{
  "url": "https://www.wikihow.com/Write-a-Warning-Letter-to-a-Tenant",
  "title": "How to Write an Effective Letter of Warning to a Tenant",
  "steps": [
    {
      "title": "Begin by re-reading the lease.",
      "content": "Begin by re-reading the lease. It may have been a while since you last read your tenants' lease, so this is the first place to begin. Be sure that the violation you are warning your tenant about is referenced in the lease itself. This way, you can reference the lease that was signed by the tenant when you write the letter."
    },
    {
      "title": "Research any relevant local, state and federal laws for your defense.",
      "content": "Research any relevant local, state and federal laws for your defense. There are different sets of laws for different communities. You need to be absolutely sure that your warning letter will be in compliance with these laws. A letter that goes against such laws can get you into legal trouble. Start your search for relevant laws at the offices of your city or town government. The offices of the mayor, city attorney, or department of housing may be useful as well. [1] X Research source If the warning pertains to a noise violation for example, you will want to look up local ordinances pertaining to a municipalities noise rules. [2] X Research source"
    },
    {
      "title": "Know what legal protection tenants may have.",
      "content": "Know what legal protection tenants may have. Just as you have to check local ordinances to see if your claims are justified, you also need to see what protection the tenant may have. For example a tenant has a right to a habitable home, service animals and to be free from harassment. [3] X Research source Check with your local government for any tenant rights that may affect your situation."
    },
    {
      "title": "Take time to make the letter look official.",
      "content": "Take time to make the letter look official. An official looking letter will add to the weight of the letters contents. This will help to convey the seriousness of the situation to your tenant(s). If the tenants understand the seriousness of the situation, the are more likely to comply without offering further resistance. [4] X Research source Include a company or personal letterhead. If you do not have a letter head create one that includes your name, address and contact information such as phone number and email. Include the date in the top left corner. Include the tenant's name and address below the date."
    },
    {
      "title": "Establish an intent for your warning letter at the top.",
      "content": "Establish an intent for your warning letter at the top. Below the date and tenant's address, in bolded and underlined font state your reason for writing the letter. This should be kept short and clear. [5] X Research source Some warning letters are written in order to get the tenant to do something, called a compliance letter. The other type of letter is a violation letter which warns tenants that they are in violation of the lease and run the risk of terminating the lease. For example a compliance heading could read: 'Compliance with our non-smoking policy' A violation letter could read: 'Notice to pay or quit'."
    },
    {
      "title": "Begin by referencing the lease and how it was violated.",
      "content": "Begin by referencing the lease and how it was violated. It is important that your letter immediately references what terms of the lease your tenant is violating. Target your letter to the matters at hand as much as possible, making it clear as to why the tenant received the letter and what the tenant needs to do about the situation. For example, you may write: 'Pursuant to a written lease dated November 2, 2015 you agreed to not smoke in common areas near your premises'"
    },
    {
      "title": "Notify your tenant how they can rectify the situation.",
      "content": "Notify your tenant how they can rectify the situation. In a warning letter, you need to tell the tenant how they can resolve the problem after informing them of the violation. The solution may be paying money or stopping a specific action. [6] X Research source For example, you may write: 'You are hereby required to stop smoking in the common areas near your premises'"
    },
    {
      "title": "Set out clear terms and consequences if the tenant continues their violation.",
      "content": "Set out clear terms and consequences if the tenant continues their violation. By establishing what will happen if a violation continues, you will lay the groundwork for any future corrective action you may have to make against the tenant. For example, write 'If you fail to correct this violation, the tenancy will be forfeited by December 1, 2015.'"
    },
    {
      "title": "Conclude the letter and follow up with the tenant.",
      "content": "Conclude the letter and follow up with the tenant. Concluding the letter with a simple 'Sincerely' followed by your signature will work in most cases. It is important that you follow up with the tenant several days after they have received the letter. You will want to be sure that the tenant understood the letter and plans to make the necessary changes to their behavior."
    },
    {
      "title": "Address issues with late or unpaid rent with a reminder or demand for payment letter.",
      "content": "Address issues with late or unpaid rent with a reminder or demand for payment letter. Late payment, and even unpaid rent, are some of the most common issues that a landlord will have to deal with. Typically, a landlord should provide a 3 to 5 day window after the rent due date before rent is considered late. So if rent is expected on the first of each month, the tenant should be allowed until the third or fifth of the month to pay. As a landlord it is vital that you inform the tenant about when rent is due and they with be considered late in their payment. [7] X Research source If your tenant is late paying their rent, you can send them a reminder letter or a demand for payment letter. These letters can be delivered in person, by mail or by email. Be sure to keep a copy of the letter. [8] X Research source A reminder letter should be generally kind in tone, reminding the tenant that they are past due in their payment. It should include an exact list of what they owe and when. The letter should conclude sternly, notifying the tenant that legal action will be taken if rent is not paid by a specific date. A demand for payment letter needs to be more threatening. It should spell out the rent that is owed, including any late fees. It also needs to inform the tenant that you will begin eviction proceedings if rent is not paid immediately. From here, you can contact an eviction lawyer to begin proceedings. Remember it is illegal to lock a tenant out or shut off utilities. It is also illegal to threaten, humiliate or physically remove the tenant."
    },
    {
      "title": "Deal with noise and disorderly conduct by documenting and recording the incidents.",
      "content": "Deal with noise and disorderly conduct by documenting and recording the incidents. Noise violations, loud parties and other disorderly conduct are a common complaint landlord have with their tenants. In some states, repeated disorderly conduct offenses can be grounds for eviction. The most important thing for a landlord to do is in these circumstances is to document the instances of disorderly conduct, noting both the time and the exact nature of the offense (loud noise, partying, etc). You can begin addressing the situation by reminding the tenant in person or by letter of the lease agreement, which should mention something about violating laws or causing disturbances. Provide the tenant another copy of the lease with the letter, highlighting the rules they have violated. If the situation continues, it is within your rights to threaten eviction in a formal letter. This letter should include the dates, times and specific incidents that took place. If you receive a complaint from a tenant about another tenant's disorderly conduct, it is you legal responsibility to discuss the problem with the noisy tenant. [9] X Research source"
    },
    {
      "title": "Correct tenants who continuously violate rules with reminders of the lease.",
      "content": "Correct tenants who continuously violate rules with reminders of the lease. While some rules set out may be trivial and violation may not endanger people or the property, others rules are meant to be taken seriously. It is the landlord's responsibility to outline the rules of the property in the lease. If any of these rules are violated, a letter should be sent immediately to the violating tenant. Again, highlight the rules that were violated and order the tenant to cease the activity or risk eviction. Consider adding the following requirements or rules to your lease; a list of all tenants, limits to occupancy, terms of the tenancy (month to month or year to year), rent amount, deposits and fees, repairs, restrictions on illegal activity and pets. [10] X Research source As a landlord you need to be proactive and be on the lookout for possible serious violations."
    }
  ]
}