{
  "url": "https://www.wikihow.com/Train-for-Parkour",
  "title": "How to Train for Parkour",
  "steps": [
    {
      "title": "Train with your own body weight.",
      "content": "Train with your own body weight. Nothing else will train you to really move and push your body through the environment than working with it from the get-go. Do the following routine 2 times each workout session. If you can't do it all, do what you can. Aim for improvement above all else. If you can do it all, consistently increase your number of reps and/or sessions bit by bit. Remember to take a day or two off every week to give your muscles time to rebuild. [1] X Research source 10 squats (building up to plyometric box jumps) 10 push-ups 10 leg lifts on your back with both legs 10 pull-ups"
    },
    {
      "title": "Run",
      "content": "Run frequently. You should run at least 7-10 miles (11-16 km) per week. Running is a big part of parkour, and you should be able to run long distances, as well as sprint fast. Other cardio exercises that are helpful to do are lacrosse, boxing and swimming. Yoga will tone up your muscles, too. [1] X Research source"
    },
    {
      "title": "Lift weights.",
      "content": "Lift weights. Strength is another important aspect of parkour. You can't just hang on the wall; you have to somehow climb over it. Work with the routine described above and combine with weight training for optimal results. Do not become obsessed with how much weight you can lift. Perfect form and endurance (number of reps) are much more important. After all, you'll be working with the weight of your body, not lifting cars."
    },
    {
      "title": "Stretch and warm-up your body properly.",
      "content": "Stretch and warm-up your body properly. Parkour can be a dangerous sport if you are not conditioned, so be sure to stretch properly beforehand. If you do not warm up before you stretch, you could lose up to 30% of your muscle's possible strength and power. What's more, make sure you stretch to prevent injury or strain. Don't miss any part of your body. Parkour may seem like it uses mostly legs, but your arms, neck, back, and shoulders are equally important. If you have an injury, you should not be stretching without a physical therapist (or doing parkour in the first place)."
    },
    {
      "title": "Eat a healthy diet.",
      "content": "Eat a healthy diet. The high-carb diet is the most efficient; a non calorie-restrictive diet will provide the highest energy levels for intense sports like parkour. Raw till 4 is the most popular high carb, low fat diet, and one of the best. Whole and unprocessed foods are best for parkour athletes (traceurs). Your main source of calories should come from fruits. That might sound crazy to a society that has been taught that fruits and veggies are just snacks, but it's true. Eat a lot of high calorie fruits, along with vegetables, and greens. Cooked carbs such as rice, potatoes, and gluten free pasta are perfect for dinner. Animal products such as eggs, fish and meats (or soy equivalents for vegetarians and vegans) are also necessary as they provide protein and other vital nutrients. Make sure to drink plenty of water--at least 64 ounces per day. Many traceurs consume at least one gallon daily. [2] X Research source Cut out the high-fat, high-sodium processed goods. A healthy weight and muscle-to-fat ratio is important for succeeding at this skill. It's much easier to lift up 180 lbs (82 kgs) of stream-lined muscle over that wall than 220 lbs (100 kgs) of not-so-streamlined fat. You'll be peeing a lot, but it'll be worth it. You will be healthier, and your body will transform into a well oiled machine! Make sure to chug water after each workout session. Parkour can be incredibly hard on your body and your body needs the hydration to stay in top form."
    },
    {
      "title": "Get a good pair of shoes (unless you want to go the barefoot route).",
      "content": "Get a good pair of shoes (unless you want to go the barefoot route). Your own success at parkour can depend a lot on what shoes you have. Consider getting ones with grip (for climbing); they should be sturdy enough to handle the motions you'll put them through, but also flexible to ensure your feet can bend properly. They should also be light enough so that they don't weigh you down. Specialist parkour sneakers are starting to appear on the market. They are designed with the grip, support and stability needed for hard impacts as well as traction for a variety of running surfaces. K-Swiss, inov-8 and Vibram Five Fingers are all popular choices. You will figure out soon enough that you destroy sneakers faster than you can buy them and that it's not worth spending big amounts of money. Buy cheap sneakers; when you destroy them, get a new pair. Grip and durability are not as important as technique, but make sure the sneakers do have some traction, as it will make climbing a bit easier. Make sure that the soles are not too thick to promote bad landing techniques and to gain more feel for the environment."
    },
    {
      "title": "Refine your jump.",
      "content": "Refine your jump. Though it may seem initially scary, start out with steps. Jumping up , not down. Find some outside or a set that are wide and open. Jump from the ground up to one step, then two, then three, etc. You should be relaxed, well-balanced with a relatively upright posture, and land softly on your toes 10 times in a row before you add another step to your jumps the next session or week. Around 5 or 6 steps should be rather difficult. Find a mid-sized rail to work on your two-handed vault. Use your hands to pull your legs up to the side. One knee should seem to go between your arms. Practice staying balanced as you land."
    },
    {
      "title": "Work on your landings.",
      "content": "Work on your landings. A great jump becomes a trip to the hospital without the proper landing. Before you extend yourself, get your landings down. Remember in this order: tuck, extend, absorb. [4] X Research source At the top of your jump, bring your knees up to your waist, feet underneath. Extend your legs to a standing position mid-air, and bring your entire body down upon landing. Place your palms in front to help balance and absorb, just in case. Try to land silently (like a ninja)."
    },
    {
      "title": "Perfect your muscle-up.",
      "content": "Perfect your muscle-up. This is a pull-up taken to the extreme and will get you over walls, fences, and high obstacles. [5] X Research source Start with a normal pull-up. Then bring the bar to your chest. After that, work on bringing your chest over the bar, adding dips as well. Eventually, bring it into one fluid motion, from underneath the bar to it resting at your pelvis. Propel your knees up and forward to give your body momentum."
    },
    {
      "title": "Be one with the shoulder roll.",
      "content": "Be one with the shoulder roll. The times you'll need the roll most are when you are surprised and off-balance. Mastering the shoulder roll could get you out of what would be a terribly sticky situation. [6] X Research source Tuck your head and hands in, relax your body, arc your arms and one shoulder forward in a hula hoop shape around your head, and roll your butt over your head. Think of it going from your shoulder diagonally to your hip. If you're a bit hesitant, start with one knee on the ground. Put your arm on the inside of your leg, holding the foot that's on the ground. This will help you keep form while doing the roll. Propel yourself forward while holding onto your foot. Once you get the basic of the roll, start from low jumps, moving progressively higher."
    },
    {
      "title": "Run up walls.",
      "content": "Run up walls. You've seen it in movies and now you're ready to do it yourself. Start with walls that are just barely out of reach; don't go climbing apartment buildings District B13 style just yet. [7] X Research source Get a good run up to a wall, kick off with your foot, and reach as high as you can, grabbing the edge of the wall. Kip at the top to pull yourself up. As you get better, use corners for two kick-offs, giving you extra height."
    },
    {
      "title": "Be as silent as possible.",
      "content": "Be as silent as possible. This is for your safety and for the safety of the objects you are running on and gallivanting over. A structure may seem sturdy and able to withstand your weight, but you won't know for sure until you're climbing on it. Tread lightly to respect yourself and your environment. Less noise generally means less impact. That's great for the concrete, yes, but the least impact possible is what's best for your knees. Listen to yourself as you move. Or you'll be able to feel it afterward."
    },
    {
      "title": "Develop your own style.",
      "content": "Develop your own style. When you start working with a teacher or other trainees, you'll notice that everyone has a different way of going about from point A to point B. None of these is incorrect. All you have to do is find what comes most naturally to you. Watch videos and observe others, but only to a point. If you're hurting yourself, definitely question your form--but if it's working for you, don't make efforts to change your habits. What comes natural to you may not come naturally to someone else."
    },
    {
      "title": "Find an academy or train with others.",
      "content": "Find an academy or train with others. Working with a professional one-on-one is a privilege that no amount of practice can equal. Working with others allows for personal exploration and critiques of your skills that may come in handy for improvement. [8] X Research source If no academy is in your area, hit up your local gyms. A professional will not only teach you everything you need to know, providing you well-rounded skills, they will also make sure you stay safe. If you do choose to train with others, keep it to a few people. If too many gather, it becomes a roadshow of boasting and showing off skills. The practice should be a collaboration, not one person demanding the others follow suit."
    },
    {
      "title": "Choose a common A and B.",
      "content": "Choose a common A and B. This is good advice whether you're working by yourself or anyone else. Always establish a starting point and an ending point. There can be innumerable ways there, but only one beginning and end. The aim is to get there as quickly as possible, not how many impressive jumps you can do or how many walls you can climb up or roll underneath. Pick a path that doesn't stand out in its simplicity or its grandeur."
    }
  ]
}