{
  "url": "https://www.wikihow.com/Upgrade-from-Free-to-Premium-on-Spotify",
  "title": "How to Upgrade from Free to Premium on Spotify",
  "steps": [
    {
      "title": "Go to Spotify.com in a web browser.",
      "content": "Go to Spotify.com in a web browser. You can upgrade your Spotify account to a Premium subscription using any web browser on your computer."
    },
    {
      "title": "Sign in to your account.",
      "content": "Sign in to your account. If you see a Log in link at the top-right corner of the page, click it now, and then follow the on-screen instructions to sign in to your account. If you don't have a Spotify account, click Sign up at the top-right corner of the page to get one now."
    },
    {
      "title": "Click the Profile menu.",
      "content": "Click the Profile menu. It’s at the top-right corner of the page."
    },
    {
      "title": "Click Account.",
      "content": "Click Account . It’s at the top of the menu. [1] X Research source"
    },
    {
      "title": "Scroll down and click Subscription.",
      "content": "Scroll down and click Subscription . It’s toward the bottom of the left column."
    },
    {
      "title": "Click TRY PREMIUM FREE or GET PREMIUM.",
      "content": "Click TRY PREMIUM FREE or GET PREMIUM . If you haven’t yet used your 30-day free trial version of Spotify, the green button near the top of the page will say TRY PREMIUM FREE . If you’ve already used your trial and have reverted to a free account, click GET PREMIUM . You’ll have to enter credit card details for your free trial. Once the trial ends, your card will be billed for $9.99 (US) for the first month of service. You will not be charged if you cancel your trial before the 30 day period ends. If you haven't used a Spotify premium plan, you’ll also see the option to click Try Premium on the ″Account overview″ screen."
    },
    {
      "title": "Select a Premium option (optional).",
      "content": "Select a Premium option (optional). The standard, most popular version of Spotify Premium is selected by default for $9.99/month (US). To select an alternative plan or option, click Change plan next to ″Your plan″ (above the form), and then choose one of the following: To share your Spotify account with up to five other people for $14.99/month (US), click GET FAMILY next to ″Premium for Family. If you’re a college student with an email address that ends with .edu, you can sign up for a discounted subscription. Click VERIFY next to ″Premium for Students\" to get started. To pay for a full year of Spotify Premium at once, click GET PREMIUM next to ″Spotify Premium Yearly.″ To make a one-time payment for a specific amount of time (instead of a recurring subscription), select a payment option from the ″One-time payment\" section."
    },
    {
      "title": "Enter your payment details.",
      "content": "Enter your payment details. Enter (or select) your credit card information and other billing information as requested. If you chose the Student membership, you’ll have to verify your student status before you can enter your payment information."
    },
    {
      "title": "Click the START MY PREMIUM button.",
      "content": "Click the START MY PREMIUM button. The text on the button varies depending on the plan you selected, but it’s a green button at the bottom of the form. Your Spotify membership will be upgraded to Premium immediately."
    }
  ]
}