{
  "url": "https://www.wikihow.com/Turn-on-Nfc-on-Android",
  "title": "How to Enable NFC on Your Android Phone: Step-by-Step Guide",
  "steps": [
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. For Samsung devices, NFC is required to use Samsung Pay and Android Beam. [1] X Research source"
    },
    {
      "title": "Navigate to Connections > NFC and contactless payments.",
      "content": "Navigate to Connections > NFC and contactless payments . If you don't see NFC and contactless payments , your phone doesn't support NFC."
    },
    {
      "title": "Tap the toggle to turn on NFC.",
      "content": "Tap the toggle to turn on NFC. Once NFC is enabled, you can tap Contactless payments to select if you want to use Google Pay or Samsung Pay (both of which require NFC). To turn off NFC, return to this menu and tap the NFC toggle again."
    },
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. NFC is required to use Google Pay on your Google Pixel. [2] X Research source"
    },
    {
      "title": "Navigate to Connected devices > Connection preferences.",
      "content": "Navigate to Connected devices > Connection preferences . If you don't see an NFC option in this menu, your phone doesn't support NFC."
    },
    {
      "title": "Tap NFC.",
      "content": "Tap NFC . Once in this menu, toggle on Use NFC . You can also tap Contactless payments > Payment default to select your preferred default contactless payment app. To turn off NFC, return to this menu and tap the NFC toggle again."
    },
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. NFC is required for contactless payments on your OnePlus, as well as file transfers and device pairing. [3] X Research source"
    },
    {
      "title": "Tap on Connection and Sharing.",
      "content": "Tap on Connection and Sharing . You may have to scroll down to find this menu option."
    },
    {
      "title": "Toggle on the NFC option.",
      "content": "Toggle on the NFC option. If you don't see the NFC option, your phone doesn't support NFC. To turn off NFC, return to this menu and tap the NFC toggle again."
    },
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. NFC is required to use contactless payments and Android Beam. [4] X Research source"
    },
    {
      "title": "Navigate to Connected devices > Connection preferences.",
      "content": "Navigate to Connected devices > Connection preferences . If you don't see an NFC option in this menu, your phone doesn't support NFC."
    },
    {
      "title": "Tap the NFC option to toggle it on.",
      "content": "Tap the NFC option to toggle it on. You can also now tap Android Beam to turn it on from this menu. To turn off NFC, return to this menu and tap the NFC toggle again."
    },
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. NFC is required for contactless payments with Alipay, WeChat, or other payment apps. [5] X Research source Huawei phones do not currently run on Android but instead use Huawei's proprietary HarmonyOS, which is a fork of Android."
    },
    {
      "title": "Navigate to More connections > NFC.",
      "content": "Navigate to More connections > NFC . If you don't see the NFC option, your phone doesn't support NFC."
    },
    {
      "title": "Toggle NFC on.",
      "content": "Toggle NFC on. Alternatively, you can enable NFC by swiping down from the status bar until you see your shortcut switches, then tapping NFC to enable it. To turn off NFC, return to your Settings menu and tap NFC again. You can also swipe down and tap the NFC shortcut switch again to toggle it off."
    }
  ]
}