{
  "url": "https://www.wikihow.com/What-Does-Se-Mean-in-Shoes",
  "title": "What Does “SE” Stand for in Sneakers?",
  "steps": [
    {
      "title": "“SE” stands for “Special Edition.”",
      "content": "“SE” stands for “Special Edition.” A shoe or sneaker labeled “SE” is especially rare and hard to come by. Special Edition footwear is unique and only released in small quantities. Typically, these shoes reflect a certain style, trend, event, or celebrity and are only available for a limited amount of time. [1] X Research source For example, these shoes below are popular SE sneakers: LeBron 14 Chase Down (2017) Air Jordan 4 What The (2019) NMD_R1 Japan Pack (2017) UltraBoost 4.0 Triple White (2017) CLOT x Nike 1World Air Force 1 (2009)"
    },
    {
      "title": "Timing",
      "content": "Timing Special Edition shoes are only available to purchase within a specific window. Companies typically release these shoes to celebrate a specific event, holiday, or person. Because of this, they can only be purchased for a set amount of time. [2] X Research source"
    },
    {
      "title": "Rarity",
      "content": "Rarity Special Edition shoes aren’t restocked. There’s a limited quantity of these shoes, and once production stops and the shoe sells out, that’s it. This can make it harder to find and purchase the shoes later."
    },
    {
      "title": "Price",
      "content": "Price Special Editions tend to be more expensive than shoes that are always on the market. The uniqueness and rarity of the SE shoe hike up the price, and the value can continue to increase for years to come. For example, if you wish to sell SE sneakers, the selling price will be much higher than the purchasing price if you sell 5 years after the release."
    },
    {
      "title": "Collaborations",
      "content": "Collaborations More often than not, Special Editions are released in collaboration with a well-known celebrity, athlete, or brand. This makes the demand for the shoes even higher amongst fans."
    },
    {
      "title": "Style and packaging",
      "content": "Style and packaging Special Edition shoes have a unique look to them. They come in different styles and colors than other shoes within the brand or model, and they likely have themed packaging that’s unique to the shoes (such as a newly designed box, case, or carrier). [3] X Research source"
    },
    {
      "title": "",
      "content": "“SE” isn’t the only acronym used in the shoe world. Check out these common abbreviations you may find on your next shoebox: [4] X Research source GR = General Release LE = Limited Edition PE = Player Edition DS = Deadstock BNIB = Brand New in Box TTS = True to Size EQT = Equipment V/VX = Version RNR = Runner SPLY = Supply"
    },
    {
      "title": "What’s the difference between a limited and special edition shoe?",
      "content": "What’s the difference between a limited and special edition shoe? Limited Edition (LE) shoes aren’t as rare as Special Edition (SE) shoes. While LE and SE footwear are available for a limited amount of time and have unique features, SE is generally more exclusive. There are fewer SE shoes produced than LE shoes, meaning that SE shoes are harder to come by once they’re sold out. [5] X Research source"
    },
    {
      "title": "Is it difficult to get SE shoes?",
      "content": "Is it difficult to get SE shoes? It depends on the shoe. Newly released SE shoes are usually easy to find online through the company or a reseller. However, vintage SE shoes that were released years ago may be harder to track down secondhand, and they’ll likely cost you a pretty penny."
    },
    {
      "title": "What does SE stand for in shoe size?",
      "content": "What does SE stand for in shoe size? “SE” stands for “Special Edition,” not shoe size. Even so, SE shoes are most commonly medium-width (labeled as M or D) but can also be narrow (N) or wide (W)."
    }
  ]
}