{
  "url": "https://www.wikihow.com/Squeaking-Noise-While-Driving-but-Not-Brakes-Applied",
  "title": "How to Identify the Cause of Squeaking When Driving but Not Stopping",
  "steps": [
    {
      "title": "Wear indicators on your brakes",
      "content": "Wear indicators on your brakes Most modern brake pads will intentionally make noise when it’s time to change them out. At the tip of the brake pad, there is a small “squealer” that will begin to make annoying noises when you’re close to the end of the brake pad’s life. Once you hear noise while you’re driving or actively braking, your brakes are telling you to change them ASAP. Some “squealers” will kick on when you aren’t breaking, while others will start making noise whenever you even gently touch the brake pedal. Location of the squeaking sound : Your wheels, although the sound may be so high-pitched it’s hard to pinpoint at first. Other symptoms : None. Your brakes should work like normal. The squeaking is just a sign your pads are nearing the end. The fix : Replace your brake pads . Ideally, see a professional for this to avoid making any potentially catastrophic mistakes."
    },
    {
      "title": "Debris in your wheel well",
      "content": "Debris in your wheel well Your wheel well refers to the interior space between your tire and the vehicle. If there’s a branch, stick, pebble, or even trash stuck somewhere inside of the well, it can cause all kinds of squeaking, rattling, or whistling noises when you drive. These noises may cool off when you slow down as the friction is reduced. Location of the squeaking sound : One of your wheels. It may even feel like the sound is emanating from underneath the vehicle. Other symptoms : You may notice the nature of the sound changing as the debris rattles around. You’ll also probably hear the sound only coming from one wheel. The fix : With your vehicle cold, get down on the ground and shine a flashlight in the wheel well. Look between the brake caliper and the disc, too. Remove any trash or debris you find to solve the problem."
    },
    {
      "title": "Stuck brake calipers",
      "content": "Stuck brake calipers The calipers are the assemblies that hold the brake pads in place. When you press the brake pedal, the caliper pushes the brake pad against the rotor to slow the vehicle down. If a caliper is stuck though, you’ll hear a high-pitched squealing noise as the rotor and brake pad fight against one another. [1] X Research source Location of the squeaking sound : One wheel. It will be noticeably loud and obnoxious. Other symptoms : You should see smoke the longer you drive, and you’ll likely smell a burning odor coming from the brake pad. If the caliper is pushing hard on the rotor, you might notice the vehicle pulling to one side as you drive. The fix : If it’s cold or the brake assemblies are old, you might have a locked-up piston or brake hose that needs to be repaired. In any case, see a mechanic to have the calipers repaired. Worst case scenario, the caliper needs to be replaced ."
    },
    {
      "title": "Worn-out suspension components",
      "content": "Worn-out suspension components Your suspension refers to the system of shocks, springs, and absorbers between your tires and the body of your vehicle. Its core job is to absorb the bumps and valleys when you drive so that you’re comfortable in the driver’s seat. If any of those springs or absorbers are damaged, you may hear squeaking as the suspension struggles to absorb vibrations. [2] X Research source Location of the squeaking sound : Underneath the vehicle. It’ll probably sound like a general area is especially noisy. Other symptoms : Your vehicle may ride rougher than it normally does. You may also hear a creaking sound when you’re at stop lights as your vehicle settles, too. The fix : Your suspension is kind of complicated, so see a professional mechanic to have them inspect and repair your suspension."
    },
    {
      "title": "Power-steering pump failure",
      "content": "Power-steering pump failure Power steering is what makes it possible to lightly turn your wheel with ease despite the fact that you’re moving thousands of pounds of metal. This is made possible by power steering fluid, which creates a hydraulic (or electric) system that connects to your steering column. If the pump keeping your fluid pressurized fails, you may hear squeaking noises as you steer. [3] X Research source It’s possible your power steering fluid is low due to a leak. If you don’t fix this soon, the pump will die. Location of the squeaking sound : Inside of your engine bay or just behind your dashboard, depending on the pump’s location. Other symptoms : The squeaking gets worse when you turn the wheel, you find it harder to corner, and you hear groaning or swooshing noises when you idle. The fix : See a mechanic to have the power steering pump replaced."
    },
    {
      "title": "Rusty or dry steering column",
      "content": "Rusty or dry steering column The steering column connects your wheel to the rest of the steering system. It’s basically a large shaft with a joint at the end. If that joint has been exposed to moisture it may start to rust. Alternatively, the lubrication on that joint may dissipate from overuse. Either issue may cause squeaking that goes away when the vehicle slows down. [4] X Research source Location of the squeaking sound : In your engine bay. It may even sound like the noise is coming from just behind the steering wheel. Other symptoms : If your steering column is to blame, it’ll be noticeably difficult to steer or turn the wheel. The fix : Messing with your steering system can be dangerous, so see a mechanic to have your steering column re-lubricated or replaced."
    },
    {
      "title": "Bad CV joint",
      "content": "Bad CV joint Each tire has two CV joints. These are the bearing assemblies that connect the wheels to the axle so that the transmission can distribute power to the wheels. If one or more of those CV joints are damaged, you may hear squeaking as you drive. [5] X Research source Location of the squeaking sound : Typically, just inside of the wheel well, underneath the vehicle. Other symptoms : You may hear clicking alongside that squeaking noise. You’ll also feel vibrations in your steering wheel, and all of these symptoms will get worse the faster you go. The fix : See a transmission specialist or mechanic to have the CV joints inspected and potentially repaired."
    },
    {
      "title": "If you can brake like normal, you’re fine to drive.",
      "content": "If you can brake like normal, you’re fine to drive. So long as your brakes are working correctly and you can control the vehicle, you’re good to drive. The noise is a sign that something is wrong—and you should get it fixed soon—but it’s unlikely you’re doing any serious damage or putting your safety at risk by driving in the short term. Don’t ignore this, but save yourself some money by skipping the tow truck. [6] X Research source The exception here is if you’ve got trouble steering, which can happen if your power-steering pump or steering column is damaged. Don’t drive on the highway and get to the mechanic sooner than later if this is the issue."
    }
  ]
}