{
  "url": "https://www.wikihow.com/This-Is-She-or-This-Is-Her",
  "title": "This Is She or This Is Her? Learn the Correct Grammar & Usage Rules",
  "steps": [
    {
      "title": "Use either “This is she” or “This is her” depending on what you prefer.",
      "content": "Use either “This is she” or “This is her” depending on what you prefer. English grammar rules used to say that using \"This is she\" with subject pronouns was correct. By the early 20th century, grammar rules started to say that using the object pronoun in “This is her,” “This is him,” and “It is me” are also fine, especially when used informally. [1] X Research source Today, “This is she,” “It is I,” and other predicate nominatives are considered to be super formal and may not be used as frequently. [2] X Research source Informal: “Hi, is this Sydney?” “Yes, this is her.” Formal: “Hi, is this Sarah?” “Yes, this is she.”"
    },
    {
      "title": "“This is she” is grammatically correct because it follows the predicate nominative.",
      "content": "“This is she” is grammatically correct because it follows the predicate nominative. The verb “to be” is a linking verb that joins together the subject and object. Both “she” and “this” are subject pronouns, so the two words are interchangeable (called the predicate nominative). Since you would typically say “She is this,” you can also say “This is she.” [3] X Research source This rule gets broken all the time, and both “This is she” and “This is her” are now considered acceptable. The form you choose depends on how formal you’d like to be. [4] X Research source “Hi, is this Theresa? Isabella assigned the job to you.” “Yes, this is she.” “Were you the one who set up a meeting with the president?” “It is I.” “Hello, I’m from First Line Bank. Is this Josh?” “This is he.” “Is this Emma and Lara?” “Yes, this is we.”"
    },
    {
      "title": "“This is her” is acceptable to use, but is considered less formal.",
      "content": "“This is her” is acceptable to use, but is considered less formal. Since “her” is an object pronoun, it can’t be swapped with the subject pronoun “this,” which was why “This is her” was grammatically incorrect. However, in most informal contexts, object pronouns like “her,” “him,” and “us” are not only acceptable but sound more natural. [5] X Research source By the early part of the 20th century, grammarians (grammar experts) said that “This is her” and “It is me” were fine to use, especially in informal situations. [6] X Research source “Hi, is this Mary?” “Yes, this is her.” “Are you the person who stole my shoes?” “Yeah, that’s me.”"
    },
    {
      "title": "Alternatively, use “that’s me,” answer with your name, or say “yes.”",
      "content": "Alternatively, use “that’s me,” answer with your name, or say “yes.” If you’re not comfortable using “This is she” or “This is her,” there are tons of other ways you can answer the phone when someone asks if they have the right person. You can use “that’s me,” say “Yes, this is [your name],” or just respond with a simple “yes.” [7] X Research source “Hi, is this Molly?” “Yep, that’s me!” “Are you the one who ordered the pizza?” “Yeah, that’s me.” “Is this Joseph and Beth?” “Yes, that’s us.” “Hey, is this Jacob?” “Speaking.” “Hey! Are you Rachel?” “Yeah, I’m Rachel.” “This is Joe from the tire shop next door. Are you Drew?” “This is Drew, I’m glad you called!” “Hi, are you Alan from the office?” “Yes! How can I help you?”"
    }
  ]
}