{
  "url": "https://www.wikihow.com/Use-Boosters-in-Candy-Crush",
  "title": "How to Use Boosters in Candy Crush",
  "steps": [
    {
      "title": "Know a Striped Candy.",
      "content": "Know a Striped Candy. A Striped Candy is a special candy that results from matching four candies in a row. When you use a striped candy as part of a match, it will clear out a whole row or column from the board. The direction is dependent on what direction the stripes are on the candy. Vertical Striped candies are useful for Ingredient Levels since they can clear out a whole column of candies and allow the ingredient to fully drop to the bottom. Striped candies are also useful in removing jellies and chocolate, when placed in the right position."
    },
    {
      "title": "Know a Wrapped candy.",
      "content": "Know a Wrapped candy. A Wrapped candy is a special candy that results from matching at least three vertical and three horizontal candies forming a plus, T-shape, or corner-shape. This one is more challenging and difficult to get compared to a striped candy. When you use a Wrapped candy as part of a match, it will first explode and knock out the nine candies surrounding it, and then it will drop and explode again, knocking out another nine candies the same way. Wrapped candies can be useful in removing obstacles within their explosion area, which can otherwise be difficult to get to."
    },
    {
      "title": "Know a Candy Bomb.",
      "content": "Know a Candy Bomb. A Candy Bomb is a special candy that results from matching five candies in a row. It can be difficult to get, but not impossible. You just have to work on getting the right candies in place to swap with to form the five-in-a-row. Color bombs do not need to be matched to be used. You can just swap it with another candy, and all similar candies would be removed from the board. By itself, it doesn’t sound like achieving much, but when combined with another special candy, it will give you more awesome results."
    },
    {
      "title": "Know a Jellyfish.",
      "content": "Know a Jellyfish. A Jellyfish is a special candy that cannot be generated by any move. It either is provided within the game or equipped pre-game. It’s only available for Jelly levels. When used, a Jellyfish summons three more Jellyfish and they eat three jelly squares at random. Jellyfish can be useful in removing jellies from hard to reach areas, though they move in random."
    },
    {
      "title": "Know a Coconut Wheel.",
      "content": "Know a Coconut Wheel. A Coconut Wheel is a special candy that cannot be generated within a game by any candy combination. It either is provided within the game or equipped pre-game. It’s only available for Ingredients levels. When used, the Coconut Wheel will roll over the next three candies in one direction, converting them to Striped candies and then triggering them. It can be useful in clearing out whole columns for ingredients to drop."
    },
    {
      "title": "Know a Striped and Wrapped.",
      "content": "Know a Striped and Wrapped. A Striped and Wrapped booster can only be equipped pre-game. Once equipped, you will start your board with one Striped Candy and one Wrapped Candy at random positions. This can be useful if you want special candies on the board when you start."
    },
    {
      "title": "Know a Lucky Candy.",
      "content": "Know a Lucky Candy. A Lucky Candy is a booster that can be equipped pre-game or made available on certain levels. When used as part of a match or a combination, it will transform into another special candy. The candy it will transform to cannot be determined as it happens in random. Since it’s a lucky candy, the special candy it will transform to is something you may need for that level."
    },
    {
      "title": "Know a Lollipop Hammer.",
      "content": "Know a Lollipop Hammer. A Lollipop Hammer is a booster that can be equipped within a game. It’s not a candy that appears on the board. It’s a tool that you can equip for destroying one square of candy, jelly, or some other blocker."
    },
    {
      "title": "Know Extra Moves.",
      "content": "Know Extra Moves. Extra Moves provide you with five extra moves when activated within a game."
    },
    {
      "title": "Know Free Switch.",
      "content": "Know Free Switch. Free Switch enables you to switch two side-by-side items on the board, without using a move. The candies don’t need to match for you to switch them."
    },
    {
      "title": "Know Extra Time.",
      "content": "Know Extra Time. Extra Time gives you 15 extra seconds of play time. It can be equipped pre-game, and it only works for Timed levels."
    },
    {
      "title": "Know Sweet Teeth.",
      "content": "Know Sweet Teeth. Sweet Teeth can be activated within a game. Once called, it will eat several candies, licorice, chocolate, meringue, and marmalade."
    },
    {
      "title": "Know Bomb Cooler.",
      "content": "Know Bomb Cooler. Bomb Cooler adds five moves to the timers of the bombs on the board. It can only be activated on levels with bombs."
    },
    {
      "title": "Know Bubblegum Troll.",
      "content": "Know Bubblegum Troll. The Bubblegum Troll can be activated within a game. Once called, it will remove all chocolate and block all chocolate fountains for five moves. Jump ahead to learn how to get boosters , use boosters , and combine boosters ."
    },
    {
      "title": "Get free boosters.",
      "content": "Get free boosters. Candy Crush gives you a free booster daily through its Daily Booster Wheel. This can be accessed from the game’s main screen, right below the number of lives. Play the Daily Booster Wheel every day, and get your free boosters. The prizes you can get from turning this wheel are: a Lucky Candy, a Coconut Wheel, a Free Switch, a Lollipop Hammer, a Candy Bomb, a Jellyfish, and a Striped and Wrapped. If you’re very lucky, you can hit the Jackpot, which contains three of each of the rewards."
    },
    {
      "title": "Buy boosters before a game.",
      "content": "Buy boosters before a game. If you’d like to use some boosters and equip them before the game, you can buy them. On the pre-game screen, click or tap the boosters you’d like to use. The price will be displayed. Click or tap the price button, and you will be directed to the in-app purchase function. Be sure you have your credit card handy. Input your payment details when prompted. Prices vary per booster."
    },
    {
      "title": "Buy boosters within a game.",
      "content": "Buy boosters within a game. If you’d like to use some boosters within the game, you can buy them. On the game screen’s upper-left corner, all available boosters for the level is displayed. Click or tap the boosters you’d like to use. The price will be displayed. Click or tap the price button, and you will be directed to the in-app purchase function. Be sure you have your credit card handy. Input your payment details when prompted. Prices vary per booster."
    },
    {
      "title": "Using a single booster.",
      "content": "Using a single booster. Different boosters work differently. Using single boosters independently is very straightforward. Refer to Part 1 to know more about the different boosters and how they can be used in your game."
    },
    {
      "title": "Combine basic boosters.",
      "content": "Combine basic boosters. To make the most out of your boosters, you can mix and match them to come up with awesome results. Boosters can be combined when they are side-by-side. All pre-game boosters and generated special candies can be combined. To learn more about combining basic boosters, see Part 4."
    },
    {
      "title": "Combine other boosters.",
      "content": "Combine other boosters. The boosters mentioned in Step 2 are the more common boosters and special candies available. They can be used in almost all levels of the game. The Coconut Wheel and the Jellyfish are the other boosters, but they are only available in certain levels. Coconut Wheels are only available on Ingredients levels, and Jellyfish are only available on Jelly levels. When they are available, they can also be mixed and matched with any of the other boosters from Step 2. Put them side by side and see the awesome results you can achieve."
    },
    {
      "title": "Combine two Striped Candies.",
      "content": "Combine two Striped Candies. When you get two Striped Candies, regardless of colors and stripe directions, side by side, you can clear out a column and a row in one move, originating from where the combination was made. Imagine multiplying the effects of a Striped Candy by two."
    },
    {
      "title": "Combine a Striped Candy and a Wrapped Candy.",
      "content": "Combine a Striped Candy and a Wrapped Candy. When you get a Striped Candy and a Wrapped Candy side by side, you can achieve the same thing as combining two Striped Candies, but with damage thrice as big. It will clear out three rows and three columns in one move, originating from where the combination was made."
    },
    {
      "title": "Combine a Striped Candy and a Candy Bomb.",
      "content": "Combine a Striped Candy and a Candy Bomb. When you get a Striped Candy and a Color Bomb side by side, you can convert all candies similar in color to the striped candy to striped candies with random stripes. The Color Bomb would then explode, and all the striped candies generated would burst out clearing several columns and rows at once. Depending on your level, this can be a game-changer. You can generate more candies that are striped by having some more candies of the same color drop before using the combo."
    },
    {
      "title": "Combine two Wrapped Candies.",
      "content": "Combine two Wrapped Candies. When you get two Wrapped candies side by side, you can get massive explosions, much bigger than individual Wrapped Candies exploding. Similar to a single Wrapped candy, the explosions would happen twice. Using this combo may not be as useful in achieving your level’s targets, but it is fun to do and generates bigger points. It can also be used to significantly clear out some blockers like jellies, licorice, and chocolate."
    },
    {
      "title": "Combine a Wrapped Candy and a Candy Bomb.",
      "content": "Combine a Wrapped Candy and a Candy Bomb. When you get a Wrapped candy and a Candy Bomb side by side, you can get an effect similar to two Candy Bombs, with the second explosion targeting a random color. If a Candy Bomb by itself doesn’t do much good for your level, making this combo won’t do any good too. This is one of the least useful combos in the game. You’re better off using them separately or combining them with other special candies."
    },
    {
      "title": "Combine two Candy Bombs.",
      "content": "Combine two Candy Bombs. When you get two Candy Bombs side by side, you can wipe your board clean of candies. It’s basically a refresh of your board with new candies. This combo is very hard to get, but it’s extremely useful and fun to use."
    }
  ]
}