{
  "url": "https://www.wikihow.com/Terraria-How-to-Teleport",
  "title": "11 Ways to Teleport in Terraria + Expert Crafting & Usage Tips",
  "steps": [
    {
      "title": "Teleporters can transport players, NPCs, and enemies instantaneously.",
      "content": "Teleporters can transport players, NPCs, and enemies instantaneously. The Teleporter used to be purchased from the Steampunker, but as of version 1.4.4 you can purchase it from the Mechanic for 2 gold and 50 silver coins. [1] X Research source The Mechanic is found after killing Skeletron, and you can find her in the Cavern layer or below in the Dungeon. Teleporting via a Teleporter is instantaneous, has no Mana cost, no coin cost, or limit on distance. You must wire two teleporters together to use them. You can wire two teleporters with Wire, and you can use trigger mechanisms such as a Switch or Pressure Plate. Once the trigger is activated, all players, NPCs, and most enemies touching the 3x3-tile area above the Teleporter are teleported. Teleporters can be wired with different colored Wires to the same teleporters to create complex teleportation systems, such as one central teleporter that can teleport you to many different destinations. Teleporting via a Teleporter is two-way. If you activate a Teleporter trigger and something is on the other Teleporter (such as an enemy), it will be transferred to the Teleporter you're on. As Teleporters can teleport players, NPCs, and enemies standing up to 3 tiles above the Teleporter, you're able to bury Teleporters two tiles deep and they will still work. Teleporters will not teleport worms, bosses, critters, liquids, dropped items, projectiles, enemies from the Old One's Army event, furniture, or enemies that travel through rocks."
    },
    {
      "title": "Recall Potions will return you to your spawn point.",
      "content": "Recall Potions will return you to your spawn point. If you've placed a Bed and interacted with it, this will be your spawn point—otherwise you'll return to the world's initial spawn point. The Recall Potion functions similarly to a Magic Mirror or Ice Mirror, but has a faster use time. [2] X Research source Recall Potions can be crafted with Bottled Water, Specular Fish, and Deathweed or Daybloom depending on the version you're playing. You can craft these potions in a Placed Bottle or Alchemy Table. Specular Fish are found by fishing in the Forest, Jungle, or Snow biomes in the Underground Cavern and Underworld layers. [3] X Research source You'll need Deathweed (found Corruption or Crimson biomes) for the old-gen console version, Windows phone version, and Nintendo 3DS version. You'll need Daybloom (found growing on Grass) for all the other versions. Recall Potions can also be found in underground pots and chests, and has a 1/14 chance of being dropped as a bonus drop when defeating Slimes."
    },
    {
      "title": "Teleportation Potions will teleport you to a random location.",
      "content": "Teleportation Potions will teleport you to a random location. If there are parts of the map that you haven't explored as much, using a Teleportation Potion will likely teleport you to unmapped areas. [4] X Research source Teleportation Potions are not recommended for trying to return to your base, since you can get teleported to very remote areas. Teleportation Potions can be crafted with Bottled Water, Chaos Fish, and Fireblossom in a Placed Bottle or Alchemy Table. Chaos Fish can only be found in Hardmode by fishing in the Underground Hallow. [5] X Research source Fireblossom grows in Ash Blocks in the Underworld. [6] X Research source You can also find Teleportation Potions in Caverns layer chests. When using a Teleportation Potion, you will always be placed on top of a solid block and never inside blocks. You'll also never be placed in front of a below-surface Dungeon wall until Skeletron has been defeated, and you'll never be placed in front of a below-surface Lihzahrd Brick Wall until Plantera has been defeated. When using a Teleportation Potion, you won't be placed somewhere where you can take damage from environmental hazards such as Thorny Bushes, Silt Blocks, Slush Blocks, Sand Blocks, Spikes, Wooden Spikes, Meteorite, Hellstone, Hellstone Bricks, Lava, or Cactus Plants."
    },
    {
      "title": "Wormhole Potions will teleport you to another player's location in multiplayer.",
      "content": "Wormhole Potions will teleport you to another player's location in multiplayer. After drinking the Wormhole Potion, you can select another member of your team on the full-screen map to be teleported to them. [7] X Research source You can craft Wormhole Potions in both multiplayer and singleplayer, but Wormhole Potions will only drop as loot in multiplayer. Wormhole Potions can be crafted with Bottled Water, Specular Fish, and Blinkroot at a Placed Bottle or Alchemy Table. Blinkroot is found in Dirt or Mud Blocks, and is most commonly found in the Underground layer. [8] X Research source Specular Fish are found in the Forest, Jungle, or Snow biomes in the Underground Cavern and Underworld layers. [9] X Research source You can also get Wormhole Potions from Pots, and there is a 1/14 chance you'll get one as a bonus drop for defeating a Slime."
    },
    {
      "title": "Magic Mirrors teleport you back to your spawn point, but are very slow to use.",
      "content": "Magic Mirrors teleport you back to your spawn point, but are very slow to use. They have the same function as the Recall Potion, but one advantage is that the Magic Mirror can be used over and over again while Recall Potions are one-time-use items. [10] X Research source You can craft a Magic Mirror with Diamonds, Gold or Platinum Bars, and Glass in a Furnace. Diamonds are found in the Underground and Cavern layers by breaking blocks with light-blue gemstones embedded in them. Gold and Platinum Bars are made with Gold Ore or Platinum Ore respectively, as you may have one or the other in your world. Magic Mirrors can also be found in gold chests in the Underground and Cavern layers. If you start a Journey Mode character, you will get a Magic Mirror for free upon character creation. Magic Mirrors are one of the ingredients used to craft Cell Phones. Ice Mirrors are a variant of Magic Mirrors. They work in exactly the same manner, but you cannot craft one. You can find them, however, in Frozen Chests in the Ice biome."
    },
    {
      "title": "Pylons are teleporters for specific biomes.",
      "content": "Pylons are teleporters for specific biomes. Pylons can be purchased from NPCs that live in the various biomes. There are 8 Pylons available, and they can only be placed in their corresponding biome: Forest, Snow, Desert, Cavern, Ocean, Jungle, Hallow, and Mushroom. [11] X Research source However, obtaining and using Pylons is a bit more involved than some other teleportation methods: To purchase the Pylon, the vendor NPC must be happy and there must be another NPC near them. This means you will need to rearrange your NPCs in a specific way so each Pylon can be purchased. There are multiple combinations to do this, but below is one potential combination: Forest Pylon: Zoologist and Golfer Snow Pylon: Mechanic and Goblin Tinkerer Desert Pylon: Dye Trader and Arms Dealer Cavern Pylon: Tavernkeep and Demolitionist Ocean Pylon: Pirate and Angler Jungle Pylon: Dryad and Painter and Witch Doctor Hallow Pylon: Wizard and Party Girl Mushroom Pylon: Truffle and Guide Once the NPC is happy, the Pylon will be in their sale inventory unless they don't have any room in their inventory. To place a Pylon, you must place it in its corresponding biome and there must be at least 2 NPCs within a 169x124-tile area centered on the Pylon. The NPCs must be housed and alive, but they do not need to be happy for the Pylon to work."
    },
    {
      "title": "The Rod of Discord can teleport you short distances in Hardmode.",
      "content": "The Rod of Discord can teleport you short distances in Hardmode. The Rod of Discord can only be obtained in Hardmode and has a 1/500 chance of being dropped by Chaos Elementals upon defeat. [12] X Research source The Rod of Chaos costs no mana to use, but after using it you'll have the Chaos State debuff for 6 seconds. If you use the Rod of Discord while you have this debuff will cause you to lose health equivalent to 1/7 of your maximum health."
    },
    {
      "title": "The Portal Gun can teleport players and NPCs, but not enemies.",
      "content": "The Portal Gun can teleport players and NPCs, but not enemies. The Portal Gun is only available in Hardmode and is obtained from defeating the Moon Lord. Click the Use/Attack button to fire one portal, and the Interact button to fire the other. The two portals fired by the Portal Gun are linked. If you touch one portal, you will be instantly transported to the other one. You don't lose your momentum when you use the portals, and your fall speed increases as well. You can purchase a Portal Gun Station from the Cyborg if you have the Portal Gun in your inventory. This is a furniture item that can fire portals similar to the Portal Gun. Interact with the top of the station to change portal colors, the left or right side to change direction, and the base to fire a portal."
    },
    {
      "title": "The Cell Phone combines the effects of the PDA with the Magic Mirror.",
      "content": "The Cell Phone combines the effects of the PDA with the Magic Mirror. Using a Cell Phone can send you back to your spawn point just like the Magic Mirror (or Ice Mirror), but you can also view all of the information that is provided by the PDA. [13] X Research source You can only make the Cell Phone after you've defeated Skeletron. Besides teleportation, you can use the Cell Phone to view fishing power, weather, moon phase, time, movement speed, and more. To craft a Cell Phone, you must combine a PDA with a Magic Mirror or Ice Mirror at the Tinkerer's Workshop."
    },
    {
      "title": "The Magic Conch will teleport you to the farthest ocean.",
      "content": "The Magic Conch will teleport you to the farthest ocean. This item can be used an unlimited amount of times, similar to the Magic Mirror, but it will only teleport you to the Ocean biome that is furthest away from your current location. [14] X Research source Magic Conches can be found in Sandstone Chests, Oasis Crates, and Mirage Crates. You need a Magic Conch to make the Shellphone, which combines all of the functions of the Cell Phone with those of the Magic Conch and the Demon Conch. [15] X Research source"
    },
    {
      "title": "The Demon Conch will teleport you to the center of the Underworld.",
      "content": "The Demon Conch will teleport you to the center of the Underworld. This item can be used an unlimited amount of times, similar to the Magic Mirror, but it will only teleport you to Underworld [16] X Research source Magic Conches can be found by fishing in lava. You need a Demon Conch to make the Shellphone, which combines all of the functions of the Cell Phone with those of the Magic Conch and the Demon Conch."
    },
    {
      "title": "The Potion of Return teleports you to your spawn point, but also creates a portal.",
      "content": "The Potion of Return teleports you to your spawn point, but also creates a portal. This portal will take you back to the location you used the Potion of Return, so you can easily move back to where you'd left off in case you just needed to return to your base for any reason. [17] X Research source Once the portal is used, it will disappear. It will also disappear if you exit the game before using the portal. The Potion of Return can be crafted by combining a Recall Potion and an Obsidifish in a Placed Bottle or at an Alchemy Table. Obsidifish can be caught by fishing in lava. You can also find Potions of Return in Shadow Chests and Pots in the Underworld."
    }
  ]
}