{
  "url": "https://www.wikihow.com/Use-a-Prepaid-Credit-Card",
  "title": "How to Use a Prepaid Credit Card",
  "steps": [
    {
      "title": "Check your balance before using your card.",
      "content": "Check your balance before using your card. A prepaid credit card has to be funded with money you load onto it. Before purchasing anything, you should be sure you know your balance because you can get hit with big fees for making a purchase without enough money on your card. This is particularly important if you have not used your card for a long time, as many cards have monthly maintenance fees ranging from $1 to $9.95 that will slowly eat away at your balance. [1] X Research source Many cards charge a fee for checking your balance at out of network ATMs, so be sure to use the correct ATM. Others charge a fee at all ATMs, so you will want to check your balance by phone (with an automated system, not a live representative, as that also comes with a fee), by text, by app, or online. [2] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source"
    },
    {
      "title": "Buy goods and services as you would with a credit card.",
      "content": "Buy goods and services as you would with a credit card. When shopping, a prepaid card works just like a credit card. You can buy things at stores, shop online, or pay bills, so long as you don’t exceed the amount you have loaded onto your card. [3] X Research source Prepaid cards have one major advantage in that they are not linked to your private data like your Social Security Number, so unlike with a normal credit card, hackers cannot use them to steal your identity. [4] X Research source"
    },
    {
      "title": "Pay in the store when buying gas with your prepaid card.",
      "content": "Pay in the store when buying gas with your prepaid card. If you pay at the pump, most cards will apply a hold to your card of up to $100. This hold might not clear for several days, temporarily reducing the amount you have available to spend on your card. To pay the exact amount instead, you will need to go inside to pay the attendant. [5] X Research source"
    },
    {
      "title": "Withdraw money from an ATM.",
      "content": "Withdraw money from an ATM. Prepaid cards work just like debit cards for withdrawing money. You will be sent a Personal Identification Number (PIN) by the card issuer for this purpose. If you don’t have a PIN, you can call the number on the card to request one. Be aware that many cards will charge a fee of up to $2.50, on top of the one charged by the bank where you withdraw the money. [6] X Research source"
    },
    {
      "title": "Pay with checks.",
      "content": "Pay with checks. Some cards will allow you to pay your creditors by issuing a paper or electronic check for you. [7] X Research source"
    },
    {
      "title": "Check your balance before using your card.",
      "content": "Check your balance before using your card. A prepaid credit card has to be funded with money you load onto it. Before purchasing anything, you should be sure you know your balance because you can get hit with big fees for making a purchase without enough money on your card."
    },
    {
      "title": "Rent a car with a prepaid card.",
      "content": "Rent a car with a prepaid card. While it is easier to rent with a regular credit card or debit card, there are companies such as Enterprise that accept prepaid credit cards when renting cars. Be aware though that you will usually have a more limited choice in cars unless you purchase insurance, as agencies are reluctant to rent more expensive models to people without credit cards. Most companies will allow you to pay for your car upon return with a prepaid card, after initially checking it out with a regular credit card. There are a few additional steps you may have to take to rent with a prepaid card: Rent Early – Companies that allow prepaid cars often require you to reserve 4-6 weeks in advance. In most instances, you cannot rent at the counter with a prepaid card. Contact the Local Office – Even companies that often accept prepaid cards, like Enterprise, require you to contact the local office to discuss the details of payment without a standard credit card. Security Deposit – You can expect to pay a deposit of $100-$500, in addition to the cost of rental, in order to cover any incidentals or additional costs you may incur. Credit Check – Some companies will require a credit check before allowing you to pay with a prepaid card. The credit check is to help them to evaluate the level of risk in renting to you – i.e. if you regularly fail to pay bills, they will be less likely to rent you a car. Additional Information – The rental agency may require additional documents for renters using prepaid cards, including paycheck stubs, proof of insurance, current utility bills, and personal references. No One Way Rental – One-way rentals are usually not allowed if renting with a prepaid card. If renting at an airport, most companies will only accept a prepaid card if you can show evidence of a return flight from that same airport."
    },
    {
      "title": "Check into a hotel.",
      "content": "Check into a hotel. With most hotels, you can pre-book a hotel room online with your pre-paid card. Most hotels will also require a deposit to cover the cost of your room and any possible extra charges. This deposit is typically done as a pre-authorization on your credit card. Some hotels allow prepaid cards for checkin. For others, you will need to leave a deposit equivalent to several nights’ stay at the hotel. This deposit can be charged on your prepaid card. [8] X Research source"
    },
    {
      "title": "Buy airline tickets.",
      "content": "Buy airline tickets. You can use your prepaid credit card to purchase airline tickets, just as you would a normal credit card. Unlike hotels or rental cars, there are no incidental charges associated with airline tickets, so a line of credit is not needed when purchasing them. Many airlines will require you to purchase your ticket at least 6 days before departure if using a prepaid card."
    },
    {
      "title": "Reserve a spot on a cruise.",
      "content": "Reserve a spot on a cruise. Most major cruise lines accept prepaid cards as payment for the cruise ticket. While onboard, most lines use a cashless system, wherein all onboard purchases are charged to your boarding pass. If using a prepaid card to settle these purchases: [9] X Research source You will need to provide a deposit, usually around $500. Your daily expenditures will be limited, usually to somewhere between $300-$500 per day. You will need to settle any outstanding charges on you account before disembarking at the end of the cruise. Be sure to check with the cruise line to determine the rules regarding onboard purchases before booking."
    },
    {
      "title": "Direct deposit your paycheck to your card.",
      "content": "Direct deposit your paycheck to your card. Prepaid cards come with account and routing numbers, so you can have your paycheck sent directly to your card, just as you would with a bank account. This is the most effective way to add money to your card. The money will show up on your card the same day, and most prepaid cards do not charge a fee for direct deposits. [10] X Research source Some even offer lower monthly fees and other advantages for cardholders who direct deposit above a certain amount every month."
    },
    {
      "title": "Transfer money from your bank account.",
      "content": "Transfer money from your bank account. If you have a bank account, you can usually transfer money to your prepaid card online, via phone, or in person at the bank. Your bank may charge for the transaction, but the prepaid card issuer generally does not."
    },
    {
      "title": "Use PayPal to add money to your card.",
      "content": "Use PayPal to add money to your card. With most prepaid cards, adding money via PayPal is free, and the money will show up in your account in 2-3 business days. Here’s how: Sign up with PayPal. You’ll need to enter your email address, home address, and phone number. Use the account and routing number associated with your card to set it up as a bank account on PayPal. Click “Transfer to your bank” to transfer money to your card."
    },
    {
      "title": "Add money at a retail store.",
      "content": "Add money at a retail store. Prepaid cards can be reloaded at many gas stations, pharmacies, grocery stores, as well as at most check cashing agents and MoneyGram and Western Union agents. In most cases, the cashier will be able to add the money directly to your card. Check with your card issuer for a list of locations where you can use a check or cash to reload your card. [11] X Research source"
    },
    {
      "title": "Purchase a MoneyPak.",
      "content": "Purchase a MoneyPak. With many prepaid cards, you can buy a MoneyPak at retailers with which to add funds to your card. The MoneyPak is a card with a cash value on it and a code number that you use to transfer that value to your prepaid card. In general, the amount you pay for the MoneyPak will be the amount added to your account, though there are sometimes fees involved. After purchasing the MoneyPak, access your prepaid card account online or by phone and use the MoneyPak code to add the money to your card. [12] X Research source"
    },
    {
      "title": "Reload at an ATM.",
      "content": "Reload at an ATM. Prepaid cards issued by banks will often let you add money to the cards at ATMs of the bank, though some will only allow it at particular ATM locations. Reloading at ATMs is usually not possible with cards issued by credit card companies like Visa or American Express, or by major retailers like Walmart. Check the terms of a card before you purchase it to see if reloading at ATMs is possible."
    },
    {
      "title": "Know the fee structure of your card.",
      "content": "Know the fee structure of your card. It’s important to know what fees are associated with your card in order to use it in a way that keeps costs down. If you don’t, you can pay tens, or even hundreds of dollars a month in fees. You can check here for a break down of fees on some of the most common cards, but be sure to also contact your issuer for an exact list."
    },
    {
      "title": "Check if your card is pay-as-you go or has a monthly fee.",
      "content": "Check if your card is pay-as-you go or has a monthly fee. If your card charges you per transaction, you’ll want to use it only in emergencies. Most cards charge a monthly fee instead. Check with your issuer to see if you can avoid this fee in one of these ways: [13] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source By making a certain number of purchases a month. By using direct deposit to add money to your account. By loading a certain amount of money each month."
    },
    {
      "title": "Reload as infrequently as possible if your issuer charges for adding money to your card.",
      "content": "Reload as infrequently as possible if your issuer charges for adding money to your card. If this is the case with your card, you’ll want to try to load large amounts at infrequent intervals in order to keep the fees down. Be aware, though, that some cards have limits as to how much you can add at once. Try to avoid cards that both charge for adding money and have low limits on how much you can add. [14] X Research source"
    },
    {
      "title": "Make sure to only withdraw money at network ATMs or use the cash back feature at stores.",
      "content": "Make sure to only withdraw money at network ATMs or use the cash back feature at stores. Check here to see the fees charged by the most common cards for ATM withdrawals. To avoid them, you’ll usually need to use an ATM within the issuer’s network. Check with your issuer to see which ATMs are free. Cash back – At many retailers – particularly gas stations, pharmacies, and supermarkets – you can ask for cash back when making a purchase. This cash will be included in the purchase price and will thus come without any fees."
    },
    {
      "title": "Report a lost card immediately.",
      "content": "Report a lost card immediately. The amount on your card is insured up to $250,000. If you notify your issuer immediately, they will usually restore your original balance and issue a new card. The faster you act, the less trouble you will have, as whoever now has your card will have less time to rack up charges. [15] X Research source"
    }
  ]
}