{
  "url": "https://www.wikihow.com/Start-an-Amusement-Park",
  "title": "How to Start an Amusement Park",
  "steps": [
    {
      "title": "Pick the type of amusement park you will open.",
      "content": "Pick the type of amusement park you will open. You will need to do market research to determine the size of the market and the competitors in your area. If there is already a well-established park in the area, it will be easier to break into the market if your park offers a substantially different experience, whether in terms of rides or theme. The two major types of park are water parks and thrill-based parks involving roller-coasters and other types of rides. There are seven major types of theme, though many parks combine several of them: Adventure – Thrill rides, mystery, action. Futurism – Discovery, exploration, science, robotics, science fiction. International – Flavors of the world, areas with national themes. Nature – Animals, gardens, natural wonders. Fantasy – Cartoon characters, magic, myths and legends. History and Culture – Historical ambiance, areas with period themes. Movies – Rides based on films, stunt shows, behind the scenes."
    },
    {
      "title": "Decide between franchising or starting a new park.",
      "content": "Decide between franchising or starting a new park. Though starting your own park will allow you more control over the attractions offered and the style of the park, it also entails greater risk. Starting a franchise will give you more support and a proven brand that will aid in raising capital. For a first time business owner, it is a safer option. [1] X Research source"
    },
    {
      "title": "Hire an experienced group to perform a feasibility study.",
      "content": "Hire an experienced group to perform a feasibility study . Amusement parks require a lot of capital to start, and there is no sense in wasting time and effort if there is no market for your park. A feasibility study will take into account potential sites, your park concept, the local market and tourist market, and industry trends and local competition in order to estimate costs, revenues, and how many first-year guests you can expect. This last number is hugely important, as the number of first-year guests expected will determine the amount you need to spend to build a park that can accommodate them. Estimate too low, and your park will be overcrowded. Estimate too high, and your park will fail due to inability to recoup construction costs. [2] X Research source"
    },
    {
      "title": "Write a business plan.",
      "content": "Write a business plan . To attract investors and efficiently run your business, you will need to develop a strategic plan, which you will base on the analysis performed in the feasibility study. You can find more details about how to write a plan here, but broadly, you will want to include: Your business concept: what sort of park you are creating, your strengths and weaknesses, long term goals, and performance indicators, beyond the bottom line, which will let you know you are succeeding or failing. Market research: the nature of the amusement park industry, the size of the market and how much of it you must capture to show a profit, who are your customers, who are your local competitors, how will you advertise your park. A marketing plan: how you will communicate with customers and grow your customer base. An operations plan: identify the individual projects that will lead to completing your larger goals. To begin with, these might include steps to build the park like finding a favorable location, deciding the type of park to build, and hiring an architect, or steps to run the park like hiring experienced managers, deciding on the number of staff needed and their pay, placing ads, and hiring staff. Financial projections: the first thing potential investors will look at, they include: start-up costs such as purchasing land, construction and equipment; operating costs including staff, insurance, utilities, and supplies; marketing costs; and revenue projections from ticket sales, concession sales, games, gift shops, and other sources. Project costs and revenues for at least the first five years. You can find a sample business plans for an amusement park here ."
    },
    {
      "title": "Hire an experienced firm to design your amusement park.",
      "content": "Hire an experienced firm to design your amusement park. Before going to potential investors, you will need an attractive mock-up of your park that both features the attractions and takes into account zoning, safety, and traffic flow. [3] X Research source Designing a theme park requires a variety of specialized skills from drawing to understanding ride engineering and safety to managing traffic flow. To make a convincing presentation to potential investors, it is best to hire a firm that has a successful track record in park design."
    },
    {
      "title": "Create a scripted pitch for investors.",
      "content": "Create a scripted pitch for investors. Your pitch should be designed to quickly capture potential investors’ attention, impress them with the thoroughness of your financials, and show them how they will make money. Be sure to include: [4] X Research source A one minute “elevator pitch” – This pitch should be practiced until you have it down cold. It tells a story that explains the opportunity in the marketplace and how you intend to exploit it, and should make investors want to know more. You will use it both at chance meetings – cocktail parties, elevators – and to start off formal pitches. A compelling PowerPoint presentation – The key here is to keep it short and simple. A good presentation should take less than 15 minutes, meaning 12 to 15 slides that summarize the content of your business plan. An exit strategy – Make sure your PowerPoint presentation discusses how investments will be monetized, whether that means paying dividends, recapitalizing (borrowing money to buy out investors), going public, or selling to another operator. [5] X Research source"
    },
    {
      "title": "Pitch your park to potential investors.",
      "content": "Pitch your park to potential investors. Amusement parks are expensive. The average cost of construction per expected first-year guest is $109.61, meaning that if you hope to attract a million guests in year one, you will need to raise approximately $109,610,000. [6] X Research source Approach banks, venture capitalists, and angel investors (wealthy individuals). In addition to your business plan and design, you will need to write an investor proposal letter . Send it out very judiciously, usually after you have already attracted some investment. [7] X Research source Amusement parks can be a tough sell. To improve your odds, start with people who have invested in amusement parks or entertainment in the past. [8] X Research source Investors receive hundreds of unsolicited proposals, most of which never go read. Your best bet is to use connections who can recommend you to potential investors. [9] X Research source"
    },
    {
      "title": "Build your team.",
      "content": "Build your team. You will need architects, landscapers, a construction firm experienced with installing amusement park rides, and experienced project managers to guide the project to completion. There are specialized companies who will oversee all aspects of building, or you can take that role on yourself and pick your contractors."
    },
    {
      "title": "Choose a location.",
      "content": "Choose a location. You will need to have vetted two or three potential locations before approaching investors. Now is the time to pick one, based on availability, cost, and the factors unearthed in your feasibility study: Ease of access for local residence and tourists. Climate. Surrounding neighborhood and businesses. Potential for expansion. Zoning rules for the proposed site and the surrounding area."
    },
    {
      "title": "Finalize the park’s design.",
      "content": "Finalize the park’s design. The schematic designs used to attract investors must now be fleshed out in detail, including engineering studies for all of the rides and attractions. Clearly document how each aspect of the park will be constructed."
    },
    {
      "title": "Acquire the necessary permits and licenses.",
      "content": "Acquire the necessary permits and licenses. You will need a business license to begin construction, as well as local construction permits. In addition, there are a variety of other licenses you will need before the park opens, as well as regulations you will want to adhere to: You will likely need state and or local food/alcohol service licenses, public entertainment licenses, amusement park licenses, and more. All states except for Alabama, Mississippi, Wyoming, Utah, Nevada, and South Dakota regulate amusement parks, so you will need to be sure your park conforms to their regulations. You will also want to make sure your park conforms to the standards of the ASTM International F-24 Committee on Amusement Ride and Devices."
    },
    {
      "title": "Put the elements of your project out for bidding and create a schedule for completion.",
      "content": "Put the elements of your project out for bidding and create a schedule for completion. You or the company you have hired to oversee construction will want to competitively bid the various aspects of construction in order to reduce costs as much as possible. Once you have chosen your builders, negotiate contracts and a schedule for completion. Plan to open your park at the beginning of summer to maximize initial attendance. [10] X Research source"
    },
    {
      "title": "Construct your amusement park.",
      "content": "Construct your amusement park. Here is where your dream starts to become a reality. The builders you have contracted will construct buildings, ride, and show sites, and then install ride systems and show components. All attractions will be tested to assure they work properly. [11] X Research source"
    },
    {
      "title": "Purchase insurance.",
      "content": "Purchase insurance. There are a variety of firms that offer specialized property and liability insurance for amusement parks. Bid your park to get the best coverage at the lowest price."
    },
    {
      "title": "Pick a marketing firm to help advertise the park.",
      "content": "Pick a marketing firm to help advertise the park. Even before construction nears completion, you will want to hire a firm to help you begin advertising your new park through billboards and targeted television, radio, newspaper, and online ads. Also consider offering opening day and first-year pass discounts to boost initial attendance and create more word-of-mouth buzz."
    },
    {
      "title": "Hire and train personnel to run the park.",
      "content": "Hire and train personnel to run the park. After you determine the number of staff, their positions and pay, one of your project managers should be placed in charge of staffing the park. As the park nears completion, you will begin training staff for the rides, concessions, ticket sales, games, etc. Rehearsals will also start for any shows or entertainment features at the park. [12] X Research source"
    },
    {
      "title": "Start with a soft opening.",
      "content": "Start with a soft opening. Invite members of the public to try out the park before it officially opens. This will give your staff a chance to practice with real customers and allow you to work out any operational kinks. You may want to plan a week or more of trial days to help perfect the functioning of your park. [13] X Research source"
    },
    {
      "title": "Open your amusement park.",
      "content": "Open your amusement park. After all your hard work, your amusement park is finally open! Invite the media, government officials, celebrities, important investors, and friends to the official ribbon cutting. Be sure to schedule special events in the park to commemorate the day. You want your first visitors to be wowed so they promote the park to your friends."
    }
  ]
}