{
  "url": "https://www.wikihow.com/T%E2%80%90Streak-(Microbiology)",
  "title": "How to T‐Streak (Microbiology)",
  "steps": [
    {
      "title": "Flip to the back of a sterile petri dish containing agar.",
      "content": "Flip to the back of a sterile petri dish containing agar. Draw a line starting slightly above the center point. Continue drawing the line until you hit the back plate's edge."
    },
    {
      "title": "Draw another line starting from the left side of the back plate until you hit the other side.",
      "content": "Draw another line starting from the left side of the back plate until you hit the other side. This new line should be perpendicular to the original line, intersecting it at the starting point. The back plate of the petri dish should now be divided into three sectors, appearing as a large “T”."
    },
    {
      "title": "Label the back plate of the petri dish with relevant laboratory information such as your initials, date, time and culture source.",
      "content": "Label the back plate of the petri dish with relevant laboratory information such as your initials, date, time and culture source."
    },
    {
      "title": "Begin by connecting the Bunsen burner to a fuel source and igniting it.",
      "content": "Begin by connecting the Bunsen burner to a fuel source and igniting it."
    },
    {
      "title": "Insert the loop into the flame at a vertical angle.",
      "content": "Insert the loop into the flame at a vertical angle. The object is to have the inoculation loop be slightly above the inner blue cone of the flame. Hold it there for several seconds."
    },
    {
      "title": "Remove the loop from the flame.",
      "content": "Remove the loop from the flame. At this point, the loop is sterile and extremely hot. The inoculation loop must be cooled, or else the residual heat will kill any bacteria taken from the culture."
    },
    {
      "title": "Cool the inoculating loop.",
      "content": "Cool the inoculating loop. Lift the lid of the petri dish just enough to insert the loop. Touch the outer edge of the nutrient agar. A sizzling sound should be heard upon first contact. Continue holding the inoculation loop against the surface for several seconds."
    },
    {
      "title": "Remove the inoculation loop from the petri dish.",
      "content": "Remove the inoculation loop from the petri dish. Avoid touching any other surface at this point, doing so will recontaminate the inoculation loop."
    },
    {
      "title": "Hold the sterile inoculation loop.",
      "content": "Hold the sterile inoculation loop. Open the source of your culture such as broth culture."
    },
    {
      "title": "Insert the loop into the culture, swirling the contents to insure even distribution of bacteria within.",
      "content": "Insert the loop into the culture, swirling the contents to insure even distribution of bacteria within. Do this for several seconds."
    },
    {
      "title": "Remove the loop and recover the original sample.",
      "content": "Remove the loop and recover the original sample."
    },
    {
      "title": "Select a colony or section of the sample.",
      "content": "Select a colony or section of the sample."
    },
    {
      "title": "Remove the cover from the agar plate and scrape up the selected specimen with the inoculation loop.",
      "content": "Remove the cover from the agar plate and scrape up the selected specimen with the inoculation loop."
    },
    {
      "title": "Place the cover of the plate back on.",
      "content": "Place the cover of the plate back on."
    },
    {
      "title": "Lift the lid of the petri dish just enough to insert the loop.",
      "content": "Lift the lid of the petri dish just enough to insert the loop. Beginning in the top sector of the “T’, lightly drag the inoculation loop across the surface of the nutrient agar in a zigzag pattern. It is important to stay within the region in which you are currently inoculating."
    },
    {
      "title": "Re-sterilize the inoculation loop now that the first sector of the “T” has been inoculated.",
      "content": "Re-sterilize the inoculation loop now that the first sector of the “T” has been inoculated. Follow the method described in Sterilizing the Inoculation Loop . Remember to cool the inoculating loop on the edge of the nutrient agar that has not been contaminated with the original culture!"
    },
    {
      "title": "Rotate the petri dish 90 degrees and lift the lid just enough to insert the loop.",
      "content": "Rotate the petri dish 90 degrees and lift the lid just enough to insert the loop."
    },
    {
      "title": "Start in the first sector.",
      "content": "Start in the first sector. Lightly drag the inoculation loop across nutrient agar toward the second sector."
    },
    {
      "title": "Continue into the second sector.",
      "content": "Continue into the second sector. Lightly drag the inoculation loop across the nutrient agar in a zigzag pattern."
    },
    {
      "title": "Re-sterilize the inoculation loop now that the second sector of the “T” has been inoculated.",
      "content": "Re-sterilize the inoculation loop now that the second sector of the “T” has been inoculated. Follow the method described in Sterilizing the Inoculation Loop . Remember to cool the inoculating loop on the edge of the nutrient agar that has not been contaminated with the original culture!"
    },
    {
      "title": "Rotate the petri dish 90 degrees and lift the lid just enough to insert the loop.",
      "content": "Rotate the petri dish 90 degrees and lift the lid just enough to insert the loop."
    },
    {
      "title": "Start in the second sector.",
      "content": "Start in the second sector. Lightly drag the inoculation loop across the nutrient agar towards the third sector."
    },
    {
      "title": "Continue into the third sector.",
      "content": "Continue into the third sector. Lightly drag the inoculation loop across the nutrient agar in a zigzag pattern."
    }
  ]
}