{
  "url": "https://www.wikihow.com/Speed-up-Torrents",
  "title": "How to Speed up Torrents",
  "steps": [
    {
      "title": "Select torrents with enough seeds.",
      "content": "Select torrents with enough seeds. Torrents with fewer \"seeds\" (uploaders) than \"leeches\" (downloaders) will take significantly longer to download than in the inverse. [1] X Expert Source Luigi Oppido Computer & Tech Specialist Expert Interview. 19 February 2020. If a torrent has few to no seeds, you won't be able to download the whole torrent."
    },
    {
      "title": "Close background services and programs when downloading.",
      "content": "Close background services and programs when downloading. Running any programs—especially those which take up large amounts of bandwidth, such as streaming services—while attempting to download torrents will invariably slow down your download rates. [2] X Research source"
    },
    {
      "title": "Try downloading one torrent at a time.",
      "content": "Try downloading one torrent at a time. In the event that you're running into issues with torrent speed while downloading multiple torrents, try pausing all but one. This will allocate the bandwidth that the other two torrents were using to the one that isn't paused. [3] X Research source You can pause a torrent by right-clicking it and clicking Pause ."
    },
    {
      "title": "Prioritize a specific torrent.",
      "content": "Prioritize a specific torrent. If you're downloading more than one torrent, you can set its priority to \"High\" in order to cause it to download faster than the other torrents in your queue: Right-click a torrent. Hover your mouse over Bandwidth Allocation . Click High"
    },
    {
      "title": "Avoid downloading other files when downloading a torrent.",
      "content": "Avoid downloading other files when downloading a torrent. Again, running streaming programs and file-sharing programs other than your torrent client will prevent your torrents from downloading in a timely fashion. If you share an Internet connection with one or more people, try to download your torrent when you know that they aren't downloading or streaming."
    },
    {
      "title": "Download during periods of low activity.",
      "content": "Download during periods of low activity. This goes for both inside of your house and in general: try to download late at night or early in the morning during a period where you know that anyone else on your Internet connection isn't also downloading or streaming."
    },
    {
      "title": "Connect your computer to your router via Ethernet.",
      "content": "Connect your computer to your router via Ethernet . Using an Ethernet cable to connect your computer to your router will ensure that there aren't any hiccups in your download speed. If this isn't an option for you, bring your computer as close to your router (or vice versa) as possible."
    },
    {
      "title": "Use a VPN",
      "content": "Use a VPN when downloading torrents. If your ISP is throttling your Internet speed because they don't approve of you downloading torrents, using a VPN will help you circumvent the restrictions. [4] X Research source Keep in mind that torrenting illegal files can result in your IP address being blacklisted (among other criminal charges)."
    },
    {
      "title": "Open uTorrent or BitTorrent.",
      "content": "Open uTorrent or BitTorrent. These are the two most popular torrent clients. If you don't have uTorrent, you can download and install it from https://www.utorrent.com/ If you don't have BitTorrent, you can download and install it from https://www.bittorrent.com/ ."
    },
    {
      "title": "Click Options.",
      "content": "Click Options . It's in the upper-left side of the window. A drop-down menu will appear."
    },
    {
      "title": "Click Preferences.",
      "content": "Click Preferences . This option is at the top of the drop-down menu. Doing so opens the Preferences window."
    },
    {
      "title": "Prevent torrent standby.",
      "content": "Prevent torrent standby. This will ensure that your computer doesn't enter Standby mode if you're actively downloading torrents: Click the General tab. Check the \"Prevent standby if there are active torrents\" box. Click Apply"
    },
    {
      "title": "Enable UPnP.",
      "content": "Enable UPnP. UPnP is a connection type which allows your torrent access to the correct port(s) in your router: [5] X Research source Click the Connection tab. Check the \"Enable UPnP port mapping\" box. Click Apply"
    },
    {
      "title": "Optimize the upload and download capacities.",
      "content": "Optimize the upload and download capacities. This will ensure that you aren't spending too much bandwidth on uploading while allowing you to download an unlimited amount: Click the Bandwidth tab. Find the \"Maximum upload rate\" heading near the top of the window. Type 500 into the text box to the right of the \"Maximum upload rate\" heading. Make sure that the \"Global Rate Limit Options\" text box has \"0\" in it. Click Apply"
    },
    {
      "title": "Change the number of possible connections.",
      "content": "Change the number of possible connections. This will help keep your torrenting profile in good standing with the community while maximizing your download speeds: Set your \"Global maximum connections\" text field to 150. Set the \"Maximum connections per torrent\" text field to 100. Set the \"Upload slots per torrent\" text field to 3-5."
    },
    {
      "title": "Change the number of maximum ongoing downloads.",
      "content": "Change the number of maximum ongoing downloads. To do so: Click the Queueing tab. Increase the number in the \"Maximum number of active downloads\" text box. Click Apply"
    },
    {
      "title": "Click OK.",
      "content": "Click OK . It's at the bottom of the window. Your settings will be saved; from now on, your downloaded torrents will use your optimized settings. You may have to close and re-open uTorrent or BitTorrent before the settings will be implemented fully. [6] X Expert Source Luigi Oppido Computer & Tech Specialist Expert Interview. 19 February 2020."
    }
  ]
}