{
  "url": "https://www.wikihow.com/Use-the-YouTube-Miniplayer",
  "title": "A Complete Guide to Using the YouTube Miniplayer",
  "steps": [
    {
      "title": "Go to https://www.youtube.com in a web browser.",
      "content": "Go to https://www.youtube.com in a web browser. You can use any web browser on your computer to use YouTube's Miniplayer."
    },
    {
      "title": "Click the video you want to play.",
      "content": "Click the video you want to play. This opens the video on its own page. It should begin to play immediately, depending on your settings."
    },
    {
      "title": "Hover the mouse cursor over the video.",
      "content": "Hover the mouse cursor over the video. This displays the video controls at the bottom of the video. You can also pause the video to bring up the controls."
    },
    {
      "title": "Click the Miniplayer icon.",
      "content": "Click the Miniplayer icon. It's the square with a smaller square inside, directly to the right of the gear icon. This opens a smaller version of the video at the bottom-right corner of the YouTube website. It will start playing from the place it left off on its regular page. Hover the mouse cursor over the Miniplayer at any time to bring up the controls, including options to pause and close the player. It's not possible to move or resize the Miniplayer—it'll remain at the bottom-right corner of YouTube while you browse."
    },
    {
      "title": "Browse YouTube's website.",
      "content": "Browse YouTube's website. Now that you've activated the Miniplayer, you can check out other content on YouTube without stopping or pausing the video. If you click another video on YouTube, it will replace the video that you had open in in the same Miniplayer window. [1] X Research source You can't have two different YouTube videos open in Miniplayers at the same time. If, while browsing, you find a video you want to watch after you're finished with the one that's playing now, hover the mouse cursor over it, click the three vertical dots that appear, and then click Add to queue . Click the \"Next\" or \"Forward\" icon on the currently-playing Miniplayer video to skip to the next video. This icon looks like a sideways triangle pointing at a narrow vertical line."
    },
    {
      "title": "Close the Miniplayer to return to regular viewing.",
      "content": "Close the Miniplayer to return to regular viewing. To return the video to its original page and size, click the square with an up-pointing arrow at the Miniplayer's top-left corner. Or, if you just want to close the Miniplayer, click the X at its top-right corner."
    }
  ]
}