{
  "url": "https://www.wikihow.com/Wash-Spinach",
  "title": "How to Clean Spinach (Plus, How to Dry and Store It)",
  "steps": [
    {
      "title": "Wash your hands",
      "content": "Wash your hands for 20 seconds. If you don’t wash your hands before cleaning the spinach, you might get the leaves even dirtier. Just spend at least 20 seconds washing your hands with soap and warm water. This also helps prevent the spread of diseases and other bacteria. [1] X Trustworthy Source EatRight.org Organization associated with the Academy of Nutrition and Dietetics providing advice about food, health, and fitness Go to source Dry your hands thoroughly after washing them, especially when handling a knife or other cutting tool to remove blemishes on the spinach."
    },
    {
      "title": "Discard rotten leaves and cut off any damaged spots.",
      "content": "Discard rotten leaves and cut off any damaged spots. Inspect your bunch of spinach for any damage. If you see any brown, wet, or moldy leaves, throw them away. Then, use a knife to cut off parts of the leaves that have holes, black spots, or other damage; these might be areas where aphids or other bugs chewed through the spinach. [2] X Trustworthy Source EatRight.org Organization associated with the Academy of Nutrition and Dietetics providing advice about food, health, and fitness Go to source Compost the damaged leaves , or throw them away in your trash can."
    },
    {
      "title": "Remove the spinach leaves from the stems, if desired.",
      "content": "Remove the spinach leaves from the stems, if desired. If you don’t like the texture of the stems or need the spinach to be stemless for a recipe, simply grasp each leaf at its base, or just above the top of the stem. Then, tear the leaf from the stem. Or, use a knife to cut the stem from the leaf. [3] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source To remove the entire stem, fold each side of the leaf down along the stem. Then, quickly pull down on the leaf halves to rip the leaf from the stem."
    },
    {
      "title": "Soak the spinach in a bowl of cool water for 5 minutes, 1 to 2 times.",
      "content": "Soak the spinach in a bowl of cool water for 5 minutes, 1 to 2 times. Fill a large bowl with cool water and place the leaves inside. Then, rub the leaves and stir them around to remove any dirt and debris. Let the leaves soak for 2 to 5 minutes and then remove the leaves before draining the water. If you still see dirt on the spinach, soak it in cool water again. [4] X Research source Rinsing spinach with cool water is effective at eliminating pesticide residue, germs, and dirt. For extra cleansing power , soak the spinach in ½ cup (118 ml) of white vinegar for every 1 cup (237 ml) of cool water. This can remove slightly more bacteria than water alone. Do not use soap or produce washes to clean spinach, as these aren’t more effective than water and can leave behind a harmful residue. [5] X Trustworthy Source National Pesticide Information Center Organization run by Oregon State University providing objective, science-based information about pests and pesticides Go to source Warm or hot water can cause the spinach to wilt."
    },
    {
      "title": "Rinse the spinach under cool, running water as a quick alternative.",
      "content": "Rinse the spinach under cool, running water as a quick alternative. If you have a lot of spinach to wash, place it inside a colander or salad spinner. Turn on your facet to a cool, thin stream of water and run it over the leaves. While the water is running, use your hands to gently rub each leaf to remove any pesticide residue, dirt, and bacteria. [6] X Research source For an extra cleaning boost , rinse the spinach under running water after soaking it in a bowl of water or a vinegar and water solution."
    },
    {
      "title": "Pat the spinach leaves dry with a dish towel or paper towel.",
      "content": "Pat the spinach leaves dry with a dish towel or paper towel. Spread your spinach onto a clean dish towel or paper towel. Then, grab another clean dish towel or paper towel to gently blot off the excess water on each leaf. [7] X Trustworthy Source EatRight.org Organization associated with the Academy of Nutrition and Dietetics providing advice about food, health, and fitness Go to source Removing excess moisture on your spinach prevents the leaves from growing soggy or developing mold, which helps them stay fresh for longer."
    },
    {
      "title": "Dry the spinach with a salad spinner for a fast option.",
      "content": "Dry the spinach with a salad spinner for a fast option. The quickest way to remove excess moisture on your spinach is to use a salad spinner . Just place your spinach inside, twist on the top, and spin the leaves through several rotations until the water is gone from the spinach. [8] X Trustworthy Source EatRight.org Organization associated with the Academy of Nutrition and Dietetics providing advice about food, health, and fitness Go to source You can also use a salad spinner to wash spinach. The spinning motion can remove dirt and bacteria on the leaves. Clean and dry your salad spinner thoroughly after using it to dry the spinach. Just wash each piece of the salad spinner with dish soap and warm water."
    },
    {
      "title": "Avoid air-drying spinach.",
      "content": "Avoid air-drying spinach. Letting spinach sit out and air dry allows excess moisture to stay on the leaves for a longer period of time. The moisture can encourage bacteria and other microorganisms to grow and spread. Plus, damp leaves are prone to rotting or growing moldy quickly. [9] X Trustworthy Source EatRight.org Organization associated with the Academy of Nutrition and Dietetics providing advice about food, health, and fitness Go to source Always dry spinach well before using it in your cooking or storing it in your refrigerator."
    },
    {
      "title": "Wrap spinach in paper towels and store it for up to 10 days in the fridge.",
      "content": "Wrap spinach in paper towels and store it for up to 10 days in the fridge. To keep washed, leftover spinach fresh, bundle the leaves in paper towels and seal them in an airtight glass or plastic container. [10] X Research source Set the container in your refrigerator’s crisper drawer, where your spinach will stay well for 7 to 10 days. [11] X Research source The paper towel helps absorb excess moisture and keep your spinach from spoiling quickly. If the paper towel feels wet to the touch, replace it with a fresh towel. Remove any wilty, wet, or moldy leaves when you see them."
    },
    {
      "title": "Wash spinach right before you plan to use it.",
      "content": "Wash spinach right before you plan to use it. When making a salad, smoothie, or other dish, only wash and dry the amount of spinach you need. Then, store the rest of the unwashed greens back in your fridge. Dry, unwashed spinach typically keeps longer in your refrigerator than washed spinach. Plus, moisture on the leaves can encourage bacteria growth and speed up leaf decay. [12] X Research source"
    },
    {
      "title": "Freeze spinach and store it in the freezer for 8 to 12 months.",
      "content": "Freeze spinach and store it in the freezer for 8 to 12 months. If you can’t use all of your greens at once, blanch the spinach by submerging it in a boiling pot of water for 2 minutes. Then, soak the leaves in a bowl of ice water for 2 minutes. Squeeze the spinach to remove excess water and then place the leaves in a plastic freezer bag. [13] X Research source Blanching and freezing spinach keeps it fresh for longer and helps preserve its nutrients. [14] X Research source"
    }
  ]
}