{
  "url": "https://www.wikihow.com/What-Does-Dead-Dove-Mean",
  "title": "What Does Dead Dove Mean?",
  "steps": [
    {
      "title": "Dead Dove (DD) is used to tag fanworks that contain dark themes.",
      "content": "Dead Dove (DD) is used to tag fanworks that contain dark themes. In the world of fanfiction, authors use an online “tagging” system to categorize their fictional work (or “fic”) and give an overview of the themes/topics it’ll discuss. The “Dead Dove” or “Dead Dove: Do Not Eat” tag indicates that a specific fic will contain dark/problematic themes, and urges potential readers to review the fic’s tags rather than reading the work blindly. [1] X Research source DD can cover a wide variety of taboo themes, including (but not limited to) extreme violence, non-consensual intimacy, intimacy between family members, and so on."
    },
    {
      "title": "The term “Dead Dove” comes from an episode of Arrested Development.",
      "content": "The term “Dead Dove” comes from an episode of Arrested Development . In season 1’s second episode of Arrested Development , protagonist Michael finds a paper bag labeled “Dead Dove: Do Not Eat!” in his refrigerator. Upon opening the bag, Michael finds that there is, in fact, a dead bird inside the bag, to which he says “I don’t know what I expected.” [2] X Research source In a fanfiction context, authors use this tag to prevent readers from feeling uncomfortable about the content in their fic. If prospective readers go through the tags and still choose to read the fic, they’ll be repeating Michael’s same mistake."
    },
    {
      "title": "“Dead Dove” as a fanfiction tag was first introduced in 2015 on Tumblr.",
      "content": "“Dead Dove” as a fanfiction tag was first introduced in 2015 on Tumblr. In a post, user mostly valid advocated for the use of a “Dead Dove” tag used to clue readers into when problematic themes could be found in a fic. Since then, thousands of authors have included the “Dead Dove: Do Not Eat” tag on their fanworks, primarily on AO3 (a global platform used for posting fanfiction). [3] X Research source People had used the phrase “Dead Dove” before this point (according to Urban Dictionary), but this Tumblr post really kickstarted its use within the fanfiction community. In some circles, “Dead Dove” has become a derogatory term for people who create content with problematic themes."
    },
    {
      "title": "Use the DD tag in addition to other tags when uploading a fanwork.",
      "content": "Use the DD tag in addition to other tags when uploading a fanwork. The DD tag is a reminder to readers that what they see is what they get—in other words, what they read in the tags is what they can expect to find in the work. Readers should review the fic’s tags and their themes independently and draw their own conclusions on whether or not they’d enjoy the work. Let’s say you’re writing a Marvel fanfiction that has extremely violent and gory scenes/themes. After choosing the most relevant tags for your content related to the violent themes, you’d also attach the “Dead Dove: Do Not Eat” tag as a reminder for the reader to look over the tags."
    },
    {
      "title": "Some authors only use the “Dead Dove” tag to vaguely flag dark content.",
      "content": "Some authors only use the “Dead Dove” tag to vaguely flag dark content. Within the fanfiction community, authors have disagreed on the proper way to use the term. While many writers believe that the DD tag needs to be used in conjunction with tags that further outline the fic’s themes, some writers solely use the DD tag as a warning. [4] X Research source It’s always best to use specific tags in addition to the DD tag when categorizing your own fanworks. The DD tag alone doesn’t clue prospective readers into the potentially triggering themes your work contains, so it’s courteous to include additional tags that provide that valuable context."
    }
  ]
}