{
  "url": "https://www.wikihow.com/Talk-to-Your-Crush-Even-Though-You-Are-Shy",
  "title": "How to Talk to Your Crush Even Though You Are Shy",
  "steps": [
    {
      "title": "Practice saying hello to people.",
      "content": "Practice saying hello to people. The more you practice, the easier and more familiar the process of introducing yourself gets. Build this skill by complimenting or saying hello to at least one person a day. Greet classmates and make conversation with the people who sit near you in class. Once you feel more confident, try saying hello to your crush. [1] X Research source Take baby steps. Start with a simple \"hello.\" Once you feel more confident, ask people how they are doing. Eventually, you'll gain enough courage to talk to your crush! You don't have to say \"hello.\" You can use another greeting that comes more naturally to you, such as \"hi!\" or \"hey!\""
    },
    {
      "title": "Think of several topics you could talk about.",
      "content": "Think of several topics you could talk about. If you know a little about your crush, think of several of their interests that you could ask them about, or some common interests that you could both discuss. If you don’t know anything about them, think of some general topics that you could both easily talk about, such as pop culture or current events. For example, if you know that they’re involved in sports or music, you could plan to ask them, “Hey, how did the game last night go?” or “I heard that your band is doing really well! When's your next show?” If you’re in the same class or activity, mention that or make a joke. This can help you develop an inside joke or something to return to the next time you talk. Preparing a little doesn’t mean you should script the entire conversation beforehand--be present and genuine when talking to your crush."
    },
    {
      "title": "Take some deep breaths to relax.",
      "content": "Take some deep breaths to relax. Shyness can sometimes feel paralyzing, but taking deep breaths can help loosen up physical tension and soothe your nerves. Whenever your shyness feels too overwhelming, take a moment to inhale and exhale deeply a few times. Try deep breathing. Inhale for 4 counts, hold your breath for 7 counts, then exhale for 8 counts."
    },
    {
      "title": "Smile to look and feel confident.",
      "content": "Smile to look and feel confident. Smiling is a powerful way to boost your mood and makes you appear more friendly and attractive. Even the action of smiling can relax your body and improve your outlook. When you’re feeling nervous around your crush, give them a confident smile. This doesn't mean that you have to smile 100% of the time like a Barbie doll. Instead, flash them a quick smile to show that you are comfortable around them. Try to smile with your eyes as well; this will make your expression look more natural."
    },
    {
      "title": "Open with a compliment.",
      "content": "Open with a compliment. If you’ve never had a conversation with the person before, it can be difficult to find common ground or a reason to start a conversation. An easy way to make contact is to give a compliment or a comment on something they’re wearing. If they’re wearing a t-shirt with the logo of a band you like or a place you’ve been before, you have even more opportunity for a conversation. For example, you could say, “I love that band! Did you see them in concert?” or “New York is so beautiful this time of year--did you visit recently?” Compliments are easy because neither of you is obligated to make conversation after the initial contact, but you still have the option. And now that you’ve initiated, you can smile and acknowledge them when you see them, which can also build your connection."
    },
    {
      "title": "Ask for a small favor.",
      "content": "Ask for a small favor. Asking to borrow a pencil or a piece of paper is an easy, low-pressure way to open communication. This kind of interaction creates what is known as the “Ben Franklin effect”: the person you ask a favor of is actually more likely to like you and develop a connection with you. [2] X Research source Obviously, constantly asking someone for favors could become annoying, so don’t do this too often. Once or twice at most should be enough."
    },
    {
      "title": "Offer to study together.",
      "content": "Offer to study together. If you’re in the same class, studying together can be an easy low-pressure way talk to them for a longer period of time. Before a quiz or test, casually ask your crush if they’d like to get together and study for a while. [3] X Research source For example, you could say in a friendly tone, “Hey, how are you feeling about the test tomorrow? Want to go over the vocabulary together tonight?” Depending on how well you know your crush, you could either study in a public place, such as the library or a coffee shop, or at your house. If you’ve never talked to your crush before, you could put together a study group with some other classmates and casually invite your crush as well. This way, your invitation is low-pressure and general, rather than obvious and out of the blue."
    },
    {
      "title": "Ask questions.",
      "content": "Ask questions. Once you’ve initiated conversation, asking your crush questions is the easiest way to keep it going. Questions also show your crush that you’re genuinely interested in them and can take some pressure off of you. If you’re feeling extra shy, try asking a question and letting the other person talk to give you some time to compose yourself. [4] X Research source Some topics you could ask about include their interests, hobbies, job, plans for the weekend, or pop culture recommendations (such as favorite books or movies)."
    },
    {
      "title": "Maintain good eye contact.",
      "content": "Maintain good eye contact. Being shy can make it difficult to hold eye contact, but fight the urge to drop your gaze. Show your crush that you’re interested in what they’re saying by making eye contact during the conversation. Constant intense eye contact can be as bad as not making any, so a good rule for eye contact is to hold your crush’s gaze 1/3 of the time while you’re speaking and 2/3 of the time while you’re listening. [5] X Research source Keeping eye contact is important because it shows the other person that you are listening to what they are saying. The reason you don't want to maintain eye contact 100% of the time is simply because it's unnerving. Break eye contact occasionally by focusing on something else for few seconds; it can even be an object behind their shoulder or even your lap, if you're sitting."
    }
  ]
}