{
  "url": "https://www.wikihow.com/Unlock-a-Disabled-iPhone-Without-iTunes",
  "title": "How to Get Into Your iPhone If It’s Disabled without Using iTunes",
  "steps": [
    {
      "title": "Enter your password until you get an \"iPhone Unavailable\" screen.",
      "content": "Enter your password until you get an \"iPhone Unavailable\" screen. You will see two options at the bottom, one for emergency calls and one that says Forgot Passcode? . You will need your Apple ID password for this method. [1] X Research source You will also need an active Wi-Fi or cellular connection to complete this method, so don't restart your phone once you get to the iPhone Unavailable screen or you won't be able to erase your device from the lockout screen ."
    },
    {
      "title": "Tap Forgot Passcode?.",
      "content": "Tap Forgot Passcode? . If you are on iOS 16 or earlier, make sure to contact your carrier before doing this method to get a QR code for setting up your eSIM. If you're on iOS 17 or later, you'll have the option to keep your eSIM and erase your data, so you don't need to contact your carrier unless you also want to delete your eSIM."
    },
    {
      "title": "Tap Start iPhone Reset on the Security Lockout screen.",
      "content": "Tap Start iPhone Reset on the Security Lockout screen. This will confirm that you want to reset your iPhone."
    },
    {
      "title": "Enter your Apple ID password.",
      "content": "Enter your Apple ID password. This will sign you out of your Apple ID to prepare your device for erasure."
    },
    {
      "title": "Tap Erase iPhone to start the reset process.",
      "content": "Tap Erase iPhone to start the reset process. All of your data and settings will be permanently lost, but after your phone is done resetting you will be able to set it back up so you can use your device again."
    },
    {
      "title": "Turn off your phone.",
      "content": "Turn off your phone. If you don't have a computer with iTunes available but you do have a Mac, you can restore your phone with Finder . If your phone is connected to a computer, unplug it. [2] X Research source"
    },
    {
      "title": "Enter recovery mode while plugging your phone into your Mac.",
      "content": "Enter recovery mode while plugging your phone into your Mac. Keep holding the recovery mode button while you plug your phone into the computer, and don't let go until you see the recovery mode screen on your iPhone. The button to press is: iPhone 8, 8 Plus, X and later: Side/power button iPhone 7, 7 Plus: Volume down button iPhone SE, 6S, and earlier: Home button"
    },
    {
      "title": "Open Finder on your Mac.",
      "content": "Open Finder on your Mac. The Finder is in the dock by default and has an icon with a blue and white background with a smiley face."
    },
    {
      "title": "Click your phone in the sidebar.",
      "content": "Click your phone in the sidebar. It will be under the Locations heading."
    },
    {
      "title": "Select Restore when prompted.",
      "content": "Select Restore when prompted. The computer will be able to tell that the phone is in recovery mode, and will prompt you to restore or update it. You should select restore to completely wipe the phone and start over."
    },
    {
      "title": "Wait for the process to finish.",
      "content": "Wait for the process to finish. Once it's done, you can set your iPhone up again."
    },
    {
      "title": "Go to the iCloud website.",
      "content": "Go to the iCloud website. Visit iCloud's Find Devices page to get started. Note that you must have \"Find My\" turned on for your iPhone for this method to work. [3] X Research source"
    },
    {
      "title": "Sign in with your Apple ID.",
      "content": "Sign in with your Apple ID. Make sure to use the Apple ID associated with the phone that you're trying to erase."
    },
    {
      "title": "Select your device in the \"All Devices\" list.",
      "content": "Select your device in the \"All Devices\" list. It will be to the left side of the page."
    },
    {
      "title": "Select Erase This Device.",
      "content": "Select Erase This Device . This will begin the erasure of your phone as long as it is turned on. If it's turned off, you must turn it on for the reset to begin."
    },
    {
      "title": "Follow the on-screen instructions.",
      "content": "Follow the on-screen instructions. Follow any additional instructions from the iCloud website and allow the erasure process to finish. Once your phone turns back on, you can set it back up again."
    },
    {
      "title": "Open the Find My app on another iPhone.",
      "content": "Open the Find My app on another iPhone. You must have Find My enabled on your device for this to work. [4] X Research source"
    },
    {
      "title": "Tap the Me tab and scroll up.",
      "content": "Tap the Me tab and scroll up. This will display some additional options."
    },
    {
      "title": "Select Help a Friend.",
      "content": "Select Help a Friend . This will allow you to log in to your Apple ID without needing to completely log out of your friend's Apple ID."
    },
    {
      "title": "Log in to iCloud in the popup window.",
      "content": "Log in to iCloud in the popup window. Use your Apple ID associated with the phone that is locked."
    },
    {
      "title": "Tap your phone under \"My Devices.\"",
      "content": "Tap your phone under \"My Devices.\" If the device doesn't show up, Find My is not enabled on your phone."
    },
    {
      "title": "Tap Erase This Device.",
      "content": "Tap Erase This Device . Press through the buttons on the screen to confirm that you want to erase the device."
    },
    {
      "title": "Enter your Apple ID password and select Erase.",
      "content": "Enter your Apple ID password and select Erase . This will begin the erasure of your phone as long as it is turned on. If it's turned off, you must turn it on for the reset to begin."
    },
    {
      "title": "Wait for the process to finish.",
      "content": "Wait for the process to finish. Once it's done, you can set your iPhone up again."
    },
    {
      "title": "Go to an Apple Store for assistance.",
      "content": "Go to an Apple Store for assistance. If you don't have a Mac or can't erase your phone via iCloud or Find My, you will have to go to the Apple Store for assistance. The Apple Store employees may ask for verification that the phone belongs to you if you're not able to unlock it with your passcode."
    }
  ]
}