{
  "url": "https://www.wikihow.com/Use-a-Sextant",
  "title": "How to Use a Sextant",
  "steps": [
    {
      "title": "Use a map to find your position above sea level.",
      "content": "Use a map to find your position above sea level. If you’re not using the sextant from aboard a ship at sea, you’ll have to correct your sighting for your height above sea level. Look at a map that includes information about your elevation or use an app (such as Google Maps) to check your elevation . Write down your elevation so you can use it later to correct your readings. [1] X Research source Since the sextant measures the angle between an object in the sky and the horizon, your reading will be less accurate if you’re not making a measurement from the level of the horizon (or sea level). You’ll need to correct that difference to find the true altitude of the object you’re observing. The difference between your elevation and the level of the horizon is called “dip.” Even if you’re at sea level, you still need to make a dip correction to take into account the difference between the horizon level and the height of your eye."
    },
    {
      "title": "Sight the horizon by looking through the scope at the horizon mirror.",
      "content": "Sight the horizon by looking through the scope at the horizon mirror. Look through the sighting scope at the horizon line, which you will see through the horizon mirror. [2] X Research source The horizon mirror is only partially silvered, allowing you to look through it and the sighting scope at the horizon beyond it. [3] X Research source The horizon line forms the baseline for the angle of elevation of the object you’re determining the position of. Your sextant may not regard the horizon line as being 0 degrees. If it doesn’t, you’ll have to correct the angle measure of the object you’re trying to determine by the same amount as the horizon line error. This error is called index error."
    },
    {
      "title": "Move the index arm until you see the object you’re trying to measure.",
      "content": "Move the index arm until you see the object you’re trying to measure. A second mirror, the index mirror, is mounted on the moving arm. Move the arm until you can see the object you’re trying to find the altitude of (such as the sun or the moon) reflected on the horizon mirror from the index mirror. [4] X Research source Moving the arm rotates the index mirror until light hitting the index mirror hits the reflective portion of the horizon mirror. This makes the object in the index mirror appear to rest on the horizon. [5] X Research source Sextants designed for looking at the sun include shade glasses to protect your eyes from the sun’s rays."
    },
    {
      "title": "Adjust the arm until the object appears close to the horizon.",
      "content": "Adjust the arm until the object appears close to the horizon. Once you spot the object you’re observing on the horizon mirror, move the arm back and forth slightly to adjust the position of the index mirror. Move it until the object appears to rest close to the level of the horizon as you look through the scope. [6] X Research source If your sextant has a clamp, use it to lock the index arm in place so it can’t swing around freely once you have the object in position. Some sextants have a pair of levers that you squeeze to make larger adjustments with the arm. Release the levers once you have the arm positioned roughly where you want it."
    },
    {
      "title": "Turn the micrometer knob until the object rests on the horizon.",
      "content": "Turn the micrometer knob until the object rests on the horizon. Locate the micrometer knob or screw at the bottom of your sextant and turn it to fine-tune the positioning of the index mirror. Make the adjustments gradually while swaying the sextant from side to side until the object just touches the horizon. [7] X Research source For example, if you were sighting the sun, you’d make fine adjustments with the micrometer knob until it appeared that the bottom curve (or “lower limb”) of the sun was just resting on the horizon."
    },
    {
      "title": "Record the time at which you made your sighting.",
      "content": "Record the time at which you made your sighting. As soon as you get the object in position, look at your watch or phone. Write down the time in hours, minutes, and seconds, starting with the seconds first to avoid errors. [8] X Research source For instance, if you’re making a measurement of the sun’s elevation at 16 seconds past 7:35 in the morning, you would write down “7:35:16 AM.” Quickly recording the time is especially important if you’re using a sextant in marine navigation, since your position and the position of objects in the sky are both changing."
    },
    {
      "title": "Look at the position of the index arm and the micrometer knob to find the angle.",
      "content": "Look at the position of the index arm and the micrometer knob to find the angle. The sextant records elevation in degrees and fractions of degrees, which are called “minutes.” Look at the window over the sextant arc on the bottom of the index arm to find the degree measurement. Then, check the position of the micrometer knob or screw to find the minutes. Your sextant may also have a smaller scale, called a Vernier, which shows fractions of a minute. The Vernier is located next to the micrometer knob. Write down these numbers along with the time. [9] X Research source For example, you may get a reading of 25° 6.40’, or 25 degrees and 6.4 minutes. The index bar may have a small magnifying glass to help you read the graduations on the sextant arc. A minute is 1/60 of a degree, and a second is 1/60 of a minute. Most sextants can take a reading that’s accurate to within 10 seconds. [10] X Research source"
    },
    {
      "title": "Adjust for index error if your sextant gives a horizon reading greater or less than 0°.",
      "content": "Adjust for index error if your sextant gives a horizon reading greater or less than 0°. Sometimes sextants become slightly misaligned, so that if you take a reading right at the horizon you’ll get a number that’s greater or smaller than 0°. This is called “index error.” Check for this error before you observe the altitude of an object. If your sextant reads the horizon angle as greater than 0 (a positive number), subtract the horizon angle from the angle measure of the object. If your sextant reads the horizon angle as less than 0 (a negative number), add the number of degrees difference to the angle measure of the object. [11] X Research source This problem occurs when the index and horizon mirrors don’t line up correctly when the index arm and minute scale are set to 0. When this error occurs, the horizon won’t look like a perfectly straight line across the 2 mirrors when you look through the scope. Turn the micrometer until the line looks straight to find the angle of the index error. If it’s greater than 1.5’, you will need to make adjustments to your sextant to fix it. Consult the user manual that came with your sextant, if you have it."
    },
    {
      "title": "Correct for dip to account for your distance above sea level.",
      "content": "Correct for dip to account for your distance above sea level. “Dip” refers to the difference between your elevation and the actual level of the horizon. To make this correction, multiply 1.7725’ by the square root of your elevation, including the height of your eye, in meters. Subtract this number from your observed altitude (the reading you got on the sextant when you measured the elevation of an object). The ‘ in this formula represents minutes (60ths of a degree). 1.7725’ is a mathematical constant that represents a small fraction of a degree. For example, if you’re 25 metres (82 ft) above sea level, and your eye level is 1.7 metres (5.6 ft), your height above sea level would be 26.7 metres (88 ft). Your dip would be 1.7725’ x √26.7 = 9.16’. If you got an altitude measurement of 38° 10.60’ for the sun, after correcting for dip you would get 38° 10.60’ - 9.16’ = 38° 1.44’."
    },
    {
      "title": "Consult the Nautical Almanac to correct for refraction errors.",
      "content": "Consult the Nautical Almanac to correct for refraction errors. Refraction refers to the way light bends when it passes through the earth’s atmosphere. This effect changes the way objects appear in the sky and makes them look slightly displaced, just like the way a drinking straw looks displaced or bent through water in a glass. Since refraction varies depending on a variety of factors, including which celestial body you’re trying to observe, it’s easiest to make this correction using a correction table. Check page A2 of the Nautical Almanac to find refraction correction tables. [12] X Research source You can purchase the latest Nautical Almanac from an online bookstore. Many of the tables in the almanac are also available for free on a variety of websites related to navigation and sailing. Refraction always makes objects appear higher than they actually are, which means that the correction is always negative. You must subtract it from the apparent altitude. The correct refraction reading will depend on your apparent altitude measurement."
    },
    {
      "title": "Use a semi-diameter correction if you’re observing the sun or moon.",
      "content": "Use a semi-diameter correction if you’re observing the sun or moon. The apparent sizes of the sun and moon change depending on the time of year (in the case of the sun) or month (in the case of the moon). These changes can affect your elevation reading, so you’ll need to make adjustments for accuracy. Check the back of your Nautical Almanac to find out what correction you need to apply to your altitude measurement depending on the time of year or phase of the moon. [13] X Research source Add the semi-diameter correction to your observed altitude after correcting for index error, dip, and refraction. For example, if you were taking a measurement of the sun’s altitude in April, the semi-diameter correction would be 15.9’. This correction only applies to relatively close objects that appear circular through the sextant scope, like the sun and moon. The semi-diameter correction adjusts your reading from the bottom curve of the circle (the lower limb) to its center. More distant stars and planets just look like points of light, so this adjustment isn’t necessary for them."
    },
    {
      "title": "Make a parallax correction using your Nautical Almanac.",
      "content": "Make a parallax correction using your Nautical Almanac . Parallax refers to the apparent difference in position of an observed object depending on your vantage point. The right parallax correction depends on which celestial body you’re observing (i.e., the sun, the moon, or a planet) and the altitude you observed. Check the parallax correction tables on page A2 of your Nautical Almanac . Add the parallax correction after adjusting for index error, dip, refraction, and semi-diameter to get the true altitude of your observed object. [14] X Research source The parallax correction accounts for the difference between your vantage point on the surface of the Earth and what you would see from the center of the Earth. The combined correction for parallax, semi-diameter, and refraction is known as the “third correction.” For example, if your observed altitude for the sun was 38° 10.60’ and you made your observation in April, you might make your corrections as follows: 38° 10.60’ + 1.2’ (index error) = 38° 11.8' 38° 11.8' - 9.16’ (dip) = 38° 2.64’ 38° 2.64’ - 1.1’ (refraction) = 38° 1.54’ 38° 1.54’ + 15.9’ (semi-diameter) = 38° 17.44’ 38° 17.44’ + 0.1’ (parallax) = 38° 17.45’ (true altitude)"
    },
    {
      "title": "Find the sun’s angle of elevation at its highest point.",
      "content": "Find the sun’s angle of elevation at its highest point. At noon (12:00 PM by your local standard time), use your sextant to measure the altitude of the sun. The sun’s altitude at noon will vary depending on your latitude and the time of year. [15] X Research source For example, if you were at the equator and taking your measurement during the spring or fall equinox, the sun would be exactly 90° overhead at noon. If you were at one of the poles, it would be at exactly 0° (on the horizon)."
    },
    {
      "title": "Make corrections for index error, dip, refraction, semi-diameter, and parallax.",
      "content": "Make corrections for index error, dip, refraction, semi-diameter, and parallax. To get an accurate latitude measurement, you’ll need to apply the standard corrections to your reading of the sun’s altitude. If your sextant has any index error (difference between a measurement taken at the horizon and 0°), take it into account. Measure the height of your eye, add it to any additional elevation above sea level, and use the 1.7725’ x √ht (ht being height) formula to correct for dip. Finally, consult the tables in your Nautical Almanac to find the corrections for refraction, semi-diameter, and parallax. Apply the corrections as follows: Observed altitude of the sun +/- index error (+ if the difference is negative, - if it’s positive) - dip - refraction + semi-diameter + parallax = true altitude of the sun"
    },
    {
      "title": "Subtract your corrected altitude from 90°.",
      "content": "Subtract your corrected altitude from 90°. Once you have your numbers, you’ll need to account for the difference between the sun’s altitude at the equator versus its altitude at your actual latitude. Use 90° as your starting point, since this is the sun’s altitude at the equator at noon during the equinox. [16] X Research source For example, if you got a reading of 82° 17.3’, subtract this from 90° to get 7° 42.7’."
    },
    {
      "title": "Use the Nautical Almanac to determine the declination of the sun.",
      "content": "Use the Nautical Almanac to determine the declination of the sun. The declination of the sun refers to the difference in altitude of the sun at any given time of year from its position during the spring and fall equinoxes. Depending on the time of year, the sun will appear higher or lower in the sky. Check the correct declination for the sun depending on the time of year in the tables in your Nautical Almanac. [17] X Research source For example, on February 1st, the declination is 17° 12’ south of the equator. The declination of the sun is at its highest (23° north of the equator) on the June solstice and lowest (23° south) on the winter solstice."
    },
    {
      "title": "Add or subtract the declination of the sun to find your latitude.",
      "content": "Add or subtract the declination of the sun to find your latitude. Depending on the position of the sun relative to the equator, you’ll need to either add or subtract the declination from your previous calculation to find your latitude. If the sun is north of the equator, add the declination. If it’s to the south, subtract it. For example, if you got a measurement of 7° 42.7’ after subtracting the sun’s altitude from 90°, and it’s currently April 13, the sun is north of the equator and its declination is 8° 54’. Add 7° 42.7’ + 8° 54’ to get 16° 36.57’. This is your latitude!"
    }
  ]
}