{
  "url": "https://www.wikihow.com/Tell-Someone-You%27re-Not-Interested",
  "title": "How to Politely Tell Someone You're Not Interested in Them",
  "steps": [
    {
      "title": "Tell them you appreciate their offer or attention.",
      "content": "Tell them you appreciate their offer or attention. Acknowledging and thanking them can take some of the sting out of the rejection. You don’t need to give them an elaborate thank you—a single sentence is enough to convey that you’re appreciative of the thought. Dating coach John Keegan recommends saying something like, “That took guts and courage…I'm really flattered. And thank you so much for doing that, it makes me feel good.” Or, say, “Thanks for complimenting my dress,” or “That’s a really nice offer.” You don't have to thank them if they're making you feel uncomfortable. You don't want to send them the message that their behavior is okay."
    },
    {
      "title": "Give them an honest and clear rejection.",
      "content": "Give them an honest and clear rejection . Dating coach Imad Jbara emphasizes that it’s important to “be honest, be direct.” It may be tempting to be vague about how you feel in order to spare their feelings, but in addition to leading them on, you’ll likely find yourself having to reject them again in the future. [1] X Research source You might say, “I’m not looking for a relationship right now,” “I don’t see you that way,” or “That’s not something I’m interested in.” Be especially firm with an ex who might be looking for a second chance. You might say, “We’ve done this before, and I don’t think it’s a good idea to try it again.” If this person continues to pursue after you've gently told them how you feel, you can be more direct about your lack of interest and set boundaries around your time together. Reader Poll: We asked 488 wikiHow readers about how they’d handle someone continuing to pursue them after rejection, and 58% of them agreed that they would set clear boundaries and communicate their disinterest . [Take Poll]"
    },
    {
      "title": "Avoid apologizing for turning them down.",
      "content": "Avoid apologizing for turning them down. You don’t owe anyone an apology for feeling the way you do. Also, saying you’re sorry makes it seem like you’re pitying them, which can hurt their feelings more. Instead of saying, “I’m sorry, I’m not interested,” just say, “I’m not interested in dinner, but I really appreciate the offer.”"
    },
    {
      "title": "Stay casual to avoid embarrassing them.",
      "content": "Stay casual to avoid embarrassing them. Asking someone out or expressing feelings is always a risk, and it takes a lot of courage! Staying light and casual helps let them down easy, and tells them that even though you’re rejecting them, it’s really no big deal, and they shouldn’t take it too hard. For example, don’t avoid them afterward, and stay friendly and cordial, so long as they also remain respectful of your boundaries."
    },
    {
      "title": "Offer to stay friends, but let them have their space.",
      "content": "Offer to stay friends, but let them have their space. Sometimes you genuinely want to be friends with someone you're not interested in dating, especially if you were friends before they made an advance. But they may not feel comfortable being friends afterward. That’s their choice, and though it might hurt, it’s best to respect that choice. [2] X Research source You might say, \"I hope we can still be friends, but I understand if you need your space.\""
    },
    {
      "title": "Use excuses or white lies carefully, and only with strangers.",
      "content": "Use excuses or white lies carefully, and only with strangers. Dating coach Imad Jbara suggests saying, “I'm really busy right now and I have to get somewhere but it was nice meeting you,” or. “Unfortunately, I have a boyfriend.” Excuses or lies can be useful if you feel uncomfortable, but choose one that doesn’t leave room for arguing, and exit the conversation as soon as you give it. Remember that if you know this person, they may be aware that your excuse is a lie, or find out about it later. It’s best to only use excuses or lies with strangers, and be more direct with closer acquaintances. You might also say, “I’m not ready to date anyone right now,” “I’m seeing someone,” “I’m just too busy right now,” or “I just got out of a relationship.”"
    },
    {
      "title": "Turn down physical advances clearly and directly.",
      "content": "Turn down physical advances clearly and directly. Dating coach and matchmaker Erika Kaplan says, “physical advances must be met with boundaries .” If someone makes an unwanted physical advance, it’s best to be direct and leave no question about your own feelings and comfort. Don’t feel pressured to be nice or suggest they have a chance if you don’t feel that way; their breach of consent is a serious overstep. You might say, “I don’t appreciate being touched without consent, and I’m uncomfortable with your advance. Please leave me alone.” If you feel unsafe, exit the situation or find a nearby friend, authority figure, or even stranger to accompany you away."
    },
    {
      "title": "Plan out what you’ll say in advance, if you can.",
      "content": "Plan out what you’ll say in advance, if you can. Knowing what you want to say or practicing it with a friend can help you let them down nicely. Think about the reasons why you don’t want to be with them, then focus on the most important issue. Consider how you can share these issues with them in the kindest words possible. [3] X Research source For example, you might not feel attracted to the person physically, but it’s unkind to tell them that. Instead, you might practice saying, “I just don’t feel any chemistry,” or “That spark is missing.” Similarly, you might feel like they talk too much. In this case, you could say, “I feel like we don’t communicate the same way.”"
    },
    {
      "title": "Meet them in person, if possible.",
      "content": "Meet them in person, if possible. Matchmaker & dating app CEO Maria Avgitidis says, “If you want to break up with someone that you've been dating, the best way would be to do it in person.” It’s the most polite and respectful way, and offers closure for both of you. Meet somewhere public, and where you can make a quick exit, like a coffee shop or park. Also, make plans with a friend afterward, so you have both an easy out and emotional support waiting in the wings. If you’ve only been on one date, it’s totally fine to express your feelings with a text or call."
    },
    {
      "title": "Start the conversation by giving them a compliment.",
      "content": "Start the conversation by giving them a compliment . Saying something nice can ease the pain of the rejection, but don’t spend too much time telling them how great they are. Otherwise, they may question why you don’t want to continue seeing them. Also, your words might seem hollow when you reject them after telling them how wonderful you think they are. [4] X Research source Give them a 1-sentence compliment, like, “I liked getting to know you,” or “I really enjoyed talking to you about movies because you’re so insightful.”"
    },
    {
      "title": "Thank them for the dates you’ve had.",
      "content": "Thank them for the dates you’ve had. This acknowledges the time they’ve put into getting to know you. It shows them that you’re thinking about their feelings, even though what you have to say might hurt. [5] X Research source For instance, you could say, “Thank you for these past few dates. I’ve had fun, but I’m not sure it’s working.”"
    },
    {
      "title": "Tell them generally why things aren’t working for you.",
      "content": "Tell them generally why things aren’t working for you. Offering an explanation, however brief, gives them some closure. [6] X Research source Even something as simple as “I don’t think we click” is better than nothing. It’s up to you if you want to give a specific reason, but if you’ve gone on a couple of dates, it might be helpful to give them a little more context for your decision. [7] X Research source You might say, “I’ve had fun with you, but I feel like we have different goals, and we just don’t seem to be on the same path in life.”"
    },
    {
      "title": "Focus on your own feelings, and avoid blaming them.",
      "content": "Focus on your own feelings, and avoid blaming them. Being honest with someone doesn’t mean being hurtful. In most cases, there’s no reason to tell someone what you don’t like about them. Instead, center the conversation on the personal reasons it’s not working. [8] X Research source For example, instead of, “I don’t like your lifestyle,” you might say, “I’m not sure our lifestyles are compatible.” Avoid offering “constructive criticism.” People are allowed to live however they like, and someone you don’t like might be a perfect match for someone else."
    },
    {
      "title": "Answer their questions, but stand your ground.",
      "content": "Answer their questions, but stand your ground. Matchmaker and dating app CEO Maria Avgitidis says, “answer any questions this person may have, just to give them closure.” They may not feel the same way as you do, and that’s okay. Acknowledge how they feel but restate your intention to break things off. For example, you might say, “I can understand why you feel like we should go on another date, but that’s not what’s right for me.” You don’t have to answer questions that make you feel uncomfortable. In this case, say something like, “I’m not sure that’s relevant, and I’ve given my reasons.” Then excuse yourself and take your leave."
    }
  ]
}