{
  "url": "https://www.wikihow.com/Use-Quotation-Marks",
  "title": "How to Use Quotation Marks",
  "steps": [
    {
      "title": "Capitalize the first letter of a direct quote from a source.",
      "content": "Capitalize the first letter of a direct quote from a source. If you are quoting directly from a source, such as a book, article, or journal, always use one pair of quotations around the quote and capitalize the first letter of the direct quote. Do this if you are quoting a complete sentence. For example, you may write: [1] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Pollen states in his book, “You can eat whatever you want as long as you make it yourself.” In Othello by William Shakespeare, Iago says in Act II, scene iii, “Reputation is an idle and most false imposition; oft got without merit and lost without deserving.”"
    },
    {
      "title": "Put a comma before a full quote.",
      "content": "Put a comma before a full quote. Whenever you use quotation marks around a full quote, place a comma or a colon before the first, or open, quotation mark. The comma or colon does not go in the quotation mark, just before it. This will let the reader know a quote is coming. For example: [2] X Research source Shakespeare notes in his diary, “I am the poor man’s playwright.” Pollen recommends, “Eat food. Mostly plants.”"
    },
    {
      "title": "Lowercase quoted material that appears mid-sentence.",
      "content": "Lowercase quoted material that appears mid-sentence. If you are quoting a source within a sentence, not at the end of a sentence, lowercase the first letter of the quote. You can do this if you are using a partial quote of a longer quote in a sentence. For example, you may write: [3] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Pollen advocates for taking responsibility for one’s food choices, for eating “whatever you want as long as you make it yourself,” a tall order for some."
    },
    {
      "title": "Include punctuation in the quote inside the quotation marks.",
      "content": "Include punctuation in the quote inside the quotation marks. Commas, periods, exclamation marks, dashes, and question marks that appear in the quote should all go inside the quotation marks. For example: [4] X Research source Othello notes, “For she has eyes and she chose me.” Pollen asks the question, “Why don’t we get to know our food?” The last line of the poem “Sestina: Altaforte” by Ezra Pound states, “Hell blot black for always the thought ‘Peace’!”"
    },
    {
      "title": "Put quotation marks around common sayings.",
      "content": "Put quotation marks around common sayings. Familiar sayings should be demarcated with quotation marks. Cliches can also go in quotation marks. For example: Everyone knows the saying, “What goes in must come out.” One is reminded of the familiar phrase, “It takes one to know one.”"
    },
    {
      "title": "Use quotation marks to emphasize a word or phrase.",
      "content": "Use quotation marks to emphasize a word or phrase. These are also known as scare quotes. Scare quotes are not used often. But they can be used to emphasize a word or phrase in a sentence in a mocking or annoyed tone. For example: [5] X Research source She did not want to bring up his “issue” in mixed company. The “in depth discussion” of the problem felt insufficient at best."
    },
    {
      "title": "Put quotation marks around the dialogue only.",
      "content": "Put quotation marks around the dialogue only. Quotation marks are essential for notating dialogue, as they signal to the reader the words are being spoken. You should use quotation marks around dialogue in a novel, short story, or poem. For example: [6] X Research source “Where is my cat?” the woman screamed. I demanded, “Let me see her.”"
    },
    {
      "title": "Lowercase the word after the quotation mark.",
      "content": "Lowercase the word after the quotation mark. Always lowercase the word that follows the close quotation mark, or the second quotation mark. Do this if the speaker attribution appears after the quoted phrase. For example: “What time is it?” the man asked. “Chop, chop,” she said."
    },
    {
      "title": "Use a comma before a speaker attribution.",
      "content": "Use a comma before a speaker attribution. Place a comma before speaker attributions like “he said,” “she said,” “they said,” “we yelled,” etc. This will signal to the reader there is about to be dialogue. For example: [7] X Research source He said, “I can’t make ballet class tonight, son.” They yelled, “You hooligans!” “We’re late,” she said to her sister. “Tell me you love me, “ he said to his lover."
    },
    {
      "title": "Include commas and periods in the quotation marks.",
      "content": "Include commas and periods in the quotation marks. Any commas or periods that are part of the sentence should be included in the quotation marks, even if the original quotation does not have a comma or a period. For example: [8] X Research source “The best way to eat food,” Pollen argues, “is to make it yourself.” (From the original quote, “The best way to eat food is to make it yourself at home, whenever you can.”) “The best investments today,” according to Smith, “are commodities and emerging-market stocks.” (From the original quote, “The best investments today are commodities and emerging-market stocks, not domestic stocks and bonds.”"
    },
    {
      "title": "Put single quotation marks around quotes within quotations.",
      "content": "Put single quotation marks around quotes within quotations. If you are quoting a phrase that already has quotation marks, change the quotation marks in the phrase to single quotation marks. Single quotation marks appear as ‘’. For example: “So he said to me, ‘You’re going to be a great success,’ and I believed him.”"
    },
    {
      "title": "Use quotation marks for the titles of poems, short stories, and chapters in a book.",
      "content": "Use quotation marks for the titles of poems, short stories, and chapters in a book. Put one set of quotation marks around these titles to off set it properly. Only put quotations around the title, not the author’s name. [9] X Research source For example, if you were citing the poem One Art by Elizabeth Bishop, it would appear as “One Art” by Elizabeth Bishop. If you were citing the short story Ironhead by Aimee Bender, it would appear as “Ironhead” by Aimee Bender. If you were citing the chapter The Boy Who Lived from Harry Potter and the Philosopher’s Stone by J.K. Rowling, it would appear as “The Boy Who Lived” from Harry Potter and the Philosopher’s Stone by J.K. Rowling."
    },
    {
      "title": "Put quotation marks on the titles of articles and essays.",
      "content": "Put quotation marks on the titles of articles and essays. Always use quotation marks when citing the title of an article or essay in a journal, magazine, or online publication. Capitalize all of the words that are not articles in the title and use one set of quotation marks around the title only. [10] X Research source For example, if you were citing the article The President Wants to Keep Us in the Dark by Marc Decosta, it would appear as “The President Wants to Keep Us in the Dark” by Marc Decosta. If you were citing the essay The Fourth State of Matter by Jo Ann Beard, it would appear as “The Fourth State of Matter” by Jo Ann Beard."
    },
    {
      "title": "Use quotation marks for television episodes and song titles.",
      "content": "Use quotation marks for television episodes and song titles. For example, if you were talking about an episode of Friends called The One With the Blackout, it would appear as “The One With the Blackout.” If you were discussing the song Tangled Up in Blue by Bob Dylan, it would appear as “Tangled Up in Blue” by Bob Dylan. [11] X Research source"
    },
    {
      "title": "Apply quotation marks to the title of a play.",
      "content": "Apply quotation marks to the title of a play. Plays should always be cited with quotation marks. For example, if you were discussing the play The Crucible by Arthur Miller, it would appear as “The Crucible” by Arthur Miller. Do not use italics or underline the title of plays. If you are citing a collection of plays by the same playwright, for example, The Collected Plays of Arthur Miller, you would use italics for the title, not quotation marks: The Collected Plays of Arthur Miller ."
    },
    {
      "title": "Do not include punctuation in the quotation marks when quoting a title.",
      "content": "Do not include punctuation in the quotation marks when quoting a title. Do not put punctuation that is part of the sentence in the quotation marks with the title. Only include punctuation that is already part of the title in the quotation marks. For example: Did you like “The Crucible”? I read “Who’s Afraid of Virginia Woolf?” by Edward Albee on the train today."
    }
  ]
}