{
  "url": "https://www.wikihow.com/Tap-a-Pine-Tree",
  "title": "How to Tap a Pine Tree",
  "steps": [
    {
      "title": "Locate some mature pine trees that you can obtain access to.",
      "content": "Locate some mature pine trees that you can obtain access to. You will need to have the landowner's permission before proceeding, and you must make it clear what you intend to do. Tapping the trees will not seriously injure them if done properly, but may decrease the value of them as timber if they are harvested in the future. [2] X Research source"
    },
    {
      "title": "Identify the best species of pines for this purpose.",
      "content": "Identify the best species of pines for this purpose. Because in general, different species of pine have similar appearance, you may need to talk to someone familiar with the pines native to your area. Southern pines that are suitable for tapping include these: Southern Yellow Pine Black Pine Loblolly Pine Improved Slash Pine"
    },
    {
      "title": "Gather the necessary tools for your project.",
      "content": "Gather the necessary tools for your project. You will have to have a tool for cutting the bark of the tree, a catch pan, and a container to gather the collected sap into. If you choose to catch the sap in a plastic container, you will also need some lightweight sheet metal to form a funnel with to decrease waste of sap. Here is a basic list of tools and materials with a description of each one. Hacker. This is a short, machete like tool for hacking the bark and sapwood of the tree. A special tool commonly made by local blacksmiths until early in the 20th century, you may substitute a hatchet or small axe or use a very sharp machete or other large knife. Turpentine pots. These pots were made of tinned steel or terra cotta ceramics, and are largely unavailable today. The two unique features they shared was a thin, curved rim at the top, and a hole for the hanging peg just below the rim on the concave edge. You can make your own turpentine pots from large metal cans such as institutional food containers. Simply remove the top completely, dent one side in to make it concave, and drill a 1 ⁄ 4 inch (0.6 cm) hole in the lip of the can. Lugging buckets. This is not a technical name, just a description of the use for the bucket the turpentine used to carry the sap from the collection pots to the still or the location the product was sold as a raw material. Hammer and pegs. Any hammer suitable for driving nails will work, and if you don't have hardwood pegs, you can also use a large nail to peg your collecting pots to the tree. The advantage of using hardwood pegs is that the tree could safely be harvested later for saw logs without the risk of a steel pin or nail damaging the sawmilling equipment. Turpentine still. Obviously this is a large and complicated assembly of equipment, and will not be discussed in detail here. Pine sap (called resin ) is gathered and distilled to produce turpentine , used for paint thinning, varnishes, and cleaning solvents."
    },
    {
      "title": "Choose a tree to make your tap into.",
      "content": "Choose a tree to make your tap into. Look for large, tight-barked trees to have the best results, since shag barked trees will be difficult to get a tight fit on with your collecting buckets."
    },
    {
      "title": "Hack the bark away from the sap (live) wood",
      "content": "Hack the bark away from the sap (live) wood about 3 foot (0.9 m) above the ground, and about 10 inches (25.4 cm) wide, by chopping the bark away with your machete, hatchet, or other chopping tool. Scrape away the bark to expose about a 6 inch (15.2 cm) tall section of sapwood."
    },
    {
      "title": "Fit your collecting bucket tightly to the sapwood,",
      "content": "Fit your collecting bucket tightly to the sapwood, so that when the sap begins to seep out, it will drip into it. If you use a bucket that cannot be conformed to the shape of your tree, use a piece of metal flashing to form a funnel into the bucket. [3] X Research source"
    },
    {
      "title": "Hack some shallow notches",
      "content": "Hack some shallow notches in a \"V\" shape, with the point of the \"V\" directly above the center of your bucket."
    },
    {
      "title": "Leave the bucket attached to the tree",
      "content": "Leave the bucket attached to the tree until the sap begins to seep out and drain into it. Rainwater will not affect the sap, since it is fairly waterproof, but you will want to collect the sap into a clean container with a tight-fitting lid every several days to keep debris from accumulating in it. Hack additional notches in the sapwood if the sap flow decreases, as the sap may begin to harden or crystallize, sealing the wood grain closed and preventing sap from seeping. [4] X Research source"
    },
    {
      "title": "Remove any nails or other metal fasteners when you are finished your project and take down your collection pot.",
      "content": "Remove any nails or other metal fasteners when you are finished your project and take down your collection pot. Driving a wooden peg into any penetrations may help prevent the tree from suffering further damage from insects or diseases entering through the hole."
    }
  ]
}