{
  "url": "https://www.wikihow.com/Thicken-Frosting",
  "title": "How to Thicken Frosting, Icing, and Ganache",
  "steps": [
    {
      "title": "Powdered sugar",
      "content": "Powdered sugar Sprinkle in 1 to 2 tbsp (7.5 - 15 g) of powdered sugar at a time, then stir it in and check the consistency. Most frostings contain powdered sugar, or icing sugar, and the most common way to thicken a runny frosting is by gradually mixing in a bit more powdered sugar to offset the liquid ingredients. [1] X Research source If you add too much at once, the frosting will become too sweet and may become too thick. If this happens, you will need to add more liquid to balance it out, and the consistency problem may only continue from there. For royal icing: Stir in ¼ cup (25 g) of powdered sugar at a time and see if the consistency improves. [2] X Research source Pro tip: For every ½ cup (50 g) of powdered sugar you incorporate in your frosting mixture, add in 1-2 tsp (3.25 - 6 g) of meringue powder, too. It’ll help thicken your frosting without packing as severe of a sweetening punch. [3] X Research source"
    },
    {
      "title": "Cornstarch",
      "content": "Cornstarch Stir in 1 tsp (3.25 g) of cornstarch with your frosting mixture and see if it becomes less runny overall. Always work in small increments, rather than adding too much at once. This can be a great way to thicken your frosting without making it sweeter in the process. Some home baking enthusiasts suggest stirring in 1 tbsp (10 g) of cornstarch at a time. [4] X Research source Ultimately, add an amount that makes the most sense for your recipe—it never hurts to start small!"
    },
    {
      "title": "Arrowroot starch",
      "content": "Arrowroot starch Measure out 1 tbsp (8 g) of arrowroot starch and add it to your frosting to see if the consistency improves. This can be a great option if you’re trying to make your frosting as glossy and big as possible. [5] X Research source Alternative: Use tapioca starch instead. This ingredient works best with frostings and icings that have a more acidic flavor profile (like citrus). Some home bakers recommend starting with 1 tsp rather than 1 tbsp. Use your best judgement to find an amount that works best for your frosting or icing."
    },
    {
      "title": "Gelatin",
      "content": "Gelatin If you don’t want to add any sweetness to your frosting, pour a &tag=wikihow3191247-20 flavorless gelatin packet into warm or cold water. When the gelatin has dissolved, pour it bit by bit into your frosting. Then, stick the frosting in your refrigerator until it thickens up. [6] X Research source Try to use gelatin in cold water. That way, you won’t have to wait for it to cool down before you add it in."
    },
    {
      "title": "Cream cheese",
      "content": "Cream cheese Add about 1 oz (30 ml) of cream cheese to your frosting and blend it in well. You can use this method for icings beyond cream cheese frosting, as long as you think the cream cheese will mesh well with the flavor profile."
    },
    {
      "title": "Butter",
      "content": "Butter Stir 1 US tbsp (15 mL) of butter into your frosting mixture and incorporate it thoroughly. If the mixture still seems runny, feel free to add one more tablespoon into the mix. [7] X Research source"
    },
    {
      "title": "Heavy cream",
      "content": "Heavy cream Add about a ¼ cup (55 mL) of heavy whipping cream into your frosting mixture. Then, use a stand or hand mixer to whip the cream within the frosting, which may help improve the consistency. [8] X Research source Continue adding a little extra cream to your recipe if the consistency still doesn’t get better."
    },
    {
      "title": "Cocoa powder (for chocolate frosting)",
      "content": "Cocoa powder (for chocolate frosting) Add 1 to 2 tsp (2.5 - 5 g) cocoa powder into the frosting at a time. Otherwise, you may end up with frosting that is too thick or too potent. Since cocoa powder is also fairly bitter on its own, too much can also cause the frosting to become bitter. [9] X Research source"
    },
    {
      "title": "Peanut butter (for peanut butter frosting)",
      "content": "Peanut butter (for peanut butter frosting) Mix an extra 1 to 2 US tbsp (15 to 30 mL) of creamy peanut butter into your peanut butter frosting and give it a good mix to see if the texture improves. If that doesn’t get the job done, keep stirring in more peanut butter in small amounts."
    },
    {
      "title": "Shredded coconut (for coconut frosting)",
      "content": "Shredded coconut (for coconut frosting) Add about 1 tbsp (6 g) of shredded coconut into your frosting and see if the consistency improves. If the frosting still seems runny, add another tbsp. [10] X Research source"
    },
    {
      "title": "Flour (for cooked frosting)",
      "content": "Flour (for cooked frosting) Use flour for cooked frostings. If you are making warm frosting on your stovetop, flour can be a good thickener. Start by adding between 1 tsp to 1 tbsp (3.25 to 12.5 g) of flour into the frosting and stir over low heat on the stove until it begins to thicken—at this point, take it off the stovetop. [11] X Research source Remove the frosting from the heat as soon as it begins to thicken. Cooking flour in for too long can cause the frosting to become thin and runny again."
    },
    {
      "title": "Refrigeration",
      "content": "Refrigeration Sticking frosting in the fridge may help improve the consistency. [12] X Research source If you’re planning to pipe the frosting, transfer it to your piping bag first —then, let it chill in the fridge for 20-30 minutes. [13] X Research source Certain frostings, like devil’s food cake, can get firm very quickly. Don’t leave these in your refrigerator for more than 10 minutes, and peek in on it frequently to keep an eye on the texture. [14] X Research source When you take the frosting out of the fridge, use a hand mixer to beat it again until it’s smooth. This method works the best on frosting with a butter base or a whipped cream frosting. [15] X Research source"
    },
    {
      "title": "Extra mixing time",
      "content": "Extra mixing time It could just be that your frosting ingredients haven’t fully incorporated yet, or they might have separated during storage. Grab a whisk or a hand mixer and try stirring up your frosting again for 3 to 4 minutes to see if it thickens up. [16] X Research source"
    },
    {
      "title": "Measure your wet ingredients carefully.",
      "content": "Measure your wet ingredients carefully. Even a small amount of extra heavy cream can give your ganache the wrong consistency. As you put your frosting together, use measuring cups carefully to avoid any mistakes. [17] X Research source"
    },
    {
      "title": "Use heavy cream or whipping cream.",
      "content": "Use heavy cream or whipping cream. While most recipes call for this, it’s easy to think that you can substitute them for regular milk. However, normal cow’s milk doesn't have enough fat to thicken ganache, so you might end up with watered-down frosting instead of a thick and creamy one. [18] X Research source"
    },
    {
      "title": "Find a recipe based on the type of chocolate you’re using.",
      "content": "Find a recipe based on the type of chocolate you’re using. White chocolate is different from milk chocolate, and milk chocolate is different from dark chocolate. Make sure you’re reading off a recipe that lines up with the proper chocolate to avoid a runny outcome. White chocolate tends to yield a thinner consistency as opposed to dark chocolate. [19] X Research source"
    },
    {
      "title": "Mix in a small amount of chopped chocolate if your ganache is too thin.",
      "content": "Mix in a small amount of chopped chocolate if your ganache is too thin. When your ganache is really fresh and warm, chop up some more chocolate (the same kind that you already used) and throw it into the bowl. Stir the chocolate in with a spatula to let it melt and combine to thicken up your mixture. [20] X Research source If you do this after your ganache is cold, your chocolate won’t combine, and you’ll end up with lumps in your ganache. If you need to heat your ganache back up, put it on a double boiler and heat it slowly and carefully. If you warm it up too much, you could end up messing with the consistency."
    },
    {
      "title": "Your butter was too soft.",
      "content": "Your butter was too soft. The consistency of the butter you add to your frosting can impact its structure overall. [21] X Research source According to some at-home bakers, butter that’s on the melted side can contribute to runny frosting (or, at least, frosting that looks pretty oily)."
    },
    {
      "title": "Your cooking space was too warm.",
      "content": "Your cooking space was too warm. Your cooking environment can play a major role in how your frosting turns out, especially if your kitchen is on the hotter side. [22] X Research source For instance, if you prep some frosting immediately after taking something out of the oven, your kitchen might be a little warmer because of it."
    },
    {
      "title": "The frosting ingredients interacted and created a runny consistency.",
      "content": "The frosting ingredients interacted and created a runny consistency. With certain frostings, like cream cheese frosting, the high-liquid volume of the cream cheese may cause the powdered sugar to break down, which makes the frosting more watery overall. [23] X Research source"
    },
    {
      "title": "Your liquid ingredients watered down the consistency.",
      "content": "Your liquid ingredients watered down the consistency. When it comes to home baking and confections, the most obvious answer is sometimes the correct one. In putting your recipe together, you ended up a little too much liquid in (e.g., milk), which made the consistency a little too soupy overall. If you’d like to give your frosting a little extra flavor, try to use non-liquid flavorings (e.g., lemon zest rather than lemon juice). [24] X Research source"
    },
    {
      "title": "Follow your recipe carefully.",
      "content": "Follow your recipe carefully. Frosting might seem simple, but making even a minor change to the ingredients can result in an unexpected change to the consistency. Make sure you’re using the right ingredients at the right measurements to make your frosting perfect. [25] X Research source For example, if a recipe calls for full-fat cream cheese, don’t substitute it for a cream cheese with a lower fat content. [26] X Research source"
    },
    {
      "title": "Mix in the liquid ingredients last.",
      "content": "Mix in the liquid ingredients last. Typically, the fully liquid ingredients in frosting are added last. Following this procedure could help you to prevent runny frosting before it happens. If you’re thinking about adding a liquid-based ingredient for flavoring purposes, mix the core ingredients together first so you can get an idea for what the main consistency will be. [27] X Research source"
    },
    {
      "title": "Add ingredients gradually and in small amounts.",
      "content": "Add ingredients gradually and in small amounts. One of the biggest reasons why people often end up with consistency problems while making frosting is simply that a little too much of one ingredient gets added, throwing the entire recipe off. [28] X Research source Both the liquids and powdered sugar need to be added slowly and in small amounts. If a frosting ends up being way too thick at first, attempts to thin it out could make it too runny. This is especially important when you’re adding ingredients to thicken up your frosting. Less is more!"
    }
  ]
}