{
  "url": "https://www.wikihow.com/View-the-List-of-People-You-Have-Requested-to-Follow-on-Instagram",
  "title": "Easily View a List of People You Have Requested to Follow on Instagram",
  "steps": [
    {
      "title": "The only way to see the follow requests you sent is to download your Instagram data.",
      "content": "The only way to see the follow requests you sent is to download your Instagram data. When you request to download a ZIP file of your \"Followers and following\" data from Instagram, you'll be able to see everyone you've requested to follow who hasn't yet accepted your request. You'll also see a general list of everyone you've asked to follow recently. Requesting a download has been the only way to view a list of people you've requested to follow on Instagram for a while, but the process has recently changed. We've detailed the updated step-by-step process below. Depending on how much data you request, it can take anywhere from several minutes to 30 days to receive your files. You can speed up the process by only downloading information about the people you requested to follow instead of all your Instagram data. [1] X Research source In our test, we received a link to download a list of people we requested to follow in about 20 minutes."
    },
    {
      "title": "Open your Instagram Settings menu.",
      "content": "Open your Instagram Settings menu. If you're using the Instagram mobile app, tap your profile photo at the bottom-right, then tap the three-line menu at the upper-right corner. If you're using Instagram on your computer, click More at the bottom-left corner, click Download your information , and skip to step 4 . This method will help you view two different lists of follow requests: One list of recent follow requests you've sent recently (whether they were accepted or not), and another containing pending follow requests (requests you've sent that have not yet been approved or denied)."
    },
    {
      "title": "Tap Your activity on the menu.",
      "content": "Tap Your activity on the menu. You'll see this under the \"How you use Instagram\" header near the top of the page."
    },
    {
      "title": "Scroll down and tap Download your information.",
      "content": "Scroll down and tap Download your information . It's at the bottom of the menu. This opens the \"Get a copy of your information\" screen."
    },
    {
      "title": "Tap Download and transfer information.",
      "content": "Tap Download and transfer information . It's near the top of the page."
    },
    {
      "title": "Tap Some of your information.",
      "content": "Tap Some of your information . This option allows you to download some of your Instagram data, including a list of people you've requested to follow. You can choose the All available information option to download even more of your data, but it will take much longer."
    },
    {
      "title": "Select \"Followers and following\" and tap Next.",
      "content": "Select \"Followers and following\" and tap Next . You'll see a checkbox next to \"Followers and following\" under the \"Connections\" header. Tap the checkbox to select this option, then tap Next at the bottom."
    },
    {
      "title": "Select \"Download to device\" and tap Next.",
      "content": "Select \"Download to device\" and tap Next . This option ensures you'll receive a download link containing the requested information, which you can download on any device."
    },
    {
      "title": "Select a date range.",
      "content": "Select a date range. If you want to see everyone you've requested to follow since you've had your Instagram account, select All time . You can also choose a shorter amount of time like Last year or Last 3 years . Choosing a longer period of time can make it take longer to create your download."
    },
    {
      "title": "Tap Create files to request your download.",
      "content": "Tap Create files to request your download. Depending on how much information you requested, receiving the data from Instagram may take a while. When your download is ready, you'll receive an email with the subject \"Your Meta information download is ready\" from an Instagram.com email account. The file may be large (typically several gigabytes), depending on how much content is included. If you're using a phone or tablet, it's best to access the file (once ready) on a computer with plenty of room and a fast internet connection."
    },
    {
      "title": "Download and unzip the file.",
      "content": "Download and unzip the file. Once you receive the email from Instagram, tap the download your information link, and then follow the on-screen instructions to save the ZIP file to your computer, phone, or tablet in a location you'll remember. Once downloaded, unzip the file . This will create a folder on your computer, phone, or tablet with the same name as the downloaded file."
    },
    {
      "title": "Open the extracted folder.",
      "content": "Open the extracted folder. The folder will contain several other folders and an HTMI file."
    },
    {
      "title": "Open the file called start_here.html.",
      "content": "Open the file called start_here.html . This opens the \"About your download\" page in your default web browser."
    },
    {
      "title": "Click Pending follow requests.",
      "content": "Click Pending follow requests . Now you'll see a list of all any follow requests that are still pending—that is, that have not been accepted or rejected. To see recent follow requests that were either accepted or deleted, click Recent follow requests . Keep in mind that if a person denies your follow request, it won't appear in this list. This list only displays follow requests that have not been rejected or approved yet."
    },
    {
      "title": "Check your search history.",
      "content": "Check your search history. If you requested to follow somebody on Instagram after searching for them , you should be able to find that user's profile by browsing your search history. Once you find the person you're looking for, tap their profile to see if there's a \"Requested\" button at the top. To view your search history: [2] X Research source Tap the magnifying glass at the bottom of the Instagram app. Tap the search bar at the top. Tap See all . This will not work if you've recently cleared your search history . If the person denies your follow request, the button will change back to \"Follow.\" So, you'll only be able to tell if you've requested somebody if they haven't denied your follow request."
    },
    {
      "title": "See which people you follow haven't followed you back.",
      "content": "See which people you follow haven't followed you back. If you sent a follow request to somebody who already follows you but hasn't followed you back, you'll see a \"Requested\" button next to their username on your friends list. On your Instagram profile, tap your number of followers, then tap Accounts You Don't Follow Back . If a private account hasn't accepted your follow request on this list, you'll see \"Requested\" next to their name."
    }
  ]
}