{
  "url": "https://www.wikihow.com/What-Is-Saffiano-Leather",
  "title": "What is Saffiano Leather? Quality, Origins, & Care",
  "steps": [
    {
      "title": "Saffiano is a durable Italian leather with a cross-hatch finish.",
      "content": "Saffiano is a durable Italian leather with a cross-hatch finish. What makes leather Saffiano isn’t the type of leather, but the finish. Saffiano leather is created by a specialized stamping machine that embosses a distinct cross-hatch finish to the fabric. Any type of leather—vegetable-tanned, Nappa, PVC, etc.—can become Saffiano leather if it has the cross-hatch finish. [1] X Research source While Saffiano leather has historically been associated with high fashion and the wealthy, the price depends on the quality of the leather used. However, even low-cost leathers can be pretty pricey because of the time and effort put into the Saffiano technique. Even though Saffiano generally refers to the cross-hatching method, some may consider leather made from calfskin to be the only “genuine” type of Saffiano leather, as it was the type originally made by Prada."
    },
    {
      "title": "Saffiano leather is coated with wax to make it scratch-resistant.",
      "content": "Saffiano leather is coated with wax to make it scratch-resistant. Rather than being dyed, Saffiano leather is finished with a wax treatment, which makes the leather very durable and scratch-resistant. The wax topcoat also gives the fabric its signature glossy shine and makes it easy to clean and maintain for everyday use. [2] X Research source While Saffiano leather can be dyed in addition to being waxed, dyeing is usually redundant. The cross-hatch finish hides the leather underneath, and color can be added to the resin. Because of its durability, Saffiano leather is used for a number of daily use products, including handbags, wallets, laptop bags, suitcases, and even watch straps."
    },
    {
      "title": "Look for the cross-hatch pattern and an even texture.",
      "content": "Look for the cross-hatch pattern and an even texture. Saffiano leather’s signature cross-hatch pattern is usually machine-pressed into the wax that coats the leather, which creates a distinctive, lightly textured surface. If the pattern appears uneven or doesn’t have a slight depth, it may not be genuine Saffiano. [3] X Research source"
    },
    {
      "title": "Check that the leather feels firm and durable.",
      "content": "Check that the leather feels firm and durable. Authentic Saffiano leather, particularly that made with calfskin, should feel rigid rather than soft. This stiffness allows the leather to hold its shape for many years. If the leather feels supple, it’s probably not genuine calfskin Saffiano. [4] X Research source Keep in mind, many consider Saffiano to be the texture of the leather rather than the type of leather. If you’re not specifically looking for genuine calfskin Saffiano, it’s possible that the leather used can be softer while still having the Saffiano cross-hatching."
    },
    {
      "title": "Note if there’s a waxy sheen.",
      "content": "Note if there’s a waxy sheen. One of the unique characteristics of Saffiano leather is the wax finish that is applied after embossing. The wax coat gives the leather a slight sheen that enhances its durability and water- and scratch-resistance. If the leather isn’t slightly shiny, it might not be true Saffiano. [5] X Research source"
    },
    {
      "title": "Look for straight, even stitching.",
      "content": "Look for straight, even stitching. If you’re looking for a high-quality Saffiano product, look for signs of good craftsmanship, like stitching and hardware. All stitches should be straight and even while the hardware should feel sturdy and substantial. [6] X Research source"
    },
    {
      "title": "Determine if the price matches the quality.",
      "content": "Determine if the price matches the quality. While any leather products can be made with the Saffiano method, if you’re looking for genuine calfskin leather, it won’t be cheap. You’ll likely only find products with this leather in high-end stores, and if the deal seems too good to be true, it probably is. [7] X Research source"
    },
    {
      "title": "Wipe the surface with a damp cloth or microfiber towel.",
      "content": "Wipe the surface with a damp cloth or microfiber towel. Because Saffiano leather has a wax topcoat, most dirt simply slides away, so you won’t have to clean it often. When you do, gently wipe the leather with a damp cloth in a straight motion. You can even use a baby wipe. [8] X Research source Even if it’s generally safe, always test your cleaning method in an inconspicuous area, like a corner, first so the leather doesn’t get ruined."
    },
    {
      "title": "Use a soft-bristle brush to clean the grooves of the leather.",
      "content": "Use a soft-bristle brush to clean the grooves of the leather. Sometimes, dirt may stick to the grooves between the grain of the leather. If a damp cloth or baby wipe doesn’t do the trick, dampen a soft-bristle brush and gently stroke with the grain. Be careful not to scrub too harshly, as you could accidentally remove the leather’s sheen. [9] X Research source"
    },
    {
      "title": "Apply a Saffiano leather cleaner for severe stains.",
      "content": "Apply a Saffiano leather cleaner for severe stains. You may need to use a commercial stain remover on noticeable blemishes, but keep in mind that industrial-strength cleaning products can damage the leather. To avoid this, opt for Saffiano-specific leather cleaner and follow the product’s instructions to apply it safely. [10] X Research source You can also apply a Saffiano leather protection cream to prevent water damage and stains."
    },
    {
      "title": "Stuff Saffiano bags with scrunched-up newspaper to preserve the shape.",
      "content": "Stuff Saffiano bags with scrunched-up newspaper to preserve the shape. If you have a Saffiano purse or tote bag, keep it from creasing or folding in on itself when not in use by stuffing it with newspaper, tissue paper, or clean rags to maintain the shape. [11] X Research source"
    },
    {
      "title": "Store Saffiano leather in a dust bag away from sharp objects.",
      "content": "Store Saffiano leather in a dust bag away from sharp objects. To keep your leather clean, store it in a dust bag in a dry area. Make sure there are no sharp objects that could pierce the leather—while Saffiano is scratch-resistant, it isn’t indestructible. Be mindful when you’re using the product, as well, and keep it away from sharp kitchenware or jagged pieces of steel. [12] X Research source Avoid storing your Saffiano leather in a plastic bag, as this could cause the leather to dry out."
    },
    {
      "title": "Avoid direct sunlight and heat.",
      "content": "Avoid direct sunlight and heat. Saffiano is resistant to many elements and can be used in daily life, but avoid prolonged exposure to sunlight, as this can cause the color to fade. Heat can also damage the leather, so it’s best to store your Saffiano in a cool, dry place away from direct sunlight. [13] X Research source"
    },
    {
      "title": "Saffiano leather is durable, making it perfect for everyday use.",
      "content": "Saffiano leather is durable, making it perfect for everyday use. Because of Saffiano leather’s strong wax coat, it can easily withstand scratches and general wear and tear from daily use. If the leather does get scratched, the cross-hatched pattern makes the scuffs difficult to see. Saffiano leather is always water-resistant (but not waterproof) so it’s also more suitable for outdoor use than other leathers. [14] X Research source Saffiano leather can still be damaged when exposed to a lot of water, so keep it away from heavy rain and never submerge it in water."
    },
    {
      "title": "It’s easy to clean and maintain.",
      "content": "It’s easy to clean and maintain. Because the wax coat prevents most dirt from sticking to the leather, you won’t have to clean your Saffiano products very often. When you do, you’ll simply wipe it down with a cloth. Unlike other leathers, the surface is easy to clean and doesn’t typically require special preparation or products. [15] X Research source"
    },
    {
      "title": "High-quality Saffiano leather can be costly.",
      "content": "High-quality Saffiano leather can be costly. Even if you’re not looking for genuine calfskin Saffiano leather, most Saffiano products will be fairly expensive due to the labor-intensive manufacturing process. Choosing Saffiano made with low-cost leather can reduce the price a bit, but high-quality Saffiano products will likely be expensive regardless. [16] X Research source"
    },
    {
      "title": "Saffiano often looks synthetic, which some people don’t like.",
      "content": "Saffiano often looks synthetic, which some people don’t like. Saffiano’s cross-hatch pattern and wax topcoat usually make the finish appear shiny and less natural than other leather types. The synthetic appearance counterbalances the earthy appearance of leather, which may not fit your aesthetic tastes. [17] X Research source However, others argue that Saffiano’s glossy coat makes products look especially sleek and glamorous, which is why Saffiano handbags are highly sought-after. Whether the sheen is a pro or a con depends on personal taste."
    },
    {
      "title": "The coating can degrade and peel over time.",
      "content": "The coating can degrade and peel over time. Saffiano leather is extremely sturdy and durable, but even it won’t last forever. Over time, the corners may start to flake and peel. This usually happens after many years of use, but it may occur sooner depending on the quality of the leather used and how well it’s been taken care of. [18] X Research source"
    },
    {
      "title": "The Prada brothers created Saffiano leather in 1913.",
      "content": "The Prada brothers created Saffiano leather in 1913. Mario and Martino Prada ran a high-end leather goods store called Fratelli Prada in Milan, Italy. They sold everything from handbags and accessories to English steamer trunks and quickly gained a positive reputation with European elites. To meet the increasing demand for luxury accessories, the brothers worked with one of Milan’s top tanneries to develop the Saffiano pressing method. [19] X Research source The term “Saffiano” comes from the Italian “Saffianare,” which refers to the cross-hatching process used to make Saffiano leather. The first Saffiano leather handbag was launched and patented in 1913 and was an immediate hit with European royalty and wealthy travelers. The style was so popular that in 1919, Prada became the official supplier to the Italian Royal Family. The brand’s logo still features some elements of the Italian Royal Coat of Arms today."
    },
    {
      "title": "Other brands began using the method when the patent expired.",
      "content": "Other brands began using the method when the patent expired. Patents generally last about 20 years, so other leather brands could begin using the Saffiano cross-hatching method in the 1930s. Today, Prada still uses premium calfskin leather, while competitors often opt for more affordable alternatives like PVC or vegan leather. [20] X Research source These days, it’s more about the look of the pattern than the material or method used to create it."
    }
  ]
}