{
  "url": "https://www.wikihow.com/Start-Your-Car-on-a-Hill-Quickly",
  "title": "How to Start Your Car on a Hill Quickly",
  "steps": [
    {
      "title": "Remember that once you have stopped completely, pull up the emergency brake.",
      "content": "Remember that once you have stopped completely, pull up the emergency brake. [1] X Research source Remove your foot off of the manual brake when you go to press the accelerator to keep your car from rolling backwards until you start moving."
    },
    {
      "title": "Press on the accelerator (and remove your other foot from the clutch) just as you would normally.",
      "content": "Press on the accelerator (and remove your other foot from the clutch) just as you would normally. The car will soon feel like it is wanting to move forward. [2] X Research source"
    },
    {
      "title": "Feel that the car is just about to move forward, keep accelerating slowly while at the same time removing the emergency brake.",
      "content": "Feel that the car is just about to move forward, keep accelerating slowly while at the same time removing the emergency brake. [3] X Research source By removing the brake at the right time, your car will already have the power it needs from the accelerator to move up the hill without the emergency brake needing to be on to keep it from rolling backwards."
    },
    {
      "title": "Press the clutch down just enough to allow the engine to return to normal idle speed.",
      "content": "Press the clutch down just enough to allow the engine to return to normal idle speed."
    },
    {
      "title": "Keep your right toes on the brake pedal, and turn your right foot inward so that your right heel is on the gas.",
      "content": "Keep your right toes on the brake pedal, and turn your right foot inward so that your right heel is on the gas. [4] X Research source By tilting your right foot in this position, you are able to depress the accelerator with your right heel while keeping the brake pedal engaged with your toes."
    },
    {
      "title": "Watch as the light changes, then press on the gas with your right heel and slowly let the clutch out.",
      "content": "Watch as the light changes, then press on the gas with your right heel and slowly let the clutch out. [5] X Research source Shortly after beginning this maneuver, remove your right toes from the brake pedal."
    },
    {
      "title": "The engine will rev, and the vehicle will begin to move forward.",
      "content": "The engine will rev, and the vehicle will begin to move forward. Once you have some forward momentum, move your right foot so that it is in a natural position on the gas pedal. You may need to press the clutch back in momentarily at this point. With some practice, you should be able to work all three pedals with just two feet, reduce engine revs to a minimum, and avoid jerking the clutch."
    },
    {
      "title": "Press both the clutch and the brake pedal.",
      "content": "Press both the clutch and the brake pedal."
    },
    {
      "title": "Do not release the brakes.",
      "content": "Do not release the brakes. Release the clutch slowly halfway until you feel vibrations (namely, until you feel like the car is trying to move forward). Observe the tachometer rev; it goes somewhere below 1000."
    },
    {
      "title": "Hold the clutch in the same position.",
      "content": "Hold the clutch in the same position. Release the brake pedal (the car does not move anywhere)."
    },
    {
      "title": "Press the accelerator pedal.",
      "content": "Press the accelerator pedal. Release the clutch gradually and you'll be off."
    }
  ]
}