{
  "url": "https://www.wikihow.com/Use-VLC-to-Stream-Audio-and-Video-to-Multiple-Computers-on-Your-Network-Using-Multicast",
  "title": "Streaming to Multiple Computers on Your Network with Multicast on VLC",
  "steps": [
    {
      "title": "Install VLC media player with full features.",
      "content": "Install VLC media player with full features. When installation is complete, open the program."
    },
    {
      "title": "In the Menu bar, click “Media” and “Open Network Stream”.",
      "content": "In the Menu bar, click “Media” and “Open Network Stream”."
    },
    {
      "title": "In the Open Media windows, click on “File”.",
      "content": "In the Open Media windows, click on “File”."
    },
    {
      "title": "Click \"Add\" and select the file you want to stream.",
      "content": "Click \"Add\" and select the file you want to stream. Near the bottom of the screen, click the drop arrow next to \"Play\" and select \"Stream.\""
    },
    {
      "title": "Click on \"Next\".",
      "content": "Click on \"Next\"."
    },
    {
      "title": "In the Destinations box, click on the drop menu and chose “HTTP.”",
      "content": "In the Destinations box, click on the drop menu and chose “HTTP.” Click on “Add\"."
    },
    {
      "title": "In the stream output window, make sure port number is 8080.",
      "content": "In the stream output window, make sure port number is 8080. Check that no other software uses the port 8080."
    },
    {
      "title": "Click \"Stream\".",
      "content": "Click \"Stream\"."
    },
    {
      "title": "VLC Steaming is ready now.",
      "content": "VLC Steaming is ready now."
    },
    {
      "title": "Open VLC media player, click on \"Media,\" and select \"Open Network Stream\".",
      "content": "Open VLC media player, click on \"Media,\" and select \"Open Network Stream\"."
    },
    {
      "title": "In the \"Network\" tab, enter the IP address of the media server, as well as the port number.",
      "content": "In the \"Network\" tab, enter the IP address of the media server, as well as the port number. Click \"Play.\""
    },
    {
      "title": "VLC steaming is ready now.",
      "content": "VLC steaming is ready now."
    },
    {
      "title": "On the streaming vlc server:",
      "content": "On the streaming vlc server: Do not check the \"display locally\" box. It will stay silent, you will not hear anything, however, the stream is sent out."
    },
    {
      "title": "On the listening VLCs:",
      "content": "On the listening VLCs: Tighten the buffering/caching: Start with a 20ms caching and increment by 10 until the stream is free of cutting out. In the startup phase it will always cut out a lot, but the stream will stabilize after about 5 to 10 seconds and be smooth."
    },
    {
      "title": "To listen on your sending computer:",
      "content": "To listen on your sending computer: Open a second vlc client and listen to the stream as you do on all the others, same caching/buffering values."
    },
    {
      "title": "Note that all caching values seem to need to be the same.",
      "content": "Note that all caching values seem to need to be the same."
    }
  ]
}