{
  "url": "https://www.wikihow.com/Wdyll-Meaning",
  "title": "What Does WDYLL Mean? Snapchat, TikTok, and More",
  "steps": [
    {
      "title": "\"WDYLL\" is an acronym for \"What Do You Look Like.\"",
      "content": "\"WDYLL\" is an acronym for \"What Do You Look Like.\" Before Instagram and Snapchat, users didn't regularly post pictures of themselves online. Often, they hid behind an avatar version of themselves, which is how \"wydll\" emerged as a way to ask someone about their appearance. However, it's still used on imaged-focused platforms to gauge someone's visual appeal. [1] X Research source You may see \"wdyll\" appear on popular dating apps or websites, like Tinder, Bumble, or even WhatsApp. Alternatively, a less common use for WDYLL is \"What Do You Like/Love.\" This helps users learn more in-depth information about someone's interests or hobbies. [2] X Research source"
    },
    {
      "title": "Use \"WDYLL\" when you're curious about someone's appearance.",
      "content": "Use \"WDYLL\" when you're curious about someone's appearance. Have you ever met someone online, struck up a really good conversation, and couldn't help but wonder what the person looked like? Once you two have built a good rapport, send a quick \"Wdyll?\" message to ask if they'd be willing to describe their appearance. [3] X Research source It's important to remember that not everyone will be comfortable detailing their appearance to someone they've just met on the internet, and that's okay. It's best to ask after you've sent each other a few messages so you're both comfortable with one another. \"I really enjoy talking to you, and I was wondering…wdyll?\" \"Omg, you're SO sweet. Wdyll?? I'm dying to know!\""
    },
    {
      "title": "Describe yourself in as little or as much detail as you'd like.",
      "content": "Describe yourself in as little or as much detail as you'd like. If you've met someone online—platonically or romantically—respond to a \"Wdyll\" message with as much or as little detail as you feel comfortable giving. You could say how tall you are, what color your eyes are, and how long or short your hair is. For example, you could say, \"I have shoulder-length blonde hair, brown eyes, and freckles. I love wearing bright-colored clothes, and I just got my third ear piercing today.\" If you're flirting with someone online, instead of saying, \"I have long hair and a round figure,\" spice up the language and say, \"I have long, dark, silky hair and a slim but curvy figure.\" If you don't want to give too much information and want to redirect the conversation, you could say, \"I'm 5'4 with short spikey hair, kind of like Ortega from Star Trek! Did you catch last week's episode of Strange New Worlds?\""
    },
    {
      "title": "ASL",
      "content": "ASL ASL stands for “Age, Sex, Location.” It was a popular term from the text-based website Omegle that allows users to anonymously socialize with others in private chat rooms. It was a way for people to know the people they spoke to were of similar ages before conversing. However, it wasn't uncommon for users to lie. [4] X Research source \"What's your asl?\" “23/M/LA. You?\" Another meaning of ASL that's not a slang term is \"American Sign Language.\""
    },
    {
      "title": "Wyd",
      "content": "Wyd Wyd is shorthand for \"What you doing?\" and is used in texting and social media to ask what someone is up to. [5] X Research source It can be used to check in on someone or see if they're not doing anything so you can make plans. \"Wyd later?\" \"Not much. You?\" \"I was thinking about going to the movies. Wanna pull up?\""
    },
    {
      "title": "Qt",
      "content": "Qt Qt is an abbreviated way of telling someone they're a \"cutie.\" This can be used to flirt with someone online. [6] X Research source \"You're such a qt! I can't wait to see you again.\""
    }
  ]
}