{
  "url": "https://www.wikihow.com/Teach-Even-and-Odd-Numbers",
  "title": "How to Teach Even and Odd Numbers",
  "steps": [
    {
      "title": "Count even objects as a class to establish a pattern.",
      "content": "Count even objects as a class to establish a pattern. Start with even numbers. Count the items together by having students pair up the items and count them off by 2s. Ask students if they notice a pattern with the numbers. [1] X Research source If they're having trouble understanding, you can take each pair and divide it, so you have 2 groups of items. Count each group aloud. That way, you show each even number can be divided into 2 equal groups."
    },
    {
      "title": "Ask students about odd numbers, and then prove the concept together.",
      "content": "Ask students about odd numbers, and then prove the concept together. That is, ask students if they can guess what makes a number odd. As students get closer, count items together again, this time in groups of odd numbers. Ask students to pair the items up. [2] X Research source Students will see that there's 1 left over each time with odd numbers. Reinforce this information by saying it aloud for them."
    },
    {
      "title": "Teach students to look for the ones' place to decipher larger numbers.",
      "content": "Teach students to look for the ones' place to decipher larger numbers. Write large even numbers on the board in a column so all the ones places line up. Do the same for odd numbers in a separate column. Underline the ones place in all the numbers. [3] X Research source Tell students to look for the ones column to decide if the number is odd or even. Go down the columns and ask students to tell you whether the numbers are odd or even and why."
    },
    {
      "title": "Use the characters \"Even Steven\" and \"Odd Todd.\"",
      "content": "Use the characters \"Even Steven\" and \"Odd Todd.\" Create a visual for each character you can put on the floor. You can use half a poster board or an 18 by 24 in (46 by 61 cm) piece of construction paper for each character. The characters should have hands large enough that students can put items in each hand. You can make them slightly larger than your hands, for instance. [4] X Research source Tell students a story about the characters to get their brains going. For instance, you can say that Even Steven loves things to be equal and always wants the same amount in each hand. Odd Todd prefers to not have the same amount in each hand. Have several plates of items, such as candy or flat glass marbles. Count out the items together, and ask students which character the plate would belong to. Once you've decided, have a student count out the items again, placing them in the character's hands. Have the child alternate between the 2 hands of the chosen character as they count. Then, count each hand to see if they're the same or not to decide if they guessed right."
    },
    {
      "title": "Have students pair up cubes or other small objects on their own.",
      "content": "Have students pair up cubes or other small objects on their own. Let each student grab a handful of the cubes. At their desk, each student should pair up their cubes and then count up how many they have. [5] X Research source Ask the students who has 1 cube leftover. When a student raises their hand, ask how many cubes they have altogether. Write those numbers on the board, such as \"15,\" \"19,\" \"23,\" and \"11.\" Write \"odd\" above them. Explain it's because they have 1 leftover. Ask for totals from the students who don't have any leftover. Write the numbers on the board, such as \"16,\" \"22,\" \"8,\" and \"12.\" Write even above them because they divide out evenly."
    },
    {
      "title": "Play a heads-down game of identifying odd and even.",
      "content": "Play a heads-down game of identifying odd and even. Have the students put their heads down on their desk. Give them a number, starting with something small. Have students raise their hands for odd numbers or put their hands on their heads if they think it's even. [6] X Research source This game is more to see how much students are comprehending, rather than to correct mistakes. After the game, you can go over the concept again. Keep getting bigger with the numbers to see if students have caught on to larger odd-even numbers."
    },
    {
      "title": "Try an even-odd mystery game.",
      "content": "Try an even-odd mystery game. Get each student an index card. Write a number on each one, and below it, create the number using dots. In other words, if you write \"8,\" you'll write 8 dots below the number. These are the \"mystery\" numbers. [7] X Research source Have each student take a card. Tell them to pair up the dots, then decide if the number is odd or even. Tell them to write \"odd\" or \"even\" by the number. Once they decide, have them bring the card up to the front and place it in the odd bag or the even bag. Then, ask them to tell the class the number and why they think it's odd or even."
    },
    {
      "title": "Give students a chart of 100 numbers to color in.",
      "content": "Give students a chart of 100 numbers to color in. The chart should have a box for each number from 1 to 100. Have students color the even numbers 1 color and the odd numbers another color. This task can be done in the classroom or at home."
    },
    {
      "title": "Use an even-odd bubble sheet.",
      "content": "Use an even-odd bubble sheet. Create or print a worksheet that has random numbers in bubbles down the page. Ask the students to color the odd bubbles 1 color and the even bubbles another color. [8] X Research source You can also ask students to do this task at home."
    },
    {
      "title": "Create or print an even-odd maze.",
      "content": "Create or print an even-odd maze. At the top of the page, place a character who needs to get to the bottom. The page should consist of a chart of numbers. Most of the numbers should be even except for the pathway the character will need to take to the bottom, which should be odd numbers. [9] X Research source Have the students trace the odd numbers with a pen or marker, creating a path through the number maze."
    }
  ]
}