{
  "url": "https://www.wikihow.com/Use-a-Ouija-Board",
  "title": "How to Play a Ouija Board So You Can Talk to Spirits (Ghost Not Included)",
  "steps": [
    {
      "title": "Pick a quiet place to hold your séance.",
      "content": "Pick a quiet place to hold your séance. You’ll be able to focus better in a chill environment, like your bedroom or a quiet park. If you’re inside, turn off all distractions, like the TV, so you’ll be able to concentrate on the spirit world. Additionally, silence your phones—you can check in with the living later. Some people warn that you shouldn’t use a Ouija board at your own house. There’s no reason to worry, though. We’ll make sure you don’t get haunted."
    },
    {
      "title": "Cleanse your space to remove negative energy.",
      "content": "Cleanse your space to remove negative energy. You can protect yourself from negative spirits by doing a simple cleansing before you start. To do a smoke cleansing , light the end of a sage bundle and waft the smoke around your space. You might even say, “I cleanse this space of all negativity.” [1] X Research source If you don’t have sage, use some salt water to cleanse your space. Mix some table or sea salt into fresh water. Then, pray or meditate over it. Next, spray or sprinkle the water around the room while saying, “With salt and water, I cleanse all negativity.”"
    },
    {
      "title": "Place your Ouija board on a table.",
      "content": "Place your Ouija board on a table. Technically, you can use a Ouija board pretty much anywhere. At the same time, you’ll be most comfortable sitting around a table. Just make sure the table is totally flat because you don’t want the planchette sliding down an incline. Your planchette is the pointer that slides around the Ouija board. Alternative: Try balancing the board on your legs instead. Traditionally, 2 players would sit opposite each other with their knees touching. Then, you balance the Ouija board on your legs. [2] X Research source"
    },
    {
      "title": "Light some candles to create ambience.",
      "content": "Light some candles to create ambience. Why not go full spooky? Create an Insta-worthy séance by setting a few candles around the board. Some candles even have special qualities that could help you as you connect with the spirits. Black candles are good for protection. White candles attract positive energy and repel negative energy. Blue candles are great for communication. Purple candles can enhance psychic powers."
    },
    {
      "title": "Burn some incense to set the mood.",
      "content": "Burn some incense to set the mood. You don’t need incense to contact the spirit world, but it definitely creates a vibe. If you have some on hand, go ahead and light a stick to add to the experience. The scent might even help you attract a friendly ghost. [3] X Research source Frankincense incense is a great scent for doing a séance. You could burn sage incense to keep the good vibes coming."
    },
    {
      "title": "Turn off the lights if you’re feeling brave.",
      "content": "Turn off the lights if you’re feeling brave. Sure, you can talk to spirits with the lights on. But it might be more fun to do it in the dark, amirite? If you want the full spooky experience, plunge the room into darkness. Just make sure your candles give off enough light for you to see your Ouija board."
    },
    {
      "title": "Invite at least 1 friend to join you.",
      "content": "Invite at least 1 friend to join you. According to the rules of Ouija, you need more than 1 person to use the board. Ask people who believe in the spirit world, or who are at least open minded. You don’t want a skeptic scaring away all the ghosts. Some traditions recommend playing Ouija with just 2 people, often a male and a female. But there’s more than 1 way to use a spirit board, so don’t stress about it."
    },
    {
      "title": "Ask someone to take notes if you have more than 2 people.",
      "content": "Ask someone to take notes if you have more than 2 people. Your new spirit friend is going to be spelling out answers, and it might be hard to keep up. It’s easier to decipher answers if you have someone there to write down the letters. Since you can’t take your fingers off the planchette while it’s moving, have your notetaker just watch. You could always take turns being the notetaker so everyone gets a chance to touch the planchette."
    },
    {
      "title": "Sit in a circle around the board.",
      "content": "Sit in a circle around the board. When you’re using a Ouija board, you’re basically doing a séance. During a séance, it’s tradition to sit in a circle, so spread out. [4] X Research source Make sure everyone has space to touch the planchette. With 2 players, just sit across from each other because that’ll form a tiny circle."
    },
    {
      "title": "Place your index and middle fingers on the planchette.",
      "content": "Place your index and middle fingers on the planchette. Put the fingers on both of your hands on the planchette. Lightly touch it so that you aren’t accidentally moving it. Then, position your planchette over the \"G\" on your Ouija board to get started. Don’t overlap your fingers because that could put too much pressure on your planchette. If you have a bunch of players, you might have to take turns."
    },
    {
      "title": "Pick a medium to lead the session.",
      "content": "Pick a medium to lead the session. Your medium will start and end your session, and they’ll lead the questioning. If any of you are “sensitive” to spirits, ask them to be medium. Otherwise, choose whoever feels the most comfortable taking the lead. Anyone can use a Ouija board, so don’t worry if none of you feel psychically gifted. You’ll still be able to talk to spirits through the board."
    },
    {
      "title": "Welcome positive spirits into the space.",
      "content": "Welcome positive spirits into the space. It’s time to meet some ghosts! To protect yourselves, state out loud that you’re only open to positive energy. That way, you’re more likely to encounter a friendly spirit. “We call upon the spirit world and welcome any kind spirits to talk with us.” “Spirits, we call to you. If you’re good, come and speak to us.” “Our circle invites positive spirits to use our Ouija board to communicate.”"
    },
    {
      "title": "Ask if there’s a spirit with you.",
      "content": "Ask if there’s a spirit with you. The easiest way to make contact is to just ask if anyone is there. If there’s a ghost nearby, they might decide to chat. Hopefully, your planchette will move to “yes.” “Is there anyone here now?” “Are there any ghosts that want to speak to us?”"
    },
    {
      "title": "Wait for an answer, which could take a little time.",
      "content": "Wait for an answer, which could take a little time. Go ahead and repeat the question a few times if the planchette doesn’t start moving after a minute or so. If it’s taking a while, you might move the planchette once in a clockwise circle to get it going. Some people think it’s not necessary to “warm up” your planchette. Just do what feels right for you."
    },
    {
      "title": "Start with an easy “yes” or “no” question.",
      "content": "Start with an easy “yes” or “no” question. Some spirits are stronger than others, and you don’t know who you might get. A weak spirit may not be able to spell out long responses, so stick with easy questions at first. Later on, you can ask open-ended questions and see if your spirit can spell out words. Can you hear us? Did you live in this house? Can you see us?"
    },
    {
      "title": "Watch the planchette spell out an answer.",
      "content": "Watch the planchette spell out an answer. When a spirit answers you, they’ll slide the planchette to point at different letters. Call out each letter to help you keep track of what the ghost is spelling. The planchette could move quickly or slowly—there’s no wrong way. None of the players should be moving the planchette. That’s for the spirit to do! If your board has a sun and moon, the sun traditionally represents “light” spirits and the moon represents “dark” spirits. If a spirit says they’re bad, just say “goodbye” and try again later. You don’t need to worry about the spirit hanging around after you close the session."
    },
    {
      "title": "Keep asking questions until the spirit stops talking—or you get scared.",
      "content": "Keep asking questions until the spirit stops talking—or you get scared. Your Ouija board séance can be as long or as short as you like. As long as the spirits keep talking, continue asking questions. At the same time, it’s best to call it quits if anyone in your group feels nervous or spooked. Ask questions like: What’s your name? How old are you? When did you live? What did you like to do when you were alive? What do you want to tell us?"
    },
    {
      "title": "Be skeptical about what the board tells you.",
      "content": "Be skeptical about what the board tells you. Ouija boards are super fun, but they’re not always accurate. Spirits aren’t able to see into the future, and they’re not aware of everything that’s happening everywhere. Your spirit guest isn’t going to know who you’re going to marry or when your bestie is going to die. Since ghosts can lie, take everything it says with a grain of salt. Since spirits are just like people, you might get a rude or cheeky response. It’s best to just ignore this type of behavior. You could always ask to talk to someone else. Just have fun! Playing a Ouija board should be a fun bonding experience. Don’t let a silly ghost ruin it."
    },
    {
      "title": "Thank the spirit for talking to you.",
      "content": "Thank the spirit for talking to you. It’s super nice that your new spectral friend made an appearance at your séance. Ghosts don’t have to talk to us, so it’s kind to offer them a little appreciation. Say a quick “thank you” so the spirit knows you appreciate that they used their ghostly energy to communicate with you. “Thank you for talking to us today.” “Thank you so much for your responses.” “We really appreciate you for answering.”"
    },
    {
      "title": "Say “Goodbye” to end the session.",
      "content": "Say “Goodbye” to end the session. Don’t “ghost” your new spirit pal. If you just leave, they might feel slighted. Plus, some people believe that the ghost can linger around. Have your medium state out loud that you’re ending the session. Then, say a friendly “goodbye” to the spirit and move the planchette so that it’s hovering over “goodbye” on the board. “We’re all finished today. Goodbye.” “Our séance is finished. Goodbye.”"
    },
    {
      "title": "Put your board away—until next time.",
      "content": "Put your board away—until next time. Congrats on a great Ouija sesh! Once you’re done, pack up your board and planchette so the ghosts know you’re totally finished using it. Ideally, put your planchette in a pouch or turn it upside down so that a spirit doesn’t try to use the board while you’re away."
    }
  ]
}