{
  "url": "https://www.wikihow.com/Use-the-Alt-Button",
  "title": "How to Use the Alt Button",
  "steps": [
    {
      "title": "Using just the Alt key, see for yourself how it switches between the above Task Bar and your internet browser's current page.",
      "content": "Using just the Alt key, see for yourself how it switches between the above Task Bar and your internet browser's current page."
    },
    {
      "title": "Open Mozilla Firefox or Internet Explorer",
      "content": "Open Mozilla Firefox or Internet Explorer Now press the Alt Key and notice how \"File\" has been selected. You can now use the arrow keys on your keyboard to maneuver through the task menu instead of a mouse. Pressing enter with select the highlighted option."
    },
    {
      "title": "Press the Alt key again, and keyboard control will return to the web page (allowing you to scroll with the arrow keys, for example).",
      "content": "Press the Alt key again, and keyboard control will return to the web page (allowing you to scroll with the arrow keys, for example)."
    },
    {
      "title": "Used in combination with other keys, the alt key can type characters not available on the keyboard, or alter the functionality of another key.",
      "content": "Used in combination with other keys, the alt key can type characters not available on the keyboard, or alter the functionality of another key. Hold down Alt, type 12 on the Number Pad (make sure number lock is OFF), and let go of Alt. In most text input boxes this will generate the female symbol. Alt + 11 generates the male symbol. Alt + 13 generates a musical note. Experiment with different numbers and see what you come up with, or use the Character Map (Windows OS) to check what the alt code for a certain character is."
    },
    {
      "title": "Other commonly used combinations that include the alt key:",
      "content": "Other commonly used combinations that include the alt key: Alt + Tab (shuffles between windows that are on your \"Start Bar\"), Alt + Left Arrow (goes to the last internet page you visited), Alt + Home Key (Returns to your home page)."
    }
  ]
}