{
  "url": "https://www.wikihow.com/Unfriend-Someone-on-Facebook-Without-Actually-Unfriending-Them",
  "title": "How to Unfriend Someone on Facebook Without Actually Unfriending Them",
  "steps": [
    {
      "title": "Open your Facebook page.",
      "content": "Open your Facebook page. The easiest way to get rid of an annoying friend's posts in your News Feed is to go to their profile and \"unfollow\" them; this feature is similar to \"muting\" an account on Twitter. If you aren't logged in, you'll first need to enter your Facebook email and password."
    },
    {
      "title": "Type your friend's name into the search bar.",
      "content": "Type your friend's name into the search bar. This is at the top of Facebook's page. If they have a recent post in your News Feed, you can also click on their name there; doing so will take you to their account page."
    },
    {
      "title": "Click the \"Following\" option at the top of their page.",
      "content": "Click the \"Following\" option at the top of their page. This should be to the right of their name. On mobile, this will be below their name and profile picture."
    },
    {
      "title": "Click or tap the \"Unfollow\" option in the resulting menu.",
      "content": "Click or tap the \"Unfollow\" option in the resulting menu. This will remove their posts from your News Feed and you will see less of them on Facebook ; however, you will remain friends on Facebook! You may have to refresh your News Feed for their posts to disappear."
    },
    {
      "title": "Open your Facebook page.",
      "content": "Open your Facebook page. Perhaps you have several dozen friends who constantly talk politics; whatever your rationale is, you can mass-unfollow friends from the Facebook menu. If you aren't logged in, you'll need to enter your login email and password."
    },
    {
      "title": "Click the menu button.",
      "content": "Click the menu button. The menu button is the downward-facing arrow in the top right corner of your screen; clicking this will prompt a drop-down menu with links to general Facebook settings. [1] X Research source"
    },
    {
      "title": "Click \"News Feed Preferences\".",
      "content": "Click \"News Feed Preferences\". This will open a small menu with settings regarding your News Feed."
    },
    {
      "title": "Click \"Unfollow people to hide their posts\".",
      "content": "Click \"Unfollow people to hide their posts\". This will take you to a list of all your Facebook friends."
    },
    {
      "title": "Click each friend you wish to unfollow.",
      "content": "Click each friend you wish to unfollow. Note that Facebook will not ask you for confirmation before unfollowing each clicked friend. Click \"Done\" when you're finished. You will no longer see posts from these friends!"
    },
    {
      "title": "Return to your News Feed.",
      "content": "Return to your News Feed. You may need to refresh your page before these changes take place."
    },
    {
      "title": "Tap your Facebook app to open Facebook.",
      "content": "Tap your Facebook app to open Facebook. You can unfriend multiple people on mobile from within the Facebook menu. If you aren't currently logged into Facebook, you'll need to enter your email address and password."
    },
    {
      "title": "Tap the Facebook menu icon.",
      "content": "Tap the Facebook menu icon. This is the stack of horizontal lines in the bottom right corner of your screen. Doing so will open the Facebook menu."
    },
    {
      "title": "Tap the \"Settings\" option.",
      "content": "Tap the \"Settings\" option. This will open your Facebook settings menu."
    },
    {
      "title": "Tap \"News Feed Preferences\".",
      "content": "Tap \"News Feed Preferences\". This will bring up a few options for editing your News Feed's appearance."
    },
    {
      "title": "Tap \"Unfollow people to hide their posts\".",
      "content": "Tap \"Unfollow people to hide their posts\". This will open a menu with a mass list of all of your Facebook friends."
    },
    {
      "title": "Unfollow as many friends as you like.",
      "content": "Unfollow as many friends as you like. You can do this by tapping each friend you wish to unfollow; Facebook will not ask for confirmation before unfollowing any tapped friends."
    },
    {
      "title": "Tap \"Done\" when you're finished.",
      "content": "Tap \"Done\" when you're finished. You shouldn't see posts from these friends anymore! You may have to close your Facebook app and re-open it for these changes to take place."
    },
    {
      "title": "Open your Facebook page.",
      "content": "Open your Facebook page. The \"Acquaintances\" feature essentially drops the priority level of its occupants' posts to the lowest possible level, meaning you'll likely never see posts from friends in the Acquaintances group. If you aren't logged in, you'll need to do so with your Facebook email and password first."
    },
    {
      "title": "Click your \"Friends\" tab.",
      "content": "Click your \"Friends\" tab. This is on the left side of your Facebook page; clicking it will take you to your friend groups."
    },
    {
      "title": "Click \"Acquaintances\".",
      "content": "Click \"Acquaintances\". This should be toward the top of the page. [2] X Research source"
    },
    {
      "title": "Click the \"Add friends to this list\" field.",
      "content": "Click the \"Add friends to this list\" field. This is in the top right corner of your Acquaintances page; you can type friends' names to add them here."
    },
    {
      "title": "Click a friend's name to add them to \"Acquaintances\".",
      "content": "Click a friend's name to add them to \"Acquaintances\". You can add as many people as you like to this list."
    },
    {
      "title": "Return to the News Feed when you're done.",
      "content": "Return to the News Feed when you're done. You may need to refresh your Facebook page to get rid of Acquaintance posts. When posting a status, you can click the \"Friends\" option next to the \"Post\" button and select \"Friends except acquaintances\" to exclude your low-priority friends from viewing your status. You may have to click \"More Options\" at the bottom of the menu to view this option."
    },
    {
      "title": "Open Facebook.",
      "content": "Open Facebook . If you don't want to block your friend, you can prevent them from seeing specific posts by editing the \"Who should see this?\" settings in your status field. For mobile, tap the \"Facebook\" app to open Facebook."
    },
    {
      "title": "Navigate to the status creation field.",
      "content": "Navigate to the status creation field. You'll find the status creation field at the top of your screen; it usually says something like \"What's on your mind?\". On mobile, you'll need to tap the status creation field to view its options."
    },
    {
      "title": "Click the \"Friends\" button below the status creation field.",
      "content": "Click the \"Friends\" button below the status creation field. This will prompt a drop-down menu with options regarding who can see your status. The \"Friends\" option is below your name in the top left corner if you're on mobile."
    },
    {
      "title": "Click \"More Options\", then click \"Custom\".",
      "content": "Click \"More Options\", then click \"Custom\". The \"Custom\" option can be used to filter out friends you don't want reading your statuses. On mobile, tap \"Friends except\" here. If you're making a post in which you tag a user, consider unchecking the box next to \"Friends of Tagged\" to prevent your friend's friends from being able to see your post."
    },
    {
      "title": "Type the name of the friend you wish to exclude.",
      "content": "Type the name of the friend you wish to exclude. You'll need to do this in the field beneath the \"Don't share with\" text; you can add as many people to this list as you please. On mobile, simply tap the circle to the left of each friend you wish to exclude from your status."
    },
    {
      "title": "Click \"Save Changes\" when you're done.",
      "content": "Click \"Save Changes\" when you're done. This will reset your default sharing option to \"Custom\"; you can change it back to \"Friends\" at any time from within the same menu. For mobile, tap \"Done\" in the top right corner to save these changes."
    }
  ]
}