{
  "url": "https://www.wikihow.com/Store-Ginger",
  "title": "How to Store Ginger Root to Keep it Fresh and Flavorful",
  "steps": [
    {
      "title": "Whole and peeled ginger",
      "content": "Whole and peeled ginger Place the ginger in a sealable plastic bag, taking care to push all of the air out of the bag. Then, stash it in the crisper drawer of your refrigerator for around 3 weeks to keep it fresh. [1] X Research source If you’ve peeled your ginger, dab the extra moisture off the peeled ginger root with a clean paper towel before sticking it in a sealable plastic bag in your refrigerator’s crisper drawer. [2] X Research source"
    },
    {
      "title": "Minced ginger",
      "content": "Minced ginger Transfer your minced ginger into a clean glass jar. Replace the lid, tighten it for a good seal, and aim to use the minced ginger within a week. [3] X Research source"
    },
    {
      "title": "Whole ginger",
      "content": "Whole ginger Peel the skin off the entire ginger knob, and then cover it tightly with plastic wrap. [4] X Research source Stash the frozen ginger in the freezer for around 3 months, removing chunks as-needed for your future recipes. [5] X Research source Did You Know? Frozen ginger doesn’t require any thawing time. Just remove it from the freezer and grate it into your recipes! [6] X Research source"
    },
    {
      "title": "Sliced ginger",
      "content": "Sliced ginger Cut your ginger root into thin chunks—no peeling is required. Slide a piece of parchment paper onto a cookie sheet and arrange the chunks of ginger on top. Let the slices freeze for 1 night before transferring them into a freezer bag or freezer-safe container. [7] X Research source Stash the frozen ginger in the freezer for around 3 months, removing chunks as-needed for your future recipes. Freezing sliced ginger is a good option if you’d rather mince your ginger later on."
    },
    {
      "title": "Minced ginger",
      "content": "Minced ginger Peel the skin off your ginger and then mince or grate it into a fine consistency (a microplane works well for this). Then, scoop 1 tsp (4.9 mL) portions of the minced/grated ginger onto a parchment-lined baking sheet and stick them in the freezer until they’re totally frozen. Transfer the minced ginger chunks to a freezer-safe bag and keep them in your freezer for up to 6 months. [8] X Research source It’s also possible to freeze your small minced ginger portions in an ice-cube tray. Once the cubes are completely frozen, store them in a freezer-safe bag in your freezer. [9] X Research source"
    },
    {
      "title": "Puréed ginger",
      "content": "Puréed ginger Slice the unpeeled ginger into smaller slices, working into the opposite side of the grain as you cut. Then, transfer these chunks to a blender and purée until they’re a smooth mixture. Pour the puréed ginger into a freezer-safe bag, seal the top securely, and then flatten the mixture so it fills the entire bag. [10] X Research source Try to use up your frozen ginger within a few months. Whenever you need some, simply break off a piece to use in your desired recipe."
    },
    {
      "title": "Peel, cut, and season 2 ginger roots with salt.",
      "content": "Peel, cut, and season 2 ginger roots with salt. Aim to make moderately sized chunks rather than finely chopping the ginger up. Sprinkle 1 tsp (7 g) of salt over the ginger chunks and transfer them into a bowl. [11] X Research source"
    },
    {
      "title": "Transfer the ginger pieces to a jar after 30 minutes.",
      "content": "Transfer the ginger pieces to a jar after 30 minutes. Remove the chunks from the bowl and move them into a clean mason jar. [12] X Research source"
    },
    {
      "title": "Boil a mixture of rice vinegar and sugar and pour it into the jar.",
      "content": "Boil a mixture of rice vinegar and sugar and pour it into the jar. In a saucepan, mix 1 c (240 mL) of rice vinegar together with 5-7 tbsp (63-88 g) of white sugar. Wait for the mixture to reach a boil, and then transfer it into the jar on top of the sliced and salted ginger pieces."
    },
    {
      "title": "Seal the jar and let it pickle for 1 week.",
      "content": "Seal the jar and let it pickle for 1 week. Wait for the jar to cool completely before fastening the lid and stashing the jar in your refrigerator. Ideally, give the mixture a week to work its magic—once the ginger has a pinkish tint, it’s ready to slice up and enjoy. [13] X Research source Pickled ginger lasts for about 1 month in the refrigerator."
    },
    {
      "title": "Alternatively, pickle ginger without vinegar using lacto-fermentation.",
      "content": "Alternatively, pickle ginger without vinegar using lacto-fermentation. Herbal medicine expert Julie Brow-Polanco suggests peeling and slicing fresh ginger into thin slices and pounding it lightly to release some of the juices. Then, “pack it down into a quart-sized mason jar, leaving at least 1 in (2.5 cm) of headspace at the top. Make a brine with 1 c (240 mL) of filtered water and 2 tbsp (28 g) of sea salt and pour it into the mason jar, still leaving 1 in (2.5 cm) of headspace. Seal the jar and store it in a dark, room-temperature space for about 3 days before enjoying the ginger.\" According to Brow-Polanco, “lacto-fermented means that you don’t use vinegar, but instead use Lactobacillus bacteria to essentially pickle the ginger.” She goes on to explain that “just a small amount with meals is plenty.”"
    }
  ]
}