{
  "url": "https://www.wikihow.com/Track-Your-Uber-History",
  "title": "2 Easy Ways to Track Your Uber History",
  "steps": [
    {
      "title": "Open the Uber app.",
      "content": "Open the Uber app. Tap to open the app. Its icon is the word Uber in white text against a black background."
    },
    {
      "title": "Tap Activity.",
      "content": "Tap Activity . It is one of the options along the bottom of your screen, represented by an image of a receipt. This will open a page of your full Uber history, including Uber Eats purchases. Each entry will display the date and time, as well as the cost. Uber rideshare activity will display your drop-off location, while Uber Eats orders will display the restaurant name."
    },
    {
      "title": "Tap a trip to view details.",
      "content": "Tap a trip to view details. You'll be able to see the map of the trip, the date, time, cost, driver name, pickup and drop-off locations, as well as the tip and the rating you gave (if applicable). Select View what your driver sees to review the security Uber has in place to protect your information."
    },
    {
      "title": "Tap Receipt to view the fare breakdown.",
      "content": "Tap Receipt to view the fare breakdown. You'll see all of the different fares and fees that made up your total cost. Tap on a blue question mark icon to learn more about that fee. The account/card that was charged will be displayed at the bottom. [1] X Research source The bottom of your screen includes a few additional options: Download PDF Resend email Review my fees and fares"
    },
    {
      "title": "Use the \"Help\" section to file a report.",
      "content": "Use the \"Help\" section to file a report. There are a variety of different reports you can file if you have a problem or issue with the trip. Tap the option that most fits your problem: Find lost item Report safety issue If you require immediate attention, use the \"Safety incident reporting line\" listed in blue text at the very bottom of the screen. Provide driver feedback Get ride help"
    },
    {
      "title": "Visit the Uber Riders website and log in.",
      "content": "Visit the Uber Riders website and log in. Open a web browser on your computer and navigate to riders.uber.com . Use your credentials to log in, or sign in with Facebook or Google. Be sure not to visit the default Uber site, which will redirect you to the webpage for drivers."
    },
    {
      "title": "Hover your mouse over your profile icon and click My Trips.",
      "content": "Hover your mouse over your profile icon and click My Trips . You'll see a list of your previous trips sorted by date. This main page includes the date and time of each trip, the type of ride taken, as well as the pickup and drop-off points. Unlike the Uber app, the website will only show your rideshare activity. You will not see any Uber Eats activity. You may limit your search to the past month or two, or use the arrows to click through your full history of Uber activity."
    },
    {
      "title": "Click a trip in your history to expand the details.",
      "content": "Click a trip in your history to expand the details. You'll see a map as well as additional information including mileage, duration, cost, payment method, and your driver's name."
    },
    {
      "title": "Click the View Receipt.",
      "content": "Click the View Receipt . This will open a full fare breakdown. Click on any of the blue question mark icons to learn more about that fee. From this pop-up, you may also select a few additional options: Print Download PDF Resend by Email Get Help"
    },
    {
      "title": "Click Resend Receipt to receive another receipt.",
      "content": "Click Resend Receipt to receive another receipt. It will be sent to your email account. You can also access this option, among others, by selecting View Receipt in the previous step."
    },
    {
      "title": "Click Find Lost Item to try to retrieve a lost item.",
      "content": "Click Find Lost Item to try to retrieve a lost item. This will start the process of contacting your driver to arrange a meeting. Uber does not oversee the return of lost items. This option will only be available for recent rides on the website, whereas it is always available on the mobile app."
    }
  ]
}