{
  "url": "https://www.wikihow.com/Treat-a-Burn-from-an-Oven",
  "title": "How to Treat a Burn from an Oven",
  "steps": [
    {
      "title": "Treat the burn if its first- or second-degree.",
      "content": "Treat the burn if its first- or second-degree. There are three degrees of burns, classified by severity (as in, how deep the burn goes under the skin). First-degree burns are superficial skin burns that are dry, red, and usually do not blister. [1] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source Mild sunburns are examples of first-degree burns, and these can be treated at home. Second-degree burns are more severe than first degree, penetrating past the first layer of skin. These burns are red, blistered, swollen, and usually painful. [2] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source Some second-degree burns can be treated at home—for example, a severe sunburn from a day at the beach. Third-degree burns are much more severe than second degree burns, destroying the first layer of skin and most of the layers underneath. These burns are white and charred. [3] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source Nearly all third-degree burns must be treated by a medical professional."
    },
    {
      "title": "Remove clothing on or around the burn.",
      "content": "Remove clothing on or around the burn. Start by removing any clothing or jewelry on or around the burn carefully. A burn can start to swell immediately, so the faster you treat it, the better. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Run cool water over a first-degree burn for about 10 minutes.",
      "content": "Run cool water over a first-degree burn for about 10 minutes. Make sure the water is cool, not cold! Cool water will help reduce swelling and any pain. If you’re trying to conserve water, dampen a hand towel with cool water and compress the burn for about 10 minutes instead. [5] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source For second-degree burns, keep cooling the burn until the pain and swelling goes down. This may take more than 10 minutes. [6] X Research source"
    },
    {
      "title": "Apply aloe after drying burn.",
      "content": "Apply aloe after drying burn. Use petroleum jelly immediately after patting the burn dry to help heal the top skin layer. [7] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source You can also use aloe vera instead of petroleum jelly, so long as you keep reapplying either until the redness fades. [8] X Research source"
    },
    {
      "title": "Keep your burn out of the sun.",
      "content": "Keep your burn out of the sun. Use a clean adhesive bandage to cover the burn when you go outside. This will prevent more damage to your skin, and help the burn heal faster."
    },
    {
      "title": "Find medical attention immediately for a severe burn.",
      "content": "Find medical attention immediately for a severe burn. If the burn is thick, leathery, or your skin chars white, you most likely have a severe second- or third-degree burn. Make sure to head to the nearest emergency medical facility immediately, or call your local emergency providers. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Seek medical attention if the burn does not fade.",
      "content": "Seek medical attention if the burn does not fade. If you’ve been treating it for two weeks and it doesn’t fade, your burn might be more severe than you originally thought. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Go to the doctor if your burn causes additional symptoms.",
      "content": "Go to the doctor if your burn causes additional symptoms. If you experience symptoms such as increased pain, increased redness, trouble breathing, or the burn begins to ooze, these could be signs that your burn is more severe than a first-degree burn. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}