{
  "url": "https://www.wikihow.com/Use-a-Facial-Scrub",
  "title": "The Ultimate Guide to Using a Face Scrub",
  "steps": [
    {
      "title": "Cleanse your skin with a mild facial cleanser.",
      "content": "Cleanse your skin with a mild facial cleanser. Washing your face before you apply the facial scrub ensures your skin is clean and free from dirt, oil, and other debris. Just wet your face with lukewarm water and gently rub a gentle facial cleanser into your skin. Then, rinse your face with lukewarm water. [1] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If you have makeup on, use makeup remover to clean it off before washing your face. If you have long hair, pull it back into a ponytail or bun so it doesn’t get in your way. Using hot water can dry out or damage your skin, so keep the temperature low."
    },
    {
      "title": "Massage the facial scrub into wet skin for 30 to 45 seconds.",
      "content": "Massage the facial scrub into wet skin for 30 to 45 seconds. Squeeze a dime-sized amount of facial scrub into your hands and rub it between your fingertips. Then, use your fingertips to gently massage the scrub into your face using circular motions. Just use a soft touch and avoid vigorously rubbing or scrubbing it into your skin, as this can cause irritation or damage. [2] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Massage the scrub starting at your chin and then work your way up your face. Concentrate the scrub on your T-zone, which makes up your forehead, nose, and chin. This area gets oilier than other areas and has more clogged pores. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Feel free to massage the scrub into your upper neck and below your chin, too. Applying the facial scrub on dry skin and massaging it in for more than 60 seconds can cause irritation, sensitivity, and damage."
    },
    {
      "title": "Rinse the scrub off with lukewarm water and dry your face.",
      "content": "Rinse the scrub off with lukewarm water and dry your face. Splash your face with lukewarm water to remove the facial scrub. Then, gently pat your face dry with a soft towel. Your face should already feel smoother and softer! [4] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Do not rub your face with the towel, as this can irritate your skin. After using a facial scrub, your skin is more sensitive than normal."
    },
    {
      "title": "Moisturize your skin.",
      "content": "Moisturize your skin. Facial scrubs remove the dead skin cells on your face, which can dry out your skin. Regardless if you have oily, combination, or dry skin, applying a moisturizer locks in hydration to keep your skin supple and soft. Just gently massage your moisturizer of choice into your skin. [5] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Apply any other skincare products on your skin before you put on moisturizer, like toner or serums. Moisturizing is a necessary part of a creating a good skincare routine . Moisturizer hydrates your skin and prevents the overproduction of skin oils to keep your skin healthy. [6] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Do: Use a facial scrub that works with your skin type.",
      "content": "Do: Use a facial scrub that works with your skin type. Facial scrubs contain different physical abrasives and active ingredients that work better for dry, oily, combination, or sensitive skin. Just determine your skin type by feeling and inspecting your face and then choose the best scrub for your skin: [7] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Oily skin : Use a facial scrub formulated for oily or acne prone skin that includes ingredients that reduce excess oil and are non-comedogenic (don’t clog your pores), like salicylic acid. More abrasive ingredients like apricot pits, walnut shells, and almonds also work well. [8] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Dry skin : Choose a dry skin face scrub formula that has lots of nourishing ingredients, like glycerin or hyaluronic acid, and uses gentle, finely ground abrasives. [9] X Research source Sensitive skin : Use mild facial scrubs that include antibacterial and anti-inflammatory ingredients like aloe, witch hazel, and chamomile. [10] X Research source Combination skin : Use face scrubs for either oily or dry skin. Patch test the scrub on your inner arm before you use it on your face, especially if you have sensitive skin, to ensure it doesn’t cause an allergic reaction."
    },
    {
      "title": "Do: Apply facial scrub only once or twice per week.",
      "content": "Do: Apply facial scrub only once or twice per week. It might be tempting to scrub your face every morning to get that soft, glowy look. However, over exfoliating can leave your skin dry, irritated, red, and full of breakouts. For most skin types, only apply the scrub once per week. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you have oily skin, you can increase the frequency to twice per week if your skin looks and feels healthy."
    },
    {
      "title": "Don’t: Scrub active breakouts or other skin problems.",
      "content": "Don’t: Scrub active breakouts or other skin problems. Using a facial scrub on inflamed, sensitive skin can further irritate your condition and potentially worsen the problem. If you’re dealing with an active breakout, rosacea, eczema, warts, herpes, or open wounds, avoid applying product on the area. [12] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If you use a prescription-strength skin medication, like retinol or benzoyl peroxide, talk to your dermatologist about adding a facial scrub to your routine before using it. Mixing products can potentially irritate your skin. If you have a history of skin problems, consult your dermatologist to determine what kind of skin care regime is most appropriate for you."
    },
    {
      "title": "Don’t: Mix physical and chemical exfoliators.",
      "content": "Don’t: Mix physical and chemical exfoliators. If you’re thinking of adding a chemical exfoliator, like alpha hydroxy acid or beta hydroxy acid, to your skincare routine, don’t use it on the same day that you use a facial scrub. This can over exfoliate your skin, leading to dry, red, and irritated skin. [13] X Research source Chemical exfoliators work similarly to facial scrubs, except they use acids and other active ingredients to break down dead skin cells. Don’t use a face scrub after receiving a face treatment, like a facial, either. Your skin is sensitive after a treatment, so exfoliating can irritate your skin."
    },
    {
      "title": "Do: Read and follow the instructions for using the facial scrub.",
      "content": "Do: Read and follow the instructions for using the facial scrub. To use your facial scrub safely, pay particular attention to product warnings, expiration dates, possible allergens, or adverse interactions with other facial products. Most scrubs also include information about how often to apply the product. Look at how the facial scrub should be stored, too. Some scrubs store best in the shower, while others need to be kept in a cool, dry place."
    },
    {
      "title": "Removes dead skin cells and brightens your skin.",
      "content": "Removes dead skin cells and brightens your skin. Your skin tends to look dull, dry, and splotchy when dead skin cells accumulate on your face. Physical exfoliators, like facial scrubs, remove dead skin cells to reveal the shiny, new skin cells underneath. This gives you a brighter and more luminous complexion. [14] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Unclogs your pores.",
      "content": "Unclogs your pores. Dead skin cells and sebum, the oil your body produces, can get trapped in your pores and cause acne breakouts. [15] X Research source Face scrubs clear away the dead skin cells, as well as the excess sebum, to unclog your pores and help reduce acne. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Helps products absorb better.",
      "content": "Helps products absorb better. Without a barrier of dead skin cells in the way, it's easier for moisturizers, serums, toners, and other products to seep into your skin. This can help your products work better and give your skin a healthy glow. [17] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Smooths and evens skin.",
      "content": "Smooths and evens skin. The outermost layer of your skin typically shows texture and damage from the weather, air quality, and stress. Sloughing off the dead layer of skin helps remove bumps and dark spots to unveil softer, smoother, and more even-toned skin. [18] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This means that facial scrubs can also help lighten and reduce the look of acne scars."
    },
    {
      "title": "Check for signs of smoother, brighter skin in the next few weeks.",
      "content": "Check for signs of smoother, brighter skin in the next few weeks. If the facial scrub works well with your skin, your complexion should look soft, glowy, and more youthful fairly quickly. In which case, congratulations! You’re using the best facial scrub for your skin. [19] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Watch for signs of redness, itching, or rash.",
      "content": "Watch for signs of redness, itching, or rash. Stop using your facial scrub if your skin is irritated or inflamed. Redness, itching, or rash are indications that the scrub is making your skin sensitive or causing an allergic reaction. [20] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Talk to your dermatologist about getting an allergy test to determine what ingredient you might be allergic or sensitive to."
    },
    {
      "title": "Try out different face scrubs to find a product that works for you.",
      "content": "Try out different face scrubs to find a product that works for you. It might take a few tries to find the ideal product for your skin type. Just remember to follow the scrub's instructions and avoid over-exfoliating to ensure you get the best possible results. With time, you’ll find a good match!"
    }
  ]
}