{
  "url": "https://www.wikihow.com/Tell-Coworkers-You%27re-Leaving",
  "title": "How to Tell Coworkers You’re Leaving: Guidelines and Sample Emails",
  "steps": [
    {
      "title": "Formally resign to your boss before talking to your coworkers.",
      "content": "Formally resign to your boss before talking to your coworkers. Schedule a meeting with your manager or supervisor so you can sit down and resign face-to-face. It’s best to give at least 2 weeks' notice, or more if you have a senior position. [1] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Work with your boss to figure out what you can wrap up before you depart and what will need to be reassigned to other employees. You might say, “I’ve loved the opportunity to learn and grow in this position, and at the same time, I’m ready to move on to the next challenge. I’ll be moving on to my next position on May 27th and wanted to give you my notice.” Or, try \"While working for Acme Media has been wonderful, I'm ready for my next adventure. I'm resigning in order to accept a new role, and my last day here will be June 1st.\" If your company has a human resources department, talk to your HR contact next. [2] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Share the news with coworkers about a week before your departure.",
      "content": "Share the news with coworkers about a week before your departure. If you tell people too soon, it could be awkward when you see them around the workplace. Wait until you’re wrapping up your final projects and on your way out before letting everyone know you're leaving. [3] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source On the other hand, don’t wait until your last day to announce that you’re quitting. Give people a little bit of time to get used to your decision, especially if they’ll need to adjust their own workload to accommodate your departure."
    },
    {
      "title": "Tell close colleagues in person.",
      "content": "Tell close colleagues in person. Go out for coffee or lunch so you can chat privately and let your coworkers know that you’re leaving. You can either do this one-on-one or arrange a group get-together. Telling your work friends and the colleagues you work closely with on a daily basis in person shows them that you value the relationship. “I’ve got some news to share. I’ve accepted a position at Morgan & Smith and will be leaving at the end of the month. I’ve enjoyed working with you all and have learned so much from each of you.” “I wanted to let you know that Friday will be my last day here. I’m really excited to go back to school to get my graduate degree, but I’ll miss working with you.”"
    },
    {
      "title": "Send an email to the rest of your coworkers.",
      "content": "Send an email to the rest of your coworkers. If you have a large team, it’s fine to send out an email letting everyone know that you’re leaving rather than talking to each person individually. Send a short note letting your colleagues know that you've accepted a new job and include the date of your departure. [4] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source If you're currently working on projects with some of your coworkers, reach out to them individually. Reassure them that you'll be tying up loose ends before your departure and let them know who will be taking over your position if your boss has reassigned the work. If you work with clients, it’s usually a good idea to send an email to those you’ve worked closely with to let them know you’re leaving. Check in with your boss about this to make sure they’re on board. They can also let you know who will be taking over the accounts or projects, so you can relay that information to your clients."
    },
    {
      "title": "Remain professional and positive.",
      "content": "Remain professional and positive. Even if you’re leaving because you’re unhappy with your job or it was a toxic environment, avoid dissing the company or employees. Focus on the positives or mention what you learned in your current role. Aim to make a good impression as you exit your role by tying up loose ends, answering questions your colleagues have, and training your replacement if your boss asks you to do so. Work hard up until the very end and make sure your files, papers, and workspace are organized for the next person who steps into your role."
    },
    {
      "title": "Keep your messages brief and to the point.",
      "content": "Keep your messages brief and to the point. Don’t feel as though you have to share a lot of information. Simply telling your colleagues that you’re moving on is enough. Avoid gushing about your new position or divulging details related to salary or benefits. [5] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Share your contact information.",
      "content": "Share your contact information. Give out your number to close colleagues and connect with other coworkers on LinkedIn. Not only will you be able to stay in touch and nurture the relationships you developed, but you’ll also have a wider professional network. [6] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "",
      "content": "Dear colleagues, My last day at Evers Law Firm is approaching. I’ll be here until June 1st, and then will move on to my next challenge after 4 years with this wonderful company. It’s been a pleasure working with all of you! I’ve learned so much during my time here and thank you all for your support. If you’d like to stay in touch, reach out to me at linkedin.com/AeshaRodgers or aesha.rodgers@mail.com. Don’t hesitate to let me know if you need anything before I depart. Sincerely, Aesha Rodgers."
    },
    {
      "title": "",
      "content": "To the marketing team at Spark, I’m reaching out to let you all know that I’ll be leaving this company at the end of the week. Although I’m looking forward to my next adventure, I will miss all of the wonderful employees and friends here at Spark. It’s been an amazing ride over the last 8 years, and it was a privilege and honor to work with you all. I’d love to stay connected with you. My email address is sean_albright@usa.com, or you can find me on LinkedIn at linkedin.com/seanalbright. Wishing you all much success in the future! Kind regards, Sean Albright."
    }
  ]
}