{
  "url": "https://www.wikihow.com/Tie-Golden-Goose-Laces",
  "title": "Tying, Styling, and Sizing Your Golden Goose Sneakers",
  "steps": [
    {
      "title": "Figure out how tight you want your shoes to be.",
      "content": "Figure out how tight you want your shoes to be. With your laces untied, slip your sneakers on and off. Tighten the criss-cross lacing and make a note of how loose the laces need to be so that you can comfortably get your foot in and out of the shoe. [1] X Research source Most Golden Goose sneakers come pre-laced. Make sure that the laces are coming out of the final eyelet and dangling on either side of the shoe. If your shoes did not come laced up, tie them in a criss-cross pattern ."
    },
    {
      "title": "Tie a knot at the end of each shoelace.",
      "content": "Tie a knot at the end of each shoelace. After finding your preferred tightness, your laces are probably dangling on either side of your shoe with just enough room for a single knot. Create a simple knot at the end of each shoelace by making a loop. Then, pull the end of the lace through the loop and tighten. [2] X Research source The knot will keep your laces from coming undone, and give you the perfect casual, undone look!"
    },
    {
      "title": "If your laces are too long, make a knot at the base of the top eyelet.",
      "content": "If your laces are too long, make a knot at the base of the top eyelet. Make sure this knot is as close to the eyelet base as possible to keep your laces at the looseness level you identified. Continue to tie knots in the shoelace until your lace is at your desired length. [3] X Research source Make sure you are knotting the laces over the initial knot or after it. If you are tying your knots in front of your initial knot, you will end up tightening your laces. The knots don’t have to be perfect or uniform! The benefits of these shoes are that they give you a casual, worn in look, especially if your knots are a little messy."
    },
    {
      "title": "Golden Goose sneakers are generally true to size.",
      "content": "Golden Goose sneakers are generally true to size. Golden Goose is a European brand, so the shoes come in European whole sizes. There are no half sizes, so if you are between sizes, order a size up. [4] X Research source If you do not typically use European shoe sizes, convert your shoe size before ordering."
    },
    {
      "title": "There may be a slight break in period with your shoes.",
      "content": "There may be a slight break in period with your shoes. You can speed up this process by wearing them with thicker socks around your house or as you run errands. This will help to gently stretch out your shoes and mold them to your feet. [5] X Research source"
    },
    {
      "title": "Most people wear no-show socks with their Golden Goose sneakers.",
      "content": "Most people wear no-show socks with their Golden Goose sneakers. The majority of Golden Goose shoes have a low profile, so ankle and taller socks peak out over the shoe. No-show socks keep the clean, casual profile of the shoes intact. [6] X Research source However, there’s no right way to wear these shoes! If you want to wear them with colorful or funky ankle or calf length socks, do it!"
    },
    {
      "title": "Or, go sockless.",
      "content": "Or, go sockless. Many people actually prefer to not wear any socks at all with their Golden Goose sneakers. These shoes are comfortable and breathable, so hot and sweaty feet aren’t anything you have to be concerned about. [7] X Research source"
    },
    {
      "title": "Wear Golden Goose sneakers with jeans and a solid t-shirt.",
      "content": "Wear Golden Goose sneakers with jeans and a solid t-shirt. This classic look gives you a relaxed vibe perfect for running errands or grabbing lunch with your friends. You can even wear this outfit on casual days at the office! [8] X Research source The great thing about Golden Goose sneakers is that the options are truly endless when it comes to wearing them. There’s no wrong way to style them!"
    },
    {
      "title": "Style your sneakers with a casual mid-length dress.",
      "content": "Style your sneakers with a casual mid-length dress. You can dress your Golden Goose sneakers up a bit while maintaining a relaxed look. If skirts are more your thing, wear your shoes with a long, silk skirt and neutral t-shirt for an effortless, put-together vibe. [9] X Research source"
    },
    {
      "title": "Wear your Golden Gooses with a neutral jogger set.",
      "content": "Wear your Golden Gooses with a neutral jogger set. This is the perfect outfit when you’re on the go and want to be both stylish and comfy. You can also pair your shoes with black leggings and a cropped athletic top for a trendy, athleisure look. [10] X Research source"
    }
  ]
}