{
  "url": "https://www.wikihow.com/Write-an-Anime-Script",
  "title": "How to Write an Anime Script",
  "steps": [
    {
      "title": "Analyze your characters.",
      "content": "Analyze your characters. Before anything, make sure you know your characters. If you haven't already, make a character profile. [1] X Research source Think about how your characters would act in certain situations such as fear, embarrassment and enjoyment. Decide who is friends with who, and who is the enemy. Is the main character outgoing at school or is the loner no one knows about? Put yourself in each characters shoes and just imagine an average day being like them."
    },
    {
      "title": "Make a story plot line.",
      "content": "Make a story plot line. On a piece of paper, start of with a straight line near the bottom of the page, make it incline by a 45 degree angle and when you are near the top of the page, drop drastically with about a 80 degree angle and continue making the line near the bottom of the page. It should look like a straight line with a lopsided mountain that is closer to the right side of the page. Use this to make your story line. This can be one episode or the whole anime. The beginning where the line is straight is the beginning of the story. This is where we get to know the characters and their average life. Try to include as many characters at this point. When the mountain begins, introduce the enemy or the conflict, such as a huge earthquake, or a threat. As you continue moving up the mountain, make the problem bigger and bigger until you are at the climax. This would be the big fight scene, the time when it seems like the world will end, whatever is the worst or biggest part of the anime should be here. Once they solve the problem, you will go down the mountain. Add how they cope after or how things go back to normal. Be sure to add what characters are involved in each scene and at least 5-10 lines about what happens in each part and scene. In the end, when you read through, it should sound like a summary of the whole anime."
    },
    {
      "title": "Begin to write.",
      "content": "Begin to write. When writing, do it play style. Put the person's name with a colon and what they say. If they do any specific actions, put it in quotes or stars. (Kuma: Are we lost? Shin: *pulls out map and looks at it. He begins to act nervously* I think so...) [2] X Research source"
    },
    {
      "title": "When writing, don't forget about the characters or the plot.",
      "content": "When writing, don't forget about the characters or the plot. Be sure that what the character says is something the character would say. If a character is a serious person, don't give him any goofy or silly jokes to say. If a girl is shy, give her as little lines as possible unless she changes by the climax."
    },
    {
      "title": "Have fun.",
      "content": "Have fun. This is your story. If you want, draw out the characters in a certain time in the story so you can look at it and imagine that scene in your head. You can skip certain parts, or even start at the climax. Because you have your plot line, you know how the story would go rather than being clueless when writing. [3] X Research source"
    },
    {
      "title": "Edit.",
      "content": "Edit. When you are done, go back and make sure everything adds up. Avoid any holes or any totally arbitrary and random parts. Make sure your grammar and punctuation is right. [4] X Research source If you want, ask a friend to read it. They may have some great ideas or additions to your story that you may not have thought of."
    },
    {
      "title": "Read through it.",
      "content": "Read through it. If you plan on recording it and making a real anime, you can add notes about the emotion or breaks the voice actor would take. [5] X Research source Every detail counts. Be sure to say if they would be reading a part fast or slow or if there are any other vocal actions they need to do. (Rai: Oh *breathes heavily* my *breathes heavily* GOD!!! *big sigh as he falls to the ground. A few seconds later, he groans* Ow....)"
    },
    {
      "title": "Your script is ready.",
      "content": "Your script is ready. Type and print out the good copy. If other people would be reading or acting to it, give them the character descriptions too so they get a better idea of the character. They would be able to tell if what they are saying matches up with the character they are supposed to be, so be open to ideas and changes until the end."
    }
  ]
}