{
  "url": "https://www.wikihow.com/Work-on-a-Computer-Safely",
  "title": "How to Work on a Computer Safely",
  "steps": [
    {
      "title": "Never touch any of the circuit boards inside the computer while it is turned on.",
      "content": "Never touch any of the circuit boards inside the computer while it is turned on . You will risk electrical shock and possibly ruining your computer. Before working on a computer, always turn the power supply unit's (PSU) power switch off and unplug the power cable. Before touching anything in the computer, it is smart to connect a grounding cable or anything that removes static electricity to avoid frying components."
    },
    {
      "title": "Use your common sense.",
      "content": "Use your common sense. When you are working on your computer while it is running, never move, slide, bump or pick up the computer or you will risk ruining the hard disks and possibly creating other problems. Also, always make sure the computer is turned off before opening it up if you need to. Other things that almost everyone knows such as not to handle drinks or food around your computer while you are opening it up or you may risk getting food lodged inside moving parts or spilling drinks on delicate electronics."
    },
    {
      "title": "Make sure you know what you are doing while dealing with the software of your computer.",
      "content": "Make sure you know what you are doing while dealing with the software of your computer. Fully understand what needs to be done before playing with the settings in any of your malfunctioning programs. It is best to look up your problem in some sort of a search engine because most likely someone else has already had these problems and solved it. If you can not find your problem or a fix to it, you may try changing settings and properties to see if that will solve the problem. Make sure you save and memorize the changes you make so as to be able to reverse them in case you needed to. If nothing else works you may want to re-install the software."
    },
    {
      "title": "Always make sure the electricity is off before touching any hardware.",
      "content": "Always make sure the electricity is off before touching any hardware. Some general tips while dealing with hardware are: When handling hardware, be careful to keep your fingers on the sides of the board or on some sort of plastic or metal covering on something like a GPU to avoid getting oil from your fingers onto the delicate electrical circuits imprinted on the board. Always be gentle with the hardware. If something won't go in, check to see if it is the right slot for that part. If something won't come out investigate around the piece of hardware and check for any types of clips or fasteners. Do not yank a piece of hardware out of the computer. Never put hardware anywhere near food's or drinks because they can severely damage the hardware."
    },
    {
      "title": "Make sure to discharge your body of any static charge that might be built up on you.",
      "content": "Make sure to discharge your body of any static charge that might be built up on you. After you open up your computer it is best to ground the case of the machine. If you don't have anything to do this with you can always just touch something metal before touching the computer to discharge any static charge you have on you. And avoid wool clothing because it can build very large static charges."
    },
    {
      "title": "Never have liquids or solids near a computer you are working on.",
      "content": "Never have liquids or solids near a computer you are working on. Either of these two things when introduced onto hardware of a computer will create damage. It is also smart not to get these anywhere near your mouse or keyboard because nobody likes a greasy mouse and keyboard or finding crumbs stuck under your mouse and in the keyboard."
    },
    {
      "title": "Install (or have somebody else install) an anti-virus and an anti-spyware software.",
      "content": "Install (or have somebody else install) an anti-virus and an anti-spyware software. It is best to check what files are infected before lettings the virus scanner delete the file. If it had infected a system file it will most likely end with your computer never starting again. You will want to try to disinfect the file possibly with multiple programs. If you have a virus or spy ware do not let it sit in the quarantine. Address the problem immediately before further problems arise."
    },
    {
      "title": "When it comes to dealing with computers, the only time anything is private is off line.",
      "content": "When it comes to dealing with computers, the only time anything is private is off line. While you are online privacy is virtually non-existent. Never put any private information on the internet or while you are doing online banking make sure your connection is encrypted or you are using an anonymous IP."
    },
    {
      "title": "Never share financial information over the internet.",
      "content": "Never share financial information over the internet. Always use some sort of privacy program like encryption or anonymous IP when dealing with banking or anything that requires a credit card number."
    },
    {
      "title": "Avoid having chemicals that cause metal to rust quickly or dissolve plastics anywhere near your computer.",
      "content": "Avoid having chemicals that cause metal to rust quickly or dissolve plastics anywhere near your computer."
    }
  ]
}