{
  "url": "https://www.wikihow.com/Treat-Shingles-(Herpes-Zoster)",
  "title": "How to Treat Shingles (Herpes Zoster)",
  "steps": [
    {
      "title": "Know the symptoms commonly associated with shingles.",
      "content": "Know the symptoms commonly associated with shingles. After a person gets the chickenpox virus, that virus will stay with them, sometimes resulting in outbreaks of a rash and blisters. The most common symptoms of shingles are: [1] X Research source Headache Flu-like symptoms Sensitivity to light Itching, irritation, tingling, and pain where a rash starts developing, but only on one side of the body"
    },
    {
      "title": "Understand that there are three stages associated with shingles.",
      "content": "Understand that there are three stages associated with shingles. Knowing the symptoms of each stage can help you doctor evaluate how to best treat your case. [2] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Stage 1 (before the rash): itchiness, tingling, numbness or pain develops in the area where the rash will eventually develop. Diarrhea, stomach ache, and chills (usually without fever) accompany this dermal irritation. Your lymph nodes may be tender or swollen. Stage 2 (rash and blisters): a rash will develop on one side of your body, with blisters forming eventually. The liquid in the blisters starts off clear but eventually gets cloudy. If a rash develops around the eyes, see a doctor immediately. The rash and blisters are sometimes accompanied by intense stinging pain. Stage 3 (after the rash and blisters): pain may develop in the area affected by the rash. This pain is called postherpetic neuralgia (PHN), and it may last a matter of weeks or even years. PHN is associated with extreme sensitivity, chronic pain, as well as aching or burning sensations."
    },
    {
      "title": "Know if you are at a higher risk of getting shingles.",
      "content": "Know if you are at a higher risk of getting shingles. If you receive immunosuppressive drugs, such as steroids, after an organ transplant, you are at a higher risk of getting shingles. If you suffer from the following conditions, you are also at a higher risk: [3] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Cancer Lymphoma Human immunodeficiency virus (HIV) Leukemia"
    },
    {
      "title": "See your doctor early.",
      "content": "See your doctor early. The sooner your doctor diagnoses shingles, the better. (Sorry, self-diagnosis is not recommended.) Patients who start a course of drug treatment within three days of symptoms see better results than patients who wait longer than three days to start treatment. [4] X Expert Source Lydia Shedlofsky, DO Dermatologist Expert Interview. 30 September 2020."
    },
    {
      "title": "Talk with your doctor about treating the rash while managing pain.",
      "content": "Talk with your doctor about treating the rash while managing pain. Most treatments for shingles are not very elaborate. They involve treating the symptoms of the rash while managing the patient's pain. Your doctor may ask you to try the following: [5] X Expert Source Lydia Shedlofsky, DO Dermatologist Expert Interview. 30 September 2020. An antiviral medicine, like acyclovir (Zovirax), valacyclovir (Valtrex), famciclovir (Famvir), in order to dull the pain of the rash and make it last shorter Over-the-counter NSAIDS such as ibuprofen, aspirin, or acetaminophen to manage pain Certain topical antibiotics to prevent infection and spread of any rash or blisters"
    },
    {
      "title": "If you experience chronic pain after your shingles rash has passed, allow your doctor to make another diagnosis.",
      "content": "If you experience chronic pain after your shingles rash has passed, allow your doctor to make another diagnosis. Your doctor may diagnose postherpetic neuralgia (PHN). In order to treat this chronic condition that 15 out of every 100 shingles patients experiences, you doctor may give you: [6] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Antidepressants (PHN is often associated with depression, as certain daily activities become painful and/or difficult to do). Topical anesthetics, including benzocaine (available OTC) and lidocaine patches (available by prescription only). Anticonvulsants, as some studies show that these drugs may help with chronic nerve pain. Opoids, such as codeine, to help reduce chronic pain."
    },
    {
      "title": "Prepare a couple home treatments to make managing shingles easier.",
      "content": "Prepare a couple home treatments to make managing shingles easier. Although you should never let shingles go untreated, there are a number of things you can do at home to combine with doctor's orders. These include: Don't cover or itch the rash or blisters too much. Let the rash and blisters breathe, even as they scab over. If the pain keeps you from sleeping, it's acceptable to wrap the rash in a sports bandage. [7] X Research source Icing the shingles for 10 minutes, with 5-minute breaks in between, for several hours. Afterward, dissolve some aluminum acetate (Domeboro) in water and apply using a moist compress to the rash. [8] X Research source Apply calamine lotion."
    },
    {
      "title": "Watch for a potential worsening of your condition.",
      "content": "Watch for a potential worsening of your condition. Shingles comes with long-term complications in some cases. You should look out for the following scenarios if you are dealing with shingles or PHN: [9] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source A spreading out of the rash over large parts of your body. This condition is called disseminated zoster, and it may affect internal organs as well as joints. Treatment of disseminated zoster usually involves both antibiotic and antiviral medicines. A spreading of the rash to the face. This condition is called herpes zoster ophthalmicus, and it potentially threatens the eyesight if left untreated. See your doctor or ophthalmologist quickly if you notice shingles spreading to your face."
    },
    {
      "title": "Get the shingles vaccine.",
      "content": "Get the shingles vaccine. If you have already been exposed to chickenpox and are concerned about getting shingles, or want to make a possible shingles episode less painful, consider getting the shingles vaccine. [10] X Expert Source Lydia Shedlofsky, DO Dermatologist Expert Interview. 30 September 2020. The vaccine is marketed under the name Zostavax, and adults 50 and older can receive one shot, whether or not they have had shingles before. [11] X Research source People who have never had chickenpox or shingles should avoid getting the vaccine, instead opting for the varicella vaccine."
    },
    {
      "title": "Avoid contact with infected people.",
      "content": "Avoid contact with infected people. Those who have never had chickenpox or shingles before should avoid contact with those people who have an outbreak of either. Blisters are contagious and should be avoided; exposure to fluid from shingles blisters causes chickenpox and possible shingles episodes later in life. [12] X Expert Source Lydia Shedlofsky, DO Dermatologist Expert Interview. 30 September 2020. Shingles is more common in people older than 50 than it is in younger people. Those older than 50 should be especially vigilant about shingles."
    },
    {
      "title": "Take a cool bath.",
      "content": "Take a cool bath. The coolness of the water will help soothe the pain and uncomfortableness of shingles. But make sure it's not too cold! Your skin will react to any extreme temperature, causing even more pain. And when you're done soaking, dry yourself off completely with a warm towel. You could take an oatmeal or starch bath, too. In lukewarm water (not cold or hot), the oatmeal or starch will provide you a soothing, silkening feeling. Read wikiHow's How to Make an Oatmeal Bath for ideas! [13] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Be sure to wash any towels you use in the hottest setting on your washing machine. You don't want to spread anything!"
    },
    {
      "title": "Use a wet compress.",
      "content": "Use a wet compress. Just like the bath, anything cool and wet will feel great on your skin. Just grab a washcloth, soak it in cool water, wring it out, and apply to your skin. After several minutes, repeat the process to renew the feeling. [14] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Don't use ice packs! Those are too cold for your skin right now -- if you think it's sensitive normally, it's extra sensitive right now. Always, always, always wash your towels after you use them, especially when you have shingles."
    },
    {
      "title": "Use calamine lotion.",
      "content": "Use calamine lotion. Normal lotions -- especially those that are scented -- could just make the situation worse. Stick to lotions like calamine that are extra soothing and be sure to wash your hands after application. Remember to apply it only to the affected area."
    },
    {
      "title": "Rely on capsaicin.",
      "content": "Rely on capsaicin. That's the stuff found in hot red peppers, believe it or not. While you probably shouldn't spend the afternoon rubbing peppers on yourself, you might find relief in using a cream that contains it. They're widely available at most pharmacies. [15] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Keep in mind that this doesn't make the shingles go away -- but it will make you feel a whole lot better. Your case should clear up in about 3 weeks, for the record."
    },
    {
      "title": "Use baking soda or cornstarch on the sores.",
      "content": "Use baking soda or cornstarch on the sores. Just on the sores, though! It'll dry them up and hasten the healing process. Just make a paste out of 2 parts baking soda (or cornstarch) to one part water. Leave the paste on for about 15 minutes, rinse it off, and pat dry with a towel. Then wash the towel when you're done! [16] X Research source You can do this a few times a day. But don't do it too often! You could dry out your skin so thoroughly you exacerbate the problem."
    }
  ]
}