{
  "url": "https://www.wikihow.com/Sync-Google-Calendar-with-Outlook",
  "title": "How to Sync Google Calendar with Outlook",
  "steps": [
    {
      "title": "Go to https://www.outlook.com in a web browser.",
      "content": "Go to https://www.outlook.com in a web browser. If you're using the free version of Outlook.com or Outlook 365 on the web, you can publish your calendar's URL so that it's possible to subscribe to it in Google Calendar. If you're not already signed in to your account, sign in now. It is only possible to sync your Outlook calendar data to your Google Calendar if you're using Outlook on the web. [1] X Research source If you're using a desktop version of Outlook through your school, company, or organization, just complete these steps from the Outlook web app URL provided by your system administrator. You won't be able to edit the information synced from Outlook in Google Calendar. If you need to edit something from the Outlook calendar, you'll need to do so in Outlook."
    },
    {
      "title": "Click the gear icon.",
      "content": "Click the gear icon. It's near the top-right corner of Outlook."
    },
    {
      "title": "Click View all Outlook Settings.",
      "content": "Click View all Outlook Settings . It's at the bottom-right corner of the menu on the right side of the page."
    },
    {
      "title": "Click Calendar.",
      "content": "Click Calendar . It's on the left side of the Settings window."
    },
    {
      "title": "Click Shared calendars.",
      "content": "Click Shared calendars . It's in the center column of the Settings window."
    },
    {
      "title": "Select your calendar under \"Publish a calendar.\"",
      "content": "Select your calendar under \"Publish a calendar.\" You'll do this from the drop-down menu that's in the second section. You may have to scroll down a little bit first. If you only have one calendar, it'll just be called Calendar ."
    },
    {
      "title": "Select Can view all details from the \"Select permissions\" menu.",
      "content": "Select Can view all details from the \"Select permissions\" menu. This ensures that your entire calendar is viewable in Google Calendar rather than just your availability."
    },
    {
      "title": "Click the Publish button.",
      "content": "Click the Publish button. It's near the bottom-right corner of the window. Two new URLs will appear at the bottom of the window."
    },
    {
      "title": "Click the \"ICS\" link and select Copy Link.",
      "content": "Click the \"ICS\" link and select Copy Link . It's the second of the two links at the bottom of the page. This copies the calendar address to your clipboard."
    },
    {
      "title": "Go to https://calendar.google.com.",
      "content": "Go to https://calendar.google.com . If you're not already signed in to your Google account, follow the on-screen instructions to do so now."
    },
    {
      "title": "Click the gear icon and select Settings.",
      "content": "Click the gear icon and select Settings . The gear is at the top-right corner of the page."
    },
    {
      "title": "Select From URL under the \"Add calendar\" header.",
      "content": "Select From URL under the \"Add calendar\" header. You'll find it in the left panel. If the \"Add calendar\" section is collapsed, click Add calendar to expand it first."
    },
    {
      "title": "Right-click the \"URL of calendar\" blank and select Paste.",
      "content": "Right-click the \"URL of calendar\" blank and select Paste . The URL to your Outlook calendar will appear. If you want to make your Outlook calendar publicly accessible, check the box below the blank as indicated on the page."
    },
    {
      "title": "Click the blue Add calendar button.",
      "content": "Click the blue Add calendar button. This adds your Outlook calendar to Google Calendar. If you also want your Google Calendar information to appear in your Outlook calendar, continue to Subscribing to a Google Calendar in Outlook Online or 365 or Subscribing to a Google Calendar in Outlook 2016 or 2019 . To ensure your Outlook appointments and events appear along with those on your Google Calendar, return your calendar and make sure the box next to the Outlook calendar's URL is checked in the left panel. It'll be under \"Other calendars\" toward the bottom."
    },
    {
      "title": "Go to https://calendar.google.com.",
      "content": "Go to https://calendar.google.com . If you're not already signed in, follow the on-screen instructions to do so now. Use this method if you use Outlook in your web browser, either with Office 365 or Outlook.com. Using this method, you'll be able to see all of your Google Calendar events in Outlook, but will only be able to edit them when using Google Calendar. [2] X Research source"
    },
    {
      "title": "Hover the mouse cursor over the calendar you want to sync.",
      "content": "Hover the mouse cursor over the calendar you want to sync. Your calendars are listed in the left panel under \"My calendars.\" When you hover the cursor over a calendar name, some icons will appear. If you don't see the calendar you want to sync, click My calendars to expand the list."
    },
    {
      "title": "Click the three-dot menu icon ⋮.",
      "content": "Click the three-dot menu icon ⋮ . It's to the right of the calendar's name. A menu will expand."
    },
    {
      "title": "Click Settings and sharing on the menu.",
      "content": "Click Settings and sharing on the menu. The Calendar settings page will appear."
    },
    {
      "title": "Scroll down and copy the secret address in iCal format.",
      "content": "Scroll down and copy the secret address in iCal format. You'll need to scroll almost all the way down the page to find the URL listed under \"Secret address in iCal format.\" To copy the URL, double-click it to highlight it, right-click the highlighted URL, and then select Copy . If the link contains %40 you will need to change that to @ before moving to the next step."
    },
    {
      "title": "Go to https://www.outlook.com in a web browser.",
      "content": "Go to https://www.outlook.com in a web browser. If you're using the free version of Outlook.com or Outlook 365 on the web, you can use it to subscribe to your Google calendar. If you're not already signed in to your account, sign in now."
    },
    {
      "title": "Click the calendar icon.",
      "content": "Click the calendar icon. It's at the bottom of the left panel. [3] X Research source"
    },
    {
      "title": "Click Add calendar or Import calendar.",
      "content": "Click Add calendar or Import calendar . The option you see varies by version, but you'll find it above your calendar list near the center of the left panel."
    },
    {
      "title": "Click Subscribe from web or From web.",
      "content": "Click Subscribe from web or From web . One of these two options will appear in the left panel."
    },
    {
      "title": "Right-click the typing field and select Paste.",
      "content": "Right-click the typing field and select Paste . The URL you copied from Google Calendar should now appear in the blank. If you're using Outlook 365, type a name you want to use for this calendar into the \"Calendar name\" field."
    },
    {
      "title": "Click Import.",
      "content": "Click Import . This will import the information from the Google Calendar into Outlook. If you add or update an event the Google calendar, it can take anywhere from a few minutes to a few hours for it appear in Outlook."
    },
    {
      "title": "Go to https://calendar.google.com.",
      "content": "Go to https://calendar.google.com . If you're not already signed in, follow the on-screen instructions to do so now. Use this method if you use an Outlook desktop application (either 2016 or 2019) on your computer. Using this method, you'll be able to see all of your Google Calendar events in Outlook, but will only be able to edit them when using Google Calendar. [4] X Research source"
    },
    {
      "title": "Hover the mouse cursor over the calendar you want to sync.",
      "content": "Hover the mouse cursor over the calendar you want to sync. Your calendars are listed in the left panel under \"My calendars.\" When you hover the cursor over a calendar name, some icons will appear. If you don't see the calendar you want to sync, click My calendars to expand the list."
    },
    {
      "title": "Click the three-dot menu icon ⋮.",
      "content": "Click the three-dot menu icon ⋮ . It's to the right of the calendar's name. A menu will expand."
    },
    {
      "title": "Click Settings and sharing on the menu.",
      "content": "Click Settings and sharing on the menu. The Calendar settings page will appear."
    },
    {
      "title": "Scroll down and copy the secret address in iCal format.",
      "content": "Scroll down and copy the secret address in iCal format. You'll need to scroll almost all the way down the page to find the URL listed under \"Secret address in iCal format.\" To copy the URL, double-click it to highlight it, right-click the highlighted URL, and then select Copy . If the link contains %40 you will need to change that to @ before moving to the next step."
    },
    {
      "title": "Open Outlook and click the Calendar icon.",
      "content": "Open Outlook and click the Calendar icon. Now that the URL is copied to your clipboard, you can subscribe to it in Outlook. The icon will be at the bottom-left corner of Outlook."
    },
    {
      "title": "Right-click My Calendars.",
      "content": "Right-click My Calendars . It's in the left panel. A menu will expand. [5] X Research source"
    },
    {
      "title": "Select Add Calendar and click From Internet.",
      "content": "Select Add Calendar and click From Internet . This opens the \"New Internet Calendar Subscription\" dialog window."
    },
    {
      "title": "Right-click the typing area and select Paste.",
      "content": "Right-click the typing area and select Paste . The copied URL will appear in the blank."
    },
    {
      "title": "Click OK and then Yes to confirm.",
      "content": "Click OK and then Yes to confirm. You'll be asked if you'd like to add the calendar and subscribe to updates. Once added, you'll be able to see your Google Calendar updates in your Outlook calendar under \"My Calendars\" header in the left panel. If you add or update an event the Google calendar, it can take anywhere from a few minutes to a few hours for it appear in Outlook."
    }
  ]
}