{
  "url": "https://www.wikihow.com/Use-a-Foam-Cannon",
  "title": "How to Use a Foam Cannon like a Pro: The Ultimate Guide",
  "steps": [
    {
      "title": "Pre-rinse your car using your pressure washer and water.",
      "content": "Pre-rinse your car using your pressure washer and water. After connecting your pressure washer to your water source of choice (some prefer distilled water, as tap water can leave residue spots), spray your vehicle, working from top to bottom. Be sure to let the water sit for a few minutes, as this will help soften any caked-on dirt and grime. [1] X Research source Pre-rinsing allows for better results than just applying the foam dry, as the moisture helps soften debris. Gas-powered pressure washers typically have higher GPM (gallons per minute) and PSI (pounds per square inch), making them the preferred option for many DIY car washers. An electric or gas-powered pressure washer should have a GPM of at least 1.75 and a PSI rating of 1,900 or more."
    },
    {
      "title": "Fill the foam canister with vehicle soap and water.",
      "content": "Fill the foam canister with vehicle soap and water. Screw off the foam canister from the foam cannon, and pour the recommended amount of soap and water (tap or distilled) into the canister—in most cases, a 1:16 ratio (1 part soap to 16 parts water) is best for use with a foam cannon. Swirl the canister around a few times to mix the suds. [2] X Research source Your foam cannon will typically have a specific fill line on the canister for soap and water but refer to your vehicle soap’s instructions to ensure the perfect mixing ratio. Go for a vehicle soap explicitly designed for use with a foam cannon to produce the most suds, as some regular vehicle soaps are low-sudsing and may result in a disappointing spray. Mixing your soap with warm water instead of cold helps the mixture to aerate better."
    },
    {
      "title": "Connect the foam cannon to a pressure washer and adjust the settings.",
      "content": "Connect the foam cannon to a pressure washer and adjust the settings. Screw your foam canister back onto the cannon, and attach the foam cannon to your pressure washer lance or quarter-inch quick connection plug, depending on what you have. Once connected, check the instructions on your particular foam cannon model to learn how to adjust your soap and water-control nozzles to the perfect level of water pressure and sud thickness. [3] X Research source Generally, turn your water control and soap nozzles to the right for maximum suds and pressure and left for less. Take a moment to play around with the foam cannon to determine what nozzle adjustments work best for you."
    },
    {
      "title": "Spray your car liberally with foam and let it sit for 2-3 minutes.",
      "content": "Spray your car liberally with foam and let it sit for 2-3 minutes. Use your foam cannon to spray on a thick layer of suds to your vehicle, working from top to bottom. Cover every inch of your car with soap, and let the solution sit for at least 2-3 minutes. [4] X Research source Letting the soap sit on your vehicle for at least 2-3 minutes ensures that all the dirt and grime lift away for a spotless clean. Try parking your car in a shaded area while using your foam cannon to ensure the foam does not dry on your vehicle."
    },
    {
      "title": "Rinse your vehicle with the pressure washer.",
      "content": "Rinse your vehicle with the pressure washer. Detach your foam cannon from your pressure washer’s lance or quarter-inch quick connection plug. Then, using your pressure washer gun, work slowly from the top of your car to the bottom, spraying with water from right to left as you blast away all the suds off your vehicle. [5] X Research source Repeat with another layer of suds followed by a rinse, if desired. For an ultra-clean finish, try wiping your vehicle dry using a microfiber cloth or mitt ."
    },
    {
      "title": "Rinse out the foam cannon with water, and store it in a clean, dry place.",
      "content": "Rinse out the foam cannon with water, and store it in a clean, dry place. To finish, dump any remaining soap from the canister and fill it with clean water. Then, screw the canister back onto the foam cannon, re-attach your pressure washer, and give the cannon a few sprays to remove any suds from the pipes and hose. [6] X Research source After cleaning out the soap from your foam canon, un-screw the cannon, dump the remaining water, and store it in a clean, dry place like your garage. Flushing the remaining suds from your foam cannon ensures that all its mechanisms, like the nozzle and hose, don’t deteriorate due to extended exposure to abrasive surfactants."
    },
    {
      "title": "Use a foam cannon and the two-bucket method for professional results.",
      "content": "Use a foam cannon and the two-bucket method for professional results. The “Two Bucket” method for washing a car by hand gets your vehicle as clean as possible by using 1 bucket for clean, soapy water and the other for dunking your dirty microfiber mitt in between wipes. When combined with the gentle lifting powers of a foam cannon, these methods form a dream team that ensures a scratch and swirl-free finish! Start by using your pressure washer to pre-rinse your car, and let it sit for 2-3 minutes. Then, use your foam cannon to spray on a thick layer of foam and let it sit for another 2-3 minutes. Rinse off the foam from top to bottom with your pressure washer. Then, use 1 bucket of soapy water and a microfiber mitt to wipe down each panel of your car, dunking the dirty mitt in the 2nd bucket to clean it before re-dunking it in the clean bucket between wipes."
    },
    {
      "title": "Foam cannons connect to pressure washers, while foam guns connect to hoses.",
      "content": "Foam cannons connect to pressure washers, while foam guns connect to hoses. If you don’t have a pressure washer but still want all the sudsing action of a foam cannon, a foam gun might be the perfect middle-of-the-road option. To use a foam gun, screw the gun onto your hose, and fill the canister with a 1:16 ratio of soap to water (or adjust according to your vehicle soap’s directions). Then, use it as you would a foam cannon to spray down your car with a thick layer of suds before rinsing it off with water. [7] X Research source Pressure washers deliver higher volumes of water, which results in thicker soap suds than can be produced with a garden hose. That said, thicker suds don’t mean better cleaning power. Foam guns typically don’t have an adjustable water pressure or soap nozzles, as a garden hose doesn’t pump out high-powered volumes of water as a pressure washer would."
    }
  ]
}