{
  "url": "https://www.wikihow.com/Use-a-Kick-Board",
  "title": "How to Use a Kick Board",
  "steps": [
    {
      "title": "Rest your chest on top of the kickboard.",
      "content": "Rest your chest on top of the kickboard. Positioning your upper body on the kickboard will help you float so you can learn to kick your legs while swimming. Place your chest on top of the kickboard so that your ribs are supported while your stomach is in the water."
    },
    {
      "title": "Hold the kickboard in both hands.",
      "content": "Hold the kickboard in both hands. You can put your hands through the holes in the kickboard, if applicable. Otherwise, grip the sides of the kickboard with both hands. Be sure to keep your elbows tucked in to your sides."
    },
    {
      "title": "Keep your hips up and your back straight.",
      "content": "Keep your hips up and your back straight. To get the most use of your kickboard you’ll need to keep your body as straight as possible. Don’t allow your hips to bend or sink into the water, but rather extend your body straight out from the kickboard. Press down slightly on the board with your chest to raise your hips."
    },
    {
      "title": "Kick your legs.",
      "content": "Kick your legs. Use your hips, rather than your knees, to kick your legs up and down. Point your toes, as the top part of your foot is what will provide the up and down movement needed to propel you through the water. [1] X Research source"
    },
    {
      "title": "Practice breathing techniques.",
      "content": "Practice breathing techniques. Extend the kickboard straight out in front of you and grip the top edge with both hands. While kicking, work on your breathing techniques in the water. Turn your head to the side (rather than lifting it up out of the water) when inhaling to avoid letting your hips dip lower into the water. Face forward and exhale while your head is under water. [2] X Research source"
    },
    {
      "title": "Extend the kickboard straight in front of you.",
      "content": "Extend the kickboard straight in front of you. Grip the top edge of the kickboard with both hands. Hold the kickboard out in front of you so that your arms are straight and your elbows are straight. [3] X Research source"
    },
    {
      "title": "Press down lightly on the board with your arms.",
      "content": "Press down lightly on the board with your arms. It’s important to press down on the board with your arms, as this allows your hips to come up. If your hips are sinking into the water, rather than in a straight line with your upper body, your kicks will not be as strong. [4] X Research source Don’t press so far that the board sinks under the water, but rather use a pressure just light enough to raise your hips. Now you can try different kicks."
    },
    {
      "title": "Try the flutter kick.",
      "content": "Try the flutter kick. Keep your legs parallel, point your toes, and quickly alternate kicking your legs up and down. The movement should come from your hip, rather than your knee. Flex your knee when you push down with your leg, and straighten it before moving your leg upward. [5] X Research source"
    },
    {
      "title": "Work on the breaststroke kick.",
      "content": "Work on the breaststroke kick. Extend your legs, keeping them parallel and your toes pointed. Flex your knees and move your feet in toward your buttocks. Then, move your knees away from each other and rotate your feet outward. Sweep your legs back and out by pushing against the water with your feet. Finish by extending your legs while moving them inward back to the starting position. [6] X Research source"
    },
    {
      "title": "Do the dolphin kick.",
      "content": "Do the dolphin kick. Extend your legs, keeping them together, and point your toes. Bend both knees to bring your feet toward your buttocks. Use both feet to forcefully kick downward at the same time."
    },
    {
      "title": "Hug the kickboard to your chest.",
      "content": "Hug the kickboard to your chest. Hold the kickboard to your chest and wrap your arms around it. Ensure you have a comfortable grip. [7] X Research source"
    },
    {
      "title": "Lay back and lift your hips up.",
      "content": "Lay back and lift your hips up. Let your body fall back into the water and raise your hips. Relax your entire body into a straight line. Avoid bending your back or hips or letting them sink into the water. [8] X Research source"
    },
    {
      "title": "Concentrate on your backstroke kick.",
      "content": "Concentrate on your backstroke kick. Alternate kicking your legs up and down. Keep your toes pointed and your legs close together, but not touching. Kick from the hip, rather than from the knee. While one leg is up the other should be down, and vice versa. [9] X Research source"
    }
  ]
}