{
  "url": "https://www.wikihow.com/Upgrade-Your-Network-to-Gigabit-Ethernet",
  "title": "How to Upgrade Your Network to Gigabit Ethernet",
  "steps": [
    {
      "title": "Decide if upgrading is worthwhile for you.",
      "content": "Decide if upgrading is worthwhile for you. If you and/or members of your household, regularly download large files, stream media, or perform other network-intensive tasks, such as hosting files on a server, or playing online games, you would likely benefit from the upgrade to Gigabit Ethernet. Medium to large enterprises that require multiple users to be connected to the network simultaneously would also notice an improvement in productivity. Individuals who use the internet solely for non-resource-intensive tasks such as e-mail, instant messaging, or surfing the web, may not see enough benefit to warrant the effort of upgrading to Gigabit Ethernet."
    },
    {
      "title": "Check if Gigabit Ethernet is available in your area.",
      "content": "Check if Gigabit Ethernet is available in your area. Gigabit Ethernet is still fairly new, and it still may not be available in all areas. This is especially true in small towns and rural areas. Check with your internet service provider to make sure they are able to provide internet speeds of up to 1000 Mbps in your area."
    },
    {
      "title": "Check the network ports on your devices.",
      "content": "Check the network ports on your devices. If you purchased your computer, gaming console, or other network-capable devices within the last two to three years, they may already be equipped with Gigabit-ready network ports. Check the ethernet ports on your devices and router to make sure they are rated for speed of up to 1,000 Mbps. [1] X Research source In Windows : Click on the start menu, click inside the search box (or click 'Run...' in older versions of Windows), type ncpa.cpl and press enter. Right-click the icon for your network adapter, and left-click 'properties'. In the dialog box that opens, click the 'Configure' button. In this new dialog box, scroll in the main window until you find an entry similar to 'Connection Type' or 'Speed', and select it. Click on the 'Value' drop-down menu. If you see '1.0 Gbps Full Duplex' or similar, your computer is Gigabit-ready. If not, you may need to upgrade your hardware, as described in the steps below. In Ubuntu 12.04 : Right-click the networking icon in the top panel of the desktop, and left-click 'Connection Information'. In the dialog box that appears, look at the 'Speed' value. A value of 1000 Mb/s indicates Gigabit-readiness. For other devices, check the instruction manual for the device's technical specifications. Look at the network adapter specifications for the keywords 'gigabit' or '1000 Mbps.' Printers: If you use a networked printer very frequently, you might consider checking it for Gigabit readiness, as well. You can find this information in the user's manual."
    },
    {
      "title": "Check your cables.",
      "content": "Check your cables. Look at the side of your network cables, and notice the cable type printed on them. If they are all labeled 'Cat5e', you are ready to go. If not, you can purchase new cables relatively inexpensively. In most cases, Cat6 cables do not provide a significant performance increase over Cat5e cables. However, if you wish to future-proof your network, you may consider using Cat6 cables."
    },
    {
      "title": "Check your router/switch.",
      "content": "Check your router/switch. Even if every other part of your network is upgraded to Gigabit standard, if your router and switch are still Fast Ethernet, they will bottleneck your network. Check the user's manual for your router or switch to make sure it is rated for 1000 Mbps. For home use, many people already use a combination switch and router in a single device. A home-use Gigabit router/switch is very similar."
    },
    {
      "title": "Upgrade your network hardware.",
      "content": "Upgrade your network hardware. If you found that your network hardware is not compliant with the Gigabit Ethernet standard, you have a couple of options: An economical choice would be to purchase a PCI Gigabit network expansion card. This card is to be installed in the rear of your PC, alongside your existing hardware. Disadvantages to this configuration include less-than-optimum speeds, and the need to remember which Ethernet port is attached to the Gigabit network card, and which is your old Fast Ethernet port. Accidentally connecting a Cat5e cable to a FastEthernet port would result in no performance gain at all. A somewhat more expensive, but more effective solution is to replace your computer's motherboard. Ensure that the motherboard includes an on-board Gigabit adapter. For maximum speed, purchase a 64-bit motherboard, making sure that you have, or can obtain, a compatible 64-bit processor chip. Most larger computer stores can help you select the right products and install them for you, to ensure that all of your hardware components are compatible with each other."
    },
    {
      "title": "Update your devices to the latest firmware.",
      "content": "Update your devices to the latest firmware. Now that you have upgraded your hardware, or even if you did not require any upgrades, now is an excellent time to make sure that all of your devices' firmware and device drivers are up to date, for maximum speed, performance, and reliability. The updates included in Windows updates may not be sufficient; visit the websites of your devices' manufacturers and download the latest updates direct from the source."
    },
    {
      "title": "Upgrade your storage media and RAM.",
      "content": "Upgrade your storage media and RAM. Regardless of your internet speed, files can only be transferred as quickly as your computer hardware is able to process. Make sure your hard drive(s) mention a speed of 7200 RPM, and also consider a RAID 1 array, for improved access speed. Alternatively, consider using solid-state drives. While more expensive than traditional hard disk drives, solid-state drives allow you to read and write almost instantaneously, vastly decreasing the speed bottleneck of a traditional hard disk drive. Adding additional RAM to your system will also increase overall performance. A good minimum is 8GB total, but you probably won't notice a significant improvement after 12GB of RAM, unless you intend to use multiple resource-intensive software programs, such as 3D rendering or simulation programs, simultaneously."
    },
    {
      "title": "Review your ISP contract.",
      "content": "Review your ISP contract. If you frequently download large files, stream high-quality media, or otherwise use the internet heavily, it can be easy to unwittingly exceed your monthly download limit, leading to costly overage fees. Check to see if there is an internet service provider in your area that doesn't have data download limits, or has really large limits.[Image:Upgrade Your Network to Gigabit Ethernet Step 9 Version 3.jpg|center]] If you are unable to switch to a new plan or if you are still concerned about possibly exceeding your monthly limit, make sure you monitor your internet usage. Most ISPs will allow you to sign up for an account on their website in order to monitor your activity, make payments online, and possibly even modify your existing plan."
    },
    {
      "title": "Run a speed test.",
      "content": "Run a speed test. Once you have completed your upgrade to Gigabit Ethernet, visit a website such as http://www.speedtest.net which will check your current network speeds. If you are still not satisfied with your network speeds, you may want to go back and review some of the steps of this article. If you are unable to reach the speeds you are promised, contact your internet service provider. They can usually help you receive the speeds you are supposed to be getting. If not, you can always downgrade to a slower plan that doesn't cost as much."
    }
  ]
}