{
  "url": "https://www.wikihow.com/Shorten-Pants-Without--Hand-Sewing",
  "title": "How to Shorten Pants Without Hand Sewing",
  "steps": [
    {
      "title": "If the pants have an unfinished bottom, you are on your way.",
      "content": "If the pants have an unfinished bottom, you are on your way. If not, turn the pants inside out, undo the hem at the bottoms and smooth out the creases with a steam iron."
    },
    {
      "title": "Turn the pants back to the right side.",
      "content": "Turn the pants back to the right side. Take a pair of pants that you have, that are the correct length and measure the outside leg, including the waistband."
    },
    {
      "title": "Measure the length and make a chalk mark on the new pants.",
      "content": "Measure the length and make a chalk mark on the new pants. Make a chalk mark across the pants and transfer the mark all round the bottom. You now have a chalk mark that is the correct length all round the bottom."
    },
    {
      "title": "Leave an inch and a half more than the mark and cut the rest off.",
      "content": "Leave an inch and a half more than the mark and cut the rest off. If the fabric is prone to fraying, rolling, or unraveling, you might want to machine-stitch a row of zigzag stitching around the very end. Cutting a woven fabric with pinking shears can also help to prevent fraying."
    },
    {
      "title": "Take the wonderweb, a glue that melts, and sew with a sewing machine on the inside around the bottom of the pants.",
      "content": "Take the wonderweb, a glue that melts, and sew with a sewing machine on the inside around the bottom of the pants. If you don't have a machine, pin the wonderweb every two or three inches all the way round."
    },
    {
      "title": "Lay the leg of the pants flat on your table.",
      "content": "Lay the leg of the pants flat on your table. You should now see the leg with the chalk mark all round the bottom plus the inch and a half allowance. Bend the leg in so that the chalk mark is on the edge. Make certain that all is smooth and flat inside. Be careful of the pins if you used them."
    },
    {
      "title": "Use a steam iron and a cloth to press the bottom of the pants with plenty of steam.",
      "content": "Use a steam iron and a cloth to press the bottom of the pants with plenty of steam. This melts the glue. Remove the pins if used and press lightly again to remove any little marks and you're done."
    },
    {
      "title": "Do the same to the other leg.",
      "content": "Do the same to the other leg."
    }
  ]
}