{
  "url": "https://www.wikihow.com/Withdraw-from-eWallet",
  "title": "How to Withdraw from eWallet",
  "steps": [
    {
      "title": "Prepare to initiate the withdrawal process.",
      "content": "Prepare to initiate the withdrawal process. Withdrawing from an FNB ATM requires you to use your mobile phone to request a withdrawal and an accompanying PIN; you will then have to travel to the closest ATM to withdraw your money. Since the PIN expires within a few hours of you receiving it, consider going through the mobile phone part of the process while at the ATM."
    },
    {
      "title": "Dial \"*120*277#\" to access eWallet.",
      "content": "Dial \"*120*277#\" to access eWallet. Exclude the quotation marks. If you don't have airtime, you can dial \"*130*277#\" without the quotation marks to buy airtime. Follow the directions on your screen to do so."
    },
    {
      "title": "Press \"1\" to select \"Withdraw Cash\".",
      "content": "Press \"1\" to select \"Withdraw Cash\". [1] X Research source"
    },
    {
      "title": "Press \"1\" to select \"Get ATM PIN\".",
      "content": "Press \"1\" to select \"Get ATM PIN\". Your eWallet will send you a text message that contains a unique four-digit PIN. The PIN will expire in 16 hours from the time you receive the text message."
    },
    {
      "title": "Visit the FNB ATM closest to you.",
      "content": "Visit the FNB ATM closest to you. Make sure that you can get to an ATM well within 16 hours of receiving your PIN."
    },
    {
      "title": "Press “Enter/Proceed” on the ATM keypad.",
      "content": "Press “Enter/Proceed” on the ATM keypad. This is the green button on most ATM keypads. You can also select \"Cardless Services\"."
    },
    {
      "title": "Select \"eWallet Services\" on the following screen.",
      "content": "Select \"eWallet Services\" on the following screen."
    },
    {
      "title": "Enter your mobile phone number on the keypad, then select \"Proceed.\"",
      "content": "Enter your mobile phone number on the keypad, then select \"Proceed.\" You must have a valid South African phone number at the time of this withdrawal to proceed."
    },
    {
      "title": "Enter the four-digit eWallet PIN you received via text message.",
      "content": "Enter the four-digit eWallet PIN you received via text message."
    },
    {
      "title": "Enter a withdrawal amount.",
      "content": "Enter a withdrawal amount. This amount must be less than or equal to the funds in your account. The ATM should dispense your cash accordingly. [2] X Research source"
    },
    {
      "title": "Verify that your transaction has ended before leaving the ATM.",
      "content": "Verify that your transaction has ended before leaving the ATM. You have successfully withdrawn money from eWallet via ATM! You can also press \"Cancel\" to void the transaction."
    },
    {
      "title": "Prepare to initiate the withdrawal process.",
      "content": "Prepare to initiate the withdrawal process. Withdrawing from an FNB-supported retailer requires you to use your mobile phone to request a withdrawal and an accompanying PIN; you will then have to travel to the closest supported retail store to withdraw your money."
    },
    {
      "title": "Dial \"*120*277*4#\" to access eWallet.",
      "content": "Dial \"*120*277*4#\" to access eWallet. Exclude the quotation marks."
    },
    {
      "title": "Press \"1\" to select \"Withdraw Cash\".",
      "content": "Press \"1\" to select \"Withdraw Cash\". This will take you to the PIN screen. [3] X Research source"
    },
    {
      "title": "Press \"1\" to select \"Get Retail PIN\".",
      "content": "Press \"1\" to select \"Get Retail PIN\". Your eWallet will send you a one-time PIN (OTP) that expires 30 minutes after being delivered. To avoid your PIN expiring--and thus having to go back through the withdrawal process--consider having your PIN sent to you while in a supported retail store."
    },
    {
      "title": "Visit any one of the following South African retail stores.",
      "content": "Visit any one of the following South African retail stores. The following is a comprehensive list of all eWallet-supported retailers in South Africa: Savoy SPAR Myezo SPAR Sutherland Ridge SUPERSPAR Northcrest SUPERSPAR Ngqeleni SUPERSPAR Lighthouse SPAR Lighthouse TOPS Bray's SPAR Limpopo SPAR Limpopo TOPS Thohoyandou SPAR Thohoyandou TOPS Randgate SPAR Randgate TOPS Umlazi Megacity SPAR Umlazi TOPS"
    },
    {
      "title": "Make a purchase at a supported retailer using a credit or debit card.",
      "content": "Make a purchase at a supported retailer using a credit or debit card. You cannot withdraw from eWallet without first making a purchase with a card."
    },
    {
      "title": "Select \"Withdraw cash\" at checkout.",
      "content": "Select \"Withdraw cash\" at checkout. You may have to ask your retailer to enter this information for you."
    },
    {
      "title": "Select \"Withdraw cash from eWallet\" on the following screen.",
      "content": "Select \"Withdraw cash from eWallet\" on the following screen."
    },
    {
      "title": "Specify the amount of cash you want withdrawn from eWallet.",
      "content": "Specify the amount of cash you want withdrawn from eWallet. This amount must be less than or equal to the funds in your account."
    },
    {
      "title": "Enter your mobile phone number when prompted.",
      "content": "Enter your mobile phone number when prompted. The cashier may ask you for your mobile phone number as well."
    },
    {
      "title": "Enter your one-time PIN to complete the process.",
      "content": "Enter your one-time PIN to complete the process. Your cashier should provide you with the appropriate amount. You have successfully withdrawn money from eWallet via retailer! There is no fee for withdrawing cash when making purchases at participating retail stores."
    }
  ]
}