{
  "url": "https://www.wikihow.com/Why-Is-Shein-So-Cheap",
  "title": "How Shein Charges Such Low Prices",
  "steps": [
    {
      "title": "Shein outsources their labor where wages are cheaper.",
      "content": "Shein outsources their labor where wages are cheaper. Most of Shein’s factories are in China, where the minimum wage is lower than in other countries like the United States and the UK. Because Shein spends less money on paying their seamstresses and factory workers, they’re able to charge lower prices for their clothes while still making a profit. [1] X Research source While Shein says they pay their workers fairly, many people believe Shein exploits their workers. Employees have stated that they often work 18 hours or more a day and make 0.27 yuan per product they make, which is equivalent to only a few cents."
    },
    {
      "title": "They are a fast fashion brand that uses less expensive materials.",
      "content": "They are a fast fashion brand that uses less expensive materials. Shein is one of the most prominent fast fashion brands, adding almost 1,000 new clothes to their website each day. They typically only make 50-100 items of each new style at first and wait to see how they perform online. Then, they mass-produce the most popular clothes, usually by using cheaper, and often lower quality, materials. [2] X Research source Fast fashion brands, like Zara, H&M, and Fashion Nova, are companies that produce trendy clothes at a quicker pace than traditional retailers. This on-demand model of manufacturing clothes is unique to Shein, which makes them one of the most popular and accessible fashion brands. Shein is also notorious for recreating the designs of luxury brands, selling similar or almost direct copies of their clothes at much cheaper prices."
    },
    {
      "title": "Shein has no physical stores, making their operational costs lower.",
      "content": "Shein has no physical stores, making their operational costs lower. What makes Shein unique from other fast-fashion brands like Zara and H&M is that their clothes are only sold online. [3] X Research source Because they have no physical stores, they don’t pay rent, utilities, or employees to manage their stores. This keeps the daily operational costs of the company low, allowing them to charge less for their clothes. [4] X Research source Shein occasionally has pop-up stores or events where people can try on and shop for clothes in-person. [5] X Research source"
    },
    {
      "title": "They ship products directly to consumers, cutting down shipping costs.",
      "content": "They ship products directly to consumers, cutting down shipping costs. Some clothing brands sell their products to retailers, who then sell the products to consumers. Because Shein is only online, they don’t have to pay another company to handle and sell their clothes. Shein is also based in China, which doesn’t require direct to consumer companies to pay export taxes. This allows Shein to lower their shipping expenses even more. [6] X Research source"
    },
    {
      "title": "Shein uses influencer marketing, which is a cheaper form of marketing.",
      "content": "Shein uses influencer marketing, which is a cheaper form of marketing. While scrolling on Instagram, TikTok, or YouTube, you’ve probably seen an influencer raving about their Shein haul. Shein does most of their marketing by paying influencers to promote their products on social media. [7] X Research source Influencer marketing is typically cheaper than social media ads, commercials, and celebrity endorsements, and is often more effective. So, Shein saves on marketing costs while getting more clicks and purchases. [8] X Research source Influencer marketing is so effective because influencers have built-in, loyal audiences who trust their opinion."
    },
    {
      "title": "They have constant discounts that encourage people to buy more.",
      "content": "They have constant discounts that encourage people to buy more. If you go to Shein’s website, you’ll probably see at least 1 discount code on the front page. Influencers who promote Shein also usually have promo codes that give their followers a certain percentage off their order. While this makes the prices lower for shoppers, the constant discounts encourage people to buy more. So, Shein earns a lot of money which lets them price their clothes even cheaper. [9] X Research source Shein typically offers free shipping on orders over $49. This also encourages people to buy more, which helps keep clothing prices low."
    },
    {
      "title": "Shein is an online fashion retailer based in China.",
      "content": "Shein is an online fashion retailer based in China. Shein was founded in 2008 in Nanjing, China. It primarily sells women’s fashion, shoes, and accessories, though it also sells men’s and children’s clothes. Shein sells its products to more than 150 countries all over the world and is now one of the largest online clothing retailers, making $100 billion in sales in 2022. [10] X Research source Shein is pronounced like “she in.” This comes from the company’s original name, SheInside."
    },
    {
      "title": "Shein is so popular because it sells trendy clothes at discount prices.",
      "content": "Shein is so popular because it sells trendy clothes at discount prices. Shein easily keeps up with the fast pace of fashion trends that Gen Z and Millennials flaunt. Shein uses their countless supplier contacts to immediately figure out what styles are trending and which ones aren’t. Their expansive network and quick turnaround means they’re able to produce new styles daily that keep their consumers on the cutting edge. And importantly, they do it all without charging luxury prices. [11] X Research source Shein also has a great social media presence, using popular influencers to promote their products, making limited collections with celebrities, and staying on top of social media trends, which Gen Z loves. Shein’s constant discounts and promo codes also incentivize consumers to keep coming back for more, adding to their popularity."
    },
    {
      "title": "Shein is great to save money, but its quality and ethics are controversial.",
      "content": "Shein is great to save money, but its quality and ethics are controversial. When you shop at Shein, you typically get what you pay for. Some clothes are well-made, while others use cheap materials that fall apart after 3 washes. Shopping at Shein is also a personal choice, as the amount of clothes they produce isn’t sustainable or environmentally friendly. The claims of low pay and poor working conditions make Shein’s ethics questionable, as well. [12] X Research source Always read reviews on Shein’s website before buying an item. Reviews tell you what the product looks like in person and if the product is good quality or runs small or large. If you want to shop more sustainably and ethically, go thrifting at consignment shops, vintage stores, or use second-hand apps like Depop or Poshmark. Or, invest your money in sustainable clothing brands like Reformation, Everlane, and Girlfriend Collective. If you’re returning a Shein order , your first ever return is free. After your first free return, Shein deducts a $7.99 shipping fee from your return."
    }
  ]
}