{
  "url": "https://www.wikihow.com/Tell-if-Your-Boss-Is-Sabotaging-You",
  "title": "How to Tell if Your Boss Is Sabotaging You",
  "steps": [
    {
      "title": "Sabotage in the workplace is when someone undermines your career.",
      "content": "Sabotage in the workplace is when someone undermines your career. While we most often hear about sabotage from coworkers, a boss or a supervisor can sabotage you as well. [1] X Research source Typically, a boss might sabotage someone because they didn’t want you hired in the first place, because they’re a bully, or because they simply don’t like you. Sabotage from your boss is a sign that they don’t respect you and that they’re likely insecure. Being sabotaged long-term can lead to fear and insecurity in the workplace, and it can make you feel undervalued and underappreciated at your job."
    },
    {
      "title": "You got insufficient training.",
      "content": "You got insufficient training. Does your boss ask you to do things that you don’t know how to do? Or, maybe they throw you into situations they know you aren’t prepared for. This is likely because they want to watch you flounder or have to ask them for help. You might feel like you don’t understand the job fully or like you don’t have the tools you need to succeed. [2] X Research source"
    },
    {
      "title": "You’re treated differently than your coworkers.",
      "content": "You’re treated differently than your coworkers. You might be getting singled out, but not in a good way. When your boss is sabotaging you, you might be overlooked for promotions or criticized regularly. Or, your boss might micromanage you and only you. [3] X Research source You might feel like you’re constantly being watched or monitored, while your coworkers have much more freedom."
    },
    {
      "title": "You’re left out of meetings or events.",
      "content": "You’re left out of meetings or events. You might be working on a team, but you don’t feel very included. Your boss might schedule meetings when they know you’re busy, or your workstation may move away from the action. Your boss might not invite you to optional events, like happy hours or lunches. This could make you feel lonely, isolated, and left out. [4] X Research source"
    },
    {
      "title": "Your boss undermines your authority.",
      "content": "Your boss undermines your authority. If you’re in charge of anything, your boss will question all of your decisions. They might even talk over you in meetings or ignore you completely. They could also shoot down your ideas, either in front of others or one-on-one, which can leave you feeling powerless or like you’re never good enough. [5] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "You are blamed for your boss’s mistakes.",
      "content": "You are blamed for your boss’s mistakes. Your boss is the leader, and good leaders will take responsibility for their actions. If your boss’s aim is to sabotage you, they might point the finger at you, even if it wasn’t fully your mistake. They might even bring up past mistakes of yours to shift the focus off of them and onto you. As such, you’ll likely feel like a constant scapegoat in your workplace. [6] X Research source"
    },
    {
      "title": "You’re set up to fail.",
      "content": "You’re set up to fail. It seems like whenever you show up to work, there’s always a fire to put out. Or, you might get assigned an impossible task that your boss knows you can’t complete. Your boss might even be “too busy” to sign off on your work, making it look like you’re missing your deadlines. You’ll likely feel frustrated and used, and you could even feel incompetent (even though you’re not). [7] X Research source"
    },
    {
      "title": "Your boss takes credit for your achievements.",
      "content": "Your boss takes credit for your achievements. We all know someone who can’t come up with their own ideas. Even more nefarious, though, is when your boss takes credit for something you did or said. The lack of recognition and disrespect can cause you to feel powerless, hopeless, and mistreated. [8] X Research source"
    },
    {
      "title": "Your boss doesn’t give you feedback.",
      "content": "Your boss doesn’t give you feedback. A good leader will tell you what you’re doing well and what you can improve on. If your boss wants you to fail, they won’t give you any feedback at all, likely in the hopes that you continue to make mistakes or go down the wrong path. This can make you feel uncertain, stuck, and undervalued. [9] X Research source On the flip side, some bosses will be overly nitpicky, giving you too much feedback all the time."
    },
    {
      "title": "You’re given tasks that no one else wants.",
      "content": "You’re given tasks that no one else wants. Maybe you keep getting the menial tasks that everyone’s supposed to share, or you’re stuck doing entry-level work even though you have experience under your belt. Your boss is likely keeping you stagnant so you don’t have a chance to advance, which can leave you feeling frustrated, bored, and unrecognized. [10] X Research source"
    },
    {
      "title": "Your boss takes away responsibilities.",
      "content": "Your boss takes away responsibilities. Your boss might strip you of your title or your duties to signal that they don’t value you as an employee. Minimizing or reducing your tasks is a clear sign of sabotage, and it could also be a sign that your time as an employee is limited. This can leave you feeling anxious, unappreciated, and disappointed. [11] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Your boss belittles you in public.",
      "content": "Your boss belittles you in public. A good boss will approach you one-on-one to give you constructive feedback on your work. A boss who is trying to sabotage you might berate you in front of your coworkers or even in front of clients. This is basically bullying with an audience, and you’ll probably feel humiliated, unsupported, and insulted. [12] X Research source"
    },
    {
      "title": "Your boss badmouths you to others.",
      "content": "Your boss badmouths you to others. Not only will your boss talk badly about you with your coworkers, but they might talk badly about you with other higher-ups, too. This can prevent you from getting promotions and can paint you in a negative light, which could leave you feeling unappreciated and disappointed. [13] X Research source"
    },
    {
      "title": "You feel harassed.",
      "content": "You feel harassed. When a boss is truly trying to sabotage you, they might even cross the line into full on harassment. This can include isolating you, threatening you, gaslighting you, or even being bigoted toward you. This constant abuse will likely leave you feeling scared, hurt, and fearful. [14] X Trustworthy Source US Equal Employment Opportunity Commission U.S. government agency that enforces civil rights in the workplace Go to source"
    },
    {
      "title": "You’re exhausted all the time.",
      "content": "You’re exhausted all the time. When you’re dealing with not only a bad boss, but one who is actively sabotaging you, it saps a lot of your energy. You might notice that even outside the workplace, you feel tired, sick, or emotionally drained. [15] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Document everything that happens.",
      "content": "Document everything that happens. If you have proof of your boss’s actions, you’re much more likely to get them to stop. Save every email and text message that you can, and try to talk to witnesses who have seen your boss harassing you. Compile all of your documentation in case you need to use it later on as you deal with an abusive boss . [16] X Research source"
    },
    {
      "title": "Speak to a higher-up or human resources.",
      "content": "Speak to a higher-up or human resources. If your workplace has an HR department, start there. If not, approach a supervisor or someone in charge of your boss. Bring all of your documentation and let them know what your boss has been doing to see if you can reach a solution. [17] X Trustworthy Source US Equal Employment Opportunity Commission U.S. government agency that enforces civil rights in the workplace Go to source If you don’t have any evidence of your boss’s actions, it will probably be your word against theirs. Try to bring in some coworkers who have seen the harassment so they can back you up. If your higher-ups don’t take you seriously, it’s time to talk to an attorney. A licensed attorney will take a look at your case to see if you have concrete evidence of your boss’s actions."
    },
    {
      "title": "Ask to transfer to a new area in the workplace.",
      "content": "Ask to transfer to a new area in the workplace. It’s likely that you want to get away from your boss, but you don’t have to leave your job entirely. Talk to HR or another supervisor about working in a different department that your boss isn’t in charge of. That way, you can still keep your job, but you won’t have to deal with a toxic boss anymore. [18] X Research source"
    },
    {
      "title": "Take time off if you need to.",
      "content": "Take time off if you need to. Dealing with a boss who sabotages you is tough, and you’re probably very tired. If you have any PTO or vacation time, consider taking a few days to rest up and recover. [19] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Consider talking to a therapist or psychologist during your time off. Dealing with a bad boss like this is stressful, and talking to a professional can help you work through your emotions. If you can’t take time off, practice self care before and after work. Do at least 1 activity per day that soothes and relaxes you so you come back to work feeling calm and refreshed."
    },
    {
      "title": "Look for a new job as a last resort.",
      "content": "Look for a new job as a last resort. If you’ve tried to transfer or get your boss in trouble and nothing has changed, your workplace might be the problem (not just your boss). Update your resume and start looking for new jobs, because you deserve to feel safe and happy in the workplace. [20] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    }
  ]
}