{
  "url": "https://www.wikihow.com/Whine-Your-Waist",
  "title": "How to Whine Dance (And the Health Benefits of Moving Your Waist)",
  "steps": [
    {
      "title": "Stand with your feet shoulder-length apart.",
      "content": "Stand with your feet shoulder-length apart. To start whining, stand on a flat surface. Hold your feet about shoulder-length apart. Keep your feet flat on the ground to maintain your balance. [1] X Research source"
    },
    {
      "title": "Roll your waist in a clockwise or counterclockwise motion.",
      "content": "Roll your waist in a clockwise or counterclockwise motion. To start getting the feel of whining, simply roll your waist in a circle. Do not try to incorporate too much movement. Just get used to the feel of moving your waist while keeping the rest of your body still. [2] X Research source Go as slowly as you need to go to pick up on the movement. It can take awhile to get used to moving your waist while keeping your shoulders and torso in place. Keep circling your hips slowly until you feel confident in the motion. A great way to gain confidence, according to hip-hop dance instructor Yolanda Thomas, is by recording yourself. “On video, you don't even notice a mistake if your recovery is quick, which is a present moment awareness,” she says."
    },
    {
      "title": "As you’re circling your waist, bend your knees.",
      "content": "As you’re circling your waist, bend your knees. Once you have a feel for the basic motion, you can lower your body down slightly. Bend your knees just a bit so your waist sinks down toward the floor. Go as low as you feel comfortable. Then, move your body back up by un-bending your knees. Keep circling your waist the entire time. [3] X Research source"
    },
    {
      "title": "Start leaning side to side as you get comfortable.",
      "content": "Start leaning side to side as you get comfortable. Whining usually adds a variety of motion to the circling move. After you've mastered the basics of moving up and down while whining, move to the side. Shift your torso slightly to the left, lowering your knee as you shift your weight to the left side. Then, return to the starting position and repeat on the other side. [4] X Research source This move is a variation on whining. You can add it to a routine, but you can also simply whine with minimal movement."
    },
    {
      "title": "Try to keep your upper body relatively still with your back straight.",
      "content": "Try to keep your upper body relatively still with your back straight. Whining is all in your waist, hips, and legs. As you whine, be aware of your upper body. Keep everything above your waist fairly still—it helps to be conscious of your back and to keep it straight and elongated. [5] X Research source"
    },
    {
      "title": "Move your waist in a rhythmic pattern following the beat of the music.",
      "content": "Move your waist in a rhythmic pattern following the beat of the music. As you get comfortable moving your waist in a circle, try to follow a whining pattern. Move your hips forward, to the side, backward, and then to the other side. Do this while counting, \"One... two... three... four…\" in your head. This will help you maintain rhythm while you whine. [6] X Research source Whine faster as the tempo (speed of the beat) increases and slow down as it decreases. Thomas advises “listening to the lyrics of the song or the changes in the music to get ideas for free-styling” once you get comfortable whining."
    },
    {
      "title": "Add some variation by moving front to back and side to side.",
      "content": "Add some variation by moving front to back and side to side. As you get comfortable whining, try adding some variation. You can dance in front of someone while whining, leaning your behind back slightly. Slow whining includes dancing very slowly to exaggerate the movements of your hips. Leaning to one side and then another while whining can also add some variation."
    },
    {
      "title": "Stretch between sessions.",
      "content": "Stretch between sessions. Regular stretching can help increase your range of motion. Gentle stretches before and after dancing will improve your whining skills as you'll be more flexible. Thomas notes, “The main thing for [dancers] is calves—stretching calves and stretching quads.” For one stretch, bend your right knee at a 90 degree angle, keeping your right foot flat on the floor. Bend your left leg back behind you, parallel to your other leg and with your left foot stretching behind you. Hold for 30 seconds and then switch the positions of your legs. [7] X Research source Lie on your back with your knees bent at 90 degree angles. Bend your right leg in front of you while lifting your hips until you form a perpendicular angle with your right leg. Move your right leg towards the ceiling. Then, lower your leg slightly. Do 10 repetitions and then switch legs."
    },
    {
      "title": "Whining is an important dance in Caribbean culture.",
      "content": "Whining is an important dance in Caribbean culture. Whining is rooted in African spirituality and dance. The circular movements hold deep symbolism, which stem from the shape of a circle itself—representing unity, community, and spirituality. [8] X Research source Some people associate whining with twerking , and although they both stem from African traditions, twerking has become a sexualized dance in today’s society. Twerking involves movements that follow more of an up and down pattern, while whining follows circular motions. [9] X Research source Many argue that whining should be thought of as a separate dance from twerking, because whining is a cultural part of the Caribbean and Africa. Some Westerners view whining as vulgar because of the pelvic gyration. However, this may be rooted in historical attempts to erase African and Black culture or the Western aesthetic preference for thin waists and women (many African and Caribbean cultures celebrate curves and bigger waists)."
    },
    {
      "title": "Whining improves the range and mobility of your hips, among other benefits.",
      "content": "Whining improves the range and mobility of your hips, among other benefits. If you work a desk job or aren’t generally very active, you probably don’t move and stretch your hip region a whole lot. Whining and other dance workouts are a great way to engage this region and help you become more aware and comfortable in your body. [10] X Research source Whining also: Burns calories Increases your endurance Improves your whole-body coordination Improves your overall mobility Did you know? Good hip mobility can help with your balance, reduce your risk of injury, help you recover from injuries more easily, and promote overall ease of movement. [11] X Research source"
    }
  ]
}