{
  "url": "https://www.wikihow.com/Treat-Skin-Allergies-in-Golden-Retrievers",
  "title": "How to Treat Skin Allergies in Golden Retrievers",
  "steps": [
    {
      "title": "Limit your Golden Retriever’s time outside.",
      "content": "Limit your Golden Retriever’s time outside. One way to treat CAD is to reduce exposure to environmental allergens. For some dogs, this will mean avoiding cut grass, or staying indoors during peak pollen season. When your Golden Retriever does need to go outside, wipe it down with a wet cloth afterwards to remove the pollen from its fur and skin. Keeping your Golden Retriever inside all the time may make it get antsy and hyper, though, so this method may not be practical for every dog. [2] X Research source Pay special attention to wiping off your Golden Retriever’s paws. [3] X Expert Source Jamie Freyer, DVM Licensed Veterinarian Expert Interview. 7 December 2021. Your dog could lick its paws or touch another part of its body with the paws and trigger an allergic reaction. Reducing exposure can be effective if your vet identified the specific ‘culprit’ allergen. Without knowing the specific allergen, reducing exposure would be very difficult. [4] X Research source"
    },
    {
      "title": "Minimize exposure to dust and dust mites.",
      "content": "Minimize exposure to dust and dust mites. If your Golden Retriever is allergic to dust or dust mites, several avoidance strategies are available. For example, dust and vacuum your home frequently (at least once a week). [5] X Expert Source Jamie Freyer, DVM Licensed Veterinarian Expert Interview. 7 December 2021. In addition, wash your Golden Retriever’s bedding in hot water regularly. Changing your air filters regularly, according to product instructions, will also help keep dust out of the air in your home. [6] X Research source Other strategies to reduce exposure to dust and dust mites are: Placing a plastic cover over your dog’s bed Using the air conditioner when it’s hot outside Keeping your Golden Retriever in non-carpeted rooms, such as the kitchen Keeping your Golden Retriever out of recently vacuumed areas Not giving your Golden Retriever stuffed toys to play with, since they could accumulate dust"
    },
    {
      "title": "Reduce mold levels in your home.",
      "content": "Reduce mold levels in your home. Mold is another common allergen associated with CAD. If your Golden Retriever is allergic to mold, consider using dehumidifiers, which reduce humidity in the air. Dehumidifiers are available at home supply stores. Also, avoid having houseplants, since the soil of potted plants can get moldy. [7] X Research source Keeping your Golden Retriever out of the basement and avoiding dusty pet foods can also reduce mold exposure. If you do have house plants, put activated charcoal on the soil to prevent mold development. Look for activated charcoal at your local gardening store. Clean your dehumidifiers according to the product’s instructions. Cleaning them will help them work more effectively."
    },
    {
      "title": "Use a medicated, pet-specific shampoo.",
      "content": "Use a medicated, pet-specific shampoo. Bathing your Golden Retriever is an important component of treating CAD, since it will remove allergens that may have settled on your dog’s fur. If your Golden Retriever has scratched its skin so much that it has become infected, a medicated shampoo will help treat those infected skin lesions. Medicated shampoo will contain either an antimicrobial or antifungal ingredient. Medicated shampoos often contain oatmeal or essential fatty acids to keep the skin from drying out. [8] X Expert Source Jamie Freyer, DVM Licensed Veterinarian Expert Interview. 7 December 2021. Purchase the medicated shampoo at your vet’s office. Do not use a human shampoo to bathe your dog. Dog skin and human skin have different pH levels. Because of the pH differences, human shampoo could irritate your Golden Retriever’s skin."
    },
    {
      "title": "Bathe your Golden Retriever regularly.",
      "content": "Bathe your Golden Retriever regularly. To help your Golden Retriever feel less itchy, bathe it either once a week or every other week. Even if your Golden Retriever feels really itchy, do not bathe it too frequently (more than once a week)—this could strip its skin of essential oils, causing dry skin. If your Golden Retriever still seems uncomfortably itchy with weekly or bi-weekly bathing, talk with your vet about how often you should bathe your dog. Consider rinsing or wiping down your Golden Retriever each day. This would remove the allergens in between baths. However, this may not be practical if you have a busy schedule. You could also use a topical anti-inflammatory product between baths on the itchy spots. This product, which would contain a steroid like hydrocortisone, would be available at your vet’s office. If your Golden Retriever has skin lesions, wash very gently around those areas, since they may be very sensitive to the touch."
    },
    {
      "title": "Apply a conditioner after the bath.",
      "content": "Apply a conditioner after the bath. When you finish bathing your Golden Retriever, apply a leave-in conditioner to the skin and coat. This conditioner will not only soothe the skin, but also serve as a barrier to keep allergens from contacting the skin. [9] X Research source Apply the conditioner according to the product label instructions. Use a pet-safe conditioner."
    },
    {
      "title": "Consult with your vet about treatment with antihistamines.",
      "content": "Consult with your vet about treatment with antihistamines. Antihistamines are commonly used to treat allergies in dogs. They work by blocking the release of histamine from mast cells (cells involved in allergic reactions). Antihistamines work best in dogs with seasonal or mild skin allergies. If this describes your Golden Retriever’s CAD, then your vet will probably prescribe an antihistamine. [10] X Research source Antihistamines are effective in about 30% of dogs with CAD. Antihistamines are inexpensive and have very few side effects."
    },
    {
      "title": "Administer the antihistamine as prescribed.",
      "content": "Administer the antihistamine as prescribed. Antihistamines work best when given consistently, not just as needed. If you give your Golden Retriever the antihistamine after an allergic reaction has started, then it’s already too late—the antihistamine needs to be in your dog’s system before the mast cells have a chance to release histamine. [11] X Research source Your vet will probably want you to give your Golden Retriever an antihistamine two to three times daily. Antihistamines for dogs are given by mouth."
    },
    {
      "title": "Try several antihistamines.",
      "content": "Try several antihistamines. Antihistamines do not work the same in every dog. For this reason, your vet may recommend trying up to three antihistamines before moving on to a different type of therapy. Examples of dog-safe antihistamines are Benadryl, Zyrtec, and Claritin. These are human, over-the-counter antihistamines, but their dosages can be adjusted to be effective in dogs. Note that the active medication in Benadryl can vary depending on the country. Always check with a vet to make sure the key component of any antihistamine is safe. [12] X Expert Source Jamie Freyer, DVM Licensed Veterinarian Expert Interview. 7 December 2021. Try each antihistamine for 10 – 14 days. [13] X Research source Your Golden Retriever may need a higher dose of antihistamine than a human would need. Before using these over-the-counter antihistamines, ask your vet what dosage of antihistamine your dog will need. With each antihistamine, contact your vet to let them know if your Golden Retriever’s symptoms are getting any better. Your Golden Retriever may still be itchy with antihistamine therapy. However, the itchiness will probably be less than what it was before."
    },
    {
      "title": "Discuss steroid treatment with your vet.",
      "content": "Discuss steroid treatment with your vet. Steroids are anti-inflammatory. By decreasing inflammation, steroids help a dog with CAD feel less itchy. However, steroids have serious long-term side effects, including increased drinking and urinating, liver enlargement, high blood pressure, and a weakened immune system. Because CAD requires lifelong therapy, you and your vet will need to discuss the safest way to use steroids to treat your Golden Retriever’s CAD. Even though steroids rapidly reduce itching and inflammation, your vet’s goal may be to limit or even eliminate the use of steroids for your Golden Retriever. [14] X Research source Prednisone is a type of steroid used to treat CAD. [15] X Research source"
    },
    {
      "title": "Follow treatment instructions.",
      "content": "Follow treatment instructions. Steroids can be given as short-term relief for flare-ups (temporary episodes of itchiness). [16] X Research source They can also be given for the duration of an allergy season, as long as the season is short (a few months or less). As a third option, steroids can be given as long term, low-dose therapy. Your vet will determine which type of steroid therapy your Golden Retriever will need. If your Golden Retriever needs long term steroid therapy, your vet may prescribe a low dosage to be given every other day. Your vet would start with an initial dosage, then gradually decrease that dosage as your Golden Retriever’s symptoms improve. Do not make changes to the steroid dosage on your own. This could make treatment more challenging."
    },
    {
      "title": "Monitor your Golden Retriever for side effects.",
      "content": "Monitor your Golden Retriever for side effects. If your Golden Retriever is on long term steroid therapy, monitoring for side effects is very important. In addition to observing your dog at home, your vet will want to see your dog regularly to analyze blood and urine samples. [17] X Research source For example, because steroids can cause liver enlargement, your vet will want to look for increased levels of liver enzymes in your dog’s blood. If you notice any side effects (e.g., drinking and urinating more often, diarrhea, increased panting) at home, contact your vet right away. You do not have to wait until your regularly scheduled appointment to have your Golden Retriever examined."
    },
    {
      "title": "Use other skin allergy therapies with steroids.",
      "content": "Use other skin allergy therapies with steroids. In addition to steroids, your vet may prescribe other medications, such as antihistamines, with the goal of limiting or eliminating steroid use. Follow prescription instructions for these other medications. Your vet will determine if the other medications are working well enough to start phasing out the steroids from the treatment plan."
    },
    {
      "title": "Discuss cyclosporine treatment with your vet.",
      "content": "Discuss cyclosporine treatment with your vet. Your vet may recommend a drug called cyclosporine, which is a non-steroidal anti-inflammatory drug. Unlike steroids, long term cyclosporine therapy is generally well tolerated by dogs. [18] X Research source However, cyclosporine is expensive, especially for large breed dogs. Fortunately, as a dog starts to respond to cyclosporine therapy, the required dosage would decrease. Therefore, the cost of cyclosporine therapy would decrease over time. Talk with your vet if you are concerned about the overall cost of cyclosporine. Atopica® is the brand name for cyclosporine that is used in dogs."
    },
    {
      "title": "Administer cyclosporine as prescribed.",
      "content": "Administer cyclosporine as prescribed. Cyclosporine is an oral drug. Initially, it is usually given daily for 4‒6 weeks. Then, the dosage is gradually decreased to the lowest effective dose. Give the cyclosporine on an empty stomach. [19] X Research source"
    },
    {
      "title": "Monitor your Golden Retriever for side effects.",
      "content": "Monitor your Golden Retriever for side effects. Cyclosporine can cause several side effects, including vomiting and diarrhea. Side effects usually occur within the first two weeks of therapy. Contact your vet if you observe these side effects. Your vet may recommend stopping the cyclosporine for a few days, then restarting it by giving it with a small amount of food. If there’s no diarrhea and vomiting after a few days, go back to giving cyclosporine on an empty stomach. [20] X Research source Infections and thickening of the gums are rare side effects of cyclosporine."
    },
    {
      "title": "Wait for a response to therapy.",
      "content": "Wait for a response to therapy. Unlike the rapid treatment response with steroids, it may take 6‒8 weeks before your Golden Retriever responds to cyclosporine therapy. Even if you become impatient with waiting for a treatment response, do not change the cyclosporine dosage on your own—this could lead to treatment failure, which could make your Golden Retriever feel even itchier. [21] X Research source"
    },
    {
      "title": "Schedule follow-up visits with your vet.",
      "content": "Schedule follow-up visits with your vet. Because cyclosporine decreases the immune response, your Golden Retriever’s immune system function may go down. Your vet will want to check your Golden Retriever’s white blood cell count regularly to assess the health of its immune system. If the white blood cell counts are low, your vet may need to adjust the cyclosporine dosage. These follow-up visits will also allow your vet to determine how well your Golden Retriever is responding to therapy."
    },
    {
      "title": "Ask your vet how immunotherapy works.",
      "content": "Ask your vet how immunotherapy works. Immunotherapy, also called Allergen Specific Immunotherapy (ASIT), is usually the best choice for treating CAD. It can help your Golden Retriever achieve remission (no visible signs of CAD) without the use of other medications (e.g., steroids, antihistamines). ASIT works by gradually desensitizing your dog’s immune system to the allergens causing the CAD. [22] X Research source The immunotherapy medicine, commonly given by injection, contains small amounts of the specific allergens to which your Golden Retriever is allergic. By exposing your Golden Retriever to small, measured amounts of the allergens (rather than a large, uncontrolled amount in the environment), your dog’s immune system would slowly become more tolerant of the allergens over time, therefore lessening the allergic reaction. [23] X Research source Results of the skin tests your vet performed to diagnose CAD would indicate the specific allergens. Immunotherapy is most helpful for dogs that have skin allergies for longer than two to three months at a time and have not responded well to other skin allergy medications. It is a lifelong treatment."
    },
    {
      "title": "Have your vet perform the immunotherapy injections.",
      "content": "Have your vet perform the immunotherapy injections. Immunotherapy injections are usually given about once every one to four weeks. Your vet will let you know how often your Golden Retriever will need the injections. It may help to schedule several appointments at one time to make sure your dog receives stays on schedule with the treatment. At the beginning of immunotherapy, your vet will increase the dosage of allergens until a maintenance dosage is reached. Your vet will determine the maintenance dosage and keep your Golden Retriever at this dosage level. Your vet may change the frequency of injections during the course of therapy. [24] X Research source"
    },
    {
      "title": "Wait for a treatment response.",
      "content": "Wait for a treatment response. This may be the hardest part of immunotherapy, since it may take anywhere from a few months to a full year before a dog responds to this type of therapy. Because your Golden Retriever will not respond to immunotherapy very quickly, your vet will recommend treating your dog with other skin allergy medications during the course of immunotherapy. Before starting immunotherapy, your vet will probably ask that you commit to this treatment for at least 1 year to see if it will work. [25] X Research source Approximately 60 – 75% of dogs on immunotherapy will experience a 50% improvement in symptoms. This amount of improvement could mean that a dog does not need to be on other skin allergy medications. [26] X Research source"
    }
  ]
}