{
  "url": "https://www.wikihow.com/Wash-Velvet",
  "title": "How to Clean Your Velvet Upholstery & Clothing at Home",
  "steps": [
    {
      "title": "Check your upholstery’s care label for cleaning instructions.",
      "content": "Check your upholstery’s care label for cleaning instructions. Locate the tag on your velvet furniture or upholstery and see if there are any specific directions on how to clean it. Pure velvet made from silk, rayon, or wool, is much more delicate, so it’s better to take them to a professional dry cleaner or contact a cleaning service. If you have polyester or cotton velvet, you’re safe to wash them at home. [1] X Research source You can usually find tags along the bottom or inside edges of velvet pillow covers, sofas, curtains, and other pieces of upholstery. If you cannot locate the cleaning code, contact the upholstery manufacturer. Most companies have a database of furniture items and can provide you with important information about how to clean it."
    },
    {
      "title": "Vacuum velvet furniture with a brush attachment.",
      "content": "Vacuum velvet furniture with a brush attachment. Put the brush or upholstery attachment on your vacuum, and turn it on. Go over your velvet furniture following the direction of the nap to help remove any dust or dirt that’s trapped in the fabric. [2] X Research source Vacuum your velvet at least once a week. If you have pets that lie on your furniture, then consider vacuuming a couple of times a week to get rid of hair."
    },
    {
      "title": "Blot spills right away with a white cloth or paper towel.",
      "content": "Blot spills right away with a white cloth or paper towel. If you just spilled something on a velvet sofa or other piece of furniture, act fast to prevent a stain from setting in. Blot the spill gently with up and down motions to lift the liquid out of the fabric. [3] X Research source Avoid rubbing the towel back and forth over the velvet because it could make a stain set deeper in the fabric’s fibers."
    },
    {
      "title": "Get rid of water-based stains with soapy water.",
      "content": "Get rid of water-based stains with soapy water. Mix a few drops of liquid dish soap into a bowl of lukewarm water. Dip the corner of a white cloth into the soapy water and gently brush the stain with quick, light strokes. Work from the edge of the stain toward the center to lift it out of the fabric. When you’re finished, dab the stain with a dry cloth to absorb the moisture. Avoid scrubbing the stain aggressively because you may damage the velvet’s pile and make the stain set in deeper."
    },
    {
      "title": "Treat stubborn or oil-based stains with dry cleaning solvent.",
      "content": "Treat stubborn or oil-based stains with dry cleaning solvent . Dry cleaning solvent doesn’t contain water, so it’s less likely to damage or leave marks on your velvet. Put on a pair of rubber gloves and dip a corner of a clean cloth into the solvent. Starting from the edge of the stain, gently brush the stain with light, quick movements rather than scrubbing back and forth. When you’re finished, dab the excess cleaner up with a clean towel. If the stain persists, then dab upholstery spot cleaner onto it and let the cleaner sit for 1 minute. Wet a sponge with cool water and wring it out. Then, dab the stain to rinse out the cleaning solution. Test cleaners on an inconspicuous spot of your velvet upholstery first to make sure it doesn’t leave any noticeable marks or damage."
    },
    {
      "title": "Scrape off sticky or waxy substances with a dull butter knife.",
      "content": "Scrape off sticky or waxy substances with a dull butter knife. If you accidentally got chewing gum or candle wax on velvet upholstery, put a piece of ice in a plastic bag and hold it over the stain until it becomes brittle. Then, hold a dull, flat knife on its side and gently scrape the substance off of the fabric. [4] X Research source"
    },
    {
      "title": "Steam and brush the velvet to restore the pile.",
      "content": "Steam and brush the velvet to restore the pile. Fill an upholstery steam cleaner with water and let it heat up. Hold the steamer’s nozzle about 1 ⁄ 2 –1 inch (1.3–2.5 cm) over the fabric, and apply steam for 10–15 seconds to any areas where the pile is crushed or matted. After that, run an upholstery brush over the velvet following the direction of the pile and let it dry completely. [5] X Research source Avoid trying to iron out wrinkles on velvet upholstery because you could crush the pile and permanently damage the fabric."
    },
    {
      "title": "Read the care label",
      "content": "Read the care label on your clothing for specific cleaning instructions. Look for the care label inside the collar or attached along one of the inseams to see the specific recommendations. If your velvet is made from silk or cotton, or if the tag says “Dry Clean Only,” then it’s best to leave cleaning to a professional service. If you have synthetic velvet made from polyester, then it’s usually safe to wash at home. [6] X Research source If you can’t find the care tag, play it safe and take the velvet to a dry cleaner to prevent it from getting damaged. [7] X Expert Source Kamel Almani Laundry & Cleaning Specialist Expert Interview. 9 April 2021."
    },
    {
      "title": "Brush your clothes with a velvet brush after each time you wear it.",
      "content": "Brush your clothes with a velvet brush after each time you wear it. When you wear velvet clothes, dirt and dust can easily get caught in the fabric’s pile. Run a soft-bristled brush across your clothing following the direction of the pile to help fluff up the velvet and break apart any loose dust. [8] X Research source"
    },
    {
      "title": "Spot-treat stains with a gentle laundry detergent.",
      "content": "Spot-treat stains with a gentle laundry detergent . Mix a solution of lukewarm water and a few drops of laundry detergent in a small bowl. Dip the corner of a clean cloth in the mixture and gently dab it onto the stain, working from the edges toward the center. Keep working until the stain disappears, and dry the excess liquid off with a fresh towel. [9] X Research source Try to treat a spill or stain as soon as possible to prevent it from setting in."
    },
    {
      "title": "Hand-wash your velvet clothing",
      "content": "Hand-wash your velvet clothing for the gentlest clean. Fill a small tub or sink with cold or lukewarm water and add in about 1 tablespoon (15 ml) of gentle detergent. Place the garment in the water and let it soak for a minute. Swish the garment around in the water a few times to loosen any dirt or dust. Then, transfer the garment to a sink with clean cold water and swish it around to rinse out the detergent. [10] X Research source Avoid wringing out or squeezing water out of velvet clothing because you could flatten or damage the pile."
    },
    {
      "title": "Machine-wash synthetic velvet using a delicate cycle.",
      "content": "Machine-wash synthetic velvet using a delicate cycle. If the label says that it’s safe for your washer, put the garment inside a mesh bag to prevent it from snagging inside the machine. Opt for a mild or gentle detergent for your velvet. Set the water temperature to cold or lukewarm, and run a delicate cycle. Use the shortest spin cycle available on your washer to prevent your garment from getting damaged. [11] X Research source"
    },
    {
      "title": "Lay the garment flat or hang it up to let it air-dry.",
      "content": "Lay the garment flat or hang it up to let it air-dry. Lay the velvet flat on top of a drying rack or hang it up in a spot where there’s good airflow. Leave the velvet alone for a few hours or overnight so it has a chance to dry completely. [12] X Research source Avoid putting any velvet in your dryer because you could damage the pile permanently. Hanging your velvet clothes also helps remove minor wrinkles."
    },
    {
      "title": "Steam the garment to get rid of any wrinkles.",
      "content": "Steam the garment to get rid of any wrinkles. Fill a steamer with water and let it heat up. Hold the steamer’s nozzle about 1 inch (2.5 cm) from the fabric and pull the trigger. Keep moving the steamer over the garment so you don’t stay in one spot for too long. Once you remove all the wrinkles, use a velvet brush to fluff up the fibers. [13] X Research source Alternatively, try hanging your velvet clothing in a steamy bathroom for a few minutes to remove wrinkles. Avoid using an iron on velvet because it could flatten the pile and damage it permanently."
    }
  ]
}