{
  "url": "https://www.wikihow.com/Sneak-Past-Your-Home-Security-System",
  "title": "How to Sneak Past Your Home Security System",
  "steps": [
    {
      "title": "Identify your ideal escape route.",
      "content": "Identify your ideal escape route. You'll find the magnet sensors of most alarms on the windows and doors of your home. You'll want to choose a door or window that's easy to access and escape through. For windows, you'll also want to consider your path after you exit. Second story windows can be difficult to safely get down from without extra tools, like a ladder. Because of this, these windows should be avoided. If you plan to leave through a window, your best choice may be one that's ground level and roughly chest height."
    },
    {
      "title": "Inspect the alarm mechanism to verify it's magnetic.",
      "content": "Inspect the alarm mechanism to verify it's magnetic. Generally, magnet sensors will look like a small metal box. In some cases, this may have exposed pieces of magnet, which are usually dark in color. The sensor will have two parts. One will be stationary, and the other will be attached to the movable part of your door or window. When the magnetic bond between the fixed and movable parts of the sensor is broken, the alarm will be activated. Magnet sensors are almost always placed on the frame of the door or window at the top, bottom, or one of the sides. [1] X Research source Some magnetic sensors cannot be bypassed because they are placed inside the door jamb and the door."
    },
    {
      "title": "Use a magnet to bypass the sensor.",
      "content": "Use a magnet to bypass the sensor. You should be careful when attempting this, as some sensors are higher quality than others and this technique may not always work. However, in some cases, you may be able to place a fridge magnet on the sensor to trick it into thinking the door or window is closed even when open. For more sophisticated magnet sensors, you may need to use tools, like a screwdriver, to remove the movable part of the sensor on the door or window. Then, place it onto the stationary sensor to make it think the window is still closed. Before you remove any parts of the sensor, you might first want to take a picture of it with your cell phone. This way, you'll have a reference photo if you have to put it back together later. You may be able to check whether or not your fridge magnet works by applying it to the sensor and running a check on your security system, if that feature is available. If the sensor reads as closed when the fridge magnet is in place and the window open, this technique should work."
    },
    {
      "title": "Return the door or window to normal.",
      "content": "Return the door or window to normal. After you come back, you'll want to re-engage your alarm to prevent burglars from using your temporary escape route. To do this, simply return your door or window to the fully closed position and remove the magnet you used to trick the sensor. If you removed the movable part of the sensor because your system was more sophisticated, all you have to do is refasten that part into place. If you have difficulty remembering how to reinstall the mechanism, consult the picture you took earlier."
    },
    {
      "title": "Determine your exit point.",
      "content": "Determine your exit point. Button alarms, much like magnet alarms, are also common for windows and doors. [2] X Research source Choose an exit point that is easily accessible, like one that is free of clutter and opens easily. For windows, you should prioritize those that are chest high, as these will pose less of a risk for falling injuries. Falling from a second story window or higher could cause serious injury or death. For this reason, you should avoid windows this high."
    },
    {
      "title": "Familiarize yourself with the alarm.",
      "content": "Familiarize yourself with the alarm. Push button alarms will oftentimes have a thin, plastic casing that has a button built into it. When a door or window is opened, the button is released and the alarm is activated. In many cases, the button will be in the center of its casing and positioned in such a way that when fully closed, the door or the window fully presses it. Some button sensors may have a casing that contours itself so that the sides of the casing form a cradle for the door or window. The button for the alarm is often located in the center of this cradle."
    },
    {
      "title": "Block the button.",
      "content": "Block the button. By placing an object over the button to keep it engaged, you can fool your button alarm into thinking that the window or door is still closed. Depending on your situation, how you do this may vary. In some cases, you might: [3] X Research source Open the door or window in extremely tiny increments. Once the button is accessible, but still engaged, use a popsicle stick to hold the button down and keep the alarm from sounding. Use stiff card stock for sensitive alarms. Even opening your door or window a tiny amount might cause sensitive alarms to sound. Use a thin piece of stiff material, like card stock, and wiggle it between the space between the button and the door or window to hold the button in place."
    },
    {
      "title": "Fasten your button blocker.",
      "content": "Fasten your button blocker. To prevent setting off the alarm after you leave, you'll need to fasten your button blocker in place to prevent the alarm from activating. In most cases, you should be able to use a durable tape, like duct tape, to hold your button blocker in place and keep the button pressed. Many doors and windows are painted. Be careful when applying tape to these surfaces. Sometimes the tape can damage the paint job when you pull it free. For more permanent disabling measures, you may want to glue your button blocker in place. However, doing so will make this point more accessible to burglars as well."
    },
    {
      "title": "Remove your button blocker when the alarm is disengaged.",
      "content": "Remove your button blocker when the alarm is disengaged. Your button blocker may be obvious on your window, so you may want to remove it after you're done bypassing your alarm. Since removing your blocker while the alarm is activated may result in you setting it off, you may want to wait until the alarm is turned off before you remove your blocker."
    },
    {
      "title": "Scout the environment.",
      "content": "Scout the environment. Some cameras are stationary, but others move to pan a wide view of a location. You'll have to study the camera to determine the range of its view if you're going if you're going to sneak by it without being seen. Some cameras will be oriented at a single important point, like a corner, door, or entrance of a walkway. These may only narrowly focus on that point. Others may focus on a wide/long view, like down a hallway or even the side of a building. In many cases, there will be other items in the environment, like boxes, chairs, tables, and so on. You might be able to creep behind these to hide from the camera. If you set up a home security system, make it visible. Nowadays, cameras are relatively cheap. They are even wireless. You can plug them in. You can get a package of Costco and put them up very quickly."
    },
    {
      "title": "Chart your course.",
      "content": "Chart your course. If you've noticed the camera is angled downward, you may be able to pass by undetected by giving it a wide berth. If the camera is pointing in the distance, you may be able to creep close to the wall outside its view. Planning possible routes before attempting to sneak could reveal even better paths for you to take. It may help to draw potential routes past the camera on a piece of paper to evaluate your options. Make a simple drawing of the environment, shade the likely area of the camera's vision, and draw lines to represent possible unseen paths you can use. Some cameras may have be equipped with wide angle lenses to give a broader view. To account for this, you should make the suspected field of vision for the camera slightly larger than you originally think."
    },
    {
      "title": "Err on the side of caution when sneaking.",
      "content": "Err on the side of caution when sneaking. You might feel silly flattening yourself against the wall at the base of a camera to inch past it without being seen, but if even a piece of clothing or a limb is caught on film, you could be busted. For this reason, you should always give potential areas of the camera's vision as much cushion space as possible. Before sneaking, you may want to imagine the view from the camera's perspective as a final check to see if you've overlooked something. When sneaking behind objects, like desks and chairs, try to stay as close to the item as possible. This will cut down the angle of visibility of overhead cameras. If sneaking behind objects, like desks and chairs, mind that gaps don't give you away and make yourself as small as possible to prevent a limb or piece of clothing from getting caught on camera."
    },
    {
      "title": "Return with caution.",
      "content": "Return with caution. When coming home, especially after a fun time with friends, it can be easy to forget the camera and pass by it like you might normally. You'll have to creep by the camera in the same fashion you did while leaving for there to be no trace of your passing."
    }
  ]
}