{
  "url": "https://www.wikihow.com/Write-Creepypasta",
  "title": "How to Write Creepypasta",
  "steps": [
    {
      "title": "Have vision and creativity.",
      "content": "Have vision and creativity. This is the first step to creating any piece of art, especially stories. A good indicator of vision is when the phrase \"what if\" is used. Some good examples are: What if someone hides outside your room every night waiting for the perfect chance to kill you? What if there's a demon that is possessing your loved ones and killing them off? The possibilities for your stories are limitless."
    },
    {
      "title": "Know the elements of horror.",
      "content": "Know the elements of horror. Think of what scares you, and why it scares you. Being alone, darkness, imminent danger, and things that seem normal but are somewhat off tend to be scary things. But why do these things scare you? It tends to be that it's our natural response to things that could be dangerous (about surviving in the wilderness). We are never completely sure if something is hiding in the darkness. Being alone means that you don't have the power of being in numbers to fight predators. Knowing there's imminent danger is a more obvious example, and when you know something is off, you simply can't trust it to be safe. Knowing what scares you and why it does will allow you to write great creepypasta."
    },
    {
      "title": "Decide what your creepypasta will be about.",
      "content": "Decide what your creepypasta will be about. An abandoned building? A meme, like Slender Man or Zalgo? A failed experiment? A ghostly serial killer? A crazy person? There are many great topics for creepypasta, and the possibilities are endless."
    },
    {
      "title": "Develop your characters and your setting.",
      "content": "Develop your characters and your setting. Remember that this is not a novel, so you don't have to be too in-depth."
    },
    {
      "title": "Start writing the plot.",
      "content": "Start writing the plot. For creepypasta, a first-person narrative is usually the most effective. How will it begin? A dark, tall man lurking in the woods? A series of entries from a failed government project? A person going and purchasing a demonic doll that happens to like mutilating children? Usually, a more morbid beginning is better, but remember, there may be kids out there reading your pasta."
    },
    {
      "title": "Edit, edit, edit!",
      "content": "Edit, edit, edit! Most first drafts aren't perfect. If you want your pasta to be successful, then editing is a must. Edit them once a day, re-read them and repeat the following day. Remember to look out for nasty grammar and spelling errors!"
    },
    {
      "title": "Publish it, whether on your website, another website or even a creepypasta wiki.",
      "content": "Publish it, whether on your website, another website or even a creepypasta wiki."
    }
  ]
}