{
  "url": "https://www.wikihow.com/Wrap-Your-Hair-in-a-Scarf-for-Bed",
  "title": "How to Wrap Your Hair in a Headscarf Before You Sleep",
  "steps": [
    {
      "title": "Tie your hair back into a loose bun.",
      "content": "Tie your hair back into a loose bun. Gather your hair or dreads and make a loose bun near the back of your head. Position the bun near the nape of your neck or the center of your head depending on which is more comfortable for you. [1] X Research source hhttps://www.tiktok.com/@travelingwithjessica/video/7302853339945913643?lang=en Skip this step if you have short hair, or want to preserve a particular style. This method is great for preserving parted hairstyles, or styles that lay flat on top of your head."
    },
    {
      "title": "Fold the scarf into a triangle and lay the long side across your forehead.",
      "content": "Fold the scarf into a triangle and lay the long side across your forehead. Take a large silk scarf and lay it flat. Then fold 1 corner over to meet the opposite corner to make a triangle. Grab the 2 folded corners and drape the long folded edge over your forehead so that the scarf rests over your hair. [2] X Research source"
    },
    {
      "title": "Tie the ends of the scarf near the base of your neck.",
      "content": "Tie the ends of the scarf near the base of your neck. Wrap the folded ends along your hairline and back to the nape of your neck. Hold them firmly so the tension keeps the scarf from slipping. Then tie the ends into a knot at the base of your neck to secure them. [3] X Research source You'll still have a corner of the scarf pointing down below the ends beneath the knot at this point."
    },
    {
      "title": "Fold the loose ends under the scarf or tie them up near your forehead.",
      "content": "Fold the loose ends under the scarf or tie them up near your forehead. Use your fingers to tuck the long ends, as well as the loose corner, beneath the edges of the scarf. If the ends are especially long, bring them back around to the front of your head and tie them in a knot near your forehead. [4] X Research source To secure the scarf even more, wear an elastic headband over the scarf. This will prevent it from slipping as you sleep."
    },
    {
      "title": "Fold a square scarf into a triangle.",
      "content": "Fold a square scarf into a triangle. Get out a large silk or satin scarf and lay it flat. Take 1 corner of the square and fold it so it meets the opposite corner. The long folded side of the scarf forms the base of a triangle. [5] X Research source Lay the softer side of the scarf face down before you fold it. This will reduce friction which can cause frizzy hair."
    },
    {
      "title": "Place the folded edge of the triangle against the nape of your neck.",
      "content": "Place the folded edge of the triangle against the nape of your neck. Hold both ends of the folded scarf and bring the center of the folded side to the base of your neck. Make sure no hair is between the scarf and your neck. [6] X Research source"
    },
    {
      "title": "Bring the ends of the scarf up to the top of your head and tie them.",
      "content": "Bring the ends of the scarf up to the top of your head and tie them. Pull both folded corners of the scarf up along your hairline towards the top of your head, covering your ears. Keep the scarf taut so the folded side stays firmly along the nape of your neck. Then, tie the ends into a knot and tighten it until the knot rests securely on your forehead. [7] X Expert Source Amber Rose Licensed Cosmetologist Expert Interview. 13 April 2021. If the knotted ends hang in front of your face, tie them with a bow or knot them at the nap of your neck. Alternatively, tuck the long ends under the scarf to keep them in place. [8] X Expert Source Amber Rose Licensed Cosmetologist Expert Interview. 13 April 2021. If the scarf feels too tight, rewrap it so you don't give yourself a headache."
    },
    {
      "title": "Tuck the pointed corner of the scarf under the knot.",
      "content": "Tuck the pointed corner of the scarf under the knot. Now that the scarf is secure around your hairline, pull the pointed corner of the scarf forward over your hair. Ensure that your hair is contained under the scarf, and then push the pointed corner under the knot that you made near your forehead. Wrap the corner over and under the knot so it's secure. [9] X Research source Skip this step if you’re wrapping short hair , or just like to leave your hair looser instead of containing all of it under the scarf."
    },
    {
      "title": "Tie your hair into a loose ponytail on top of your head.",
      "content": "Tie your hair into a loose ponytail on top of your head. Pull your hair together and up onto the top of your head. Then tie it into a loose ponytail with a scrunchie and let your hair fall in front of your face. This is known as a “pineapple.” Avoid tying the hairband too tight or it might be uncomfortable to sleep in. [10] X Research source Using a scrunchie prevents kinks from forming in your hair overnight. Wrapping a scarf over pineappled hair keeps your curls neat and intact."
    },
    {
      "title": "Fold the scarf into a triangle and tie the ends near your forehead.",
      "content": "Fold the scarf into a triangle and tie the ends near your forehead. Take a large rectangular scarf and fold one corner over to the opposite corner to create a triangle. Then place the long, folded edge at the nape of your neck, and bring the folded corners forward along your hairline. Cross the ends to form a loose knot, as you would when you begin to tie your shoes. [11] X Research source"
    },
    {
      "title": "Wrap the folded corners to the back of your neck and tie them off.",
      "content": "Wrap the folded corners to the back of your neck and tie them off. Bring the ends of the scarf back down towards your neck, and tie the scarf into a firm knot . Then, tuck the loose corner of the scarf under the front of the wrap, near your forehead. This covers your hair and keeps it safe during the night. [13] X Research source For extra hair protection, cover your wrapped hair in a silk pillowcase or cap. This can be especially effective if you're protecting braids ."
    }
  ]
}