{
  "url": "https://www.wikihow.com/Wear-a-Haori-Coat",
  "title": "How to Wear a Haori Coat",
  "steps": [
    {
      "title": "The haori should be the centerpiece of your outfit.",
      "content": "The haori should be the centerpiece of your outfit. Haoris for women are characteristically bright with bold patterns, while haoris for men are dark or muted colors. Pick a plain neutral t-shirt or blouse to place underneath it. Wear the haori over the plain shirt so the shirt doesn’t take the attention away from the beautiful pattern and colors. Try a thin t-shirt in white, black, or grey. You may also choose a solid color t-shirt that matches one of the colors in the haori. Consider a neutral toned button up or blouse."
    },
    {
      "title": "Jeans are great when you want to dress your haori down.",
      "content": "Jeans are great when you want to dress your haori down. Haoris are versatile articles of clothing that look good with any bottom. Jeans look great with them because they are a neutral bottom that gives the haori a casual vibe. You can wear this outfit when you go shopping or out with friends."
    },
    {
      "title": "Haoris are lightweight enough for spring and summer.",
      "content": "Haoris are lightweight enough for spring and summer. Shorts with a neutral top and a bright haori can be a great combination for a warm day."
    },
    {
      "title": "Your haori will look great with a knee-length or maxi skirt.",
      "content": "Your haori will look great with a knee-length or maxi skirt. Both of these skirts work well with the long haori jacket since they will fall below the hem of the jacket."
    },
    {
      "title": "Create a cozy layered look.",
      "content": "Create a cozy layered look. Haoris are oversized, so they make a great garment for the winter time. You can wear them over thick sweaters or cardigans for a fashionable and warm winter look. Try pairing a sweater, haori, scarf, knit hat, and boots for a fashionable warm outfit."
    },
    {
      "title": "Haoris can be dressed enough for formal occasions.",
      "content": "Haoris can be dressed enough for formal occasions. Most traditional haoris are made of high quality fabrics with beautiful designs. Put on a haori with a simple dress, like a plain black dress. You can go bold, like pairing a red haori with a black dress, or keep it simple with a black haori."
    },
    {
      "title": "This works especially well with a neutral male haori.",
      "content": "This works especially well with a neutral male haori. In addition to wearing it with jeans for a casual look, you can put a haori with dress pants for a nicer outfit. Choose a contrasting neutral shade of pants and a matching button up. For example, you can pair a black haori with grey pants and a solid shirt in white, blue, or even purple."
    },
    {
      "title": "Scarves are a great accessory for a haori.",
      "content": "Scarves are a great accessory for a haori. Try an open long scarf that hangs down along the cut of the front of the haori. You can also wear a smaller scarf tied around your neck. Try looping a scarf around your neck or drape one around your shoulders. Choose a scarf that is in a complementary color to your haori. For example, if you are wearing a multi-colored haori, choose a scarf that matches a color in the pattern. If you are wearing a pastel blue toned haori, go for a complementary beige scarf."
    },
    {
      "title": "Traditionally, haoris are worn without a belt.",
      "content": "Traditionally, haoris are worn without a belt. However, if you prefer, you can wear your haori coat with a belt. Place it over your favorite base shirt and bottom or dress and then add a belt for a cinched look. Wearing the haori this way is similar to wearing a belt with a sweater, dress, or shirt."
    },
    {
      "title": "Haoris look better when you keep it more minimal on top.",
      "content": "Haoris look better when you keep it more minimal on top. Because of the cut and patterns of the haori, large necklaces or ties may not go well with the outfit. Skip the statement necklaces and ties when wearing a haori. Instead, let the haori be the centerpiece of your top half."
    },
    {
      "title": "Haoris are easily paired with any kind of handbag.",
      "content": "Haoris are easily paired with any kind of handbag. Small hand-held purses or large hobo bags go great with this style. Choose a handbag color that matches a color in the pattern or complements the colors of the haori."
    },
    {
      "title": "Haoris are really versatile and can be dressed up or down.",
      "content": "Haoris are really versatile and can be dressed up or down. They go with just about any shoe style. Your choice of shoes should be based on your overall outfit. For example, if you are pairing the haori with jeans and a scarf, go for boots or flats. If you are pairing it with a dress, choose nicer boots, flats, or heels. For a fun, bright pop of color, consider choosing shoes in a color that matches one of the colors in the pattern on your haori."
    },
    {
      "title": "Most traditional haoris are one size fits all.",
      "content": "Most traditional haoris are one size fits all. That said, you can get a fashion haori in a clothing store that follows normal clothing sizes. Haori come in different lengths. What length you choose is up to you. For example, you may choose a haori based on your height. If you are shorter, you may choose a shorter haori. You may choose different length haoris for different outfits. For example, a longer haori may be paired with a dress, while a shorter haori may be matched with jeans and a sweater."
    },
    {
      "title": "The easiest place to purchase a haori is online.",
      "content": "The easiest place to purchase a haori is online. There are many online retailers who sell a variety of haoris. You may choose from authentic Japanese haori or hand-made fashion haori. Do an online search for haori and see what you can find. Some clothing retailers may carry haori, but it may depend on the season and the season's fashion trends."
    },
    {
      "title": "Haoris come in all sorts of bold colors and patterns.",
      "content": "Haoris come in all sorts of bold colors and patterns. You can choose the haori that you wear based on the season. Go for pastels and florals in spring, bright colors in summer, earthier tones in fall, and blues and greys in winter."
    }
  ]
}