{
  "url": "https://www.wikihow.com/When-to-Capitalize-Earth",
  "title": "Do You Capitalize Earth, Sun, & Moon? Guidelines for the Whole Solar System",
  "steps": [
    {
      "title": "Capitalize “Earth” when you’re referring to the planet we live on.",
      "content": "Capitalize “Earth” when you’re referring to the planet we live on. Earth (the planet) is a proper noun—it’s a name that refers to a specific person, place, or thing. In English, all proper nouns are capitalized regardless of which citation style you’re writing in. [1] X Research source The NASA style guide indicates that Earth and all the other planets of the solar system should be capitalized when you talk about them as celestial bodies. For example: “Mars is 38.6 million miles (62.07 million kilometers) from Earth at its closest approach” or “The only home we’ve ever known is Earth.”"
    },
    {
      "title": "Be consistent with how you use the article “the” before “Earth.”",
      "content": "Be consistent with how you use the article “the” before “Earth.” According to NASA’s style guide, “the” is unnecessary when you’re talking about our home planet. Think about the other planets—you’d probably get a weird look if you said “the Jupiter” or “the Mercury.” [2] X Research source Grammatically, using “the” before “Earth” is OK as long as you’re consistent with whether you use it or not. [3] X Research source For example, both “Earth is the third planet from the sun” and “The Earth is the third planet from the sun” are grammatically correct. An article modifies a noun. In English, there are 2 articles: “the” for specific nouns and “a/an” for non-specific nouns."
    },
    {
      "title": "Spell “earth” lowercase if you’re referencing soil or the ground.",
      "content": "Spell “earth” lowercase if you’re referencing soil or the ground. In this case, earth is a common noun—a noun that describes a type of person, thing, or place or that names a concept (not a specific, single object or person). In English, common nouns are always spelled lowercase. [4] X Trustworthy Source NASA Independent agency of the U.S. government in charge of the aerospace research and the space program Go to source For example: “The tree’s roots extend deep into the earth” or “She picked up a handful of earth and sifted it between her fingers.”"
    },
    {
      "title": "Use lowercase “earth” in idioms or expressions.",
      "content": "Use lowercase “earth” in idioms or expressions. If you’re writing a recognizable turn of phrase, go for a lowercase “e.” It can be unclear whether the user is speaking about the astronomical planet or the ground in some cases, so it’s usually standard to go lowercase across the board. [5] X Research source For example: “What on earth is going on?” “He’s really down to earth.” “That place is hell on earth.”"
    },
    {
      "title": "Include “the” before \"earth\" to specify soil or the ground.",
      "content": "Include “the” before \"earth\" to specify soil or the ground. Sentences about Earth (the planet) will always make sense without “the” in front of it (“Earth is one of the rocky planets”), but sentences about earth (the ground) sometimes need an article for clarification. For example, “He was a real salt of earth guy” seems awkward or vague compared to “He was a real salt of the earth guy.” [6] X Research source"
    },
    {
      "title": "NASA says “Sun” and “Moon” are capitalized as proper nouns.",
      "content": "NASA says “Sun” and “Moon” are capitalized as proper nouns. If you’re referring to Earth’s natural satellite or the star our planet revolves around, use capital letters. If you’re referring to generic suns or moons throughout space, use lowercase letters. [7] X Research source For example: In “Earth orbits the Sun,” “Sun” is capitalized because the sentence refers to the specific star our planet orbits. In “Jupiter has many moons,” “moons” is lowercase because the sentence describes a group of other moons that are not ours."
    },
    {
      "title": "The AP style guide says “sun” and “moon” should always be lowercase.",
      "content": "The AP style guide says “sun” and “moon” should always be lowercase. The Associated Press (AP) made this decision based on the idea that the moon is a thing, not a thing named “Moon.” However, NASA and other organizations find this rule problematic, and there’s still debate about whether capital letters should be used or not. [8] X Research source According to the AP, a sentence like “The moon orbits Earth and Earth orbits the sun” is correct. NASA prefers “The Moon orbits Earth and Earth orbits the Sun.” The AP and NASA agree “sun” and \"moon\" are lowercase in sentences like “Let's get out of the sun” since the sun isn’t being talked about astronomically. AP rules still say that “Earth” should be capitalized when used as a proper noun referring to our planet."
    },
    {
      "title": "Go lowercase when in doubt.",
      "content": "Go lowercase when in doubt. Unless you’re writing for NASA or a diehard fan of the moon, use lowercase letters for “sun” and “moon.” It’s easier to be consistent that way, and you won’t have to worry about proofreading for nitpicky capitalization rules or improving your grammar . However, feel free to capitalize them for poetic emphasis or if you feel they simply deserve a capital letter. Lots of people do! [9] X Research source If you’re being poetic and using the Roman names for the moon and sun (Luna and Sol, respectively), capitalize them. If you’re writing for an organization that uses a specific style guide, follow that guide’s rules on capitalization for sun and moon."
    }
  ]
}