{
  "url": "https://www.wikihow.com/Use-Cleansing-Milk",
  "title": "How to Use Cleansing Milk",
  "steps": [
    {
      "title": "Pull your hair back.",
      "content": "Pull your hair back. Because you will be leaning forward when you use cleansing milk, you need to secure your hair so it doesn’t fall into your face. Pin back your bangs with a clip. Pull your hair into a ponytail with a hair tie. [1] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If you have short hair, you can hold it back with a headband instead."
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. You should have clean hands before you apply cleansing milk. Wash your hands well with soap and warm water. Your hands may have bacteria that can cause acne or infection on your face."
    },
    {
      "title": "Warm the cleansing milk to skin temperature.",
      "content": "Warm the cleansing milk to skin temperature. Place the cleansing milk into your palm. Put your palms together and rub the cleansing milk to warm it up. Do this for a few seconds, until it’s approximately the temperature of your skin. [2] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Place the milk on your face.",
      "content": "Place the milk on your face. Cover your cheeks with your hands with light pressure. This transfers the milk to your skin. Keep your hands there for 10 seconds before removing your hands. [3] X Research source"
    },
    {
      "title": "Tap your face with your hands gently five times.",
      "content": "Tap your face with your hands gently five times. Once you’ve transferred the milk to your face, gently place your hands back onto your face and pull them away quickly five or six times. This should create a kind of suction that will help pull impurities to the surface of your skin where they can be easily washed away. [4] X Research source"
    },
    {
      "title": "Massage the milk into your skin.",
      "content": "Massage the milk into your skin. Apply the cleansing milk all over your face and neck. Apply with gentle pressure and massage the milk lightly into your skin. By massaging the milk into your skin, you can reach areas, like the sides of your nose and the skin under your brows, where dirt and makeup often become trapped."
    },
    {
      "title": "Rinse with warm water.",
      "content": "Rinse with warm water. After you are finished, rinse your face with warm water. This will remove any excess milk from your face. Or can also use a cotton ball or cloth to remove the leftover cleansing milk."
    },
    {
      "title": "Remove residue with a warm cloth.",
      "content": "Remove residue with a warm cloth. Milk cleansers can leave a residue on your face. If you feel like you still have your cleanser on your face, soak a cloth in warm water. Cover your face with the cloth for five seconds. Wipe away the residue. [5] X Research source You can repeat this three or four times to remove any excess."
    },
    {
      "title": "Tone and moisturize afterwards.",
      "content": "Tone and moisturize afterwards. Use your usual toner to tone your face. This will give your skin a deep clean and may help to prevent acne. Then, finish by using your regular face cream or lotion to moisturize and hydrate your face. [6] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source You can apply your makeup at this point."
    },
    {
      "title": "Use cleansing milk in the morning and evening.",
      "content": "Use cleansing milk in the morning and evening. Cleansing milk is gentle enough that you can use it in both the morning and the evening. You can replace your daily face wash with cleansing milk. At night, you can use cleansing milk to help remove light makeup. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Use cleansing milk to remove foundation makeup.",
      "content": "Use cleansing milk to remove foundation makeup. Cleansing milk is used to remove makeup, dirt, and impurities from your face. It isn’t meant to be used as a cleanser, to reduce sebum, or to unclog pores. To remove your foundation or powder, apply the cleansing milk on your face like a cleanser. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you wear heavy makeup, use a makeup remover, then use cleansing milk to finish removing makeup and dirt."
    },
    {
      "title": "Use it to remove eye makeup.",
      "content": "Use it to remove eye makeup. Cleansing milk is used to remove makeup. To remove your eye makeup, dampen a cotton ball with warm water. Apply the cleansing milk. Gently sweep the cotton ball over the eye from the inside corner to the outside. [9] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Rinse away any excess with warm water."
    }
  ]
}