{
  "url": "https://www.wikihow.com/Train-Your-Service-Dog-Without-a-Professional-Trainer",
  "title": "How to Train Your Service Dog Without a Professional Trainer",
  "steps": [
    {
      "title": "Training guidelines indicate your dog needs at least 120 hours of training.",
      "content": "Training guidelines indicate your dog needs at least 120 hours of training. In addition to that 120 hours, your dog needs at least 30 hours of practice in public. Public practice typically entails taking your dog to a lot of different environments where you typically go. For example, if you go to the local shopping mall frequently, take your dog to the shopping mall so it's used to walking around and behaving well in shops where there can be a lot of distractions. Generally, expect it to take about 2 years to fully train your service dog. [1] X Research source Keep in mind that dogs in training are not entitled to the same level of access as fully-trained service dogs. If the owner or manager of a store or restaurant allows your dog, they're doing that out of their own goodwill. If they refuse, you have to respect their wishes. [2] X Research source"
    },
    {
      "title": "Start by teaching your dog basic obedience commands.",
      "content": "Start by teaching your dog basic obedience commands. From the start, your dog should look at you when you say its name, come on command, and know basic commands such as \"sit,\" \"stay,\" and \"heel.\" You can train your dog these commands on your own or take it through a basic obedience class. [3] X Research source Your dog should also be comfortable sitting still in one place for an extended period of time and not moving until you indicate that it should do so. This is an important skill that will serve as the foundation of more advanced service dog training. Generally, plan on spending at least 2 months teaching your dog basic obedience before you move on to specific assistance tasks. [4] X Research source"
    },
    {
      "title": "Clicker training is typically the best method to use for specific tasks.",
      "content": "Clicker training is typically the best method to use for specific tasks. With clicker training , you reward your dog for behaving the way you want it to, rather than punishing it for bad behavior. Since you'll use a lot of treats to reward your dog when you're starting out, it helps if your dog is food-motivated. Eventually, your dog will progress to the point that a treat isn't necessary for it to perform the desired behavior. [5] X Research source For some disabilities, you'll have to simulate the condition that should trigger your dog's behavior. For example, if you're training your dog to act when you have a seizure, you would need your dog to know what to do before you actually had a seizure. Talk to a professional trainer who has experience training dogs to assist with your particular disability. They can offer tips on what tasks to train your dog to do and how best to train your dog to complete those tasks."
    },
    {
      "title": "Teach your dog to stay close and pay attention to you at all times.",
      "content": "Teach your dog to stay close and pay attention to you at all times. A good service dog is attentive to the person it's assisting, which means it has to remain close to you and can't be easily distracted by movement, smells, or sounds. Every time you take your dog for a walk, expect this behavior and offer rewards when your dog meets your expectations. [6] X Research source For example, your dog should stay close by you when you're walking. If you stop, your dog should also stop, then sit and wait until you start moving again. Dogs that get nervous or excitable around other animals or people typically aren't going to make good service dogs. While you want your dog to be aware of its surroundings, it should always focus primarily on you and your needs."
    },
    {
      "title": "No, the ADA has no requirement that your dog be registered or certified.",
      "content": "No, the ADA has no requirement that your dog be registered or certified. Some cities, states, and local organizations have voluntary registration or certification programs. However, you can't be penalized for not signing your dog up with these programs. It's entirely your choice to do so. [7] X Research source Shop owners or managers are not allowed to ask you for any proof that your dog is registered or certified. If you're asked, it's generally better if you don't provide any proof—you're reinforcing the misconception that registration or certification is a requirement."
    },
    {
      "title": "Under the ADA, service dogs aren't required to have any identification.",
      "content": "Under the ADA, service dogs aren't required to have any identification. If you find it easier to have a vest on your dog when it's working, that's entirely up to you. US law doesn't require a vest, nor can anyone deny you access without one. [8] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Therapy and emotional support dogs frequently wear vests to distinguish them from pets. However, these dogs aren't considered service dogs under the ADA and aren't guaranteed access to public places where dogs generally aren't allowed."
    },
    {
      "title": "Most professional trainers start training puppies around 8 weeks old.",
      "content": "Most professional trainers start training puppies around 8 weeks old. Puppies who start training this early can potentially \"graduate\" and become full service dogs at 18-24 months. It's never too early to start training a service dog, particularly with basic obedience tasks and routine commands. [9] X Research source Starting training with a puppy also allows you to set your expectations early and maintain them consistently."
    },
    {
      "title": "Yes, but keep in mind service dog training typically takes at least 2 years.",
      "content": "Yes, but keep in mind service dog training typically takes at least 2 years. When starting service dog training, think about how long the dog will be with you (and able to perform) after training is over. If your dog is near the end of its lifespan, it might not make sense to spend 2 years training it when you're only going to get a year or 2 of service. [10] X Research source If you've had your dog as a pet for several years and want to start training it as a service dog, training might be a little more slow-going. Imagine how difficult it would be for you to adjust to an entirely new set of rules at work after years of doing things a certain way—your dog is no different."
    },
    {
      "title": "Your dog might make a good service dog if it has an even temperament.",
      "content": "Your dog might make a good service dog if it has an even temperament. Temperament and personality are perhaps the most important things about a potential service dog. If your dog is shy, nervous, or fearful, it likely won't make a good service dog. [11] X Research source Also look for a match in personality and energy level. For example, if you're on the go a lot, you would want a more high-energy dog. If you're mostly sedentary, on the other hand, you don't want a high-energy dog that needs a lot of exercise. Take into consideration how your disability will affect your life in 5-10 years. If your disability is progressive, you want a dog that can step up to handle increasingly greater responsibilities."
    },
    {
      "title": "Yes, most service dogs are spayed or neutered.",
      "content": "Yes, most service dogs are spayed or neutered. Most professional breeders and trainers of service dogs spay or neuter their dogs at about 8 weeks old, although some dogs are spayed or neutered later. Spaying or neutering your service dog helps avoid distractions and can improve the dog's temperament. [12] X Research source Studies have shown that spaying or neutering your dog at 7 to 11 months decreases the probability of behavioral problems that would prevent a dog from becoming a service dog."
    },
    {
      "title": "Yes, your service dog is subject to local animal control and registration.",
      "content": "Yes, your service dog is subject to local animal control and registration. Your service dog isn't exempt from local laws requiring dogs to be vaccinated, tagged, or registered. These laws exist to protect you, your dog, and your local community. [13] X Research source Your city can't require you to register your dog specifically as a service dog. However, if your city has a registration policy in effect that applies to all dogs, it also applies to your service dog. If your city or a local organization has a volunteer registry, you might consider doing it. These registries typically offer benefits, including reduced fees for vaccinations and licensing."
    },
    {
      "title": "Any breed can be trained as a service dog.",
      "content": "Any breed can be trained as a service dog. When you picture a service dog in your mind, you might picture a larger dog, such as a Golden Retriever or a German Shepherd. But which breed will work best for you depends on what you need the dog to do. Here are some examples: [14] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source If you need mobility assistance, choose a dog with the right height and strength, such as a Great Dane, Saint Bernard, or Bernese Mountain Dog. Small dogs, such as Papillons, are great if you need hearing assistance. Labrador Retrievers, Golden Retrievers, and German Shepherds are commonly trained as guide dogs for people with impaired vision. Poodles are versatile dogs that can be trained to detect blood sugar variations, carry objects, or flip light switches."
    },
    {
      "title": "All service dogs perform tasks related to their handler's disability.",
      "content": "All service dogs perform tasks related to their handler's disability. In this respect, you might say that there are as many types of service dogs as there are disabilities. Generally, though, service dogs fall into 5 categories: [15] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Guide dogs: assist blind and visually impaired people in navigating their environment and avoiding obstacles Mobility dogs: help people with mobility issues, including balance and coordination or pushing wheelchairs Medical alert dogs: alert (usually bark) at the onset of a medical issue, such as low blood sugar or a seizure Hearing dogs: notify deaf and hard of hearing people of important sounds, such as fire alarms Psychiatric service dogs: help mitigate stressful situations or conditions, detect the onset of a panic attack, or interrupt compulsions or repetitive behavior"
    },
    {
      "title": "Any disability that substantially limits 1 or more major life activities qualifies.",
      "content": "Any disability that substantially limits 1 or more major life activities qualifies. The Americans with Disabilities Act (ADA) doesn't list specific disabilities that are covered under this definition. [16] X Research source Your service dog must be trained to perform a task that's directly related to your disability. [17] X Research source For example, if you have diabetes, your dog might be trained to alert (bark) when it detects a change in the smell of your breath that indicates low blood sugar. PTSD and other anxiety disorders qualify as disabilities. If your dog is specifically trained to detect the onset of a panic attack and perform actions that help prevent the attack or lessen its impact, it's considered a service dog. Dogs that provide emotional support and comfort just by being there, but don't perform any specific tasks for you, aren't considered service dogs."
    }
  ]
}