{
  "url": "https://www.wikihow.com/What-Does-the-Blue-Check-Mean-on-Tinder",
  "title": "What Does the Blue Checkmark Mean on Tinder?",
  "steps": [
    {
      "title": "A blue check indicates that a Tinder user is Photo Verified.",
      "content": "A blue check indicates that a Tinder user is Photo Verified. Verification on Tinder simply means that you are a real person . Unlike verification on various social media sites, it does not mean that a user is a celebrity or influencer of any kind. [1] X Research source Photo Verification on Tinder is meant to make the community safer. When a user has a blue checkmark, other users can rest assured that they are actually who they say they are."
    },
    {
      "title": "Open Tinder and tap your profile icon.",
      "content": "Open Tinder and tap your profile icon. It is the small human icon in the bottom-right corner of the app."
    },
    {
      "title": "Tap the gray checkmark by your name.",
      "content": "Tap the gray checkmark by your name. It is encircled by a dotted line. A pop-up labeled Get Verified will appear. If you are already verified on Tinder, this check will be blue."
    },
    {
      "title": "Select Continue.",
      "content": "Select Continue . Then, continue to tap the large pink button to continue through the instructions from Tinder. You may have to grant Tinder access to your camera at this time."
    },
    {
      "title": "Frame your face in the oval and tap I’m Ready.",
      "content": "Frame your face in the oval and tap I’m Ready . The button will be greyed out until your face is properly situated within the oval."
    },
    {
      "title": "Follow the onscreen prompts.",
      "content": "Follow the onscreen prompts. Tinder will instruct you to move your face to varying distances from the camera. Once done, the video will upload to Tinder's servers, and you will receive a message notifying you that your video is under review. The verification process is carried out by AI, so you should receive confirmation of your verification rather quickly. If there are any issues with your verification, Tinder will notify you accordingly. You will need to repeat the steps above. Be sure to remove any hats, sunglasses, or face coverings when recording your verification video. Also make sure you are in a well-lit room."
    },
    {
      "title": "Build greater trust with your matches.",
      "content": "Build greater trust with your matches. Although there is no data to suggest a blue check leads to more matches, it will likely improve the quality of your matches. Other users will feel more comfortable chatting and going on dates with someone they know is actually who they say they are. [2] X Research source"
    }
  ]
}