{
  "url": "https://www.wikihow.com/Tell-Which-Tire-Is-Out-of-Balance",
  "title": "Your Guide to Finding and Fixing an Unbalanced Tire",
  "steps": [
    {
      "title": "Look for visible wear and damage.",
      "content": "Look for visible wear and damage. When you look at your tires, you’ll probably notice that one has a tread pattern that is more smoothed over and worn out than your other tires’ treads. [1] X Research source You might also see tire cupping on this tire, which is when areas of the tire collapse or curve inwards. This can sometimes look like parts of your tire or treads are missing. [2] X Research source You can’t always see tire wear, so it’s a good idea to check your tire treads using the penny test. Insert a penny upside down into any groove on your tire. If you can see all of Abraham Lincoln’s head, this means that your tires are worn and might need to be replaced. [3] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Figure out where the vibrations are coming from.",
      "content": "Figure out where the vibrations are coming from. One of the first signs that you have an unbalanced tire is when your car starts to shake. If you feel the vibrations in your steering wheel or front seat, this typically means that one of your front tires is out of balance. If you notice the shaking towards the back of your car, specifically in your back seats, one of your rear tires is likely out of balance. [4] X Research source You might really notice the shaking and vibrations when you are driving at high speeds."
    },
    {
      "title": "Your steering wheel is less responsive.",
      "content": "Your steering wheel is less responsive. When you have an unbalanced tire, it takes more time for your steering wheel to respond to your turn and move your tires. You might also notice that your steering is less smooth when you turn because it is fighting the resistance created by your unbalanced tire. [5] X Research source"
    },
    {
      "title": "Your car is less fuel-efficient.",
      "content": "Your car is less fuel-efficient. When you’re driving on an unbalanced tire, you’ll probably notice that your fuel tank runs out of gas quicker than normal. This is because an unbalanced tire creates more road resistance, which causes your engine to work harder to stay at a steady speed and accelerate. [6] X Research source You can easily calculate your fuel consumption to determine your fuel efficiency. Simply record your odometer reading when you fill up on gas, what it reads when you stop to fill up again, and how many gallons filled up your car. Subtract your 2nd odometer reading from your 1st and divide it by the number of gallons. This tells you how many miles or kilometers you drove per gallon of gas you used. It’s a good idea to check your tire pressure about once a month, especially if you notice your car is using more gas than normal. A sticker on your driver’s side door will tell you the recommended PSI for each tire. Place a tire pressure gauge at the tire’s valve and check its reading. If your car tire is below the recommended PSI, add more air ."
    },
    {
      "title": "You hear humming or buzzing noises.",
      "content": "You hear humming or buzzing noises. Along with feeling your car shake and vibrate, you’ll likely hear abnormal hissing noises coming from your tire. The noises will typically get louder when you speed up and accelerate your car. [7] X Research source"
    },
    {
      "title": "Your shocks and bearings are worn.",
      "content": "Your shocks and bearings are worn. As you continue to drive, you might notice that your suspension system seems to be vibrating and making clunking and banging noises. Your steering wheel will also be hard to control and seem jerky. Because your tire is out of balance, the bearings, ball joints, and shocks in your wheel assembly are under much more stress. [8] X Research source"
    },
    {
      "title": "Normal wear and tear",
      "content": "Normal wear and tear Your tires definitely aren’t meant to stay in perfect condition and last forever. Simply driving and braking causes your tires to wear out and develop an uneven weight distribution. [9] X Research source Practice good driving habits like braking slowly and maintaining a constant speed to help your tires last longer. Braking suddenly and hard puts a lot of stress on your tires which can cause them to wear out faster. This also happens when you accelerate quickly. [10] X Research source Schedule a regular tire rotation appointment after every 3,000-5,000 miles (4,800-8,000km) to help your tires wear evenly. During this process, your mechanic simply switches your front and back tires. If you’re handy, it’s easy to rotate your tires yourself ."
    },
    {
      "title": "Manufacturing imperfections",
      "content": "Manufacturing imperfections Unfortunately, all tires are not made perfectly. If you just installed a new tire, it’s entirely possible that it had a slight weight imbalance that is throwing your car out of whack. These imperfections are usually slight, as just a ½ ounce (14 g) weight difference between your tires can cause an imbalance in your car. [11] X Research source In fact, experts recommend balancing your tires when you replace, repair, or install a new tire. This addresses any weight imbalances right away and prevents further issues from developing. [12] X Research source"
    },
    {
      "title": "Cold weather",
      "content": "Cold weather When temperatures suddenly drop in the fall and winter, it’s common for your tires to deflate and lose air. [13] X Research source If you continue to drive on tires with low air pressure, this can cause them to wear faster and more unevenly."
    },
    {
      "title": "Bumps and potholes",
      "content": "Bumps and potholes It is easy to wear and damage your tires when you run over a gaping pothole or drive too fast over a speed bump. Even a small dent or bulge can throw your tire out of balance. This can also scratch and damage your wheel or rims, which also affects the balance and weight of your tire. [14] X Research source"
    },
    {
      "title": "Balance your own tires with a portable tire balancer.",
      "content": "Balance your own tires with a portable tire balancer . Place the balancer’s base on a flat surface, such as a table or piece of plywood. Screw the balancer into the base and adjust the screws so that the bubble is in the center of the circle. Clean off your tires and remove any existing weights. Then, remove your tire and put it on top of the balancer. If the bubble moves outside of the circle, add and move wheel weights around the wheel until the bubble is back in the center of the circle. [15] X Research source To adhere the weights to your wheel, clean off any grime with a tire cleaner . Then simply use super glue to stick the weights onto the outside of the rim. Portable tire balancers usually cost around $70. You can also balance your tires with a tire balancer machine . These typically cost around $1,000 and up."
    },
    {
      "title": "Go to a mechanic if you aren’t comfortable working on your car, .",
      "content": "Go to a mechanic if you aren’t comfortable working on your car, . This is always a great way to fix your unbalanced tires! Your mechanic uses a machine that spins your tire and measures the imbalance. They then use that information to install weights onto your wheel. [16] X Research source A car balancing service for all 4 tires can cost anywhere from $15 to $80."
    },
    {
      "title": "It’s best not to drive on an unbalanced tire.",
      "content": "It’s best not to drive on an unbalanced tire. If you continue to drive with an unbalanced tire, you can cause long-term damage to your wheels and suspension. Those parts can be more costly to fix, so when you notice your tire is out of balance, fix it immediately. [17] X Research source"
    },
    {
      "title": "Balancing adjusts weight while aligning adjusts your tire’s angle.",
      "content": "Balancing adjusts weight while aligning adjusts your tire’s angle. It’s easy to get these 2 routine services mixed up because they both improve your tire’s performance. During an alignment, the angle of your tire is corrected so that all 4 point and move in the same direction. A tire balance is done only when the weight distribution of your tire is thrown out of balance. [18] X Research source"
    }
  ]
}