{
  "url": "https://www.wikihow.com/Understand-Myers-Briggs-Type-Theory",
  "title": "How to Understand Myers Briggs Type Theory",
  "steps": [
    {
      "title": "Differentiate between introversion and extraversion.",
      "content": "Differentiate between introversion and extraversion. Introverts tend to look inward first while extraverts first look outward. This definition differs from the way people typically think of introversion and extraversion being measures of how social someone is. [1] X Research source Everyone has traits of both introversion and extraversion, but people tend to lean to one side or the other. [2] X Research source Shyness (social anxiety) is not a predictor of introversion or extraversion. Introverts look inward, and thus, do not necessarily fear socialization. Both introverted and extroverted types can be shy. [3] X Research source [4] X Research source"
    },
    {
      "title": "Differentiate between sensing (sometimes called \"observation\" or \"sensation\") and intuition.",
      "content": "Differentiate between sensing (sometimes called \"observation\" or \"sensation\") and intuition. Sensing focuses on the real, sensory, physical world while intuition focuses more on possibilities and finding patterns. [6] X Research source Intuition is not supernatural (even if it appears so). Sensors tend to be more in-tune with their body. Although intuition starts with an \"I,\" the system uses an \"N\" to signify it. Most people can’t force out intuitions."
    },
    {
      "title": "Recognize feeling versus thinking.",
      "content": "Recognize feeling versus thinking. Thinkers rely on thoughts, logic, and judgments to process facts and make decisions, while feelers tend to rely on the sensory information coming in through their body's senses, which urges them to look deeper inside themselves about something. This can be a physical feeling. Usually we have feelings telling us to get in touch with more complex emotions existing underneath. It is there, underneath your emotional response, that an individual will find something out about their needs being met. This comes into play when making decisions; a thinker is more likely to accept logic than an emotional plea. [7] X Research source [8] X Research source Feelings are not equivalent to emotions, and thinking is not the same as facts or intelligence. Many individuals confuse feelings and emotions, and facts and intelligence with thinking."
    },
    {
      "title": "Look at judging and perceiving (sometimes called prospecting).",
      "content": "Look at judging and perceiving (sometimes called prospecting). Judgers tend to be more orderly and organized than perceivers. Perceivers tend to be more spontaneous and flexible. [9] X Research source"
    },
    {
      "title": "Understand that everyone uses all eight preferences.",
      "content": "Understand that everyone uses all eight preferences. Intuitives still use their senses, feelers use thinking, and perceivers use judging. The MBTI measures a person's preferences , not the only way someone perceives the world. No preference is better than another. All eight help the world thrive. [10] X Research source [11] X Research source The dichotomies exist on a spectrum. People tend to lean more to one side or the other, but it is not possible to not use one or the other. [12] X Research source A sign of a well-developed type is incorporating your weak points into your life."
    },
    {
      "title": "Understand the J/P orientation and the attitude of the functions.",
      "content": "Understand the J/P orientation and the attitude of the functions. The thinking and feeling functions (Ti, Te, Fi, and Fe) are judging functions, and the sensor and intuitive functions (Si, Se, Ni, Ne) are perceiving functions. [13] X Research source Functions are either introverted or extraverted. Sensing, intuition, thinking, and feeling each have an extraverted and introverted counterpart. Extraverted functions are more objective and interested in the outside world than introverted functions. Introverted functions are more personal and subjective. Judging functions tend to be more organized and systematized than perceiving functions. Perceiving functions are more spontaneous."
    },
    {
      "title": "Understand what the functions are.",
      "content": "Understand what the functions are. The cognitive functions are how each person perceives and processes the world. The functions are abbreviated to the first letter of the preference (or an N for intuition) and the first letter of the function's attitude. For example, introverted feeling is \"Fi\", pronounced \"eff-eye\"."
    },
    {
      "title": "Differentiate between Ti and Te.",
      "content": "Differentiate between Ti and Te. Ti builds an internal framework of knowledge, while Te cares more about external logic and efficiency. Te is more objective and practical, whereas Ti cares about precision and accuracy. [14] X Research source Ti tends to learn for the sake of learning, while Te users tend to learn for an objective gain. Te tends to be more efficient and practical, whereas Ti is more impractical yet thorough. As thinking functions, Ti and Te are both judging functions."
    },
    {
      "title": "Define Fe and Fi.",
      "content": "Define Fe and Fi. Fe is concerned with others' emotions while Fi concerns itself with inner emotions. For instance, Fi users often have strong morals and ethics, doing what they feel is right, while Fe users tend to weigh in others' emotions more often. [15] X Research source Fi users often have a strong sense of identity."
    },
    {
      "title": "Understand Si and Se.",
      "content": "Understand Si and Se. Se is the sensory world. Si is the subjective interpretation of sensory experiences. Se users tend to live more in the moment than Si users. Si users often have good memories for the past (though, this is not always the case and Si should not be confused with memory). [16] X Research source"
    },
    {
      "title": "Compare Ne and Ni.",
      "content": "Compare Ne and Ni. Ne tends to have more breadth than Ni. Ni is more personal than Ne and may not be as outwardly visible. Ne tends to zoom around finding connections between seemingly extraneous topics. [17] X Research source Ni tends to be more focused on one idea than Ne. Ne enjoys novelty often in unconventional manners. Ne users may be the ones to suddenly go vegan, move across the world, or decide to learn Esperanto. Likewise, Ne users are known to start way too many projects at the same time and not finish things. [18] X Research source Intuition often has intuitions that are underdeveloped and may not make sense to others or even the intuitor themself."
    },
    {
      "title": "Understand what a function \"stack\" is.",
      "content": "Understand what a function \"stack\" is. A function stack is a group and ordering of the four (in some models eight) functions that a person uses. For example, the ISFJ function stack is Si, Fe, Ti, Ne."
    },
    {
      "title": "Understand the order of the functions.",
      "content": "Understand the order of the functions. Your functions alternate in attitudes (e.g., an INTP's stack is Ti, Ne, Si, Fe). For example, a Fi dominant would have an auxiliary extraverted perceiving function because Fi is an introverted judging function. The auxiliary function is in the opposite J/P orientation as well."
    },
    {
      "title": "Recognize the position of the dominant function.",
      "content": "Recognize the position of the dominant function. The dominant function makes up the majority of your personality. The dominant function is most present out of your functions and develops earliest in life. [19] X Research source"
    },
    {
      "title": "Define the auxiliary function.",
      "content": "Define the auxiliary function. Sometimes called the secondary function, the auxiliary function \"backs up\" or supports the dominant function. The auxiliary function typically develops in adolescence to early adulthood. [20] X Research source This function is in the opposite attitude and J/P orientation of the dominant and the opposite attitude but same J/P orientation of the tertiary. The auxiliary provides balance to your psyche. [21] X Research source The auxiliary function complements the dominant function and aids the dominant in its goals."
    },
    {
      "title": "Recognize the tertiary function.",
      "content": "Recognize the tertiary function. This function is sometimes called the eternal child due to its playful nature. The tertiary function is often used playfully as a form of relaxation and usually does not develop until midlife; though, it appears in younger individuals but often in forms of frustration. [22] X Research source For example, an IxFJ (INFJ or ISFJ) may enjoy brain exercises as these work their Ti. The tertiary function often comes easily to a type, so it may be over-utilized. The tertiary function is directly oppositional to the auxiliary function (opposite attitude and preference). The tertiary function was initially proposed to be in the opposite attitude as the dominant, but most models now say that it is the same attitude as the dominant."
    },
    {
      "title": "Recognize the role of the inferior function.",
      "content": "Recognize the role of the inferior function. Sometimes called the repressed or lost function, the inferior is the fourth function in the stack. This function is known to manifest in immature methods, and it is said that one can never have a perfect grasp of it. [23] X Research source While it can be very frustrating, some depth-oriented therapists propose it is the key to developing wholeness of the Self in the second half of life."
    },
    {
      "title": "Look at shadow-function theory.",
      "content": "Look at shadow-function theory. The four above functions are known as the \"ego-functions\". A lesser-known branch of MBTI theory is the shadow-function stack. These functions are in the opposite attitudes of your ego-stack. An ENFJ's function stack is Fe, Ni, Se, Ti; therefore, an ENFJ's shadow-stack would be Fi, Ne, Si, Te. These functions are said to not be conscious in a person and present themselves in different ways than one's ego functions. The fifth function is usually called the opposing role or sometimes nemesis. The sixth function is called the witch/senex. The seventh function is called the blindspot, PoLR (point of least resistance), or trickster. The eighth function is called the demon function. (Other alternate names exist that are not in the mentioned above.) Varying, contradicting ideas stem from shadow-function theory. Some say that people do not have shadow functions, while others disagree."
    },
    {
      "title": "Recognize inferior function grips.",
      "content": "Recognize inferior function grips. When a type falls into a time of acute stress, they may enter an inferior function \"grip\". During a grip, a type overuses their inferior function, which can result in unhealthy, uncharacteristic behavior due to poor grasp of the inferior function. [24] X Research source For example, an ENxP (who has inferior Si) may become hyperaware of the little things that bother them. ENxPs may also overanalyze events that happened months, years, or even decades ago."
    },
    {
      "title": "Take a look at loops.",
      "content": "Take a look at loops. Loops are when someone resorts to using their dominant and tertiary function, ignoring their auxiliary function (which usually comes naturally and provides balance). Loops can result in uncharacteristic, unhealthy behavior. An INTP in the Ti-Si loop may become extremely reclusive. They may overanalyze an event from the past (Si) with Ti."
    },
    {
      "title": "Understand stack \"jumping\".",
      "content": "Understand stack \"jumping\". Jumping is when someone does not follow the typical function order for their type (the term often refers to individuals relying more on the tertiary function than auxiliary). \"Jumping\" is disputed within the MBTI community, with some typologists saying that jumpers are actually just developing (and thus, more reliant on) their tertiary (or other) function."
    },
    {
      "title": "Learn about temperaments.",
      "content": "Learn about temperaments. Temperaments are groupings of types with similar traits. Varying theories on grouping types exist, the most common being: The NTs (INTPs, INTJs, ENTP, ENTJ): These types are known for their insatiable curiosity and rational minds. The NFs (INFPs, INFJs, ENFP, ENFJ): NFs are known for their intuition and empathic abilities. The SJs (ISTJs, ISFJs, ESTJs, ESFJs): SJs are characterized by their orderly, efficient personalities. The STs (ISTPs, ISFPs, ESTPs, ESFPs): SPs are known to be spontaneous and practical. Other categorizations include categorizing based on function groups (ISTJs, ESTJs, INFPs, and ENFPs because they all use Si, Ne, Te, and Fi in various orders) or by the E/I and J/P axes (IPs, IJs, EPs, and EJs)."
    },
    {
      "title": "Learn about type development.",
      "content": "Learn about type development. People develop their functions at different points in life. [25] X Research source You may enjoy furthering your knowledge in this area. People usually develop the functions in order with the exception of the inferior function."
    },
    {
      "title": "Explore shadow-type theory.",
      "content": "Explore shadow-type theory. Your shadow-type (not the same as shadow functions) is the type with the same functions, but in reverse order (an ESTJ's shadow is the INFP since the ESTJ's functions are Te, Si, Ne, Fi, and the INFP's are Fi, Ne, Si, Te). Your shadow type is said to \"shadow\" you, and you resort to it in times of stress. Likewise, people shadowing each other (e.g., an ESTJ and INFP) provide contrast and new viewpoints to each other."
    },
    {
      "title": "Determine your dichotomies.",
      "content": "Determine your dichotomies. Check the above section to determine which dichotomies apply to your personality. Each letter represents one of the dichotomies. For example, an ESTP's preferences are: Extraversion Sensing Thinking Perceiving"
    },
    {
      "title": "Check out the cognitive functions.",
      "content": "Check out the cognitive functions. If you have figured out your dichotomies, move on to see if you relate to the cognitive functions by checking out the above section. If you aren't aware of your dichotomies, you can also figure out your type solely through the functions. The cognitive function stack for each of the types is: INTP: Ti, Ne, Si, Fe INTJ: Ni, Te, Fi, Se ISTP: Ti, Se, Ni, Fe ISTJ: Si, Te, Fi, Ne INFP: Fi, Ne, Si, Te INFJ: Ni, Fe, Ti, Se ISFP: Fi, Se, Ni, Te ISFJ: Fe, Si, Ne, Ti ENTP: Ne, Ti, Fe, Si ENTJ: Te, Ni, Se, Fi ESTP: Se, Ti, Fe, Ni ESTJ: Te, Si, Ne, Fi ENFP: Ne, Fi, Te, Si ENFJ: Fe, Ni, Se, Ti ESFJ: Fe, Si, Ne, Ti ESFP: Se, Fi, Te, Ni"
    },
    {
      "title": "Look at other aspects of MBTI theory.",
      "content": "Look at other aspects of MBTI theory. Check to see if you relate to loops, grips, shadow-stacks, and other branches of MBTI."
    },
    {
      "title": "Take a free online test.",
      "content": "Take a free online test. There are many free tests online that can tell you your type. A quick search for “MBTI test” will give you plenty of results. One of the most common “MBTI” tests is the 16 Personalities test despite actually being a Big 5 (OCEAN) test that was mashed with MBTI. [26] X Research source This does not mean it's useless, however; it's just not completely accurate to MBTI. These results can vary greatly and may change based on your mood, the wording of the questions, and other factors. Many tests have acquired a bad reputation because of this. Most tests use the dichotomies, not the functions, as the dichotomies are simpler to explain. Remember to answer on how you actually feel and/or act, not how you want (or how someone else wants you) to act/feel. Don’t be afraid to admit to some of your traits; there are no wrong answers. Even if the results aren’t completely accurate, they tend to get at least 2-3 letters right. Using one of the other methods in this section is still a good idea, however."
    },
    {
      "title": "Take the official MBTI test.",
      "content": "Take the official MBTI test. If you want a more accurate and official answer, try taking the official MBTI. The official MBTI test can be taken online or in-person for roughly $15-40. [27] X Research source Know that these can still be inaccurate, and confirming your type in some other way is a good idea. Just like when taking a free test, you must answer based on how you think/act, not how you want yourself (or someone else wants you) to think/act."
    },
    {
      "title": "Book a session with a typologist.",
      "content": "Book a session with a typologist. Some typologists will offer typing services where they have a short video call or in-person session with you, during which they try to figure out your type. These can be booked for roughly $40-200 and typically range from 30 to 60 minutes long. Try to find a typologist with credentials and good testimonials. Check for psychology degrees and certification as MBTI practitioners. If the price is too high or booking a session is otherwise undesirable, you can use the other methods mentioned. A typologist is only human, and they will never know what it is like to be you. Since they may make a mistake, it’s a good idea to confirm your type in another method. Typologists may also answer any questions you have about MBTI and typology as a whole."
    },
    {
      "title": "Ask questions.",
      "content": "Ask questions. Try asking questions in MBTI communities. Many people experienced in typology will happily try to help you determine your type. Try asking questions in wikiHow's Q/A or on a message board."
    },
    {
      "title": "Check out some bloggers, vloggers, or other social media users of your type.",
      "content": "Check out some bloggers, vloggers, or other social media users of your type. Seeing if you relate to them can be a useful way to find your type. Know that people often have online personas (which can be especially true for people of certain types!) and may not show their true selves. Additionally, they may have mistakenly mistyped themselves."
    },
    {
      "title": "Avoid using things like career or interests to determine MBTI.",
      "content": "Avoid using things like career or interests to determine MBTI. While certain types gravitate towards particular careers or interests, interests and careers vary greatly and are not a good determiner of type. Likewise, things such as gender or sexual orientation should not be used either."
    },
    {
      "title": "Remember there's no one right way to be a type.",
      "content": "Remember there's no one right way to be a type. INFPs aren't always artists. ISTPs aren’t always craftsmen (or male at all!). One person’s definition of “ISTJ” could be wholly different from another’s. Keep this in mind. Only you can know your type. No one else knows how your mind functions. Even if everyone keeps telling you you're an ENTJ when you think you’re an INFP, you are the only person who could know. Remember that any psychological test is like a photograph of many different contextual things coming together in one moment. Just like you can't look exactly the same in photos across your life, your typological snapshot may shift over time, with some things staying the same. Only you can decide if this feels relevant, or if it acts as a portal to connect you to some part of you that was previously unknown."
    },
    {
      "title": "Dispel stereotypes and biases.",
      "content": "Dispel stereotypes and biases. There are many stereotypes about the types. Dispel these to have an unbiased typing process. Sensors are not \"stupid\". Thinkers aren't always nerds with no social skills. Introverts do not hate socialization, and extraverts do not loathe alone time. Not all NTs are scientists or mathematicians. STJs aren't \"neat freaks\" who never have fun. INTJs aren't evil masterminds. NTPs don't always play video games. Feelers still use logic. ISTPs aren't always craftspersons."
    },
    {
      "title": "Understand what MBTI is not.",
      "content": "Understand what MBTI is not . MBTI should not be used to define who you date, your friends, or your career. MBTI is not a predictor of happiness or life satisfaction. MBTI should not dictate your friendships or relationships. People of any type can have a relationship. Although MBTI is often employed in relationships and careers, it's used to understand employees/partners, not choose partners or employees."
    },
    {
      "title": "Remain sensible with MBTI.",
      "content": "Remain sensible with MBTI. MBTI is a foundation for understanding yourself and others better, not a complete blueprint to your life. It's okay to not meet every criterion for your type. If you're actually an ESTP but you benefit from life tips for INTJs, that's okay! You aren't harming INTJs by applying tips to your life or posting in an INTJ forum. These are archetypes. If they were complete blueprints, there would only be 16 different types of people and they’d be a lot more obvious."
    },
    {
      "title": "Grow.",
      "content": "Grow. A practical way to use MBTI is to understand your weaknesses and strengths. See what areas people of your type struggle in and see if you can improve in those areas. Talking to like-minded individuals can help you identify areas in which you lack. Consider if you enter loops or grips. Try to see what you can do to get out of loops/grips and/or channel loops/grips healthily. Your weaknesses aren't in stone. You can overcome your weaknesses."
    },
    {
      "title": "Embrace your traits.",
      "content": "Embrace your traits. You are trying to embrace yourself, not trying to become a different type. Although personality does change, this happens naturally and not by force. Some enthusiasts believe your type is in-grained at birth and that changes are just different phases of development. You can overcome your weaknesses but not rewire your brain."
    },
    {
      "title": "Understand others better.",
      "content": "Understand others better. Try using MBTI to understand other people. For example, if you are an ISFJ, you may want to use MBTI to understand your INTP partner better. [28] X Research source For example, instead of blowing up at your ESFJ brother, you could recognize that you approach the world differently and agree to disagree. Likewise, you should also notice and appreciate your friend/family member’s strengths. [29] X Research source Many have found MBTI useful in relationships to better understand their partners. Some have even said that MBTI saved their relationship."
    },
    {
      "title": "Learn MBTI lingo.",
      "content": "Learn MBTI lingo. In the MBTI community, you may find terms seldom used elsewhere. Here is a list of common MBTI slang and vocabulary. Preferences or dichotomies. The four different personality axes (introversion/extraversion, intuition/sensing, thinking/feeling, judging/perceiver). \"Dom\", \"aux\", \"tert\" are shorthand for the dominant, auxiliary, and tertiary functions, respectfully. (Function name) dom indicates a type with that function in their dominant slot (e.g., Ne dom is either an ENTP or ENFP). IxFP, ENxJ, etc. An “x” stands for either dichotomy (ENFx or ENFX stands for either ENFJ or ENFP). Likewise, ENF or ENFJ/P also stands for either ENFJ or ENFP. Some people will write their type with an \"x\" to signify they are not sure of their type or that they consider themselves both types. Carl Gustav Jung was the Swiss psychiatrist who devised the concepts of MBTI. Psychology Types is a book written by Carl Jung describing the functions. Isabel Myers and Katharine Cook Briggs are the mother-daughter team who applied Carl Jung’s concepts and wrote the book Gifts Differing . ”16p” is shorthand for 16Personalities.com (the online test). A “jumper” is someone who doesn't follow the traditional function stack for their type (e.g., an ESFP preferring Te to Fi). Socionics is another personality system that was birthed from MBTI. The Five Factor Personality test (OCEAN or sometimes CANOE) is another personality assessment. The acronym “OCEAN” stands for the five traits on the scale (openness to experience, conscientiousness, extraversion, agreeableness, and neuroticism). [30] X Research source Enneagram is another typological system. [31] X Research source The “functions” refer to the cognitive function explained above. The “T” or “A” at the end of the letters (such as “INFJ-A”) stands for turbulent or assertive. This letter was added by the site 16 Personalities. The turbulent versus assertive scale was based on the neuroticism scale on the Five-Factor Personality scale (OCEAN)."
    },
    {
      "title": "Engage in MBTI culture.",
      "content": "Engage in MBTI culture. You can find many MBTI memes, comedy sketches, and other things online. Try typing some of your favorite characters or celebrities. It can give you some typing practice and a fun activity. Note: If you’re typing a celebrity who is still alive, make sure to be respectful, especially if you’re doing it with other people."
    },
    {
      "title": "Share MBTI with others.",
      "content": "Share MBTI with others. Even if your friends/family do not want to take the time to understand the theory deeply, they may enjoy taking a test such as the one on 16Personalities.com. Taking a test can help you better understand your friend/family member and can be a fun activity."
    },
    {
      "title": "Expand your viewpoint.",
      "content": "Expand your viewpoint. This article is only a starting point. If you want to learn more about MBTI, try reading some blogs, joining a forum, or something else. MBTI is a rich field with many differing ideologies. Topics debated in the MBTI community include: The attitude of the tertiary function. (Is it the same or different than the dominant function's attitude?) Whether or not the function stacks are set in stone. (Are there people who don’t follow one of the sixteen functional stacks? Do “jumpers” exist?) Shadow-function theory. (Do we use four or eight functions?) Whether or not type is lifelong. Whether or not you can be multiple types. (Do ESTP/Js exist?)"
    },
    {
      "title": "Learn more about personality and general psychology.",
      "content": "Learn more about personality and general psychology. For some, MBTI is a bridge into psychology and may even lead to a career. Even if your interest is just a hobby, you may enjoy learning about other aspects of psychology. Similarly, you may enjoy learning about other personality systems, such as Big 5 (OCEAN), HEXACO, True Colors, or Enneagram."
    },
    {
      "title": "Understand that all types are equal.",
      "content": "Understand that all types are equal. No preference or combination of preferences are better than another. All types have a valuable place in the world. [32] X Research source"
    }
  ]
}