{
  "url": "https://www.wikihow.com/Stay-Underwater-Longer",
  "title": "How to Stay Underwater Longer",
  "steps": [
    {
      "title": "Start a cardiovascular exercise routine.",
      "content": "Start a cardiovascular exercise routine. The best way to increase the amount of time you can stay underwater is by increasing your cardiovascular ability. [2] X Expert Source Alan Fang Former Competitive Swimmer Expert Interview. 10 January 2019. By committing to a cardio training exercise routine, you’ll increase your body’s ability to process and use oxygen. Commit to running, powerwalking, using an elliptical, or another cardio activity. Exercise 3 to 5 times a week for at least 30 minutes. The longer you work out, though, the better."
    },
    {
      "title": "Swim",
      "content": "Swim often. [3] X Expert Source Alan Fang Former Competitive Swimmer Expert Interview. 10 January 2019. By swimming a lot, you’ll get your body used to being in the water. You’ll also dramatically increase your cardio and your body’s ability to use oxygen efficiently. Ultimately, the more you swim, the easier it will be for you to stay underwater long. Swim 3 to 5 times a week for at least 30 minutes each time. Swimming can take the place of other cardio workouts."
    },
    {
      "title": "Avoid a serious weight-training routine.",
      "content": "Avoid a serious weight-training routine. While you may think that weight training could increase your lung capacity and the ability of your body to process oxygen, it might undermine your goal of staying underwater long. This is because the more muscle mass you have, the more oxygen your body will need. Consider a light weight-training routine in which you tone your body and increase certain muscle groups – like your arms and legs. Targeting certain muscle groups could help you support the weight of an oxygen tank or other equipment (if you scuba). [4] X Research source"
    },
    {
      "title": "Gain lots of experience in the water.",
      "content": "Gain lots of experience in the water. One of the most important factors in staying underwater a long time is being able to relax while underwater. If you’re anxious or nervous, you will breathe deeper and use more air. As a result, spend as much time underwater as you can. [5] X Research source Consider getting broad experience in different bodies of water. This way, you’ll be able to adjust quickly to new circumstances. Try different activities in the water, like snorkeling or scuba diving."
    },
    {
      "title": "Stay still.",
      "content": "Stay still. In the end, the more you move, the more air you’ll use and the quicker you’ll have to return to the surface. To avoid this, try to stay as still as possible. If you do have to move, do so deliberately and calmly. You’ll find that by staying still, you’ll be able to stay underwater longer. [6] X Research source"
    },
    {
      "title": "Avoid going too deep.",
      "content": "Avoid going too deep. The closer you stay to the surface, the less air you’ll use. Because of this, avoid going deep as it will drain your air quicker. If you’re in a swimming pool, stick to the shallow end and stay just below the surface. If you’re in a natural body of water, try to hold on to something that keeps you near the surface. For example, try to hold on to a dock post. [7] X Research source"
    },
    {
      "title": "Get air when you need.",
      "content": "Get air when you need. The second you start to feel light-headed, you should return to the surface. If you stay underwater without oxygen, you risk brain damage or drowning. [8] X Research source Call emergency services immediately if someone loses consciousness while underwater."
    },
    {
      "title": "Hold your breath while swimming.",
      "content": "Hold your breath while swimming. Instead of breathing regularly while you swim, consider holding your breath. Do this for a certain amount of time, like 30 seconds to 1 minute. This will slowly train your mind and body. To do this: Warm up, without holding your breath, with a 400-meter swim. Complete sets of 25-meter freestyle swims without breathing. Try to do 10 sets of these. Allow yourself 15 to 30 seconds to breathe in-between sets. [9] X Research source"
    },
    {
      "title": "Use a watch with a timer.",
      "content": "Use a watch with a timer. Perhaps the best tool in training yourself to stay underwater is a timer. Use a timer to establish a baseline for how long you stay under. Then, time yourself every time you go underwater and try to beat your best time. [10] X Research source"
    },
    {
      "title": "Slowly increase the amount of time you are underwater.",
      "content": "Slowly increase the amount of time you are underwater. After you have a baseline of how long you can stay underwater, you should challenge yourself to increase that time slowly. You’ll find that increasing the amount of time you’re underwater by a few seconds a week could have huge results over the course of many weeks or months. Set a goal of increasing your time underwater by 5% to 10% a week or a month, depending on your ability. Remember, though, it is best to focus on slow progress."
    },
    {
      "title": "Practice deep breathing.",
      "content": "Practice deep breathing. Take a deep breath through your mouth. Hold it for a second. Use your mouth to exhale for 10 seconds. Make sure your mouth isn’t open very much as you exhale. Do this for a minute and a half. You can practice breathing while in the water or while on land. Practice at least 3 times a week, until you are completely comfortable with deep breathing. By practicing, you'll condition yourself to deep breathing and be able to increase the amount of time you stay underwater. [11] X Research source"
    },
    {
      "title": "Alternate between breathing and holding your breath.",
      "content": "Alternate between breathing and holding your breath. Once you've mastered deep breathing, you can train yourself to alternate breathing and holding your breath. Start by holding your breath for 30 seconds and then breathing for a minute. Do this for a given amount of time. Consider doing a 5-minute warmup workout before your breathing exercises. Try swimming or running for a few minutes. This will get your heart rate up and get you breathing faster. [12] X Research source"
    }
  ]
}