{
  "url": "https://www.wikihow.com/Wake-Someone-Up-over-the-Phone",
  "title": "How to Wake Someone Up over the Phone",
  "steps": [
    {
      "title": "There’s no immediate way to alert someone when their phone is on silent.",
      "content": "There’s no immediate way to alert someone when their phone is on silent. Once a person switches on \"silent\" mode, their phone will mute notifications from everyone on their contact list. When you call, they won't be able to hear ring tones or alerts. [1] X Research source “Silent” mode quiets any notifications. However, a phone will still light up or vibrate. When a phone is on “ Do Not Disturb ” mode, it blocks notifications—it won’t light up or vibrate. If they program their own alarm on their phone, then they'll hear it even if it's on silent mode."
    },
    {
      "title": "If you plan in advance, there are settings and apps to wake someone up over the phone.",
      "content": "If you plan in advance, there are settings and apps to wake someone up over the phone. For any of them to work, this individual will have to switch off silent mode or change their phone's settings to give you special permission to contact them. [2] X Research source When you edit a person's \"Do Not Disturb\" settings or add yourself as an emergency contact , they'll hear you when you call. Special apps called \"social alarm apps\" are designed to allow you to customize fun alarms and reminders to wake this person up."
    },
    {
      "title": "Go to “Settings.”",
      "content": "Go to “Settings.” Tap this app on the Home Screen or the App Library. [3] X Research source"
    },
    {
      "title": "Tap \"Focus.\"",
      "content": "Tap \"Focus.\" Choose the square purple icon with the symbol of a white crescent moon. Select “Do Not Disturb.”"
    },
    {
      "title": "Select “People.\"",
      "content": "Select “People.\" Find it under the “Allowed Notifications” tab."
    },
    {
      "title": "Add yourself to the “Allow Calls From” list.",
      "content": "Add yourself to the “Allow Calls From” list. Now, you’ll be able to call them at any time—even when their phone is on silent ."
    },
    {
      "title": "Go to their contact list.",
      "content": "Go to their contact list. Scroll down until you find your number. Tap it to select it."
    },
    {
      "title": "Edit the info for your number.",
      "content": "Edit the info for your number. Choose a ringtone with a special sound effect that's loud and exciting so you can wake this person up. For example, “chimes” resemble the sound wind chimes make. [4] X Research source"
    },
    {
      "title": "Edit their “Do Not Disturb” settings.",
      "content": "Edit their “Do Not Disturb” settings. Swipe down from the top of their phone’s screen to access the “Control Center.\" [5] X Research source"
    },
    {
      "title": "Tap “Do Not Disturb.\"",
      "content": "Tap “Do Not Disturb.\" When the menu opens up, select “People” under the “What can interrupt Do Not Disturb ” tab."
    },
    {
      "title": "Add yourself as a \"starred contact\" in their “Calls” list.",
      "content": "Add yourself as a \"starred contact\" in their “Calls” list. Select “Calls from” and add your number to the list that pops up."
    },
    {
      "title": "Enable sound alerts for your number.",
      "content": "Enable sound alerts for your number. Swipe “Alarms” to the right."
    },
    {
      "title": "Go to their Contacts list and edit your number's info.",
      "content": "Go to their Contacts list and edit your number's info. Select “Sound” and choose an alert that will get their attention every time you call."
    },
    {
      "title": "Give the Galarm app a go for helpful reminders.",
      "content": "Give the Galarm app a go for helpful reminders. Galarm allows someone to create group chats, “buddy alarms,” and urgent alerts. Members can configure alarms in their apps or on a web browser. [6] X Research source Galarm also has special alarms that are designed to notify multiple people at the same time. This is helpful if a whole group needs to schedule a wake up call."
    },
    {
      "title": "Install the Snoozle app so they can receive audio messages.",
      "content": "Install the Snoozle app so they can receive audio messages. If you and other mutual friends also have Snoozle, you can record yourselves talking and send this person voice memos as a fun alternative to a standard alarm tone. [7] X Research source Their friends and family can record messages that are up to 12 seconds long. The messages are also self-deleting, so anyone sending them can get really silly without worrying about the voice memo being played again later!"
    },
    {
      "title": "Use the WakieChat app’s “social alarm clock” feature.",
      "content": "Use the WakieChat app’s “social alarm clock” feature. This allows a random stranger to give someone a wake up call. They both have to be in the same region that speaks the same language, and their numbers will be hidden from each other. [8] X Research source WakieChat's research suggests that a 1-minute call with a stranger immediately engages a person's brain, which is very effective for waking this individual up. If this person really hits it off with whoever called them, they can go to the in-app forum and message the individual who woke them up."
    },
    {
      "title": "Give the WakeMe app a shot for a fun surprise.",
      "content": "Give the WakeMe app a shot for a fun surprise. WakeMe gives users a chance to record their own alarm tones and send them to strangers to change up their wake up routine. If someone wakes up within 90 seconds of the new alarm, they have a chance to chat with whoever sent it. [9] X Research source WakeMe also allows users to create profiles. That way, members can learn about each other if they respond to their alarm quickly enough. If the person prefers to be woken up by a stranger of a particular gender, there's a feature for that. Once an individual starts adding friends, they can opt to receive alarms only from these members. Members can create a schedule and review all of their alarms. For example, they can see when they need to wake up for exercise classes and exams."
    },
    {
      "title": "Try out the Air Horn app.",
      "content": "Try out the Air Horn app. Grab their attention with an exciting sound effect. Install an “Air Horn” app on your phone’s friend. Choose one of the app’s sound effects as your ringtone when you call. If you’re able to walk up to them while they’re sleeping, play one of the app’s alerts to surprise them and get them out of bed. [10] X Research source Ask which sound they like the best or think they’re more likely to wake up to—they might prefer a stadium horn or a trumpet effect."
    },
    {
      "title": "If they live with you, set up a WiFi activated sunrise alarm.",
      "content": "If they live with you, set up a WiFi activated sunrise alarm. Use a special app to connect your phone to the alarm. Place a sunrise alarm near this individual—on their nightstand, for example. Install an app that’s compatible with the sunrise alarm and connect the alarm to your phone. Use the app to select the time this person wants to wake up. [11] X Research source Make sure you're connected to the same WiFi network—if you are, then you can use your phone to configure the settings on this individual's sunrise alarm clock. Most sunrise alarm apps also allow you to choose different shades of light for this person to wake up to. Check which color they prefer. Sunrise alarms can help defeat grogginess and offer a gentler way to wake up. [12] X Research source"
    }
  ]
}