{
  "url": "https://www.wikihow.com/Type-with-Accents-on-an-Android-with-Smart-Keyboard",
  "title": "How to Access Accented Characters on Your Android Smart Keyboard",
  "steps": [
    {
      "title": "Purchase and Install Smart Keyboard Pro.",
      "content": "Purchase and Install Smart Keyboard Pro. Dexilog Smart Keyboard Pro is a paid app that costs $2.49 to purchase. You can purchase and install Smart Keyboard Pro from the Google Play Store use the following steps to do so: Open the Google Play Store. Search Smart Keyboard . Tap Smart Keyboard in the search result. Tap the app price. Tap Buy ."
    },
    {
      "title": "Open the Settings of your Android device.",
      "content": "Open the Settings of your Android device. To do so, swipe down from the top of the screen to open the Quick Access menu. Then tap the gear icon in the upper-right corner."
    },
    {
      "title": "Select “Language and Input” from the Settings menu.",
      "content": "Select “Language and Input” from the Settings menu. On stock Android, it is in the System option. On Samsung Galaxy, it is in the General management option. If you can't find this section in the Settings app, tap the magnifying glass icon in the upper-right corner and search \"Keyboard.\""
    },
    {
      "title": "Tap On-screen keyboard (stock Android) or Keyboard list and default (Samsung Galaxy).",
      "content": "Tap On-screen keyboard (stock Android) or Keyboard list and default (Samsung Galaxy). This displays a list of keyboards you have installed on your Android phone"
    },
    {
      "title": "Tap Smart Keyboard Pro.",
      "content": "Tap Smart Keyboard Pro . Tap the radio option next to Smart Keyboard Pro."
    },
    {
      "title": "Tap Ok.",
      "content": "Tap Ok . This enables Smart Keyboard Pro."
    },
    {
      "title": "Tap a text field.",
      "content": "Tap a text field. This can be a note, email, text message, instant message, or social media post. Tap anywhere you enter text."
    },
    {
      "title": "Tap and hold a letter.",
      "content": "Tap and hold a letter. Long press any letter you want to add an accent to. A list of accents for that letter will appear."
    },
    {
      "title": "Tap the accented letter you want to use.",
      "content": "Tap the accented letter you want to use. This adds the letter to your text. You can do this anytime you need to add an accent to a letter. You can type with accents using other keyboard apps, including Gboard as well as the default Samsung Galaxy and iOS keyboards."
    }
  ]
}