{
  "url": "https://www.wikihow.com/Tell-if-a-Girl-in-Your-Class-Likes-You-(High-School)",
  "title": "How to Tell if a Girl in Your Class Likes You (High School)",
  "steps": [
    {
      "title": "Notice if she seems to look at you a lot.",
      "content": "Notice if she seems to look at you a lot. If you catch her staring at you, that could be a sign she's into you or wants to get to know you better. Don't stare at her! However, look at her occasionally to see if you can catch her looking at you. [1] X Research source Keep in mind that some girls are shy, so this isn't a tried-and-true method to tell if she likes you. In fact, she may avoid your gaze instead of looking at you. Also, notice if she tries to find you when she walks in the room. She may look around, and when she finds you, her eyes will stop on you for a second. Often, she may glance away as soon as she notices you're looking at her, too! [2] X Research source Reader Poll: We asked 1872 wikiHow readers to tell us what the clearest signal was that a girl had a crush on them, and 51% said prolonged eye contact. [Take Poll] Every girl is different, and you shouldn’t assume she likes you unless she says so. But according to wikiHow readers, staring could definitely be a sign that she’s into you!"
    },
    {
      "title": "Watch for her to flash you a smile.",
      "content": "Watch for her to flash you a smile. If a girl likes you, she may start smiling at you more often. Maybe her face lights up when you walk over to you, or when you catch her eye, she flashes a grin. These could be signs she likes you. [3] X Research source"
    },
    {
      "title": "Look if she seems approachable when you're around.",
      "content": "Look if she seems approachable when you're around. If a girl likes you, she'll often make herself more approachable. She'll put down her phone, and turn her body towards you, for instance. She might also sit up straighter, tilt her chin up, or move her hair out of her face with her fingers. Much of this movement is subconscious, and it can indicate she's into you. Especially if she's with a friend of yours and she stops her conversation to speak to you [4] X Research source On the other hand, if she crosses her arms and legs, turns her body away from you, picks up her book or phone, or generally looks like she doesn't want to be disturbed when you're around, she may not like you."
    },
    {
      "title": "Notice if she preens or blushes.",
      "content": "Notice if she preens or blushes. When we're around someone we like, we tend to unconsciously preen. For instance, she might run her fingers through her hair, adjusting her headband, or pass her hands over her clothing to smooth it out. [5] X Research source She might also blush when she sees you."
    },
    {
      "title": "Check if she suddenly becomes more fidgety when you're nearby.",
      "content": "Check if she suddenly becomes more fidgety when you're nearby. People tend to fidget when they're nervous, and if a girl likes you, she's going to be nervous around you! That may mean she jiggles her leg, plays with her hair, or jingles her keys. She might also bite her nails or mess with any jewelry she's wearing. [6] X Research source Of course, some people just naturally fidget a lot. Watch her before she notices you're nearby. Check if she seems to fidget more when she sees you."
    },
    {
      "title": "Check if she laughs at your jokes.",
      "content": "Check if she laughs at your jokes. A girl who likes you will laugh more when you're around. She may even laugh at something that's not that funny, just because you said it. If she seems to be laughing or giggling a lot while you're talking to you, she may be into you. [7] X Research source"
    },
    {
      "title": "Notice if she starts acting differently around you.",
      "content": "Notice if she starts acting differently around you. If you've been friends, she may suddenly seem more distant. If you haven't been close, she may suddenly seem more affectionate. If her behavior suddenly changes towards you, her feelings may have changed, too. [8] X Research source Also, watch how she treats other people in comparison to how she treats you. If she treats you differently, that could indicate she likes you."
    },
    {
      "title": "Pay attention if she touches you a lot.",
      "content": "Pay attention if she touches you a lot. People who like each other tend to make gentle contact while talking. For instance, she might reach out and touch your arm when she's making a point, or she might rub your shoulder as she walks up behind you. Hugs are also a good sign."
    },
    {
      "title": "See if she tries to be around you a lot.",
      "content": "See if she tries to be around you a lot. While she's not likely to follow you around, she might just show up where she knows you're going to be, such as reading in the library when she knows you have study hall there. Alternatively, she might try to sit at a nearby table at lunch or even at the same table. Also, if she seems to be more dressed up than usual when she's around you, whether at school or when you're alone, that could mean she likes you."
    },
    {
      "title": "Check how quickly she replies to your messages.",
      "content": "Check how quickly she replies to your messages. If you're talking on social media or by text message, she'll likely reply fairly quickly if she's into you, often within minutes if she's online. If she's not that into you, she may wait longer to reply. [9] X Research source Also, if she adds you on social media, that's a good sign, too. [10] X Research source"
    },
    {
      "title": "Listen to see if she makes it known she's single.",
      "content": "Listen to see if she makes it known she's single. Often, she'll mention more than once that she doesn't have a boyfriend or girlfriend. If she's gay or bisexual (and you are, too), she might bring up that fact more than once to let you know she's available. [11] X Research source"
    },
    {
      "title": "Pay attention to compliments.",
      "content": "Pay attention to compliments. If she's always saying nice things to you, that's a pretty good sign she could be into you. Of course, everyone gives out a compliment every now and then, but if she is doing it regularly, pay attention. [12] X Research source For instance, you may notice she is always complimenting what you're wearing or how smart you are."
    },
    {
      "title": "Notice if she remembers the little things about you.",
      "content": "Notice if she remembers the little things about you. If she pays close attention to what you say and like, that's a good indicator. For instance, maybe she remembers you like cherry cola, so she grabs the last one at lunch for you before they run out. [13] X Research source Alternatively, maybe you say something about your brother, and she says, \"Charlie, right? I've heard you mention him before.\""
    },
    {
      "title": "Show her you like her, too.",
      "content": "Show her you like her, too. Before you ask her out, you can use the same signals to show her you like her, too. For instance, you can smile at her every time you see her, touch her arm in conversations, and invite her to sit next to you at lunch. [14] X Research source"
    },
    {
      "title": "Bolster your self confidence",
      "content": "Bolster your self confidence when you work up the courage. Confidence is attractive, so try to believe in yourself. If she doesn't like you, well, there's someone else out there for you! [15] X Research source To bolster your confidence, try practicing what you're going to say in a mirror first. Take a deep breath, and try to say it in a slow, steady voice."
    },
    {
      "title": "Ask her to hang out with you.",
      "content": "Ask her to hang out with you. Try a small \"date\" first. Ask her if she wants to hang out after school or go get a soda. You could even ask to study together. The more you're together, the more likely your friendship will blossom into something more. For instance, you might say, \"Hey Catherine! You feel like grabbing a soda with me after school?\""
    },
    {
      "title": "Accept defeat if you realize she doesn't like you.",
      "content": "Accept defeat if you realize she doesn't like you. If she doesn't return calls or texts and she disappears when you're around, she may not like you. If you feel like you're getting these signals, accept it and move on. You'll find someone else in time! [16] X Research source This is especially true after you've had a date or hung out together more. If she suddenly stops wanting to hang around with you, that may mean she's decided she's just not that into you."
    }
  ]
}