{
  "url": "https://www.wikihow.com/Use-Tracing-Paper",
  "title": "How to Use Tracing Paper",
  "steps": [
    {
      "title": "Place a sheet of tracing paper over your drawing and tape it in place.",
      "content": "Place a sheet of tracing paper over your drawing and tape it in place. Make sure the tracing paper is flat and that the entire image is covered by the tracing paper. Then use masking tape or painter’s tape to secure the edges of the tracing paper to your drawing surface. [1] X Research source For easier tracing, work on top of a light box , or even tape both drawings to a window to let the light illuminate them from behind. If you don’t have tracing paper, use culinary parchment paper instead."
    },
    {
      "title": "Trace the original image onto the tracing paper with a graphite pencil.",
      "content": "Trace the original image onto the tracing paper with a graphite pencil. Use a soft graphite pencil to carefully follow the lines of the original image. [2] X Expert Source Kathy Leader Artist Expert Interview. 13 February 2022. Don’t worry about tracing the shading in the original image. Focus on copying all the lines from the original image onto the tracing paper. [3] X Research source Don’t use a pen, marker, or colored pencil or you won’t be able to transfer your traced image onto another sheet of paper. If the tracing paper slips out of place as you’re working, line it back up using the lines you’ve already traced. Erase mistakes with an eraser, but be gentle so you don't tear the tracing paper."
    },
    {
      "title": "Remove the tracing paper.",
      "content": "Remove the tracing paper. Peel off the tape that was holding the tracing paper in place, and set the sheet of tracing paper next to the original image. [4] X Expert Source Kathy Leader Artist Expert Interview. 13 February 2022. Look at the two side by side and make sure you copied all the important lines. If you notice you missed a spot, place the tracing paper back over the original drawing and trace over the line you missed."
    },
    {
      "title": "Tape your traced drawing face down onto your new medium.",
      "content": "Tape your traced drawing face down onto your new medium. Flip your tracing paper over so that the graphite marks touch the new surface, like a blank sheet of sketchbook paper. Tape the tracing paper down at the corners with making tape or painter’s tape. [5] X Expert Source Kathy Leader Artist Expert Interview. 13 February 2022. Make sure your tracing paper lines up with the new sheet of paper below it, so that the entire drawing will transfer."
    },
    {
      "title": "Rub the back of the traced drawing to transfer it onto the medium below.",
      "content": "Rub the back of the traced drawing to transfer it onto the medium below. Use your pencil, the end of a marker, or another hard, smooth object. Apply firm pressure and rub over all of the lines in your traced drawing. [6] X Expert Source Kathy Leader Artist Expert Interview. 13 February 2022. This presses the graphite on the tracing paper onto the paper beneath it."
    },
    {
      "title": "Remove the tracing paper and touch up the transferred drawing.",
      "content": "Remove the tracing paper and touch up the transferred drawing. Peel off the tape and set the tracing paper aside. You’ll see a faded copy of the drawing you traced on the new sheet of paper. Fill in any lines that may not have been transferred with your pencil. Then, use a pen, marker, or paint to go over the pencil and complete the drawing. [7] X Research source Note that the finished transfer will be a mirror image of the original work."
    },
    {
      "title": "Cover a blank sheet of tracing paper in charcoal.",
      "content": "Cover a blank sheet of tracing paper in charcoal. Use a charcoal stick or a charcoal pencil to cover a blank sheet of paper, coating it with an even layer of shading. [8] X Research source You don’t need tracing paper for this method—use sketch paper, newspaper, or any other type."
    },
    {
      "title": "Tape the charcoal-covered paper face-down onto blank paper.",
      "content": "Tape the charcoal-covered paper face-down onto blank paper. Turn over the paper you scribbled charcoal onto and place it on top of your new medium, like a blank sheet of sketchbook paper. [9] X Expert Source Kathy Leader Artist Expert Interview. 13 February 2022. Tape the corners down with masking tape or painter’s tape. Make sure the charcoal-covered side touches the blank paper."
    },
    {
      "title": "Place the original drawing face-up on the charcoal paper and trace it.",
      "content": "Place the original drawing face-up on the charcoal paper and trace it. Set the drawing you want to trace face-up on top of the other 2 sheets. Then, art specialist Kathy Leader says to use a pencil or pen to go over the lines, and to “press hard on the lines so that the graphite transfers to the paper.” [10] X Expert Source Kathy Leader Artist Expert Interview. 13 February 2022. Trace over your original drawing in colored pen or pencil to keep track of which lines you’ve traced already."
    },
    {
      "title": "Remove the charcoal paper and the original drawing.",
      "content": "Remove the charcoal paper and the original drawing. Peel off the tape, then set the top 2 sheets of paper aside, revealing the transferred drawing. Touch it up or shade it in with a pencil, pen, or whatever medium you like. [11] X Research source"
    }
  ]
}