{
  "url": "https://www.wikihow.com/Use-an-Incentive-Spirometer",
  "title": "How to Use an Incentive Spirometer",
  "steps": [
    {
      "title": "Put the incentive spirometer together, if necessary.",
      "content": "Put the incentive spirometer together, if necessary. If you haven’t used the device before, you may need to assemble it. Wash your hands, then remove the pieces from the plastic bags. Stretch out the flexible tubing with the mouthpiece, then connect the side without the mouthpiece to outlet. The outlet is on the bottom right-hand side of the base. [3] X Research source"
    },
    {
      "title": "Position the marker to the recommended level, if applicable.",
      "content": "Position the marker to the recommended level, if applicable. The large column on the outside of the device has a marker, slider, or “coach indicator” that tells you how deeply you should breathe. Generally, your doctor will set this slider for you or let you know what level it should be set at. [4] X Research source As you breathe into the device, a piston or ball inside the column moves upward to reach the marker."
    },
    {
      "title": "Stand or sit upright before using the device.",
      "content": "Stand or sit upright before using the device. You should be positioned upright when using the incentive spirometer so that your lungs can expand fully. You can sit on the edge of your bed or in a chair, or even stand if you feel comfortable doing so. [5] X Research source"
    },
    {
      "title": "Hold the spirometer at eye level with the base parallel to the floor.",
      "content": "Hold the spirometer at eye level with the base parallel to the floor. Place the incentive spirometer in your non-dominant hand. Hold it at eye level, close enough that the mouthpiece will comfortably reach your mouth. Make sure the base is level and parallel with the floor. [6] X Research source"
    },
    {
      "title": "Exhale and place your mouth around the mouthpiece.",
      "content": "Exhale and place your mouth around the mouthpiece. Breathe out as you normally would, then use your dominant hand to put the mouthpiece to your lips. Close your lips around the mouthpiece and let your tongue rest in the bottom of your mouth to keep it from blocking the mouthpiece. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Inhale through your mouth until the piston reaches the marker.",
      "content": "Inhale through your mouth until the piston reaches the marker. With the mouthpiece in your mouth, take a slow, deep breath in. There is a yellow piston or ball inside the column that will rise as you inhale. The goal is to make the piston or ball rise to the level indicated by the slider or marker. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you can’t inhale deep enough to move the piston or ball to the recommended level, don’t get discouraged. As you continue to use the incentive spirometer, your lung function will improve. [9] X Research source"
    },
    {
      "title": "Hold your breath for as long as you can.",
      "content": "Hold your breath for as long as you can. Once the indicator has reached the desired level, hold your breath for as long as possible. Try to aim for at least 10 seconds. During this time, the piston or ball will slide back down toward the base."
    },
    {
      "title": "Exhale through your mouth, then rest for a few seconds.",
      "content": "Exhale through your mouth, then rest for a few seconds. After holding your breath as long as you can, slowly exhale through your mouth into the incentive spirometer. You can then remove the mouthpiece and rest for a few seconds. [10] X Research source"
    },
    {
      "title": "Repeat 10 times per hour or as often as your doctor recommends.",
      "content": "Repeat 10 times per hour or as often as your doctor recommends. If your doctor has given you specific instructions on how often to use the incentive spirometer, be sure to follow them exactly. Otherwise, aim for using the device 10 times per hour. Don’t forget to rest for a few seconds in between breaths to prevent lightheadedness. [11] X Research source"
    },
    {
      "title": "Cough to clear your lungs when you are finished.",
      "content": "Cough to clear your lungs when you are finished. After using the device the recommended number of times, try to cough a few times. Coughing will help clear any fluid or mucus from your lungs and make breathing easier. [12] X Research source"
    },
    {
      "title": "Clean the mouthpiece after each use or use a new one every 24 hours.",
      "content": "Clean the mouthpiece after each use or use a new one every 24 hours. If the mouthpiece isn’t disposable, wash it with mild soap and water between uses to disinfect it and prevent the buildup of bacteria. Alternatively, you can use a new disposable mouthpiece every day. [13] X Research source"
    },
    {
      "title": "Keep a log of your progress for your doctor, if applicable.",
      "content": "Keep a log of your progress for your doctor, if applicable. In some cases, your doctor may want you to keep track of how much air you’re able to inhale. Track your progress by writing down how far the piston moves upward each time you use the device. There are markings on the column that the piston is housed in that indicate how much air you’ve inhaled in milliliters. [14] X Research source"
    },
    {
      "title": "Report dizziness or lightheadedness to your doctor.",
      "content": "Report dizziness or lightheadedness to your doctor. Stop using the device if you feel dizzy or lightheaded at any point. Rest for as long as necessary, then resume your breathing exercises with the incentive spirometer.Let your doctor know if using the device causes any of these symptoms, and follow their instructions going forward. [15] X Research source"
    }
  ]
}