{
  "url": "https://www.wikihow.com/Stretch-Boots",
  "title": "How to Stretch Boots",
  "steps": [
    {
      "title": "Put on thick socks and your boots.",
      "content": "Put on thick socks and your boots. Putting on two pairs of socks will allow for greater stretch. [1] X Expert Source Trent Potter Shoe Care & Repair Specialist Expert Interview. 22 April 2021. You won't need to wear the boots for long, so don't worry too much about hurting your feet."
    },
    {
      "title": "Turn on the hairdryer.",
      "content": "Turn on the hairdryer. Aim the hair dryer at the area of the boot that needs stretching. Hold it a few inches (about 10 cm) away from the boot and only turn it on for a few seconds. [2] X Research source Move your foot around inside the boot or curl and stretch your toes for better stretching. Too much heat can damage boots, so never hold the hairdryer against them or heat them too long."
    },
    {
      "title": "Wear them until they cool down.",
      "content": "Wear them until they cool down. Walk until the boots have lost the heat from the hairdryer. If it's painful to walk in the boots, remain seated and stretch them by flexing your toes and foot."
    },
    {
      "title": "Test with normal socks, then repeat if needed.",
      "content": "Test with normal socks, then repeat if needed. If the boots have not stretched enough, heat and walk again."
    },
    {
      "title": "Apply leather conditioning cream (optional).",
      "content": "Apply leather conditioning cream (optional). Heat can dry out leather and make it brittle, so apply a leather conditioner afterward if using this method on leather boots. There's no need to moisturize synthetic material such as vinyl."
    },
    {
      "title": "Learn how to use this method properly.",
      "content": "Learn how to use this method properly. This is an easy and effective method for small to medium adjustments, but you shouldn't expect a full-size change. For that, you'll need a shoe stretching liquid and a boot stretcher. This method works because the water will expand when frozen, pushing into the shoe. It has nothing to do with the boots becoming wet, which could shrink or damage them."
    },
    {
      "title": "Fill two resealable bags partially with water.",
      "content": "Fill two resealable bags partially with water. Fill two Ziploc bags or other freezer-safe plastic bags roughly 1/3 full of water. Squeeze out as much of the air as possible before sealing. [3] X Research source Use a bag that will fit snugly into the part of the boot that needs stretching. A quart (liter) bag works for most toe and heel related adjustments, while you may need a gallon (4 liters) bag to stretch the calf of the boot. To remove the air, seal most of the way and leave a small gap. Gently press the portion of the bag containing air until most of the air has exited and the plastic is nearly flat. Bags not labeled for freezer use may break later in the process, leaking water onto your boots and potentially damaging them."
    },
    {
      "title": "Push the bags into the area you want to stretch.",
      "content": "Push the bags into the area you want to stretch. Put each bag of water into one of the boots. If you want to stretch the toe, tilt the boot forward and gently push the bag as far as it will go. If you need to stretch the calf, keep the bag from slipping by stuffing the toe with newspapers."
    },
    {
      "title": "Leave the boots in a freezer overnight.",
      "content": "Leave the boots in a freezer overnight. Put your boots in a freezer or icebox and leave them there for 8-12 hours. Unlike most liquids, water expands when it freezes, pushing the boot outward from the inside. If the bag slips out of the toe when you move the boots, tilt the boots forward and prop them up on a block of wood or anything else that will keep them stable."
    },
    {
      "title": "Thaw for 20 minutes or more.",
      "content": "Thaw for 20 minutes or more. Remove the boots from the freezer and wait for the ice to melt before removing the bags. How long this takes depends on the temperature. Don't try to remove the bags right away, as you could damage the boots trying to pull them out."
    },
    {
      "title": "Remove the bags and try on the boots.",
      "content": "Remove the bags and try on the boots. You should feel a noticeable difference in the stretched area. If it's still insufficient, or if the boot starts to shrink back, you can repeat this method to stretch it out further. If your boots are made of rubber, they won't stretch much since the material doesn't have a lot of give. [4] X Expert Source Trent Potter Shoe Care & Repair Specialist Expert Interview. 22 April 2021."
    },
    {
      "title": "Select a shoe stretching liquid.",
      "content": "Select a shoe stretching liquid. A 50/50 mix of rubbing alcohol and water will work if you don't want to buy a specialized stretching fluid. This will greatly increase the speed of breaking it in by walking or combine with boot stretchers to make more extreme changes. Leather stretching liquids will not work for synthetic boots. Some are specialized for patent leather or other subtypes, so read the label carefully. Check the label for special instructions. If a specific product requires a different method, follow its instructions. To avoid abrading the boot's material, dilute the rubbing alcohol with equal parts water. [5] X Research source"
    },
    {
      "title": "Prepare a work surface.",
      "content": "Prepare a work surface. Lay down some black and white newspapers to catch spills and drips, or work over concrete where they won't matter. Don't use colored newspapers, as the ink can transfer onto the boots."
    },
    {
      "title": "Test a small area.",
      "content": "Test a small area. Pick an unobtrusive spot on one of the boots, such as the back heel or the inside lip. Apply a small amount of the stretching liquid there and wait for it to dry. If it leaves a stain, try a different liquid or stretching method. Only test the inside lip if it is the same material as the outside of the boot. Check for stains under both natural and artificial light, if possible."
    },
    {
      "title": "Rub or spray the tight area.",
      "content": "Rub or spray the tight area. Apply stretching liquid to the area you want to be stretched and surrounding areas until the leather is damp or the synthetic material is visibly wet. Apply a spray about 5 inches (12 cm) away from the boots. You can apply the liquid to the outside or inside of the shoe. It should stretch either way. If the liquid begins to run off the shoe, stop and wipe off the excess."
    },
    {
      "title": "Put on one or two pairs of thick socks.",
      "content": "Put on one or two pairs of thick socks. Make your feet bulkier to stretch out the shoe more. If the shoes are only slightly abrasive, wearing only one pair of socks is fine. Use two pairs of socks for more significant stretching."
    },
    {
      "title": "Walk around in the boots while they're still wet and flexible.",
      "content": "Walk around in the boots while they're still wet and flexible. Wear them the rest of the day and walk around as much as possible to maximize the stretching. Don't walk around in boots that are causing you pain. Skip to the next step instead."
    },
    {
      "title": "If they require a lot of stretching, use a boot stretcher.",
      "content": "If they require a lot of stretching, use a boot stretcher. There's only so much you can achieve by wearing thick socks. If the boots are still too tight, buy a boot stretcher and use it to stretch the boot overnight: Find a boot stretcher that stretches the correct area. Some are specialized for toe, instep, or calf stretching, while \"two-way\" varieties increase the general size of the foot area. Place the boot stretcher into the shoe. Push the foot-shaped object to the end of the boot. If you are using a calf stretcher, place it in the ankle shaft of the boot. Turn the handle of the stretcher a couple of times until you see the tight area visibly stretch outward. Don't make it too tight. Leave the stretcher in for 8-48 hours. A small adjustment can be made overnight. A full-size difference requires a day or two."
    },
    {
      "title": "Select the correct stretcher.",
      "content": "Select the correct stretcher. Pick one designed to stretch the area you need, or you'll expand the boot in the wrong places. Stretchers are an excellent way to achieve significant stretching, especially when paired with shoe stretching liquid. A two-way stretcher will stretch the foot's length and width. A toe stretcher lifts the toe portion higher. A vamp or instep stretcher lifts the foot portion higher. A calf stretcher will widen the shaft of the boot. The term \"boot stretcher\" can also refer to this variety or any long-handled shoe stretcher, so the packaging carefully. If you don't know your boot size, bring it into the shop to compare to stretchers. Stretchers apply to a range of sizes, so the fit doesn't need to be perfect."
    },
    {
      "title": "Prepare the boots with shoe stretching fluid (optional).",
      "content": "Prepare the boots with shoe stretching fluid (optional). The boots will gain much-needed flexibility if you apply shoe stretching liquid first, making adjustments easier. If you don't want to buy a shoe stretching fluid, mix your own stretching liquid by combining rubbing alcohol and water in equal amounts. Make sure the liquid you use is suitable for your boot material, then apply on the tight areas until the shoe is wet. Continue to the next step immediately."
    },
    {
      "title": "Wedge each stretcher into a boot.",
      "content": "Wedge each stretcher into a boot. Use the knob to adjust it to a snug fit before placing it in the boot. If the handle is swallowed up by the ankle, you'll need to either unzip the boot or use a stretcher with a longer handle."
    },
    {
      "title": "Turn the handle to expand the stretcher.",
      "content": "Turn the handle to expand the stretcher. Rotate the handle, usually counterclockwise, to make the wedge wider. You should feel or see the boot expanding slightly in the area the stretcher is designed to affect. This typically takes 1-3 turns, but you should judge the amount by looking for a slight expansion and a tight feeling."
    },
    {
      "title": "Wait.",
      "content": "Wait. Typically you should leave the stretcher in for 24–48 hours. If you're worried the boots might become too loose, you should test them after 8 hours of waiting. If you test the boots and they are still tight, you can put the stretchers back in immediately or first apply additional shoe stretching liquid. After streching rubber boots , stuff the boots with newspaper if you do not wear them."
    },
    {
      "title": "Avoid getting your boots wet.",
      "content": "Avoid getting your boots wet. You might have heard someone recommend soaking your leather boot to wear it in faster. Even if this works, you risk damaging the material and it may shrink back as it dries. When stretching your boots with ice, be careful to only use freezer safe bags and make sure the seal will hold tightly."
    },
    {
      "title": "Don't expose your boots to prolonged high temperatures.",
      "content": "Don't expose your boots to prolonged high temperatures. They can weaken the material. If the boots do get wet, let them dry naturally rather than putting them in front of a fire to minimize shrinking. Use moderation when stretching your boots with a hairdryer for exactly this reason."
    },
    {
      "title": "Don't force your feet into a painful boot.",
      "content": "Don't force your feet into a painful boot. If walking in the boot causes you pain, you'll need a stronger and safer method than simply \"walking it in.\" Take breaks while you're breaking in your boots. [6] X Expert Source Trent Potter Shoe Care & Repair Specialist Expert Interview. 22 April 2021. Try stretching it with ice, or use a shoe stretcher for even greater adjustments."
    }
  ]
}