{
  "url": "https://www.wikihow.com/Tell-if-a-Handbag-Is-Genuine-Crocodile",
  "title": "How to Tell if a Handbag Is Genuine Crocodile",
  "steps": [
    {
      "title": "Be wary of an abrupt transition in the size and shape of the scales.",
      "content": "Be wary of an abrupt transition in the size and shape of the scales. Crocodiles have scales that gradually transition from large, square shapes on their bellies to smaller, more rounded shapes on their sides. If the change is abrupt, if it switches more than twice in a single panel, or if there is no transition, the bag is likely made from stamped leather. [1] X Research source"
    },
    {
      "title": "Look for an irregular grain pattern.",
      "content": "Look for an irregular grain pattern. Look closely and carefully at the grain pattern on the handbag. The pattern of the grain on a crocodile leather handbag will have some irregularities, as each scale will be of a slightly different shape and size. There may also be small, uneven lines present at the base of the scales. If the grain pattern of the scales is very uniform, it has probably been stamped on."
    },
    {
      "title": "Determine if it is crocodile by the feel and flexibility of the bag.",
      "content": "Determine if it is crocodile by the feel and flexibility of the bag. Run your fingers over the bag and pay attention to the softness and flexibility of the leather. Crocodile bags are soft, smooth, and supple. Stamped or embossed leather bags are more compact and rigid than genuine crocodile leather. [2] X Research source"
    },
    {
      "title": "Examine the tag to find out if the handbag is crocodile leather.",
      "content": "Examine the tag to find out if the handbag is crocodile leather. It’s not enough for the tag to say “genuine leather” as this won’t tell you what kind of leather it is, and genuine leather is actually the lowest quality leather. Instead, look for a tag that states that the handbag has been crafted from crocodile. [3] X Research source The tag may even say “full-grain leather,” meaning the grain of the hide has not been broken up."
    },
    {
      "title": "Expect to pay a considerable price.",
      "content": "Expect to pay a considerable price. Designer crocodile handbags are quite expensive―a Hermès Birkin crocodile handbag can cost upwards of $50,000! [4] X Research source Less prestigious brands sell crocodile handbags for a minimum of $2,000-$4,000, depending on the size and style. If someone is trying to sell you a crocodile handbag for less than a few thousand dollars, it is almost certainly a fake. [5] X Research source"
    },
    {
      "title": "Ask the seller for paperwork proving the crocodile handbag is genuine.",
      "content": "Ask the seller for paperwork proving the crocodile handbag is genuine. If you are buying a crocodile handbag from a reputable seller, they should have no problem answering all of your questions and providing you with paperwork that proves the bag was made from crocodile hide. If the seller refuses to answer your questions or provide you with paperwork, they are likely selling embossed or stamped leather bags. [6] X Research source"
    },
    {
      "title": "Identify alligator and crocodile leather by its softness.",
      "content": "Identify alligator and crocodile leather by its softness. Both crocodile and alligator leather are soft and supple. Caiman leather, however, is more rough and rigid. Simply run your fingers along the leather to determine if it is soft (meaning it’s alligator or crocodile) or rough (meaning it’s likely caiman). [7] X Research source"
    },
    {
      "title": "Look for cracks to identify caiman leather.",
      "content": "Look for cracks to identify caiman leather. Bend the leather to determine its flexibility. Alligator and crocodile leather are more pliable than caiman. If you see lots of light cracks when you bend the leather, it is probably made from caiman, which is the lowest quality reptile leather. [8] X Research source"
    },
    {
      "title": "See if the dye is absorbed smoothly and uniformly into the leather.",
      "content": "See if the dye is absorbed smoothly and uniformly into the leather. Alligator and crocodile hides are softer than caiman, so the dye is absorbed smoothly and uniformly into the leather. There shouldn’t be any areas that are darker or lighter than others. Caiman leather that has been dyed is likely to look blotchy due to the rougher texture. [9] X Research source"
    },
    {
      "title": "Look for a 4-2 pattern of horned bumps.",
      "content": "Look for a 4-2 pattern of horned bumps. If the leather used is from the back, rather than the belly, of the animal, you can determine which reptile it came from based on the number and pattern of horned bumps present. In addition to the flat scales, there will be a few horned bumps in the leather. Crocodiles have a 4-2 pattern of bumps (i.e. one row of four bumps and one row of two bumps). [10] X Research source Alligators have a 2-2-2 pattern of bumps (three rows of two), and caiman have a 4-4-2 pattern of bumps (two rows of four, one row of two)."
    },
    {
      "title": "Note a gradual transition of the size and shape of scales.",
      "content": "Note a gradual transition of the size and shape of scales. The scales of an alligator suddenly transition from wide, square shapes to small, round shapes (meaning one column has large scales while the next has small scales). On a crocodile, the transition is more gradual as the scales steadily become smaller and more rounded. [11] X Research source"
    },
    {
      "title": "Look for pores to distinguish alligator leather from crocodile leather.",
      "content": "Look for pores to distinguish alligator leather from crocodile leather. If the back side of the animal was used, you should look to see if there are pores (holes) in the horned scales. Crocodiles, unlike alligators, have pores in their scales from the small hairs that cover their bodies. [12] X Research source"
    }
  ]
}