{
  "url": "https://www.wikihow.com/Use-Visa-Giftcard-Online",
  "title": "How to Use a Visa Gift Card Online",
  "steps": [
    {
      "title": "Use your Visa gift card like a credit or debit card.",
      "content": "Use your Visa gift card like a credit or debit card. Visa gift cards can be accepted anywhere that accepts Visa. When you go to check out online, select the option to pay with a credit or debit card. Do not select the option to pay with a gift card. This option is for store-brand gift cards that only work with that retailer. Enter the 16-digit number, expiration date, and the 3-digit CVV number on the back. Make sure you activate your gift card before you try to use it to make purchases."
    },
    {
      "title": "Call the toll-free number on the card.",
      "content": "Call the toll-free number on the card. There should be a sticker with a toll-free number you can contact on the front of the card. Call this number and activate your gift card before attempting to use it."
    },
    {
      "title": "Activate your gift card online.",
      "content": "Activate your gift card online. In addition to calling the toll-free number, you can activate a Visa gift card at https://www.visaprepaidprocessing.com/MyGift/Verify/Activate . Have the 16-digit number, expiration date, and CVV number on the back ready. You can activate Vanilla Visa gift cards at https://balance.vanillagift.com/#/"
    },
    {
      "title": "Activate the card at the retail store you bought it from.",
      "content": "Activate the card at the retail store you bought it from. Visa gift cards are typically activated upon purchase. If your card was not activated, you can take it to the store you bought it from and have it activated."
    },
    {
      "title": "Activate Giftcard.com cards online.",
      "content": "Activate Giftcard.com cards online. If you bought a Visa gift card from Giftcards.com, you can activate it by going to https://www.giftcards.com/us/en/self-serve/activate-giftcard and entering the card number."
    },
    {
      "title": "Call the toll-free number on the card.",
      "content": "Call the toll-free number on the card. There should be a toll-free number you can call on the card. Call this number to check the balance of your Visa gift card . Make sure you have the 16-digit number on the card ready. [1] X Research source"
    },
    {
      "title": "Check with the card issuer's website.",
      "content": "Check with the card issuer's website. You can also check the balance of your card online by going to the card issuer's website. The following are a few websites you can use to check the balance of your Visa gift card: Giftcards [2] X Research source Vanilla Visa Gift Gift Card Mall Walmart Visa Gift"
    },
    {
      "title": "You may be able to use a Visa gift card to make a partial payment.",
      "content": "You may be able to use a Visa gift card to make a partial payment. If the remaining balance on your Visa gift card is less than the total transaction, you'll have to split the payment. Some online retailers provide this as an option, while others don't. [3] X Research source To use a Visa gift card for a partial payment on Amazon, add your Visa gift card as a payment option to your Amazon account. Select it as a payment option at checkout, and use your default payment to cover the rest of the balance. Alternatively, use your Visa gift card to buy an Amazon or other retailer gift card. Most online retailers will allow you to split the transaction total between a gift card and a debit or credit card."
    }
  ]
}