{
  "url": "https://www.wikihow.com/Text-or-Call-Your-Crush-Without-Being-Scared",
  "title": "How to Text or Call Your Crush Without Being Scared",
  "steps": [
    {
      "title": "Think positively",
      "content": "Think positively . Don’t dwell on what might go wrong with the conversation. Instead, try to adopt a positive attitude before talking to your crush. [1] X Research source If you’re feeling negative and discouraged, think of ways to put a positive spin on these negative thoughts. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For example, if you find yourself thinking about reasons why your crush might not like you, think about reasons why she will like you instead. Have a friend give you a pep talk to boost your confidence. The more optimistic you feel, the more positive your experience will be."
    },
    {
      "title": "Embrace the nerves.",
      "content": "Embrace the nerves . Everyone gets nervous. It’s your brain’s natural reaction to stimulating circumstances. The trick is to channel your anxiety into excitement. You can do this by repeating this positive mantra: “I’m so excited!” Repeating this phrase will help you gather energy from your anxiety instead of losing your nerve. [3] X Research source Any variation of “I’m so excited” will work. For example, you could say, “I’m so pumped about this!”"
    },
    {
      "title": "Chill out.",
      "content": "Chill out. If you find yourself losing your nerve, try to relax . Practice a breathing exercise or meditate for a few minutes. Closing your eyes and counting backward from ten will also help calm your nerves. If you’re still feeling frantic, go for a quick walk or jog to shake off the stress."
    },
    {
      "title": "Figure out what you want to say.",
      "content": "Figure out what you want to say. Having a plan will make you less nervous. Decide what you’ll talk about. Write down a few sample questions on a notepad. You can refer to these questions while you’re on the phone if you get anxious. Avoid topics that you know you’ll disagree on. Try to focus on interests that you have in common instead. If you’re worried that you’ll run out of conversation topics, read the newspaper or watch the news. If the conversation lags, you can bring up a current event and talk about it together."
    },
    {
      "title": "Consider multiple outcomes.",
      "content": "Consider multiple outcomes. Part of what makes reaching out to your crush so scary is that you have no control of the outcome. He may respond, or he may not, and there's little you can do to influence what he does, and that can be a little frightening. Allow yourself to feel optimistic and excited, by also know how to handle rejection if things don't go so well. Know how to deal with negative thoughts. If your crush is not responsive, you may start putting yourself down, wondering if there's something wrong with you, or feeling like you will never find love. These are natural thoughts to have in the face of rejection, but just having these thoughts doesn't make them true. Know how to refute these negative thoughts ahead of time so you can put a stop to them right away. Practice self-care. Know what makes you feel better. If talking to your friends usually lifts you, tell your friend you're going to be texting or calling your crush, and ask if you can hang out afterward. Or, make enough time so you can go for a run, watch a favorite show, or do something else that you know improves your mood. Reader Poll: We asked 817 wikiHow readers what do they do when a crush doesn’t respond to a text, and 57% said they would wait patiently for them to reply. [Take Poll]"
    },
    {
      "title": "Practice.",
      "content": "Practice. Practice makes perfect, even when learning how to talk to your crush. Rehearse your conversations with a friend by sending some sample texts. Alternatively, call your friend and pretend she's your crush. Try out all your sample questions and see what works. After the phone call, ask your friend to give you her honest opinion about your performance. Practicing with a friend will build your self-confidence and sharpen your conversation skills. If you’re persistent with practicing, you’ll be much more relaxed in stressful situations. [4] X Research source"
    },
    {
      "title": "Get her number.",
      "content": "Get her number. If you’re feeling bold, ask your crush in person if you can have her phone number. Alternatively, if you have a mutual friend, ask him to start a group text with a few people. This will give you access to your crush’s phone number. After a few days of talking to the group, “accidentally” text your crush a particularly funny joke outside of the group text. If you don’t want to ask for a phone number in person, you can ask over a social media platform such as Facebook or Instagram."
    },
    {
      "title": "Choose the right time.",
      "content": "Choose the right time. Avoid calling during lunch or dinner hours as your crush will probably be busy eating. Similarly, avoid calling or texting in the early hours of the morning or late at night. He may be sleeping. If you wake him up, he won’t be very happy with you. If your crush doesn’t answer the phone, leave a short message or send him a text and then go do something fun. Don't sit around waiting for him to call or text back — go live your life!"
    },
    {
      "title": "Find a good opening line",
      "content": "Find a good opening line . If you’re texting, start the conversation with a good knock-knock joke to get their attention. After you type “knock knock,” she will have no choice but to respond. [5] X Research source If you decide to call your crush, start with an overly-cheesy pickup line to make her laugh. Some other great opening lines include: [6] X Research source “My friends don’t want to see the new Avengers movie, but I don’t want to go alone. Interested?” “You looked amazing today! What’s your secret?” “How would you define yourself in three emoji’s or less?”"
    },
    {
      "title": "Strike the right tone.",
      "content": "Strike the right tone. Avoid talking about controversial, weird, or unpleasant topics. [7] X Research source These discussion topics bring negativity into your conversation. Instead, focus on fun experiences and shared interests. [8] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. You want your crush to have positive feelings about talking to you. Otherwise, he may not want to talk to you again. For example: “Have you ever been on any exciting vacations?” “I’m totally addicted to this new phone game. Have you played it?” “What are you going to do after you graduate?”"
    },
    {
      "title": "Find common ground",
      "content": "Find common ground . Chances are good that you and your crush have a few things in common. If possible, skim her social media profiles to find some common ground. Make sure you don’t do too much research or you’ll come across as creepy; [9] X Research source however, you probably have more in common than you think. Do you: Go to the same school? Play the same sports? Take the same classes? Know the same people?"
    },
    {
      "title": "Focus on mutual interests.",
      "content": "Focus on mutual interests. [10] X Research source Everyone enjoys talking about their personal interests and hobbies. Hopefully, you’ll have an interest in common with your crush, giving you an easy conversation topic. For example, if you share a favorite class together, ask your crush what he thought about the homework assignment. If you focus on these mutual interests, the conversation will flow naturally. For example: “I also love playing video games! Do you have any favorites?” “That’s my favorite soccer team too! Do you have any game day traditions?” “If you tell me what’s on your bucket list, I’ll tell you what’s on mine.” “I love that TV show! Who’s your favorite character?”"
    },
    {
      "title": "Ask questions.",
      "content": "Ask questions. Once your crush answers, ask to follow up questions. This will allow your crush to talk about herself. Ask questions that show you have a genuine interest in what she has to say. For example: “We just got back from France. Where’s the coolest place you’ve ever been to?” “What are you passionate about?” “I wish I could go to Hawaii. What’s your dream vacation?” “What’s your favorite class?”"
    },
    {
      "title": "Respond to his cues.",
      "content": "Respond to his cues. Gauge when the conversation is over. If there are long stretches of silence or the conversation becomes awkward politely excuse yourself . If you’re texting and your crush doesn’t respond immediately, give him time to answer. [11] X Research source If you bombard him with text messages he'll start ignoring you and may even block your number. When in doubt, keep your conversation under thirty minutes. You want to intrigue your crush and leave him wanting more, not exhaust him with your company."
    }
  ]
}