{
  "url": "https://www.wikihow.com/Suture-Wounds",
  "title": "How to Suture Wounds",
  "steps": [
    {
      "title": "Gather the necessary equipment:",
      "content": "Gather the necessary equipment: [1] X Research source To practice the suturing techniques, you will need a suture pad. It can easily be obtained online (from Amazon, for example). Tissue forceps: opens up wound and allows clear vision of the needle's puncture site Scissors: To cut excess thread. Needle holder: To prevent the spread of germs, the needle must always be held by the needle holder rather than being held with your hands. Needle with thread: The choice of the needle size and thread type depend on the reason for performing a suture and the nature of the wound. The needle with thread used in the following steps is 2-0 silk."
    },
    {
      "title": "Hold the tools correctly:",
      "content": "Hold the tools correctly: For right-handed people, hold the needle holder with your right ring finger and thumb. For more control and stability, place your index and middle fingers on the long side of the needle holder. [2] X Research source Left-handed people can follow the same steps (including those below) but should replace the tools used with the left hand with those used by the right hand, and vice versa. The tissue forceps are to be held by the left hand with the thumb and index fingers, just like holding a pen."
    },
    {
      "title": "With the needle holder, take out the needle from its package.",
      "content": "With the needle holder, take out the needle from its package. Make sure to pull all the thread out."
    },
    {
      "title": "Hold the needle by its flat side using the needle holder.",
      "content": "Hold the needle by its flat side using the needle holder. Hold it approximately 2/3 of the way up from the needle's tip, which should be pointing upwards. [3] X Research source Press down with your thumb and ring finger until you hear a click from the needle holder."
    },
    {
      "title": "Using the tissue forceps, expose the skin towards the end of the right side of the wound.",
      "content": "Using the tissue forceps, expose the skin towards the end of the right side of the wound. This allows for better visualization and avoids hitting muscle. This step should always be done before puncturing the skin, which is introduced in the next step. Remember to always avoid pushing down on the skin with the tissue forceps."
    },
    {
      "title": "Puncture the right side of the skin (take a bite).",
      "content": "Puncture the right side of the skin (take a bite). Aim for about half a cm down from the end of the wound with a 90 degrees angle between the skin and the needle, twisting your hand clockwise for about half a circle. [4] X Research source The needle goes through the skin from outside to inside. Also, make sure that you the needle exits on the inner side of the skin; it should go down to a depth of about 0.5cm. To release the needle holder's \"click\" to pull the needle out, pull the needle holder with your ring finger to the right and push with your thumb to the left."
    },
    {
      "title": "Parallel to the first bite, puncture the left side of the skin the same way as you did in the last step.",
      "content": "Parallel to the first bite, puncture the left side of the skin the same way as you did in the last step. However, in this step, the needle goes from inside to outside."
    },
    {
      "title": "Hold the needle with the needle holder (without the need to hear a click) and pull so that all the thread, except for about 3–5 centimeter (1–2 in), is on the left side of the wound.",
      "content": "Hold the needle with the needle holder (without the need to hear a click) and pull so that all the thread, except for about 3–5 centimeter (1–2 in), is on the left side of the wound."
    },
    {
      "title": "After releasing the needle from the needle holder, use your left hand to hold the thread near the wound and wrap it approximately a cm or two from the tip around the closed needle holder.",
      "content": "After releasing the needle from the needle holder, use your left hand to hold the thread near the wound and wrap it approximately a cm or two from the tip around the closed needle holder. [5] X Research source Make sure to wrap the thread three times outward (clockwise) while keeping the thread in close proximity to the wound. Note: The direction in which you wrap the thread does not matter as long as it alternates between consecutive steps."
    },
    {
      "title": "Slightly open the needle holder with the thread wrapped around it, grab the 3–5 centimeter (1.2–2.0 in) of thread on the right side with the needle holder.",
      "content": "Slightly open the needle holder with the thread wrapped around it, grab the 3–5 centimeter (1.2–2.0 in) of thread on the right side with the needle holder."
    },
    {
      "title": "Using your left hand, pull the long thread to allow the wrapped thread to pass out of the needle holder and get tied around the loose 3–5 centimeter (1.2–2.0 in) of thread on the right.",
      "content": "Using your left hand, pull the long thread to allow the wrapped thread to pass out of the needle holder and get tied around the loose 3–5 centimeter (1.2–2.0 in) of thread on the right. Be careful to NOT pull too much on the skin, causing one side to be pushed on top of the other. Only pull as much as you need in order to bring together and seal the two sides of the wound."
    },
    {
      "title": "Next, do steps 5 to 7 again with a couple of alterations:",
      "content": "Next, do steps 5 to 7 again with a couple of alterations: Note: these three steps (5 to 7) will be done a total of 3 times, with a small difference in them each time. First, do steps 5 to 7, wrapping the thread inwards (counterclockwise) twice around the needle holder. Then, do steps 5 to 7 a third time, wrapping the thread only once outwards (clockwise) on the needle holder."
    },
    {
      "title": "This suture consists of multiple instrumental ties performed again and again along the stretch of the wound.",
      "content": "This suture consists of multiple instrumental ties performed again and again along the stretch of the wound. Simply perform an instrumental tie, cut the excess thread, move down the wound on the right side approximately one cm from the first suture, and start another instrumental tie. Do this until the whole wound is sealed."
    },
    {
      "title": "Again, start with the instrumental tie at the beginning of the wound in order to fix the thread in place but do not cut the excess thread.",
      "content": "Again, start with the instrumental tie at the beginning of the wound in order to fix the thread in place but do not cut the excess thread."
    },
    {
      "title": "Continue to puncture the right and left sides of the wound, respectively, bringing them together.",
      "content": "Continue to puncture the right and left sides of the wound, respectively, bringing them together. MAKE SURE that every loop you make is on the upper side of the suture pad (away from you). This is going to be one long suture running along the entire wound with an instrumental tie at the beginning and end of the suture. [6] X Research source This suture is as if you are continuing to make whirls in a clockwise direction. Use the last loop of the running suture to perform an instrumental tie since there is no loose end to grab with the needle holder."
    },
    {
      "title": "This is what the end result should look like, more or less.",
      "content": "This is what the end result should look like, more or less."
    },
    {
      "title": "Like before, start this altered version of the simple running suture with an instrumental tie at the beginning of the wound and then puncture the skin about a cm from the instrumental tie on the right and left side of the wound, respectively.",
      "content": "Like before, start this altered version of the simple running suture with an instrumental tie at the beginning of the wound and then puncture the skin about a cm from the instrumental tie on the right and left side of the wound, respectively."
    },
    {
      "title": "Before pulling the thread completely to seal the wound, it's very important to MAKE SURE that the loop is on the lower side of the suture pad (towards you).",
      "content": "Before pulling the thread completely to seal the wound, it's very important to MAKE SURE that the loop is on the lower side of the suture pad (towards you)."
    },
    {
      "title": "Continue performing steps 1 and 2 multiple times along the extent of the wound and end the suture with an instrumental tie to prevent any loosening up to take place.",
      "content": "Continue performing steps 1 and 2 multiple times along the extent of the wound and end the suture with an instrumental tie to prevent any loosening up to take place. Note: You will notice that a line will form on the left side of the suture, which provides extra firming, allowing the suture to remain in place."
    },
    {
      "title": "This is what the end result should look like, more or less.",
      "content": "This is what the end result should look like, more or less."
    },
    {
      "title": "Start with a puncture of the skin on the right side of the wound, but make sure to do so approximately double the distance that you used for the previous sutures, so approximately 2 centimeter (0.79 in) out from the wound site.",
      "content": "Start with a puncture of the skin on the right side of the wound, but make sure to do so approximately double the distance that you used for the previous sutures, so approximately 2 centimeter (0.79 in) out from the wound site. [7] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source"
    },
    {
      "title": "Travel under the skin to the left side of the wound and bring out the needle at the same distance, so approximately 2 centimeter (0.79 in) out from the wound site.",
      "content": "Travel under the skin to the left side of the wound and bring out the needle at the same distance, so approximately 2 centimeter (0.79 in) out from the wound site."
    },
    {
      "title": "Turn the needle around 180 degrees with the help of the tissue forceps and hold it with the needle holder.",
      "content": "Turn the needle around 180 degrees with the help of the tissue forceps and hold it with the needle holder. This will make the next step easier. DO NOT use your hands to adjust and turn the needle around."
    },
    {
      "title": "The next puncture site inwards will be on the same side of the wound (left) and halfway between the puncture site made in step 2 and the wound.",
      "content": "The next puncture site inwards will be on the same side of the wound (left) and halfway between the puncture site made in step 2 and the wound."
    },
    {
      "title": "Finally, take a bite outwards on the right side of the wound, halfway between the initial puncture site and the wound.",
      "content": "Finally, take a bite outwards on the right side of the wound, halfway between the initial puncture site and the wound. The 4 puncture sites are represented by the 4 red dots."
    },
    {
      "title": "Of course, you will need to pull the thread out, bring the two sides of the skin together, and finish with an instrumental tie to secure the suture.",
      "content": "Of course, you will need to pull the thread out, bring the two sides of the skin together, and finish with an instrumental tie to secure the suture. If you place your suture pad with the wounds lined horizontally, then you will see that the puncture sites line up vertically, hence this suture's name. In addition, a bigger needle is usually used to perform this type of suture."
    },
    {
      "title": "Start at the beginning of the wound and take a bite inwards approximately 1 centimeter (0.39 in) from the wound site.",
      "content": "Start at the beginning of the wound and take a bite inwards approximately 1 centimeter (0.39 in) from the wound site. [8] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Leave approximately a 3 centimeter (1.2 in) of the thread loose."
    },
    {
      "title": "Next, take an outward bite parallel to the previous one, but on the opposite side of the wound.",
      "content": "Next, take an outward bite parallel to the previous one, but on the opposite side of the wound."
    },
    {
      "title": "Moving alongside the same side of the wound (left), take an inwards bite about 2 centimeter (0.8 in) from the previous bite.",
      "content": "Moving alongside the same side of the wound (left), take an inwards bite about 2 centimeter (0.8 in) from the previous bite. A \"line\" will form between the second and third bites. [9] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source"
    },
    {
      "title": "The last bite for this suture is across from the third suture, taken outwards about 2 centimeter (0.8 in) from the first bite.",
      "content": "The last bite for this suture is across from the third suture, taken outwards about 2 centimeter (0.8 in) from the first bite. The puncture sites are represented by the 4 red dots."
    },
    {
      "title": "To end this suture, perform an instrumental tie and cut excess thread.",
      "content": "To end this suture, perform an instrumental tie and cut excess thread. With the suture pad placed horizontally in front of you, it will seem that you are moving horizontally along the wound, hence this suture's name."
    }
  ]
}