{
  "url": "https://www.wikihow.com/Why-Does-My-Breaker-Keep-Tripping-with-Nothing-Plugged-in",
  "title": "Reasons Your Circuit Breaker Keeps Tripping (Plus, What to Do)",
  "steps": [
    {
      "title": "Overloaded circuits",
      "content": "Overloaded circuits In the United States, standard household circuits are rated 15 or 20 amps. [1] X Research source So, when the electrical demand exceeds this amount, it causes the breaker to overheat. Tripping is a protective measure against a potential fire risk. When this happens, redistribute your appliances onto different circuits or upgrade your home's system. For a 20-amp circuit, you can put a maximum of 16 outlets on it. Meanwhile, a 15-amp circuit can handle 12 outlets. [2] X Research source Unplug unused electronics or avoid using two demanding appliances at once if you don't know how to wire a circuit breaker to redistribute appliances or add new circuits. If your circuit breaker frequently trips, this may be a sign that it's time to replace your breaker. Cost: $200 to $600 to replace a main breaker or $150 to $1,000 for rewiring. [3] X Research source"
    },
    {
      "title": "Short circuits",
      "content": "Short circuits Short circuits happen when a hot or live wire contacts another hot wire within the same circuit. You may notice a sparking or popping noise as you plug in a device. Inspect your outlets for burning, cracking, or broken insulation. Similarly, check the appliance's wire to ensure there are no cracked or frayed wires since this can cause a circuit to be short, too. [4] X Research source If you're an experienced electrician, locate the short circuit within the wiring system and make a new wire to replace the damaged one. Remove insulation from the ends of the new wire and solder them in place. [5] X Research source If you're unfamiliar with wiring, it's best to call an electrician for assistance as soon as possible to avoid an electrical fire! Cost: Fixing a short circuit can cost $75 to $200. [6] X Research source"
    },
    {
      "title": "Ground fault surges",
      "content": "Ground fault surges An issue with the Ground Fault Circuit Interrupter (GFCI) is similar to a short circuit; the only difference is a live wire touching a copper round wire or metal outlet box. This creates an excess flow of electricity, which can overpower the circuit breaker, causing it to trip. Look for signs of discoloration around the outlet. [7] X Research source GFCIs are often installed in wet environments, like bathrooms or kitchens. Any lingering water can create a new path for electricity to flow. Be sure the outlet is dry before inspecting it. Unplug all the appliances from the circuit and press the reset button on the GFCI. Plug in your electronics one by one to determine the cause of the trip. If it continues to trip, call an electrician. [8] X Research source Cost: A replacement can cost between $100 to $400. [9] X Research source"
    },
    {
      "title": "Power surges",
      "content": "Power surges Power surges are caused by short circuits, ground faults, or power overloads. It’s when an abnormally high voltage lasts for a brief period. Circuit breakers are designed to flip to protect against an electrical fire. However, it’s still inconvenient when you’re constantly losing power. This can be resolved by disconnecting excess electronics—even if they’re not in use—and finding an alternative power source. [10] X Research source Cost: If your home lacks power surge protection, a whole house installation can cost between $70 to $700. [11] X Research source"
    },
    {
      "title": "Environmental conditions",
      "content": "Environmental conditions Intense storms or lightning strikes in your area can create a power surge that overloads and trips circuit breakers. Limit electronic usage during inclement weather to avoid sparks or electrical fires. [12] X Research source"
    },
    {
      "title": "Something is plugged in",
      "content": "Something is plugged in Now, we know you said nothing is plugged in even though your breaker keeps tripping, but it doesn't hurt to check. Do another round throughout your house and ensure nothing is plugged inside and outside. You may have forgotten a device in the garage or backyard. If you find something, unplug it and test the breaker again. You can also use an electronic circuit breaker finder to map out which outlets are connected to which breakers. [13] X Research source"
    },
    {
      "title": "Locate the circuit breaker in the garage.",
      "content": "Locate the circuit breaker in the garage. Before heading to the garage or utility closet, turn off any light switches and unplug appliances in the room that have lost power to avoid an electrical shock or fire. Then, find your electrical panel. It's typically a grey metal box attached to the wall. [14] X Research source"
    },
    {
      "title": "Look for the tripped breaker stuck in the middle or \"OFF\" position.",
      "content": "Look for the tripped breaker stuck in the middle or \"OFF\" position. Go through each circuit breaker. They're small, horizontal switches that may have labels for each specific room it controls. For instance, if you lose power in the kitchen, look for the breaker that reads, \"KITCHEN.\" A tripped circuit breaker will be in the \"OFF\" or middle position between \"ON\" and \"OFF.\" [15] X Research source"
    },
    {
      "title": "Turn the breaker fully off before flipping it back on.",
      "content": "Turn the breaker fully off before flipping it back on. To reset a circuit breaker, if the switch is in the middle position, flip it to the \"OFF\" position. Then, flip it back to the \"ON\" position to restore power. You should hear or see power resume in the affected room. Plug each appliance individually to see if the circuit breaker trips again. [16] X Research source If the circuit breaker continues to flip and you can't identify which appliance is causing it, call a licensed electrical contractor to find the source of the problem."
    },
    {
      "title": "Continuously resetting a breaker can cause a fire.",
      "content": "Continuously resetting a breaker can cause a fire. When you live in a place long enough, it's only a matter of time before you trip a breaker, and that's okay! However, repeatedly resetting the same breaker over a short time may result in an arc flash or fire. If you notice the same breaker is giving you trouble, leave it in its tripped state and contact a professional as soon as possible. [17] X Research source"
    }
  ]
}