{
  "url": "https://www.wikihow.com/Start-a-Fraternity",
  "title": "How to Start a Fraternity",
  "steps": [
    {
      "title": "Determine what kind of purpose your fraternity should stand for.",
      "content": "Determine what kind of purpose your fraternity should stand for. Most fraternities have a code of conduct or beliefs that informs their existence. What do you believe in? Why are you creating this organization? What are your core beliefs? These are important questions to answer if you want to be able to you're your fraternity to fellow students and the administration. Loyalty, leadership, service, and rigorous academic standards are all ways to appeal to your school’s administration. [1] X Research source Sports often work as a big draw too."
    },
    {
      "title": "Decide if you want to start your own fraternity or just a chapter.",
      "content": "Decide if you want to start your own fraternity or just a chapter. There are many national fraternities that may not already exist at your school. If you want to start a chapter for a certain fraternity you can visit the national fraternity's website and follow the process that they list there. There are many different fraternities but the processes are relatively similar. They will help you raise funds and find appropriate members for the fraternity. [2] X Research source You can also stay independent. There are not many independent fraternities because they lack funding that national fraternities have. Alumni networks are key to maintaining a fraternity. However, there are benefits to staying independent. First, you get to decide all your rules, symbols, rituals, etc for yourself. Second, you don't have to deal with all the paperwork of filing for colonization with the national organization. If you just want to have a group of close friends who do things together while you are in college, and are not so worried about \"building\" something that you will graduate before you can enjoy it, this is the better option."
    },
    {
      "title": "Figure out what kind of people might be interested in your fraternity.",
      "content": "Figure out what kind of people might be interested in your fraternity. If you are starting an entirely new fraternity you’ll have to figure out what exactly is appealing about your fraternity. An independent fraternity might make its mark by being more spontaneous and avoiding many of the tropes that national fraternities fall into. Try to add your own flair to your fraternity. [3] X Research source You might want a fraternity that is associated with athletics, or theater, or a different activity. Try to pick something that you are interested in and will also interest a lot of other people. For example, you could try to start a fraternity that is very interested in community service or one that wants to be known for holding a lot of fun social events. For example, many fraternities have their own songs. However, one popular fraternity in Nevada called Omega Xi made a name for itself by choosing ‘Row, Row, Row Your Boat’ as their song."
    },
    {
      "title": "Start generating interest.",
      "content": "Start generating interest. Spread interest through word of mouth and by posting on social media. Put flyers up all over campus and advertise relentlessly. When you go to the administration asking for them to recognize your fraternity you’ll need a large number of people who are already interested in joining the fraternity. Your administration will probably try to dissuade you from starting a fraternity because it doesn’t look good for them to support failed projects. This may be a reason to remain \"unofficial\" or \"underground.\""
    },
    {
      "title": "Commit to being hazing-free.",
      "content": "Commit to being hazing-free. Hazing only leads to resentment between younger and older members of the fraternity, and civil and criminal liability. Hazing activities include but are not limited to: sleep deprivation, corporal punishment or assault, physical bondage or confinement, demeaning language or forcing someone to engage in demeaning behavior, forcing someone to wear humiliating clothing or clothing inappropriate to weather conditions, forced exercise, forcing someone to eat or drink anything, and requiring a person to perform acts of personal service. One way to avoid hazing is to avoid the idea of a \"pledgeship\" altogether. Screen potential members carefully before offering membership, and make them full-fledged members immediately. At maximum, have a “new member training period.” If you want to have new member training events every day, make the period no longer than two weeks. If you expect new members to meet weekly for training, no more than two months. Membership training should be only about teaching them the history, rituals, and ideals of your organization."
    },
    {
      "title": "Decide on a name for your fraternity.",
      "content": "Decide on a name for your fraternity. Because fraternities are a part of the Greek system you should pick between two or three letters of the Greek Alphabet. These letters should represent the Greek words for values you want your fraternity to embody. Make sure you choose a name that isn't already taken. A quick internet search should let you know if the name is taken or not. Also consider avoiding choosing a Greek-letter name altogether. Consider the Harvard clubs like Fly and Porcellian, Yale organizations like Skull and Bones, Princeton eating clubs like The Ivy Club, that all function as traditional fraternities, without being Greek-letter organizations. Avoiding choosing a Greek-letter name may also help you avoid the stigma of Greek-letter fraternities that now exists with many college administrations. Not being Greek-letter may also allow you to avoid being regulated by the specific rules established by colleges' Offices of Greek Life. You also could design and select your regalia, symbols, and mascots."
    },
    {
      "title": "Pick a mantra.",
      "content": "Pick a mantra. Most fraternities have a good Latin phrase that fits their belief system. Your slogan doesn’t need to be in Latin, but that is the standard."
    },
    {
      "title": "Determine your organizational structure.",
      "content": "Determine your organizational structure. All fraternities have a hierarchy. For example there will be a President, a Vice President, a treasurer, and so on. Decide on how you would like for the fraternity to be organized. Some schools may have specific requirements for student organizations, so it would be a good idea to check with your Greek life coordinator or the director of Student Life. [4] X Research source"
    },
    {
      "title": "Create your Constitution and write your fraternity's policies.",
      "content": "Create your Constitution and write your fraternity's policies. These should cover topics like academic performance, personal conduct, and public relations. Make sure you make a section that allows your brothers to sign the document. This way people are bound by the policies and you can remove someone from the fraternity if they are causing issues. Make sure that you include all of your members on the editing and fine-tuning of your Constitution. This is vital to creating a good organization."
    },
    {
      "title": "Consider if you want a central location.",
      "content": "Consider if you want a central location. Many fraternities are known for their houses. These houses act as gathering places for the fraternity brothers as well as a great location for parties and other social events. A house or other central location is vital to the long-term well being of a fraternity. Without a fraternity house it is hard to tell the difference between your fraternity and a club."
    },
    {
      "title": "Understand the requirements.",
      "content": "Understand the requirements. Get in touch with your campus Greek Life office. [5] X Research source Once you have an idea for a fraternity and a decent pitch, you should go to the Greek Life office at your school and tell them your plans for starting a fraternity. Ask what they would like you to accomplish before they would be willing to recognize your fraternity. They might be resistant at first, so you’ll have to come in with a very concrete pitch and plan. Don’t wing it. Be very prepared. Come with details about name, values, and organization as well as a list of all the people you have gathered who are interested in it. The administration will be much more open to your idea if it is clear that you are on top of it. Of course, if you avoid branding yourself as a Greek-letter fraternity by adopting a non-Greek-letter name, you may be able to avoid these requirements entirely."
    },
    {
      "title": "Develop a strong pitch.",
      "content": "Develop a strong pitch. Present your fraternity with confidence. Show everyone what hole in the campus culture you fill. Prove to them that you will be a positive influence. Don't try to develop a fraternity that is just like every other fraternity - that will make you redundant. However, you also shouldn't be so far out in left field that no one would want to join your group. Your pitch should include all the aspects that you have organized so far including structure, constitution, name, mantra, regalia, and location. However, you also need to explain to them how your fraternity will survive moving forward and how they will fit into the daily life of the campus. What do you bring that no one else brings? Why will you succeed? Draft a plan that starts by addressing the basics and then moves on to the details. For example, maybe you are selling a fraternity that is based on political activism. You need to explain not only the idea behind your fraternity but also how you will organize events centered on political activism and how this fits into the college's mission."
    },
    {
      "title": "Affiliate with a national fraternity.",
      "content": "Affiliate with a national fraternity. [6] X Research source If you want to affiliate with a national university you’ll have to get in touch with that fraternity and tell them you are interested in opening a chapter at your school. Let them know that you have established an interest group and ask them what the next steps will be. They can help guide you through the process. [7] X Research source This is not necessary if you want to start a brand new independent fraternity."
    },
    {
      "title": "Convince your university to recognize your fraternity.",
      "content": "Convince your university to recognize your fraternity. Once you have taken the steps that your Greek Life office has asked you to take, you can ask for recognition. This will allow you to throw campus events, advertise on campus, and be involved in school-sponsored events. Being recognized by the university is necessary if you want to add legitimacy to your fraternity. Remember, the better prepared you are and the more details you can show your administration the more likely they are to approve your fraternity."
    },
    {
      "title": "Develop a program to RUSH prospective new members.",
      "content": "Develop a program to RUSH prospective new members. [8] X Research source You shouldn’t admit just anyone to your fraternity going forward. It’s important to have criteria that is written and defined. Don’t just pick people because they seem cool. Have a defined set of criteria like GPA, community service, and any other qualities you want in your members. You should never discriminate based on race, religion, sexual orientation, or anything else."
    },
    {
      "title": "Create a pledge process.",
      "content": "Create a pledge process. Pledge processes often have a bad reputation for hazing. That’s not necessary. A good pledge process should be one that determines whether or not the prospective new members are a good fit for your Fraternity. Use this process to educate them about your group's values. A good pledge process should allow the members of your fraternity to get to know your pledges and vice versa. This way both of you will be able to judge if the pairing is a good fit. You should hold a lot of events with pledges that fit the values of your fraternity so that the pledges can see what life would be like inside the fraternity. For example, if your fraternity is based on political activism, maybe you could ask your pledges to organize and execute a protest or event bringing awareness to a certain issue your fraternity finds important."
    },
    {
      "title": "Allow your pledges to join the fraternity.",
      "content": "Allow your pledges to join the fraternity. Initiate those pledges with customized rituals that embody your Fraternity's values. Initiation rituals are great ways to build friendship and add legitimacy to your fraternity."
    },
    {
      "title": "Set up an alumni event.",
      "content": "Set up an alumni event. If you are starting a new fraternity you will probably be struggling for money, especially since you will only have young alumni for a long period of time. Developing an annual alumni event is a great way to keep in touch with your alumni. Hopefully you can convince them to make some donations! [9] X Research source Events like pig roasts or sports games are great examples of alumni events."
    }
  ]
}