{
  "url": "https://www.wikihow.com/Yurr-Meaning",
  "title": "What Does Yurr Mean in NYC, on Social Media, & Over Text",
  "steps": [
    {
      "title": "“Yurr” means “Yes.”",
      "content": "“Yurr” means “Yes.” “Yurr” or “Yerr” is a slang term that means you agree with something that someone said. It’s an informal way of expressing affirmation or assent, so you use it similarly to phrases like “Yeah” or “Yep.” “Yurr, of course. I’ll water your plants when you’re gone.” “Yurr, I’d love to join you! I’m always hungry for pizza.”"
    },
    {
      "title": "“Yurr” is New York slang for “What’s up” or “Hey!”",
      "content": "“Yurr” is New York slang for “What’s up” or “Hey!” In New York City, you say, “Yurr” or “Yerr” as a casual and friendly way to greet someone or a group of people. It means the same thing as saying, “How are you,” “What’s good,” or “Yo!” [1] X Research source “Yurr! It’s good to see you, bro!” “Yurrrrrr! What’s going on with you?” While “Yurr” and “Yerr” originate from New York, these slang terms have gained popularity online. So, you might hear people outside of New York say “Yurr,” too!"
    },
    {
      "title": "“Yurr” is also a way to get someone’s attention.",
      "content": "“Yurr” is also a way to get someone’s attention. New Yorkers commonly say “Yurr” as an exclamation to attract someone’s attention. It’s similar to shouting, “Hey,” “Yo,” “Oi,” or “Yoo-hoo” when you want to call out to someone and turn their focus to you. “Yurr! You dropped your bag. Here you go.” “Yurr! I’m over here, come sit by me!”"
    },
    {
      "title": "“Yurr” can express excitement.",
      "content": "“Yurr” can express excitement. This New York slang term can also be a way to convey enthusiasm and joy. You use it similarly to other exclamations of excitement like “Yay” and “Yes!” [2] X Research source “Yurr! I passed my math test!” “They had my favorite ice cream flavor at the store! Yurrrrrrr!”"
    },
    {
      "title": "“Yurr” might also mean “you” or “your.”",
      "content": "“Yurr” might also mean “you” or “your.” In the United Kingdom, “yer” is an informal way to say “you” or “your.” [3] X Research source So, you might say or write “yurr” to mean “you” or “your,” too. “It’s dinner time! Come and get yurr plate.” “Follow me! Let me show yurr to the room.”"
    },
    {
      "title": "“Yurr” can mean “Yes,” “What’s up,” or “you” on social media.",
      "content": "“Yurr” can mean “Yes,” “What’s up,” or “you” on social media. “Yurr” has the same meanings on TikTok, Instagram, and Snapchat as it does when you hear it in person. It can mean someone is agreeing with you, greeting you, getting your attention, expressing their excitement, or saying “you” or “your.” Pay attention to the context and tone of your conversation to help determine what “Yurr” means online."
    },
    {
      "title": "“Yurr” also means “Yep,” “Hey,” or “you” in texts.",
      "content": "“Yurr” also means “Yep,” “Hey,” or “you” in texts. Receiving a “Yurr” text from a friend also means the same things as when someone says it to you in person. It might mean your friend is saying hi, agreeing with you, trying to get your attention, shouting for joy, or typing “you” or “your.” Like determining what “Yurr” means on social media, consider the conversation you’re having with your friend to figure out what it means."
    },
    {
      "title": "In memes, “Yurr” refers to New York slang.",
      "content": "In memes, “Yurr” refers to New York slang. “Yurr” and “Yerr” sometimes appear in memes and viral TikTok videos. In these memes, it’s usually referencing New York City slang and used as a greeting, a way to get someone’s attention, or a shout of excitement. [4] X Research source"
    },
    {
      "title": "Say “Yurr” back as a greeting.",
      "content": "Say “Yurr” back as a greeting. When someone greets you with a “Yurr,” the New York way is to say “Yurr” back even louder! This is a fun way to say hi to your friends and joke around with them at the same time. Your friend : “Yurr! What’s good?” You : “YURRRRRR!”"
    },
    {
      "title": "Ask someone what they need if they are getting your attention.",
      "content": "Ask someone what they need if they are getting your attention. When a friend or family member says, “Yurr” to get your attention, acknowledge them to see what they want. Then, help them out with what they need—they’re sure to appreciate it! Your friend : “Yurr! Come over here!” You : “Sure! What’s up?”"
    },
    {
      "title": "Share in someone’s excitement when they say, “Yurr!”",
      "content": "Share in someone’s excitement when they say, “Yurr!” If your friend is shouting “Yurr” out of happiness or joy, join in on their celebration! Congratulate them on their achievement or simply cheer, “Yurr” back. Your friend : “Yurrrrr! I got the job!” You : “Woohoo! I’m so excited for you!”"
    }
  ]
}