{
  "url": "https://www.wikihow.com/Why-Can%27t-I-Do-Anything-Right",
  "title": "What to Do When You Feel Like You Can’t Do Anything Right",
  "steps": [
    {
      "title": "Stress and feelings of being overwhelmed",
      "content": "Stress and feelings of being overwhelmed When you have a lot going on and start to feel overwhelmed, it can be easy to slip into thinking negative things like, “I can’t do anything right.” Such negative thoughts are especially likely to pop up if you put a lot of pressure on yourself to pull off everything perfectly with zero mistakes. [1] X Research source Stressful life events, such as the death of a loved one, financial troubles, or relationship issues may also cause an increase in negative thoughts and feelings directed toward yourself."
    },
    {
      "title": "Low self-esteem",
      "content": "Low self-esteem When you’re dealing with low self-esteem, it may seem really hard to feel confident in who you are as a person and your abilities. You may be overly critical toward yourself and tell yourself things like “I can’t do anything right” or only focus on your perceived “flaws” instead of your many positive qualities. Other signs of low self-esteem include: [2] X Research source Making self-deprecating jokes Blaming yourself when things go wrong Telling yourself that you don’t deserve nice things or to have fun Constantly telling yourself that others are better than you Avoiding challenges due to fear of failure Not accepting compliments"
    },
    {
      "title": "Highly critical individuals",
      "content": "Highly critical individuals If the people around you are constantly telling you that you can’t do anything right, it can influence you to adopt a similar way of thinking. Sadly, this might have been something that’s been going on for a long time. During your childhood, if you had parents, teachers, or other adults who were overly critical of your actions and/or placed the blame on you when things went wrong, it could be a reason why you’re being hard on yourself now. [3] X Research source Your current relationships may also be influencing how you think about yourself. For example, a friend or partner who often points out your mistakes and “failures” can definitely cause you to take on a more negative perception of yourself."
    },
    {
      "title": "Frequent comparison to others",
      "content": "Frequent comparison to others When you compare yourself to others, it can be easy to tell yourself that they’re doing so much better than you. It’s human nature for people to compare themselves to others, but that doesn’t mean such behavior doesn’t come with negative consequences. If you find yourself fixating on the successes of others, it can be easy to tell yourself that you’re falling behind and not doing things right. [4] X Research source This is especially true if you’re someone who spends a lot of time on social media. It’s not unusual for people to only post the highlights of their life, which can cause you to be harder on yourself for not being able to achieve such an impossible standard."
    },
    {
      "title": "Unrealistic expectations",
      "content": "Unrealistic expectations Setting unrealistic goals or holding yourself to very high standards might cause you to be overly harsh toward yourself when you aren’t able to meet them. It’s natural to want to achieve your goals and succeed at the challenges you set for yourself, but if they’re too unrealistic, it can, unfortunately, be easy to fall into a downward spiral of negative thoughts. [5] X Research source For example, telling yourself that everyone needs to like you may be an unrealistic expectation since, in reality, not everyone is destined to get along perfectly. Or, telling yourself that you should be the best at something and pull off everything flawlessly from the very beginning is also an unrealistic expectation."
    },
    {
      "title": "Fixation on past mistakes",
      "content": "Fixation on past mistakes We all make mistakes. It’s a part of human nature that simply can’t be avoided. But the way you choose to deal with these mistakes helps to shape your way of thinking and your perception of yourself. If you ruminate on the past and constantly berate yourself for the mistakes you made, you can end up developing a very negative self-image and become overly critical of yourself. [6] X Research source For example, constantly thinking about a mistake you made at work can cause you to think that you’re not good at anything and make you fearful of taking risks in the future."
    },
    {
      "title": "Past trauma",
      "content": "Past trauma Unfortunately, the root of your negative thinking and feelings of insecurity may lie in traumatic events that happened in the past. Childhood physical and emotional abuse as well as neglect can cause a person to feel extremely insecure well into their adult lives. For example, a caregiver who withholds affection unless their expectations are met can cause a child to develop low self-esteem and self-worth. [7] X Research source Traumatic life events, such as the death of a loved one, can also cause these negative thoughts and feelings."
    },
    {
      "title": "Depression",
      "content": "Depression Such feelings of helplessness and low self-esteem are some of the common symptoms of depression. If you think you may be dealing with depression, talk to a mental health professional as soon as possible to receive an official diagnosis and professional care. Other symptoms of depression include: [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Feelings of sadness or emptiness Irritability and frustration over small issues Loss of interest in things you once enjoyed doing Sleep disturbances such as insomnia or sleeping too much Anxiety or restlessness Trouble concentrating and focussing on tasks"
    },
    {
      "title": "Challenge your negative thinking.",
      "content": "Challenge your negative thinking. When you find yourself saying things like, “I can’t do anything right” or “This is all my fault,” stop for a moment and think about how valid these thoughts actually are. What caused you to think this way? Is there evidence to back up this thought? By challenging your negative thoughts and making an effort to consciously acknowledge them, you may be able to change them into positive thoughts and be less critical of yourself when it’s not warranted. [9] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source One idea is to ask yourself how a close friend or family member might react to your negative thought. Would they tell you you’re right? Or would they try to get you to see the positive and dismiss such a critical view of yourself? [10] X Research source Another idea is to keep a journal and write down your negative thoughts there. Use this to look at your thoughts from a different perspective and begin to find patterns in your ways of thinking."
    },
    {
      "title": "Practice positive self-talk.",
      "content": "Practice positive self-talk. Combat these negative thoughts by using positive affirmations to boost your confidence and self-esteem. One way to help you do this is to think about how you would talk to other people who are feeling badly about themselves. Make it a goal to tell yourself at least one positive thing each day. For example, say things like: [11] X Research source “I’m a good person.” “I have a lot to offer the world.” “I’m loved by many.” Another idea is to write down the positive things that other people say about you. When you’re feeling down, reading through such kind words can help to raise your spirits and instill confidence in you."
    },
    {
      "title": "Remind yourself of the things you’ve done right.",
      "content": "Remind yourself of the things you’ve done right. It just doesn’t seem possible that there isn’t a single thing you’ve done right or succeeded at in your life. No matter how small of a success it might have been, take some time to explore your memories and acknowledge the positive ones. Even though they may have seemed insignificant at the time, remembering such things can help you see just how capable of a person you truly are. [12] X Research source For example, go through your old school projects or homework and look for ones you did really well on. Or, go through your performance review at work and take note of the compliments your supervisor gave you for areas you were excelling in. Another idea is to think of the times when you helped others and made the people around you feel happy."
    },
    {
      "title": "Reframe failure as a learning opportunity.",
      "content": "Reframe failure as a learning opportunity. Everybody makes mistakes, that’s just a fact of life. But learning from these mistakes is how you can continue to grow into the best version of yourself. Rather than telling yourself that your mistakes are a sign of weakness and failure, reflect on them and identify what you can learn from them that’ll help you succeed in the future. [13] X Research source For example, if you made a mistake at work, acknowledge it, take responsibility, then go over what happened so that you know what you can improve upon next time. Also be sure to point out the things you did well. Even when you make a mistake, there are still likely things that you did correctly that can help you next time."
    },
    {
      "title": "Identify your strengths.",
      "content": "Identify your strengths. Stop for a moment and think about what unique skills and talents you possess. While you may feel like you can’t do anything right, it’s almost certain that there’s at least one thing that you can do well. Even if it’s something small, identifying your strengths can go a long way in making you feel more confident about yourself and your abilities. Some things you might excel at include:: [14] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Singing Drawing Cooking Solving puzzles Listening to others Giving advice Taking care of a pet Managing your time Cleaning"
    },
    {
      "title": "Build a positive support system.",
      "content": "Build a positive support system. If there are people in your life who are very negative and tend to bring you down, make an effort to cut them out of your life and instead surround yourself with positive, encouraging people. Find people who truly appreciate you and give you genuine encouragement when you most need it. For example, spend time with close friends and family members who you know will give you unconditional love and support. [15] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Another idea is to join a club or organization for one of your hobbies to meet people with similar interests so that you can cheer each other on and support one another."
    },
    {
      "title": "Avoid comparing yourself to others.",
      "content": "Avoid comparing yourself to others. While it may sound easier said than done, refraining from comparing yourself to others can help a lot in raising your self-esteem and allow you to fixate on your own strengths and success. The only person you should be comparing yourself to is you. For example, compare your past and present self to see just how much progress you’ve made. You’ll likely be amazed at just how far you’ve come in a short amount of time. [16] X Research source Take a break from social media . Even if it’s just for a few days, taking that time to focus on yourself may give you the boost of confidence you need."
    },
    {
      "title": "Do something nice for someone else.",
      "content": "Do something nice for someone else. There’s nothing more rewarding than helping someone and showing them kindness. If you’re feeling down about yourself, helping others can fill you with a sense of satisfaction and like you’re making a contribution. For example, doing a random act of kindness for someone can add positivity to both your day and theirs as well. Expressing gratitude toward others is a great random act of kindness that can bring a lot of light to someone’s day. Tell them thank you and let them know what you appreciate about them. Other things you can do to help others include listening to and comforting people when they’re having a hard time, sending a gift or letter of appreciation to a loved one, or helping with chores or work around the house."
    },
    {
      "title": "Practice gratitude every day.",
      "content": "Practice gratitude every day. One thing that can help change your negative thoughts into more positive ones is to focus on the good things happening in your life right now. Take time each day to remind yourself of the things and people you’re grateful for. Practicing gratitude also helps you focus on the present rather than ruminate on your past “mistakes” and “failures.” One idea is to start a gratitude journal and write down 3-5 things you’re grateful for each day."
    },
    {
      "title": "Take care of yourself physically.",
      "content": "Take care of yourself physically. Your physical health is just as important as your mental and emotional health. While getting enough sleep and eating healthy may not be at the top of your list of priorities, making sure that you’re taking care of yourself can help you focus and reflect on your thoughts with a clearer mind. Some things to do include: [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Making sure you’re getting at least 7 hours of sleep each night Eating a balanced diet that includes fruits, vegetables, whole grains, and protein Excercising at least 30 minutes a day most days of the week Resting when you feel tired or overwhelmed Spending time with friends and family"
    },
    {
      "title": "Spend time doing things that make you happy.",
      "content": "Spend time doing things that make you happy. Investing time in doing the things you enjoy might help you forget about your negative thoughts. Schedule time to just have fun and leave your worries somewhere else. Make time for your hobbies or find a new hobby that aligns with your interests. You might also find that you feel more confident when you’re in your element doing the things you love. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For example, spend time crafting, exercising, reading, or participating in a club sport. Do things that will also help you relax , such as going for a walk, listening to music, or watching your favorite show."
    },
    {
      "title": "Set goals and challenge yourself.",
      "content": "Set goals and challenge yourself. Setting goals will help keep you motivated to continue improving and working on your skills. While unrealistic goals can make you feel less confident about your abilities, goals that are specific and actionable will allow you to gain the confidence to see your plan out until the very end. One idea is to set SMART goals which are specific, measurable, attainable, relevant, and time-bound. For example: [19] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Specific: The goal is to study for 5 days a week for my math class for 5 weeks. Measurable: I’ll keep a calendar and mark down the days and times I study. Attainable: I have 1 hour of free time after school each day to study. Relevant: This added study time will help me improve my grade. Time-bound: This will continue for 5 weeks."
    },
    {
      "title": "Speak with a therapist if you need more support.",
      "content": "Speak with a therapist if you need more support. There’s nothing saying that you have to face these negative thoughts on your own. If you feel like you need support from a professional, talking to a therapist can provide you with a safe space to express your thoughts, and your therapist may have exercises and activities that can help you change your way of thinking. [20] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    }
  ]
}