{
  "url": "https://www.wikihow.com/Squid-Stardew-Valley",
  "title": "How to Catch & Use Squid in Stardew Valley: Recipes, Gifting & More",
  "steps": [
    {
      "title": "Wait until Winter.",
      "content": "Wait until Winter. Squid can be caught during the Winter. There are a few exceptions to this, however, though they require game progression or gold: [1] X Research source If you have access to Qi's Walnut Room, you can buy Magic Bait that allows you to catch any fish regardless of the weather, time, or season. You can purchase Magic Bait for 5 Qi Gems, as well as the recipe for Magic Bait for 20 Qi Gems. [2] X Research source Squid can randomly (and rarely) be found in Garbage Cans during Winter. You can also sometimes find Squid for sale in the Traveling Cart for 240 to 1,000 gold. During the Desert Festival (Spring 15-17) in the Calico Desert, if Pierre is chosen to have a shop he will have 5 Squid for sale for 10 Calico Eggs each. Pierre also sells Calico Eggs for 150 gold each if you don't want to earn the Calico Eggs other ways."
    },
    {
      "title": "Go to the Beach between the hours of 6pm and 2am.",
      "content": "Go to the Beach between the hours of 6pm and 2am. Squid can also be found on the Beach Farm, if you selected that farm layout. On Winter 12 and 13, you can catch Squid all day thanks to the SquidFest event. [3] X Research source"
    },
    {
      "title": "Go fishing.",
      "content": "Go fishing. Squid isn't a necessarily hard fish to find, but it may be a bit more challenging for novice fishers to catch one. Squid have the Sinker behavior during the fishing mini-game, which means they will rapidly move downwards while being reeled in. [4] X Research source"
    },
    {
      "title": "Four recipes can be made with Squid.",
      "content": "Four recipes can be made with Squid. However, three of these recipes do not require Squid specifically, so you can technically use any fish to make them. The recipes you can use Squid in are as follows: [5] X Research source Fried Calamari: 1 Squid, 1 Wheat Flour, 1 Oil Maki Roll: 1 Fish (any), 1 Seaweed, 1 Rice Quality Fertilizer: 1 Fish (any), 2 Sap Sashimi: 1 Fish (any)"
    },
    {
      "title": "Squid can be used to create clothing.",
      "content": "Squid can be used to create clothing. If you put a Squid in the Sewing Machine, you can make a Sailor Shirt. [6] X Research source"
    },
    {
      "title": "Squid are used in a number of quests.",
      "content": "Squid are used in a number of quests. Some of these quests are at the Help Wanted board, though others are given in different ways. [7] X Research source On Winter 2, Willy will send a request by mail for one Squid. If you complete this quest you'll get 800 gold and one friendship heart. One Squid may be requested in Winter at the Help Wanted board. The reward is 240 gold and 150 friendship points with the poster. Willy or Demetrius may request one to four Squid during Winter at the Help Wanted board. You will get 80 gold per fish, and you can keep the fish after turning in the quest. Demetrius may put up a request in the Winter at the Special Orders board (outside the Mayor's house) for 10 Squid. The reward is the same amount of gold you would get for selling the fish, plus the Farm Computer recipe."
    },
    {
      "title": "Squid can be placed in the Fish Pond, where they will reproduce.",
      "content": "Squid can be placed in the Fish Pond, where they will reproduce. You can initially place 3 Squid in your Fish Pond, but if you complete two quests you can store up to 10. Squid will reproduce every 3 days. The only item you can harvest from Squid is Squid Ink. [8] X Research source If you need Squid Roe, you can get it after reading the Jewels of the Sea power book. This book gives you the power to get Roe from every fish you catch, including Squid."
    },
    {
      "title": "You can use Squid as a gift.",
      "content": "You can use Squid as a gift. While most fish are not liked as gifts, Elliott does like to get Squid as a gift. If you have extra Squid, consider giving them to Elliott. Demetrius, Leo, Linus, Sebastian, and Willy are all neutral towards getting Squid as a gift, so gifting it to them isn't bad but is also not the best use for the item. Most other villagers dislike Squid as a gift, and you should avoid giving it to them. #*Evelyn, Haley, Pam, and Pierre hate Squid, so never give it to them as a gift."
    }
  ]
}