{
  "url": "https://www.wikihow.com/Wear-a-Loose-Tie",
  "title": "How to Wear a Loose Tie",
  "steps": [
    {
      "title": "Loose ties aren't appropriate for formal or professional events.",
      "content": "Loose ties aren't appropriate for formal or professional events. A loose tie instantly gives you a laid-back, relaxed vibe, which can be a great look if it matches the occasion. After-hours events, casual dinners, or informal parties are all great reasons to wear a loose tie. [1] X Research source Don’t wear a loose tie for formal or professional events such as business meetings, weddings, religious ceremonies, fine dining, and job interviews. These moments really call for a crisp, tight tie."
    },
    {
      "title": "There’s a reason it’s the most common knot used for ties.",
      "content": "There’s a reason it’s the most common knot used for ties. Drape the tie around your neck so the wide end is over your right shoulder, then cross the wide end over the narrow end near your collar. Loop the wide end through the neck loop of the tie, bring the wide end underneath the knot, and then feed the wide end over the neck loop to make a symmetrical knot. Finish the knot by pulling the wide end over the front of the knot, bringing the tie through the bottom of the neck loop, and pulling the tie down through the loop in front of the knot. [2] X Research source The Windsor knot is easy to tie and it works well on any neck and face type. Make sure the thin part is a little shorter than the wide part and don't let the tie hang past your belt buckle."
    },
    {
      "title": "Once you’ve adjusted the knot, tug it gently to loosen it.",
      "content": "Once you’ve adjusted the knot, tug it gently to loosen it. Grip the knot with your dominant hand, but don’t squeeze it or you could ruin it. With your other hand, hold the thin part of the tie. Then, gently tug the knot away from the collar to loosen it while you keep the tie centered. [3] X Research source It can be helpful to button your shirt all the way up while you’re tying your tie, but once you’ve got the knot finished, pop that bad boy open. [4] X Research source Adjust the loose knot so it rests just below your shirt’s top button for a laid-back, comfortable loose-tie look."
    },
    {
      "title": "Choose your clothes first, then your tie.",
      "content": "Choose your clothes first, then your tie. Make sure the colors match or correspond and don’t clash. If you’re wearing patterned clothes, you can pick a patterned tie if you like, but make sure it matches and enhances it. If you’re wearing a plain white shirt, you can wear pretty much any pattern or color tie with it. You can pair almost any color with a neutral color outfit. For instance, if you’re wearing a dark navy suit and a white shirt, you can choose a dark tie to create a more professional look or a bright tie for a vibrant splash of color. A basic rule of tie-wearing is to never wear a shirt and tie with the same pattern. [5] X Research source"
    },
    {
      "title": "A loose tie adds a relaxed energy to your ensemble.",
      "content": "A loose tie adds a relaxed energy to your ensemble. You don’t have to save your ties for special or formal events. If you want to add one to your outfit, go for it! Wear a tie with a button-down, denim jacket, or a polo shirt. Put one on for a night out on the town or to grab lunch with a friend. [6] X Research source Complete your outfit with jeans and sneakers for a casual vibe. Ties were once symbols of conformity, of the straight and narrow. But these days, adding a tie to your look can be a sign of rebellion—especially a relaxed and loose tie."
    },
    {
      "title": "Keep the tie loosely knotted and add some formality.",
      "content": "Keep the tie loosely knotted and add some formality. A loose tie will make sure you still have a relaxed and confident style, but a traditional suit jacket, sport coat, cardigan, or blazer will give you an extra element of formality. The juxtaposition of a loose tie and a more formal jacket can give a more rebellious type of look. [7] X Research source To complete your outfit, wear slacks and dress shoes."
    }
  ]
}