{
  "url": "https://www.wikihow.com/Tile-a-Shower",
  "title": "Tiling a Shower: Prep, Installation, and Finishing Touches",
  "steps": [
    {
      "title": "Remove the old tile from the walls.",
      "content": "Remove the old tile from the walls. If you’re working on an existing shower, demolition is the first step. Turn off the water and the power to the bathroom before you start. When you’re done tiling, you can turn both back on. Cover the doors and windows with plastic , and put a drop cloth on the floor. Wear a ventilated mask , and use a hammer and chisel to break the tiles apart and throw them away. Go from the top down to make quick work of your old tiles. [1] X Research source If your shower isn’t tiled, remove the existing material or shower surround, instead. Remove the backing board behind the tile with a crowbar. When you’re done, you should see insulation and studs. If you’re working on a brand new shower, you don’t need to do any demo. Make sure you’ve installed a shower pan or bathtub before tiling the shower. If you’re planning on tiling the shower floor, you don’t need a shower pan."
    },
    {
      "title": "Install a vapor barrier on the shower walls.",
      "content": "Install a vapor barrier on the shower walls. Roll the plastic barrier onto the entire shower wall, then use a staple gun to staple the barrier to the studs. Trim off any excess so the barrier fits neatly inside the shower walls. [2] X Research source If you fail to install a vapor barrier, you might grow mold and mildew as moisture from your shower escapes through the tiles and into walls. [3] X Expert Source Art Fricke Home Renovation & Repair Specialist Expert Interview. 1 July 2020."
    },
    {
      "title": "Put up a sturdy cement board backer.",
      "content": "Put up a sturdy cement board backer . Measure your shower walls, then cut the cement backer to fit from top to bottom. Screw the board to the studs, leaving a 1 ⁄ 8 in (0.32 cm) gap between the panels and the shower pan. That way, the backer and the shower pan won’t squeak when they rub together. [4] X Research source Be sure to cut out any notches for your shower head and handles using a saw or a box cutter. Putting up cement board is just like putting up drywall . Apply 100% silicone caulk behind the board on the studs and also use it to seal the seams between the panels. Add some seam tape between the panels as well."
    },
    {
      "title": "Add seam tape and mortar to the edge of the backer board.",
      "content": "Add seam tape and mortar to the edge of the backer board. If there’s a gap between the backer board and the wallboard, add seam tape to seal it up. Then, apply thin-set mortar with a putty knife to make a smooth, continuous wall with no gaps. [5] X Research source Keep this seam tight. Aim for a gap of 3/16” or smaller."
    },
    {
      "title": "Paint a water resistant primer over the backer board.",
      "content": "Paint a water resistant primer over the backer board. A primer will help keep moisture from building up in your walls and rotting your shower. Use a paint roller to spread a thin layer of primer over all of the shower walls, then let it dry completely. [6] X Research source Use a paint brush to get into nooks and crannies, too."
    },
    {
      "title": "Mark the vertical and horizontal layout of your tile.",
      "content": "Mark the vertical and horizontal layout of your tile. Planning out your tile will ensure you work in a straight, even pattern. Measure 1 of your tiles, then mark the center of each wall. Start in the center and carefully mark each tile in 1 vertical and 1 horizontal line. Use a level to ensure your line is straight, and leave 1/2“ in between each tile to account for the grout joints. [7] X Research source Your shower pan may not be totally level, so don’t use it as a straight edge guide. You can either use a pencil to mark out your lines, or you can nail a board to the wall and use it as a straight guide. Ceramic tile, porcelain tile, and quarry tile are best for shower walls. Planning to tile the shower floor? Make sure you use floor tiles, not wall tiles. Then, continue your tile pattern down to the floor."
    },
    {
      "title": "Mix enough thin-set mortar for the bottom row.",
      "content": "Mix enough thin-set mortar for the bottom row. Pour thin-set into a 5-gallon bucket, then add water according to the instructions on the package. Use an electric drill and a mortar mixing bit to mix the mortar until it’s the consistency of peanut butter. [8] X Research source Keep an eye on the consistency of your thin-set. If it’s too thick, it might dry out, and if it’s too thin, it will have a hard time setting. Do not use mastic as the adhesive for tile in a shower or a tub surround, as it will allow mold to grow. [9] X Expert Source Art Fricke Home Renovation & Repair Specialist Expert Interview. 1 July 2020."
    },
    {
      "title": "Spread thin-set onto 1 horizontal row.",
      "content": "Spread thin-set onto 1 horizontal row. Use a notched trowel to pick the thin-set up out of the bucket. Spread it onto the wall in an upwards motion, using the notches to thin it out. Cover 1 horizontal row of the shower wall. [10] X Research source Spread the thin-set onto the wall about 1 in (2.5 cm) thick."
    },
    {
      "title": "Set the first tile in the middle of the wall.",
      "content": "Set the first tile in the middle of the wall. This will create a pleasant visual effect and allow each tile that is placed beside it on either side seem centered. Press the tile onto the thin-set, then apply pressure to make it stick. Use your straight line as a guide to ensure your tiles are even. [11] X Research source"
    },
    {
      "title": "Add spacers in between each tile.",
      "content": "Add spacers in between each tile. Spacers will leave you identifiable grout lines between tiles. Before adding any more tiles, place small 1/16\" or 1/8\" spacers on the x and y axis of each tile. Add shims or small spacers beneath the bottom row of tiles to leave space between the shower pan and the tile. [12] X Research source Small pieces of cardboard work great as makeshift shims between your tile and shower pan. After the mortar is set, you can simply remove these shims and caulk between the lip of the pan and the bottom of the tile."
    },
    {
      "title": "Continue laying tile in a horizontal line.",
      "content": "Continue laying tile in a horizontal line. Keep using your straight edge as a guide, placing tiles next to each other with spacers in between each tile. Finish 1 horizontal row before moving on. [13] X Research source If you are tiling your shower floor as well, switch to floor tiles as soon as you reach the floor. Apply the tiles using mortar and spacers the same way that you put them on the wall."
    },
    {
      "title": "Cut tiles to fit in the corners and edges.",
      "content": "Cut tiles to fit in the corners and edges. As you get close to the edge of your shower wall, you’ll probably find that at least 1 of the tiles doesn’t fit neatly into the space left. When that happens, measure the open space, then cut the tile with a glass cutter or a manual tile cutter . [14] X Research source You can also cut tile with a wet saw, if you have one. Use the same tools to cut notches for your shower head and handles."
    },
    {
      "title": "Keep adding new rows of tile.",
      "content": "Keep adding new rows of tile. Use a level to make sure your original row is straight, then add more thin-set to the next row and keep tiling. Continue going up until you reach the top of the shower stall. [15] X Research source Make sure to measure every third or fourth row to ensure that you have an even grout line. If you don’t, gently pry the tile off and try again."
    },
    {
      "title": "Let the tile set for 48 hours.",
      "content": "Let the tile set for 48 hours. This will make sure that the mortar has adhered properly to both the tile backing and the cement board backer. Try not to move or adjust the tiles, since this could disrupt the drying process. [16] X Research source"
    },
    {
      "title": "Remove the spacers.",
      "content": "Remove the spacers. Since your tiles are set now, you don’t need your spacers anymore. Gently remove the spacers from the tiles and throw them away. [17] X Expert Source Art Fricke Home Renovation & Repair Specialist Expert Interview. 1 July 2020."
    },
    {
      "title": "Apply grout to the tiles in sections.",
      "content": "Apply grout to the tiles in sections. Mix up a batch of grout, then let it rest for about 5 minutes. Wet the tiles with a damp sponge, then use a grout float (a flat trowel) to press the grout into the spaces between the tiles. Add grout to all the spaces in between each tile in a 4 by 4 ft (1.2 by 1.2 m) section. [18] X Research source It’s important to work in small sections so that the grout doesn’t dry on the tiles. Grouting a shower wall is similar to grouting a tile floor ."
    },
    {
      "title": "Wipe excess grout off the tiles in sections.",
      "content": "Wipe excess grout off the tiles in sections. When you’re done grouting an area, you’ll notice that there’s a lot of excess grout on your tiles. Use a damp sponge to go over the tiles, lightly removing all the grout from the outside of the tiles. [19] X Research source Then, keep going in sections over the entire wall. The tiles may look a bit hazy even after wiping, so you may have to buff them with a clean sponge to get rid of this haze."
    },
    {
      "title": "Let the grout cure for 3 days, then seal it.",
      "content": "Let the grout cure for 3 days, then seal it . Run a thin bead of liquid grout onto every grout line and wipe away. Let it dry, then drop water onto the sealed grout to test its water resistance. Correctly sealed grout will cause the water to bead up on top of it. [20] X Research source Sealer isn’t strictly necessary, but it will extend the grout’s lifespan and make your shower more resistant to mold and mildew."
    },
    {
      "title": "Caulk",
      "content": "Caulk the seams around the shower pan. Make sure to use a grout caulk to match the colors of your existing grout. As you caulk, remember to pull the caulk gun relatively quickly across the joint. Most amateurs caulk too slow and end up dropping too much caulk down on the joint. Other things to remember: [21] X Research source Keep the tip angled as you run the bead along the joint. Match the speed with which you pull the caulk gun trigger with the rate at which you pull the gun along the joint. You don't want to be pulling the gun fast but triggering slowly, or vice versa. After applying the bead of caulk, \"bed\" it by running a damp finger across the bead with light pressure."
    }
  ]
}