{
  "url": "https://www.wikihow.com/Use-a-Waterpik-Water-Flosser",
  "title": "How to Use a Waterpik Water Flosser",
  "steps": [
    {
      "title": "Decide where to shop.",
      "content": "Decide where to shop. The Waterpik is available at many major retailers like Target and Walmart. You can also find it at some electronics stores like Best Buy or internet retailers like Amazon."
    },
    {
      "title": "Pick the right model.",
      "content": "Pick the right model. The Waterpik comes in a variety of models with different functions and prices. Shop around and decide what works best for you. [1] X Research source The countertop model is designed to permanently sit on your counter. It has a large reservoir, making it ideal for family use. These models typically cost between $45 and $59. The cordless model has no cord and a larger base to hold the water. It is ideal for travel, but it has less power and may be harder to handle. These models typically cost between $47 and $69. There are Showerpik models that are cordless and externally waterproof for use in the shower. They use only the shower pressure which may sometimes be low. These models typically cost around $69. The deluxe and ultra models often include a sonic toothbrush that can dock on the unit itself. You can change the tips of these models, making them usable for all family members. These models typically cost around $99. There are various kid’s models available as well. They are smaller and generally decorated to be kid friendly. They are designed for kids age 6 and older. These models typically cost between $35 and $49."
    },
    {
      "title": "Pick the right specialty tips.",
      "content": "Pick the right specialty tips. The standard model typically comes with only one tip; however, there are a variety of specialty options you can purchase individually, in a package deal or with deluxe versions of the unit. [2] X Research source The classic jet tip, included in all Waterpik models, will provide a steady flow that is ideal for direct application to the gums and teeth. The toothbrush tip allows you to brush your teeth with a steady flow of water coming through the center of the brush, improving the quality of your brushing. The plaque seeker tip is ideal around crowns, bridges, and implants. The orthodontic tip is ideal for dental braces. It will remove plaque and debris from around brackets and under wires which are hard to reach with floss and other methods. The pik pocket tip removes plaque deep within periodontal pockets. This is ideal for people who have chronic periodontitis."
    },
    {
      "title": "Fill the water reservoir.",
      "content": "Fill the water reservoir. The reservoir is the large water container. It should have a removable top where it can easily be refilled. [3] X Research source Use lukewarm water. Don’t use water that is uncomfortably hot. Add a small cup of chlorhexidine mouthwash twice a week if your dentists recommends it to create a sterile environment. [4] X Research source Do not use salt water as you may block the pipes of the Waterpik."
    },
    {
      "title": "Select the right tip.",
      "content": "Select the right tip. Choose the tip that works best for you. The options are the classic jet tip, the toothbrush tip, the plaque seeker tip, the orthodontic tip and the pik pocket tip. [5] X Research source"
    },
    {
      "title": "Place the tip in the handle.",
      "content": "Place the tip in the handle. There should be a way to lock the tip in place, either by twisting it or pressing a button on the handle. Consult the product manual if necessary."
    },
    {
      "title": "Place the tip in your mouth.",
      "content": "Place the tip in your mouth. Start with your back teeth. Hold the tip away from the teeth and gums rather than touching them directly. The tip of the Waterpik should be placed between the teeth and then the area gently lavaged. Lean over the sink so you don’t splash water on your countertop. You can either start with the outside of the teeth or the inside, but make sure you spray every interdental area where a regular brush can't reach."
    },
    {
      "title": "Turn on the unit.",
      "content": "Turn on the unit. There will be either an on-button or a dial that adjusts the water pressure. Start with the low pressure setting. Increase the water pressure as you go along to a rate that is comfortable."
    },
    {
      "title": "Follow your gum line.",
      "content": "Follow your gum line. Go tooth by tooth to ensure you get everything. Aim for the top of the tooth, the baseline of the gum and the space between each tooth. Trace both from behind your teeth and from the front. Essentially, you’ll be making four passes to reach the front and back of both and bottom rows. Hold the Waterpik for about two second over each tooth. The entire process should last for about two minutes but take your time to rinse if you feel like it."
    },
    {
      "title": "Empty the reservoir.",
      "content": "Empty the reservoir. You should pour out any remaining water. Leaving stale water in the reservoir can cause bacteria to grow. [6] X Research source"
    },
    {
      "title": "Use the instruction manual.",
      "content": "Use the instruction manual. Each Waterpik unit comes with an instruction manual. If you lose it, you can download another copy on the Waterpik website. [7] X Research source"
    },
    {
      "title": "Buy replacement parts.",
      "content": "Buy replacement parts. The Waterpik is an elaborate device with several parts that can break and require replacement. The Waterpik website includes a section where tips, accessories and replacement parts are available for sale separate from the main units. You should replace the tips every three to six months. [8] X Research source"
    },
    {
      "title": "Fix a drop in water pressure.",
      "content": "Fix a drop in water pressure. A common issue is that the device sometimes loses water pressure. You can attempt to fix this issue before having to replace the device. [9] X Research source Ensure the black valve in the reservoir tank is inserted with the dome side facing up and the four-pronged side facing down. Fill the reservoir at least half full to support pressure. Confirm that the unit is plugged into a fully functioning electrical outlet. Regularly clean the unit by adding a few teaspoons of vinegar or chlorhexidine mouthwash to a full reservoir of warm water. Then drain the reservoir through the handle into the sink until it is empty."
    },
    {
      "title": "Fix a leaking reservoir.",
      "content": "Fix a leaking reservoir. A reservoir leak is another common issue. You can attempt to fix this issue before having to replace the device. Remove the black rubber valve from the water tank by pushing it out from the bottom. Run the valve under warm water and massage with your fingers. Return the valve to the tank. Ensure the dome side is facing up and the four-prong side is showing on the bottom."
    }
  ]
}