{
  "url": "https://www.wikihow.com/Use-Dishwasher-Salt",
  "title": "How to Use Dishwasher Salt",
  "steps": [
    {
      "title": "Remove the bottom rack to expose the salt reservoir.",
      "content": "Remove the bottom rack to expose the salt reservoir. Pull the bottom rack out completely and set it on your kitchen counter. You may need to lift it up slightly to unclip it from its rollers. Your reservoir will be on the bottom of the dishwasher, probably off to one side. If you don’t see a reservoir, your dishwasher may not have a built-in water softener."
    },
    {
      "title": "Unscrew the cap and check for water.",
      "content": "Unscrew the cap and check for water. Water softener units have caps that need to be tightly secured after each use. Unscrew this cap and set it to the side. If this is the first time you’re using your unit, it needs to be filled with water. Pour enough in to fill it to the top of the opening. After the first time you use it, your softener unit should always have a bit of water in it. You won’t need to refill it."
    },
    {
      "title": "Use only dishwasher salt in your softener unit.",
      "content": "Use only dishwasher salt in your softener unit. You can find specially made dishwasher salt at grocery stores, hardware stores, or online. It doesn’t matter which brand of you choose, but you cannot use table salt, sea salt, or kosher salt as a replacement for dishwasher salt. These cooking salts contain additives that might actually increase the hardness of your water. They may also be too fine, which could clog the unit. [1] X Research source"
    },
    {
      "title": "Pour salt into the funnel until the reservoir is full.",
      "content": "Pour salt into the funnel until the reservoir is full. Different dishwashers will have differently sized units that take various amounts of salt, so there’s no precise measurement for this process. Pour salt into the unit until it’s completely filled up. Since you also have water in the unit, you’re creating a saltwater brine that will refresh the chemical processes that occur in the built-in softener. [2] X Research source Using a funnel to pour your salt will help you avoid spills. Hold the funnel above the reservoir instead of plunging it into the unit. If the funnel gets wet, the salt won’t pour through it properly."
    },
    {
      "title": "Clean excess salt with a wet cloth.",
      "content": "Clean excess salt with a wet cloth. If you’ve spilled any salt in the dishwasher around the unit, wipe it up with a wet cloth. The salt you pour in the softener unit never actually touches your dishes, as it just stays in the unit itself. If you leave loose salt in the dishwasher, however, it will get mixed in with the water that cleans your dishes. This won’t hurt them, but it may give you slightly dirty (or salty) dishes for one cycle. [3] X Research source You can also run a rinse cycle without dishes to clean any spilled salt out of the dishwasher."
    },
    {
      "title": "Screw the cap on tightly.",
      "content": "Screw the cap on tightly. Replace the cap securely and check to make sure it’s tight. If the cap gets loose during a cycle and detergent gets into the unit, it could break. You certainly don’t want to pay for a new dishwasher just because your cap wasn’t tight enough! [4] X Research source"
    },
    {
      "title": "Replace the bottom rack and run the dishwasher normally.",
      "content": "Replace the bottom rack and run the dishwasher normally. Once you’ve checked your cap, you can put the bottom rack back into the dishwasher. Fill your dishwasher with dishes and run it like you always do. There’s no need for an empty rinse or clean cycle after you refill the salt. [5] X Research source"
    },
    {
      "title": "Use salt only in dishwashers that have built-in softener units.",
      "content": "Use salt only in dishwashers that have built-in softener units. If you are unsure whether your dishwasher has a built-in unit, contact your manufacturer. If you can’t find it on the bottom of the dishwasher, you probably don’t have one. Don’t put dishwasher salt into other spots marked for normal detergent or dishwasher cleaner. This could easily break your appliance. Most dishwashers in the United States do not have built-in softener units that need to be filled with salt. Only select models come with this feature. [6] X Research source"
    },
    {
      "title": "Check your dishwasher’s salt indicator.",
      "content": "Check your dishwasher’s salt indicator. The easiest way to know if your dishwasher needs more salt is for it to tell you that it’s ready for a refill! Many dishwashers have an indicator light either on the top panel of the dishwasher and/or on the unit itself. If your lights are green, they’re good to go. If your indicator lights are red (or, on the unit itself, clear), then you’re ready to pour in more salt. [7] X Research source"
    },
    {
      "title": "Top off the reservoir at least once per month.",
      "content": "Top off the reservoir at least once per month. If your dishwasher doesn’t have indicator lights, it’s up you to make your own schedule. It’s a good idea to refill the salt about once per month in dishwashers that contain built-in units. Even if you have indicator lights, you may want to do a refill if it’s been over a month. [8] X Research source If you notice that your indicator lights are taking more than a month to tell you to refill the unit, they may be broken. Check your unit levels, and call your manufacturer if you’re concerned."
    },
    {
      "title": "Top off the reservoir if your dishes appear overly streaky.",
      "content": "Top off the reservoir if your dishes appear overly streaky. Monitor your dishes to keep an eye on the water softness. If your water is getting too hard, you’ll start getting streaky dishes that look like they have a white film on them. This will be especially obvious on clear glasses. Top off the reservoir with salt to restore that pretty sparkle to your wine glasses! [9] X Research source"
    }
  ]
}