{
  "url": "https://www.wikihow.com/Take-a-Hard-Drive-Out-of-a-Laptop",
  "title": "How to Remove a Hard Drive from a Laptop: Step-by-Step",
  "steps": [
    {
      "title": "Backup your files.",
      "content": "Backup your files. Before you remove the hard drive from your laptop, make sure you backup all the files in case something goes wrong. You can backup your files using an external hard drive, a USB drive, or using cloud storage like Google Drive , or Dropbox ."
    },
    {
      "title": "Disconnect all cables.",
      "content": "Disconnect all cables. Remove any cables connected to your laptop. This includes the power cable, any USB cables, network cables, phone lines, and any other attached devices."
    },
    {
      "title": "Remove the battery.",
      "content": "Remove the battery. In most cases, the battery has one or two release latches that you press to remove the battery. Press the release latch(es) and pull the battery out of the bay. Some laptops, like most newer MacBook models, are not designed with easily removable batteries. While you might be able to find DIY instructions online, it's better to take your computer to a professional in these cases unless you're very handy."
    },
    {
      "title": "Press and hold the power button for 15 seconds.",
      "content": "Press and hold the power button for 15 seconds. This will drain any remaining electricity in the laptop, which will prevent you from getting shocked while working on the laptop."
    },
    {
      "title": "Unscrew and remove the main access panel.",
      "content": "Unscrew and remove the main access panel. The access panel is located either on the bottom of the laptop or on one of the sides, depending on the brand and model of your laptop. There may be a symbol that resembles a stack of CDs on the access panel. In some cases the hard drive is located under the motherboard or the keyboard. If this is the case, it will be much more difficult to remove the hard drive. If so, consult your user's manual or take your laptop to a professional. Some laptops, like the newer MacBooks, aren't designed so you can easily replace or modify the hard drive without specialized tools and skills."
    },
    {
      "title": "Remove the hard drive mount.",
      "content": "Remove the hard drive mount. The hard drive may be held in place by an additional mounting mechanism, which can vary from one laptop model to another. You may need to remove some additional screws, but on some laptops, there might be a button that you press or a latch to release the hard drive."
    },
    {
      "title": "Separate the hard drive from the connectors.",
      "content": "Separate the hard drive from the connectors. Pull the hard drive away from the connectors to disconnect and remove the hard drive from the bay. There may be a tab on the hard drive that you can pull to remove the hard drive more easily, but in some cases, you may need a flat-bladed tool to remove the hard drive."
    },
    {
      "title": "Remove the hard drive bracket from the drive.",
      "content": "Remove the hard drive bracket from the drive. Once the hard drive is disconnected, if the hard drive bracket is still fastened to the hard drive you will need to remove it so you can install the new hard drive. Typically brackets are held on by four screws on the sides of the hard drive. Remove the screws to separate the hard drive from the bracket. If you are replacing the hard drive, you will place the new hard drive inside the bracket to install it. If your original laptop is broken, take out the internal hard drive, and purchase a unit that makes your internal HD act like an external HD ."
    }
  ]
}