{
  "url": "https://www.wikihow.com/Unblock-Someone-on-Facebook",
  "title": "2 Ways to Unblock Someone on Facebook",
  "steps": [
    {
      "title": "Open Facebook.",
      "content": "Open Facebook. It's a dark-blue app with a white \"f\" on it. Doing so will open your News Feed if you're logged into Facebook. If you aren't logged in, first enter your email address (or phone number) and password ."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . It's either in the bottom-right corner of the screen (iPhone) or in the top-right corner of the screen (Android)."
    },
    {
      "title": "Scroll down and tap Settings & privacy.",
      "content": "Scroll down and tap Settings & privacy . You'll find this option toward the bottom of the menu and will expand down to show more options."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . It's usually the first option in the \"Settings & privacy\" drop-down menu."
    },
    {
      "title": "Tap Profile settings.",
      "content": "Tap Profile settings . You'll see this under the \"Profile\" header. This might instead be a tab that says \"Audience & Visibility.\""
    },
    {
      "title": "Tap Blocking.",
      "content": "Tap Blocking . This option is near the bottom of the first section titled \"Privacy\" and will display all the people that you have blocked."
    },
    {
      "title": "Tap Unblock to the right of a user's name.",
      "content": "Tap Unblock to the right of a user's name. Tap Unblock to confirm your action, and you'll be able to interact with that user again. If you want to re-block the user, you'll have to wait for 48 hours before you can block them again. If you're using Facebook Lite, the steps are nearly identical. However, you may see an Audience & Visibility tab in Settings. In case you do, don't go to \"Profile Settings,\" but instead, tap Blocking from that tab."
    },
    {
      "title": "Go to Facebook's website.",
      "content": "Go to Facebook's website. It's at https://www.facebook.com/ . If you're already logged into Facebook, doing so will open your News Feed. If you aren't logged into Facebook, you'll first enter your email address (or phone number) and password in the upper-right side of the page."
    },
    {
      "title": "Click your profile picture in the right-hand side.",
      "content": "Click your profile picture in the right-hand side. Doing so will prompt a menu to drop down."
    },
    {
      "title": "Click Settings & privacy.",
      "content": "Click Settings & privacy . The menu changes to reveal new options."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . It's next to a gear icon."
    },
    {
      "title": "Click Privacy.",
      "content": "Click Privacy . You'll see this in the menu on the left side of your screen next to a padlock icon. The \"Privacy\" menu opens to replace the left-side menu options."
    },
    {
      "title": "Click Blocking.",
      "content": "Click Blocking . It's on the left side of the page."
    },
    {
      "title": "Click Edit to the right of \"Block users.",
      "content": "Click Edit to the right of \"Block users. \" This is usually the second item in the menu and will allow you to edit your blocked users. [1] X Research source"
    },
    {
      "title": "Click See your blocked list.",
      "content": "Click See your blocked list . Doing so opens a new window with a list of all the accounts you've blocked."
    },
    {
      "title": "Click Unblock to the right of someone's name.",
      "content": "Click Unblock to the right of someone's name. Click Confirm to make sure you really want to unblock them. If you want to re-block the user, you'll have to wait for 48 hours before you can block them again."
    }
  ]
}