{
  "url": "https://www.wikihow.com/Stop-Saying-the-Word-%22Like%22",
  "title": "How to Stop Saying the Word \"Like\"",
  "steps": [
    {
      "title": "Pair the word with an action so you can catch it faster.",
      "content": "Pair the word with an action so you can catch it faster. If you’re talking and you say “like,” quickly tap yourself on the thigh or pinch yourself on the wrist. The more you notice it, the more you can break the habit. [1] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Keep the movement small so that it doesn’t distract you from what you’re saying. You can also pull on a hair tie around your wrist or flick yourself in the leg."
    },
    {
      "title": "Try to count the number of times you say “like” in 1 minute.",
      "content": "Try to count the number of times you say “like” in 1 minute. Then, record yourself again, and try super hard not to say the word “like” at all. Try doing this a couple of times per day until you get into the habit of checking yourself on your own. [2] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source You can also download an app like LikeSo to automatically count the number of times you say “like” for you."
    },
    {
      "title": "Think about what you say before you say it.",
      "content": "Think about what you say before you say it. If you’re talking quickly or you’re in a fast-paced conversation, you might be thinking about what to say next instead of what’s coming out of your mouth. Try to really slow down and contemplate every sentence before you say it to avoid saying “like.” [3] X Research source If you hear yourself say the word “like,” that’s okay! Just make a note of it and try not to say it again in the same conversation."
    },
    {
      "title": "Do this instead of saying “like” in between phrases.",
      "content": "Do this instead of saying “like” in between phrases. When you say a sentence and you come to a moment when you’d normally say “like,” just stop. Take a deep breath and let the silence fill the space in your sentence. [4] X Expert Source Patrick Muñoz Speech Coach Expert Interview. 12 November 2019. This can also help you avoid other filler words like “um” or “ah.”"
    },
    {
      "title": "You can use “roughly,” “approximately,” and “around.”",
      "content": "You can use “roughly,” “approximately,” and “around.” These words are helpful in sentences where you’re trying to convey an approximate amount, like money spent or time wasted. Make your sentences sound more specific by saying things: [5] X Research source “We spent around $500 at the mall today.” “I wasted roughly 30 minutes driving back and forth.” “We’ve used approximately 60% of our inventory.”"
    },
    {
      "title": "You could also use “yelled,” “whispered,” or “shouted.”",
      "content": "You could also use “yelled,” “whispered,” or “shouted.” Saying “like” before a quote is a super common way this word gets misused, and it’s probably where you’ll hear yourself using it the most. Instead, try getting super specific with your descriptor. [6] X Research source Instead of saying, “I was like, ‘no way!’” say, “I thought to myself, ‘no way!’” Instead of saying, “He was like, ‘I’m not interested.’” say, “He said, ‘I’m not interested.’”"
    },
    {
      "title": "You don’t need the word “like” to emphasize your point.",
      "content": "You don’t need the word “like” to emphasize your point. By omitting the word “like,” you can actually strengthen your sentences and speech. Stick to words like “very” or “incredibly” to make your sentence stronger. [7] X Research source For example, instead of saying, “He was, like, so angry,” say, “He was very angry.” Instead of saying, \"The sky was, like, so blue,\" say, \"The sky was a deep blue color.\""
    },
    {
      "title": "The more words you know, the easier time you’ll have.",
      "content": "The more words you know, the easier time you’ll have. Try reading new books, playing word games like Scrabble, or keeping a thesaurus handy to look up synonyms. If you can think of something else to say besides “like,” you’re already halfway there! You could try phrases such as “for example,” “nearly,” or “about.” [8] X Research source You can also download apps like Word of the Day to get new words sent directly to you."
    },
    {
      "title": "Use it when you’re expressing enjoyment or comparing 2 things.",
      "content": "Use it when you’re expressing enjoyment or comparing 2 things. You could say “I really like chocolate” or “He acts like his father.” If you keep the definition in mind, you can tell when you’re using “like” the right way and when you’re using it as a filler word. [9] X Research source"
    },
    {
      "title": "“Um,” “ah,” and “er” can also get repetitive.",
      "content": "“Um,” “ah,” and “er” can also get repetitive. As you cut down on your use of the word “like,” be careful you’re not replacing it with something else! When in doubt, just don’t say anything. [10] X Research source You might also find yourself saying “you know,” “well,” and “okay.”"
    }
  ]
}