{
  "url": "https://www.wikihow.com/Use-a-Pendulum-for-Divination",
  "title": "How to Use a Pendulum for Divination",
  "steps": [
    {
      "title": "Buy or make a pendulum.",
      "content": "Buy or make a pendulum. You might want to buy commercial pendulums, but it is very easy to make a pendulum. You can make a pendulum out of a paperclip, a ring, or a washer. The string or chain should be about 4–5 inches (10.2–12.7 cm), depending on the person."
    },
    {
      "title": "Get into a proper position.",
      "content": "Get into a proper position. You may stand, but it is easier to sit. Unfold your arms and legs, and rest your elbow on the table. Sit up straight, and get into a calm state. You may meditate if you like."
    },
    {
      "title": "Ask it to show you a \"Yes\".",
      "content": "Ask it to show you a \"Yes\". Once you are into a proper position, ask it \"Show me a Yes, please.\" Wait patiently. It might take a few seconds, or five minutes. It will begin to swing in a direction, whether it be in a circle or from side to side. This is your yes."
    },
    {
      "title": "Repeat the above process for the word \"No\".",
      "content": "Repeat the above process for the word \"No\". This time ask it to \"Show me a No please.\" Follow the above instructions from there."
    },
    {
      "title": "Begin to ask it simple questions that you know the answer to.",
      "content": "Begin to ask it simple questions that you know the answer to. This includes questions like \"Is my name...\" or \"Am I Female?\" If your name is that, then the pendulum will swing in a yes direction. Same if you were a female."
    },
    {
      "title": "Begin to use your pendulum for divination.",
      "content": "Begin to use your pendulum for divination. Ask it simple questions at first. As you become more advanced, you can begin to ask it personal questions. Some questions that you might consider asking are: Should I work at this job, Is it time to move, Will it rain tomorrow, etc."
    }
  ]
}