{
  "url": "https://www.wikihow.com/Use-the-Scan-It!-Device-at-Stop-%26-Shop",
  "title": "How to Use the Scan It! Device at Stop & Shop",
  "steps": [
    {
      "title": "Enter the store and locate the Scan It!",
      "content": "Enter the store and locate the Scan It! recharging area. These are conveniently located near the entrances. If there are no available guns left, you can either check the other area (if applicable) or you can ask customer service."
    },
    {
      "title": "Scan your Stop & Shop card with the scanner.",
      "content": "Scan your Stop & Shop card with the scanner. It will then load up your card information and device coupons to a scanner, which will light up on the charger."
    },
    {
      "title": "Learn about the interface.",
      "content": "Learn about the interface. On the top-right corner is the time. Next to that is your total price so far and how much you've saved with the card. In the main area there are some deals for you. Keep watch to see what's happening. The right side also features highlighted savings, which you can press down and scroll through the different coupons for you to use. These coupons can only be used once and often expire by the end of the regular sale week. If the device is idle for some time, it may randomly beep with a \"CHA-CHING!\" dollar sign sound. This is just to remind you about a random coupon or saving on the device."
    },
    {
      "title": "Start shopping for groceries.",
      "content": "Start shopping for groceries. Hold down the green button while you scan the UPC bar code on the item. Review the screen afterwards. It will show you what the cost of the item, how much you saved (store discounts, Scan It! discounts, etc), etc. Fruits and veggies are a little trickier. Bag it, then go over to one of the designated produce scanning areas. On the fruit will be the number which you type in to the area. It also has a number reel on the bottom of the machine. Hit \"enter\". Type in the quantity. Repeat \"enter\". Print sticker and scan. Deli and fish are the same as regular products. You can scan alcohol (see warning)."
    },
    {
      "title": "Know how to remove an item.",
      "content": "Know how to remove an item. Removing an item is essential when you changed your mind on an item before finalizing the transaction or if it was a mistake (it usually occurs when a child uses the device on a random item). Re-scan the item's UPC bar code to officially remove it from the device."
    },
    {
      "title": "Bag your groceries as you go.",
      "content": "Bag your groceries as you go. This is the most fun of using the tool. Bagging your own groceries allows you to take control where things go in your bags. You can use either old plastic bags, reusable bags, or your own backpack."
    },
    {
      "title": "Proceed to a designated cash register with a Scan It!",
      "content": "Proceed to a designated cash register with a Scan It! bar code when you are done shopping. This UPC bar code needs to be scanned, to \"tell\" the device that the transaction is going to be finalized. You or the cashier can scan this bar code."
    },
    {
      "title": "Hand over your Scan It!",
      "content": "Hand over your Scan It! device to the cashier, along with your Stop & Shop card. The cashier will then place your transaction to the machine and your purchases will appear on the screen."
    },
    {
      "title": "Follow the regular process of paying for your transaction.",
      "content": "Follow the regular process of paying for your transaction."
    }
  ]
}