{
  "url": "https://www.wikihow.com/Start-a-Record-Label",
  "title": "How to Start a Record Label",
  "steps": [
    {
      "title": "Define your venture.",
      "content": "Define your venture. For the most effective startup, focus on a particular genre to build your reputation. This focus will be determined in large part by what you wish to accomplish. If your goal is to make a lot of money, then you'll focus on popular music. If your goal is to be the go-to label for 21st century post avant jazzcore, your focus and approach will be much different."
    },
    {
      "title": "Write a business plan.",
      "content": "Write a business plan. This is needed on many levels. First and foremost, you will build the framework of your label: how you plan on finding and developing talent, your marketing and promotion avenues, how you understand the market and the competition, how you plan on financing your venture, and how you intend on making this a profitable business. If you're independently wealthy, then you may not need investors, at least for the monetary backing. However, you may wish to attract investors who can help you build credibility in your market. For example, if you started a pop music label with your own cash, but were able to convince Sir Paul McCartney to invest in your label, that would be a huge win for your label. To do that, though, you will need a credible plan that shows Sir Paul, or any other investor, that you know what you are doing. Should you need financial backing, having a plan that shows that you understand both the rewards and the risks, and that you have been able to determine a way forward, will go a long way in convincing an investor to risk his capital on your venture."
    },
    {
      "title": "Detail all the costs associated with your startup.",
      "content": "Detail all the costs associated with your startup. That will include everything from staples to electricity to recording and production costs. Be very thorough when you do this: people who might consider becoming involved in your label will certainly be, when they read your plan! Here are some things to take into account: Administrative costs: rent, utilities, taxes, and licenses are right up front and can be significant. Don't forget to include phone, internet, printers, paper, computers, business cards, and office supplies in this list. You will also need a website, as well as somebody to both create and maintain it. Some of these costs will be weekly, some monthly, and some that only happen every year or two. It may seem like a lot at first, but if you create a five-year plan, you should be able to chart out how these costs will eventually become a small percentage of the overall financial picture. Recording costs: as a record label, you're going to be producing acts. That means you need to account for the recording chain, including studio time, the fees for the engineer and producer (which may be you, but you need to get paid too), mixing engineers, and studio musicians. Marketing budget: a great recording is nothing until it's actually in the market. To do that, you're going to need to promote your label through online ads, magazine ads, press releases, and your website. You will also need to work with artists and designers to create your logo, packaging standards, and overall design plan. Professional services: while you're busy making beautiful music, somebody needs to take care of writing clear, effective legal contracts both for your talent, and for your business deals. For that, you will want the services of a qualified attorney who specializes in the music business. You'll also want an accountant to make sure that you friendly tax collector doesn't come to call. You need people that you can trust and rely on."
    },
    {
      "title": "Prepare a cash flow forecast.",
      "content": "Prepare a cash flow forecast. Planning a cash flow forecast for one, three, and five years out requires some skill, some savvy, and some educated guesswork. The first year should be a very solid plan: you will have a good idea of your startup costs already, and you will likely have in mind (and made contact with) a few bands who will be the first on your roster. Using this information, determine how much you'll be spending, and a projection about how much these acts will bring in. For example, you can base this on how the bands are doing currently: Do they pack clubs? Their music has a good track record, and will probably perform well. If you also have bands that are brand new, and don't have a fan base to work from, you'll have to do significantly more promotion to get the word out. As you add more bands to your roster, your income potential will continue to grow. As you plan for years three to five in your forecast, you will need to determine how and when you will add more talent, and how you will promote them. This is where prediction gets a little more complicated: a great band on your roster may make it much easier for you to promote all the bands on your roster. Similarly, a poorly-performing band will be a cash drain that can lead to financial struggles."
    },
    {
      "title": "Create your team.",
      "content": "Create your team. Unless you're supremely talented in sales, marketing, music, business, art, conversation, and moonlight as a lawyer, you're going to want to develop a team. Here are some key skill sets that will enable your success: Marketing and sales: somebody who can get out there and promote your label, who knows the industry, and has a personal relationship with artists, promoters, and people who like to support the arts financially. This person or persons will be key to your success: they're responsible for bringing talent in, and getting the word out. The better they perform, the more successful you'll be. Production. You'll need somebody who understands the recording process inside and out, who can find or develop good engineers, mixers, and producers, and who can run a recording session. Contract help. To keep costs down, at least at first, consider hiring other staff on a per-job basis. This would include logo and graphic design, legal, accounting, engineering, and other needs that only occur from time to time."
    },
    {
      "title": "Formalize your business.",
      "content": "Formalize your business. Set up the appropriate business entity for your label so that you can operate legally, and protect yourself as well. You have several options, which may be called different things in different countries, but are functionally the same: Sole proprietorship. This is the one where you do it all. A sole proprietorship is easy to start, easy to stop, and easy to maintain. You may have consultants or friends who help you out with the many things that need to be done, but at the end of the day, it's all yours. That includes all the profits, and all the liabilities. It offers little incentive for investors, very little protection for you and should your business fail, any business debts will come out of your pocket. If you are planning on making your label a real business, or want to hire people as you grow, this is not the best option. Limited Liability Corporation (LLC). An LLC is great for a small business. You have the ability to add people to the team as you grow, and it offers personal liability protection should the business fail. It also provides for relatively easy and flexible control over finances, legal, and tax issues. If you plan on seeking investors, or are international in scope, this is not a good option. Corporation (You, Inc.). If you are planning to make this a major business venture, are going to be seeking investors, and who like a formal structure, this is the way to go. As with LLCs, you are protected from liability for business losses. You can issue shares of stock, raise investment capital, and have decades of legal precedents to call on when necessary. There are strict rules of organization, and your accountant—as well as your attorney—will be kept busy with taxes, fees, reports, and filings. If you are the casual, laid-back type, this is not the best option for you unless you are ready to pick up the pace."
    },
    {
      "title": "Bring in the talent.",
      "content": "Bring in the talent. With your plan in place, your business in order, licenses and permits applied for and granted, and your production art created and approved, and (hopefully) some investment capital to get you rolling, it's time to get to work!"
    },
    {
      "title": "Get out there and listen to live music, but listen with a critical ear.",
      "content": "Get out there and listen to live music, but listen with a critical ear. Watch the audience and see how they react to the band. If they are up on their feet from the start, and swooning over the band, you might be on to something! Approach the band and talk with them. Find out who they are, how long they've been together, have they released any music, and what their plans are for the future. Most importantly, find out if they've been signed to a label already. That may not be a show-stopper, but for starting a record label, you might want to pick a band that's not already signed!"
    },
    {
      "title": "Meet the press.",
      "content": "Meet the press. Your town is loaded with writers who will help you get the word out, but they have to know you. Search for them in the local papers, or local music blogs, and make contact. Invite them to lunch, or to your studio (or to the studio you like to use), and keep in touch with them."
    },
    {
      "title": "Meet the engineers.",
      "content": "Meet the engineers. Find the local recording studios in your area, and visit them. Some may be extravagant, high-end studios, and many will be modest one- or two-room affairs, with varying equipment standards. While that is certainly something to consider, more important is the quality of music that comes out of their speakers. Get to know the engineers, and talk to them about their recording philosophy, how they relate to bands, and what irks them. This is good to know if, for example, you have a rap artist you think will be a hit, and the engineer absolutely hates rap. Ask them to play some of their favorite cuts, and listen carefully. To be really thorough, ask them for a CD of some of their work so that you can also listen on your home speakers. Though it's rare, what sounds mind-blowing in a million-dollar studio might sound like it was recorded in the back seat of a Gremlin when taken out of the studio environment."
    },
    {
      "title": "Visit the music and record stores.",
      "content": "Visit the music and record stores. Big or small, they are there to sell recordings. When you get to know them, they may well be happy to sell your recordings as well. It's a small venue in the grand scheme of things, but when you're getting started, there's no venue that's too small."
    },
    {
      "title": "Get to know the agents.",
      "content": "Get to know the agents. These are the people who have their fingers on the pulse of the local music industry. The bands that have signed an agent have passed a certain threshold of legitimacy, simply by being professional enough to hire an agent. If your services show well to agents and promoters, the next time one of their bands says, \"Hey (name), I think we're ready to record an album,\" That person will say, \"I know just the place!\""
    },
    {
      "title": "Establish your brand.",
      "content": "Establish your brand. Once you've got the practical business matters well in hand, cultivate and maintain the aesthetic layers of your record label. Create a logo and make sure you use your logo and \"look\" on your physical labels, on your website, and on all stationery, t-shirts, mugs, etc. Sign bands and acts that fit in with the particular image you hope to cultivate. Check out successful DIY labels Sub Pop and Matador records for examples of brand management, who maintain a fiercely independent business model that's also quite diverse."
    },
    {
      "title": "Market your label creatively.",
      "content": "Market your label creatively. Over the last ten years, the Internet has drastically changed the way music is purchased, listened to, and distributed. You may face a hard road to success if you're using the traditional model of touring and relying on CD sales and radio play. YouTube videos and pay-what-you-want models are increasingly popular in maintaining the success of your brand. Consider promotional gimmicks, like printing t-shirts with the download code for a label mixtape on the tag. Goner records, a Memphis-based garage/punk label, even offered free 7-inch records to anyone who got \"Goner\" tattooed to their body and showed it at the store."
    },
    {
      "title": "Grow your base.",
      "content": "Grow your base. Sub Pop started by focusing on local Pacific Northwest grunge bands, but now features a diverse array of more mainstream sounds, like Iron & Wine and Fleet Foxes. With this expansion of the kinds of sounds they embrace, their success and share of the market has grown considerably. Even if you're focusing right now on tween pop stars, consider taking ways in which you might crossover and fit other sounds and images into your brand. In the early 90's, major labels were much more willing to take risks on unknown or \"underground\" acts. Sonic Youth, a noisy independent art band from New York, found themselves in a unique position after being offered a big deal by Geffen, and the signing was applauded by both label executives and music fans. If your label is bringing in money, consider throwing a curveball by releasing a project from left field."
    }
  ]
}