{
  "url": "https://www.wikihow.com/What-to-Say-to-Someone-with-Anxiety-Attack-over-Text",
  "title": "How to Help Someone Having a Panic Attack Over Text",
  "steps": [
    {
      "title": "A simple message of support is sometimes all that’s needed.",
      "content": "A simple message of support is sometimes all that’s needed. When someone is experiencing a panic or anxiety attack, they’re often really scared that they won’t make it through. Giving them faith in their own strength and ability to overcome this situation can really help them. Text them something like: [1] X Research source “I’m here for you. You’ll be okay soon.” “You’re strong and capable—this panic attack won’t beat you.” “It’s okay—nothing bad is going to happen.”"
    },
    {
      "title": "Letting your loved one know that anxiety passes can help them feel better.",
      "content": "Letting your loved one know that anxiety passes can help them feel better. Panic attacks generally last between 5-10 minutes, though they can sometimes go on for longer. They almost never last longer than an hour. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Telling your loved one that they’ll feel better shortly can feel very comforting, so say something like: “Panic attacks are temporary—in a few minutes, you’ll feel normal again.” “I know you’re going through a really difficult moment right now, but it’ll be okay again soon. These anxiety attacks don’t last long.” “Hold on. Everything will be okay soon—keep talking to me, keep yourself distracted, and you’ll feel better before you know it.”"
    },
    {
      "title": "Deep breathing is the most effective way to stop an anxiety attack.",
      "content": "Deep breathing is the most effective way to stop an anxiety attack. Many people experiencing anxiety are looking for a reminder to breathe, and sending them a message telling them to focus on their breathing can be especially helpful. Text your loved one something like: “Take long exhales—just think about letting all the air in your body out, then slowly bringing it back in.” “I want you to focus on your breathing. Nothing else matters—just take 10 slow breaths.” “Try to breathe from your belly, not your upper chest. Let your stomach rise up and down with your breaths.”"
    },
    {
      "title": "A relaxation technique may be exactly what your friend needs.",
      "content": "A relaxation technique may be exactly what your friend needs. For many people who suffer from anxiety attacks, an activity that allows them to focus on something else for a little bit can help them manage their feelings. Suggest a relaxation exercise to your friend or family member with a text like: [3] X Research source “Let’s focus on your senses. Text me 5 things you can see, 4 things you can touch, 3 things you can hear, 2 things you can smell, and 1 thing you can taste.” “How about a change of location? This place might be giving you a lot of anxiety, so why don’t you head to a different room, sit down, and text me how you’re doing?” “Here’s something that helps me a lot: can you go to your kitchen, pour yourself a big glass of ice water, and drink it slowly?”"
    },
    {
      "title": "A conversation about their symptoms lets your loved one talk things out.",
      "content": "A conversation about their symptoms lets your loved one talk things out. Asking your friend to open up about how they’re feeling can get them to reconnect to the sensations of their body, rather than the anxiety in their mind. By putting their symptoms into words, your loved one can organize their thoughts and feelings. Message them something like: “You mentioned that you feel sweaty. Would you feel better with a cool shower?” “Are the symptoms you’re experiencing similar to things you’ve felt in the past?” “I know nausea can be really uncomfortable. When I’m nauseous, I feel a lot better when I lay down on my side. Are you doing that now?”"
    },
    {
      "title": "Analyzing their feelings can give your loved one a sense of power.",
      "content": "Analyzing their feelings can give your loved one a sense of power. Although not all panic attacks have clear triggers, many do. When your loved one is able to identify what’s triggered their panic attack—for example, a social encounter, a movie, or caffeine—they’ll be able to turn on the analytical side of their brain. This can help panic attacks feel less scary, so message your loved one something like: [4] X Research source “Can you think about what caused you to feel this way?” “I think that you’re probably still up because of how much caffeine you’ve been drinking. That’s okay—caffeine is pretty harmless.” “It sounds like alcohol might be a trigger for your panic attacks. It’s okay—these effects should wear off soon, and you’ll feel like your normal self again.”"
    },
    {
      "title": "Putting your loved one in the driver’s seat makes them feel more in control.",
      "content": "Putting your loved one in the driver’s seat makes them feel more in control. Let your friend know that you’re a resource for them, and that you’re willing to do what it takes to help them through this tough moment. They might know what they need from you, which can make your role a lot more simple. Text something like: [5] X Research source “What can I do to help you through this?” “What have other people done to help you through your panic attacks in the past?” “I’m here for you—let me know how I can be a good source of support.”"
    },
    {
      "title": "If your loved one is in treatment for anxiety, remind them of their tools.",
      "content": "If your loved one is in treatment for anxiety, remind them of their tools. If their psychiatrist or mental health provider has given them strategies or medication for managing these anxiety attacks, reminding them of their options can be very useful. CBT (Cognitive Behavioral Therapy) has been shown to be very effective as a way to treat panic disorder. Talk to your loved one about treatment by saying something like: “I know you’ve been talking to a therapist. What advice do they have for moments like this?” “You’ve been going to CBT sessions, right? Tell me about their strategies for overcoming negative thoughts.” (If your loved one isn’t in treatment yet) “You aren’t alone: a lot of people experience panic attacks. I think talking to a mental health professional could be a really good idea—could I help you schedule an appointment?”"
    },
    {
      "title": "It’s easier to offer comfort with your voice.",
      "content": "It’s easier to offer comfort with your voice. Although texting is very convenient, and your loved one might refuse to interact in another way during this time, tell them that you’d like to call them either through a voice call or video chat. Studies have shown that people feel far closer to others and better cared for when they can hear another person’s voice. [6] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source “I’d like to give you a voice call. You don’t have to say anything if you don’t want to, but I think it’d be better for us to talk this way.” “Let’s talk through voice messages—I want to hear your voice and have a more natural conversation.” “Can we video chat? I’m going to give you a call now, please pick up.”"
    },
    {
      "title": "Reassure your loved one that they aren’t a burden.",
      "content": "Reassure your loved one that they aren’t a burden. If your loved one believes that they’re a burden during their panic attacks, it could make their anxiety worse. Message your friend that you’re happy that they’re reaching out instead of struggling by themselves: [7] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source “Thank you for telling me about what you’re going through. I’m grateful that you opened up to me.” “I love and care about you a lot. It’s a privilege to be here for you.” “You can always count on me to be there for you. We’ll get through moments like this together.”"
    }
  ]
}