{
  "url": "https://www.wikihow.com/White-Smoke-from-Exhaust",
  "title": "What Causes White Smoke from Your Muffler (or Engine Bay)?",
  "steps": [
    {
      "title": "Yes, if you see white smoke after starting the car, it's just condensation.",
      "content": "Yes, if you see white smoke after starting the car, it's just condensation. So long as the smoke mostly goes away after the car has been running for a few minutes, you’ve got nothing to worry about. This is just condensation buildup in your tailpipe and muffler from the ambient humidity. [1] X Research source This “smoke” is actually steam. It’s the water droplets (or ice) in your tailpipe being heated rapidly via your engine’s heat. The smoke may not go away entirely if it’s extremely humid or cold outside. This is normal, and nothing needs to be fixed. However, if the smoke doesn't go away or is thicker than normal, you may want to have your car inspected."
    },
    {
      "title": "Crack in the head gasket",
      "content": "Crack in the head gasket A vehicle's head gasket creates a seal between the head of each cylinder and the engine block, where fuel and air combine to power the engine. If the head gasket is cracked, coolant may leak out of the seal and burn off inside the engine bay. [2] X Research source If the smoke is tinted blue, you’ve got oil leaking out of the gasket. Coolant burns white, but oil burns bluish. Can you drive with this? If your engine isn’t overheating, you can drive a short distance. It’s not safe to ignore this, though. Additional symptoms: The engine runs hot, you notice pools of liquid under the engine bay, and you smell something sweet. The fix: See a mechanic to have the head gasket re-sealed and the engine repaired. The cost: Anywhere from $500-3,000 depending on how much damage there is."
    },
    {
      "title": "Broken engine block",
      "content": "Broken engine block An engine block is also known as a cylinder block, which makes up the bottom end of a motor where pistons are fired. If a cylinder is cracked, coolant can leak into the engine and burn away. This will cause white smoke. [3] X Research source Can you drive with this? No. It’s likely your car won’t even run if the engine block is bad. Additional symptoms: The car runs hot, the engine stalls, you hear loud knocking noises, the car shakes, and you get no (or little) power from your engine. The fix: There normally isn’t a repair option—your engine likely needs to be replaced. A cracked engine block is usually catastrophic for the engine. The cost: A new engine (or an engine rebuild) will run you $3,000-5,000 depending on the engine model."
    },
    {
      "title": "Crack in the cylinder head",
      "content": "Crack in the cylinder head A vehicle's cylinder head is located on top of the engine block. Along with the head gasket, the cylinder head helps seal the pistons. If the cylinder head is damaged, coolant will leak out and burn away in a white smoke. [4] X Research source Can you drive with this? No, although you can get a short distance if the engine doesn’t overheat. Additional symptoms: The engine overheats, the engine makes knocking noises, there are pools of liquid under the engine bay, and you smell something sweet. In extreme cases, the engine may run rough. The fix: A small crack can be repaired by “pinning,” which involves welding an aluminum strip on the crack. If the crack is bad though, the engine needs to be replaced. The cost: A minor repair will likely cost $800-1,500. If you need a new engine, expect to pay $3,000-5,000."
    },
    {
      "title": "Damaged coolant reservoir tank",
      "content": "Damaged coolant reservoir tank The coolant reservoir tank houses your coolant. If you have a crack or leak in the reservoir tank, coolant will burn off in the engine bay. [5] X Research source Can you drive with this? So long as the coolant levels don’t drop dramatically, yes. If the engine overheats though, pull over. Additional symptoms: You have to replenish your coolant constantly, your engine overheats, you smell something sweet, and you see puddles under your engine bay. The fix: The coolant tank needs to be patched or replaced. The cost: Expect to spend around $400 on a new coolant reservoir. A patch job might be a touch cheaper."
    },
    {
      "title": "Faulty fuel injector",
      "content": "Faulty fuel injector A fuel injector is the heart of a car's engine. It delivers fuel to the engine, maximizing its power and keeping it running effectively. If an injector fails and fires too much gas into a cylinder, the excess gas may burn off and create smoke. [6] X Research source This is a common issue for diesel-powered vehicles where diesel is introduced to the cylinders at the wrong time or quantity. [7] X Research source A note on color: Faulty fuel injector smoke won’t be pure “white.” Fuel burns black, so this will be a deeper gray color most of the time. Can you drive with this? No, this is a fire hazard. If you smell gas and see smoke, do not drive. Additional symptoms: A gas aroma will be the biggest clue here. You may also notice poor engine performance and a check engine light. The fix: The fuel injector needs to be replaced. See a mechanic to have them swap the faulty injector out. The cost: You’re likely going to pay $300-900 depending on how difficult the injector is to remove."
    },
    {
      "title": "Black smoke: gasoline",
      "content": "Black smoke: gasoline If your vehicle is producing thick black smoke, this means the air and fuel ratio is too rich with fuel. This is often a result of a faulty fuel pressure regulator, a leaking fuel injector, or a faulty oxygen (O2) sensor. If this happens, your check engine light will appear on your dashboard. Bring your car to your mechanic or dealership to address the issue. [8] X Research source Is this dangerous? Yes. Fuel leaks are a potential fire hazard, so do not drive if your engine is leaking or burning off excess fuel. The cost: Generally, a fuel pressure regulator can cost between $266 to $344. A fuel injector replacement costs up to $2,500, and a new oxygen sensor costs up to $500. [9] X Research source"
    },
    {
      "title": "Blue smoke: engine oil",
      "content": "Blue smoke: engine oil Generally, blue or grey exhaust smoke indicates that your engine is burning oil. If this happens, your vehicle is likely leaking oil due to old or worn valve seals and piston rings. You may notice that you have to change your oil more often. Be sure to check the oil level using the dipstick and look for any debris that may be mixed in. Is this dangerous? Yes. Like gasoline, oil is combustible. If your car is leaking or burning off excess oil, your car could potentially catch fire. The cost: Worn valve seal replacements can cost up to $250. Piston ring replacements can cost up to $3,500, depending on your vehicle’s model and engine type. [10] X Research source"
    }
  ]
}