{
  "url": "https://www.wikihow.com/Talk-in-Discord",
  "title": "How to Talk in Discord With Voice and Video Chat",
  "steps": [
    {
      "title": "Enable microphone and camera permissions on your device.",
      "content": "Enable microphone and camera permissions on your device. To join Discord voice and video, you'll need to give permission. By default, this should already be enabled. If it isn't, do the following: Android : Open Settings → Apps → Discord → Permissions → Camera → Allow . Go back and tap Microphone → Allow . [1] X Research source iPhone or iPad : Open Settings → Discord → toggle on Microphone and Camera ."
    },
    {
      "title": "Open the Discord app.",
      "content": "Open the Discord app. This looks like Discord's mascot, Wumpus, with a blue-purple background. If you aren't already logged in, enter your email address and password to do so now. Discord is available for iOS in the App Store and for Android in the Google Play Store ."
    },
    {
      "title": "Navigate to a server or Direct Message.",
      "content": "Navigate to a server or Direct Message. Tap a server from the left panel, or tap a recent Direct Message to open it. You can join a voice channel in a server or start a voice call with an individual user or group."
    },
    {
      "title": "Tap a voice channel and tap Join Voice.",
      "content": "Tap a voice channel and tap Join Voice . This is represented by a volume icon on the left side of the channel name. You'll see all users currently in the voice channel listed underneath it. If you're in a Direct Message, tap the phone icon at the top. This will start a voice call. You can also tap the video camera icon to start a video call."
    },
    {
      "title": "Start talking.",
      "content": "Start talking. You can tap the voice channel to open the voice settings. This will display all users in a grid. If you're muted, tap the microphone icon to unmute yourself. To see more voice options, tap and drag the bottom menu upwards. To leave a voice channel, tap the red phone icon at the bottom of the screen."
    },
    {
      "title": "Open the Discord application.",
      "content": "Open the Discord application. Discord is available for Windows, Mac, and Linux. [2] X Research source You can also use Discord in your browser at https://discord.com/ ."
    },
    {
      "title": "Check your Voice & Video settings.",
      "content": "Check your Voice & Video settings. To ensure your voice or video calls go smoothly, double-check your input and output devices. [3] X Research source Do the following: Click the cog icon at the bottom-left corner. In the left panel, scroll down and click Voice & Video . Click the drop-down menu for Input Device and select your microphone. Click the drop-down menu for Output Device and select your speakers or headset. Under Input Mode , select Voice Activity to automatically transmit your voice or Push to Talk to transmit your voice after pressing a specified key. Click X or press Esc to exit this menu."
    },
    {
      "title": "Navigate to a server or Direct Message.",
      "content": "Navigate to a server or Direct Message. Click a server from the left panel, or click a recent Direct Message to open it. You can join a voice channel in a server or start a voice call with an individual user or group."
    },
    {
      "title": "Join a voice channel.",
      "content": "Join a voice channel. This is represented by a volume icon on the left side of the channel name. Clicking a voice channel will join it immediately. You'll see all users currently in the voice channel listed underneath it. If you're in a Direct Message, click the phone icon at the top. This will start a voice call. You can also click the video camera icon to start a video call."
    },
    {
      "title": "Start talking.",
      "content": "Start talking. You can click the voice channel to open the voice settings. This will display all users in a grid. If you're muted, click the microphone icon to unmute yourself. If other users still can't hear you, check your computer's microphone privacy settings. This must be enabled for your input and output devices. To leave a voice channel, click the red phone icon at the bottom of the screen."
    }
  ]
}