{
  "url": "https://www.wikihow.com/Write-a-Mental-Health-Assessment",
  "title": "How to Write a Mental Health Assessment",
  "steps": [
    {
      "title": "Gather background information from the patient.",
      "content": "Gather background information from the patient. Background information will help you to establish context for your assessment. Put the patient at ease so that the interview will be fruitful and informative. Maintain eye contact and make small talk so that the patient will be comfortable in providing the information you require for the assessment. [1] X Research source Some of the information will be basic, such as the patient's age, gender, and ethnicity. Some information will more telling in terms of what it reveals about the patient."
    },
    {
      "title": "Record the patient's medical history.",
      "content": "Record the patient's medical history. Check all the boxes on the assessment that apply. Annotate wherever additional description is required. Include current medications (prescription and over-the-counter). [2] X Research source Note the patient's substance abuse history. List all psychiatric drugs the client is currently taking. Keep in mind that sometimes physical conditions can mimic psychiatric illnesses. For instance, if a patient has uncontrolled asthma as well as anxiety, the asthma might actually be provoking the anxiety. [3] X Research source Padam Bhatia, MD. Psychiatrist. Personal interview. 12 May 2020."
    },
    {
      "title": "Record the patient's mental health history.",
      "content": "Record the patient's mental health history. Encourage the patient to provide a narrative using their own words. The story they provide enables them to describe associated social circumstances and emotional reactions that might not, otherwise, be revealed. [4] X Research source Keep in mind that asking questions about a patient's mental health history may seem very personal to them. Try to give off a calm, open demeanor so they'll feel comfortable discussing this with you. [5] X Research source Padam Bhatia, MD. Psychiatrist. Personal interview. 12 May 2020. Indicate previous assessments,dates of diagnoses, referrals and responses to treatments. [6] X Research source Include details that refer to the onset of the presenting problem, symptoms, previous treatments and providers. Reader Poll: We asked 402 wikiHow readers who've worked with mental health patients, and 46% of them agreed that the best way to make them feel at ease is by practicing active listening. [Take Poll]"
    },
    {
      "title": "Record cultural factors on the assessment paper.",
      "content": "Record cultural factors on the assessment paper. For this portion of the assessment you should include ethnicity, immigration, language, religion, sexual orientation. Make note of the impact of cultural factors on the patient's behavior."
    },
    {
      "title": "Complete a narrative summary of your findings.",
      "content": "Complete a narrative summary of your findings. This is an expansive written interpretation of the information collected and how all of the elements recorded contribute to the patient's presenting problem. Recognize that every component of the patient's history is significant and will impact the patient's treatment, from the patient's chief complaint to the patient's family history. [7] X Research source"
    },
    {
      "title": "Describe the patient's presenting mental health problem.",
      "content": "Describe the patient's presenting mental health problem. Include current symptoms and behavior. Include a description of the onset of the presenting problem, its duration and intensity. [8] X Research source Look for non-verbal clues from the client such as an inability to make eye contact and nervousness. Observe and note the patient's hygiene, cleanliness, choice of clothing, behavior, mood and physical abnormalities. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Assess the patient's psychosocial history.",
      "content": "Assess the patient's psychosocial history. Include birth, childhood, family history and social relationships. Describe the patient's family history and current relationships. Indicate the patient's medical history and current status. Example \"Jim is HIV positive and has been for three years, with a T-cell count within the normal range.\" Address a wide-ranging list contributing factors from the patient's support system to education and employment. Note the patient's strengths and weaknesses. Does the patient seem willing to work on the presenting problems? Will the patient work with a support system in place? Does the patient have medical issues or financial problems that might prevent them from completing treatment? [10] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "Assess risk factors for the patient.",
      "content": "Assess risk factors for the patient. Provide detailed information that offers an assessment of the risk factors as determined by information gathered during the interview. Examples of risk factors: Suicidal, homicidal, homelessness, trauma, neglect, abuse, domestic violence."
    },
    {
      "title": "Complete the Mental Status Exam checking all boxes that apply.",
      "content": "Complete the Mental Status Exam checking all boxes that apply. This will include thought content (obsessive, hallucinations, delusions), affect, mood and orientation. Your comments and descriptions will be required. Example: Behavior: \"Appropriate,\" \"Inappropriate,\" and follow with a description of the behavior. [11] X Research source"
    },
    {
      "title": "Complete the Medical Necessity Criteria.",
      "content": "Complete the Medical Necessity Criteria. In this section of the assessment, you will need to describe the patient's impairments. The categories include health,daily activities, social relationships and living arrangements. They'll require detailed descriptions if selected."
    },
    {
      "title": "Employ a multidimensional approach in diagnosing the patient.",
      "content": "Employ a multidimensional approach in diagnosing the patient. The Diagnostic and Statistical Manual of Mental Disorders is used to categorize psychiatric diagnoses. However, the format is changing. The new format begins with the \"principal diagnosis\" and this condition should be followed by the phrase \"principal diagnosis\" or \"reason for visit.\" [12] X Research source Insurance companies may still require the old method, which assesses five dimensions (Axis). Include a diagnosis for each axis: Axis I: Primary presenting problem (such as major depressive disorder or bipolar disorder). Axis II: Personality disorder (ex: borderline personality disorder) or intellectual disability Axis III: Medical problems (only MDs can diagnose these) Axis IV: Psychosocial and Environmental Problems Axis V: Global assessment of functioning (GAF) is a numerical rating on a scale of 0 - 100 of the client's current functioning with the life stressors he or she presents with. A GAF score of 91-100 means the patient is high functioning and easily managing the stressors in his or her life. A GAF score of 1-10 indicates that the patient is a danger to himself and/or others."
    },
    {
      "title": "Recommend treatment for the patient.",
      "content": "Recommend treatment for the patient. Your recommendations should be based on your narrative summary and assessment. Your treatment goals must be measurable with specific time frames for completion. [13] X Research source Part of an assessment involves trying to determine what the patient sees as the ideal outcome from treatment. For instance, some patients might want to pursue only therapy, others might want only medicine, and still others might prefer a combination of the two. You have to try the get the patient to where they want to be in a way that's still clinically appropriate. [14] X Research source Padam Bhatia, MD. Psychiatrist. Personal interview. 12 May 2020. Compile a list of treatment goals. Examples:reducing risk factors, decreasing functional impairment. [15] X Research source Indicate planned preventions with patient participation. Examples would be anger management, parent training, problem solving. [16] X Research source"
    },
    {
      "title": "Finish by documenting the patient's understanding of the treatment.",
      "content": "Finish by documenting the patient's understanding of the treatment. Your assessment should conclude with a statement about the patient's understanding of the course of treatment and its goals. This portion of the assessment shows that the patient is aware of the decided course of treatment and is willing to work with it. [17] X Research source Patients report better outcomes to their treatment when they're in agreement with their practitioners about the course of treatment. [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Ensure effective interventions by implementing a negotiations process between patient and mental health care provider. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    }
  ]
}