{
  "url": "https://www.wikihow.com/Shuffle-(Dance-Move)",
  "title": "How to Shuffle Dance: A Quick & Easy Guide for Beginners",
  "steps": [
    {
      "title": "Stand with your left foot about 1 foot (30 cm) in front of your right.",
      "content": "Stand with your left foot about 1 foot (30 cm) in front of your right. To start the running man shuffle, position your left leg slightly forward, with your left foot flat on the floor. Raise your right heel off of the ground, and lightly rest on the tips of your toes (on the right foot). Aim to shuffle on a hard floor so there isn’t too much resistance when you slide and alternate between feet, and wear socks or flexible sneakers that are comfortable. If you’re a beginner, place 3 pieces of tape on the ground to act as a guide while you’re shuffling. Position the tape so there’s about 1 foot (30 cm) of space between each piece, placing your left foot on the top piece and your right foot on the bottom piece."
    },
    {
      "title": "Raise your right knee to waist level, then hop to bring your left foot to center.",
      "content": "Raise your right knee to waist level, then hop to bring your left foot to center. Move your right foot off the floor until your knee is waist level. As you raise your knee, lightly hop to bring your left foot in toward your body so that it’s directly underneath you (instead of slightly forward). [2] X Research source When you raise your right knee, keep your right foot parallel to the floor so it’s easier to switch feet in the following steps."
    },
    {
      "title": "Bring your right foot down, then hop to slide your left foot back.",
      "content": "Bring your right foot down, then hop to slide your left foot back. While your right foot is lifted in the air, lightly hop and slide your left foot a few inches behind you. Use the ball of your foot for a smooth slide, and keep your left heel off the ground so it’s easy to alternate between feet as you shuffle. At the same time, bring your right foot to the floor, stepping out a few inches forward so your right foot is flat on the floor. [3] X Research source This position should be the same as the first position you made, but with the opposite leg in front of you. When you slide your left foot back, distribute your weight so most of it is on the right side."
    },
    {
      "title": "Lift your left knee to waist level, then hop to bring your right foot to center.",
      "content": "Lift your left knee to waist level, then hop to bring your right foot to center. Now, you’re just repeating the same motion with alternate legs. Raise your left foot off the floor until your left knee is waist level. As you lift your knee up, lightly hop to bring your right foot in toward your body so it is directly underneath you (instead of forward). [4] X Research source"
    },
    {
      "title": "Lower your left foot and drag your right foot behind you.",
      "content": "Lower your left foot and drag your right foot behind you. When your left knee is lifted off the floor, lightly hop and slide your right foot back, dragging it a few inches behind you. Simultaneously, bring your left foot to the ground, placing it about 0.5 feet (15 cm) in front of you. [5] X Research source Keep most of your weight on your left side as you bring your left foot to the floor."
    },
    {
      "title": "Continue alternating feet to perform the running man shuffle.",
      "content": "Continue alternating feet to perform the running man shuffle. Keep lifting one knee up while slightly hopping to slide the opposite foot behind you. To make your running man look smoother, practice hopping on your toes and the balls of the feet, and repeat the movements until you’re more comfortable shifting your weight quickly. [6] X Expert Source Dariusz Horvath-Krol Professional Ballroom Dancer & Dance Instructor Expert Interview. 13 September 2021. Dance in front of a mirror or record yourself shuffling so you can have a better idea of what you can improve on. Practice shuffling with slower BPM tracks, like house music, to get the hang of things and find your groove."
    },
    {
      "title": "Stand with your feet together and your toes turned out to the sides.",
      "content": "Stand with your feet together and your toes turned out to the sides. To begin the T-step, position your feet in a “V” shape, leaving about 1 foot (30 cm) of space between your feet and pointing your toes outwards. In ballet, this starting position for the T-step is known as “third position.”"
    },
    {
      "title": "Pick your right foot up while you shuffle your left foot inward.",
      "content": "Pick your right foot up while you shuffle your left foot inward. Lift your right foot about 0.5 feet (15 cm) off the ground, drawing your knee up toward your hip. As you raise your right foot, keep all of your weight on your left heel, and rotate your left foot in so your toes are facing forward. [7] X Expert Source Dariusz Horvath-Krol Professional Ballroom Dancer & Dance Instructor Expert Interview. 13 September 2021. Since this shuffle involves fast movements, you don’t have to keep your left foot firmly planted on the ground like the running man."
    },
    {
      "title": "Place your right foot down while shuffling your left foot outward.",
      "content": "Place your right foot down while shuffling your left foot outward. Point your right foot down and out to the right side of your body, just until your toes touch the ground. At the same time, push off the back of your left heel and rotate your left foot back to your starting position, with your toes pointed outward. [8] X Research source Keep your right toes slightly pointed as you lift them on and off the ground. To make your T-step look effortless, practice rotating your heel inward and outward so you can speed up your shuffle. [9] X Expert Source Dariusz Horvath-Krol Professional Ballroom Dancer & Dance Instructor Expert Interview. 13 September 2021."
    },
    {
      "title": "Shuffle at least 5 times on the right foot before switching to the left.",
      "content": "Shuffle at least 5 times on the right foot before switching to the left. Once you've taken at least 5 steps to the right, switch to the left side. As your right foot hits the ground for the last time, shift your weight to the right side to switch your “shuffling” foot. Press your right heel into the ground, then move your toes inward and outward, tapping your left foot down and out to the left side of your body. [10] X Research source Once you master this technique, your right foot should lift exactly when your left foot turns inward, and your right foot should point downward when your left foot turns outward. Tip: Practice the movements of your right and left foot separately until you feel more comfortable combining them together."
    },
    {
      "title": "Continue shuffling from side to side.",
      "content": "Continue shuffling from side to side. After you've taken at least 5 steps to the left, switch back to the right, and keep on going until you've mastered the shuffle—or if you just need a water break! While the T-step is all about the footwork, have fun swinging your arms from side to side along to the beat of the music."
    },
    {
      "title": "Start with the T-step and transition to the running man.",
      "content": "Start with the T-step and transition to the running man. To truly perform the shuffle, combine the running man and the T-step. To do this, simply move to one side while doing the T-step, then switch to the running man instead of moving to the other side. Take 5 steps to the left and when you lift your left foot for the last time, turn 90 degrees forward or backward, using this foot as your lead foot for the running man. Do the running man in place, or move in a circle as you show off your skills. Then, when you plant both of your feet, choose one foot to be the lifted foot for the T-step and start doing that type of shuffle. Move back and forth between the 2 dance moves to match the beat of the music."
    },
    {
      "title": "Or, try transitioning from the running man to the T-step.",
      "content": "Or, try transitioning from the running man to the T-step. Start by doing the running man in place or in a circle, then turn your body 90 degrees to the right (or left) and start shuffling to do the T-step. Just wait until both of your feet are on the floor during the running man, and lift one of your feet to use it as your lifted leg for the T-step."
    },
    {
      "title": "Alternate between the 2 shuffles however you like.",
      "content": "Alternate between the 2 shuffles however you like. Alternate between the T-step and running man in whatever way you wish. For example, you could take 1 or 2 steps of the T-step, turn your body, then move into the running man. Or, take 2-3 steps of the running man, then switch back into the T-step. Have fun switching up your moves, and let the music guide your body. If you feel awkward at first, dance freestyle to get yourself warmed up—bob your head, snap your fingers, or clap your hands to the beat!"
    },
    {
      "title": "Throw in a spin while you’re shuffling for some extra flair.",
      "content": "Throw in a spin while you’re shuffling for some extra flair. If you want to kick your shuffle routine up a notch, add a spin while you do the running man. Just move your body in a circle while you’re shuffling in place, and keep your core tightly engaged. [11] X Research source Before busting this move out in public, practice a few times in your room so you become more comfortable (and so you don't get dizzy and run into someone)."
    },
    {
      "title": "Add in some arm movements.",
      "content": "Add in some arm movements. Although leg movements are the most important part of the shuffle, pay attention to your arms once you've mastered the footwork. Instead of leaving your arms to the sides like a robot, pump them up and down to the beat, or twist them in the opposite direction of your feet. [12] X Research source If you're doing the T-step, move your arms out whenever you plant your lifted leg, then switch and move them in when you lift your leg. For the running man, pump your arms up and down sort of like you’re working out. If you need a little inspiration, watch “Rhythm Nation” by Janet Jackson and emulate her moves."
    }
  ]
}