{
  "url": "https://www.wikihow.com/Use-Vanish",
  "title": "How to Use Vanish on Laundry & Carpet",
  "steps": [
    {
      "title": "Apply Vanish directly to the stained area.",
      "content": "Apply Vanish directly to the stained area. Pre-treating stains works best on whites or colors made from any fabric, including cotton, polyester, wool, linen, silk, and even velvet. [1] X Research source Brush off any excess dirt or debris before applying Vanish to the stain, following the instructions on the package. For Vanish powder , mix 10 grams (0.35 oz) of the powder with an equal amount of water until it forms a paste. Spread the paste over the entire stain and let it sit for up to 5 minutes For Vanish liquid cleaner , apply 2 millilitres (0.41 tsp) of the cleaner directly onto the stain and rub it in with your fingers. Leave the cleaner for up to 10 minutes. [2] X Research source Try Vanish Power Gel on tough stains. Press the applicator on the stain, squeeze the bottle, and rub it in small circles against the fabric. Let the gel sit for 5 minutes max. [3] X Research source Alternatively, use Vanish stain remover spray for an easy application. Just spray both sides of the fabric to wet the stain and let it sit for 5 minutes. [4] X Research source Avoid leaving Vanish on your clothes for longer than the time listed on the packaging because it could damage the fabric."
    },
    {
      "title": "Wash your clothes as you normally would.",
      "content": "Wash your clothes as you normally would. Immediately toss your clothes in the washing machine and set it to the cycle you’d regularly use for them. Add in standard detergent to wash out the leftover stains on your clothes. [5] X Research source If you don’t have the time to wash your clothes, thoroughly rinse out the cleaner with running water. Rub the stain with your fingers to help break it apart more. If you still notice the stain on the fabric after washing it, try applying Vanish and washing your clothes again. It may take multiple times for old, stubborn stains. Avoid putting your clothes in the dryer if you still notice stains because heat can set stains in fabric."
    },
    {
      "title": "Put your clothes in a container with warm water and Vanish.",
      "content": "Put your clothes in a container with warm water and Vanish. Soaking works best for stubborn stains that have already dried. It works on any color and any type of fabric, like cotton, polyester, wool, silk, and linen. [6] X Research source For Vanish powder , fill a large container or tub mix 4 litres (1.1 US gal) of warm water and 60 grams (2.1 oz) of Vanish powder. Then, submerge your clothes in the container. [7] X Research source For Vanish liquid cleaner , pour 100 millilitres (0.42 c) of the cleaner onto your clothes and rub it into the stains. Then, place them in a container with 4 litres (1.1 US gal) of warm water. Test Vanish on an inconspicuous spot of each garment to make sure the colors don’t run or bleed. If they do, keep them in a container separate from other clothes. Avoid soaking garments that have protective coatings or metal fasteners because the cleaner could damage them."
    },
    {
      "title": "Soak your clothes for 1–6 hours.",
      "content": "Soak your clothes for 1–6 hours. Let colored clothes soak for up to 1 hour. Leave white clothes to soak for up to 6 hours. Once your clothes finish soaking, rub the stain between your fingers to help remove it even more. [8] X Research source"
    },
    {
      "title": "Wash your clothes as normal.",
      "content": "Wash your clothes as normal. Toss the stained fabrics into your washing machine as soon as they finish soaking. Use your standard detergent and the cycle recommended on the garment’s care tag to fully wash out the stain. [9] X Research source If you can’t wash your clothes right away, rinse out the Vanish with clean water. If you still see the stain after washing your clothes, soak and wash your clothes again. It may take a few tries to remove the oldest, most stubborn stains. Avoid tossing stained garments in the dryer because the heat might set the stain."
    },
    {
      "title": "Add a dose of Vanish to regular loads to get cleaner clothes.",
      "content": "Add a dose of Vanish to regular loads to get cleaner clothes. If you want extra stain-fighting power to keep your clothes looking their best, just add Vanish to your washing machine with your regular detergent. Use 50–100 millilitres (3.4–6.8 US tbsp) of liquid Vanish or 30–60 grams (1.1–2.1 oz) of powder cleaner with each load. [10] X Research source"
    },
    {
      "title": "Vacuum your carpet.",
      "content": "Vacuum your carpet. If the stain is still wet, blot up as much as you can with a clean towel. Run a vacuum over the stained area to pick up any dirt or debris that is left in the carpet. [11] X Research source"
    },
    {
      "title": "Apply the Vanish cleaner directly onto the stained section.",
      "content": "Apply the Vanish cleaner directly onto the stained section. There are multiple carpet-cleaning products from Vanish, and how you apply them depends on the type you’re using. For Vanish Vacuum Powder , shake the bag to evenly cover the stained area of your carpet. Work the powder into your carpet with a soft-bristled brush and let it sit for about 20 minutes. [12] X Research source For Vanish Vacuum Up Foam , dispense the foam over the stain and let it dry for about 2 hours. [13] X Research source To use Vanish Manual Shampoo , combine 1 part shampoo with 9 parts water to create a foam. Spread it evenly over the stain and leave it to dry. [14] X Research source To use Vanish Carpet Spray , apply it directly onto the stain until it’s completely coated. Let the spray sit for about 5 minutes. [15] X Research source"
    },
    {
      "title": "Blot or vacuum the cleaner out of your carpet.",
      "content": "Blot or vacuum the cleaner out of your carpet. If you applied stain remover spray, use a clean towel to blot up the cleaner and the stain. [16] X Research source For Vanish powder, foam, or shampoo, just vacuum up any leftover residue. [17] X Research source If you still notice a stain, try applying Vanish again. Older stains may take multiple tries to completely lighten them."
    }
  ]
}