{
  "url": "https://www.wikihow.com/Twirl-a-Baton",
  "title": "How to Twirl a Baton",
  "steps": [
    {
      "title": "Learn baton terminology.",
      "content": "Learn baton terminology. A baton has three parts: the ball, shaft, and tip. The ball is the bigger end of the baton. The shaft is the baton’s metal or plastic middle section. The tip is the baton’s smaller end. These three terms are frequently used to describe hand position and twirls."
    },
    {
      "title": "Select a baton that is the correct size for your height and wingspan.",
      "content": "Select a baton that is the correct size for your height and wingspan. When choosing a baton, it is very important that you select the correct size. Using a baton that is the wrong size, increases your risk of slip-ups and injuries. Stand straight and extend one arm in front of yourself parallel to the floor. Ask a friend to measure from the base of your neck to the tip of your middle finger. Purchase a baton that is made for a person with your measurement. If you are unusually small or tall, remove or add 1 to 2 inches to the measurement. If you are in between sizes, purchase the next size up. Batons come in 1 inch increments."
    },
    {
      "title": "Learn to hold a baton.",
      "content": "Learn to hold a baton. Before you can twirl a baton, you must learn how to hold one. Stand straight with your dominant arm along your side. Wrap your four fingers around the center of the baton’s shaft—the ball should be in front of you. Place your thumb along the top of the shaft—it should point towards the ball. Raise your arm 45° with your palm facing up. The shaft should be parallel to the floor. [1] X Research source Style, Susan. <i>Baton Twirling Master: Baton Twirler - Step by Step Moves &amp; Instructions</i>. Occasionally, a specific twirl may require that you hold the baton with your thumb facing the tip."
    },
    {
      "title": "Assume the correct stance for the right hand horizontal twirl.",
      "content": "Assume the correct stance for the right hand horizontal twirl. Horizontal twirls are flat, one handed spins in which the ball moves over the arm as the tip moves underneath. Stand tall with your feet in a Right T. Hold the baton in your right hand with your thumb pointing towards the ball."
    },
    {
      "title": "Rotate the baton counterclockwise.",
      "content": "Rotate the baton counterclockwise. Begin with the baton parallel to the ground. Point the ball towards the left. As you rotate the baton so that the ball points directly away from you, bring the tip underneath your forearm. Point the ball to the right. As you rotate the baton so that the ball points directly at you, bring the ball over your arm. Complete the horizontal circle—point the ball to the left. [2] X Research source"
    },
    {
      "title": "Speed up the rotation and adjust your hold.",
      "content": "Speed up the rotation and adjust your hold. Once you have mastered the pattern, speed up the twirl and adjust your hold on the baton. Pinch the baton between your thumb and index finger. Use your remaining fingers—your middle, ring, and pinky fingers—to turn the baton. As you speed up the twirl, keep your wrist loose. [3] X Research source"
    },
    {
      "title": "Practice the left hand horizontal twirl.",
      "content": "Practice the left hand horizontal twirl. As a baton twirler, you must be able to execute moves with your dominant and non-dominant hand. The left horizontal twirl follows the same pattern as the right horizontal twirl. [4] X Research source Although it may feel more natural to rotate the baton in the opposite direction (front, right, back, left), you must execute the move with a counterclockwise rotation."
    },
    {
      "title": "Pass the baton from your right to left hand while executing a horizontal twirl.",
      "content": "Pass the baton from your right to left hand while executing a horizontal twirl. Test your horizontal twirling skills by passing the horizontally twirling baton from hand to hand. Place the baton in your right hand and begin to twirl it horizontally. Carefully move your left hand towards the center of the shaft and encircle the baton with your left hand’s thumb and pointer finger. As the left hand gains control of the baton, continue to execute the horizontal twirl. Make sure the baton continues to rotate in a counterclockwise direction. [5] X Research source Style, Susan. <i>Baton Twirling Master: Baton Twirler - Step by Step Moves &amp; Instructions.</i> The baton should remain horizontal the entire time."
    },
    {
      "title": "Get into position for the right wrist twirl.",
      "content": "Get into position for the right wrist twirl. When executing wrist twirls, also known as vertical twirls, the baton rotates up and down. The ball passes through the inside of your arm as the tip remains on the outside of your arm. Before you can master the wrist twirl, you must assume the appropriate stance. Stand straight with your right arm at your side and your feet together. Place your left hand on your hip. Your four fingers should be close together and resting on the front of your hip. Hold the center of the shaft and point your thumb towards the ball. [6] X Research source"
    },
    {
      "title": "Rotate the baton clockwise.",
      "content": "Rotate the baton clockwise. Start with the baton parallel to the ground with the ball facing forward. Rotate the ball so that it is pointing at the ground; the tip should be on the outside of your arm. Continue turning the baton so that the ball is pointing behind you. Turn the baton so that ball is pointing up and is located on the inside of your arm. Complete the rotation—the baton should be parallel to the ground. [7] X Research source"
    },
    {
      "title": "Speed up the rotation and adjust your hold.",
      "content": "Speed up the rotation and adjust your hold. Once you have mastered the pattern, speed up the twirl and adjust your hold on the baton. Pinch the baton between your thumb and index finger. Use your remaining fingers to turn the baton. Keep your wrist loose. [8] X Research source"
    },
    {
      "title": "Practice the left wrist twirl.",
      "content": "Practice the left wrist twirl. Baton twirlers must be able to execute twirls with both their dominant and non-dominant hand. As you work on the right wrist twirl, devote time to mastering the left wrist twirl. The left wrist twirl follows the same pattern as the right wrist twirl. [9] X Research source"
    },
    {
      "title": "Perform a horizontal twirl with your right hand.",
      "content": "Perform a horizontal twirl with your right hand. The execution of this common spin begins with a horizontal twirl. Stand tall with your feet in a Right T. Grasp the baton with your right hand—point your thumb towards the ball. Extend your right arm and position the baton so that it is parallel to the ground. Rotate the baton counter clockwise. Keeping the shaft parallel to the ground, point the ball to the left. Turn the baton so that the ball points directly away from you and simultaneously bring the tip underneath your forearm. Point the ball to the right. While you rotate the ball towards yourself, bring the ball over your forearm. Complete the horizontal circle by rotating the ball to the left. [10] X Research source Complete 3 to 4 horizontal spins."
    },
    {
      "title": "Open up your palm and spin the baton.",
      "content": "Open up your palm and spin the baton. Throughout the horizontal twirl, the turn of your wrist causes your palm to face up and down. When the ball points left your palm is down; when the ball points right, your palm is up. Just before the ball points to the right, open your hand to create a flat, steady surface. The baton will continue to spin in a counterclockwise circle on the top of your palm and fingers. Keep your fingers flat and out of the way. As the baton slows, subtly move your palm as though it were a teeter-totter."
    },
    {
      "title": "Secure the baton in your right hand and return to the horizontal twirl.",
      "content": "Secure the baton in your right hand and return to the horizontal twirl. When the ball is just about to point to the right, close your hand around the baton. Secure the baton between your thumb and index finger. Complete another series of horizontal twirls. [11] X Research source Try the Palm Spin with your left hand!"
    },
    {
      "title": "Assume the correct starting position.",
      "content": "Assume the correct starting position. To complete the around the body twirl, you will move your twirling baton around your waist. Hold the baton in your right hand—your thumb should point towards the ball. Place your left hand on your left hip. [12] X Research source Style, Susan. <i>Baton Twirling Master: Baton Twirler - Step by Step Moves &amp; Instructions</i>."
    },
    {
      "title": "Complete a Figure 8 with your right hand.",
      "content": "Complete a Figure 8 with your right hand. Draw an “8” with the ball of the baton. Lower the ball on a downward angle towards the left side of your body. Raise the ball up towards your face in a circular motion. Once the ball reaches the center, completing the first circle, lower the ball on a downward angle towards the right side of your body. Raise the ball up towards your face in a circular motion. Pinch the baton between your thumb and index finger. Keep your wrist loose. [13] X Research source"
    },
    {
      "title": "Bring the baton behind your back and take it in your left hand.",
      "content": "Bring the baton behind your back and take it in your left hand. When the baton returns to waist height, prepare to have the baton change hands. Bring the baton behind your back—lead with the ball. Remove your left hand from your hip and reach it behind your back. Secure the baton in your left hand—your thumb will point towards the tip. Release your right hand and place it on your right hip. [14] X Research source Style, Susan. <i>Baton Twirling Master: Baton Twirler - Step by Step Moves &amp; Instructions</i>."
    },
    {
      "title": "Execute a Backwards Outside Circle with your left hand.",
      "content": "Execute a Backwards Outside Circle with your left hand. When performing a Backwards Outside Circle within an Around the Body Twirl sequence, the tip, not the ball, passes behind the elbow. The circle is executed within a vertical plane Bring the baton from behind your back to your left side. Extend your left arm to the side with your elbow bent at a 90° angle. Raise the tip towards your left shoulder. Continue the circular motion, passing the tip behind your elbow. As the tip points towards the ground, the ball points up. Complete the circular motion by bringing the ball in front of your elbow. [15] X Research source Style, Susan. <i>Baton Twirling Master: Baton Twirler - Step by Step Moves &amp; Instructions</i>."
    },
    {
      "title": "Raise the baton horizontally above your head and take it in your right hand.",
      "content": "Raise the baton horizontally above your head and take it in your right hand. As you lift the baton horizontally above your head, lead with the tip. Make sure to raise your arm high. Raise your right hand and take the baton—your thumb will point towards the ball. [16] X Research source Style, Susan. <i>Baton Twirling Master: Baton Twirler - Step by Step Moves &amp; Instructions</i>."
    },
    {
      "title": "Return the baton to its original position and repeat.",
      "content": "Return the baton to its original position and repeat. Lower the baton so that it is parallel to your left side—keep the baton vertical. The ball will point up, while the tip points down. Repeat the sequence. [17] X Research source Style, Susan. <i>Baton Twirling Master: Baton Twirler - Step by Step Moves &amp; Instructions</i>."
    }
  ]
}