{
  "url": "https://www.wikihow.com/Use-Anything-As-a-Stylus-on-a-Samsung-Galaxy",
  "title": "How to Use Anything As a Stylus on a Samsung Galaxy",
  "steps": [
    {
      "title": "Find something long and thin.",
      "content": "Find something long and thin. When trying to find a substitute for a stylus, you’d probably need to look for something that can give the same feel as a real stylus can. For this, you’ll need to get something long and thin. The best item for this would be an empty pen case, but you can use absolutely any item you have in mind—yes, even a stick can do the trick."
    },
    {
      "title": "Grab some cotton.",
      "content": "Grab some cotton. Take a small piece of cotton and attach it to the tip of the item you’re going to use as a stylus. If you don’t have any cotton, you can use a tissue or a piece of cloth—any item that can hold or absorb water."
    },
    {
      "title": "Measure about a teaspoon of water.",
      "content": "Measure about a teaspoon of water."
    },
    {
      "title": "Dip your stylus in the water.",
      "content": "Dip your stylus in the water. You don’t need to submerge the entire stylus, just have the end with a cotton touch the water, enough for the cotton to be moist."
    },
    {
      "title": "Test your stylus.",
      "content": "Test your stylus. Drag the tip of your new stylus (the one with a cotton attached) across the screen of the Samsung Galaxy, and you’ll notice it reacting to your gestures. Android touchscreen devices react to electro-conductive materials like organic stuff such as our fingers or water. So, the device will react to a tip of a pencil only when it’s wet. The cotton at the tip helps to hold water and allows your stylus to be used for longer periods. It also prevents the item you’re using as a stylus from scratching the screen of your Samsung Galaxy."
    },
    {
      "title": "Re-moisten your stylus.",
      "content": "Re-moisten your stylus. When the improvised stylus starts to dry and lose its traction, simply dip the cotton tip in water again to keep it conductive."
    }
  ]
}