{
  "url": "https://www.wikihow.com/Use-the-World-of-Warcraft-Armory",
  "title": "How to Use the World of Warcraft Armory",
  "steps": [
    {
      "title": "Log into the Battle.net website.",
      "content": "Log into the Battle.net website. It's the easiest way to load your own armory. To log in, go to http://us.battle.net/wow/en/ ."
    },
    {
      "title": "Look for your character's name and picture.",
      "content": "Look for your character's name and picture. Once you are logged in, you should see your character's name and picture near the top right. You can click on your character's name and then on “Profile,” and it will take you to your armory. Alternatively, if you just click on the picture of your character, that will also take you to your armory. If you do not want to log in, you can still view a character's armory, but you need to know his name and realm. To find a character in the armory, search for him on Battle.net by putting his name in the search box at the top right of the World of Warcraft home page ( http://us.battle.net/wow/en/ ). Once you have put his name in the search box, click on the magnifying glass on the right to do a search. You should see a list of links on the left under Summary with one link called “Characters.” When you click on “Characters,” it will display a list of all characters with the name you have searched. It will also show other basic info about the characters, such as level, guild, and realm. To access the armory of any character, click on his name."
    },
    {
      "title": "View a particular character's armory.",
      "content": "View a particular character's armory. The first thing you will notice on the top left of a character's armory is his name, title , level, race, class, and realm. Right beneath that, you will also see the character's achievement points. You should double-check this info to make sure you are viewing the right character's armory."
    },
    {
      "title": "Check out the character's gear.",
      "content": "Check out the character's gear. When you are at the armory, you will be able to see all of the gear that a character currently has equipped. If you move your mouse over a piece of gear, a small window will pop up with more info on that piece of gear so you can get full information on all of its stats. This is useful to see if you are missing any gems or enchantments on your gear."
    },
    {
      "title": "Inspect the character's stats, talents, and glyphs.",
      "content": "Inspect the character's stats, talents, and glyphs. Directly beneath Gear are two sections. On the left section, you will see a character's stats, and on the right section, you can see his talents and glyphs. You can move your mouse over any part of this section, and a small window will pop up on your screen with more information on how the attribute affects them. Let's say that you are viewing a Fury Warrior's armory. If you move your mouse over Mastery, a small window would pop up saying something along the line of “Increases physical damage done while Enraged by 5.23%.” The exact percent would depend on his mastery, but this information would tell you how he is affected by the stat. Only core stats are shown on the armory by default, although you can look at all stats by clicking on the button with the text “Show all stats.” To the right of character stats is a section labeled “Talents.” This section covers not just his talents, but also his glyphs. Talents are class-specific abilities that you can choose from every 15 levels. In other words, level 15 characters can pick one talent out of three possible talents for their first talent, and then when they reach level 30, they are able to pick one of three possible talents for their second talent. By the time a character reaches level 90, they will have six talents (out of 18 possible choices). For more information on talents, you can look through the talent calculator. The link is right on the armory under the Talents section. You will also see Major Glyphs and Minor Glyphs in the Talents section of the armory. Major glyphs enhance a character's abilities (for example, a major glyph could increase the damage or healing of one of your abilities). Minor glyphs generally don't provide much actual benefit for your character—they are usually cosmetic. You can move your mouse over a glyph in the armory, and it will pop up a small window with a description of what the glyph does."
    },
    {
      "title": "Examine other pertinent information.",
      "content": "Examine other pertinent information. Further below Talents, you can find more detailed information including player vs. player ratings, challenge mode score, professions, pets, and recent activity. You can click on any of these sections to find out even more about the character. For example, you could be viewing a character's armory and see under the Professions section that he has 600 in Blacksmithing. If you click on Blacksmithing, it will take you to another page where you can see which Blacksmithing items he's capable of crafting, and which items he hasn't yet learned how to craft."
    },
    {
      "title": "Scrutinize “Raid Progression.",
      "content": "Scrutinize “Raid Progression. ” Finally, at the bottom of a character's armory is a section called “Raid Progression.” In this section, you can see which raids the character has been to and what he has killed in those raids. You will also see a list of all raids in the game, even if the character whose armory you are viewing hasn't been there. Similar to most other sections of the armory, a small pop-up window will appear with more information if you move your mouse over an image of a raid."
    },
    {
      "title": "View specific, detailed information.",
      "content": "View specific, detailed information. On the main page of a character's armory, there is a list of links to view specific detailed information such as achievements, pets and mounts, challenge mode times, and recent activity. There are also links to trade on the Auction House with your in-game and respond to event invitations, but you must be logged in as your character to use those links. When you click on Achievements, you will reach a nicely organized page with the number of achievements the character has completed in each achievement category. To take a look at the specific achievements you can go a step further and click on a category to see which achievements they have completed. For example, if the person you are viewing has completed 73 out of 196 possible achievements in the Quests category, you will see that under the section titled “Progress Overview.” To see which 73 Quest achievements he has completed, click on “Quests” in the list of links to the left. The achievements the character has completed are listed from the top of the page by the date they were earned. You can see the date the achievement was earned on the right of the achievement. At the end of all completed achievements, you will see unfinished achievements below, in faded text with no completion date. The armory can also be used to find out which pets and mounts a character owns. To view pets and mounts, click on the Pets and Mounts link on the main page of a character's armory. If you are on another section, such as the Achievement section, you will have to click on Summary to return to the main page. Once you have clicked on the Pets and Mounts link, you will at first see the three battle pets the character has set in his active pet slots. Beneath that is a section with his pet collection. If you move your mouse over the image of a pet, a small pop-up window will appear on your page with more information about that pet. To view all of the mounts in a character's armory, you will first have to be on the Pets and Mounts section. At the top of the Pets and Mounts page, there are two tabs. The first is labeled “Pet Journal,” and the second is “Mounts.” Click on Mounts to be taken to a page with all of the mounts that character has collected. If you move your mouse over the image of a mount, a small pop-up window will appear on your page with more information about that mount (such as whether it is a flying mount or a ground mount). You can also find out where to obtain a mount by moving your mouse over the name of the mount, and a small pop-up window will appear with information about the source of the mount. For example, if you were viewing someone's mount collection, and saw that he has a Cenarion War Hippogryph, you can move your mouse over the Cenarion War Hippogryph's name, and a pop-up should appear with the following information. Requires Level 70 Requires Cenarion Expedition - Exalted Requires Artisan Riding Faction: Cenarion Expedition Vendor: Fedryen Swiftspear Zone: Zangarmash Cost: 2,000 Gold The information will tell you that to in order to obtain a Cenarion War Hippogryph, you must be level 70, you must have an exalted reputation with the Cenarion Expedition, and you also must have learned Artisan Riding. If you want to acquire the Cenarion War Hippogryph, find it from the vendor Fedryen Swiftspear in Zangarmarsh, and it would cost you 2,000 gold."
    },
    {
      "title": "Log into your account.",
      "content": "Log into your account. Unlike most features on the armory, to trade at the Auction House you have to actually be logged in on your account. If you aren't yet, at the top of every page on Battle.net is a Log In link. Click on it, and you will be prompted to enter your username and password to log in. One reason for this important security feature is that trading at the Auction House uses your character's in-game gold."
    },
    {
      "title": "Access the Auction House.",
      "content": "Access the Auction House. Once you're logged in on your own armory page, you can access the Auction House. The link to the Auction House is called “Auctions,” and it is located to the left of your character, on the list of links beginning with Summary. Once you click on Auctions, you will be taken to a page with basic info about your current auctions (items you have placed at the Auction House to sell), and bids (items you have placed bids to purchase). There are also four links: Buy, Sell, Bids, and Auctions. The Bids link will take you to a list of specific information on each item that you have placed a bid on. The Auctions link will take you to a list of specific information on each item that you have placed at the Auction House to sell. If you want to place an item at the Auction House to sell through the website, click on “Sell.” It will show a list of all items in your inventory and bank box. To select an item to sell, click on it and you will be prompted to fill in the settings of your auction, such as starting bid and auction duration. You will also see a section called “Deposit Total” with an amount in gold or silver. The Deposit Total depends on the item you are placing for sale, but it will never be lower than 1 silver. You will be charged the Deposit Total simply for listing your item at the Auction House, even if your item does not sell."
    },
    {
      "title": "Browse for items.",
      "content": "Browse for items. If you want to browse the Auction House for items to purchase, click on “Buy,” and you will see a list of items that other people have placed on the Auction House for sale. You can click on “Bid” or “Buyout” to purchase the item through your armory. If there is a certain item you are looking for, you can search for it by name by filling in the field “Item Name:” at the top of the page. Note that you will only be able to see 200 items at a time."
    },
    {
      "title": "Pick up your purchased items.",
      "content": "Pick up your purchased items. After purchasing an item on the Auction House, it will be sent directly to your character through the mail system. You can pick up your item from any mailbox. Mailboxes are located in every major city and also near most inns across the world. If you have successfully sold an item at the auction, you will be able to pick up the money from the sale through the mail also. If your auction has expired without a sale, your item will be returned to you via the mail. Finally, if you have placed a bid on an item and someone else outbids you, the money you have placed to bid will be returned to you via the mail."
    },
    {
      "title": "Check out the status of your bids.",
      "content": "Check out the status of your bids. If you want to check on the status of an auction you have placed a bid on, or if you want to see if anyone has placed a bid on items you have put up for auction, you can go to the “Bids” or “Auctions” page from the links on the Auction House page of the Armory. The “Bids” page displays a list of all bids you have placed on auctions that have not ended, as well as completed auctions that you have won with the highest bid, or completed auctions you have placed a bid on but were outbid. The “Auctions” page displays a list of all your active auctions, as well as all auctions that have recently been finished whether your item has sold or not."
    },
    {
      "title": "Download the Mobile Armory app.",
      "content": "Download the Mobile Armory app. If you have an iPhone, iPod Touch ,or an Android phone, then you can also take the armory with you on the go by downloading the Mobile Armory. Download the app from Google Play if you are using Android, or directly from Battle.net at http://us.battle.net/wow/en/shop/mobile-armory/ . If you are using an iPhone or iPod, download the app from iTunes."
    },
    {
      "title": "Follow the installation steps carefully.",
      "content": "Follow the installation steps carefully. Since there are different versions of Android and iTunes, the exact steps to install the Mobile Armory may vary slightly. Basically, once you are in the Apps or Apps store section of your device, search for “World of Warcraft.” The exact title of the app is “World of Warcraft Armory,” and the author is “Blizzard Entertainment Inc.” You may be prompted for payment details or authorization, but do not worry, the app is free to use. There should be a button called “Skip,” which will let you bypass any payment details."
    },
    {
      "title": "Log in.",
      "content": "Log in. Once you have downloaded the app, log in by running the app, and put in your Battle.net username and password. If you are having problems logging in, check and make sure that Region is set to “Americas and Oceanic.” Sometimes, Battle.net routinely goes offline for server maintenance (usually scheduled on Tuesday) or other reasons. You will not be able to log in if Battle.net is offline."
    },
    {
      "title": "Select your character.",
      "content": "Select your character. After logging in, you should see several buttons, namely Auction House, Events, My Characters, Talent Calculator, Realm Status, and others. Make sure that you first go into the My Characters section to select the character you want to use. If you are checking on Realm Status, it doesn't matter which character you are logged in as, but if you are going to be placing bids or items at the Auction House, it's important to ensure that you are on the right character."
    },
    {
      "title": "Connect with your guild.",
      "content": "Connect with your guild. If you are in a guild, one of the buttons you will see in the Mobile Armory after logging in is “Guild Chat.” Tap on it, and you will be taken to a page with your guild's message of the day, and a list of all members in your guild members who are currently online. Most of the functions of the Mobile Armory are nearly identical to the web armory, though the information is a bit condensed since it's designed to be accessed through mobile device rather than a PC. Guild Chat is the one main feature that is available on the Mobile Armory but not on the web armory. You can either click on the guild message of the day to enter the regular guild channel, and view or send messages to everyone at once as you would in the game by using the /g command. If you click on a person's name, you will then be taken to a page where you can send him or her a private whisper that only the two of you will be able to see."
    }
  ]
}