{
  "url": "https://www.wikihow.com/Wire-a-Wall-Switch",
  "title": "How to Wire a Wall Switch",
  "steps": [
    {
      "title": "Pick a single-pole light switch for most applications.",
      "content": "Pick a single-pole light switch for most applications. Common applications include ceiling or hallway light switches, a cellar or attic light, a ceiling fan or chandelier, or an outdoor patio light. A single-pole wall switch usually has a lever or toggle that completes the circuit when it is flipped up to turn a light, device, or appliance on. When the toggle is flipped down, the circuit is broken, and the power goes off. Single-pole switches have 2 brass terminal screws on the side, and newly purchased switches usually have a ground wire."
    },
    {
      "title": "Turn off the electricity carefully.",
      "content": "Turn off the electricity carefully. [1] X Expert Source Daniel Stoescu Master Electrician Expert Interview. 16 August 2021. Locate your circuit breaker box and the circuit breaker specific to the switch to be wired. Turn off that circuit breaker."
    },
    {
      "title": "Confirm the electricity is off at the spot you want to install the switch.",
      "content": "Confirm the electricity is off at the spot you want to install the switch. Remove the faceplate from the switch with a screwdriver. Touch a non-contact voltage detector near each of the 2 screw terminals. If the voltage detector lights, electricity is still on, and you are at risk, so return to the circuit breaker to determine if it is off and/or if it is the correct circuit breaker. If the voltage detector does not light, the electricity is off, and you can proceed."
    },
    {
      "title": "Unscrew the top and bottom of the switch in place, and remove it gently from the box.",
      "content": "Unscrew the top and bottom of the switch in place, and remove it gently from the box. Measure the height, width, and depth of the electrical box in place to determine if your new light switch will fit."
    },
    {
      "title": "Disconnect the wires from the existing switch with a screwdriver.",
      "content": "Disconnect the wires from the existing switch with a screwdriver. Keep the wires separate; the wire from the top terminal should be positioned differently from the wire from the bottom terminal."
    },
    {
      "title": "Strip insulation away on each wire to expose 3/8 inch (0.9525 cm) of wire.",
      "content": "Strip insulation away on each wire to expose 3/8 inch (0.9525 cm) of wire."
    },
    {
      "title": "Attach the wires in the box to the appropriate terminal, top or bottom, on the new switch.",
      "content": "Attach the wires in the box to the appropriate terminal, top or bottom, on the new switch. Use needle-nose pliers to shape a loop at end of each wire. Place loops over terminals and tighten terminal screws with screwdriver."
    },
    {
      "title": "Ground the new switch.",
      "content": "Ground the new switch. Attach the ground wire to the ground post in the box. Clip a grounding clip to the bottom edge of the box if there is no grounding post."
    },
    {
      "title": "Bundle the package together in your hand, and gently insert it into the wall box without undoing any of the connections.",
      "content": "Bundle the package together in your hand, and gently insert it into the wall box without undoing any of the connections. Try to fold the wires like an accordion to avoid crowding."
    },
    {
      "title": "Screw the top and bottom of the switch body to the top and bottom of the box.",
      "content": "Screw the top and bottom of the switch body to the top and bottom of the box."
    },
    {
      "title": "Screw on the faceplate.",
      "content": "Screw on the faceplate."
    },
    {
      "title": "Restore the electricity by turning the circuit breaker back on.",
      "content": "Restore the electricity by turning the circuit breaker back on."
    },
    {
      "title": "Test the light switch.",
      "content": "Test the light switch."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}