{
  "url": "https://www.wikihow.com/Treat-Soccer-Toe",
  "title": "How to Treat Soccer Toe",
  "steps": [
    {
      "title": "Rest after the injury.",
      "content": "Rest after the injury. If you have soccer toe, the first symptoms the injured player will notice will be pain, swelling, and limited movement in the injured foot and toe. [2] X Research source It’s important for the player to rest the injured area so that the injury is not worsened and the body can begin to heal. [3] X Expert Source Mark Co, DPM Podiatrist Expert Interview. 21 April 2020. Once the player is at home resting, they should elevate the injured foot (at least while ice packs are applied), to moderate blood flow to the foot."
    },
    {
      "title": "Put ice packs on the injured toe.",
      "content": "Put ice packs on the injured toe. Ice should be applied immediately to reduce swelling in the injured area. Soccer toe is not only painful, but it also is usually accompanied by swelling. Ice will help minimize the swelling by constricting the blood vessels. Apply ice to the injured area for 15–20 minutes, several times a day. The injured player should be completely off the foot for at least 3–4 days. Use crutches if necessary. [4] X Research source"
    },
    {
      "title": "Apply a heat wrap to the injured toe.",
      "content": "Apply a heat wrap to the injured toe. After the initial ice pack, switch to a warm heat pack. The warm heat pack will dilate the blood vessels, rushing blood into the area, which promotes the healing process. After about 20 minutes, return to an ice pack to prevent swelling. Repeat the ice-heat therapy for a couple of hours. This step is optional, as the application of heat is less important than icing the injury. The application of heat to the injured toe/foot can also reduce pain. [5] X Research source"
    },
    {
      "title": "Bind or tape the injured foot.",
      "content": "Bind or tape the injured foot. Adhesive athletic tape exists for this purpose, and can be easily found in a pharmacy or athletic-equipment store. Tightly wrap the tape around the injured area of the player’s foot, but be careful not to wrap so tightly as to cause pain or restrict bloodflow. Compression is an important step when treating soccer toe; it limits further swelling and supports the injured toe and ligament, so that further strain will not be put on them. [6] X Research source If the injured player is suffering from a more severe type of turf toe, a doctor may tape the injured toe to the adjacent toe, to further restrict the injured toe’s movement. [7] X Research source"
    },
    {
      "title": "Administer an over-the-counter oral painkiller.",
      "content": "Administer an over-the-counter oral painkiller. A painkiller such as ibuprofen will reduce swelling and combat the pain that the injured player will be experiencing. If over-the-counter medications do not provide enough pain relief, or do not adequately combat the swelling, your doctor may order a prescription-strength painkiller. [8] X Research source"
    },
    {
      "title": "Wear a boot or other stiff-soled shoe after the injury.",
      "content": "Wear a boot or other stiff-soled shoe after the injury. While you’re recovering from soccer toe, it’s important to keep the ligaments behind your big toe relatively immobile during daily life. [9] X Research source Find a hard soled boot, or even a hard-soled shoe with a Morton’s Extension under the toe and ligament. This prevents the toe from bending unnecessarily until it is completely healed. It’s also common practice to tape the injured toe. This will restrict mobility and prevent the ligaments from being over-extended while healing. Taping a player’s toe can also be done before a soccer game, as a preventative measure against turf toe."
    },
    {
      "title": "Plan to spend at least three weeks recovering.",
      "content": "Plan to spend at least three weeks recovering. [10] X Expert Source Mark Co, DPM Podiatrist Expert Interview. 21 April 2020. Ligaments heal slowly, and a player can easily reinjure the area by returning to the field too quickly after sustaining an injury. Taking three weeks to recover will keep you from experiencing further pain while playing, and will let your joint capsule heal. [11] X Research source To speed up your recovery, you can try the Tennis Ball Massage: sit in a chair with a tennis ball on the ground in front of you. Place your injured foot on top of the ball, and roll your foot back and forth. Do this for 5 minutes, once or twice a day, to keep your ligaments flexible and encourage healing."
    },
    {
      "title": "Visit a doctor for a full diagnosis.",
      "content": "Visit a doctor for a full diagnosis. There are several stages of soccer toe, and the injury gets progressively worse as you move up through the stages. Only a doctor will be able to accurately diagnose the extent of the damage. [12] X Expert Source Mark Co, DPM Podiatrist Expert Interview. 21 April 2020. Turf toe is not particularly difficult to diagnose, but it’s important to find out quickly how serious your case of turf toe is. Soccer toe, type 1: The ligament that attaches the big toe to the foot and its joint capsule has been stretched too far. Soccer toe, type 2: The ligament that attaches the big toe to the foot and its joint capsule is partially torn. This will take more than the standard week to heal. This is more serious and more painful. Soccer toe, type 3: The ligament and the joint capsule have been completely torn. This is very severe, very painful and will take weeks to heal. This can wreak havoc on a player’s season because it is the kind of nagging injury that doesn’t seem to ever go away."
    },
    {
      "title": "Describe to your doctor what you felt and heard when you injured your toe.",
      "content": "Describe to your doctor what you felt and heard when you injured your toe. This will help with a proper diagnosis. An audible and painful “pop” or “crack” is usually heard and felt when a player suffers the soccer toe injury. When talking to your doctor, say something like: [13] X Research source “I was turning quickly to run for the ball, and heard a sound like a ‘snap’ from near my big toe.” “I kicked the ball wrong and hit it with my toe. It bent back too far, and I heard a sound like a crunch from my toe.” Your doctor will also likely ask for a patient medical history, to find out if the feet or toes have been injured previously (including prior cases of turf toe). [14] X Research source"
    },
    {
      "title": "Comply with your doctor’s directions for x-rays or surgery.",
      "content": "Comply with your doctor’s directions for x-rays or surgery. These are uncommon, but in severe cases of soccer toe, you may need to sit for an x-ray or have surgery performed. [15] X Research source If the doctor suspects that your toe may be broken—a more serious injury than turf toe—they will take an x-ray to examine the bone. Surgery is only performed in rare cases when the ligament has completely torn and needs to be repaired. Surgery may also be needed to remove any bone spurs that have developed from repeated injuries to the area. [16] X Research source"
    },
    {
      "title": "Wear athletic shoes that fit properly.",
      "content": "Wear athletic shoes that fit properly. [17] X Expert Source Mark Co, DPM Podiatrist Expert Interview. 21 April 2020. Soccer toe is usually caused from an ill-fitting soccer shoe: either a shoe is too small and does not absorb shocks to the player’s feet and toes, or the shoe is too large, and the player’s foot slides in the shoe, slamming the toes into the front of the shoe. Wearing an athletic shoe with a stiff sole can prevent ligament hyperextension and cushion the player’s toes from contact with the soccer ball. [18] X Research source Soft, flexible athletic shoes increase a player’s risk for turf toe, as the shoes do very little to limit the movement of the player’s big toe. [19] X Research source"
    },
    {
      "title": "Use extra caution when playing on artificial turf.",
      "content": "Use extra caution when playing on artificial turf. Artificial turf on soccer fields is made of a harder substance than grass, and consequently, players’ cleats are more likely to stick in the artificial turf. [20] X Research source This will place extra strain on the players’ feet and tendons. Even if cleats don’t stick in the turf, the added friction from the artificial turf will cause players to use more force when running and will increase the likelihood of ligament hyperextension."
    },
    {
      "title": "Avoid repeated instances of soccer toe.",
      "content": "Avoid repeated instances of soccer toe. Although a single occurrence of soccer toe is not considered medically serious, if a player contracts soccer toe multiple times, the ligaments and soft tissue in the player’s foot are at risk of serious damage. [21] X Research source Under these circumstances, turf toe can become a chronic condition, leading to joint pain and permanent loss of movement. Players who suffer from chronic turf toe are also at a higher risk for arthritis in the area."
    }
  ]
}