{
  "url": "https://www.wikihow.com/Time-Travel-in-Tomodachi-Life",
  "title": "How to Time Travel in Tomodachi Life",
  "steps": [
    {
      "title": "Enter the Town Hall.",
      "content": "Enter the Town Hall. The town hall is found between the houses and apartments on the map. It is represented by a blue icon with a picture of a building on it. Double tap on this icon, or tap on it once, then tap Enter"
    },
    {
      "title": "Select Options.",
      "content": "Select Options . This is found on the bottom right of the screen, underneath the QR Code option. It has the word \"Options\" underneath a picture of a spanner."
    },
    {
      "title": "Choose Clock Settings.",
      "content": "Choose Clock Settings . This is found on the top left of the screen, above the Island Name option, and to the right of the StreetPass/SpotPass option. It has a picture of a clock at nine o clock above the words \"Clock Settings\"."
    },
    {
      "title": "Set the date.",
      "content": "Set the date. Use the up and down arrow buttons to change the date. You can choose any date from the 1st of January 2000, to the 31st of December 2050. Use the \"up\" arrow to move the day, month, or year up, and vice versa for the \"down\" arrow. When you have chosen the date, select the orange Next button to the bottom right of the screen. You can only select existing dates. For example, the 29th of February 2019 will not be an option due to the fact it doesn't exist. Press Cancel to cancel what you're doing."
    },
    {
      "title": "Set the time.",
      "content": "Set the time. Like the date, you use the orange arrow buttons to change the time. Using the \"up\" buttons will move the time up an hour/minute and using the \"down\" buttons will move the hour/minute down. Press OK when you are satisfied. It will say \"am\" or \"pm\" at the end to show if it is morning or afternoon. To change this, change the hour. To go back to change the date, press the orange Back button on the bottom left."
    },
    {
      "title": "Select Yes.",
      "content": "Select Yes . You will get a notice saying \"Change the date/time? You may not be able to get donations at the fountain for up to 1 day after the change.\" Select either No or Yes . If you select Yes , the game will change and the new date/time will be set. Beware of the risks. While time traveling has no permanent effect, as the date and time can be changed later on, it can cause missing features for up to 24 hours. After 24 hours, things will be back to normal, with the new date and time in place. You won't get donations at the fountain the following day. You will be unable to get seasonal clothes and headgear from the Seasonal tab at the shops. [1] X Research source You will still be able to get seasonal items from the In Stock tab. Shops and markets won't get new items in the next 24 hours. [2] X Research source"
    }
  ]
}