{
  "url": "https://www.wikihow.com/Use-Nutritional-Yeast-for-Soups",
  "title": "How to Use Nutritional Yeast for Soups",
  "steps": [
    {
      "title": "Prepare it in a liquid state before putting it in the soup.",
      "content": "Prepare it in a liquid state before putting it in the soup. For every 1 cup of soup, add 1/2 cup of nutritional yeast. Both forms of nutritional yeast can be used (powdered or flaky). Keep in mind that the nutritional yeast will affect the flavour of the soup, but it is a healthier alternative to flour or other starches."
    },
    {
      "title": "Turn your stove top to medium-high heat.",
      "content": "Turn your stove top to medium-high heat."
    },
    {
      "title": "Add your 1/2 cup of nutritional yeast.",
      "content": "Add your 1/2 cup of nutritional yeast."
    },
    {
      "title": "Add 1/4 cup of water.",
      "content": "Add 1/4 cup of water."
    },
    {
      "title": "Slowly add another 1/4 cup of water.",
      "content": "Slowly add another 1/4 cup of water. Stir continuously."
    },
    {
      "title": "Pour the nutritional yeast mixture into your soup mixture once it has formed a cheesy semi-thick state.",
      "content": "Pour the nutritional yeast mixture into your soup mixture once it has formed a cheesy semi-thick state. Continue to stir."
    },
    {
      "title": "Sprinkle approximately 1 tablespoon on top of your soup once your soup has been created, .",
      "content": "Sprinkle approximately 1 tablespoon on top of your soup once your soup has been created, . The nutritional yeast will absorb the soups water and sit on the surface of the soup. You can either stir it in, eat the soup, or have it elegantly idling."
    },
    {
      "title": "Keep in mind that if you stir in the nutritional yeast, you will see flakes of it in your soup.",
      "content": "Keep in mind that if you stir in the nutritional yeast, you will see flakes of it in your soup. The nutritional yeast does not completely dissolve."
    }
  ]
}