{
  "url": "https://www.wikihow.com/Warm-Up-for-Ballet",
  "title": "How to Warm Up for Ballet",
  "steps": [
    {
      "title": "Prance around.",
      "content": "Prance around. Prancing for 3-4 minutes will help get your body ready for stretching and exercising. It will also help warm up your feet. [1] X Expert Source Geraldine Grace Johns Professional Ballerina & Ballet Instructor Expert Interview. 11 November 2020. Begin with your feet parallel to each other and alternate raising your heels slowly and gently. Avoid locking your knees while prancing. You can prance in place as well as prance forward and backward. [2] X Research source"
    },
    {
      "title": "Perform rises at the barre.",
      "content": "Perform rises at the barre. Rises will help warm up your legs, feet, and ankles. Begin at the barre with your feet parallel to each other and your ankles touching. Raise and lower your heels slowly while keeping your ankles together. [3] X Expert Source Geraldine Grace Johns Professional Ballerina & Ballet Instructor Expert Interview. 11 November 2020. Do 30 rises, 15 on each side, to get blood moving through your lower half. [4] X Research source You can also do rises with a tennis ball held between your ankles."
    },
    {
      "title": "Do jumping jacks",
      "content": "Do jumping jacks . Jumping jacks are a simple exercise that will get your blood flowing. Stand up straight with your arms by your sides and your legs shoulder-width apart. Jump so that your legs extend outward at the same time you lift your arms above your head until they are shoulder-width apart. Jump again to return to the starting position, bringing your legs back inward and your arms down to your sides. Repeat 25 times."
    },
    {
      "title": "Roll your hips.",
      "content": "Roll your hips. Lie flat on the floor with your knees bent. Extend one leg and draw your other knee toward your chest. Imagine that your knee is a marker and use it to “draw” the biggest circle you can. Focus on making the circle with you knee and allow the rest of your body to follow naturally. Start in a clockwise direction and then repeat the exercise in a counterclockwise direction. [5] X Expert Source Geraldine Grace Johns Professional Ballerina & Ballet Instructor Expert Interview. 11 November 2020. You can straighten your leg to make a bigger circle and allow your leg to open far enough that your thigh touches the ground and your opposite hip lifts off the floor. Repeat in both directions with the other leg as well. You can also warm up your hips by standing on one leg and swinging your other leg back and forth. [6] X Expert Source Geraldine Grace Johns Professional Ballerina & Ballet Instructor Expert Interview. 11 November 2020."
    },
    {
      "title": "Try a butterfly stretch",
      "content": "Try a butterfly stretch . Sit up straight and bring the soles of your feet together. Bring your heels as close to your body as you can to fully stretch your hips and groin. You can reach your arms out in front of you on the floor for a more challenging stretch. Hold the stretch for 30-60 seconds, and remember to breathe deeply. [7] X Research source"
    },
    {
      "title": "Do the splits",
      "content": "Do the splits . Sit up straight and extend and spread your legs as far as they will go. Be sure to keep your back straight. Lean over and stretch one arm to your side, holding the position for 15 seconds. Then, lean over and stretch your other arm to the other side, holding the position for 15 seconds. [8] X Research source"
    },
    {
      "title": "Perform a bridge",
      "content": "Perform a bridge . Lie on your back with your knees bent and your arms extended out beside you. Keep the palms of your hands and the soles of your feet flat on the floor, shoulder-width apart. Lift up your chest, back, hips, bottom, and thighs toward the ceiling. Keep your shoulders, hands, and feet pressed to the floor. [9] X Research source You can also extend one leg while in the bridge position and hold it for 10 seconds. Return your foot to the floor and repeat with the other leg."
    },
    {
      "title": "Roll your shoulders.",
      "content": "Roll your shoulders. Stand or sit up straight. Using a fluid motion, lift your shoulder up, back, and down. Repeat 10 times before reversing the movement. Lift your shoulder up, forward, and down. Repeat 10 times, then switch to the other side. [10] X Research source"
    },
    {
      "title": "Point and flex your feet.",
      "content": "Point and flex your feet. To stretch out and warm up your feet and ankles, sit on the ground with your legs extended out in front of you, feet together. Point your toes by pressing them toward the floor and hold the position for 5 seconds. Then, flex your feet by pulling your toes up toward your body and the hold the position for 5 seconds. Alternate between pointing and flexing 12 times. [11] X Research source"
    },
    {
      "title": "Practice ballet positions in the air.",
      "content": "Practice ballet positions in the air. Lie flat on your back and go through the five ballet positions with your legs in the air. This will stretch out your muscles and help you practice the proper form for each position. For first position, place your heels together so that your toes are pointing equally outward to each side. Concentrate on using your hips to turn your legs and feet outward. For second position, move your feet outward so they are hip-distance apart. Keep your heels pointing inward and your toes out to each side. For third position, begin in first position then move one foot in front of the other so that one of your heels lines up with the middle of your other foot. Keep your toes out to the side and your heels pointing inward. For fourth position, turn your feet out so that your heels are pointing inward, as before. Move one foot about 12 in (30.5 cm) in front of the other one, and line up the heel of one foot with the toes of the other foot. For fifth position, keep one foot in front of the other, as in fourth position. Move your front foot back until your feet are touching. Keep your heels pointing inward and your toes turned out."
    },
    {
      "title": "Start off slow to avoid injury.",
      "content": "Start off slow to avoid injury. It takes time for your blood to get moving and your muscles to get warm. Don’t immediately jump into tough stretches or serious dancing. Do some gentle movements and stretches to allow your body to warm up. Stop if anything hurts or feels too intense."
    },
    {
      "title": "Breathe deeply to get oxygen to your muscles.",
      "content": "Breathe deeply to get oxygen to your muscles. Breathing is super important when you’re stretching. Generally, you should inhale on the easier part of a stretch or exercise, and exhale on the harder part. Breathe deeply from your stomach rather than taking shallow breaths. Make sure you never hold your breath. [12] X Research source"
    },
    {
      "title": "Do static stretches at the end of your warm-up.",
      "content": "Do static stretches at the end of your warm-up. Static stretches are those that you simply hold in place to maintain flexibility and correct muscle imbalances. To ensure your blood is flowing and your muscles are warm, perform these kinds of stretches at the end of your warm-up. Get into position and hold the stretch for 10-60 seconds before moving on. [13] X Research source"
    },
    {
      "title": "Warm up for 10 to 15 minutes.",
      "content": "Warm up for 10 to 15 minutes. Students who train every day should warm up for 10-15 minutes, but if you are new to ballet, you may want to cut your warm up down to 7-8 minutes. Generally, the longer you train, the longer your warm up should be. Get your heart rate up as you warm up. If you go into class cold, you're more likely to have an injury. [14] X Expert Source Geraldine Grace Johns Professional Ballerina & Ballet Instructor Expert Interview. 11 November 2020."
    },
    {
      "title": "Cool down after class.",
      "content": "Cool down after class. It’s important to cool down after your ballet class. Walk around the room while swinging your arms and do gentle stretches, like touching your toes. You can even repeat some of the stretches and exercises you did to warm up, like prancing or doing the butterfly stretch."
    }
  ]
}