{
  "url": "https://www.wikihow.com/Treat-the-Mumps",
  "title": "How to Treat the Mumps",
  "steps": [
    {
      "title": "Keep in mind mumps is contagious before symptoms occur.",
      "content": "Keep in mind mumps is contagious before symptoms occur. The symptoms of mumps usually develop 14 to 25 days after the person is infected. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Someone who is infected with mumps is most contagious about 3 days before the facial swelling becomes evident. Be aware, in addition, that in about 1 in 3 cases, mumps doesn’t cause any noticeable symptoms in the infected person. [5] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Check for swelling of the salivary glands.",
      "content": "Check for swelling of the salivary glands. The most common symptom of mumps is swollen parotid glands, commonly called “hamster face.” The parotid glands are a pair of glands that are responsible for producing saliva. They are located on either side of your face, just in front of your ears and above your jaw. While both glands are usually affected by the swelling, only one gland can be affected. Due to the swelling, you may have pain or tenderness around your face, ear(s), or jaw. You may also have dry mouth and a hard time swallowing."
    },
    {
      "title": "Note any other general symptoms of mumps.",
      "content": "Note any other general symptoms of mumps. There are several other symptoms you may experience prior to the parotid gland swelling when you have mumps, including: [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Headache Joint pain and aches Nausea and a general feeling of illness Ear pain when chewing Mild abdominal pain Loss of appetite A high temperature (fever) of 38°C (100.4°F), or above"
    },
    {
      "title": "Check for swollen testicles or breasts.",
      "content": "Check for swollen testicles or breasts. If you are a male over 13, you may develop swollen testicles. If you are a female over 13, you may develop swollen breasts. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Women who contract mumps can also develop swollen ovaries. For both men and women, the swelling can be painful. However, it will rarely lead to sterility, or the inability to have children. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Get a diagnosis from your doctor.",
      "content": "Get a diagnosis from your doctor. Swollen parotid glands and the above symptoms are usually a clear sign you have the mumps. However, other virus (like influenza) can cause parotid swelling, though this is often limited to one side. In rare cases, parotid swelling can come from a bacterial infection or from plugged salivary gland(s). Your doctor can confirm you have the virus by checking for these symptoms. Your doctor may also take a blood or urine sample to run tests and confirm the mumps diagnosis. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source It's also important to report the mumps to your doctor so he or she can let the Public Health Department in your area or country know. This will prevent the spread of the mumps to others. A recent mumps outbreak among college students in the Midwest has raised the awareness of mumps by US Public Health Department. While mumps is not usually a serious disease, it does have symptoms of other serious diseases like glandular fever and tonsillitis. So its important to speak to your doctor if you suspect you or your child has the mumps. [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Be aware mumps will usually relieve itself within a week to two weeks.",
      "content": "Be aware mumps will usually relieve itself within a week to two weeks. Children usually recover from mumps in about 10-12 days. It takes about 1 week for the swelling to go down in each parotid gland. The average recovery time for adults is 16-18 days. If your symptoms do not improve after 7 days of home care, or they get worse, talk to your doctor. [11] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Isolate yourself and rest.",
      "content": "Isolate yourself and rest. Call in sick to work and rest for at least five days. This will prevent mumps from spreading to others. [12] X Research source Your child cannot go to school or daycare for at least five days after the glands start to swell. In Canada, cases of the mumps must be reported to the nearest Public Health Department. In the United States, all physicians are required to report any cases of the mumps to the Public Health Department."
    },
    {
      "title": "Take over the counter painkillers.",
      "content": "Take over the counter painkillers. Ibuprofen or Tylenol can relieve any discomfort or pain around your face, ear, or jaw. [13] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source For children, ask your pediatrician what the best and safest pain relief options are. Never give aspirin to children under the age of 18."
    },
    {
      "title": "Apply a warm or cold compress to swollen glands.",
      "content": "Apply a warm or cold compress to swollen glands. This will help to reduce swelling and soothe any pain. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Drink a lot of water.",
      "content": "Drink a lot of water. It’s important to stay hydrated when you have mumps by drinking lots of water throughout the day. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Avoid acidic drinks like fruit juice, as these can irritate your already swollen glands. Water is the best fluid to relieve the mumps. [16] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source You should also avoid sour foods like citrus fruits as these can make the swollen glands worse. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Eat food that does not require a lot of chewing.",
      "content": "Eat food that does not require a lot of chewing. Opt for soft foods like soup, oatmeal, mashed potatoes, and scrambled eggs. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Wear an athletic supporter for any groin pain.",
      "content": "Wear an athletic supporter for any groin pain. You can also apply ice packs or bags of frozen peas on the area to relieve the pain and swelling. [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you are experiencing swollen breasts or abdominal pain, apply a cold compress to the area to help relieve any pain."
    },
    {
      "title": "Seek medical treatment immediately for severe symptoms.",
      "content": "Seek medical treatment immediately for severe symptoms. Go to the nearest hospital or call 911 if you develop a stiff neck, have convulsions, experience severe vomiting, experience weakness or paralysis, or become semi-conscious or unconscious. These could be signs of a brain infection like meningitis or encephalitis. [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Some patients with mumps can develop meningitis, which may require further medical treatment. [21] X Research source Encephalitis occurs when your brain is inflamed. Left untreated, it can lead to neurological problems and become life-threatening."
    },
    {
      "title": "Call your doctor if you have severe abdominal pain and vomiting.",
      "content": "Call your doctor if you have severe abdominal pain and vomiting. These could be signs of an inflamed pancreas, or pancreatitis. [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Monitor children carefully.",
      "content": "Monitor children carefully. Bring your child to the nearest doctor if he or she experiences convulsions or if you suspect malnourishment or dehydration. These may be signs of a more serious illness or condition. [23] X Research source"
    },
    {
      "title": "Talk to your doctor if you contract mumps while pregnant.",
      "content": "Talk to your doctor if you contract mumps while pregnant. Mumps during a pregnancy can be dangerous, with an increased risk of miscarriage in the first 12-16 weeks. [24] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Go to the doctor if you experience hearing loss.",
      "content": "Go to the doctor if you experience hearing loss. In rare cases, mumps can cause hearing loss in one or both ears. So if you start to lose hearing in one or both ears, speak to your doctor. They can then refer you to hearing specialist. [25] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Confirm you have received both doses of the MMR vaccine.",
      "content": "Confirm you have received both doses of the MMR vaccine. The MMR vaccine is a combined measles-mumps-rubella inoculation. It contains the safest and most effective form of each vaccine. You are considered immune to mumps if you’ve had the infection before or if you’ve been immunized with the MMR vaccine. But a single dose of the vaccine does not offer enough protection during an outbreak. So its important to ensure you receive two doses of the MMR vaccine. [26] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The recommendation of the second dose did not begin until the late 1980s or early 1990s. So many young adults may not have received a second dose of the vaccine. If you are an adult, talk to your doctor about the number of vaccines for mumps you have received and ensure you are given both doses. Two doses of the MMR vaccine are recommended before a child enters school. The first one should be given between 12 and 15 months old. The second one should be given between 4 and 6 years old. Though the initial shot for the vaccine may be a bit painful, most people do not experience any serious side effects from the vaccine. In fact, less than one out of 1 million doses causes a serious allergic reaction. [27] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Despite fairly prevalent internet rumors due to a discredited study, the MMR vaccine does not cause autism. [28] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Be aware of circumstances where you do not need to get the MMR vaccine.",
      "content": "Be aware of circumstances where you do not need to get the MMR vaccine. If your doctor runs a blood test and confirms you are immune to measles, mumps and rubella, you do not need the vaccine. As well, if you have already been given two doses of the vaccine, you normally do not need to be vaccinated again. [29] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source In the case of a severe outbreak, a physician may recommend that you receive a third dose to “boost” your immunity. [30] X Research source The vaccine is not recommended for women who are pregnant or plan to get pregnant within the next four weeks. It is also not recommended for individuals who have a life-threatening allergy to gelatin or antibiotic neomycin. Check with your doctor before getting vaccinated if you have cancer, a blood disorder or HIV/AIDS. Talk to your doctor before getting vaccinated if you’re taking steroids or other drugs that affect your immune system. [31] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Practice good hygiene like hand washing and using a tissue.",
      "content": "Practice good hygiene like hand washing and using a tissue. When you sneeze or cough, use a tissue to wipe your nose and cover your mouth. Throw away any used tissues to keep them away from others. You should also wash your hands regularly to prevent the spread of germs, including mumps. To prevent the spread of mumps to others, it’s important to stay home for at least five days after you have been diagnosed with mumps. [32] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source The mumps virus can be spread via surfaces that have been infected, so do not share utensils or cups with someone who has been infected and be sure to sanitize shared surfaces (countertops, light switches, door knobs, etc) with antiseptic cleaners."
    }
  ]
}