{
  "url": "https://www.wikihow.com/Split-an-Atom",
  "title": "How to Split an Atom",
  "steps": [
    {
      "title": "Choose the right isotope.",
      "content": "Choose the right isotope. Not all isotopes are created equal when it comes to being readily split. The most common isotope of uranium has an atomic weight of 238, consisting of 92 protons and 146 neutrons, but these nuclei tend to absorb neutrons without being split into smaller nuclei of other elements. An isotope of uranium with 3 fewer neutrons, 235 U, can much more readily be split apart than can 238 U; such an isotope is called fissile. [1] X Research source When uranium splits (undergoes fission) it releases 3 neutrons that collide with other uranium atoms, thus creating a chain reaction. Some isotopes can be split too readily, so fast that a continuous fission reaction can’t be maintained. This is called spontaneous fission; the plutonium isotope 240 Pu is such an isotope, unlike the isotope 239 Pu with its slower fission rate."
    },
    {
      "title": "Get enough of the isotope to ensure fission will continue after the first atom is split.",
      "content": "Get enough of the isotope to ensure fission will continue after the first atom is split. This requires having a certain minimum amount of the fissile isotope to make the fission reaction sustainable; this is called critical mass. Achieving critical mass requires enough of source material for the isotope to increase the chances of fission occurring. [2] X Research source"
    },
    {
      "title": "Fire one atomic nucleus of the same isotope at another.",
      "content": "Fire one atomic nucleus of the same isotope at another. Because loose subatomic particles are difficult to come by, it’s often necessary to force them out of the atoms they’re part of. One method of doing this is firing atoms of a given isotope against other atoms of that same isotope. [3] X Research source This method was used to create the 235 U atomic bomb dropped on Hiroshima. A gun-like weapon with a uranium core fired 235 U atoms at another piece of 235 U-bearing material fast enough to have the neutrons they released naturally slam into the nuclei of other 235 U atoms and break them apart. The neutrons released when the atoms split would, in turn, strike and split other 235 U atoms. The end result was a massive explosion."
    },
    {
      "title": "Bombard the nuclei of the fissile isotope with subatomic particles.",
      "content": "Bombard the nuclei of the fissile isotope with subatomic particles. A single subatomic particle can strike an atom of 235 U, splitting it into 2 separate atoms of other elements and releasing 3 neutrons. These particles can come from a moderated source (e.g. a neutron gun) or can be generated when nuclei collide. Three types of subatomic particles are commonly used. [4] X Research source Protons. These subatomic particles have mass and a positive charge. The number of protons in an atom determines what element the atom is. Neutrons. These subatomic particles have the mass as protons but no charge. Alpha particles. These particles are the nuclei of helium atoms, shorn of their orbiting electrons. They consist of 2 protons and 2 neutrons."
    },
    {
      "title": "Obtain a critical mass of a radioactive isotope.",
      "content": "Obtain a critical mass of a radioactive isotope. You will need enough raw material to make sure that fission continues. Keep in mind that in a given sample of some element (plutonium for example), you will have more than 1 isotope. Make sure that you have calculated how much of the desired fissile isotope is in your sample. [5] X Research source"
    },
    {
      "title": "Enrich the isotope.",
      "content": "Enrich the isotope. Sometimes, it is necessary to increase the relative amount of fissile isotope in a sample to ensure a sustainable fission reaction occurs. This is called enrichment. There are several ways to enrich radioactive materials . Some of these are: [6] X Research source Gas Diffusion Centrifuge Electromagnetic Separation Liquid Thermal Diffusion"
    },
    {
      "title": "Squeeze the atomic sample tight, bringing fissile atoms closer together.",
      "content": "Squeeze the atomic sample tight, bringing fissile atoms closer together. Sometimes, atoms decay too fast on their own to be fired at one another. In this case, bringing the atoms closer together increases the chance of released subatomic particles striking and splitting other atoms. This can be done by using explosives to force the fissile atoms close together. 239 Pu atoms. [7] X Research source This method was used to create the 239 Pu atomic bomb dropped on Nagasaki. Conventional explosives ringed a mass of plutonium; when detonated, they pushed the plutonium mass together, bringing the 239 Pu atoms close enough together that the neutrons they released would continuously strike and split other plutonium atoms. This created an enormous explosion."
    },
    {
      "title": "Encase radioactive materials in metal.",
      "content": "Encase radioactive materials in metal. Place your radioactive material in a gold casing. Use a copper holder to fasten the casing into place. Keep in mind that both the fissile and the metals will become radioactive once fission takes place. [8] X Research source"
    },
    {
      "title": "Excite electrons with laser light.",
      "content": "Excite electrons with laser light. With the development of petawatt (10 15 watt) lasers, it is now possible to split atoms by using laser light to excite electrons in metals encasing a radioactive substance. Similarly, you could use a 50 terawatt (5 x 10 12 watt) laser to excite the electrons in the metal. [9] X Research source"
    },
    {
      "title": "Stop the laser.",
      "content": "Stop the laser. When the electrons return to their regular orbits, they release high-energy gamma radiation that penetrates the gold and copper nuclei. This will liberate neutrons from those nuclei. Those neutrons will then collide with the uranium underneath the gold splitting the uranium atoms. [10] X Research source"
    }
  ]
}