{
  "url": "https://www.wikihow.com/Winterize-Your-Mercruiser",
  "title": "How to Winterize Your Mercruiser",
  "steps": [
    {
      "title": "Read your engine's owner's manual and all safety precautions.",
      "content": "Read your engine's owner's manual and all safety precautions. Most owner's manuals have step-by-step winterization instructions."
    },
    {
      "title": "Find any missing manual online at Stern Drive Manuals.",
      "content": "Find any missing manual online at Stern Drive Manuals."
    },
    {
      "title": "Plan ahead and be aware that your engine has dangerous moving parts.",
      "content": "Plan ahead and be aware that your engine has dangerous moving parts."
    },
    {
      "title": "Perform a good tune-up to ensure the engine is running OK.",
      "content": "Perform a good tune-up to ensure the engine is running OK. Engine problems become worse while the engine sits."
    },
    {
      "title": "Haul the boat out and clean the running gear, hull and sides.",
      "content": "Haul the boat out and clean the running gear, hull and sides."
    },
    {
      "title": "Remove your hull drain plug while stored on land.",
      "content": "Remove your hull drain plug while stored on land."
    },
    {
      "title": "Run your engine on the garden hose with a good flushette to flush out any old salt water that might be sitting in the block and exhaust.",
      "content": "Run your engine on the garden hose with a good flushette to flush out any old salt water that might be sitting in the block and exhaust. Some owners prefer to run the engine on a 50:50 solution of antifreeze, using a hose and a bucket (above the level of the engine)."
    },
    {
      "title": "Add fuel stabilizer to your fuel tank and run the engine long enough to allow the stabilizer to get into the engine's fuel system.",
      "content": "Add fuel stabilizer to your fuel tank and run the engine long enough to allow the stabilizer to get into the engine's fuel system."
    },
    {
      "title": "Follow the directions for winterization and fuel stabilization in your engine owner's manual.",
      "content": "Follow the directions for winterization and fuel stabilization in your engine owner's manual. Some people prefer to \"fog\" the engine. With the engine running at a high idle (with a water hose hooked up for cooling of course), slowly pour a quart of Marvel Mystery Oil down the throat of the carburetor. The engine will try to stall so rev the engine as not to let it stall just until your can of Marvel Mystery Oil is empty. Drop the RPM while you pour the last bit in faster, so as to cause the engine to stall. This will coat the inside valves and cylinder walls."
    },
    {
      "title": "Locate all your engine's water drain plugs and hoses.",
      "content": "Locate all your engine's water drain plugs and hoses. For stern drive and inboard engines such as Mercruiser models the drain plugs are either brass or plastic."
    },
    {
      "title": "Remove the drain plugs located on either side of the engine block.",
      "content": "Remove the drain plugs located on either side of the engine block."
    },
    {
      "title": "Make sure that when you remove the drain plug that the water drains and that the passage is not plugged with rust.",
      "content": "Make sure that when you remove the drain plug that the water drains and that the passage is not plugged with rust."
    },
    {
      "title": "Remove the drain plugs from the bottom of each exhaust manifold and make sure the passages are not plugged or clogged.",
      "content": "Remove the drain plugs from the bottom of each exhaust manifold and make sure the passages are not plugged or clogged. Some models have drain plugs on either side of the exhaust elbow. Remove the plugs and make sure the passages drain."
    },
    {
      "title": "Save all your drain plugs in a safe place for spring.",
      "content": "Save all your drain plugs in a safe place for spring."
    },
    {
      "title": "Unclamp and remove the large fat water hose from the front of your motor.",
      "content": "Unclamp and remove the large fat water hose from the front of your motor. This will allow more of the blocked passages to drain."
    },
    {
      "title": "Remove any standing water from all hoses.",
      "content": "Remove any standing water from all hoses."
    },
    {
      "title": "Remove any water from any oil coolers or power steering coolers.",
      "content": "Remove any water from any oil coolers or power steering coolers."
    },
    {
      "title": "Remove your propeller.",
      "content": "Remove your propeller."
    },
    {
      "title": "Drain your gear lube and fill your drive with the correct lube (see WikiHow how to Change your Mercruiser Gear Lube).",
      "content": "Drain your gear lube and fill your drive with the correct lube (see WikiHow how to Change your Mercruiser Gear Lube). Some owners prefer to either lock or remove their stern drive unit. Many owners remove the boats battery and place on trickle charge over the winter in a safe ventilated area."
    }
  ]
}