{
  "url": "https://www.wikihow.com/Trap-a-Possum",
  "title": "How to Trap, Relocate, and Deter Possums from Your Home",
  "steps": [
    {
      "title": "Buy a large steel cage.",
      "content": "Buy a large steel cage. Because possums can grow to be the size of a large cat, i.e., two to three feet long and four to 15 pounds, you will need to buy a large, steel cage trap. These traps are also known as raccoon traps. Buy a cage that is about 30 to 40 inches (.762 to 1 meter) in length and 12 inches (.305 meters) in height. Visit your local hardware store to purchase a trap cage. [1] X Research source Most traps come in one or two-door models. It is recommended that you buy a one-door model. One-door models offer better bait protection and are better at catching larger animals."
    },
    {
      "title": "Place the trap in the area the possum frequents.",
      "content": "Place the trap in the area the possum frequents. The best location for the trap is near the possum’s den. However, if you don’t know where the possum’s den is, then place the trap in the area where you have noticed the most activity or damage, like near garbage cans. Because possums are nocturnal marsupials, place the trap in the designated area just before nightfall. [2] X Research source If the possum is living in your attic or garage, place the trap in the center of the space. If the possum lives underneath your house, or in a crawlspace or in a tree’s hollow, place the trap three to five feet outside of the entrance. Remember to place the trap on an even surface. Place a brick on top of the trap to keep it steady and to prevent the possum from flipping it over."
    },
    {
      "title": "Bait the trap.",
      "content": "Bait the trap. Because possums are omnivores, almost any type of bait will work. However, try to choose bait that will only attract possums and not other animals, like cats. Apples, aniseed oil on bread, marshmallows, and other sweet bread are good examples of bait that will only attract possums. [3] X Research source Using a small amount of food creates a trail that will lead to the trap. Make sure to position the food in a way that will force the possum to step on the trigger plate, which will close the trap door. For example, make sure the possum has to step on the trigger plate to get to the food. If the food gets stuck between the trigger plate and the bottom of the cage, the trap door will not close."
    },
    {
      "title": "Check the trap frequently.",
      "content": "Check the trap frequently. Check the trap every morning after you set it. You do not want the possum to be stuck in the trap for more than a day. This can cause the possum to become hungry and thirsty, and thus, anxious and aggressive. They are also more vulnerable to predators if they are trapped for long periods of time. [4] X Research source If your trap is still empty in the morning, close the trap to avoid catching day time animals, like cats and squirrels."
    },
    {
      "title": "Put on heavy gloves.",
      "content": "Put on heavy gloves. Once you have caught the possum, you will need to remove the cage with the possum in it. When handling the cage, make sure you wear heavy gloves. Buy gloves that are specifically made for handling animals, for example, Kevlar gloves. [5] X Research source"
    },
    {
      "title": "Place a blanket over the cage.",
      "content": "Place a blanket over the cage. Before lifting the cage, place a blanket over it. Placing a blanket over the cage will calm the possum. It will also prevent the possum from reaching out to grab your hands, legs, or shoes. When lifting the cage, make sure to lift it by the handle. [6] X Research source Do not put your fingers in the trap. When carrying the trap, carry it away from your legs and feet."
    },
    {
      "title": "Place the trap on a newspaper.",
      "content": "Place the trap on a newspaper. Place the trap on top of newspaper or in a cardboard box in your car or in the back of your truck. This will prevent any feces from getting on your car while transporting the possum. [7] X Research source"
    },
    {
      "title": "Relocate the possum.",
      "content": "Relocate the possum. Contact your local wildlife management agency to find safe and humane relocation areas. Because possums have a great sense of smell and direction, you should relocate the possum to an area that is at least 25 miles from your home. [8] X Research source Examples of safe and humane relocation areas are wildlife preserves, forests, and areas that are similar to a possum’s natural habitat."
    },
    {
      "title": "Open the cage and step away.",
      "content": "Open the cage and step away. When you find a suitable relocation area, safely set the trap down on the ground. Point the opening of the trap away from you, and in the direction of the area where you intend to relocate the animal, i.e., facing the forest. Push down on the safety bar and springs, and pull the trap door all the way up. This will allow the possum to exit the trap safely. [9] X Research source Always stand behind the trap cage when you are releasing the possum. If the possum turns to look at you while it is exiting the cage, put your arms up in the air and make loud predator noises as if you are a bear. This should scare the possum and cause it to turn away and leave. If the possum does not leave immediately, step away from the cage and go inside your car. Wait 10 minutes before checking the cage again."
    },
    {
      "title": "Contact your local animal control agency.",
      "content": "Contact your local animal control agency. If you are uncomfortably relocating the possum yourself, then contact your local animal control or wildlife management agency. Let them know that you captured a possum and need help relocating it. They will send someone to your home to relocate the possum for you."
    },
    {
      "title": "Eliminate sources of food.",
      "content": "Eliminate sources of food. A great way to deter possums from your home is to eliminate their food sources. Eliminate their food sources by securing garbage cans with tight-fitting lids. [10] X Expert Source Kevin Carrillo Pest Control Specialist Expert Interview. 22 October 2019. Also, clean up fallen nuts, fruit, berries, and birdseed around your house. [11] X Research source You should also remove any uneaten pet food that is placed outside your home."
    },
    {
      "title": "Close off access to shelter.",
      "content": "Close off access to shelter. By preventing access to sheltered areas, like the underside of your house, you can make your house inhospitable for possums. [12] X Expert Source Kevin Carrillo Pest Control Specialist Expert Interview. 22 October 2019. To do this, place or repair screens that close off openings to your garage, porch (underneath your porch, too), sheds, poultry houses, and other small places that possums can hide in. [13] X Research source Make sure to repair any broken vents, screens, roofing, and siding to prevent possums from making a home out of your home."
    },
    {
      "title": "Trim the trees around your house.",
      "content": "Trim the trees around your house. To keep possums from making a home out of your attic, trim tree branches that hang over your roof. It is recommended that you trim all tree branches within 10 feet of your roof to prevent possums from entering your attic. [14] X Research source"
    }
  ]
}