{
  "url": "https://www.wikihow.com/Stardew-Artisan-or-Agriculturist",
  "title": "Stardew Valley: Should You Pick the Artisan or Agriculturist Profession?",
  "steps": [
    {
      "title": "Artisan increases the sale price of artisan goods by 40%.",
      "content": "Artisan increases the sale price of artisan goods by 40%. Most of the items you make on your farm count as artisan goods , such as honey, alcohol, cheese, mayonnaise, pickles, and cloth. The only items that don't count are oil and coffee. [1] X Research source While listed as \"artisan goods\" in game, maple syrup, oak resin, and pine tar prices are not affected by the Artisan profession but instead the Tapper profession. [2] X Research source"
    },
    {
      "title": "Agriculturist increases the growth rate of crops by 10%.",
      "content": "Agriculturist increases the growth rate of crops by 10%. This 10% increase stacks with fertilizers or other buffs you may have to increase the growth rate of your crops. This does not increase the regrowth rate of crops that have multiple harvests, such as strawberries."
    },
    {
      "title": "For most players, Artisan is the best pick.",
      "content": "For most players, Artisan is the best pick. By the time you get to level 10 in the Farming skill you are likely producing a number of artisan goods already, so having a permanent increase in the selling price of your artisan goods is a great way to generate a lot of gold. Going the artisan goods route might take a bit more time to get started due to the length of time artisan goods take to create, but in the long run it will pay off with more gold in your pocket."
    },
    {
      "title": "The ultimate decision comes down to your playstyle.",
      "content": "The ultimate decision comes down to your playstyle. If you don't like making artisan goods or prefer to grow lots and lots of crops, selecting the Agriculturist profession might make more sense for you. At the end of the day, the choice is ultimately yours."
    }
  ]
}