{
  "url": "https://www.wikihow.com/Treat-Coccidiosis-in-Cats",
  "title": "How to Help a Cat with Coccidiosis: Signs, Treatment & Prevention",
  "steps": [
    {
      "title": "Keep your cat’s litter tray clean.",
      "content": "Keep your cat’s litter tray clean. Feces from an infected cat contains coccidian oocysts. If your cat comes into contact with the feces, such as when using the same dirty litter tray, she may become infected when she grooms fur that has oocysts stuck to it. To decrease the risk of exposure to infectious feces the following litter tray hygiene measures should be followed strictly: [3] X Research source Remove feces from the litter tray every day. This reduces the opportunity for cross-cat contamination. Provide one tray per cat in the household, plus a spare : this makes it more likely each cat will use their \"own\" toilet facility and are thus less likely to be contaminated if another cat has coccidiosis. Clean litter trays twice a week (minimum) : Be sure to empty all litter trays and either steam-clean them, or use an ammonia based disinfectant to rid them of harmful bacteria. If you have other pets, quarantine your sick cat in a separate room while they are recovering. Make sure they have a separate litter box to use."
    },
    {
      "title": "Give each of your cat’s plenty of space.",
      "content": "Give each of your cat’s plenty of space. Try to avoid crowding your cats together. Pet shops, catteries, and animal shelters need to be especially careful to keep cats in groups of four or less, and, where possible, house them individually. In a domestic setting be sensible about how many cats you own. For example, three-bedroomed house (with access to the outside) is suitable for no more than five cats."
    },
    {
      "title": "Use oocyst-killing disinfectants.",
      "content": "Use oocyst-killing disinfectants. Coccidian oocysts are resistant to low temperatures and many disinfectants. They are, however, killed by high temperatures, desiccation (drying-out), and steam. The following steps are effective ways of cleaning litter trays, play pens, and floors."
    },
    {
      "title": "Steam clean your home.",
      "content": "Steam clean your home. Steam cleaning is effective at killing oocysts and safer for the operator than OO-cide. Be sure to expose all surfaces to the steam when steam cleaning. You can hire professional steam cleaners to come into your home and steam clean."
    },
    {
      "title": "Prevent your cat from hunting.",
      "content": "Prevent your cat from hunting. Cats can become infected by eating infected prey. Thus, preventing cats from hunting prevents infection from this route. One way to keep your cat from hunting is to keep her inside."
    },
    {
      "title": "Clean your cat regularly while she is being treated for this condition.",
      "content": "Clean your cat regularly while she is being treated for this condition. Oocysts can cling to your cat's coat. Thus, it is possible for a cat that is successfully treated with drugs, to re-infect herself when grooming. To avoid this it is best to bathe your cat in warm water with a mild baby shampoo or shampoo specifically meant for cats. [4] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source This should be done on the first and last day of treatment, in order to physically wash away contamination from your cat’s coat."
    },
    {
      "title": "Use an ammonia based disinfectant if the situation is dire.",
      "content": "Use an ammonia based disinfectant if the situation is dire. If you have multiple cats who keep reinfecting each other, you may need to use a stronger disinfectant. \"OO-cide\" is a disinfectant manufactured by Vetoquinol, which is effective against coccidians. The product is made up of two packs. Pack number one is dissolved in water and applied to the surfaces that need cleaning. Pack number two is dissolved in water and applied after Pack number one. This causes ammonia to be released, which is the active coccidiocide. Take extreme care when using this product because harmful vapors are released when this product is in use. When cleaning, you will need to wear a respirator and rubber gloves, and avoid spending time in the treated room until the surfaces are dry. The room will need to be ventilated as well, so open up all windows and doors. Ammonia can be dangerous if not used properly. This should only be an option if other cleaning solutions haven't worked."
    },
    {
      "title": "Get a prescription medication from the vet.",
      "content": "Get a prescription medication from the vet. Your vet will need to examine your cat to give a proper diagnosis and prescription. There are many different types of medications that are used to treat coccidiosis in cats, but the most common are sulfonamide antibiotics. Only give your cat medications prescribed by your vet."
    },
    {
      "title": "Understand the different dosages and their effects on the bacterial infection.",
      "content": "Understand the different dosages and their effects on the bacterial infection. The effect of these sulfonamide antibiotics is dose dependent. At higher doses they are coccidiocidal (meaning they kill protozoa) and at lower doses they are a coccidiostat (meaning they stop the protozoa from breeding). Cats are most commonly prescribed a potentiated form of sulfonamide that contains sulfadiazine potentiated (activated) by trimethoprim. You will most likely give the cat this medication for six days. Always follow the vet's instructions regarding dosage."
    },
    {
      "title": "Consider your cat’s other health problems when getting prescription antibiotics for your cat.",
      "content": "Consider your cat’s other health problems when getting prescription antibiotics for your cat. Sulfonamide drugs are metabolized by the liver and excreted by the kidneys. In animals with liver or kidney damage, the dose should be towards the lower end of the dose range. This is because the organs have a reduced ability to get rid of the drug and so it tends to accumulate in the blood stream."
    },
    {
      "title": "Know what the symptoms of this condition are.",
      "content": "Know what the symptoms of this condition are. Those cats most likely to show symptoms of coccidiosis are young kittens, those with weak immune systems, or cats kept in crowded, unhygienic conditions. Coccidia invade the gut and irritate the lining of the bowel. This causes stomach cramps, loss of appetite, and poor growth in young kittens. Cats commonly develop diarrhea with mucus, a jelly-like substance, in it and flecks of blood from the inflamed bowel wall. These cats are not usually suddenly ill, in a life-threatening way, but will act like they do not feel well. Without treatment, their general body conditions will decline."
    },
    {
      "title": "Understand how coccidiosis is diagnosed.",
      "content": "Understand how coccidiosis is diagnosed. A diagnosis of coccidiosis can be reached by looking at fecal samples under the microscope. Coccidian eggs, or oocysts, have a typical appearance; they look like oval-shaped eggs and contain either one or two sporoblasts (these divide to produce adult coccidians) which look like round balls. [5] X Research source"
    },
    {
      "title": "Familiarize yourself with the coccidian life cycle.",
      "content": "Familiarize yourself with the coccidian life cycle. Coccidia have both a direct and an indirect life cycle. The direct life cycle means the parasite survives by passing from cat to cat via fecal contamination. The indirect life cycle means the parasite infects an intermediate host such as vermin where it remains dormant. When the mouse is eaten by a cat, the oocysts in the mouse bowel are activated and infect the cat."
    }
  ]
}