{
  "url": "https://www.wikihow.com/Use-Dry-Shampoo",
  "title": "How & When to Apply Dry Shampoo for the Best Results",
  "steps": [
    {
      "title": "Spray dry shampoo over your roots, sectioning your hair if needed.",
      "content": "Spray dry shampoo over your roots, sectioning your hair if needed. Shake the dry shampoo bottle and hold it about 6 inches (15 cm) away from your hair. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Then, spray the product liberally to the roots of your hair until the product is visible, focusing on the areas with the most grease. Flip sections of your hair up or back to ensure all of your roots are covered in the shampoo. It's okay if your hair looks chalky after applying dry shampoo, especially if you have darker hair. Excess residue will disappear when you work the product in later."
    },
    {
      "title": "Let the shampoo sit for 5 to 10 minutes.",
      "content": "Let the shampoo sit for 5 to 10 minutes. Dry shampoo needs time to absorb the oils in your hair, so leave the product be for at least 5 minutes. The longer you wait, the more oil the dry shampoo will absorb. [2] X Research source"
    },
    {
      "title": "Massage the shampoo into your hair with your fingertips.",
      "content": "Massage the shampoo into your hair with your fingertips. Work your fingers through your hair as you would when washing it in the shower. Rub the dry shampoo throughout your scalp and roots until it blends into your hair and you can no longer see it. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Brush away any excess shampoo.",
      "content": "Brush away any excess shampoo. Some dry shampoo might linger in your hair after you've rubbed it in. If this is the case, use a brush to distribute the shampoo throughout your hair and remove excess powder. If your hair remains chalky, blow dry your hair on a cool, low setting."
    },
    {
      "title": "Use dry shampoo in between hair washing days.",
      "content": "Use dry shampoo in between hair washing days. Sometimes, your hair needs a little refresh before you give it a good cleansing scrub—and this is exactly what dry shampoo is for! This product is great to use on days when your hair is a bit greasy, but you don’t feel like washing it in the shower just yet. Overall, do what’s best for your hair and hair care routine."
    },
    {
      "title": "Spritz your hair with dry shampoo before styling for extra volume.",
      "content": "Spritz your hair with dry shampoo before styling for extra volume. Looking to give your hair a little more va-va-voom? Consider applying some dry shampoo before curling or straightening it! This is a great way to add texture and height to your hair. Make sure your hair is completely dry before applying any dry shampoo product. Don’t be afraid to add dry shampoo to clean hair for this purpose."
    },
    {
      "title": "Apply dry shampoo before you go to bed.",
      "content": "Apply dry shampoo before you go to bed. Spraying your hair with dry shampoo at the end of the day can help prevent your roots from getting oily at night. Simply spray on the product, then in the morning, massage it into your scalp and brush it out. Sleep on a silk or satin pillowcase to help protect your hair from drying out overnight."
    },
    {
      "title": "Try to avoid using dry shampoo 2 days in a row.",
      "content": "Try to avoid using dry shampoo 2 days in a row. Dry shampoo is a great product to use when you’re in a pinch, but it shouldn’t be a full-time substitute for hair washing. Overusing dry shampoo can dry out your hair and lead to excess buildup, making your hair dirtier and weakening your hair follicles. So, try to only use it when necessary. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source In extreme cases, overusing dry shampoo may lead to hair loss."
    },
    {
      "title": "Opt for a classic aerosol shampoo for convenience.",
      "content": "Opt for a classic aerosol shampoo for convenience. The most popular type of dry shampoo comes in a can that sprays on (just like hairspray). This type is easy to apply and spray on, covering your roots in an even layer of product. Best for: All hair types Spray-on dry shampoos also come in a range of colors. Those with dark hair can purchase tinted dry shampoo to match their hair color."
    },
    {
      "title": "Purchase powder dry shampoo if you have allergies or smell sensitivities.",
      "content": "Purchase powder dry shampoo if you have allergies or smell sensitivities. Spray shampoos can irritate those sensitive to strong smells or who have allergies or asthma. If you fall into one of these categories, go for a powder dry shampoo. Instead of spraying the product on, you pat and rub it in with your fingers. Best for: Fine hair [5] X Research source"
    },
    {
      "title": "Go with a foam dry shampoo for added volume.",
      "content": "Go with a foam dry shampoo for added volume. If you primarily use dry shampoo to add height and texture to your hair, opt for a foaming product. Like powder shampoos, these are patted and rubbed onto the scalp (think of it like a mousse). [6] X Research source Best for: Flat hair"
    },
    {
      "title": "Avoid butane-based shampoos.",
      "content": "Avoid butane-based shampoos. Some store-bought shampoos contain chemicals like butane or isobutane, which can cause hair damage and health risks if used excessively. [7] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Along with this, butane-based shampoos can also be bad for the environment. Look for dry shampoos made of natural, eco-friendly ingredients or make your own to avoid potential health risks. Butane is a colorless and flammable gas found in many aerosol products. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Cornstarch can also be used as a dry shampoo alternative. Simply dab it onto greasy roots with your fingertips and rub it in gently."
    }
  ]
}