{
  "url": "https://www.wikihow.com/Use-Brylcreem",
  "title": "How to Use Brylcreem",
  "steps": [
    {
      "title": "Pick up a jar of Brylcreem.",
      "content": "Pick up a jar of Brylcreem. Due to its iconic status and recognizable branding, Brylcreem can be found just about anywhere that hair care products are sold. You’ll most likely even be able to snag some in the beauty aisle of your favorite supermarket or corner drugstore. If you’re having trouble getting your hands on Brylcreem, try expanding your search to barber shops that cater specifically to men. You can also purchase it online. A large container of Brylcreem typically costs less than $10 and has the potential to last you for months, making it as economical as it is effective. [1] X Research source"
    },
    {
      "title": "Wash your hair prior to styling.",
      "content": "Wash your hair prior to styling. To ensure that the pomade isn’t being forced to compete with your hair’s natural oils, it’s best to start with a clean head of hair. Hop in the shower and lather up with a cleansing shampoo, then follow up with a protective, moisturizing conditioner. [2] X Research source The key to a luxurious, eye-catching coif is, above all else, healthy hair."
    },
    {
      "title": "Leave your hair damp.",
      "content": "Leave your hair damp. Brylcreem coats and holds best when applied to locks that aren’t bone-dry. As soon as you get out of the shower, towel off to soak up the excess water, but let a little bit of moisture remain. That way, you’ll have an easier time distributing the semi-solid cream. [3] X Research source It's a good idea to keep a spray bottle so that you can dampen your hair, as needed. This is particularly useful if you have hair that dries quickly. Make sure your hair isn’t overly wet. Trying to use a wax-based pomade on a waterlogged mane will just result in an oily mess. The volume and absorbency of dry hair, on the other hand, can make it nearly impossible to get the product to coat evenly."
    },
    {
      "title": "Warm the pomade to thin it.",
      "content": "Warm the pomade to thin it. Classic Brylcreem has a soft, creamy consistency that makes layering it on a breeze, but if you’ve chosen a high-hold wax or paste variety, it may be necessary to heat it up to promote spreadability. You can get your product of choice primed and ready by blasting it briefly with a hairdryer, or by simply rubbing it between your palms for a few seconds. [4] X Research source It may also help to store your Brylcreem in a warm place, such as the ledge of your shower."
    },
    {
      "title": "Scoop up a small amount with two fingers.",
      "content": "Scoop up a small amount with two fingers. Use just enough to completely coat your hair and give it a subtle sheen. If you’re sporting a short, neat cut, you’ll be able to get away with less pomade. For longer styles, you’ll need to gather up a little more. [5] X Research source Brylcreem’s famous ad slogan says it all—a little bit goes a long way. Too much product can weigh down hair and leave it looking flat and greasy."
    },
    {
      "title": "Rub the Brylcreem between your palms.",
      "content": "Rub the Brylcreem between your palms. When it comes to taming your mane, two hands are better than one. Spreading the pomade out over a larger surface area will allow you to cover more hair at once. It will also help soften more solid products, as previously mentioned. [6] X Research source"
    },
    {
      "title": "Work the pomade through your hair from root to tip.",
      "content": "Work the pomade through your hair from root to tip. Smooth it on at the scalp, then run your fingers through your hair in all directions to thoroughly coat each strand. Apply it just like you would shampoo, with the goal of getting full coverage over your entire head. [7] X Research source Spiking your hair upwards during the first few strokes can make it easier to work the product down to the roots. [8] X Research source Every now and then, pause long enough to take a quick peek in the mirror. Checking your progress will help you spot sections that you may have missed."
    },
    {
      "title": "Tame cowlicks and flyaways.",
      "content": "Tame cowlicks and flyaways. Use the flat part of your hand to smooth unruly hairs and keep them from sticking up. For persistent problem areas, apply a little extra product directly to the stubborn strands. The added weight will help hold them down, and they'll proceed to fall in line. [9] X Research source To avoid messing up your meticulous grooming, be sure to flatten your hair in the direction that it's parted or slicked. Blow drying cowlicks briefly can help lock them in place once you've successfully got them lying down."
    },
    {
      "title": "Style your hair as usual.",
      "content": "Style your hair as usual. Once your hair is slick and smooth with a faint shine, just comb your hair like you normally would and you’re good to go! Wax-based pomades like Brylcreem don’t dry out like some styling products, so there’s no need to grab the blow dryer or wait to leave the house. [10] X Research source Styling products make it possible to achieve ‘dos that require a little more hold, like pompadours, faux-hawks, and piled curls. [11] X Research source"
    },
    {
      "title": "Wash your hair thoroughly to remove the pomade.",
      "content": "Wash your hair thoroughly to remove the pomade. Unless you like the idea of resting your head on a greasy pillow, it’s a good idea to scrub up before bed on days that you’ve used Brylcreem. To ensure that no residue is left in your hair, use a deep-cleaning clarifying shampoo and conditioner designed to break up oils and rinse until the water runs clear. [12] X Research source The combination of dirt, oils, and additional product can quickly lead to quick buildup. It may take repeated washings to get out every last trace of pomade. [13] X Research source Get in the habit of washing your hair every time you pile on the styling products."
    },
    {
      "title": "Let your hair dry completely between applications.",
      "content": "Let your hair dry completely between applications. When you’re finished washing your hair, air out to return it to its natural state for a few hours. Hair is strongest when it’s dry. Going product-less for a few hours here and there will also give it a chance to breath and keep it healthy and resilient. [14] X Research source The simplest way to dry hair is to give it a good shake, then leave it alone. You can also pat it dry with a soft towel. Just make sure you're not being too rough with it. If you usually to blow dry your hair to save time, do it on a low heat setting to prevent unnecessary damage. You should also use a heat protectant spray to protect your hair from heat damage."
    },
    {
      "title": "Get your hair trimmed regularly.",
      "content": "Get your hair trimmed regularly. No amount of product can disguise a head of hair that's in poor condition. Even if you'd rather keep your locks on the longer side, an occasional shape-up will do away with split-ends and thin out scraggly strands damaged by friction and exposure to the elements. Afterwards, your hair will be tighter, sleeker, and much more manageable. [15] X Research source Schedule a cut every two to six weeks. If you wait much longer, the new growth can make it tough to keep pulling off your current style. [16] X Research source Be sure to communicate your preferences to your stylist so they'll know just how much to take off."
    },
    {
      "title": "Improve the health of your hair with other Brylcreem products.",
      "content": "Improve the health of your hair with other Brylcreem products. In addition to their time-honored styling cream, Brylcreem also makes products specifically designed to treat different types of hair. These include high-hold gels, restorative leave-in masks and dandruff formulas for flaky scalps. If you have especially dry, textured or unruly hair, consider adding one of these products to your hair-care regimen. [17] X Research source Look for other varieties of Brylcreem wherever men’s hair care products are sold."
    }
  ]
}