{
  "url": "https://www.wikihow.com/Stop-Worrying-About-Noisy-Neighbours",
  "title": "Loud Neighbors? Here’s How to Drown Them Out",
  "steps": [
    {
      "title": "These can really help block out noise when you’re home by yourself.",
      "content": "These can really help block out noise when you’re home by yourself. If you find that your noisy neighbors are really getting on your nerves, invest in a pair of noise-cancelling headphones or earbuds, then wear them when you’re trying to relax. These can even help you fall asleep if your neighbors tend to keep you awake at night. [1] X Research source You can find a quality pair of noise-cancelling headphones for around $100. If headphones are out of your budget right now, just get some ear plugs instead."
    },
    {
      "title": "A little bit of background noise can help drown out annoying neighbors.",
      "content": "A little bit of background noise can help drown out annoying neighbors. Plug in a white noise machine or even get a fan and put it on high. This can really help block out annoying sounds, and it can help calm you down when you’re feeling anxious about the noise. [2] X Research source If you don’t want to run out and buy a white noise machine right now, try looking up “white noise” on YouTube and playing it from your phone or your computer instead. White noise machines are also great sleep aids! If you ever have trouble falling asleep, try playing some white noise to lull you into slumber."
    },
    {
      "title": "If you share a wall with your neighbors, it can be hard to fall asleep.",
      "content": "If you share a wall with your neighbors, it can be hard to fall asleep. If you have the space in your home, consider readjusting your furniture so your bed is away from the wall where your neighbors are. Do the same thing with your couch and anywhere you spend a lot of time, too—the further away you are from the noise, the better. [3] X Research source"
    },
    {
      "title": "Getting a few rugs is an easy way to dampen the sound in your home.",
      "content": "Getting a few rugs is an easy way to dampen the sound in your home. If you have wooden, tile, or concrete floors, head to the store and buy a few big rugs to lay down in your home. The more soft areas you can add to the inside of your home, the better! [4] X Research source Similarly, if you have a big area in your home that’s mostly empty, consider filling it up with furniture to absorb some of the sound. You can find quality furniture for a lower price at thrift stores near you."
    },
    {
      "title": "Cracks and holes let in a lot of sound.",
      "content": "Cracks and holes let in a lot of sound. If you live in an older home or you notice any cracks where noise seems to seep through, grab a tube of caulk and seal up the openings. Let the caulk dry for a few hours, then see if the noise from your neighbors has lessened at all. [5] X Research source Cracks are very common around doors and windows. If you own the home that you’re in and it’s an older one, consider upgrading your door and window fittings so they’re tighter and block out noise better. If you’re renting, consider adding weather stripping to your windows to make them a little more sound proof."
    },
    {
      "title": "These special light fixtures are made specifically to help cancel out noise.",
      "content": "These special light fixtures are made specifically to help cancel out noise. If you’re allowed to change the light fixtures in your home, head out and buy a pack of acoustic light fixtures and change them out. [6] X Research source The more light fixtures you add, the more they’ll absorb sound and help cancel out some of the noise from your neighbors. You can find a pack of basic acoustic light fixtures at most hardware stores for around $80. If you’re in a rental, save your old light fixtures and then replace them before you move out."
    },
    {
      "title": "If you just can’t take it anymore, go for a walk or head to a coffee shop.",
      "content": "If you just can’t take it anymore, go for a walk or head to a coffee shop. Getting out of the house can give you a nice break from your situation, and you’ll probably feel calmer once you come home. If you work from home and the noise bothers you throughout the day, consider heading to a coffee shop or a shared workspace to work instead. [7] X Research source"
    },
    {
      "title": "The less stressed you are, the less you’ll worry about noise.",
      "content": "The less stressed you are, the less you’ll worry about noise. Practice self-care by doing one nice thing for yourself every day, like taking a bubble bath or having a fun treat. You can also reduce stress by meditating once a day, even for 5 or 10 minutes. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Exercising is also a great way to reduce stress. Plus, if you find a gym nearby, it’s a great excuse to get out of the house for a while. If dealing with noisy neighbors is causing you anxiety, talk to a mental health professional. When you’re anxious, you’re going to be more stressed, which can create a never-ending cycle of worry about the noise in your home."
    },
    {
      "title": "If you haven’t done so already, you might try chatting with your neighbors.",
      "content": "If you haven’t done so already, you might try chatting with your neighbors. There’s a high chance that they don’t realize how loud they’re being, and they might take steps to reduce their noise if you talk to them about it. Knock on their door one day and have a polite, civil conversation about the noise levels and how it’s bothering you. You could say something like: [9] X Research source “Hey, I live in the apartment right below you, so I can hear you guys walking around a lot. I was wondering if you guys wouldn’t mind trying to keep it down at night, just so I can get to sleep a little easier.” It can seem nerve-wracking to approach your neighbors, but it can really help you take control of the situation and lower your anxiety levels about the noise. Even if your neighbors don’t change right away, at least you’re actively doing something about it."
    },
    {
      "title": "If your neighbors don’t make a change, you can talk to your landlord.",
      "content": "If your neighbors don’t make a change, you can talk to your landlord. If you’re in a rental, call up your landlord or property manager and explain to them what’s been going on. Be sure to mention that you’ve already talked to your neighbors and that the issue is still happening. Hopefully, your landlord will send them an official warning, and they’ll take it seriously enough to quiet down. [10] X Research source When you talk to your landlord, say something like, “I wanted to chat about the people in apartment 23. They play loud music really late at night, and I’ve already asked them to quiet down. It’s disturbing me and the other tenants in the building at this point.”"
    },
    {
      "title": "If your landlord can’t do anything, this is your next step.",
      "content": "If your landlord can’t do anything, this is your next step. Most cities have noise ordinances, which means it’s technically illegal to be super loud after a certain hour. If your neighbors are being loud late at night, call the non-emergency line and report a disturbance to have a cop come out and chat with them about their noise levels. [11] X Research source For instance, a lot of cities have a noise ordinance that bans loud noises from 9 PM to 7 AM. Calling the police on your neighbors isn’t a great way to foster a neighborly relationship, so only use this tactic if you’ve tried everything else."
    }
  ]
}