{
  "url": "https://www.wikihow.com/When-Do-Tattoos-Start-Peeling",
  "title": "When and Why Does a Tattoo Start to Peel?",
  "steps": [
    {
      "title": "Your tattoo starts to flake about 3-4 days after you get it.",
      "content": "Your tattoo starts to flake about 3-4 days after you get it. Typically, your new tat begins to peel after you take off the initial bandage and the tattoo gets a chance to breathe. [1] X Research source But this varies from person to person, and from tattoo to tattoo. In some cases, peeling may not begin until up to a week afterward. [2] X Research source Sometimes, a tattoo doesn’t peel at all, either due to its size or the resilience of your skin. Don’t worry, it just means you got lucky with the healing process. Still, don’t skimp on the aftercare!"
    },
    {
      "title": "Your tattoo typically stops peeling after about 2-3 weeks.",
      "content": "Your tattoo typically stops peeling after about 2-3 weeks. Generally, a tattoo is more or less healed after 2 weeks, when the top layer of skin has fully renewed itself. [3] X Research source That said, every tattoo is different. Some larger tattoos peel for longer and more intensely. Some people’s skin tends to peel more easily, or not at all. Regardless, many tattoo artists advise giving your new ink consistent TLC for up to 6 weeks. If your tattoo continues to peel after 4-5 weeks, however, it may be a sign of infection. See a doctor to get a professional opinion."
    },
    {
      "title": "Peeling occurs as dead skin cells fall away from your body.",
      "content": "Peeling occurs as dead skin cells fall away from your body. When you get a tattoo, the tattoo needle repeatedly punctures your skin to deposit ink further down in the “dermis,” or lower layer of skin, causing what are essentially hundreds or thousands of tiny wounds. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source The top layer of skin, or the “epidermis,” then dies and sloughs off to make way for new, healthy skin. Don’t worry too much about your tattoo “coming off” with the peeling skin. In most cases, the colors you see coming off in your flaking skin are excess pigment deposited in the epidermis—it’s the ink in the dermis that will stay forever. Your tattoo may become a bit dull after some peeling, but that’s normal. As long as you follow proper aftercare , it’ll retain much of its pigment and vibrance."
    },
    {
      "title": "Apply a thin layer of mild lotion to keep it moisturized.",
      "content": "Apply a thin layer of mild lotion to keep it moisturized. Your skin needs some rest and relaxation as it recovers. Help it out by applying a dab of mild, water-based lotion like Cetaphil to moisturize it any time it appears especially dry or flaky. [5] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Avoid scented lotions or lotions with added active ingredients, like aloe, which may lead to further irritation. Don’t use too much! Just enough to cover the tattoo will do. Too much lotion can stifle the tattoo, making for a prolonged healing process."
    },
    {
      "title": "Tap your tattoo lightly with your fingers to soothe itching.",
      "content": "Tap your tattoo lightly with your fingers to soothe itching. Flakes and scabs are natural parts of the healing process, but that doesn’t make them any less unpleasant. Still, avoid picking or scratching at your tattoo, which can prolong the healing process or even damage the tattoo. Instead, use 2-3 fingers to firmly tap your tattoo to relieve itchiness. [6] X Research source Make sure to wash your hands before tapping your tattoo! Dirty hands may transfer bacteria, worsening the problem."
    },
    {
      "title": "Use a stress toy to distract yourself from picking at your tattoo.",
      "content": "Use a stress toy to distract yourself from picking at your tattoo. You’re going to want to pick that scab—it’s basically human nature. But resist! Let the scab fall off on its own as it heals naturally. Instead of picking, play with a fidget spinner or a stress ball to keep your mind off your itchy skin. [7] X Research source"
    },
    {
      "title": "Intense redness or rash",
      "content": "Intense redness or rash A little redness is normal in the days after you get your tattoo, but typically that redness is fairly slight and stays within the tattooed area. If your skin becomes a deeper red, swollen, or a dry, red rash forms around the area, your tattoo may be infected. [8] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Note that tattoos may trigger other reactions, like eczema or psoriasis. Areas of redness or rashes aren’t sure signs of infection, but see a doctor anyway to stay on the safe side. To treat a tattoo that may be infected , take an antihistamine and apply a cold compress to reduce inflammation until you can see a medical professional."
    },
    {
      "title": "Prolonged or intense pain",
      "content": "Prolonged or intense pain For the first few days (up to a couple weeks), your tattoo will feel much like a sunburn and may cause a bit of discomfort when you’re moving. Intense pain or pain that lasts more than a few weeks, however, is abnormal—visit your doctor to have your tattoo examined. [9] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Discolored discharge",
      "content": "Discolored discharge Tattoos tend to seep blood and pigment for a couple days while they’re fresh, and you wash this away during your typical aftercare. But if your tattoo develops oozing, open sores or begins to seep white or yellow pus, definitely consult your physician—these are hallmark signs to look for when deciding if a tattoo is infected. [10] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Fever or chills",
      "content": "Fever or chills Raised body temperature or any sort of all-over discomfort are never normal symptoms of a properly healing tattoo. [11] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source These are advanced signs of infection, and require medical intervention. Visit the nearest emergency room for treatment."
    },
    {
      "title": "Leave the initial bandage on for at least 2 hours.",
      "content": "Leave the initial bandage on for at least 2 hours. Before you stroll out of the parlor, your artist wraps your tattoo in cling wrap or an adhesive bandage. Ideally, leave it on for up to 10 hours. These first few hours are when your tattoo is the most vulnerable to airborne bacteria, and that bandage is the first line of defense. [12] X Research source Some artists go so far as to request you leave it on for 24 hours—always do as your artist says, in these cases. Your tattoo will ooze blood and pigment beneath the bandage in the first hours. That’s normal! If you’d rather not see it, loosely wrap the bandage in a single layer of gauze."
    },
    {
      "title": "Wash the tattoo 2-3 times a day with warm water and mild soap.",
      "content": "Wash the tattoo 2-3 times a day with warm water and mild soap. After removing the initial bandage, wash your hands and place the tattoo under warm running water. Gently but firmly wash the tattoo with unscented hand soap . Only use your fingers—towels or rags may carry bacteria. [13] X Research source Afterward, pat your tattoo dry with paper towels. Just gentle dabs here; avoid rubbing it. Scented hand soaps may irritate your vulnerable, sensitive skin."
    },
    {
      "title": "Spread a thin layer of mild lotion over the tattoo 2-3 times a day.",
      "content": "Spread a thin layer of mild lotion over the tattoo 2-3 times a day. Every 4-5 hours, or immediately after you wash your tattoo, apply some moisturizing lotion onto the tattoo using the tips of your fingers. [14] X Trustworthy Source State of Michigan Official website for the State of Michigan Go to source Avoid petroleum-based products, which don’t allow your skin to breathe. Instead, use a lighter, unscented, water-based formula like Aquaphor or Cetaphil . Keep your tattoo moisturized at all times, and reapply lotion any time it starts to feel or appear dry."
    },
    {
      "title": "Wear loose clothing and sunscreen to protect your tattoo from the sun.",
      "content": "Wear loose clothing and sunscreen to protect your tattoo from the sun. A sunburn on top of already tender skin only spells trouble, and can inhibit the healing process, damaging your tattoo. Wear loose clothing over your tattoo to keep it shaded, and always wear an SPF 30 or higher sunscreen when you venture outdoors. [15] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source In addition, avoid tanning beds as your tattoo heals. Artificial sources of UV light are just as damaging as the sun."
    },
    {
      "title": "Avoid submerging your tattoo in still water for 6 weeks.",
      "content": "Avoid submerging your tattoo in still water for 6 weeks. Stay away from baths, pools, hot tubs, lakes, the ocean—any context where your tattoo may become submerged in water, which is where bacteria lurks. For a couple months, take only showers, where clean, running water has minimal risk of infecting your fresh tattoo. [16] X Trustworthy Source State of Michigan Official website for the State of Michigan Go to source It’ll be tempting to dive into that pool, but tattoos are a commitment in more ways than one. And just think of how refreshing that dive will finally be once your tattoo is fully healed!"
    }
  ]
}