{
  "url": "https://www.wikihow.com/Understand-Bovine-Behaviour",
  "title": "How to Understand Bovine Behaviour",
  "steps": [
    {
      "title": "Read some books on animal behaviour or herding/handling cattle.",
      "content": "Read some books on animal behaviour or herding/handling cattle. Books that have been written by people who have studied animal behaviour are the best to start with. Often your local bookstores may not have such books, so the best place to buy them is either at an online bookstore such as Amazon.com , or from a college or university bookstore that sells such books for students taking animal care/agricultural-type courses. Websites such as Grandin.com [1] X Research source and other scientific journals may also be good resources to study up on cattle behaviour. Recent scientific papers like those posted in the Journal of Animal Science are one of the best to look through if you are looking for research papers on cattle behaviour."
    },
    {
      "title": "Go to a farm or ranch to observe and study actual cattle behaviour.",
      "content": "Go to a farm or ranch to observe and study actual cattle behaviour. Make sure the animals cannot see or smell you, otherwise they will come up to the fence and stare at you, expecting some form of treat, or run away where you cannot observe them. Sometimes, however, them seeing you can be a good thing, and may encourage the animals to perform certain behaviours towards you, be those behaviours good or bad."
    },
    {
      "title": "Note the behaviour that is being displayed between animals and/or towards you.",
      "content": "Note the behaviour that is being displayed between animals and/or towards you. A cattle herd is set up in hierarchy , with one animal being the boss, progressing all the way down to the one at the bottom. This is also called \"pecking order\" or \"the totem-pole effect,\" however you want to put it: The \" alpha \" bovine, be it a bull, cow, steer or heifer , will boss the \"omega\" bovine by either staring directly at it until it moves away, or lower its head (to expose the poll, with the chin tucked in) to head-butt the lower-level animal. If the omega challenges the alpha for leadership, then there will be a head-butting and shoving match until either one wins. The winner will chase or herd the loser around the pen until the loser, the new omega, submits by slightly lowering the head (much like a dog or wolf lowering its head to the alpha male or female), or turning away from the more alpha animal. Often submission behaviours are so subtle that it can be hard for a person unfamiliar with bovine behaviour to see. This sort of fighting will occur in two types of situations: new animals enter the herd, or bulls fighting for breeding rights and in defense of their harem. Very rarely does fighting between cows, heifers or steers end in death. However, it is more common in bulls, especially between two rivals that are of the same size as the other, or if an older bull feels that the younger bull is a threat that should be dealt with in more ways than trying to get him to submit to the older fellow. This is even more of a risk factor if one of the bulls is horned."
    },
    {
      "title": "Ask yourself whether the cattle are exhibiting good behaviours or bad ones.",
      "content": "Ask yourself whether the cattle are exhibiting good behaviours or bad ones. Good or normal behaviours include: Grazing or eating from a feed trough or hay bale Curiosity about your presence or something that is different in the corral or pasture (this is where they are watching and sniffing and even licking, if they get the nerve to come close enough to this strange \"thing\") Scratching an itch on a fence , tree or the side of a building Tossing their head back over the shoulder (only if flies are bothering them) Any other activity that involves licking itself or another friend Chewing their cud, be it standing or laying down Going to find a place to lie down Watching you with an expression of mild to somewhat-intent interest Raising and bobbing their heads to smell you, if you've got their attention The bull \"courting\" the cows (sniffing and licking the genital area, attempting to mount, etc.) Bad or threatening behaviours include (mostly exhibited by an over-protective bull or mother cow): Wrinkling of the muzzle much like a dog (it's less obvious than what you would see in a dog, but if you look close enough [at a safe distance, mind you] you may be able to see it) Glaring or intently staring or fixation on you or a predator Pawing the ground Showing their side Growling (sounds something like a low \"RRrrrruuumph!\" Rrrruummph!\") Shaking or tossing of the head Charging towards you and stopping short (definitely a challenge and a threat) Non-threatening behaviours that mean that the animal is anything but calm and relaxed include: Head up, ears perked forward means alert, very nervous, tense, and a little scared and unsure. Stilting, high-stepping walk, still staring at you in the same manner as previously mentioned means the animal is alert and on the verge of flight because of fear. Showing the whites of the eyes - could mean that the animal is unsure, nervous, tense, or slightly fearful Mad switching of the tail (this indicates intense anxiety, except when calves are suckling from momma or the flies are really bugging the cattle). Startling at a sudden movement, shying away from something, etc. all indicates tension, insecurity and fear. Stampede only results if the fear they feel is overwhelming and they need to get away from it as fast as possible. Because cattle are prey animals, flight and keeping with the herd is their best (but not the only) defense mechanism against the offending stimulus."
    },
    {
      "title": "Consider the frame of mind the cattle might be in.",
      "content": "Consider the frame of mind the cattle might be in. Are they nervous, calm, excited, agitated, unsure or frightened? See the above points for indicators. An important thing to remember is that, like all animals, cattle are sensitive to what your feelings are. If you are tense, frustrated , scared, unsure or excited, then they will mirror those feelings by acting in the same way or reacting to your feelings. Cattle will always act nervous, fearful and unsure whenever they meet someone new, but if you spend enough time with them (at least 30 minutes) and remain calm and relaxed, then they will also be calm and relax."
    },
    {
      "title": "Familiarize yourself with such behaviours, and try to memorize them for future reference.",
      "content": "Familiarize yourself with such behaviours, and try to memorize them for future reference. Memorizing bovine behaviour and psychology will help you improve your practices in working with cattle and, if you are afflicted with bovinophobia, help work through your fears."
    }
  ]
}