{
  "url": "https://www.wikihow.com/Treat-Nutritional-Deficiencies-in-African-Grey-Parrots",
  "title": "How to Treat Nutritional Deficiencies in African Grey Parrots",
  "steps": [
    {
      "title": "Spot the symptoms of Vitamin A deficiency.",
      "content": "Spot the symptoms of Vitamin A deficiency. Look for respiratory issues like wheezing, sneezing, and breathing through the mouth. Check for nasal discharge, plugged nostrils, swollen eyes, discharge from the eyes, bad breath, white patches in the mouth, or a slimy appearance to the mouth. Affected birds might also be depressed and/or lethargic and lose weight suddenly. [1] X Research source"
    },
    {
      "title": "Recognize the symptoms of Metabolic Bone Disease.",
      "content": "Recognize the symptoms of Metabolic Bone Disease. Look for curvature in your bird's spine or legs. Check for limping or favoring of a wing, which could signal a broken bone. Watch for bending of your bird's beak as they eat. Other symptoms include seizures, tremors, depression, trouble swallowing, weakened vocalizations, lack of balance, and involuntary eye movements. [2] X Research source"
    },
    {
      "title": "Spot the symptoms of obesity.",
      "content": "Spot the symptoms of obesity. African Greys aren't as prone to obesity as other parrot species, but that doesn't mean they're immune. Look for abnormal body girth and difficulty breathing. Check for evidence of dermatitis on their feet. Be alert to any evidence of joint pain, which could signal arthritis. [3] X Research source"
    },
    {
      "title": "Recognize the symptoms of iron storage disease.",
      "content": "Recognize the symptoms of iron storage disease. Fortunately, this condition is rare in parrots, but it never hurts to know what to look for. Check for sudden weight loss, loss of appetite, vomiting, a bloated abdomen, and difficulty breathing. Look for yellow or green crystals in your bird's urine. These symptoms signal problems with the heart, liver, and/or spleen. [4] X Research source"
    },
    {
      "title": "Take your bird to the vet if you see any symptoms.",
      "content": "Take your bird to the vet if you see any symptoms. If you notice that your bird has any of these symptoms, take it to an avian veterinarian. They can make an accurate diagnosis and treat the problem promptly and correctly. Most of these diseases are caused by incorrect diets, particularly if the bird has too many seeds and not enough pellets in their diets. Only a vet can diagnose this with certainty, though."
    },
    {
      "title": "Supplement Vitamin A.",
      "content": "Supplement Vitamin A. Your vet will start the supplementing process in the office. You can expect your bird to stay overnight at the clinic, where they’ll receive vitamin A injections. Expect to supplement about 100,000 IU/kg per day. However, the exact dosage will depend on how severe your bird's deficiency is. [5] X Research source"
    },
    {
      "title": "Treat any secondary infections.",
      "content": "Treat any secondary infections. These can be more dangerous than the deficiency that caused them. Tell your vet about your bird's symptoms in detail. Your vet likely start the treatment at the same time as the vitamin supplementation. Follow their instructions if you have to continue the treatment after your bird comes home. [6] X Research source"
    },
    {
      "title": "Feed your bird Vitamin A-rich foods.",
      "content": "Feed your bird Vitamin A-rich foods. Your vet will likely recommend a pelleted diet high in Vitamin A. If they say it's safe, make your bird's diet 65-80 percent formulated foods and 15-30 percent fresh fruits and vegetables. Feed them foods like broccoli flowerettes, carrots, nectarines, parsley, and turnip greens. Serve the food in small enough servings for bird to eat safely. [7] X Research source"
    },
    {
      "title": "Treat bone fractures.",
      "content": "Treat bone fractures. Metabolic Bone Disease (MBD) can result in weakened or broken bones. Tell your vet if your bird fell off their perch or has been showing evidence of a fracture. After an x-ray confirms a fracture, your vet will give your bird a splint. Follow your vet's instructions about changing the bandages, cleaning the wound (if necessary), and providing pain relief. [8] X Research source"
    },
    {
      "title": "Provide high-calcium foods and calcium supplements.",
      "content": "Provide high-calcium foods and calcium supplements. Your vet will start your bird on a regimen of 100 mg/kg of calcium gluconate, likely given as intramuscular injections. Follow your vet's instructions regarding continued supplementation. When your bird comes home, feed them foods like broccoli, kale, turnip greens, and collard greens. [9] X Research source"
    },
    {
      "title": "Supplement Vitamin D3.",
      "content": "Supplement Vitamin D3. Vitamin D3 helps birds' bodies absorb calcium much better than Vitamin D2. African Greys don't absorb Vitamin D very well from food sources. Therefore, your vet will likely prescribe liquid vitamins like Avitron or powdered supplements like Superpreen, which are easier to absorb. Follow your vet's dosage instructions. [10] X Research source Too much Vitamin D3 can cause too much calcium to build up in vital organs like the kidneys. Stick to the dosage your vet prescribes. [11] X Research source"
    },
    {
      "title": "Provide ultraviolet light.",
      "content": "Provide ultraviolet light. UV light helps African Greys produce their own Vitamin D. Whenever possible, place your bird's cage in natural sunlight. This can be in an open window or outdoors away from possible predators. When natural sunlight isn't possible, shine an ultraviolet bulb into the cage. You can buy it at your local pet store. [12] X Research source Make sure you don’t expose your bird to cold or drafts, particularly if you live in a cold weather climate. A sick bird that becomes chilled is at risk of becoming sicker or even dying."
    },
    {
      "title": "Cut back on high-fat foods.",
      "content": "Cut back on high-fat foods. Too much fat binds calcium in your bird's digestive tract and prevents it from being absorbed into the body. Cut back on Brazil nuts and sunflower seeds, making them only an occasional treat. Eliminate commercial seed mixtures, which lack essential nutrients, and replace them with pellets. [13] X Research source"
    },
    {
      "title": "Supplement magnesium, if necessary.",
      "content": "Supplement magnesium, if necessary. Your vet might prescribe magnesium if your bird is having seizures. Magnesium might also help raise calcium levels in your bird's blood plasma. Follow their instructions in terms of the dosage and how long you'll need to supplement. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Expect different age-related results.",
      "content": "Expect different age-related results. Adult birds who developed MBD after birth respond to treatment better than juvenile birds who were born with the condition. Don't be disappointed if a bird born with MBD develops stunted legs or wings even with proper nutrition. The key thing is to get your bird diagnosed and begin treatment immediately to prevent further damage from developing."
    },
    {
      "title": "Switch to a mostly pelleted diet.",
      "content": "Switch to a mostly pelleted diet. Pellet foods are formulated to contain most or all of the nutrients your bird needs. They're also low in fat. Follow your vet's instructions in terms of how much and how often to feed your bird. Usually, pelleted food should make up about 85 percent of an obese bird's diet. [15] X Research source"
    },
    {
      "title": "Serve up some fruits and veggies.",
      "content": "Serve up some fruits and veggies. If it's okay with your vet, make them about 15 percent of your parrot's diet. Aim for calcium-rich dark leafy greens, protein-rich legumes, and Vitamin A-rich carrots and sweet potatoes. Birds also need carbs and fats in their diets, but they should make up a very small part of this 15 percent. Check with your vet for what's right for your parrot."
    },
    {
      "title": "Cut back on seeds.",
      "content": "Cut back on seeds. Seeds provide essential fats, but there is such a thing as too much. Talk to your vet about how much your parrot needs. If your bird likes their seeds too much, ask your vet for pointers about reducing seeds without upsetting your feathered friend. [16] X Research source"
    },
    {
      "title": "Encourage movement around the cage.",
      "content": "Encourage movement around the cage. Buy a larger cage for your bird. Divide the food into smaller bowls and place them at different ends of the cage. Provide a hanging rope for climbing and a rope perch to improve your bird's balance. Install stairs if your bird's wings are clipped. If your bird's wings aren't clipped, give them a flight cage outside. You can purchase any of these at your local pet store. [17] X Research source Allow your bird to exercise outside of the cage as well. If possible, set aside a bird-proof room or large enclosed area for your bird to walk or crawl around in."
    },
    {
      "title": "Cut back on iron-rich foods.",
      "content": "Cut back on iron-rich foods. Your bird still needs iron, so don't cut off their iron intake entirely. Reduce the amount of bananas, mangos, papayas, squash, and skinless potatoes you feed them. Substitute these foods with honeydew melons, peaches, plums, and peeled apples. [18] X Research source"
    },
    {
      "title": "Eliminate foods high in Vitamin C.",
      "content": "Eliminate foods high in Vitamin C. Stop feeding your bird citrus fruits. Avoid beetroots, carrots, chili peppers, and spinach. Never give your bird baby food, juices, nectars, or commercial food formulated for humans or other animals. In addition to Vitamin C, they also contain too much iron for avian bodies. [19] X Research source"
    },
    {
      "title": "Provide necessary medications.",
      "content": "Provide necessary medications. Give your bird iron-reducing supplements like tannins and fiber. Feed them whole grains, legumes, nuts, and seeds. Work with your vet to work out a schedule for regular blood tests, probably for the rest of your bird's life. [20] X Research source"
    }
  ]
}