{
  "url": "https://www.wikihow.com/Write-an-Application-Letter-for-a-Teaching-Job",
  "title": "How to Write an Application Letter for a Teaching Job",
  "steps": [
    {
      "title": "Read the job posting carefully and underline or highlight key terms.",
      "content": "Read the job posting carefully and underline or highlight key terms. Before you begin writing your cover letter for a teaching position, read through the job posting with a pen or highlighter in hand. Identify the key skills, certifications, and other qualifications that the employer is seeking. This will help you to tailor your cover letter to the position you’re applying for. For example, if the position is for a Kindergarten teacher, then the position may indicate that you need to have undergone a preparatory teaching program. If the job posting is online, you can transfer the text into a word processor and highlight using the highlight tool."
    },
    {
      "title": "Find out the name of the hiring manager.",
      "content": "Find out the name of the hiring manager. It’s important to address the hiring manager by name when you submit your application. This adds a personal note to your letter and shows your attention to detail. Check the job posting to see if the hiring manager’s name is included. If it’s not, email or call the school to find out who you should address your application to. [1] X Research source Make sure to find out the person’s preferred prefix. For example, if the hiring manager is a woman named Nancy Cardigan, ask if she goes by Ms., Mrs., or something else."
    },
    {
      "title": "Research the school, district, and position.",
      "content": "Research the school, district, and position. Visit the school's website and search online to find out as much as you can about the school, the school district, and the position as you can. These extra details allow you to display knowledge of the job and school, which might help to set you apart from the competition. Some things to research include: [2] X Research source The school’s student population Special challenges facing the school, such as budgetary issues or overcrowding Extracurricular programs available to students"
    },
    {
      "title": "Identify 3 experiences or skills that qualify you for the position.",
      "content": "Identify 3 experiences or skills that qualify you for the position. [3] X Expert Source Adrian Klaphaak, CPCC Career Coach Expert Interview. 18 December 2018. Once you have completed your research, start making notes about what you want to include in your letter. Since your letter should not exceed 1 page, try to identify the top 3 professional experiences or special skills that qualify you for this position. List these and any notes about how you might describe these in you letter. [4] X Research source For example, if you’re applying for a Spanish teacher position, you might want to mention your study abroad experience that enhanced your Spanish speaking skills, or your additional certification as a TESOL teacher. Make sure that your cover letter points to things that are included in your resume. [5] X Expert Source Adrian Klaphaak, CPCC Career Coach Expert Interview. 18 December 2018. This will allow the employer to find out more about the professional experiences, certifications, or skills you mention."
    },
    {
      "title": "Include your address and the date followed by 3 spaces.",
      "content": "Include your address and the date followed by 3 spaces. Don’t put your name at the top of the letter. Just include your mailing address on the upper left hand side of the page. Then, add a space between the last line of your address and include today’s date. For example, you might list your address as “100 Main Street, Everytown, ND, 12345.” Then, after adding a space, list today’s date in long form, such as August 8th, 2019."
    },
    {
      "title": "Provide the full name and address of the hiring manager.",
      "content": "Provide the full name and address of the hiring manager. Use the hiring manager’s name and preferred prefix in the address. Then, follow it with their title and the address listed in the job posting or the one that you got for them when you called to get their name and contact info. For example, “Mrs. Sherri Mascarpone, Executive Director of Personnel, Sacramento School District, 1000 Johnson Lane, Sacramento, CA, 12345.”"
    },
    {
      "title": "Greet the person with a formal salutation.",
      "content": "Greet the person with a formal salutation. It’s fine to start with a simple salutation, such as “Dear.” Avoid using anything too informal or personal, such as “Hi” or “Hello.” For example, you might start with “Dear Mr. Rodgers,” and then add a space and begin your introduction."
    },
    {
      "title": "Indicate the job you’re applying for and why you’d be a good fit.",
      "content": "Indicate the job you’re applying for and why you’d be a good fit. The first line of your introduction is meant to grab the attention of the hiring manager. The best way to do this is often to get right to the point and say why you’re writing. If the job posting includes a job number that you need to reference, you might want to include it here. Or, you can simply say what position you’re applying for and then give a brief overview of why you’d be a good fit. For example, you might open with something like, “I’m writing to apply for the Math Teacher position that was advertised in this week’s paper.” It’s also a good idea to give the employer some indication of who you are, such as by mentioning where you attended school and when you graduated or expect to graduate. For example, you might follow your first sentence with something like, “As a recent graduate of Universal University’s teacher education program, I am well-qualified for the position.” [6] X Research source"
    },
    {
      "title": "End the first paragraph with 3 reasons you're qualified.",
      "content": "End the first paragraph with 3 reasons you're qualified. Look back over the top 3 skills or experiences that you want to emphasize in your cover letter. Then, close the intro paragraph by pointing to these 3 things as evidence of your qualifications for the job. [7] X Research source For example, you might write something like, “I’ve had a broad range of professional experiences that qualify me for the position, including working in the school district as a teacher’s aide while working on my college education, getting the opportunity to tutor at-risk youth in an after-school program run by a local charity, and completing my student teaching at this school.”"
    },
    {
      "title": "Provide evidence of your experiences and skills.",
      "content": "Provide evidence of your experiences and skills. [8] X Expert Source Adrian Klaphaak, CPCC Career Coach Expert Interview. 18 December 2018. Include 1 or 2 body paragraphs in your letter that expand on the 3 things you listed at the end of your introduction. Provide more information on the experiences you mentioned or expand on any special training or certifications you hold and talk about how they enhance your teaching. [9] X Research source For example, if you mention that you completed one of your student teaching rotations at the school you’re applying to work at, then you might expand on what you learned about the school and its teachers during that experience and how that knowledge would make you a good fit for this position. If you mentioned that you hold a special certification, then you might expand on how that could enhance your ability to fulfill the needs of the position to which you’re applying."
    },
    {
      "title": "Emphasize what you’d contribute as a teacher at this school.",
      "content": "Emphasize what you’d contribute as a teacher at this school. [10] X Expert Source Adrian Klaphaak, CPCC Career Coach Expert Interview. 18 December 2018. Think about what makes you different from other teachers. What have your professors or former employers praised you for in the past or listed as your assets in evaluations of your work? Identify at least one trait or skill that you can emphasize towards the end of your body paragraph. [11] X Research source For example, you might include a line about your persistence and refusal to give up on students who struggle with course material, or you might mention that your professors or former employers have praised you for your ingenuity in designing engaging lessons."
    },
    {
      "title": "Reemphasize your qualifications and interest in the position.",
      "content": "Reemphasize your qualifications and interest in the position. After you finish covering your main skills and experiences, start your conclusion by emphasizing your interest in the position again. Keep it simple and avoid using terms like “I think” or “I believe.” [12] X Research source For example, you might write something like, “Because of my professional experiences and special certifications, I’m very interested in the 7-12 French teacher position at Northwestern Central School.”"
    },
    {
      "title": "Thank the employer for their time and consideration and look ahead.",
      "content": "Thank the employer for their time and consideration and look ahead. Next, let the employer know that you appreciate them taking the time to read your cover letter and consider your application. This is also a great place to request an interview. [13] X Research source Try saying something like, “Thank you for considering my application! I hope we can meet soon to discuss my qualifications further.” [14] X Research source You may also indicate when you’re available or suggest a time and date for an even stronger option. For example, you could say something like, “I’m available to meet in person most weekday mornings and on Friday afternoons.” Or, you could say, “I’m available next Friday afternoon between 1:00 and 4:00 pm if you’d like to schedule an interview.”"
    },
    {
      "title": "Provide an email address and phone number where you can be reached.",
      "content": "Provide an email address and phone number where you can be reached. Make sure that the hiring manager has a reliable way to get in touch with you, such as by providing your email address and phone number. You can include this information in a line at the end of your introduction. [15] X Research source For example, you might write something like, “My cell phone number is (123) 555-1234 and my email is DJohnson@email.com.”"
    },
    {
      "title": "End with a simple sign off and your name.",
      "content": "End with a simple sign off and your name. Finish the letter with a simple, friendly goodbye message or sign off. Try saying something like, “Sincerely,” or “Kind Regards,” and then add a space and type your name under the signoff."
    },
    {
      "title": "Check the content of your letter and revise as needed.",
      "content": "Check the content of your letter and revise as needed. Read through your letter and look for areas where you could expand, simplify, or reorganize. It might also be a good idea to re-read the job posting to make sure that you’ve included information about the key skills they’re looking for in a teacher. If you notice anything that you can improve, revise your letter . For example, if the job posting emphasizes that the ideal candidate should have evidence that their teaching strategies are successful, then you might want to add more detail on the positive feedback you’ve received during teaching observations."
    },
    {
      "title": "Ensure that your letter is brief and to the point.",
      "content": "Ensure that your letter is brief and to the point. The hiring manager likely has many applications to consider, so they’ll appreciate it if you keep your letter brief and easy to follow. Some ways to ensure that you’re doing that include: [16] X Research source Not making your letter more than 1 page long Describing your skills using action verbs similar to the ones in the job posting Avoiding long, intricate sentences that may be difficult to follow"
    },
    {
      "title": "Read through the letter again to check for errors.",
      "content": "Read through the letter again to check for errors. Your application letter should be polished and free from errors, so read through it carefully after you finish editing the content. Fix any misspellings, typos, or grammatical errors before you print your letter. Try reading the letter out loud to help you spot any errors that you might miss while reading the letter silently. Don’t rely on your word processing software to catch errors. These programs are not foolproof for spotting errors."
    },
    {
      "title": "Print the letter on high-quality bond paper and sign it.",
      "content": "Print the letter on high-quality bond paper and sign it. Get some high-quality resume paper to print your resume and cover letter on. Plain white paper is fine, but the paper should be of a higher quality than normal printer paper. After you print your letter, sign your name in blue or black ink underneath where your name is printed on the letter. [17] X Research source If you need to submit the letter electronically, convert it to PDF format."
    }
  ]
}