{
  "url": "https://www.wikihow.com/Use-a-Cooling-Towel",
  "title": "How to Wear a Cooling Towel (And How They Work)",
  "steps": [
    {
      "title": "Soak the cooling towel in cool water.",
      "content": "Soak the cooling towel in cool water. Run the cooling towel under a cool faucet, or dunk it into a basin full of cool water. [1] X Research source Keep it there until it’s completely saturated and soaked through."
    },
    {
      "title": "Wring out any excess water, then give the towel a quick snap.",
      "content": "Wring out any excess water, then give the towel a quick snap. Give your towel a twist and a squeeze to get any drips out. [2] X Research source Then, hold the towel at each end and snap it quickly downward to distribute the moisture throughout the fabric. Or, instead of snapping it, simply shake the towel in the air 2-3 times. Just be sure you’re outdoors, or somewhere that can take a little spritz of water!"
    },
    {
      "title": "Wrap the towel around your head or neck as you work.",
      "content": "Wrap the towel around your head or neck as you work. Drape the towel across your shoulders, or over your head. You might also wrap it around your wrists, arms, or anywhere else on your body you want to keep cool. [3] X Research source Use cooling towels as you work out inside or outside, labor in the sun, to relieve headaches, or any time you need a little refreshment. How long your towel remains effective depends on the temperature, weather, and where you wear it on your body. Typically, it’ll last for about half an hour to an hour. Keep soaking it periodically, or whenever it feels dry, to stay cool . [4] X Research source"
    },
    {
      "title": "Cooling towels cool you off with the power of evaporation.",
      "content": "Cooling towels cool you off with the power of evaporation. As you wear the cooling towel, the water in the towel evaporates into the air. When water evaporates, or turns from a liquid to a gas, it carries heat from your body and the surrounding air off with it. [5] X Research source This has a cooling effect that helps keep you comfortable as you work up a sweat or swelter under the sun. Most brands say their towels cool your skin to a breezy 59–65 °F (15–18 °C)."
    },
    {
      "title": "A regular towel will also get the job done.",
      "content": "A regular towel will also get the job done. Cooling towels are often made with specialty materials, like polyester varieties, that supposedly hold more water for longer, evaporate more evenly, and are more comfortable than normal towels. That may be true (it’s hard to say without a controlled lab test), but a normal washcloth or hand towel soaked in water will have about the same effect, and you probably already have one lying around. [6] X Research source Some users say they can’t tell for certain if the brand-name towel is actually more effective than a regular towel. If you prefer the specific look or feel of a branded cooling towel, go for it! They’re still relatively inexpensive, and there are worse ways to spend your money."
    },
    {
      "title": "Wash the towel with a gentle cycle after each day of use.",
      "content": "Wash the towel with a gentle cycle after each day of use. After a full day of using the towel, toss it into the laundry and run a gentle cycle with mild detergent, then hang the towel to air dry somewhere well-ventilated, like near a window. [7] X Research source Or, hand-wash the towel under warm water, working 2-3 drops of mild detergent into the towel. Then, rinse it until the water runs clear. Double check the care tag on your towel for washing instructions, and when in doubt, hand-wash it."
    },
    {
      "title": "Wear lightweight sunscreen to let your body sweat.",
      "content": "Wear lightweight sunscreen to let your body sweat. The same principle that makes a cooling towel work—evaporation—also wicks sweat off your skin to keep you cool. And while sunscreen is a must if you’re outdoors, thick or overly oily sunscreen can prevent your sweat from evaporating, stifling your skin. Wear just a thin layer of lightweight sunscreen and reapply it every hour or so. [8] X Research source"
    },
    {
      "title": "Drink about 11–15 c (2.6–3.5 L) of water to stay hydrated.",
      "content": "Drink about 11–15 c (2.6–3.5 L) of water to stay hydrated. Your body needs water to sweat and keep you cool, so keep a beverage on-hand to hydrate your body during the hot days. [9] X Research source It’s estimated that men need about 15 c (3.5 L) of water per day, while women need 15 c (3.5 L). [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Reach for a sports drink to also get vital sugars and salts, as well as hydration. Avoid caffeine and alcohol, which dehydrates your body and makes it harder for your body to regulate its temperature."
    },
    {
      "title": "Wear a damp t-shirt outside.",
      "content": "Wear a damp t-shirt outside. A damp t-shirt is like a cooling towel for your entire torso! If you’re spending time out in the sun, go ahead and soak a spare tee before you head out. [11] X Research source Just make sure it’s not one you’re too fond of—it may stretch or disform. Alternatively, dry but loose-fitting and light-colored clothing keeps you much cooler than thicker, dark-colored fabrics. [12] X Research source Or, wear sweat-wicking sportswear, which is made with breathable fabric that lets sweat evaporate off your body, unlike standard clothing, which traps sweat. A wet t-shirt also isn’t ideal if it’s humid, or if you’re exercising, as it may cause chafing or discomfort."
    },
    {
      "title": "Eat lighter meals to help your body feel cooler.",
      "content": "Eat lighter meals to help your body feel cooler. Heavy meals with loads of carbs or fats can make you feel sluggish or lethargic, as your body devotes energy to digesting them, which doesn’t help when you’re overheating. Instead, reach for light or moisture-filled foods, like fruits, veggies, or other healthy snack foods. [13] X Research source"
    }
  ]
}