{
  "url": "https://www.wikihow.com/Tell-If-Your-Car-Speakers-Are-Blown",
  "title": "4 Ways to Tell If Your Car Speakers Are Blown",
  "steps": [
    {
      "title": "Turn on the vehicle.",
      "content": "Turn on the vehicle. Most vehicles need to be turned on for the audio system to play. Unless your car is particular, you won't need to start the engine fully, which would only waste gas."
    },
    {
      "title": "Insert a CD or mp3 device with a full sound range.",
      "content": "Insert a CD or mp3 device with a full sound range. Pick something you play often in your car so you know what to listen for. This will help you spot anything that sounds unusual. You could also pick a song with a clear and familiar bass line."
    },
    {
      "title": "Turn the volume to an appropriate level.",
      "content": "Turn the volume to an appropriate level. If the audio is too low, it will be hard to tell if you have a blown speaker. This doesn't mean you should blast your whole neighborhood with tunes to diagnose your vehicle. Adjust the treble and bass, if necessary. Make sure that their levels are equal in the twelve o'clock position. When you hear a lack of range, it might just mean your system isn't equalized properly. [1] X Research source"
    },
    {
      "title": "Recognize distortion.",
      "content": "Recognize distortion. If you have trouble recognizing distortion, play a track on headphones or on another device. Then, play that same track through your car's sound system. If you hear crackles or the song sounds slightly muffled, one or more of your speakers might be blown. Listen for rattling. If the speaker is blown, you will likely hear a shaking, rattling sound. [2] X Research source"
    },
    {
      "title": "Listen for a lack of range.",
      "content": "Listen for a lack of range. If a certain bass, mid, or high speaker is blown, you will notice certain registers don't come through. This is easiest if you are familiar with the song and know what to listen for or expect."
    },
    {
      "title": "Isolate the speaker.",
      "content": "Isolate the speaker. If possible, use your audio system's fader controls to attempt to isolate the faulty speaker. By narrowing down one section of the car, you'll have a better chance of determining which speaker is blown. Always try to isolate the problem so you don't overspend and replace the entire system. Use the pan function to switch the sound from left to right. When panning, go 100% to either the left or right side to fully isolate it. Use the fade settings the same as the pan setting. Go 100% to the rear or front of your car. The most common signs to listen for are distorted or muffled sound, rattling or buzzing noises, lack of bass, or no sound at all."
    },
    {
      "title": "Remove the wires from the amplifier and attach them to a 9-volt battery.",
      "content": "Remove the wires from the amplifier and attach them to a 9-volt battery. Listen out for a brief popping sound from the speaker. This might require you to unscrew the speaker out of its holder. Only remove the wires if you're comfortable handling electronics."
    },
    {
      "title": "Inspect the speaker.",
      "content": "Inspect the speaker. Remove the speaker cover so you can inspect the speaker itself. Attach the wires to a 9-volt battery again and observe the speaker. If the cone moves, your problem is in the connection, not the speaker."
    },
    {
      "title": "Get a multimeter tester.",
      "content": "Get a multimeter tester. These simple electronic tools help measure ohms and voltages. They can be found at your local electronics store or hardware store. You can also use an ohmmeter."
    },
    {
      "title": "Test the ohms.",
      "content": "Test the ohms. Set your device to reading ohms if you're using a multimeter. Make sure that the speakers are turned off. Touch the lead of your device to each terminal of the speaker. The terminal is part of the speaker where the wires attach. If you get a reading of 1.0 ohms, that speaker is not blown, and the problem is elsewhere. If the device reads infinite ohms, then your speaker is blown."
    },
    {
      "title": "Understand how bad amplifiers can affect the sound.",
      "content": "Understand how bad amplifiers can affect the sound. If something is wrong with the amplifier, you will likely hear some sound distortion or nothing at all when you turn on your speakers. This is usually because there is something wrong with the fuse or the capacitor."
    },
    {
      "title": "Open the fuse box.",
      "content": "Open the fuse box. If you don't know where the fuse box is, you can check online or in the manual that came with your car, as each car will be a little different. A fuse box will usually be located in the front of the knee well or under the dashboard, however. [3] X Research source"
    },
    {
      "title": "Get out your multimeter and set it to the conductivity test.",
      "content": "Get out your multimeter and set it to the conductivity test. This will help you figure out whether or not the fuse is good or needs"
    },
    {
      "title": "Hook up the multimeter to the fuse box.",
      "content": "Hook up the multimeter to the fuse box. Touch the multimeter's red wire to one of the poles on the fuse. Touch the meter's black wire to the other pole."
    },
    {
      "title": "Listen for any beeps.",
      "content": "Listen for any beeps. If you hear a beep, the fuse is good, and your problem is likely with the capacitor. If you don't hear a beep, the fuse is blown and must be replaced. Be sure to get the exact same fuse model. If you hear a beep, consider replacing the amp first. They are usually less expensive and don't require soldering irons and desoldering pumps like new capacitors do."
    },
    {
      "title": "Turn on the car and test the speakers.",
      "content": "Turn on the car and test the speakers. They should be working now. If they don't, then there might be something else wrong with your car's speakers. Consider taking your car into the repair shop and having a professional take a look at it."
    },
    {
      "title": "Inspect the damage.",
      "content": "Inspect the damage. Visually look at the speaker once you've determined the speaker is faulty. Look for holes, tears, or splits on the speaker. Make sure the cover of the speaker is off so you can truly inspect it. Most damage that you'll be able to see will be on the cone of the speaker or the soft part. Gently run your hand along the cone to make sure there aren't any scrapes you can't see. Dust or dirt shouldn't affect the quality of the speaker, but it might be a good idea to clean them out."
    },
    {
      "title": "Repair minor damages.",
      "content": "Repair minor damages. If you only have a small tear, you can fix the damage with a sealer designed for speakers. If the damage is overwhelming, you'll probably need to replace the speaker."
    },
    {
      "title": "Test the remaining speakers.",
      "content": "Test the remaining speakers. Once you've determined one of your speakers is blown, you'll want to see if any of the other speakers are blown. Remove the faulty speaker if you haven't already done so. Play a track in your car and listen for speaker irregularities. If the problem persists in multiple speakers, consider replacing the entire system. Follow the above steps to test any other suspicious speakers."
    },
    {
      "title": "Let the professionals look.",
      "content": "Let the professionals look. Take your car or speaker to an automotive audio specialist. Explain the tests you gave and ask them what their estimate would be to inspect and repair the speaker or speakers. Be frank and ask if she thinks it'll be more price-effective to replace the set."
    }
  ]
}