{
  "url": "https://www.wikihow.com/Shorten-Backpack-Straps",
  "title": "How to Shorten Backpack Straps",
  "steps": [
    {
      "title": "Put the backpack on and adjust the straps.",
      "content": "Put the backpack on and adjust the straps. The cushion on the top of the strap should rest evenly and comfortably on top of your shoulders. The backpack should not sag below your behind. Instead, it should run parallel to your back when you are walking. [1] X Research source If you notice the backpack sagging below your behind, there may be too much weight in the backpack or you may need to get a backpack that has a reinforced bottom so it does not sag."
    },
    {
      "title": "Measure each side of the straps to ensure an equal distribution.",
      "content": "Measure each side of the straps to ensure an equal distribution. You can measure each strap by taking off the backpack and holding each strap taunt next to each other. Make sure both straps are the same length as uneven straps may strain your body, especially your neck and shoulders. As well, even straps will ensure there is an equal distribution of weight when you wear your backpack."
    },
    {
      "title": "Fold the remaining material.",
      "content": "Fold the remaining material. You may need to make one to two folds to tuck the straps under the tightening mechanism. You may also cut the remaining material if the straps are too long and you have no future use for them. Leave 2-4 inches for room to adjust. If you cut the material, melt the folded area with a lighter. [2] X Research source"
    },
    {
      "title": "Tuck the material under the mechanism.",
      "content": "Tuck the material under the mechanism. Feel free to reinforce the fold with some twine or rubber bands to help the straps to stay in place. You can tie the twine around the fold and secure it with a knot or wrap rubber bands around the fold to secure it in place."
    },
    {
      "title": "Adjust your bag straps to a comfortable length.",
      "content": "Adjust your bag straps to a comfortable length. The top of the straps should rest comfortably on your shoulders. You should put the backpack on and adjust the straps until the bag fits well, with no sagging below your behind."
    },
    {
      "title": "Cut the nylon straps.",
      "content": "Cut the nylon straps. You will need to cut them so there is 1 inch (2.5 cm) of extra nylon sticking out past the plastic adjustment mechanism. Use fabric scissors or kitchen shears to get a clean cut on both straps. [3] X Research source"
    },
    {
      "title": "Fold over the extra inch into a half-inch square.",
      "content": "Fold over the extra inch into a half-inch square. Then, staple over the fold about three times. Be careful, as this will leave no room for adjustment in the future! You may want to leave 3-4 inches of strap for future serious backpacking trips."
    },
    {
      "title": "Melt the folded area slowly with a cigarette lighter.",
      "content": "Melt the folded area slowly with a cigarette lighter. Make sure to do this outside as it will result in some smelly fumes that may not be ideal indoors or in an enclosed space. [4] X Research source Hold the lighter under the straps and slowly move it back and forth over the straps several times. The frays of the strap will melt into a single, thicker layer, which is too big to fit through the plastic adjustment mechanism. This will keep the rest of the strap from pulling through the adjustment mechanism."
    },
    {
      "title": "Remove the staples after the nylon has cooled.",
      "content": "Remove the staples after the nylon has cooled. Use a staple remover to avoid finger pricks or accidents. Make sure to throw out the staples afterwards."
    },
    {
      "title": "Put on the backpack and adjust the straps to a comfortable length.",
      "content": "Put on the backpack and adjust the straps to a comfortable length. Make sure the backpack is flush to your back and is not sagging past your behind. If you notice there are other straps on your backpack that are unnecessarily long, you can use this method to fold the straps."
    },
    {
      "title": "Place velcro or fastening tape on one end of the strap.",
      "content": "Place velcro or fastening tape on one end of the strap. You will need 5-6 inches of fastening tape per strap to ensure it can wrap around the folded strap. Fastening tape is the best option for this method, but you can also use rubber bands, zip ties, or twine."
    },
    {
      "title": "Fold and secure the straps.",
      "content": "Fold and secure the straps. Begin at the end of the straps and roll the straps so they lie flat and even in a bundle. Once the straps have been folded up, secure them with the fastening tape by wrapping the tape around the straps."
    }
  ]
}