{
  "url": "https://www.wikihow.com/Uninstall-Genshin-Impact",
  "title": "5 Simple Ways to Completely Uninstall Genshin Impact",
  "steps": [
    {
      "title": "Open the Control Panel.",
      "content": "Open the Control Panel. Click the Start menu and type in \"control panel\". Click the Control Panel . [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Use this method if you downloaded Genshin Impact on Windows 10 or Windows 11."
    },
    {
      "title": "Click Uninstall a program.",
      "content": "Click Uninstall a program . This will be underneath the Programs header."
    },
    {
      "title": "Click Genshin Impact.",
      "content": "Click Genshin Impact . If the list of applications aren't in alphabetical order, click the Name header to organize it."
    },
    {
      "title": "Click Uninstall.",
      "content": "Click Uninstall . This will be above the list, next to Organize . You might see \"Uninstall/Change\". A pop-up window will open. You can also right-click Genshin Impact and select Uninstall ."
    },
    {
      "title": "Click Yes.",
      "content": "Click Yes . Genshin Impact will begin uninstalling."
    },
    {
      "title": "Launch the Epic Games Launcher.",
      "content": "Launch the Epic Games Launcher. Similar to Steam , this is a digital game launcher where you can purchase and play games. If you downloaded Genshin Impact through Epic Games Launcher, you must use it to uninstall the game."
    },
    {
      "title": "Click Library.",
      "content": "Click Library . This will be on the left panel."
    },
    {
      "title": "Click Genshin Impact.",
      "content": "Click Genshin Impact . Your games will be listed in alphabetical order."
    },
    {
      "title": "Click the three dots below the Genshin Impact image.",
      "content": "Click the three dots below the Genshin Impact image. A menu will open."
    },
    {
      "title": "Click Uninstall.",
      "content": "Click Uninstall . Genshin Impact will begin to uninstall."
    },
    {
      "title": "Unlock your iPhone or iPad.",
      "content": "Unlock your iPhone or iPad. If you use a passcode or Face ID, use it to unlock your device. Genshin Impact is available for iOS in the App Store ."
    },
    {
      "title": "Long-press the Genshin Impact app.",
      "content": "Long-press the Genshin Impact app. This looks like Paimon's face. The apps will begin to shake."
    },
    {
      "title": "Tap Remove app.",
      "content": "Tap Remove app . If you're long-pressing the app from the App Library , you can directly select Delete app ."
    },
    {
      "title": "Tap Delete app.",
      "content": "Tap Delete app . This will be in red."
    },
    {
      "title": "Tap Delete.",
      "content": "Tap Delete . Genshin Impact will be removed from your device."
    },
    {
      "title": "Open the Google Play Store.",
      "content": "Open the Google Play Store. This looks like a multi-colored \"play\" icon. [2] X Research source Similar to deleting other apps, you'll need to use the Google Play Store to uninstall Genshin Impact."
    },
    {
      "title": "Tap your profile picture.",
      "content": "Tap your profile picture. This will be in the top-right corner. If you have multiple Google accounts connected, select the correct account from the drop-down menu."
    },
    {
      "title": "Tap Manage apps and devices.",
      "content": "Tap Manage apps and devices . A new page will open."
    },
    {
      "title": "Tap Manage.",
      "content": "Tap Manage . You'll see a list of installed apps."
    },
    {
      "title": "Tap Genshin Impact.",
      "content": "Tap Genshin Impact . You may need to scroll to find this option."
    },
    {
      "title": "Tap the delete icon.",
      "content": "Tap the delete icon. This will be in the top-right corner. Genshin Impact will be uninstalled."
    },
    {
      "title": "Open your PlayStation library and highlight Genshin Impact.",
      "content": "Open your PlayStation library and highlight Genshin Impact. This will be on your home page. You'll need your connected controller to uninstall games. If you aren't on your homepage, press the PS button on your controller."
    },
    {
      "title": "Press Options.",
      "content": "Press Options . This will be the button on the right side of the controller. A menu will open on the right side."
    },
    {
      "title": "Select Delete.",
      "content": "Select Delete . You can find this towards the bottom of the menu."
    },
    {
      "title": "Select OK.",
      "content": "Select OK . Genshin Impact will begin to uninstall."
    }
  ]
}