{
  "url": "https://www.wikihow.com/Use-Shea-Butter",
  "title": "The Best Ways to Use Raw Shea Butter",
  "steps": [
    {
      "title": "Use shea butter as a moisturizer.",
      "content": "Use shea butter as a moisturizer. Simply scoop some shea butter up from the jar and rub it over your skin, focusing on the areas that are dry (such as the hands, elbows, and feet)."
    },
    {
      "title": "Get rid of stretch marks or cellulite using shea butter.",
      "content": "Get rid of stretch marks or cellulite using shea butter. Since it is very high in Vitamins A, E & F, shea butter aids in cell regeneration and circulation. Vitamin A stimulates the production of collagen. [1] X Expert Source Heather Richmond, MD Board Certified Dermatologist Expert Interview. 15 September 2020. Apply a small amount of shea butter onto the affected areas and massage it in, much like you would with any other lotion When treating stretch marks, use the shea butter twice a day."
    },
    {
      "title": "Apply shea butter on your face before putting on makeup.",
      "content": "Apply shea butter on your face before putting on makeup. It makes a great moisturizer, and helps replenish the skin. You can also use it under your eyes if you have under eye bags or shadows."
    },
    {
      "title": "Use shea butter in homemade bath and beauty products.",
      "content": "Use shea butter in homemade bath and beauty products. Because of its moisturizing qualities and high-vitamin content, shea butter is a great ingredient for many homemade bath and beauty products, including: Body butters, and melts Body scrubs Soaps and lotions Lip balms Shaving cream"
    },
    {
      "title": "Soften and tame frizz using a shea butter hair mask.",
      "content": "Soften and tame frizz using a shea butter hair mask. Warm a few tablespoons of shea butter over the stove or in the microwave. Massage it into your hair, focusing on the dry ends first and moving gradually upwards towards the scalp. Tuck your hair under a shower cap and wait 30 minutes. Wash and rinse the hair mask out, then follow with your usual shampoo and conditioner. [2] X Research source"
    },
    {
      "title": "Gather your ingredients.",
      "content": "Gather your ingredients. To make some lip balm, you will need a double-boiler, some small containers, and the following ingredients: [3] X Research source 2 tablespoons beeswax 2 tablespoons shea butter 2 tablespoons coconut oil 6 – 12 drops essential oil (optional)"
    },
    {
      "title": "Set up your double-boiler.",
      "content": "Set up your double-boiler. If you do not have one, fill a large pot with a few inches of water, then place a large bowl on top of the pot. The bottom of the bowl should not be touching the water."
    },
    {
      "title": "Turn the stove on and bring the water to a simmer.",
      "content": "Turn the stove on and bring the water to a simmer. If you cannot see the water, then just watch for the steam."
    },
    {
      "title": "Add the beeswax, shea butter, and coconut oil into the double-boiler, and melt them.",
      "content": "Add the beeswax, shea butter, and coconut oil into the double-boiler, and melt them. Be sure to stir your ingredients often so that they melt evenly and become mixed."
    },
    {
      "title": "Consider adding some essential oil.",
      "content": "Consider adding some essential oil. You can leave your lip balm plain, or you can add some flavor to it with 6 to 12 drops of essential oil. Oils that would work well with shea butter include vanilla, lavender, and rose. After you have added the oils, give the mixture another stir to blend everything together."
    },
    {
      "title": "Transfer the lip balm to your containers.",
      "content": "Transfer the lip balm to your containers. Work quickly before the mixture hardens. You can use anything to store your lip balm, so long as it has a tight-fitting lid. If you are having difficulties pouring the mixture in, then you can use a spoon or eyedropper to transfer the mixture from the pot to the containers."
    },
    {
      "title": "Gather your ingredients.",
      "content": "Gather your ingredients. To make some luxurious shea butter body melts, you will need equal parts of shea, grated beeswax, and food-grade oil (such as olive oil or coconut oil). You will also need something to use as molds, such as a silicone ice cube tray or candy molds. If you want fragranced body melts, you can add a few drops of essential oil, such as rose, lavender, or vanilla."
    },
    {
      "title": "Set up a double-boiler.",
      "content": "Set up a double-boiler. If you do not have one, you can make your own by filling a large pot with 2 to 3 inches (5 to 7.5 centimeters) of water, and placing a large bowl on top. The bowl should fit snugly and not touch the water."
    },
    {
      "title": "Bring the water to a simmer.",
      "content": "Bring the water to a simmer. Set the heat on your stove to \"medium\" and wait for the water to begin steaming."
    },
    {
      "title": "Add the beeswax and wait for it to melt.",
      "content": "Add the beeswax and wait for it to melt. Be sure to stir if often so that it melts evenly and does not scorch."
    },
    {
      "title": "Add the rest of the ingredients.",
      "content": "Add the rest of the ingredients. Keep stirring until everything is melted and spread evenly throughout."
    },
    {
      "title": "Remove the mixture from heat and pour into your molds.",
      "content": "Remove the mixture from heat and pour into your molds. Work quickly so that the mixture does not harden while you are pouring it."
    },
    {
      "title": "Wait for the body melts to set, then use.",
      "content": "Wait for the body melts to set, then use. You can use them by massaging them over your skin. The wax and shea butter will melt, leaving a thin film on your skin. The film will get absorbed into your skin, leaving it feeling soft and smooth."
    },
    {
      "title": "Gather your ingredients.",
      "content": "Gather your ingredients. You can make some luxurious and moisturizing shaving cream using shea butter and a few other ingredients. Here is what you will need: [4] X Research source 1/3 cup coconut oil 1/3 cup shea butter ¼ cup olive oil"
    },
    {
      "title": "Melt the coconut oil and shea butter in a small pot.",
      "content": "Melt the coconut oil and shea butter in a small pot. Put the pot on the stove, and set the heat to \"low.\" Drop in your oil and butter and wait for both to melt. Be sure to stir every so often so that they melt evenly. Because of their low melting points, this should not take long."
    },
    {
      "title": "Pour the melted butter and oil into a bowl and add the olive oil.",
      "content": "Pour the melted butter and oil into a bowl and add the olive oil. Once the coconut oil and shea butter have melted, lift the pot off the stove and transfer everything into a heat-safe bowl. Add in the olive oil and stir to blend everything together. The liquid will look translucent."
    },
    {
      "title": "Put the bowl into the fridge and let it cool.",
      "content": "Put the bowl into the fridge and let it cool. As the oils and butters harden, they will turn an opaque yellow color. Consider labeling this bowl so that someone does not mistake your shaving cream for butter and eat it."
    },
    {
      "title": "Whip the hardened oils and butters until they become light and fluffy.",
      "content": "Whip the hardened oils and butters until they become light and fluffy. You can do this by using a hand mixer, or a food processor with a whisk attachment. This should take about three minutes."
    },
    {
      "title": "Transfer the shaving cream to a seal-able container and store it properly.",
      "content": "Transfer the shaving cream to a seal-able container and store it properly. Because of the low-melting points of coconut oil and shea butter, you will need to store your shaving cream in a cool, dry place."
    },
    {
      "title": "Consider using unrefined shea butter in cooking.",
      "content": "Consider using unrefined shea butter in cooking. The difference between unrefined and refined shea butter is that unrefined shea butter is pure, full of nutrients, and has a slight, nutty flavor; refined shea butter, on the other hand, lacks some of its natural nutrients and is also mostly odorless and flavorless. Buy the product from a reputed company. [5] X Expert Source Heather Richmond, MD Board Certified Dermatologist Expert Interview. 15 September 2020. If the price is extremely low compared to its retail price, the product may not be of good quality. [6] X Expert Source Heather Richmond, MD Board Certified Dermatologist Expert Interview. 15 September 2020."
    },
    {
      "title": "Replace butter with shea butter when cooking.",
      "content": "Replace butter with shea butter when cooking. If your recipe calls for regular butter, but you don't happen to have any at home, you can use shea butter as a substitute."
    },
    {
      "title": "Use shea butter when frying.",
      "content": "Use shea butter when frying. Instead of using cooking oil or butter, consider using some shea butter instead. It is solid at room temperature, but it has a low melting point and will soften quickly in the frying pan. It will also lend your food a nuttier flavor."
    },
    {
      "title": "Use shea butter when making chocolate.",
      "content": "Use shea butter when making chocolate. Instead of using butter, you can use shea butter instead. It will give the chocolate a slight, nut-like flavor."
    }
  ]
}