{
  "url": "https://www.wikihow.com/Speak-the-Ancient-Language-from-the-Inheritance-Cycle",
  "title": "How to Speak the Ancient Language from the Inheritance Cycle",
  "steps": [
    {
      "title": "There are three lines:",
      "content": "There are three lines: \"Atra esterni ono thelduin.\" This line is usually spoken by the person of lower status (e.g. a student greeting a teacher), or by the person of higher status as an honour. \"Atra du evarínya ono varda.\" This is the response of the second person. \"Un atra mor'ranr lifa unin hjarta onr.\" This is spoken by the first person to finish the greeting. The lines mean \"May good fortune rule over you, may the stars watch over you, and may peace live in your heart.\""
    },
    {
      "title": "The grammar is similar to English, with a few twists:",
      "content": "The grammar is similar to English, with a few twists: Adjectives come after nouns. For example, \"the white dragon\" would be written as \"du skulblaka hvitr\", with the adjective (hvitr) coming after the noun (skulblaka). the nouns can be in any order. This applies to adjectives describing who the noun belongs to, so \"my hand\" would be written as \"lam iet\" There are no \"-ing\" verbs. There are past simple (walked, swam), present simple (I walk, I swim) and future simple (I will walk, I will swim). Two nouns can be joined to form one. If this happens, the descriptive noun comes first. For example, \"skulblaka\" (dragon) is a combination of \"skul\" (scale) and \"blaka\" (flapper)."
    },
    {
      "title": "Future tense form just uses the word \"weohnata\" (will) in front of the present tense.",
      "content": "Future tense form just uses the word \"weohnata\" (will) in front of the present tense. -í : past tense of verbs not ending in -ir. Note that the i has an accent. -o : past tense of verbs ending in -ir. -ar : plural for nouns ending with a consonant. For nouns that end in -consonant-r, add an a between the consonant and the r to form the -ar ending. -ya : plural for nouns ending in a vowel or -vowel-r. For -vowel-r, replace the vowel and the r with -ya. For vowel, replace the vowel with -ya, unless -ya interferes with pronunciation, in which case just add the -ya after the vowel. Vowels \"a\" and \"i\" are usually changed to e. For example, \"celöbra\" becomes \"celöbreya\""
    },
    {
      "title": "There are a few other suffixes and prefixes that crop up sometimes.",
      "content": "There are a few other suffixes and prefixes that crop up sometimes. It's worth knowing how to use them: -r : gives nouns a masculine connotation. -s : makes nouns possessive. -sja : adds \"-looking\" to the end of adjectives. For example, \"ramr\" (strong) becomes \"ramrsja\" (strong-looking). äf- : gives words a malignant connotation. eld- : changes verbs into words of action. For example, \"jierda\" (break) becomes \"eld jierda\" (breaker)."
    },
    {
      "title": "These are said after a person's name, and are usually attatched with a hyphen.",
      "content": "These are said after a person's name, and are usually attatched with a hyphen. Each has a different meaning. elda : gender neutral, indicates great praise. finiarel : young man of great promise. svit-kona : woman of great wisdom. Not attached with a hyphen. vodhr : male honorific, indicates middling praise. vor : male honorific for a close friend."
    },
    {
      "title": "The language is used for magic.",
      "content": "The language is used for magic. Thus, the more words you know, the more magic you could perform (in general, some solutions could be improvised from relatively few words). Brisingr - fire Deloi - earth (not to be confused with delois, a type of plant) Vindr - air, wind Adurna - water Jierda - break Thrysta - thrust, compress Fricai - friend Neiat - not Weohnata - will Haina - harm Ono - you Iet - my (capital i at the start, not lowercase L) Nosu - us Eka - I Vae - we Stenr - stone Reisa - raise Malthinae - bind, hold in place Abr - of Aí - a Un - and Unin - in Thäet - it Shur'tugal - dragon rider"
    },
    {
      "title": "These are useful phrases to know to communicate with others you might come across:",
      "content": "These are useful phrases to know to communicate with others you might come across: Eka ai shur'tugal un fricai - I am a dragon rider and a friend. Kvetha fricai/fricaya - Greetings, friend/friends (less formal greeting). Vel eïnradhin iet ai Shur'tugal - Upon my word as a rider."
    },
    {
      "title": "Besides being used for magic, the language has a few traits that make it very important:",
      "content": "Besides being used for magic, the language has a few traits that make it very important: Anything said in the language is unquestionably true. However, this only applies to the exact translation of what is being said: it is possible to say something that is technically true, but mean something completely different. Names have power over the person, creature or item being named. Being a language of truth, anything's name in the language is it's true name: it describes it absolutely, and can be used to gain power over the thing that it belongs to. This is why hardly anybody knows the true name of the language itself: it could be used to control the entire language, and by extension, anybody using it. Oaths made in the language cannot be broken. You can't lie in the language, so any oath or contract that you make in it has to be obeyed. However, you can exploit any loopholes that you may find to get you out of obeying."
    },
    {
      "title": "Familiarize yourself with complex vocab lists.",
      "content": "Familiarize yourself with complex vocab lists. Just type in \"The Ancient Language\" on Google, and it comes up with lots of word lists and dictionaries that people have made. The main ones are on Paolini.net and the Inheritance wiki."
    }
  ]
}