{
  "url": "https://www.wikihow.com/Sneak-Around-at-Night-(for-Kids)",
  "title": "A Complete Guide for Sneaking Around at Night",
  "steps": [
    {
      "title": "Check for squeaky floors and loud doors during the day.",
      "content": "Check for squeaky floors and loud doors during the day. Plan out which rooms you want to sneak into at night. Try to walk from your bedroom to all the rooms without making any noise. Listen for any squeaks or creaks so you know which areas to avoid at night. Some fun things to do while you’re sneaking around could be playing on the computer, going on your phone, or getting a snack. Write down any noisy spots you find in a notebook so you don’t forget where they are. If your parents ask you what you’re doing, tell them that you’re pretending to be a ninja or playing a game you made up so it doesn’t seem as suspicious. Turn off anything that’s making noise while you practice sneaking around so you can get an idea of how quiet it will be at night."
    },
    {
      "title": "Wait until your parents go to bed.",
      "content": "Wait until your parents go to bed. It might be tempting to sneak around earlier in the night, but your parents may spot you if they’re still awake. Try to find out what time they normally go to bed, and patiently wait until they fall asleep before leaving your room. If you want to check if your parents are asleep, try creeping up to their bedroom door and listening for heavy breathing or snoring. Wait about 10–20 minutes after your parents go to their bedroom so they have time to fall asleep. It will be easier to sneak around at night if your parents sleep with their bedroom door closed instead of leaving it open."
    },
    {
      "title": "Wear socks to make your footsteps quieter.",
      "content": "Wear socks to make your footsteps quieter. Find the thickest pair of socks you own and put them on. If you don’t have thick socks, just put on 2 pairs so you can walk around quietly. Practice walking around in your socks so you don’t accidentally slip and make a loud noise. If you plan on sneaking outside, wait to put on your shoes until you’re out the door so you don’t make loud footsteps."
    },
    {
      "title": "Put on dark pajamas to stay hidden.",
      "content": "Put on dark pajamas to stay hidden. Put on tight pajamas so they don’t get caught or cause you to trip while you’re sneaking around. Pick dark black, blue, or brown so you blend in with the shadows better. That way, you may be able to hide in the dark if your parents wake up. [1] X Research source Stay in your pajamas even if you plan on sneaking outside. That way if you’re caught while you’re still in the house, you can tell them that you were just getting a glass of water or going to the bathroom."
    },
    {
      "title": "Walk slowly so your toes touch the ground first.",
      "content": "Walk slowly so your toes touch the ground first. When you want to walk silently , put your weight on your toes first. Slowly lower your heel down and shift your weight so you don’t make the floors squeak. Watch your step so you don’t accidentally kick or step on anything in the dark. [2] X Research source Even though walking on your tiptoes seems like it would be quieter, you’re more likely to trip or lose your balance. Practice taking slow steps around your home without making any noise during the day so you’re easily able to sneak around later. Lean against a wall as support if you’re worried about falling or tripping."
    },
    {
      "title": "Open and close doors slowly.",
      "content": "Open and close doors slowly. Turn the doorknob or handle all the way before opening or closing a door so the latch doesn’t catch. Keep your hand on the knob and push the door open just far enough so you can sneak out. Hold the handle on the other side of the door and gently close it. [3] X Research source If you open a closed door while sneaking around, be sure to close it again right away. Your parents may be suspicious if they find the door open. If the door has a lock, try to turn it as slowly as possible so it doesn’t make a loud noise. Doors with squeaky hinges sometimes make less noise if you open them quickly. Test your doors during the day to see which way makes the least noise."
    },
    {
      "title": "Stay close to the wall if you’re using stairs.",
      "content": "Stay close to the wall if you’re using stairs. Avoid stepping in the middle of the stairs since that’s usually where they’re the squeakiest. Hold onto the wall or railing for support so you don’t trip or fall. [4] X Research source"
    },
    {
      "title": "Make an excuse if your parents wake up and catch you.",
      "content": "Make an excuse if your parents wake up and catch you. If your parents find you sneaking around your home, give them a believable reason for why you’re awake. Try saying that you needed a glass of water or that you had to go to the bathroom so they don’t get suspicious. After your parents catch you, go right back to your bedroom to make it look like you’re going to fall asleep. You can try sneaking around again when your parents go back to bed, but they may be more aware that you’re awake. Try to stay relaxed when your parents ask what you were doing. Try making eye contact and staying still so they don’t think you’re lying. [5] X Research source"
    },
    {
      "title": "Plan how you’re going to leave during the day.",
      "content": "Plan how you’re going to leave during the day. Figure out the easiest path from your bedroom to the door so you can easily sneak outside at night . Practice sneaking around during the day to see if there are any noisy floors or doors you should avoid later at night. [6] X Research source If you’re planning to meet up with friends, talk to them to figure out where you want to meet beforehand. If you notice squeaky hinges on doors, try pointing it out to your parents during the day to see if they fix it. Say something like, “That door is really squeaky, we should fix it.” Check if your home has any alarms or security cameras near the entrances. If your home has a security system, you may not be able to sneak out without your parents noticing."
    },
    {
      "title": "Put items you want to take with you into a backpack.",
      "content": "Put items you want to take with you into a backpack. Bring things like clothes, your cell phone, and your wallet, and pack them tightly into a bag before you fall asleep. Keep the backpack near the door you’re leaving from before you sleep so you don’t have to carry it through your home late at night. Try to hide the backpack outside if you’re positive that no one else could steal it. Make sure your backpack doesn’t have any loud zippers or keychains hanging from it or it will be difficult to sneak in and out."
    },
    {
      "title": "Hide pillows under your sheets so it looks like you’re sleeping.",
      "content": "Hide pillows under your sheets so it looks like you’re sleeping. Stuff any extra blankets, pillows, or stuffed animals under your bedsheets. Position them in the shape of your body and pull the covers up so it looks like you’re fast asleep for the night. If you’re sure that your parents won’t check in on you during the night, you may be able to skip this step."
    },
    {
      "title": "Take a spare key with you.",
      "content": "Take a spare key with you. Look for a spare door key during the day and keep it with you at all times when you’re sneaking out. When you leave your home, slowly close and lock your door. Turn the key as slowly as you can so the lock doesn’t click loudly inside. [7] X Research source Avoid bringing a key ring since they may jingle and make a lot of noise while you’re trying to lock and unlock the doors. Don’t leave doors or windows unlocked because it could make your home vulnerable to break-ins."
    },
    {
      "title": "Put on your shoes once you’re outside.",
      "content": "Put on your shoes once you’re outside. Carry your shoes as you sneak through your home and out the door. Once you’re outside, make sure you are away from your parents’ bedroom window and slip on your shoes. [8] X Research source Wearing your shoes while you’re inside can make your footsteps sound a lot louder and could wake your parents up. Avoid wearing shoes that squeak or make loud noises when you walk, like old sneakers, flip-flops, or heels."
    },
    {
      "title": "Get home before your parents normally wake up.",
      "content": "Get home before your parents normally wake up. Learn your parents’ schedule so you know when they get up for the morning. When you get back home after sneaking out, take off your shoes outside and let yourself in quietly. Get back into bed so it looks like you were sleeping the whole time. If your parents find you when you’re back inside, just tell them that you thought you heard a noise or were getting a small snack."
    },
    {
      "title": "Tell your parents the truth if you get caught.",
      "content": "Tell your parents the truth if you get caught. If your parents woke up and saw you were gone, they may be worried or upset that you snuck out late at night. Tell the truth about where you were and what you were doing so your parents don’t get more upset. Even though they may punish you for breaking rules, they’ll appreciate that you were being honest with them. [9] X Research source Call your parents if there’s an emergency or if you’re in an uncomfortable situation. While they may be mad that you snuck out, they’ll be able to help you out."
    }
  ]
}