{
  "url": "https://www.wikihow.com/Unclog-a-Kitchen-Sink-with-a-Garbage-Disposal",
  "title": "How to Unclog a Kitchen Sink with a Garbage Disposal",
  "steps": [
    {
      "title": "Turn off the garbage disposal using the switch or breaker.",
      "content": "Turn off the garbage disposal using the switch or breaker. Switch the power to the garbage disposal off at the circuit breaker to be extra safe, or unplug the garbage disposal where it’s connected under the sink. This ensures you won’t be working with the garbage disposal while it’s connected to electricity. [1] X Research source If you’re not sure where your circuit breaker is, opt to unplug the garbage disposal instead."
    },
    {
      "title": "Put a plug in one of the drains if it’s a double sink.",
      "content": "Put a plug in one of the drains if it’s a double sink. Choose a drain to cover with a drain plug—it doesn’t matter which one. The drain that you don’t put a plug in will be the drain that you’ll plunge. [2] X Research source If you don’t have a double sink, skip this step."
    },
    {
      "title": "Cover the unplugged drain with a plunger.",
      "content": "Cover the unplugged drain with a plunger. Situate the plunger so it’s covering the whole drain. If you have a double sink, keep one hand pressed down on the plug so it doesn’t come up when you start plunging. [3] X Research source Turn on the faucet and let water run over the edges of the plunger to help seal it against the drain."
    },
    {
      "title": "Push down and up with the plunger to force air into the drain.",
      "content": "Push down and up with the plunger to force air into the drain. While still holding down the plug with one hand, start plunging the open drain. Push the plunger down and up several times, stopping roughly every 5 times to see if the water will drain yet. This should clear the drain of any objects blocking it. [4] X Research source The plunger will ideally loosen any food that’s clogging the disposal. Remove the plunger once the water starts draining from the sink."
    },
    {
      "title": "Turn the garbage disposal back on and see if everything is working properly.",
      "content": "Turn the garbage disposal back on and see if everything is working properly. [5] X Expert Source Allen Lee Home Improvement Specialist Expert Interview. 10 July 2020. Once the water has drained from the sink, unplug the other sink and wait for that water to drain as well. Turn the garbage disposal back on and test it to see if food is now able to go down it without causing a clog. [6] X Research source Turn the garbage disposal back on by plugging the plug back in under the sink or turning back on the breaker switch."
    },
    {
      "title": "Unplug the garbage disposal or turn it off at the breaker.",
      "content": "Unplug the garbage disposal or turn it off at the breaker. The plug to the garbage disposal is located under the sink. Turning off the power to the garbage disposal is important so you're working with the disposal safely. [7] X Research source Plug the disposal bag in to a power source once you're finished unclogging it, or turn back on the circuit breaker."
    },
    {
      "title": "Pour 0.25 cups (59 ml) of baking soda into the garbage disposal.",
      "content": "Pour 0.25 cups (59 ml) of baking soda into the garbage disposal. Measure out the baking soda using a measuring cup. Pour it directly into the drain, making sure to hold it right over the center of the drain so it goes straight down. [8] X Research source"
    },
    {
      "title": "Add 0.5 cups (120 ml) of white vinegar down the drain.",
      "content": "Add 0.5 cups (120 ml) of white vinegar down the drain. Measure out the white vinegar before carefully pouring it down the drain just as you did with the baking soda. When white vinegar and baking soda combine, they create a cleaning chemical that helps to loosen any food that’s stuck to the sides of the drain. [9] X Research source Don't be alarmed when the ingredients start fizzing when they touch each other—this means it's working! Pour the white vinegar slowly to make sure it all goes down the drain."
    },
    {
      "title": "Let the mixture sit in the drain for 5-10 minutes.",
      "content": "Let the mixture sit in the drain for 5-10 minutes. During this time, the ingredients will continue to fizz and create foam. Set a timer for 5-10 minutes so you know when it’s time to rinse out the drain. [10] X Research source"
    },
    {
      "title": "Run hot water down the drain for a few minutes.",
      "content": "Run hot water down the drain for a few minutes. Turn the faucet to the hottest setting possible. Let the water run down the drain for at least 2 minutes, washing away the white vinegar and baking soda mixture while removing any loosened food as well. [11] X Research source"
    },
    {
      "title": "Turn on the garbage disposal to test it out.",
      "content": "Turn on the garbage disposal to test it out. Plug the garbage disposal back in or turn back on the circuit breaker. Flip the garbage disposal switch to see if it runs smoothly, listening for its normal loud sound that signals it’s fixed. [12] X Research source If this doesn’t fix the clog, use a flashlight to see if anything is caught in the drain."
    },
    {
      "title": "Check that the garbage disposal is off so you don’t injure yourself.",
      "content": "Check that the garbage disposal is off so you don’t injure yourself. Unplug the plug that powers the garbage disposal, found under the sink. Or, turn off the power connected to the garbage disposal at the circuit breaker. [13] X Research source It’s important that the garbage disposal not have electricity running through it as you’re working on it to keep you safe."
    },
    {
      "title": "Shine a flashlight down the drain to look for objects clogging the drain.",
      "content": "Shine a flashlight down the drain to look for objects clogging the drain. Turn on a flashlight and shine it directly down the drain, illuminating what’s inside. Look to see if there’s anything clearly blocking the drain, such as a large piece of food or other object. [14] X Research source"
    },
    {
      "title": "Use tongs or pliers to remove the items if you can see any.",
      "content": "Use tongs or pliers to remove the items if you can see any. Find a long pair of tongs that will reach the object, or use a pair of pliers. Hold onto the tongs or pliers as you put them down the drain before clamping down on the object to pull it out. [15] X Research source Shine the flashlight down the drain as you’re using the tongs if necessary, helping you see what you’re doing. Garbage disposals often have sharp things in them, so it’s not a good idea to stick your hand down there."
    },
    {
      "title": "Turn the garbage disposal back on and see if it works.",
      "content": "Turn the garbage disposal back on and see if it works. Once you think you’ve removed the object that was causing the clog, turn the garbage disposal’s power back on and test it out. If the disposal starts up its regular whirring sound and water is flowing down it normally, it’s good to go! [16] X Research source"
    },
    {
      "title": "Turn the garbage disposal off at the breaker or unplug it from the wall.",
      "content": "Turn the garbage disposal off at the breaker or unplug it from the wall. Look under the sink to unplug the garbage disposal's plug. Alternatively, turn off the main power to the garbage disposal at the circuit breaker in your house. [17] X Research source Sometimes circuit breakers are located outside of your house, so check there as well as the garage or basement if you're not sure where it is."
    },
    {
      "title": "Insert an Allen wrench into the hole at the bottom of the garbage disposal motor.",
      "content": "Insert an Allen wrench into the hole at the bottom of the garbage disposal motor. Get down under your sink and look at the bottom of the garbage disposal. Locate a small hole right in the center of the disposal, which is where your Allen wrench is inserted. [18] X Research source Some garbage disposals come with a hex tool that fits in the hole just for this purpose."
    },
    {
      "title": "Twist the wrench back and forth to help clear the disposal.",
      "content": "Twist the wrench back and forth to help clear the disposal. With the wrench securely in the hole, start moving it back and forth. This manually turns the blades of the garbage disposal, hopefully dislodging anything that’s caused a blockage. [19] X Research source As you’re twisting the Allen wrench back and forth, notice if the blades suddenly feel like they’re unclogged as it gets easier to twist."
    },
    {
      "title": "Press the reset button after you’ve finished unclogging it.",
      "content": "Press the reset button after you’ve finished unclogging it. This button is red (or sometimes black) and is also on the bottom of the garbage disposal. Press this once to reset the garbage disposal so that it works again. [20] X Research source When the garbage disposal stops working, the button usually pops out. Pushing it back in signifies that you’ve fixed it and it should start working again."
    },
    {
      "title": "Switch the garbage disposal back on to see if it now works.",
      "content": "Switch the garbage disposal back on to see if it now works. Turn the power to the garbage disposal back on and test it to see if it’s working. Turn the water on as you’re testing it and listen for the loud whirring noise meaning it’s fixed. [21] X Research source"
    }
  ]
}