{
  "url": "https://www.wikihow.com/Write-a-Hamburger-Paragraph",
  "title": "How to Write a Hamburger Paragraph",
  "steps": [
    {
      "title": "Write a topic sentence as the \"top bun\" of your hamburger.",
      "content": "Write a topic sentence as the \"top bun\" of your hamburger. The topic sentence should tell you what the paragraph is about. For example, if you were writing about your best friend your topic sentence might be something like this: \"Allie is a really great friend.\" [1] X Research source"
    },
    {
      "title": "Add a detail as your tomato.",
      "content": "Add a detail as your tomato. The tomato is going to be a detail. A detail should some how connect with the topic sentence. An example is: \"Allie is always there for me, no matter what.\" [2] X Trustworthy Source Reading Rockets Online resource supported by PBS providing research-based strategies for assisting children to become confident readers Go to source"
    },
    {
      "title": "Layer on another detail as the cheese.",
      "content": "Layer on another detail as the cheese. The cheese is going to be another detail that connects with the topic sentence. An example is; \"Allie is a really good friend because she helps me with my homework.\" [3] X Research source"
    },
    {
      "title": "Add another sentence as your burger.",
      "content": "Add another sentence as your burger. The burger is just another detail that connects with the topic sentence. An example is: \"Allie is lots of fun when we play together.\" [4] X Research source"
    },
    {
      "title": "Add the lettuce, another detail that connects with the topic sentence.",
      "content": "Add the lettuce, another detail that connects with the topic sentence. An example is: \"Allie is a really good friend because she makes me happy when I am sad.\" [5] X Research source"
    },
    {
      "title": "Offer up the onions.",
      "content": "Offer up the onions. The onions will be the last detail that connects with the topic sentence. An example is: \"Allie shares her lunch with me, when I forget mine.\" [6] X Research source"
    },
    {
      "title": "Finish up with the bottom bun.",
      "content": "Finish up with the bottom bun. It will wrap up the whole paragraph. An example is: \"I am really glad Allie is my friend and I would not be the person I am today without her.\" [7] X Trustworthy Source Reading Rockets Online resource supported by PBS providing research-based strategies for assisting children to become confident readers Go to source"
    },
    {
      "title": "Analyse your finished paragraph.",
      "content": "Analyse your finished paragraph. Here's our example in all its glory. Allie is a really great friend. Allie is always there for me, no matter what. Allie is a really good friend because she helps me with my homework. Allie is lots of fun when we play together. Allie is a really good friend because she makes me happy when I am sad. Allie shares her lunch with me, when I forget mine. I am really glad Allie is my friend and I would not be the person I am today without her.If you think your paragraph is of a similar structure and quality as this example, well done, you've written a hamburger paragraph."
    },
    {
      "title": "Review it again and consider any possible improvements.",
      "content": "Review it again and consider any possible improvements. My friend Allie is really great, always there for me when I need her, no matter what. If I need help with my homework, Allie helps me. We have fun playing together too, lots of fun. Allie always makes me happy whenever I am sad, even if I am sad because I'm hungry! Allie shares her lunch with me if I have forgotten mine. I am really glad Allie is my friend: I would not be the person I am today without her. Which paragraph do you think is better? [8] X Trustworthy Source Reading Rockets Online resource supported by PBS providing research-based strategies for assisting children to become confident readers Go to source"
    }
  ]
}