{
  "url": "https://www.wikihow.com/Use-a-Fiskars-Circle-Cutter",
  "title": "How to Use a Fiskars Circle Cutter",
  "steps": [
    {
      "title": "Loosen the clear knob",
      "content": "Loosen the clear knob by turning it counterclockwise."
    },
    {
      "title": "Slide the clear arm in or out",
      "content": "Slide the clear arm in or out to set the diameter of the circle you want to cut, using the markings on the arm: one side measures inches, the other side is marked in centimeters. Note: The markings set the diameter of the circle you will cut, but the length of the arm is actually radius of circle, which is 1/2 the diameter. For example, if you move the arm out by 1\", you increase the diameter of the circle by 2\"."
    },
    {
      "title": "Tighten down the clear knob",
      "content": "Tighten down the clear knob by turning it clockwise."
    },
    {
      "title": "Remove one of the small, blue caps",
      "content": "Remove one of the small, blue caps and tip the cutter upside down to remove a blade."
    },
    {
      "title": "Install this blade at the end of the arm",
      "content": "Install this blade at the end of the arm , making sure that the flat sides line up and the blade itself is perpendicular to the arm. Push it in all the way, using the orange edges. Don't touch the cutting tip."
    },
    {
      "title": "Center the orange post",
      "content": "Center the orange post in the center of the cutter over the center of the circle you wish to cut. You may wish to turn the cutter all the way around before you cut to be sure your circle does not extend over the edge of the material you are cutting."
    },
    {
      "title": "Press down firmly on the orange knob",
      "content": "Press down firmly on the orange knob to hold the rubber pad against the item you're cutting."
    },
    {
      "title": "Rotate the clear, outer ring around the orange post",
      "content": "Rotate the clear, outer ring around the orange post to cut the circle. Go all the way around, and make sure the cut goes all the way through. You may have to make more than one pass for thicker materials, and you may want to press down on the end of the arm as you go. Try not to let up on the orange post or let the center of the circle cutter slip."
    },
    {
      "title": "Separate the circle from the surrounding material.",
      "content": "Separate the circle from the surrounding material. Go slowly, in case there are parts that are not cut all the way through."
    },
    {
      "title": "Remove the blade from the arm",
      "content": "Remove the blade from the arm and replace it in the holder, covered with the blue cap for storage. Loosen the arm and return it to a medium position for storage."
    }
  ]
}