{
  "url": "https://www.wikihow.com/Use-Kik",
  "title": "How to Use Kik",
  "steps": [
    {
      "title": "Register an account.",
      "content": "Register an account. Start by opening Kik on your mobile device. Touch the \"Register\" button. On the New Account screen, fill in your personal information in the appropriate boxes, then touch \"Register\" to open your account. On the other hand, if you already have an account, simply touch \"Log In\" and provide your details."
    },
    {
      "title": "Search your phone's contacts for Kik users.",
      "content": "Search your phone's contacts for Kik users. The first time you open Kik, the program will ask you if you want to find your friends. If you agree to this, Kik will use the names, phone numbers, and email addresses in your phone's contact list in order to find anyone you know using Kik. If you choose not to do this now, don't worry — you can always do this manually later by tapping the gear icon on the home screen, then going to Chat Settings > Address Book Matching."
    },
    {
      "title": "Find additional friends on Kik manually.",
      "content": "Find additional friends on Kik manually. If you want to add someone on Kik that the program couldn't find in your contacts list, you can add friends at any time in just a few seconds. Start by touching the speech bubble in the top right corner. Then, in the search field, type your friend’s Kik username or real name. Once you start adding friends in Kik, the speech bubble will also show a list of your friends. You can also search for Kik interest groups by searching for keywords related to your interest (e.g., \"cars,\" \"computers,\" \"style,\" etc.). You can even make your own group by tapping the \"Start a Group\" button.\""
    },
    {
      "title": "Confirm your email address.",
      "content": "Confirm your email address. When you get the chance, confirming your email address with Kik is a good idea, as this lets you retrieve your password if you lose it. To do this, open your email and look for an email from Kik with the subject “Welcome to Kik Messenger! Confirm your details inside...‏” Open the email and click where it says “Click here to complete your sign-up\" to confirm your email. If you don’t see this email, check any junk or spam mail folders. If you still don't see the email, you can have Kik resend it — see the \"Troubleshooting\" section below for more information."
    },
    {
      "title": "Send a message to a friend.",
      "content": "Send a message to a friend. Sending messages with Kik is easy! On the speech bubble menu, touch a friend’s name to open a chat. Touch the \"Type a message\" box, then type your message. Touch \"Send\" when you're done. That's it! Note that, on some devices, the \"Send\" button will look like a blue speech bubble. If you don’t see the Send button, touch the speech bubble to send your message instead."
    },
    {
      "title": "Add an emoticon to a message.",
      "content": "Add an emoticon to a message. Emoticons are fun themed graphics and smiley faces that you can use to add character and flair to your messages. To add an emoticon, touch the smiley face button while you're typing a message to a friend. A menu with many different choices should pop up. Touch an emoticon to choose it. If you want more options, you can buy additional emoticons in the Kik store. In the emoticon window, touch the + button to go to the Kik store. See \"Using Extra Features\" below for more information."
    },
    {
      "title": "Send a photo or video.",
      "content": "Send a photo or video. When you're typing a message to a friend, to the left of the \"Type a message\" box, you should see a small + button. Press this. If you’ve given Kik access to your camera roll, you should see your photos and videos. Touch a photo to add it to your message. If you want, you can also type a message with your photo or video. Touch Send or the speech bubble button as normal to send the content. Note: On some mobile devices, especially iOS, the first time you try to send a photo or video from your camera roll, Kik will ask you if it can access your photos. Give the program your permission to continue. You can also change this setting in your iOS Settings app by scrolling down to the Kik app settings, and then changing the Privacy settings."
    },
    {
      "title": "Take a photo to send.",
      "content": "Take a photo to send. You aren't limited to sending photos you've already taken — with Kik, you can also record and send them on the fly! To the left of the \"Type a message field,\" touch the + button, then touch the camera button. You should see a view of your device's camera pop up. Touch the white circle to take a picture, then touch the Send button. Note: Again, on some devices, especially iOS, the first time you try to take a photo or video using Kik, it will ask you if it can access the Camera app. You can also change this setting in your iOS Settings app by scrolling down to the Kik settings, and then changing the Privacy settings."
    },
    {
      "title": "Use the globe icon to send other content.",
      "content": "Use the globe icon to send other content. In addition to photos and videos from your phone, with Kik, you can also send YouTube videos, sketches, images and more. Doing this is easy — just touch the + button, then touch the globe icon. A small menu of options should pop up. Select the one you want. Your options are: Stickers: Small images that you can buy in the Kik store. Some stickers are free, while others require money or Kik points (Kp). Youtube Videos: Lets you browse and send videos from YouTube. Sketch: Lets you draw a picture. Image Search: Lets you search the internet for images according to the keyword you type in (e.g., \"flowers,\" \"landscapes,\" etc.) Memes: Lets you create your own custom \"meme\" images (e.g., Socially Awkward Penguin, etc.) Top Sites: Lets you browse and link from a list of hot websites. Note that the Kik points site , where you can earn Kp for buying stickers and so on, is in this list."
    },
    {
      "title": "Know how to delete images or videos before sending.",
      "content": "Know how to delete images or videos before sending. Accidentally tap on the wrong picture? Undoing a mistake is easy. To delete an image or video, before sending it, touch the image or video, and then touch \"Delete.\" Careful — you can't delete content after you've already sent it."
    },
    {
      "title": "Set your profile picture.",
      "content": "Set your profile picture. Your profile picture is what other people see when they're chatting with you. By default it is blank, but it's easy to set it to show a picture of yourself or something else. To do this, just use the following steps: Tap the gear icon at the top of the Kik home screen. On the next page, tap \"Set Photo.\" Pick \"Take Picture\" to take a picture of yourself or pick \"Choose Existing\" to browse your camera roll for a picture to use."
    },
    {
      "title": "Personalize your chat bubble color.",
      "content": "Personalize your chat bubble color. Bored of the default green chat bubble for your messages? Use the following steps to change it to the color you wish: Tap the gear icon at the top of the Kik home screen. Tap \"Chat Settings.\" Tap \"Chat Bubble Color.\" Tap the color you would like from the list of options."
    },
    {
      "title": "Try downloading new emoticons.",
      "content": "Try downloading new emoticons. Once you start using emoticons, it can be surprising how quickly you get used to throwing them into your messages. If you get tired of your basic selection of emoticons, try using the following steps to get more: Start a message to one of your friends. Tap the emoticon button. Tap the + button in the right corner of the menu that pops up. Select the emoticons you want from the shop."
    },
    {
      "title": "Try messaging the Kik Team for fun.",
      "content": "Try messaging the Kik Team for fun. Before you add anyone else to your list of contacts, you will have one already pre-set: a contact named \"Kik Team.\" This is a support bot — a simple program that will try to answer any questions you ask it. It also has a number of witty one-liners and anecdotes in its repertoire, so try sending it any message you like and seeing what it has to say! You can also send it pictures and videos to have it comment on them. If you ask the Kik Team bot for help (for instance, with a message like \"I need help\"), it will give you a link to the Kik support page at help.kik.com."
    },
    {
      "title": "If you can't find the Kik confirmation email, resend it.",
      "content": "If you can't find the Kik confirmation email, resend it. Resending a confirmation email if you can't find the original or it's expired only takes a few minutes. You do this with the Kik app on your mobile phone , not your computer. Use the following steps: Tap the gear icon at the top of the Kik home screen. Tap \"Your Account.\" Tap \"Email\" and ensure your address is correct. Tap \"Email is Unconfirmed.\" When the message pops up asking if you want Kik to send a new email, tap \"Yes\" to confirm. Note: On Windows Phone, this process is a little different. After going to the \"Your Account\" page, you need to tap \"Account Status,\" then tap the appropriate checkmark to resend the email."
    },
    {
      "title": "Change your notifications so you only get bothered when you want to be.",
      "content": "Change your notifications so you only get bothered when you want to be. By default, Kik will notify you when you get a new message. However, if you don't like these messages, you can change the way that Kik notifies you with the following steps: Tap the gear icon at the top of the Kik home screen. Tap \"Notifications.\" Check and uncheck the boxes on the following page to change the way that Kik notifies you. You can disable the sound that is played, the vibrating effect, and more."
    },
    {
      "title": "Use the block list to get rid of undesirable messages.",
      "content": "Use the block list to get rid of undesirable messages. Getting messages from someone you'd rather ignore, like an ex-friend or a junk mail bot? Disable unwanted messages by using Kik's built-in block list with the following steps: Tap the gear icon at the top of the Kik home screen. Tap \"Chat Settings.\" Tap \"Block List.\" Type in the username of the person you want to block or press the + button in the top right and browse your contact list manually. Click \"Block\" to confirm. Unblock someone by visiting the block list, tapping the name you want to unblock, and tapping \"Unblock.\""
    },
    {
      "title": "Try re-installing the app if it repeatedly crashes.",
      "content": "Try re-installing the app if it repeatedly crashes. Kik is constantly being updated and having new features added to it by the Kik team. Sometimes, unfortunately, this rapid update cycle can make the app act strangely. The solution to this problem is usually fairly simple — just uninstall the app, then re-download it and install it once again. You will automatically be updated to the latest version of the app when you re-install it. Note: Uninstalling the app will delete your history of messages, so save any important information before you uninstall."
    },
    {
      "title": "Visit the Kik support center for more help.",
      "content": "Visit the Kik support center for more help. Have a technical problem that's not addressed here? Try using the Kik support site, which allows you to quickly search for your problem in the Kik database of help resources."
    }
  ]
}