{
  "url": "https://www.wikihow.com/What-Does-Live-Mean-on-Find-My-Friends",
  "title": "What Does Live Mean on Find My? Plus, How to Use the Find My App",
  "steps": [
    {
      "title": "Live indicates that you are seeing someone's location in real time.",
      "content": "Live indicates that you are seeing someone's location in real time. When you view someone's location in the Find My app, you'll see the last time their location was updated under their name. If their location is immediately available, you'll see \"live\" instead of the time. If someone's location is live, you'll also see a green pulse around their profile picture on the map when you select them in the People tab."
    },
    {
      "title": "Open the settings app.",
      "content": "Open the settings app. It's the gray gear icon on one of your home screen pages. You'll need to turn on location services in the settings app to share your location with other people. [1] X Research source"
    },
    {
      "title": "Tap Privacy & Security.",
      "content": "Tap Privacy & Security . [2] X Research source"
    },
    {
      "title": "Tap Location Services.",
      "content": "Tap Location Services . [3] X Research source"
    },
    {
      "title": "Toggle on Location Services.",
      "content": "Toggle on Location Services. This will allow you to share your location with other people. [4] X Research source"
    },
    {
      "title": "Open the settings app.",
      "content": "Open the settings app. It's the gray gear icon on one of your home screen pages. You can turn on Find My in the settings app. [5] X Research source"
    },
    {
      "title": "Tap your name.",
      "content": "Tap your name. It's at the top of the settings app."
    },
    {
      "title": "Tap Find My.",
      "content": "Tap Find My . [6] X Research source"
    },
    {
      "title": "Tap Find My iPhone.",
      "content": "Tap Find My iPhone ."
    },
    {
      "title": "Toggle on Find My iPhone.",
      "content": "Toggle on Find My iPhone. This allows you and other people you share your location with to find your iPhone."
    },
    {
      "title": "Open the settings app.",
      "content": "Open the settings app. It's the gray gear icon on one of your home screen pages. If you're trying to share your iPhone's location with someone who has an Android , you'll need to use Google Maps location sharing instead of Find My."
    },
    {
      "title": "Tap your name.",
      "content": "Tap your name. It's at the top of the settings app."
    },
    {
      "title": "Tap Find My.",
      "content": "Tap Find My . [7] X Research source"
    },
    {
      "title": "Toggle on Share My Location.",
      "content": "Toggle on Share My Location. This allows you to share your iPhone's location with other people."
    },
    {
      "title": "Open the Find My app.",
      "content": "Open the Find My app. It's a green radar icon on one of your home screen pages. [8] X Research source"
    },
    {
      "title": "Tap the People tab.",
      "content": "Tap the People tab. It has an icon with two people."
    },
    {
      "title": "Tap the + button and select Share my Location.",
      "content": "Tap the + button and select Share my Location . This will open a new menu for selecting who you want to share your location with. [9] X Research source"
    },
    {
      "title": "Type the name of the person you want to share your location with and select them in the list.",
      "content": "Type the name of the person you want to share your location with and select them in the list. You can select multiple people if needed. [10] X Research source"
    },
    {
      "title": "Tap Send.",
      "content": "Tap Send . [11] X Research source"
    },
    {
      "title": "Select how long you want to share your location.",
      "content": "Select how long you want to share your location. Once you choose, your location will immediately be shared with the people you selected. You can always stop sharing your location later if needed. You can choose from these options: Share for One Hour Share Until End of Day Share Indefinitely ."
    },
    {
      "title": "Open the Find My app.",
      "content": "Open the Find My app. It's a green radar icon on one of your home screen pages. Note that you need to share your location with someone first before you can request that they share their location with you."
    },
    {
      "title": "Tap the People tab.",
      "content": "Tap the People tab. It has an icon with two people."
    },
    {
      "title": "Tap the person you want to share their location with you.",
      "content": "Tap the person you want to share their location with you."
    },
    {
      "title": "Tap Ask To Follow Location.",
      "content": "Tap Ask To Follow Location . This will send the person a message requesting that they share their location with you. [12] X Research source"
    },
    {
      "title": "Open the Find My app.",
      "content": "Open the Find My app. It's a green radar icon on one of your home screen pages. [13] X Research source"
    },
    {
      "title": "Tap the People tab.",
      "content": "Tap the People tab. It has an icon with two people. [14] X Research source"
    },
    {
      "title": "Tap the person you want to view.",
      "content": "Tap the person you want to view. This will zoom in to their last known location on the map. [15] X Research source"
    }
  ]
}