{
  "url": "https://www.wikihow.com/Somatic-Narcissist",
  "title": "10 Traits of Somatic Narcissists & Advice for Dealing with Them",
  "steps": [
    {
      "title": "Somatic narcissists get their self-worth from their physical appearance.",
      "content": "Somatic narcissists get their self-worth from their physical appearance. “Somatic” means “related to the body,” so somatic narcissists tend to believe they look stronger or more attractive than everyone else. They expect other people to give them attention because of it. [1] X Research source Because they think so highly of themselves, they usually feel superior or entitled to validation from other people just based on their bodies. [2] X Research source Someone may become a somatic narcissist if they felt insecure when they were younger, if they had narcissistic or neglectful parents, or if they’ve gone through a traumatic event."
    },
    {
      "title": "They always try to look their best.",
      "content": "They always try to look their best. Somatic narcissists always want to look their best, so they may show off the latest clothes, newest gadgets, or most expensive homes. They may try to feel more superior by name-dropping famous friends, bragging about private events they’ve attended, or spending a lot of money on the finer things in life, like first-class tickets or front-row seats. [3] X Research source An aging somatic narcissist may worry about their appearance even more as they get older, and could resort to plastic surgery or other beauty treatments to try and maintain their looks."
    },
    {
      "title": "They obsess over diet and exercise.",
      "content": "They obsess over diet and exercise. Since somatic narcissists are focused on how other people perceive them, they’ll usually do whatever they can to maintain their physique. You may notice they have an intense workout routine and brag about how fit they are, or they may latch onto a strict diet without allowing themselves a cheat day. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Somatic narcissists are prone to body dysmorphia and obsessive fixations, which could potentially lead to eating disorders like anorexia or orthorexia (an obsession with healthy eating)."
    },
    {
      "title": "They criticize how other people look.",
      "content": "They criticize how other people look. If you don’t focus as much on your appearance as a somatic narcissist, they may point out everything they see wrong with how you look. They may make negative comments about your body, clothes, diet, or any other way you present yourself so they feel more superior to you. [5] X Research source To deal with someone making fun of your appearance , remember that you’re perfect just the way you are and no one can tell you otherwise. The comments a somatic narcissist makes are more about their insecurities than what they actually think of you, so you shouldn’t put a lot of stake in them."
    },
    {
      "title": "They get angry when you give them criticism.",
      "content": "They get angry when you give them criticism. Somatic covert narcissists spend so much time on how they appear to others but they have low self-esteem, so any small criticism might feel like an attack. They may get defensive as soon as you address how they look or anything they’ve done wrong. Even if you only make a minor comment, a somatic narcissist could think that it’s really harsh and that you’re calling them out. [6] X Research source If something you said upsets a somatic narcissist, just avoid engaging with them. If you try to defend what you said, they may get more upset with you."
    },
    {
      "title": "They have trouble fitting in with others.",
      "content": "They have trouble fitting in with others. Since a somatic narcissist is so focused on how they’re feeling, they may not be able to make deep connections with other people. They may hide their true selves behind a persona they’re maintaining, so they may not sound genuine even in their close friend circles. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Some somatic narcissists thrive more on social media because they can carefully craft how they present themselves as opposed to showing their true colors in person."
    },
    {
      "title": "They put their needs before yours.",
      "content": "They put their needs before yours. Narcissists usually think that other people are lower than them, so they may not consider what you need or how you’re feeling. They may only talk about themselves and what they need from you rather than asking how they can help you in return. [8] X Research source"
    },
    {
      "title": "They take credit for someone else’s accomplishments.",
      "content": "They take credit for someone else’s accomplishments. Since a somatic narcissist wants other people to think they’re successful, they may steal the credit to make themselves look better than you. They may say they had a bigger part of a project than what they actually contributed, or they may say that no one else helped them along the way even if they had a large support network. [9] X Research source"
    },
    {
      "title": "They gaslight you.",
      "content": "They gaslight you. If a somatic narcissist tries to convince you that something happened differently than you remember, then it may be a sign of gaslighting. Since a narcissist wants to have control over a narrative, they might ignore the facts and tell their version of the story so they look better than you. [10] X Research source Watch out for gaslighting phrases like, “That’s not what happened,” “You’re exaggerating,” and “It’s not that big of a deal.” Ignore a narcissist that’s trying to gaslight you since they probably won’t accept the facts even if you try to defend yourself."
    },
    {
      "title": "They base their self-esteem on sex.",
      "content": "They base their self-esteem on sex. Since somatic narcissists tend to focus on their attractiveness, their self-worth may rely on how sexually active they are or how many people they sleep with. They see their sexual encounters as a way to boost their ego and feel more desirable. Somatic narcissists usually have relationships that rush through the romance and jump straight into physical contact. Somatic narcissists may also use sex to manipulate your emotions. They may try to coerce you into doing something you don’t want to do just so they can feel more in control."
    },
    {
      "title": "They may be unfaithful to their partners.",
      "content": "They may be unfaithful to their partners. Somatic narcissists are usually hard to keep satisfied in longer romantic relationships, so they may be on the lookout for new people to spend time with. They want to feel desired by as many people as possible, so they’ll tend to keep their options open even if they’re already dating someone. [11] X Research source If you’re recovering from being cheated on , remember that you’re not the one to blame for their choices. Allow yourself some time to grieve, try journaling about your feelings , and do activities that you love to help take your mind off of it."
    },
    {
      "title": "Set and maintain boundaries with them.",
      "content": "Set and maintain boundaries with them. As you’re creating your boundaries , really think about what behavior you consider is acceptable and what you absolutely cannot tolerate. Whenever a somatic narcissist tries to push against your boundaries, stop them and let them know what they’re doing in a firm voice. If they continue to push your boundaries, then walk away or ignore them so they don’t break you down. [12] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Example: If you don’t want someone talking about your weight and a somatic narcissist brings it up, you could say something like, “I told you that my appearance is not an appropriate conversation topic. We can talk about something else, or this conversation is over.” Enforce boundaries each time that they’re broken. If a narcissist notices that you let the boundary slide once or twice, they may continue pushing against it."
    },
    {
      "title": "Focus on things you enjoy.",
      "content": "Focus on things you enjoy. Rather than replaying what a narcissist says or does in your head, immerse yourself in the activities you’re passionate about. Exercise, make art, join a sports league, or focus on your personal goals so you aren’t comparing yourself to a narcissist and can be proud of everything that you do. As long as the activities make you feel energized, they’re great picks to take your mind off what a narcissist says."
    },
    {
      "title": "Surround yourself with friends and family.",
      "content": "Surround yourself with friends and family. Look at your network of loved ones and reach out to them when you’re struggling with the somatic narcissist in your life. Your friends and family are there to support you, so ask them for advice on what to do if they’ve been through something similar. They’ll help you recognize all your best qualities so you’re not comparing yourself to a narcissist. Be honest about your feelings as you open up to them rather than bottling up or tamping down your emotions."
    },
    {
      "title": "Consider seeing a therapist.",
      "content": "Consider seeing a therapist. See if there are any therapists or narcissistic abuse support groups in your area that you could tell about your experiences. They’ll be able to help you recognize any damaging behaviors that you’ve gone through and help you come up with long-term solutions for overcoming them."
    },
    {
      "title": "End the relationship if there aren’t any changes.",
      "content": "End the relationship if there aren’t any changes. If you’re dating a somatic narcissist and you haven’t seen them change any of their patterns, then they might not be ready to make the changes you need them to. You deserve someone who loves and appreciates you for who you are, so you don’t need to stay in a toxic relationship where you’re not treated right. Get out of the relationship by being straightforward with your reasons and moving on. Narcissists may try to “hoover” you, which means they could say nice things or claim they’ve changed just to get you back into the relationship. Watch for hoovering behaviors, and avoid getting involved again if you notice them."
    },
    {
      "title": "Cerebral narcissists get their self-esteem from their smarts, not looks.",
      "content": "Cerebral narcissists get their self-esteem from their smarts, not looks. Both cerebral and somatic narcissists think they deserve validation from people, but they get their fixes differently. Cerebral narcissists put their worth in being smarter than others, and may flaunt their credentials or boast about their intelligence. Somatic narcissists focus on their looks and how they appear to others, so they’ll focus more on comments about their bodies. [13] X Research source “Cerebral” and “somatic” are not clinical terms for narcissism, but they’re still helpful descriptive terms to categorize common traits. Somatic and sexual narcissists have similar traits, but sexual narcissists get more of their self-worth and superiority from romantic encounters."
    }
  ]
}