{
  "url": "https://www.wikihow.com/Use-Witch-Hazel-to-Reduce-Hemorrhoids",
  "title": "How to Treat Hemorrhoids with Witch Hazel",
  "steps": [
    {
      "title": "Apply a witch hazel-soaked pad to your hemorrhoids for immediate relief.",
      "content": "Apply a witch hazel-soaked pad to your hemorrhoids for immediate relief. Take a cotton ball and soak it in witch hazel. Then, press it gently to the area for about 60 seconds up to 6 times a day. Throw away the cotton ball after you’ve used it and wash your hands. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you prefer, you can use packaged witch hazel pads (like Tucks Pads ) that are made specifically for hemorrhoids."
    },
    {
      "title": "Take a witch hazel sitz bath to soothe your hemorrhoids.",
      "content": "Take a witch hazel sitz bath to soothe your hemorrhoids. Fill your bathtub with 3 to 4 inches (76 to 102 mm) of warm water. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Then, stir in 1/2 cup (115 grams) of Epsom salt and 2 tablespoons (30 mL) of witch hazel. Soak in the sitz bath for 15-20 minutes, adding more hot water if you start to get cool. Gently towel dry yourself afterward. For extra convenience, you can also buy a toilet sitz bath . After your bath, use a hairdryer to dry off your anal area rather than rubbing over it with a towel. If you do use a towel, try to blot the area rather than rubbing and irritating it. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Relieve itching and swelling with a hemorrhoid cream that contains witch hazel.",
      "content": "Relieve itching and swelling with a hemorrhoid cream that contains witch hazel. Read and follow the directions on the container. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Plan to use your finger to apply the cream directly to your rectum. [6] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Always wash your hands before and after applying the product. If you dislike the way the product feels while you’re going about your day, stick with witch hazel-soaked pads instead."
    },
    {
      "title": "Clean your anal area before treating your hemorrhoids.",
      "content": "Clean your anal area before treating your hemorrhoids. Bathe or shower daily to keep your anal area clean. Generally speaking, baths are preferable to showers since they have the added benefit of soaking your hemorrhoids, which can provide some relief. Be gentle when you clean yourself, as scrubbing the area could be painful or uncomfortable. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You don’t have to use soap but do use warm or hot water. Leftover fecal matter can irritate your hemorrhoids, so use a soothing wipe after every bowel movement. You can buy these wipes at any drugstore, and many of them contain soothing witch hazel."
    },
    {
      "title": "Make a suppository out of witch hazel tincture and cocoa butter.",
      "content": "Make a suppository out of witch hazel tincture and cocoa butter . In a small bowl, mix 1 teaspoon (4.9 mL) of the tincture with 1 teaspoon (4.9 mL) of cocoa butter. A tincture is a concentrated form of something else. Witch hazel tincture generally comes in a dropper bottle and is much more potent than regular witch hazel. It’s important for your suppository as it wouldn’t work if the witch hazel were too watery. Warning: If you decide to buy a suppository from the store rather than making one yourself, don’t confuse a laxative suppository for a hemorrhoidal suppository—the consequences will not be what you expected!"
    },
    {
      "title": "Mold the mixture in a small oblong shape.",
      "content": "Mold the mixture in a small oblong shape. If you’re having trouble shaping the suppository, place the mixture in plastic wrap and twist it to mold it into a pill shape. Place the suppository in a small bowl and cover it with plastic wrap. In this case, a suppository is a solid dose of some type of medicine that gets inserted into the rectum. It releases the soothing witch hazel as it melts."
    },
    {
      "title": "Freeze the suppository for 1-2 hours until it is fully frozen.",
      "content": "Freeze the suppository for 1-2 hours until it is fully frozen. Place the bowl into the freezer, making sure it’s covered in plastic wrap.The suppository is good to use once it’s firm to the touch and doesn’t give when you press it. The suppository needs to be as cold and firm as possible for it to be fully inserted in your rectum."
    },
    {
      "title": "Wash your hands and put on a disposable glove to practice good hygiene.",
      "content": "Wash your hands and put on a disposable glove to practice good hygiene. Wear hand protection to keep your fingers germ-free and keep bacteria from getting under your nails or in the folds of your skin. [8] X Research source You could also use a finger cot , which is like a disposable glove but just for an individual finger. If you don’t have a glove or finger cot, you can use your bare hand. Just make sure to thoroughly wash your hands both before and after inserting the suppository."
    },
    {
      "title": "Lubricate the end of the suppository to help it go in more easily.",
      "content": "Lubricate the end of the suppository to help it go in more easily. Use some kind of water-soluble lubricant and dab it on the end of the suppository. This helps you avoid any discomfort when you insert it, and it’ll help it go in a little further to more thoroughly treat your hemorrhoids. [9] X Research source If the suppository looks too large when you take it out of the freezer, you can cut it in half. Doing so won’t make it any less effective."
    },
    {
      "title": "Insert the suppository",
      "content": "Insert the suppository while laying on your left side. While on your side, bend the knee of your top leg while keeping your bottom leg straight. Lift your top buttocks with one hand and gently push the hemorrhoidal suppository into your anus with the other hand. Make sure it goes in about 1 inch (25 mm). [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source You may need to push the suppository up inside using a finger. It may be a little uncomfortable but it should be over very quickly!"
    },
    {
      "title": "Lay on your side for about 15 minutes while the suppository works.",
      "content": "Lay on your side for about 15 minutes while the suppository works. [11] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source You may need to squeeze your sphincter for a few seconds to keep the suppository inside your body. Try your best to relax, though; hopefully, you’ll feel relief from the witch hazel before too long. You may get chilly while you’re waiting for the suppository to work, so it can be handy to have a blanket nearby. Try watching some funny videos on your phone while you’re waiting—they’ll help distract you and make the time pass more quickly."
    },
    {
      "title": "Discard your gloves and wash your hands a final time.",
      "content": "Discard your gloves and wash your hands a final time. Use warm water and soap, and scrub your hands for at least 20 seconds before drying them off with a clean towel. The suppository should have dissolved, but you may experience a little leakage as you move about. Wear a pad if this happens to you to keep the cocoa butter from getting on your clothes. [12] X Research source You can use this kind of suppository up to 3 times if you need to for relief."
    },
    {
      "title": "Visit your doctor if your hemorrhoids bleed, hurt, or don’t improve.",
      "content": "Visit your doctor if your hemorrhoids bleed, hurt, or don’t improve. Most hemorrhoids go away within a week without medical care, but they can occasionally bleed or cause excessive pain. If you experience this, meet with your doctor to see what additional treatment options are out there so you can find relief. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Let your doctor know that you’ve been treating your hemorrhoids at home with witch hazel. It’s always important to call your doctor whenever you experience hemorrhoids, even if you’re confident that hemorrhoids are the issue. Rectal bleeding can sometimes signify something more serious, like colon cancer. [14] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source"
    },
    {
      "title": "Get immediate medical care for dizziness, lightheadedness, or fainting.",
      "content": "Get immediate medical care for dizziness, lightheadedness, or fainting. Visit your doctor or an urgent care center immediately to get checked out, as these may be symptoms of a more serious condition or possibly an infection. Medical professionals can help you get the proper treatment so you start feeling better quickly. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Don’t drive yourself if you’re dizzy or lightheaded. Instead, call a friend to come pick you up, or order a car to take you."
    },
    {
      "title": "Complete any hemorrhoid checks and tests at the doctor’s office.",
      "content": "Complete any hemorrhoid checks and tests at the doctor’s office. Let your doctor check your hemorrhoids and do any necessary tests—they’ll probably do a visual inspection to confirm your diagnosis. If you have internal hemorrhoids, they may do a quick exam by feeling for the hemorrhoid using their finger. These tests can be a little awkward and uncomfortable, but they’re very quick. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source In rare cases, your doctor may decide to do a colonoscopy if they suspect you have a condition other than hemorrhoids. This test is generally painless, though you may experience some discomfort."
    },
    {
      "title": "Try a topical treatment if witch hazel doesn’t work for you.",
      "content": "Try a topical treatment if witch hazel doesn’t work for you. Look into OTC treatments like hemorrhoid creams and hemorrhoid suppositories , which may all help to ease your symptoms. If you still have hemorrhoids after a week, visit your doctor again to ask about other treatments. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Read the label before using the product and make sure you follow all of the directions."
    },
    {
      "title": "Discuss medical treatments with your doctor if natural and OTC remedies aren’t working.",
      "content": "Discuss medical treatments with your doctor if natural and OTC remedies aren’t working. If nothing seems to be helping, your doctor may suggest a minimally invasive medical procedure to help with your hemorrhoids, like: [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Rubber band ligation: Your doctor cuts off the hemorrhoid’s blood supply by doing a rubber band ligation, which means tying rubber bands around the hemorrhoid. This makes it fall off. Sclerotherapy: Your doctor inserts a treatment into your hemorrhoid to help it decrease in size. Coagulation: Your doctor uses heat from a laser or infrared light to shrink and harden your hemorrhoid. Surgery: Your doctor removes the hemorrhoid in a hemorrhoidectomy or staples your hemorrhoid to help relieve your symptoms."
    }
  ]
}