{
  "url": "https://www.wikihow.com/Why-Do-I-Forget-to-Breathe",
  "title": "4 Reasons Why You Forget to Breathe When You’re Awake or Asleep",
  "steps": [
    {
      "title": "You may be really focused and have “screen apnea.”",
      "content": "You may be really focused and have “screen apnea.” When you’re watching a gripping movie or playing an intense game, there are times you may involuntarily hold your breath. During work, you may get “email apnea” when you’re watching your inbox or reading through a document. When you’re done focusing or when your body recognizes it needs more air, then you may suddenly become aware that you need to breathe. [1] X Research source Quick Fix: Try taking a break from your screen every 20 minutes, take a few deep breaths, and move around a little bit. You may also try taking a short walk to get your breathing back to its normal rhythm."
    },
    {
      "title": "You may be feeling stressed or anxious.",
      "content": "You may be feeling stressed or anxious. In moments when you’re feeling really overwhelmed or stressed, or if you’re anticipating something to happen, you may hold your breath without realizing it. Because you’re holding more tension in your body, it’s harder to catch your breath and it can feel like you’re forgetting to breathe. [2] X Research source Quick Fix: Try to remove yourself from the situation, if possible. Take a second to close your eyes and focus on taking deep breaths . Inhale slowly through your nose and gently breathe out through your mouth."
    },
    {
      "title": "You may have developed a habit of holding your breath.",
      "content": "You may have developed a habit of holding your breath. Some people online report that they regularly hold their breath without any other reason besides it being a bad habit. [3] X Research source If you’re still not quite sure why you’re holding your breath while you’re awake and it happens regularly, talk to your doctor. They may help find an underlying cause and help find ways to help you catch your breath."
    },
    {
      "title": "You may be experiencing sleep apnea.",
      "content": "You may be experiencing sleep apnea. Sleep apnea is a condition where your breathing repeatedly starts and stops while you’re asleep. Other common symptoms of sleep apnea include loud snoring, gasping for air, drowsiness during the day, dry mouth, headaches, and waking up frequently throughout the night. [4] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source If you suspect that you have sleep apnea, contact a doctor to perform a sleep study and find treatment options. [5] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source Obstructive sleep apnea is the most common type, and it occurs when your throat muscles relax and block your airways while you’re asleep. You may be more at risk if you’re overweight, are a smoker, or if you have a family history of sleep apnea. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Central sleep apnea is less common and is caused when your brain doesn’t send signals to your body to breathe. The condition is usually caused by other problems, like infection, stroke, or heart failure. [7] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Common treatments for either type of sleep apnea include wearing a specialized mouthpiece that opens your airways or putting on a CPAP machine while you’re sleeping, which has a mask or nosepiece that supplies continuous air pressure to help you breathe."
    },
    {
      "title": "Sit comfortably with your feet on the floor.",
      "content": "Sit comfortably with your feet on the floor. Choose a nice, relaxing chair to sit in and keep your back straight. Put both feet flat on the ground about hip-width apart. Keep your arms relaxed on the armrests. [8] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Alternatively, lay flat on your back with your arms slightly out from your sides and your palms up. Keep your legs straight, or bend your knees to put your feet flat on the floor. If you’re wearing any tight clothes, loosen them or remove them so you aren’t restricting your breathing."
    },
    {
      "title": "Place your hands on your upper chest and stomach.",
      "content": "Place your hands on your upper chest and stomach. Take one hand and put it flat against the middle of your chest. Take your other hand and place it just below your ribcage on your stomach. While this isn’t required, it helps you feel when you’re breathing from your diaphragm compared to when you’re breathing from your chest. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source The diaphragm is a dome-shaped muscle right under your ribs, and it’s the main muscle you use for breathing. When you use your diaphragm to breathe , it pulls more air into your lungs so you get a deeper, fuller breath. [10] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source"
    },
    {
      "title": "Breathe in through your nose to a count of 5.",
      "content": "Breathe in through your nose to a count of 5. Close your eyes and focus only on your breathing throughout the exercise. Slowly inhale through your nose and count to 5 in your head. As you breathe in, expand your stomach instead of your chest to use your diaphragm and get the most air in your lungs. [11] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If you have trouble getting a deep breath over 5 seconds, try inhaling for 3–4 seconds instead. Avoid sucking in your stomach and raising your shoulders when you breathe in because you’ll get a shallower breath with less air. [12] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Breathing in through your nose helps filter out dust and allergens, and it warms up the air so your lungs function better. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Exhale through your mouth slowly.",
      "content": "Exhale through your mouth slowly. Purse your lips and blow out all the air in your lungs over 4–5 seconds. Take your time as you exhale and don’t try to force the air out quickly. As you breathe out, contract your stomach to relax your diaphragm. [14] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Do mindful breathing for 5 minutes at a time.",
      "content": "Do mindful breathing for 5 minutes at a time. Take a few minutes of your day to focus on your breathing and use your diaphragm correctly so your body gets used to doing it. Aim to do breathing exercises around 3–4 times a day, and don’t be afraid to increase the amount of time you do it to strengthen your diaphragm even more. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}