{
  "url": "https://www.wikihow.com/Strengthen-Your-Wrists",
  "title": "How to Strengthen Your Wrists",
  "steps": [
    {
      "title": "Use both hands for one-handed tasks.",
      "content": "Use both hands for one-handed tasks. For most people, the wrist of the dominant hand is noticeably stronger than the wrist of the non-dominant hand. If you make an effort to start using your non-dominant hand for your daily tasks, you will probably be surprised at how hard they are to accomplish! Stick with it — over time, your weaker wrist will become stronger and your tasks will become easier. Below is a short list of tasks you can start using your \"off\" hand for. Brushing your teeth Writing Using a computer mouse/touchpad Eating Stirring"
    },
    {
      "title": "Try squeezing a stress ball or palm exercise device.",
      "content": "Try squeezing a stress ball or palm exercise device. You may have seen these hand-held exercise devices in workout rooms, high-stress places (like home offices), and more. Though they come in many different shapes and sizes, the basic idea is the same for all of them — hold the device in your hand, squeeze firmly but steadily, relax your grip, and repeat. That's all there is to it! These are great for when you have one hand free. For instance, it's not hard to get a wrist workout in while you talk on the phone or read a book."
    },
    {
      "title": "Try a golf wrist exercise.",
      "content": "Try a golf wrist exercise. Thinking of hitting the links in the near future? Dust off your golf clubs early for this exercise, which is great for improving your wrists' strength along their entire range of motion. You can also use any sort of long, rigid object light enough to manipulate with one hand (like, for instance, a broom.) Stand with your arm at your side and hold a golf club by the end of the handle. Using only your wrist, slowly point it toward the sky, then point it back down again. Repeat until you feel a good \"burn\" in your forearm. For an extra challenge, start with a light club, then work your way up to your heavier ones."
    },
    {
      "title": "Try doing wrist circles.",
      "content": "Try doing wrist circles. These minimum-resistance exercises are great for quick breaks at the office or in situations where you can't do more complicated exercises (such as when you're on an airplane.) They're sometimes also used in physical therapy situations, but don't let that stop you if you're perfectly healthy, as wrist circles can be a great relaxer if you're feeling \"all wound up.\" Stand or sit with your hands out in front of you, palms down. Move your wrists in a slow circular motion to the left, then back to the right. You may want to clench and unclench your fists as you do this to add an extra degree of motion to the exercise. After you've worked out any kinks, turn your palms over and start over."
    },
    {
      "title": "Try resistance band exercises.",
      "content": "Try resistance band exercises. Resistance bands are large, elastic strips of rubbery material which are often used for physical therapy purposes, but they're also great for building strength even if you're not recovering an injury. You'll need a sturdy resistance band for these exercises — usually, these are available at exercise stores, but you may also be able to get them from physical therapy centers. Below are two resistance band exercises for your wrists you may want to try out: Wrist flexion: Loop the resistance band over the fingers of one hand, then stand with your arm at your side, your elbow bent at a 90-degree angle, and your hand palm-up in front of you. Put the other end of your resistance band under your foot or attach it to the floor. Curl your wrist upwards as far as you can, then let your hand relax back down and repeat. Keep your forearms steady as you do this. Note that this exercise is very similar to the wrist curl described above. Wrist extensions: Identical to wrist flexion, except with your hand turned palm-down. This exercise is very similar to a standing wrist curl."
    },
    {
      "title": "Try the rice bucket workout.This unconventional exercise doesn't have much in common with the others on this list, but it's simple to set up and perform and it's quite effective at building wrist and forearm strength.",
      "content": "Try the rice bucket workout.This unconventional exercise doesn't have much in common with the others on this list, but it's simple to set up and perform and it's quite effective at building wrist and forearm strength. In fact, some baseball teams recommend it for their players as a way to build wrist strength. [1] X Research source All you'll need for this exercise is a container wide and deep enough that both hands fit in it comfortably without touching each other and enough rice to bury your hands in the container. Start by pouring the rice into the container. Plunge your hands into the rice until they are buried up to your wrists. Next, make the following motions with your hands and repeat until you feel a good burn — the resistance of the rice being pushed by your hands will exercise your wrists a surprising amount. Clench your hands into fists and turn them in circles back and forth. Open your hands and turn them in circles back and forth. Open and close your hands while submerged in the rice. Move your hands up and down. Make wrist curl movements with your palms facing you. Make reverse wrist curl movements with your palms facing away from you."
    },
    {
      "title": "Try wrist curls as a good \"bread and butter\" exercise.",
      "content": "Try wrist curls as a good \"bread and butter\" exercise. Wrist curls are one of the quintessential wrist and forearm exercises. To do a wrist curl, you'll need a weighted dumbbell (you can also use a barbell to hit both hands at once). [2] X Research source Sit at a bench or bicep curl rack. Hold your dumbbell so your palm faces upwards. Using only your forearm muscles, curl the dumbbell up toward your wrist as far as you can without bending your elbow. Lower the dumbbell back down and repeat the curling motion. Repeat for both arms. [3] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. [14 May 2020]. Do three sets of 15 reps or until you feel sufficiently fatigued. Unless otherwise noted, these set recommendations hold true for all exercises in this article. You can also do this exercise at home with a soup can or a jug of milk in place of a dumbbell."
    },
    {
      "title": "Use reverse wrist curls to work the other side of your wrists.",
      "content": "Use reverse wrist curls to work the other side of your wrists. Reverse wrist curls are just what they sound like — normal wrist curls performed backwards. These are great to do right after a few sets of ordinary wrist curls to ensure that you work out all of your wrist muscles. Sit on a bench. Rest one forearm on your thigh so that your hand extends beyond your knee. Take a dumbbell and hold it so your palm faces downward. Let the dumbbell hang limp in your hand, then, using only your wrist, pull it up so it is level with the rest of your arm. Lower the dumbbell back down and repeat the raising motion. [4] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. [14 May 2020]. Repeat for both arms."
    },
    {
      "title": "Try wrist rolls for a challenge.",
      "content": "Try wrist rolls for a challenge. These exercises may look unconventional, but if you can power through them, they're highly effective at strengthening your wrists. For this exercise, you'll need a sturdy stick or rod (like a broom handle or a dumbbell without weight on it. Tie a modest weight (like five or ten pounds) to the end of a sturdy string and tie the other end to the center of the rod. Hold the rod out in front of you and let the weight hang at the end of its string. Your palms should be facing down. Start to turn the rod with your arms — the string should start winding up and the weight should start climbing towards the stick. Stop when the weight touches the stick, then, carefully roll it back down to the floor. Do not stop or let your arms fall throughout this exercise. Repeat for three to five windings or until you are sufficiently fatigued."
    },
    {
      "title": "Try two-hand pinches.",
      "content": "Try two-hand pinches. This challenging exercise uses heavy barbell plates, making it a good choice for those who are already strong and want to take their wrist and forearm strength to the next level. Because these plates can cause serious injury if they are dropped, you may want to stick to the exercises above if you aren't already an experienced gym-goer. Place two barbell plates of the same size on the floor in front of you so that you are facing their wide edge and so that they are touching each other. Grip both plates at once over the top — your fingers should be on one side of the plates and your thumbs should be on the other. Lift the weight off of the ground and hold it in front of your hips as if you were doing a deadlift . Pinch the weights together to keep them from slipping. Hold for 30 seconds (or as long as you can), then set the weights back down. [5] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. [14 May 2020]. Repeat for 3-5 sets or until you are sufficiently fatigued. Perform this exercise while sitting on a bench and hold the weights well away from your feet. If you must stand, keep a wide stance. If you keep your feet together, the plates are more likely to hit them if they slip out of your hands."
    },
    {
      "title": "Use grip-based exercises to indirectly improve wrist strength.",
      "content": "Use grip-based exercises to indirectly improve wrist strength. A huge variety of gym exercises that don't directly target the wrists still rely on grip strength and thus will indirectly work the forearm and wrist muscles. If you're serious about improving your wrist strength, try adding more of these exercises to your workout schedule to give yourself extra opportunities throughout your week. Below is a short list of exercises that use forearm/wrist grip strength for support — there are many more (you'll notice that all involve gripping a bar or handle to move weight.) Pullups Chin ups Bicep curls Deadlifts Seated rows Lat pulldowns Chest presses Chest flies Shoulder presses."
    },
    {
      "title": "Don't forget wrist stretches for improving flexibility.",
      "content": "Don't forget wrist stretches for improving flexibility. Just like the other muscles you train at the gym, wrists need stretching to maintain flexibility and keep them feeling great from week to week. In addition, regularly stretching your wrists is one way to stave off painful conditions like carpal tunnel syndrome that can develop over time as the body matures. Below are a few recommended wrist stretches: Prayer stretches: Start with your palms together in front of your chest. Slowly lower your palms (keeping them together) until your forearms form a straight line. This should look a little like you're praying and you should feel a gentle stretch in your forearms. Hold this stretch for 30 seconds and repeat several times for best results. Wrist flexor stretch: Extend one arm in front of you with the palm facing up. Point your hand at the floor by bending your wrist — don't turn your arm. Apply gently pressure with your other hand until you feel a moderate stretch. Hold for 30 seconds, then switch hands. Wrist extensor stretch: Extend one arm in front of your with the palm facing down. Point your hand at the floor by bending your wrist. Apply gentle pressure with your other hand until you feel a moderate stretch. Hold for 30 seconds, then switch hands."
    },
    {
      "title": "Adjust your normal pull-up grip by keeping your thumbs under the bar and your wrists kinked forward.",
      "content": "Adjust your normal pull-up grip by keeping your thumbs under the bar and your wrists kinked forward. Basically, you want the palm of your hand to be directly underneath the bar. This will make your pull-ups a lot harder, but they will target more of your wrists. This requires a ton of forearm strength to pull off -- these exercises are for further training, not beginners. [6] X Research source"
    },
    {
      "title": "Try a \"flexus\" pull-up by cupping your hands over the top of a larger bar, touching only with your fingertips and the heel of your hand.",
      "content": "Try a \"flexus\" pull-up by cupping your hands over the top of a larger bar, touching only with your fingertips and the heel of your hand. Incredibly difficult but worth the effort, this pull-up variation requires you cup your hands on top of a beam or bar so that all of your stabilization comes through the wrist. Start with 1-2, building up until you can do full sets of 8-10."
    },
    {
      "title": "Hold your pull-up position, instead of moving up and down, to build strength.",
      "content": "Hold your pull-up position, instead of moving up and down, to build strength. Get into position and hold it, aiming for 45 seconds to a minute at a time. Rest for a little longer than you worked out, (if you held for 45 seconds, rest for a minute or so) and then repeat two more times. Any exercise where you must hold your wrists in position while fighting tension will increase your wrist strength. To make it even harder: Pull the lower half of your torso up so that it is parallel to the ground. Use the grips mentioned above. [7] X Research source"
    },
    {
      "title": "Consider using ball-grips for pull-ups.",
      "content": "Consider using ball-grips for pull-ups. These will work your wrist in multiple ways, which is key to avoid only training certain muscles. They hang from the pull-up bar to provide tricky, rounded grips, which will significantly increase forearm, finger, and wrist strength. You could also use hanging \"rock holds,\" used to help train rock climbers. They can be found at many gyms already, even if they don't have a wall."
    },
    {
      "title": "Do fore-arm push-ups against a wall.",
      "content": "Do fore-arm push-ups against a wall. Stand 5-6 feet away from a wall, leaning towards it so that your hands support you. You'll be diagonally pointed to the wall. Push off your fingers so that the heel of your hand rises off the wall. Then slowly lower them back out and repeat. Perform 15-20 reps. Move further and further away from the wall to increase the challenge."
    },
    {
      "title": "Try wrist pushups.",
      "content": "Try wrist pushups. This will hurt if you're not trained, so start on your hands and knees before moving into a plank push-up position. Instead of a normal palms-on-the-floor push-up, curl your hands back towards your feet and rest on the back of your hands. Perform the pushups like normal. Try them as well with the outside edge of your hands. Can you \"walk\" forward on your feet and the blades of your hands? [8] X Research source"
    },
    {
      "title": "Try knuckle push-ups.",
      "content": "Try knuckle push-ups. You can also start by resting on your knuckles, with your hands in a fist. This is often a good middle-ground to strengthen your wrists, though you'll need to harden your knuckles first or it will be painful. Try this first on soft surfaces, like carpet or spongy gym floor."
    },
    {
      "title": "Do handstands on solid ground and parallel bars.",
      "content": "Do handstands on solid ground and parallel bars. These full-body holds put a lot of pressure on your wrists, and if you can't keep them stable and strong, you won't be able to hold yourself up. Don't worry if you can't do a full handstand just yet -- you can rest your feet on a wall to keep balance without significantly compromising the wrist workout. [9] X Research source Really ready to test yourself? Try a handstand push-up. Simply bend your elbows out to lower yourself to the ground slightly, then push back up to a full handstand. This is much easier with the wall for support."
    }
  ]
}