{
  "url": "https://www.wikihow.com/Talk-Nicely",
  "title": "How to Talk Nicely",
  "steps": [
    {
      "title": "Do not yell.",
      "content": "Do not yell. Yelling will make you sound short-tempered. And when you sound short-tempered, people will try to avoid talking to you because they think you could explode any second. Try to talk in a calm voice."
    },
    {
      "title": "Do not talk too quietly, either.",
      "content": "Do not talk too quietly, either. It will make you sound like you are not interested in the conversation, making you sound rude, or just not easy to talk to."
    },
    {
      "title": "Make gentle hand movements while talking.",
      "content": "Make gentle hand movements while talking. If you jerk your hands back and forth you will look aggressive, and like you are getting angry in some way."
    },
    {
      "title": "Take into consideration how your audience (or those you are talking to) react to your words.",
      "content": "Take into consideration how your audience (or those you are talking to) react to your words. There are many things one could learn in looking at a person's reactions to words, topics and tone. You will know what the other likes or dislikes from their expressions. Be sensitive. Be kind."
    },
    {
      "title": "Be careful with your word choice.",
      "content": "Be careful with your word choice. Even if you do talk gently and not yelling, the words you use are of great impact to those who listen and on your character. They may not take you seriously or be hurt at what words you use."
    },
    {
      "title": "Be eager and sincere.",
      "content": "Be eager and sincere. Talk to them because you like to talk to them and the topic of your conversation is something exciting for you. That way, words would come easier for you and you would be engaged to the conversation."
    },
    {
      "title": "Listen.",
      "content": "Listen. Listening would give you enough information about your conversation partner and would open up new topics and ideas to talk more of. Also you could learn too by observing."
    },
    {
      "title": "Smile, laugh, joke.",
      "content": "Smile, laugh, joke. Jokes should be appropriate to the conversation and the audience, they should never offend another or give harm. Do not be callous of their feelings just so you could have the spotlight."
    },
    {
      "title": "Never use monosyllabic answers unless appropriate.",
      "content": "Never use monosyllabic answers unless appropriate. It would make you sound bored and uncaring which would lead to some awkward silence to your conversation partner. Examples are 'Hm.', 'Che.', 'Ok.' and the like."
    },
    {
      "title": "Never cut the conversation midway.",
      "content": "Never cut the conversation midway. If you need to, excuse yourself politely and do not just walk away."
    },
    {
      "title": "Timing is everything.",
      "content": "Timing is everything. Know when to stop, change the topic, explain and end the conversation."
    }
  ]
}