{
  "url": "https://www.wikihow.com/Switch-SIM-Cards",
  "title": "How to Switch SIM Cards",
  "steps": [
    {
      "title": "See if your phone is unlocked",
      "content": "See if your phone is unlocked . Some phones are \"carrier locked\", meaning that they cannot be used with any other carriers' SIM cards. You can unlock your iPhone or Android if you meet the proper criteria, which depend on your carrier. If your phone is already unlocked, you should be able to use other carriers' SIM cards in your phone."
    },
    {
      "title": "Buy a new SIM card.",
      "content": "Buy a new SIM card. When you sign up for service with a new provider, they'll give you a SIM card that works for their service. If you signed up online, you can usually have the SIM mailed to your house or pick it up at your carrier's store (if they have one). Your phone most likely takes a specific size of SIM card, so check which SIM card size your phone uses before buying one. If you aren't sure of the SIM card that you should use, you can usually take your phone into a carrier store and have them evaluate it for you. They may even install the SIM card themselves!"
    },
    {
      "title": "Turn off your phone.",
      "content": "Turn off your phone. It's important for your phone to be turned off before you access the SIM card: Android - Press and hold the Power button on the top or side of the phone, then tap Power off when prompted. iPhone X, 11, or 12 - Press and hold either of the two volume buttons and the right-side button at the same time. When the power slider appears, swipe it to turn off your phone. [1] X Research source iPhone SE (2nd gen), iPhone 8, 7, and 6: Press and hold the button on the right side until the power slider appears, and then drag the slider to turn off the phone. iPhone SE (1st gen), iPhone 5, and earlier: Press and hold the top button until the power slider appears, and then drag it to turn it off. iPad without a Home button: Press and hold either volume button at the same time as the top button, and then drag the slider to turn it off. iPad with a Home button: Press and hold the top button and then drag the power off slider to turn it off."
    },
    {
      "title": "Remove your phone's case.",
      "content": "Remove your phone's case. If you have an external case on your phone, take it off before you attempt to find the SIM tray."
    },
    {
      "title": "Locate the SIM tray.",
      "content": "Locate the SIM tray. The SIM tray is on the right side of all iPhone models except iPhone 3GS, 3G, and the original iPhone. [2] X Research source If you have an iPad, it's also on the right side for most models, although the iPad 4th, 3rd, and 2nd generations have SIM trays on the left side. You will know you've found the SIM tray when you see a very small hollow dot on a narrow panel."
    },
    {
      "title": "Eject the SIM tray.",
      "content": "Eject the SIM tray. Insert a SIM card removal tool, bent paperclip, needle, or other similarly thin object into the hole near the bottom of the SIM tray and gently push until the tray pops out."
    },
    {
      "title": "Remove the old SIM card from the tray.",
      "content": "Remove the old SIM card from the tray. You can gently lift out the card from the tray, or you can turn the tray over and allow the card to fall onto a soft surface (e.g., a towel). Make sure that you don't touch the gold connectors on the bottom of the SIM card."
    },
    {
      "title": "Place the new SIM card in the tray.",
      "content": "Place the new SIM card in the tray. The SIM card should only fit one way into the tray: the angled edge should be in the top-right corner of the tray."
    },
    {
      "title": "Insert the tray back into the phone.",
      "content": "Insert the tray back into the phone. It should click back into place, at which point the back of the SIM tray should be flush with the body of the phone."
    },
    {
      "title": "Power on your iPhone or iPad.",
      "content": "Power on your iPhone or iPad. Press and hold the right-side button on your iPhone (or the top of your iPad) to power it back on. When it comes back up, it will connect to the network of your new SIM card. If you set a SIM PIN for your phone, you'll have to enter it before you can use your phone on your carrier's network."
    },
    {
      "title": "Locate your Android's SIM slot.",
      "content": "Locate your Android's SIM slot. Android phones tend to have SIM card slots in different locations depending on the manufacturer and model, so it's best to research your specific model of phone to determine where the SIM slot is. Does your Android have a removable battery or back panel? This is not common anymore, but some newer models, such as the Samsung Galaxy XCover series, Moto E6 series, and BLU VIVO X5, do. [3] X Research source . If you turn your Android over and see a removable back cover, your SIM is likely under that panel. [4] X Research source You may need to remove the battery to find it. If your Android doesn't have a removable battery or back plate, the SIM tray will be a removable tray on one of the sides or button of the phone. The tray is only a few millimeters wide and has a hollow hole on one side—this hole is used to eject the tray. Look on all edges of your phone or tablet for the small hollow hole to find the SIM tray. If you're using a modern Samsung Galaxy A-series model or Google Pixel 4, your SIM tray is on the upper-left side of the phone. The Samsung Galaxy S21's SIM slot is on the bottom of the phone, while most other S models have slots on the left side. The OnePlus 9 and 9 Pro have SIM slots on the bottom edge of the phone."
    },
    {
      "title": "Eject the SIM tray (if you have one).",
      "content": "Eject the SIM tray (if you have one). If your phone has a SIM tray on the exterior, insert a SIM removal tool, bent paperclip, needle, or another similarly thin object into the hole on the side of the tray and gently push it in. It will then pop out."
    },
    {
      "title": "Remove the old SIM card from the tray.",
      "content": "Remove the old SIM card from the tray. You can gently lift out the card from the tray, or you can turn the tray over and allow the card to fall onto a soft surface (e.g., a towel). If your SIM is below the back panel, use your fingernails to gently pull it out of its slot instead. Remember which direction the SIM faces, as you'll want to insert the new SIM the same way. Make sure that you don't touch the gold contacts on the bottom of the SIM card."
    },
    {
      "title": "Place the new SIM card in the tray.",
      "content": "Place the new SIM card in the tray. The SIM card should only fit one way into a removable tray: the angled edge should be in the top-right corner of the tray. If your SIM card was below a removable panel, insert the new SIM the same way the old one was situated. Be sure to consult your specific phone's manual or online documentation if your experience here differs."
    },
    {
      "title": "Insert the tray back into the phone.",
      "content": "Insert the tray back into the phone. It should snap back into place, and the back of the tray should be level with the body of the phone. If your SIM tray is located below the battery, replace the battery and battery cover after swapping your SIM cards."
    },
    {
      "title": "Turn on your Android.",
      "content": "Turn on your Android. When your phone or tablet powers on, it should begin working with your carrier right away. If you set a SIM PIN for your phone, you'll have to enter it before you can use your phone on your carrier's network."
    }
  ]
}