{
  "url": "https://www.wikihow.com/Shower-After-Hip-Replacement-Surgery",
  "title": "Showering After a Hip Replacement: Best Bathroom Setup & More",
  "steps": [
    {
      "title": "Purchase a shower seat or bathroom commode chair at your local medical supply store.",
      "content": "Purchase a shower seat or bathroom commode chair at your local medical supply store. [1] X Expert Source OrthoNOW Orthopedic Professionals Expert Interview. 13 July 2021. This will allow you to sit on a seat while bathing, making soaping and cleaning your body with a sponge a lot easier. A bath seat also ensures you are not bending your hips greater than 90 degrees when sitting, it ensures your bottom is supported, and it helps you stand up easily after bathing. [2] X Research source Look for a metal, non-skid shower chair with a back to add more stability. Metal chairs are also more durable than plastics. Use a chair that is 17-18 inches higher than the floor to avoid bending your hips more than 90 degrees. [3] X Research source Justesen, S., 2009, July 1 Try to get a shower chair with a footrest so if you are trying to shave your legs, you do not have to bend over."
    },
    {
      "title": "Have a bidet installed near your toilet.",
      "content": "Have a bidet installed near your toilet. A bidet allows you to clean up after you go to the bathroom by having warm water sprayed on your bottom to wash and clean it. It also lets out warm air to dry your bottom. [4] X Research source It may be a good idea to also install a handheld showerhead. This will allow you to direct or control the flow of water on your body, especially if you are sitting down while showering."
    },
    {
      "title": "Install horizontal and vertical grab bars by your toilet.",
      "content": "Install horizontal and vertical grab bars by your toilet. [5] X Expert Source OrthoNOW Orthopedic Professionals Expert Interview. 13 July 2021. Horizontal bars will help you get in the bathtub and lower yourself down to a sitting position in the toilet, while vertical grab bars will help you get up from sitting on the shower seat or from the toilet. [6] X Research source Remember not to grab towel racks for support because these are not strong enough to hold your weight; you might end up falling."
    },
    {
      "title": "Raise your toilet seat.",
      "content": "Raise your toilet seat. This will prevent you from flexing your hip joint too much when sitting on the toilet after the operation. [7] X Research source One of the precautions after hip replacement is avoiding hip flexion greater than 90 degrees so you want to avoid bringing your knee up higher than your hip when sitting. [8] X Research source You can also purchase a detachable elevated seat cover or have a toilet safety frame installed. In your pre surgery consultation, ask your orthopedic surgeon where you can purchase a toilet safety frame."
    },
    {
      "title": "Place non slip rubber suction mats or silicone decals in the tub and on the floor surrounding the toilet seat.",
      "content": "Place non slip rubber suction mats or silicone decals in the tub and on the floor surrounding the toilet seat. This will prevent any slips or falls when you are using the bathroom post surgery. Make sure you also place a non slip or non skid bath mat outside the bathtub or shower door to help you get a firm footing after you bathe or shower."
    },
    {
      "title": "Move all bath toiletries so they are within easy reach.",
      "content": "Move all bath toiletries so they are within easy reach. Position your shampoo, soap, and sponge within reaching distance from your shower seat so you don’t have to exhaust yourself trying to access them post surgery. If possible, switch out bar soap for liquid soap. You can easily drop bar soap by accident, which will force you to reach or bend for it. Liquid soap will be easier to use."
    },
    {
      "title": "Place a stack of clean towels in the bathroom.",
      "content": "Place a stack of clean towels in the bathroom. You can store them on a low shelf in the bathroom or in a spot that is a short distance away and easy to access so you can dry yourself off in the bathroom, rather than having to get up and look for one."
    },
    {
      "title": "Keep in mind you will instructed not to shower for 3-4 days after your surgery.",
      "content": "Keep in mind you will instructed not to shower for 3-4 days after your surgery. This is to prevent your incision and bandages from getting wet. Your doctor will let you know when you can shower after your surgery. [9] X Research source In the meantime, wash your upper body with the usual soap and water by using the sink or a small basin. You may ask the nurse at the hospital to help you wash or clean your private areas/genitals. They will know how to assist you. Since you won’t be doing any other tasks other than to get well after your surgery, you won’t be perspiring much so just try to relax and focus on resting."
    },
    {
      "title": "Get a referral for an occupational therapist to assess your bathroom.",
      "content": "Get a referral for an occupational therapist to assess your bathroom. If you aren’t sure what changes may be necessary or best for your bathroom set up, your orthopaedic or rehabilitation doctor can refer you to an occupational therapist who is qualified to look at your bathroom and make safety recommendations before surgery. [10] X Research source"
    },
    {
      "title": "Protect the surgical site from water if waterproof dressings are not used.",
      "content": "Protect the surgical site from water if waterproof dressings are not used. Most surgical sites have waterproof dressings so your doctor may already permit you to take a shower provided you take some precautions. But if they are not used, your doctor will advise you not to get the dressing on the surgical site wet as a moist dressing is a breeding ground for harmful microorganisms that could lead to an infection. [11] X Research source Best, C., 2008, September 15) To protect a surgical site without waterproof dressings, get a plastic bag and cut it so it just covers the surgical dressing (should be at least a few inches larger than the dressing). Make two plastic bag covers. The second one is a backup in case the first bag has any holes. Place the two cut plastic bags on the surgical site. Get tape and secure it. Make sure that a part of the tape touches your skin to prevent water from entering. If you cannot do this on your own, ask someone for assistance. You can also use medical or surgical tape, which can be purchased at your local drugstore."
    },
    {
      "title": "Use a wet cloth to remove any tape on your skin from the waterproof dressing.",
      "content": "Use a wet cloth to remove any tape on your skin from the waterproof dressing. Almost all tape on the skin hurts when you remove them. Using a wet cloth on the tape will make it easier to remove the wet tape without hurting yourself. Do not to reuse the plastic bag covers as it may rip off upon removal of the tape. Use a new one each time you take a shower."
    },
    {
      "title": "Move both crutches, followed by the unaffected leg and then the affected leg into the bathroom.",
      "content": "Move both crutches, followed by the unaffected leg and then the affected leg into the bathroom. Usually, your doctor will provide you with crutches after surgery to avoid putting too much weight on the newly repaired hip. [12] X Research source Schoen, D., 2000, January 1 Make sure your crutches are placed within reach in the bathroom so you can grab them easily after you’re done showering."
    },
    {
      "title": "Let someone assist you with taking off your clothes and preparing the shower chair.",
      "content": "Let someone assist you with taking off your clothes and preparing the shower chair. Having a family member, friend, spouse, or professional home care worker help you do this makes it easier for you to shower and prevents you from stumbling or falling. Make sure there is a clean, dry towel within reaching distance, such as on the rubber mat on the floor, just outside your bathtub or close to the shower seat."
    },
    {
      "title": "With help, sit down on the shower chair.",
      "content": "With help, sit down on the shower chair. If you feel comfortable bathing on your own, instruct your assistant to stay outside of the bathroom where they can hear you in case you need help."
    },
    {
      "title": "Turn on the shower and begin to wash yourself.",
      "content": "Turn on the shower and begin to wash yourself. Use a shower sponge with a long handle to clean your legs, feet and toes. Then, use the sponge to clean the rest of your body. You can stand up from the shower seat once or twice when bathing as long as you make sure that before you stand up, you dry your hands with a towel nearby and grab the vertical hand bars to support your weight."
    },
    {
      "title": "Once you are finished bathing, turn off the shower and slowly pull yourself up from the shower seat.",
      "content": "Once you are finished bathing, turn off the shower and slowly pull yourself up from the shower seat. Make sure your hands are dry when grabbing the vertical bars or horizontal bars to avoid slipping. You can also have someone assist you as you get off the chair."
    },
    {
      "title": "Pat yourself dry with a clean towel.",
      "content": "Pat yourself dry with a clean towel. When drying your body, do not attempt to bend down from your waist beyond 90 degrees and avoid excessive inward or outward turning of your feet when standing. Do not twist your body. Hold onto the horizontal bars and make small stomping gestures with your feet to dry them out."
    },
    {
      "title": "Get actively involved in the healing and recovery process.",
      "content": "Get actively involved in the healing and recovery process. This means using the help and guidance of a health care team, such as your orthopaedic surgeon, your rehabilitation doctor and her team and your loved ones to support your recovery. [13] X Expert Source OrthoNOW Orthopedic Professionals Expert Interview. 13 July 2021. Returning to everyday activities will take time and you may need to make some modifications to your lifestyle as you recover. Performing basic activities like bathing, walking, running, toilet activities and sexual activities will need to be done in a modified way to account for your new hip."
    },
    {
      "title": "Do not cross your legs for eight weeks after surgery.",
      "content": "Do not cross your legs for eight weeks after surgery. This could lead to the dislocation of your new hip joint. [14] X Research source"
    },
    {
      "title": "Avoid bending your hips beyond 90 degrees or leaning forward when sitting.",
      "content": "Avoid bending your hips beyond 90 degrees or leaning forward when sitting. Do not bring your knees higher than your hip joint and always keep your back straight when sitting."
    },
    {
      "title": "Get someone else to pick something off the floor for you while you are sitting.",
      "content": "Get someone else to pick something off the floor for you while you are sitting. This is especially important when bathing. If the soap falls out of your hand while bathing, your knee jerk response may be to bend down and pick it up. Using liquid soap instead of bar soap will limit the chances of this happening. Anything you have dropped on the floor while bathing must not be picked up. Instead, dry yourself and get out of the shower or bathroom to ask for assistance from a trusted family member or a caregiver, in picking up the soap or whatever has been dropped to the floor."
    },
    {
      "title": "Understand how your hips work.",
      "content": "Understand how your hips work. Your hip joint is composed of a ball and a socket. The ball-like structure is attached to the long bone of the thigh called the femur, while the socket is located on the hip bone or pelvis. When you move your legs, this ball rotates into the socket (acetabulum). [15] X Research source Callaghan, J., Rosenberg, A., Rubash, H., 2007 In a healthy hip, the ball-like structure is able to glide smoothly in any direction inside the socket. This is because the smooth cartilage, which is a flexible tissue covering the ends of the bones, serves as a cushion. If the smooth cartilage gets worn out or damaged due to a fall or an accident, the movement of the ball and socket becomes rough and rubs against each other. This causes damage in your hip’s bone structure and reduces the mobility of your legs."
    },
    {
      "title": "Be aware of factors like age and disability that could lead to hip replacement surgery.",
      "content": "Be aware of factors like age and disability that could lead to hip replacement surgery. While there is really no absolute weight or age criteria for total hip replacement, most people who need hip replacement surgery are within 50-80 years of age. Orthopaedic surgeons will evaluate hip issues on a case to case basis but will often recommend it if you demonstrate: [16] X Research source Hip joint pain that severely limits your ability to do basic, daily activities. Hip joint pain that is present both at rest and during movement, day and night. Hip joint stiffness that limits your hip joint’s normal range of motion, especially when lifting your legs or while walking or running. If you have a degenerative hip joint condition, such as osteoarthritis, rheumatoid arthritis, bone necrosis, fracture or in lesser cases, hip joint diseases found in children. If you are not getting enough support or pain relief from medications, conservative treatment and orthopaedic assistive devices for walking such as a cane or walker."
    },
    {
      "title": "Ask your doctor if you require partial or total hip replacement.",
      "content": "Ask your doctor if you require partial or total hip replacement. In partial hip replacement, only the head of the femur is replaced by a metal ball so that it will glide into the socket smoothly. In a total hip replacement, both the ball and socket are replaced. [17] X Research source Total hip replacement surgery or hip arthroplasty, is a surgical procedure where the damaged bone and cartilage of the hip joint is removed and replaced with prosthetic parts. A socket made of a durable plastic replaces the worn out socket. It is then stabilized using a cement-like material. Your doctor may also just leave it in the socket to allow new bones growing in the area to stabilize it. [18] X Research source (Kennon, R., 2008, January 1) Total hip replacement surgery will eliminate debilitating pain in your hip joint and help you resume normal activities such as bathing, walking, running, driving, etc. which have become virtually impossible to do pre-operation due to your injured hip. [19] X Research source"
    },
    {
      "title": "Try non-invasive treatments before getting hip replacement surgery.",
      "content": "Try non-invasive treatments before getting hip replacement surgery. Not everyone who experiences hip joint pain are good candidates for hip replacement surgery. Even if you are a good candidate for surgery, your doctor will almost always prescribe non-invasive procedures first to treat your hip joint pain [20] X Research source such as medications, exercise, and lifestyle modification such as losing weight and a physical therapy program. Your doctor will only recommend hip replacement surgery when these non-invasive treatments have not adequately helped you recover and resume your daily activities."
    }
  ]
}