{
  "url": "https://www.wikihow.com/The-Elevator-Game",
  "title": "How to Play the Elevator Game (and Survive the Otherworld)",
  "steps": [
    {
      "title": "Find an elevator in a building at least 10 stories high.",
      "content": "Find an elevator in a building at least 10 stories high. For the best experience, go alone and at night. If you like, though, you’re permitted to bring a group of friends to play with you, and to go in the daylight, though you might not get the full experience. Just be aware that if any player quits while the game is going, the rest of the group may be affected… [1] X Research source"
    },
    {
      "title": "Ride the elevator past the 4th, 2nd, 6th, and 10th floors.",
      "content": "Ride the elevator past the 4th, 2nd, 6th, and 10th floors. Visit each of these floors in this order, pressing the button for the next floor after the elevator arrives. It’s important that when the doors open, you don’t get out. Let the doors close and keep riding the elevator. [2] X Research source If you do exit, the game ends immediately, and may not even work if you try it again."
    },
    {
      "title": "Ride to the 5th floor and ignore the woman there.",
      "content": "Ride to the 5th floor and ignore the woman there. When the doors open on the fifth floor, you’ll encounter a strange woman, who may look familiar to you or someone in your group. She may also board the elevator. By no means should you interact with her. Wait for the doors to close so you can go to the next floor. [3] X Research source Do not look at, speak to, or acknowledge the woman in any way. Nobody knows what happens if you do, perhaps because nobody has returned to tell the tale. The woman might also ask for help or feign distress. Disregard her completely."
    },
    {
      "title": "Press the button for the 1st floor and see if the game continues.",
      "content": "Press the button for the 1st floor and see if the game continues. When you press the 1st floor button, one of two things may occur: If the elevator actually takes you to the 1st floor, immediately exit both the elevator and the building, and don’t look behind you. Something has gone wrong, and the game is over. If you return home as fast as possible, you should be safe. [4] X Research source If the elevator instead takes you to the 10th floor, the game is on, and you’ve entered the Otherworld. You may leave the elevator to explore. If you end up on the 10th floor but decide to quit the game, stay in the elevator and press the button for the 1st floor again. The elevator should take you there; exit immediately when you arrive."
    },
    {
      "title": "Exit the elevator and walk around the Otherworld.",
      "content": "Exit the elevator and walk around the Otherworld. Things may be a little different than you expect—strange lights, odd noises, a chilling presence. Whatever you do, make sure you keep track of where you are and can find your way back to the elevator, so that you're not stuck in the Otherworld forever. Stay focused , as it’s easy to become disoriented there. [5] X Research source Some say the Otherworld is an alternate universe or another dimension. Whatever is, try not to linger for too long, and avoid touching or influencing things there. Note that your phone or other devices may not work here."
    },
    {
      "title": "Never speak to the strange young woman.",
      "content": "Never speak to the strange young woman. The young woman from the 5th floor may appear as you explore the Otherworld. Whatever you do, continue to ignore her. [6] X Research source Don’t look at her, speak to her, or touch her. If you encounter her, walk quickly back to the elevator to exit the Otherworld. As before, she may try to interact with you or ask you questions. Do not engage. Note that if the strange woman boards the elevator while you’re trying to leave the Otherworld, you must wait for her to exit first before you can proceed."
    },
    {
      "title": "Return to the elevator and repeat the initial steps to leave the Otherworld.",
      "content": "Return to the elevator and repeat the initial steps to leave the Otherworld. You must return to the elevator you arrived on for this to work. Once inside, ride the elevator past the 4th, 2nd, 6th, 10th, and 5th floors, in that order. Then, press the button for the first floor. When you arrive, check your surroundings, and go straight to the exit of the building. [7] X Research source If things don’t feel right on the first floor ( use your intuition ), repeat this step again, and only exit once it appears you’re back in the real world. The elevator may try to bring you back to the 10th floor after requesting the 1st floor. Press any of the elevator’s other floor buttons to disrupt it if it begins heading there."
    },
    {
      "title": "The Elevator Game was partly inspired by Elisa Lam.",
      "content": "The Elevator Game was partly inspired by Elisa Lam. Lam was a Canadian college student whose death was widely publicized after her body was found in the Cecil Hotel’s rooftop water tank in 2013. Surveillance footage captured Lam displaying strange behavior in the hotel’s elevator shortly before her disappearance–speaking to someone not there, strange movements, and jumping in and out of the elevator. [8] X Research source The Elevator Game emerged after the surveillance footage was released as a way to explain Lam’s behavior and subsequent death, though it’s probably not the cause of these. [9] X Research source The game may also have been adapted from a paranormal challenge popularized on South Korean and Japanese online message boards in 2008. [10] X Research source"
    },
    {
      "title": "The Elevator Game has since been adapted into a movie.",
      "content": "The Elevator Game has since been adapted into a movie. The movie was released in 2023, and follows a group of teens who set out to play the Elevator Game themselves, but they don’t all survive. The movie is available on Shudder, and was directed by Rebekah MecKendry. [11] X Research source There’s also a fan game available on Steam that lets you play the elevator game from the comfort of your computer!"
    },
    {
      "title": "Bloody Mary",
      "content": "Bloody Mary Bloody Mary is a classic urban legend game that you play in a dark bathroom in front of a mirror. Summon the ghost of Bloody Mary by standing before the mirror and saying her name 3 times: “Bloody Mary, Bloody Mary, Bloody Mary!” Just be warned that not everyone who plays survives…"
    },
    {
      "title": "Light as a Feather",
      "content": "Light as a Feather Play Light as a Feather if you’re looking for some lower stakes spooks with friends. One player lies on their back, and the others all attempt to lift them using just one finger each while chanting, “Light as a feather, stiff as a board.”"
    },
    {
      "title": "Charlie Charlie",
      "content": "Charlie Charlie “Charlie” is said to be a demonic spirit you can summon to ask your most pressing questions. Do the Charlie Charlie Challenge by splitting a piece of paper into 4 quadrants labeled “yes” and “no.” Then balance one pencil on top of another and ask your question. The top pencil often wavers to point at one of the answers!"
    }
  ]
}