{
  "url": "https://www.wikihow.com/Teach-Your-Dog-to-Herd",
  "title": "How to Teach Your Dog to Herd",
  "steps": [
    {
      "title": "Teach your dog basic training tricks.",
      "content": "Teach your dog basic training tricks . Even non-herding breeds can easily be taught to sit, come, lie down, and heel whether or not you continue their training. Unless your dog knows how to be obedient off-leash and listen to you despite distractions, training to herd sheep will be difficult, if not impossible."
    },
    {
      "title": "Take note of your dog’s behavior.",
      "content": "Take note of your dog’s behavior. A dog with solid herding instincts will display this aptitude early on. Look for your dog moving around you or other animals in a circular motion. If your dog does not display early signs of these instincts, you may not be able to train it to herd."
    },
    {
      "title": "Consider professional training.",
      "content": "Consider professional training. If you are serious about dog herding, you should consider training yourself or the dog sooner rather than later. The earlier in your dog’s life you use the most up-to-date training techniques, the better the result. It is possible to teach your dog more advanced commands without professional help, but only the most instinctive herders will pick it up easily. [1] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source"
    },
    {
      "title": "Play catch with your dog.",
      "content": "Play catch with your dog. As soon as you take your dog home, start getting it to retrieve balls or toys for you. As soon as you can, teach it to get the toy only at your command. This will develop its instincts for chasing as well as basic obedience. [2] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source"
    },
    {
      "title": "Teach your dog directional movement.",
      "content": "Teach your dog directional movement. It is important that your dog learn verbal commands for left and right. Use a leash and walk your dog through the motions. Combine this with repetitive verbal commands so your dog learns the association. Teach your dog to run right, or clockwise, when you say “come bye” or “bye” for short. The command for left, or counterclockwise, is “away to me” or “’way” for short. Get your dog used to stopping and lying down when you say “wait,” “lie down,” “sit,” or a similar word."
    },
    {
      "title": "Get your dog acclimated to livestock.",
      "content": "Get your dog acclimated to livestock. You don’t want your dog’s first encounter with livestock on show day. Get it used to obeying your commands around sheep and other animals. Contact local dog herding associations to find out where you can take your dog to meet livestock. [3] X Research source"
    },
    {
      "title": "Train your dog to herd a real animal.",
      "content": "Train your dog to herd a real animal. See if you can buy or get access to a lamb or duck for your dog to practice herding. Put them in a small kennel and practice the basic commands “come bye” and “away to me.” Now is a good time to practice your “lie down” command. Get your dog used to obeying your basic commands. [4] X Research source"
    },
    {
      "title": "Watch your dog's body language.",
      "content": "Watch your dog's body language. It should be clear if your dog has the right instincts for advanced herding. Its tail should go down when it is around the flock, meaning that it is thinking. It should naturally run circles around the livestock and respond to your commands. You can only take this interest as far as your dog will let you, so respect natural limits."
    },
    {
      "title": "Move onto more complex commands.",
      "content": "Move onto more complex commands. Once your dog is obedient to you, acclimated to livestock, and knows basic commands, teach them useful maneuvers. Getting your dog to run around the herd is useful, but the ability to move it from place to place is the next step. Work toward a practical application of herding commands. Outrun: your dog will run past the flock and stop them from moving away from you. This is important to getting the flock under control. The lift: your dog has to introduce itself to the flock. Working on this move will get the flock to respect your dog and follow its directions. The fetch: in this move, your dog will work the flock back to you. This has an important applicability for working dogs."
    },
    {
      "title": "Enroll in classes or shows.",
      "content": "Enroll in classes or shows. The basics for herding will only get you so far. If you want to take this hobby further and compete in shows, you need to teach your dog more complex commands. There are a host of herding commands that you may need to know on show day. Teaching them to your dog may require a little more expertise than you have been able to pick up thus far. If your dog displays little enthusiasm for the classes, it may not be well-suited for herding. You should always pay attention to the wants and needs of your dog."
    },
    {
      "title": "Enroll in tests and trials.",
      "content": "Enroll in tests and trials. When it is time, sign you and your dog up for a show. The excitement of having lots of dogs, people, and new scents and sounds will be confusing for your dog at first. You will probably have to compete in a few shows before your dog scores some wins. [5] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source"
    }
  ]
}