{
  "url": "https://www.wikihow.com/Turn-Off-Your-iPod",
  "title": "2 Ways to Turn Off Your iPod Touch, Nano & Classic",
  "steps": [
    {
      "title": "Press and hold the Sleep/Wake button.",
      "content": "Press and hold the Sleep/Wake button. It's on the upper-right part of the iPod's housing."
    },
    {
      "title": "Release the button when the \"slide to power off\" slider appears at the top of the screen.",
      "content": "Release the button when the \"slide to power off\" slider appears at the top of the screen. It should appear in 3-5 seconds. [1] X Research source"
    },
    {
      "title": "Swipe \"slide to power off\" to the right.",
      "content": "Swipe \"slide to power off\" to the right. Your iPod will power off. [2] X Research source To power on your iPod, press and hold the Sleep/Wake button until you see the Apple logo, then release it. If your iPod is unresponsive, you may need to perform a force restart . All you need to do is hold down both the Top and Volume Down(or Home button if you have it) buttons at the same time for about 10 seconds. During that time, you'll see the iPod turn off, then the screen will display the Apple logo, at which time you can release those buttons. [3] X Research source"
    },
    {
      "title": "Press and hold the \"Play/Pause\" button until the display disappears.",
      "content": "Press and hold the \"Play/Pause\" button until the display disappears. If you have a 6th or 7th Gen nano, the buttons to turn it off are different: Press and hold the Sleep/Wake buttons, then slide the button at the top. [4] X Research source Instead of powering your iPod off, you can also wait for it to go into sleep mode. If you don't touch it or play music for a while, the screen will dim and eventually turn off. When the screen is black, your iPod is sleeping. While sleeping, your iPod conserves battery, as if it were off. However, it is faster to play music again since you don't have to restart it."
    },
    {
      "title": "Slide the \"Hold\" switch to the \"On\" (orange) position.",
      "content": "Slide the \"Hold\" switch to the \"On\" (orange) position. You turned your iPod off by holding the Play/Pause button, and this will ensure that the power remains off even if you accidentally hit a button. [5] X Research source Slide the switch to the \"Off\"(white) position to turn your iPod back on. If your iPod is unresponsive, you may need to perform a force restart . To do this, press and hold the Sleep/Wake button and the Home (or Volume Down) button until the screen turns off. The Apple logo will appear and you can release the buttons. [6] X Research source"
    }
  ]
}