{
  "url": "https://www.wikihow.com/Use-OneDrive",
  "title": "Getting Started with OneDrive: How-To Guide for Web & Mobile",
  "steps": [
    {
      "title": "Sign in to OneDrive, or create an account.",
      "content": "Sign in to OneDrive, or create an account. Go to https://www.onedrive.com/ . If you already have a OneDrive account, click Sign in and enter your Microsoft 365 email and password to log in. If you don't have a OneDrive account, click Sign up for free and follow the on-screen instructions to sign up for a free Microsoft 365 account. Free accounts get up to 5 GB of cloud storage. [1] X Research source If you need more storage, you can sign up for a paid Microsoft 365 subscription on Microsoft's website ."
    },
    {
      "title": "Find the navigation pane.",
      "content": "Find the navigation pane. The navigation pane is on the left-hand side of the screen, and has links to the various locations of your OneDrive. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source My Files: The de facto \"home\" page of your OneDrive that holds all of your files and folders. Recent: Displays the files you worked on last in reverse chronological order. Photos: Opens OneDrive photos, where you can manage your uploaded photos and videos. Shared: Shows the files that you have shared with others, and that others have shared with you. Recycle bin: All deleted files and folders will be found here."
    },
    {
      "title": "Find the toolbar.",
      "content": "Find the toolbar. The toolbar is across the top of the screen, and houses a number of buttons and options to help you use OneDrive. New & Upload: Allows you to create a new file or upload an existing one to your OneDrive. Sort: Changes how your files are sorted in the current view. View: Changes your OneDrive view between List, Compact List, and Tiles. Details: Shows your recent OneDrive activity."
    },
    {
      "title": "Find the search bar.",
      "content": "Find the search bar. The search bar is located at the top of the screen. Enter keywords or tags to search for files and folders in your OneDrive."
    },
    {
      "title": "Sign in to OneDrive, or create an account.",
      "content": "Sign in to OneDrive, or create an account. Download and install the mobile app, if you don't already have it. You can get OneDrive from the Apple App Store or the Google Play Store . If you already have a OneDrive account, enter your Microsoft 365 email and password on the main \"Sign In\" page to log in. If you don't have a OneDrive account, tap Sign Up at the bottom of the screen and follow the on-screen instructions to sign up for a free Microsoft 365 account. Free accounts get up to 5 GB of cloud storage. [3] X Research source If you need more storage, you can sign up for a paid Microsoft 365 subscription on Microsoft's website ."
    },
    {
      "title": "Find the navigation bar.",
      "content": "Find the navigation bar. The navigation bar is at the bottom of the screen, and has links to the various locations of your OneDrive. [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Home: The home screen of your OneDrive app that shows your recent and offline files. Files: The page that holds all of your files and folders. You can access the Recycle Bin on this page. Camera: Opens the camera so you can scan a document into OneDrive. Shared: Shows the files that you have shared with others, and that others have shared with you. Photos: Displays the photos and videos you've uploaded."
    },
    {
      "title": "Find the toolbar.",
      "content": "Find the toolbar. The toolbar is across the top of the screen, and it has a few buttons that will help you use OneDrive. Initials button: In the top-left corner there is a button with your initials. Tapping that button opens a menu that allows you to add another account, access your offline files and recycle bin, open settings, get help and submit feedback, and manage your storage (or purchase more). Diamond: Brings you to a screen where you can pay to upgrade your OneDrive account. Plus: Opens a dropdown menu that allows you to create, upload, or scan in new files and folders."
    },
    {
      "title": "Find the search bar.",
      "content": "Find the search bar. The search bar is located at the top of the screen. Enter keywords or tags to search for files and folders in your OneDrive."
    },
    {
      "title": "Open a folder if desired.",
      "content": "Open a folder if desired. You can create files and add them directly to the files page, but if you want to organize your files, first double-click or tap a folder to open it. Files can also be moved after creating them by clicking or tapping the three-dot button next to the file name and selecting Move to (web)/ Move (mobile)."
    },
    {
      "title": "Create a new file.",
      "content": "Create a new file. On the web, click New & Upload . On the mobile app, click the \"+\" button. Then, select how you want to add a new file. The options vary depending on if you're using the web or mobile app version of OneDrive: Web: You can create a new Word document, Excel workbook, PowerPoint presentation, OneNote notebook, Forms survey, or plain text document. Mobile app: The app can only create a new Word document, Excel workbook, or PowerPoint presentation, and you'll need the free Microsoft 365 Office app to make them. You can also tap Take a Photo or Video to add a new photo or video to your OneDrive."
    },
    {
      "title": "Start working in your document.",
      "content": "Start working in your document. Once you select what kind of document you want to make, OneDrive will open up the new document in a new tab or in the Microsoft 365 Office app. The document will automatically save into OneDrive as you work on it."
    },
    {
      "title": "Open a folder if desired.",
      "content": "Open a folder if desired. You can upload files directly to the files page, but if you want to organize your files, first double-click or tap a folder to open it. Files can also be moved after uploading them by clicking or tapping the three-dot button next to the file name and selecting Move to (web)/ Move (mobile)."
    },
    {
      "title": "Upload a file.",
      "content": "Upload a file. On the web, click New & Upload . On the mobile app, click the \"+\" button. Then, select how you want to upload your file. The options vary depending on if you're using the web or mobile app version of OneDrive: Web: Select Files upload and pick a file from your computer that you want to upload. Mobile app: Select Upload > Browse to upload a file from your phone, or tap Scan to use your phone's camera to scan in a document."
    },
    {
      "title": "Open a folder if desired.",
      "content": "Open a folder if desired. If you want to add a folder inside of a folder, select the parent folder. Otherwise, you can add the folder directly to your files page. Folders can also be moved after creating or uploading them by clicking or tapping the three-dot button next to the folder name and selecting Move to (web)/ Move (mobile)."
    },
    {
      "title": "Create or upload a folder.",
      "content": "Create or upload a folder. On the web, click New & Upload . On the mobile app, click the \"+\" button. To create a new folder, click Folder on the web or tap Create a Folder on the mobile app. If you're creating a new folder, you must give it a name before you can create it. To upload a folder, click Folder upload on the web. There is currently no way to upload a folder to OneDrive via the mobile app."
    },
    {
      "title": "Start using your folder.",
      "content": "Start using your folder. Move other files or folders into your newly created or uploaded folder by clicking or tapping the three-dot button next to the file or folder name and selecting Move to (web)/ Move (mobile app). If you want to rename your folder, click or tap the three-dot icon and select Rename ."
    },
    {
      "title": "Click or tap the three-dot icon next to a file or folder.",
      "content": "Click or tap the three-dot icon next to a file or folder. This will open the options menu for the file or folder, and you may see some or all of the following options: Preview (web only): Allows you to preview the file without opening it. Open: Lets you choose to open the file in the online version of the Microsoft Office program or the desktop app version. On mobile, this will open the file in the Microsoft 365 Office app. Share: Allows you to share your selected file or folder through OneDrive, social media, messaging, or email. Manage access (web only): Allows you to manage who has access to your file or folder. Delete: Sends the selected item to the Recycle Bin. Make Available Offline (mobile only): Adds the selected file or folder to your OneDrive's \"Offline\" folder, which will let you access the stored files while offline. Move to/Move: This option allows you to move your file or folder to a different location in your OneDrive. Copy to (web only): Select a file location to which you'll copy your selected item without moving it. Download (web only): Downloads the selected item to your computer's desktop. Mobile users can use the Open in Another App option in this menu to download a file to their phone. Rename: Change your selected item's name. On mobile the options are Rename This File and Rename This Folder . Embed (web only): Generates an HTML code that will allow you to embed your selected file in a website or blog. Version history (web only): Opens the file in a new tab and allows you to see what edits were made to the file. Create album from folder: Takes the files in the folder and makes a new album with them in OneDrive Photos. Details: Shows information about your file or folder, such as when it was last modified, the size, and who it is shared with."
    },
    {
      "title": "Download and install the OneDrive desktop app.",
      "content": "Download and install the OneDrive desktop app. The OneDrive desktop app is free, and can be downloaded on Microsoft's website for Windows and macOS. With the desktop app, you can sync files with your other devices, including the web and mobile versions of OneDrive. Sign in with your Microsoft 365 account once OneDrive is installed. Follow the on-screen instructions to set up OneDrive. On Windows, OneDrive will automatically make a new OneDrive folder for you. On macOS, you will have to select where you want your OneDrive folder to be saved. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you have Windows 11, OneDrive is already installed on your computer."
    },
    {
      "title": "Select which folders you want to back up to OneDrive.",
      "content": "Select which folders you want to back up to OneDrive. The OneDrive app will ask you during setup which folders you want to back up to your drive. But what do you do if you want to change which folders get backed up to your OneDrive after setup? According to Mitch Harris, tech consultant, this is easy to adjust. \"You can just go into OneDrive settings and choose which computer folders you might want to include in the backup,\" Harris says. On Windows, right-click on your OneDrive folder and select Settings . In the Sync and backup menu, click Manage backup to change what folders get backed up to OneDrive. On macOS, click the OneDrive icon in the menu bar, then click the three-dot icon to open the menu. Go to Preferences > Backup and select Manage Back up to change what folders get backed up to OneDrive. [6] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Open your OneDrive folder.",
      "content": "Open your OneDrive folder. Any files and folders that were in your OneDrive on the web or mobile apps will have automatically synced. And likewise, any files or folders you place in your OneDrive folder will sync with the web and mobile apps as well."
    }
  ]
}