{
  "url": "https://www.wikihow.com/Stop-Heavy-Breathing",
  "title": "How to Stop Heavy Breathing",
  "steps": [
    {
      "title": "Try a deep breathing exercise.",
      "content": "Try a deep breathing exercise. Start by counting your breaths so you become aware of them. Then, put your hands over your ribcage. Slowly inhale to a count of 10 and fill your entire rib cage with air. [1] X Expert Source Ni-Cheng Liang, MD Board Certified Pulmonologist Expert Interview. 18 June 2021. Then, slowly exhale to a count of 10, letting your rib cage fall. Repeat until you feel calm. [2] X Research source As an alternative, you can try diaphragmatic breath by inhaling so you expand your stomach before your ribcage and upper chest. Hold your breath for 1–3 seconds, and then exhale from your chest first followed by your stomach."
    },
    {
      "title": "Loosen your clothing if it feels tight.",
      "content": "Loosen your clothing if it feels tight. Clothing that is fitted or too small may restrict your ability to breathe. This is especially true if you're wearing garments like shapewear or a corset. Make sure that your clothing doesn't feel restrictive. If it does, loosen or remove the clothing that is bothering you. [3] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source If an item of clothing is too small for you, it's best to choose something else."
    },
    {
      "title": "Reduce your exertion level if exercise is causing your heavy breathing.",
      "content": "Reduce your exertion level if exercise is causing your heavy breathing. Exercise is a common cause of heavy breathing, especially if you're pushing yourself to work hard. Slowing down or stopping for a few minutes to drink some water can help you breathe easier. Keep in mind that your fitness level will increase over time if you keep working out, so you won't have to slow down or stop as often. [4] X Research source Always listen to your body. If you're getting winded, slow down and give yourself time to recover."
    },
    {
      "title": "Drink a glass of water if you may be dehydrated.",
      "content": "Drink a glass of water if you may be dehydrated. Sometimes dehydration can make you feel winded, which can cause you to breathe heavily. Fortunately, relieving dehydration is as easy as drinking a glass of water. If dehydration caused your heavy breathing, it should go away after you take in more fluids. [5] X Research source As an alternative, you may want to drink a sports drink to boost your electrolytes, as well."
    },
    {
      "title": "Rest and cool off if you're feeling overheated or feverish.",
      "content": "Rest and cool off if you're feeling overheated or feverish. Getting overheated or feeling ill can cause you to become winded. This is especially true if you're trying to be active. When you feel overheated or feverish, sit down in a cool location and give yourself a chance to catch your breath. [6] X Research source If you're ill, continue to rest until you start to feel better."
    },
    {
      "title": "Take an antihistamine if you have seasonal allergies.",
      "content": "Take an antihistamine if you have seasonal allergies. Sometimes heavy breathing is caused by your airways narrowing due to inflammation caused by seasonal allergies. In some cases, your allergies might also make you feel ill by causing sneezing, itchy eyes, and a runny nose. Fortunately, over-the-counter antihistamines can treat your symptoms and help you breathe easily. [7] X Research source Talk to your doctor before taking an antihistamine. Many antihistamines cause drowsiness, so look for one that is non-drowsy. For example, cetirizine (Zyrtec) and loratadine (Claritin) are both non-drowsy options."
    },
    {
      "title": "Maintain a healthy weight for your height and age.",
      "content": "Maintain a healthy weight for your height and age. Carrying extra weight on your body can make you get winded more easily. This means you're more likely to experience heavy breathing. [8] X Expert Source Ni-Cheng Liang, MD Board Certified Pulmonologist Expert Interview. 18 June 2021. Additionally, you may be more likely to develop other conditions, like sleep apnea, that can affect your breathing. It's best to keep your weight in a healthy range, depending on your height and age. [9] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source If you need to lose weight, eat a healthy diet composed of lean proteins and plenty of fresh produce. Additionally, minimize your consumption of added sugars. Being active every day can also help you manage your weight. However, talk to your doctor before beginning a workout plan."
    },
    {
      "title": "Do 30 minutes of moderate exercise every day.",
      "content": "Do 30 minutes of moderate exercise every day. Not only is exercise great for managing a healthy weight, it also helps you keep your heart and lungs healthy. [10] X Expert Source Ni-Cheng Liang, MD Board Certified Pulmonologist Expert Interview. 18 June 2021. Since heart and lung issues can both cause heavy breathing, working out regularly can help you breathe more easily. [11] X Research source Talk to your doctor to make sure you're ready to start exercising. Great exercise options include walking, jogging, swimming, aerobics, group classes, kickboxing, dancing, and using cardio machines."
    },
    {
      "title": "Manage your anxiety",
      "content": "Manage your anxiety to reduce its effect on you. Anxiety can cause you to have trouble breathing and may make your chest feel tight. Learning better ways to cope with your anxiety may help you reduce these symptoms. Here are some techniques you can try: [12] X Research source Do breathing exercises, like counting your breaths. [13] X Expert Source Ni-Cheng Liang, MD Board Certified Pulmonologist Expert Interview. 18 June 2021. 5–7 diaphragmatic breaths to bring oxygen into your body and calm your nervous system. Meditate every day for 5-10 minutes. Use mindfulness strategies to help you focus only on the present. Substitute positive self-talk, like “I am enough” or “It will be okay,” for the worries in your head. Practice regular self-care."
    },
    {
      "title": "Stop smoking, if you do.",
      "content": "Stop smoking, if you do. You likely know that smoking is bad for your breathing. However, quitting can be very difficult, especially if you do it on your own. Fortunately, your doctor can help you figure out which quitting aids can work for you so that you can stop smoking for good. [14] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source For example, you may be able to use gum, patches, or prescription medication to help you quit. Additionally, your doctor may be able to help you find a support group that meets in your area so that you won't have to do it alone."
    },
    {
      "title": "Keep your home free of dust and allergens if you have allergies.",
      "content": "Keep your home free of dust and allergens if you have allergies. It's easy to overlook allergens in your home that might be causing your breathing issues. Make sure you're regularly cleaning up dust, debris, and pet dander so that it doesn't trigger your allergies. [15] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source You might also install a HEPA filter to help clean the air in your home. Taking off your shoes when you enter your home can also help decrease the allergens that circulate in the air."
    },
    {
      "title": "Avoid drinking alcohol close to your bedtime.",
      "content": "Avoid drinking alcohol close to your bedtime. Since alcohol acts as a depressant, it relaxes the muscles in the back of your throat. This can cause snoring and other breathing issues while you're trying to sleep. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Similarly, don't take drugs that depress your system, like muscle relaxers."
    },
    {
      "title": "Avoid large meals before bed.",
      "content": "Avoid large meals before bed. Large meals within a few hours of bedtime can make you breathe heavier and even cause snoring. Try to time out your dinner so you at least have 2–4 hours before you fall asleep. [17] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Sleep on your side rather than your back.",
      "content": "Sleep on your side rather than your back. When you sleep on your back, your tongue and soft palate can block your airways, causing you to struggle to breathe. Additionally, extra weight on your chest or stomach may press down on your lungs, causing you to breathe more heavily. Alternatively, sleeping on your side keeps your airways more open. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you have a tendency to roll onto your back, you can attach something like a tennis ball onto your nightshirt so that it's uncomfortable for you to roll over. As another option, you can buy a device that vibrates whenever you roll onto your back. These are available online or at some department stores."
    },
    {
      "title": "Elevate the head of your bed.",
      "content": "Elevate the head of your bed. Studies have shown than raising the head of your bed can help resolve heavy breathing, improve your quality of sleep, and lessen the symptoms of obstructive sleep apnea. Try to lift the head of your mattress by around 6 inches (15 cm) by using a wedge or pillows. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Check for symptoms of sleep apnea.",
      "content": "Check for symptoms of sleep apnea . Heavy breathing while you're sleeping may be caused by sleep apnea, which occurs when you stop breathing periodically during sleep. Sleep apnea can be a serious condition, but treatments are available. If you notice the following symptoms, see your doctor: [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Loud snoring Gasping for air during sleep Dry mouth when you wake up Morning headaches [21] X Expert Source Ni-Cheng Liang, MD Board Certified Pulmonologist Expert Interview. 18 June 2021. Insomnia Daytime sleepiness Difficulty concentrating Irritability"
    },
    {
      "title": "Talk to your doctor about treatment options if you have sleep apnea.",
      "content": "Talk to your doctor about treatment options if you have sleep apnea. If your doctor diagnoses you with sleep apnea, they may recommend lifestyle changes for a mild case. However, you may need additional treatment for a moderate to severe case of sleep apnea. Here are some of the treatment options your doctor might offer: [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source An oral appliance can bring your jaw forward to help you breathe better. This is the simplest and easiest treatment option, but it's not as effective as a CPAP machine. A continuous positive airway pressure (CPAP) machine is the most common treatment for sleep apnea. This machine comes with a mask that you fit over your face to help you breathe throughout the night. A bilevel positive airway pressure (BPAP) machine can also help you breathe at night, but it's not as helpful as a CPAP machine. However, some people find the BPAP more comfortable."
    },
    {
      "title": "Get emergency care if you have shortness of breath or heart or lung disease.",
      "content": "Get emergency care if you have shortness of breath or heart or lung disease. Heavy breathing can be a sign of a serious condition, especially if you have known health problems. It's best to get immediate help if you're having trouble breathing or have a previously diagnosed health condition. In some cases, heavy breathing can be related to a serious health issue, such as a heart attack. [23] X Research source Ask your doctor for a same-day appointment or visit an urgent care center. If you're alone, it's best to call for help."
    },
    {
      "title": "Visit your doctor if you may have a respiratory infection.",
      "content": "Visit your doctor if you may have a respiratory infection. Heavy breathing can occur if you've had infections like the flu, bronchitis, pneumonia, a cold, or a sinus infection. Although these illnesses often go away without medical treatment, you need additional care if your symptoms have become severe, such as when your breathing is affected. [24] X Research source For instance, your viral infection may have triggered a bacterial infection, which can require antibiotics. Similarly, the inflammation and discharge may be blocking your airways to the point that you need a breathing treatment. Your doctor can recommend the best treatment options for your symptoms."
    },
    {
      "title": "Talk to your doctor if you have symptoms of asthma.",
      "content": "Talk to your doctor if you have symptoms of asthma. This may include burning, panic, or dizziness, as well as trouble taking a breath. Asthma often begins in childhood but can occur at any age. If you have asthma, you may experience heavy breathing before or during an attack. Your doctor can prescribe you an inhaler and possibly other medications to manage your condition. [25] X Research source If you know you have asthma, use your inhaler if you're having breathing issues."
    },
    {
      "title": "Talk to a counselor or therapist if you're struggling with anxiety.",
      "content": "Talk to a counselor or therapist if you're struggling with anxiety. They can help you work through your issues and learn new ways to cope. Anxiety can be a difficult condition to live with, so don't hesitate to reach out for help. [26] X Research source Look for a therapist who has experience in treating people who have anxiety."
    }
  ]
}