{
  "url": "https://www.wikihow.com/Stop-Neck-Cracking",
  "title": "A Complete Guide to End a Neck Cracking Habit",
  "steps": [
    {
      "title": "Remind yourself why you want to stop cracking your neck.",
      "content": "Remind yourself why you want to stop cracking your neck. Having personalized motivation is essential to breaking any habit —and cracking your neck is no exception! [1] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Manual neck cracking can irritate your neck cartilage and soft tissue over time, which isn’t good for your long-term health. [2] X Research source In especially rare cases, manual neck cracking can tear an artery and potentially cause a stroke. [3] X Research source"
    },
    {
      "title": "Replace the neck cracking with a different habit.",
      "content": "Replace the neck cracking with a different habit. The next time you’re tempted to crack your neck, try doing a different stretch or activity instead. [4] X Research source Chin tucks are a great option—just stare straight ahead, pull your chin towards your neck a little bit, and slowly bring your head back to a neutral position (without turning or moving it around). Stay in this position for 5 seconds, relax, and then repeat it 4 more times. [5] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Go easy on yourself if you can’t break the habit right away.",
      "content": "Go easy on yourself if you can’t break the habit right away. Chances are, you won’t stop cracking your neck overnight—and that’s okay! Be mindful of when you do crack your neck, and make a conscious effort to do it less in the future."
    },
    {
      "title": "Occasional, gentle neck cracking should be safe, but avoid manual cracking.",
      "content": "Occasional, gentle neck cracking should be safe, but avoid manual cracking. Leaning your head to the side and hearing a pop is totally normal—if anything, it’s just a sign that you’re a little stiff there. [6] X Expert Source Eric Christensen, DPT Physical Therapist Expert Interview. 17 March 2021. The important thing is to avoid applying a lot of pressure to your neck and to stop if you experience any pain. Also, only let trained professionals crack your neck—if a friend or other untrained person does it, you could get injured. [7] X Research source Your neck contains delicate nerves and blood vessels, so it’s important to always be gentle!"
    },
    {
      "title": "Painless neck cracks are caused by gas bubbles in your neck joints.",
      "content": "Painless neck cracks are caused by gas bubbles in your neck joints. Also known as neck crepitus, this common condition occurs when tiny gas bubbles form and collapse around your neck joints as you move. It can occur during natural movements, like when you turn your head to back out in your car, or during purposeful manipulation of the neck, like when you get a chiropractic adjustment. [8] X Research source Natural cracks and pops can also occur when a ligament or tendon moves around a bone in the neck. This is more likely if the muscles and tissues in the neck are too tight, but it can also occur as the muscles and tissues in the neck become less elastic with age. In some cases, neck cracking can be the result of bones rubbing against each other due to osteoarthritis or disc degeneration."
    },
    {
      "title": "Painful neck cracks can be a sign of an underlying medical condition.",
      "content": "Painful neck cracks can be a sign of an underlying medical condition. If your neck cracking is accompanied by stiffness or pain, that could be a sign that something more serious is going on. In that case, you should talk to your doctor. [9] X Research source You should also talk to your doctor if your neck cracks frequently or constantly, or if it’s cracking after a recent injury or surgery. [10] X Research source"
    },
    {
      "title": "A professional chiropractic adjustment may help with neck pain.",
      "content": "A professional chiropractic adjustment may help with neck pain. During a session, a chiropractor carefully manipulates your joints, which can provide pain relief and improved mobility. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source However, chiropractic adjustments don’t work for everyone, and there are still risks even when you’re working with a professional. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Some research has shown that people associate the sound of their neck cracking with a feeling of relief, even when there isn't actually any tension being released. [13] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source That could be why many people feel temporary relief when they crack their neck on their own."
    },
    {
      "title": "Work with your doctor if you’re experiencing neck pain.",
      "content": "Work with your doctor if you’re experiencing neck pain. If you’re regularly cracking your neck in an attempt to alleviate pain, a doctor can help identify what’s causing the pain and recommend the best treatment. Depending on the cause of your pain, they may suggest things like home exercises, medication, physical therapy, or short-term immobilization. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source A doctor might suggest that you wear a soft neck collar for short periods of time to help immobilize your neck. Your doctor might also suggest steroid injections to help you manage the pain. In physical therapy, your therapist may coach you on good posture habits, teach you neck-strengthening exercises, and help you manage your pain with applied heat or ice."
    },
    {
      "title": "Gently stretch your neck by doing a chin tuck.",
      "content": "Gently stretch your neck by doing a chin tuck. Look straight ahead, tuck your chin, and slowly move your head back. Hold this position for 5 seconds, and then do the stretch 4 more times. [15] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Your neck might be supplying more stability than it should be if you're feeling really stiff. [16] X Expert Source Eric Christensen, DPT Physical Therapist Expert Interview. 17 March 2021. Exercise like the chin tuck can help lower this pain around your neck and upper back muscles. [17] X Research source"
    },
    {
      "title": "Ice your neck for 2 days and follow up with heat.",
      "content": "Ice your neck for 2 days and follow up with heat. During the first 2 days you experience neck pain, place a towel-wrapped ice pack over your neck for 15 minutes at a time. If your neck is still sore after this, treat the pain by applying a low-temperature heating pad and/or by hopping in a warm shower for a few minutes. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Painkillers like acetaminophen and ibuprofen may also help you manage the pain—just be sure to follow the correct dosage instructions on the bottle. [19] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Work on your posture to prevent future neck pain.",
      "content": "Work on your posture to prevent future neck pain. Whenever you stand, improve your posture by keeping your neck straight, aligning your shoulders with your hips, tucking in your stomach, and balancing your weight between both feet. [20] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source When you sit, support your back (along with your hips and upper legs), uncross your legs, relax your shoulders, and plant your feet firmly on the ground. [21] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Good posture doesn’t just help with neck pain—it also helps prevent back pain. [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Try acupuncture, massage, or chiropractic treatments.",
      "content": "Try acupuncture, massage, or chiropractic treatments. Besides working with a doctor, alternative medicine treatments may help you manage your neck pain. Talk with your doctor before scheduling any acupuncture, chiropractic, or massage sessions to make sure these treatments are a good option for you. [23] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For instance, acupuncture may not be a good option if you take an anticoagulant. [24] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    }
  ]
}