{
  "url": "https://www.wikihow.com/Treat-Tongue-Burn-Blisters",
  "title": "How to Treat Tongue Burn Blisters",
  "steps": [
    {
      "title": "Spit out whatever burned you.",
      "content": "Spit out whatever burned you. You'll probably realize right away that the food or beverage you just put in your mouth was way too hot. You should remove the food or drink that burned you immediately, or it will keep scalding your mouth. It isn't always possible to spit the food out, but you should try to do this instead of swallowing the food so you don't continue burning your throat and esophagus."
    },
    {
      "title": "Drink cold water immediately.",
      "content": "Drink cold water immediately. This helps in two ways. First, it will cool off the burned area. Second, it removes any food or liquid that is still hot. Oily foods especially can leave hot liquid in your mouth that will continue to burn you if you don't flush it away quickly. Cold milk coats the inside of your mouth more thoroughly than water. You may find extra relief from drinking some cold milk."
    },
    {
      "title": "Place an ice cube on your tongue.",
      "content": "Place an ice cube on your tongue. After rinsing with cold water, suck on an ice cube for 5 to 10 minutes. This will keep your mouth cold and prevent any further burning, sparing as much of your mouth as possible. This will also numb the area, which is helpful because tongue burns can be very painful. [1] X Research source"
    },
    {
      "title": "Rinse your mouth out with salt water.",
      "content": "Rinse your mouth out with salt water. After you've cooled off your mouth, you'll want to disinfect your burn. Your mouth is full of bacteria, and burns can get infected if not treated properly. A salt water solution will help disinfect the area and keep it free of infection. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Mix 1/2 teaspoon of salt into a glass of warm water. Stir so the salt dissolves. Rinse and gargle with the mixture. Be sure not to swallow any of the salt water."
    },
    {
      "title": "Continue rinsing your mouth with salt water daily.",
      "content": "Continue rinsing your mouth with salt water daily. You'll still want to keep your burn clean while it heals. You should continue rinsing your mouth once or twice daily until the burn heals. [3] X Research source"
    },
    {
      "title": "Keep blisters intact.",
      "content": "Keep blisters intact. If you've suffered a more severe burn, blisters can form and you can experience a lot of pain. If blisters form on your tongue, don't pop or drain them. They may pop on their own, but your shouldn't do this purposely. Blisters protect new cells as they form and keep bacteria out of wounds. Popping them can slow the healing process and could lead to an infection. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Drink plenty of water.",
      "content": "Drink plenty of water. This will help keep the area moisturized, which will help with pain. It also aids in the healing process by balancing your mouth's pH and preventing acids from damaging new cells. Additionally, blisters can pop more easily when they are dry."
    },
    {
      "title": "Eat ice cream, frozen yogurt, ice pops, and other cold, soft foods.",
      "content": "Eat ice cream, frozen yogurt, ice pops, and other cold, soft foods. While you may lose some of your sense of taste as your burn heals, these treats will definitely make your healing process more enjoyable. Not only are they easy to eat, but the cold will keep your tongue numb and kill the pain. [5] X Research source Sprinkling a little sugar on your tongue may help with pain."
    },
    {
      "title": "Keep any cold foods or drinks in your mouth as long as you can.",
      "content": "Keep any cold foods or drinks in your mouth as long as you can. When you take a drink of cold water or a bite of ice cream, keep it over your burn blisters for as long as you can. This will numb the area and fight the pain."
    },
    {
      "title": "Drink a milk and honey solution.",
      "content": "Drink a milk and honey solution. This mixture is both soothing and helps increase circulation to the mouth. Increased circulation brings nutrients to the wound, which will help it heal faster and more efficiently. [6] X Research source Alternatively, you could just apply a dab of honey to the blisters. This will soothe the wound and stimulate circulation. Honey also has natural anti-bacterial properties that can help prevent infection. Do not give honey to infants under 1. It may cause infant botulism, a serious condition."
    },
    {
      "title": "Apply an oral anesthetic to blisters and painful spots.",
      "content": "Apply an oral anesthetic to blisters and painful spots. If ice cream and cold drinks don't treat the pain well enough, you can use an oral anesthetic. Brands like Orajel and Anbesol are readily available at pharmacies and supermarkets. These will help keep the area numb while it heals. Be sure to use these products as labels or pharmacists direct you to. [7] X Research source"
    },
    {
      "title": "Take a pain reliever if you are uncomfortable.",
      "content": "Take a pain reliever if you are uncomfortable. If the pain from the burn is causing discomfort, you can treat it with a pain reliever like acetaminophen. [8] X Research source"
    },
    {
      "title": "Brush your teeth carefully.",
      "content": "Brush your teeth carefully. The motion of brushing and the chemicals in toothpaste can be both painful and damaging to your burn. You'll have to take care when brushing to avoid popping blisters and hampering the healing process. [9] X Research source Don't brush your tongue. You will damage newly-formed cells and slow the healing process. You can also pop blisters, which can lead to infections. Don't get toothpaste on burned areas. Toothpaste can irritate the burn and cause pain. Use mouthwash sparingly, if at all. Like toothpaste, mouthwash will irritate the burn. It is better to just rinse your mouth out with salt water while you wait for your burn to heal."
    },
    {
      "title": "Visit the doctor if you see no improvement or the pain is too much to handle.",
      "content": "Visit the doctor if you see no improvement or the pain is too much to handle. The cells in your mouth regenerate quickly, so most burns on the tongue clear up in 2 or 3 days. If your burn was more severe, however, it can take longer for your mouth to heal. If it has been more than 3-4 days and you see no improvement, see your doctor to make sure you don't have an infection. You should also see your doctor at any point if the pain is more than you can handle, or if the burn seems large or deep, or if the burn makes it difficult to breathe or swallow. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Avoid hot food and drinks while your mouth is healing.",
      "content": "Avoid hot food and drinks while your mouth is healing. You can still have your coffee and tea, but just make sure you allow it to cool fully before drinking. You might even want to consider switching to iced varieties for a few days. The new cells in your mouth will be very sensitive- if you expose them to hot food before the burn is fully healed, they can easily burn again. Also it will be very painful. [11] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Blow on food and drinks to cool them off faster. For drinks, you should consider adding an ice cube to ensure they are a safe temperature. Test everything before putting it in your mouth. Touch it with just the tip of your tongue to make sure it is a safe temperature."
    },
    {
      "title": "Avoid crunchy food.",
      "content": "Avoid crunchy food. Foods like crackers, chips, and crunchy bread should be off the menu until your burn heals. These can scratch against your burn, which will be very painful. They can also pop blisters, which will slow the healing process and put you at increased risk of an infection. [12] X Research source"
    },
    {
      "title": "Abstain from spices.",
      "content": "Abstain from spices. Spicy food will cause a lot of pain for your healing mouth. The irritation from spices can also slow the healing process. If you're a fan of spicy food, it would be best to abstain for a few days while your burn heals. Also avoid adding any spices like pepper to your food. [13] X Research source"
    },
    {
      "title": "Stop eating acidic food.",
      "content": "Stop eating acidic food. These are mostly citrus-fruits like lemons, oranges, and pineapples. Citric acid will hurt and slow the healing process. Wait at least 3 days before bringing these foods back into your diet. [14] X Research source"
    }
  ]
}