{
  "url": "https://www.wikihow.com/Tell-if-Running-Shoes-Are-Worn-Out",
  "title": "Are My Running Shoes Worn Out? 11 Ways to Tell",
  "steps": [
    {
      "title": "Comfort and support start going downhill at the 300-mile mark.",
      "content": "Comfort and support start going downhill at the 300-mile mark. After logging a few hundred miles, the mid-sole of your shoes—the cushioned part that absorbs shock—begins to break down. Poor shock absorption can cause joint pain and injury, so it's important to replace your shoes around this time. [1] X Research source If you run 10 mi (16 km) per week, it'll take you about 8 months to hit 300 mi (480 km). If you run 20 mi (32 km) (or more) per week, replace your shoes every 4-6 months. The soles of your shoes may look fine, but mid-sole damage isn’t always visible to the naked eye."
    },
    {
      "title": "Experts say shoe quality begins to degrade after 12 months.",
      "content": "Experts say shoe quality begins to degrade after 12 months. Even if you haven’t hit the 300-500 mile mark yet, the materials will start to dry out and the foam cushioning will lose its springiness. Shoes with worn out foam cushioning won't absorb shock well, so try to invest in a new pair as soon as you can. [2] X Research source If your shoes have hit their limit, you don't have to get rid of them! Feel free to wear them to run errands or do yard work. Just avoid wearing them for running so you don’t hurt yourself."
    },
    {
      "title": "Worn tread can cause you to lose your footing.",
      "content": "Worn tread can cause you to lose your footing. The bottom tread is the most rugged part of running shoes, so if yours looks worn smooth, it’s time to retire your shoes. Good tread grips the ground and absorbs shock, so it’s crucial to your performance and safety as a runner. [3] X Research source If you’re experiencing sore or tight feet for the first time as a runner, worn out tread is likely the issue. When you're buying new running shoes, consider your specific needs. For example, if you run cross-country on tough terrain, quality tread is crucial. If you struggle with knee or hip pain, go with well-cushioned shoes that absorb shock better. [4] X Research source"
    },
    {
      "title": "Shoes with uneven wear won't provide enough stability.",
      "content": "Shoes with uneven wear won't provide enough stability. Place your shoes on a table and get down at eye-level to inspect them. If they lean over to the side instead of standing up straight, the soles are worn down unevenly. Uneven soles force your muscles to work harder to compensate, which can lead to muscle strain. [5] X Research source"
    },
    {
      "title": "If your heels are sliding around in your shoes, the interiors are shot.",
      "content": "If your heels are sliding around in your shoes, the interiors are shot. When your shoes were new, your feet felt snug and comfy inside them. Lately, though? Your heels are sliding back and forth and your balance is off. Take a peek at the inside—does the heel area look tattered or torn? If so, it's time for new running shoes. [6] X Research source"
    },
    {
      "title": "Visible damage is more than an aesthetic issue—it affects performance.",
      "content": "Visible damage is more than an aesthetic issue—it affects performance. If you’re the no-frills type, replacing running shoes because they don’t look perfect on the outside may sound ridiculous. Running shoes are made of super durable materials, though! If the exterior looks rough, there’s probably more damage than meets the eye. [7] X Research source For example, if exterior stitches are fraying, the shoes will feel loose and provide less support than they used to. It’s a good idea to start checking your shoes for visible wear at the 6-month mark (especially if you wear them for activities other than running)."
    },
    {
      "title": "Mid-sole compression will take the spring out of your step.",
      "content": "Mid-sole compression will take the spring out of your step. If you don't feel that familiar little bounce when your feet strike the ground, the cushioning in your shoes is compressed or worn out. Mid-sole cushioning is crucial because it absorbs shock and protects your joints. Without it, you're more susceptible to injury. [8] X Research source Mid-sole compression isn’t always visible on the outside. That said, if the shoe cushioning looks visibly creased, it’s definitely time for a new pair."
    },
    {
      "title": "Post-run muscle fatigue, shin splints, and joint pain are all red flags.",
      "content": "Post-run muscle fatigue, shin splints, and joint pain are all red flags. Some soreness is to be expected, especially after an intense or long-distance run! But if you feel unusually sore after jogging your normal route and you’ve had your current pair of running shoes for a while, worn out cushioning is probably to blame for your aches and pains. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This is especially true if the pain is sudden and you can feel it on both sides of your body (for example, both knees hurt instead of just one of them). To test the theory, switch to another pair of sneakers and hit the trail. If you don't feel the same aches and pains, your shoes were causing the problem."
    },
    {
      "title": "Running shoes in good condition have no problem gripping terrain.",
      "content": "Running shoes in good condition have no problem gripping terrain. Shoes with good grip should keep you mostly upright, even when you’re running in the rain or on gravel. If you’re suddenly sliding or losing your balance on a muddy trail, the tread on your shoes is probably worn down. [10] X Research source If you’re slipping on flat or dry surfaces, the tread is definitely shot."
    },
    {
      "title": "An occasional blister is normal, but constant blisters are a problem.",
      "content": "An occasional blister is normal, but constant blisters are a problem. Blisters happen when the shoe rubs repeatedly against your skin. Running shoes in good condition should hug your feet and feel snug to prevent that from happening. If you've recently started getting blisters, it's probably because your shoes are worn out and not fitting as well as they used to. [11] X Research source"
    },
    {
      "title": "Proper cleaning and storage can help your shoes last longer.",
      "content": "Proper cleaning and storage can help your shoes last longer. It's tempting to toss your running shoes into the washing machine, but submerging them in water and putting them through a spin cycle can warp them. Instead, use a damp rag to spot clean them when they get dirty. [12] X Research source You can also: Untie them instead of kicking them off Air-dry them when they get wet (avoid the dryer) Wear them for running only Rotate between 2 pairs of running shoes [13] X Research source"
    }
  ]
}