{
  "url": "https://www.wikihow.com/Tie-a-Carolina-Rig",
  "title": "How to Tie a Carolina Rig",
  "steps": [
    {
      "title": "Pick a bullet weight that’s about 3/4 oz.",
      "content": "Pick a bullet weight that’s about 3/4 oz. The weight’s main purpose is to drive the line deeper into the water to reach more fish. [1] X Research source Simply slide the weight onto your main line using the hole in the center. If you’re fishing in shallow water, go for a 1/2 oz bullet weight . If you prefer using egg style sinkers, use that instead! The Carolina rig is versatile, so you can modify it to your liking."
    },
    {
      "title": "Slide the bead onto the line after the bullet weight.",
      "content": "Slide the bead onto the line after the bullet weight. The bead serves 2 main purposes: it knocks against the weight to make a noise that attracts fish, and it also protects the knot tied onto the swivel. Simply slide the line through the hole in the center of the bead. [2] X Research source The material and color of the bead are up to you!"
    },
    {
      "title": "The function of any swivel is to keep the line from twisting.",
      "content": "The function of any swivel is to keep the line from twisting. Pick a swivel and then tie a palomar knot to keep the swivel in place, then clip off any excess line after your knot is done. [3] X Research source Swivels are another piece of your rig that you can choose based on personal preference. An 80 pound brown swivel is usually a good universal choice."
    },
    {
      "title": "The leader line is what connects the hook to the swivel.",
      "content": "The leader line is what connects the hook to the swivel. For a Carolina rig, cut a line that’s between 12 and 48 in (30 and 122 cm) long, depending on where the fish are in the water. Use a palomar knot to tie the leader line onto the empty end of the swivel. [4] X Research source To get the length of your leader line, simply figure out how far the fish are from the bottom of the water. If they’re 12 in (30 cm) from the bottom, for instance, cut a 12 in (30 cm) long leader line."
    },
    {
      "title": "Use a palomar knot to attach your hook on the end of the line.",
      "content": "Use a palomar knot to attach your hook on the end of the line. Pick an off-set worm hook that complements the size of your bait. [5] X Research source Tie the hook tightly to keep it in place, and snip off any excess line. For soft plastic baits, use a 3/0 EWG Worm Hook or Round Bend Worm Hooks . For live worms, use a 1/0 Round Bend hook ."
    },
    {
      "title": "Choose a soft, plastic bait to complement the Carolina rig.",
      "content": "Choose a soft, plastic bait to complement the Carolina rig. Soft plastic bait works best when dragging along the ground under the water. Use your hook to attach the bait to your line, and get ready to fish! [6] X Research source"
    },
    {
      "title": "Entice fish by dragging the bait along the bottom of the water.",
      "content": "Entice fish by dragging the bait along the bottom of the water. Carolina rigs are perfect for attracting a lot of dispersed fish in a big area. Move your pole slowly back and forth across the water, dragging your bait along the ground. Keep most of the slack out of your line so you can feel when fish bite! [7] X Research source"
    }
  ]
}