{
  "url": "https://www.wikihow.com/Tell-if-Someone-Is-a-Poser",
  "title": "How to Tell if Someone Is a Poser",
  "steps": [
    {
      "title": "A poseur will use any chance to show off the thing they’re “obsessed” with.",
      "content": "A poseur will use any chance to show off the thing they’re “obsessed” with. Look for stickers, apparel, and other items that relate to what they claim to love. For instance, posers within the car scene will cover their cars in stickers as a cry for attention. [1] X Research source If that backpack or t-shirt from a popular comic book is brand new, but the wearer claims to have been a fan forever, you might have a poseur on your hands."
    },
    {
      "title": "Poseurs will try hard to show they're part of a community.",
      "content": "Poseurs will try hard to show they're part of a community. Beyond simply looking at the things they own, look for specific company names that relate to the poseur’s claimed obsession. This is especially true of poseurs within communities such as skateboarding and surfing. [2] X Research source There’s a delicate balance between wearing brands you like and wearing them for attention. A poser is likely to have brand names on everything they own."
    },
    {
      "title": "Poseurs are more likely to jump on a bandwagon than try and be themselves.",
      "content": "Poseurs are more likely to jump on a bandwagon than try and be themselves. Check what they claim to be obsessed about, whether it’s a band, a TV show or just a specific kind of identity. Ask yourself if this is a popular trend, especially if it’s a new trend. A perfect example of this is the “geek” phenomenon. If you go back a couple of decades, it wasn’t at all cool to be a geek; it meant you were obsessed with a particular hobby or facet of pop culture. Geekdom is now more mainstream, and some posers will claim they’re geeks just to fit in. [3] X Research source"
    },
    {
      "title": "Poseurs love to talk about the things they love more than do them.",
      "content": "Poseurs love to talk about the things they love more than do them. In contrast, someone who’s truly passionate about a hobby, a skill or a specific community usually lets their passion do the talking. Someone who’s thoroughly passionate about something will talk about it at length if asked, whereas a poser will shove it in just about anyone’s face. [4] X Research source"
    },
    {
      "title": "Compare a poser's behavior to other people's.",
      "content": "Compare a poser's behavior to other people's. Depending on your area of passion, there are a few specific behaviors that will make a poseur stand out. It might take some time to actually pick out these behaviors, so pay close attention to suspected poseurs. For example, a poseur pretending to be a surfer may have a really nice board, but won’t properly wax or take care of it. [5] X Research source Not properly handling the tools of the trade is a classic sign of a poser."
    },
    {
      "title": "Ask a poser about the topic they claim to be passionate about.",
      "content": "Ask a poser about the topic they claim to be passionate about. While the best way to deal with a poser is to simply ignore them, there might be situations where you decide to confront them. If you want to be sure they’re a poseur, simply test them on what they claim to know so much about. Poseurs are so focused on the way they come across to people that they don’t usually know what they’re talking about. They’ll repeat things that are common knowledge, but dig a bit deeper and you should be able to expose them. For instance, some poseurs might act like they’re really into cars. If you want to test them, just get them to pop the hood and tell you about what their car’s got. If they stumble, or try to get out of it, you might have found a poser. [6] X Research source"
    },
    {
      "title": "A really dedicated poseur can easily purchase fans, views, and followers.",
      "content": "A really dedicated poseur can easily purchase fans, views, and followers. This will artificially inflate their social media accounts, making it seem like they have a large following. To get to the bottom of this, look at the relationship between your suspected poseur and their fans. You can also check the profiles of their followers; if the profiles are empty, they’re likely not real followers. Social media is essentially a more complicated, high tech conversation. If there are no comments or likes on the suspected poseur’s posts, it’s a one way conversation and you might be dealing with a poseur. [7] X Research source"
    },
    {
      "title": "Buying followers means poseurs don’t have to worry about putting out quality posts.",
      "content": "Buying followers means poseurs don’t have to worry about putting out quality posts. Even without a following, poseurs will focus on posts that can bring the most attention, rather than putting out something important and creative. People who are truly passionate about their hobby or interest will release content that helps to educate others or celebrates their passion. [8] X Research source Poseurs treat it like a science; they’re just after the views."
    },
    {
      "title": "The scheduling of a person’s posts can tell you about how they treat their social media accounts.",
      "content": "The scheduling of a person’s posts can tell you about how they treat their social media accounts. A poseur might try and use their social media accounts like a brand or company: minimizing effort and maximizing their following. Someone who’s truly passionate is more likely to post as the mood strikes them; maybe they come across something particularly funny or important they really want to share. If the suspected poseur runs their social media on a tight schedule, your suspicions likely have some truth to them. [9] X Research source"
    }
  ]
}