{
  "url": "https://www.wikihow.com/Wear-a-Monocle",
  "title": "How to Put on a Monocle So It Stays on Your Face",
  "steps": [
    {
      "title": "Raise your eyebrows.",
      "content": "Raise your eyebrows. Make a surprised face and lift your eyebrows as high as you can so your monocle fits more comfortably on your face. Keep holding the expression the entire time you’re putting on your monocle. [1] X Research source Practice putting your monocle on in front of a mirror the first few times so you can easily see what you’re doing."
    },
    {
      "title": "Fit the monocle between your brow and your cheekbone.",
      "content": "Fit the monocle between your brow and your cheekbone. Hold the monocle by one of the galleries, which are the extended rims on the top and bottom of the lens. Set the bottom gallery on your skin just above your cheekbone. Push the top gallery back so it sits underneath your brow. [2] X Research source If your eyelashes brush up against your monocle, reposition it so you aren’t touching the lens. Position the monocle closer to your nose to help it stay in place easier."
    },
    {
      "title": "Relax your eyebrows to secure the monocle.",
      "content": "Relax your eyebrows to secure the monocle. Let your eyebrows drop back down so they can pinch the top of the monocle. Try slowly moving your head around to see if the monocle stays in position or if it falls away from your eye. Just reposition it until it sits comfortably without falling out. [3] X Research source If your monocle extends past the bottom of your eyebrow or makes you see the pinks of your eyes, then your monocle is too large. If you’re actively squinting to keep your monocle in place or if it keeps falling out, then it’s too small for you."
    },
    {
      "title": "The top and bottom galleries hold the monocle in place.",
      "content": "The top and bottom galleries hold the monocle in place. The natural tension of your skin holds onto the extended rims on each of the galleries. As long as your monocle is the proper size and fits properly between your cheek and brow, then it’ll stay secure as long as you don’t raise your eyebrows. [4] X Research source Most monocles come on a chain or string that you can clip onto your shirt or jacket so they don’t fall to the floor if you accidentally drop them."
    },
    {
      "title": "Wear your monocle whenever you’d normally use reading glasses.",
      "content": "Wear your monocle whenever you’d normally use reading glasses. If you want something a little more portable and quicker to put on than reading glasses, just keep a monocle with you. You can easily slip the lens into a pocket to use wherever you go. Monocle lenses magnify what you’re looking at so just put one on when you need a little help reading small print or getting a better look at something. [5] X Research source"
    },
    {
      "title": "Pair your monocle with a classy outfit when you’re dressing up.",
      "content": "Pair your monocle with a classy outfit when you’re dressing up. Even though the Monopoly Man doesn’t wear one, a monocle is a symbol of class and wealth. Wear a suit and accessorize with a monocle for a ritzy, old-fashioned style. [6] X Research source If you want an exaggerated classy look, wear a top hat and bow tie to complete your look."
    },
    {
      "title": "Accessorize a steampunk outfit with a monocle.",
      "content": "Accessorize a steampunk outfit with a monocle. Steampunk is a style based on the Victorian era with some sci-fi mechanical flair. Start making a steampunk costume with old clothes, like Victorian dresses , corsets , and tweed vests . Complete your look with a monocle, top hat, bowtie, and other steampunk costume accessories . [7] X Research source"
    }
  ]
}