{
  "url": "https://www.wikihow.com/Sigils-for-Protection",
  "title": "How to Create Sigils for Protection and Use Them in Spellwork",
  "steps": [
    {
      "title": "Write your intentions as a sentence, then remove the repeated letters.",
      "content": "Write your intentions as a sentence, then remove the repeated letters. Write your intentions as a single sentence or word in the present tense. [1] X Research source Then, concentrate the message by taking out all of the repeated letters and vowels. If you used the word “protection,” for example, you’d end up with “p r t c n.” Avoid negative language like “I can’t” or “I won’t.” Originally, intentions for sigil magic started with the words “I wish,” but current practitioners often write their sentences as if they’re currently happening. Some examples of intentions are: “I am safe on this trip,” or “I am protected in this house”—“m s f n t h r p,” “m p r t c d n h s.”"
    },
    {
      "title": "Arrange the letters into a stylized image to make a word sigil.",
      "content": "Arrange the letters into a stylized image to make a word sigil. Sigils work with your unconscious mind, which operates in symbols, not words. Take the letters you have left over and play with them to make a shape or image that speaks to you. [2] X Research source Add extra embellishments, if you so choose, to make it more stylized. You could overlap the letters, connect them with extra lines, or draw them radially around a point."
    },
    {
      "title": "Draw the alphabet around the circumference of a circle for magic circle sigils.",
      "content": "Draw the alphabet around the circumference of a circle for magic circle sigils. To make a magic circle, first draw a circle, then write letters of the alphabet along the inside of the circumference. Put a dot by the first and last letter of your intention, then trace from the first letter to the second, to the third, etc., until you reach the end. [3] X Research source The resulting shape is your sigil."
    },
    {
      "title": "Use existing protection sigils.",
      "content": "Use existing protection sigils. Some protection sigils have been used since ancient times, like the Aegishjalmur, an Icelandic protection symbol for warriors; the Triple Moon Goddess, a Neopagan protection symbol; or the Knot of Isis, an Egyptian protection symbol for fertility. [4] X Research source If any of these resonate with you, consider using one as your sigil. Other symbols are the pentagram, the unicursal hexagram, the Eye of Horus, the cross, the ankh, and the Celtic knot. [5] X Research source"
    },
    {
      "title": "Make your own sigil out of images that symbolize protection to you.",
      "content": "Make your own sigil out of images that symbolize protection to you. To make your own pictorial sigil, start by choosing something you associate with protection, like a shield, turtle shell, or antlers. [6] X Research source Then, draw it as simplistically as you can. For example, a shield could be represented as a pentagon."
    },
    {
      "title": "Add word sigils to your protection symbols.",
      "content": "Add word sigils to your protection symbols. You can also combine the two kinds of sigils to imbue the symbols with your intentions. You could incorporate a pictorial symbol into the letter symbol, or you could just put the word sigil inside of a shape or image. A simple hybrid sigil would be a word sigil with a circle drawn around it, to represent a protective border, like a wall or fence."
    },
    {
      "title": "Concentrate on your sigil until your eyes unfocus.",
      "content": "Concentrate on your sigil until your eyes unfocus. To embed your sigil in your unconscious, clear your mind , then stare at your sigil. Try to not think of anything except your intentions as you meditate on it. Once your eyes start to unfocus and take in the entirety of the sigil, you can stop. [7] X Research source It can be difficult for some people’s vision to reach that dream-like state. If it’s not happening for you, don’t worry. Just concentrate on the sigil until you feel it’s been burned into your mind."
    },
    {
      "title": "Leave your sigil out of sight until you no longer feel connected with it.",
      "content": "Leave your sigil out of sight until you no longer feel connected with it. Now that the sigil has been transferred into your unconscious, disconnect from the physical version of it. Put your drawing in a folder or drawer, and come back to it once you’ve moved on from it. ”Moving on” is very subjective, so wait until you don’t regularly think about the sigil or the process of making it. It could take a few days or a few weeks."
    },
    {
      "title": "Charge your sigil with sexual, spiritual, or emotional energy.",
      "content": "Charge your sigil with sexual, spiritual, or emotional energy. Once you’ve fully disconnected from the physical symbol, start concentrating on your sigil during periods of high energy or emotion. You can place crystals on the image, focus on it during an orgasm, or bring it to mind when you’re especially angry, afraid, or joyful. [8] X Research source Other ways to charge your sigil are to meditate on it, play music while thinking of it (either on speakers or with instruments), or look at it while chanting your intention."
    },
    {
      "title": "Burn, rip up, or erase your sigil.",
      "content": "Burn, rip up, or erase your sigil. In theory, the way sigil magic works is by creating an image of your desire and then replacing the image with the real thing. To release the energy you built into the sigil, ritualistically destroy it. You could burn it, rip it into pieces, erase it (if you drew it in pencil), or throw it into running water. [9] X Research source If you’re throwing the paper into nature, make sure it’s unbleached, acid-free, and not glossy. You can also carve the sigil into an ice cube and let it melt, or dress a candle with it and let it burn down entirely. The ritual can be anything you want it to be, as long as you know it’s releasing the energy. Practicing magic is far less about what you do than it is about how you do it. If you are confident that what you're doing is magic—it’s magic."
    },
    {
      "title": "Let the sigil fade slowly by drawing it on yourself or the soles of your shoes.",
      "content": "Let the sigil fade slowly by drawing it on yourself or the soles of your shoes. You can keep imbuing your sigil with energy as it slowly fades away by drawing it somewhere semi-permanent. [10] X Research source Incorporate It into a makeup look, draw it on the bottoms of your shoes, or carve it into a bar of soap."
    },
    {
      "title": "Add permanent sigils to art, clothing, or magical items.",
      "content": "Add permanent sigils to art, clothing, or magical items. If you feel your sigil doesn’t need to be destroyed to work, put it somewhere permanent. You could burn it into wooden cooking utensils, stitch it into clothing, paint it on your altar, or incorporate it into a piece of artwork. [11] X Research source For permanent sigils, put them in something you see regularly. One way to be constantly reminded of your sigil is to make it your phone lock screen . If you feel really connected to it, you could even get your sigil as a tattoo."
    },
    {
      "title": "Forget and release non-permanent sigils.",
      "content": "Forget and release non-permanent sigils. Once your ritual is over, let nature take its course. Try not to think about your intentions, or really the sigil at all. While sigils are not replacements for action (if your intention is to get really strong, for example, you have to physically exert yourself) they are meant to be released to work. [12] X Research source"
    }
  ]
}