{
  "url": "https://www.wikihow.com/Wear-High-Waisted-Jeans",
  "title": "How to Wear High Waisted Jeans",
  "steps": [
    {
      "title": "Go for skinny jeans with a 29 inch (73 cm) inseam if you are petite.",
      "content": "Go for skinny jeans with a 29 inch (73 cm) inseam if you are petite. If you are petite, you will have shorter legs or a shorter torso. Try high-waisted jeans that have a 29 inch inseam or lower, as they will elongate your legs. The inseam is the length of the jeans along the inside of your thighs. [1] X Research source Try skinny high-waisted jeans if you are petite, as they will make your legs look longer and slimmer. Do not go for flared high-waisted pants, as they will swallow up your petite frame."
    },
    {
      "title": "Try boyfriend style jeans with a wide waistband if you are pear shaped.",
      "content": "Try boyfriend style jeans with a wide waistband if you are pear shaped. Pear shaped means you carry weight in your hips, thighs, and bottom. High-waisted jeans with a wide waistband will give you full coverage from in front and behind. Look for high-waisted jeans that are boyfriend cut or bootcut denim to balance out your proportions. [2] X Research source Avoid high-waisted jeans with no give in the waist, as this will squeeze your stomach and you will feel uncomfortable wearing them."
    },
    {
      "title": "Go for flare style jeans if you have an athletic build.",
      "content": "Go for flare style jeans if you have an athletic build. An athletic build will be straight up and down. You can create curves by wearing flare style high-waisted jeans. Look for wide cut or full flare cut jeans that curve outward at the knee. [3] X Research source If high-waisted jeans tend to flatten your butt, look for flare pants that have pockets that sit higher up on your butt to help add shape to this area."
    },
    {
      "title": "Get jeans with a 35 inches (88 cm) or higher inseam if you are tall.",
      "content": "Get jeans with a 35 inches (88 cm) or higher inseam if you are tall. If you are above 5 feet 10 inches (1.5 metres 25 cm), you may struggle to find high-waisted jeans that fit your height. Look for high-waisted jeans that have a long inseam so they fit correctly. [4] X Research source You can try high-waisted jeans that are wide-leg, skinny, or boyfriend cut as long as they have a 35 inches (88 cm) or higher inseam."
    },
    {
      "title": "Hem the jeans to your height.",
      "content": "Hem the jeans to your height. To ensure the jeans fit your body, consider getting them hemmed to fit your height. Hem the bottom of straight or flared high-waisted jeans to just at the top of your toes. For skinny high-waisted jeans, get them hemmed just at the ankles. [5] X Research source Do not hem skinny high-waisted jeans any higher than your ankles, as this will cause them to bunch up at your legs and make you look shorter."
    },
    {
      "title": "Get dark wash for versatility.",
      "content": "Get dark wash for versatility. Dark wash jeans are a good option if you want a pair that will go from day to night easily. You can wear dark wash jeans to work and then transition them easily to a night out. Dark wash jeans will appear dark blue or almost black. [6] X Research source"
    },
    {
      "title": "Try light denim for a spring or summer look.",
      "content": "Try light denim for a spring or summer look. Light colored denim is a fun option for a spring or summer day. Light wash jeans will appear pale blue or classic true blue. Light wash jeans pair well with spring and summer tops. You can also pair light wash denim with sweaters for fall or winter."
    },
    {
      "title": "Do black high-waisted jeans for a night out.",
      "content": "Do black high-waisted jeans for a night out. Black jeans are always a solid option for a night out on the town. Get high-waisted black jeans for a night out dancing or for a dinner date. You can also pull out black high-waisted jeans for days when you want to put minimal effort into your look but still want to feel put together."
    },
    {
      "title": "Go for jeans made with spandex for stretch.",
      "content": "Go for jeans made with spandex for stretch. Some jeans will be 100% cotton and others will be a blend of cotton and other materials like spandex. Jeans that are only made of cotton may look great, but they have very little to no stretch. This means you may find it painful to sit down for a long period of time in the high-waisted jeans. Getting jeans with spandex will ensure they have some give when you sit down and move around. [7] X Research source Read the label of the jeans to check that it is partly made of spandex. Some high-waisted jeans that have a stretch waistband will already contain spandex."
    },
    {
      "title": "Tuck in your top.",
      "content": "Tuck in your top. Don’t hide the great high waist of your jeans. Tuck in a t-shirt or a blouse into the waistband of the jeans and get an instant outfit. Show off the front and back of the jeans by tucking in your top. You can also tie your top so it sits just above the waistband of your jeans. Loop the two sides of a long t-shirt or a button up shirt together and tie them in a knot right above the top button of your jeans."
    },
    {
      "title": "Wear crop tops.",
      "content": "Wear crop tops. Crop tops are a great pair with high-waisted jeans as they allow you to show off the top portion of the jeans. Go for crop tops that hit just above your hips. Try cropped t-shirts and blouses. You can also wear cropped sweaters with high-waisted jeans. Wear short sleeve or long sleeve cropped sweaters."
    },
    {
      "title": "Pair skinny high-waisted jeans with a blazer.",
      "content": "Pair skinny high-waisted jeans with a blazer. For a business casual look, wear skinny high-waisted jeans with a tucked in blouse and a fitted blazer. Try wearing a colorful blouse with a blazer in a neutral color like black, dark blue, or beige. You can also wear a tucked in t-shirt or cropped shirt with a longer jacket and high-waisted jeans for a more casual look."
    },
    {
      "title": "Belt the high-waisted jeans.",
      "content": "Belt the high-waisted jeans. Some high-waisted jeans will come with a denim sash that acts like a belt. If the jeans have belt loops, be sure to throw on a fun belt for added style. Look for belts in a neutral material like brown or black leather. Try a skinny belt for a more sleek look or a wider belt for a more statement look. You can also try belts in bold colors, like a red or green leather belt. Colored belts tend to look good on dark wash or black high-waisted jeans."
    },
    {
      "title": "Wear high heels or low boots with the jeans.",
      "content": "Wear high heels or low boots with the jeans. High-waisted jeans that are skinny or flared look great with high heels as the height will elongate your legs. Try patterned heels for a fun look or heels in a neutral color to offset jeans in a dark wash. You can also wear bootcut or boyfriend style high-waisted jeans with low boots with a slight heel. Low boots are a good way to appear put together without dealing with heels."
    },
    {
      "title": "Try sandals or wedges.",
      "content": "Try sandals or wedges. You can also pair skinny high-waisted jeans with sandals that are flat or have a slight heel. Try sandals made of leather for a more casual summer look, or sandals with a heel for a night out. Flared high-waisted jeans look best with wedges or heeled sandals, as the height will help to elongate your legs at the widest point of the flare."
    },
    {
      "title": "Go for flats for a casual look.",
      "content": "Go for flats for a casual look. Basic flats are a good option for a casual day look. Pair fabric or leather flats with the high-waisted jeans. Try patterned flats in a fun color with dark wash high-waisted jeans or black high-waisted jeans."
    },
    {
      "title": "Avoid wearing sneakers with high-waisted jeans.",
      "content": "Avoid wearing sneakers with high-waisted jeans. Sneakers or athletic shoes tend to look too casual with high-waisted jeans, especially if they are flared. Avoid them and opt for nice sandals or low boots instead. You may be able to pull off sneakers with skinny high-waisted jeans that are a light wash for a spring day out. Just make sure the sneakers elongate your legs and your proportions are balanced."
    }
  ]
}