{
  "url": "https://www.wikihow.com/Summon-Queen-Slime",
  "title": "How to Summon and Defeat Queen Slime Boss in Terraria",
  "steps": [
    {
      "title": "Obtain a Gelatin Crystal.",
      "content": "Obtain a Gelatin Crystal. This can be found in the Underground Hallow, growing on Pearlstone or Pink Ice Blocks. The Gelatin Crystal will glow pink and then blue in a constant cycle. You will only be able to summon Queen Slime in hardmode in Terraria ."
    },
    {
      "title": "Go to the Hallow biome.",
      "content": "Go to the Hallow biome. Queen Slime can only be summoned in the Hallow. This can be at any time of the day."
    },
    {
      "title": "Use the Gelatin Crystal.",
      "content": "Use the Gelatin Crystal. If you're inside the Hallow, the Crystal will be consumed and Queen Slime will spawn immediately. If you move out of Queen Slime's sight, it will teleport to you. Because of this, you can move the battle to the surface or a different biome for more space to fight."
    },
    {
      "title": "Prepare your gear.",
      "content": "Prepare your gear. Before you summon Queen Slime, it's a good idea to prepare your gear so you can have a successful battle. This ultimately depends on which weapons, armor, and accessories you feel most comfortable using. However, it's recommended to use gear that can help you evade projectiles, such as Wings, and a ranged weapon to attack while maintaining distance. Keep in mind that if you're playing in Expert or Master modes in Multiplayer, the health of bosses will depend on the number of players."
    },
    {
      "title": "Build platforms in the sky.",
      "content": "Build platforms in the sky. Queen Slime can launch projectiles that can ricochet off physical blocks. If you're worried about dodging and attacking at the same time, build a few platforms in the sky, long enough for you to evade long-ranged attacks. The platforms will cause Queen Slime's projectiles to fall straight down rather than bounce around."
    },
    {
      "title": "Place down Heart Lanterns and campfires.",
      "content": "Place down Heart Lanterns and campfires. These provide health regeneration during your fight, which is useful if you don't want to use a lot of Healing Potions. [1] X Research source"
    },
    {
      "title": "Avoid Queen Slime's phase one attacks.",
      "content": "Avoid Queen Slime's phase one attacks. In Queen Slime's first phase (above 50% hp), it will jump towards the player and summon Crystal Slimes, Heavenly Slimes, and Bouncy Slimes. [2] X Research source Keep your distance and focus on Queen Slime unless the summoned slimes get close. In this case, kill the summoned slimes and then refocus on Queen Slime. Continuously move to avoid its attacks. When Queen Slime jumps, it will remain still for a few seconds and then attack in one of two ways: A quick jump towards the player to stomp them (passing through blocks) Fires 6 Regal Gel that bounce twice before breaking"
    },
    {
      "title": "Avoid Queen Slime's phase two attacks.",
      "content": "Avoid Queen Slime's phase two attacks. When Queen Slime is at 50% health, it will grow wings and begin to fly. It can pass through blocks, so try evading in a zig-zag motion while maintaining fire. Keep in mind that in phase two, Queen Slime will no longer teleport to players. Be sure to stay within the fighting area to finish it. Queen Slime's phase two attacks are as follows: Continues to summon Crystal Slimes, Heavenly Slimes, and Bouncy Slimes Rapidly fires Regal Gel in 10 directions Flies above the player and stomp them when in close proximity"
    },
    {
      "title": "Item drops.",
      "content": "Item drops. When the Queen Slime is defeated, it will drop rewards depending on Classic Hard mode or Expert/Master mode. Some items have a 100% drop-rate, while others have a lower drop-rate. Classic mode: Sparkle Slime Balloon: 100% Crystal Assassin Hood or Crystal Assassin Shirt or Crystal Assassin Pants: one will always be dropped, 33.33% after Blade Staff: 25% Gelatinous Pillion: 25% Hook of Dissonance: 33.33% Greater Healing Potion: 100% Queen Slime Mask: 14.29% Queen Slime Trophy: 10% Expert or Master mode: Greater Healing Potion: 100% Queen Slime Trophy: 10% Treasure Bag (Queen Slime): 100% Crystal Assassin Hood or Crystal Assassin Shirt or Crystal Assassin Pants: two will always be dropped, 67% after"
    },
    {
      "title": "Just Desserts Achievement.",
      "content": "Just Desserts Achievement. You'll obtain this achievement when you defeat the Queen Slime for the first time."
    }
  ]
}