{
  "url": "https://www.wikihow.com/Why-Does-My-Car-Smell-Like-Burning-Rubber",
  "title": "Burning Rubber Smell in Your Car? Causes & Solutions",
  "steps": [
    {
      "title": "If the odor is kind of sweet, you have a coolant leak.",
      "content": "If the odor is kind of sweet, you have a coolant leak. Coolant flows through your engine to absorb the heat produced by combustion and prevent your car from overheating. If there’s a leak in the coolant lines though, the radiator fluid may be burning off in the engine bay. Those fumes will come in through your air vents. Coolant usually smells sweet, so as it burns that rubbery smell will have hints of nuts, candy, and/or sugar. [1] X Research source Other Symptoms: You see puddles under your vehicle, the engine runs hot, and the coolant level in the reservoir The Fix: Your coolant lines need to be tested for leaks and patched. See a mechanic to have them take a look. The Cost: It depends on the location of the leak. Expect to spend anywhere from $150 to 1,000 on a coolant leak repair."
    },
    {
      "title": "If it smells like straight rubber, it’s probably a slipping serpentine belt.",
      "content": "If it smells like straight rubber, it’s probably a slipping serpentine belt. Your serpentine belt (also known as a timing belt) is a rubber band that wraps around a sequence of pulleys and gaskets on the side of your engine. If it slips when the engine is running, the friction can cause the rubber to overheat and burn. This will cause your engine to smell like rubber. [2] X Research source Other Symptoms: You experience nasty gear shifts, the engine kicks randomly, you hear squealing noises, and your AC doesn’t work the way it should. The Fix: When a serpentine belt begins to slip, it’s a big sign it’s time to replace it. If you’re a little handy, you can totally replace the belt yourself . The Cost: You’re probably going to pay $400-1,000 paying for someone to repair the belt. If you can install the belt yourself, you’ll only need to pay $20-60."
    },
    {
      "title": "If you see smoke, you probably have an engine oil leak.",
      "content": "If you see smoke, you probably have an engine oil leak. The oil helps keep all of the moving components in your engine lubricated so that they don’t overheat or break from the friction. If there’s a leak though, it will smell vaguely like rubber. Engine oil burns when your engine runs hot, so if you see white smoke slipping out the seams of your hood, it’s engine oil. [3] X Research source Other Symptoms: Your engine overheats, your check engine light comes on, the oil light comes on, and you see puddles under the engine bay. The Fix: The head gasket, oil lines, or engine have a leak somewhere. See a mechanic to have your engine and oil lines inspected and repaired. The Cost: Engine oil leak repairs can range from $200 to $2,000 depending on what needs to be repaired."
    },
    {
      "title": "If it smells acrid and plastic, it’s probably an electrical issue.",
      "content": "If it smells acrid and plastic, it’s probably an electrical issue. Insulated wires, rubber hoses, and fuses may all smell vaguely like rubber if they begin to overheat. Your vehicle has all kinds of electrical systems and connections. If any of them fray, come loose and touch a hot engine component, or outright fail, you could be smelling an overheating electrical component. [4] X Research source Other Symptoms: Your dashboard or headlights seem to randomly surge or lose power, your car stalls out or fails, or your vehicle seems to not get enough power. The Fix: Diagnosing and fixing an electrical issue can be tricky, so see a mechanic to have them repair your car. The Cost: It really depends on what specific electrical failure you have. If it’s something as minor as a bad fuse, it shouldn’t cost more than $100. If you need to replace an entire electrical system, it might run up to $1,500."
    },
    {
      "title": "If you hear screeching, your tires are burning as you accelerate.",
      "content": "If you hear screeching, your tires are burning as you accelerate. If you’re putting the pedal to the metal, burning out, or doing donuts, that burning smell is your tires. This is a sign you’re doing damage to your tires so cool off on the crazy driving, Evel Knievel. [5] X Research source Other Symptoms: Your car seems perfectly fine when you aren’t driving like a speed demon. The Fix: Check your tire tread to confirm that your tires are safe. If they are, the fix is to just stop driving recklessly. If the tires are worn down, replace them . The Cost: A new set of tires will run $300-600 depending on the wheel set you choose."
    },
    {
      "title": "If your AC is also making noise, it’s a bad AC compressor.",
      "content": "If your AC is also making noise, it’s a bad AC compressor. If you only smell the rubber aroma when you turn on the air conditioning and your AC system seems to be making noise, it’s probably a sign your AC compressor (or clutch) is bad. The compressor and clutch work together to engage the refrigerant and distribute it. If they fail or begin to die, the belt inside the compressor will burn as it struggles to pump out the refrigerant. This will cause a rattling or screeching noise when you turn the AC on [6] X Research source Other Symptoms: Your AC isn’t blowing cold ai and the rubber smell goes away when the AC is off. The Fix: The compressor and clutch need to be replaced, so see a qualified mechanic. The Cost: Expect to spend $600-1,200."
    },
    {
      "title": "If you drive a manual, your clutch plate is probably worn down.",
      "content": "If you drive a manual, your clutch plate is probably worn down. If you happen to drive a car with a manual transmission, a rubber aroma may be a sign your clutch plate needs to be replaced. The clutch plate creates friction on the flywheel and pressure plate to make gear changing possible, but if it’s worn down the extra friction can produce enough heat to generate a burning rubber aroma. [7] X Research source Other Symptoms: You have trouble engaging the transmission, the clutch pedal sticks, your speed doesn’t increase appropriately, and you get poor mileage. The Fix: It’s time for a new clutch plate. If you’re a handy garage mechanic, you can fit the new clutch plate yourself. Otherwise, see a mechanic. The Cost: On average, expect to spend around $1,500 on a new clutch plate."
    },
    {
      "title": "No, a burning aroma could indicate a serious fire risk.",
      "content": "No, a burning aroma could indicate a serious fire risk. If the burning smell is just a result of you driving fast and burning rubber, you’re okay to drive. Any other issue—from a bad AC compressor to an engine oil leak—could potentially result in a fire. This is especially likely to occur if you also notice your engine is running hot. Don’t risk it; take your vehicle to a mechanic and have it towed if your engine is running hot or you see smoke. [8] X Research source If you don’t have any overheating and you decide to drive to the mechanic, take it slow and pull over if you notice any smoke or additional symptoms."
    }
  ]
}