{
  "url": "https://www.wikihow.com/What-to-Say-to-Family-when-Someone-Is-Dying",
  "title": "7 Comforting Things to Say to Family When Someone Is Dying",
  "steps": [
    {
      "title": "Reach out right away using your normal method of communication.",
      "content": "Reach out right away using your normal method of communication. You may be worried about reaching out the \"right\" way, whether that's texting, calling, or in-person. As a rule of thumb, choose the mode of communication that you've used with this family in the past. If you’re close and visit them regularly, for example, then share your message in person. [1] X Research source If you’re more of an acquaintance and you usually connect via text, then message one member of the family who can share your text with everyone else."
    },
    {
      "title": "If you’re close with this family, reach out early, often, and consistently.",
      "content": "If you’re close with this family, reach out early, often, and consistently. Understand that there is no “normal” timeline for grief, especially when this family may be watching their relative battle a long-term, terminal illness. If you’re a close friend of this family, reach out and stop by regularly to offer your sympathy and support. [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Set up weekly dinner plans and do your best never to miss them. While you're with this family, check in on how they're feeling. If you're close with this family but live far away, set up regular phone calls with them. Even a simple check-in text can do wonders, especially months down the line when their support might've waned."
    },
    {
      "title": "Offer loving gifts and gestures as a show of support.",
      "content": "Offer loving gifts and gestures as a show of support. Send flowers, a card , or a basket , because this can be an excellent way to offer comfort. For the card, choose one of the helpful phrases offered below. Keep things simple—the goal is just to let the family know that they’re loved and supported. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source When grieving, people may not have time to make nutritious meals. Share food with your family friends so that cooking isn't another thing on their full plate."
    },
    {
      "title": "“I’m so sorry to hear about Brian.”",
      "content": "“I’m so sorry to hear about Brian.” Express your care and concern by simply offering your condolences. People sometimes feel that this message is too basic to be effective, but there’s no magic phrase that can end a family’s grief. Instead, simply let them know that you care about what the family is going through. That’s one of the most powerful things you can do to help. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source \"I heard about your cousin. It's so terrible, and I'm sorry.\" \"You have my deepest condolences.\""
    },
    {
      "title": "“Kelly is in my thoughts.”",
      "content": "“Kelly is in my thoughts.” Let them know that their relative is on your mind—because this can help a family feel less alone in their grief. If you know that this family would appreciate a religious take, consider explaining that their relative is in your prayers as well. \"I'm so sorry to hear about your grandmother. She's in my prayers.\" \"Your entire family has been in my thoughts constantly since I heard.\" \"All of my thoughts and prayers are with Leo.\""
    },
    {
      "title": "“I wish I had the right words, just know that I care.”",
      "content": "“I wish I had the right words, just know that I care.” You may worry that you won’t say the right thing, and that’s a scary feeling—but still, reach out to let the family know that you support them. With grief, connection can be a huge source of comfort. Instead of letting your fear keep you from offering that, admit that you don’t have the perfect words. But despite that, your message reminds them of something more important: that this family can rely on you for care and support. \"There are no words that could be enough. All I can say is that I'm so sorry—and I'm here for you.\" \"I'm more sad and sorry than I could possibly put into words. But please know that I'm here to help.\""
    },
    {
      "title": "“I can’t imagine how you’re feeling, just know I’m here to help.”",
      "content": "“I can’t imagine how you’re feeling, just know I’m here to help.” Instead of making the conversation about your feelings or trying to guess how they might be feeling, simply offer your help and comfort. Sometimes, practical help can ease another’s burden more than you’d think—so make sure this family knows that they can rely on you. [5] X Research source \"I won't pretend to understand how you're feeling.\" \"I can't begin to understand the pain you're in. But I can still help. Please, let me.\" \"I'll never really get how you're feeling, but I'd love to listen if you're willing to share.\""
    },
    {
      "title": "“I’m just a phone call away.”",
      "content": "“I’m just a phone call away.” While watching a family member struggle, through terminal illness for example, people may fear a long road ahead dealing with grief. Let them know that through it all, you’ll be there. To help them feel less alone, emphasize that you’re immediately reachable whenever they need it. [6] X Research source \"I just want you to know—I'm here. This week, next month, next year. I'm here for you.\" \"I never want you to wonder whether or not you can ask me for help. You can call me anytime.\" \"You know what I might do? Assign your contact a special ring. That way, I'll always know if it's you calling.\""
    },
    {
      "title": "“I’m going to bring by food this afternoon—what do you want?”",
      "content": "“I’m going to bring by food this afternoon—what do you want?” Offer practical help and be specific. Instead of just asking what the family members might need, explain that you already have a plan. The truth is, none of us can fix another person’s grief—but you can make their life’s logistics a little easier in their time of need. [7] X Research source Grocery shopping can become extremely difficult. \"Could you make a list of groceries? I'm going to do a run for you this afternoon.\" To a grieving family, simple household errands can feel like a huge burden. Say you're willing to help: \"I was going to mow my lawn this afternoon. I think I'll come by and do yours, too, if you're okay with that.\""
    },
    {
      "title": "“How have you been feeling?”",
      "content": "“How have you been feeling?” No two people experience grief the same way. Ask a family member to describe their experience to you, because this could be cathartic. Then, offer them one of the most powerful tools in your wheelhouse: an empathetic ear. [8] X Research source \"If you're willing to talk about it, I'm here to listen. How have you been?\" Sit and listen , and if they get choked up or take long breaks between words, wait in silence. Don’t interrupt or change the subject and if you’re close enough, offer them physical comfort , like a hug."
    },
    {
      "title": "“It’s going to be okay.”",
      "content": "“It’s going to be okay.” When someone’s family member is dying, the outcome isn’t going to be “okay.” When people use this phrase, they want to help grievers feel positive and hopeful—and that makes sense. But saying this will probably frustrate a grieving family, not comfort them. Instead, acknowledge the reality of the situation and offer your condolences. [9] X Research source"
    },
    {
      "title": "“At least you get to enjoy a little more time with her.”",
      "content": "“At least you get to enjoy a little more time with her.” When comforting a grieving family, any phrase beginning with “at least” risks invalidating their feelings. Instead of turning the family’s focus towards a positive, this comment might leave them feeling unsupported. Steer clear of phrases that might downplay their grief, especially ones that begin with “at least.” [10] X Research source"
    },
    {
      "title": "“Be strong.”",
      "content": "“Be strong.” As a rule of thumb, stay away from any comments that tell the family how they should handle their own grief. This is an unimaginable struggle they’re going through, and they’ll handle it as well as they can, however they can. Instead of inspiring them to be strong, this will probably make them feel misunderstood. [11] X Research source"
    },
    {
      "title": "“I understand what you’re going through.”",
      "content": "“I understand what you’re going through.” Even if you’ve experienced grief or watched a family member face terminal illness, stay away from this phrase. Not only does this make their grief about you, but it may even put the other person in a position where they feel they need to console you. [12] X Research source Someone saying this would definitely be trying to empathize, which makes sense—but this won’t have the desired effect."
    },
    {
      "title": "“He’s going to a better place.”",
      "content": "“He’s going to a better place.” Even if the family believes that this is fact, they’d definitely rather have their loved one stay with them instead. So thinking about why their relative is being taken away will probably feel extremely painful. Steer clear of this phrase. [13] X Research source In general, avoid religious-based comments unless you know that the family is spiritual. As a rule of thumb, wait until you’ve heard them speak about their grief in religious terms (for example: “I’ve been praying for Tommy every night”)."
    },
    {
      "title": "“Everything happens for a reason.”",
      "content": "“Everything happens for a reason.” The goal here is probably to make the family feel like there’s light at the end of the tunnel—like their pain serves a purpose. But instead, this phrase probably won’t comfort a family member, and it may even hurt them. What reason could possibly justify the loss of a loved one? Steer clear of this phrase. [14] X Research source"
    },
    {
      "title": "“God wants to be with him.”",
      "content": "“God wants to be with him.” Even for a religious family, this phrase will probably cause more pain than comfort. Again, losing a loved one is such a devastating experience, this family probably won’t want to imagine such a simple reason for their loss. Pick a new, more comforting phrase instead. [15] X Research source"
    }
  ]
}