{
  "url": "https://www.wikihow.com/Wear-Progressive-Glasses",
  "title": "How to Wear Progressive Glasses",
  "steps": [
    {
      "title": "Visit your optometrist.",
      "content": "Visit your optometrist. If you suspect that you might benefit from progressive lenses, you will want to visit with your optometrist. They will be able to determine if you need progressive lenses and help find the right lenses for you. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Progressive lenses can help if you have difficulty focusing on nearby objects. Your optometrist may suggest alternative treatments including surgery, lens implants, or contact lenses."
    },
    {
      "title": "Tell your optometrist about any problems with your vision.",
      "content": "Tell your optometrist about any problems with your vision. If you are having any issues with your vision, you should inform your optometrist about them. This will help them focus the examination on those problems and help meet your health needs. Take a moment to review the following list of topics you should discuss with your optometrist. Discuss any obvious issues you are having with your eyes or vision. Tell your optometrist about any previous issues with your vision or health. Be ready to let your optometrist know about any family history with eye issues, such as glaucoma or macular degeneration."
    },
    {
      "title": "Undergo the eye examination.",
      "content": "Undergo the eye examination. To accurately determine what level of strength your lenses will need to be, your optometrist will perform some diagnostic tests. These tests will measure the shape, strength, and health of your eyes. Your optometrist will discover how clearly you can see, which will find out how strong your lenses must be. Your optometrist may shine strong lights in your eyes to assess their internal health. Color vision testing may be performed during your examination. You may be screened for any signs of glaucoma or macular degeneration."
    },
    {
      "title": "Select your frames and make sure they fit.",
      "content": "Select your frames and make sure they fit. Once your examination has been done, your optometrist will give you a prescription for your progressive lenses. Some optometrist's offices will have a frame and lens boutique at which you can fill your new prescription and have them framed for you. If you don't have a glasses boutique nearby you, you can also order your prescription and frame with an online vendor. By visiting a vendor in person you can have your glasses adjusted to make sure they comfortably fit. The frames for your new progressive lenses come in many different shapes, sizes, and styles. Ask for advice on lens style choices from your optometrists or optician. Progressive lens styles are wide and varied, and a good optician can make recommendations based on your lifestyle on the right style of progressive lens."
    },
    {
      "title": "Wear your glasses often.",
      "content": "Wear your glasses often. Part of getting used to your new lenses is making sure that you are wearing them often enough. Using them frequently will help your eyes become accustomed to the new lenses and will help you learn what part of the lens to look out of. [3] X Research source Wear your progressive lenses every day, all day, for at least two weeks. Do not switch back and forth between your old glasses and your new ones. This may prolong the adaptation period. Practice getting used to which part of the lenses you need to look out of when doing your daily tasks. If you are struggling to adapt to your new lenses, wait a day or two before driving."
    },
    {
      "title": "Learn the parts of your lenses.",
      "content": "Learn the parts of your lenses. The benefit of a progressive lens is the gradually changing level of correction and focus. Since the lenses have different areas of focus, you will have to learn which ones to use in which situations. It may take some practice to learn which part of the lens you need to look through. [4] X Research source The top of the lens will be used for focusing on objects that are far way. The middle of the lens is focused on objects that are at an intermediate distance. The bottom of the lens will let you focus on objects that are nearby."
    },
    {
      "title": "Move your head, not your pupils.",
      "content": "Move your head, not your pupils. You may notice that your peripheral vision is slightly blurry or unclear when using your new progressive lenses. This blur might be most noticeable in the lower sides of your lenses. Learning to turn your head, instead of moving your eyes, can help you to focus on something in this area of your vision. [5] X Research source [6] X Research source After some time wearing your lenses, you will stop noticing the slight blur in your peripheral vision. Turning or moving your head will allow you to keep your eyes focused through the area of the lens you need."
    },
    {
      "title": "Practice proper care techniques.",
      "content": "Practice proper care techniques. Like any other pair of glasses, your progressive lenses will require proper care. Keeping your lenses clean and safe will keep your vision clear and extend the life of your lenses. Review the following tips to keep your lenses clean and well cared for: When you aren't using your glasses, keep them safe in their case. Don't let your lenses touch any abrasive or rough surfaces. Don't let other people try your glasses on, as this can reshape them, making them no longer fit you properly. Make sure the lenses are slightly wet when cleaning to avoid scratching them. Rinsing your glasses prior to using a cleaning cloth can help ensure that dust and debris are washed off before rubbing the surface of the lens."
    },
    {
      "title": "Be careful as you get used to your new lenses.",
      "content": "Be careful as you get used to your new lenses. As you get used to your new lenses, you will want to be careful when walking or driving. Although serious problems are unlikely, learning how to focus and use your lenses properly will help keep your vision strong and clear. [7] X Research source Be careful going up stairs. Turn your head down so that you can focus on your feet if you need to. Walk slowly in any new areas that present unfamiliar footing until you are used to focusing on your step using your progressive lenses. Certain brands, such as Definity lenses, have ground view advantage to help with typical distortion that other progressives exhibit when climbing stairs, curbs etc."
    },
    {
      "title": "Talk with your optometrist for more tips.",
      "content": "Talk with your optometrist for more tips. Your optometrist will be able to give you some tips and techniques to help keep your progressive lenses safe from scratches and other damages. She may be able to offer tools and products that you can use, such as microfiber cleaning cloths or lens cleaning solutions, to get the most out of your lenses. If you are having any difficulty adjusting to your new lenses, let your optometrist know. They may need to be adjusted."
    }
  ]
}