{
  "url": "https://www.wikihow.com/Wear-BUFF%C2%AE-Headwear",
  "title": "How to Wear BUFF® Headwear",
  "steps": [
    {
      "title": "Wear your BUFF® headwear around your neck to stay warm while you’re outdoors.",
      "content": "Wear your BUFF® headwear around your neck to stay warm while you’re outdoors. Tuck the bottom of the BUFF® headwear inside your shirt or jacket collar to keep it in place. You can also use the BUFF® headwear to protect the back of your neck from burning by wearing it as a scarf. [1] X Research source BUFF® headwear doesn’t just have to be functional—pick out a color and pattern that you love and use it to accessorize your outfit, too."
    },
    {
      "title": "Use BUFF® headwear as a face mask by pulling it up over your mouth and nose.",
      "content": "Use BUFF® headwear as a face mask by pulling it up over your mouth and nose. If you’re outdoors and the wind is blowing and the cold air is irritating your face, simply pull your BUFF® headwear up from around your neck. Position the top of the fabric over the bridge of your nose so your nose, mouth, and neck are covered. [2] X Research source BUFF® headwear is made of a material that keeps you warm while also allowing you to breathe through it without the fabric itself getting moist."
    },
    {
      "title": "Keep your ears warm with BUFF® headwear.",
      "content": "Keep your ears warm with BUFF® headwear. From the scarf position, pull the back of the fabric up so that it extends over the majority of your scalp. Leave the front tucked under your chin, and position your BUFF® headwear so that it covers your earlobes. [3] X Research source For extra warmth, pull a hat over the top of your BUFF® headwear."
    },
    {
      "title": "Turn BUFF® headwear into a balaclava to keep your entire face warm.",
      "content": "Turn BUFF® headwear into a balaclava to keep your entire face warm. From the scarf position, take the back of the fabric and pull it up over your head so that it’s covering your ears. Then, pull the front of it up over your nose and mouth. Grab the middle of that front section, right between your nose and mouth, and fold the top edge inside to create a thicker, straighter line for your balaclava. [4] X Research source It’s super easy to line up BUFF® headwear because there are no seams!"
    },
    {
      "title": "Make a hat out of your BUFF® headwear by twisting it in the middle.",
      "content": "Make a hat out of your BUFF® headwear by twisting it in the middle. Turn the entire BUFF® headwear inside out and twist the middle several times. Hold the twisted section in one hand and put one side of it on your head, like a hat. Pull the other half down over the inside-out section so that the pattern is on the outside again. [5] X Research source Since BUFF® headwear is thin, you can still wear it under a hat or helmet, even when it’s doubled up on your head. This is a great option for those mornings when you wake up with tousled hair, especially if you’re out camping and don’t have the option to shower or style your hair."
    },
    {
      "title": "Use BUFF® headwear as a headband when you’re on the go or working out.",
      "content": "Use BUFF® headwear as a headband when you’re on the go or working out . To wick away sweat or keep your hair out of your face, pull your BUFF® headwear down around your neck so it looks like a scarf, then pull it up around your hairline. Fold it or scrunch it so it isn’t hanging down on your forehead. [6] X Research source To keep your ears warm while sporting a headband style, put your BUFF® headwear on over your hair rather than pulling it down to the scarf position first."
    },
    {
      "title": "Put BUFF® headwear under your helmet to wick away sweat.",
      "content": "Put BUFF® headwear under your helmet to wick away sweat. Wear it as a hat or balaclava, or simply pull it over your head however it feels best to you. Then settle your helmet on top of your BUFF® headwear and fasten the straps as you normally would. [7] X Research source This is a great option for bikers , especially as the weather gets colder. You can add warmth without adding a lot of weight to your ensemble."
    },
    {
      "title": "Pick wool or fleece-lined BUFF® headwear to keep you warm.",
      "content": "Pick wool or fleece-lined BUFF® headwear to keep you warm. If you love camping but don’t love how cold you get when the sun goes down, buy BUFF® headwear with wool or fleece lining to provide some extra insulation. There are lots of different styles and colors to choose from! [8] X Research source You can buy BUFF® headwear online from the official BUFF® store. You can also find genuine BUFF® products at most sporting goods stores. You can get a traditional fleece-lined BUFF® headwear, or you can buy one of the newer styles, which are made of the same great material but come in hat form."
    },
    {
      "title": "Grab windproof BUFF® headwear for your next chilly hiking adventure.",
      "content": "Grab windproof BUFF® headwear for your next chilly hiking adventure. Search your local sporting goods store to find windproof-specific BUFF® headwear. Bring it with you when you go hiking, camping, biking, skiing, or when doing any activity that takes you out into the cool air. [9] X Research source Wear windproof BUFF® headwear like a balaclava so that it protects your nose and mouth. Pull the top down further to cover your forehead, too."
    },
    {
      "title": "Choose UV BUFF® headwear to protect your skin from the sun.",
      "content": "Choose UV BUFF® headwear to protect your skin from the sun. If you love spending time out in the fresh hair but also want to keep your skin healthy, use UV BUFF® headwear to put another breathable layer between your skin and the sun. [10] X Research source Even on cold or cloudy days, the rays can still reach through and burn your skin."
    }
  ]
}