{
  "url": "https://www.wikihow.com/Use-a-Urine-Dipstick-Test",
  "title": "How to Use a Urine Dipstick Test",
  "steps": [
    {
      "title": "Wash your hands",
      "content": "Wash your hands . Wet your hands with warm water, then rub antibacterial soap between them for at least 20 seconds. Rinse your hands with warm, running water, then dry them with a clean, single-use paper towel. [1] X Research source Consider putting on medical-grade gloves if you’re working with bodily fluids that are not your own."
    },
    {
      "title": "Fill a sterile specimen container with urine",
      "content": "Fill a sterile specimen container with urine . Urinalysis tests should always be conducted using fresh urine. First, clean the urinary opening with a sterile wipe . Then, urinate a small amount in the toilet, then stop urinating and position the collection container underneath the urethra or penis tip. Urinate directly into the container until it is half full, then secure the lid. [2] X Research source To ensure an accurate reading, it’s essential to keep the urine from coming into contact with contaminants from the environment. For a home test, you can also position the strip directly under the stream, the way you would with a traditional pregnancy test. Swirl or shake the container lightly to mix the urine prior to testing."
    },
    {
      "title": "Dip the test strip into the urine.",
      "content": "Dip the test strip into the urine. Take hold of the gripping surface at the thick end of the dipstick. Submerge the strip all the way, making sure you completely cover each individual test square. Once you’ve saturated the strip, remove it from the container immediately. Drag the strip along the edge of the container. Most urine test strips are comprised of 5 or 7 separate squares. Strips with 5 squares test for blood, glucose, protein, ketones, and pH levels. Strips with 7 squares also include bilirubin and urobilinogen. [3] X Research source"
    },
    {
      "title": "Use an absorbent material to blot the edge of the strip.",
      "content": "Use an absorbent material to blot the edge of the strip. Do not touch the pads with any material. A sheet of filter paper or absorbent paper towel will soak up the excess urine, preventing drips and keeping the testing area clean and sanitary. The remaining urine will be enough to react with the test squares. [4] X Research source Let the urine drip off the side of the strip, not down its length. Never shake the dipstick or blot it with another object."
    },
    {
      "title": "Turn the strip sideways before reading it.",
      "content": "Turn the strip sideways before reading it. When held in a horizontal position, you can make sure that the reactive chemicals won’t run from one square to another. Be sure to keep the test squares facing up so they’ll be plainly visible. [5] X Research source Mingling the urine from different squares can easily throw off the results of the test. Wash your hands after collecting and testing the urine sample."
    },
    {
      "title": "Wait approximately 2 minutes for the results.",
      "content": "Wait approximately 2 minutes for the results. It can take anywhere from 30 to 120 seconds for the compounds in the urine to begin reacting with the reagents on the test squares. Read the instructions for the specific test you are performing to know the exact time needed. Once a reaction is underway, the squares will gradually begin to change color. [6] X Research source Trying to track the time in your head is too imprecise. Set a timer or keep a close eye on the second hand of your watch so you’ll know exactly when the test is complete."
    },
    {
      "title": "Compare the test squares to the color chart.",
      "content": "Compare the test squares to the color chart. Each package of test strips should come with a color chart for easy analysis. Keep this chart handy when it comes time to read the strip . It will tell you what substances cause each change in color, which will help you narrow down your course of treatment. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The color chart will most often be displayed somewhere on the packaging itself, though it may also be included as a separate sheet. Take a few moments to read the instructions specific to the brand of test strips you’re working with to verify that you’re examining the squares in the correct order. Any color changes that take place after the initial 2 minutes should be disregarded, as the longer the urine remains exposed, the more likely it is to produce false positives."
    },
    {
      "title": "Interpret the results carefully.",
      "content": "Interpret the results carefully. Different colors indicate the presence of different substances. High amounts of proteins, for example, will turn the corresponding protein square (abbreviated as “PRO”) a cyan hue, while elevated nitrite levels (“NIT”) are common with UTIs. Refer to your color chart frequently to get a better sense of the significance of each value. [8] X Research source You’ll always want to take a look at the pH, specific gravity (“SG”), and glucose levels (“GLU”) of a urine sample, regardless of what you’re screening for. The leukocyte and ketone ranges can point to potentially serious conditions like bacterial infections or diabetes."
    },
    {
      "title": "Test the urine right away.",
      "content": "Test the urine right away. Ideally, the sample should be analyzed as soon as it leaves the body. If this isn’t possible, refrigerate the fresh urine until it can be examined. Keeping it in cold conditions will slow the breakdown of different chemicals and the onset of bacteria. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Always refrigerate a sample if it’s going to be more than 2 hours before you can get around to testing it. [10] X Research source Discard samples that are more than a couple hours old if they’ve been exposed to air or left to sit at room temperature. If necessary, you can wait and take a new sample at a later time."
    },
    {
      "title": "Pay attention to the physical characteristics of the urine.",
      "content": "Pay attention to the physical characteristics of the urine. The way a sample looks will provide the first clues about what’s going on inside the body. Healthy urine should be clear or faintly yellow. If the urine you’re testing is a dark or unusual color, is especially cloudy, or has an abnormal odor, you may not need a full urinalysis to tell you that something is off. [11] X Research source For best results, make sure you’re satisfactorily hydrated before you collect your sample. Orange, brown, or reddish urine may be a sign of blood in the urinary tract. Similarly, greenish-blue urine can occur if you have a UTI or a reaction to prescription medication. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Keep in mind that a dipstick test is not infallible.",
      "content": "Keep in mind that a dipstick test is not infallible. Generally speaking, urinalysis is a convenient and reliable way to get an overview of a patient’s level of health, but it’s not a perfect system. Bacteria, external contaminants, and the passing seconds can all contribute to inaccurate readings. Furthermore, it’s possible for testing machines and other materials to occasionally provide false results. [13] X Research source If you need to be able to detect potentially serious health complications, another type of test (such as a detailed blood screening) may be necessary."
    }
  ]
}