{
  "url": "https://www.wikihow.com/Shoot-a-Shotgun",
  "title": "How to Shoot a Shotgun",
  "steps": [
    {
      "title": "Always treat the shotgun as it were loaded.",
      "content": "Always treat the shotgun as it were loaded. Always wear ear and eye protection when shooting. Keep the safety on until the gun is in firing position. Never put your finger on the trigger until you're ready to fire. When you're not in firing position, keep the barrel aimed up or straight down at the ground, never point the gun in the direction of yourself or anyone you're with, and always assume the gun is loaded. [1] X Research source Before you try aiming, loading, or firing a shotgun, learn to respect the shotgun for what it is: a dangerous and powerful tool."
    },
    {
      "title": "Hold the shotgun correctly.",
      "content": "Hold the shotgun correctly. [2] X Research source The gun should be held at all times with your non-firing hand on the hand stock, roughly in the middle of the grip. Cradle it firmly, using the \"V\" created by your thumb and forefinger. Hold the grip of the gun with your firing-hand (the hand you write with) on the grip behind the trigger. Hold onto the gun securely but gently, as if you were giving it a light handshake."
    },
    {
      "title": "Put the gun in firing position.",
      "content": "Put the gun in firing position. Pull the gun snuggly into the shoulder, keeping your hands in the same position, but rotating the gun up. Pull the butt firmly into your shoulder. Failing to keep the shotgun tight in your shoulder will make the \"kick\" more painful when you shoot the gun. Keeping it tight allows your body to absorb the kick, as opposed to the gun bouncing into your shoulder. Your feet should be shoulder width apart, your knees flexed slightly, with your body turned roughly 40 degrees to the side of the target your firing hand is on. Your finger should not be on the trigger, but holding the stock behind the trigger guard with the rest of your fingers."
    },
    {
      "title": "Weld your cheek to the stock.",
      "content": "Weld your cheek to the stock. To aim properly, you need to develop what is called \"cheek to stock weld,\" which means that you've aligned your eye evenly with the sight of the shotgun by keeping your cheek in tight to the stock. [3] X Research source When the butt of the shotgun is pulled into the pocket your shoulder makes with your pectoral muscle, let your head rest against it by relaxing your neck. If the shotgun has a sight aperture about halfway up the barrel, align the gun so the sighting point near the tip of the shotgun barrel lines up in the aperture. Practice letting your cheek fall to the same point on the gun and aligning the sight-points as quickly and as comfortably as possible."
    },
    {
      "title": "Develop your swing.",
      "content": "Develop your swing. With an unloaded shotgun, ensure that the safety is on and practice bringing the gun into the firing position quickly. Push the gun straight out from your body, then tuck the butt of the shotgun firmly into your shoulder, keeping it tight against the pocket your shoulder created with your body. [4] X Research source Like in golf or tennis, shooting a shotgun is partially about swing. Whether you're sport-shooting or hunting, bringing the shotgun to firing position quickly and comfortably is an important start of the process."
    },
    {
      "title": "Decide what you want to shoot.",
      "content": "Decide what you want to shoot. Mostly, shotguns are good for shooting moving targets in the air. If you decide to go to the gun range or to a safe rural property with lots of space where you can practice, you'll probably want to practice shooting clay pigeons before you move on to hunting or other kinds of shooting. Gun ranges will have clay target areas with automated machines that launch the clay onto the range and various positions on the range from which you can shoot. This is a good way to learn from more experienced shooters. When you're in position, yell \"Pull\" for the clay operator to push the button and release the target onto the field. Take a turn launching the clay onto the range to watch the technique of others. It's a great way to learn."
    },
    {
      "title": "Go to a place where you can safely shoot the shotgun.",
      "content": "Go to a place where you can safely shoot the shotgun. Remember that shot goes for several hundred yards, and slugs even farther. Gun clubs and shooting ranges are the safest bet to start out with and learn the basics. Shoot some clay to get familiar with your shotgun before taking it into the woods. If you're going to hunt, make sure that you're not on private property, that it's the appropriate season, and that you follow the laws and regulations in your area."
    },
    {
      "title": "Load the shotgun.",
      "content": "Load the shotgun. First, make sure the safety is on. If you have a \"break action\" shotgun, meaning that the barrel and the butt hinges open to allow for a shell to be inserted, flip the break-level, which will usually be on the top of the gun near the back hand grip. The gun will hinge open, so you can insert a shell into the barrel. Firmly snapping the gun back closed loads the shotgun. Leave the safety on until you're ready to shoot. [5] X Research source For semi-automatic shotguns and pump-action shotguns, you'll take a shell, orient it so that the brass end is facing the rear of the shotgun, cup it in your hand, and lift it up into the loading port directly ahead of the trigger guard. You should be able to load 3-5 shells into these types of shotguns.\"Pumping\" the shotgun will load it. Alternatively, you can pull the pump back, opening the sliding shell-ejection port and insert one shell at a time. Moving the pump back forward will load the shotgun. Only load your shotgun when you're in position to shoot. Make sure the safety is on until you're ready to shoot."
    },
    {
      "title": "When you're ready, pull the trigger smoothly.",
      "content": "When you're ready, pull the trigger smoothly. With your shotgun pointed at the target and the gun in firing position, the butt firmly in your shoulder, flip the safety off and squeeze the trigger as if you were giving the grip a firm handshake with your firing hand. Closing your eyes at the moment of firing or jerking the shotgun up by pulling the trigger abruptly is a common mistake when you're just starting out. Keep both of your eyes open to give yourself good \"sight picture,\" meaning that you can focus on the moving target you're trying to hit and maintaining good sight-alignment (the sight post in the aperture). The kick of the shotgun is more significant than most rifles, so it can take some getting used to."
    },
    {
      "title": "Develop your accuracy.",
      "content": "Develop your accuracy. The difficult thing about shooting clay is that you have to compensate for the speed of the target, which means that you're shooting ahead of the target, not at it. [6] X Research source Also, you have to compensate for the \"spread\" of the shotgun, which is the range of the shot in each shell. They have a fairly wide range, which means that you're aiming for the neighborhood of each target, and that you don't have to be directly on it. For this reason, you need to make sure you've got plenty of space with nothing behind it in which to shoot. Gun clubs are the safest bet. Let the target to pass before you mount the gun onto the line of the target, swinging the gun along its line of travel. Get to the front edge of the target, and squeeze the trigger. Keep swinging and the gun will go off ahead of the target. Focus on the target, and follow through, hold the gun in position for a breath before you lower it, safety it, and check your shot. The whole process is similar to hitting a golf ball: eye on the ball; a good swing and follow through."
    },
    {
      "title": "Consider single and double shot options.",
      "content": "Consider single and double shot options. Single-shot shotguns are generally the least expensive. They hold one shell at the time, which means you'll have to reload between shots, which can be a negative if you're hunting and need multiple shots. Double barrel shotguns come in two varieties: over-unders (O/U) with one barrel above another, and side-by-sides, in which the barrels are located horizontally. Some people prefer one style, some the other; neither is ultimately better, and both styles are expensive. Some custom guns will run over $10,000. Both of these types of guns are \"break action\" shotguns, which means a level will hinge the barrel and the stock open to load and unload manually."
    },
    {
      "title": "Consider reloading options.",
      "content": "Consider reloading options. Pump-action shotguns hold 3-5 ammunition shells at once. To reload, you \"pump\" the slide on the stock and advance another shell into the chamber, ejecting the spent shell and loading another from the magazine tube. This inexpensive gun is known for its reliability and the distinctive sound the pump makes when reloading. [7] X Research source Semi-automatic shotguns load automatically every time the gun is fired. They range anywhere from $300 to $5000 and up."
    },
    {
      "title": "Choose a gun of a desirable barrel length.",
      "content": "Choose a gun of a desirable barrel length. For a skeet, target, or hunting shotgun, a long barrel with a choke on it is probably preferred, whereas a home (or personal) defense, a shotgun should probably have a short barrel with little or no choke. [8] X Research source Long barrels allow more of the powder's pressure to accelerate the shot which in turn means higher muzzle velocities and because the pellets have more time to move in a straight path they spread out less. It also makes the shotgun heavier and more difficult (or at least slower) to swing around to aim at fast moving objects. Short barrels are great for close quarters and other situations when pellet spread means less."
    },
    {
      "title": "Consider the gauge.",
      "content": "Consider the gauge. Bore size is also a big consideration as the the heavy 12-, or even 10-, gauge shotguns can be painful to shoot for a weak, small, or untrained user. 16- or 20-gauge shotguns are available which have much less kick and thus are easier to handle for a wider range of users."
    },
    {
      "title": "Select your choke.",
      "content": "Select your choke. A choke is a section at the end of the barrel which slightly constricts the diameter of the muzzle. The size of the choke changes how wide the spread of the pellets will be. The tighter the choke the tighter the pattern. Loose patterns allow for greater accuracy error, but it also means that at a closer distance your pellets will no longer be affective against your target. [9] X Research source The two types of chokes are fixed chokes and screw-in chokes. Fixed chokes are part of the barrel design and cannot be changed or removed (without major work). The screw-in choke means the end of the barrel is threaded (inside the bore) to allow many different sizes of chokes to be easily replaced."
    },
    {
      "title": "Use \"bird shot\" for sport shooting.",
      "content": "Use \"bird shot\" for sport shooting. There are a wide variety of ammunition options available for the shotgun, and bird shot--made of small pellets poured into a plastic wadding--is most commonly used for shooting clay pigeons on the target range, or small birds like doves. For shooting clays, lower recoil shells will often be referred to as \"Trap\" loads and the more potent shells for hunting are often marked as \"Game\" loads. [10] X Research source You can also choose between high-base (also called high-brass) or low-base (also low-brass). High-base (compared to low-base) does not necessarily mean more powder. This is the type of shot you would use against small living creatures such as dove or varmint, where low-base you can use against clays."
    },
    {
      "title": "For large game hunting, try Buckshot.",
      "content": "For large game hunting, try Buckshot. This type uses large pellets (up to 0.38-inches) seated into plastic wadding. The most common type of Buckshot is 00 (pronounced \"double-aught\"). 000-buck (triple-aught) is even larger pellets, 0-buck (single-aught) is smaller, the next set of smaller pellets would be #1 buck, then #2 and so on. [11] X Research source"
    },
    {
      "title": "Get shells of the appropriate size for your gun.",
      "content": "Get shells of the appropriate size for your gun. There are three shell sizes. 2-3/4-inch (standard), 3-inch (magnum), and 3-1/2-inch (super-magnum). Even shorter shells are available for esoteric purposes, but these will not reliably feed in pump or autoloader shotguns. Most common shotguns support up to 3-inch (shotguns can always shoot smaller shells, but not necessarily larger), but some shoot the 3-1/2-inch which contain much more shot than standard loads but may or may not have more powder."
    },
    {
      "title": "Consider getting some slugs.",
      "content": "Consider getting some slugs. Slugs are essentially what most think of when they think of a bullet. It is a large piece of lead propelled by powder. Slug power is determined in the same way as Buckshot, with standard, magnum, and super-magnum loadings. With magnum and super-magnum you also have the option of getting a heavier (heavier than 1oz.) slug. There are two common types of slugs. The \"rifled\" slug is used in shotguns that have a smooth-bore barrel and the sabot slug is used for shotguns with a rifled barrel. Sabot slugs are generally more accurate and higher velocity than rifled slugs, but they require a rifled barrel to be fired accurately, which is less common."
    },
    {
      "title": "Note the shot size of your ammunition.",
      "content": "Note the shot size of your ammunition. When you're shopping for ammunition, keep an eye out for the size of the shot listed on the box and get something appropriate for your needs. Just as a 12-gauge is larger than a 20-gauge, #6-shot uses larger pellets than #8-shot. For shooting clay, a higher shot number (#7-1/2 to #9 shot) is usually preferred as the dense spread of the pellets is more important than the weight of individual pellets. The larger, heavier pellets (#4-#6 shot) is usually reserved for birds and rabbits, because fur and feathers are harder to penetrate than the ceramic of the artificial targets. The trap shells used for shooting clays are generally less powerful, reducing impact on the user during the large number of shots fired in competitions."
    },
    {
      "title": "Clean the gun",
      "content": "Clean the gun after every shooting. [12] X Research source To keep your shotgun in good working condition, you'll need to follow this process after you're through shooting every time. The powder and the grease from the gun can build up, causing malfunctions in no time. A dirty shotgun is a dangerous shotgun. Clean it."
    },
    {
      "title": "Break the gun into its primary parts.",
      "content": "Break the gun into its primary parts. Follow the instructions in your owner's manual to break the gun down. If you've got a break action shotgun, you just need to let the gun hinge open and you can clean the gun that way. For a pump action gun, you'll at least need to remove the barrel to clean it."
    },
    {
      "title": "Degrease the gun.",
      "content": "Degrease the gun. Use an aerosol degreaser or solvent designed for guns. Don't use this on any areas with moving parts, like the trigger assembly, but spray a coating of this into the barrel and into the choke tubes. [13] X Research source"
    },
    {
      "title": "Swab the barrel.",
      "content": "Swab the barrel. Using a rag and a rod to push it through is fine, or you can purchase a Boresnake barrel cleaning device made for the purpose. Make sure the rag or the snake don't snag on anything and leave little cloth chunks in the barrel."
    },
    {
      "title": "Scrub the chokes.",
      "content": "Scrub the chokes. These will get very dirty, taking the brunt of most of the powder grime that builds up on the gun. Use a rifle brush or an old toothbrush with a little bit of aerosol cleaner sprayed directly onto it."
    },
    {
      "title": "Wipe the gun down.",
      "content": "Wipe the gun down. With a clean cloth, spot check for any powder or dirt spots that need scrubbing, and wipe the gun down of any excess aerosol spray."
    }
  ]
}