{
  "url": "https://www.wikihow.com/Stain-Pine",
  "title": "The Best Way to Stain and Finish Pine Wood",
  "steps": [
    {
      "title": "Level the wood’s surface with 80-grit or 120-grit sandpaper.",
      "content": "Level the wood’s surface with 80-grit or 120-grit sandpaper . If you have a bare piece of pine, use 80-grit sandpaper to rough up the surface. If you want to stain over an existing finish, opt for 120-grit sandpaper instead. [1] X Research source Rub the sandpaper on your piece of pine using a wide, looping circular motion. Keep roughing up the surface until the wood doesn’t have any raised bits or pieces. [2] X Expert Source Ryaan Tuttle Home Improvement Specialist Expert Interview. 17 February 2022. Sanding helps open up the pores in natural wood surfaces, which will allow the stain to set in better. Try using a sanding block to apply more consistent pressure than holding a sheet of sandpaper in your hand. You can instead use a random orbital sander to shave off any rough edges or pieces of wood."
    },
    {
      "title": "Smooth out the pine with 150-grit sandpaper.",
      "content": "Smooth out the pine with 150-grit sandpaper . Once you have the pine leveled out, go over it one more time with your higher-grit sandpaper. The finer grit will get rid of any coarse scratches or marks on the wood’s surface so the stain evenly soaks into the wood without blotching. [3] X Research source If you’re working with raw pine boards, don’t forget to go over the cut ends, as well. Avoid using sandpaper that’s finer than 150-grit since it could smooth the wood out so much that it won’t accept stain easily."
    },
    {
      "title": "Clean the sawdust off the surface with a damp sponge.",
      "content": "Clean the sawdust off the surface with a damp sponge. Wet a soft sponge and wring out the excess water. Run your sponge over the surface of the pine from end to end with heavy, sweeping strokes in one direction. [4] X Expert Source Ryaan Tuttle Home Improvement Specialist Expert Interview. 17 February 2022. Wiping the pine with a damp sponge can help open up the wood’s pores so the stain can soak in easier."
    },
    {
      "title": "Apply pre-stain conditioner",
      "content": "Apply pre-stain conditioner to the wood with a sponge brush . Pre-stain conditioner helps the stain spread evenly so you’re less likely to get blotches and wood grain reversal. Dip your sponge brush into the conditioner, and spread it over every exposed area of the piece of wood. Make sure the entire piece of pine has an even coat of the conditioner. [5] X Research source Work in a well-ventilated space when you use stain or pre-conditioner. If the area where you’re working doesn’t have good ventilation, then put on a respirator while you’re working. Pre-sealing your pine with conditioner essentially evens out the empty space inside the grain, allowing the stain to stand out boldly on top without simply absorbing too deep into the wood. [6] X Expert Source Ryaan Tuttle Home Improvement Specialist Expert Interview. 17 February 2022."
    },
    {
      "title": "Wipe off the excess conditioner with a shop cloth after 10–15 minutes.",
      "content": "Wipe off the excess conditioner with a shop cloth after 10–15 minutes. The conditioner needs a little bit of time to soak into the wood. Give the wood at least 10 minutes before running your shop cloth over the surface. Wipe in long, sweeping strokes to ensure you don’t leave any streaks on your wood. Keep wiping your piece of pine until there aren’t any wet spots left. [7] X Research source If you leave too much conditioner on the wood, it will fill the pores and prevent the stain from setting in at all."
    },
    {
      "title": "Leave the conditioner to set for up to 2 hours.",
      "content": "Leave the conditioner to set for up to 2 hours. Leave the piece of pine in a cool, clean place with low humidity to dry before you start staining. You can start staining your wood as soon as 15 minutes after you wipe off the excess conditioner, but make sure to do it within 2 hours so the pores don’t close up again. [8] X Research source Applying the stain right after you put conditioner on the surface could water down the color and make your stain appear lighter."
    },
    {
      "title": "Brush a thin coat of gel stain onto the wood’s surface.",
      "content": "Brush a thin coat of gel stain onto the wood’s surface. Gel stain is the best type of stain to use for pine since it gives the wood a more consistent color without blotching. [9] X Research source Dip a lint-free cloth or a sponge brush into the stain and blot it across your piece of wood. Then, brush the stain into the wood using circular motions or long back-and-forth strokes. [10] X Research source For a light warm color, try a golden oak stain on your piece of pine. Use a gray stain if you want to balance out the pine’s natural orange hue. Darken and complement the wood’s natural color with walnut or mahogany stain . Be conservative and apply a thin layer of stain at first. It’ll be easier to get a darker wood tone with multiple thin coats of stain instead of one thick coat. Avoid thin water- or oil-based stains since pine absorbs them unevenly, which gives the wood a splotchy appearance."
    },
    {
      "title": "Wipe off the excess stain after 2–5 minutes.",
      "content": "Wipe off the excess stain after 2–5 minutes. The stain will start soaking into the pine’s surface within a few minutes and change the wood’s color. After a few minutes, run a clean shop cloth across the wood in long sweeping strokes to pick up the excess stain. Keep wiping your piece of pine until you aren’t picking up any more stain on your cloth. [11] X Research source Leaving excess stain on the wood could cause it to dry with an uneven finish."
    },
    {
      "title": "Let the stain dry for at least 2 hours.",
      "content": "Let the stain dry for at least 2 hours. Leave the stain alone in a well-ventilated area so it has a chance to dry. Test the dryness by touching an inconspicuous part of the wood with a finger. If the stain is wet or tacky, leave it alone until it’s dry and smooth to the touch. [12] X Research source Drying times depend on the humidity in your area. If you live in a more humid climate, it may take longer for the stain to dry. Set the piece on a tarp or sheet of newspaper while it dries to prevent the finish from rubbing off on anything nearby."
    },
    {
      "title": "Apply additional coats of stain if you want a darker color.",
      "content": "Apply additional coats of stain if you want a darker color. If you want a deeper shade on your piece of pine, brush on a second coat the same way you applied the first one. After another few minutes, use a clean cloth to wipe off the excess. Keep adding more thin layers of stain until you’re satisfied with the appearance. [13] X Research source If you’ve used more than three coats and the piece still hasn’t reached the shade you want, consider switching to a darker stain. If you notice any dust dried into the first coat of stain, lightly sand it with 150-grit sandpaper and wipe the dust off. Be careful not to sand so much that you expose the raw wood underneath the stain."
    },
    {
      "title": "Let the stain dry for 24 hours after the final coat.",
      "content": "Let the stain dry for 24 hours after the final coat. When you’re satisfied with how your stain turned out, leave it in a well-ventilated spot so it has a chance to completely set. Give the stain at least a day to set, and test if it’s dry with your finger. If it still feels tacky, let it dry for a few more hours. Otherwise, you can start sealing the piece of pine. [14] X Research source"
    },
    {
      "title": "Wipe down the stained surface with a clean shop cloth.",
      "content": "Wipe down the stained surface with a clean shop cloth. Give your piece of pine a quick once-over with a shop cloth to get rid of any dust that might have settled on the surface. That way, you prevent it from becoming sealed onto the wood. [15] X Research source Use a light touch and be careful not to scrub too hard so you don’t end up removing or smudging the stain."
    },
    {
      "title": "Brush 2 layers of polyurethane clear coat onto the pine.",
      "content": "Brush 2 layers of polyurethane clear coat onto the pine. Stir your polyurethane to make sure it’s properly mixed. Dip a bristle brush into the clear coat and apply the polyurethane in a thin layer using long, broad strokes. Make sure you coat the entire surface of the wood to seal it. Give the polyurethane a day to dry completely before applying a second coat. [16] X Research source Be careful not to apply the clear coat too heavily since it could create an uneven surface with drips or pools."
    },
    {
      "title": "Sand the clear coat smooth with 180-grit sandpaper to finish.",
      "content": "Sand the clear coat smooth with 180-grit sandpaper to finish. Apply gentle pressure to lightly sand any imperfections off of the sealant. Work in the same direction as the wood grain while you’re sanding. Once you have a smooth, professional-looking surface, wipe off any excess dust with a shop cloth. [17] X Research source"
    }
  ]
}