{
  "url": "https://www.wikihow.com/Volunteer-at-a-Hospital",
  "title": "How to Volunteer at a Hospital",
  "steps": [
    {
      "title": "Volunteering is a big commitment, so find a convenient location.",
      "content": "Volunteering is a big commitment, so find a convenient location. Start by making a list of hospitals in the area that you can commute to regularly—and be sure to include smaller clinics too. If you plan to volunteer after school or work, choose a hospital that’s close to your job or school. If you plan to volunteer on the weekends, choose a hospital that’s close to where you live. [1] X Research source A little online research can help you track down every nearby hospital. Use Google Maps to make your list of possible volunteer spots! Search the internet for a phone number for volunteer services, or write down the main phone number for the hospital. Make a plan for how you’ll get there, too, whether you have a car or you’ll need to use public transportation (or get a ride from someone else)."
    },
    {
      "title": "There may be age limits, time commitments, and health requirements.",
      "content": "There may be age limits, time commitments, and health requirements. Hospitals also have different rules depending on whether you’re a teen or adult volunteer. Ensure you qualify to work at each hospital you're considering and cross them off your list if they aren't a good fit. [2] X Research source For example, a hospital might require you to work 4 hours per week or 100 hours per year. Some hospitals have special volunteer programs and internships for students. Requirements also change based on the position. Even if you can start volunteering at 16, you might not be able to talk to patients until you’re 18. If you’re under 18, you’ll need permission from your parents to volunteer at a hospital."
    },
    {
      "title": "Learn about the hospital’s volunteer roles online and over the phone.",
      "content": "Learn about the hospital’s volunteer roles online and over the phone. Once you find the hospital you want to volunteer at, visit their website for specific opportunities. Make another list of all the positions that look interesting to you. Most hospitals have volunteer programs, and their website also lists contact information for the volunteer office, so you can call with any questions you have. [3] X Research source You can also contact the volunteer office directly, usually by phone or email, to ask them what volunteer opportunities are available."
    },
    {
      "title": "Volunteering should be enjoyable for you and beneficial for the hospital.",
      "content": "Volunteering should be enjoyable for you and beneficial for the hospital. Consider whether you’d prefer to work with patients (adults, children, or people with specific illnesses and issues), families, or hospital visitors. Find an opportunity that matches your interests, and don’t be afraid to ask for a few different positions; there are many ways to volunteer at a hospital! [4] X Research source If you want to interact with visitors, many hospitals need door greeters, volunteer receptionists, and gift shop cashiers. If you prefer helping patients look for positions that involve delivering gifts, socializing with patients , or entertaining them. You might want to interact with children , in which case you might volunteer as a baby cuddler, play with adolescent children, or help bring them to and from appointments. If you prefer not to interact with anyone, you could volunteer to do administrative work like filing, shredding, inventory, or other tasks."
    },
    {
      "title": "Hospitals require applications to get a sense of your qualifications.",
      "content": "Hospitals require applications to get a sense of your qualifications. Fill out an application online, or download it from the hospital website. Enter all the requested information, and include the specific areas you’d like to volunteer in n the application. Typically, a member of the volunteer office will contact you after your application is received to tell you about the next steps. [5] X Research source Choose more than one area of interest on your application, just in case you don’t get your first choice. Most hospitals conduct background and criminal checks as part of the screening process, so be sure to report any history on the application. Send in the application as soon as possible, as slots may be filled on a first-come, first-serve basis. If you’re applying to a special summer program, check the application dates to ensure you stay within the deadline."
    },
    {
      "title": "Prepare for the interview beforehand to ace every question.",
      "content": "Prepare for the interview beforehand to ace every question. During the interview, you’ll answer questions such as: Why do you want to volunteer at the hospital? What would like to do as a volunteer? Do you have any special skills? How did you hear about the hospital volunteer program? Consider each answer beforehand and write down your responses so you know what to say. [6] X Research source Remember: this isn’t a formal job interview! Give honest answers and just be yourself; the hospital needs volunteers and genuinely wants to find a good placement for you."
    },
    {
      "title": "Hospitals require volunteer staff to provide their full vaccination record.",
      "content": "Hospitals require volunteer staff to provide their full vaccination record. Medical requirements are especially important at hospitals, where you’ll work around sick and injured people. Provide your full immunization record, including proof that you have the MMR (measles, mumps, rubella) vaccine and a recent tuberculosis (TB) skin test. You can get a record of them from your primary doctor. [7] X Research source You’ll also likely have to pass a drug and alcohol test before being cleared. Some hospitals also require influenza (flu) vaccination and varicella (chicken pox) vaccination or immunity. If you don’t have the necessary vaccinations, you’ll need to get them before volunteering. Visit your primary care doctor or local health department if you need to get your vaccinations or a TB test."
    },
    {
      "title": "You’ll learn the hospital’s policies and receive training at orientation.",
      "content": "You’ll learn the hospital’s policies and receive training at orientation. Hospitals typically require orientation before you can start volunteering, which covers many topics, including hospital policies and procedures, volunteer requirements and expectations, and the history and mission of the hospital. You might also be trained in your specific volunteer area if it requires extra instruction. [8] X Research source You’ll get your official assignment during orientation, which might be online or in-person, depending on the hospital. Pay attention and ask questions during orientation to excel as a volunteer. It’s also a great time to meet some of the people you might be working with. Some hospitals require orientation before you complete your application. In that case, you’ll get information about the application and interview process during orientation."
    },
    {
      "title": "Professional conduct helps maintain a safe environment for everyone.",
      "content": "Professional conduct helps maintain a safe environment for everyone. Although you are not an employee, you should still be professional . Show up to work on time, treat patients and visitors respectfully, report any unsafe conditions, and don’t use your cell phone while volunteering. The hospital’s rules are there for a reason! Professionalism protects you, the hospital patients, visitors, and employees. Maintain some distance between yourself and the patients you work with. Being caring and helpful is important, but giving out contact information blurs your professional boundaries and compromises your objectivity. Avoid physical contact with the patients unless it’s required as part of your job. This prevents you from passing any germs back and forth between you and the patients."
    },
    {
      "title": "Your uniform lets patients and staff know that you’re a volunteer.",
      "content": "Your uniform lets patients and staff know that you’re a volunteer. Most hospitals require volunteers to wear a uniform and badge for every volunteer shift. Be sure to keep your uniform neat and clean, as you’re representing the hospital each time you wear it. Ensure your name badge is visible at all times so everyone can see who you are. [9] X Research source Remember to keep to other work attire policies if the hospital also has them, including footwear and masks. For example, some hospitals require volunteers to wear flat, closed-toe shoes. Be prepared to pay a small fee for your own uniform, as hospitals often charge volunteers for them. If you ever lose your badge, let your supervisor know."
    },
    {
      "title": "For their safety, never share any patient's medical information.",
      "content": "For their safety, never share any patient's medical information. As a volunteer, it’s important to follow all the hospital’s rules and avoid sharing any patient's medical information, name, address, phone number, or other identifying information. If you’re ever unsure about something, read your volunteer handbook or ask your supervisor about it. [10] X Research source For example, if you want to tell a story about your work at the hospital, be careful not to include the patient's name or any specifics about them. Remember: you’re also responsible for knowing and following the hospital’s other policies, including emergency procedures and infection control."
    },
    {
      "title": "Many hospitals have strict policies against accepting gifts.",
      "content": "Many hospitals have strict policies against accepting gifts. When you volunteer regularly, you’ll develop friendships with some of the patients and families. While they might be grateful to you and try to show their gratitude with a gift, volunteers should never accept gifts from patients. Hospitals have strict policies about this because gifts compromise the relationship between you and the patient. [11] X Research source For example, some patients might expect special treatment from you after you accept a gift, which is why it’s so important to be polite and refuse. You could lose your volunteer position otherwise. If a patient gives you something, try saying, \"This is very nice of you, but I can’t accept this,\" or \"You’re very kind, but no, thank you.\" If a patient insists that you accept a gift, take it and give it to your supervisor. Let them know that you politely declined, but the patient wouldn’t take “no” for an answer."
    },
    {
      "title": "Making connections through work gives you contacts for the future.",
      "content": "Making connections through work gives you contacts for the future. If you’re aiming for a career as a medical professional, volunteering is an invaluable opportunity to watch doctors and nurses work. Talk to people who work at the hospital in their downtime about their work, and ask them about their thoughts on current medical issues to build rapport. They might just become a reference or job connection later on! [12] X Research source If you aren’t sure of your career path yet, write down your thoughts and reflections in a notebook as you observe the hospital each shift. Explore different departments if you can, so you can get as much experience as possible in all areas of the hospital. Be sure to add your volunteer work to your resume or college application! Even if it isn’t related to your career goals, it shows that you’re a dedicated worker, which is a valuable trait."
    },
    {
      "title": "Volunteering means supporting staff and patients alike.",
      "content": "Volunteering means supporting staff and patients alike. Remember that, ultimately, your goal is to help the hospital staff make their patients’ stays as enjoyable as possible. When you’re on duty, focus on doing what you can to help the people around you, whether it’s entertaining a patient or doing a small task to make them more comfortable. [13] X Research source For example, if a child staying overnight in the hospital is bored, you can make it your mission to find them a few toys to play with."
    }
  ]
}