{
  "url": "https://www.wikihow.com/Spot-Valuable-Paintings",
  "title": "How to Tell if a Painting Is Valuable",
  "steps": [
    {
      "title": "Seek out paintings created by renowned artists.",
      "content": "Seek out paintings created by renowned artists. For many people, the goal of art hunting is to find a lost masterpiece from a beloved artist. Though you most likely won’t find anything by Monet or Vermeer, you may come across a hidden gem made by a lesser-known or regionally popular painter. [1] X Research source Some artists whose work ended up at thrift stores include Ben Nicholson, Ilya Bolotowsky, Giovanni Battista Torriglia, Alexander Calder, and even Pablo Picasso. So you’ll know what paintings to keep an eye out for, learn about different artists through local galleries, art museums, and online databases like the Web Gallery of Art."
    },
    {
      "title": "Search for paintings on your phone to see if anything comes up.",
      "content": "Search for paintings on your phone to see if anything comes up. If you stumble upon a piece you think may be valuable, try searching for it on Google or a similar search engine. If the painting shows up in your search results, you may have found a valuable item. [2] X Research source If you don’t know the name of a painting, search for it using descriptors. For example, you can find Thomas Gainsborough’s The Blue Boy with the terms “painting,” “kid,” and “blue.” If you can take a high-quality photo of the piece, try running it through Google’s Reverse Image Search at https://reverse.photos . This will make the searching process far easier."
    },
    {
      "title": "Purchase limited edition and signed prints.",
      "content": "Purchase limited edition and signed prints. Though most art prints have little to no financial value, there are a couple of notable exceptions. Look out for prints that were part of a limited edition run, meaning the artist only produced a few copies, and prints with a handwritten signature from the artist on the front or back, as these are usually more valuable. [3] X Research source Most limited edition prints have numbers on them indicating which copy you have and how many copies exist."
    },
    {
      "title": "Avoid buying small and subtle paintings if you plan on selling them.",
      "content": "Avoid buying small and subtle paintings if you plan on selling them. Unless you stumble upon an original piece by a popular artist, stay away from paintings that are extremely small in size or subtle to the point of being abstract. Though these paintings may be excellent, they don’t have the same mass appeal that a large, traditional painting does, making them harder to sell. This is especially important if you plan to sell your paintings online since small and abstract art is hard to convey over digitized photographs."
    },
    {
      "title": "Pick up paintings with high-quality frames.",
      "content": "Pick up paintings with high-quality frames. Even if you decide that a painting is not valuable, make sure to examine the frame before moving on. Picture frames are works of art in their own right, so a vintage or well-crafted frame may be worth a lot regardless of the painting inside. Look for frames with: [4] X Research source Hand-carved designs Intricate or unique patterns Gilded molding Slight wear and similar signs of age"
    },
    {
      "title": "Look for the artist’s original signature.",
      "content": "Look for the artist’s original signature. Often, the easiest way to tell if a painting is authentic or not is to look for the artist’s signature on the front or back side. In particular, look for a signature that was hand-written or added to the piece using paint. If a painting doesn’t have a signature, or if the signature seems flat and artificial, there’s a good chance the piece is a reproduction print or fake. [5] X Research source If you know the artist’s name, look them up online and see if their signature matches the version on the painting. Signatures are easy to fake, so don’t use this as your only proof of authenticity."
    },
    {
      "title": "Use a magnifying glass to check for printer dots.",
      "content": "Use a magnifying glass to check for printer dots. Before purchasing a painting, hold a magnifying glass up to it and look for small, perfectly-round dots arranged in a grid. If you see any, the piece is a reproduction print created using a laser printer. [6] X Research source Though this method will help you identify common prints, be aware that it may not work for higher-quality giclee reproductions. Unlike laser prints, paintings made using a pointillist technique will have dots of varying sizes and shapes."
    },
    {
      "title": "Inspect oil paintings to see if they have textured surfaces.",
      "content": "Inspect oil paintings to see if they have textured surfaces. When determining the authenticity of an oil painting, check to see if the surface has bumps or paint waves on it. If your piece has a significant amount of texture, there’s a good chance it is authentic. If the surface is completely flat, you’re looking at a reproduction. [7] X Research source If a painting only has 1 or 2 spots of texture, it may be a forgery disguising itself as the real deal."
    },
    {
      "title": "Examine watercolor art pieces to see if they have rough surfaces.",
      "content": "Examine watercolor art pieces to see if they have rough surfaces. To determine whether or not a watercolor painting is authentic, hold the piece at an angle and look at the paint strokes closely. If the paper appears rough around major strokes, you may have an original work of art. If the paper is uniformly smooth, it’s most likely a reproduction. [8] X Research source"
    },
    {
      "title": "Look to see if canvas paintings have rough edges.",
      "content": "Look to see if canvas paintings have rough edges. A lot of the time, artists who work on canvas will make jagged or uneven brush strokes along the edges of their paintings. However, they often don’t bother retouching these spots since viewers rarely look at them. As such, if a canvas painting has perfectly even edges, there’s a good chance it’s a factory reproduction. [9] X Research source"
    },
    {
      "title": "Check the back of the frame for signs of age.",
      "content": "Check the back of the frame for signs of age. Often, the back of a frame will tell you more about a painting than the artwork itself. Look for frames that are dark in color and have clear signs of age such as peeling lacquer and patches of worn out wood. The older a frame is, the more likely the piece inside is authentic. [10] X Research source If the back of a frame is mostly dark but has a few bright streaks in it, there’s a good chance the painting is authentic but had to be relined at some point. Many old frames have a X or H shape in the back, something far less common in contemporary frames."
    },
    {
      "title": "Look at the artwork’s mounting method to see how old it is.",
      "content": "Look at the artwork’s mounting method to see how old it is. If nails hold the painting in place, or if you see empty nail holes around the frame, there’s a good chance the artwork is an original piece from before the 1940s. If staples hold the painting in place, there’s a greater chance it is a reproduction, especially if it is an old piece and has no signs of a prior mounting method."
    }
  ]
}