{
  "url": "https://www.wikihow.com/Vesica-Piscis",
  "title": "What Is the Vesica Piscis?",
  "steps": [
    {
      "title": "The vesica piscis is the shape formed between 2 overlapping circles.",
      "content": "The vesica piscis is the shape formed between 2 overlapping circles. When 2 circles of equal diameters overlap with the edge of one circle touching the exact center of the other, the almond shape formed in between is known as the vesica piscis. [1] X Research source Vesica piscis is Latin for “fish bladder” and comes from the shape's resemblance to a fish's swim bladder. It is also sometimes called the mandorla —Italian for “almond.”"
    },
    {
      "title": "The divine feminine",
      "content": "The divine feminine The vesica piscis has been compared to a vagina or vulva, lending to its usage as a symbol of the divine feminine. It is sometimes called the “womb of the universe” and has been used as a symbol of female fertility in both Christian and pagan religions. The symbol is sometimes associated with the Roman goddess of love, beauty, sex, and fertility Venus (Greek Aphrodite ). [2] X Research source The symbol is also seen in the sheela-na-gig , a Christian and pagan fertility figure depicted in European carvings throughout the 12th to 17th centuries. [3] X Research source"
    },
    {
      "title": "The gate of life",
      "content": "The gate of life In much Christian art, the vesica piscis is used to depict the gate of life, or the portal between life and death or being and not being. It's often seen surrounding images of Jesus. In Christianity, the gate of life is distanced from the idea of the divine feminine or the birth canal and is more of a symbol of God’s glory and power."
    },
    {
      "title": "Ichthys symbol (\"Jesus fish\")",
      "content": "Ichthys symbol (\"Jesus fish\") A fish formed from a horizontal vesica piscis, with one side of each arch continuing to form a \"fishtail,\" has long been considered a symbol of Christianity. [4] X Research source The vesica piscis can be divided into 4 equal right triangles, the height and width of which may be expressed in the ratio 265:153. This ratio recalls the 153 fish Jesus helped his disciples catch in the Book of John—the origin of the Biblical fish symbol."
    },
    {
      "title": "The flower of life",
      "content": "The flower of life The flower of life is a 2D symbol constructed of 19 overlapping circles, with each overlap forming a vesica piscis. It is believed this floral shape contains all the shapes available in the natural universe; therefore, the flower of life often symbolizes the mysteries of the universe and the interconnectedness of everything. [5] X Research source"
    },
    {
      "title": "Symmetrical geometric lens",
      "content": "Symmetrical geometric lens In geometry, a lens is the shape that results from 2 circles overlapping each other, creating a shape with 2 points where the circle edges intersect and curved lines on either side. The vesica piscis is a special lens with perfect symmetry (the offset of the disk is equal to the radii of the circles). [6] X Research source"
    },
    {
      "title": "Sacred geometry",
      "content": "Sacred geometry In sacred geometry, curved lines are considered \"feminine\" and straight lines are \"masculine.\" The vesica piscis contains only curved lines; however, when the various points of intersection in the vesica piscis are connected to form straight lines, it results in the following infinite measurements, which are considered the numbers that constitute all life: √2 : The angle of the line extending from the center of the mandorla on one side to the top of the circle on the other side equals √2. The number √2 recalls the infinite binary sequence: 1, 2, 4, 8, 16, 32, 64, 128.... √3 : The ratio of the height of the mandorla to its width is √3. √3, or the infinite number 1.7320508..., forms the dimensions of the mandorla itself. It is also the angle of the diagonal of a 3-dimensional cube. Thus, √3 represents 3-dimensional space. √5 : The angle of the line extending from the top of one circle to the bottom of the other circle is √5. √5 is a number with which the Golden Ratio may be found. The Golden Ratio formula is 1 + √5 / 2. [7] X Research source The Golden Ratio is believed to provide the most aesthetically pleasing proportions and is used widely in art and architecture."
    },
    {
      "title": "Gothic religious architecture",
      "content": "Gothic religious architecture Because the mandorla is often used to symbolize the gate of heaven, it is seen throughout Orthodox Christian architecture—especially Gothic architecture. The vesica piscis can be seen in the arches, vaults, and windows of Gothic cathedrals. [8] X Research source"
    },
    {
      "title": "The Sphinx",
      "content": "The Sphinx Both the Egyptian Sphinx and the pyramids of Giza were constructed using the proportions of the vesica piscis."
    },
    {
      "title": "The Washington Monument",
      "content": "The Washington Monument The Washington Monument stands in the center of 2 great overlapping circles. The Washington Monument itself is an obelisk, an architectural structure typically associated with the male genitals. Thus, the Washington Monument is constructed of both male genitals and female genitals."
    },
    {
      "title": "St. Peter’s Square",
      "content": "St. Peter’s Square In the center of St. Peter’s Square in Vatican City is an ancient Egyptian obelisk. The obelisk stands in the center of a great vesica piscis."
    }
  ]
}