{
  "url": "https://www.wikihow.com/Use-Reflexology-for-Migraines",
  "title": "How to Treat Migraines: Can Reflexology Help?",
  "steps": [
    {
      "title": "Massage the tips of your toes to relax the frontal sinus.",
      "content": "Massage the tips of your toes to relax the frontal sinus. Sinus pain during a migraine can manifest on your forehead, between your eyes, or around your cheeks. The tips of all your toes correspond to your sinuses, so massage all of them equally if you feel sinus pain. [2] X Research source"
    },
    {
      "title": "Put pressure on the center of your big toes to send energy to your brain.",
      "content": "Put pressure on the center of your big toes to send energy to your brain. This is a small point on each of your big toes, right around the knuckle on each toe. Accessing these points could help relieve general pain around your head. [3] X Research source"
    },
    {
      "title": "Massage the tops of your big toes for facial pain.",
      "content": "Massage the tops of your big toes for facial pain. The rest of your big toes correspond with your nose, cerebellum, brain stem, and other parts of your face. If you feel pain in these areas, then focus on your big toes. [4] X Research source"
    },
    {
      "title": "Press between your middle and second toes for pain around your eyes.",
      "content": "Press between your middle and second toes for pain around your eyes. Pain around your eyes is very common during a migraine, so this spot can bring relief. Between your second toe (starting from your big toe) and your middle toe, there is a pressure point corresponding to your eyes. [5] X Research source Some reflexology maps show that this point also covers the bases of these toes. There’s some disagreement in the reflexology community about the specific locations of certain points, and this is an example. [6] X Research source"
    },
    {
      "title": "Massage below your big toes for pain in your neck.",
      "content": "Massage below your big toes for pain in your neck. If your migraine pain extends down your neck, there’s also a reflexology point for that. Massage the top of your feet, just below the knuckles on your big toes. [7] X Research source"
    },
    {
      "title": "Sit in a quiet, relaxing position.",
      "content": "Sit in a quiet, relaxing position. Reflexology is all about releasing tension, so getting comfortable is the best way to start. Find a quiet spot in your home where you won’t be disturbed. Sit on a couch, chair, or on the floor and get comfortable. [8] X Research source It’s also relaxing to turn the lights down. If you’d like to set a more relaxing mood, try lighting some scented candles. Try letting everyone in your home know not to bother you."
    },
    {
      "title": "Apply firm pressure with your fingers to each pressure point.",
      "content": "Apply firm pressure with your fingers to each pressure point. Pick the pressure points that correspond with the areas that you’re feeling pain in. Use your thumbs and fingertips to press each point. Apply as much pressure as you’re comfortable with. Then move your fingers in a circular motion to massage the points. [9] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source If you’re just starting out, use light pressure. Then gradually press harder in later sessions when you get used to the treatment. If you feel pain at any point, then you’re pressing too hard. The massage shouldn’t be painful."
    },
    {
      "title": "Massage each pressure point for 3-5 minutes.",
      "content": "Massage each pressure point for 3-5 minutes. There is no set time for a reflexology treatment, so you can practice it for as long as you want. Start out with rubbing each point for 3-5 minutes to see how you feel. You can adjust your touch or the amount of time in future sessions. [10] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "Let your body return to normal for 24 hours after the treatment.",
      "content": "Let your body return to normal for 24 hours after the treatment. After a reflexology treatment, your body might need some time to rebalance itself. You might experience some euphoria, fatigue or energy bursts, frequent bathroom trips, and heightened emotions. This is all normal and should pass within 24 hours. [11] X Research source You might feel thirstier than normal after a treatment, so drink plenty of water afterward. These symptoms are more common for full reflexology treatments from a professional. You might not experience many side effects from a home treatment."
    },
    {
      "title": "Repeat the treatment every few days if you have to.",
      "content": "Repeat the treatment every few days if you have to. If you have chronic migraines, then you can do reflexology repeatedly. When you’re first starting out, try doing 3 treatments per week with at least a day in between to see if this helps your migraines. [12] X Research source Don’t do a reflexology treatment every day. Your body needs around 24 hours to rebalance itself afterward."
    },
    {
      "title": "Find a reflexologist approved by the American Reflexology Certification Board.",
      "content": "Find a reflexologist approved by the American Reflexology Certification Board. This is the leading reflexology organization in the United States, and it oversees the certification process for reflexologists. Visit their website to find a skilled and approved reflexologist. Find their homepage at https://arcb.net/ . If you’re from a different country, find out if there is a similar professional organization in your country. This way, you’ll know you’re receiving a quality treatment. Don’t visit a reflexologist without the proper licensing and certifications."
    },
    {
      "title": "Tell the reflexologist about your migraines before the session.",
      "content": "Tell the reflexologist about your migraines before the session. Professional reflexologists will always have a consultation with you before your first session. This is so they can understand your problem and design a program that will treat it most effectively. Tell them about your migraines and any other pains you feel so they know which pressure points to access. [13] X Research source Feel free to ask any questions you might have during the opening consultation. Reflexologists are happy to explain the process more if you need them to. Expect the reflexologist to ask about your health and medical history. This is so they can make sure reflexology is right for you. For example, reflexologists won’t work on pregnant people because the process could induce labor."
    },
    {
      "title": "Lay back with your shoes and your socks off.",
      "content": "Lay back with your shoes and your socks off. You’ll remain fully clothed except for your shoes and socks. The reflexologist might gently wash your feet before starting the session. [14] X Research source Feel free to get into a comfortable position. Reflexology is all about relaxation."
    },
    {
      "title": "Relax for 30-60 minutes while the reflexologist works on you.",
      "content": "Relax for 30-60 minutes while the reflexologist works on you. This is how long an average reflexology appointment lasts. You don’t have to do much during the session. Simply lay back and let the reflexologist massage your pressure points. You can talk if you want to, or simply relax. [15] X Research source Tell the reflexologist what you’re feeling and if anything doesn’t feel right. They can always adjust their approach of you’re uncomfortable. It’s normal to feel some tingling, euphoria, or emotional release during a session. This is all part of energy moving to different parts of your body."
    },
    {
      "title": "Get up slowly when the session is done.",
      "content": "Get up slowly when the session is done. When the reflexologist finishes, they won’t tell you to get up right away. Your body will probably be very relaxed and you might feel unsteady if you get up too quickly. The reflexologist will advise you to sit or lay quietly for a few minutes to recover. When you feel up to it, then you can get up and go home. [16] X Research source It’s normal to feel very thirsty after a session, so the reflexologist will probably give you some water while you rest. The reflexologist might give you some tips to rest and relax in the 24 hours following the session."
    },
    {
      "title": "Schedule more appointments as often as the reflexologist recommends.",
      "content": "Schedule more appointments as often as the reflexologist recommends. You’ll probably need multiple sessions to feel the full benefits of reflexology. Talk to the reflexologist for a recommendation on how often you should come back. Commonly, they’ll suggest a weekly treatment for a few months, then less frequent tune-ups when you start feeling better. Follow their advice for the most effective treatment. [17] X Research source"
    }
  ]
}