{
  "url": "https://www.wikihow.com/Stretch-a-Ring",
  "title": "How to Stretch a Ring",
  "steps": [
    {
      "title": "Don’t stretch a ring with stones or an engraving.",
      "content": "Don’t stretch a ring with stones or an engraving. If you stretch a ring with stones on it at home, the stones might pop off. If your ring has a pattern engraved in it, the pattern might become misshapen as you stretch the ring. [1] X Research source If you can’t stretch your ring at home, consider getting it done professionally be a jeweler."
    },
    {
      "title": "Check the current size of your ring with a mandrel.",
      "content": "Check the current size of your ring with a mandrel. A ring mandrel is a tapered, metal rod with ring sizes marked on it that you can use to measure ring sizes. You can buy one at a hardware store or online. Simply slide the ring onto the mandrel. The bottom of the ring will line up with a marked number on the mandrel. [2] X Research source Consider getting a steel mandrel, because they are more versatile, and you can even use one to stretch your ring."
    },
    {
      "title": "Figure out your ring size using a ring sizer.",
      "content": "Figure out your ring size using a ring sizer. A ring sizer looks a bit like a ring of keys, except instead of keys, there are a metal rings in order of their size. They often come with a ring mandrel when you buy it. Try on the rings until you find the one that fits on your finger. The ring should slide on fairly easily and be a little hard to take off. [3] X Research source [4] X Expert Source Nicole Wegman Jewelry Professional & Founder of Ring Concierge Expert Interview. 23 April 2020. Note that it’s impossible to have a ring fit perfectly, because our fingers change size throughout the day based on temperature, exercise, and time of day. [5] X Research source A ring should fit snugly without making your finger bulge around it or leaving indent marks."
    },
    {
      "title": "Find your ring size",
      "content": "Find your ring size with paper and a conversion chart as an alternative. If you don’t have access to a ring sizer, you can also use measure around your finger with a strip of paper and mark the paper where it wraps. Then, measure the length of the paper with a ruler. Finding a conversion chart online to convert the measurement to ring size. [6] X Research source Make sure you find a conversion chart for your country, because different countries have different ring measurement systems. Fingers get smaller in the cold, so make sure you are warm before you size your finger."
    },
    {
      "title": "Stretch a ring up to ½ a size bigger.",
      "content": "Stretch a ring up to ½ a size bigger. If the difference between the current ring and the size you want it to be is more than ½ size, you should probably see the jeweler to help you. When you stretch a ring, you are making the metal thinner, so if you stretch it too much it will weaken the ring and could even break it. [7] X Research source Jewelers have other methods for enlarging rings that don’t thin the metal, such as cutting the ring open and adding metal. [8] X Research source"
    },
    {
      "title": "Slide the hollow bottom of the stretcher into the base.",
      "content": "Slide the hollow bottom of the stretcher into the base. Make sure you are working on a firm, hard surface like a concrete floor or sturdy metal table. Ring stretchers come with three basic parts: a nylon base which holds the tool and dampens hammering impact, a slotted, hollow mandrel, and the top pin, which you will hammer on. Slide the slotted, hollow part into the nylon base."
    },
    {
      "title": "Put the ring around the hollow mandrel and insert the pin.",
      "content": "Put the ring around the hollow mandrel and insert the pin. The ring should fit snugly around the metal surface of the hollow bottom part of the stretcher. Then, slide the top pin into the hollow interior of the bottom piece. The top pin is the part you will hammer, and it will push open the slotted part so that it evenly opens up your ring."
    },
    {
      "title": "Hammer the top of the stretcher gently with a rawhide hammer.",
      "content": "Hammer the top of the stretcher gently with a rawhide hammer. A rawhide hammer will be more gentle than a metal hammer. Hammer lightly, because you don’t want to overstretch your ring. It’s best to use many light taps, rather than a few hard taps, so that you can slowly expand the ring and you don’t accidentally enlarge it too much. You should be able to see the bottom of the ring stretcher opening slightly as you tap."
    },
    {
      "title": "Check the width of your ring and hammer again if necessary.",
      "content": "Check the width of your ring and hammer again if necessary. Take the ring out of the stretcher, and try it on your finger. You can also measure the new size on a ring mandrel. If it is the right size, you’re done. If it’s not wide enough, put it back on the ring stretcher and give it a few more taps. Remember, it’s easy to stretch your ring, but harder to shrink it , so stretch it in small increments."
    },
    {
      "title": "Slide the ring onto a steel mandrel.",
      "content": "Slide the ring onto a steel mandrel. You’ll need a steel mandrel, not a plastic one, because it needs to be able to withstand your hammer taps. Put the ring on the mandrel at the narrow end, and slide it down as far as it goes. Don’t force it on, because you’ll be pushing it down further with a hammer to stretch it. Right now, it can just sit in its natural position. [9] X Research source If you want a slightly more secure set up, get a bench pin which can secure your steel mandrel to your table, but you can also just hold the mandrel."
    },
    {
      "title": "Tap all the way around the ring with a rawhide hammer.",
      "content": "Tap all the way around the ring with a rawhide hammer. Tap the ring with the hammer at the top of the ring, not the side. Rotate the ring as you tap it, so that you are hitting all sides evenly. Stop when you’ve tapped a full circle around the ring. Use the same amount of pressure for each tap, so that your ring stays even. [10] X Research source Your hammer strokes should be parallel with the mandrel, so that you’re gently pushing the ring further down toward the thicker end of the mandrel. Don’t use a metal hammer for this, because it may dent and mar the surface of your ring."
    },
    {
      "title": "Flip the ring over and tap it on the other side.",
      "content": "Flip the ring over and tap it on the other side. Since the mandrel is tapered, if you only tap on one side of the ring, it will come out uneven. To adjust for this, remove the ring from the steel mandrel after you’ve tapped all the way around. Then, tap the top of the ring with the rawhide hammer, just as you did before. [11] X Research source Stop when you’ve gone all the way around once."
    },
    {
      "title": "Continue hammering and flipping the ring until it is the right size.",
      "content": "Continue hammering and flipping the ring until it is the right size. You may have to do this several times. Check how far the ring has slid down the mandrel after each round of hammering. Remember, you can always stretch it more, but it’s difficult to shrink a ring at home. If your ring is a little bit stuck on the mandrel when you’re trying to remove it, just tap it lightly in the other direction with your hammer until it loosens. [12] X Research source"
    }
  ]
}