{
  "url": "https://www.wikihow.com/Turn-Off-the-Android-Dialpad-Sounds",
  "title": "How to Turn Off the Android Dialpad Sounds",
  "steps": [
    {
      "title": "Open the settings menu.",
      "content": "Open the settings menu. Open up the apps drawer from the bottom of your home page (box made up of rows and columns smaller boxes), then find the Settings icon. Depending on your device, the Settings icon will differ. Try searching for \"settings\" by tapping on the magnifying glass icon in the upper right corner of your device's apps page. [1] X Research source"
    },
    {
      "title": "Select the \"Sound\" option for dealing with Android sounds.",
      "content": "Select the \"Sound\" option for dealing with Android sounds. Some devices may call this option \"Sound & notification.\" [2] X Research source"
    },
    {
      "title": "Turn off the dialpad sounds.",
      "content": "Turn off the dialpad sounds. Under the \"System\" header, tap the box that says \"Keypad touch tones\" or \"Dialpad touch tones.\" The exact phrasing differs slightly from device to device. Some devices may have multiple options after tapping the box. [3] X Research source Short tones: Each press on the dialpad will be a quick beep, similar to what you usually hear from a dialpad. Long tones: Each press on the dialpad will be a long beep, useful if you have trouble hearing the shorter beep. Off: As is expected, turns the dialpad sounds off entirely."
    },
    {
      "title": "Adjust the other screen press sounds.",
      "content": "Adjust the other screen press sounds. On the majority of Android devices, you can also adjust Touch sounds, Screen lock sounds, Pull-to-refresh sounds, and vibrate on touch Touch sounds: Will play a sound whenever you touch a screen. This is useful if you are having trouble telling when the device has registered your touch. Screen lock sounds: Will play sounds when you unlock and lock the screen. Useful if you are trying to unlock the screen without looking at it. Pull-to-refresh sounds: Will play a sound when you refresh feeds and content. You have likely seen these sorts of pull-to-refresh feeds on apps like Twitter, Facebook, or Snapchat. Whenever you pull down from the top of the screen to refresh content, you will hear a sound if this option is checked. Vibrate on touch: Your phone will vibrate when buttons, such as Home or Back, are pressed."
    },
    {
      "title": "Search through your settings.",
      "content": "Search through your settings. If you have trouble finding any of the above options, you can always just type in their name and have your phone automatically find them. Press the magnifying glass icon in the upper right corner of the setting window, then enter in your search term. The phone will only search through the Settings category currently displayed. For example, if you wanted to search through the options in the \"Display & gestures\" category, you would first have to be in the \"Display & gestures\" category."
    },
    {
      "title": "Set your ringer settings to Silent or Vibrate.",
      "content": "Set your ringer settings to Silent or Vibrate. By default, the dialpad sounds will be off if your phone is set to Vibrate or Silent. You can change this setting by using the volume button on the side of your device. [4] X Research source You can also set the phone to Silent or Vibrate by pulling the menu down from the top of the screen and changing it from the options listed in this menu."
    }
  ]
}