{
  "url": "https://www.wikihow.com/Use-ibis-Paint-X-to-Shade-Gacha-Characters",
  "title": "How to Use ibis Paint X to Shade Gacha Characters",
  "steps": [
    {
      "title": "Download the ibis Paint X app on your mobile device.",
      "content": "Download the ibis Paint X app on your mobile device. It works on any device, but for PC, you might use Krita or Medibang on PC. Once you have it downloaded, open the app. You are going to be sent to a webpage. Click Start Drawing . You can find this app on the App Store for iOS users or Google Play for Android users."
    },
    {
      "title": "Click the + Icon and then Import Picture to add your picture.",
      "content": "Click the + Icon and then Import Picture to add your picture. Choose your Gacha character picture. You can make your Gacha characters on apps like Gacha Life, Gachaverse, and Gacha Studio. You must have your character screen-shotted in a white screen if you might do a thumbnail."
    },
    {
      "title": "Crop if needed.",
      "content": "Crop if needed. When you add your picture, it might come up with a message asking you to resize the full image. Click \"recommended\", so the image is a better fit for your screen, and you don't miss out on any little details. Then click out on the next notification you get. It is not needed."
    },
    {
      "title": "Click on the circle icon on the bottom bar.",
      "content": "Click on the circle icon on the bottom bar. Then find \"Pen (Fade).\" This pen is critical for shading. If you do not have access to the Fade Pen, look for \"Airbrush (Trapezoid 40%)\". Any light/soft pen works, but the fade pen is the best choice. Never use any Difficult pens or the Digital Pen. They have too many pixels and aren't soft enough. If you have no choice, try lowering the opacity of the pen. If you decide to use a hard pen, lower the opacity to below 85%."
    },
    {
      "title": "Start drawing!",
      "content": "Start drawing! Hold the part you want to shade with your finger to copy the color. Then go to the color selector and make the color lighter or darker. You can do this by dragging the color pin around the area. This will add the shade effect to the image. You can see the black outline of the Gacha character. Just move a bit in the clothing and start there. If you see a white particle in their clothing that you don't like, try fixing it by tapping over it about 2-3 times on opacity 100."
    },
    {
      "title": "Shade softly.",
      "content": "Shade softly. If you shade too harshly, don't worry. There is an \"Undo\" button. The color you use depends on the area you are shading. Farther away from the head would make it a darker color. If you do not use the color that is in the area (for example, if you shade with red on a blue area), it will block it out a little. This makes it look sloppy and faded."
    },
    {
      "title": "Use the eraser to add highlights.",
      "content": "Use the eraser to add highlights. The eraser is good for making shines on the hair, or anywhere else you want to shine. You can usually use the ruler to make your highlights straight. If you do not want to use the eraser, select a brush. Get a white color and select an airbrush that's lower than 60%. If you decide to use the ruler, align it correctly. The ruler will go into the outlines of the character. Just adjust it to your liking."
    },
    {
      "title": "Use the blur tool (optional) after shading.",
      "content": "Use the blur tool (optional) after shading. The blur tool can be a bit annoying to use, but you can use it to smudge to blend your shading to give it more of a realistic look. Another trick to blending is copying and pasting the color you had and then making it lighter or darker (depending on where you shaded)."
    },
    {
      "title": "Click out of the picture when you are finished.",
      "content": "Click out of the picture when you are finished. You can do this by clicking the button on the bottom-right corner of your screen. This can also be used as a \"Save\" button. Use it anytime you need to save your edit. If you accidentally make a mistake and click it, the mistake will be saved. Unless you can erase it without damaging your edit, it is permanent and cannot be undone."
    },
    {
      "title": "Use your image!",
      "content": "Use your image! You can go back to the image and make any changes if you like. The image is going to be stored in your ibis Paint x folder. You can click the circle with the \"i\" on it (info button) to change the name and other information. In the info tab, you can also upload your image if you have a Twitter/Facebook account. Those are the only apps that can be linked to the app."
    }
  ]
}