{
  "url": "https://www.wikihow.com/Use-Dyson-Attachments",
  "title": "How to Use the Attachments for Corded & Cordless Dyson Vacuums",
  "steps": [
    {
      "title": "Choose the crevice tool to vacuum corners and hard-to-reach spots.",
      "content": "Choose the crevice tool to vacuum corners and hard-to-reach spots. The crevice tool is long and thin with a 45° opening at the end of the attachment. The small, angular opening makes it easy to clean narrow crevices and tight spots, like behind furniture, between couch cushions, and under car seats. [1] X Research source When using the crevice tool, hold the angled opening directly against the surface you’re cleaning. The crevice tool is safe to use on fabric, wood, metal, or stone. However, other tools might do a better job of cleaning dirt out of fabric."
    },
    {
      "title": "Use the soft dusting brush to clean blinds and other delicate surfaces.",
      "content": "Use the soft dusting brush to clean blinds and other delicate surfaces. The soft dusting brush is a cylindrical shaped tool surrounded by flexible nylon bristles. This allows the brush to gently remove dirt and light debris on delicate surfaces like blinds, drapes, lampshades, keyboards, mirrors, and tapestries. It’s also perfect for dusting hard surfaces in your home and car. [2] X Research source There is also a mini soft dusting brush which is great for cleaning smaller areas. Dyson also makes a scratch-free dusting brush for more sensitive surfaces like computer and TV screens. It has a smaller, softer brush. [3] X Research source To clean the brush, run it under water and let it air dry."
    },
    {
      "title": "Opt for the tangle-free turbine tool to sweep up hair on upholstery.",
      "content": "Opt for the tangle-free turbine tool to sweep up hair on upholstery. The tangle-free turbine tool is a flat, rectangular attachment with 2 spinning brush heads. These rotating brushes help prevent hair from getting caught in the tool as you sweep it back and forth over carpets, rugs, pet beds, upholstered furniture, and other fabric surfaces. [4] X Research source"
    },
    {
      "title": "Use the combination tool to easily vacuum hard and soft surfaces.",
      "content": "Use the combination tool to easily vacuum hard and soft surfaces. The combination tool has a wide nozzle and retractable brush, making it a blend of the crevice and brush attachments. This allows you to easily switch between the tools to vacuum a wide variety of surfaces during a single cleaning session. [5] X Research source Simply slide the brush up to clean narrow spaces with the nozzle. Then, slide the brush over the nozzle to vacuum upholstery and delicate surfaces."
    },
    {
      "title": "Pick the articulating or flat out floor tool to clean hard surfaces.",
      "content": "Pick the articulating or flat out floor tool to clean hard surfaces. Both the articulating floor tool and the flat out floor tool have slim designs for cleaning under furniture and appliances. The articulating floor is best for cleaning hard surfaces like wood and tile, as it has soft nylon brushes to pick up dirt and dust and easily bends to maintain suction on uneven ground. [6] X Research source The flat out floor tool works similarly to the articulating floor tool, though it cleans both carpet and hard surfaces well. [7] X Research source Dyson advertises that the articulating floor tool works well on carpets, but the nylon brush may not work well on thin or sensitive rugs."
    },
    {
      "title": "Select the stair tool to clean carpeted stairs and hard-to-reach spots.",
      "content": "Select the stair tool to clean carpeted stairs and hard-to-reach spots. Dyson’s stair tool attachment has a wide but narrow opening that helps it sweep up hair and dirt on carpeted surfaces that are more difficult to get to. This makes it perfect for vacuuming stairs and tight corners. [8] X Research source"
    },
    {
      "title": "Add the extension hose to increase the reach of any Dyson attachment.",
      "content": "Add the extension hose to increase the reach of any Dyson attachment. The extension hose snaps directly into your corded or cordless vacuum to give you an additional 22 to 24 inches (55-61 cm) of reach. It is compatible with every Dyson attachment, allowing you to clean high, low, and hard-to-reach spaces in your home and car. [9] X Research source"
    },
    {
      "title": "Select the stubborn dirt brush to clean ground in dirt and dried mud.",
      "content": "Select the stubborn dirt brush to clean ground in dirt and dried mud. The stubborn dirt brush is a small attachment surrounded by stiff, tightly packed bristles. The hard bristles easily pick up dirt, mud, and other debris crushed into carpets, rugs, car floor covers, and door mats. [10] X Research source Simply scrub the brush back and forth over the dirty area to vacuum up the debris. The bristles are very durable, so you can use more force with this tool."
    },
    {
      "title": "Use the mattress tool to absorb dust on mattresses and upholstery.",
      "content": "Use the mattress tool to absorb dust on mattresses and upholstery. The mattress tool looks like a plastic triangle that dips down at a 45° angle away from your Dyson’s wand. It is specifically designed to gently vacuum up dust mites on your mattress without damaging it. You can also use the tool to clean other soft, pliable surfaces, like fluffy sofas and pillows. [11] X Research source To use the mattress tool, press and drag it into the surface you’re cleaning to remove deeply embedded dirt and dust. The mattress tool is certified as asthma and allergy-friendly because it lifts hard-to-reach allergens out of surfaces that you commonly lay or sit on."
    },
    {
      "title": "Choose the hair screw tool to clean long hair, pet hair, and dander.",
      "content": "Choose the hair screw tool to clean long hair, pet hair, and dander. The hair screw tool has a motorized, conical brush that helps vacuum up hair without causing tangles and clogs. Its brush is also made to clean dander and dust mites, helping to remove allergens. Just use the hair screw tool to clean difficult-to-reach areas, like couch cushions, pet beds, and carpets. [12] X Research source The hair screw tool works well on all surfaces, from carpet to wood."
    },
    {
      "title": "Select the pet grooming tool to brush your furry friends.",
      "content": "Select the pet grooming tool to brush your furry friends . The pet grooming tool is a small, round attachment with a comb and a filter on it. Simply use the comb to gently brush your pet’s fur while vacuuming up loose hair, dirt, or dust. The filter catches any thick clumps of fur, making them easy to pull off once you’re done grooming your pet. [13] X Research source The grooming tool is probably best suited for dogs, since cats tend to be harder to groom. Always brush a pet by combing away from their head."
    },
    {
      "title": "Add the mini motor head to powerfully sweep small areas of upholstery.",
      "content": "Add the mini motor head to powerfully sweep small areas of upholstery. The mini motorized head is simply a smaller version of your Dyson’s brush head bar. This gives you the same power and suction to clean in tight, hard-to-reach areas. So, use the tool to vacuum tough spots of dirt and debris on car seats, furniture, and carpeted stairs. [14] X Research source"
    },
    {
      "title": "Use the wide nozzle tool to vacuum dirt and debris on upholstery.",
      "content": "Use the wide nozzle tool to vacuum dirt and debris on upholstery. Dyson’s wide nozzle tool is a triangular attachment with a wide but narrow opening. Attach this tool to clean up dirt, dust, and large pieces of debris on upholstered furniture, carpets and rugs, and your mattress. [15] X Research source"
    },
    {
      "title": "Select the flexi crevice tool to clean narrow spaces and odd angles.",
      "content": "Select the flexi crevice tool to clean narrow spaces and odd angles. The flexi crevice tool has a soft brush head and retractable rubber arm that allows it to bend and fit into awkward gaps and super small spaces. Use the tool to clean dust and debris on both hard and upholstered surfaces, like behind furniture and appliances and between car seats and accessories. [16] X Research source To extend the flexi crevice tool, press the button on the side of the attachment. Then, pull out the rubber arm. [17] X Research source"
    },
    {
      "title": "Use the up top adaptor to remove dust in high places.",
      "content": "Use the up top adaptor to remove dust in high places. The up top adaptor is a hook-shaped tool that bends from 0° to up to 130°, allowing you to reach tall surfaces that are flat or angled. Simply snap any Dyson tool onto the adaptor, like the soft dusting brush, and sweep up dust and dirt on top of cabinets, shelves, doors, light fixtures, and fans. [18] X Research source The adaptor also has locking capabilities to keep the tool at a certain angle as you clean, including 0°, 65°, and 97.5°."
    },
    {
      "title": "Add on the low reach adaptor to easily vacuum under furniture.",
      "content": "Add on the low reach adaptor to easily vacuum under furniture. Dyson’s low reach adaptor is another hook-shaped tool that bends between 0° to 90°, extending the brush head bar’s reach to super low areas. Use the tool to clean dirt, dust, and debris under couches, beds, appliances, and other pieces of furniture. [19] X Research source"
    },
    {
      "title": "Pick the multi-angle brush to dust hard-to-reach areas.",
      "content": "Pick the multi-angle brush to dust hard-to-reach areas. The multi-angle brush consists of a moderately soft brush head attached to a clear, adjustable tube. Twisting the brush head rotates the tool at different angles, allowing you to clean odd corners and high areas. So, use the multi-angle brush to kick dirt off of baseboards, molding, cabinets, bookcases, and carpets under furniture. [20] X Research source Use the multi-angle brush to dust delicate surfaces too, like shaded light fixtures. Clean the multi-angle brush by running the bristles under warm water and letting it air dry."
    },
    {
      "title": "Use the reach under tool to deep clean tiny, narrow spaces.",
      "content": "Use the reach under tool to deep clean tiny, narrow spaces. The reach under tool is made up of a long, thin wand with a retractable rubber arm and a flat paddle with soft, L-shaped bristles. The rubber arm allows the tool to bend while the flat paddle fits between super small gaps. Just use the reach under tool to dust and remove debris in your car, under appliances, between radiator and AC units, and inside air vents. [21] X Research source To extend the rubber arm, press the red button at the end of the attachment. The reach under tool was made for newer Dyson models, so older vacuums need an adaptor to fit it on the machine."
    },
    {
      "title": "Turn off the vacuum before changing attachments.",
      "content": "Turn off the vacuum before changing attachments. Unplug your corded Dyson vacuum or switch off your cordless vacuum before removing the wand and attaching anything to the vacuum or hose. If the vacuum is running when you detach the handle or hose, it might fly all over the place or knock something over. [22] X Research source The wand is the thin pole extending out of the handle on corded vacuums and out of the clear bin and main body on cordless vacuums."
    },
    {
      "title": "Press the red button at the base of the handle to release the wand.",
      "content": "Press the red button at the base of the handle to release the wand. If you have an upright vacuum, press the red button on the back of the machine where the wand meets the frame of the vacuum. This releases the wand and the hose at the same time. Lift the wand out of the vacuum by pulling the handle directly up. Then, pull the hose out with your other hand. [23] X Research source The hose is attached to the bracket with the red button on it. Simply lift the entire piece out of the vacuum to extend the hose. On cordless vacuums , press the red button on the end of the wand to remove the brush bar or other tool attached to the wand. [24] X Research source"
    },
    {
      "title": "Flip the plastic cover at the top of the handle.",
      "content": "Flip the plastic cover at the top of the handle. On the top of the corded vacuum’s handle, there is a plastic cover. Flip this cover up to reveal the opening. Your hose slides into this opening to connect your wand. [25] X Research source"
    },
    {
      "title": "Slide the hose into the handle until you hear a clicking sound.",
      "content": "Slide the hose into the handle until you hear a clicking sound. Turn your wand around so that the handle is facing the hose and slide the hose into the opening at the top of the handle. Once the hose and wand click into place, they are locked together. [26] X Research source Turning on your vacuum when the wand is connected to the hose automatically pulls air through the hose instead of the head of the vacuum. Dyson attachments can attach directly to a corded vacuum’s hose or directly into a cordless machine. So, if you don’t need the wand’s extra length, simply slide your tool onto the end of the hose or vacuum."
    },
    {
      "title": "Slide your desired attachment onto the end of the wand.",
      "content": "Slide your desired attachment onto the end of the wand. To add any Dyson attachment to the wand, simply slide the opening of the tool over the end of the wand. Just rotate the attachment as needed to secure it. You don’t typically hear a click when the tool attaches to the wand on corded vacuums, while most cordless vacuums make a click to let you know the attachment is secure. [27] X Research source When attaching a tool directly onto a corded vacuum’s hose, you typically hear a click. [28] X Research source"
    },
    {
      "title": "Press the red button again to remove the wand and reset your vacuum.",
      "content": "Press the red button again to remove the wand and reset your vacuum. When you’ve finished using an attachment on your corded vacuum, turn off your machine and pull off the tool. Then, press the same red button that you originally pressed to unlock the hose from the handle. Slide the hose back into the corresponding slot on your vacuum and flip the wand around again to reinsert your handle. [29] X Research source The attachment slides off of the end of your wand if you apply a little pressure. On cordless vacuums , turn off the machine. Then, press the red button at the top of the attachment to remove it from the wand or vacuum."
    }
  ]
}