{
  "url": "https://www.wikihow.com/What-Is-Selvedge-Denim",
  "title": "What Is Selvedge Denim?",
  "steps": [
    {
      "title": "Selvedge denim is denim with naturally finished edges.",
      "content": "Selvedge denim is denim with naturally finished edges. To make selvedge denim, a shuttle loom passes a “shuttle,” or a sort of loaded bobbin, through parallel threads to weave the denim fabric. As it goes back and forth, it crosses back on itself to secure any loose threads, creating a “self edge,” or edges that are naturally bound and finished by the weaving process itself. [1] X Research source The shuttle weaves the “weft,” or the lighter, whitish fabric, through the stationary “shed,” or the hallmark blue fabric, to create a panel of denim. Modern, or standard denim, on the other hand, is made on a projectile loom, which weaves individual threads together, leaving loose threads at the ends. These are then secured in place with an additional overlock stitch."
    },
    {
      "title": "Selvedge denim has a distinctive colored stripe under the hem.",
      "content": "Selvedge denim has a distinctive colored stripe under the hem. Turn up the hem of your jeans and look for the vertical seam where the fabric panels are joined. If your jeans are selvedge denim, spotting this will be easy—this white seam will be narrow and marked with a colored stripe that’s usually red or orange. [2] X Research source This is the finished edge of the fabric—the self edge itself."
    },
    {
      "title": "Selvedge denim is more durable, and more expensive, than other denim.",
      "content": "Selvedge denim is more durable, and more expensive, than other denim. Because the edges of selvedge denim are naturally woven and secured into the fabric itself, selvedge denim is often much more durable than other types. It’s also said to fade more naturally and elegantly, and to conform to your body over time, making for a more personalized and comfortable fit. [3] X Research source Many types of denim made today are made with “projectile looms,” which produce the material one weft thread at a time, leaving loose threads that are fastened after the fabric panel is made. [4] X Research source"
    },
    {
      "title": "Selvedge denim takes much more labor to manufacture.",
      "content": "Selvedge denim takes much more labor to manufacture. Unlike modern, standard denim, selvedge denim is woven on specialty looms that are often old, and which take much more human involvement to operate. They also produce narrower lengths of fabric, meaning more labor is needed to produce enough fabric for a single pair of jeans. [5] X Research source All that labor doesn’t come cheap!"
    },
    {
      "title": "Raw denim is denim that hasn’t been washed by the producer.",
      "content": "Raw denim is denim that hasn’t been washed by the producer. Most selvedge denim is raw, which just means the denim hasn’t been washed before you wear it, and is said to make the denim more durable and form-fitting. [6] X Research source It’s valued for the graceful way it ages and fades, and holds the shape of your body the longer you wear it. [7] X Research source Raw denim can be washed as usual, but be prepared for it to shrink 1-2 sizes after that first wash."
    },
    {
      "title": "Selvedge denim was the original denim manufacturing method.",
      "content": "Selvedge denim was the original denim manufacturing method. The history of selvedge is the history of denim. When denim was first being manufactured in America by producers like Levi Strauss back in the 19th century, they used now-traditional shuttle looms to do so, which gave the denim that iconic selvedge we covet today. [8] X Research source Cone Mills Denim in Greensboro, North Carolina, which opened in 1905, was the epicenter of America’s denim production, and was where many producers filed patents for denim."
    },
    {
      "title": "American selvedge began to disappear as denim demand soared.",
      "content": "American selvedge began to disappear as denim demand soared. Traditional methods of weaving denim are neither cheap nor quick, so as denim became wildly popular after WWII, producers turned to other weaving methods to meet demand, and selvedge denim began to disappear. [9] X Research source The Cone Mills denim factory shuttered in 2017, marking an end to 112 years of selvedge production and, in many ways, the end of an era."
    },
    {
      "title": "Japanese producers kept selvedge alive.",
      "content": "Japanese producers kept selvedge alive. While selvedge production dropped off in America, a number of Japanese producers procured their own shuttle looms and began to make their own selvedge denim. Now, Japan is one of the largest producers of selvedge denim, and Japanese producers have their own processes and hallmarks, and are known for their meticulous eye for detail and quality. [10] X Research source In comparison to American selvedge, Japanese selvedge is somewhat rougher and thicker, and is famous for often being hand-dyed with indigo, a costly and labor-intensive process. Some popular Japanese producers include Kurabo, Kuroki, Kaihara, and Toyoshima, among others."
    },
    {
      "title": "Budget brands",
      "content": "Budget brands If money’s tight, but you still want that signature quality and durability of selvedge, Uniqlo’s a top pick. The Unbranded Brand also makes quality selvedge, which is made with many of the same materials as designer brands, but priced much lower due to remote manufacturing. Other budget brands include: Edwin Old Blue Co. Sage Denim Levi’s"
    },
    {
      "title": "High-end brands",
      "content": "High-end brands You get what you pay for, and that’s true of selvedge denim, too. If you’re a little more experienced with selvedge and know what you want, and what you like, then you might spring for something a little more pricey, which tends to last even longer. Some choice brands include: A.P.C. &Sons Kurabo Nudie"
    }
  ]
}