{
  "url": "https://www.wikihow.com/Smoke-Dabs",
  "title": "How to Smoke Dabs (Even Without a Dab Rig)",
  "steps": [
    {
      "title": "Add water to your rig and get familiar with its parts.",
      "content": "Add water to your rig and get familiar with its parts. First, add water to the main chamber of your rig, just like you would when smoking a bong—enough to mostly cover the downstem. The most important part of the rig is the nail , which is where the wax is placed and heated. The carb cap goes over the nail after the nail is heated so that smoke goes into the rest of the rig and can be inhaled. [1] X Research source Many dab rigs are essentially just like standard bongs, but instead of a bowl they have a dab nail. The rig’s base or central chamber holds water and transports vapor. The rig’s downstem protrudes down into the chamber, funneling smoke downward. The mouthpiece is the top opening, where you’ll inhale the vapor."
    },
    {
      "title": "Portion out about 0.02 g of wax.",
      "content": "Portion out about 0.02 g of wax. A little goes a long way! Use a metal tool, like a quarter teaspoon or a dabber , to scoop out an amount of wax that’s as large as half a grain of rice. [2] X Research source Set the wax aside for now, while you get the rest of your rig ready. Once you have some experience, feel free to use a little more. For now, start small and see where it gets you."
    },
    {
      "title": "Attach your nail to your dab rig.",
      "content": "Attach your nail to your dab rig. This will look a bit different based on what kind of rig you have (and they come in all shapes and sizes). No matter your rig, though, insert or attach the nail to the rig. [3] X Research source On a standard bong-type rig, the nail simply replaces the bowl. Make sure it’s secure!"
    },
    {
      "title": "Heat up the nail with a butane torch.",
      "content": "Heat up the nail with a butane torch. Hold your torch to the bottom of the nail, aiming it so that the flame just grazes the nail’s bowl. Focus the heat on where you plan to place the wax—in a corner is often best. Heat the nail until it glows red hot, then remove the heat and let it cool for about 30-60 seconds. Otherwise, it’ll be too hot, and you’ll cough up a storm. [4] X Research source It may take up to 20-30 seconds to fully heat the nail. It helps to use an infrared thermometer to make sure the nail reaches 500–700 °F (260–371 °C), but it’s not totally necessary. Pros often recommend butane torches, since they burn hotter and cleaner than other heat sources, like standard lighters, which may not be able to get hot enough, depending on your rig."
    },
    {
      "title": "Place the dab into the nail.",
      "content": "Place the dab into the nail. Carefully take the portion of wax you set aside and lower it into the nail. This is where a dabber comes in handy. Make sure to place the dab directly onto the part of the nail where you focused the heat, so it burns properly. Swirl the nail so that the wax melts evenly. [5] X Research source"
    },
    {
      "title": "Cover the nail with a carb cap and inhale from the mouthpiece.",
      "content": "Cover the nail with a carb cap and inhale from the mouthpiece. Once the dab is in the nail, cover the nail with the carb cap so the vapors don’t escape. Then, place your mouth on the rig’s mouthpiece and inhale slowly, for just 2-3 seconds. As you do, briefly remove the nail, then replace, to provide airflow into the rig. Pull away, then exhale. [6] X Research source Take 1-2 more hits, then stop to see how you feel. If 2 hours pass and you feel nothing, feel free to take 1-2 more hits. You’ll probably feel the effects almost instantly. Note that your high can last anywhere from half an hour to several hours, depending on your tolerance."
    },
    {
      "title": "Wash out the nail with a cotton swab and dish soap.",
      "content": "Wash out the nail with a cotton swab and dish soap. It’s important to keep your nail tidy, otherwise you’ll be inhaling old or contaminated wax. Simply wipe the cooled nail with a damp cotton swab. [7] X Research source A little dish soap usually takes care of any stubborn residue. Also clean your rig as you would clean a bong . Again, warm water and dish soap go a long way."
    },
    {
      "title": "Fill the rig’s main chamber with cool water.",
      "content": "Fill the rig’s main chamber with cool water. Just like with a bong, you’ll want water in your rig to help cool the smoke as you inhale. Fill your rig so that the water mostly covers the downstem. [8] X Research source Filling it to about ¾ of the way up the downstem is typical. Electric rigs, or e-rigs, eliminate the need for an open flame, making dabbing safer and more convenient."
    },
    {
      "title": "Turn on the rig and set your temperature.",
      "content": "Turn on the rig and set your temperature. Power on your rig. Then, use the buttons and display to set a temperature of about 750 °F (399 °C) degrees. [9] X Research source Consult your owner’s manual for operating instructions, since this varies by model. Some dabs indicate their required temperature on their packaging. Typically, use a higher temperature for a larger dab."
    },
    {
      "title": "Set about 0.02 g of dab into the nail.",
      "content": "Set about 0.02 g of dab into the nail. Start small. Use a dabber or another metal tool to portion out an amount of concentrate that’s about a quarter the size of a pea. Then, set the concentrate into the nail, taking care not burn yourself on the hot rig. [10] X Research source"
    },
    {
      "title": "Place the carb cap on the nail and inhale from the mouthpiece.",
      "content": "Place the carb cap on the nail and inhale from the mouthpiece. The carb cap goes over the nail to trap the vapors. Once it’s on, slowly inhale from the mouthpiece for about 2-3 seconds, lifting the carb cap so that air can flow through the rig. Then breathe out, and enjoy the effects. [11] X Research source Take 1-2 more hits, then stop to see how you feel. If 2 hours pass and you feel nothing, feel free to take 1-2 more hits. You’ll usually feel the effects almost instantly. Note that your high can last anywhere from half an hour to several hours, depending on your tolerance."
    },
    {
      "title": "Wash out the nail with a cotton swab and dish soap.",
      "content": "Wash out the nail with a cotton swab and dish soap. It’s important to keep your nail tidy, otherwise you’ll be inhaling old or contaminated wax. Simply wipe the cooled nail with a damp cotton swab. [12] X Research source A little dish soap usually takes care of any stubborn residue. Also clean your rig as you would clean a bong. Again, warm water and dish soap go a long way. Make sure to follow any cleaning instructions included in your rig’s packaging. E-rigs tend to be a bit more particular."
    },
    {
      "title": "Standard bong",
      "content": "Standard bong We’ve mentioned it already, but standard bongs are in many ways identical to dab rigs. You just need a dab nail that fits your bong, then swap the nail for the bong’s bowl, and you’re good to go. They work much the same way: just follow the instructions above. [13] X Research source While using a bong , you might choose to add a healthstone—a porous piece of glass—to the bottom of the bowl. This makes it so you don’t have to wait for the dab to cool. There are also healthstone dab rigs that come in bong and pipe form, making dabbing simpler."
    },
    {
      "title": "Standard pipe",
      "content": "Standard pipe The same principle applies to a pipe. Just pack a half bowl of ground cannabis, add a bit of dab, then cover it with more herb. Afterward, just light up and smoke the bowl as usual. [14] X Research source Use a lighter to light the herb while you inhale and cover the airhole with your finger, then keep inhaling as you uncover the airhole."
    },
    {
      "title": "Dab joint",
      "content": "Dab joint You can roll dab wax into a joint to make a simple dab joint! Lay the rolling paper flat and add a few pinches of ground flower in a line near one edge. Then, spread a pea-sized amount of wax over the flower. Roll the joint as tight as you can, sealing it with a lick like sealing an envelope. Then light up! [15] X Research source"
    },
    {
      "title": "Vape pen",
      "content": "Vape pen You can place dab wax into portable vaporizers, but it’s not the easiest method. For one, you need to be able to open the vape. Then, you need a vape where the heating element and the cartridge are separate, which most modern vapes don’t have. If your vape fits those requirements, though, it’s as easy as filling the cart with the dab and vaping as usual. [16] X Research source Most vapes are prefilled with extract or wax. In fact, when you vape cannabis, you’re already hitting a dab."
    },
    {
      "title": "Glass straw",
      "content": "Glass straw Glass straw pipes are another simple method. Just use a butane torch to heat one end of the straw until it’s red-hot, then carefully place a bit of dab inside the hot end. Hold the straw with oven-mitts, then inhale through the opposite end of the straw. [17] X Research source"
    },
    {
      "title": "Hot knives",
      "content": "Hot knives This is for the real DIY-ers out there, and we don’t recommend it, but it’s a classic trick. Heat the tips of 2 metal butter knives with a butane torch until they’re red-hot. Then place your dab on the hot tip of one knife, and sandwich the other hot knife tip on top. Then, place a plastic bottle with the bottom cut off over the knives and inhale through the bottle’s nozzle. [18] X Research source . This method is pretty wasteful, as plenty of vapor escapes from the dab unsmoked, and also dangerous, for obvious reasons."
    },
    {
      "title": "Edibles",
      "content": "Edibles Making edibles out of dabs is a popular (and tasty) method. It’s a little complex, but you’ll essentially heat up the dab on the stove to decarb it and make the THC accessible. Then, just add 2-3 pea-sized amounts of dab to 1 cup (227 g) of butter or oil, and use the oil in your cooking. [19] X Research source"
    },
    {
      "title": "A dab is a highly concentrated form of cannabis.",
      "content": "A dab is a highly concentrated form of cannabis. To make dabs, marijuana containing THC is extracted into a highly concentrated form, and this concentrate is known as the “dab.” Dabs are superheated using some sort of tool—the “dab rig”—and then inhaled as a vapor, just like standard weed. [20] X Research source Many extracts are made by pouring butane over the cannabis flower, which pulls the THC from the plant. [21] X Research source There are lots of different ways to do dabs, both with and without a proper dab rig. All you really need is some heat to burn the wax."
    },
    {
      "title": "Dabs come in many shapes and forms.",
      "content": "Dabs come in many shapes and forms. All dabs are extracted and concentrated THC, but they come in many different varieties. They’re all used the same way, and at the end of the day, which kind you use comes down to personal preference: [22] X Research source Wax is the standard kind. It’s thick, lumpy, and sticky, but not totally liquid. Oil is the liquid form, and is what you find in many vape pens. Shatter is like hard candy, and is made by drying and breaking wax. Since it’s solid, it’s a little more convenient to work with. Cured sugar is granulated wax. Like shatter, it’s a little easier to handle. Rosin is wax made without a solvent, meaning it’s much more potent than other forms of dab."
    },
    {
      "title": "Dabbing is often more potent than other forms of weed.",
      "content": "Dabbing is often more potent than other forms of weed. Dabbing is popular because it often results in a quicker and more intense high. [23] X Research source It can also be a bit more convenient, since you can do dabs using vape pens or other similar devices, and since you don’t have to spend time grinding or packing your weed. Since it’s more potent, the effects of the high are often more severe, so it’s important to smart small! Some say that dabs are better for your lungs than burning marijuana flower, but no form of smoking is ever good for your airways. [24] X Research source"
    },
    {
      "title": "Dabbing is said to produce fewer carcinogens.",
      "content": "Dabbing is said to produce fewer carcinogens. Carcinogens are cancer-causing molecules. Since dabbing produces much less smoke than using a bong, pipe, or smoking joints, many claim that it’s healthier for you and your lungs. [25] X Research source That said, no form of smoking is ever healthy, and research is still ongoing."
    },
    {
      "title": "Dabbing is easier to enjoy and tastes better.",
      "content": "Dabbing is easier to enjoy and tastes better. Many dabs waxes are flavored, and that flavor is super noticeable when you do a dab. And since there’s less smoke, it leaves less of a stale feeling in your mouth compared to ground flower. This makes it much easier to enjoy. [26] X Research source"
    },
    {
      "title": "Dabs can make you green out more easily.",
      "content": "Dabs can make you green out more easily. Greening out is when you get too high, too fast, and become disoriented, anxious, or just have a plain bad time. Since dabs are super potent, it’s easy to green out , which isn’t great for your nerves, or your relaxation time. [27] X Research source"
    },
    {
      "title": "Dabs may still cause health complications.",
      "content": "Dabs may still cause health complications. Dabbing may be safer than other forms of smoking, but as with any form of smoking, it’s not exactly healthy. Dabbing still involves inhaling heated vapors, which can lead to damage to your lungs or airways. Those vapors also contain carcinogens, and may lead to cancer. [28] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    }
  ]
}