{
  "url": "https://www.wikihow.com/Soothe-a-Gassy-Baby",
  "title": "How to Soothe a Gassy Baby",
  "steps": [
    {
      "title": "Give your baby a tummy rub.",
      "content": "Give your baby a tummy rub. Rub gently in slow, clockwise circles. Your touch will help comfort the baby and move the gas along through the intestines. [1] X Research source The intestines work in a clockwise direction, so that is the best direction in which to rub. Don’t press hard. It shouldn’t be painful for the baby."
    },
    {
      "title": "Change your baby’s position.",
      "content": "Change your baby’s position. If air bubbles are stuck in your baby’s intestines, changing your baby's position can help them to become unstuck, and help your baby to pass them. [2] X Research source If your baby was lying down, pick her up and hold her so she is sitting upright. You can walk around a bit. The movement may help the gas to move through her system. Hold your baby in the football position with her stomach down. Some babies enjoy this position and the movement may free the trapped gas. Place her facing downward with her belly across your lap. Gently move your legs to massage her abdomen. This slight pressure may help move the gas. You can also gently rub her back."
    },
    {
      "title": "Lay your baby on her back and pedal her legs in the air as if she’s riding a bike.",
      "content": "Lay your baby on her back and pedal her legs in the air as if she’s riding a bike. If your baby’s belly is hard and bloated with gas, she may already be fidgeting, waving her arms, and kicking her legs. [3] X Research source The movement may help get bubbles unstuck and move them through the intestines, so your baby can pass them naturally. If your baby resists and does not want to have you pedal her legs, don’t force her."
    },
    {
      "title": "Try movement.",
      "content": "Try movement. Movement will be comforting to the baby and may help her relax and pass the gas. There are several options: [4] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Rock the baby. Hold the baby in your arms and rock her back and forth. You can also try singing softly. Try putting her in her car seat and going for a short drive around the block. The change of scenery and soft background noise of the motor may soothe her and cause her to fall asleep even though she’s gassy. Put the baby in the stroller and go for a walk around the block. The movement and gentle bouncing of the stroller may help her to pass the gas."
    },
    {
      "title": "Ask your doctor about over-the-counter medications for gas.",
      "content": "Ask your doctor about over-the-counter medications for gas. Though there are medications made especially for babies with gas, it is generally a good idea to discuss them with your doctor, to make sure that they will be okay for your baby. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Babies who need thyroid replacement medications should not take these medications. Over-the-counter medications usually contain simethicone (St. Joseph Baby Infants’ Gas Relief, Infants’ Mylicon Gas Relief) Read and follow the manufacturer’s instructions."
    },
    {
      "title": "Discuss probiotics with your doctor.",
      "content": "Discuss probiotics with your doctor. Probiotics are supplements that are supposed to help people develop and maintain healthy communities of bacteria in their digestive tract. When the balance of bacteria is not right, it can lead to digestive problems, including gas. But the scientific evidence for giving it to babies is mixed and many doctors do not recommend it. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Some studies have found that probiotics decrease colic in babies. If your baby is crying because of gas due to colic, the probiotics may help the colic and, by extension, the gas. But other studies have not found them to be helpful. Your doctor will be able to give you recommendations based on the latest scientific evidence and your baby’s particular health needs."
    },
    {
      "title": "Consult your doctor before trying any alternative medicines.",
      "content": "Consult your doctor before trying any alternative medicines. Herbal remedies and supplements are not quality-controlled by the government the way commercial medications are. This means that the doses in them may not be standardized or they may be contaminated with low amounts of harmful chemicals. For a small baby, even a little bit could be dangerous. However, if your doctor gives you the OK, you might try soothing your baby with: [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Herbal tea. Use decaffeinated tea so your baby won’t be awake all night. Sugar water. While it may seem like sugar water couldn’t possibly be harmful, ask your doctor if giving it to your baby might interfere with breastfeeding or bottle-feeding. Use an eye-dropper to administer very small amounts. Gripe water. Talk to your pediatrician about using this formula, which usually includes ingredients such as fennel, caraway, ginger, dill, chamomile, and peppermint. Avoid formulations that contain alcohol or sodium bicarbonate. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Give your baby a soothing bath.",
      "content": "Give your baby a soothing bath. A warm bath with a few drops of chamomile or lavender oil may help relax and soothe your baby. [9] X Research source"
    },
    {
      "title": "Take your baby to the emergency room if there are signs of a problem more serious than gas.",
      "content": "Take your baby to the emergency room if there are signs of a problem more serious than gas. These symptoms usually indicate that the baby might be sick and in need of medical care. Symptoms to watch for include: [10] X Research source [11] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Fever Stomach that is bloated, swollen, hard, or tender Bloody stool or stool with mucus Vomiting (especially forcefully, or with a green or dark color or blood) Diarrhea Reduced hunger Limp skin Pale skin Inability to suck A cry that sounds different from usual or is constant Difficulty breathing or changes in the rate of breathing Not being alert or being very sleepy Becoming more unhappy when touched"
    },
    {
      "title": "Soothe a fussy baby quickly.",
      "content": "Soothe a fussy baby quickly. Many babies swallow air when they cry. If your baby tends to cry often, pick her up and comfort her as quickly as possible. [12] X Research source [13] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Some babies are very sensitive and may not be able to soothe themselves without help from a parent. You can help prevent your baby from swallowing air when crying by holding her when she’s upset and helping her to calm down."
    },
    {
      "title": "Position your baby properly during feeding.",
      "content": "Position your baby properly during feeding. This will reduce the amount of air she swallows. During all holds keep the baby's head above her stomach and support her head. This will help her swallow properly. Common positions are: [14] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The side-lying hold, where mom and baby are lying tummy to tummy on the bed with the baby's head at the mom's breast. The football hold, where mom is upright and holds the baby like football with her feet in mom's armpit and her head at the breast on the same side. The cross-cradle hold, where mom holds the baby like a football, but nurses the other breast. The cradle hold, where the baby's head is supported by mom's elbow and her body lies across mom's forearm."
    },
    {
      "title": "Burp your baby at the end of each feeding.",
      "content": "Burp your baby at the end of each feeding. If your baby is particularly gassy, you can interrupt the feeding a few times in the middle to burp her. You can burp your baby in a few different positions: [17] X Research source Sit upright and hold the baby to your chest. Allow your baby's chin to rest on your shoulder as you gently pat her back. Hold your baby sitting upright. Support her head by cradling her chin with one hand, and use the other to pat her back. Place your baby on her belly across your lap. Make sure the baby's head is still higher than her chest. Gently pat her on the back."
    },
    {
      "title": "Evaluate your bottle feeding technique.",
      "content": "Evaluate your bottle feeding technique. There are a few simple changes that may help enormously if your baby swallows air during bottle feeding. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Hold the bottle high enough that the nipple stays full. If the nipple is only partially full with milk, the baby will suck in air with the milk. Try a different bottle or a different nipple on the bottle. Your baby might not swallow as much air when drinking from a bottle with a disposable, collapsible bag."
    },
    {
      "title": "Talk to your baby’s doctor about whether your baby might be allergic to cow’s milk in the formula.",
      "content": "Talk to your baby’s doctor about whether your baby might be allergic to cow’s milk in the formula. Though it’s rarer in babies than in adults, some babies are allergic to cow’s milk, or intolerant of it. These babies often do much better on formulas which are easier to digest. If formula was causing your baby’s gas, you should see improvement in about two days. Possible formulas to try include: [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Similac Expert Care Alimentum Nutramigen Pregestimil"
    },
    {
      "title": "Consult your baby’s doctor about whether your baby might be allergic to something in your breast milk.",
      "content": "Consult your baby’s doctor about whether your baby might be allergic to something in your breast milk. If your baby might have a genetic predisposition to allergies, stopping eating these foods might help relieve your baby’s gas. It may take a few weeks before you notice a reduction in your baby’s gas. Possible allergens include: [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Dairy Peanuts Tree nuts Wheat Soy Fish Eggs"
    }
  ]
}