{
  "url": "https://www.wikihow.com/Test-for-Lactose-Intolerance",
  "title": "How to Test for Lactose Intolerance",
  "steps": [
    {
      "title": "Notice gas and bloating, particularly after eating dairy.",
      "content": "Notice gas and bloating, particularly after eating dairy. You may notice you feel extra full, for instance, which can indicate bloating. Also, you may pass more gas when you eat dairy foods, such as milk or cheese. Gas can make your stomach feel rumbly, too. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Passing gas can come in the form of flatulence or belching."
    },
    {
      "title": "Listen for grumbling from your abdomen.",
      "content": "Listen for grumbling from your abdomen. When you eat dairy, you may notice that your stomach complains about it, literally. It might make noises as it's trying to digest the lactose in the milk and can't. Sometimes, it may sound like your hungry, for instance, even if you just ate. It can sound like gurgles and pops."
    },
    {
      "title": "Pay attention to nausea and abdominal cramps.",
      "content": "Pay attention to nausea and abdominal cramps. Because your stomach is having trouble digesting the lactose, it might hurt some. For instance, you might feel sick to your stomach or feel heavy cramping in the area. You might just feel a bit queasy, too, like you don't really want to eat. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Cramping feels like someone is squeezing your muscles, and it is painful."
    },
    {
      "title": "Look for diarrhea and vomiting.",
      "content": "Look for diarrhea and vomiting. Diarrhea, or loose stools, is more common. If you find yourself running to the bathroom more after eating dairy, that could be a sign of lactose intolerance. However, you may also have instances of vomiting. Basically, any kind of stomach discomfort could indicate lactose intolerance. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Of course, you should be looking for these symptoms specifically after eating dairy products."
    },
    {
      "title": "Identify the foods with high lactose in your diet.",
      "content": "Identify the foods with high lactose in your diet. Lactose is found in almost any dairy product, and that can include milk, ice cream, coffee creamer, butter, and butter, just to name a few. Even protein powders, sausages, deli meat, flavored chips, and salad dressings can contain lactose. [4] X Expert Source Lyssandra Guerra Certified Nutrition & Wellness Consultant Expert Interview. 25 March 2020. These food products could be causing your stomach discomfort. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Think about how often you eat these products, and try to connect them to feelings of stomach discomfort. For instance, does your stomach hurt after you eat a bowl of cereal with regular milk? That might indicate lactose intolerance."
    },
    {
      "title": "Watch for hidden lactose.",
      "content": "Watch for hidden lactose. Lactose can be in foods you don't expect, such as soups, sauces, and gravies, which often use milk. It can also be in foods like salad dressings, bread, instant potatoes and soups, margarine, milk chocolate, and even breakfast cereals. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Lactose can show up in lunchmeats, candies, baking mixes, organ meats, peas, lima beans, and sugar beets. Get used to reading labels to look for dairy products so you can identify which ones may be causing symptoms."
    },
    {
      "title": "Eliminate the milk products from your diet to see if you improve.",
      "content": "Eliminate the milk products from your diet to see if you improve. Stop eating dairy, as well as any other possible sources of lactose, for at least 2 weeks. If you stop having diarrhea, nausea, bloating, gas, and so on, you may be lactose intolerant. You may still want to get tested by a doctor so you know for sure. You could have another underlying condition in addition to being lactose intolerant."
    },
    {
      "title": "Ask about the lactose tolerance test.",
      "content": "Ask about the lactose tolerance test. For this test, you drink a liquid that's high in lactose. After 2 hours, a medical professional will perform a glucose test on you. If your sugar doesn't increase, you haven't digested the lactose properly. [7] X Research source A glucose test is a blood sugar test. They will prick your finger to get a drop of blood, then measure the level of sugar in the blood. In a similar test, called the milk tolerance test, you'll be asked to drink a glass of milk, and then a medical professional will test your blood sugar levels."
    },
    {
      "title": "Discuss the hydrogen test if you don't like needles.",
      "content": "Discuss the hydrogen test if you don't like needles. You still have to drink a liquid with high lactose. However, instead of checking your blood sugar, the medical professional will measure the amount of hydrogen in your breath to determine if you're lactose intolerant. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Often, your doctor will request that you avoid lactose in the week or 2 before your test to make it more accurate. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If your hydrogen is higher than average, it means the lactose is staying in your colon and fermenting, which in turn increases the hydrogen in your body."
    },
    {
      "title": "Request a stool acidity test if it's for a child that can't do another test.",
      "content": "Request a stool acidity test if it's for a child that can't do another test. If the person you're testing is a child, they may need to do this test instead. With this test, you will need to collect a stool sample from toilet paper for them. Then, you'll take the sample to the doctor in a special kit. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source When lactose stays in a person's system, the amount of lactic acid increases, which will show up in a stool sample."
    },
    {
      "title": "Talk about a small bowel biopsy to test for other conditions.",
      "content": "Talk about a small bowel biopsy to test for other conditions. With this test, your doctor will insert a small tube down your throat. While it sounds scary, it doesn't typically hurt, as the doctor will use local anesthetic. Then, the doctor will take a tiny tissue sample from your small intestinal lining and test it for other conditions, such as celiac disease. [11] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source While this type of biopsy isn't done very often for lactose intolerance, your doctor may request one to help rule out other possibilities. If the tissue sample has a low amount of lactase in it, you likely have lactose intolerance."
    }
  ]
}