{
  "url": "https://www.wikihow.com/Wrap-Flowers",
  "title": "How to Wrap Flowers in Tissue or Brown Paper",
  "steps": [
    {
      "title": "Choose the type and size of paper to wrap your flowers.",
      "content": "Choose the type and size of paper to wrap your flowers. Zuniga says, when it comes to wrapping your flowers, consider the wrapping as another element of the bouquet. [1] X Expert Source Pilar Zuniga Florist Expert Interview. 12 March 2020. Use almost any type of paper that’s about 1 inch (2.5 cm) longer than your bouquet and roughly twice the width. However, 18” x 18” (45.72 x 45.72 cm) is a good place to start for most bouquets. For a classic look, choose plain brown craft paper . For something dressier, try wrapping paper or decorated wrapping sheets. Think about using unusual papers for a unique look, such as: [2] X Research source Newspaper Pages from old books (if you're wrapping small flowers) Sheets of music Zuniga recommends colored tissue paper that coordinates with the colors in the bouquet or contrasts with the flowers to make them pop. [3] X Expert Source Pilar Zuniga Florist Expert Interview. 12 March 2020."
    },
    {
      "title": "Fold the paper in half from corner to corner to make a triangle.",
      "content": "Fold the paper in half from corner to corner to make a triangle. Lay your paper on a table so the printed or colored side is face down. Match the closest corner to the opposite one to fold it in half on a diagonal. Zuniga says another option is to fold the paper at an angle so some of the plain side is exposed. [4] X Expert Source Pilar Zuniga Florist Expert Interview. 12 March 2020. After you fold it, the paper looks like two triangles overlapping Folding the paper over at an angle creates decorative folds in the wrapped bouquet."
    },
    {
      "title": "Secure the stems with a rubber band.",
      "content": "Secure the stems with a rubber band. Place a rubber band around the middle of your flower stems to make them easier to wrap and keep them from coming loose in your paper. A small portion of the stems will be wrapped, which will cover the rubber band, so it doesn’t have to be neat, just secure."
    },
    {
      "title": "Position the flowers on the paper and then fold the corners over it.",
      "content": "Position the flowers on the paper and then fold the corners over it. Arrange the flowers by positioning the blooms toward the top point of the paper triangle. Fold the left point of the paper to the right over the flowers. Then, fold the right side of the paper to the left, overlapping one side over the other. [5] X Research source This method will make a cone shape and can be good for wrapping a bouquet with varying sizes of flowers."
    },
    {
      "title": "Secure the paper and then tie a piece of ribbon around the bouquet.",
      "content": "Secure the paper and then tie a piece of ribbon around the bouquet. Place clear double-sided tape on the underside of the folds of paper that overlap or staple the overlapping paper together. Press the taped pieces together so that the wrapped bouquet doesn't come apart when you move your hands away. [6] X Research source If you don't have tape or a stapler , use craft twine or string to secure the bouquet. Wrap the string or twine tightly so the paper doesn't unwrap. Finish your bouquet by wrapping a bow at the base of the paper where it meets the stems."
    },
    {
      "title": "Try wrapping individual flowers for an extra-special presentation.",
      "content": "Try wrapping individual flowers for an extra-special presentation. Roll the single stem in a square piece of brown craft paper or cloth with dimensions that are about the same as the length of the flower stem. Start at the corner of the paper for a tighter look and more visual interest. Then, secure it with twine or a ribbon tied in a bow. [7] X Research source If the flower is very small, twist one end of the paper into a cone. Place the small flower into the cone so it sits at the narrow end."
    },
    {
      "title": "Select a sturdy piece of paper to wrap your bouquet.",
      "content": "Select a sturdy piece of paper to wrap your bouquet. To support a delicate bouquet, use brown craft paper or thick wrapping paper. If your flowers have strong stems and blooms, a more delicate paper, like tissue paper or newsprint, also works. Choose coordinating colors that look good with your flowers and don’t clash or compete with them. For example, if you have an orange flower, think about using red and yellow tissue paper, which brings out the vibrant orange color. It helps to think about what wrapping paper to use as you make the bouquet ."
    },
    {
      "title": "Wrap the stems of the flowers together.",
      "content": "Wrap the stems of the flowers together. Trim the stems of your bouquet so they're the same length. Tie a rubber band around the stems so they don't come loose. Don’t worry, the rubber band is hidden when you wrap the flowers in paper. Wrap a paper towel around the end of the stems to prevent water from leaking out of the flowers and onto the paper. To keep flowers fresh longer, consider soaking the paper towel in water. Then wrap the wet paper towel around the stems. Cover it with plastic wrap to prevent the water from soaking into the paper. [8] X Research source"
    },
    {
      "title": "Lay out the paper and place the flowers on it.",
      "content": "Lay out the paper and place the flowers on it. Lay a square of your paper at a diagonal (so it looks like a diamond) in front of you. To keep the colorful part of the paper on the outside, lay it out so the plain side faces up. If you place the plain side down, only a little of the color shows after you wrap the bouquet. Position the flowers so the blooms are at or above the top of the paper, with most of the stems going straight down the middle of the paper. [9] X Research source For an average bouquet, use a square of paper that measures 2” x 2” (61 x 61 cm)."
    },
    {
      "title": "Fold the right side of the paper over the flowers.",
      "content": "Fold the right side of the paper over the flowers. Fold 1 to 2 inches (2.5 to 5 cm) of paper over to make a clean edge. Holding the folded edge, wrap that side of the paper over the flowers. If your bouquet is small, make another fold along the edge so it ends up closer to the stems of your bouquet for a neater look. A large bouquet with long stems might only need one fold."
    },
    {
      "title": "Fold the left side of the paper over the flowers.",
      "content": "Fold the left side of the paper over the flowers. Take the left corner of the paper and fold it up and over the flowers. Place your hand on the bouquet to hold the first side you folded as you wrap the second side over the flowers. To secure the paper around the flowers, use a piece of clear double-sided tape to stick the left side to the right. Leave 2 to 3 inches (5.08 to 7.62 cm) of the left side free to create a neater finish after the next step."
    },
    {
      "title": "Fold the bottom point of the paper up to the stems.",
      "content": "Fold the bottom point of the paper up to the stems. Tape or carefully hold your folded pieces in place over the flowers. Zuniga recommends folding the pointed section of paper that extends below the ends of the stems up for a more finished look. [10] X Expert Source Pilar Zuniga Florist Expert Interview. 12 March 2020. Continue folding until the stems sit in the fold. It's important to fold the corners in this order so the bottom fold makes a kind of base or bottom for your flower stems."
    },
    {
      "title": "Finish folding or rolling the right side of the paper over the bouquet.",
      "content": "Finish folding or rolling the right side of the paper over the bouquet. Finish rolling or folding the free edge of the left side of the paper over the bottom fold. Secure it to the other side of the paper with clear double-sided tape. [11] X Research source For a tightly wrapped bouquet, finish rolling the paper using more tension. For a looser bouquet, gently fold the remaining paper over the bouquet."
    },
    {
      "title": "Secure the bouquet with ribbon, twine, or string.",
      "content": "Secure the bouquet with ribbon, twine, or string. Wrap the ribbon, twine, or string around the paper several times so it won't come undone. If your paper is very thick, use clear double-sided tape to tape the folds together. [12] X Research source Place a large decorative ribbon on the outside of your wrapped flowers to give the bouquet a professional look."
    },
    {
      "title": "Gather the flowers into a bouquet.",
      "content": "Gather the flowers into a bouquet. Hold all of the flowers with one hand so your palm is around the stems. Take a rubber band and wrap it around the stems at the point where you're holding them. [13] X Research source The rubber band doesn’t show once the ribbon is on. It’s used to keep individual flowers from falling out of the bouquet."
    },
    {
      "title": "Attach a looped string or ribbon to a single stem.",
      "content": "Attach a looped string or ribbon to a single stem. Take your string or ribbon and make a slip knot or square knot with a loop on one end. Slip the loop onto one flower stem and slide it up near where you placed the rubber band. [14] X Research source The looped stem gives your string or ribbon a starting point for wrapping the bouquet. It also makes sure the string or ribbon doesn't unravel from the bouquet."
    },
    {
      "title": "Wrap the string or ribbon around the rest of the stems.",
      "content": "Wrap the string or ribbon around the rest of the stems. Make sure to keep the ribbon flat as you wrap it evenly around your grouped stems. Keep wrapping until you've covered at least 3 inches (7.62 cm) or as much of the stems as you like. [15] X Research source Wrapping several layers of string or ribbon around the stems strengthens and supports the bouquet."
    },
    {
      "title": "Secure the string or ribbon to finish it off.",
      "content": "Secure the string or ribbon to finish it off. Once the flowers are secure and wrapped as much as you like, bring the string or ribbon back to the front of the bouquet. Cut the string or ribbon and tuck the end into the wrapped stems. Tie a ribbon bow to the front of the wrapped stems to hide the end of the wrapping."
    }
  ]
}