{
  "url": "https://www.wikihow.com/Attach-a-Garden-Hose-to-a-Kitchen-Faucet",
  "title": "How to Hook Up a Garden Hose to Your Indoor Faucet",
  "steps": [
    {
      "title": "Unscrew the aerator on the tip of the faucet.",
      "content": "Unscrew the aerator on the tip of the faucet. Place a towel over the drain of your sink, then use your hands or an adjustable wrench to remove the metal piece on the tip of your faucet. [1] X Research source Keep the pieces in a safe place. If you’re using a wrench, put pieces of vinyl grip tape on the teeth so you don’t scratch the metal. If there’s no way to grip the aerator, you may have a “cache” style faucet. If so, use an aerator removal tool or large flathead screwdriver to unscrew it. [2] X Research source"
    },
    {
      "title": "Get a faucet adapter that matches your aerator.",
      "content": "Get a faucet adapter that matches your aerator. Measure the diameter of the aerator and check the threads to determine what size faucet adapter is compatible with your sink. If the threads (the raised, screw-like spiral) are on the outside, you have a male faucet. If they’re on the inside, you have a female one. [3] X Research source To ensure you get the right adapter, bring your aerator to a local hardware store and compare it to the products they have. Some adapters can be used on male and female faucets."
    },
    {
      "title": "Screw the faucet adapter onto the spout.",
      "content": "Screw the faucet adapter onto the spout. Check the inside of the adapter to be sure it has a washer (small removable ring) inside of it, then screw it onto your faucet by hand. [4] X Research source Make sure that it forms a tight seal. If you’re going to submerge the hose, screw a hose-type vacuum breaker on the end of the hose threads before attaching it to the faucet. This prevents the hose from sucking up the contents of the container and contaminating your drinking water. [5] X Research source"
    },
    {
      "title": "Screw on the hose until it’s watertight.",
      "content": "Screw on the hose until it’s watertight. Take the rubber gasket (soft removable circle) that came with your adapter and fit it on the inside of the hose. [6] X Research source Connect the hose to the faucet tightly enough that it forms a watertight seal."
    },
    {
      "title": "Remove the adapter and wrap the spout in Teflon tape.",
      "content": "Remove the adapter and wrap the spout in Teflon tape. Unscrew the hose from the sink, then take off the adapter. If your faucet spout is male, wrap Teflon tape clockwise around it. If it’s female, wrap the tape (still clockwise) around the threads of your aerator. [7] X Research source Pull the tape tightly around the threaded area of the faucet, being careful not to let extra tape overhang the area where the water comes out. You may want to put the end of the hose in a bucket so it doesn’t spill water in your house."
    },
    {
      "title": "Trim any tape that goes past the threads.",
      "content": "Trim any tape that goes past the threads. Gently cut the excess tape and peel away the scraps. Make sure the opening for the water is completely unblocked. Another way to ensure you have the right amount of tape is by leaving the bottom threads uncovered. [8] X Research source"
    },
    {
      "title": "Screw on the aerator and turn on the water.",
      "content": "Screw on the aerator and turn on the water. Start screwing the aerator in by hand, then use an adjustable wrench to fully tighten it to the spout. [9] X Research source Turn on the water to be sure there are no leaks, and your sink is back in business."
    }
  ]
}