{
  "url": "https://www.wikihow.com/Apply-Makeup-to-Dry-Skin",
  "title": "How to Apply Makeup to Dry Skin & Rough Patches",
  "steps": [
    {
      "title": "Wash your face.",
      "content": "Wash your face. No matter what kind of skin you have, always wash your face before putting on makeup. This will give you the ideal canvas for your makeup by leaving skin fresh and ready for anything you put on it. It also will wash away any leftover makeup or products that you may have used. This will prevent breakouts and clogged pores. Use a gentle face wash formulated for dry skin to wash your face. Face washes meant for normal or oily skin will be too aggressive, and could cause dryness to get worse."
    },
    {
      "title": "Moisturize your skin.",
      "content": "Moisturize your skin. After washing your face, apply moisturizer to your skin, focusing it on the driest areas. For many, the area around the nose and the space between the eyebrows tend to be the driest areas. [1] X Research source Use an extra-hydrating moisturizer formulated for dry skin. Apply enough moisturizer so that it gets absorbed by the skin, but not so much that the skin feels greasy with moisturizer."
    },
    {
      "title": "Apply face primer.",
      "content": "Apply face primer. Primer is a sheer, gel-like base that goes on skin before applying makeup. For dry skin, primer is especially useful because it gives your skin a smoother base, so that makeup can be applied without getting stuck to dry patches of skin. To apply primer, take a dot of it on your finger and pat it into sections of the face. Do not apply too much primer. In general, use one dot for small areas like your chin and nose, and two dots for larger areas like your cheeks or forehead."
    },
    {
      "title": "Apply eye primer.",
      "content": "Apply eye primer. Eye primer helps eyeshadow and eyeliner glide on smoother, and makes eye makeup more blendable. It also is often tinted to give your eyelid a more uniform color. If your eyelids are dry, they may appear red or irritated. Eye primer will moisturize without making your lids too oily, and will help combat discoloration. [2] X Research source Apply one dot of eye primer to each lid and pat it on with your fingertip."
    },
    {
      "title": "Apply chapstick.",
      "content": "Apply chapstick. If you suffer from dry skin, your lips may also be chapped. Chapped lips make it almost impossible to apply lipstick or other lip products smoothly. Patchy lipstick is one of the most obvious makeup faux pas, so make sure to use a layer of chapstick before you apply your makeup. [3] X Research source"
    },
    {
      "title": "Use face makeup meant for dry skin.",
      "content": "Use face makeup meant for dry skin. Make sure you are using foundation and concealer meant for dry skin. Foundation meant for dry skin is packed with more moisture than foundation meant for oily or normal skin, meaning that it will glide on easier and keep your skin feeling enriched and fresh, as opposed to making it feel depleted. [4] X Research source Don't overlook the importance of the right foundation. Applying foundation smoothly is often the biggest struggle for those with dry skin, so if you think your foundation may not be working for you, it may be best to invest in a new one. If you feel like drugstore-quality foundation isn't working for you, visit a high-end makeup store like Sephora or Mac. Tell a sales associate that you are looking for a foundation for dry skin. Sample several foundations and apply them until you find one that works for your skin."
    },
    {
      "title": "Use liquid foundation as opposed to a powder foundation.",
      "content": "Use liquid foundation as opposed to a powder foundation. If you are using powder foundation, this may be the cause of some of your makeup woes. Powder foundation is great for people with oily skin, because it helps to absorb excess oil and moisture on the skin. However, it you have dry skin as it is, using powder foundation will only leave your skin more dried out than before. The powder will cling to the dry areas of your face, making foundation look patchy, especially from up close. Buy a liquid foundation at the drugstore or at makeup stores like Ulta or Sephora. Also make sure to use a cream concealer as opposed to a stick concealer."
    },
    {
      "title": "Apply foundation.",
      "content": "Apply foundation. Pick an area of your face to start applying foundation. Dab a small amount of liquid foundation onto your finger, then tap the foundation onto your face. Use a foundation brush to blend the foundation into your skin. Repeat as desired for your whole face, except for your under eye area and your eyelids. If you have dry skin, you may notice that your skin is often flaky. Using a brush as opposed to your fingers to blend foundation minimizes flaking since brushes are gentler. Do not press too hard with the brush. Instead, use a soft series of repetitive taps that blends in and spreads the foundation to the area you are working on."
    },
    {
      "title": "Apply concealer.",
      "content": "Apply concealer. Use a liquid or cream concealer on your undereye area, and any other area that you feel needs more coverage. Apply concealer like you applied the liquid foundation, using a series of small pats.Use a small brush that can reach all the areas of the under eye. [5] X Research source"
    },
    {
      "title": "Use a setting spray.",
      "content": "Use a setting spray. Use setting spray, as opposed to powder, to set your makeup. Hold the spray about a foot from your face and give your face a gentle mist. Setting spray has a moisturizing effect, as opposed to setting powder which will absorb precious moisture. [6] X Research source"
    },
    {
      "title": "Apply your eye makeup.",
      "content": "Apply your eye makeup. With your eyes already primed, apply your eye makeup as you usually do. You should notice that with the primer in place, it is easier to blend your eyeshadow, and your liner pencil should glide on more smoothly. If you notice that your eyelids are still dry, apply liquid liner as opposed to pencil liner. You also can use cream-based eyeshadows, though they are less easy to blend than powders. [7] X Research source"
    },
    {
      "title": "Use liquid blush.",
      "content": "Use liquid blush. If your cheeks and cheekbone areas are prone to dryness, making your blush go on patchily, try a liquid blush. Liquid blush not only goes on smoother, but it lasts longer and is more heat resistant during hot days. To use liquid blush, dab a dot of it on your cheekbones and spread with a blush brush in small pats. [8] X Research source"
    },
    {
      "title": "Apply your lipstick.",
      "content": "Apply your lipstick. By the time you have put on your foundation, blush and eye makeup, your lips may be starting to feel dry again. Apply a thin coat of chapstick. Wait for a moment for it to sink in, and then apply your lipstick. Try to avoid matte lipsticks, or long-lasting lipsticks, as these have a drying effect. [9] X Research source If do decide to use a matte lipstick that leaves your lips feeling dry, dab a bit of petroleum jelly or chapstick onto your finger, then pat this onto your lips. This will leave your lips feeling moisturized, and will counteract the drying effect of the lip product you are using."
    },
    {
      "title": "Apply highlighter for a dewy look.",
      "content": "Apply highlighter for a dewy look. If you are self-conscious about your skin appearing dry, use a liquid highlighter to give your skin a fresh, dewy look. Use a liquid highlighter, and dab a drop on the top of each cheekbone. Pat it in using your finger in a diagonal along the ridge of your cheekbone. Applying highlighter won't actually make your skin less dry, but it will give you a fresh and healthy look."
    },
    {
      "title": "Refresh your makeup throughout the day.",
      "content": "Refresh your makeup throughout the day. Check up on your makeup every couple of hours. If you notice that your skin is flaking or dry patches have appeared, revitalize your skin. First take a pair of tweezers and tweeze off any flakes of dry skin. Then use a patting motion to apply a dot of moisturizer to each dry patch. Moisturizer will give your skin the moisture and nourishment that it needs, and it will make your makeup look less dry and cakey. [10] X Research source Make sure to not to use too much moisturizer, and to pat as opposed to rub the moisturizer in. Rubbing can remove your foundation and concealer."
    }
  ]
}