{
  "url": "https://www.wikihow.com/Change-Location-on-Bumble",
  "title": "Four Ways to Change Your Location on Bumble",
  "steps": [
    {
      "title": "The simplest way to change your location is to set yourself to 'Travel Mode'.",
      "content": "The simplest way to change your location is to set yourself to 'Travel Mode'. By activating Travel Mode, you can select a city to appear in for seven days. Your profile will appear at the center of your chosen city and will display a 'traveling' icon so that other users know you are traveling. [1] X Research source Open the Bumble app and log in. Click on Settings in the upper left-hand corner of the app. Scroll down to the Location section and click Travel-to. Search for your desired city and select it. If you are an iOS user, this feature is only available for Premium subscribers. If you are an Android user, five Bumble coins will be deducted from your balance or you will be prompted to purchase five Bumble coins to pay for this feature. [2] X Research source A timer will appear under your location settings to let you know how much time you have left in your altered location."
    },
    {
      "title": "Bumble does not allow you to change your own location.",
      "content": "Bumble does not allow you to change your own location. Instead, you can submit a request for a location change. This method is best for users who need their location permanently adjusted rather than temporarily changed. [3] X Research source Open the Bumble app and log in. Click on your Profile. Scroll to the bottom of the screen and click on 'Contact & FAQ.' Click 'Contact Us,' which will take you to a new menu. Click on 'Report a Technical Problem.' This will open a form to request a location change. In your comments, you can mention that your phone's GPS is inaccurate and you want to adjust your location."
    },
    {
      "title": "Instead of changing your location on Bumble, consider hiding it.",
      "content": "Instead of changing your location on Bumble, consider hiding it. Bumble will still show you matches after completing these steps, but they may be hundreds of miles away. For this method, the steps will differ based on what kind of device you use."
    },
    {
      "title": "For Android devices",
      "content": "For Android devices Open your device 'Settings' from your app drawer. Click on 'Apps & notifications' from the list of options. From the list of apps on your device, find and click on 'Bumble.' Click on 'Permissions' from the app options. Switch the toggle beside 'Location' to 'Deny.' Now, the app does not have your permission to find your location."
    },
    {
      "title": "For iOS devices",
      "content": "For iOS devices Tap on the gear icon to open your 'Settings.' Scroll down to the bottom of the settings to see your list of apps. Click on 'Bumble' to see its permission options. Tap on 'Location Services from the Bumble settings menu. Select the 'Never' or 'Ask Next Time' option. Now, Bumble does not have access to your location."
    },
    {
      "title": "Your final option is to trick your phone’s GPS into thinking you’re in a different location.",
      "content": "Your final option is to trick your phone’s GPS into thinking you’re in a different location. This is a slightly longer and more complicated process than the other methods, but you can get a sense of the dating scene anywhere in the world. You will be spoofing your location for your entire device so apps, like Find My iPhone or other trackers, will also shift location. [4] X Research source"
    },
    {
      "title": "For Android devices",
      "content": "For Android devices Open your 'Settings.' Tap on 'System' > 'About Phone' > 'Software Info.' Under the Software Info section, click on 'Build Number' seven times fast. This action will prompt you to enter your phone’s lock code/password. You will now have access to the Developer Mode settings page. Click 'Settings' > 'System' > 'Developer Options.' Download the Fake GPS Location app from the Google Play store if you don’t already have it. Now, you need to tell your phone to use the Fake GPS Location app as its real GPS. Start by opening your 'Settings.' Click on 'System' > 'Developer Options.' Scroll down within Developer Options and click 'Select mock location app.' Choose the Fake GPS app. Within the Fake GPS, select your new location by navigating on the map and pressing the green arrow button. Your phone will now believe you are in the location you selected. To check if it’s working on Bumble close the app and restart it. Spoofing your GPS can be a bit tricky, so you can try troubleshooting the device until you get it right."
    },
    {
      "title": "For iOS devices",
      "content": "For iOS devices Unfortunately for iOS devices there aren’t any free GPS apps, but you can always pay for iTools, which can spoof your location. To start your GPS spoof, open up iTools and click on the Toolbox icon in the blue panel at the top of the page. Click on 'Virtual Location.' In the pop-up box, enter your new location and click 'Move Here.' This will change your location in your Bumble app. If you want to remove your location, navigate to iTools and click 'Stop Simulation.'"
    }
  ]
}