{
  "url": "https://www.wikihow.com/Become-a-Mangaka",
  "title": "How to Become a Mangaka: Building a Story & Getting Published",
  "steps": [
    {
      "title": "Practice your drawing.",
      "content": "Practice your drawing. Just like learning an instrument, practicing drawing will make you better over time. You can start out by imitating characters you like, then you can move on to creating your own characters and panels. Regularly practice your drawing and focus on poses, proportions, facial expressions, and other artistic principles. [1] X Trustworthy Source US Bureau of Labor Statistics U.S. government agency that collects and reports labor-related information Go to source Comic artists recommend putting in practice every day. Make sure you are setting aside at least an hour a day to work on your artwork."
    },
    {
      "title": "Use free resources.",
      "content": "Use free resources. You don't need formal education to learn from professionals. You'll find many resources are available to you for free. You can find free online courses on sites like YouTube , Coursera , and Princeton , all of which you can use to develop your drawing skills. You'll also find resources available at your local library. Make use of the resources available to develop your skills. Don't just get books on drawing. Look at books on writing comic books, as well as books just on writing. If your library doesn't have what you want, most libraries will order books from other libraries for you to use. To become a mangaka, you need to be familiar with the genre. Widely study the genre to see what is getting published. Don't just read your favorite manga over and over. Branch out into ones you normally wouldn't be drawn to to see what else manga has to offer. Exposing yourself to different styles will help you work towards your own style."
    },
    {
      "title": "Take appropriate courses in high school.",
      "content": "Take appropriate courses in high school. While you're still in high school, start building your artistic skills by taking art classes. Drawing and painting would both be helpful for building your skill set to draw manga art, and even a general art class could potentially help you build skills. [2] X Trustworthy Source US Bureau of Labor Statistics U.S. government agency that collects and reports labor-related information Go to source In addition, take literature and writing courses. As a mangaka, you'll be creating a storyline, as well, so make sure to spend time focusing on how to develop a story."
    },
    {
      "title": "Seek out others with similar interests.",
      "content": "Seek out others with similar interests. Working with other people on similar goals can help encourage you in yours. In addition, you can learn new skills from other people in the group. Try to find a group interested in manga at your school or in your area. You could also join an art club to help increase your skills. If you can't find one to join, consider creating one. There's bound to be others who have similar interests. Look for classes or groups at your local library or with your park and recreation department."
    },
    {
      "title": "Consider pursuing an art degree.",
      "content": "Consider pursuing an art degree. While you don’t need a degree to be a mangaka, formal education can help you gain the professional skills you need. A bachelor's degree in fine arts can help you build up your artistic skills. However, you can also get a much more specific degree. A number of universities in the United States offer degrees in comic art, and if you're willing to travel to Japan, you can earn bachelor's or master's degrees specifically in manga art. [3] X Research source In addition, think about double majoring or minoring in literature or writing. Developing your writing skills will be helpful in writing stories later."
    },
    {
      "title": "Brainstorm ideas for the plot.",
      "content": "Brainstorm ideas for the plot. Think about the stories that you love to read, and how you can make your own contribution. Manga has a wide variety of stories, from horror to romance, so feel free to let your brain run wild. The key is to be thinking about your story all the time. If you limit your brainstorming to just when you sit down to write the story, you're not giving your creativity the time it needs to build a good story. [4] X Research source Try starting with one idea on a piece of paper. Build on that idea by connecting dots to other ideas you come up with. Another way to get your creativity flowing is to do free writing. Start with a word or image, and just start writing until you hit on something you like. Once you do, start developing that idea. Pick an idea you enjoy. Working on your own manga is going to take some hard work. If you don't pick an idea you love, you'll have a hard time motivating yourself to work on it. [5] X Research source"
    },
    {
      "title": "Plot out a storyline.",
      "content": "Plot out a storyline. Once you have an idea for a story, you need to work beyond that because manga comics generally need more planning than a normal novel. Create an outline of how your story is going to move from beginning to end, putting focus on key plotlines, character development, and pacing. [6] X Research source Start by figuring out the main plot points. What's the driving force of your story? What are the major events? Make sure to include the setting, as well. Think about the background you want for your setting and how that will affect your story. For example, an urban setting is very different from a rural setting in terms of story. Move on to going scene-by-scene, so you have an idea of what the main scenes will look like. When preparing your work, Arklight Blues says that “it’s very important to actually write stuff down.” Take notes on your characters, how you want the chapters to go, and ideas that you want to add to your manga so you don’t forget them."
    },
    {
      "title": "Develop your characters.",
      "content": "Develop your characters. When creating your characters, you need to think both about their place in the story (personality) and their physical appearance. To keep them consistent throughout your story, you should develop character sheets that outline both types of traits. For appearance, draw the character in a model or turnaround sheet. Draw them from every angle, figuring out clothing, hair, and proportion, so you can recreate the character in the same manner throughout your manga. Arklight Blues also says to avoid over-designing your character, as you’ll either crowd the page or exhaust yourself having to draw everything all the time. Write down personality and personal traits for the character, such as personality quirks, personal beliefs, religion, favorite foods, color, and so on. Don't forget personality flaws. No one is perfect, and no character should be either. [7] X Research source Create sheets for all your characters, but make sure your main characters are the most fleshed out. Figure out what motivates your character, too. What’s driving them through the story?"
    },
    {
      "title": "Work on creating your personal style.",
      "content": "Work on creating your personal style. Really, developing a style comes from drawing for a while and using your creativity to figure out what you like. However, it's important to pick something that's doable. You don't want to start on a style that's hard for you to maintain over time. Use one that you enjoy and find easy to draw. [8] X Research source That doesn't mean that it must look simple, just that it's simple enough that you can put in the hours it takes to draw it through a whole story or a series of stories. Explore different styles. Once you see what others do, you can see what you like and don't like. That will help you figure out what you like in your own style. Try not to just copy any one style exactly. You want yours to be unique in some aspect. Arklight Blues says depending on your manga, you may have to focus on different design elements. Slice of Life manga typically prioritizes designing different faces for characters, while manga like Jojo’s Bizarre Adventure prioritizes clothing. When it comes to drawing hair, Weiser says to use a model or look at yourself in the mirror for a live reference. It’ll help with realism, lighting, and depth."
    },
    {
      "title": "Design and format the panels for your manga.",
      "content": "Design and format the panels for your manga. Format your panels to follow the flow of your story. Consider the beginning and end points of each page and how many panels you’ll need to get from one to the other, what size panels you need for specific scenes, and how to set them up to make sure the reader’s experience follows what you envisioned. [9] X Research source For example, if you’re drawing a fight and your main character is about to deliver the final blow, consider a mid-sized panel leading up to the impact, then a page-full panel showing the impact. If you’re drawing a conversation between two characters, draw small panels that fit the characters’ heads and dialogue. If the conversation is intense, feel free to increase the panel size to match."
    },
    {
      "title": "Sketch out your manga.",
      "content": "Sketch out your manga. Begin by sketching out the scenes, blocking where the dialogue and characters will go; remember, you're just creating a bare-bones sketch to see where things will go. Weiser says after you sketch, move on to fully drawing out the scenes, but use pencil so that you can make changes. Once you’re satisfied with your sketches and blocking, write in the dialogue for your story in pencil. Weiser says if you’re just starting off, use a regular, inexpensive pencil for your drawings. As you develop, move on to a graphite pencil. It’s not about the tool, it’s about your ability."
    },
    {
      "title": "Ink your manga.",
      "content": "Ink your manga. After finalizing the sketches of your manga, fill them in with ink and color. Many manga are not colored, due to cost restrictions, so you can work just in black and white if you prefer. In fact, many publishers prefer black and white. [10] X Research source How you create your manga is up to you, as many manga artists work in digital formats nowadays. [11] X Research source If you prefer to work digitally, consider using a manga drawing app. These tools are designed for creating comics, so they will make it easier for you to work. [12] X Research source Don't forget to make your text legible. If people can't read your text, they won't read your comic."
    },
    {
      "title": "Get your work ready for a publisher.",
      "content": "Get your work ready for a publisher. When looking at publishers, consider what types of work they tend to print, and then pick one that fits your style and theme. If your manga is a shonen, consider reaching out to a popular shonen publishing company, like Shonen Jump. Make sure you follow all their guidelines to the letter, including maturity level. For instance, most will want PG or PG13. [13] X Research source Most publishers will want a copy of your manga, not the original. You can make a copy on a high-quality copier or use a laser printer. Pay attention to sizing formats for the company you are sending it to. Most companies will expect you to have the basics of drawing down, such as proper proportions. If you aren't there yet, you may want to wait a while."
    },
    {
      "title": "Present your work to a publisher.",
      "content": "Present your work to a publisher. One simple way to find a publisher or magazine you want to contact is to look at the back of your favorite manga. You can call up the publisher and schedule an appointment to be seen and show them your work. It's actually a common practice, and many mangakas began in this manner. You can also look them up online. You need to have your work ready to show. It may not be published, but many publishers will give you advice on how to do better. Others will hire you to work for them. If you can't visit in person, many publishers take submissions by mail."
    },
    {
      "title": "Enter competitions to get more visibility.",
      "content": "Enter competitions to get more visibility. Some people become mangakas by submitting their work through contests run by the publishers. Most contests will focus on Japanese-language contests, but a few accept submissions in other languages. Sometimes, mangakas are hired from these contests. MediBang and Comic Zenon both sponsor manga contests in other languages, so head to their websites if you want to learn more. Arklight Blues suggests using Manga Plus for Creators to get your manga seen, as they have a monthly competition that helps mangaka gain exposure."
    },
    {
      "title": "Become a publisher’s assistant.",
      "content": "Become a publisher’s assistant. There are plenty of manga artists who started off as assistants to manga publishers. While you’ll mainly be helping complete projects by drawing and editing another mangaka’s content, like backgrounds and filling, being an assistant presents plenty of opportunities for networking and industry growth, as you’ll see how things get done up close and personal. [14] X Research source"
    },
    {
      "title": "Consider self-publishing.",
      "content": "Consider self-publishing. Self-publishing is becoming more popular in all writing and comic book genres, especially in a digital world where you can do so much on your own personal computer. You can do the same thing with manga, and sometimes, you can even be recruited to be a mangaka from your online work. If you self-publish, you can either take the route of an eBook or publish a serial manga on a blog. You can self-publish eBooks through sites like Ebooks Direct or Amazon. You can publish free blogs through any number of sites, including Blogger and Tumblr . If you take this route, you'll need to market yourself on platforms like social media by posting about your work and encouraging others to read and follow you."
    },
    {
      "title": "Creativity",
      "content": "Creativity Mangaka tend to be creative and think outside the box, as they have to come up with appealing, exciting stories that haven’t been done before. So, if you’re thinking about becoming a mangaka, you’ll need to be creative, too. Creativity involves artistry and being analytical, so if you’re the type to study something and immediately branch ideas off of it, you’ve got a good shot at being a mangaka. [15] X Research source"
    },
    {
      "title": "Artistry",
      "content": "Artistry You can’t become a mangaka if you don’t know how to draw, as drawing is the basis of manga. Being skilled at art helps you know what looks good and what doesn’t, what expressions, perspectives, and proportions work best for particular scenes, and how to tell a story through a visual medium, which are all crucial for putting together a manga."
    },
    {
      "title": "Storytelling",
      "content": "Storytelling Alongside artistry, storytelling abilities is one of the foundational pieces of becoming a mangaka. To become a successful mangaka, you must learn how to build a strong plot, write characters that are unique and interesting, and be able to tell your story in a way that is both entertaining and successful. [16] X Research source"
    },
    {
      "title": "Designing",
      "content": "Designing When you’re crafting your manga, you must be able to format it in a way that delivers an impactful story filled with surprising reveals, detailed visuals, and immerses the reader. This means building the page with a variety of panels that flow together, visualing the story and characters before starting your sketches, and portraying those characters with proper depth and perspective . [17] X Research source"
    },
    {
      "title": "Communication",
      "content": "Communication Being a mangaka isn’t always a one-person job. If you want to be successful, you’ll need to be able to communicate with others . You’ll need to be able to take criticism from those who read your story, like publishers and colleagues, in order to improve. [18] X Research source You’ll also need to be able to properly communicate things to your readers. For example, if you have a complicated power system, you’ll have to communicate how it works in a way that is understandable and accessible."
    },
    {
      "title": "Become a comic book artist.",
      "content": "Become a comic book artist. To become a comic book artist, you’ll still need to be able to visually tell a story and craft your own art style, as you would as a mangaka, but you’ll be exclusively responsible for the visuals. [19] X Research source So, whether you prefer art over writing or want to do Western styles over manga, become a comic book artist!"
    },
    {
      "title": "Publish on Webtoons.",
      "content": "Publish on Webtoons. Webtoons is a website where you self-publish your manga, manhwa, or other webcomics online without having to deal with a huge publisher. There are 166 million active users, meaning there’s a good chance that your work will be seen by someone. So, if you prefer to build and publish your story on your own terms, publish on Webtoons. [20] X Research source"
    },
    {
      "title": "Become a fiction writer.",
      "content": "Become a fiction writer. If you prefer writing over artistry, you can still flex your creative muscles by becoming a fiction writer. You’ll have to study the genre, learn how to tell a story, and write interesting characters, just like mangaka, but you’ll be able to put all of your energy towards the writing aspect, rather than having to split the writing and artistry. [21] X Research source"
    },
    {
      "title": "Become a playwright.",
      "content": "Become a playwright. As a playwright, you’ll still be able to craft a unique, powerful story, but the way you go about it will be vastly different, as you’ll be writing to a live audience. Rather than sketching static poses, you’ll write actions to be performed on stage. So, when you want to bring your story to life and let your creativity shine on stage, become a playwright. Playwriting comes with its own set of challenges, like having to get your play produced, finding actors to perform it, and crafting a set. [22] X Research source"
    },
    {
      "title": "A mangaka is a manga artist and author.",
      "content": "A mangaka is a manga artist and author. Unlike Western comic artists, who typically only draw the story while working with writers, a mangaka is responsible for both. By definition, a mangaka is simply someone who creates manga, so if you create your first manga, you can consider yourself a mangaka, whether it’s published or not. [23] X Research source You’ll have a better chance at making a career out of being a mangaka if you’re able to get your work published."
    }
  ]
}