{
  "url": "https://www.wikihow.com/Build-a-Desk",
  "title": "How to Build a Desk",
  "steps": [
    {
      "title": "Measure the area where you’ll be putting your desk.",
      "content": "Measure the area where you’ll be putting your desk. Once you’ve determined where your new desk will go, stretch a tape measure from one end of your workspace to the other. Write down or make a mental note of the measurements you get. You’ll need to keep them in mind while gathering your materials and planning the dimensions of your desk. [1] X Research source If you don’t think you have enough room for a full-sized desk, consider installing a floating desk along the wall of your workspace. Floating desks can be as small as 1.5 feet (0.46 m) x 3 feet (0.91 m), and often require only 1-2 pieces of wood."
    },
    {
      "title": "Decide on a practical size for your desk.",
      "content": "Decide on a practical size for your desk. If you have roughly 5 square feet (0.46 m 2 ) of space to work with, you might make a desk that’s 2 feet (0.61 m) long by 4 feet (1.2 m) wide to ensure that you’ll have plenty of room. Of course, you’re free to play around with the dimensions of your desk however you see fit. Don’t forget to account for the space that your chair or stool will occupy when settling on a size for your desk. Most standard desks are around 29–30 inches (74–76 cm) high. Internal dimensions vary, but some of the more common lengths include 48 in (120 cm), 60 in (150 cm), and 72 in (180 cm), with widths of 24 in (61 cm), 30 in (76 cm), and 36 in (91 cm). [3] X Research source To keep things simple, round off the planned measurements for your desk to the nearest 1 ⁄ 2 foot (0.15 m). This will make all the measuring, marking, and cutting much easier."
    },
    {
      "title": "Cut your wood to the appropriate dimensions.",
      "content": "Cut your wood to the appropriate dimensions. It’s possible to construct a basic desk entirely out of 2x6 and/or 2x4 boards. Mark your chosen measurements on your boards in pencil and use a circular saw or miter saw to trim them to size. For a 2 ft (0.61 m) x 4 ft (1.2 m) desk, you would simply cut two 8 ft (2.4 m) 2x6 boards in half lengthwise to get four pieces that you can then assemble into a single plane. [4] X Research source You’ll be clamping multiple boards together to fashion the desktop, so be sure to shave off any rounded edges on the boards that will go in the middle section. Setting the adjustable blade guard on your saw will make this task easier. If you don’t want to bother with a lot of cutting and clamping, another option is to buy a solid door slab or sheet of laminated 3 ⁄ 4 in (1.9 cm) plywood and use it as a readymade one-piece desktop. [5] X Research source"
    },
    {
      "title": "Sand the wood thoroughly to prepare it for paint or stain.",
      "content": "Sand the wood thoroughly to prepare it for paint or stain. Once you’ve finished cutting your boards, run a sheet of medium- or high-grit sandpaper (80-120-grit will provide the best results) over the faces and edges of each piece using smooth circular motions. The idea is to scuff up the surface of the wood so it will better accept paint or stain. [6] X Research source An automated finishing sander can save you quite a bit of time and energy compared to manual sanding. If you’d prefer to leave your wood unfinished for more of a contemporary rustic look, you can skip straight to gluing the boards together."
    },
    {
      "title": "Glue your boards together end-to-end widthwise into a single piece.",
      "content": "Glue your boards together end-to-end widthwise into a single piece. Apply a straight, even line of glue to the cut edge of your first board, leaving the rounded edge clean. Then, press one of the cut edges of the next board into place and spread another line of glue onto the far edge. Continue in this fashion until you have each of your boards properly situated. Use a series of clamps (you’ll need at least 2) to hold the boards tightly together as the glue begins to dry. [7] X Research source Wipe off any excess glue that seeps out through the cracks in the boards right away to prevent it from hardening on the surface of the wood. Allow the glue to dry for at least 1 hour before unclamping the boards and proceeding with your project. [8] X Research source"
    },
    {
      "title": "Paint",
      "content": "Paint or stain your desktop. After the glue has had time to dry completely, apply 2-3 coats of paint or stain in the shade of your choice to your desktop. To achieve full coverage, brush or wipe on your color both with and against the pattern of the wood grain. Let each coat of paint or stain dry to the touch before applying follow-up coats. [9] X Research source Add stain one layer at a time until you get the desired depth of color, wiping off the excess pigment between coats. [10] X Research source When you’re satisfied with the appearance of your newly-finished desktop, allow it to dry for at least 24 hours."
    },
    {
      "title": "Cut your own custom desk legs using 2x4 boards.",
      "content": "Cut your own custom desk legs using 2x4 boards. Start by sawing a 2x4 board into 2 pieces that are the same width as your desktop, minus the width of the two legs that will go on either side. These pieces will serve as supports to brace the desk from beneath. Once you’ve done this, cut your remaining wood into 4 identical legs. Their length should correspond to the desired height of your desk, minus the width of the boards making up the desktop. [11] X Research source Note that 2x4 boards are actually only 1.5 inches (3.8 cm) thick, not a full 2 inches (5.1 cm). This means that if your desktop is 24 inches (61 cm) wide, each of your support pieces will need to be 21 inches (53 cm) to allow enough room for a leg on either side. Similarly, you’ll need to subtract 1.5 inches (3.8 cm) from your initial table leg measurements to reflect the thickness of the desktop—you want your desk to sit 28 inches (71 cm) off of the ground, for example, each of your legs will need to be 26.5 inches (67 cm) long. Paint or stain your table legs to match your desktop, or leave them unfinished to provide some visual contrast."
    },
    {
      "title": "Purchase premade desk legs to give your desk a more polished look.",
      "content": "Purchase premade desk legs to give your desk a more polished look. You can find premade desk and table legs at most hardware stores and home improvement centers, as well as certain specialty furniture stores like IKEA. They’re available in a variety of lengths, shapes, and materials, which means you’re sure to find the perfect set to complete the style of desk you’ve envisioned. [12] X Research source Metal legs, for instance, could give a lightly-stained wooden desk a sleek, minimalistic modern air, while square frames can keep the underside of a desk from looking so open without sacrificing valuable storage space. [13] X Research source"
    },
    {
      "title": "Use other items as improvised legs for a thrifty and unique approach.",
      "content": "Use other items as improvised legs for a thrifty and unique approach. Keep in mind that you’re not limited to simple 2x4 or premade legs. You might also turn a few old wooden pedestals into one-of-a-kind decorative stands to lend your desk added personality, or even just secure your desktop to a pair of sawhorses for a clever, no-fuss solution. The possibilities are virtually endless! [14] X Research source Think outside the box and keep your eyes peeled for interesting materials and objects that you think might make good legs for a homemade desk. Examples of other unusual items you could utilize as legs include plywood sheeting, bamboo, industrial pipe, telescopic metal poles, or even modified wooden crates or pallets. [15] X Research source"
    },
    {
      "title": "Attach your desk legs to the bottom of your desktop using wood screws.",
      "content": "Attach your desk legs to the bottom of your desktop using wood screws. To fasten legs cut from 2x4 boards, drill 2 screws through the outer edge of each leg and into the end of the central support piece on each side of the desk. Then, sink another screw every 7 inches (18 cm) along the length of the support. Jostle your desk gently when you’re finished to confirm that it’s stable. [16] X Research source Store-bought desk legs typically have screw holes molded into the ends to make the assembly process a cinch. You may need to get creative when it comes to putting on legs made from converted or salvaged materials, depending on the general shape and configuration of the pieces."
    },
    {
      "title": "Buy or build drawers to keep your work materials organized.",
      "content": "Buy or build drawers to keep your work materials organized. A few pull-out drawers can come in handy for stashing things like documents, devices, and spare office supplies. To add drawers to your desk, it will first be necessary to install slide hardware or a separate wooden frames along the underside of the desktop, then guide your drawers into position inside the slots. Make sure the drawers you use are a suitable size for your desk’s overall dimensions. Antique stores and thrift shops are good place to hunt for old furniture containing drawers that you might be able to transplant into your homemade desk."
    },
    {
      "title": "Substitute other furniture items to maximize your storage potential.",
      "content": "Substitute other furniture items to maximize your storage potential. For some people, a couple sliding drawers just won’t cut it. If you need to create as much built-in storage space as possible, one thing you can do is forego legs altogether in favor of supports that double as their own storage solutions, such as bookshelves, metal racks, or filing cabinets. Just align your items with the edges of your desktop, screw or bolt it on, and get to work! Choose storage pieces that are approximately the same height that you want your desk to be. If you like, you could even cut legs for one side of your desk and place a cabinet or shelf on the opposite side to get the best of both worlds."
    },
    {
      "title": "Add a hole to the back of the desk to hide your devices’ electrical cords.",
      "content": "Add a hole to the back of the desk to hide your devices’ electrical cords. Fit your drill with a hole saw attachment and use it to make an opening in an inconspicuous spot along the desk’s rear edge. Slip a plastic grommet of the same size into the hole to cover the exposed edges of the wood, then thread the cables for your computer, keyboard, printer, scanner, and other electronic equipment through the hole to keep them bundled together out of sight. [17] X Research source Creating a hidden cord hole can be a good way to keep all those pesky wires and cables organized and out of the way, especially if you plan on positioning your desk flush against the wall of your work space. Hole saws come in a variety of diameters, ranging from less than 1 in (2.5 cm) to 6 inches (15 cm). Use the size that you think will work best to contain all of the cords for your various devices. [18] X Research source"
    },
    {
      "title": "Mount your desktop on the wall to make a floating desk.",
      "content": "Mount your desktop on the wall to make a floating desk. A minimalistic floating desk can make a savvy and attractive alternative to a traditional leg-supported desk if storage isn’t a major concern. Simply attach a pair of brackets to your wall at the desired height and fasten your desktop to the brackets. You can use all the time you save to catch up on all those unanswered emails you have sitting in your inbox. [19] X Research source Floating desks can make for tidier workspaces, as they enable easy cleaning and leave the floor open for separate storage solutions or additional furniture or accessories. Mount your desk at around chest height to make a standing desk that also functions as an inconspicuous shelf when you’re not working."
    },
    {
      "title": "Make an L-shaped desk to double your work area.",
      "content": "Make an L-shaped desk to double your work area. Putting together an L-shaped desk is as simple as cutting, sanding, and painting a second desktop and securing it perpendicularly to one of the edges of the first. The add-on only requires slightly more work, but can end up offering you twice the amount of space (or more), which can be a big benefit if you’re an artist, avid crafter, or just really, really busy. [20] X Research source To avoid complicating things, use the same type of wood for both sections of your L-shaped desk. Remember that you’ll need to attach 2 additional legs or another rack, shelf, or cabinet to support the extension."
    }
  ]
}