{
  "url": "https://www.wikihow.com/Cook-Ham-Hocks",
  "title": "How to Cook Ham Hocks",
  "steps": [
    {
      "title": "Make a brine to keep the ham hocks moist and flavorful.",
      "content": "Make a brine to keep the ham hocks moist and flavorful. In a large bowl, mix 8 cups (1.9 L) of water with ¾ cup (96 grams) of salt and ¾ cup (96 grams) of brown sugar for every 5 pounds (2.3 kg) of ham hocks. [1] X Research source Stir all the brine ingredients together with a spoon or whisk until the salt and sugar are completely dissolved. To add more flavor to your ham hocks, add additional spices or seasonings to your brine, such as 2 bay leaves or 1 teaspoon (4.2 grams) of black peppercorns. [2] X Research source"
    },
    {
      "title": "Place the ham hocks into the brine.",
      "content": "Place the ham hocks into the brine . Add each of the ham hocks to the bowl holding the brine one at a time. As you place them in the bowl, make sure that each piece gets completely coated. [3] X Research source Once all are coated with the brine, cover the bowl with a lid. If the bowl holding the brine isn’t large enough to hold all the ham hocks, you can separate the brine evenly into 2 or more bowls or large resealable plastic baggies. Then, divide up the ham hocks and add the appropriate number to each bowl or baggie of brine and cover or close to prevent any leaking."
    },
    {
      "title": "Refrigerate the ham hocks in the brine for 3 to 7 days.",
      "content": "Refrigerate the ham hocks in the brine for 3 to 7 days. To give the ham hocks time to soak up the liquid, place them in the refrigerator and let them rest for 3 to 7 days. This will ensure that the meat won’t dry out in the smoker. If your ham hocks are brining in resealable baggies, you may want to flip the bags over every day or so to ensure that the brine is evenly distributed across the ham hocks. [4] X Research source"
    },
    {
      "title": "Dry the ham docks on a rack in the refrigerator.",
      "content": "Dry the ham docks on a rack in the refrigerator. Remove the brining ham hocks from the refrigerator. Take the ham hocks out of the brine and rinse them briefly under cold water. Then, lay the ham hocks on a rack and place the rack in the refrigerator for 1 to 24 hours. [5] X Research source This will help the ham hocks absorb more smoke flavor once you put them in the smoker. You may want to lay a towel or baking sheet underneath the rack in the refrigerator to keep the ham hocks from dripping any residual brine or juice."
    },
    {
      "title": "Heat up your smoker to 200 °F (93 °C).",
      "content": "Heat up your smoker to 200 °F (93 °C). If you are using an electric smoker , turn on the smoker and set the temperature to 200 °F (93 °C). If you’re using a charcoal smoker, light the smoker and let it heat up until the temperature reaches 200 °F (93 °C). If you don’t have a smoker, you can turn your oven into a temporary smoker by placing water-moistened wood chips in a roasting pan on the bottom shelf. Cover the pan loosely with aluminum foil so that a bit of smoke can escape out the sides and preheat the oven to 200 °F (93 °C). [6] X Research source"
    },
    {
      "title": "Put the ham hocks in the smoker.",
      "content": "Put the ham hocks in the smoker. Remove the ham hocks from the rack in the refrigerator and place them directly on the grates in the smoker. Make sure that the ham hocks are spread out enough so that none are touching each other. [7] X Research source Close the lid to let the ham hocks begin to cook. If you’re using your oven as a makeshift smoker, place the ham hocks directly on the oven rack right above the rack holding the roasting pan with wood chips."
    },
    {
      "title": "Smoke until the internal temperature reaches 150 °F (66 °C).",
      "content": "Smoke until the internal temperature reaches 150 °F (66 °C). Leave the ham hocks on the smoker for about 2 to 6 hours. Use a meat thermometer to check the internal temperature of the ham hocks every hour or so until the thermometer reads 150 °F (66 °C). Once they’ve reached 150 °F (66 °C), remove the ham hocks from the smoker. The amount of time it will take to fully cook the ham hocks varies greatly depending on the type of smoker that you have. As a result, it's important that you use a meat thermometer to check the internal temperature every so often so that the ham hocks don’t overcook and dry out."
    },
    {
      "title": "Eat or freeze the smoked ham hocks within 1 week.",
      "content": "Eat or freeze the smoked ham hocks within 1 week. Once your ham hocks are cooked, you can serve them immediately, save them in the refrigerator for up to 1 week, or freeze them for future use within 1 week. [8] X Research source Smoked ham hocks are great in soups , with rice , black beans , or collard greens, or eaten on their own."
    },
    {
      "title": "Preheat the oven to 350 °F (177 °C).",
      "content": "Preheat the oven to 350 °F (177 °C). To make crispy, roasted ham hocks in the oven, you’ll first need to preheat the oven. Set the oven to preheat to 350 °F (177 °C). You can then prepare the ham hocks while the oven is heating up. [9] X Research source"
    },
    {
      "title": "Score the skin and fat of each of the ham hocks.",
      "content": "Score the skin and fat of each of the ham hocks. Using a sharp knife, carefully create thin slice marks in a crisscross pattern across the skin and fat layers of each of the ham hocks. Avoid pressing down too hard with the knife, as you want to avoid cutting into the meat below the skin and fat layers. [10] X Research source Scoring the top layers will help the ham hocks absorb the salt and seasoning, adding more flavor to the final dish."
    },
    {
      "title": "Rub your choice of seasonings onto the outside of the ham hocks.",
      "content": "Rub your choice of seasonings onto the outside of the ham hocks. Pour a liberal amount of salt, pepper, pork seasoning, caraways seeds, or any seasonings of your choosing onto the outside of the ham hocks. Then, rub the seasoning into the scored slices on the skin and fat layers. [11] X Research source Rubbing seasoning onto the ham hocks will help tenderize and flavor the meat. The amount of seasoning you’ll need will depend on how strong you want the seasoning flavor to be, as well as how big the ham hocks are. As a starting point, though, try using about 2 tablespoons (28.3 grams) of the seasoning of your choice, then add more as needed."
    },
    {
      "title": "Place the ham hocks into a large roasting pan with water.",
      "content": "Place the ham hocks into a large roasting pan with water. After seasoning your ham hocks, put each of the ham hocks into a large roasting pan with the meatiest part of the hocks facing down. Spread the ham hocks out so that they don’t touch each other. Then, add enough water to fill up the bottom 1 inch (2.5 cm) of the roasting pan. [12] X Research source When pouring in the water, avoid pouring the water on top of the ham hocks. Try to keep the skin and fatty layers dry so that they will crisp while they roast."
    },
    {
      "title": "Add any additional ingredients you want to roast with the ham hocks.",
      "content": "Add any additional ingredients you want to roast with the ham hocks. When oven-roasting ham hocks, you can cut down on your meal prep and cooking time by roasting any side items or other ingredients in the same pan. Onions, potatoes, and quartered apples, for example, can all be roasted alongside ham hocks. [13] X Research source Roasting vegetables or other side items in with the ham hocks will also add a bit of extra flavor to the ham hocks as the cook."
    },
    {
      "title": "Roast the ham hocks in the oven for 3 to 4 hours.",
      "content": "Roast the ham hocks in the oven for 3 to 4 hours. Place the roasting pan with the ham hocks, water, and any additional ingredients into the oven, being careful not to let the water splash onto the tops of the ham hocks. Leave the ham hocks to roast in the oven for about 3 to 4 hours, or until the internal temperature reaches 165 °F (74 °C). [14] X Research source If the ham hocks are particularly small, you may want to start checking the internal temperature with a meat thermometer after 2 hours instead of waiting until 3 hours."
    },
    {
      "title": "Remove the ham hocks once they are cooked through.",
      "content": "Remove the ham hocks once they are cooked through. Once the ham hocks reach an internal temperature of at least 165 °F (74 °C), you can turn off the oven. Using oven mitts, remove the roasting pan from the oven. [15] X Research source Wait a few minutes for the ham hocks to cool before serving. [16] X Research source When the ham hocks are done, the tops should appear crispy and browned and the meat should pull easily away from the bone. For a traditional German dish, serve your roasted ham hocks with potatoes and sauerkraut. [17] X Research source"
    },
    {
      "title": "Fill a large pot with water.",
      "content": "Fill a large pot with water. Choose a pot that is large enough to hold all the ham hocks you are cooking. Then, fill the pot about ¾ of the way up with water, making sure that you leave enough space at the top so that the water doesn’t spill over when you add the ham hocks, or when the water begins to boil. To add more flavor, you can use vegetable or chicken broth instead of water, or use equal parts broth and water. [18] X Research source"
    },
    {
      "title": "Wash the ham hocks with cold water.",
      "content": "Wash the ham hocks with cold water. To make sure that the meat is clean before boiling, rinse each of the ham hocks with cold water in your kitchen sink. This will help remove any impurities from the meat and cut down on the fatty residue that will float to the top while the ham hocks boil. [19] X Research source Since you’ll be putting the washed meat straight into a pot, there is no need to pat them dry after rinsing."
    },
    {
      "title": "Place the rinsed ham hocks in the pot.",
      "content": "Place the rinsed ham hocks in the pot. Put them in the pot gently one at a time to ensure that the water doesn’t spill over. Make sure that each ham hock is totally submerged with about 1 inch (2.5 cm) of water between the top of the ham hocks and the water line. If the water line gets too close to the top as you add the ham hocks, you may need to pour a bit of the water out into the sink."
    },
    {
      "title": "Add in seasoning and vegetables for more flavor.",
      "content": "Add in seasoning and vegetables for more flavor. If you want to add a bit more flavor to the ham hocks while they cook, you can add the seasonings or vegetables of your choice to the water before boiling. Adding 1 teaspoon (4.2 grams) of black peppercorns, 1 to 2 sliced onions, 1 teaspoon (4.2 grams) of garlic, 2 or 3 stalks of celery, or 1 teaspoon (4.2 grams) salt, for example, can all add a lot of flavor to your ham hocks as they cook. [20] X Research source You can also boil the ham hocks in the same pot as other ingredients for your dish, such as beans or potatoes. To do this, simply add the beans or potatoes to the pot before boiling."
    },
    {
      "title": "Bring the water to a boil.",
      "content": "Bring the water to a boil. Once you’ve added the ham hocks and any other desired ingredients to the pot, turn the stovetop on high. Leave the temperature on high until the water reaches a boil. [21] X Research source"
    },
    {
      "title": "Let the ham hocks simmer for 2 to 4 hours.",
      "content": "Let the ham hocks simmer for 2 to 4 hours. Once the water reaches a strong boil, reduce the stovetop heat to the low or medium setting so that the water continues to simmer without spilling over. The exact cooking time will vary depending on how many ham hocks you’re cooking, how big they are, and the water temperature. Therefore, it can be helpful to begin checking on the meat after 2 hours to make sure they don’t overcook. [22] X Research source You can leave the pot uncovered, or cover it with a lid if you want the ham hocks to cook faster. If you do cover the pot, check on it every 30 minutes or so to make sure that the water stays at a simmer and doesn’t begin to boil over the sides."
    },
    {
      "title": "Check if the meat pulls easily away from the bone.",
      "content": "Check if the meat pulls easily away from the bone. To see if the ham hocks are done boiling, remove 1 of the pieces from the simmering water. Use a fork to try to pull off a small piece. If the meat easily pulls away from the bone, the ham hocks are done. If they are still a bit tough, stuck to the bone, or not quite tender, place the meat back into the pot and continue to boil as needed. [23] X Research source"
    },
    {
      "title": "Remove the cooked ham hocks from the boiling water.",
      "content": "Remove the cooked ham hocks from the boiling water. Once the ham hocks are cooked and the meat pulls easily away from the bone, turn off the stovetop and carefully remove them from the water with a large spoon. Place the ham hocks on a cutting board or plate and let them cool for a few minutes before trimming, chopping, or enjoying right off the bone. [24] X Research source Use the boiled ham hocks in a soup, stew, casserole, or enjoy with potatoes and a salad. If you plan to eat your boiled ham hocks alone and want to crisp the skin a bit, you can bake them in a pan in the oven at 450 °F (232 °C) for about 20 minutes or on the broil setting for about 5 to 10 minutes. [25] X Research source"
    }
  ]
}