{
  "url": "https://www.wikihow.com/Add-Contacts-to-Gmail-Using-a-CSV-File",
  "title": "How to Add Contacts to Gmail Using a CSV File",
  "steps": [
    {
      "title": "Export a CSV file from Gmail.",
      "content": "Export a CSV file from Gmail. This can provide a template for which fields Gmail will accept for CSV importing. [1] X Research source If you are having problems exporting without any contacts, try manually adding a single contact to create an export file. If you are importing a CSV from another email service, you can skip to the import method . If you want to create CSV file from scratch, a full list of the field headers can be found here ."
    },
    {
      "title": "Open the CSV file",
      "content": "Open the CSV file with a spreadsheet or text program. The first line of the CSV will display the different categories for data entry (e.g. First Name, Last Name, email, etc.). Spreadsheets will separate these categories into different cells, while text editors will list these values on the first line separated by commas. Microsoft Excel or Google Sheets will work for working with a spreadsheet, Notepad or TextEdit will work for working with a plaintext file. [2] X Research source"
    },
    {
      "title": "Add your contacts to the CSV.",
      "content": "Add your contacts to the CSV. Enter information to the related cell or list values in order. If no value is needed for a certain area, the cell can be left blank, or in the case of a text file, filled with a “,”. For example, a First Name, Last Name, Telephone, Email on a text file could be “John,,,john@email.com”. Make sure to not to remove any fields or to include a comma in place of a blank field in the case of a text file. Gmail will scan for all fields, so missing fields will cause problems with the import."
    },
    {
      "title": "Open the “File” menu and select “Save”.",
      "content": "Open the “File” menu and select “Save”. Changes to the CSV file must be saved before they can be imported into your Gmail account. [3] X Research source"
    },
    {
      "title": "Navigate to Google Contacts in your web browser.",
      "content": "Navigate to Google Contacts in your web browser."
    },
    {
      "title": "Sign into your Google/Gmail account.",
      "content": "Sign into your Google/Gmail account. Enter your username and password and click “Sign in”. You will be redirected to your Google Contacts page."
    },
    {
      "title": "Click the “Import Contacts” button.",
      "content": "Click the “Import Contacts” button. This button is listed in the left panel and will open an import popup window. [4] X Research source If you are using the new Contacts preview, this button will be labeled “Contacts”. The preview does not currently support importing contacts and you will be redirected to the old contacts interface and will need to redo this step."
    },
    {
      "title": "Click “Choose File”.",
      "content": "Click “Choose File”. [5] X Research source"
    },
    {
      "title": "Select your .CSV file to upload.",
      "content": "Select your .CSV file to upload. Browse for the file you exported or created and click “Open”. The file will be added to the import popup window."
    },
    {
      "title": "Click “Import”.",
      "content": "Click “Import”. After a few moments the import will complete and your contacts will appear listed on your Contacts page. [6] X Research source If you find that your contacts did not import correctly (i.e. information imported into the wrong field), you may have removed a field or missed a comma on your CSV file. If you imported many contacts, it may be easier correct the CSV file, delete all imported contacts, and re-import, rather than editing each contact one by one."
    }
  ]
}