{
  "url": "https://www.wikihow.com/Clean-a-Shower-Curtain",
  "title": "How to Clean a Shower Curtain",
  "steps": [
    {
      "title": "Place the shower curtain or liner into your washing machine.",
      "content": "Place the shower curtain or liner into your washing machine. To start, remove the shower curtain from the wall in your bathroom. Then, place it in your washing machine. [1] X Research source Make sure you remove any metal hooks that may be on the shower curtain before placing it in your washing machine."
    },
    {
      "title": "Place one or two towels into the washing machine.",
      "content": "Place one or two towels into the washing machine. This helps prevent the shower curtain or liner from wrinkling, sticking to itself, and being torn apart in the machine. The towels also scrub the shower curtain while the washing machine is going. Take one to two white towels and throw them into the washing machine. The towels you use should be clean. [2] X Research source"
    },
    {
      "title": "Add baking soda and detergent.",
      "content": "Add baking soda and detergent. Add the normal amount of laundry detergent you would use for a load of laundry. From there, add half a cup to a cup of baking soda. Bigger shower curtains will require more baking soda. [3] X Research source"
    },
    {
      "title": "Start the machine.",
      "content": "Start the machine. Turn on your washing machine. Select the highest cleaning level. Wash your shower curtain in warm water. [4] X Research source"
    },
    {
      "title": "Use bleach for built-up stains.",
      "content": "Use bleach for built-up stains. For mildly dirty shower curtains, you do not need anything other than baking soda and detergent. However, if there is a lot of mildew and other stains on your curtain, add bleach. After adding your baking soda and detergent, turn the machine on. Pour in half a cup of bleach as the washer fills with water. [5] X Research source Only add bleach if your shower curtain is white or transparent."
    },
    {
      "title": "Add vinegar during the rinse cycle.",
      "content": "Add vinegar during the rinse cycle. When the washing machine switches to the rinse cycle, open the machine. Pour in a half cup to a cup of the distilled vinegar. Restart the machine and allow it finish the cycle. [6] X Research source"
    },
    {
      "title": "Hang the shower curtain or liner to drip-dry.",
      "content": "Hang the shower curtain or liner to drip-dry. Never dry a shower curtain. Instead, hang it back up in the shower after it's done in the washing machine. It should drip dry on its own from there. [7] X Research source"
    },
    {
      "title": "Add baking soda to a dampened cloth.",
      "content": "Add baking soda to a dampened cloth. Get a clean microfiber cloth slightly damp. Then, sprinkle baking soda over the cloth so the cloth is coated in a light layer of baking soda. [8] X Research source"
    },
    {
      "title": "Scrub down the entire shower curtain.",
      "content": "Scrub down the entire shower curtain. Use your cloth to scrub down the curtain. Give the curtain a light scrub at first, leaving set-in stains alone for now. Focus on removing basic grime and dirt only. [9] X Research source"
    },
    {
      "title": "Rinse with warm water.",
      "content": "Rinse with warm water. Take a new cloth and get it damp with warm water. Swipe it over the shower curtain to remove all of the baking soda and water. Make sure to scrub the curtain until all traces of baking soda are gone. Add more water to the cloth as necessary. [10] X Research source"
    },
    {
      "title": "Clean any remaining stains.",
      "content": "Clean any remaining stains. After giving the shower curtain a general cleaning, get your cloth damp again and sprinkle it with baking soda. Scrub out any set in soap stains or mildew this time around. Focus on areas you glossed over during the first round of cleaning. [11] X Research source"
    },
    {
      "title": "Rinse the curtain again.",
      "content": "Rinse the curtain again. Get another clean cloth damp with warm, clean water. Rub down the shower curtain again to remove any baking soda residue. [12] X Research source Do not leave any lingering baking soda on the shower curtain. Make sure you keep rinsing the shower curtain until your cloth runs clean."
    },
    {
      "title": "Spot test any cleaner first.",
      "content": "Spot test any cleaner first. Before applying detergents, cleaners, or bleach to a shower curtain, test out the cleaners on a small portion of the curtain. Make sure they do not cause discoloration or damage. If you notice any damage, opt for a different cleaner."
    },
    {
      "title": "Read the care label.",
      "content": "Read the care label. Before washing a shower curtain, give the care label a close read. Most shower curtains can be washed in the washing machine with detergent or bleach, but some are hand wash only. Others may require specific types of cleaning. Always read the care label over carefully before washing your curtain. [13] X Research source"
    },
    {
      "title": "Maintain a clean shower curtain.",
      "content": "Maintain a clean shower curtain. After cleaning your shower curtain, take steps to make sure mold and mildew do not build up in the future . Spray down the shower curtain with a mixture of half water and half vinegar each day. Wash the bottom of the shower curtain with vinegar and water each week to remove any soap scum and mildew building up on the bottom of the curtain. [14] X Research source Go for body wash over bar soaps, as bar soaps can cause scum."
    }
  ]
}