{
  "url": "https://www.wikihow.com/Celebrate-Janmashtami",
  "title": "How to Celebrate Janmashtami",
  "steps": [
    {
      "title": "Begin fasting at dawn.",
      "content": "Begin fasting at dawn. One of the predominant and most pervasive aspects of celebrating Janmashtami is fasting. To start your day of celebration, begin fasting at dawn and avoid eating until midnight. [1] X Research source Among most Hindus, it’s generally acceptable for the young (7 or younger) or the infirm to not take part in the fast. Many Hindus also allow for the consumption of water, fruits, and milk throughout the fast, while meat, grains, and liquors are strictly forbidden during the Janmashtami fast."
    },
    {
      "title": "Participate in group devotional songs and chants.",
      "content": "Participate in group devotional songs and chants. Singing kirtan, or songs of devotion, glorification, or praise, is another important element of Janmashtami celebrations that takes place in most temples. Sing songs or repeat chants that praise Krishna in a group with other celebrators. An example of a chant you could do would be the Hare Krishna mantra. Taking part in a kirtan in a group is a very good way of building a sense of community with the people around you and is thus a very important part of Janmashtami celebrations in many temples."
    },
    {
      "title": "Prepare flower garlands and other decorations for the temple.",
      "content": "Prepare flower garlands and other decorations for the temple. During Janmashtami, the temple is elaborately decorated, not only to welcome the god Krishna, but also to create a festive ambience. Help decorate the temple to take part in both the religious and festive elements of the holiday. If you don’t normally attend services at the temple, you might want to call ahead and inform them that you would like to come and take part in Janmashtami festivities. They will be very glad to have you. Flower garlands are the most common decorations used during Janmashtami, but hanging festoons of leaves and balloons are also popular ways of decorating Hindu temples. Any colorful variety of flower will do."
    },
    {
      "title": "Read from religious scriptures and watch religious reenactments.",
      "content": "Read from religious scriptures and watch religious reenactments. Many temples organize their activities during Janmashtami around parts of Hinduism’s holy texts. If offered, consider reading from these texts to other devotees, or simply watch others perform dramatic reenactments of scenes from these texts. [2] X Research source The texts most commonly read from or acted out during Janmashtami celebrations include the Bhagavad Gita and the Bhagavata Purana."
    },
    {
      "title": "Bathe and clothe the Krishna idol with other devotees.",
      "content": "Bathe and clothe the Krishna idol with other devotees. Washing the deity of Krishna and dressing it in new clothes is another important aspect of Janmashtami as it’s celebrated in many temples. Take part in this cleaning and clothing process if you’re unable or unwilling to help decorate the temple or read from religious scripture. [3] X Research source The deity is bathed in a variety of auspicious liquids, including fragrant water, milk, or honey. This ablution ceremony is called the abhisheka. Although there’s no specific material you should use to clothe the Krishna idol, the clothes themselves should be colorful."
    },
    {
      "title": "Witness the unveiling of the Krishna idol at midnight.",
      "content": "Witness the unveiling of the Krishna idol at midnight. At midnight, priests pull apart the curtains that typically hide the deity of Krishna to reveal the newly bathed and clothed deity on its decorated altar. Be sure to be present for this unveiling and take part in the kirtan that takes place immediately afterwards. The unveiling takes place at midnight because this is the time that devotees believe the god Krishna was born."
    },
    {
      "title": "Bring food to the temple as an offering.",
      "content": "Bring food to the temple as an offering. After the unveiling of the deity of Krishna at midnight, devotees break their fasts by sharing snacks and meals with one another and give up some food as a religious offering. Bring traditional Janmashtami snacks and dishes to the temple to take part in this important conclusion to the holiday. [4] X Research source Examples of snacks to bring include Sabudana Tikki, Roasted Makhana, Aloo Chaat, and Fruit Chaat. Sabudana Thalipeeth, Singhare ki poori, Dahi aloo, and Samvat rice khichdi are all examples of traditional dishes used as the main meal eaten during Janmashtami."
    },
    {
      "title": "Fast until midnight if possible.",
      "content": "Fast until midnight if possible. Fasting is an important component of celebrating Janmashtami wherever you are. Beginning at dawn, refrain from eating until midnight, other than consuming water, fruits, and milk, unless doing so would be a significant physical burden. [5] X Research source Note that the infirm and children under the age of 8 are generally not expected to fast. If you have guests, be as accommodating as possible. Encourage them to fast with you as part of the holiday, but don’t make it a requirement for them to take part in the festivities. Remember, Janmashtami is about showing love, both for Krishna and for others. If completely abstaining from food is too difficult, you can also eat light foods throughout the day to tide you over until midnight."
    },
    {
      "title": "Prepare traditional foods to eat and to offer to Krishna.",
      "content": "Prepare traditional foods to eat and to offer to Krishna. At midnight, the hour of Krishna’s birth, devotees are able to break their fast and share traditional meals with one another. At this hour, you can also give food as an offering for Krishna. Examples of snacks to eat at midnight might include Sabudana Tikki, Roasted Makhana, Aloo Chaat, and Fruit Chaat. Sabudana Thalipeeth, Singhare ki poori, Dahi aloo, and Samvat rice khichdi are all examples of traditional dishes used as the main meal eaten during Janmashtami. Any of these foods can also be used as your offering. There is no set guideline for how much food to include in your offering, but a helpful rule of thumb would be to have each person offer 1 dish."
    },
    {
      "title": "Decorate your home with garlands, balloons, and leaves.",
      "content": "Decorate your home with garlands, balloons, and leaves. As part of your celebration of Janmashtami, you should invite friends over to your home and collectively decorate it to create a festive ambience. These decorations will also serve to welcome the god Krishna into your home at midnight. Place potted plants and bouquets of colorful flowers around your home and near the idol of Krishna. Decorative light garlands can also be strung up around windows and door frames, while colorful balloons are inflated and left to float in ceiling corners. Flower garlands, balloons, and festoons of leaves are all popular decorations used in Hindu temples during Janmashtami and are also suitable for decorating your home for Krishna."
    },
    {
      "title": "Watch a webcam broadcast of Janmashtami temple services.",
      "content": "Watch a webcam broadcast of Janmashtami temple services. Many temples around the world will broadcast their festivities over the web for those who can’t physically attend the celebration. Tune in to these broadcasts and, if you or your guests are willing, take part in the songs and chants as they’re performed. [6] X Research source The songs that are sung typically come from the Vaishnava songbook, although you can simply watch others sing if you don’t know the words or don’t feel like singing."
    },
    {
      "title": "Dress your children up as Krishna.",
      "content": "Dress your children up as Krishna. In certain parts of India, Janmashtami celebrations involve children dressing up as Lord Krishna and going around to visit friends and family. Use a dhoti, crown, and various accessories to make celebrating Janmashtami more fun for the children! [7] X Research source Yellow is the most widely used color for the dhoti, although any festive color (e.g., bright blue, red, etc.) will also work. Some accessories you can use to add to your child’s outfit include a peacock feather for the crown, a waistband, an arm band, and some lightweight jewelry."
    },
    {
      "title": "Attend any festivals or events in your area.",
      "content": "Attend any festivals or events in your area. If you can’t make it to a temple to celebrate Janmashtami, taking part in a local festival or parade is another great way to spend the holiday. Check to see if any festivities will be taking place in your city or wider area during the holiday and consider taking your family out to participate. [8] X Research source These festivities often include markets selling sweet treats and decorations, as well as people performing the types of reenactments you might expect to see in a temple. Janmashtami festivals are also excellent occasions for dressing your children as Krishna and letting others compliment them on their outfits!"
    },
    {
      "title": "Bathe and clothe your Krishna deities if you have them.",
      "content": "Bathe and clothe your Krishna deities if you have them. Washing the deity of Krishna and dressing it in new clothes is another important aspect of Janmashtami as it’s celebrated in many temples. If you have deities of Krishna in your home, have your guests participate in bathing the deities in fragrant water and dressing them in new clothes as part of your celebrations. [9] X Research source If you don’t have fragrant water, you can also use milk or honey to bathe your Krishna deities. The ceremony of bathing and clothing the Krishna idol is called the abhisheka. Use colorful clothing of any material to clothe the Krishna idol."
    },
    {
      "title": "Hold a worship ceremony at midnight.",
      "content": "Hold a worship ceremony at midnight. Finally, at midnight, it is time to hold a ceremony to worship Krishna and welcome the god into your home. This ceremony should include a kirtan, or song of devotion, glorification, or praise, and could include ceremonial paraphernalia, such as a blowing shankha and incense, if you have them. [10] X Research source Note that you don’t need to have ceremonial paraphernalia in order to have a successful worship ceremony. What ultimately matters is that you offer what you can to Krishna and do so out of love and devotion."
    }
  ]
}