{
  "url": "https://www.wikihow.com/Apply-for-a-Marriage-License-in-New-York",
  "title": "How to Apply for a Marriage License in New York",
  "steps": [
    {
      "title": "Know who can marry in New York.",
      "content": "Know who can marry in New York. The state of New York does not require couples to be residents of New York to marry in the state. However, marriage licenses issued in New York must be used within the state of New York. [1] X Research source Certain restrictions do apply: Age. Individuals under 14 cannot get a marriage license. Applicants who are 14 or 15 years old must show written consent by both parents and a judge. This judge can be from a family court in the applicant’s county of residence. A judge from the New York Supreme Court may also provide the necessary assent. Applicants who are 16 or 17 must show written consent from both parents. No consent is necessary for applicants who are age 18 or older. [2] X Research source Family relationship. New York does not grant marriage licenses to ancestors and their descendants (e.g., parents and children, grandparents and grandchildren), siblings, or aunts/uncles and their nieces/nephews. First cousins may marry. As of 2015, same-sex couples can legally marry in all states. You may apply for a marriage license even if you already have a domestic partnership or civil union. The application procedures are the same as for heterosexual couples. [3] X Research source"
    },
    {
      "title": "Have one of the following documents as proof of your age and identity.",
      "content": "Have one of the following documents as proof of your age and identity. Each person must have at least one of the following documents when applying for a marriage license. You will also need to provide your Social Security Number if you have one. [4] X Research source Birth Certificate Baptismal record Naturalization record Census record If you are a refugee and do not have a birth certificate, you must get a signed and sealed record of your name, birth date, birth place, and parents’ names from your sponsoring agency. If the document is in a foreign language, you must provide a certified translation into English along with the original. A certified translation will be signed, dated, and contain a statement that attests the accuracy of the translation. [5] X Research source"
    },
    {
      "title": "Bring a form of photo ID.",
      "content": "Bring a form of photo ID. In addition to the birth-related document, each person must provide an accepted form of photo ID. New York accepts the following types of documents: Driver’s license Passport Employment picture ID Immigration record"
    },
    {
      "title": "Provide documentation of previous marriages.",
      "content": "Provide documentation of previous marriages. If either you or your partner were previously married, you must furnish information about those marriages on the application. You must say whether the former spouse is living and whether the marriage ended by divorce, annulment, or death. [6] X Research source If divorced, you must be able to give your previous spouse’s full legal name, the date that the divorce decree was finalized, and the city, state, and country that issued the divorce. [7] X Research source You may also be required to show a certified copy of the divorce decree or other dissolution document."
    },
    {
      "title": "Make sure you have your parents’ information.",
      "content": "Make sure you have your parents’ information. The application for a marriage license requires you to give your parents’ birth names and country of birth."
    },
    {
      "title": "Decide on your surname.",
      "content": "Decide on your surname. If you wish to change your legal surname after marriage, the easiest way to do so is to indicate it on your application for the marriage license. Once your marriage is completed, the name you provide on the license application becomes your legal surname. [8] X Research source Surnames do not automatically change after marriage. You must choose your legal surname. One or both parties may choose to change their surnames. You do not have to change your surname to be legally married. In the state of New York, you must choose from the following options for the surname change: one spouse’s surname for both partners a surname that combines elements of both spouses’ surnames both spouses’ surnames, separated by hyphen"
    },
    {
      "title": "Go to the city or town clerk's office.",
      "content": "Go to the city or town clerk's office. You may get a marriage license valid in the state of New York at any city or town clerk’s office. Both parties must appear in person to apply for a marriage license. Each of you must bring the appropriate documentation listed above. A representative cannot apply for a marriage license on your behalf, even if the person has been granted a Power of Attorney. You cannot use a notarized marriage license affidavit to substitute for your personal appearance at the office. Some locations, such as New York City, allow you to fill out the application online. This will make the in-person application process faster. Both parties must still appear at the clerk's office to complete the application and sign the application."
    },
    {
      "title": "Fill out the application.",
      "content": "Fill out the application. If you do not fill out an online application first, you must complete the application in the office where you are applying for a license. [9] X Research source Read the application carefully to make sure you have not made any proofreading or other errors. It can be difficult to correct these errors after the license has been filed. The New York State Department of Health has a sample copy of a marriage license/certificate here ."
    },
    {
      "title": "Pay the New York marriage license fee.",
      "content": "Pay the New York marriage license fee. In most offices, you may use a money order or credit card to pay this fee. Some offices may also accept cash or checks, but you should contact them beforehand to make sure. If you apply for a marriage license in New York City, the fee is $35. The City Clerk of New York City accepts only credit card or money order as payment. [10] X Research source If you apply for a marriage license anywhere else in the state of New York, the fee is $40. [11] X Research source"
    },
    {
      "title": "Receive the marriage license as soon as the application is complete.",
      "content": "Receive the marriage license as soon as the application is complete. After you get your marriage license, you have 60 calendar days to complete the marriage ceremony. The counting period begins one day after issuance. [12] X Research source Military personnel may have 180 days to get married. [13] X Research source"
    },
    {
      "title": "Apply for a judicial waiver, if necessary.",
      "content": "Apply for a judicial waiver, if necessary. Once you get your marriage license, you must wait a minimum of 24 hours from the exact time of issuance. (For example, if you were issued your license at 10:48 A.M., you would not be eligible to marry until 10:48 A.M. the following day). However, if you must get married before this period is over -- for example, your spouse is being deployed in the military -- you may apply for a judicial waiver of the waiting period. [14] X Research source You must request a waiver from the county clerk’s office where you obtained your marriage license. A judge will give the waiver order. If you are 16 or older, you can request the waiver order from a judge of the county court in the county where at least one applicant resides. You can also request a waiver order from a justice of the New York Supreme Court. If you are under 16, the waiver order must come from a family court judge in the county where you reside."
    },
    {
      "title": "Verify the required signatures are on the marriage license after the wedding ceremony.",
      "content": "Verify the required signatures are on the marriage license after the wedding ceremony. Both spouses, a witness, and an eligible officiant must all sign the license for it to be valid. [15] X Research source There is no minimum legal age for a witness to a marriage ceremony. However, your witness should be able to sign his/her name and testify about the ceremony if necessary. There are many choices for an eligible officiant. Clergy or ministers of any religion, mayors of cities and towns, the city clerks of cities of more than a million people, federal judges, state judges, and justices of the peace can be officiants. Ship captains are not eligible officiants in the state of New York. If you wish to get married in the City of New York, your officiant must register with the City Clerk’s office in Manhattan. [16] X Research source The fee to register is $15. The registration requirement applies only to marriages performed in the five boroughs of New York City. After the wedding, the officiant should send the completed license back to the issuing city clerk's office for recording."
    }
  ]
}