{
  "url": "https://www.wikihow.com/Bandage-Fingers-or-Toes",
  "title": "How to Bandage Fingers or Toes",
  "steps": [
    {
      "title": "Determine the severity of the injury.",
      "content": "Determine the severity of the injury. Seek medical attention if the injury involves protruding bones, deep cuts or lacerations, numbness, or if large areas of skin have been removed. In the worst cases, some parts of skin or even the finger or toe may have been partly or entirely cut off. If this happens, put the appendage on ice and take it with you to the emergency care facility. [1] X Research source"
    },
    {
      "title": "Stop the bleeding.",
      "content": "Stop the bleeding. Apply pressure to the area using a sterile dressing or clean cloth until the bleeding stops. If the bleeding does not stop after five to 10 minutes of constant pressure, seek medical attention. If available, use Telfa bandages, which do not leave fibers in the wounds or impede clotting and are best."
    },
    {
      "title": "Clean the injured area thoroughly.",
      "content": "Clean the injured area thoroughly. Use fresh water, sterile dressing pads, or clean cloths. Wash your hands before you begin if you have time. Clean out any dirt or debris that may be located in the wound. Touching a fresh wound can be painful, but cleaning it thoroughly and carefully is important in order to prevent infection. Clean the area surrounding the wound, using sterile dressings dampened with saline or clean water. Wipe away from, not toward or into, the injury in all directions."
    },
    {
      "title": "Decide if the injury can be treated and bandaged at home.",
      "content": "Decide if the injury can be treated and bandaged at home. After the bleeding has stopped and the area has been cleaned, it is easier to see damage that was not clear at first, such as visible bone or bone fragments. Most injuries that occur to fingers and toes can be managed at home by using proper methods of cleaning, bandaging, and monitoring the injured area. [2] X Research source"
    },
    {
      "title": "Use a butterfly band-aid.",
      "content": "Use a butterfly band-aid. For deep cuts and lacerations, stitches may be needed. Apply a butterfly band-aid, if available, to pull together the split areas of the skin until you can get to a medical facility. Use several butterfly band-aids for larger areas. This will help to prevent infection, control the bleeding, and help the doctor to assess the area for stitches. If butterfly band-aids are not readily available, use regular band-aids and pull the skin together as tightly as possible. Avoid placing the adhesive part of the band-aid directly on the wound."
    },
    {
      "title": "Determine if a bone is broken.",
      "content": "Determine if a bone is broken. Symptoms of a broken bone can include pain, swelling, stiffness, bruising, deformity, and difficulty moving the finger or toe. Experiencing pain when putting pressure on the area or trying to walk can mean a bone has been fractured. [3] X Research source [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Manage broken bones or sprains at home.",
      "content": "Manage broken bones or sprains at home. In many cases, even broken bones and sprains can be managed at home. However, if the area looks deformed, is cold, pale, or without a pulse, this indicates the broken parts of the bone have separated from each other. Prompt medical attention is needed to realign the separated sections of bone. [5] X Research source [6] X Research source [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Treat a broken big toe.",
      "content": "Treat a broken big toe. Broken bones involving the big toe are harder to treat at home. Bone fragments can become dislodged, damage to ligaments or tendons may have occurred during the injury, and risks of infection and arthritis may be greater if the area does not heal properly. Consider seeking medical help if the big toe appears to be broken. [8] X Research source Buddy taping the injured toe to to its neighbor with a turn or two of medical tape will help support the broken toe while you go to the hospital."
    },
    {
      "title": "Apply ice to prevent swelling, reduce bruising, and reduce the pain.",
      "content": "Apply ice to prevent swelling, reduce bruising, and reduce the pain. Avoid applying ice directly to the skin. Ice can be placed in a baggie, then wrapped in a small towel or other material. Some finger and toe injuries do not involve cuts, scrapes, bleeding, or any areas of broken skin. The finger or toe may be sprained, or one of the bones may be broken, yet the skin is still intact. [9] X Research source [10] X Research source Apply the ice for 10 minutes at a time."
    },
    {
      "title": "Select a bandage that fits the injury.",
      "content": "Select a bandage that fits the injury. For minor cuts and scrapes, the purpose of the bandage is to prevent infection and promote healing. For more serious injuries, the bandage can help to prevent infection and provide protection for the injury while it heals. [11] X Research source"
    },
    {
      "title": "Use basic dressings to prevent infection.",
      "content": "Use basic dressings to prevent infection. A finger or a toe injury can involve damage to the skin, the nail, the nail bed, sprained ligaments and tendons, or broken bones. For injuries that only need protection from infection, simple dressings and regular band-aids will work fine. [12] X Research source"
    },
    {
      "title": "Dress the wound with sterile material.",
      "content": "Dress the wound with sterile material. If the skin is broken, then properly dressing the area will prevent infection and control further bleeding. Use sterile pads, sterile gauze (Telfa works best), or very clean materials to cover the entire wound. Try not to touch the sterile part of the dressing that will be directly in contact with the wound. [13] X Research source"
    },
    {
      "title": "Use antibiotic creams as a part of the dressing.",
      "content": "Use antibiotic creams as a part of the dressing. The risk of infection is increased with injuries that involve cuts, scrapes, or torn areas of the skin. Applying the antibiotic cream or ointment directly to the dressing is a good way to help prevent infection without directly touching the wound."
    },
    {
      "title": "Secure the dressing in place with a bandage.",
      "content": "Secure the dressing in place with a bandage. Bandages are to be applied not too tightly, but tight enough to keep the dressing in place. Bandages that are too tight can interfere with blood flow. [14] X Research source"
    },
    {
      "title": "Avoid loose ends from the bandage.",
      "content": "Avoid loose ends from the bandage. Be sure to cut or secure any loose ends from dressing material, bandages, or tape. This can cause pain, and possibly further damage, if the loose ends get caught or snagged on something. [15] X Research source"
    },
    {
      "title": "Leave the tip of the finger or toe exposed.",
      "content": "Leave the tip of the finger or toe exposed. Unless the tip is part of the injury, leaving it exposed helps to watch for changes that might indicate problems in circulation. Plus, if medical attention is needed, leaving the ends of fingers and toes exposed helps doctors to evaluate for nerve damage. [16] X Research source"
    },
    {
      "title": "Tailor your bandage to properly cover the tip if it is injured.",
      "content": "Tailor your bandage to properly cover the tip if it is injured. The fingers and toes can present challenges when they need to be bandaged. Gather materials that are larger than the area, so you can cut the large gauze, sterile dressing pads, and medical tape, in sizes suited to the area. [17] X Research source"
    },
    {
      "title": "Cut the bandage into a “T shape”, “X shape”, or “crisscross” shape.",
      "content": "Cut the bandage into a “T shape”, “X shape”, or “crisscross” shape. Cutting the material this way helps to securely cover the tips of the injured finger or toe. The cut pieces should be designed to be twice the length of the finger or toe. Apply the bandage along the length of the finger or toe first, then down the other side. Wrap the other ends around the area. [18] X Research source"
    },
    {
      "title": "Take caution not to wrap the area too tightly.",
      "content": "Take caution not to wrap the area too tightly. Use additional pieces of tape as need to secure the bandage in place. Also take care to cover all areas of broken skin with dressing materials, before applying the final bandage, in order to prevent infection. [19] X Research source"
    },
    {
      "title": "Provide support for a sprain or broken bone.",
      "content": "Provide support for a sprain or broken bone. The bandage you apply may need to provide protection, prevent infection, promote healing, act like a splint, and prevent further damage to the injured area. [20] X Research source"
    },
    {
      "title": "Use a splint for sprains or broken bones.",
      "content": "Use a splint for sprains or broken bones. A splint helps to immobilize the injury and prevent further, accidental injury. Select a splint that is the proper size for the injured digit. In some cases, a regular popsicle stick can be used as a splint. [21] X Research source [22] X Research source Try to immobilize the joint above and below the injury site with the splint. If the injury is to the first joint of the finger, this means try to immobilize the wrist and joints above the injury. This keeps the surrounding muscles and tendons from straining the injury or becoming damaged themselves."
    },
    {
      "title": "Place gauze or folded dressing pads along the area for cushion.",
      "content": "Place gauze or folded dressing pads along the area for cushion. Carefully folded pieces of dressing material can be used between the injured digit and the splint to provide some cushion and prevent irritation. [23] X Research source [24] X Research source [25] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Secure the splint in place.",
      "content": "Secure the splint in place. Use medical or paper tape to secure the splint, taking care not to wrap the area too tightly. Apply the medical or paper tape lengthwise first, with the digit on one side and the splint on the other, then wrap around the injured digit and the splint to keep it in place. Take caution not to wrap the area too tightly, but tight enough so the splint does not slide off. [26] X Research source [27] X Research source"
    },
    {
      "title": "Bandage the area using buddy taping.",
      "content": "Bandage the area using buddy taping. An adjacent finger or toe works just as well as a splint in most cases. Buddy taping helps to prevent free movement of the injured digit to allow the area to heal properly. [28] X Research source [29] X Research source [30] X Research source [31] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [32] X Research source Most commonly, fingers and toes 1 and 2, or 3 and 4, are paired or taped together. Always place small sections of gauze between the digits being paired to prevent irritation. [33] X Research source"
    },
    {
      "title": "Start by applying tape above and below the injury.",
      "content": "Start by applying tape above and below the injury. Cut or tear 2 sections of non-stretch, white, medical tape. Wrap each piece around the areas just above and below the injured joint or break in the bone, including the buddy digit in the wrapping. Be careful to wrap securely but not too tightly."
    },
    {
      "title": "Wrap additional sections of tape.",
      "content": "Wrap additional sections of tape. Once the digits are anchored to each other, proceed with wrapping additional sections of tape around both digits to secure them to each other. This method allows for the digits to bend together, but side to side movement will be restricted. [34] X Research source"
    },
    {
      "title": "Watch for blood under the nail.",
      "content": "Watch for blood under the nail. In some cases, blood can accumulate under the nail of the injured finger or toe, and can cause unwanted, added pressure and possible further damage to the injury. A medical procedure can be done to relieve the pressure."
    },
    {
      "title": "Keep up with your tetanus boosters.",
      "content": "Keep up with your tetanus boosters. Even minor cuts or scrapes may require a tetanus booster shot to prevent serious infections. Adults should get a tetanus booster every 5 to 10 years."
    },
    {
      "title": "Watch for new symptoms.",
      "content": "Watch for new symptoms. Developing a fever, chills, sudden numbness or tingling, or a sudden increase in pain or swelling warrants seeking medical help sooner, rather than later. [35] X Research source"
    },
    {
      "title": "Allow time to heal.",
      "content": "Allow time to heal. It usually takes about 8 weeks for a broken bone to heal. Sprains and joint injuries may heal more quickly. If problems linger, see a doctor. If symptoms get worse, such as pain and swelling, beyond the first 2 to 3 days, medical attention may be warranted."
    }
  ]
}