{
  "url": "https://www.wikihow.com/Convince-Your-Boyfriend",
  "title": "How to Convince Your Boyfriend",
  "steps": [
    {
      "title": "Write down your goal for the conversation.",
      "content": "Write down your goal for the conversation. Limit your conversation to a single issue for best results. If you have multiple things you want to convince your boyfriend of, that means you need to have multiple conversations. Start with the thing that's most important to you. [1] X Research source Here are some examples of things that you might want to convince your boyfriend about: Relationship issues : moving in together, getting married, having a child, healing your relationship after cheating, building trust, increasing intimacy Lifestyle changes : changing your diet, exercising more or being more active generally, quitting smoking or drinking, going green (recycling, reducing your carbon footprint), going vegan Other changes : getting a new pet, moving to a different city, starting a new job or project, doing chores at home"
    },
    {
      "title": "Be confident about what you want.",
      "content": "Be confident about what you want. People associate confidence with being right. If you seem unsure about whatever it is you want to convince him of, he's likely to be unsure as well. When speaking to him, don't use qualifiers or say things like \"I think\" or \"I believe.\" Instead, make a strong stand about what you want and why you want it. [2] X Research source If you want to convince him to move in together, you might say, \"We've been dating for 5 years now. We should move in together so we can see each other more and start building a life together.\""
    },
    {
      "title": "Be open and honest about why you want what you want.",
      "content": "Be open and honest about why you want what you want. Your boyfriend will be more likely to trust you and believe in what you're telling him if you're genuine about your motivation for it. If you have some sort of ulterior motive, you might come off as insincere. He's not likely to go along with what you want if he feels you're manipulating him. [3] X Research source For example, suppose you want you and your boyfriend to quit smoking or vaping. If your actual motivation is simply that most of your friends don't smoke anymore and you don't feel \"cool\" doing it, just say so. This can be powerful if your reasons are a bit embarrassing because you're making yourself vulnerable by sharing them."
    },
    {
      "title": "Adapt your approach to your boyfriend's emotional style.",
      "content": "Adapt your approach to your boyfriend's emotional style. Think about how your boyfriend best receives and processes information—that's how you want to present this thing to him. He'll be much more likely to agree with you if you approach him on his terms. [4] X Research source For example, does your boyfriend dislike being put on the spot? If you present the issue out of the blue and demand a decision immediately, his answer will probably be \"no.\""
    },
    {
      "title": "Find 2-3 reliable sources to back up your position.",
      "content": "Find 2-3 reliable sources to back up your position. If you're trying to convince your boyfriend about something that involves facts (not just your own emotions), gathering evidence shows him that you've actually thought it through and are taking it seriously—this isn't just some impulsive thing that you're going to forget about in a few days or a week. [5] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source For example, say you want to convince your boyfriend to adopt a dog with you. Research different breeds to figure out which ones fit your lifestyle. Then, check with breeders or local shelters to learn more about the adoption process. If you're proposing a lifestyle change, look for medical sources that highlight the possible health benefits. You can find reliable sources to back up your position on a relationship issue, too. For example, if you want to move in together, look for psychological articles on the benefits of moving in together."
    },
    {
      "title": "Anticipate concerns your boyfriend might have.",
      "content": "Anticipate concerns your boyfriend might have. You'll have a more productive conversation if you have good answers to some problems your boyfriend might raise. This also shows that you've thought through the topic from his perspective as well as your own. [6] X Research source For example, if you want to go vegan but your boyfriend loves bacon, look for good vegan alternatives to bacon that you can have him try. Many changes come with financial considerations. If you want to persuade your boyfriend to get a new pet with you, move to a different city, or buy a house, consider multiple financial scenarios. A professional financial advisor can help you with this."
    },
    {
      "title": "Cover the cons as well as the pros.",
      "content": "Cover the cons as well as the pros. When you want something, you probably think it's best to gloss over any downsides or pretend they don't exist—but this doesn't do you any favors. No idea is ever perfect, so it's better if you can show your boyfriend that you've thought about the negatives as well as the positives. [7] X Research source For example, if you want to get a dog, research how to prevent it from chewing on things and how to potty train effectively. Want to cut down to one vehicle and start biking to work? Make a plan for when the weather's bad. Thinking about going vegan? Find vegan replacements for your favorite foods."
    },
    {
      "title": "Tell your boyfriend that you want to have a sit-down conversation.",
      "content": "Tell your boyfriend that you want to have a sit-down conversation. If you really want to convince your boyfriend, you're less likely to do it over the phone or through text. When you're talking face-to-face, he can see your body language and hear your tone of voice. It also just makes the conversation feel more serious and less easily dismissed. [8] X Research source You might say, \"I have something big I need to talk to you about. Do you have time to chat before work tomorrow?\" When someone asks for a conversation like this, a lot of people assume it's something bad. Put him at ease by saying, \"There's something I'm really excited about that I'd like to share with you. Can we talk about it after dinner this evening?\""
    },
    {
      "title": "Schedule a time when you can have a private conversation.",
      "content": "Schedule a time when you can have a private conversation. Choose a time when neither of you has to be anywhere and you aren't stressed or tired. Plan on having the conversation in a place where you're both comfortable and will have some privacy. [9] X Trustworthy Source Understood Nonprofit organization dedicated to resources and support to people with thinking differences, such as ADHD or dyslexia Go to source Allow plenty of time to unwind from an activity before you get started. If you try to tackle this right after you both get home from work, you might be too keyed up to have a calm, productive discussion. If you don't live together or have roommates, you might prefer a neutral, third location, such as a local park or a quiet café."
    },
    {
      "title": "Mention your existing relationship and your motivation.",
      "content": "Mention your existing relationship and your motivation. When you start out talking about how long you've been together and how much you mean to each other, it puts you on common ground right from the start. He'll be more likely to agree with you in light of the history you have together. Being open and honest about your motivations helps him understand why this thing is so important to you. You might say, \"We've been together for 5 years now, and in that time I've always been grateful for your love and support. I want us to get a dog. I've always had dogs growing up. They make me happy and I want to share that happiness with you.\""
    },
    {
      "title": "Describe what you want inclusively.",
      "content": "Describe what you want inclusively. Talk about how the thing you want will benefit you both as individuals and strengthen your relationship as a couple. He'll feel more like part of a team if he sees that you took him into consideration from the beginning. [10] X Research source You might say, \"If we exercise together, we'll both gain more stamina and increase our life expectancy. That's more time we'll have to chase our dreams together.\""
    },
    {
      "title": "Provide evidence that supports your request.",
      "content": "Provide evidence that supports your request. You don't have to go into a lot of detail here (unless he wants it), just let him know that you've researched the issue and have plans to deal with any issues that might arise. Let him know that you took it seriously and examined it from all angles. [11] X Research source If you want to buy a house together, you might tell him about the market research you've done on available homes in the area, or real estate agents you've talked to."
    },
    {
      "title": "Ask for his thoughts on the matter.",
      "content": "Ask for his thoughts on the matter. After you've told him what you want, ask him directly what his concerns are and listen actively to what he says. [12] X Expert Source Maureen Taylor Communications Coach Expert Interview. 6 March 2019. It helps to repeat back his concerns so he knows that you understand him (or can correct you if you've heard him wrong). [13] X Trustworthy Source Understood Nonprofit organization dedicated to resources and support to people with thinking differences, such as ADHD or dyslexia Go to source For example, if he says that he's interested in a vegan lifestyle but he's concerned about getting enough protein in his diet, you might say, \"I hear you, and that's a legitimate concern. I did some research, though...\" Try to empathize with his point of view. You might say, \"I understand that you're worried our relationship will change if we get married. I thought about that, too, but I know we can work together to make sure nothing bad happens.\" [14] X Expert Source Maureen Taylor Communications Coach Expert Interview. 6 March 2019."
    },
    {
      "title": "Answer any questions he has openly and honestly.",
      "content": "Answer any questions he has openly and honestly. Your boyfriend is a separate person from you and will have his own thoughts and concerns—treat them just as seriously as your own. If he brings up issues you haven't thought of, you might want to look into those things together. [15] X Research source If you're really excited about whatever it is, don't be afraid to let your enthusiasm show! Enthusiasm can be contagious. If he sees that you're excited, he'll be more likely to get swept up in it. For example, if you've suggested buying a house and he's unsure about the financial implications, offer to set up an appointment with a financial advisor."
    },
    {
      "title": "Encourage him to research the issue on his own.",
      "content": "Encourage him to research the issue on his own. If you're proposing a lifestyle change, he might be more interested if he can figure out how that change would benefit him. Remember: he's a different person and the facts he finds that motivate or convince him might be different than what motivated or convinced you. [16] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Share any specific resources that you think have good information. For example, if you want to adopt a dog, point him to the AKC website for information on different breeds. If you're recommending a relationship change, suggest that you go to a couples' counselor together to discuss the change."
    },
    {
      "title": "Let him have a few days or a week to mull it over.",
      "content": "Let him have a few days or a week to mull it over. If you're proposing a big change, it can be quite a shock. Or, if you've confronted him with a relationship issue, he might need some time to consider it. Remember, even though you've been thinking about this for a while, it might be the first time he's thought of it. [17] X Research source Ask him how much time he needs. Say something like, \"I know this might seem a bit sudden for you. How about you take some time to think about it and we can revisit the subject next week?\" Be careful about the words you use here. If you say you're going to give him time, it sounds as though you're the one in control. Use language like, \"you take some time\" or \"do what you need to do.\""
    },
    {
      "title": "Take the lead in getting things started if he agrees.",
      "content": "Take the lead in getting things started if he agrees. It was your idea, after all! Now that you have your boyfriend on board, figure out what your first steps need to be. Make a list and set deadlines for each step towards your goal. [18] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Go ahead and sign up for any services you need or make necessary appointments. Your boyfriend will appreciate the initiative and it will prove to him how important this is to you. If he didn't agree and it's something you can start on your own, try to lead by example. He might get on board if he sees the positive effects in real life. This works best if he was on the fence about it, rather than outright opposed. [19] X Research source"
    },
    {
      "title": "Start small and make changes incrementally.",
      "content": "Start small and make changes incrementally. Follow the Japanese principle of \"Kaizen\" and make gradual, continual improvements as you work toward your final goal. Small changes are less of a shock and allow you to more easily adapt to your \"new normal.\" This works especially well for major lifestyle changes. [20] X Research source For example, if you want you and your boyfriend to transition to a plant-based diet, start by having one plant-based meal a week. The following week, eat two plant-based meals, and so on, until ultimately you're only eating plant-based food. If your goal is to increase your physical activity, start with walking. Then, increase the time you spend walking by 5 minutes each day."
    },
    {
      "title": "Check in with each other regularly to discuss the changes being made.",
      "content": "Check in with each other regularly to discuss the changes being made. You and your boyfriend are in this together! Make sure he's still on board with it and doesn't feel like he's being railroaded. Listen to his concerns and do what you can to accommodate him if you need to. Tracking your feelings will help you make changes that stick. [21] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source It can help to set up a regular time—say, every 2 weeks or so—to go over what you've accomplished and how you're both feeling. That way, you can adjust as necessary and maintain your forward momentum."
    },
    {
      "title": "Respect his decision and let it go (for now) if he's not convinced.",
      "content": "Respect his decision and let it go (for now) if he's not convinced. [22] X Expert Source Maureen Taylor Communications Coach Expert Interview. 6 March 2019. You and your boyfriend are equal partners in your relationship, and he has the right to say \"no.\" It wouldn't be fair for you to try to force the issue. But it's fine to ask if it's something he might be open to later on. [23] X Research source You might say, \"I respect your decision, but this is something I really want. Can we revisit this issue in two months?\" If you agree to revisit the issue later, don't keep talking about it in the meantime. He'll only feel like you're nagging or pressuring him. Mark your calendar and don't mention it until the date the two of you agreed to discuss it again. Let him know where your mind is at. You might say, \"I respect your decision not to get married, but I'm not sure how much longer I can stay in a romantic relationship with you knowing that marriage isn't on the table.\" [24] X Research source"
    }
  ]
}