{
  "url": "https://www.wikihow.com/Contact-WWE",
  "title": "How to Contact WWE on the Phone & Through Social Media",
  "steps": [
    {
      "title": "Call WWE headquarters at 203-352-8600[1] X Research source .",
      "content": "Call WWE headquarters at 203-352-8600 [1] X Research source . Doing this will allow you to leave a voicemail message for a WWE Superstar. Follow the automated prompts until you reach the correct voicemail and leave your message. The Superstar or Diva of your choice will get your message, but it is highly unlikely that you will actually speak to any of the wrestlers this way."
    },
    {
      "title": "Send an email through the WWE website portal.",
      "content": "Send an email through the WWE website portal. [2] X Research source This portal allows you to type in your name, contact email, the Superstar you want to contact, and then provides a box in which you can write a message to that person. It will then be directed to that Superstar. WWE does not guarantee any responses to these messages."
    },
    {
      "title": "Mail a letter to your favorite WWE Superstar.",
      "content": "Mail a letter to your favorite WWE Superstar. You can send a written letter through the mail at this address: Superstar Name C/O WWE, 1241 East Main Street, Stamford, CT 06902. WWE does not guarantee responses to your letters, but they will reach the Superstar. WWE recommends that you don’t send anything of value to be signed by the Superstar. [3] X Research source"
    },
    {
      "title": "Email WWE fan services at fanservices@wwecorp.com.",
      "content": "Email WWE fan services at fanservices@wwecorp.com. This email address allows you to contact the WWE and leave comments about WWE programming and WWE Superstars and Divas. Your message will be received, but it is unlikely that anyone affiliated with WWE will respond individually to these emails."
    },
    {
      "title": "Call WWE headquarters 203-352-8600.",
      "content": "Call WWE headquarters 203-352-8600. This will allow you to leave a comment for a WWE show in a voicemail message. Follow the prompts you are given by the automated phone system until you reach the correct voicemail and leave your message. You can get automated information about WWE’s upcoming schedules and events at this phone number, as well."
    },
    {
      "title": "Find WWE on social media.",
      "content": "Find WWE on social media. WWE has a presence on Twitter, Facebook and YouTube. You are able to make comments on posts and videos, as well as stay up to date with WWE news. Find WWE on Twitter at www.twitter.com/wwe. Find WWE on Facebook at www.facebook.com/wwe. Check out WWE's YouTube Channel at www.youtube.com/wwe."
    },
    {
      "title": "Sign up for the WWE newsletter and email alerts on their website.",
      "content": "Sign up for the WWE newsletter and email alerts on their website. Visit the email notification page to sign up to get email alerts from WWE that pertain to their events, documents, and press releases. Once you sign up for an email alert, you will automatically be placed on the email list to receive the WWE newsletter."
    },
    {
      "title": "Call the WWE headquarters at (203) 352-8600[4] X Research source .",
      "content": "Call the WWE headquarters at (203) 352-8600 [4] X Research source . You will get an automated message that offers many transfer options. All you have to do is say “Talent Relations” when the automated voice prompts you to, and you will be able to leave a message there. It’s unlikely that you will receive a call back, but you never know! It doesn’t hurt to try."
    },
    {
      "title": "Visit the career page on the WWE website.",
      "content": "Visit the career page on the WWE website. On this webpage you are able to search and apply for WWE’s current open positions. [5] X Research source The job categories are Accounting/Finance, Administrative/Operations, Business Development, Consumer Products and Content. The page lists openings not only at WWE headquarters in Connecticut, but also openings at WWE’s other corporate locations in the United Kingdom, India, Germany, China and Los Angeles, California. There are full job descriptions listed and the page allows you to submit a job application directly through their site."
    },
    {
      "title": "Apply to be a WWE wrestler online.",
      "content": "Apply to be a WWE wrestler online. [6] X Research source You can find a link on WWE’s website that will take you to a page detailing the criteria for becoming a WWE wrestler and provide you with information on how to apply. The application can be filled out and submitted to WWE on this page, as well. The direct link is www.wwerecruit.com. If you are selected to participate in a tryout and go through WWE’s recruitment process, they will contact you. Once you submit your application, WWE asks that you don’t contact them to follow up about application progress or response timeframes."
    },
    {
      "title": "Mail video to WWE Talent Relations.",
      "content": "Mail video to WWE Talent Relations. WWE gets around 2000 unsolicited wrestler applications every week. While it’s rather difficult to get your foot in the door this way, you can try to catch their attention by sending video (and press, if applicable) to: World Wrestling Entertainment, Inc. Attention: Talent Relations, 1241 East Main Street, Stamford, CT 06902."
    },
    {
      "title": "Apply for a WWE contract through Tough Enough.",
      "content": "Apply for a WWE contract through Tough Enough. Tough Enough is a reality television show that follows wrestlers competing for a contract with WWE. 30 contenders will be chosen from the applicants. You can fill out and submit an application to compete online, as well as upload video of yourself to be considered, through the Tough Enough website."
    },
    {
      "title": "Contact Joe Villa about live events in the United States.",
      "content": "Contact Joe Villa about live events in the United States. To request U.S. or Canadian media credentials for a live event, you can call Joe directly at (203) 359-5175 or send an email to joe.villa@wwecorp.com. If you choose to send an email, make sure that it clearly identifies the media outlet you work for."
    },
    {
      "title": "Contact Dan Humphreys about international live events.",
      "content": "Contact Dan Humphreys about international live events. For events held outside the U.S. and Canada, you can call Dan directly at 44 20 7349 1744 or contact him via email at Dan.Humphreys@wwecorp.com. He can provide international press inquiries and media credentials for these events. If you choose to send an email, make sure that it clearly identifies the media outlet you work for."
    }
  ]
}