{
  "url": "https://www.wikihow.com/Alleviate-Breast-Tenderness",
  "title": "Quick Remedies and Medical Treatments for Breast Pain",
  "steps": [
    {
      "title": "Apply a cool compress to your breasts.",
      "content": "Apply a cool compress to your breasts. Use cool compresses on the areas of your breasts that are tender. This can help reduce any swelling and relieve pain. You can use an ice pack as often as necessary for 20 minutes at a time. You can freeze a plastic foam cup full of water to gently massage the affected area. You can also try a bag of frozen vegetables wrapped in a dishtowel. The frozen vegetables conform to the shape of the breast and may be more comfortable than an ice pack. If it is too cold or your skin gets numb, remove the pack. Use a towel between the ice pack and your skin to help prevent frostbite."
    },
    {
      "title": "Use heat therapy on sore breasts.",
      "content": "Use heat therapy on sore breasts. Using heat on tense muscles not only can relax the contracting muscle and you, but it will also help alleviate the pain. From heating pads to warm baths, there are many different types of heat treatments that can help breast tenderness. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Taking a warm shower or bath will relax you and can help relieve breast pain. Fill a hot water bottle or get a heating pad and place it on the your breasts. Over the counter heat rubs may also help alleviate tenderness, though you should be careful putting these creams on your nipples. You should also avoid these if you are breastfeeding."
    },
    {
      "title": "Consume pain medication.",
      "content": "Consume pain medication. Take pain relievers for severe discomfort and/or as necessary. These medications may help alleviate breast pain and possible swelling. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Take over the counter pain relievers such as aspirin, ibuprofen, naproxen sodium or acetaminophen. Ibuprofen and naproxen sodium may also help alleviate some of the swelling."
    },
    {
      "title": "Rub topical anti-inflammatory cream on your breasts.",
      "content": "Rub topical anti-inflammatory cream on your breasts. Ask your doctor to prescribe a topical non-steroidal anti-inflammatory cream or purchase an over the counter option at a local pharmacy. This can help relieve pain and reduce swelling associated with breast tenderness. [4] X Research source Apply the cream directly to the area of your breasts on which you feel pain."
    },
    {
      "title": "Wear comfortable and supportive bras.",
      "content": "Wear comfortable and supportive bras. Your choice of bras can affect how your breasts feel. Wearing comfortable bras that firmly support your breasts can help relieve pain and may also help protect against the effects of gravity. Make sure you get properly fitted for a bra by a professional. A bra that doesn’t fit your breasts properly can cause pain. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You can find a professional to fit you for a bra at many department stores and most lingerie stores. Avoid wearing under-wire and push-up bras for a few days. Instead, try wearing camisoles with built-in shelf bras or sports bras to give you light support. Don’t wear a bra while you sleep if possible. If you need some support, wear a sports bra made of a breathable fabric."
    },
    {
      "title": "Exercise only while wearing a sports bra.",
      "content": "Exercise only while wearing a sports bra. If you are active and exercise regularly, purchase a supportive sports bra. They are specially designed to help cushion and support your breasts against the impact of sports and may help alleviate breast discomfort. [6] X Research source Sports bras come in different styles, sizes, and types of support. Consider asking a fitting professional to help you find the proper sports bra for your needs and breast size. Women with larger breasts should purchase a sturdier and firmer support sports bra. If you have smaller breasts, you may need less support."
    },
    {
      "title": "Limit or avoid caffeine.",
      "content": "Limit or avoid caffeine. Studies linking caffeine and breast tenderness are still inconclusive, but some doctors suggest reducing or staying away from caffeine altogether. This may help reduce tenderness in the breast. [7] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Drinks such as soda, coffee, and tea contain caffeine. [8] X Research source Foods including chocolate and some coffee ice creams may contain caffeine. [9] X Research source If you are taking caffeine pills to stay awake, avoid taking them during times your breasts are sore. [10] X Research source"
    },
    {
      "title": "Adjust your diet.",
      "content": "Adjust your diet. Reduce fat in your diet and increase the number of complex carbohydrates you eat. There is some evidence that making these changes to your diet can help relieve breast pain. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Eat leans meats such as chicken and fish for protein and avoid other high fat foods such as fried and junk food. You can get complex carbohydrates from fruits, vegetables, and whole grains."
    },
    {
      "title": "Take nutritional supplements.",
      "content": "Take nutritional supplements. Some studies have shown that nutritional supplements may help with breast tenderness. Adding vitamins and minerals such as vitamin E and iodine may alleviate any pain you have. [12] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Try 600 IU per day of vitamin E, 50 mg per day of vitamin B6, and 300 mg per day of magnesium. [13] X Research source You can get iodine though salt or take an aqueous dose of 3-6mg per day. [14] X Research source Evening primrose oil, which contains linoleic acid, may help make the breasts less sensitive to hormonal changes. Take three grams of evening primrose oil per day. You can get nutritional supplements and vitamins at most pharmacies and health food stores."
    },
    {
      "title": "Massage your breasts.",
      "content": "Massage your breasts. Gently massaging your breasts and surrounding tissues can relieve pain and may also help you relax. Some studies show that massage can release tension and lengthen tense muscles. [15] X Research source Make sure to be gentle when you do any kind of breast massage. You don’t want to injure your delicate breast tissue. Rubbing your face or even just massaging your ears will relieve tension. [16] X Research source"
    },
    {
      "title": "See your doctor.",
      "content": "See your doctor. If home treatment isn’t working or your breast pain is affecting your daily life, see your doctor. Breast pain is very common and very treatable, and getting a medical diagnosis early can help you relieve pain and/ or get proper treatment for underlying causes. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can see your regular doctor or visit an ob/gyn, who specializes in treating disorders such as tendinitis. Your doctor will conduct a physical exam to check your pain as well as feel for abnormalities in your breasts. She will also likely ask for a health history, including factors such as what type of activities you do and what medications you take. Bromocriptine, an oral medication, may be prescribed."
    },
    {
      "title": "Adjust birth control pills.",
      "content": "Adjust birth control pills. Because birth control pills often contain hormones, they may contribute to breast pain. Consult with your doctor about adjust the type or dose of pill you take, which may help to relieve breast pain. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Skipping the placebo, or pill-free, week, may also help manage breast tenderness. Switching your form of birth control to a non-drug method may also help. Make sure to consult your doctor before stopping your birth control pills or changing them."
    },
    {
      "title": "Reduce hormone therapy medications.",
      "content": "Reduce hormone therapy medications. If you are using hormone therapy for menopause or another condition, talk to your doctor about reducing or stopping your dosage. This may help relieve breast pain and tenderness, but may also have other side effects. [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Speak to your doctor about reducing your medications, going off of them, or trying alternative hormonal treatments."
    },
    {
      "title": "Consider the drugs Tamoxifen and Danazol.",
      "content": "Consider the drugs Tamoxifen and Danazol. These drugs are short-term solutions for extreme pain and may be a last resort for those women who do not respond to other therapies. Speak to your doctor and consider taking one of these medications to help manage your breast tenderness. You need a prescription from your doctor for both Danazol and Tamoxifen. Be aware that both of these drugs can come with significant side effects including weight gain, acne, and voice changes."
    },
    {
      "title": "Undergo relaxation therapy.",
      "content": "Undergo relaxation therapy. If your breast pain is causing you stress, think about undergoing relaxation therapy. Although studies have not been conclusive, some evidence suggests that relaxation therapy may help relieve breast pain by controlling the severe anxiety that can accompany it. [20] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}