{
  "url": "https://www.wikihow.com/Check-Ammonia-in-a-Fish-Tank",
  "title": "How to Check Ammonia in a Fish Tank",
  "steps": [
    {
      "title": "Get an ammonia testing kit from a pet or aquarium store.",
      "content": "Get an ammonia testing kit from a pet or aquarium store. Ammonia testing kits are essential items and you can find them in pet supply or fish care stores. Get a kit from your usual fish store or order one online. [1] X Research source The most popular and common testing kit is the API ammonia kit. These are accurate and easy to use. Most kits come with a test tube, a few bottles of testing solution, and a color chart to measure the ammonia levels. The API kit can measure both fresh and saltwater fish tanks. If you get a different kit type, make sure it’s for the type of tank you have."
    },
    {
      "title": "Fill the test tube with tank water to the fill line.",
      "content": "Fill the test tube with tank water to the fill line. There's a fill line about halfway up the test tube. Either dip the tube into your tank or scoop the water into the tube and fill it up to the line to get started with your test. [2] X Research source Make sure the test tube is clean when you do this, or you might get tainted results. Some pros like to use a small medical dropper, similar to a turkey baster, to fill the tube. You can find these at pharmacies. [3] X Research source"
    },
    {
      "title": "Add 8 drops of testing solution #1 to the tube.",
      "content": "Add 8 drops of testing solution #1 to the tube. The testing solutions are labeled with numbers, and you need to use them in the correct order. Uncap solution #1 and hold it perfectly vertical over the tube. Gently squeeze 8 drops into the tube. [4] X Research source Don’t mix up the testing solutions and add them out of order. This will mess up your results. Different test kits may tell you to add a different number of drops, ranging from 5 to 7. [5] X Research source It’s important to keep the bottle vertical because if it’s crooked, the drops might not be the same size. This could ruin your results. [6] X Research source Be careful with the testing solutions. They can irritate your skin and eyes."
    },
    {
      "title": "Squeeze 8 drops of testing solution #2 into the tube.",
      "content": "Squeeze 8 drops of testing solution #2 into the tube. Uncap bottle #2 and hold it vertically over the tube, the same as you did for #1. Squeeze in 8 drops. [7] X Research source Some testing kits have a third testing solution to add, so make sure you double check the instructions that come with the kit that you use. [8] X Research source"
    },
    {
      "title": "Shake the tube for 5 seconds.",
      "content": "Shake the tube for 5 seconds. Put the cap on the test tube and make sure it’s secure. Then shake the tube vigorously for 5 seconds to mix the solution together. [9] X Research source Test to make sure the cap is on tight. The test solution is irritating, so you don’t want it spilling out."
    },
    {
      "title": "Let the solution sit until the color develops.",
      "content": "Let the solution sit until the color develops. The testing solutions take some time to react with ammonia, and the exact amount of time depends on the kit. Set it down and leave it alone for the recommended amount of time. This way, the color will develop and indicate if there’s any ammonia in the water. For the API kit, the recommended wait time is 5 minutes. [10] X Research source On other kits, the recommended time is as long as 15-20 minutes. [11] X Research source The water will probably change color pretty quickly. Still let it sit for the recommended time and let the solution work."
    },
    {
      "title": "Compare the water color to the chart in your testing kit.",
      "content": "Compare the water color to the chart in your testing kit. Go to a well-lit area so you can see the color clearly. Hold the test tube up against the white part of the testing chart next to the colors. Then compare the color of the water to the color scale on the chart. Generally, the darker the color, the higher the levels of ammonia in the water, measured in parts per million (ppm). [12] X Research source With most kits, yellow means that there’s no ammonia, and as the color gets greener, it indicates a higher ammonia level. Some kits have 2 charts, 1 for freshwater and 1 for saltwater. Make sure you’re using the right chart for your tank. [13] X Research source"
    },
    {
      "title": "Clean your tank if the kit detects any ammonia.",
      "content": "Clean your tank if the kit detects any ammonia. Ideally, your tank should always read 0.0 ppm, or the lowest color section on the chart. If your chart reads any higher than that, then it's time to clean your tank. This keeps your fish healthy and strong. [14] X Research source A normal scale for an ammonia kit in ppm is 0.0, 0.25, 0.5, 1.0, and so on. No matter what the scale is, clean your tank if the reading is above 0.0."
    },
    {
      "title": "Rinse out the test tube before putting it away.",
      "content": "Rinse out the test tube before putting it away. Get rid of the testing solution as soon as you're done. Pour the test tube water down your drain. Then rinse it out thoroughly with clean water so it’s ready for your next test. [15] X Research source Never pour the test solution back into the tank. This will poison the fish."
    },
    {
      "title": "Get a bottle of ammonia test strips from a pet or aquarium store.",
      "content": "Get a bottle of ammonia test strips from a pet or aquarium store. Just like with testing kits, test strips are easy to find at pet stores. Pick up a bottle or pack of test strips designed to measure ammonia. [16] X Research source There are packages with just ammonia test strips, and there are larger sets that have strips to measure pH and nitrates. A larger set might be handy to check the overall water quality in your tank. Strips can usually work in fresh or saltwater, but be sure to confirm this on the package. Generally, pros prefer testing kits over strips because they’re more accurate. However, strips are quick and convenient, so you might find them easier to use."
    },
    {
      "title": "Swish the test strip around the tank water for 10 seconds.",
      "content": "Swish the test strip around the tank water for 10 seconds. Take a test strip out of the package and dip about half of it into the tank. Swish it around for about 10 seconds to test if there’s any ammonia in the water. [17] X Research source Some testing strips might have different instructions, so always follow those if they’re different."
    },
    {
      "title": "Compare the test strip color to the color chart to check for ammonia.",
      "content": "Compare the test strip color to the color chart to check for ammonia. The test strip will change color if there is ammonia in the water. Hold the test strip up against the chart in the kit. The matching color indicates how much ammonia, if any, is in the water. [18] X Research source Usually, yellow means that there’s no ammonia, and the color gets greener if there’s a higher level of ammonia. Throw out the test strip after you’re done. They aren’t reusable."
    },
    {
      "title": "Clean your tank if you detect any ammonia.",
      "content": "Clean your tank if you detect any ammonia. Just like with a testing kit, the test strips should ideally show a reading of 0.0 ppm for the ammonia levels. If it's any higher than that, then it's time to clean your tank. [19] X Research source The scale for testing strips varies depending on the brand. No matter what the scale is, you don't want any ammonia in your tank."
    },
    {
      "title": "Test on a regular weekly schedule.",
      "content": "Test on a regular weekly schedule. The best way to monitor your ammonia and nitrate levels and keep your fish healthy is with a regular, weekly test. Make this part of your normal chore schedule. This way, you can catch any problems early enough to clean the tank and prevent any harm to your fish. [20] X Research source Ammonia can build up in a tank if there is a problem with your filter or it’s been a while since you changed the water. This is why regular testing is important."
    },
    {
      "title": "Check ammonia levels whenever you add new fish to your tank.",
      "content": "Check ammonia levels whenever you add new fish to your tank. New fish could carry contaminants like ammonia. Whenever you add new fish, check your levels afterward to see if ammonia is building up. [21] X Research source It’s a good idea to schedule a tank cleaning when you’re adding new fish to get rid of any contaminants."
    },
    {
      "title": "Measure the water quality if your fish seem sluggish or unwell.",
      "content": "Measure the water quality if your fish seem sluggish or unwell. If there are high ammonia levels in your tank, then it’ll definitely start affecting your fish. If your fish are usually lively and seem to acting sluggish or unhealthy, then test your ammonia levels. Your tank might need a good cleaning. [22] X Research source In general, if ammonia levels are so high that it’s affecting your fish, you might not be testing or cleaning or tank regularly enough."
    }
  ]
}