{
  "url": "https://www.wikihow.com/Amazon-Package-Delivered-to-Wrong-Address",
  "title": "What to Do When Amazon Delivers to the Wrong Address",
  "steps": [
    {
      "title": "Confirm your Amazon shipping address is correct.",
      "content": "Confirm your Amazon shipping address is correct. You may have accidentally selected the wrong shipping address when you placed your order or typed the address wrong. If the address is incorrect, follow this set of steps . [1] X Research source"
    },
    {
      "title": "Check your porch and the nearby area.",
      "content": "Check your porch and the nearby area. The delivery driver may have stashed the package in an odd place to hide it from thieves or protect it from the elements. Take a look around any bushes, potted plants, or other concealed areas at the front of your home where a driver may have left your package. [2] X Research source"
    },
    {
      "title": "Look for a delivery notice on or around your front door.",
      "content": "Look for a delivery notice on or around your front door. If delivery drivers need you to sign for a package and you aren’t home, they may leave an “attempted delivery” slip on your front door. Check your mailbox, your porch, and anywhere else where a delivery notice could’ve been placed or fallen to. [3] X Research source"
    },
    {
      "title": "Ask your household members and neighbors if they've seen it.",
      "content": "Ask your household members and neighbors if they've seen it. It's possible that the driver handed your package to someone living with you or to a neighbor. In either case, you might be able to find your package without involving Amazon. Ask your roommates, family members, neighbors, or even your security guard whether they’ve seen or received your package. [4] X Research source"
    },
    {
      "title": "Wait 48 hours after the delivery notification.",
      "content": "Wait 48 hours after the delivery notification. The carrier may have accidentally marked your package as \"delivered\" when they're still planning on dropping it off. Wait at least two days after your package is marked “delivered” before ordering a new one or complaining to Amazon. It's a frustrating delay, but it would take even longer to order a replacement. [5] X Research source"
    },
    {
      "title": "If all else fails, report the delivered package missing.",
      "content": "If all else fails, report the delivered package missing. Report a missing package shipped by Amazon by calling Amazon Customer Service at 1-888-280-4331 or starting a live chat on the app or website. If a third-party seller shipped the item, contact them directly using the information in your Order Details . [6] X Research source To connect with a live chat agent, go to Amazon's Customer Service page on their website or app and select the item you didn't receive. Next, select \"Says delivered, but it's not here,\" and the chat will begin."
    },
    {
      "title": "If you’ve entered the wrong address, contact Amazon for help.",
      "content": "If you’ve entered the wrong address, contact Amazon for help. If your package has been delivered to the wrong home due to you entering the incorrect delivery details, first login to your Amazon account and update your shipping address. Then, reach out to Amazon Customer Service. They may issue a refund or a replacement when you explain your error – just remember to update your shipping address! [7] X Research source If the person you sent the package to is someone you know or one of your neighbors, you may also reach out to them to see if they received it and can deliver it to you."
    },
    {
      "title": "Yes, but you may have to wait up to 48 hours to get refunded.",
      "content": "Yes, but you may have to wait up to 48 hours to get refunded. Amazon typically asks customers to wait 2 days to make sure the carrier didn't accidentally mark the package as \"delivered.\" [8] X Research source After 48 hours, if you still haven't received or found your package, Amazon will offer you a choice between a refund and a replacement. If you ask for a refund, they will remit the money you spent on the missing order to your credit card on file or your Amazon gift card balance."
    },
    {
      "title": "You made a mistake in the address number, spelling, or direction.",
      "content": "You made a mistake in the address number, spelling, or direction. Delivery drivers from Amazon and other carriers use GPS to navigate to addresses. If you accidentally transposed the numbers, misspelled the street name, or left off a direction (i.e., S. or Ave.), the driver may deliver to the wrong location."
    },
    {
      "title": "Your address is hard for the delivery driver to find.",
      "content": "Your address is hard for the delivery driver to find. People who live in rural areas or don't have their address numbers clearly displayed on their buildings may struggle to get packages delivered. Add detailed delivery instructions to your address on your Amazon account to guide the driver to your door. [9] X Research source"
    },
    {
      "title": "The delivery driver made an error and delivered to the wrong place.",
      "content": "The delivery driver made an error and delivered to the wrong place. For example, they may have read your address incorrectly or accidentally grabbed your box when they were delivering somewhere else. You can rate a poor delivery as \"Not so great\" in the Amazon app by navigating to Your Orders and selecting the order you didn't receive. If you're using the website, go to Your Orders , find the product, and click \"Leave delivery feedback.\" [10] X Research source"
    },
    {
      "title": "The package was stolen off your doorstep.",
      "content": "The package was stolen off your doorstep. You may think it went to the wrong address, but it could have been stolen! 1 in 4 people in the United States have had packages stolen from them at some point in their lives, so don't rule out the possibility that you are also a victim of this crime. [11] X Research source If you suspect porch pirates are stealing your packages, set up outdoor cameras to look out over your porch, front walk, and driveway. If you catch the thieves in the act, turn the footage over to the police."
    },
    {
      "title": "You can legally keep Amazon packages that aren't addressed to you.",
      "content": "You can legally keep Amazon packages that aren't addressed to you. That's because the Federal Trade Commission (FTC) ruled that Americans can keep any unsolicited packages that arrive on their doorstep. Furthermore, they're not required to pay for return shipping. [12] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source It's up to you if you want to contact Amazon to return the package. If you do, Amazon is legally obligated to provide you with a free shipping label, or else they can tell you to keep the items in the box."
    },
    {
      "title": "Contact the seller and say they have the wrong address.",
      "content": "Contact the seller and say they have the wrong address. Meanwhile, don't open the package to see what's in it or leave it outside in the open where someone could steal it. Instead, set it someplace safe in your home until you learn what the sender wants you to do with it. [13] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source If Amazon delivered it, contact Amazon Customer Service. After you explain the situation, they may send you a return label so you can send the package back to them. They may also tell you to keep the items. If a third-party seller shipped it, you can either reach out to them and ask them to send you a return shipping label for free or contact the carrier and request a free return label from them."
    },
    {
      "title": "Find out if someone you know sent the package to you first.",
      "content": "Find out if someone you know sent the package to you first. The package could be an impromptu gift from a friend or family member. The friend or family member may have ordered a package to your house while they were on vacation or for some other innocent reason. [14] X Research source"
    },
    {
      "title": "If no one you know ordered the package, check your subscriptions.",
      "content": "If no one you know ordered the package, check your subscriptions. Amazon sells subscriptions to certain products, like supplements and pet food. You may have started a subscription a few weeks or months ago and forgotten about it or didn't realize you set it up. [15] X Research source To cancel an Amazon product subscription, log into your account and go to Your Memberships and Subscriptions . Find the subscription(s) you want to cancel and select \"Manage Subscriptions\" next to it. Select the link underneath Advance Controls to go to the main subscriptions page, from which you can start the cancellation process. [16] X Research source"
    },
    {
      "title": "If you didn't accidentally order the item, report it to Amazon.",
      "content": "If you didn't accidentally order the item, report it to Amazon. Amazon has a Report Unwanted Package form online for members who receive packages in their name that they didn't order. You'll have to sign into your Amazon account or make one to fill it out. Provide Amazon with the number of packages you received, their tracking numbers, and other information from the shipping label so they can investigate who sent it."
    },
    {
      "title": "Beware of brushing scams, where people leave reviews in your name.",
      "content": "Beware of brushing scams, where people leave reviews in your name. In a brushing scam, you'll receive a package you didn't order, sent by a third-party seller who then uses your name to write a fake review of the product. It's a scheme to raise ratings on low-quality items to encourage real buyers to buy it. [17] X Research source"
    }
  ]
}