{
  "url": "https://www.wikihow.com/Be-Sociable",
  "title": "How to Be Sociable",
  "steps": [
    {
      "title": "Be less critical.",
      "content": "Be less critical. Some of the people who call themselves \"antisocial,\" tend to constantly criticize both themselves and those around them. [1] X Research source They avoid social interaction because they are on the one hand afraid of being judged by others, and on the other hand (ironically) themselves extremely judgmental toward others. In order to become a more social person, it is important to accept that everybody, no matter how they may seem on the outside, has both positive and negative qualities. What separates the confident people from the insecure people is the attitude that they have toward themselves and the active focus in living a fulfilling social life. [2] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 14 April 2021. Confident, social people tend to focus on the positive qualities of themselves and those around them, whereas unconfident, antisocial people focus on their own shortcomings and the shortcomings of the people they know. [3] X Research source Make a list of your own positive qualities. Be sure to include both internal (intellectual, emotional) and external (physical) qualities. Get in the habit of reminding yourself of these positive qualities on a daily basis, and counter each negative thought you have toward yourself with two positive ones. Stop referring to yourself as shy, timid, or antisocial. The more you use these words to label yourself, the more you will reinforce the idea that you are incapable of social interaction! If the idea frightens you, remember that your perception by others depends not on them but on you . If you want to become a more social person, you have to start by actually believing that you are and can be a social person. Remind yourself that being sociable is a choice , not a predisposition. Accept that human nature is good. While there are plenty of bad people out there, it is important to accept that humans can be loving, kind, and accepting creatures. Believing this will make you look forward to meeting new people rather than avoiding it."
    },
    {
      "title": "Don't over-analyze your interactions.",
      "content": "Don't over-analyze your interactions. Over-thinking is usually what prevents people from enjoying social interaction. While it may seem difficult, it is important to break the habits of anticipating what social interactions will be like before they happen, and of over-analyzing them once they are over. [4] X Research source Rather than focusing on what may go wrong or how you may embarrass yourself, approach every new social interaction with a clean slate and a positive attitude. When reflecting on past interactions, focus on the positive things rather than the negative ones. Even if it wasn't the most eventful or exciting interaction of your life, try to identify one good experience from each interaction you have, even if it is as simple as having been able to make somebody laugh."
    },
    {
      "title": "Realize that you're not that big of a deal.",
      "content": "Realize that you're not that big of a deal. Interestingly, shy people who feel invisible and unwanted also tend to feel like they are constantly under a spotlight, being watched and criticized by others. This strange paradox of shyness is what prevents people from feeling comfortable being themselves in front of others. This doesn't mean that you should feel like an unimportant person, but rather, that you should acknowledge that you are your own worst critic; other people are simply too busy to constantly judge and criticize you. Remember that people are so caught up in their own lives and interactions that they have little time to notice if you embarrass yourself, say something stupid, or don't look your best. Even if they do notice, it is very unlikely that they will care very much, as they have their own issues to deal with. Recognize that everybody, to some extent or another, feels exactly the same way you do. Even the most social people still feel insecure and worry about embarrassing themselves; the only difference is that they choose to take the risk and enjoy themselves rather than worrying about how others will react."
    },
    {
      "title": "Get practice.",
      "content": "Get practice. Just like any other skill, being sociable requires consistency and practice in order to master. [5] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 14 April 2021. This means you will have to get out of your comfort zone and force yourself to interact with other people on a regular basis. Avoid compartmentalizing your life and separating your \"social life\" from the rest of your life. If you truly want to be a social person, you will have to be social in all aspects of your life, from work to school to family. [6] X Research source Get in the habit of striking up casual conversations with the people you meet on a daily basis, including bank tellers, baristas, and cashiers. Spend your free time with friends, when possible. [7] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 14 April 2021. If you are the type of person who spends a lot of time partaking in a certain hobby or physical activity alone, then consider inviting a friend along next time. [8] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 14 April 2021. Always accept social invitations. Avoid making excuses like being too tired, having to wake up early the next day, or feeling unattractive. While some excuses are legitimate, others are simply used to avoid interaction. Learn to differentiate between honest excuses and dishonest ones."
    },
    {
      "title": "Be positive.",
      "content": "Be positive. Everybody wants to be around people who are optimistic, upbeat, and happy. Even if you don't feel positive all of the time, you should at least act positive when talking to other people. For example, if somebody asks you to tell them about your life, focus on sharing the positive qualities of your life rather than complaining about the negative ones. [9] X Research source Making your life sound positive will instantly spark peoples' interest, and they will want to hear more about you."
    },
    {
      "title": "Be fully engaged.",
      "content": "Be fully engaged. If you want to seem interesting to others, you will have to show interest in them, especially when you are in the middle of a conversation. [10] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 14 April 2021. When you are talking to somebody, listen to what they are saying rather than worrying about what you should be saying. Make eye contact, nod your head, and ask them follow-up questions. [11] X Research source Avoid constantly checking your phone or looking around you while you are in the middle of a conversation. These types of things come across as rude and suggest that you are uninterested in the person and conversation."
    },
    {
      "title": "Watch your body language.",
      "content": "Watch your body language. If you are at a party or other social function, how you position your body sends a message to other people. If you want to be approached by others, you should avoid standing in the corner, crossing your arms, staring at your phone, and frowning. [12] X Research source Making eye contact with others and smiling shows them that you are friendly, open, and non-intimidating. Plus, everybody looks more attractive when they smile."
    },
    {
      "title": "Initiate interactions.",
      "content": "Initiate interactions. [13] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 14 April 2021. If you are constantly waiting around for people to call you or invite you places, then you are wasting your life. Relationships are built upon a mutual effort; if you want to show people that you value their friendship, you will have to reach out to them and initiate opportunities to spend time with them. [14] X Research source Keep in touch with friends, even if you don't live in the same town. Pick up the phone and call them, send them a text, or e-mail them asking how they've been."
    },
    {
      "title": "Embrace opportunities to meet new people.",
      "content": "Embrace opportunities to meet new people. [15] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 14 April 2021. The best way to make new friends and expand your social circle is to say yes to new opportunities to meet others. Accept invitations to parties and social gatherings, take trips to new places, and talk to strangers in cafes, on the bus, at school, on airplanes, etc. While meeting strangers may seem intimidating, think of it this way: if you don't know them to begin with, then you really have nothing to lose if things don't work out. On the other hand, you never know when a stranger can turn into your new best friend, business partner, or love interest!"
    },
    {
      "title": "Make notes of what people may like.",
      "content": "Make notes of what people may like. It is hard to remember what each and every person you have met so far likes or what he or she is interested in. So, when you go home make notes of what this person likes. Research it properly and when you meet them again talk to them about it. You will be surprised by the number of friends you will make by just learning what each one of them is interested in It may seem hard and time consuming at first so start by your classmates or colleges. Remember to not get carried away. For example, do not go as far as stalking the person on social networking sites. Just knowing by how much points did Barcelona won with and the next time they are going to play in a match is enough. Even that person will continue the conversation so you don't have to worry about reaching a dead end."
    }
  ]
}