{
  "url": "https://www.wikihow.com/Be-Safe",
  "title": "How to Be Safe",
  "steps": [
    {
      "title": "Keep a first aid kit handy.",
      "content": "Keep a first aid kit handy. To make sure your home is as safe and prepared as possible, it's a good idea to keep a quality first aid kit on hand for emergencies. For an easy option, buy one that comes pre-packaged with everything you need. However, you can also assemble one yourself and keep it in a tackle box or another plastic case. If you do that, make sure it includes: [1] X Research source Clean bandages and gauze Isopropyl alcohol and hydrogen peroxide Antibacterial ointment OTC painkillers Surgical tape Antibiotics"
    },
    {
      "title": "Stock up on supplies in case of an emergency.",
      "content": "Stock up on supplies in case of an emergency. Bad weather and other disasters can hit without much notice, so it's a good idea to make sure you're prepared year-round just in case. A few things you should always have on hand include: [2] X Research source Batteries and sturdy flashlights Pocketknife Needles and thread Canned goods and other nonperishable items Lots of water Matches or lighters Radio"
    },
    {
      "title": "Protect your home against the risk of fire.",
      "content": "Protect your home against the risk of fire. Whether you're a homeowner or a renter, it's important to make sure your whole family knows what to do in case there's a fire. Here are a few things you can do that could help protect your home from fire damage: [3] X Research source Install smoke detectors and test them regularly. Keep a fire extinguisher in your home. Read the directions so you'll know how to use it if there's an emergency, and replace it when it expires. Unplug any electrical devices that you're not using and make sure your wiring is up to date. Develop an escape plan and practice it with your family."
    },
    {
      "title": "Make your home less attractive to burglars.",
      "content": "Make your home less attractive to burglars. Having someone break into your home can be really scary. You may not be able to prevent it completely, but there are a few things you can do to make your home less of a target: [4] X Research source Have a security system installed. Make it visible—place cameras where they can be seen and put a sign or sticker on your home that indicates what security company you're using. Organize a neighborhood watch. Install good-quality locks on your doors. Keep your yard clean and well-lit. Keep your car inside the garage if you have one."
    },
    {
      "title": "Child-proof your home if you have children.",
      "content": "Child-proof your home if you have children. If you have kids or are planning on having kids, it's important to make your home as safe as possible. Get down on a child's eye-level and look for anything that they could hurt themselves on, including anything they could put into their mouth or pull down on themselves. Here are a few specific things to look for: [5] X Research source Install gates at the top of staircases. Hide electrical cords and plug outlets. Secure hazardous chemicals in locked or out-of-reach places. Lock firearms in appropriate storage. Store small or sharp objects out of your child's reach. Install safety latches or locks on your cabinets and drawers. Use anchors to keep heavy furniture from tipping over."
    },
    {
      "title": "Invest in disaster insurance.",
      "content": "Invest in disaster insurance. There's no way to know when a disaster might occur and potentially cause major damage to your home. However, if you have disaster insurance, you may be covered, which could protect you from being out in the cold. [6] X Research source For instance, if you own your own home, homeowner's insurance might pay for part or all of the damage in the event of major storms, fire, or other catastrophic events. If you rent your home, renter's insurance might replace the contents of your home if something happens."
    },
    {
      "title": "Carry a cellphone in case of an emergency.",
      "content": "Carry a cellphone in case of an emergency. When you're going out at night, even if you're just going around the corner, it's a good idea to carry some form of communication. That way, if anything unexpected happens, you'll be able to get in touch with someone who can help you. It's also a good idea to make sure your phone is fully charged before you leave home. You might also want to set up location services on your phone so it can be tracked if it's lost or stolen, or if something happens to you. If you have a late-model smartphone, it may be smartest to keep it tucked in your pocket or purse unless you need to use it. That way, it won't attract muggers. [7] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Travel in groups when you're walking.",
      "content": "Travel in groups when you're walking. It's usually not a good idea to walk by yourself late at night, no matter who you are. That could make you a target for someone with bad intentions. It's better if you can walk with at least one other person—but the more people you're around, the safer you'll tend to be. If you must walk alone, stick to well-lit areas, avoid high-crime areas, and get where you're going as quickly as possible. Call someone to let them know your travel plans, as soon as possible. If you go out drinking, make sure you get rides figured out before it gets late. If you end up downtown at 2 am without a plan for getting home, you might end up in a sketchy situation."
    },
    {
      "title": "Let people know where you're going.",
      "content": "Let people know where you're going. When you go out at night, tell someone where you're going and when you're likely to be back. At the very least, you'll keep people from worrying about you. In an emergency, though, that could be really important information. If you're going somewhere unfamiliar, like on a first date with someone you don't know well, you might ask a friend to check in with you about once an hour or so."
    },
    {
      "title": "Learn to defend yourself confidently.",
      "content": "Learn to defend yourself confidently. The best way to win a fight is to avoid it entirely. However, if you do find yourself in a situation where you need to defend yourself, you'll be a lot more confident if you know what to do. Taking even a few beginners' self-defense classes can help you learn techniques you could use in the event of an attack. [8] X Research source Avoid physical confrontations at all costs. The best way to win a fight is to avoid it entirely."
    },
    {
      "title": "Consider carrying some personal defense.",
      "content": "Consider carrying some personal defense. If you have to be alone at night, pepper spray or mace can be an effective safety tool against threats like assailants or stray dogs. They can also make you feel more safe and confident—and projecting that energy may make you less of a target. However, go through some type of training to learn how to properly use these items before you start carrying them. Otherwise, they can be easily used against you. [9] X Research source Check your local laws—in some areas, you need certain training to be able to legally carry these types of self-defense. Carrying concealed weapons like guns and knives can be more dangerous than safe, but if that's an option you want to use, enroll in a personal defense course so you can learn to defend yourself safely. You'll also need a permit to carry weapons legally. Keep in mind you can't carry concealed weapons in places like schools or government buildings. [10] X Research source"
    },
    {
      "title": "Choose secure passwords.",
      "content": "Choose secure passwords. Never use obvious passwords like \"password\" or \"12345.\" Hackers use software that can get past these types of common passwords quickly and effectively, making them as useless as having no password at all. Choose secure passwords with a mix of letters, numbers, and special symbols for the best password. [11] X Research source Don't use the exact same password for every site. That way, even if a hacker does get your password for one site, they won't be able to use it anywhere else. Consider using a password manager that will create a unique password for every site you log into."
    },
    {
      "title": "Log out of sites when you're done using them.",
      "content": "Log out of sites when you're done using them. Always log out of any website that requires you to log in. This includes email sites, social networking, and other sites you wouldn't want someone else to access. This is especially true on public computers, but it's a good idea to do it on your personal computer as well, to be safe. [12] X Trustworthy Source U.S. Securities and Exchange Commission Independent U.S. government agency responsible for regulating the securities industry, which includes stocks and options exchanges Go to source"
    },
    {
      "title": "Keep private information to yourself.",
      "content": "Keep private information to yourself. Never give out identifiable information such as your full name, address, phone number, email, or credit card number to anyone on the internet. That includes people in chat rooms and message boards, through your email, or on Twitter or Facebook. [13] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source Control your privacy settings so that absolutely nothing that you post is public to anyone who you haven't approved. Going to the effort to restrict everything so that can keep prying eyes away from your posts and pictures is worth it to feel safe. If you have to enter in anything private on a website, verify it's a site you trust. Also, look for a lock signal next to the name of the site in the search bar—that indicates the site is secure."
    },
    {
      "title": "Read the terms and conditions.",
      "content": "Read the terms and conditions. Before you sign up to any site, read the terms and conditions—especially if it's a site where you'll be paying for something. Go through all of the fine print to make sure that you're not agreeing to any terms you're not aware of. It may be tedious, but it's worth the extra measure of safety. [14] X Research source For example, if you don't read the terms, you might accidentally sign up for a recurring charge when you only meant to make a one-time purchase. Or, you could consent to having your personal data sold to a third party without realizing it."
    },
    {
      "title": "Don't take dangerous dares.",
      "content": "Don't take dangerous dares. It can seem hard to say no to your friends, but if someone dares you to do something that's unsafe, it's really important that you stand up for yourself. Taking a dare can sometimes have serious consequences, so trust your instincts. [15] X Research source For instance, if a friend dares you to run across a busy road, say something like, \"I'm not doing that, and you shouldn't either. Let's go do something else instead.\""
    },
    {
      "title": "Say no to drugs, alcohol, or cigarettes.",
      "content": "Say no to drugs, alcohol, or cigarettes. Don't let the people around you bully you into trying drugs, drinking alcohol, or smoking cigarettes. These substances can all be harmful—especially to kids and teens. That's because your brain and body are still developing, so you could end up doing real damage to yourself. [16] X Research source It might not seem like a big deal at the time, but taking drugs can do long-term damage to your brain, heart, and other parts of your body. [17] X Research source You should also tell a trusted adult that someone offered you something illegal. [18] X Research source"
    },
    {
      "title": "Stick with friends who share your values.",
      "content": "Stick with friends who share your values. If you hang out with people who have really different values than you, they're going to be more likely to pressure you into things you aren't comfortable with. For instance, if school is important to you but not to your friends, they might pressure you to skip school or hang out with them instead of doing your homework. [19] X Research source It also helps to have a lot of different friends. That way, if one friend is pushing you to do something you know you shouldn't, you can just spend time with someone else, instead."
    },
    {
      "title": "Always tell an adult where you're going.",
      "content": "Always tell an adult where you're going. Never leave your house without letting your parents or guardians know first. Tell them where you're going, who you're going with, and when you expect to be home. [20] X Research source For instance, you might say, \"Hey Mom, Brit wanted to know if I could come over after school today, is that okay? His dad will pick us up from school and bring me home by 6:00.\" Also, if you're at school, never leave the school grounds without permission."
    },
    {
      "title": "Never accept rides from anyone you don't know.",
      "content": "Never accept rides from anyone you don't know. Absolutely never get into the car with a stranger—even if they say they know you or your parents. If a stranger does try to coax you into their car, run in the opposite direction and scream as loud as you can until you find an adult you can trust. [21] X Research source Also, don't get into a car with someone you do know unless you have a parent's permission."
    },
    {
      "title": "Don't go places alone.",
      "content": "Don't go places alone. When you're going places, you'll be a lot of safer if you have at least one other friend with you. If you can, try to stick with a group of friends—this will help keep you all safer. [22] X Research source Do this no matter where you're going, whether it's to the park, the pool, the mall, or even just walking around the block. This is especially important at night—although if you can, try to stick to going places during the daytime, when it's easier to see what's going on."
    },
    {
      "title": "Don't take side routes home.",
      "content": "Don't take side routes home. If you're walking to or from school, stick to a routine path that you're familiar with. That way, it will be easy for your parents to find you if you don't make it home on time. For instance, if you take an unfamiliar path through the woods and you slip and hurt your ankle, it will be a lot harder for anyone to figure out where you are."
    },
    {
      "title": "Practice safety drills regularly.",
      "content": "Practice safety drills regularly. At home, have regular fire drills so everyone knows exactly what to do. At school, pay close attention during drills so you'll know exactly how to evacuate in case there's an emergency."
    },
    {
      "title": "Avoid people who are sick.",
      "content": "Avoid people who are sick. If you know or suspect that someone else is sick, keep your distance from them. Stand at least 6 ft (1.8 m) away if possible—that way, even if they sneeze or cough, their germs will be less likely to reach you. [23] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source In the case of a pandemic like COVID-19, it may not always be possible to tell when someone else is sick. In that case, wearing a mask may help prevent the spread of germs that could make you ill. Also, avoid sharing personal items with other people—don't drink or eat after them, for instance. [24] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Wash your hands frequently.",
      "content": "Wash your hands frequently. One of the best ways to keep from getting sick is to wash your hands often throughout the day. Use soap and warm water, and wash for at least 20 seconds. Be sure to wash the palms of your hands, backs of your hands, between your fingers, under your fingernails, and around the base of your thumbs each time you wash. [25] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Be especially sure to wash your hands before you eat or prepare food, and after you cough, sneeze, go to the bathroom, or touch a dirty surface. If you can't get to soap and water, use an alcohol-based hand sanitizer. However, this won't clean your hands, so you should still wash them when you get a chance. [26] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Clean high-touch surfaces every day.",
      "content": "Clean high-touch surfaces every day. Use a disinfecting wipe or spray to clean things that are frequently touched in your home every day. For instance, every afternoon you might wipe down your countertop and table, as well as all of your doorknobs and the handles on your fridge, sink, and toilets. [27] X Research source This is a good practice to get into every day, but it's especially important when someone in your home is sick. If you work in an office, it's a good idea to sanitize surfaces in the public areas—like the break room—before you touch them, as well."
    },
    {
      "title": "Prepare meals safely to avoid food-borne illness.",
      "content": "Prepare meals safely to avoid food-borne illness. Getting sick from the food you eat is no fun at all. To avoid that, follow some safety guidelines in the kitchen. Here are a few examples: [28] X Research source Wash your hands frequently while you prepare food. Keep your food prep surfaces and utensils clean—wash them frequently or switch to a new one after you handle a food like raw meat. Always wash fruits and vegetables before you eat them. Cook foods (especially things like fish, meat, seafood, and eggs) to a safe internal temperature. Don't leave food sitting at room temperature. Eat it promptly or put it in the refrigerator."
    },
    {
      "title": "Get vaccinated against illnesses.",
      "content": "Get vaccinated against illnesses. Vaccines are a really important way to keep from getting dangerous diseases, so talk to your doctor about what you need. Make sure your vaccines are up-to-date, also—some vaccines, like the flu shot, need to be repeated every year. [29] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Vaccines for children are especially important, as they protect against childhood illnesses like measles, mumps, and rubella."
    },
    {
      "title": "Try not to touch your mouth or nose.",
      "content": "Try not to touch your mouth or nose. It can be tough, but to keep yourself safe from germs, get in the habit of keeping your hands away from your face. If you touch a surface that had germs on it, then you touch your eyes, nose, or mouth, you could get infected with those germs. [30] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you do need to touch your face—like you're putting on makeup—wash your hands first."
    }
  ]
}