{
  "url": "https://www.wikihow.com/B%E2%80%90boy-Dance",
  "title": "How to B‐boy Dance",
  "steps": [
    {
      "title": "Do the top rock.",
      "content": "Do the top rock. The top rock is a basic b-boy dance move that can be used as a single move or as a move between other moves. Stand with your legs hip width apart. Raise your right leg and cross it over so it is diagonally in front of your left leg. As you place your right leg down, hold your hands up so they form a t-shape. Cup your hands and relax your wrists, opening your arms. Then, return to the starting position. [1] X Research source Repeat the same movements with your left leg, lifting it and crossing it over your right leg on a diagonal. Open your arms as you do this. Return to the starting position. Practice doing the top rock move at a regular pace. Stay light and bouncy on your feet, landing softly and smoothly when you place your foot down."
    },
    {
      "title": "Try the indian step.",
      "content": "Try the indian step. Start by standing with your legs hip width apart. Lift your right leg and place it directly in front of your left leg. Raise your left heel and put your weight on your right foot. Keep your arms loose at your sides as you do this. Next, lift your left foot and place it behind your right foot. Turn your body to the right and raise your left foot off the ground. [2] X Research source Repeat these motions several times, moving back and forward by stepping your right leg in front of your left leg and then behind your left leg. Stay light and bouncy on your feet. Lift your arms in a t-shape and use them to punctuate your movements as you step backward and forward. You can switch to the other side after you have repeated the indian step a few times. Lead with your left leg."
    },
    {
      "title": "Do the kick and twist.",
      "content": "Do the kick and twist. The kick and twist is a popular basic b-boy move that can add variety to your steps. Start with your legs hip width apart. Lift your right foot and kick it forward with your toes facing upward. Next, step to the right one to two feet away with your foot facing outward. Lift your left foot and place it outside of your right foot. As you do this, kick your right foot in the air. [3] X Research source Repeat these movements a few times, starting with your right foot. Make sure you twist to the right as you move your left foot over your right foot and kick your right foot in the air smoothly. Swing your arms as you move, keeping them loose by your ribs. Once you’ve practiced this move a few times, switch to the other side, starting with your left foot. Repeat the same movements on the left side."
    },
    {
      "title": "Create a basic combination to music.",
      "content": "Create a basic combination to music. Pick music that is upbeat and has a 1-2 count. Often, popular hip hop and electronic music tracks are good for b-boy dancing. Do a series of moves one after the other to the music in counts. This will help you move seamlessly from one move to the other in the combination. [4] X Research source For example, you may do the top rock for eight counts, followed by the indian step for eight counts, and then the kick and twist for eight counts. Once you get this combination down, you can try moving a bit faster and doing each movement a bit quicker. For example, you may do the top rock for two counts, followed by the indian step for four counts, and then two counts of the kick and twist."
    },
    {
      "title": "Practice a swipe.",
      "content": "Practice a swipe. Start on your hands and feet, with your legs bent and a little wider than hip width apart. Bend over backward and place your hands on the ground so you are in a table shape, with your stomach and chest facing upward. Lift your right hand, supporting your weight on your legs and your left hand. Next, throw your right hand to the left in a swiping motion. Once it reaches the left side, switch hands so your left hand is now raised in the air. Then, let your left hand fall beside your right hand. [5] X Research source Once your left hand falls beside your right hand, lift off your hands and raise your right leg. Then, twist your right leg and left leg around so you return to the starting position, with both feet on the floor. Your legs should be bent and open, a little wider than hip width apart. Swipes always move in a circle. Try doing several swipes in a row, making a wide circle around the room. Always land back at the starting position before doing another swipe."
    },
    {
      "title": "Do a baby freeze.",
      "content": "Do a baby freeze. This is a popular hand balancing b-boy move. Begin with your right leg bent on the floor and your left leg bent with your knee off the floor. Place your left elbow against the outside of your right knee. Keep your palm flat, with your hand suspended in the air. Next, place your right elbow against the outside of your hip, keeping your palm flat and your hand extended in the air. [6] X Research source From this position, place your hands flat on the ground. As you do this, lean your body against your arms. Keep your arms straight and strong. Balance your legs against your arms and let your body fall forward until your head touches the floor. Then, extend your legs. You can also move your legs back and forth when you are in a baby freeze."
    },
    {
      "title": "Create an advanced combination to music.",
      "content": "Create an advanced combination to music. Select music that has a loud beat and follows a 1-2 count. Hip hop and electronica are popular genres for b-boy dancing. Do a series of movements in a row to the music. Use counts to determine how many movements you are doing in the combination. You can integrate basic moves between harder moves for variety. [7] X Research source For example, you may start with a top rock for four counts, followed by a swipe for four counts, and a baby freeze that you hold for four counts. You can speed up the combinations as you get more confident. For example, you may do a kick and twist for two counts, followed by a swipe for four counts, and a baby freeze for two counts."
    },
    {
      "title": "Take a b-boy dance class.",
      "content": "Take a b-boy dance class. See if there is a b-boy dance class at a dance or performance center near you. Check if your gym offers a b-boy dance class. Search online for b-boy dance classes in your area. Taking a class taught by a professional b-boy dancer can bring your skills to the next level and help you to get better. It can also expose you to new b-boy dance moves and styles. Taking a b-boy dance class can also be a great way to meet other b-boy dancers and build a community of dancers that you can learn from."
    },
    {
      "title": "Start a b-boy crew.",
      "content": "Start a b-boy crew. Get better at b-boy dancing by starting a crew with friends or family. Ask friends who are also interested in b-boy dancing if they want to start a crew where you get together and practice moves together. Approach people in your b-boy dance class to see if they’d be into starting a crew. Ask people who’s dancing you like or feel compliment your own style of dancing. Once you get a few dancers together for the crew, you should all come up with a name for the crew together. B-boy dance crew names are often playful, upbeat, and bold. Work with the other members of the crew to come up with a creative name that announces what your crew is about."
    },
    {
      "title": "Practice b-boy dancing with an experienced b-boyer.",
      "content": "Practice b-boy dancing with an experienced b-boyer. To improve your skills further, see if you can find a seasoned b-boy dancer to practice with. You may approach a b-boy dancer in a class or someone you notice in the community and ask them to mentor you. Learn new skills and variations on basic moves from them by practicing together on a regular basis. Get in the habit of practicing with them several times a week so you can get better and become a more confident b-boy dancer."
    }
  ]
}