{
  "url": "https://www.wikihow.com/Connect-a-Bluetooth-Speaker-to-Windows-10",
  "title": "5 Easy Steps to Connect a Bluetooth Speaker to Windows 10",
  "steps": [
    {
      "title": "Turn on your Bluetooth speaker and make it discoverable.",
      "content": "Turn on your Bluetooth speaker and make it discoverable. The steps to make your speaker discoverable vary by model and maker. There's usually a button you press and hold or a switch that you toggle to pair your speaker; if so, it'll be labeled with a Bluetooth icon. It might be a separate button, or it might be a multi-purpose button (i.e., the \"Power\" button can double as the pairing button if it's held down). Depending on the speaker, you may need to plug it in to pair it. Make sure the speaker is close to your Windows 10 computer."
    },
    {
      "title": "Open Action Center.",
      "content": "Open Action Center. Click the speech bubble icon on the taskbar. You'll usually see this near the right of your screen, as long as the taskbar is still in its default position. Otherwise, you'll find the Action Center icon near the time and date in your taskbar. If you have active notifications, the icon may look more like a square with a small number over it."
    },
    {
      "title": "Click the Bluetooth icon .",
      "content": "Click the Bluetooth icon . The tile will turn blue to indicate Bluetooth is on. You can also enable Bluetooth Settings. Go to Settings > Devices > Bluetooth & other devices and slide the \"Bluetooth\" switch to the On position."
    },
    {
      "title": "Click Connect.",
      "content": "Click Connect . This is the tile with an icon of two devices. The panel will slide away for a moment as it searches."
    },
    {
      "title": "Click your speaker’s name and icon.",
      "content": "Click your speaker’s name and icon. If your Bluetooth speaker is in pairing mode, it should show up in the panel on the right of your screen. This connects the speaker to Windows 10. You should now be able to play music and audio from your computer through your speaker. Your PC and speaker will connect whenever they are in range of each other and have Bluetooth turned on. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    }
  ]
}