{
  "url": "https://www.wikihow.com/Activate-Call-Forwarding",
  "title": "How to Activate Call Forwarding",
  "steps": [
    {
      "title": "Open your iPhone’s Settings .",
      "content": "Open your iPhone’s Settings . You’ll usually find it on the home screen. [1] X Research source This method will forward all incoming calls to a different phone number. If you only want to forward phone calls in certain situations (such as when you’re on the phone or unavailable), skip to the last step for instructions."
    },
    {
      "title": "Scroll down and tap Phone.",
      "content": "Scroll down and tap Phone . It’s near the middle of the menu. [2] X Research source"
    },
    {
      "title": "Tap Call Forwarding.",
      "content": "Tap Call Forwarding . It’s toward the bottom of the “CALLS” section. [3] X Research source"
    },
    {
      "title": "Slide the “Call Forwarding” switch to On .",
      "content": "Slide the “Call Forwarding” switch to On . This opens a new blank below. If you don’t see a switch or see a perpetually-spinning wheel, you’ll need to contact your mobile carrier to enable call forwarding."
    },
    {
      "title": "Tap Forward To.",
      "content": "Tap Forward To . The keypad will appear."
    },
    {
      "title": "Enter the forwarding phone number.",
      "content": "Enter the forwarding phone number. This is the phone number that your incoming calls will be forwarded to."
    },
    {
      "title": "Tap < Call Forwarding.",
      "content": "Tap < Call Forwarding . It’s at the top-left corner. This saves your changes and adds a new icon to the status bar at the top of the screen. As long as your calls are being forwarded, a tiny icon of a phone receiver with a right-pointing arrow will be visible in that bar. To disable call forwarding, return to the Call Forwarding screen and toggle off the switch."
    },
    {
      "title": "Set up call forwarding for specific situations.",
      "content": "Set up call forwarding for specific situations. You should only complete this step if you want to forward calls only in specific situations (such as when you’re unreachable). Since there’s no option to specify these situations in the Phone app, you’ll have to dial a code, followed by the phone number: Forward if you don’t answer: **61*1+PhoneNumber# To disable, dial ##61# Forward if you’re unreachable: **62*1+PhoneNumber# To disable, dial ##62# Forward if you’re on another call: **67*1+PhoneNumber# To disable, dial ##67#"
    },
    {
      "title": "Open the Phone app.",
      "content": "Open the Phone app. This is the app you use to make phone calls. [4] X Research source Since there are many different phone apps available for different versions of Android, your menu names may not match what you see here. If you can’t follow these steps exactly, try browsing different menus until you find the Call Forwarding option. Some carriers do not support call forwarding. If you purchased your phone from a carrier that doesn’t support forwarding, you may not find a Call Forwarding menu (or the options within it may be disabled)."
    },
    {
      "title": "Tap the menu icon.",
      "content": "Tap the menu icon. The menu icon will usually look like three lines ( ≡ ) or three dots ( ⁝ or ⋯ )."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . If you don’t see this option, it may be in a different menu."
    },
    {
      "title": "Tap More settings or Calls.",
      "content": "Tap More settings or Calls . This menu may also be called Call Settings . [5] X Research source"
    },
    {
      "title": "Tap Call Forwarding.",
      "content": "Tap Call Forwarding . A list of forwarding options will appear. If your carrier doesn’t support call forwarding, you may not see this menu at all."
    },
    {
      "title": "Select which calls to forward.",
      "content": "Select which calls to forward. Tap Always forward to forward all incoming calls to the desired number, or tap the option that best fits your situation (e.g., Forward when busy ) instead. [6] X Research source"
    },
    {
      "title": "Enter the forwarding phone number.",
      "content": "Enter the forwarding phone number. This is the phone number that your incoming calls will be forwarded to. [7] X Research source"
    },
    {
      "title": "Tap TURN ON.",
      "content": "Tap TURN ON . All incoming phone calls will now be forwarded to the number you selected. To disable call forwarding, return to this screen and tap TURN OFF ."
    },
    {
      "title": "Pick up your landline phone.",
      "content": "Pick up your landline phone. Wait for the dial tone. Some phone providers require you to sign up for call forwarding/diversion at an additional cost. This method will only work if your service supports call forwarding."
    },
    {
      "title": "Dial the call diversion code.",
      "content": "Dial the call diversion code. After a brief pause (or three quick dial tones), you’ll hear the steady dial tone once more. The code you’ll dial depends on how you want to forward calls: [8] X Research source Forward all incoming calls: *72 Forwarding when you don’t answer: *92 Forward when busy/on the other line: *90"
    },
    {
      "title": "Dial the forwarding phone number.",
      "content": "Dial the forwarding phone number. This is the phone number that your incoming calls will be forwarded to."
    },
    {
      "title": "Wait for confirmation.",
      "content": "Wait for confirmation. Confirmation may occur in one of two ways: If you hear a confirmation message, you’re all set. If you hear ringing through the receiver, this means your provider will confirm the forwarding once another party answers the call."
    },
    {
      "title": "Disable call forwarding when desired.",
      "content": "Disable call forwarding when desired. If you decide not to forward calls, dial one of the following codes: [9] X Research source Stop forwarding all calls: *73 Stop forwarding on no answer: *93 Stop forwarding when busy: *91"
    },
    {
      "title": "Pick up your landline phone.",
      "content": "Pick up your landline phone. Wait for the dial tone. Some phone providers require you to sign up for call forwarding/diversion at an additional cost. This method will only work if your service supports call diversion."
    },
    {
      "title": "Dial the call diversion code, followed by the forwarding phone number.",
      "content": "Dial the call diversion code, followed by the forwarding phone number. The call diversion code varies by service provider. [10] X Research source BT, SkyTalk, TalkTalk, and others Divert all calls: *21*(phone number to forward to). Divert when busy: *67*(phone number to forward to). Divert when you don’t answer: *67*(phone number to forward to). Virgin Media and others Divert all calls: *70*(phone number to forward to). Divert when busy: *76*(phone number to forward to). Divert when you don’t answer: *77*(phone number to forward to)."
    },
    {
      "title": "Press the # (pound) key.",
      "content": "Press the # (pound) key. Incoming calls will now be diverted to the forwarding phone number."
    },
    {
      "title": "Stop diverting calls.",
      "content": "Stop diverting calls. If you decide to disable call diversion, pick up the phone and dial #(the diversion code)#."
    }
  ]
}