{
  "url": "https://www.wikihow.com/Calculate-Simple-Interest",
  "title": "How to Figure Out Simple Interest",
  "steps": [
    {
      "title": "Determine the total amount borrowed.",
      "content": "Determine the total amount borrowed. Interest is paid on the total amount of money borrowed, also known as the principal . In the case of an investment, your principal is the total amount of money you invested. This amount is represented in the simple interest formula by a \"P.\" [1] X Research source For example, suppose you bought a car for $12,000. You paid a $3,000 down payment and financed the rest. The principal on your car loan would be $9,000."
    },
    {
      "title": "Convert the interest rate to a decimal value.",
      "content": "Convert the interest rate to a decimal value. Interest rates are typically expressed as a percentage. Divide the percentage rate by 100 to turn it into a decimal. Use that decimal in the formula. [2] X Research source For example, if your car loan had an annual interest rate of 7%, you would express this in the simple interest formula as 0.07."
    },
    {
      "title": "Use the correct time period for the length of the loan.",
      "content": "Use the correct time period for the length of the loan. Loans are usually made for a certain number of years, represented by \"t\" in the simple interest equation. However, for some loans, such as car loans, the length of the time period is expressed as a number of months. For this simple interest formula, you would need to turn months into years. [3] X Research source For example, if you took out a 60-month car loan, you would divide 60 by 12 (the number of months in a year) to determine that the loan is 5 years. The formula I = P i n {\\displaystyle I=Pin} can also be used if you have a loan term expressed in months or weeks. This formula is a little different in that \"i\" represents the interest rate during each period and \"n\" refers to the number of periods. You would divide the annual interest rate by the number of periods in a year to get the right value for \"i,\" then use the total number of months for \"n.\" Whether you adjust the time period or the interest rate, you should get the same result."
    },
    {
      "title": "Find the total interest owed using the formula I = P r t {\\displaystyle I=Prt} .",
      "content": "Find the total interest owed using the formula I = P r t {\\displaystyle I=Prt} . Once you have numerical values for the pieces of the formula, multiply them together to determine the amount of interest owed over the life of the loan or investment. Continuing the example, you financed a car with a $9,000 loan at 7% interest for 5 years: [4] X Research source P = 9 , 000 {\\displaystyle P=9,000} r = 0.07 {\\displaystyle r=0.07} t = 5 {\\displaystyle t=5} The interest owed is $3,150. 3 , 150 = 9 , 000 x 0.07 x 5 {\\displaystyle 3,150=9,000x0.07x5} ."
    },
    {
      "title": "Calculate the total amount owed over the life of the loan.",
      "content": "Calculate the total amount owed over the life of the loan. When you pay back a loan with simple interest, you pay the principal amount that you originally borrowed plus the total interest on that amount. [5] X Research source To find the total amount, add the interest back into the principal using the formula I + P {\\displaystyle I+P} . Continuing with the previous example, the total amount owed would be $12,150. 3 , 150 + 9 , 000 = 12 , 150 {\\displaystyle 3,150+9,000=12,150} . You can combine both equations together if you're looking for the total amount of money that will be accumulated over the life of the loan or investment by using the formula A = P ( 1 + r t ) {\\displaystyle A=P(1+rt)} ."
    },
    {
      "title": "Start with the initial amount borrowed or invested.",
      "content": "Start with the initial amount borrowed or invested. Like simple interest, compound interest is charged on the principal. But unlike simple interest, compound interest is added to the principal. In the compound interest formula, the principal is symbolized by a \"P,\" just as in the simple interest formula. [6] X Research source For example, suppose you bought a house for $150,000. You made a $50,000 down payment and took out a mortgage on the rest. The principal of your mortgage would be $100,000."
    },
    {
      "title": "Express the annual interest rate as a decimal.",
      "content": "Express the annual interest rate as a decimal. In the compound interest formula, just as in the simple interest formula, the interest rate is symbolized by the letter \"r.\" Divide the percentage by 100 to get the decimal value. [7] X Research source For example, if the annual interest rate on your mortgage is 8%, you would use 0.08 in the compound interest formula."
    },
    {
      "title": "Determine the term of the loan or investment in years.",
      "content": "Determine the term of the loan or investment in years. In the compound interest formula, the letter \"t\" is used to symbolize the number of years the loan or investment will be in effect. As with the simple interest formula, the value for \"t\" must be years, so if the term is expressed in months or weeks, you would need to convert them to years. [8] X Research source For example, if you have a 10-year mortgage on the house you bought, you would use 10 in the compound interest formula."
    },
    {
      "title": "Find the number of times the interest will be compounded in 1 year.",
      "content": "Find the number of times the interest will be compounded in 1 year. When interest is compounded, it is added to the principal at the end of each compounding period. In the next period, interest is figured on the total amount of principal and interest from the first period. This cycle continues for the entire term of the loan, or until the loan is paid off. [9] X Research source For example, if your mortgage compounds interest monthly, it would be compounded 12 times in a year. In your compound interest formula, this value is represented by an \"n.\" [10] X Research source In the case of an investment, interest would be compounded until the end of the deposit term, or until you withdrew your investment."
    },
    {
      "title": "Calculate the total amount accumulated using the compound interest formula.",
      "content": "Calculate the total amount accumulated using the compound interest formula. Once you have numbers for all the values, you can determine the total amount of money that will be accumulated over the life of the loan or investment, including interest. This amount is symbolized by the letter \"A\" in your formula. Use the formula A = P (1 + r/n) nt . [11] X Research source P = 100 , 000 {\\displaystyle P=100,000} r = 0.08 {\\displaystyle r=0.08} n = 12 {\\displaystyle n=12} t = 10 {\\displaystyle t=10} The total amount paid over the life of the mortgage would be $221,964. 221,964 = 100,000 (1 + 0.08/12) 12(10) . The total interest paid would be $121,964.0. Compound interest can be significantly greater than simple interest, particularly over the long term. If the same mortgage had simple interest, you would only pay $80,000 in interest over the life of the loan."
    }
  ]
}