{
  "url": "https://www.wikihow.com/Be-Random",
  "title": "How to Be Random",
  "steps": [
    {
      "title": "Use non sequiturs.",
      "content": "Use non sequiturs. [1] X Research source Non sequitur is Latin for \"does not follow\" and describes a speaker's failure to construct an argument in a logical manner. This phrase has been used since the time of the Caesars. Today, the word \"random\" is used in basically this way, referring to the use of non sequitur for comedy. The word \"random\" really refers to a process or a decision made without a conscious or systematic choice. True randomness is unplanned, making it somewhat difficult to provide a concrete strategy for \"being random.\" Strictly speaking, a person is not random. A phrase or an action can seem spontaneous or unexpected, but one person is not more or less \"random\" than another. You can, however, learn to be wacky and spontaneous in the way that people mean when they say \"random.\""
    },
    {
      "title": "Be oddly specific with what you are saying.",
      "content": "Be oddly specific with what you are saying. It will sound more random, or like you've got some kind of head injury. For example, instead of saying, \"A few years ago,\" be more specific and say, \"A few years after the year before ten years ago, I was speaking to the brother of my sister's father (uncle).\" Take your figures of speech to extremes. [2] X Research source"
    },
    {
      "title": "Learn very specific facts and recite them regularly.",
      "content": "Learn very specific facts and recite them regularly. Start thinking of the most obscure, inane, and spectacularly random details under the sun and committing them to memory. The more you've got rattling around in your noggin', the more random you'll be able to be. Don't use regular colors, like \"blue,\" use \"eggshell,\" or \"dioxazine violet.\" Look through Liquitex paint names for ideas; a favorite of theirs is \"hookers green\" in your writing and your speech. And yes, those are real colors. The next time someone asks you to pick a number between one and ten, answer with something like \"pi\", \"e\", or \"the square root of seven.\""
    },
    {
      "title": "Avoid \"wandom\" words.",
      "content": "Avoid \"wandom\" words. \"Wandom\" means \"wannabe random,\" and it can be extremely heartbreaking that someone would feel the need to invent this term. This is usually formerly random material that has been overused and is just not random anymore. Strictly speaking, anything that you've used for joke purposes before can only be \"random\" once. Wandom words include pickle, chicken, monkey, dino, penguin, purple, pie, squirrel, moo, pizza, mayonnaise, pudding, pants, rawr, socks, pony, llama, unicorn, taco (or burrito), cheese, and nose. Of course, the randomness is fairly culturally specific to North American school culture, so feel free to ignore this step. Use random words as you see them."
    },
    {
      "title": "Speak about yourself in the third person.",
      "content": "Speak about yourself in the third person. Third person means replacing \"I\" with your full name. This is common to the ego-obsessed and many professional wrestlers. [3] X Research source If you want to take it even further, when you're speaking about the group you're in by using random alternative group concepts. Instead of saying \"we,\" say \"our company,\" \"our army,\" \"the movement,\" or \"the squad.\" Keep switching between normal speaking and these methods, and also constantly changing the replacements themselves for maximum efficiency."
    },
    {
      "title": "Make random noises.",
      "content": "Make random noises. Things like \"mwargh\" or \"oooooohh\" or even \"bwah\" and \"digee\" will work divinely. You could also laugh. A lot and randomly. People will know you for it. Sometimes, you can be the person who laughs and makes everyone else join in! Don't try for this, though. You have to kind of be in your own world first."
    },
    {
      "title": "Use weird voices.",
      "content": "Use weird voices. Try putting on a new accent, or speaking in an abnormally high, low, or loud voice. You can experiment a lot with this. Try seeing how far you can push your voice!"
    },
    {
      "title": "Dress in unusual clothing combinations.",
      "content": "Dress in unusual clothing combinations. Put on a very normal outfit, like jeans and T-shirt, but add something ridiculous. Like a big gorilla mask. Of course, you could also go with strange clothing all the way. You might want to invest in things like suspenders, top hats, parasols, glitter vests, canes, ribbons, army boots, hippie or (real) vintage things, neon things, glowsticks, or rainbow suspenders. The trick is to have basic staples: plain T-shirts in varying colors and a couple pairs of blue jeans, maybe in gray, paired with freaky accessories."
    },
    {
      "title": "Form unusual obsessions.",
      "content": "Form unusual obsessions. Pick a certain state, food, person, or animal. Make them very public and insane. Maybe you could be obsessed with the Hindenberg disaster, labradoodles, or the actor Charles Nelson Riley. Learn as much as possible about unusual and specific historical trivia and bring it up more or less at random. Pick something you're genuinely interested to make it worth your while."
    },
    {
      "title": "Make plans and change them mid-way.",
      "content": "Make plans and change them mid-way. Just because you're buying a new coat doesn't mean you can't go to the zoo on the way there. Plans should be broken if you think of a more exciting plan. Always let spontaneity trump whatever it is you thought was more important."
    },
    {
      "title": "Listen.",
      "content": "Listen. Secret to random success? Listening closely to the conversation and responding with something that'll come across as off-the-wall at an appropriate moment. It's not appropriate to interject a \"random\" gag when your girlfriend is trying to tell you about how she feels, or when your parents are scolding you about not cleaning your room. Listen to what other people say to find a good in. Then jump. [4] X Research source Good times for a \"random\" joke? When a conversation dies. You're in a group and everyone's being boring, talking about the same old, same old? Tell them all about Star Trek: The Next Generation, a show that ended like decades ago."
    },
    {
      "title": "Add a title to your name.",
      "content": "Add a title to your name. Why be your regular old self? Only refer to yourself as \"Lord Steven\" or \"Captain Theresa.\" Better yet, invent your own. If you use an adjective, make sure it doesn't usually apply to people in normal circumstances. If You use a noun, make it an uncommon one, or one in another language. Examples include John Doe the inhospitable, Dr. Doe, John Doe of Topeka, and John el Fuego."
    },
    {
      "title": "Study the masters.",
      "content": "Study the masters. So-called random humor isn't the invention of the 13 year olds at your school, despite what they'll have you believe. If you want to brush up on wacky, off-the-wall, \"random\" styles of humor, explore the following unusual sources to get your fix: Ultimate Warrior's pro wrestling promos. Monty Python's Flying Circus Family Guy Zach Galifianakis' stand-up routine Dada Julius Caesar"
    },
    {
      "title": "Try to lose your inhibitions.",
      "content": "Try to lose your inhibitions. Many people think of very random things through the day, but never act on them because they're too afraid of being embarrassed or seen as weird. Want to run at pigeons in the middle of a conversation? Suddenly feel like running doing a slope screaming \"Wheeee!\"? Get the urge to pick roadside daffodils and walk off with a bouquet of them while you're going somewhere? Surrender to your whims."
    },
    {
      "title": "Break free of conventional rules.",
      "content": "Break free of conventional rules. Finishing your sentences clearly? Holding the same opinion from hour to hour? What for? If you decide you want to buy rubber ducks whilst talking about something important — don't be afraid to end the conversation and do it! Decorum means nothing to the total random. If you're at a college library and suddenly, you just want to find Waldo, go to the desk and ask for Where's Waldo. They probably won't have it, but hey, at least you tried."
    }
  ]
}