{
  "url": "https://www.wikihow.com/Blow-Smoke-Out-of-Your-Nose",
  "title": "How to Blow Smoke Out of Your Nose",
  "steps": [
    {
      "title": "Get the mildest cigar possible if you are new to smoking.",
      "content": "Get the mildest cigar possible if you are new to smoking. It will burn slightly when you blow the smoke through your nose. Mild cigars don’t have as much flavor, which makes them less harsh on your throat and nose. Strong cigars produce harsher smoke, and this is often uncomfortable to practice with if you are a beginner. [1] X Research source Strong cigars include full-bodied options or those with a peppery taste."
    },
    {
      "title": "Light your cigar and take a drag.",
      "content": "Light your cigar and take a drag. Hold a flame at the end of your cigar to light it and take a couple puffs to get it burning. Then, inhale deeply to take a drag. If you are using an electronic cigarette, simply push the button on your device and inhale to take a drag."
    },
    {
      "title": "Close your lips to keep the smoke in your mouth.",
      "content": "Close your lips to keep the smoke in your mouth. Take a drag from your cigar, and bring your lips together. It’s okay if some of the smoke escapes as you close your mouth. [2] X Research source You may taste the mild flavor of your cigar as you do this."
    },
    {
      "title": "Move your tongue to the roof of your mouth to force the smoke upwards.",
      "content": "Move your tongue to the roof of your mouth to force the smoke upwards. With your mouth closed, bring your tongue to the back of your top teeth, and slide it back until you reach the center of the back of your mouth. [3] X Research source Since your mouth is closed, the smoke can’t go out of your mouth, so the only place it can move is through your nose."
    },
    {
      "title": "Push the air through your nose to exhale the smoke.",
      "content": "Push the air through your nose to exhale the smoke. Simply let the air pressure in your lungs push the air through your nose. You can practice with varying degrees of force to make the smoke come out quicker or slower. This may seem tricky at first, but with some practice, the action will seem easier and effortless. [4] X Research source For instance, pretend you are swimming underwater. While holding your breath, push the air out of your nose to exhale and create bubbles in the water. Instead of bubbles, you are blowing out smoke."
    },
    {
      "title": "Take a large drag with your smoking device.",
      "content": "Take a large drag with your smoking device. Bring your smoking device to your lips, inhale deeply for several seconds, and shut your mouth. Hold the smoke in your mouth for 2-5 seconds or so. [5] X Research source This trick is typically performed with electronic cigarettes; however, doing smoke tricks over time can damage your lungs and throat."
    },
    {
      "title": "Close the middle part of your lips to practice blowing smoke sideways.",
      "content": "Close the middle part of your lips to practice blowing smoke sideways. During the dragon trick, you blow smoke through your mouth and your nose at the same time. In order to blow smoke through the mouth, bring only the middle of your lips together so air can still escape on either side. [6] X Research source If you are having a hard time keeping just the middle shut, try adjusting your tongue to the middle of your bottom teeth. You can also try widening your smile to help the air pass through your mouth."
    },
    {
      "title": "Exhale the smoke through your nose if you need to practice retrohaling.",
      "content": "Exhale the smoke through your nose if you need to practice retrohaling. To blow smoke out of your nose, simply push air forcefully through your nose instead of exhaling with your mouth, as if you are taking a reversed deep breath. Use moderate force as you do this so the smoke can easily travel up your nasal passageway. [7] X Research source If it’s helpful, you can also slide your tongue to the roof of your mouth to help direct the smoke. However, this may be more tricky to do if you are a beginner with smoke tricks."
    },
    {
      "title": "Blow smoke through your nose and mouth simultaneously to do the trick.",
      "content": "Blow smoke through your nose and mouth simultaneously to do the trick. The “Dragon” trick is performed in 2 stages: blowing smoke out of your nose and blowing smoke out of the corners of your mouth. With smoke in your mouth, close just the middle of your mouth, hold the smoke in your mouth for a second and push the smoke through both your nose and mouth with a quick exhale. [8] X Research source As you do this, the smoke from your nose will travel downward while the smoke from your mouth travels upward. Imagine you are a dragon puffing out a large cloud of smoke. Acting the part can make performing the trick seem easier. Don’t get discouraged if you don’t nail the trick in the first few attempts!"
    }
  ]
}