{
  "url": "https://www.wikihow.com/Change-a-Chain-on-a-Mountain-Bike",
  "title": "How to Change a Chain on a Mountain Bike",
  "steps": [
    {
      "title": "Secure your bike.",
      "content": "Secure your bike. It's unlikely that your kickstand will be sufficient for you to get a good look at your bike without it falling over. A bike rack that has hooks from which you can hang your bike works very well, but you can also turn your bike upside down so it rests on the seat and handlebars. Inspecting your chain with your bike's wheels facing upwards will make it more comfortable for you to inspect and work on. If you don't have a rack, simply lean your bike upright against a wall."
    },
    {
      "title": "Take a picture of the chain.",
      "content": "Take a picture of the chain. To make the reinstallation process easier, take a picture of the chain so you can refer to it later. Make sure your picture shows how the chain feeds through the gear mechanism."
    },
    {
      "title": "Check for a master link.",
      "content": "Check for a master link. A master link is a special link in your bike chain that has a pin/slot configuration that will allow you to easily remove your chain from the bike. Two popular kinds of master links are Connex and SRAM Powerlink. Knowing where your master link is ahead of time will make chain replacement go smoother. The master link for a bike is specific to the chain size and brand. If your bike does not have a master link, you can install one yourself or have it done at your local bike shop. This installation is usually inexpensive, costing about $15 in most cases. If your bike does not have a master link and you prefer not to have one installed, order a chain-tool to remove the chain. They're inexpensive and essential pieces of equipment. [1] X Research source"
    },
    {
      "title": "Position your chain.",
      "content": "Position your chain. This is especially important if you have a master link. Removing a master link that's positioned on the teeth of the chain ring or a gear can be very difficult. Positioning the master link so it is suspended at the midpoint between the crankset and the rear wheel will be easiest. If you are using a chain tool, you can still benefit from proper chain positioning. Some parts of your chain will be dirtier or have more wear than others. A clear segment of chain positioned at the midpoint between the wheels will be easiest to remove with your chain tool. [2] X Research source"
    },
    {
      "title": "Remove the chain.",
      "content": "Remove the chain. Now that the chain is in position, you can remove it. If you have a master link, use master-link pliers or your hands to squeeze both ends of the master link inwards so the pin comes out of its slot and the link comes apart, freeing your chain. If you're using a chain tool: Set the chain tool on the link you are trying to remove so it aligns with one of the round holes to either side of the link. Screw the chain tool so it moves through the hole. This will push out the pin that is keeping that link together. Try not to push the pin completely free of the link. This will make it difficult, or in some cases impossible, to reassemble that link of the chain. You'll often feel a popping or snapping when the pin pushes free of the link. This is a good indicator that the link has been disengaged. Some chain tools are only intended for certain sized links, though some can be used on several different sizes of chain. Check the instructions on your chain tool before using it. [3] X Research source"
    },
    {
      "title": "Avoid using failed chains as replacements.",
      "content": "Avoid using failed chains as replacements. Chains generally fail because they have reached their limit or been put under too much stress. Replacing a failed chain on your bike could result in an even more severe failure down the road. To prevent injury to yourself or your mountain bike, you should buy a new chain instead of reusing old ones. [4] X Research source Bike chains can be bought at your local bike shop or, in some cases, your local hardware store."
    },
    {
      "title": "Measure your replacement chain.",
      "content": "Measure your replacement chain. It's important that you only use the kind of chain intended for your bike. For example, an 11-speed bike will use an 11-speed chain. Hang your old bike chain so it dangles freely and do the same with your new chain beside the old one. Count the number of links if your new chain is longer than the old. This will be the number of links you need to remove. If your chain has snapped and it is unreliable to measure your new chain, you can remove links after feeding the chain into the drivetrain of your bike. [5] X Research source"
    },
    {
      "title": "Insert your chain into the gear mechanism.",
      "content": "Insert your chain into the gear mechanism. For more complex mountain bike, you may need to consult the picture you took of how the old chain feeds through the gear mechanism to do this properly. Simple mechanisms may be more intuitive. Pull the chain through the entire drivetrain until both ends terminate at the bottom midpoint between your wheels. Positioning the ends of your chain at the bottom midpoint between the wheels of your bike will make it more accessible and allow gravity to keep the chain on the bike until you can secure it. [6] X Research source"
    },
    {
      "title": "Remove extra links from the chain, if necessary.",
      "content": "Remove extra links from the chain, if necessary. If your chain is loose, you'll need to remove some links. This is likely the case if you were not able to measure your chain. Shift your bike to its lowest gear, and then use your chain tool to remove links one at a time to shorten the chain until it is taut in the drivetrain. When removing extra links, avoid popping the pin holding them together completely free of the link. This will make it difficult to reattach the link if you shorten it too much. [7] X Research source For the best ride, you'll need the chain to be strung tautly between the wheels in its lowest gear. [8] X Research source"
    },
    {
      "title": "Attach the loose ends of your chain.",
      "content": "Attach the loose ends of your chain. With a master link, all you need to do is slip the pin of the link into its slot to complete the link. If you removed your chain with a chain tool, you'll have to re-couple the split link by lining up its halves together and using a pair of pliers to force the pin back through the hole to complete the link. You should feel a click or a pop when the pin of a master link slides into place. You can also pull on the chain to either side of the link to securely seat the pin of the master link in place."
    },
    {
      "title": "Test your chain.",
      "content": "Test your chain. Reposition your bike back on its rack and move the pedals manually with your hands to run the chain through the drivetrain of your bicycle. The chain should move smoothly. If you notice stiff links, these are often caused by a protruding link pin, and can be fixed by resetting the pin with your chain tool and pliers. Cycle the suspension by sitting on the saddle and bouncing up and down a few times to test your chain length. To protect your chain from the elements and to help it run smoothly in your drive train, you should lubricate your chain with a suitable bicycle chain lubricant."
    },
    {
      "title": "Use a chain wear indicator to evaluate your chain for best results.",
      "content": "Use a chain wear indicator to evaluate your chain for best results. You can find a chain wear indicator at your local bike shop or maybe even at a hardware store. You'll have to attach the indicator between the links of your chain and follow the directions on it to interpret its reading. Most chain wear indicators will have a sticker that establishes the values for a worn chain and an unworn chain. If your wear indicator does not, check the box it came in for these values. If you do not have a wear indicator, you can perform a hand check of the chain. Use moderate pressure to lift a section of your chain from the chainring of your bike with your fingers. A small gap should form between the chain and the ring. If you can clearly see through the gap over three or four teeth, your chain is worn. [9] X Research source"
    },
    {
      "title": "Try to join the ends of your chain to test for wear as a simpler alternative.",
      "content": "Try to join the ends of your chain to test for wear as a simpler alternative. If inspecting your chain with a wear indicator or a physical gap check aren't an option, or if your chain is already off the bike, you can also check for wear by trying to touch the ends of the bike chain. Lay your chain on a clean surface so that the holes in the chain are oriented up and down. Then: Try to touch the ends of the chain together while keeping the holes facing up and down. Over time, chains are bent by the action of your bikes derailleur. Note the amount of sideways flex in your chain. A worn chain will have a great deal flexion. Newer chains resist touching and only arc slightly. [10] X Research source"
    },
    {
      "title": "Familiarize yourself with the drivetrain.",
      "content": "Familiarize yourself with the drivetrain. The drivetrain of your bike is the part that transfers the energy you put into the pedals through the chain to your gears to move the wheels. You'll want to pay extra close attention to how the chain feeds into the gears. Knowing how the chain fits in the mechanism will allow you to replace it with greater ease."
    }
  ]
}