{
  "url": "https://www.wikihow.com/Connect-Time-Capsule-to-Mac",
  "title": "How to Connect Airport Time Capsule to Mac",
  "steps": [
    {
      "title": "Connect an Ethernet cable to the Time Capsule.",
      "content": "Connect an Ethernet cable to the Time Capsule. Use the provided Ethernet cable to connect to the WAN port on the Time Capsule."
    },
    {
      "title": "Connect the Ethernet cable to the broadband modem or router.",
      "content": "Connect the Ethernet cable to the broadband modem or router. A typical broadband modem has four WAN ports on the back that you can connect an Ethernet cable too. Connect the other end of the Ethernet cable connected to your Time Capsule to the broadband modem. [2] X Research source"
    },
    {
      "title": "Plug the Time Capsule into a power outlet.",
      "content": "Plug the Time Capsule into a power outlet. Use the AC adapter to plug the Time Capsule into an open power outlet on the wall. Make sure you have a free outlet near your broadband modem to connect your Time Capsule. It's recommended that you plug the Time Capsule (and all your valued electronics) into a surge protector to prevent any damage in the event of an electrical surge."
    },
    {
      "title": "Open the Finder on your Mac.",
      "content": "Open the Finder on your Mac. The Finder is the app that has a blue and white image with a smiley face. The Finder is used to browse files and applications on your Mac."
    },
    {
      "title": "Click Applications.",
      "content": "Click Applications . It's in the sidebar to the left in the Finder. This will display all the applications installed on your Mac."
    },
    {
      "title": "Double-click the Utilities folder.",
      "content": "Double-click the Utilities folder. It's the blue folder with the icon of a wrench and screwdriver on it at the bottom of the page. This is where all your Mac's system applications are stored."
    },
    {
      "title": "Double-click AirPort Utility.",
      "content": "Double-click AirPort Utility . It's the app with a blue Wi-Fi symbol on a white background. It's located near the top of the page when displayed alphabetically."
    },
    {
      "title": "Click Other wireless devices.",
      "content": "Click Other wireless devices . It's in the upper-left corner of the AirPort Utility app."
    },
    {
      "title": "Click AirPort Time Capsule.",
      "content": "Click AirPort Time Capsule . It's in the menu for Other wireless devices in AirPort Time Capsule. You may see six letters and numbers after \"AirPort Time Capsule\" like \"fea88c\" or something similar."
    },
    {
      "title": "Select Create New Network and click Next.",
      "content": "Select Create New Network and click Next . You will see a list of options when you click on the Time Capsule in AirPort Utility. Click the radial button next to \"Create New Network\" at the top of the list of options. Click \"Next\" when you are done."
    },
    {
      "title": "Name the network.",
      "content": "Name the network. Click the text box next to \"Network Name\" and type a name for the network. You can name the network anything you want. You can name it your last name, or something clever."
    },
    {
      "title": "Name the base station.",
      "content": "Name the base station. Click the box next to \"Base Station Name\" and type a name. The base station is the name for the Time Capsule. Having a separate name for the Time Capsule is useful if you ever get another Time Capsule to expand your network."
    },
    {
      "title": "Create a password.",
      "content": "Create a password. Use the text boxes next to \"Network Password\" and \"Verify Password\" to create a password. Make sure the password is identical for both boxes. To create a separate password for the Time Capsule, uncheck \"Use a single password\" This will give you two more boxes to create a password for the individual Time Capsule. This is useful if you have more than one Time Capsule and you want to create a password for a guest house or guest room."
    },
    {
      "title": "Click Next.",
      "content": "Click Next . It's in the lower-right corner of the AirPort Utility app."
    },
    {
      "title": "Restart your modem.",
      "content": "Restart your modem. Now you will be asked to reboot your modem. Unplug it for about a minute and plug it back in and wait for it to fully restart."
    },
    {
      "title": "Create a guest network (optional).",
      "content": "Create a guest network (optional). If you wish to enable a guest network, check the checkbox next to \"Enable guest network\" and then type a name for the guest network. This allows guests to be able to access your network without being able to access all the computers on the network. If you don't want to have a guest network, don't click the checkbox."
    },
    {
      "title": "Click Next.",
      "content": "Click Next . It's in the lower-right corner of the AirPort Utility app."
    },
    {
      "title": "Enable diagnostics & usage data to be sent to Apple (optional).",
      "content": "Enable diagnostics & usage data to be sent to Apple (optional). If you want your Time Capsule to send diagnostics and usage data to Apple, click the radial button next to \"Send diagnostics & usage data to Apple\". All data sent to Apple is anonymous. If you don't wish to send diagnostics and usage data to Apple, click the radial button next to \"Don't Send\"."
    },
    {
      "title": "Click Next.",
      "content": "Click Next . It's in the lower-right corner of the AirPort Utility app. AirPort Utility will now configure your network."
    },
    {
      "title": "Click Done.",
      "content": "Click Done . You network setup is now complete."
    },
    {
      "title": "Click the Apple icon .",
      "content": "Click the Apple icon . It's in the menu bar in the upper-left corner of the screen."
    },
    {
      "title": "Click System Preferences….",
      "content": "Click System Preferences… . This is where you access your system preferences applications."
    },
    {
      "title": "Open Time Machine.",
      "content": "Open Time Machine. Time Machine is the app that has a green icon that resembles a clock."
    },
    {
      "title": "Check the checkbox for \"Back Up Automatically\".",
      "content": "Check the checkbox for \"Back Up Automatically\". Click the checkbox next to \"Back Up Automatically\". This will ensure that your computer is backed up automatically so that you don't forget to backup your system."
    },
    {
      "title": "Click Select Backup Disk.",
      "content": "Click Select Backup Disk . You will see a popup menu with all the Time Capsules connected to your network."
    },
    {
      "title": "Select the Time Capsule.",
      "content": "Select the Time Capsule. This will select the Time Capsule as your backup disk, and allow access the data portion of your Time Capsule."
    }
  ]
}