{
  "url": "https://www.wikihow.com/Clean-Felt",
  "title": "How to Clean Felt",
  "steps": [
    {
      "title": "Allow spillage to dry before cleaning.",
      "content": "Allow spillage to dry before cleaning. Whether the issue is food crumbs, dirt, mud or any other non-staining spillage, it must be allowed to dry before proceeding. [1] X Research source If you attempt to clean the item before the spillage has dried, the substance will likely get ground into the fibers of the felt, making clean up far more difficult. Doing this could also result in ruining your felt item completely. If you suspect that the spillage will cause a stain, immediately skip to the spot cleaning and hand washing methods. Stains must be addressed promptly for successful removal from felt."
    },
    {
      "title": "Remove loose debris.",
      "content": "Remove loose debris. Once the spillage is dry, shake off or brush away all loose debris from your felt item. [2] X Research source Take care not to accidentally mash any debris into the fiber of the felt. You can simply use your hand to brush debris away, especially if the issue is very minor. Use a soft bristled brush to gently brush away any stubborn debris. Also try flicking the felt item from the back (if possible) to get off stubborn debris."
    },
    {
      "title": "Inspect the item closely.",
      "content": "Inspect the item closely. Everything, especially food particles, needs to be removed from the item. Allowing food particles to remain in the fibers of felt can lead to deep set staining, as well as pest or sanitation issues. If additional debris is found upon closer examination, gently use the soft bristled brush again."
    },
    {
      "title": "Wipe the surface gently with a baby wipe.",
      "content": "Wipe the surface gently with a baby wipe. This will clean any remaining debris from your item. Be very careful when wiping and avoid any aggressive scrubbing, since this can damage the surface of your felt. The wipe won’t cause a lot of wetness to begin with, but still allow the moisture to air-dry before using or wearing your felt item. [3] X Research source Do not air-dry in direct sunlight because this can damage the fabric."
    },
    {
      "title": "Use masking tape to remove any stubborn lint or hair.",
      "content": "Use masking tape to remove any stubborn lint or hair. Persistent lint and hair can be eliminated by patting the sticky side of masking tape over the surface of the felt, then quickly pulling it off. You will see the lint and hair transferred from the felt onto the tape. [4] X Research source Repeat if necessary."
    },
    {
      "title": "Dab a tiny amount of very gentle soap (Ivory, Dawn) directly on the stain.",
      "content": "Dab a tiny amount of very gentle soap (Ivory, Dawn) directly on the stain. Be sure you dab the soap on without rubbing at the fabric. Spot cleaning small and relatively minor stains this way is preferable to immersing your felt item in water, since the dyed color in felt can run easily. [5] X Research source Try to get started with the spot cleaning process as soon as possible after the stain occurs."
    },
    {
      "title": "Dampen a soft, clean cloth with cool water and dab at the stain until clean.",
      "content": "Dampen a soft, clean cloth with cool water and dab at the stain until clean. [6] X Research source Take care not to rub the fabric or agitate it in any way. If the stain is being stubborn, add another dab of soap on the remaining stain and dab again until it’s gone. For extra stubborn stains, you can use diluted white vinegar to clean the felt. Use one part vinegar and two parts water to get the proper dilution for this. Concentrated vinegar can bleach the colors out of your felt. Repeat the same process of dabbing at the stain with your vinegar/water solution. The vinegar not only removes stains but can also destroy any bad odors."
    },
    {
      "title": "Rinse the rag with cool water to remove all of the soap.",
      "content": "Rinse the rag with cool water to remove all of the soap. Once free of soap, re-soak it with cool water. Try to use approximately the same water temperature throughout the entire process."
    },
    {
      "title": "Dab at the spot again using the wet rag.",
      "content": "Dab at the spot again using the wet rag. This will force clean water through the stained area, rinsing any remaining soap from the felt. You may find it easier to use two wet rags to rinse the soap from the felt. Using a flat surface, put one rag on each side of the felt and press down over the cleaned area, forcing clean water through. Rinse out the rag and repeat the process, if necessary."
    },
    {
      "title": "Use a clean, dry towel to soak up any excess moisture.",
      "content": "Use a clean, dry towel to soak up any excess moisture. Simply press down on the spot a few times until the towel has soaked up the excess water. Allow the item to air-dry in a cool place. [7] X Research source Do not air-dry felt in direct sunlight, because this is damaging to the fabric."
    },
    {
      "title": "Brush away any loose debris while the felt is still dry.",
      "content": "Brush away any loose debris while the felt is still dry. [8] X Research source If the spillage isn’t completely liquid, brush away what you can of any loose debris with a soft bristled brush before moving on. Take care not to brush with too much pressure, or the debris will get embedded in the fiber of the felt."
    },
    {
      "title": "Use a clean towel to blot up any liquid spillage.",
      "content": "Use a clean towel to blot up any liquid spillage. Gently dab at the stain, taking care not to rub any of the liquid around or into the surface of the felt. Blot until there is no visible liquid left, just the stain."
    },
    {
      "title": "Fill your sink or a bucket with cold or cool water.",
      "content": "Fill your sink or a bucket with cold or cool water. Do not use warm or hot water because this will cause dyed color to run and bleed. Make sure there is enough water in the basin to submerge your item."
    },
    {
      "title": "Add a small amount of gentle soap to the water.",
      "content": "Add a small amount of gentle soap to the water. Use as little soap as possible and make sure you are using something very gentle, such as Ivory or Dawn. Baby shampoo or wool wash (soap created specifically to clean wool felt) will also work well. If you are working with a dirty piece of felt that has a bad odor, cut up a couple of lemons and squeeze their juice into the water. Lemon will help to disinfect and remove odors from the fabric. [9] X Research source"
    },
    {
      "title": "Submerge the felt and gently wash the stained area.",
      "content": "Submerge the felt and gently wash the stained area. Do not use aggressive scrubbing motions, since these will damage your felt. Repeatedly squeezing and pushing on the felt under the soapy water will wash the stain away. [10] X Research source Once clean, drain the soapy water from the sink."
    },
    {
      "title": "Rinse the soap from the felt using cool water from the tap.",
      "content": "Rinse the soap from the felt using cool water from the tap. Make sure to rinse it carefully until all of the soap is completely removed from the felt. Try to do the rinsing as quickly as possible. The less time you have to submit your felt to water, the better. Once rinsed, shut off the tap and gently squeeze the item one time to remove excess water."
    },
    {
      "title": "Place the wet felt on a clean, dry towel.",
      "content": "Place the wet felt on a clean, dry towel. Use another dry towel to press down on the felt, so that both towels are soaking up moisture from the item. Repeat until the felt is damp rather than wet. Do not rub the felt. At this stage it is particularly vulnerable, and rubbing it can damage the fabric and cause it to pill. You made need to use additional dry towels to get the job done, depending on how large the felt item is."
    },
    {
      "title": "Lay the felt out flat and allow to air-dry in a cool place.",
      "content": "Lay the felt out flat and allow to air-dry in a cool place. [11] X Research source Hanging the item from a drying rack is also acceptable. Make sure the fabric is completely dry before using or wearing your felt item. Do not let the felt air-dry in direct sunlight, as this can be damaging to the fabric. If all else fails, take your fabric to a dry cleaner to be cleaned by a professional."
    }
  ]
}