{
  "url": "https://www.wikihow.com/Change-Circular-Saw-Blade",
  "title": "How to Change a Circular Saw Blade",
  "steps": [
    {
      "title": "Unplug the saw’s cord or battery.",
      "content": "Unplug the saw’s cord or battery. Always disconnect your saw from power before you replace the blade. That way, there isn’t a risk of the saw accidentally turning on while you’re changing the blade. [1] X Research source"
    },
    {
      "title": "Set the blade to the highest position.",
      "content": "Set the blade to the highest position. Set your saw horizontal on the table so the blade faces up. Unlock the lever on the back of the shoe, which is the flat horizontal guard near the bottom of the saw blade. Push the shoe down as far as it can go so the saw is above it. Lock the shoe back into place with the lever. [2] X Research source Putting the blade in the highest position gives you better access to the blade onto the saw. Otherwise, the shoe could have blocked you from unscrewing it."
    },
    {
      "title": "Press and hold down on the saw’s spindle-lock button.",
      "content": "Press and hold down on the saw’s spindle-lock button. The spindle-lock button is a lever behind the top guard covering the saw blade. Keep the spindle-lock button held down the entire time you’re changing the saw blade, or else it will rotate without loosening. [3] X Research source Check the circular saw’s manual if you have a hard time finding the spindle-lock button."
    },
    {
      "title": "Unscrew the spindle nut and washer with a wrench.",
      "content": "Unscrew the spindle nut and washer with a wrench. Circular saws usually come with a blade wrench slotted into the shoe or tucked into the main body. Fit the wrench around the nut on the spindle, which is the center bolt in the middle of the blade, and turn it in the same direction that the printed arrow on the blade is pointing. Pull the nut and washer underneath it off of the blade and set them aside. [4] X Research source If your circular saw doesn’t have a blade wrench, unscrew a six-sided nut with a standard wrench and a nut with a hexagonal hole with an allen wrench."
    },
    {
      "title": "Push the blade guard up to remove the old blade.",
      "content": "Push the blade guard up to remove the old blade. The blade guard is the cover that slides over the bottom of the blade when you’re not using it. Pull the lever up on the end of the blade guard to move it up. Then, carefully lift the bottom of the blade and slide it out from the saw to remove it. [5] X Research source You’ll easily be able to grab the bottom of the blade without touching any of the sharp edges. If you want additional protection, put on a pair of leather work gloves ."
    },
    {
      "title": "Clean the inside of the saw’s blade guard.",
      "content": "Clean the inside of the saw’s blade guard. Use a clean cloth to wipe out any sawdust that’s stuck inside the guard or around the spindle. Try to remove as much as possible so it doesn’t build up and affect your saw’s performance."
    },
    {
      "title": "Remove the knockout from the blade if the saw spindle is diamond-shaped.",
      "content": "Remove the knockout from the blade if the saw spindle is diamond-shaped. The knockout is the diamond-shaped section of metal in the middle of your saw blade. Get a new saw blade that’s the same size as the old blade. Grip the blade with a pair of needlenose pliers through the hole in the middle. Gently pry the diamond knockout from the middle of the blade and throw it away. [6] X Research source You can also try tapping the knockout with a hammer to help loosen it. If you don’t know the right size for the saw blade, check the user manual or bring the old blade with you to the store when you buy a new one."
    },
    {
      "title": "Set the new blade onto the saw’s spindle.",
      "content": "Set the new blade onto the saw’s spindle. Pull the lower blade guard up so you can install the new blade. Slide the blade through the shoe and place it on the spindle. Make sure the arrow printed on the blade points in the same direction as the arrow on the saw’s guard. You may need to flip your saw blade over so the printed side faces the inside of the machine to make the arrows point in the same direction."
    },
    {
      "title": "Hold down the spindle-lock button.",
      "content": "Hold down the spindle-lock button. Find the spindle-lock button again and hold it down for the entire time you’re installing the blade. Otherwise, you won’t be able to tighten the nut back onto the spindle. [7] X Research source"
    },
    {
      "title": "Tighten the washer and nut onto the spindle until they feel snug.",
      "content": "Tighten the washer and nut onto the spindle until they feel snug. Slide the washer back onto the blade before you put the nut on. Turn the wrench in the opposite direction of the arrows to secure the blade to the saw. Rotate the screw until it feels snug without forcing it any tighter so it’s easier to remove next time you replace the blade. [8] X Research source You can use a circular saw when installing custom shelves that are not the right size. [9] X Research source Measure the area you need to cut. Wear goggles before using the circular saw. [10] X Research source"
    }
  ]
}