{
  "url": "https://www.wikihow.com/Buy-Kindle-Books-on-the-iPad",
  "title": "How to Buy Kindle Books on the iPad",
  "steps": [
    {
      "title": "Launch the App Store icon on your Apple iPad.",
      "content": "Launch the App Store icon on your Apple iPad."
    },
    {
      "title": "Type “Kindle” into the search box of App Store.",
      "content": "Type “Kindle” into the search box of App Store."
    },
    {
      "title": "Tap on the Kindle icon displayed in search results.",
      "content": "Tap on the Kindle icon displayed in search results. The Kindle icon features a person reading a book and the word “Kindle” in yellow against a blue background."
    },
    {
      "title": "Tap on “Install.",
      "content": "Tap on “Install. ” The Kindle app is free, and will install itself to your iPad within a few minutes. [1] X Research source"
    },
    {
      "title": "Launch the Kindle app on your iPad when installation is complete.",
      "content": "Launch the Kindle app on your iPad when installation is complete."
    },
    {
      "title": "Enter your Amazon login credentials, then tap “Sign In.",
      "content": "Enter your Amazon login credentials, then tap “Sign In. ” Any Kindle books you purchase will be available under the “Cloud” tab. [2] X Research source Select the option to register or sign up for Amazon if you don’t already have an account. You must have an Amazon account to purchase Kindle Books for your iPad."
    },
    {
      "title": "Launch the Internet browser on your iPad or computer.",
      "content": "Launch the Internet browser on your iPad or computer."
    },
    {
      "title": "Navigate to the Kindle Store for the iPad.",
      "content": "Navigate to the Kindle Store for the iPad."
    },
    {
      "title": "Sign in to the Kindle Store using your Amazon login credentials.",
      "content": "Sign in to the Kindle Store using your Amazon login credentials. You must enter the same Amazon credentials you used when installing the Kindle app on your iPad."
    },
    {
      "title": "Browse for Kindle books you want to read on your iPad.",
      "content": "Browse for Kindle books you want to read on your iPad. Enter search criteria for specific book titles, or browse books by genre and release date."
    },
    {
      "title": "Tap on “Buy Now” next to the book title you wish to purchase.",
      "content": "Tap on “Buy Now” next to the book title you wish to purchase."
    },
    {
      "title": "Follow the on-screen instructions to enter your payment details.",
      "content": "Follow the on-screen instructions to enter your payment details. Kindle books are purchased using Amazon’s 1-Click Payment Method, which is part of your Amazon account. After your purchase is complete, the book will be available under the “Cloud” tab in the Kindle app on your iPad."
    },
    {
      "title": "Launch the Kindle app on your iPad, then tap the “Cloud” tab.",
      "content": "Launch the Kindle app on your iPad, then tap the “Cloud” tab."
    },
    {
      "title": "Tap on the book title you purchased.",
      "content": "Tap on the book title you purchased. The book will now open in your Kindle app. [3] X Research source"
    },
    {
      "title": "Update the iOS software on your iPad",
      "content": "Update the iOS software on your iPad if you experience problems downloading the Kindle app. This ensures your iPad is up to date and compatible with the latest version of Amazon’s Kindle app."
    },
    {
      "title": "Confirm your iPad is connected to the Internet if a book you purchase isn’t delivered to the Kindle app.",
      "content": "Confirm your iPad is connected to the Internet if a book you purchase isn’t delivered to the Kindle app. The iPad will only sync with Amazon if the device is connected to a wireless or data network."
    },
    {
      "title": "Tap on “Sync” from the Home screen of the Kindle app if your book is not available under the “Cloud” tab.",
      "content": "Tap on “Sync” from the Home screen of the Kindle app if your book is not available under the “Cloud” tab. This syncs your iPad with Amazon’s servers manually if for some reason the service fails to sync automatically. [4] X Research source"
    }
  ]
}