{
  "url": "https://www.wikihow.com/Become-a-Politician",
  "title": "How to Become a Politician: Process, Qualifications & More",
  "steps": [
    {
      "title": "Go to college.",
      "content": "Go to college. While really anyone can be a politician (depending on your definition of politician, of course), the ones that make a true dent in society and can call it a career have been to college. They likely studied economics, business, political science, or international relations. Though any degree is better than none! Many go on to law or business school. This isn't a hard-and-fast requirement, but it's definitely not a bad idea. If you want to be a big dog, it's wise, that's for certain. In the US Congress, 68 are currently either lawyers or businessmen. [1] X Research source Just for the record. Back in the day, military experience was pretty common. It's definitely not a bad idea -- we're all pro people who support their country. But it is becoming less common and if you don't feel the pressure to fit the presidential mold, there's no shame in keeping your office job."
    },
    {
      "title": "Volunteer.",
      "content": "Volunteer. With volunteer experience on your resume, it's hard for someone to look at you and say, \"That's not a trustworthy, good person.\" That would require a person who doesn't like puppies. To get votes, you need to show that you support good causes, you've put in the time, and you care about your community. The easiest way to do that? Volunteering. You could start by volunteering for a local campaign, but it's also a good idea to foster your interests outside the political arena, too. Join a non-profit, help the homeless, get involved with an organization you would support if you were in a position of power. Show the world just how well-rounded (and moral) you are."
    },
    {
      "title": "Affiliate yourself with a political party.",
      "content": "Affiliate yourself with a political party. Running on the Jane/John party won't get you much attention (well, good attention at least). If you're serious about this politics thing, you need to affiliate yourself with a well-established political party. That way you'll get backing, you'll meet like-minded friends and cohorts, and in some cases, people will look at your label and assume you're good to go. Or don't. Whichever. That's what the Independent party is for. However, do note that running with this party and getting elected to office is like running up a hill blind with a Skip-Bo on your ankle, carrying a screaming monkey on your back. People like labels and they really like labels they think they understand. \"Independent\" isn't one of them, sadly."
    },
    {
      "title": "Pay your dues on someone else's campaign.",
      "content": "Pay your dues on someone else's campaign. If you're blessed enough to know what you want to do at a young age, then a good way to make headway into this field is to work on someone else's campaign. It may be grunt work, but you'll get a sneak peek into what it's like and get a leg up on the whole networking thing. Which is super important, by the way. You may be knocking on doors, you may be stuffing pamphlets into boxes or putting stamps on envelopes, but you'll be doing something. It will give you an appreciation for these roles when you're at the top -- and a relatability people will admire, too."
    },
    {
      "title": "Get active in your community.",
      "content": "Get active in your community. If no one knows you from Joe, it'll be hard for people to trust you with, well, anything. So get active locally! Be that one that everyone knows. The one that's involved in everything. You have a reputation to develop! A good place to start? Community meetings. Get on local school boards, city assemblies, and the like and make some noise . Be active. Starting at the bottom is the only way you'll work your way up. So go to your area's party headquarters, ask some questions, and grab a seat."
    },
    {
      "title": "Have a flexible career.",
      "content": "Have a flexible career. So while most big cheese politicians are businessmen or lawyers, the local and state ones are a different story. Your city's representatives could be grocery store owners, teachers, factory supervisors, anything. Since politics won't start paying you for probably another decade or two, get a career and get a flexible one -- unless you have ten years of money lying around. The flexible part here is important because there will be times when politics takes over. You have to take an afternoon off for a meeting, you have to take a week off for a convention, or you have to take six months off for your campaign. The more flexibility you have, the less you'll be sweating your finances in the long run."
    },
    {
      "title": "Get passionate about something.",
      "content": "Get passionate about something. Very few people become a politician simply on the idea that it looks like fun. While they may want to \"change the world,\" they have a general idea of what needs changed. So before you throw your name in the ring, find something you want to get behind. Find something to motivate you. Get passionate. Do the conditions of your city's road irritate you to no end? Do you want to save the local hospital from being moved to a different area? Do you wish there were more allocated green space in your neighborhood? Great! You don't have to have the next best thing since the two-party system. All you need is a driving force for your platform and your reason to campaign."
    },
    {
      "title": "Start local.",
      "content": "Start local. While you could go from student body president to running for the President of the United States...you'd really just be asking for a hard time. If you want to go about it and be successful, you'll start small. In the US, you have a few options: School board City Council City mayor County supervisor"
    },
    {
      "title": "Check your bank balance.",
      "content": "Check your bank balance. Okay, you've decided you want to run for office. Maybe it's mayor, maybe it's county supervisor, heck, maybe it's even state legislator. The bigger it is, the more money you're gonna need. Do you have some padding in there in case things go awry? What if your campaign comes up short and you have to foot some of the bill? What if you lose the election and your job isn't there when you get back? Will there be food on the table? Campaigns are expensive. Way more expensive than you realize before going into your first one. There's travel expenses, paying your team, marketing expenses, and schmoozing expenses, just to get the list started. Ideally these won't come from your pocket. Ideally."
    },
    {
      "title": "Develop your campaign.",
      "content": "Develop your campaign. Now for the fun stuff! You know, sort of. At least the adrenaline-packed stuff. You'll need to assemble a team of people you trust to run it for you, but you need to develop it. How do you want to go about getting the word out there? How big should your team even be? What issues will you be pushing? How will you handle your opponents? Three words: Start. Raising. Funds. Start raising funds now . Hit up everyone you know for donations (you've been nice to them because you knew this was coming, right?). Even if you met them once and they're not even your Facebook friend, hit 'em up. No shame!"
    },
    {
      "title": "Lean on your (rich) friends.",
      "content": "Lean on your (rich) friends. This is one of those times when belonging to one of those posh country clubs will really come in handy. You'll need the cash flow to keep on flowing and those $10 semi-annual donations from Aunt Marge aren't cutting it. You'd need thousands of those. So whether you were sipping on Pinot Grigio with the Gateses or serving it, know where your bread is buttered. The unfortunate truth, really. This is why having been a name for a while is especially helpful. The right people might notice you and have decided that you show political promise. That's why it's a good idea to get involved with one of the major parties -- it's a solid platform for grabbing attention."
    },
    {
      "title": "Get state-wide.",
      "content": "Get state-wide. Once you've dominated your local pond, you'll probably look for some bigger fish to fry. So go state-wide! Be a legislator -- get involved in the Congress or the Senate. You've proven you have the chops, so might as well make some money with it! This is a lot of the same, just on a bigger level. And with a bigger level comes more scrutiny. And more money. Generally, more of everything. Definitely more time. And because of the \"more time\" thing, make sure you talk this over with your family and those who you're close with. Your life will not be the same and you will not be as accessible. You may be on the road quite a bit and you may be very stressed because of it. But hopefully it'll be worth it!"
    },
    {
      "title": "Soldier on.",
      "content": "Soldier on. If you are successful, and if you do end up getting elected, for starters, congratulations! It's gonna be stressful and it's gonna make your hair turn gray prematurely, but you'll be making a difference! And if you're not successful, don't be dissuaded. If this is something you're truly passionate about, your time will come.You gotta keep your head up and not take this personally. It's a fierce world out there and you wouldn't have it any other way. If it were easy, it wouldn't mean as much. So keep calm and carry on. There's always next cycle!"
    },
    {
      "title": "Be a fantastic public speaker",
      "content": "Be a fantastic public speaker . If there's just one skill you have, it should be public speaking. Your face, your voice, you is gonna be in the limelight at least until the election is over. People are going to be watching you and analyzing your every move. If you can convince them with your winning smile, calm demeanor, and persuasiveness that you're qualified for the job, it'll be smooth sailing. The most obvious examples are Barack Obama and JFK. When Barack steps up to the podium, his charisma just oozes out of him. His public speaking skills got him to where he is today. And then there's the famous JFK/Nixon debate, where JFK was so calm, cool, and collected that he made the nervous, twitchy Nixon look like a joke. So brush up!"
    },
    {
      "title": "Have the wardrobe.",
      "content": "Have the wardrobe. So while JFK schooled Nixon because of his charisma, it didn't hurt that he was 100x better looking and more put together. If you're gonna be in the public eye, you gotta look the part. That means ties, suits, and that wonderful pair of I'm-just-like-you khakis. And the shoes! Don't forget the shoes. You'll generally need two looks: the nice, fancy suit for your more formal functions and then the rolled-up Oxford and khakis when you're talking in the town hall. This goes for men and women, though a women's suit could either be a skirt or pants."
    },
    {
      "title": "Solidify your views.",
      "content": "Solidify your views. If you expect people to vote for you, you gotta have your views and your views down pat. None of this wishy-washy flip-flopping -- or you'll be called on it faster than you can say \"John Edwards.\" Hopefully you figured these out pre-campaign (though in the realm of politics, changes of heart aren't exactly uncommon). You'll probably be encouraged to align your views with the majority. There is no book that says you have to do this. Your team may want you to, but you don't have to do a damn thing. It can get you votes, but what's gonna happen when bill-passing time rolls around? Hope the Catholic guilt doesn't get to you?"
    },
    {
      "title": "Be comfortable with the media and their antics.",
      "content": "Be comfortable with the media and their antics. Once you're a politician, you're basically signing off on your privacy. You're the closest thing to a movie star there is. Your image will be plastered everywhere from buses to the Daily Show. And it won't always be nice. So while it's gonna be hard handling the constant photo ops and always faking a smile, it's gonna be harder handling the criticism. Can you take it? The association between politicians and scandals is so ridiculous it's almost funny. If you're running for office, expect to have to face that everything from your dishonorable discharge in the military to that appealed DUI charge to a speeding ticket from 27 years ago. If it's the slightest bit juicy, it could come back to haunt you."
    },
    {
      "title": "Get tough.",
      "content": "Get tough. This is not a career for the faint of heart. It's gonna involve late nights, name calling, begging, brown-nosing, and lots and lots of putting up with the trivial. There will be times when you'll feel on top of the world and there will be times when you'll feel like it's on top of you. You gotta have a thick skin and an impermeable sense of confidence . You ready? This could be tough on your loved ones, too. Bristol Palin, anyone? So while this may be your dream, make sure you're looking out for them, too. You'll need them when it feels like the weight of the world is on your shoulders."
    }
  ]
}