{
  "url": "https://www.wikihow.com/Arc-Weld",
  "title": "How to Arc Weld",
  "steps": [
    {
      "title": "Understand the process of shielded metal arc welding.",
      "content": "Understand the process of shielded metal arc welding. An electric arc is formed at the tip of the welding rod when a current passes across an air gap and continues through the grounded metal which is being welded. Here are some of the terms and their descriptions used in this article: [1] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Welding machine. This is the term used to describe the machine which converts 120-240 volt AC electricity to welding voltage, typically 40-70 volts AC, but also a range of DC voltages. It generally consists of a large, heavy transformer, a voltage regulator circuit, an internal cooling fan, and an amperage range selector.The term welder applies to the person doing the welding. A welding machine requires a welder to operate it. Leads, or welding leads. These are the insulated copper conductors which carry the high amperage, low voltage electricity to the workpiece that is being welded. Rod holder , or stinger is the device on the end of the lead that holds the electrode, which the person welding uses to accomplish the welding task. Ground and ground clamp. This is the lead that grounds, or completes the electrical circuit, and specifically, the clamp that is attached to the work to allow the electricity to pass through the metal being welded. Amperage, or amps . This is an electrical term, used to describe the electrical current supplied to the electrode. DC and reverse polarity. This is a different configuration used in welding with an arc/electrode system, which offers more versatility, especially in overhead welding applications and for use welding certain alloys that do not weld easily with AC voltages. The welding machine that produces this current has a rectifier circuit or has the current supplied by a generator, and is much more expensive than a typical AC welder. Electrodes. There are many specialized welding electrodes, used for specific alloys and types of metals, such as cast or malleable iron, stainless or chromoly steel, aluminum, and tempered or high carbon steels. A typical electrode consists of the wire rod in the center covered with a special coating (flux) which burns as the arc is maintained, consuming oxygen and producing carbon dioxide in the weld area to prevent the base metal from oxidizing or burning away in the arc flame during the welding process. Here are some common electrodes and their uses: E6011 electrodes are a mild steel electrode with a cellulose fiber coating. The first two numbers in the electrode identification is the tensile strength, measured in pounds per square inch times 1,000. Here, the yield of the electrode would be 60,000 PSI. E6010 electrodes are a reverse polarity electrode, commonly used for welding steam and water pipes, and are particularly useful for overhead welding, since the metal holds its position while in a liquid state, being drawn into the molten weld pool by the flow of the direct current from the electrode to the workpiece . Other specific purpose E60XX electrodes are available, but since E6011s are considered a standard, general purpose rod, and E6010s are considered the standard for reverse polarity DC welding, they will not be covered in detail in this article. E7018 electrodes are low hydrogen, flux-coated steel rods, with a high yield tensile strength of 70,000 PSI. These are often used in assembling structural steel used in the construction industry, and in other applications where a strong filler material and higher strength weld is required. Note that, although these rods provide greater strength, they are less forgiving in respect to achieving a clean, high-grade weld at incorrect amperages and with dirty (rusted, painted, or galvanized) steels. These electrodes are called low hydrogen due to every attempt to lower the hydrogen content. These electrodes must be stored in an oven with a temperature between 250ºF and 300ºF. This temperature is above the water boiling point of 212ºF at sea level. This temperature keeps the moisture (dew)(H2O) in the air from collecting in the flux. Nickel, Castalloy, Ni-Rod electrodes. These are special rods made for welding cast, ductile, or malleable iron, and have more yield, to allow for the expansion and contraction of the iron material being welded. Dissimilar metals rods. These rods are made from a special alloy and give better results when welding tempered, hardened or alloyed steels. Aluminum rods. These are a more recent technology and allow arc welding aluminum with a conventional welder, rather than using a special gas-shielded wire feed welder like a MIG (metal, inert gas) or TIG (tungsten, inert gas) welding machine, often referred to as heliarc welding, since helium was the gas used to shield the arc flame while welding. The official names created by the American Welding Society (AWS)for this arc type welding are Shielded Metal Arc Welding (stick), Gas Tungsten Arc Welding (tig)and Gas Metal Arc Welding (mig). Electrode sizes. Electrodes come in a variety of sizes, measured by the diameter of the metal center of each rod. For mild steel rods, a diameter range of 1 ⁄ 16 inch (0.2 cm) to 3 ⁄ 8 inch (1.0 cm) is available, and the size used is determined by the amperage of the welder, and the thickness of the material being welded. Each rod performs best at a given amperage range. Selecting the correct amperage range for a given size rod will depend on the base material and the desired penetration, so specific amperages will only be covered for the welding described further in this article. Safety equipment. A critical part of welding safely is having, and knowing how to use, the correct safety equipment for the job. Here are some typical items that are required for welding safely. [2] X Research source Welding shield (hood). This is the mask which is worn to protect the person welding from the bright flash of the arc, and from sparks being thrown during welding. Standard arc welding lenses are tinted very darkly, since exposure to the arc flash can cause flash burns to the retina of the eye. A level 10 darkness is the minimum for arc welding. Welding hoods with a flip up lens was once preferred, as the dark lens can be lifted up, and a separate clear glass lens will protect the welder from bits of slag while the weld is chipped . The newer self darkening welding shields are the most desirable welding shield now sold. These welding shield lens are very light-colored for grinding and torch cutting. When an arc is struck the automatic self darkening lens will change to a preset #10 shade. Even newer on the market are the variable shade automatic self darkening lens. Welding gloves. These are special, insulated leather gloves that reach about 6 inches (15.2 cm) above the wrists, and protect the hands and lower arms of the welder (the person welding). They also provide limited protection from accidental shock if the person welding comes into contact with the electrode accidentally. Welding leathers. This is an apron like leather jacket that covers the shoulders and chest of the welder, used for overhead work where sparks might ignite the welder's clothing, or cause burns. Work boots. The person welding should wear at least a 6 inch (15.2 cm) lace-up type boot to prevent sparks and hot slag from burning his feet. These boots should have insulating soles made from a material which does not melt or burn easily."
    },
    {
      "title": "Learn the steps for creating a successful weld.",
      "content": "Learn the steps for creating a successful weld. Welding is more than dragging a welding rod across a piece of steel and gluing it to another one. The process begins with properly fitting and securing the workpieces , or metal to be welded, together. For thicker pieces, you may want to grind a bevel so subsequent beads can be placed in the groove to fill it completely with a solid weld. Here are the basic steps for completing a simple weld. [3] X Research source Strike the arc. This is the process of creating an electric arc between the electrode and the workpiece. If the electrode simply allows the current to pass directly into the grounded workpiece, there will not be enough heat produced to melt and fuse metal together. Move the arc to create a bead . The bead is the metal from the melting electrode flowing together with molten metal from the base metal to fill the space between the pieces being joined by welding. Shape the weld bead. This is done by weaving the arc back and forth across the weld path either in a zig zag or figure 8 motion so the metal spreads to the width that you want your finished weld bead to be. Chip and brush the weld between passes. Each time you complete a pass , or trip from one end to the other of your weld, you need to remove the slag , or the melted electrode flux material, from the surface of the weld bead so only clean molten metal will be filling the weld on the subsequent pass."
    },
    {
      "title": "Gather the tools and materials you will need to begin welding.",
      "content": "Gather the tools and materials you will need to begin welding. This means the welding machine, electrodes, cables and clamps, and the metal to be welded. [4] X Research source"
    },
    {
      "title": "Set up a safe work area, preferably with a table constructed of steel or other non-flammable material.",
      "content": "Set up a safe work area, preferably with a table constructed of steel or other non-flammable material. For practice, a few pieces of mild steel, at least 3 ⁄ 16 inch (0.5 cm) thick will work. [5] X Research source"
    },
    {
      "title": "Prepare the metal to be welded.",
      "content": "Prepare the metal to be welded. If the metal consists of two pieces that are to be joined in the welding process, you may need to prep , or weld prep them, by grinding a beveled edge on the sides that are to be joined. This allows for sufficient penetration of the weld arc to melt both sides to a molten state so the filler metal bonds through the sectional thickness of the metal. At the least, you should remove any paint, grease, rust, or other contaminants so you are working with a clean pool of molten metal as you weld."
    },
    {
      "title": "Attach clamps to hold your metal pieces together, if needed.",
      "content": "Attach clamps to hold your metal pieces together, if needed. Locking type pliers, \"C\" clamps, a vice, or spring loader clamps will usually work. For special projects, you may find you will have to adapt different techniques to secure the workpieces until they are joined."
    },
    {
      "title": "Attach the ground clamp to the larger piece of stock that is being welded.",
      "content": "Attach the ground clamp to the larger piece of stock that is being welded. Make sure there is a clean location so that the electrical circuit can be completed with minimal resistance at the ground location. Again, rust or paint will interfere with the grounding of your workpiece, making it difficult to create an arc when you begin welding. [6] X Research source"
    },
    {
      "title": "Select the correct rod and amperage range for the work you are attempting.",
      "content": "Select the correct rod and amperage range for the work you are attempting. As an example, 1 ⁄ 4 inch (0.6 cm) plate steel can be welded effectively using an E6011, 1 ⁄ 8 inch (0.3 cm) electrode, at between 80-100 amps. Place the electrode in the electrode holder (henceforth referred to as the stinger ) making sure the conductive material of the stinger clamp is on the clean metal at the end of the electrode. [7] X Research source"
    },
    {
      "title": "Turn on your welding machine.",
      "content": "Turn on your welding machine. You should hear a humming sound from the transformer. The sound of the cooling fan running may or may not be heard. Some welding machine fans only operate when the machine requires cooling. If you do not, you may need to check the circuit that is supplying your power, and the breakers in the panel box. Welding machines require a considerable amount of power to operate, often a special circuit rated at 60 amps or more at 240 volts. [8] X Research source"
    },
    {
      "title": "Hold the stinger in your dominant hand by the insulated handle, with the rod in a position so that striking the tip of it against the plate you are welding will be as natural a movement as possible.",
      "content": "Hold the stinger in your dominant hand by the insulated handle, with the rod in a position so that striking the tip of it against the plate you are welding will be as natural a movement as possible. Hold your welding shield up just high enough so you can see to move the electrode to within a few inches of the workpiece, ready to flip in down to protect your eyes. You may want to practice tapping the electrode against the weld metal to get the feel of it before turning the power on, but never strike an electric arc without protecting your eyes . [9] X Research source"
    },
    {
      "title": "Select the point where you wish to begin your weld.",
      "content": "Select the point where you wish to begin your weld. Position the tip of the rod close to it, then drop the welding hood into place. You want to tap the tip of the electrode against the metal to complete the electrical circuit, then instantaneously pull it back a little bit, to create an electric arc between the electrode tip and the metal being welded. Another way to strike an arc is like striking a match. This arc gap, or airspace, creates a great deal of resistance in the electrical circuit, which is what produces the arc flame or plasma and heat needed to liquefy the electrode and the metal adjacent to the weld area. [10] X Research source"
    },
    {
      "title": "Strike the electrode against the surface of the metal, pulling it back slightly when you see an electric arc occur.",
      "content": "Strike the electrode against the surface of the metal, pulling it back slightly when you see an electric arc occur. This takes a great deal of practice, since different electrode diameters and welding amperages require a different gap between the tip of the electrode and the workpiece, but if you can hold the gap steady, a continuous electric arc will occur from the electrode to the workpiece. Typically, the arc gap should be no greater than the electrode diameter. Practice steadying the arc by holding the electrode about 1/8 to 3/16 of an inch from the workpiece, then begin moving along the path you want to weld. As you move the electrode, the metal will be melting away, filling the pool of molten metal and building your weld. [11] X Research source"
    },
    {
      "title": "Practice traveling across the path of your weld with the electrode until you can keep a consistent arc, moving at a consistent speed, and in line with the path you want to weld.",
      "content": "Practice traveling across the path of your weld with the electrode until you can keep a consistent arc, moving at a consistent speed, and in line with the path you want to weld. When you have mastered controlling the arc, you will begin to practice laying, or building up the weld bead. This is the deposit of metal that joins the two pieces that you are welding together. The technique you use for laying your bead will depend on the width of the gap (if there is one) you are filling, and the depth you want the weld bead to penetrate. The slower you move the electrode, the deeper the weld will go into the metal workpieces, and for making a wide path, the more you zig zag or weave the electrode's tip, the wider the bead you will lay up. [12] X Research source"
    },
    {
      "title": "Keep the arc established as you move along the weld you are making.",
      "content": "Keep the arc established as you move along the weld you are making. If the electrode grounds to the metal and becomes stuck, jerk the stinger to break the rod free either from the stinger clamp or the weld metal. If the arc is lost because you move the electrode too far from the metal's surface, stop the process and clean the slag from the spot you are welding so when you re-strike the arc to continue, there will be no slag in the weld area to contaminate the new weld you are beginning from the place the arc was lost or broken. Never lay a new bead over existing slag, as this material will melt in the arc plasma and bubble through the new layer of metal you are placing, resulting in a weak and dirty weld. [13] X Research source"
    },
    {
      "title": "Practice moving the electrode in a sweeping motion to create a wider bead.",
      "content": "Practice moving the electrode in a sweeping motion to create a wider bead. This will allow you to fill more of the weld in a single pass, leaving a cleaner and more sound weld. The electrode is moved in a sideways motion as it is drawn along the weld path, either in a zig-zag, curved, or figure eight motion. [14] X Research source"
    },
    {
      "title": "Adjust your welder's output amperage to suit the material you are welding and the desired penetration of the arc.",
      "content": "Adjust your welder's output amperage to suit the material you are welding and the desired penetration of the arc. If you find the finished weld bead is pitted, with deep cratering at the bead's edges, or the adjacent metal is simply melted or burned away, reduce the amperage incrementally until the condition is corrected. If, on the other hand, you have difficulty striking or maintaining an arc, you may need to increase the amperage."
    },
    {
      "title": "Clean your finished weld.",
      "content": "Clean your finished weld. After you have finished welding, you may want to remove the slag and clean up your weld, either to allow paint to bond better, or simply for cosmetic reasons. Chip off the slag and wire brush the weld to remove any foreign material and remaining slag. If the surface needs to be flat to allow fitting the piece you have welded to another piece, use an angle grinder to remove the top, or high portion of the bead. A clean weld, particularly after grinding flat, is easier to examine to see if pitting, puddling, or other defects have occurred while welding."
    },
    {
      "title": "Paint your weld with a suitable rust-preventative primer to protect it from corrosion.",
      "content": "Paint your weld with a suitable rust-preventative primer to protect it from corrosion. Freshly welded metal will corrode rather quickly if exposed to the elements, since the actual base metal is exposed directly to moisture."
    }
  ]
}