{
  "url": "https://www.wikihow.com/Choose-Lottery-Numbers",
  "title": "13 Ways to Pick Winning Numbers in the Lottery",
  "steps": [
    {
      "title": "28, 16, 39, 32, and 15 are the most commonly drawn lottery numbers.",
      "content": "28, 16, 39, 32, and 15 are the most commonly drawn lottery numbers. [1] X Research source You can also use a lotto frequency chart to see which numbers are picked most in your state. Most state lottery programs offer charts showing how often each number has been drawn during a given time frame. [2] X Research source Winning numbers that come up more frequently are likely to remain frequent winners, so choose a few to add to your ticket to tip the odds of winning in your favor. If you can look up the all-time frequencies, that's the best possible data set for you to analyze. It’s more comprehensive, and you should base your numbers on as large a time frame as possible. Make sure you're looking up the right frequency chart for the lottery game you plan to play. For instance, Powerball stats will differ from Mega Millions stats. Keep in mind that other people will be trying this tactic. If you win with frequently picked numbers, you might be at a greater risk of having to share the prize with other winners. On the other hand, some people like to choose numbers that aren't picked very often. It might seem counterintuitive, but consider this: If everyone else is busy picking frequently drawn numbers and you win with your “long-shot” picks, you might not have to share the prize with as many other winners! [3] X Research source 47, 46, 43, 41, and 44 are the least commonly drawn lottery numbers."
    },
    {
      "title": "The system picks numbers using stats about adjoining numbers.",
      "content": "The system picks numbers using stats about adjoining numbers. In other words, the Delta System is based on research, but keep in mind there’s no guarantee you’re going to increase your chances of winning if you choose this way. [4] X Research source To use the Delta System: Choose one very low number between 1–3. Pick two more low numbers between 1–8. Pick a number very close to 8, like 7 or 9. Next, select two more numbers between 8–15. Add up your numbers and make sure the total isn’t greater than the highest pickable number on the ticket. If it is, adjust your picks to lower the total (repetition is OK). Mix up all of your numbers so they’re not in numerical order and write them down. These are your Delta numbers (not your final lotto number). 1st lotto number: Leave your first Delta number unchanged (this is now your first lotto number). 2nd lotto number: Add the 1st lotto number and 2nd Delta number together. The sum becomes your 2nd lotto number. 3rd lotto number: Add your 2nd lotto number and 3rd Delta number. 4th lotto number: Add your 3rd lotto number and 4th Delta number. 5th lotto number: Add your 4th lotto number and 5th Delta number. 6th lotto number: Add your 5th lotto number and 6th Delta number. The resulting 6 numbers become your lottery pick!"
    },
    {
      "title": "Higher numbers are chosen less often since they don’t appear in dates.",
      "content": "Higher numbers are chosen less often since they don’t appear in dates. Since so many people use important dates in their lottery numbers, numbers at or below 31 tend to get filled in more often than higher numbers. This doesn’t mean higher numbers are picked more or less often than lower numbers—it just means you’ll be more likely to share the prize if you win with a lot of numbers under 31. [5] X Research source"
    },
    {
      "title": "Play your sequence of choice over and over and over until you win.",
      "content": "Play your sequence of choice over and over and over until you win. This could be a series of lucky numbers for you (like your favorite lucky number combined with your birthday, or a completely random set you’ve settled on. Play this number every time you play the lottery. Then, you wait for your number to come up a winner. This could be considered making your own luck. [6] X Research source This is a super simple strategy lots of people use because it takes the guesswork and effort out of picking lotto numbers."
    },
    {
      "title": "Use a random number generator to fill out your ticket.",
      "content": "Use a random number generator to fill out your ticket. Sites like Random.org have number generators specifically designed for lottery tickets for different games and from various states. The advantage of using truly random draws is that winning lottery numbers are chosen randomly as well. So, it might be a lucky draw! Check the generator settings to make sure you’re picking the correct number of numbers and for the correct lottery type and state (Mega Millions, Pennsylvania Match 6, etc.). Check that the numbers the generator chooses aren’t too high or too low for what’s available on your ticket. If you want some control over your numbers, you can choose some yourself and then use a generator to pick the remaining numbers. You can also try to choose random numbers yourself, but unconscious biases might make you choose or avoid certain numbers instead of being truly random."
    },
    {
      "title": "Request an auto-generated “quick pick” when you buy a ticket.",
      "content": "Request an auto-generated “quick pick” when you buy a ticket . This is like letting the lottery pick random numbers for you. When the attendant asks you for the numbers, tell them that you want the system to choose the numbers for you. With the click of a few buttons, you’ll have your lottery ticket with pre-selected numbers. If you're buying several tickets at one time, this is probably the way to go. [7] X Research source Some lotto players claim that using the quick pick options “ruins” your chances of winning, but in reality, you have the same chance as you would if you picked numbers yourself (randomly or not)."
    },
    {
      "title": "Make a heart, circle, smiley face, star, or other pattern to choose numbers.",
      "content": "Make a heart, circle, smiley face, star, or other pattern to choose numbers. Why not have a little fun with your ticket? If you’re not sure which numbers to pick, an artistic guess could prove to be a winning strategy. It’s unlikely that someone would draw the exact same image using the exact same numbers as you, so you’re less likely to share the jackpot if you win! Avoid really common patterns, like drawing a line all the way through a row or column of numbers. Lots of people choose this, so your chances of sharing the prize are increased. Also avoid picking entirely consecutive numbers (like 1, 2, 3, 4, 5, 6) since it’s likely others are choosing similar patterns as well. [8] X Research source"
    },
    {
      "title": "Use this trick to make a unique and personal set of numbers.",
      "content": "Use this trick to make a unique and personal set of numbers. There’s no set way to do this—you could assign the numbers 1 through 26 to the letters of the alphabet, or repeatedly cycle from 1 through 9 so that each number has multiple letters associated with it (see example below). Then, take the numbers you get from your name and use them in order, mix them around, and/or add and combine them together to form larger numbers so you’re not only picking lower than 26. Here’s an example numbering system: 1: A, J, S 2: B, K, T 3: C, L, U 4: D, M, V 5: E, N, W 6: F, O, X 7: G, P, Y 8: H, Q, Z 9: I, R Say your name is Ann and you get the numbers 1, 5, and 5. You could use the numbers 1, 5, 15 (1 with 5), 51 (5 with 1), 55 (5 with 5), 10 (5+5), 6 (5+1), etc. on your lottery ticket in any order you choose. Feel free to come up with more creative ways to combine your numbers."
    },
    {
      "title": "Do you have a lucky number you use for everything (or just like a lot)?",
      "content": "Do you have a lucky number you use for everything (or just like a lot)? A lucky number doesn’t have to be connected to a birthday or anything like that—you just have to like it or believe it’s special. If this is the case for you, add your number to your lottery ticket. You might just get lucky! If you're playing a lottery game such as Powerball , consider making your lucky number the Powerball pick. Super common lucky numbers (like 7, 11, or even “unlucky” 13) are popular lotto picks. If you win with these numbers on your ticket, you might end up sharing the prize with a lot of people."
    },
    {
      "title": "Pick a date, phone number, address, or other number you consider special.",
      "content": "Pick a date, phone number, address, or other number you consider special. If you believe in lucky numbers, they're probably digits that center around important dates or events in your life. Brainstorm a few options, then mix the numbers together. For instance, you might use your grandfather’s birthday month and year (10/1929) and your mother’s birth month and day (3/21). Together, you might come up with something like 10-19-3-21-29. Other significant numbers could be: Birthdays: Yours, your children's, your spouse's, and so on. Anniversaries: This could be a wedding anniversary date or the date of another significant event. Ages: Using your age or the ages of your loved ones is also a common practice. Addresses: The address of your childhood or current home is another tactic you can try. Phone numbers: Try breaking down your phone number into a sequence of single- or double-digit lotto numbers."
    },
    {
      "title": "Do you believe in horoscopes, numerology, fortune cookies, or dreams?",
      "content": "Do you believe in horoscopes, numerology, fortune cookies, or dreams? If so, include some lucky numbers from these spiritual sources. Horoscopes and fortune cookies often feature a few lucky or powerful numbers, while numerology claims that recurring numbers you see over and over again are angel numbers (messages from your guardian angels) that hold special significance for your life. Some also say that their lottery numbers came to them in dreams or other visions, so don’t be afraid to consult with the occult if you’re out of ideas!"
    },
    {
      "title": "Do you just have a gut feeling that certain numbers are winners?",
      "content": "Do you just have a gut feeling that certain numbers are winners? If you do, listen to that feeling and pick them. Mathematically, each number is equally likely to be picked, so you can’t guess a “bad” or unlikely number this way. Who knows? Maybe you’ll win big and find your new lucky number!"
    }
  ]
}