{
  "url": "https://www.wikihow.com/Apply-Makeup-as-a-Man",
  "title": "How to Apply Makeup as a Man",
  "steps": [
    {
      "title": "Highlight areas of your face you wish to feature.",
      "content": "Highlight areas of your face you wish to feature. A liquid highlighter will make the important areas of your face look more radiant. Highlight your nose by brushing a thin line down its bridge. Fill in the area between the eyebrows with diagonal strokes. Use gentle strokes as you move and watch as your skin begins to look younger and smoother. [1] X Research source Try highlighting other areas. Color in the space between your lower eyelids and upper cheekbones. Place a little bit around your nostrils and above the arches of your eyebrows. Your highlighter should be two shades lighter than your skin tone. Those with light skin, for instance, wouldn’t want to use brown or orange highlighters."
    },
    {
      "title": "Blend in the highlighter with your fingers.",
      "content": "Blend in the highlighter with your fingers. Tap or massage the highlighter into your skin. You don’t need to use a lot of force. Small areas, such as around your nose, can be handled by patting in the makeup with a single finger. For larger areas, such as the bridge of your nose, rub your finger lightly up and down the highlighted area. When you’re finished, the highlighter won’t leave any obvious lines."
    },
    {
      "title": "Contour your face with foundation.",
      "content": "Contour your face with foundation. Apply foundation over the areas you wish to sculpt. For your nose, brush on a line all the way down both its sides. The darker foundation should be next to the highlight on the bridge of your nose. Later on, your nose will appear thinner and more shapely. [2] X Research source Try contouring other areas. Start at eyebrow level on the side of your head and follow your head’s curve upwards to your hairline. Also, suck in your cheeks and paint from near your lower eyelid, along the hollow of your cheek, and down into your jawline. Your foundation should also complement your skin tone, but be about two shades darker."
    },
    {
      "title": "Blend the foundation with your fingers.",
      "content": "Blend the foundation with your fingers. Gently go over the foundation lines. Pat them down and rub them into your skin. The goal is to soften the lines so the foundation blends in and becomes undetectable."
    },
    {
      "title": "Cover dark areas with light-colored foundation.",
      "content": "Cover dark areas with light-colored foundation. A stippling brush is useful for applying and blending in this second coating of foundation. Dip the brush, a cotton ball, or makeup sponge in the foundation. Tap the brush against the areas you wish to cover. When you get to your nose, work from bottom to top and finish blending it with your fingers. [3] X Research source This lighter foundation should be two shades lighter than your skin tone."
    },
    {
      "title": "Powder over highlighted areas.",
      "content": "Powder over highlighted areas. The powder is used to reduce the unnatural skin glow some makeup, warm temperature, and bright lights can cause. Get a pressed powder a shade lighter than your skin tone. Use a brush to spread a light coating over the areas you highlighted earlier."
    },
    {
      "title": "Color your face with bronzer.",
      "content": "Color your face with bronzer. Bronzer is useful if you think you look a little pale. Get a bronzer two shades darker than your skin tone. With your brush, follow the contour lines you made earlier. Use circular motions to blend the bronzer and highlighter. [4] X Research source After this, you may continue to make adjustments. Try blending in some blush on your cheekbones, nose, eyelids, and chin. You can also use a lip liner to draw on freckles and other beauty spots you covered. This will ensure your skin maintains a natural, no makeup look."
    },
    {
      "title": "Test the concealer on your arm.",
      "content": "Test the concealer on your arm. Find the veins on the underside of your wrist. Rub a little bit of the concealer into your skin. If it matches your skin, it’ll hide the veins. A concealer that matches your skin will look natural when used to hide marks on your face. Men with oily skin should avoid cream and stick concealers. Those with dry skin should avoid liquid concealers. [5] X Research source Colored concealer, used in place of your regular concealer, can help cover up certain marks. Use the opposite color from what’s on your face. Orange pigment can help cover bluish dark circles and green pigment can help cover red blemishes. [6] X Research source"
    },
    {
      "title": "Apply the concealer around the blemish.",
      "content": "Apply the concealer around the blemish. Dab the concealer near the blemished area. You can do this directly with stick concealer or by using a finger or brush. Look into a mirror. Spread small amounts of the concealer all around the border of the darkened area. Don’t forget add some concealer on the top of raised blemishes. Foundation works the same way as a concealer but doesn’t blend in well with facial hair. Avoid using foundation and concealer at the same time under facial hair.."
    },
    {
      "title": "Blend in the concealer with your fingers.",
      "content": "Blend in the concealer with your fingers. Take your fingertips and tap them against the concealer. Gently rub the cream into the area. Keep a delicate touch when working around painful blemishes. It won’t take long for the concealer to blend in with your skin."
    },
    {
      "title": "Brush your eyebrows into shape.",
      "content": "Brush your eyebrows into shape. Start near the center of your face. Use gentle strokes to draw the hairs upwards. Continue doing this down to the thin part of the eyebrows. As you reach the end, brush to the side so your brows end in points. [7] X Research source A spoolie is a tiny brush used on eyebrows. It looks similar to a mascara brush, but make sure you don’t grab a makeup-filled brush by mistake."
    },
    {
      "title": "Pluck your eyebrows with tweezers.",
      "content": "Pluck your eyebrows with tweezers. Any loose hairs can be removed. Grip the hairs and pull them out one by one. Work slowly so you don’t thin your eyebrows more than you want. Take some time to step back from the mirror and see how your eyebrows look. Groomed eyebrows should complement your facial structure. [8] X Research source Start at the thicker part and end at the thinner part. Keep the hairs at an even length on the top and bottom of the eyebrow. Facial structure is important. For an oval face, for example, make your eyebrows square with space between them. For more square faces, a slight arch in your eyebrows will look better."
    },
    {
      "title": "Fill in your eyebrows with a brow pencil.",
      "content": "Fill in your eyebrows with a brow pencil. Press the pencil gently against your brow. Find the place where the hairs begin to slant towards the side of your head. Make short strokes to the side to add color. For areas of vertical hair, start at the bottom of your brow and work upwards until your eyebrows look full. [9] X Research source"
    },
    {
      "title": "Hold the hairs in place with brow gel.",
      "content": "Hold the hairs in place with brow gel. Dip the brush in the gel. Again, lightly stroke the brush along your brow. Drag the brush along the area of hair that slants towards the side of your face. Return to the vertical hair and stroke upwards from the bottom of your brow. [10] X Research source"
    },
    {
      "title": "Draw a line under your lower eyelash.",
      "content": "Draw a line under your lower eyelash. Use a black eye pencil to trace along the bottom of your eye. Move slowly so you draw on an even, thin line. For a more pronounced look, you can also close your eye and color your eyelid. You can use gel or liquid eyeliner if you wish. These tend to be a little harder for beginners to use and are more expensive, but last longer."
    },
    {
      "title": "Smudge the eyeliner with your finger.",
      "content": "Smudge the eyeliner with your finger. To channel David Bowie or Johnny Depp, make your eyeliner a little messy. Take one fingertip and rub it back and forth under your eye. If you colored your eyelid, smudge that too. Don’t worry about it looking neat. [11] X Research source"
    },
    {
      "title": "Line the inside of your eye.",
      "content": "Line the inside of your eye. Open your eye wide. Take the pencil to your lower eyelid. Touch the pencil to the inside portion. Draw a line around it from one corner to the other. [12] X Research source Feel free to customize your look. You may make them more colorful by adding silver eyeshadow to the inner corners or covering the black areas with a shiny lip gloss. You can also add mascara to make your eyes look darker. This is done by gently dragging a mascara brush over your eyelashes."
    },
    {
      "title": "Wash your face with an exfoliant.",
      "content": "Wash your face with an exfoliant. Exfoliants remove dead skin cells, which helps makeup settle better on your face. Apply some exfoliant. Don’t rub it in. Instead, gently massage or pat it in. Follow up by patting your face dry with a towel. Use the exfoliant at least twice a week. You should always wash your face before applying makeup. [13] X Research source If you have sensitive skin, use exfoliant sparingly. A non-exfoliant cleanser can always be used. It’s a good idea to use once (twice for oily skin) a day even when you aren’t wearing makeup."
    },
    {
      "title": "Apply toner to hydrate your skin.",
      "content": "Apply toner to hydrate your skin. Toner replenishes your skin, so it’s useful anytime you apply a cleanser. Get a cotton ball or cosmetic pad. Dip it in a little bit of the toner, then use it to dab the toner across your face. It’ll keep your skin smooth and soft. [14] X Research source Avoid using toners with alcohol. These can dry out your face."
    },
    {
      "title": "Protect your skin with a 15 SPF moisturizer.",
      "content": "Protect your skin with a 15 SPF moisturizer. Moisturizer, when applied in the morning, shields your skin from the sun. It can be applied at night as well to reduce the formation of wrinkles and other marks that break up makeup. Look for a product that has an SPF rating of 15 or higher. Rub it over your face and neck. [15] X Research source Try using moisturizer before applying makeup and after you wash it off at night."
    },
    {
      "title": "Clean off your makeup at night.",
      "content": "Clean off your makeup at night. Always remove makeup before you sleep. Wash your face at night to ensure you don’t leave stains on your pillow. A cleanser will help guarantee that your face is free of all makeup. An oil-based cleanser is effective for removing makeup, but shouldn’t be used on oily skin. Instead, stick to gels and water-based cleansers."
    },
    {
      "title": "Wear lip balm.",
      "content": "Wear lip balm. Lip balms also protect your skin and should be applied every morning. Look for ones with at least SPF 15, since these will protect your lips from sun damage. Avoid balms that have a shiny or glossy finish. These tend to look feminine."
    }
  ]
}