{
  "url": "https://www.wikihow.com/Check-Powerball",
  "title": "How to Check Powerball",
  "steps": [
    {
      "title": "Log onto the official Powerball website.",
      "content": "Log onto the official Powerball website. Access the game’s official website at https://www.powerball.com/ . The site includes listings of winning numbers, a map of states where Powerball is played, the names and prizes of previous winners and a detailed history of the game. [1] X Research source"
    },
    {
      "title": "Review the main page for winning numbers and other information.",
      "content": "Review the main page for winning numbers and other information. The site’s web designers have placed all of the relevant game information in plain sight at the top of the main page, making it easy for players to check and find the information they’re looking for. You should find the most recent Powerball drawing numbers front and center, alongside the current jackpot number and announcements of winners."
    },
    {
      "title": "Check back three times a week.",
      "content": "Check back three times a week. Powerball drawings are done on Monday, Wednesday and Saturday nights. Be sure to check the website on these days after 11pm to see if a winner has been named. [2] X Research source Updates to the Powerball website are made immediately after the tri-weekly drawings have been performed."
    },
    {
      "title": "Visit the Powerball website.",
      "content": "Visit the Powerball website. Get on the Powerball website and click on the “signup” link under the top menu bar. On this page, you will be given the option to put your name down to receive email alerts giving you up-to-the-minute details of drawings. Alternatively, there is a second link on the far left side of the page in the shape of an eye-catching bright red star reading “Get These Results by Email.” Both links will direct you to the same form."
    },
    {
      "title": "Sign yourself up to receive Powerball email alerts.",
      "content": "Sign yourself up to receive Powerball email alerts. Fill out the email alert signup form with the required information; you will be asked for your full name, valid email address and city and state location. That’s it! Once you’ve done this, you’ll be sent an email twice a week informing you of the status of the game. You can unsubscribe from the Powerball mailing list at any time by revisiting the same link and choosing the “unsubscribe” option at the bottom of the page."
    },
    {
      "title": "Check your email after every drawing.",
      "content": "Check your email after every drawing. Powerball selections are made bi-weekly on Wednesday and Saturday nights, so be sure to check your inbox after every drawing. The emails will contain the drawing numbers for that week, the amount that the jackpot has increased to and the names and locations of any winners. If you use a smartphone, turn on the notifications for your email app to be sent a quick message whenever you receive a new email. [3] X Research source If you find that you’re not receiving email updates, look to see if the announcement got caught by your spam filter. Some email platforms automatically filter out emails that are sent by third-party groups or aren’t from known senders."
    },
    {
      "title": "Find out what local channels air Powerball announcements.",
      "content": "Find out what local channels air Powerball announcements. Local news networks broadcast Powerball results after each drawing."
    },
    {
      "title": "Tune in at 10:59pm EST.",
      "content": "Tune in at 10:59pm EST. Winning powerball numbers are called out in a short segment aired just before the 11:00 nightly news. Turn to your local news network a couple minutes early to make sure you catch the announcement."
    },
    {
      "title": "Watch to see if you’ve chosen the winning numbers.",
      "content": "Watch to see if you’ve chosen the winning numbers. The format of the Powerball news broadcast is simple: the winning combination of numbers is displayed sequentially on the screen and highlighted to give time for players to review their own numbers. In order to win, you must be able to match at least three of the first five (white) ball numbers, as well as the last red (“Power”) ball. Pay close attention to your own numbers to see if there’s a match. In the event that your selected numbers match the winning combination, you’ve won! Fill out an authentication form and visit your state’s lottery headquarters to claim your winnings."
    },
    {
      "title": "Visit a local gas station, convenience store or supermarket.",
      "content": "Visit a local gas station, convenience store or supermarket. Powerball tickets can be bought in these establishments. For this reason, store owners usually help players keep track of the game. Powerball tickets cost $2 or $3, depending on whether you splurge for the “PowerPlay” option, which will multiply your winnings in the event of a match."
    },
    {
      "title": "Ask an attendant if the business posts Powerball updates.",
      "content": "Ask an attendant if the business posts Powerball updates. In many cases, places that sell Powerball tickets will keep winning numbers posted on a small board so that players who purchased a ticket from these stores can come back and check the game’s status. Bring your ticket and ask to be directed to the corner of the store where results are posted."
    },
    {
      "title": "Look to see if you’ve won.",
      "content": "Look to see if you’ve won. Check the posted winning numbers against your own ticket. Remember, you only need to match three out of the five white balls plus the Powerball to win. If you don’t hold the winning ticket, try your hand again and return once the next round of numbers is posted. Powerball numbers don’t have to be match in any particular order: as long as three or more of the five numbers are there, you’re a winner."
    }
  ]
}