{
  "url": "https://www.wikihow.com/Access-Facebook-Dating",
  "title": "How to Access Facebook Dating",
  "steps": [
    {
      "title": "Open Facebook.",
      "content": "Open Facebook. This app icon features a white \"f\" on a blue background that you can find on one of your Home screens, in the app drawer, or by searching. Tap ☰ . You'll see this in the upper right corner of your screen."
    },
    {
      "title": "Tap Dating.",
      "content": "Tap Dating . You'll see this next to the icon of a heart. [1] X Research source If you don't have a dating profile, you'll need to opt in before you can use Facebook Dating."
    },
    {
      "title": "Open Facebook.",
      "content": "Open Facebook. This app icon features a white \"f\" on a blue background that you can find on one of your Home screens, in the app drawer, or by searching. You must be 18 years or older to use Facebook Dating."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . You'll see this in the upper right corner of your screen."
    },
    {
      "title": "Tap Dating.",
      "content": "Tap Dating . You'll see this next to the icon of a heart."
    },
    {
      "title": "Follow the on-screen instructions to create a Facebook Dating profile.",
      "content": "Follow the on-screen instructions to create a Facebook Dating profile. You'll enter details about yourself, like your height, job title, religion, etc. The app will suggest profile pictures from your Facebook albums. You can accept or decline these suggestions, but you must have more than one photo to continue. The suggestions for matches that you see are only other Facebook users who have opted into Facebook Dating."
    },
    {
      "title": "Open Facebook.",
      "content": "Open Facebook. This app icon features a white \"f\" on a blue background that you can find on one of your Home screens, in the app drawer, or by searching."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . You'll see this in the upper right corner of your screen."
    },
    {
      "title": "Tap Dating.",
      "content": "Tap Dating . You'll see this next to the icon of a heart. When you open Facebook Dating, you'll see a card stack of potential matches as well as suggestions for potential matches from your Events and Groups. Along the top of your screen, you'll see if Facebook Dating users have sent you likes and your conversations."
    },
    {
      "title": "Tap the X or heart icon to indicate your interest.",
      "content": "Tap the X or heart icon to indicate your interest. If you're interested in a profile in the card stack, tap the heart icon to send them a like. If you're not interested, tap the X icon."
    },
    {
      "title": "Tap the profile from the card stack to see more of the profile.",
      "content": "Tap the profile from the card stack to see more of the profile. If you're intrigued by the card presentation, you can tap it to get a full, detailed view of the profile. You'll see the location of the user, more pictures, as well as more details (like their height and religion). You can also tap the X or heart icons to express interest or disinterest."
    },
    {
      "title": "Tap Liked You (if you have outstanding likes).",
      "content": "Tap Liked You (if you have outstanding likes). These are all profiles that have looked at yours and marked their interest."
    },
    {
      "title": "Tap the X or heart icon to indicate your interest.",
      "content": "Tap the X or heart icon to indicate your interest. If you're interested in a profile in the card stack, tap the heart icon to send them a like. If you're not interested, tap the X icon."
    },
    {
      "title": "Open Facebook.",
      "content": "Open Facebook. This app icon features a white \"f\" on a blue background that you can find on one of your Home screens, in the app drawer, or by searching."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . You'll see this in the upper right corner of your screen."
    },
    {
      "title": "Tap Dating.",
      "content": "Tap Dating . You'll see this next to the icon of a heart."
    },
    {
      "title": "Tap Go for It.",
      "content": "Tap Go for It . You'll see this at the bottom of the main Facebook Dating page inside a purple card labeled \"Secret Crush.\" You can add up to 9 of your Facebook friends and Instagram followers to your list of Secret Crushes. They will not be notified unless they add you as well as a Secret Crush. To add Instagram friends, you must connect your Instagram account with your Facebook Dating account."
    },
    {
      "title": "Tap the plus (+) icon.",
      "content": "Tap the plus (+) icon. You'll see a grid of 9 circles where you can add up to 9 Secret Crushes."
    },
    {
      "title": "Tap to add a Facebook friend or Instagram follower.",
      "content": "Tap to add a Facebook friend or Instagram follower. Only friends or followers who have also joined Facebook Dating will get a notification that they've been added as a Secret Crush, but not who added them. You can only add Instagram followers if you've connected your Instagram account with your Facebook Dating account. If you tap here without linking those accounts, you will be prompted to. You'll just need to follow the on-screen instructions to link the accounts."
    },
    {
      "title": "Search for your Facebook friend or Instagram follower.",
      "content": "Search for your Facebook friend or Instagram follower. As you type their name or username, you'll see suggestions below the search box."
    },
    {
      "title": "Tap a suggestion to add them to your Secret Crush list.",
      "content": "Tap a suggestion to add them to your Secret Crush list. Their profile will be added to your Secret Crush list and you'll get a notification if they add you to their Secret Crush list. To remove a profile from your Secret Crush list, tap their profile on the grid and select Remove ."
    }
  ]
}