{
  "url": "https://www.wikihow.com/Ask-Your-Parents-for-a-Mature-Video-Game",
  "title": "How to Ask Your Parents for a Mature Video Game",
  "steps": [
    {
      "title": "Start by asking nicely.",
      "content": "Start by asking nicely. Simply be kind, clear, and polite when you ask for the game. Say, “Mom, Dad, can I please have this game? It’s really important to me.” You can point out that you haven’t asked for a game in a while or you have a birthday or other occasion coming up if that’s true. Talk through what makes them concerned. Ask your parents what elements of the rating they are hesitant about, which are usually listed as intense violence, blood and gore, sexual content, and/or strong language. Whatever they mention, provide reasoning and reassurance for why playing the game doesn’t influence you to copy those things in real life. Say, \"If you see me acting more violently then you can take away the game.\" Or, \"Sex is optional and if you see me doing it you can take away the game.\" For drugs say, \"In health class, they teach us the effects of drugs and why not to take them.\" If the strong language bothers them, for example, you can say, “Look, if you hear me not being kind using those words, you can take away the game.\""
    },
    {
      "title": "Stay calm",
      "content": "Stay calm and show patience . Avoid getting in arguments and getting frustrated with your parents if they say no. Come back to them in a week or so with a calm and respectful demeanor to present a new angle for why you should have the game. Display that you care enough about the game that you can be patient and respectful when asking for it."
    },
    {
      "title": "Discuss the age limit.",
      "content": "Discuss the age limit. If you’re 17 years old or older, you are definitely of an age to purchase the game for yourself, but if you are younger than 17, point out to your parents that the Entertainment Software Rating Board (ESRB) classifies the Mature rating as “generally suitable” for 17 and up, but there is no legal requirement for selling this game to people under 17. [1] X Research source"
    },
    {
      "title": "Tell them the positive effects of video games.",
      "content": "Tell them the positive effects of video games. Let your parents know that there are positive things about playing video games that they may not know about. Refer to studies that show that video game play can strengthen problem-solving skills and prevent anxiety. You can tell them that first-person shooter games, which are generally more violent, are also shown to improve spatial reasoning, navigation, memory, and perception. [2] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source"
    },
    {
      "title": "Mention friends that have the game.",
      "content": "Mention friends that have the game. Tell your parents about friends you know of that have the game you want, and even suggest that your parents talk to theirs about why they agreed to let their child have the game. Make sure you talk to your friends first and get their permission to mention them. They might have purchased the game through an older sibling or friend without their parents knowing, or their parents might reconsider their decision after talking to yours."
    },
    {
      "title": "Offer to pay for it.",
      "content": "Offer to pay for it. Reassure your parents that you will pay for the game with your own money from an allowance, job, or savings ."
    },
    {
      "title": "Address violence.",
      "content": "Address violence. Ask your parents if they are concerned about the potential violence in video games because a major concern of many parents is that playing violent video games will lead to having more violent tendencies in real life. Do some research to find any of several studies that show that violent video games don’t make a person more violent and show it to them. [3] X Research source You can say, “The violence doesn’t affect me. I don’t get into fights in school or anything. But if the violence in this game starts to bother me, I’ll tell you or I’ll stop playing it.”"
    },
    {
      "title": "Compare to R-rated movies.",
      "content": "Compare to R-rated movies. If you’ve been allowed to watch any R-rated movies in the past, point out to your parents that an R rating has the same “suggested” age limit of 17 that the M rating for games has. Pick some examples of movies that might have similar themes to the game you want to buy to illustrate that you’re mature enough to handle them."
    },
    {
      "title": "Set a time limit.",
      "content": "Set a time limit. Discuss and agree on an amount of time per day or week that you won’t go over when playing the game, or any video game, if your parents are concerned about how the content affects you based on how much you play. Let them know that if you get the game, you’ll stick to this time limit. Show them that you can play games in moderation."
    },
    {
      "title": "Exchange for good grades.",
      "content": "Exchange for good grades . Promise all A’s or B’s on your next report card, or a similar goal for your grades, if they will get you the game."
    },
    {
      "title": "Exchange for chores.",
      "content": "Exchange for chores. Agree on certain chores you will do every week or month in exchange for being able to get the game. You can say, “I’ll take out the trash and load the dishwasher every day, and vacuum every week, if I can have the game,” or something similar that you and your parents can agree on."
    },
    {
      "title": "Set restrictions.",
      "content": "Set restrictions. Tell them you will not play on school nights, you will not play until you finish ALL your homework, and you will keep your grades up."
    },
    {
      "title": "Rent it until they approve.",
      "content": "Rent it until they approve. Rent the game from a library, video store, or Redbox, or invite a friend over who has the game. Tell your parents they can watch you play the game for a certain amount of time. If they are okay with what they see, they let you buy it; if they’re not okay with it, you will agree on a time when you can rent it and ask them again. You can also show them screenshots of the game online; they might be convinced by them alone."
    },
    {
      "title": "Play in a central location.",
      "content": "Play in a central location. Discuss and agree with your parents on the location of the house that you will always play the game if they let you get it. Letting them keep an eye on you in exchange for getting the game can be worth it, because they will likely stop paying attention after a time and let you play in peace."
    },
    {
      "title": "Allow parental controls.",
      "content": "Allow parental controls. Let your parents know they can use whatever parental controls are available on the device you play on, as long as you can have the game. They may be able to restrict access to the internet, the ability to make purchases, or even control how long you play and what friends you play with. [4] X Research source Consider that it could be worth it to sacrifice a small amount of your freedom to get the game you want. You might also impress your parents by being upfront about these controls rather than them having to do it behind your back."
    }
  ]
}