{
  "url": "https://www.wikihow.com/Change-Colors-when-Crocheting",
  "title": "How to Change Colors when Crocheting",
  "steps": [
    {
      "title": "Choose your colors.",
      "content": "Choose your colors. Before you begin crocheting, choose the colors that you would like for your pattern and decide where you want these colors to start. Some patterns may tell you specifically where to change colors, but if you are crocheting without a pattern, simply decide how much of each color you want in your work. It's best if you decide how many rows and chains you want in your pattern before you start working. For example, if you are making a dish cloth you may want 28 rows with 28 stitches going across. Then, you would need to decide how many rows of each color you want."
    },
    {
      "title": "Create your chains and rows.",
      "content": "Create your chains and rows. Take your first color and create your first chain and then your rows of single crochets until you have your desired size of that one color. Follow the steps for basic crocheting to create your pattern. Or, if you are following a specific pattern, create that pattern until you have reached the point where you want to change colors. On the very last stitch, don't complete your single crochet. Stick your hook through your chain, yarn over, and then pull it through to create two loops. At this point you should have two loops around your hook. Leave these loops on your hook as you switch colors. These specific instructions are for a single crochet stitch, which is the most basic, common stitch for crocheting. However, the technique used for this stitch can also be used for all types of stitches, so you can follow the instructions and gear them towards the type of stitch you are using."
    },
    {
      "title": "Take your new yarn and pull it through your hook.",
      "content": "Take your new yarn and pull it through your hook. Place the yarn you are working with down, with the crochet hook still inside it. Then, take your next color and fold it in half at the end, with five or so inches at the end of the yarn on one side of the fold. Then place your hook through the loop you just created and pull the second yarn color through the two loops on the hook. [1] X Research source Make sure you don't tie a loop in color two. You just want it folded in half so that it can slide through your loops in color one. As you are pulling color two through color one, you might need to hold onto the loose end of it to make sure you don't lose the yarn."
    },
    {
      "title": "Cut and pull color one.",
      "content": "Cut and pull color one. Now that you have color two attached, cut color one's attached strand of yarn. Leave about four inches, cutting the yarn attached to the skein. Then, pull the strand of yarn left that you just cut to tighten color two in place. [2] X Research source You might need to adjust color two into place by pulling on the end of the yarn with the end of color one. Take the color one yarn still connected to your work. Then, grab hold of the end of color two yarn and pull both strands together. This well help you adjust the yarn so the ends are about the same length."
    },
    {
      "title": "Create the first chain with your new color.",
      "content": "Create the first chain with your new color. Place the yarn under then over your hook and pull it through the loop on your hook. At this point you will start to crochet as usual, single crocheting over loose strands and then continuing to form rows and chains until you have your desired size."
    },
    {
      "title": "Single crochet over loose strands of yarn.",
      "content": "Single crochet over loose strands of yarn. Taking the color one and color two yarn you just pulled to adjust and tighten your crochet, hold them in the back of your work, near the top of your highest row. Now, turn your work and single crochet over both of those colors. Place your hook through the second chain. Then, grab your working yarn (color two attached to the bulk of the yarn) and place it over the hook. Then, pull color two through the loop. [3] X Research source"
    },
    {
      "title": "Crochet the strands until they are secure.",
      "content": "Crochet the strands until they are secure. As you create your stitches, the single strands of yarn will be crocheted into your work. Continue to create crochet stitches until the yarn feels secure, doing at least six to eight single crochets over the strands. Then, cut the ends of the yarn close to your last single crochet. [4] X Research source"
    },
    {
      "title": "Continue to crochet.",
      "content": "Continue to crochet. Now you should be solely working with color two. Continue to crochet color two into your work until you have your desired amount. At this point you can switch back to color one, add another color, or continue to crochet with color two. If you are going to switch colors again, just repeat the steps you used to switch from color one to color two. It's that easy!"
    },
    {
      "title": "Finish your project.",
      "content": "Finish your project. After you have your desired size, you'll need to do something with your loose yarn ends. Finish off your last single crochet, pushing the hook through your last stitch, yarning over, and then pulling through the two loops. Then cut your working yarn, leaving four or five inches. Yarn over and pull the yarn with your hook through your last loop. Pull it tight and weave your loose ends through your work. To weave your loose ends through your work, place your hook through your last stitch, yarn over with your loose yarn, and then pull it through the stitch. Continue to do this through each loop until you have weaved in about half of your yarn. Then, turn and go back the same direction you came, putting your hook through the stitch you just used and weaving your yarn towards the start."
    },
    {
      "title": "Crochet your rows until your desired length.",
      "content": "Crochet your rows until your desired length. Begin your crochet project as you normally would with one color. Stitch as many rows as you want. Then, when you know where you want to start your next color, stop crocheting. You can start your new color in the very middle of the row, towards the end, or towards the beginning. It's up to you really."
    },
    {
      "title": "Feed the hook through the next loop.",
      "content": "Feed the hook through the next loop. As you normally would, take your crochet hook and stick it through the next stitch with your color one yarn still on your hook. Then, wrap the yarn you are currently working with around the hook and pull it through the stitch (the first loop on your hook) just as usual. Let go of your yarn. [5] X Research source"
    },
    {
      "title": "Pick up your new yarn.",
      "content": "Pick up your new yarn. On your final yarn over, you will add your new colored yarn. Leaving the loops from your previous yarn on your hook, wrap your second colored yarn around your hook. Then, pull it through the loops already on your hook. After you have pulled it through, tug the new yarn from the back to tighten and adjust it. [6] X Research source"
    },
    {
      "title": "Crochet as you normally would.",
      "content": "Crochet as you normally would. At this point you should be working with your color two yarn. Simply crochet that yarn into your project as your normally would until you reach the point in your project that you want to change colors again. Then, change colors again in the same way. If you plan to switch back to the first color of yarn you were working with, then \"carry\" your yarn. Do this simply by changing colors in the way described, but keep the strand of your old yarn against the loops you are working with. Then, as you crochet with your new yarn, your old yarn will be carried in your work, because it is up against the loops you are crocheting. When you decide to change back to your previous color, it will already be in your work so the process will be easier. [7] X Research source"
    },
    {
      "title": "Purchase your supplies.",
      "content": "Purchase your supplies. To crochet you simply need a crochet hook and yarn. You can find both of these items at your local craft store or online. The best type of yarn to use when you are first starting out is 100 percent acrylic yarn in worsted weight. The best hook to use when you are first starting out is an aluminum crochet hook in size H (five millimeters). If you are an expert at crocheting, then use the supplies you already own."
    },
    {
      "title": "Create the first loop in your yarn.",
      "content": "Create the first loop in your yarn. Hold the hook in your right hand and wrap the yarn around your left index finger, placing the yarn over your finger and then looping it around your finger in a clockwise manner. When the yarn reaches the top of your finger again (where you began to wrap it) place it over the loop. Then, place the existing yarn on your finger over that piece of yarn and pull that piece of yarn upwards, pulling it through to form a loop. Hold your hook in your right hand (even if you are a lefty) and place your thumb and index finger on the flattened part of your crochet hook."
    },
    {
      "title": "Insert the crochet hook into the loop.",
      "content": "Insert the crochet hook into the loop. Insert the hook through the loop, and then take the loose end of your yarn and pull on it, until the loop is pulled tightly around the crochet hook."
    },
    {
      "title": "Begin the chain.",
      "content": "Begin the chain. Holding the hook in your right hand, take the yarn and place it over your left index finger. Then, take your thumb and middle finger and place them on the knot of the yarn that is around your hook. Hold that knot to secure it as you crochet. Then, move your crochet hook under then over the yarn in your left hand. Catch the yarn on the hook and pull the yarn through. This creates your first chain."
    },
    {
      "title": "Continue creating chains.",
      "content": "Continue creating chains. In a simple crochet pattern you will create twenty one chains. Continue to repeat the previous step, placing your crochet hook under and then over your yarn. Then, catch the yarn on the hook and pull it through. Do this until you have created 21 chains. It is important in crocheting that you keep count of your chains. You want your crochet to be even, and if you loose count it may be difficult to continue to crochet the next chains and to keep them the same length."
    },
    {
      "title": "Create your first crochet stitch.",
      "content": "Create your first crochet stitch. After you have created your first set of chains, take your hook and insert it in the second chain next to the hook. Your hook will be at the end of your chains, so don't place it in the chain directly next to it. Insert it into the chain one away from it. Place the head of the hook through the chain, Then, place your working yarn over your hook, and pull the yarn through to form a loop. This step is called the single crochet. It is helpful to remember this terminology because as you continue to crochet, it will be easier for you to follow the directions. The chains are the first loops that you create, and then from there you will continue to create single crochets until you have your final crochet pattern."
    },
    {
      "title": "Pull the yarn through both loops.",
      "content": "Pull the yarn through both loops. At this point you should have two loops on your hook. Now, place the yarn over the hook (yarn over), and pull the yarn through both loops. Then, move onto the next chain and do the exact same thing. Stick the head of the hook through the chain, yarn over, and pull it through the chain. Then yarn over and pull the yarn through both loops. You will do this step until there are a total of 20 single crochets, meaning you have looped your yarn through 20 of the chains."
    },
    {
      "title": "Add another row.",
      "content": "Add another row. Repeat the previous steps until you've completed the entire row of chains. Now, create the next set of chains by placing the working yarn over the hook and pulling it through the loop around your hook. Then, turn your work and skip the first chain. Place the hook through the second chain. Yarn over and pull it through both loops. Continue to do this until you have worked your way down your chains."
    },
    {
      "title": "Repeat these steps until you have finished.",
      "content": "Repeat these steps until you have finished. You will do 20 single crochets for each row and then 20 rows. Repeat these steps -- placing the hook through your chain, pulling the yarn through the two loops, continuing down the chain, turning your work and starting again on the next set of chains -- until you have completed 20 rows. If you mess up, that's okay! Simply, take your hook out of your yarn and begin to pull your yarn to unravel it, until you've reached your mistake. Then, stick your hook back through your yarn and continue to crochet. If this is your first time crocheting and your work looks like a mess, don't stress. Crocheting is an art that takes practice, so continue to practice until you get the hang of it."
    }
  ]
}