{
  "url": "https://www.wikihow.com/Breed-Lovebirds",
  "title": "How to Breed Lovebirds",
  "steps": [
    {
      "title": "Learn about love birds.",
      "content": "Learn about love birds. Breeding love birds can come with risks, especially if a mate dies. [4] X Research source Informing yourself about love birds and their mating process can help you figure out if this right decision for your animals and for you. Understand that unlike other animals, lovebirds mate for life and can continue mating throughout their almost 15 year life cycle. [5] X Research source Monogamy underpins the social structure of lovebirds and is vital to the stability of flocks. [6] X Research source Be aware that if a mate dies, its companion can exhibit erratic behavior that is like a form of depression. Lovebirds do not like to be alone. [7] X Research source Enjoy the fact that lovebirds are romantic with one another and may feed each other to re-establish their bonds after stress or separation. [8] X Research source"
    },
    {
      "title": "Get supplies to breed and house lovebirds.",
      "content": "Get supplies to breed and house lovebirds. Lovebirds usually live in holes in trees, rocks or shrubs in the wild. Buy the supplies to give your lovebirds a home where they feel comfortable and can breed successfully. Get your lovebirds a cage of no less than 18x18x12 inches with the bars spaced no more than 3/4\" inch apart. Try and purchase a square or rectangular cage so they have places to hide. Place different sized perches in the cage along with toys to keep the lovebirds happy and stimulated. Avoid wooden Put separate water and food dishes in the cage away from the bottom. Clean the cage and dishes daily to keep your lovebirds healthy . Disinfect the cage once a week."
    },
    {
      "title": "Find a pair of lovebirds to breed.",
      "content": "Find a pair of lovebirds to breed. Choose the best lovebirds to breed. This can help ensure the health of the birds and the breed. Check that the lovebirds you want to mate are not related. This may require a DNA test. Make sure the birds have not mated for more than 2 clutches, which can cause them serious illness. Avoid mixing breeds, which results in hybrid birds that don’t belong to any species of lovebirds. [9] X Research source Male and female lovebirds often look the same, so you may need to take your birds to a veterinarian to determine the sex . Contact groups such as the African Love Bird Society for places to get birds of the same species as yours. [10] X Research source"
    },
    {
      "title": "Select a healthy mate.",
      "content": "Select a healthy mate. Choosing a healthy mate for your lovebird or two healthy lovebirds is important to maintaining their health and that of the breed. Look for the following qualities of a good lovebird specimen when selecting a mate or pair: Rounded body shape Good ability to stand and walk Broad rump and back Rounded and full breast Sharp and compact tail Large, wide, and rounded head Wide and appealing face Large, round, and bold eyes Even, deep and clear plumage, or feathers Immaculate feather condition Clean, large, and strong feet with straight toes and no scars Clean and large bill, or beak, free of scars."
    },
    {
      "title": "Check the health of your lovebirds.",
      "content": "Check the health of your lovebirds. You cannot introduce lovebirds unless you know that both animals are healthy. Take the pair to the vet to make sure that they’re healthy enough to breed. Let your vet know that you plan to breed the lovebirds. Ask her any questions you might have about the birds, their health, or breeding the pair."
    },
    {
      "title": "Consider quarantining the animals.",
      "content": "Consider quarantining the animals. If you bring a new lovebird into your flock for mating, consider quarantining the pair for a few days. This can help ensure that both are healthy and that the female doesn’t get territorial or reject the male. If you are breeding lovebirds you already own, you likely don’t need to quarantine the pair"
    },
    {
      "title": "Introduce the lovebird pair.",
      "content": "Introduce the lovebird pair. When you know that each lovebird is healthy, introduce the pair. Take it slowly, as it could take a few days for the birds to get used to one another. Place the birds in cages next to one another before putting them in the same cage. Move the birds to the same cage after a couple of days. Put nesting materials in the cage to encourage the couple to start building a nest. Remove any birds that are exhibiting signs of aggression or rejection of a potential partner."
    },
    {
      "title": "Watch for signs of mating.",
      "content": "Watch for signs of mating. Lovebirds are prolific reproducers and you may notice many signs of mating. Signs of mating can include: Courtship Aggression Jealousy or being “hormonal” [11] X Research source Carrying material in the feathers Nest-building."
    },
    {
      "title": "Provide the birds enough nutrition.",
      "content": "Provide the birds enough nutrition. Lovebirds that are breeding need dense, nutrition packed foods because of the stress on their bodies. Avoid giving them just seeds, which may not provide enough nutrients for the birds or their babies. Some examples of what you can mix together to feed your lovebirds are: Cooked elbow macaroni Pearl barley Frozen vegetables Granulated sea kelp Whole grain brown rice Apples Greens Cereal, toast or crackers Cuttlebone."
    },
    {
      "title": "Check for eggs.",
      "content": "Check for eggs. The only way to be certain that your lovebirds have mated is by checking for eggs. In most cases, the female lovebird will lay her first egg ten days after mating and then will brood, or sit on the eggs, after the second is laid. Look at the nest every morning to see if there are any eggs. The female will generally lay eggs at night. She may produce one egg every other day, up to 5 or 6 eggs. Be aware that two female lovebirds, if placed together. can lay up to 10 infertile eggs."
    },
    {
      "title": "Allow the female to brood.",
      "content": "Allow the female to brood. It takes around 25 days for a female to brood, or sit on, her eggs. Let her brood uninterrupted for at least 10 days. Be aware the female will only leave to excrete waste, drink, and have a bite of food. In most cases, the male will feed the female during brooding."
    },
    {
      "title": "Figure out if eggs are fertile.",
      "content": "Figure out if eggs are fertile. It’s common to have infertile eggs, especially if a pair is too young or old. After allowing the female to brood for 10 days, you can check to see if the eggs are fertile. Handle the eggs as gently as possible. Check each egg by holding an egg up to a light source, such as a flashlight and looking for a membrane, which is a sign the egg is fertile. You can also check by placing the egg in a shallow dish of warm water one week before it hatches. After five seconds, check if you can see a membrane. Be aware that it is normal for eggs to not be fertile or for a baby to die in the egg."
    },
    {
      "title": "Wait for the eggs to hatch.",
      "content": "Wait for the eggs to hatch. After between 21-26 days of brooding, your eggs may hatch. Be sure to not handle the eggs or the hatchlings for the first 6-8 weeks of life. The mother bird will feed the babies for 6-8 weeks from the nutritious food you provide. Remove any unhatched eggs or baby lovebirds that die."
    }
  ]
}