{
  "url": "https://www.wikihow.com/Admit-to-a-Foot-Fetish",
  "title": "How to Tell Your Partner about Your Foot Fetish",
  "steps": [
    {
      "title": "Let the relationship breathe a bit before bringing your fetish up.",
      "content": "Let the relationship breathe a bit before bringing your fetish up. The worst thing you can do is blurt your fetish out too early in the relationship. If you're just in the middle of your first date , or even kissing for the first time , saying, \"I have a foot fetish!\" is likely to turn your night in the wrong direction. If you want to tell your partner about your foot fetish and get the best results, wait for the perfect time when you know each other a little better. [1] X Research source Ideally, you should wait until you have a sexual experience before you discuss your foot fetish. Otherwise, it may be too much, too soon. On the other hand, you don't want to wait too long —if you walk down the aisle before admitting your lifelong obsession with feet, then you may run in to some serious trouble. Devlin recommends knowing yourself first, anyway. She says, “The first step with admitting a fetish is becoming clear on it for yourself. The more we understand what we want, what we don't want, and things that light us up, it becomes easier to share that someone else.”"
    },
    {
      "title": "Start touching your partner's feet when you're ready.",
      "content": "Start touching your partner's feet when you're ready. Once you've gotten more comfortable with your partner, it's time to test the waters. If you've found yourself in bed in various degrees of undress, you can try kissing your partner's stomach, and legs, and then move your way down to the feet. Don't go straight for the feet or you may freak your partner out. You can also just start touching your partner's feet if you're watching TV and you want to give them a sexy foot massage . [2] X Research source Don't start licking or sucking on your partner's feet yet—this may be too much too soon as well. Don’t worry about your partner reacting super negatively! Devlin points out that everyone loves foot massages. “I don’t know anyone that is going to turn down a foot massage from their partner.”"
    },
    {
      "title": "See how they react to your interest in their feet.",
      "content": "See how they react to your interest in their feet. How does your other half react when you go for the feet? Do hear murmurs of approval, the occasional, \"Oh, that feels good,\" and see a nice relaxed smile on their face? If so, then things are moving in the right direction. If your partner pulls away, or even outright says they don't like it when you touch their feet, then it's time to abort the mission. [3] X Research source If your partner reacts negatively, don't be discouraged. You may still be able to turn things around. However, this does mean that you shouldn't go for the feet again until you have the big talk."
    },
    {
      "title": "If your partner reacts positively, compliment their feet.",
      "content": "If your partner reacts positively, compliment their feet. Don't go overboard -- just say, \"You have such sexy feet,\" or \"I just love your feet.\" Don't make it sound like a fetish yet -- just tell your partner that they specifically have amazing feet. This will make it easier for your partner to swallow the news than if you flat-out stated that you categorically love all feet before paying special attention to your partner's feet. [4] X Research source Additionally, if you're a guy, and really feel like you need to mention their feet, you can compliment her about it when you're having a night out. You can say, \"Your feet look great in those shoes.\" But don't overdo it, or little will they know, you have a foot fetish and think you only like them for their feet."
    },
    {
      "title": "Pick the right time to do it.",
      "content": "Pick the right time to do it. When is the right time to admit to a foot fetish? There's no golden rule, but you probably should not do it in the middle of a hook-up. Instead, pick a time when you and your special someone are hanging out and feeling good about each other -- while having some privacy. You can tell your partner when you're back at your place and you think you may be close to being intimate again. [5] X Research source Fessing up in the middle of hooking up or cuddling may give you a reaction you may not be ready for, and can interrupt the mood (though, not ruin it for good!)."
    },
    {
      "title": "Focus on the pleasure of getting what you want.",
      "content": "Focus on the pleasure of getting what you want. We are social creatures and pick up cues from the people around us, and our emotions are contagious—so, if you approach your partner with anxiety, they will also feel anxious. Devlin says that instead, it’s best to fantasize about how good it will feel when your partner says \"yes\" to your request. When you have the conversation, present your ask as if you are inviting your partner to do something fun! Let them feel your anticipation and ease. It will help them accept your desires because they will feel more comfortable. It's much better to imagine your partner's positive response rather than imagining a poor reaction from them. If you approach your partner with anxiety, guess what—they are going to feel super anxious, too."
    },
    {
      "title": "Share your fetish with excitement.",
      "content": "Share your fetish with excitement. Devlin says it’s best to just be honest . Just say, \"Hey, I have a thing for feet.\" Or, \"I want you to know that I have a foot fetish.\" Let them feel your excitement and ease—it will help them accept your desires because they'll feel more comfortable. If you hear nothing, you can ask, \"What do you think?\" But generally, it's a good idea to give your partner some time to process the news. Devlin also advises differentiating between things you fantasize about and things you want to explore right now. This way, if your partner isn’t super into feet-related activities, they can choose what kind of activities they want to explore with you. Give them options!"
    },
    {
      "title": "React respectfully when your partner shares their feelings.",
      "content": "React respectfully when your partner shares their feelings. There are a few ways that this news can be taken. The best case scenario is if your partner says, \"Really? That's kinky. I don't mind at all!\" However, it's also possible that your partner will want more information or won't quite know how to react. The worst-case scenario is if your partner is completely not accepting of your fetish and thinks that feet are completely gross. You've said your piece, though, and now it's time to be mature and to deal with your partner's reaction in a calm and adult fashion. Whatever happens, you should be proud of yourself for being honest. If your partner accepts your foot fetish on the spot, great. Prepare for a night of kinky fun. If your partner needs some time to deal with it, take things slow. Don't try to touch their feet too much during your next kissing session -- wait for your partner to give you the green light. If your partner is just flat-out not into it, then there's no need to not try to force it. After all life is short and you have a foot fetish. Now, it's up to you to decide if you can handle a relationship that doesn't allow you to indulge your foot fetish. There is also a chance that over time they will warm up to it and become curious after a while. [6] X Research source"
    },
    {
      "title": "Give your partner a range of activities to choose from.",
      "content": "Give your partner a range of activities to choose from. Devlin points out that It's pretty common for partners not to have completely matched desires. In the case of a foot fetish, start by having a conversation where you say \"This is why I like this. These are the fantasies that I have and these are the things I actually want to do.\" Then, your partner can cherry-pick from the menu of activities and let you know what they're comfortable with. For example, maybe your partner isn’t into you putting their toes in your mouth. But maybe they’re totally okay with some foot-to-genital play. If you only tell you partner you want to kiss their feet, you may be missing out on something else!"
    },
    {
      "title": "Remember that foot fetishes are actually fairly common.",
      "content": "Remember that foot fetishes are actually fairly common. Devlin says, “I would be really shocked if your partner is totally freaked out by a foot fetish. This is a common kink and there are way more extreme fetishes out there.” It’s even possible that your partner has been with other people who had foot fetishes before. Some studies suggest that 15-20% of people have a foot fetish, so it’s not like you’re into something super obscure or out there. [7] X Research source"
    },
    {
      "title": "Find other ways to get your needs met if your partner isn’t into it.",
      "content": "Find other ways to get your needs met if your partner isn’t into it. Devlin explains, “For people that are in relationships in which their partner cannot satisfy any of their needs, I encourage the person with the fetish to seek non-conventional ways of getting their needs met. So, if someone has fantasies about people touching their feet, they can go get a foot massage at a massage parlor or they can read dirty stories. You can fantasize if nothing else.” Don’t cheat. However, if your partner isn’t interested in foot play and you two have discussed opening up the relationship, this is a good way to get your needs met elsewhere."
    }
  ]
}