{
  "url": "https://www.wikihow.com/Claim-Land",
  "title": "How to Claim Land",
  "steps": [
    {
      "title": "Make sure you understand what is meant by abandoned land.",
      "content": "Make sure you understand what is meant by abandoned land. Just because the owner of a property is deceased and has no living heirs doesn’t mean the land is up for grabs. In most cases, it will belong to the state. If a person physically abandons the land and has no plans to return or execute their rights of ownership, it may be considered abandoned. Check the rules for your jurisdiction to find out what is considered to be abandoned land."
    },
    {
      "title": "Check the tax roll for the city or county in which the property is located.",
      "content": "Check the tax roll for the city or county in which the property is located. This lists all taxable property within a given jurisdiction. The roll will tell you how much the land is worth, whether it's been claimed, and whether there's an outstanding tax bill that needs to be paid on the property. [1] X Research source Many counties have digitized this list onto a county-wide parcel assessor website. Search for \"XYZ County Parcel Assessor\". If you find land on the tax roll that appears unclaimed, get a copy of all the information listed about the parcel."
    },
    {
      "title": "Enlist the help of a lawyer.",
      "content": "Enlist the help of a lawyer. If you find parcels of land that can potentially be claimed, the process of officially doing so can be complicated. Work with a real estate lawyer in your area to ensure that you complete all requirements correctly, and legitimately take ownership of any land that can be claimed."
    },
    {
      "title": "Contact the state's unclaimed land division, if applicable.",
      "content": "Contact the state's unclaimed land division, if applicable. Some states may have unclaimed land divisions, while others only have abandoned property divisions. You need to provide the identifying map coordinates or the address of the land you want to claim, available via the tax roll. Ask whether the unclaimed land department has had any contact with a possible owner or heir, and if so, how recently. [2] X Research source For instance, Texas has an “Unclaimed Property Search” available through its Comptroller’s office, which provides information about unclaimed land."
    },
    {
      "title": "Inquire about back taxes owed against the land.",
      "content": "Inquire about back taxes owed against the land. When property taxes are left unpaid for too long, the land title defaults to a public agency until the tax bill is satisfied. In order to redeem tax-defaulted property, you must usually pay the sum of the unpaid taxes, with interest, along with a redemption fee. [3] X Research source If the taxes are being paid by a mortgage company, bank, or someone other than the owner, use the tax report to find their contact information. They may be willing to let you take over the bill and claim the land. There is often no limit to how long states can act as the custodian for abandoned land. This means the tax bills can be sizeable."
    },
    {
      "title": "Look for heirs or others with a legitimate claim to the land.",
      "content": "Look for heirs or others with a legitimate claim to the land. Before you can legitimately claim possession of land, you must prove you have performed due diligence to find any owners or heirs who may have a legal right to the property. Work with a property lawyer in your area to find the actions required for due diligence, which may include: [4] X Research source Putting an advertisements in a classifieds section of a local newspaper announcing your intent to claim the land if no heirs come forward. Registering an announcement on a state website for unclaimed land. Looking into state records to find the last known owner or heirs, and attempting to track them down."
    },
    {
      "title": "File a suit for a quiet title if necessary.",
      "content": "File a suit for a quiet title if necessary. In some cases, you may need to file a suit for a quiet title to take ownership of the land. Generally, you’ll need to pay taxes and live on the property for 7 years in order to obtain the title or deed for the land. Speak to your lawyer about the procedure for filing a quiet title. [5] X Research source"
    },
    {
      "title": "Take possession of the land.",
      "content": "Take possession of the land. If you qualify with the unclaimed land office, and they don't find any heirs or blood relatives with a more legitimate claim than yours, then you can go ahead and stake your claim. Ask the land department how to take possession of the land. Make sure that you are able to secure the title to the land from the department, to prove your legal ownership in the future."
    },
    {
      "title": "Be wary of scam artists.",
      "content": "Be wary of scam artists. Long ago, the Federal Bureau of Land Management administered parcels of free land under the Homestead Act, but this practice has been discontinued for many years. Free plots of land without an owner are basically nonexistent. Be wary of any companies that offer to help you stake your claim to your “free land,” since these are likely scams. Some small, rural communities in states like Alaska, Iowa, Kansas, Minnesota, Nebraska, North Dakota, and Wisconsin may offer local land-grant programs intended to reverse depopulation. They may require you to do things like build a home of a certain size or value on the property, or bring business to the community. [6] X Research source"
    },
    {
      "title": "Check the legal definition of “adverse possession” that applies to your area.",
      "content": "Check the legal definition of “adverse possession” that applies to your area. What is commonly called “squatter’s rights” is legally known as adverse possession. In theory, if an owner allows someone to trespass for years without giving permission, complaining, or taking action, he or she may lose the rights to the land. However, the laws governing adverse possession vary from state to state, and they are often very strict. [7] X Research source Contact a real estate lawyer to help you understand and follow the laws of adverse possession that apply in your area. To find a state-by-state guide on adverse possession, go to: https://www.nolo.com/legal-encyclopedia/state-state-rules-adverse-possession.html ."
    },
    {
      "title": "Show “hostile” occupation of the land.",
      "content": "Show “hostile” occupation of the land. “Hostile” in this sense has a specific legal meaning, signifying that you are occupying land you do not have legal ownership or other right to. There are two general definitions of hostile occupation. Courts will follow one or the other. Under the “Maine rule,” you must occupy the land for several years, fully aware that you have been trespassing. Under the “Connecticut rule,” however, you do not need to know that you have been trespassing."
    },
    {
      "title": "Prove that your possession has been “actual.”",
      "content": "Prove that your possession has been “actual.” This is another legal term. As the trespasser you must actually be in possession of the property and treat it as if you were an owner. You must have a physical presence on the land, whether you outright live there or you've just built a fence."
    },
    {
      "title": "Don’t keep your possession a secret.",
      "content": "Don’t keep your possession a secret. To gain adverse possession, your use of the land must be “open and notorious.” This means it must be obvious to anyone, including an owner who investigates that a trespasser is on the land. Obvious signs of possession of the land may include, but are not limited to, things like: Building a house. Planting and maintaining a garden. Pouring a concrete driveway. Erecting a fence."
    },
    {
      "title": "Stay on the land that you want to claim.",
      "content": "Stay on the land that you want to claim. Adverse possession requires your use of the land to be “exclusive and continuous.” This means you yourself must use the land without interruption, for a period of time determined by your state (typically several years). You cannot leave the land and later return to it, or let someone else use it before taking it back."
    },
    {
      "title": "Meet any other legal requirements applicable in your area.",
      "content": "Meet any other legal requirements applicable in your area. Some states have additional requirements beyond proving that your occupation of the land has been hostile, actual, open and notorious, and exclusive and continuous. For example, in California, you must also prove that you have been paying property taxes on the land."
    },
    {
      "title": "Prepare for common defenses.",
      "content": "Prepare for common defenses. You will need to build a case against the legal owner, and you should bear in mind the reasons why your claim might be denied. Common reasons an owner might legally retain ownership of the land you want to claim include: Permissive use. If the actual owner has granted you permission to use the property, especially in writing, your possession is not “hostile.” Insufficient acts. You might have used the land, but not in a way that suggests ownership. For instance, perhaps you walked across a neighbor's field for years to get to the store. Non-exclusive use. This means you weren't the only person using the land. If both you and your neighbor let cattle graze on a piece of land, you cannot claim exclusive use. Insufficient time. This simply means that it is deemed you did not use the land as long as your state requires for adverse possession."
    },
    {
      "title": "File a complaint and claim your title.",
      "content": "File a complaint and claim your title. If you have met all of the requirements for adverse possession, you may file a complaint with the court in your area to \"quiet title\" and declare you the legal owner of the property. If the court grants your complaint, the title will be cleared in your name, and you will become the exclusive legal owner of the property. Work with a real estate lawyer to file the complaint with the proper court."
    }
  ]
}