{
  "url": "https://www.wikihow.com/Assert-Yourself",
  "title": "How to Assert Yourself",
  "steps": [
    {
      "title": "Practice using \"I\" statements.",
      "content": "Practice using \"I\" statements. \"I\" messages allow you to take responsibility for your own feelings and opinions in communication without attacking or offending others. These assertive statements are based on your own unique experience regarding a certain topic. They do not focus on the other person's experience. \"I\" messages convey to the listener \"this is what the situation looks like to me\". Examples of \"I\" statements include: [1] X Research source \"I get scared and upset when yelling or curse words happen during arguments\" rather than \"Your yelling and cursing scares me. You need to stop it.\" \"I am worried that my abilities are not being put to use in my current position\" as opposed to \"You all placed me in a position that is not conducive to my growth.\""
    },
    {
      "title": "Get comfortable saying \"no\".",
      "content": "Get comfortable saying \"no\". Turning down projects or nights out with friends might not seem all that friendly, but occasionally saying \"no\" allows you to say \"yes\" to events and tasks that allow you to flourish. For the most part, you have the right to use your time as you see fit. Assertiveness means giving a head shake to situations that are not in your best interests. [2] X Research source Saying \"no\" might be difficult at first, but, with practice, you will see that exercising this right helps you get ahead. Doing so gives you experience setting boundaries with others and asserting yourself, which are some of the most important skills for both personal and professional growth. Setting boundaries will help you to communicate your needs to other people and ensure that people know what you will and will not tolerate. [3] X Research source"
    },
    {
      "title": "Minimize judgments.",
      "content": "Minimize judgments. Many people shy away from asserting themselves in social situations because they equate assertiveness with being judgmental. Assertiveness, by definition, involves standing up to yourself, but this is done by compromising, considering other's needs and being respectful. Judgments are not cast. [4] X Research source"
    },
    {
      "title": "Reel in your emotions",
      "content": "Reel in your emotions . Assertive people are considered to be expert communicators. It follows that such masters at communication cannot allow their emotions to control them. They must be in control of their emotions since failing to effectively manage your own feelings can result in dire consequences. [5] X Research source For example, if someone says something you disagree with, it will not be effective to lash out in anger. Such a reaction can cause you to damage the relationship because you are speaking from your emotions, and not from a place of objectivity. The first step towards mastering your feelings is to become aware of them. Begin monitoring your feelings for several days. Take note of the times and situations that evoke strong emotions from you. Find an emotions chart and try to label what you're feeling. [6] X Research source Next, uncover the stimulus behind these feelings. In other words, why did you react this way? After that, decide if that emotion is a great representation for how you want to behave and interact with people. If it's not, then you will have to make a choice to change your perspective by editing negative or unhelpful thoughts."
    },
    {
      "title": "Drop the qualifying statements.",
      "content": "Drop the qualifying statements. In English, a qualifying statement is something added to an initial statement that reduces it's strength. In the context of writing arguments, it is good practice to leave room for uncertainty. Therefore, qualifying statements are useful in this regard. In the context of assertiveness, however, you should state your opinions using categorical statements, which are statements you support 100%. Categorical statements leave no room for doubt, thereby coming off as assertive. A qualifying statement might sound like \"This is just my opinion but...\" or \"Feel free to disregard this but...\". A stronger categorical and assertive statement may be \"In my opinion...\" (with no added \"but\" or reducing disclaimer) or \"I think the best course of action is...\""
    },
    {
      "title": "Assess your body language.",
      "content": "Assess your body language. Nonverbal communication has as much impact, if not more, than the words you say. Assertive communicators must be mindful of their body language in order to come off as non-threatening, uncaring, etc. Assertive speakers have respect for the other person's personal space, allowing up to a 4 feet distance between both parties. They also maintain direct, non-invasive eye contact while speaking with a balanced volume (not too soft, not too loud) and a tone that is modulated for the situation and location. [7] X Research source It is acceptable to stand or sit with an erect, but relaxed posture (open arms and legs oriented towards the speaker) and use non-threatening gestures to illustrate a point."
    },
    {
      "title": "Learn to choose your battles.",
      "content": "Learn to choose your battles. Always being the congenial peacekeeper may not bode well in many areas of life. However, barking down someone's throat at the slightest error in judgment will probably not win over any supporters, either. Being assertive means taking a firm, yet flexible middle ground. Pick your fights. Every issue is not one that requires a full-on debate or a stance on the soapbox. Decide which issues match your values, and be sure to use your voice during these times."
    },
    {
      "title": "Understand what you want.",
      "content": "Understand what you want. Assertiveness can help promote greater self-esteem, but you will require some self-esteem to assert yourself in social situations. Assertiveness and self-esteem are both rooted in knowing what you want . How do you want to be treated by others? How do you want to feel about yourself? What are you passionate about? What kind of people do you want to surround yourself with? What do you value in yourself and others? All of these questions can give you an idea of what you want. To start, get out a sheet of paper and list values that you admire in yourself and in others. These can include characteristics such as ambition, forgiveness, compassion, honesty, kindness, etc. Rank by order of importance which values you consider to be most significant. Your ranking response will guide you to answering many of the other questions."
    },
    {
      "title": "Be clear about your expectations - to yourself and to others.",
      "content": "Be clear about your expectations - to yourself and to others. Once you understand what it is you want out of life, move in the direction of making those things happen. Stop accepting treatment from others that does not reflect your standards. Voice your wants by standing up for yourself when those basic desires are not met. For example, if you have a partner who lies to you and this goes against your basic desire of having an open and honest relationship, you will need to assert yourself (i.e. speak up) with your partner and discuss these desires. If the person chooses not to respect your rights, then you might consider whether you want to continue the relationship. Avoid beating around the bush or expecting others to guess your needs. Voice your needs and desires in a straightforward and healthy way, demonstrating to others that these important standards and values are non-negotiable. \"I expect to have a partner I can trust\" or \"I want to you to be honest with me always.\""
    },
    {
      "title": "Know what you have going for yourself.",
      "content": "Know what you have going for yourself. A key aspect of building self-esteem is being aware of your strong suits. Make two lists: one for your achievements and one for all the things you admire about yourself. Enlist the help of a close friend or family member if you have trouble identifying some of the traits that make you a great person. [8] X Research source"
    },
    {
      "title": "Become a thought editor.",
      "content": "Become a thought editor. Few people understand that one of the most powerful tools we have to manage our emotions and behaviors lies inside our own minds. What you say to yourself on a daily basis can determine whether you feel great or horrible about yourself. Learn to manage your self-talk by paying close attention to negative or unhelpful statements you say to yourself. Edit your negative thoughts into positive ones by finding evidence - or lack thereof - to support or deny these unhelpful thoughts. [9] X Research source For example, you find yourself saying \"I will never get a raise. No one notices my performance.\" Can you really predict the future (i.e. that you will never get a raise)? How do you know that no one notices your performance? By asking questions you can prove that this thought is clearly irrational, since no one can predict the future. Bringing awareness to negative thoughts can minimize that inner critic that lowers your self-esteem."
    },
    {
      "title": "Show others respect.",
      "content": "Show others respect. It's important to recognize that the word 'assertive' has a drastically different meaning than 'aggressive'. Aggressive is spouted over and over again in the business world as a positive attribute. Aggressive marketing, aggressive sales - these may be great in many aspects. However, an aggressive communicator attacks, belittles, disrespects, and violates the rights of others. Being assertive translates to respecting the opinions, time, and effort of others. Stand up for yourself, while also treating everyone else with positive regard. When you show others respect, you naturally become a more respectable person. [10] X Research source"
    }
  ]
}