{
  "url": "https://www.wikihow.com/Change-Your-Name",
  "title": "How to Legally Change Your Name",
  "steps": [
    {
      "title": "List your new name on your marriage certificate.",
      "content": "List your new name on your marriage certificate. When you go to the courthouse to get your marriage certificate, the clerk should ask you if you want to change your name. Make sure your full new name is listed on the marriage certificate. [1] X Research source If it's not, the name changing process will be more complicated. If you've already obtained your marriage certificate and it doesn't include your name change, skip down to the general name-changing method. Getting married makes changing your name easier than it would otherwise be, so think carefully about what you want your permanent name to be. You can use your former last name as your middle name or hyphenate two last names if you don't want to drop your maiden name entirely."
    },
    {
      "title": "Change your name on your Social Security card.",
      "content": "Change your name on your Social Security card. Once you've received your marriage license, your next step will be to obtain a new social security card, which will require you to fill out a form and either visit a Social Security Administration office or mail it in with the required documents. [2] X Research source Gather your paperwork together. You'll need your marriage certificate, birth certificate, photo ID (driver's license, passport, or state ID card) and a completed application for a new Social Security card, available online. [3] X Trustworthy Source Social Security Administration Independent U.S. government agency responsible for the administration and management of Social Security Go to source Submit your documents to the Social Security Administration. You can make an appointment to change your name in person, or you can mail in the appropriate documents. All original copies will be mailed back to you with a receipt. [4] X Trustworthy Source Social Security Administration Independent U.S. government agency responsible for the administration and management of Social Security Go to source You can find the address for the Social Security office nearest you via a locator on the Social Security Administration website. [5] X Research source Your new card should arrive within 10 days of processing (that is, the date shown on your receipt or the date on which you visited an SSA office)."
    },
    {
      "title": "Change your name on your driver's license or state ID card.",
      "content": "Change your name on your driver's license or state ID card. Visit your local DMV with your new Social Security card and your old driver's license or ID card to receive a new ID card. [6] X Research source"
    },
    {
      "title": "Change your name on all your other documentation.",
      "content": "Change your name on all your other documentation. Here's a short list of what you might consider: [7] X Research source Bank accounts Credit cards Leases or mortgages Car title Voter registration Medical offices Post office boxes Passport"
    },
    {
      "title": "Start using your new name.",
      "content": "Start using your new name. For the first few months you'll probably have to deal with some confusion on the part of people who aren't aware you changed your name. Start introducing yourself with your new last name, signing checks and other documents with your new last name, and politely asking people to use it when they address you."
    },
    {
      "title": "Choose your new name carefully.",
      "content": "Choose your new name carefully. Legally changing your name is a serious decision, so you should make sure that you choose a name that you like enough to keep. Before beginning the process of changing your name, practice signing it and have a few people close to you call you by that name, to make sure you like it. You can change your first name, middle name, last name, or all of the above. [8] X Research source"
    },
    {
      "title": "Make sure your new name will be legal.",
      "content": "Make sure your new name will be legal. The primary concern here is that your new name doesn't imply \"fraudulent intent\" (i.e. that you aren't trying to gain some benefit by misleading others about your identity), [9] X Research source as this will prevent you from being able to legally change it. There are, however, several reasons why you might be denied a name change, including any of the following: [10] X Research source You're avoiding bankruptcy by pretending to be someone else. Your new name violates a trademark (e.g. trying to name yourself \"Chuck E. Cheese\" or \"Adidas Batman\"). The name uses numbers or symbols (except Roman numerals). The name includes obscene words. If you are having trouble determining if your name change is legal, or need legal assistance with this process, hire an attorney. Legal self-help centers are often available to help with name changes, and legal fees may be waived if sufficient financial need is demonstrated. Search online to see what legal aid resources are available in your community."
    },
    {
      "title": "Fill out a petition.",
      "content": "Fill out a petition. Most states require you to fill out a petition explaining your reasons for wanting to change your name. Go to the courthouse or your state's courts website to obtain the proper forms and learn all the requirements in your jurisdiction. [11] X Research source The petition will be submitted to a judge, so make sure it explains your reasoning completely and correctly. For example, in California, you must fill out forms NC-100 , NC-110 , NC-120 , and CM-010 . [12] X Research source Other states may have different requirements. For instance, in Florida, you must undergo fingerprinting and state and federal criminal background checks as well. If you're changing your name because of a divorce, contact your divorce lawyer. He or she may be able to help you expedite the process, since changing a name for this reason is quite common. Sometimes it can even be included in the divorce decree. If you're an immigrant, ex-convict, or attorney, you'll probably need an affidavit of service of notification to authorities in addition to your petition. This shows that any relevant authorities have been alerted to your proposed name change. For example, attorneys must be licensed under their legal names, so if an attorney changes his or her name, that license must reflect the change."
    },
    {
      "title": "File your petition with your local civil court.",
      "content": "File your petition with your local civil court. Visit your local civil court in person to file the petition with a clerk, or file by mail if that is allowed in your state. Bring two copies of each form. The clerk will stamp both with a “Filed” stamp and return one copy to you for your records. [13] X Research source The clerk will give you a court date, which you should make sure you can attend. Check your local court's website to determine if your petition must be submitted in person, and to determine the hours that they are open for such business. In some jurisdictions, you will need to have your petition notarized or signed by a court clerk before filing. [14] X Research source Once you're finished filling it out, take it back to the courthouse to have it notarized or signed. You can also have it notarized at a bank or other notary public."
    },
    {
      "title": "Pay your filing fee.",
      "content": "Pay your filing fee. Most states will also have filing fees involved with the petition process. In California, you can expect to pay a total of approximately $435. [15] X Research source In Florida, as another example, the fees are estimated at $401."
    },
    {
      "title": "Publish your name change.",
      "content": "Publish your name change. Some states require that you publish your new name for a number of weeks in approved general circulation newspapers. [16] X Research source This gives any member of the public a chance to object to your name change if, for example, you owe debt under your current name. The specific amount of time for which you must publish the notice varies by state. In California, applicants must publish for four consecutive weeks, [17] X Research source whereas New Mexico only requires two consecutive weeks. [18] X Research source Some states may not even have such a publication requirement. Some states allow you to simply post in a public place such as a designated bulletin board at the courthouse."
    },
    {
      "title": "Attend your hearing.",
      "content": "Attend your hearing. Most name-change hearings are fairly straightforward. If the judge asks you any questions about your reasons for changing your name, answer clearly and honestly. If you live in a state with a publication requirement, bring copies of the publication to prove you met the requirement. [19] X Research source In some states you will be expected to present a prepared testimony explaining your name change. Arrive at your hearing 15 to 20 minutes early, just in case. If the judge denies your request, get a copy of the denial and try again. If the judge approves your request, you'll be granted a name change court order, probably given to you by your local civil court clerk. Make a copy for your records."
    },
    {
      "title": "Get a new social security card and driver's license.",
      "content": "Get a new social security card and driver's license. Take your court order to the Social Security Administration, or mail in a certified copy. Make sure you also have your birth certificate, photo ID (driver's license, passport, or state ID) and a completed application for a new Social Security card, available online. [20] X Trustworthy Source Social Security Administration Independent U.S. government agency responsible for the administration and management of Social Security Go to source You should get your new card in the mail 10 days after your request was processed (either the date you visited SSA in person or the date listed on your receipt). Once you've received your new Social Security card, take it to your local DMV, along with your court order and your old driver's license or state ID. They will issue you a new ID that reflects the name change."
    },
    {
      "title": "Change your name on all your other documentation.",
      "content": "Change your name on all your other documentation. Here's a short list of what you might consider: [21] X Research source Bank accounts Credit cards Leases or mortgages Car title Voter registration Medical offices Post office boxes Passport"
    },
    {
      "title": "Start using your new name.",
      "content": "Start using your new name. Introduce yourself with your new name and use it to sign checks and other documents."
    },
    {
      "title": "Fill out the relevant court forms.",
      "content": "Fill out the relevant court forms. In addition to the steps in Method 2, most states require additional steps if you want to change both your name and gender legally. Many states require a Change of Name and Gender form in addition to the state’s standard petition or order for a name change. [22] X Research source For example, in California, applicants must fill out Form NCC-200 in addition to the standard name-change document Form NC-110 . [23] X Research source Other documents vary by state. Look into your local laws."
    },
    {
      "title": "Have a doctor fill out an affidavit telling the court that you have undergone clinically appropriate treatment for change of gender.",
      "content": "Have a doctor fill out an affidavit telling the court that you have undergone clinically appropriate treatment for change of gender. Most states require a licensed physician to provide documentation that you have undergone the respective change of gender. Your doctor may be able to write his or her own note or use a form provided from the state. [24] X Research source In California, for instance, your physician can use the Declaration of Physician Attachment, which is officially Form NC-210. [25] X Research source Each state has different requirements for what constitutes change of gender. In California, Oregon, Washington, Vermont, and Washington, D.C., the clinical treatment does not necessarily need to be surgical. [26] X Research source"
    },
    {
      "title": "Receive your decree from the court.",
      "content": "Receive your decree from the court. You’ll still file your forms in your jurisdiction’s civil court and attend your hearing as with Method 2. If the judge approves your request, then you will receive a court order allowing you to change not just your name but also your gender on state-issued documents. [27] X Research source"
    },
    {
      "title": "Change your name and gender on legal documents.",
      "content": "Change your name and gender on legal documents. Again, each state differs on its approach to changing your name and gender when it comes to legal documents. Some states may not even allow a change of gender on particular documents. For example, in California you do not need a court-ordered gender change to change your driver's license or birth certificate. Other states, such as Ohio, Idaho, and Tennessee, do not allow gender changes to birth certificates at all. [28] X Research source For a federal document, such as a social security card, you must provide a court-ordered name change document in order to be issued a new card. Gender details do not appear on social security cards, but to change you gender filed with the Social Security Administration, you can show a state-issued amended birth certificate, a physician’s letter certifying clinical treatment, or a ten-year U.S. passport showing the appropriate gender marker. [29] X Research source To receive a ten-year U.S. passport, your ID and passport photo must resemble your current appearance, and you must submit a letter from a physician certifying that you have completed your transition. [30] X Research source"
    }
  ]
}