{
  "url": "https://www.wikihow.com/Apply-Stage-Makeup-to-Look-Old",
  "title": "How to Apply Stage Makeup to Look Old",
  "steps": [
    {
      "title": "Choose a sallow-toned foundation.",
      "content": "Choose a sallow-toned foundation. For stage makeup, cream or pancake makeup works best. Select a shade that matches your skin tone, but look for an option with yellow or gray undertones. That will give your complexion a sallow look, which can help you appear older. If you can’t tell whether a foundation has yellow or gray undertones, try holding it up against a white piece of paper or fabric to look for any yellow or gray tones. If you still can’t tell, ask a sales clerk at the store for help. You can even use liquid latex or Elmer's glue to add texture and wrinkles. [1] X Expert Source Nini Efia Yang Makeup Artist Expert Interview. 27 August 2019."
    },
    {
      "title": "Stipple the foundation onto your face.",
      "content": "Stipple the foundation onto your face. Dip a brush or damp makeup sponge into the foundation, but instead of blending it over your face, use a stippling motion, which involves bouncing the brush or sponge over the skin to apply it. That will emphasize your skin’s pores and natural texture, so it appears rougher and older."
    },
    {
      "title": "Blend a darker foundation where you want to create creases.",
      "content": "Blend a darker foundation where you want to create creases. Choose a cream foundation that’s one to two shades darker than your skintone to create depth for the creases that you’ll create. Use a small brush to smooth the dark foundation over areas that you want to add wrinkles, such as your forehead, beside your eyes, or the creases from the sides of your nose to your mouth. [2] X Research source Keep your skin flat as you apply the darker foundation. Use a clean finger to blend the edges of the foundation in well so the transition is seamless."
    },
    {
      "title": "Set the foundation with powder.",
      "content": "Set the foundation with powder. Use a loose translucent powder to set the darker foundation in the areas that you’ve applied it. Press it lightly over the spots with a small powder brush to lock the makeup in place. [3] X Expert Source Nini Efia Yang Makeup Artist Expert Interview. 27 August 2019. [4] X Research source"
    },
    {
      "title": "Smile and apply a lighter foundation over the dark base.",
      "content": "Smile and apply a lighter foundation over the dark base. With the dark makeup set on your face, smile in an exaggerated fashion to create creases around your eyes, across your forehead, any anywhere else you applied the dark base. Use a small makeup sponge to pat a cream foundation that’s one to two shades lighter than the your skin tone over the dark foundation in the creases that form when you smile. [5] X Research source For the best results, be sure to use a clean sponge to pat on the makeup. Don’t rub it on either, or you won’t get the proper effect. If you need the effect to be very dramatic for a performance in a large theater, use dark and light foundation shades that are more than a couple of shades darker or lighter than your skin tone."
    },
    {
      "title": "Powder all over your face to set the makeup.",
      "content": "Powder all over your face to set the makeup. After you’ve applied the light foundation to highlight the creases and wrinkles, dust the same translucent powder you used to set the darker foundation over your entire face to lock all of the makeup in place. Don’t worry about applying too much powder; it will only give your face more texture so it appears rough and old. [6] X Research source"
    },
    {
      "title": "Shadow the arch of the nose and highlight the center.",
      "content": "Shadow the arch of the nose and highlight the center. The small indentation between your eyebrows at the top of your nose is known as the superciliary arch, and it tends to get darker as your age. Use a small shadow brush to dust a brown shadow over the arch, and dust a light highlight shade down the center of the nose to create the narrowing that usually occurs as you get older. For shading and highlighting your face to appear older, always use matte powders. Shimmery shades won’t look natural. Choose a brown powder for shading that has gray undertones to create the most natural look."
    },
    {
      "title": "Contour beneath your cheekbones.",
      "content": "Contour beneath your cheekbones. As you get older, you usually use volume in the face so your cheeks take on a sunken appearance. To mimic the look, use a small contour brush to apply the same brown powder you used on the arch of your nose beneath your cheekbones to make your face look more angular. While you should blend out the edges of the contour line so it doesn’t just look like a stripe on your cheek, you should apply it more heavily than you would if you were contouring for every day. That will help it stand out when you’re on stage."
    },
    {
      "title": "Add brown powder to the creases from your nose to your mouth.",
      "content": "Add brown powder to the creases from your nose to your mouth. As you age, the loss of volume in your face makes the creases that run from either side of the nose down to the mouth, or the nasolabial folds, become much more pronounced. Use a small fluffy brush to dust the brown contour powder through them so they look deeper. [7] X Research source As with the cheek contour, you should blend the edges of the nasolabial fold lines well but still leave the shading dark and pronounced. You can make the nasolabial fold lines appear even deeper by using the matte highlight shade over the top lip and blending it out to the creases. You may also want to add a little of the brown powder to the corners of your mouth, so it looks like it’s starting to droop."
    },
    {
      "title": "Dust some contour powder across the center of the chin.",
      "content": "Dust some contour powder across the center of the chin. The chin is another area that usually gets more angular as you age. Mimic the look by using a small fluffy brush to dust the brown contour powder through the groove or crease in the center of your chin fold added shadow. Applying a dusting of the light highlight shade to the bottom part of your chin can help make it look even more angular."
    },
    {
      "title": "Use a brown powder beneath your eyes.",
      "content": "Use a brown powder beneath your eyes. With a fluffy eyeshadow brush, apply some of the brown powder beneath your eyes. Start at the inner corner and blend the powder into the natural groove there. That will help your eyes appear more sunken, emphasize fine lines, and give you a more tired look. [8] X Research source While you can use the same matte brown contour powder that you used on the rest of the face, you may want to opt for a brown with reddish undertones beneath the eye. The skin around the eyes -- and the corners of the nose -- often gets red as you age so that can help you appear older."
    },
    {
      "title": "Blend foundation over your lips.",
      "content": "Blend foundation over your lips. To emphasize the cracks and dryness in your lips, it helps to add a little foundation over them. Dot a small amount of the foundation you use on your face on a clean finger and gently it pat it over your lips. Blot with a tissue afterward to ensure that your lips appear dry. [9] X Research source"
    },
    {
      "title": "Brush gray shadow through your brows.",
      "content": "Brush gray shadow through your brows. While a gray wig can help make you appear older, you’ll need to do some work on your eyebrows. Use an angled brow brush to apply a gray powder to your brows so the color appears faded. You can use a gray brow pencil or pomade if you prefer. [10] X Research source A white brow powder, pencil, or pomade can also work well. If you don’t have a wig to wear, you can also brush some of the powder through your roots to make yourself appear older."
    },
    {
      "title": "Black out your teeth.",
      "content": "Black out your teeth. Depending on the character that you’re playing, you may look more convincing as an older person if you fake one or more missing teeth. Use black tooth makeup wax to cover a couple of your front teeth so it appears that they’ve been lost due to old age. Be sure to use a product designed for use on the tooth. Eyeliners and other makeup may stain your teeth and may not be safe for use in the mouth."
    }
  ]
}