{
  "url": "https://www.wikihow.com/Build-an-EMP-Generator",
  "title": "How to Make an EMP Generator from a Disposable Camera",
  "steps": [
    {
      "title": "Understand the type of EMP device you’re building.",
      "content": "Understand the type of EMP device you’re building. You are not able to create the type of EMP you saw in the Matrix movies or Ocean’s 11 . Those would require millions of dollars to build. This type of electromagnetic pulse generator works best for small electronics. [1] X Research source Using an EMP outside of your home or on any device owned by someone else is functionally illegal. Do not build an EMP device to use on others. [2] X Research source Warning: Do not use an EMP if you or anyone around you has a pacemaker or relies on a medical device to stay alive. An EMP may disable medical devices. [3] X Research source"
    },
    {
      "title": "Gather the supplies you need.",
      "content": "Gather the supplies you need. For this EMP you are going to take the circuit board and capacitor out of a disposable camera . [4] X Research source The other key supplies you need are a: Soldering iron Enamel-coated wire On/off switch Basic tape Flathead screwdriver Pliers Core wire Wire strippers Sandpaper A circular object about 2 inches (5.1 cm) in diameter. [5] X Research source"
    },
    {
      "title": "Be safe and don’t do this without a parent’s permission.",
      "content": "Be safe and don’t do this without a parent’s permission. If you’re under the age of 18, ask a parent for help before you start. You are dealing with high-voltage equipment and may get shocked if you aren’t careful. When removing the capacitor in particular, be cautious. It’s also recommended to use a |multimeter to gauge voltages and a battery holder to avoid exposing yourself to shocks. [6] X Research source Wear rubber gloves to avoid transferring any shocks you may run into through your body. A multimeter is a tool that measures the electric voltage of a circuit. You don’t need one, but it will tell you the voltage of your capacitor."
    },
    {
      "title": "Pry the case of a camera open using the edge of a screwdriver.",
      "content": "Pry the case of a camera open using the edge of a screwdriver . Stick the head of your screwdriver in between the two halves of your disposable camera and apply a light amount of force until the case pops open. Be careful not to touch the circuit board or any metal parts inside. [7] X Research source You can use any disposable camera for this so long as it has a flash mechanism. The cheaper the better, too. A nicer disposable camera may be harder to open."
    },
    {
      "title": "Slip on a pair of rubber gloves for safety.",
      "content": "Slip on a pair of rubber gloves for safety. You'll be dealing with the potential of getting a painful shock if you accidentally touch the flash capacitor, which carries about 180-300 volts. It’s not enough to seriously injure you most of the time, but it’s better to be safe than sorry. [8] X Research source The 180-300 volt shock you could get may be potentially dangerous if you have any kind of heart condition."
    },
    {
      "title": "Locate the capacitor feeding into the flash.",
      "content": "Locate the capacitor feeding into the flash. The capacitor is usually a black cylinder about the size of a small battery with two leads coming out of the bottom. This is the capacitor. Capacitors store electrical charges and release them when triggered. Disposable cameras need capacitors for the flash function."
    },
    {
      "title": "Discharge the capacitor with any rubber-insulated tool.",
      "content": "Discharge the capacitor with any rubber-insulated tool. Use an instrument with an insulated end to avoid getting shocked (a screwdriver or channel lock with an insulated grip is perfect). Slide the tool’s tip against one of the exposed metal pieces by the flash to discharge the capacitor’s remaining electrical current. You should hear a quick pop and/or a small spark. [9] X Research source Once the initial spark has gone off, you shouldn’t need to redo this. As you remove the board, continue checking the soldered sealants on the circuit board by the capacitor. Capacitors store electrical charges, so you have to discharge it to ensure there’s no juice left before you hook it back up."
    },
    {
      "title": "Remove the circuit board and capacitor by hand.",
      "content": "Remove the circuit board and capacitor by hand. After carefully taking apart the walls of the disposable camera, remove the board and capacitor by hand. Mark on the battery holder which side is positive and negative with a marker. You’ll be able to tell because there should already be a battery in the machine. [10] X Research source Remove the battery from the device for now. The battery holder is connected to the circuit board. You don’t need a separate power source."
    },
    {
      "title": "Cut 2 lengths of wire and strip the ends.",
      "content": "Cut 2 lengths of wire and strip the ends. Locate your wire and cut it to the desired length. You don’t want too much slack, so anything from 3–12 inches (7.6–30.5 cm) will work. This wire will connect the switch to the capacitor. Strip the ends of each wire from the rubber casing. [11] X Research source"
    },
    {
      "title": "Solder the wire to the capacitor.",
      "content": "Solder the wire to the capacitor. Solder the wire to one of the two terminals of the capacitor. Use a quality soldering gun to avoid a messy circuit board. Solder a blob of lead-free rosin core to the surface. Then, heat the wire to the blob with your soldering gun. [12] X Research source The resin should dry quickly to a firm connection."
    },
    {
      "title": "Attach the switch to the capacitor.",
      "content": "Attach the switch to the capacitor. Take the wire you just soldered to the capacitor and attach it to the “off” side of the switch by joining the wires. Either solder the wire onto the switch or wrap the exposed wire end around one of the screwable ports on the switch. [13] X Research source"
    },
    {
      "title": "Prepare the ignition.",
      "content": "Prepare the ignition. Wrap a strip of tape around whatever small circular object you’re using with the adhesive side facing outward. Now, take the enamel-coated wire and wrap it 7-15 times around the tape. Leave at least 1–2 inches (2.5–5.1 cm) of wire out on each end to attach to the terminals. Don’t overlap any of the coil lengths. Take your time and be precise. Make sure the wire is snug and that there aren’t any spatial gaps. [14] X Research source Coat the finished wiring with tape so it’s secure. Slide the wire and tape off of the object. Cut the terminals of the coils to the desired length, but make sure you leave yourself enough room to work with."
    },
    {
      "title": "Remove the enameled coat from the ends of the wire.",
      "content": "Remove the enameled coat from the ends of the wire. Use a sheet of sandpaper to gently file down the ends of the wire to remove the enamel coat. This will create a stronger bond between the individual components. [15] X Research source"
    },
    {
      "title": "Solder the coil to the capacitor.",
      "content": "Solder the coil to the capacitor. Attach a strand of coil to the remaining terminal of the capacitor. Use care and don’t create a mess. Use the same resin you used before to connect the coil and capacitor. [16] X Research source \\"
    },
    {
      "title": "Attach the coil to the other side of the switch.",
      "content": "Attach the coil to the other side of the switch. Connect one of the leads of the coil to the other “on” terminal of the switch. You should now have a loop of coil connecting the capacitor to the switch. [17] X Research source Reinsert the battery in the circuit board when you’re done."
    },
    {
      "title": "Fire the device on something small to test it.",
      "content": "Fire the device on something small to test it. Use a fresh battery or confirm the old battery works by sticking it in another device. Then, test your new EMP device on a handheld video game, alarm clock, or calculator. Insert the electronic device into the circular coil and flip the EMP switch to see if it shuts off. [18] X Research source You can only target items by placing them inside of the coil or directly against the end of the opening. However, objects near the outside of the coil will also likely be damaged. Newer electrical devices are sometimes insulated to protect them from EMP charges, so they may not shut off."
    }
  ]
}