{
  "url": "https://www.wikihow.com/Check-a-California-Licensed-Contractor",
  "title": "How to Check a California Licensed Contractor",
  "steps": [
    {
      "title": "Visit the CSLB's website.",
      "content": "Visit the CSLB's website. In California, a contractor needs to hold a valid CSLB license if they are agreeing to do work on a project that is valued at $500 or more for combined labor and materials. [1] X Research source The first step in finding a qualified contractor is to check their license. Start by visiting the CSLB website, which can be found at http://www.cslb.ca.gov/ ."
    },
    {
      "title": "Use their \"Check a License\" tool.",
      "content": "Use their \"Check a License\" tool. From the CSLB's main page, hold your mouse over the link titled \"Consumers\" and click the button that reads \"Check a License.\" This tool allows you to search and view important information about any contractor in the state of California. The \"Check a License\" tool can be found at https://www2.cslb.ca.gov/OnlineServices/CheckLicenseII/CheckLicense.aspx ."
    },
    {
      "title": "Search using any number of references.",
      "content": "Search using any number of references. You can look up a contractor's license by using their license number, business name, personal name, Home Improvement Salesperson (HIS) name, or HIS number. [2] X Research source Click on the method you wish to use and enter the information in the box on the website. Once you search, you will need to sift through a number of responses in order to find your company. Be as specific as possible so there are fewer results to your search. For example, if you search for someone's personal name, you may get hundreds of results you will have to go through. On the other hand, if you search for the contractor's license number, you should only get one result. All of this information should be readily available to you. If a contractor is not willing to give you his license number, it should be a red flag. If you do not get any of this information immediately, ask the contractor so you can conduct your search."
    },
    {
      "title": "Analyze the results.",
      "content": "Analyze the results. When you find the correct result, click on the license number to read their business information. The results will tell you whether the contractor's license is active, inactive, expired, suspended, or cancelled. Verify when the contractor obtained a license and what type of construction work they are licensed to perform. You should always look to hire a contractor who has an active license and has been in business for at least 5 to 10 years. Do not ever hire a contractor that does not have an active license."
    },
    {
      "title": "Call CSLB if you do not have an internet connection.",
      "content": "Call CSLB if you do not have an internet connection. If you are unable to connect to the internet, you can still check with the CSLB in order to verify a contractor's license. To do so, simply call (800) 321-CSLB (2752). The CSLB call center will be able to help you verify a license 24 hours a day, seven days a week. When you call, have a pen and paper available to write down all of the information you need. If you are speaking to a real person and not the automated system, feel free to ask any question you may have. If they are unable to answer it, they will find the answer and call you back. [3] X Research source"
    },
    {
      "title": "Use the CSLB website.",
      "content": "Use the CSLB website. The CSLB website is also a great tool for investigating a contractor's complaint history. When you are analyzing your search results using the \"Check a License\" function, you will be able to see some types of complaints if they have been made against the company. Look at the disclaimer at the top of each result to get an idea of what can and cannot be made public on the CSLB website. If the entity is subject to public disclosure laws, there will be a link in their result that will take you to any complaints they have had. CSLB will only show construction related judgments. Arbitrations are not listed unless the contractor failed to follow some part of the agreement."
    },
    {
      "title": "Check with the Better Business Bureau (BBB).",
      "content": "Check with the Better Business Bureau (BBB). To help supplement the information you find on the CSLB website, you should also check with the BBB for a contractor's history of complaints. The BBB is an organization that sets business standards and accredits businesses. They also take complaints and post them on their website. To check the BBB database, simply visit their website and type in the business's name and location. You can find the search function at https://www.bbb.org/ . Once you find your contractor on their website, you will be able to look at past complaints against that company, as well as customer reviews of that company."
    },
    {
      "title": "Examine online reviews.",
      "content": "Examine online reviews. You can also check with other reliable online sources in order to get an idea of a contractor's honesty, work ethic, and quality of craftsmanship. You can use sites like Angie's List, Yelp, and HomeAdvisor to help you make an informed decision. Each of these sites, and others, will allow you to search for your contractor and read reviews about their service. Be aware that some sites require you to pay for their services. Try using free resources before you pay money. Most of the time you will be able to gather all the information you need without having to spend anything."
    },
    {
      "title": "Inspect public records.",
      "content": "Inspect public records. If a contractor has a judgment or lien against them, you may be able to find records of those things. You can do a public records search online using the State of California website. Use this website to look for any information you can about the contractor. This might include lawsuits, liens, bond data, and insurance data."
    },
    {
      "title": "Ask the contractor for personal references.",
      "content": "Ask the contractor for personal references. If everything else checks out, ask the contractor for two or three professional references. These references should be past employees, employers, educators, or clients. Call these references and ask for details about the contractor. If you are calling past employees or employers, ask about their work ethic, craftsmanship, and ability to get the job done on time and on budget. If you are past clients, ask about their overall experience. Be sure they had an experience you would want to have. Ask if you can see the work in person. Carefully inspect the work quality if the reference allows you to visit."
    },
    {
      "title": "Verify the contractor's location and contact information.",
      "content": "Verify the contractor's location and contact information. Using the CSLB website and their \"Check a License\" tool, you will be able to see a contractor's work address and contact information. Use that information to visit their office and call them on the phone. When you visit their office, make sure they maintain a professional work space. You should be weary if their office is always closed or if you cannot find an address at all. In addition, call them and email them to make sure they respond to your inquiries in a timely manner. You do not want to hire a contractor who will not respond to your questions or concerns. [4] X Research source"
    },
    {
      "title": "Examine a contractor's insurance coverage.",
      "content": "Examine a contractor's insurance coverage. You can also use the CSLB website to make sure the contractor you are looking at is bonded and insured. You can ask to see the contractor's certificate of insurance. In California, a contractor who has employees is required to have workers' compensation insurance. While commercial general liability insurance is not required by state law, you should find a contractor who has it. It will protect you in case there is any damage to your property while work is being done. In addition, California licensed contractors are required to have a contractor license bond. This type of bond covers any project the contractor agrees to perform. However, they are only required to have a bond of $15,000. This will often not cover everything if something goes wrong. [5] X Research source"
    }
  ]
}