{
  "url": "https://www.wikihow.com/Access-Google-Assistant",
  "title": "How to Access Google Assistant",
  "steps": [
    {
      "title": "Enable Google Assistant.",
      "content": "Enable Google Assistant. If you haven't already done so, you'll need to enable Google Assistant before you can start using its commands. To do this: Open the Google app, which is the rainbow \"G\" icon in your app drawer. Tap the More option at the bottom-right corner. Tap Settings . Tap Google Assistant . If the Assistant is not enabled, tap TURN ON at the bottom-right corner."
    },
    {
      "title": "Press and hold the Home button or say \"OK Google.\"",
      "content": "Press and hold the Home button or say \"OK Google.\" This opens the Google Assistant window. The assistant will begin listening to your command. [1] X Research source If you're using a Google Pixel 2, 3, 3a, or 4, you can even open Google Assistant by squeezing the bottom half of your phone."
    },
    {
      "title": "Ask a question or say a command.",
      "content": "Ask a question or say a command. Commands can be anything from \"Set an alarm for 6AM\", or \"Show my stocks for today.\" If you don't want to use your voice, tap the keyboard icon at the bottom to open the on-screen keyboard, and then type your question or command instead. If you use your voice to interact with Google Assistant, the response will be audible, but you'll also see the results on the screen. If you used the keyboard option, the results will only be displayed on the screen."
    },
    {
      "title": "Tap the result(s) to view more information.",
      "content": "Tap the result(s) to view more information. The information you'll see will vary depending on how you're using Google Assistant. For example, you may be presented with a web link that gives more details about your question."
    },
    {
      "title": "Tap the Explore tab to do more with Google Assistant.",
      "content": "Tap the Explore tab to do more with Google Assistant. It's the compass icon at the bottom-right corner of the screen. This section lets you do more with Google Assistant on your Android—browse the categories to learn commands to try, or search for specific commands using the Search bar at the top of the page. You can also quickly access your Google Assistant settings from the Explore section—just tap the three-dot menu at the top-right corner of the screen, select Settings , and then tap the Assistant tab to customize your preferences. If you want to learn how to train Google Assistant to better recognize your voice, check out How to Use OK Google on Android."
    },
    {
      "title": "Download the Google Assistant app.",
      "content": "Download the Google Assistant app. You can download the Google Assistant app from the App Store using the following steps. Open the App Store app. Tap Search . Type \"Google Assistant\" in the search bar. Tap Get next to Google Assistant."
    },
    {
      "title": "Open the Google Assistant app.",
      "content": "Open the Google Assistant app. It's the app that has an icon with four different colored dots. You can open Google Assistant by tapping the app on the home screen, or by tapping \"Open\" in the App Store after the app is downloaded. If you haven't already done so, sign in to Google Assistant using the email address and password associated with your Google account."
    },
    {
      "title": "Navigate through the setup screens.",
      "content": "Navigate through the setup screens. The first time you set up Google Assistant, you'll be shown some legal information and be asked to give the app permission to display notifications. Follow the on-screen instructions to move through these screens and allow or deny permissions as needed."
    },
    {
      "title": "Say \"Ok Google\" or tap the microphone icon.",
      "content": "Say \"Ok Google\" or tap the microphone icon. The microphone icon is at the bottom of the screen in the center. Google Assistant will start listening for your question or inquiry. The first time you activate voice assistance, you'll be prompted to give the app permission to access your microphone. Tap OK to continue. If you prefer not to use your voice, tap the keyboard icon at the bottom of the screen instead."
    },
    {
      "title": "Ask a question or say a command.",
      "content": "Ask a question or say a command. Commands can be anything from \"Set an alarm for 6AM\", or \"Open www.wikihow.com\". If you use your voice to interact with Google Assistant, the response will be audible, but you'll also see the results on the screen. If you used the keyboard option, the results will only be displayed on the screen."
    },
    {
      "title": "Tap the result(s) to view more information.",
      "content": "Tap the result(s) to view more information. The information you'll see will vary depending on how you're using Google Assistant. For example, you may be presented with a web link that gives more details about your question."
    },
    {
      "title": "Tap the Explore tab to do more with Google Assistant.",
      "content": "Tap the Explore tab to do more with Google Assistant. It's the compass icon at the bottom-right corner of the screen. This section lets you do more with Google Assistant. Browse the categories to learn commands to try, or search for specific commands using the Search bar at the top of the page."
    },
    {
      "title": "Set your language for Google Assistant.",
      "content": "Set your language for Google Assistant. Google Assistant needs to know which language to listen for, so start by specifying your language: Navigate to Settings and press the center key to select it. Navigate to Change Language and press the center key. Navigate to your language and press the center key."
    },
    {
      "title": "Press and hold the center key to activate Google Assistant.",
      "content": "Press and hold the center key to activate Google Assistant. After about 2 seconds of pressing the button, colored dots will appear on the screen to indicate that Google Assistant is listening."
    },
    {
      "title": "Ask a question or say a command.",
      "content": "Ask a question or say a command. After a few moments, Google Assistant will say and/or and display the results of your search. For example, saying \"What's the weather like in Toronto?\" will display information about Toronto's current weather. If you ask the definition of a word, you'll typically hear the definition spoken aloud by the assistant as well as see it displayed on the screen."
    },
    {
      "title": "Use Google Assistant to send an SMS text message.",
      "content": "Use Google Assistant to send an SMS text message. If you'd like to use your voice to compose a text message to one of your contacts, you can do so using Google Assistant: Press and hold the center button to activate Google Assistant. Say, \"SMS [the name of the contact you want to text].\" Use the arrow keys to scroll to the correct contact and press the center key to select. Press the center key to activate the microphone. Speak the content of your message aloud. When you stop speaking, the contents of your message will display on the screen. Read over the message before it sends. To prevent it from sending, select Cancel . If you're okay with sending the message, you don't have to select anything."
    }
  ]
}