{
  "url": "https://www.wikihow.com/Block-Ads",
  "title": "How to Block Ads - Choices for Browsers, iPhone, Android",
  "steps": [
    {
      "title": "Click the link that corresponds to your web browser.",
      "content": "Click the link that corresponds to your web browser. uBlock Origin works as an extension for your web browser. uBlock Origin is a multi-purpose blocker that can block ads, trackers, and malware sites. [1] X Research source Click on one of the following links to navigate to the download page for the web browser you are currently using: Google Chrome Firefox Microsoft Edge Safari Opera"
    },
    {
      "title": "Add the extension to your browser.",
      "content": "Add the extension to your browser. This way this is done is different for each web browser. Use the following instructions for the web browser you are using: Google Chrome: Click the blue button that says Add to Chrome . Click Add Extension in the pop-up at the top of the screen. Firefox: Click the blue button that says + Add to Firefox . Click Add in the pop-up at the top of the page. Microsoft Edge: Click the blue button that says Get . Click Open in Microsoft Store . Click Get in the Microsoft Store window. Safari (MacOS) Click Install Extension Opera: Click the green button that says + Add to Opera ."
    },
    {
      "title": "Click the uBlock Origin icon.",
      "content": "Click the uBlock Origin icon. It's the icon that resembles a burgundy colored shield that says \"uo\" in the middle. It's in the upper-right corner of your web browser. This displays the uBlock Origin controls. Here you can either allow ads and pop-ups for the current site your are on, or block all pop-ups for the current site you are on. To allows pop-ups for the site you are on, click the icon. When the icon is grey, pop-ups and ads are allowed for the site you are currently viewing. To block all pop-ups for the site you are on, click the icon that resembles two sheets of paper. It's in the lower-left corner of the uBlock controls."
    },
    {
      "title": "Navigate to https://adguard.com using a web browser.",
      "content": "Navigate to https://adguard.com using a web browser. You can use any web browser on your Android device. You cannot get the full version of AdGuard from the Google Play Store."
    },
    {
      "title": "Tap Download.",
      "content": "Tap Download . It's the green button at the bottom of the page. This downloads the AdGuard apk file. You may be informed that installing these kinds of files can be harmful to your phone. Tap Ok ."
    },
    {
      "title": "Tap the Menu icon.",
      "content": "Tap the Menu icon. Depending on which web browser you are using, this may be an icon with three dots (\"…\" or \"⋮\"), or an icon with three horizontal lines (☰). It is typically located in the upper-right corner or lower-right corner."
    },
    {
      "title": "Tap Downloads.",
      "content": "Tap Downloads . It's in your web browsers menu. This displays a list of downloads you downloaded through your web browser."
    },
    {
      "title": "Tap the \"adguard.apk\" file.",
      "content": "Tap the \"adguard.apk\" file. This installs AdGuard on your Android device . If you receive a pop-up that says your phone is not allowed to install files from unknown sources, tap the option in the pop-up that opens your Settings menu. Then tap the toggle switch next to \"Allow unknown sources\"."
    },
    {
      "title": "Tap Install.",
      "content": "Tap Install . This installs the AdGuard app using the APK file."
    },
    {
      "title": "Open AdGuard.",
      "content": "Open AdGuard. It has a green icon that is shaped like a shield that has a checkmark in the middle. Tap the icon on your home screen or apps menu to open the app, or tap Open in the lower-left corner after the app is installed."
    },
    {
      "title": "Tap Continue.",
      "content": "Tap Continue . It's the green button at the bottom of the screen. This starts the quick setup process."
    },
    {
      "title": "Tap Block them.",
      "content": "Tap Block them . It's the green button at the bottom of the page."
    },
    {
      "title": "Select your privacy level.",
      "content": "Select your privacy level. \"Comfortable\" is the only option available with the free version of AdGuard. It blocks all known analytics and lower third-party cookie lifetimes. \"High\" and \"Ultimate\" have more features to block your web browser from tracking you. These options are only available on the Premium version of the app."
    },
    {
      "title": "Tap Hide Them.",
      "content": "Tap Hide Them . It's the green button at the bottom of the app."
    },
    {
      "title": "Tap the \"x\" icon to close the ad.",
      "content": "Tap the \"x\" icon to close the ad. If you do not wish to sign up for AdGuard Premium, tap the \"x\" icon in the upper-right corner to close the ad."
    },
    {
      "title": "Tap the toggle switch .",
      "content": "Tap the toggle switch . This enables ad protection. While AdGuard protection is on, your battery usage may not be properly reflected in the Settings menu."
    },
    {
      "title": "Open the App Store .",
      "content": "Open the App Store . It has a blue icon with a white \"A\" in the middle. Tap the icon on your home screen to open the App Store."
    },
    {
      "title": "Tap the Search tab.",
      "content": "Tap the Search tab. It's in the lower-right corner of the App Store. This displays a page with a search bar."
    },
    {
      "title": "Type AdGuard in the search bar.",
      "content": "Type AdGuard in the search bar. This displays a list of search results below the search bar."
    },
    {
      "title": "Tap AdGuard in the search results.",
      "content": "Tap AdGuard in the search results. This displays the app and other similar apps in the App Store."
    },
    {
      "title": "Tap GET next to AdGuard.",
      "content": "Tap GET next to AdGuard. It has an icon that resembles a green shield with a checkmark in the middle. There is a free version and a paid version of AdGuard in the App Store."
    },
    {
      "title": "Open AdGuard.",
      "content": "Open AdGuard. To open AdGuard, tap the icon on your home screen, or tap Open in the App Store once it finishes installing. When AdGuard first opens, allow about 30 seconds for it to load some settings into Safari."
    },
    {
      "title": "Open the Settings menu.",
      "content": "Open the Settings menu. It's the icon that has two silver gears. Tap the icon on your home screen to open the Settings menu."
    },
    {
      "title": "Scroll down and tap Safari.",
      "content": "Scroll down and tap Safari . It's next to an icon that resembles a blue compass. This displays the Settings for the Safari web browser."
    },
    {
      "title": "Scroll down and tap Content Blockers.",
      "content": "Scroll down and tap Content Blockers . It's the last option under the \"General\" heading."
    },
    {
      "title": "Tap the toggle switch next to AdGuard.",
      "content": "Tap the toggle switch next to AdGuard. The toggle switch should be green to indicate that it is active. This enables AdGuard in Safari."
    },
    {
      "title": "Open Safari.",
      "content": "Open Safari. Safari has an icon that resembles a blue compass. Tap the icon on your home screen or dock to open Safari."
    },
    {
      "title": "Tap the icon.",
      "content": "Tap the icon. The \"Share\" icon resembles a blue box with an arrow pointing up. It's in the upper-right corner of the Safari web browser. This displays the Share menu."
    },
    {
      "title": "Swipe all the way left and tap More… on the icons at the bottom.",
      "content": "Swipe all the way left and tap More… on the icons at the bottom. The icons at the bottom of the Share menu represent different actions you can take in Safari. Swipe all the way left on these icons and tap \"More\". It has an icon with three horizontal dots. This displays more actions you can enable."
    },
    {
      "title": "Tap the toggle switch next to AdGuard.",
      "content": "Tap the toggle switch next to AdGuard. This enables AdGuard as one of the actions you can tap in the Share menu. To manage elements on a page, open the Share menu. Then tap the AdGuard icon. Tap Block Element on this Page . Then tap Start . Tap the image or ad you want to block and tap the eyeball icon at the bottom of the page."
    },
    {
      "title": "Open Google Chrome .",
      "content": "Open Google Chrome . It's the icon that has a red, green, and yellow wheel, with a blue dot in the middle. Tap the icon on your home screen or apps menu or Google folder open Chrome for Android."
    },
    {
      "title": "Tap ⋮.",
      "content": "Tap ⋮ . It's the icon in the upper-right corner. This displays the menu to the right."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . It's near the bottom of the menu to the right."
    },
    {
      "title": "Tap Site settings.",
      "content": "Tap Site settings . It's the third option under the blue \"Advanced\" header."
    },
    {
      "title": "Tap Ads.",
      "content": "Tap Ads . It's near the bottom of the Site settings menu."
    },
    {
      "title": "Turn the toggle switch off .",
      "content": "Turn the toggle switch off . It's the only option on the ads menu. Turning this switch off blocks ads that are intrusive and misleading."
    },
    {
      "title": "Open Google Chrome .",
      "content": "Open Google Chrome . It's the icon that has a red, green, and yellow wheel, with a blue dot in the middle. Tap the icon on your home screen to open Google Chrome."
    },
    {
      "title": "Tap ….",
      "content": "Tap … . It's in the upper-right corner of the Google Chrome web browser. This displays the menu to the right."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . It's near the bottom of the menu to the right. It's next to an icon that resembles a gear."
    },
    {
      "title": "Tap Content Settings.",
      "content": "Tap Content Settings . It's near the bottom of the Settings menu. It's also next to an icon that resembles a gear."
    },
    {
      "title": "Tap Block Pop-ups.",
      "content": "Tap Block Pop-ups . It's the first option in the Content Settings menu."
    },
    {
      "title": "Turn the toggle switch on .",
      "content": "Turn the toggle switch on . This turns the pop-up blocker on, which blocks intrusive ads."
    },
    {
      "title": "Open the Settings menu.",
      "content": "Open the Settings menu. It's the icon that resembles two silver gears. Tap the icon on your home screen to open the Settings menu."
    },
    {
      "title": "Scroll down and tap Safari.",
      "content": "Scroll down and tap Safari . It's next to an icon that resembles a compass."
    },
    {
      "title": "Turn on the toggle switch next to \"Block pop-ups\".",
      "content": "Turn on the toggle switch next to \"Block pop-ups\". This turns the pop-up blocker on for the Safari web browser and blocks intrusive pop-up ads."
    },
    {
      "title": "Go to https://www.ghostery.com in a web browser.",
      "content": "Go to https://www.ghostery.com in a web browser. [2] X Research source This is the website for Ghostery. This browser extension prevents spyware from tracking your browsing habits. The Ghostery extension is a free download. It can be used with Firefox, Chrome, Opera, Safari, and Internet Explorer. Ghostery is widely used and highly trusted. They have compiled the most comprehensive database of trackers you will find anywhere on the web. The home page includes many useful resources to help you understand how spyware tracking works. The software itself lets you see who exactly is tracking you and why."
    },
    {
      "title": "Click Install Ghostery.",
      "content": "Click Install Ghostery . It's the purple button on the web page. This will activate the installation of the correct version on your browser."
    },
    {
      "title": "Add Ghostery to your browser extensions.",
      "content": "Add Ghostery to your browser extensions. Use the following steps to add Ghostery to your browser. Google Chrome: Click the blue Add to Chrome button at the top of the page. Click Add Extension . Mozilla Firefox: Click Allow in the pop-up. Click Add in the pop-up. Click Ok . Microsoft Edge: Scroll down and click the blue Get button. Click Get again. Click Install . Internet Explorer: Click Run at the bottom of the screen. Safari: Click View in Mac App Store . Click Get button in the App Store. Click Install app . Ghostery requires access to your website data, your tabs, and your browsing activity. See the Ghostery Privacy Statement for more info on how this data will be used. [3] X Research source"
    },
    {
      "title": "Click Start below \"Take a tour\".",
      "content": "Click Start below \"Take a tour\". It will automatically open in a new browser tab upon installation of the extension. This helpful tool explains what you need to know as it walks you through every step of customizing the extension’s various options and settings. Decide which configuration is best for you based on the information you find there. Click Next after each information slide, then click Done to complete the tutorial."
    },
    {
      "title": "Click Edit Setup.",
      "content": "Click Edit Setup . This walks you through the setup process. Adjust the settings on each page to fit your preferences and click Next\"'. Then click Done to finish the setup process."
    }
  ]
}