{
  "url": "https://www.wikihow.com/Beat-Lexaeus-(Data-Battle)-in-Kingdom-Hearts-II",
  "title": "How to Beat Lexaeus (Data Battle) in Kingdom Hearts II",
  "steps": [
    {
      "title": "Use Decisive Pumpkin.",
      "content": "Use Decisive Pumpkin. This keyblade has the unique ability Combo Boost, which let's you do more damage whenever you deal a blow on the enemy (combo). You can obtain Decisive Pumpkin if you defeat the Experiment at Halloween Town."
    },
    {
      "title": "Get Highest Ribbon.",
      "content": "Get Highest Ribbon. This will boost all your resistance by 25%, including physical damage resistance. Complete the Twilight puzzle to obtain Highest Ribbon."
    },
    {
      "title": "Get Ribbon.",
      "content": "Get Ribbon. Ribbon will boost all your resistance, including physical damage resistance. You can synthesize ribbon. Find the recipe at http://www.khwiki.com/Ribbon ."
    },
    {
      "title": "Get Full Bloom+.",
      "content": "Get Full Bloom+. This will add 3 points to Sora’s strength. Full Bloom+ is an upgrade of Full Bloom. You can synthesize both; find the recipes at http://www.khwiki.com/Full_Bloom+ ."
    },
    {
      "title": "Remove all of Donald's and Goofy's attack abilities.",
      "content": "Remove all of Donald's and Goofy's attack abilities. Lexaeus’ powers up every time you hit him with his shield up, this includes Donald's magic and Goofy running into him."
    },
    {
      "title": "Summon Genie at the beginning of the battle.",
      "content": "Summon Genie at the beginning of the battle. This will help you avoid all unnecessary attacks from Donald and Goofy; it also helps you with your health as Genie will continuously heal you."
    },
    {
      "title": "Place Reflega on your shortcuts.",
      "content": "Place Reflega on your shortcuts."
    },
    {
      "title": "Avoid his power charge.",
      "content": "Avoid his power charge. Lexaeus will blow Sora, Donald, and Goofy away with his aura while charging his power bar. Be sure to summon Genie as soon as Lexaeus uses this. Do not attack him during this phase as his power will increase immensely."
    },
    {
      "title": "Watch out for his tomahawk swing.",
      "content": "Watch out for his tomahawk swing. Lexaeus will attack you with his tomahawk."
    },
    {
      "title": "Dodge his Shattering Earth.",
      "content": "Dodge his Shattering Earth. Lexaeus will throw his tomahawk in the air and summon 3 earth spikes. This can be dodged by either using Reflega or Dodge Roll (analog + □) 3 times, with a pause in between. Dodge Roll out of the way to avoid it."
    },
    {
      "title": "Try to avoid his grapple.",
      "content": "Try to avoid his grapple. Lexaeus will run toward Sora and throw him into a pillar, then throw his tomahawk at him. This is very hard to avoid. The visual cue for this is similar to most attacks, and it can only be blocked by Reflega. Luckily he'll only use this when his aura is around 50,000 plus."
    },
    {
      "title": "Block his earthquake.",
      "content": "Block his earthquake. Lexaeus will leave the arena and smash down on Sora. He will then summon large rocks from below the earth, which covers the entire area. Spam Reflega as he's about to come down; you should get away unscathed."
    },
    {
      "title": "Summon Genie as soon as the battle starts.",
      "content": "Summon Genie as soon as the battle starts. You'll have a small window frame to do this while Lexaeus power charges. Donald or Goofy might attack him if you don't do it fast enough, and his damage will increase substantially."
    },
    {
      "title": "Get near Lexaeus as soon as he finishes charging.",
      "content": "Get near Lexaeus as soon as he finishes charging. He might attack you with shattering earth. To avoid it, dodge roll as soon as he throws his tomahawk in the air, then dodge roll again after the first rock appears. Pause for a moment before dodge rolling for the 3rd time. Don't dodge roll too far from Lexaeus as you'll want to be near him at all times to avoid his power charge."
    },
    {
      "title": "Press □ to guard if Lexaeus swings his arm back and slashes the ground.",
      "content": "Press □ to guard if Lexaeus swings his arm back and slashes the ground. This is the attack that you're waiting for. Make sure that you're standing close to him when you block so the Reaction Command (∆) will activate."
    },
    {
      "title": "Do a full ground combo on Lexaeus after doing the Reaction Command.",
      "content": "Do a full ground combo on Lexaeus after doing the Reaction Command. After the finisher, wait for Lexaeus to land on the ground and do another combo, but don't use the finisher or he'll retaliate and power up."
    },
    {
      "title": "Repeat this for the remainder of the battle.",
      "content": "Repeat this for the remainder of the battle. If you do this correctly, it will prevent Lexaeus from ever powering up and using stronger attacks."
    },
    {
      "title": "Continue the battle as you would when Lexaeus hasn't powered up.",
      "content": "Continue the battle as you would when Lexaeus hasn't powered up. However, if you see Lexaeus turning around near Sora, immediately spam Reflega. Lexaeus will grapple Sora, and it is impossible to guard against this. Only Reflega can protect you against it."
    },
    {
      "title": "Watch him if he jumps off the arena.",
      "content": "Watch him if he jumps off the arena. This means that Lexaeus will use his desperation attack. Wait for him to start coming down, then spam Reflega until your whole screen is taken over by rocks."
    },
    {
      "title": "Continue blocking him until you get a chance to guard against a tomahawk attack.",
      "content": "Continue blocking him until you get a chance to guard against a tomahawk attack."
    },
    {
      "title": "Repeat everything until Lexaeus dies.",
      "content": "Repeat everything until Lexaeus dies."
    }
  ]
}