{
  "url": "https://www.wikihow.com/Construct-an-Angle-Congruent-to-a-Given-Angle",
  "title": "How to Construct an Angle Congruent to a Given Angle",
  "steps": [
    {
      "title": "Review your original angle.",
      "content": "Review your original angle. The task for this construction is to copy, or transfer, some given angle, using the rules of mathematical construction. Begin with your sample angle on a sheet of paper. You also need to have a blank space to draw the congruent angle. For ease of reference, refer to the original angle as Angle ABC. Point B is the vertex of the angle. An angle is made up of two rays that join at the vertex. This angle is comprised of Ray BA and Ray BC."
    },
    {
      "title": "Get a compass.",
      "content": "Get a compass. The first tool that you need for constructing a congruent angle is a compass. Compasses come in a variety of styles. Some very inexpensive ones have a simple slot for you to insert a pencil. Some more expensive and accurate compasses have a variety of lead or ink inserts that may be interchangeable. For a simple task like copying an angle, you can use just about any compass that you have available. [1] X Research source Construct an Angle Congruent to a Given Angle"
    },
    {
      "title": "Find any straightedge.",
      "content": "Find any straightedge. The second tool you need is a straight edge. In fact, for the most genuine constructions, you should avoid using a ruler. According to the true sense of geometric construction, you should not rely on measurements. Therefore, you can use anything with a rigid straight edge. [2] X Research source"
    },
    {
      "title": "Use a pencil, pen or other marking tool.",
      "content": "Use a pencil, pen or other marking tool. The pencil in your compass will be used to mark certain lengths, but you will also need a pencil, pen or marker for drawing straight lines. [3] X Research source"
    },
    {
      "title": "Use the straight edge to draw a ray.",
      "content": "Use the straight edge to draw a ray. Begin by marking a point where you want to place your new angle. Label the point M. Align your straight edge with that point and draw a straight line that begins at M and extends as long as you want it to be. [4] X Research source Place an arrow point at the end of the line you drew and label it N. You have just drawn Ray MN. This will be the base of the angle you construct."
    },
    {
      "title": "Set the compass to any comfortable length.",
      "content": "Set the compass to any comfortable length. You will need to mark an arc on the original angle. The size of the arc does not matter. Choose a setting that is comfortable for you to work with. [5] X Research source"
    },
    {
      "title": "Draw an arc that crosses both rays of the original angle.",
      "content": "Draw an arc that crosses both rays of the original angle. When you use the compass, you need to be careful that the arc length you set does not slip. With some advanced compasses, you can use a screw setting to lock in the size. With cheaper compasses, you just need to be careful not to apply too much pressure, or the compass might slip. [6] X Research source Set the point of the compass at point B, the vertex of the original angle, and draw an arc that crosses both Ray BA and Ray BC. You do not need to draw an entire circle. For reference, mark the points where the arc crosses the rays as points X and Y."
    },
    {
      "title": "Draw the same arc on your transfer angle.",
      "content": "Draw the same arc on your transfer angle. Being careful not to let the compass setting slip, move the compass and set the point on point M. Draw an arc that crosses Ray MN and extends about as long as the one you drew over Angle ABC. [7] X Research source For reference, label Point F where the arc crosses Ray MN."
    },
    {
      "title": "Use your compass to measure the XY distance.",
      "content": "Use your compass to measure the XY distance. Pick up the compass and set the point down on Point X. Adjust the width of the compass so the pencil point is on Point Y. Draw a small arc that passes through Y. [8] X Research source"
    },
    {
      "title": "Copy the XY distance to your transfer angle.",
      "content": "Copy the XY distance to your transfer angle. Without adjusting the size of the compass width, place the tip of the compass on Point F. Draw a new arc, with Point F as the center. This arc should cross the one that you previously drew. Label the point where the two arcs intersect Point G. [9] X Research source"
    },
    {
      "title": "Use your straight edge to complete the angle.",
      "content": "Use your straight edge to complete the angle. Set your straight edge to align with Points M and G. Use a pencil or marker to draw a ray that begins at M and passes through G. Place an arrow point on the end of this ray, and label it Ray ML."
    },
    {
      "title": "Review your completed angle.",
      "content": "Review your completed angle. You should have an exact copy of the original Angle ABC. Your new angle is Angle LMN. [10] X Research source If the copied angle does not appear to be exactly congruent to the original, you should check that your compass remained stable each time that you lifted it off the paper."
    }
  ]
}