{
  "url": "https://www.wikihow.com/Care-for-Orchids",
  "title": "How to Take Care of Potted Orchids",
  "steps": [
    {
      "title": "Indirect light prevents orchids from getting sun-damaged.",
      "content": "Indirect light prevents orchids from getting sun-damaged. As a good rule of thumb, your orchids should be in light that’s bright enough to easily read a small-print book. If you have one available, set your pot of orchids on the sill of a north- or east-facing window so it gets some light throughout the day without being directly in the sun. If you only have a west- or south-facing window, cover it with a sheer curtain to keep the orchids from getting burned. [1] X Trustworthy Source Iowa State University Extension and Outreach Iowa State University's Extension and Outreach program dedicated to educating and engaging communities Go to source If you don’t have any space around your windows, put your orchids underneath grow lights instead. Keep the lights 6–8 inches (15–20 cm) above your orchids and leave them on for 12–16 hours each day."
    },
    {
      "title": "Deep, infrequent waterings prevent your orchid’s roots from rotting.",
      "content": "Deep, infrequent waterings prevent your orchid’s roots from rotting. Gently stick 1 or 2 fingers into the potting medium to test if it feels moist. If you don’t feel any moisture on your fingers, pour lukewarm water into the potting medium until it runs out from the bottom of the pot. Let the pot drain completely. Avoid using water that’s colder than 50 °F (10 °C) since it can damage the roots. If the inner leaves of your orchid start yellowing or wilting, it may be a sign that you’re overwatering it. [2] X Research source Clear pots can help you determine when it’s time to water your orchids—if there’s no condensation on the inside of the pots, then it’s time to water."
    },
    {
      "title": "Fertilizing your orchids helps them produce healthy blooms.",
      "content": "Fertilizing your orchids helps them produce healthy blooms. Use a balanced liquid fertilizer , such as 10-10-10 or 20-20-20, to give your orchids an equal mix of nitrogen, phosphorus, and potassium. Mix the fertilizer to quarter-strength and apply it directly to the potting medium. When the plant stops producing flowers, then stop applying fertilizer. If you planted your orchids in bark, use a 20-10-10 or 30-10-10 fertilizer mix to give your flowers more nitrogen and help them grow."
    },
    {
      "title": "Orchids will wilt and die if they get too hot or cold.",
      "content": "Orchids will wilt and die if they get too hot or cold. Orchids do best when they’re kept between 65–75 °F (18–24 °C), but they can handle temps a little cooler or warmer. Keep your thermostat set above 60 °F (16 °C) at night so your orchids don’t get too cold. During the day, make sure the temperature doesn’t go above 85 °C (185 °F) since it could cause your orchids to dry out and wilt. [3] X Research source"
    },
    {
      "title": "Air circulation keeps orchids cool on hot days and dries out moisture.",
      "content": "Air circulation keeps orchids cool on hot days and dries out moisture. During the cooler spring and autumn months, open your windows to let in a gentle breeze. Otherwise, just turn on an overhead fan on a low setting or an oscillating fan directed away from the orchids to keep the air from getting stale or stagnant. If your orchids don’t get good air circulation, they may have too much moisture and could develop fungal or bacterial problems."
    },
    {
      "title": "Orchids grow best in moderately humid conditions.",
      "content": "Orchids grow best in moderately humid conditions. Place a hygrometer near your pot of orchids to measure the humidity in your home. If the humidity is less than 40%, put a tray or saucer filled with pebbles and water underneath your plant so the water evaporates and increases the moisture in the air. [4] X Research source If the humidity in your home is higher than 60%, run a dehumidifier in the room with your orchids to prevent bacterial and fungal growth."
    },
    {
      "title": "Trimming off the old stems can help make your orchids rebloom.",
      "content": "Trimming off the old stems can help make your orchids rebloom . Use a clean pair of pruners or razor blade to trim your orchids. If you’re growing moth orchid (Phalaenopsis), cut the stem just above the bottom 2 nodes, or the small brown lines circling the stem. For any other orchid varieties, cut the stem off as close to the potting media as possible. [5] X Research source Always disinfect your gardening tools before and after you prune so you don’t spread any bacterial or fungal infections between plants."
    },
    {
      "title": "Pests damage leaves and flowers if you don’t quickly remove them.",
      "content": "Pests damage leaves and flowers if you don’t quickly remove them. Look for signs of scale insects and mealybugs, such as sticky leaves and black, sooty mold near the flowers. Dip a cotton swab in rubbing alcohol and apply it directly to stray insects to control them . If the bugs come back or if you have a larger infestation, apply a horticultural soap to the leaves to get rid of them. [6] X Research source Try to avoid using strong, toxic insecticides so you don’t harm your orchids."
    },
    {
      "title": "Removing infected foliage keeps the rest of your plant healthy.",
      "content": "Removing infected foliage keeps the rest of your plant healthy. Check your orchid for signs of infection, like yellow, brown, or black spots of discoloration on the leaves. Use a sterile blade or pair of pruners to cut away all of the diseased leaves, stems, and flowers. Be sure to disinfect your gardening tools before and after removing the affected leaves. [7] X Research source Try applying a fungicide to your orchids to help prevent the spread of infections. If you aren’t able to get a handle on a fungal or bacterial infection, it may be best to dispose of the entire plant."
    },
    {
      "title": "Orchids need good drainage so they don’t develop root rot.",
      "content": "Orchids need good drainage so they don’t develop root rot. Check that your orchid pot has slits along the sides or holes on the bottom so excess water can run out. If you got your orchids in pots without drainage holes, then just repot them into new ones. Put a saucer or drip tray underneath the pots to prevent excess water from spilling on your floor. If you notice your orchid is wilting or yellowing, it may already have root rot. Repot your orchid and avoid watering it for a few days to save the plant ."
    },
    {
      "title": "Bark and moss are fast-draining so your orchid doesn’t get waterlogged.",
      "content": "Bark and moss are fast-draining so your orchid doesn’t get waterlogged. Orchids normally grow on the bark of trees, so fill your pot with bark-based mix or moss-based medium . Avoid using regular potting mix since your orchids might not produce as many blooms. If your orchids are planted in any other medium, transplant them to a pot with the correct mix. [8] X Research source Bark-based medium drains well and helps prevent overwatering, but can break down quickly and needs to be replaced as it disappears. Moss-based media retain moisture better and are usually cheaper than bark, so you don’t have to water it as frequently."
    },
    {
      "title": "Repotting your orchids helps them produce healthy blooms each year.",
      "content": "Repotting your orchids helps them produce healthy blooms each year. Wait until the later winter or early spring to repot your plants so they still bloom in the late summer or fall. Carefully take the orchids out of the old pot and cut away any dead roots or yellowed leaves. Plant your orchid in a larger pot so the base of the stem is at the same level as it was in the old pot. [9] X Research source Check if any of the roots are growing out from the drainage holes to determine if you need to repot your orchids."
    }
  ]
}