{
  "url": "https://www.wikihow.com/Add-Someone-to-Your-House-Title",
  "title": "How to Add a Spouse, Family Member, or Friend to a House Deed",
  "steps": [
    {
      "title": "Get a copy of your current deed.",
      "content": "Get a copy of your current deed. Your current deed is typically located at the recorder's office for the county where your house is located. Search online for \"recorder\" or \"register of deeds\" along with the name of your county to find the right office. [1] X Research source Your county recorder may charge a small fee to pull the deed, and typically will charge an additional fee to make a copy of it for you. These fees usually won't be more than $20. Some companies offer to provide you with a copy of your deed, but you're better off dealing with the recorder's office directly. These companies charge a lot more money than you would pay if you got a copy from the county. [2] X Research source"
    },
    {
      "title": "Choose the type of deed form you want to use.",
      "content": "Choose the type of deed form you want to use. The two most common types of deeds are quitclaim deeds and grant deeds (also called warranty deeds in some states). The type you choose has legal and financial consequences. [3] X Research source When you use a quitclaim deed, you're only transferring your ownership interest. You're not guaranteeing you have any interest at all, or that you have particular ownership or possession rights. With a grant deed, you're making a promise that you're the current property owner. You're also stating that there aren't any liens, mortgages, or other claims to the property that you haven't disclosed."
    },
    {
      "title": "Fill out your new deed.",
      "content": "Fill out your new deed. Type the information for your new deed, or write it out neatly using blue or black ink. Copy information about the property exactly as it appears on your current deed, including the parcel number and the property description. [4] X Research source Include your full legal name and the legal name of the person you want to add to your house title. Use the right terminology to set up the type of co-ownership you've chosen."
    },
    {
      "title": "Sign your new deed in the presence of a notary.",
      "content": "Sign your new deed in the presence of a notary. As the \"grantor\" of the property, you must sign the deed and have your signature notarized . The person you're adding to your house title (the \"grantee\") doesn't need to sign the deed. [5] X Research source The notary will charge a small fee (typically less than $10)to witness your signature and notarize your deed. Bring a government-issued photo ID with you when you get your signature notarized. The notary will need to verify your identity."
    },
    {
      "title": "Take the new deed to the county recorder's office.",
      "content": "Take the new deed to the county recorder's office. Once you've signed the deed, take it to the recorder's office where you got the copy of your old deed. You may have to fill out a form and pay a small fee to get the deed officially recorded. [6] X Research source You may also have to pay a documentary transfer tax (DTT). For example, Sacramento County in California charges $0.55 per $500 of the property value when you file a new deed. [7] X Research source"
    },
    {
      "title": "File a claim with the tax assessor if necessary.",
      "content": "File a claim with the tax assessor if necessary. Any time property changes hands, the tax assessor's office will reassess the value of that property for tax purposes. This typically increases your property taxes. However, some types of transfers are excluded from reassessment. [8] X Research source If you're adding a spouse or a child to your house title, the transfer is usually excluded from reassessment."
    },
    {
      "title": "Use a tenancy in common if you want separate ownership interests.",
      "content": "Use a tenancy in common if you want separate ownership interests. With a tenancy in common, both owners have separate ownership interests in the property, but the property is undivided, and both owners have the right to possess the whole property. [9] X Trustworthy Source Iowa State University Extension and Outreach Iowa State University's Extension and Outreach program dedicated to educating and engaging communities Go to source The separate interest refers to the monetary interest in the property. For example, you may set it up so that you have an 80% interest in the property while your sister has a 20% interest. This means that if the property were sold, you would get 80% of the money from the sale, and your sister would get the remaining 20%. Co-owners who are tenants in common can use the property as security on a loan or take out a mortgage, but only to the extent of their ownership interest. For example, if you owned an 80% interest and your sister owned a 20% interest, your sister could only take out a mortgage for 20% of the property value. To create a tenancy in common, you would use \"and\" or \"or\" between the property owners' names on the deed. For example, \"Suzy Sunshine and Martin Moon\" or \"Suzy Sunshine or Martin Moon.\""
    },
    {
      "title": "Create a joint tenancy if you want undivided, joint ownership.",
      "content": "Create a joint tenancy if you want undivided, joint ownership. Unlike a tenancy in common, with a joint tenancy, both of you own the entire property, not a separate interest. A joint tenancy has a right of survivorship, which means if one owner dies, the surviving owner automatically gets the entire property. [10] X Research source You must use specific language in your deed to create a joint tenancy. For example, it would work to say \"Suzy Sunshine and Martin Moon as joint tenants with right of survivorship and not as tenants in common.\" Your state law may have other specific languages to use. Check with a property law attorney if you want to create a joint tenancy and are unsure of the language to use."
    },
    {
      "title": "Set up a tenancy by the entirety if you're married.",
      "content": "Set up a tenancy by the entirety if you're married. A tenancy by the entirety is similar to joint tenancy with right of survivorship, in that each spouse owns the entire property. When one spouse dies, the other spouse owns the property. [11] X Research source The difference between tenancy by the entirety and joint tenancy with right of survivorship is that if one spouse has debts, that spouse's creditors can't go after the other spouse's interest in the property to cover those debts. With a tenancy by the entirety, one spouse cannot take out a mortgage on the property or do anything else to encumber the property without the consent of the other spouse. Tenancy by the entirety is only available for married couples and is not recognized in some states. Talk to a property law attorney if you're interested in creating a tenancy by the entirety."
    },
    {
      "title": "It allows both owners to own a large asset and profit from it.",
      "content": "It allows both owners to own a large asset and profit from it. Sharing assets is often very important to recently married couples, who take co-owning a home as a sign of trust and commitment. But it also provides legal protection for both parties, regardless of their relationship status. Once you're co-owners, any decision you make must be mutually agreed on, and neither of you can (legally) cheat the other out of their share of the house. [12] X Research source"
    },
    {
      "title": "It can ease your financial responsibility.",
      "content": "It can ease your financial responsibility. Owning a house is a big financial responsibility, but owning it with someone else can make covering some of those expenses easier. Paying for a mortgage, home insurance, escrow, utilities, and general upkeep costs isn't as expensive when you're splitting it in half with someone else, or when you and the co-owner are sharing income. [13] X Research source"
    },
    {
      "title": "It helps the co-owner build credit.",
      "content": "It helps the co-owner build credit. When you add someone as a co-owner on your house, you're giving that person the opportunity to build their credit (if you have a mortgage). Making regular monthly mortgage payments looks good on their credit report and may help them qualify for more loans in the future. [14] X Research source Keep in mind that your co-owner's credit score will probably go down slightly after they sign their name to the deed for your house. But as long as you both keep up with the payments, their score will go back up in a few months."
    },
    {
      "title": "Loss of property tax exemptions",
      "content": "Loss of property tax exemptions Depending on the age of the person you plan to add to your house title, other property they own, or other factors, you may lose a property tax exemption you currently have. For example, if you have a property tax exemption because you're older than 65, you would lose that exemption if you added your daughter to your house title. [15] X Research source Property tax exemptions mean that you pay lower property taxes, and sometimes no property tax at all. These exemptions vary among states. Some common exemptions include homestead exemptions or exemptions for people over the age of 65. If you look at your property tax statement, it should indicate whether you're receiving any property tax exemptions. You can also find out by contacting the tax assessor's office in your county."
    },
    {
      "title": "Gift taxes",
      "content": "Gift taxes When you add someone to your house title, you're giving them a share of the property. Depending on the value of your property, you may be on the hook for federal gift taxes at the end of the year. Consult a tax professional if you believe the gift tax may apply. The gift tax applies if you transfer property ownership and receive nothing in return (or receive less than market value for the ownership interest you transferred). It doesn't matter whether you intended it to be a gift. [16] X Trustworthy Source Internal Revenue Service U.S. government agency in charge of managing the Federal Tax Code Go to source The transfer is excluded from the gift tax if you're adding your spouse to your house title. [17] X Trustworthy Source Internal Revenue Service U.S. government agency in charge of managing the Federal Tax Code Go to source"
    },
    {
      "title": "Property value reassessment",
      "content": "Property value reassessment When you transfer ownership of your house, it triggers a reassessment of the property value for tax purposes in most cases. You could end up paying hundreds of dollars more in property taxes as a result. [18] X Research source Some transfers are excluded from reassessment. The types of transfers that are excluded vary among states. For example, if you're adding a spouse to your house title, the deed transfer will be exempt from reassessment in many states."
    },
    {
      "title": "Estate impact",
      "content": "Estate impact Adding someone to your house title can have legal and financial consequences if either of you dies. Get advice from an experienced estate planning attorney , particularly if your house is worth a considerable amount of money or is your only major asset. [19] X Research source How you add the person to your title affects whether the surviving owner must go through a probate process . If avoiding probate is a priority, an attorney can help you find the best method to add the other person to your house title."
    },
    {
      "title": "To add someone to your house title, you must file a new deed.",
      "content": "To add someone to your house title, you must file a new deed. Before you start a new deed, weigh the potential benefits and consequences of adding a co-owner. If you decide to proceed, choose a type of co-ownership that appeals to both of you. After that, fill out a new deed form, sign it, and file it with your local county recorder's office."
    },
    {
      "title": "How long does it take to update a property deed with a new name?",
      "content": "How long does it take to update a property deed with a new name? It can take 1 business day to several weeks for your county recorder to process the new deed. It depends on how busy they are. In Shelby County in Memphis, TN, for example, the county recorder typically takes 1 business day to record it and return it to you. [20] X Research source"
    },
    {
      "title": "How much does it cost to add someone to my deed?",
      "content": "How much does it cost to add someone to my deed? The cost varies based on the county you live in. You may be charged a fee by the county recorder as well as a Document Transfer Tax (DTT). The DTT is calculated based on a certain percentage of your property value, which is set by the county. [21] X Research source"
    },
    {
      "title": "Can I update a property deed myself or do I need a lawyer?",
      "content": "Can I update a property deed myself or do I need a lawyer? While you can certainly do it yourself, it's always a great idea to ask a lawyer to look over it. They'll ensure you filled out the deed form correctly to set up your co-ownership the way you want it."
    }
  ]
}