{
  "url": "https://www.wikihow.com/Care-for-Your-Lizard",
  "title": "How to Care for Your Lizard",
  "steps": [
    {
      "title": "Change the water regularly.",
      "content": "Change the water regularly. However, different lizards will require different types of water dishes. For instance, some do best with a small bowl, while others will need a drip water system. As an example, chameleons need dripping water because they won't drink from a small bowl. You can either ask at the pet store or contact your vet to find out which is best for you pet. Be sure to change the water every day, especially if the lizard uses a small bowl for water. Some lizards like to swim so you will need to provide a large enough water area to allow them to do so. [1] X Research source"
    },
    {
      "title": "Mist your lizard.",
      "content": "Mist your lizard. Depending on the type, your lizard will need to be misted once a day. You can use any spray bottle, as long as it's set to mist and not stream. The mist helps create the humidity needed by some lizards. For instance, bearded dragons will not need to be misted, but iguanas will."
    },
    {
      "title": "Provide appropriate food.",
      "content": "Provide appropriate food. Most lizards will eat insects and prefer live ones. Crickets are a common food that can be supplemented with a reptile food supplement, and waxworms, mealworms, and roaches are also common. In fact, many owners keep a small colony of crickets or roaches to feed their pets. Also, it is recommended to cut the heads of mealworms because they have been known to chew the way out of lizards, causing your lizard to die. [2] X Research source Some lizards are carnivores, while others are omnivores or herbivores. If you keep live crickets, one-fifth of their diet needs to be calcium carbonate, given to them at least 2 days before you feed your crickets. The other four-fifths can be cricket food. Carnivores will eat insects, but they'll also snack on smaller lizards or frogs if they are big enough. [3] X Research source You may also need to feed rodents, fish, shrimp, or baby chicks. [4] X Research source For instance, leopard geckos are carnivores and do well on a diet of crickets and mealworms. [5] X Research source You can collect insects with a sweep net from nearby fields to feed your lizards. However, you must be sure that the fields are not treated with insecticide, and you'll likely only have luck when it's warm out. [6] X Research source Some lizards are omnivores, and they will eat plants, too, such as dandelion, clover, and other common fruits and vegetables. For instance, tomatoes, pears, apple, and lettuce are common fruits and vegetables to feed your lizards. They will also eat other small insects, such as snails and mealworms, or even dog food (with a bit of added water if dry). Bearded dragons are omnivores, and they can subsist mainly on greens (like kale and leaf lettuce) and squash with mealworms and locusts or other insects making up the other quarter of their diet. [7] X Research source Most omnivores and carnivores will only need to be feed 2 to 3 times a week. However, smaller or younger reptiles may need to be fed more often. How much your lizard eats depends on its size. [8] X Research source Some lizards are herbivores, meaning they will eat only vegetables. Iguanas are a good example of this type. They can eat leafy greens, as well as many fruits and vegetables, and they should be fed every day. Food should mostly be about as long as their head is wide to prevent choking. In addition, you should place foods on a small plate for consumption, especially if you have sand in the tank. [9] X Research source"
    },
    {
      "title": "Choose the right cage for your lizard.",
      "content": "Choose the right cage for your lizard. What type of cage you get is determined by your lizard. Be aware that lizards need to be kept within certain temperature ranges. If the ambient temperature where you live drops low in winter, then you need to provide a thermally efficient enclosed tank. This will keep your lizard warm without sending your heating budget sky high. You should be able to control the heat in the cage, as well as the humidity for some species. You'll also need to be able to provide light, as well as give the lizard as much space as it needs. Make sure that the enclosure is secure and that your lizard cannot escape from it. One common type of cage is an aquarium with a screen on top. Small geckos do fine in this type of cage. For leopard geckos, you'll need a 20-gallon aquarium/terrarium. [10] X Research source Plastic cages are another option. Bearded dragons do well in this type of cage, though the ideal tank is a vivarium, which is made up of heat insulating material such as wood, with a glass front. Aquariums can become too hot, or be thermally inefficient. Bearded dragons need a 55-gallon aquarium. If you choose a plastic cage, it needs to be at least 2 feet by four feet, as well as 2 feet high. [11] X Research source The third type of cage is an all-wire cage. Chameleons prefer this type of cage, as they can climb as needed. For that reason, their cages should be taller than for other lizards. [12] X Research source"
    },
    {
      "title": "Keep your lizard's cage at the right temperature.",
      "content": "Keep your lizard's cage at the right temperature. Many reptiles will need a heat lamp to stay at the right temperature. However, different lamps and bulbs will put out different amounts of heat, so you need to pick one that is appropriate for what temperature your lizard needs. [13] X Expert Source Jeff Jensen Reptile Specialist Expert Interview. 8 April 2021. Ask at the pets store how much heat your lizard will need. For instance, most lizards will need an area that's somewhere between 90 degrees to 100 degrees. Lizards also need a cool area of the cage, so only put the heat on one end. The cooler end should be between 70 and 75 degrees, usually. Check temperatures. Consider how high up your lizard can get, including its height. Make sure those areas are not too hot for your lizard by using a thermometer to check. [14] X Research source Turn basking lamps that provide light off at night. If your lizard still needs warmth, use a ceramic heater instead. [15] X Research source"
    },
    {
      "title": "Give your lizard some light.",
      "content": "Give your lizard some light. Most lizards need light to help them thrive. You'll need to use lamps that provide UVA and UVB light. Only keep it on during the day for about 12 hours. [16] X Research source Pick a flood lamp. You need a zone for the lizard to bask in and absorb light. If you have a basking flood lamp, you can simply add another lamp for UVB light, so your lizard gets the full spectrum. The basking lamp will provide the UVA rays it needs. [17] X Research source Place the lamp within the enclosure but out of reach of the lizard. Be careful that the lizard cannot touch the lamp as he will get burnt, but it needs to be close enough to provide effective heating. Check the lamp you buy to see what its requirements are. [18] X Research source Create layers. That is, your lizard should have an area for basking and light, but it should also have space to get away from those sources. Keep parts of the enclosure mostly unlit. [19] X Research source Turn the lights out at night. Your reptile needs darkness at night just like you do. If you find it hard to remember, you can set the lamps on timers. [20] X Research source"
    },
    {
      "title": "Provide them with a place to hide.",
      "content": "Provide them with a place to hide. Most lizards like to hide themselves away sometimes. You need to give them a place where they can do so. Rocks and small logs work for this purpose. [21] X Research source Try to put at least one hiding place where it's cooler in the cage. If you use any outside rocks, make sure to clean them and then sterilize them in boiling water first before adding them to the cage. You can also clean and then heat branches in the oven at 250 degrees Fahrenheit for 30 minutes to help kill off any germs. [22] X Research source Branches are also important to some species, such as chameleons, because they allow them to climb."
    },
    {
      "title": "Skip the bedding.",
      "content": "Skip the bedding. While it's tempting to put gravel or other types of bedding down in a cage, lizards can eat pieces of them. The lizard cannot process these bits, which can lead to problems. However, what's best does depend on your lizard. You can use butcher paper to line the cage. Butcher paper is a good choice because it is ink-free, and ink can be harmful to your lizard. Another good choice is some newspaper that hasn't been printed on, which you can find at moving companies. [23] X Research source However, some lizards do like to burrow, in which case, reptile sand or aspen shavings are good choices. [24] X Research source You can use garden soil for bedding. You should also plant some live plants in your lizard's enclosure. In this way, the wastes that your lizard will produce will get decomposed in the soil and will be used by the plants as manure. In this way you don't have to clean up the lizard's enclosure again and again."
    },
    {
      "title": "Take your lizard to the vet.",
      "content": "Take your lizard to the vet. You should take your pet to the vet when you first get it, to make sure it is in good health. Like other animals, you should also take your lizard to the vet once a year for a checkup. Most lizards need de-worming at some point in their lives. Ask your vet about it."
    },
    {
      "title": "Watch for health problems.",
      "content": "Watch for health problems. Runny feces are a sign of poor health, at least if they last for more than 48 hours, and you need to consult a vet. [25] X Research source Similarly, not going to the bathroom is also a problem. Look for weight loss. Sudden weight loss can also be an issue. It may mean your lizard is not eating or drinking, and you need to talk to your vet. Keep an eye on other changes. Other changes that could be a sign your lizard is sick include a runny nose, eyes, or mouth, or it may have joints that swell up or have trouble shedding its skin. Alternatively, you may notice discolored skin or the fact that it's avoiding open spaces more."
    },
    {
      "title": "Quarantine new lizards.",
      "content": "Quarantine new lizards. New lizards you bring into your home should be kept in a separate cage for at least a month. That way, if your new lizard has a disease, it won't give it to your other lizards. Always feed, water, and clean the cage of the quarantined lizard last to prevent infection of the other lizards."
    },
    {
      "title": "Clean the cage.",
      "content": "Clean the cage. You should completely clean the cage once a week. However, you should check the cage every day to take out uneaten food, remove shed skin, and take out poop. You should also clean up any spills, as well as clean the food and water dishes. [26] X Research source Place your reptile in another clean cage or container while you're cleaning out the cage once a week. [27] X Research source Put gloves on. Take everything out of the cage. Throw away any liners, sand, or bedding you may have used. [28] X Research source Clean and sterilize the water and food bowls. Wash in hot, soapy water. Use a disinfectant afterwards, but make sure to rinse it out thoroughly and then dry it. [29] X Research source Wash out the cage. You may find this part easiest to do outside. Use hot water and soap to scrub down the cage. You can use a clean toothbrush to help you scrub if need be. Also, wash and clean any decorations the same way. [30] X Research source Disinfect the cage. You can use one specifically built for reptile cages to help protect your pets, but still, be sure to rinse thoroughly afterwards. [31] X Research source Put in a new liner or sand, and replace everything else. Let everything dry well. If items will not dry easily, you may need to replace them from time to time. [32] X Research source Keep reptile cleaning items separate from other cleaning items and make sure to wash them out thoroughly after using. Don't forget to scrub your own hands at the end. [33] X Research source"
    },
    {
      "title": "Provide stimulation.",
      "content": "Provide stimulation. A well-stocked cage can keep most lizards entertained, such as having enough rocks, branches, hollow areas, and even plants, depending on the lizard. [34] X Research source You can also use live prey to provide enrichment, or you can hide your lizard's food throughout the enclosure to help give it something to do. [35] X Research source"
    }
  ]
}