{
  "url": "https://www.wikihow.com/Add-Music-to-Pictures-on-Instagram",
  "title": "3 Simple Ways to Add Music to Instagram Posts",
  "steps": [
    {
      "title": "Tap + in the Instagram app.",
      "content": "Tap + in the Instagram app. You can now add music to pictures you post on Instagram. To get started, you just need to create a new post by tapping + at the bottom of your feed. Instagram is available for iOS in the App Store and for Android in the Google Play Store ."
    },
    {
      "title": "Select the photo(s) you want to add and tap Next.",
      "content": "Select the photo(s) you want to add and tap Next . If you want to select multiple photos, tap and hold the first photo you want to add, then tap the others."
    },
    {
      "title": "Tap the music note icon.",
      "content": "Tap the music note icon. It's in the upper-right corner above your photo. This opens the Music search bar, where you can search for a song or artist."
    },
    {
      "title": "Select a song.",
      "content": "Select a song. Use the search bar at the top of the page to search for an artist or song title, then tap the song to select it."
    },
    {
      "title": "Select a portion of the song and tap .",
      "content": "Select a portion of the song and tap . Tap the 30 to select a duration, anywhere from 5-90 seconds, then drag the box at the bottom to select the part of the song you want to add. You can also tap the pink dots to jump to popular sections of a song. Tap the checkmark icon or Done to continue."
    },
    {
      "title": "Edit and share your photo(s).",
      "content": "Edit and share your photo(s). You can now select a filter, add a caption and hashtags , tag a location, or tag users in your photos as you normally would. When you're finished, tap Share to post your photo(s) with music on your Instagram profile. [1] X Research source"
    },
    {
      "title": "Tap + in the Instagram app.",
      "content": "Tap + in the Instagram app. If you want to add music to a photo in an Instagram Story, you can do so while creating the story. You'll see the + at the bottom of the screen."
    },
    {
      "title": "Select Story.",
      "content": "Select Story . You'll see this next to Post near the bottom of the screen."
    },
    {
      "title": "Select or capture a new photo or video.",
      "content": "Select or capture a new photo or video. To select a photo, tap the square at the bottom-right, then choose your photo. Alternatively, you can take a photo or record a video now."
    },
    {
      "title": "Tap the music note icon.",
      "content": "Tap the music note icon. It's at the top of your photo or video preview. This opens the Music search bar, where you can search for a song to add."
    },
    {
      "title": "Select a song.",
      "content": "Select a song. Type in the name of a song or an artist, then tap a song to add it to your picture or video. You can also scroll through the For you tab list of music or tap Browse . If your search doesn't produce results, you'll have to search for a different song. You can also tap the play triangle icon next to a song to preview it."
    },
    {
      "title": "Select a segment of music to use.",
      "content": "Select a segment of music to use. You can add anywhere from 5 to 15 seconds of music to a photo or video on your Instagram Story. Tap the 15 at the bottom-left to select a time, then drag the box at the bottom to the part of the song you want to use."
    },
    {
      "title": "Toggle the song view.",
      "content": "Toggle the song view. The icons above the selection bar allow you to choose how the song displays on the Story. You can display lyrics in various formats, the album cover, and a few other options."
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . It's in the top-right corner of the screen. You can now reposition the song title or lyrics by pressing and holding them on the preview and dragging them to the desired location."
    },
    {
      "title": "Add any additional features you want to add.",
      "content": "Add any additional features you want to add. You can now design your story as you wish using the icons at the top of the screen. You'll be able to add text , stickers, locations, effects, and other story features."
    },
    {
      "title": "Tap Your Story to post your picture with music.",
      "content": "Tap Your Story to post your picture with music. It's at the bottom of the screen. Doing so adds the photo to your Instagram story, where your followers will be able to see it for the next 24 hours."
    },
    {
      "title": "Open the Instagram app and tap +.",
      "content": "Open the Instagram app and tap + . If you want to add music to a video (reel), you'll have many options. Instagram is available for iOS in the App Store and for Android in the Google Play Store . If you aren't logged into Instagram, tap Sign in to do so now or create an account . Instagram Reels are videos with one or more clips, including still photos. You can add music effects and use creative tools on the Reel before sharing them. [2] X Research source"
    },
    {
      "title": "Tap the Reel tab.",
      "content": "Tap the Reel tab. It's the third option at the bottom of the screen."
    },
    {
      "title": "Select a photo or video and tap Next.",
      "content": "Select a photo or video and tap Next . Tap a video or photo from your Gallery or Camera Roll that you want to use in your reel. You can choose multiple photos and/or videos if you'd like, as long as they don't exceed 60 seconds."
    },
    {
      "title": "Tap the music note icon.",
      "content": "Tap the music note icon. This opens your music selector."
    },
    {
      "title": "Search for and select a song.",
      "content": "Search for and select a song. Type in the name of a song or an artist, then tap a song to add it to your reel. You can also scroll through the For you tab list of music or tap Browse . You can also tap the play triangle icon next to a song to preview it."
    },
    {
      "title": "Select a segment of music to use and tap Done.",
      "content": "Select a segment of music to use and tap Done . Tap and drag left or right on the box on the sound wave at the bottom of the screen to choose which part of the song to add."
    },
    {
      "title": "Design your reel and tap Next.",
      "content": "Design your reel and tap Next . You can use the options at the top of the screen to add text, stickers, effects, and more."
    },
    {
      "title": "Add a caption and share your reel.",
      "content": "Add a caption and share your reel. Add any text, hashtags, or other details you want to add to your reel, then tap Share to post it. Your Reel will begin uploading to your Instagram page. You can view your Reels on your timeline or profile page in the Reels tab."
    }
  ]
}