{
  "url": "https://www.wikihow.com/Add-an-Account-to-the-Nest-App",
  "title": "Add Multiple Accounts to the Nest App on iPhone or Android",
  "steps": [
    {
      "title": "Open Google Home.",
      "content": "Open Google Home. It looks like a triangle that's red, yellow, green, and blue. Even if you try to add someone through the Nest app, you'll be prompted to add them through the Home app."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . It's in the bottom-right corner of your screen. If you have multiple homes, select the one that you want to add a person to. Use the drop-down list from the top of your screen."
    },
    {
      "title": "Tap +.",
      "content": "Tap + . You'll see this plus sign icon next to the list of people who are invited to that home. Alternatively, tap Add and Home member ."
    },
    {
      "title": "Enter the email address of the person you want to add.",
      "content": "Enter the email address of the person you want to add. This can be a gmail or non-gmail address. Tap Next twice to continue. You'll see a list of what the invited person has access to."
    },
    {
      "title": "Tap Send.",
      "content": "Tap Send . You'll then be asked if you want to add that person to your Google Family Group. Tap either Add to Family or No thanks . The person you invited will get an email with instructions to proceed. [1] X Research source"
    },
    {
      "title": "Open the Nest App on your mobile phone.",
      "content": "Open the Nest App on your mobile phone. It's a home icon on a blue tile."
    },
    {
      "title": "Tap .",
      "content": "Tap . It's a gear icon in the top right corner of your screen. If you have more than one home in the app, make sure the one that you want to add someone to is active."
    },
    {
      "title": "Tap Family & Guests or Family.",
      "content": "Tap Family & Guests or Family . You'll see a list of all the active family members. The wording will be different if you have a Nest x Yale Lock."
    },
    {
      "title": "Tap Add a person.",
      "content": "Tap Add a person . This will bring you to a page that allows you to search through your contacts, or enter an email address to send an invite through email. [2] X Research source"
    },
    {
      "title": "Enter the contact's information and send the invitation.",
      "content": "Enter the contact's information and send the invitation. You can type in their email or tap Add from contacts if they are in your phone's contacts. They will get an email with the subject title \"Welcome Home\" that they need to accept. If they don't already have a Nest account, your guest will have to create one."
    }
  ]
}