{
  "url": "https://www.wikihow.com/Care-for-a-Baby",
  "title": "How to Care for a Baby",
  "steps": [
    {
      "title": "Feed your little one.",
      "content": "Feed your little one. Nutrition is one of the key parts of having a happy and thriving baby. Feed your little one according to a set schedule and their age, which can help them grow and keep them active and happy. Choose to breast or bottle feed newborns and infants. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Breastfeeding is recommended because it offers the most benefits for your baby. [2] X Research source Most newborns need eight to 12 feedings per day. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source After five to six months, most babies can have breast milk or formula and begin to eat cereal or mashed foods, which are sometimes called semi-solid foods. Burp your baby after feeding for a few minutes to help dissipate gas in their system. [4] X Research source Figure out if your baby is getting enough to eat by making sure they produce at least six wet diapers and several bowel movements daily. [5] X Research source Your baby should also be gaining about five to seven ounces every week for the first six months of life. Between six to 12 months, your baby should gain about three to five ounces per week. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Ask your pediatrician questions about when it is best to begin semi-solids and solids, as well as drinking water."
    },
    {
      "title": "Change your baby’s diapers as necessary.",
      "content": "Change your baby’s diapers as necessary. It’s important to make sure that your baby has clean diapers, which promotes their health, can keep them happy, and help you when it comes time to potty train them. Whether you are using cloth or disposable diapers, change your baby’s diaper as soon as you realize it is soiled. [7] X Research source Lay your baby flat on their back to change the diaper. Keep a close eye on them at all times and never leave them alone on the changing table. Remove the soiled diaper and gently wipe your baby’s genital area clean with wipes or a pre-moistened washcloth. Wipe baby girls from front to back to minimize the risk of urinary tract infections. Be aware that removing a diaper too quickly from a baby boy may cause him to urinate. [8] X Research source Place a new diaper under your baby and apply an ointment made for the diaper area before fastening up the diaper. Your doctor can give you suggestions about ointments to use. These ointments often feature zinc oxide as the main ingredient. Applying an ointment can help to prevent diaper rash. [9] X Research source Wash your hands after changing the diaper. [10] X Research source"
    },
    {
      "title": "Bathe your baby regularly.",
      "content": "Bathe your baby regularly. Give your baby a bath a couple of times a week or if they have a diaper blowout that wipes cannot clean. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source This can ensure that their skin stays clean without drying out. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Allow your baby’s stomach to calm for a bit if you want to bathe them after a feeding. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Have a washcloth, towel with a hood, mild, unscented baby shampoo and soap, baby wipes, a clean diaper, and clean clothes ready before their bath. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source This can help you focus solely on the baby and not gathering items once you’ve started. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Consider a sponge bath if you don’t want to use a tub every time. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Fill the tub with 2-3 inches (5-8 centimeters) of warm water. Pour the warm water on your baby throughout the bath to keep them warm. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The water should be around 100F (38 degrees Celsius) and lower than 120F (49C) to prevent scalding. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Support your baby, including the head, throughout the bath so that they doesn’t slip and hurt themself. [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Focus on washing inside skin folds, especially on the face, neck, and diaper area. [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Wrap your baby in a towel with a hood when you’re finished to keep them warm and cozy. [21] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Massage baby with hypoallergenic lotion if you like. [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source This can calm them and give you a nice bonding experience. [23] X Research source"
    },
    {
      "title": "Clip your baby’s nails.",
      "content": "Clip your baby’s nails. Babies need short nails to minimize the risk of scratching or cutting their delicate skin. [24] X Research source Because babies’ nails grow quickly, trim or file your baby’s nails once or twice a week, or more often if necessary. [25] X Research source Use baby nail scissors or a small emery board. These are gentler and safer to use on a fidgety or squirming baby. [26] X Research source Consider asking your partner, a friend, or a family member to help you trim your baby’s nails. This may minimize the risk of cutting them. [27] X Research source Apply pressure to your baby’s finger if you accidentally cut it and draw blood. This is normal and you shouldn’t worry. Don’t use a bandage, which a baby may choke on if it gets into their mouth. [28] X Research source"
    },
    {
      "title": "Monitor your baby's umbilical cord stump.",
      "content": "Monitor your baby's umbilical cord stump. The umbilical cord is essential while your baby is in the womb, but after birth it is not necessary. Your baby's doctor will clamp what is left of the cord and it will fall off on its own in about two weeks. [29] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You should keep the umbilical cord area clean and dry until it falls off, but you do not need to clean it unless it looks crusty or sticky. If you notice a crusty or sticky discharge around the umbilical cord stump, then clean it with a bit of warm water and pat dry with a clean, dry towel. Do not try to pull off the stump! Allow it to fall off on its own. [30] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Care for your baby boy's circumcision site.",
      "content": "Care for your baby boy's circumcision site. If you have a newborn son and you decide to have him circumcised, then you will need to monitor and clean the circumcision site while it heals. It takes about seven to 10 days for a circumcision wound to heal and during this time the wound is susceptible to infection. Check the area each time you change your baby's diaper. Clean off any stool or urine that gets on your baby's penis with some mild, unscented soap and warm water. If you notice swelling, redness, or a cloudy, crusty fluid, then call your doctor. Your baby's circumcision wound may be infected."
    },
    {
      "title": "Learn your baby’s sleep requirements.",
      "content": "Learn your baby’s sleep requirements. Sleep is integral to a baby’s health and well-being. Learning how much they need can keep them happy and healthy. [31] X Research source The recommended daily sleep needs for babies are: Infants 0-2 months need 10.5-18 hours every day. Babies 2-12 months need 14-15 hours every day."
    },
    {
      "title": "Follow a regular bedtime.",
      "content": "Follow a regular bedtime. Fix a regular bedtime for your baby that includes a routine. This can promote and regulate sleep and help relax it. [32] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Keep in mind that most babies don't have a specific bedtime in the first two to three months of life because they are still feeding every few hours. Take naps, feedings, baths, and your baby’s age when figuring out their bedtime. Adjust your schedule for activities or other factors like illness. [33] X Research source"
    },
    {
      "title": "Get your baby to relax before bed.",
      "content": "Get your baby to relax before bed. Babies usually need time to switch into bedtime mode. Help your little one relax with a bedtime routine and cozy environment. [34] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Start switching into bedtime mode at least two hours before bedtime. Dampen any noise. [35] X Research source Dim the lights in any spaces your baby might be. This signals them that it’s time to sleep. [36] X Research source Gently talk to your baby and rub their back to relax. This can also help soothe them if they are fussy. [37] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Establish a bedtime routine.",
      "content": "Establish a bedtime routine. Set up a nightly ritual at bedtime. [38] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Taking a bath, nursing or feeding, reading a story, singing, or listening to soothing music can signal your baby that it’s time to sleep. [39] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Reading or singing can help calm your baby. [40] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Give them a warm bath to stimulate sleepiness. A gentle massage may encourage somnolence and prepare them for sleep."
    },
    {
      "title": "Create a cozy sleeping environment.",
      "content": "Create a cozy sleeping environment. Create a room for your baby that helps them to sleep. Factors such as temperature, white noise, and shutting out light can put them on the road to a full night’s rest. [41] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source A room temperature between 60 and 75 degrees is optimal for promoting sleep. Remove electronics or anything else that might stimulate your baby. [42] X Research source Use soft bulbs and curtains or blinds to control light. A night light in a non-stimulating color like red can reassure a baby. [43] X Research source White noise machine can dampen noises and help them sleep. [44] X Research source Remove blankets and soft items from the crib or bassinet to minimize the risk of suffocation. [45] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Put your baby down while awake.",
      "content": "Put your baby down while awake. Put your baby in their bed when they are drowsy but still awake. This helps them associate the crib or bassinet with sleep. [46] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source In addition, it may also reduce the amount of nighttime care you provide. [47] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Lay your baby on their back in their bed. [48] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Let your baby to adjust and see if they fall back asleep if they rouse when you put them in the bed. If they don't, hold them until they become drowsy."
    },
    {
      "title": "Promote bonding with your baby.",
      "content": "Promote bonding with your baby. Establishing a bond with your baby as a newborn and throughout infancy is an important part of promoting their health and development. From soothing, cradling, and eventually playing with your baby, do activities that promote a bond between you and your child. [49] X Research source You can bond with and stimulate your baby through a variety of activities including: Massage or gentle stroking Vocal stimulation such as talking, singing, reading, or cooing. [50] X Research source Maintaining eye to eye contact at close range. [51] X Research source Playing with age-appropriate toys."
    },
    {
      "title": "Soothe a cranky baby.",
      "content": "Soothe a cranky baby. Most babies will invariably get cranky at times. Soothing them as they cry can help them to calm down and promote your bonding. [52] X Research source Avoid sudden movements, bright lights, and loud noises so that you don’t startle your baby. [53] X Research source Pick your baby up if they cannot calm down from crying. Stroke their skin and speak to them in a soft voice to help them calm down. [54] X Research source Swaddling newborns and babies under two months can help soothe them. [55] X Research source"
    },
    {
      "title": "Secure your baby in carriers.",
      "content": "Secure your baby in carriers. No matter if you are using a carrier, car seat, or stroller, make sure that your baby is securely fastened into the unit. This can prevent injuries or even death. [56] X Research source Learn how to properly secure your baby in carriers, strollers, and car seats. Most hospital will not allow you to leave without an appropriate car seat that you can properly use. [57] X Research source Ask questions about using carriers, strollers, and car seats as you need. You can also read packaging instructions. Limit activities that are too rough or bouncy, which can be dangerous for a baby. [58] X Research source"
    },
    {
      "title": "Ask for help.",
      "content": "Ask for help. Many people feel overwhelmed when caring for a baby. Ask your partner, friends, or family members to help you care for your baby on occasion or when you need it. You may want to consider hiring a reputable babysitter you trust to give you some me time, too. [59] X Research source Know that it’s okay to ask for help and that many people are willing to help out with babies. [60] X Research source If you don’t have any close friends or family to help you, your doctor or local hospital may help you find someone to help you. [61] X Research source"
    },
    {
      "title": "Visit your pediatrician.",
      "content": "Visit your pediatrician. Schedule regular doctor’s visits for your baby. In addition, if you have any questions or concerns, contact the pediatrician’s office. It’s better to be safe and ask questions than have something turn into a problem. Talk to your doctor right away if you think your baby has a fever or seems ill or is injured in any way. Schedule regular doctor’s visits for your baby. Your pediatrician will check that they are thriving and developing according to schedule. In addition, the doctor will make sure your child is vaccinated against diseases. Your baby should see their pediatrician at regular intervals including: at birth, three to five days old, two to four weeks, two months, four months, six months, nine months, one year, 15 months, and 18 months. [62] X Research source Note what each visit will entail so that nothing comes as a surprise. For example, at three to five days your doctor will check your baby’s weight, length and head circumference and ask questions about feedings, sleeping habits, and defecation. [63] X Research source At two months, your baby will receive his first round of vaccines. At nine months, your doctor will check your baby’s size and developmental issues such as speaking, standing, and playing peek-a-boo. [64] X Research source"
    }
  ]
}