{
  "url": "https://www.wikihow.com/Be-a-More-Detailed-Writer",
  "title": "How to Be a More Detailed Writer",
  "steps": [
    {
      "title": "Show, don't tell.",
      "content": "Show, don't tell. Whether you're writing fiction, creative non-fiction, or a closing trial statement, this fundamental piece of writing advice holds true. Don't tell us your character is angry, show us by the tightness in her jaw, or the edge in her voice, or the way her posture stiffens ever so slightly. Don't tell us that the tenement building was run down; describe the broken windows, peeling paint, and pervasive smell of urine. The key is details, details, details. Take this example of a house from Alexander McCall Smith's The No. 1 Ladies' Detective Agency . He is describing a traditional mud hut, but he gives us so much more than that: \"It was a bare earth house in the traditional style; brown mud walls, a few glassless windows, with a knee-height wall around the yard. A previous owner, a long time ago, had painted designs on the wall, but neglect and the years had scaled them off and only their ghosts remained.\""
    },
    {
      "title": "Focus on key details.",
      "content": "Focus on key details. Too many details can ruin the pacing of your story or clutter your argument. The key is not to describe everything, but rather to pick out a few precise details and let the reader fill in the rest. [1] X Research source Consider why you are including details. Do they tell you something about a character or your story? Do they contribute in a specific way to the argument you are making? In this excerpt from The God of Small Things , Arundhati Roy draws on one aspect of a church – the heat – which she uses to draw a contrast that reveals the emotional state of a character: \"It was hot in the church, and the white edges of the arum lilies crisped and curled. A bee died in a coffin flower. Ammu's hands shook and her hymnbook with it. Her skin was cold.\""
    },
    {
      "title": "Avoid empty descriptive words.",
      "content": "Avoid empty descriptive words. One way to make sure you are showing and not telling is to seek out empty descriptors in your writing. These are words – usually adjectives – like \"delicious,\" which describe without really telling you anything. So the meal was delicious. How so? Did lightly fried sardines accompanied with a sweet wine smelling of apricots give way to a tartrate of egg and pungent cheese, spiced with cardamom and a dozen other spices she could not identify? Was the bread dense and rich, with a hint of earthiness, as if it had grown directly from the dark soil outside the hut? Some empty descriptors to watch out for include: Beautiful Amazing, incredible Size adjectives (tall, short, big, large, small) Good or bad Young, old Empty language also happens in non-fiction academic writing. For example, a thesis statement that says \"Shakespeare's Hamlet is a good play about the contrast between good and evil\" is shallow and doesn't provide any detail about your claim. In contrast, compare this detailed thesis statement: \"Shakespeare's Hamlet examines the nuances of intention. Hamlet's intent to avenge his father may be noble, but his willingness to annihilate everyone standing in his path to that revenge eventually outweighs any good in his purpose, making him as much a villain as King Claudius.\""
    },
    {
      "title": "Get rid of most adverbs.",
      "content": "Get rid of most adverbs. Stephen King believes \"the road to hell is paved with adverbs,\" and he is not alone. [2] X Research source Adverbs – words that modify adjectives, verbs, or other adverbs and usually end in -ly – should be used cautiously. Occasionally, they can be helpful, but for the most part, you should search for a more descriptive verb, or add context that makes the adverb unnecessary. For example: [3] X Research source Avoid said-modifiers. Instead of \"said softly\", try \"whispered.\" Instead of \"said fearfully\", \"whimpered.\" Avoid motion-modifiers. Instead of \"walked slowly,\" try \"sauntered\", \"meandered\", or \"strolled.\" Instead of \"walked quickly,\" \"hurried\" or \"scampered\". Replace adverbs with detailed context: Instead of writing \"she walked softly,\" think about why she's walking that way and how it makes her feel. \"She tip-toed past the guard, each creak of the floorboards sounding to her like thunder.\""
    },
    {
      "title": "Draw on all five senses.",
      "content": "Draw on all five senses. Smell, sound, taste, and touch can make your descriptions more vivid and tangible. They can take you to a place in a way that visual description often cannot. Think of the salty smell of sea air or the hiss of wind over new-fallen snow. Smell – Patrick Suskind's Perfume: The Story of a Murderer has, appropriately, some particularly vivid descriptions of smell. \"People stank of sweat and unwashed clothes; from their mouths came the stench of rotting teeth, from their bellies that of onions, and from their bodies, if they were no longer very young, came the stench of rancid cheese and sour milk and tumorous disease.\" Taste – Particularly effective with food, taste language can be even more powerful elsewhere: \"A wave engulfed him. He came up and spit the briny water from his mouth.\" Sound – Listen to how Robert Frost describes the sound of a wood at night: \"Which has its sounds, familiar, like the roar / Of trees and crack of branches, common things, / But nothing so like beating on a box.\" (Robert Frost, \"An Old Man's Winter Night\") Touch – In \"Once More to the Lake,\" E.B. White vividly evokes the sensation of pulling on wet, cold swimming trunks: \"He pulled his dripping trunks from the line… I watched him, his hard little body, skinny and bare, saw him wince slightly as he pulled up around his vitals the small, soggy, icy garment.\""
    },
    {
      "title": "Make judicious use of similes and metaphors.",
      "content": "Make judicious use of similes and metaphors. A simile is a figure of speech that uses \"like\" or \"as\" to make a comparison between two things: \"his eyes were as big as saucers as he gazed at the cake.\" A metaphor makes an implicit comparison without using \"like\" or \"as\": \"his eyes were saucers as he gazed at the cake.\" A well chosen metaphor, like Shakespeare's famous \"All the world's a stage,\" can illuminate, while a poor one will only confuse. To get it right, follow these rules: [4] X Research source Make your metaphors and similes simple and clear. The more elaborate they become, the more likely they are to confuse rather than to illuminate. Don't mix them. Pick a comparison and stick with that. Otherwise, you risk writing nonsense like this: \"The president will put the ship of state on its feet.\" [5] X Research source Only use original ones. Using timeworn comparisons like \"slow as a snail\" won't add anything to your writing. If the comparison isn't vivid and interesting, simply stick with a straightforward description. Use them to vividly evoke sensations. The most powerful metaphors and similes typically paint a picture or evoke a particular sound, taste, smell, or feeling. The more tangible the better, like \"The water made a sound like kittens lapping\" ( The Yearling by Marjorie Kinnan Rawlings)"
    },
    {
      "title": "Start with general background research.",
      "content": "Start with general background research. The beginning point for any piece of writing should be general research into the topic. This will mean different things for different types of writing: Fiction – Explore in-depth details that are important to the story. This might mean learning more about the job of the main character, or the setting. The goal is to learn enough to start writing. Don't worry about learning every little detail. Academic non-fiction – Background research means being aware of the literature in the field regarding your topic. You should have read and digested all the works that your own article or book is in dialogue with. Professional writing – Whether writing a pitch or a pleading, you'll again want to have researched the important details. Know enough to frame the outline of your argument. Then, fill in that frame as you write."
    },
    {
      "title": "Use the internet to help with background research.",
      "content": "Use the internet to help with background research. Wikipedia is a great place to start for general information. But never settle for internet research. Sources online are famously unreliable. Be sure to verify any information you are going to use with at least three independent sources. [6] X Research source When doing research, peer-reviewed journal articles in your field are the gold standard. Books from well-respected publishers, especially university presses, and government sources are also places to look. Always try to find the most reputable sources possible."
    },
    {
      "title": "Begin writing before you've finished your research.",
      "content": "Begin writing before you've finished your research. Whether writing fiction, non-fiction, or a professional document, you'll end up wasting time if you try to research every little thing before you start writing. This is because it's impossible to know exactly what information you'll need until you start writing. It is much more efficient to learn the basics, establish an outline, and then fill in the details you need as you go."
    },
    {
      "title": "Use bibliographies and notes to find more sources.",
      "content": "Use bibliographies and notes to find more sources. If you find an interesting fact in a book, use the citation to find out where it came from. Read that. This is a great way to get to primary sources. That's where you want to be: looking at the actual material so you can provide your own insights or put your own spin on things."
    },
    {
      "title": "Make friends with librarians.",
      "content": "Make friends with librarians. College and university librarians, in particular, can be a great resource. They can guide you to useful sources that you might not otherwise find. And they are usually happy to help. It's their job. [7] X Research source"
    },
    {
      "title": "Keep track of your sources.",
      "content": "Keep track of your sources. Take careful notes regarding where you found any information that you are considering using. For non-fiction writing, citing your sources is vital to establish the legitimacy of your argument and to avoid accusations of plagiarism. But even when researching for fiction, it is helpful to know where you found things in case you need to look them up again."
    },
    {
      "title": "Move beyond physical appearance with characters.",
      "content": "Move beyond physical appearance with characters. It's important to know what characters look like, but how a character thinks, talks or moves can leave an even more powerful impression. Think of Sherlock Holmes. His defining features are that he is ridiculously smart, doesn't like other people, and is a bit of a drug addict. When establishing a character try: [8] X Research source Using other character's reactions to convey information, e.g., \"The conversation ceased as Esmeralda entered the room. Every eye fixed on her.\" Use a character's history to convey his or her qualities: \"His appetite was legendary. It was said he had once eaten an entire boar in one sitting.\" Or, \"He had once gone a year without uttering anything beyond 'yes, sir', 'no, sir', or 'I should think not, sir.'\" Focus on a character's movement rather than his or her appearance, e.g., \"She moved with the grace of a dancer.\" If you are going to discuss appearance, don't describe everything. Pick a particular defining feature: \"Vic's a square-set, ready-and-steady sort of bloke, the sort of bloke who rubs his hands together at the start of something. His hands are always clean.\" (Graham Swift, Last Orders )"
    },
    {
      "title": "Use voice to create character.",
      "content": "Use voice to create character. The most powerful characters are often defined by the way they talk or think, like Balram Halwai, the hero of Aravind Adiga's The White Tiger . His voice is smart and humorous and alive: \"Out of respect for the love of liberty shown by the Chinese people, and also in the belief that the future of the world lies with the yellow man and the brown man now that our erstwhile master, the white-skinned man, has wasted himself through buggery, cell phone usage, and drug abuse, I offer to tell you, free of charge, the truth about Bangalore.\""
    },
    {
      "title": "Keep descriptions of settings and objects short.",
      "content": "Keep descriptions of settings and objects short. You don't need to go on and on to create a vivid picture. Doing so will only slow down your story. Instead, focus on a few key details and let the reader fill in the rest. Few writers do this better than Erik Morgenstern in The Night Circus , a book filled with dizzily clever, yet surprisingly compact descriptions, like this one of a fantastic clock: \"The body of the clock, which has been methodically turning itself inside out and expanding, is now entirely subtle shades of white and grey. And it is not just pieces, it is figures and objects, perfectly carved flowers and planets and tiny books with actual paper pages that turn.\""
    },
    {
      "title": "Use real place details judiciously.",
      "content": "Use real place details judiciously. For many books – particularly historical fiction – the setting is almost another character. Yet when describing a real place – say 19th century France – you don't want to drown the reader in details. Instead, choose a few to give a sense of place, e.g., the small circles of light thrown by the gas lamps, illuminating sections of paved street; the smell of freshly-baked bread mixing with the stench of the Seine; the chiming of bells from a hundred churches. Sprinkle in place names to give a sense of place. Instead of \"the river\", \"the Seine.\" Instead of a broad square, the \"Place de la Bastille.\" Foreign words can also create a sense of place, if sprinkled judiciously throughout your text. James Clavell's Shogun , set in feudal Japan, does a fantastic job of this. \"Hai\" is used instead of \"yes.\" \"Tomodachi\" for \"friend.\" \"Domo\" for \"thank you.\""
    },
    {
      "title": "Describe through absence.",
      "content": "Describe through absence. Sometimes, the key detail is what is not there. [9] X Research source A woman might enter a ball in a fabulous dress with a smile on her face, but no joy in her eyes. A forest might feature towering oaks and lush undergrowth, but no birdsong or animal calls, not even the buzzing of insects. Remember that what is not there can sometimes reveal more than what is there. Erin Morgenstern's The Night Circus , again, provides a great example of description through absence. In introducing the circus, he defines it through what it lacks: color. \"The towering tents are striped in black and white, no golds and crimsons to be seen. No color at all, save for the neighboring trees and the grass of the surrounding fields… Even what ground is visible from the outside is black or white, painted or powdered, or treated with some other circus trick.\""
    }
  ]
}