{
  "url": "https://www.wikihow.com/Baking-Soda-Face-Scrub",
  "title": "6 Baking Soda Face Scrubs for Smooth, Glowing Skin",
  "steps": [
    {
      "title": "Baking soda + your usual cleanser",
      "content": "Baking soda + your usual cleanser If you haven’t used baking soda on your skin before, experiment by adding a pinch to your usual face wash or cleanser. The added baking soda will give you extra exfoliating power. If your skin reacts well, feel free to experiment with more baking soda-heavy masks and scrubs! To use: Add ½ teaspoon (4 g) of baking soda to your normal amount of face wash. Scrub and rinse as normal."
    },
    {
      "title": "Simple baking soda paste",
      "content": "Simple baking soda paste This easy-to-make paste only uses baking soda and water. It works great as a face wash or as an exfoliator after you’ve washed your face with a different cleanser. [1] X Research source To use: Mix 3 parts baking soda and 1 part water in a bowl to form a soft paste (use less water to make it thicker or add more to make it runnier). Massage into your face in gentle circular motions, then rinse your face and blot dry. Bonus tip: Moisturize your face after using a baking soda face scrub since it may dry out your skin a bit."
    },
    {
      "title": "Oat flour and baking soda scrub for sensitive skin",
      "content": "Oat flour and baking soda scrub for sensitive skin If you’ve had chickenpox before, you might’ve taken an oatmeal bath to soothe your skin. This scrub also uses oats to calm your skin while it gets exfoliated by the more abrasive baking soda. [2] X Research source To use: Mix 1 teaspoon (5 g) of baking soda, 2 teaspoons (7 g) of oat flour, and 1 tablespoon (15 ml) of warm water into a paste. Rinse your face with plain water, then apply the mixture by gently rubbing it into your skin with circular motions. Let it sit and dry for 3-5 minutes, then rinse away with warm water. Bonus tip: If you don’t have oat flour on hand, throw some oatmeal into a coffee grinder and run it until it looks fine like flour."
    },
    {
      "title": "Moisturizing coconut oil and baking soda scrub",
      "content": "Moisturizing coconut oil and baking soda scrub Coconut oil is a common moisturizing ingredient, and this scrub is sure to leave your skin smooth and with its moisture barrier intact. [3] X Research source To use: Mix in ½ teaspoon (4 g) of baking soda for every 1 tablespoon (15 mL) of coconut oil you use. Spread the mixture onto your face and let it sit for 5 to 10 minutes. Gently massage the paste into your skin for another 2 or 3 minutes, then rinse and pat dry."
    },
    {
      "title": "Soothing honey and baking soda face mask",
      "content": "Soothing honey and baking soda face mask Like baking soda, honey has antibacterial and anti-inflammatory properties to soothe your face and help get rid of acne-causing bacteria. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Plus, this scrub is all-natural and eco-friendly! [5] X Research source To use: Mix 4 tablespoons (68 g) of baking soda and 1 tablespoon (15 mL) of honey in a bowl. Add no more than 2 teaspoons (10 mL) of water to form a paste. Massage onto your skin and let it sit for 15-20 minutes. When time’s up, moisten a clean cloth and gently buff the paste off of your skin. Rinse and pat your face dry."
    },
    {
      "title": "Lemon and baking soda face brightening mask",
      "content": "Lemon and baking soda face brightening mask Lemon juice is a natural brightener and also has some antimicrobial properties to clean your skin. Add in the exfoliating power of baking soda, and you’ll feel fresh all day! [6] X Research source To use: Mix the juice of half a lemon, 1-2 tablespoons (17-34 g) of baking soda (depending on the thickness you want), and 1 teaspoon (5 mL) of honey to balance out the acidity. Gently apply the mixture to your face (avoiding your eyes, nose, and any cuts—lemon stings!) and leave on for 10 minutes. Rinse the mask off with cool water and pat your face dry to reveal glowing skin."
    },
    {
      "title": "Pros",
      "content": "Pros Baking soda is a naturally abrasive deodorizer with antibacterial properties. [7] X Research source This makes it great for cleaning both your skin and other items around the house! Here are baking soda’s specific benefits for your skin: [8] X Research source It’s a natural exfoliator that clears away dead skin cells that can clog your pores, remove blackheads), and leave behind smoother and brighter skin. It removes acne-causing oil from your skin to help prevent breakouts. It’s cheap! A typical 16-ounce (170 g) box usually costs less than a dollar."
    },
    {
      "title": "Cons",
      "content": "Cons You’re unlikely to experience many issues if you use baking soda on your face sparingly—most recommend exfoliating with it only 2 or 3 times a week to let your scrubbed skin heal. [9] X Research source But, if you have sensitive skin or use it too often, you may experience some side effects like: [10] X Research source Over-exfoliation. Baking soda is abrasive and may leave micro-tears in your skin, leaving your face irritated and vulnerable to infection. If you have sensitive skin, use a chemical exfoliant instead of baking soda. A disrupted pH balance. Your skin is naturally slightly acidic, but baking soda is alkaline. Kula explains that “the pH level of baking soda is alkaline and can strip the skin’s protective moisture barrier.” To combat this, make sure you moisturize your face after every baking soda scrub!"
    },
    {
      "title": "Use baking soda as a whitening toothpaste.",
      "content": "Use baking soda as a whitening toothpaste. Mix a small amount of baking soda with a few drops of water to form a paste. Put the paste on your toothbrush and brush as normal. [11] X Research source Baking soda’s abrasiveness helps remove surface stains from your teeth, and its alkaline nature may help eliminate bacteria in your mouth."
    },
    {
      "title": "Sprinkle on baking soda as a natural deodorant.",
      "content": "Sprinkle on baking soda as a natural deodorant. If you’re out of deodorant and in a bind, dust some baking soda over your underarms. It’ll absorb odors and moisture, leaving you feeling fresh and dry. [12] X Research source Just keep in mind that it’s not an antiperspirant, so you may have to reapply later if moisture or odors come back. Alternatively, make a baking soda paste with water and rub it into your underarms. Let it dry completely before putting clothes on. Bonus: Baking soda’s exfoliating properties can also help correct any darkness under your arms. [13] X Research source"
    },
    {
      "title": "Swap dry shampoo for baking soda.",
      "content": "Swap dry shampoo for baking soda. If you’re looking for an all-natural alternative to chemical-based dry shampoo, you’re in luck. Baking soda attracts and absorbs moisture, including any grease or oil in your hair. Just sprinkle a dash of baking soda on top of your scalp and rub it in with your fingers until it’s no longer visible. [14] X Research source"
    },
    {
      "title": "Use baking soda to soothe your skin after a shave.",
      "content": "Use baking soda to soothe your skin after a shave. Baking soda has some anti-inflammatory properties and a refreshing effect on the skin—perfect for handling irritation after shaving . Make a simple baking soda paste and apply it to your clean, shaved skin. Let it dry for about 10 minutes, then rinse away with cool water. [15] X Research source You can repeat this up to twice a day if needed. Warning: Baking soda will sting if you have a cut, so be careful not to spread it over a nick from your razor."
    },
    {
      "title": "Add baking soda to your bath to soothe irritated skin.",
      "content": "Add baking soda to your bath to soothe irritated skin. Baking soda’s soothing and anti-inflammatory properties are great for treating irritation from dermatitis, eczema, and anything that makes you itch. All you have to do is add 1 cup (240 g) of baking soda to a warm bath and soak for up to 30 minutes. [16] X Research source Use warm water that’s just a bit higher than your body temperature—no more than about 105°F (40°C). Hotter water can dry out your skin and irritate it even more."
    },
    {
      "title": "Make a nail scrub to prep for your next mani-pedi.",
      "content": "Make a nail scrub to prep for your next mani-pedi. A good hand or foot soak with baking soda can soften tough cuticles, soothe your skin, and buff your nails before your appointment. First, soak your hands or feet for 10 minutes in a mixture of 1 tablespoon (17 g) of baking soda per gallon (3.8 L) of warm water. Afterward, rub some baking soda on top of your nails to give them a quick buff. [17] X Research source When you're done, rinse off with cool water, and you’re ready to go!"
    },
    {
      "title": "Use baking soda as a DIY clarifying shampoo.",
      "content": "Use baking soda as a DIY clarifying shampoo. Nguyen explains that “baking soda can be great as an exfoliator for your scalp when shampooing or when you want to use it to clarify your hair. Wet your hair in the shower and apply a baking soda and water paste to the scalp. Gently massage the paste to clean your scalp—this is where dirt, oil, and bacteria accumulate.” “Once you’re done exfoliating, spray a 50/50 mix of water and apple cider vinegar on your scalp and massage it in like you’re shampooing, then rinse,” Nguyen adds. The benefits? “Your hair and scalp will be very clean and healthy. You’ll also increase blood circulation to your scalp, which is needed to feed your hair and scalp,” explains Nguyen. “Use this method when your hair is oily or you are experiencing dandruff issues,” Nguyen concludes. “Since it is very good at removing buildup on the hair, using it frequently can dry your hair. If you have eczema or psoriasis on your scalp, this method will be too abrasive.”"
    }
  ]
}