{
  "url": "https://www.wikihow.com/Check-the-Points-on-Your-Driver%27s-License",
  "title": "How to Check the Points on Your Driver's License",
  "steps": [
    {
      "title": "Go online for a fast and easy option.",
      "content": "Go online for a fast and easy option. By going online, you will be able to print your driving record as soon as you pay the fee. Make sure you are using a computer that has a printer so you can print your driving record. [1] X Research source If you do not have access to a computer with a printer, then go to the DMV to get your driving record if you need it right away."
    },
    {
      "title": "Visit the website of your local DMV.",
      "content": "Visit the website of your local DMV. In your search engine, type “DMV” and your city or state’s name; for example, “DMV Texas.” This should pull up a list of DMVs located near you. Choose the DMV closest to your home. [2] X Research source"
    },
    {
      "title": "Click the driver records link.",
      "content": "Click the driver records link. On the website’s homepage, look for a link on the left-hand side that says “Reports and Records,” “Driving Record Status,” “Online Services,” “Driver’s License Check,” or something similar. Once you click the link, you will be redirected to a page that contains more information about obtaining your driving record. [3] X Research source Because DMV websites vary, they use different terms for checking your driving record."
    },
    {
      "title": "Provide your personal information to access your driving record.",
      "content": "Provide your personal information to access your driving record. You typically need to provide your driver’s license number, date of birth, the last 4 digits of your Social Security number, and your name. Type your information into the website. You do not need to upload copies of any identifying documents. [4] X Research source Secure websites have a web address that starts with \"https://\" and a padlock symbol, indicating that the connection and your information are encrypted and safe."
    },
    {
      "title": "Pay the fee to access your driving record.",
      "content": "Pay the fee to access your driving record. The Department of Motor Vehicles (DMV) may charge you a fee to view your driving record, especially if you want a certified copy of your driving record. Fees typically range from $4 to $10. [5] X Research source"
    },
    {
      "title": "Use the DMV's third party vendor to obtain your driving record.",
      "content": "Use the DMV's third party vendor to obtain your driving record. Use a third party vendor if you don’t have the time to obtain the record yourself. Certified vendors are listed on the DMV's website. The vendor will use your information to submit a request for your driving record. Once they receive the record, they will pass it on to you. It typically takes 2 to 3 days for you to receive your record. Venders charge $30 to $40 for their services. [6] X Research source If you are using a third party vendor, make sure they clearly state that they will provide a certified copy of your record if that is what you need. Avoid using vendors that are not listed on the DMV's website; these vendors may be a scam."
    },
    {
      "title": "Use the mail if you don't mind waiting.",
      "content": "Use the mail if you don't mind waiting. It takes time for the DMV to receive your form and then mail your driving record to you. If you are not pressed for time, then use the mail. [7] X Research source"
    },
    {
      "title": "Obtain a Request for Driver Records form.",
      "content": "Obtain a Request for Driver Records form. You can find a request form on the website of your local DMV. On the DMV’s homepage, click on a “Driver’s License Status,” “Online Services, “Driving Records Check,” or another similar link. You will be directed to a page that contains instructions on how to access your driving record. [8] X Research source"
    },
    {
      "title": "Download and print the form.",
      "content": "Download and print the form. Scroll down to the section titled “Ordering Your Driving Record.” Look under “By Mail.” There should be a link to download the form. Click on the link to download and print the form. [9] X Research source"
    },
    {
      "title": "Fill out all of the required information on the form.",
      "content": "Fill out all of the required information on the form. You may need to provide your name, driver’s license number, and the last 4 digits of your Social Security number. You may also be required to provide other important identifying information like your birth date and zip code. [10] X Research source Some states require that you get the form notarized. Visit your local bank or post office to have your form notarized. You do not need to upload copies of any official documents."
    },
    {
      "title": "Write a check to pay the fee.",
      "content": "Write a check to pay the fee. Fees typically range from $4 to $10. Make your check payable to your state’s Department of Public Safety. [11] X Research source Alternatively, use a money order to pay the fee."
    },
    {
      "title": "Mail the form and check to the address on the form.",
      "content": "Mail the form and check to the address on the form. If an address is not located on the form, then check the website for an address. Mail the form to the address that is provided. Use the regular mailing service to send the form. [12] X Research source Alternatively, drop the form off at the post office for faster service. You can also ask the post office for a tracking number. It may take up to 2 to 3 weeks to receive your driving record through the mail."
    },
    {
      "title": "Visit the DMV to receive your driving record right away.",
      "content": "Visit the DMV to receive your driving record right away. If you need your record right away, then going to the DMV may be the best option. Since Tuesdays, Wednesdays, and Thursdays are the DMV's least busiest days, visit your local DMV office on these days. You can search for offices near you online. In your search engine type, “DMV offices near me.” [13] X Research source Additionally, avoid the lunch rush by going to the DMV between 10:30 a.m. and 11:30 a.m. In some locations, you may be able to make an appointment online so you don’t have to wait in line."
    },
    {
      "title": "Fill out the application.",
      "content": "Fill out the application. Obtain an application from the attendant. Fill out all of the required information, including your name, birth date, and the last 4 digits of your Social Security number. You may also need to provide your zip code. [14] X Research source Alternatively, visit your local DMV’s website to download the form. Fill out the form before you go to the DMV."
    },
    {
      "title": "Submit the form with identification.",
      "content": "Submit the form with identification. Submit your form and the necessary identification to the attendant. You can use your driver’s license, a valid U.S. passport, a state ID, birth certificate, or your Social Security card for identification purposes. [15] X Research source"
    },
    {
      "title": "Pay the fee and receive your driving record.",
      "content": "Pay the fee and receive your driving record. You must pay the fee to receive your driving record. Fees typically range from $4 to $10. Once you pay the fee, the attendant will give you a certified copy of your driving record. [16] X Research source Make sure to bring cash or your checkbook with you since some offices only accept cash or check to pay for the fee."
    }
  ]
}