{
  "url": "https://www.wikihow.com/Catan-Strategy",
  "title": "How to Win Catan: 13 Tips and Tricks",
  "steps": [
    {
      "title": "Place your settlements strategically so every dice roll pays off.",
      "content": "Place your settlements strategically so every dice roll pays off. When you play Settlers of Catan , keep an eye on all the hexagons placed down—they represent resources. Take a look at the dots, or “pips,” at the bottom of each hexagonal tile, or “hex.” 1 dot means you’ll have a low probability of rolling for it, while 2-5 dots tell you that you’ll have a much greater chance of your dice landing on the hex’s number. Put your settlements down on hexes with the most pips since you’re more likely to roll for them. [1] X Research source 1 dot represents rolling for the numbers 2 or 12. 2 dots represent rolling for the numbers 3 or 11. 3 dots represent rolling for the numbers 4 or 10. 4 dots represent rolling for the numbers 5 or 9. 5 dots represent rolling for the numbers 6 or 8. 7 is the number you’re most likely to roll, but it activates the Robber. Place a settlement piece at the intersection of 3 hexes. When you have 3 hexes and each have lots of “pips,” you’re more likely to roll for an important resource—like wood, brick, sheep, wheat, or ore."
    },
    {
      "title": "Try to get all 5 resources to build roads, settlements, and cities.",
      "content": "Try to get all 5 resources to build roads, settlements, and cities. Ideally, position your first 2 settlements so you get 1 of every resource ASAP. To start collecting wood, brick, sheep, wheat, and ore right away, place 1 settlement at the intersection of 3 hexes that each represent 1 resource. In the next round, put 1 settlement down between 2 hexes for the last 2 resources. [2] X Research source For example, place 1 settlement down between 3 hexes that’ll give you wheat, brick, and sheep. Then, put 1 settlement down between 2 hexes that’ll help you collect wood and ore. A road is built with 2 resources—1 wood and 1 brick. A settlement is built with 4 resources—1 wood, 1 brick, 1 sheep, and 1 wheat. A city requires the most resources. You’ll need 3 ore, 2 wheat, and 1 settlement. Overall, a city costs 9 resources."
    },
    {
      "title": "Rack up 2 Victory Points by picking up the Longest Road card.",
      "content": "Rack up 2 Victory Points by picking up the Longest Road card. To earn 2 extra Victory Points with the Longest Road development card, make sure you have 5 road pieces that are all connected to each other. If another player has the Longest Road card, take it away by building a continuous road that’s longer than theirs. [3] X Research source For example, if your opponent claimed the Longest Road card because they had 6 road pieces, build a continuous road out of 7 road pieces and take the development card from them. To hold onto the Longest Road card for good, build a continuous road out of 15 road pieces before anyone else does. Each player only gets 15 road pieces, so as long as you beat them to the punch, you’ve got 2 Victory Points in the bag."
    },
    {
      "title": "Score 2 Victory Points by pulling the Largest Army card.",
      "content": "Score 2 Victory Points by pulling the Largest Army card. To collect 2 Victory Points with the Largest Army development card, collect 3 Knight cards and play them during your turn. In order to hold onto your precious 2 Victory Points so they’ll help you get closer to the 10 Victory Points you need to win Catan, gather more Knight cards. [4] X Research source If your opponent plays more Knight cards, they’ll be able to swipe the Largest Army card from you. Foil their plans by holding onto any of the Knight cards you pull. There are 14 Knight cards in the base game of Catan."
    },
    {
      "title": "Use 1 Knight to move a Robber or 3 to get a Largest Army card.",
      "content": "Use 1 Knight to move a Robber or 3 to get a Largest Army card. If an opponent rolled a “7” and slyly moved the Robber from the desert to one of your hexes, protect your valuable resources. Provided you have at least 1 Knight card, play it to kick the Robber off. Once you do, place the Robber on another unlucky opponent’s hex and steal one of their cards. If you play 3 Knight cards, claim a Largest Army card and earn 2 Victory Points. You’ll probably have lots of chances to use Knight cards to your advantage. After all, Knight cards make up 14 out of the 25 development cards in Catan, which accounts for 56% of the deck."
    },
    {
      "title": "Put a Robber on an opponent’s tile to steal all their resources.",
      "content": "Put a Robber on an opponent’s tile to steal all their resources. When you roll a “7,” you’ve basically got two options—show mercy or be petty (all in good fun, of course). If some of the other players only have 2 Victory Points each, be a “Friendly Robber” and give them a pass. However, if everyone has more than 2 Victory Points, move the Robber to any hex and take a resource from an opponent whose settlement is bordering the tile. [5] X Research source Once the Robber is on a hex, that tile won’t be able to produce any resources. If a player rolls another “7,” then the Robber returns to the desert. A player can kick a Robber off their hex with a Knight card. If you want to play super nice, put the Robber on a hex no one’s using."
    },
    {
      "title": "Use the Monopoly card to take all of any 1 resource from every player.",
      "content": "Use the Monopoly card to take all of any 1 resource from every player. When you draw the Monopoly card, you’re in luck—but for everyone else, it’s probably a turn for the worse. Play this intimidating development card during your turn to announce 1 resource, like sheep, that you’d like to take from everyone. They’ll have to give you all of those resource cards in their hand. [6] X Research source Keep in mind that tensions can get pretty high when you play the Monopoly card. If you want some extra spicy gameplay, throw down the Monopoly card when there’s a resource shortage. For example, if everyone’s been waiting for someone to finally roll a “4” so they can collect some long-awaited wood, play the Monopoly card to swipe it all."
    },
    {
      "title": "Build roads and settlements when you stockpile wood and brick.",
      "content": "Build roads and settlements when you stockpile wood and brick. If you’d like to pave the way toward the 10 Victory Points you need to conquer Catan, collect these 2 go-to resources. You’ll be able to not only build settlements for 1 Victory Point each but also the Longest Road for 2 Victory Points. [7] X Research source Settlements and/or the Longest Road can just be ways to quickly pad your amount of Victory Points if you’ve already racked up some VP from building cities or the Largest Army. Since everyone starts off with 2 settlements, you’ll have 2 initial Victory Points. Build 8 settlements to earn 10 Victory Points overall—of course, you’ll need 8 wood and 8 brick as well as 8 sheep and 8 wheat. It’s definitely “playing the long game,” but you’ll probably make your friends laugh. 2 starting Victory Points, 1 Longest Road, and 6 settlements will also help you win Catan."
    },
    {
      "title": "Barter for resources during key moments to win an advantage.",
      "content": "Barter for resources during key moments to win an advantage. Expect some friendly banter and easy exchanges when you kick off a game of Catan. If you’re short on sheep, some smooth talking might earn you a flock of 3 for the low price of 2 wood. However, as everything draws to a close and people race to get their last Victory Points, anticipate some stinginess. You’ll probably have to haggle your heart out for 1 measly resource. [8] X Research source In the first rounds of the game, players usually want to branch out and build as many settlements and roads as they can, so they’re typically more willing to trade. When Catan draws to a close, every Victory Point counts. Your opponents will probably want to hoard their resources in case they come in handy. If they do trade, they might ask for a steep price. For example, they might fleece you by asking for 5 sheep just for 1 brick."
    },
    {
      "title": "Get rid of a surplus of resources to score what you actually need.",
      "content": "Get rid of a surplus of resources to score what you actually need. If you don’t want to give an opponent an upper hand, give the bank any extra resources you have. While a 4:1 deal might sound expensive, it’s a pretty great situation if you need to offload anything. For example, you might really need 1 wheat, so you’ll let the bank take 4 wood off your hands. With that slick trade, you might be able to build, for instance, that city that will help you dominate the game with 2 Victory Points. [9] X Research source It’s possible that your friends might be a little bummed that they couldn’t trade with you, but the advantage you get will probably be worth it."
    },
    {
      "title": "Put settlements on ports in case you need a hard-to-find resource.",
      "content": "Put settlements on ports in case you need a hard-to-find resource. If a 4:1 return feels too pricey, handle your trades at ports. When you build a settlement at a port, you’ll be able to trade 2 of one resource for 1 resource or 3 of one resource for 1 resource. The ratio just depends on whether you built a settlement on a 2:1 or 3:1 coastal hex in Catan: Seafarers . For example, if you built a port on a 2:1 coastal hex, trade in 2 wheat and claim 1 ore from the bank. Catan: Seafarers is an expansion for the base game."
    },
    {
      "title": "Build 3 cities, grow the Largest Army, and earn 4 Victory Points to win.",
      "content": "Build 3 cities, grow the Largest Army, and earn 4 Victory Points to win. For a fast track to the 10 Victory Points required to win Catan, level up your settlements. Spend 3 ore and 2 wheat to turn each settlement into a city. With every city that you establish, you’ll earn 2 Victory Points. 3 cities give you 6 Victory Points, so if you pair them with the Largest Army card—worth 2 Victory Points—you’ll earn 8 Victory Points and conquer Catan. [10] X Research source Remember, you start off with 2 Victory Points after placing your first settlements, so if you earn 8 Victory Points, you’re golden (and a winner)."
    },
    {
      "title": "Use any trick you can at Catan’s endgame to get 10 Victory Points.",
      "content": "Use any trick you can at Catan’s endgame to get 10 Victory Points. In the last rounds of Catan, it’s okay to get a little wild. Maybe you played it safe by quietly building 2 settlements for 1 Victory Point each and 2 cities for 4 Victory Points overall. In this case, trade in 3 or more Knight cards to claim the Largest Army card and get the final 2 Victory Points to steal the show and beat Catan. [11] X Research source Create a longer road than someone else and steal their Longest Road card to earn 2 Victory Points. You might just need to put down a couple more road pieces for this slick trick. Start randomly upgrading your settlements into cities to steal a win before your friends’ eyes with all those extra Victory Points. Trade at a bank or port to get that last resource you need, like 1 brick, to put down a settlement and get that final Victory Point that’ll tip the scales for you."
    }
  ]
}