{
  "url": "https://www.wikihow.com/Connect-Two-Monitors",
  "title": "How to Connect Two Monitors",
  "steps": [
    {
      "title": "Make sure your computer can support multiple displays.",
      "content": "Make sure your computer can support multiple displays. This isn't usually an issue for laptop computers, but your desktop computer may not meet the requirements for adding a second monitor: [1] X Research source Laptop — If your laptop has at least one video output port, you can use it to connect a second monitor. Desktop — Your desktop computer must have at least two video ports in total (one to connect the primary monitor and one to connect the second monitor). The ports do not have to match, but they do have to be a part of the same graphics card; this means that if you have two graphics cards installed, you'll need to use the same one for both monitors."
    },
    {
      "title": "Identify your computer's video output port.",
      "content": "Identify your computer's video output port. Video output ports are found on the side of your laptop or, if you're using a desktop computer, on the back of the tower next to the port into which your primary monitor is plugged. Common output ports include the following: HDMI — Resembles a six-sided, flat port. DisplayPort — Resembles a rectangular port with a crimped side. USB-C — Resembles a thin, rounded oval port. VGA — Resembles a colored trapezoid with pinholes in it. VGA isn't common on post-2012 computers, but you may have to work with VGA if you're connecting a new computer to an old monitor (or vice versa)."
    },
    {
      "title": "Find your monitor's video input port.",
      "content": "Find your monitor's video input port. Modern monitors tend to use either DisplayPort or HDMI ports for their inputs, but some monitors will also have VGA ports. If you have an exceptionally old monitor, you may find a DVI port on the back of your second monitor. DVI ports resemble white boxes with clusters of holes, as well as a section with a few separate holes."
    },
    {
      "title": "Buy a cable to connect your monitor to your computer if necessary.",
      "content": "Buy a cable to connect your monitor to your computer if necessary. If you don't have a cable which can connect your computer to your monitor (e.g., an HDMI cable), you'll need to buy one. [3] X Research source If your computer and your monitor both have a common port (e.g., HDMI), it's easier (and cheaper) to buy a cable that fits both ports even if a higher-definition option is available. If the monitor's input doesn't match your computer's output (e.g., if the monitor uses a VGA input while your computer uses an HDMI output), you will need to buy an adapter. Some video output combinations, such as HDMI to DisplayPort, come as cables that you can purchase instead of buying an adapter."
    },
    {
      "title": "Plug one end of the cable into your computer.",
      "content": "Plug one end of the cable into your computer. The cable should plug into your computer's video output port. Remember, if you're using a desktop computer, this must be a video output port that is part of the same graphics card that your primary monitor uses."
    },
    {
      "title": "Plug the other end of the cable into your monitor.",
      "content": "Plug the other end of the cable into your monitor. The free end of the cable should fit into your selected port on the back of the monitor. If you're using an adapter, you'll plug one end of the cable into the adapter and then plug the monitor's cable into both the monitor and the adapter."
    },
    {
      "title": "Power on the monitor.",
      "content": "Power on the monitor. If your monitor isn't plugged into a power source, attach it via the included power cable; you can then press the Power button on the monitor to turn it on. Depending on your computer, you may see your desktop reflected on the second monitor when it turns on."
    },
    {
      "title": "Open Start",
      "content": "Open Start . Click the Windows logo in the bottom-left corner of the screen."
    },
    {
      "title": "Open Settings",
      "content": "Open Settings . Click the gear-shaped icon in the lower-left side of the Start window. This will open the Settings window. [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click System.",
      "content": "Click System . It's a screen-shaped icon in the upper-left side of the window."
    },
    {
      "title": "Click Display.",
      "content": "Click Display . This tab is in the upper-left corner of the window."
    },
    {
      "title": "Scroll down and click the \"Multiple displays\" drop-down box.",
      "content": "Scroll down and click the \"Multiple displays\" drop-down box. It's the box below the \"Multiple displays\" heading near the bottom of the page. Doing so will prompt a drop-down menu."
    },
    {
      "title": "Select a display option.",
      "content": "Select a display option. Depending on what you want your second monitor to do, click one of the following options: Duplicate these displays — Copies everything that's on your computer's primary display to the second monitor. Extend these displays — Creates an extension of your desktop on the second monitor. This essentially gives you more space with which to work. Show only on 1 — Blacks out the second monitor and shows content only on the first monitor. Show only on 2 — Blacks out the first monitor and shows content only on the second monitor. Depending on your computer, you may have additional options here."
    },
    {
      "title": "Know which Macs you can use.",
      "content": "Know which Macs you can use. All Macs support at least one additional monitor, though some Macs only have one available port to share between charging, file transfers, and external displays. If you have a MacBook laptop with only one port, make sure that your computer is fully charged and disconnected from any peripherals (e.g., USB flash drives) before attempting to connect another monitor. [6] X Research source"
    },
    {
      "title": "Find your Mac's video output port.",
      "content": "Find your Mac's video output port. Depending on your Mac, you'll find one (or more) of the following ports on the side of your Mac (MacBook and MacBook Pro) or on the back of your Mac (iMac): USB-C (Thunderbolt 3) — Oval-shaped port. Modern MacBooks, MacBook Pros, and iMacs have anywhere from one to four of these. Thunderbolt 2 — Square-shaped port. Found on older Macs. HDMI — Six-sided, flat port. Found on older Macs. [7] X Research source"
    },
    {
      "title": "Find your monitor's video input port.",
      "content": "Find your monitor's video input port. Modern monitors tend to use either DisplayPort or HDMI ports for their inputs, but some monitors will also have VGA ports. If you have an exceptionally old monitor, you may find a DVI port on the back of your second monitor. DVI ports resemble white boxes with clusters of holes, as well as a section with a few separate holes."
    },
    {
      "title": "Buy a cable to connect your monitor to your computer if necessary.",
      "content": "Buy a cable to connect your monitor to your computer if necessary. If you don't have a cable which can connect your computer to your monitor (e.g., an HDMI cable), you'll need to buy one. If your computer and your monitor both have a common port (e.g., HDMI), it's easier (and cheaper) to buy a cable that fits both ports even if a higher-definition option is available. If the monitor's input doesn't match your computer's output (e.g., if the monitor uses a VGA input while your computer uses an HDMI output), you will need to buy an adapter. Some video output combinations, such as HDMI to DisplayPort, come as cables that you can purchase instead of buying an adapter."
    },
    {
      "title": "Plug one end of the cable into your computer.",
      "content": "Plug one end of the cable into your computer. The cable should plug into your computer's video output port. [8] X Research source"
    },
    {
      "title": "Plug the other end of the cable into your monitor.",
      "content": "Plug the other end of the cable into your monitor. The free end of the cable should fit into your selected port on the back of the monitor. If you're using an adapter, you'll plug one end of the cable into the adapter and then plug the monitor's cable into both the monitor and the adapter."
    },
    {
      "title": "Power on the monitor.",
      "content": "Power on the monitor. If your monitor isn't plugged into a power source, attach it via the included power cable; you can then press the Power button on the monitor to turn it on. Depending on your computer, you may see your desktop reflected on the second monitor when it turns on."
    },
    {
      "title": "Open the Apple menu .",
      "content": "Open the Apple menu . Click the Apple logo in the top-left corner of the screen. A drop-down menu will appear."
    },
    {
      "title": "Click System Preferences….",
      "content": "Click System Preferences… . You'll find this option in the drop-down menu. Doing so opens the System Preferences window."
    },
    {
      "title": "Click Displays.",
      "content": "Click Displays . It's a screen-shaped icon in the System Preferences window. A pop-up window will open."
    },
    {
      "title": "Click the Arrangement tab.",
      "content": "Click the Arrangement tab. [9] X Research source This is at the top of the Displays pop-up window."
    },
    {
      "title": "Extend your desktop to the second display.",
      "content": "Extend your desktop to the second display. If you want to use the second monitor as an extension of your desktop, uncheck the \"Mirror displays\" box at the bottom of the window. [10] X Research source If you just want your second monitor to mirror whatever is on your Mac's primary monitor, skip this step."
    }
  ]
}