{
  "url": "https://www.wikihow.com/Build-a-Basic-Catapult",
  "title": "How to Build a Basic Catapult",
  "steps": [
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. This basic catapult uses tension to fling its load and can be built using a few simple supplies that can be purchased at a dollar or craft store for under $5. You may already have many of these items lying around your house! [2] X Research source 7 craft sticks. You can use either the standard 4.5\" craft sticks, or the jumbo 6\"craft sticks for this project. 4-5 elastic bands 1 bottle cap A hot glue gun and glue stick Ammunition: small marshmallows, beans, and pencil erasers are all great choices!"
    },
    {
      "title": "Create two stacks of craft sticks.",
      "content": "Create two stacks of craft sticks. These will form the body of your catapult. Stack 5 craft sticks and secure the stack with an elastic band at each end. Stack 2 more craft sticks and secure the stack on one end only, leaving the other end open."
    },
    {
      "title": "Secure the two stacks together.",
      "content": "Secure the two stacks together. Position the stacks perpendicular to one another and slide the larger stack between the two sticks of the small stack. Slide the large stack as close to the elastic band that holds the small stack as possible. Secure the stacks together where they join with an elastic band, wrapped around both stacks in a crisscross pattern. Consider adding a second elastic band to the joint to make sure it is secure."
    },
    {
      "title": "Attach the bottle cap to the catapult.",
      "content": "Attach the bottle cap to the catapult. Add a small dab of hot glue to the end of the spring arm, and press the bottle cap into the glue, holding it in place for a few seconds while the glue cools."
    },
    {
      "title": "Get ready to launch!",
      "content": "Get ready to launch! Load your ammunition of choice into the bottle cap. Hold the catapult frame securely to the table with one hand. Pull down on the lever arm with the other hand, and then let go!"
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. This catapult uses the same basic supplies as the catapult from Method 1, but uses torsion, or twisting force, to propel its payload. [3] X Research source This catapult is also quick to build and a lot of fun to fire! [4] X Research source 10 standard (4.5\") craft sticks 4-5 elastic bands 1 bottle cap A hot glue gun and glue stick Ammunition: small marshmallows, beans, and pencil erasers are all great choices!"
    },
    {
      "title": "Create one stack of craft sticks.",
      "content": "Create one stack of craft sticks. This will form the fulcrum of your catapult. Stack 5 craft sticks together and secure with rubber bands at both ends."
    },
    {
      "title": "Add the throwing arm to the catapult.",
      "content": "Add the throwing arm to the catapult. Align one craft stick perpendicular to the stack and center it, leaving 1/3\" hanging below the stack. Attach the throwing arm to the stack with 1-2 elastic bands, wrapped in a crisscross pattern. The more secure the attachment, the more spring you will get from your catapult."
    },
    {
      "title": "Build the base of the catapult.",
      "content": "Build the base of the catapult. Arrange the catapult so the stack of craft sticks is laying on the table, and the throwing arm is sticking up. Add a small dab of hot glue to each end of the stack and glue a craft stick to each end. Add another dab of glue to the end of each support you just added, and use an additional craft stick to attach the two ends, creating a rectangular base."
    },
    {
      "title": "Reinforce the throwing arm.",
      "content": "Reinforce the throwing arm. This step is optional, but will add additional stability and power to your craft stick catapult. Cut or break off a 2-inch piece of craft stick. Add a dab of hot glue to the middle of the support beam that is parallel to the fulcrum stack, and attach the piece of craft stick. Thread an elastic band over the throwing arm, and pull the end under the base of the catapult and secure it to the craft stick stub you just created."
    },
    {
      "title": "Attach the bottle cap to the throwing arm.",
      "content": "Attach the bottle cap to the throwing arm. Add a small dab of hot glue to the end of the throwing arm, and press the bottle cap into the glue, holding it in place for a few seconds while the glue cools."
    },
    {
      "title": "Fire away!",
      "content": "Fire away! Load your ammunition of choice into the bottle cap. Hold the catapult frame securely to the table with one hand. Pull down on the lever arm with the other hand, and then let go! This catapult should have a longer range and more accuracy than the basic craft stick catapult in Method 1."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. This catapult design project is used to teach engineering skills to children. It builds a slightly more complex torsion catapult than the previous methods, but requires just a few additional supplies and steps. [5] X Research source 10 standard (4.5\") craft sticks 1 jumbo (6\") craft stick 1 drinking straw 1 6\" length of wooden dowel, with a small enough diameter to fit through the straw 1 elastic band Glue gun and glue stick 1 milk jug lid or large bottle cap Ammunition! Ping pong balls and grapes both work well with this catapult project."
    },
    {
      "title": "Build two uprights for the catapult.",
      "content": "Build two uprights for the catapult. These will hold the dowel/straw fulcrum that will support the throwing arm. Add a dab of glue 1/2\" from the top of a craft stick, and attach another stick to it at approximately a 30 degree angle. Create a second upright that is the mirror image of the first."
    },
    {
      "title": "Build a base to hold the uprights.",
      "content": "Build a base to hold the uprights. Place a dab of hot glue on each of the bottom legs of the first upright, and attach a craft stick connecting the two so that the vertical portion of the upright attaches to the end of the base. Repeat this process with the second upright. Then use hot glue to attach one additional craft stick to the front of each of the uprights. The base should now form a rectangle with one end open, and the two uprights sticking up parallel to one another."
    },
    {
      "title": "Add the fulcrum to the catapult.",
      "content": "Add the fulcrum to the catapult. Cut a 2\" length of straw and slide the dowel through it. Use hot glue on to attach the dowel firmly to the wedge formed at top of the each upright."
    },
    {
      "title": "Build the throwing arm.",
      "content": "Build the throwing arm. First loop an elastic band around the craft stick that connects the two uprights. Then glue the large craft stick to the straw so that about 1/2\" hangs below the straw. Finally, carefully attach the other end of the rubber band near the bottom of the large craft stick. The throwing arm should now be able to rotate freely around the dowel on the straw, and the elastic band will put tension on the throwing arm as you pull it back. To create a strong bond with the throwing arm, use a pencil or other tool to press the elastic band firmly into the hot glue, and hold it for a few seconds until the glue cools. Do not use your fingers or you will burn yourself!"
    },
    {
      "title": "Add the finishing touches.",
      "content": "Add the finishing touches. Your catapult is nearly ready to go, but a few more steps will make it sturdier and easier to use! Attach the milk jug lid to the free end of the throwing arm with a dab of hot glue. Attach one additional craft stick horizontally to connect the slanted sides of the two uprights and provide additional stability. Add additional craft sticks to the bottom of the catapult that out as needed to keep the machine stable while firing."
    },
    {
      "title": "Fire your catapult!",
      "content": "Fire your catapult! Load a ping pong ball or grape into the milk jug lid. Pull back the throwing arm and let fly!"
    }
  ]
}