{
  "url": "https://www.wikihow.com/Change-Frigidaire-Water-Filter",
  "title": "A Step-by-Step Guide to Changing Your Frigidaire's Water Filter",
  "steps": [
    {
      "title": "Turn off the ice maker.",
      "content": "Turn off the ice maker. You don't want the ice maker pulling water from the water line while you're changing the filter! To turn off the ice maker, press and hold the \"Ice Maker\" button until you see \"Ice Maker Off.\" Follow the steps in this guide to replace the water filter on any Frigidaire refrigerator model including a gallery fridge and side-by-side model. If you're not sure what filter to buy, you can use this tool from Frigidaire or check your manual."
    },
    {
      "title": "Remove the current filter.",
      "content": "Remove the current filter. The filter is located in one of two places: in the grill at the base of the fridge or in the back upper-right corner of the interior. Push in on the filter and you'll hear a click, meaning it's unseated from the mount, and you can slide it out from the filter housing."
    },
    {
      "title": "Remove any protective caps on your new filter.",
      "content": "Remove any protective caps on your new filter. Notice that there are two valves at the top of your filter and a ridge along one side; the filter housing has a notch marking for reinserting the filter."
    },
    {
      "title": "Insert the new water filter.",
      "content": "Insert the new water filter. Turn the filter so the valves are vertically aligned and the ridge is at the bottom. Push it in like you did to remove the original filter. You will hear it click into place."
    },
    {
      "title": "Run water to clear the new filter.",
      "content": "Run water to clear the new filter. You want to make sure that there aren't any impurities in your drinking water, so run some water through the new filter first before you drink anything from it. This is the same idea for the ice maker; dump the first load of ice since it might be contaminated with impurities from the new filter. [1] X Research source Also, after replacing the filter, check to make sure there aren't any water leaks when you use the water."
    },
    {
      "title": "Turn the ice maker on.",
      "content": "Turn the ice maker on. Don't forget to turn the ice maker back on after we've turned it off! Follow the same steps that you took to turn off the ice maker to turn it on again, like pressing and holding the \"Ice Maker\" button until the \"Ice Maker Off\" icon goes away."
    },
    {
      "title": "Reset the water filter light.",
      "content": "Reset the water filter light. Press and hold the \"Reset Water Filter\" button until you hear a chime. That noise means the light is reset."
    },
    {
      "title": "Change the water filter every 6 months.",
      "content": "Change the water filter every 6 months. You can go longer without changing the filter if you use the water in your fridge less or if your tap water is clear of excess minerals; however, you may need to change the filter more often if you're using the water more or if you have particularly hard or excessive minerals in your tap water. [2] X Research source"
    },
    {
      "title": "The water in your fridge will eventually stop being filtered.",
      "content": "The water in your fridge will eventually stop being filtered. This isn't an immediate response to not changing the filter and you'll notice the quality of your water decrease as time passes. Besides the filtered water returning to tap water, you might also notice these symptoms: There's low to no ice. Slow water flow. Bad-tasting ice and water. Water or ice smells different."
    }
  ]
}