{
  "url": "https://www.wikihow.com/Braid-Your-Hair-With-Thread",
  "title": "How to Braid Your Hair With Thread",
  "steps": [
    {
      "title": "Comb",
      "content": "Comb your hair thoroughly. First, decide where you want the braid. Use a comb to section off a neat square 1–2 centimeter (0.4–0.8 in) across. It's advisable to position the braid a few centimeters away from your parting so that the top will not be visible. [1] X Research source Make sure to wash your hair with shampoo and conditioner before you start braiding—this helps it to not tangle. If it's still tangled after washing, use a detangler while brushing from the tips to the roots of your hair."
    },
    {
      "title": "Tie the rest of your hair back with the scrunchie.",
      "content": "Tie the rest of your hair back with the scrunchie. You can also use a hair band if that’s easier for you. This will make it easier to focus on your braid. As you do this, it’s a good idea to secure any wispy strands around your sectioned hair out of the way with bobby pins. [2] X Research source"
    },
    {
      "title": "Braid",
      "content": "Braid your preferred section of hair. Divide it into 3 sections, cross the right section over the middle section, then the left section over the middle section, and repeat to the end. Secure with a dab of hair gel . You can also use a hair elastic to secure the braid. [3] X Research source"
    },
    {
      "title": "Make your braid last longer by using an extra hair elastic.",
      "content": "Make your braid last longer by using an extra hair elastic. If you want your braid to last as long as possible (a few months), take an extra hair elastic and tie it about 1 centimeter (0.4 in) from the top of the plait. Hold the plait flat against your head as you do this, or your braid will stick up in the air. If you only want to keep it a short while, don't use the hair elastic. [4] X Research source"
    },
    {
      "title": "Hold the 3 strands of embroidery floss by their ends.",
      "content": "Hold the 3 strands of embroidery floss by their ends. Pass the ends through the hair above the elastic, or through the top of the plait next to the scalp. Pull them through until the same length of thread hangs on each side. [5] X Research source The length of the strands depends on the length of your hair. You should use enough floss so that it extends several inches (cm) past your own hair."
    },
    {
      "title": "Count 6 strands next to your braid.",
      "content": "Count 6 strands next to your braid. You should now have 6 strands of thread next to your plait. Select 2 (different colors will create a striped effect), pull them to the left of the plait, and smooth the other 4 down next to it. [6] X Research source"
    },
    {
      "title": "Begin braiding the threads.",
      "content": "Begin braiding the threads. Hold them so you can see strand A on the left, strand B in the middle, and the plait with the rest of the thread on the right. Pass B over the plait and bring it back to the middle. Then, pass A underneath B, then over the plait, and into the middle position. Next, pass B underneath A, over the plait, and into the middle position. Repeat these steps until you reach the end of your hair. [7] X Research source You must wrap the thread as tightly as possible, so that it sits horizontally across the plait, leaving no visible hair. You can either stop braiding at the end of your hair, or continue past it, keeping the 4 unused strands on the right hand side."
    },
    {
      "title": "Add beads to the end if you wish.",
      "content": "Add beads to the end if you wish. If you wish to add beads, just slip them over the end of the braid. Then, tie an overhand knot at the bottom of the braid. Make sure it's big enough that the beads won't slip off. [8] X Research source"
    },
    {
      "title": "Cut off any excess thread.",
      "content": "Cut off any excess thread. Make sure not to cut off any hair when you cut off the excess thread. If there’s enough thread left, you can save it for a future craft project. [9] X Research source"
    },
    {
      "title": "Cut off the thread's knot with scissors.",
      "content": "Cut off the thread's knot with scissors. To remove your braid, take a pair of sharp scissors, and cut off the knot. This will cause the thread to fall away from the plait. Then cut off the elastic if used, or just pull the thread away from the top of the hair. [10] X Research source"
    },
    {
      "title": "Separate the thread.",
      "content": "Separate the thread. When undoing the braid, you will need to separate the different bits of thread. You can begin undoing the braid once the strands of thread have been separated. Continue until your braid is completely undone. [11] X Research source"
    },
    {
      "title": "Wash your undone hair.",
      "content": "Wash your undone hair. This is especially important if your hair has been under the thread for more than a few weeks. First, comb out your hair thoroughly, as it may have become knotted during the unbraiding process. Then, wash, condition, and dry your hair as normal. [12] X Research source"
    }
  ]
}