{
  "url": "https://www.wikihow.com/Celebrate-Karva-Chauth",
  "title": "How to Celebrate Karva Chauth",
  "steps": [
    {
      "title": "Know that the festival is held in the states of Rajasthan, parts of Uttar Pradesh, Himachal Pradesh, Haryana, and Punjab.",
      "content": "Know that the festival is held in the states of Rajasthan, parts of Uttar Pradesh, Himachal Pradesh, Haryana, and Punjab. Similar festivals are held throughout India, but Karva Chauth is unique to the northern region."
    },
    {
      "title": "Begin preparing for the festivities a few days in advance.",
      "content": "Begin preparing for the festivities a few days in advance. If you're participating in the festival, you might want to buy make-up and cosmetics (shringar), adornments, jewelry and Karva lamps and plates. Local shops and bazaars decorate their stores with festive Karva Chauth products so you won't have a hard time finding plenty of fun options."
    },
    {
      "title": "Wake up before sunrise on the day of Karva Chauth.",
      "content": "Wake up before sunrise on the day of Karva Chauth. You should get up with your fellow celebrants before dawn and have something to eat and drink. If you're partaking in the festivities in Uttar Pradesh, you'll likely eat soot feni (a traditional Garbanzo bean and milk dish) with milk in sugar on the night before the celebration. This mixture allegedly helps to abstain from water the next day. The sargi(ਸਰਗੀ) in Punjab is a significant part of this pre sunrise meal. The sargi is collection of sumptuous food items, and traditionally sent or offered to your mother-in-law by you, her daughter-in-law. If you and your mother-in-law live in the same house, the pre-dawn meal will be prepared by your mother-in-law."
    },
    {
      "title": "Remember that the fast begins at dawn.",
      "content": "Remember that the fast begins at dawn. This is a tough feat, but you won't eat or drink throughout the day. And good news: you won't have to perform household tasks, either [1] X Research source ."
    },
    {
      "title": "Engage in community activities during Karva Chauth.",
      "content": "Engage in community activities during Karva Chauth. In the morning, you'll spend time with the other women in your community, and paint Henna on each other's hands and feet. Before sunset, you'll get together at one place (which can be someone's house) to perform the rituals associated with the puja. Together,you'll pray for your husbands' well-being and longevity while passing bayas to one another. The puja is a ritual during which people show reverence to a God, a spirit, or any other aspect connected to the Divine. The baya is a gift basket with items such as Almonds, pieces of jewelry, and other items."
    },
    {
      "title": "Get your husband (or fiancé) involved.",
      "content": "Get your husband (or fiancé) involved. Note that even though this festival is geared towards women, husbands actively participate. They traditionally shower their wives with gifts and treats in exchange for the tough fasting and prayers. Aside from celebrating the bond between two female friends, this holiday also serves as a reminder of the eternal bond between husband and wife [2] X Research source ."
    },
    {
      "title": "Know that women who got married left their own village or town to go live with their husband.",
      "content": "Know that women who got married left their own village or town to go live with their husband. They would share their in-laws' home, and be completely cut off from their hometown. The tradition began when these newly wed women sought out a woman to befriend in their new environment. This bond would become tremendously important, and lead to this now widely-known festival. The new friend would become a god-friend or god-sister in the newly wed's life. The women would then give each other strength, and pray for they husbands' well-being. Karva Chauth signifies the loving bond between the newly-wed and her god-sister, or god-friend. God-sisters and God-friends were treated like family members for life. A story about a highly devoted wife, Karva, who saved her husband's life provides a narrative background to the celebration."
    },
    {
      "title": "Be aware that this festival started in the northern and north Western parts of India.",
      "content": "Be aware that this festival started in the northern and north Western parts of India. Though there are various hypotheses about the origin of this celebration, no one actually knows why it was only observed in northern India in the month of October. Here are a few widely accepted notions [3] X Research source : The land was usually dry by October after the monsoon season. Military campaigns and long-distance travel usually occurred in October and November. Women started to fast to pray for their husband's (and sometimes fiancé's) longevity and safety as they resumed their travels and obligations."
    },
    {
      "title": "Be aware that the festival coincides with the wheat sowing season.",
      "content": "Be aware that the festival coincides with the wheat sowing season. The pots used to store wheat were large and earthen, and they were called karvas. The word Chauth means 'forth'. There is some speculation that the festival also originated as a plea for good harvest."
    },
    {
      "title": "Keep in mind that Karva Chauth occurs on the fourth day of the waning moon in October.",
      "content": "Keep in mind that Karva Chauth occurs on the fourth day of the waning moon in October. The celebration is also known as the 'Krishna paksha' in the month of Kartik in accordance to the Hindu calendar. There isn't a specific date, but it's always sometime in October [4] X Research source ."
    }
  ]
}