{
  "url": "https://www.wikihow.com/Clean-Parquet-Floors",
  "title": "How to Clean Parquet Floors",
  "steps": [
    {
      "title": "Vacuum the floor.",
      "content": "Vacuum the floor. Vacuuming is a good first step for clearing your floors. Since parquet floors are patterned by different sizes of wood, vacuuming can reach the dirt between the cracks. The vacuum also loosens the dirt to be scrubbed more thoroughly later."
    },
    {
      "title": "Sweep the parquet floor.",
      "content": "Sweep the parquet floor. You can use a normal brush, but you can also use a dust specific dry mop. Certain dry mops even have special tissues especially for wood floors or parquet floors. Sweeping is important to get all the bits of dirt that the vacuum missed."
    },
    {
      "title": "Mop the floor with water.",
      "content": "Mop the floor with water. Clean the parquet floor with a damp mop if your parquet floor is sealed. The trick is to use as little water as possible on the floor. Start in one corner of the room and mop in an eight symbol to remove excessive dirt and sand. Wring the mop thoroughly out, and mop the floor again to remove the excess water until the floor is dry."
    },
    {
      "title": "Perform a general cleaning regularly.",
      "content": "Perform a general cleaning regularly. It is best to do the aforementioned steps once every two weeks, if not more frequently. By doing these steps on a regular basis, you won’t be required to do a deep cleaning as often. You also will prevent the buildup of crud between the panels of wood."
    },
    {
      "title": "Start by doing a general clean.",
      "content": "Start by doing a general clean. Go through the steps of sweeping and vacuuming the floors. You should start a deep cleaning much like you would start your general cleaning. You can also mop the floors with water, but you’ll be mopping the floor with a cleaner. You will benefit the floors with two mop jobs, but this is up to you."
    },
    {
      "title": "Find special parquet flooring products.",
      "content": "Find special parquet flooring products. There are many different cleaning solutions for your parquet floors. Some products will clean the floors and place an extra sealant. This type of product is specific to wood surfaces. It cleans, polishes, and coats the flooring. Look for commercial products that enhance the flooring with nutrients and additives that make the floor look fresh. Wooden cleaners will work for parquet floors since they’re made of scraps of wood. It is important to coat the floor with a sealant to increase the longevity and durability of the floors. Avoid wax products or other cleaners that promise a shine. These products create problems when it’s time to apply another coating."
    },
    {
      "title": "Create a cleaning solution.",
      "content": "Create a cleaning solution. You don’t have to buy a commercial product if you’d rather create your own solution. Most home remedies that are safe for parquet floors include a simple mixture of mild dishwashing detergent. Mix a bucket of warm water with ¼ cup of mild dishwashing soap. Avoid using vinegar, ammonia, high pH cleaners, and any oil based soaps. [1] X Research source"
    },
    {
      "title": "Mop the floors with a cleaner.",
      "content": "Mop the floors with a cleaner. The key to mopping the floors, regardless of a cleaner, is to use a minimal amount of water. Follow the instructions if you purchased a commercial cleaner, and make sure you dilute the cleaner with the proper amount of water. Soak the mop with the cleaner water, and then spend a good bit of time draining the mop. Water is an enemy to the health of wood floors. Use as little as you can!"
    },
    {
      "title": "Protect heavy trafficked areas.",
      "content": "Protect heavy trafficked areas. Get an area rug or a rug runner for places where there will be heavy foot traffic. When selecting a rug, you should also get a rug stopper, to prevent the rug from scrunching up. Keep a rug near the door to prevent excessive dirt to be tracked onto the floor. Consider getting an outdoor rug to wipe your shoes off before entering the house."
    },
    {
      "title": "Remove furniture for cleaning.",
      "content": "Remove furniture for cleaning. To truly protect your floors, you should remove all the furniture. By doing this you will clean your parquet floors in an even manner. When you move furniture in and out of a room, be sure to handle it so that nothing scratches the floor."
    },
    {
      "title": "Trim your pet’s nails.",
      "content": "Trim your pet’s nails. Never declaw an animal because it is a cruel thing to do. Instead, you can have your cat or dog’s nails trimmed. Dogs are especially likely to scratch wooden floors due to excitement and guests."
    },
    {
      "title": "Spot clean when necessary.",
      "content": "Spot clean when necessary. If something spills onto the floors, you should take a moment to clean it up right away. Instead of waiting for your next day off to clean the floors, do a spot clean to ensure nothing stains. The best way to clean something like spilled food or liquid is with a damp cloth."
    }
  ]
}