{
  "url": "https://www.wikihow.com/Blow-Dry-Hair-With-Natural-Waves",
  "title": "How to Blow Dry Hair With Natural Waves",
  "steps": [
    {
      "title": "Start with clean hair.",
      "content": "Start with clean hair. Before you blow dry your hair, wash it with shampoo. Rinse out the shampoo, then condition your hair. Rinse the conditioner out with cool water to seal the cuticle and prevent frizz."
    },
    {
      "title": "Use a curl enhancing product.",
      "content": "Use a curl enhancing product. Prepare your hair for styling by applying a product to wet hair that is designed to accentuate waves. There are a variety of mouses and other products that will give you hold but will not make your hair crunchy. [1] X Research source"
    },
    {
      "title": "Embrace the diffuser.",
      "content": "Embrace the diffuser. Diffusers are the spiky attachments that come with most hair dryers, and they're an absolute must for blow drying wavy hair. Blow drying with a diffuser helps maintain and hold the curl pattern in your hair. To get the most benefit out of your diffuser, hold it right up to the ends of your hair and use it to push the ends of your hair up towards the roots as you blow dry. A good diffuser should reduce the amount of air your hair is exposed to. If you don't see a significant difference in airflow when you put the diffuser on your hair dryer, you may need a better diffuser. Use the low or medium heat and speed settings on your blow dryer to prevent frizz. [2] X Research source"
    },
    {
      "title": "Defy gravity.",
      "content": "Defy gravity. To help give your waves some extra bounce, it helps to hold your head upside down or to the side as you blow dry. This helps prevent your hair from getting weighed down as it dries. If you want added volume, you can try lifting your roots with duckbill hair clips before you begin blow drying. Simply divide the top layer of your hair into sections and put a clip under each section, angling it into the roots. This will help create some extra lift as your hair dries."
    },
    {
      "title": "Prep your hair.",
      "content": "Prep your hair. While your hair is wet, add in some of your favorite styling products. Use something that will add moisture and help control frizz. The right choice for you will depend on your hair type and your individual preferences. [3] X Research source You may want to try a lightweight oil or serum. Make sure to apply a thermal protectant to your hair before blowing it dry."
    },
    {
      "title": "Let your hair air dry 70%, then detangle it.",
      "content": "Let your hair air dry 70%, then detangle it. Your hair should be mostly dry before you use a round brush. Otherwise, you’ll spend lots of time blow drying and may not get the desired result. When you’re ready to use the blow dryer, run a wide-tooth comb through your tresses to remove all the tangles. You can also use a detangling spray, if necessary."
    },
    {
      "title": "Use your brush and blow dryer in sections.",
      "content": "Use your brush and blow dryer in sections. Clip the top section of your hair out of the way and blow dry the bottom section first. Place a round brush under a small section of your hair and slowly pull it down towards the ends while you use your other hand to hold your blow dryer at an angle against the brush. After you finish the bottom section, unclip the rest of your hair and use the same method to dry it. Pull the brush down straight. If you turn it, you will be creating new waves in your hair instead of blow drying it straight. Heat will help you achieve the sleekness you want, so set your hair dryer to medium or high heat. Use the blow dryer nozzle to properly direct the heat to your hair, as that is one of the biggest mistakes people make when drying their hair."
    },
    {
      "title": "Finish with a flat iron, if desired.",
      "content": "Finish with a flat iron, if desired. This is not required, but if you want some added sleekness, you can finish your look with a flat iron. Run it carefully over your strands, pulling them out and around your face to avoid making your hair totally flat. If you want stick straight hair, just pull the flat iron straight down without angling it towards your face at all."
    },
    {
      "title": "Texturize your hair.",
      "content": "Texturize your hair. If you have naturally straight hair but you want to use your blow dryer to add some waves, you will need to add product, such as sea salt spray, to give it some texture and allow it to hold the waves. Try experimenting with different products to find one that works for your hair. [4] X Research source"
    },
    {
      "title": "Add volume with a round brush.",
      "content": "Add volume with a round brush. While your hair is still very wet, use your blow dryer to dry the roots. Lift your roots with a round brush and direct air from the blow dryer onto the brush to create volume. Try using the flat nozzle attachment on your blow dryer for this step, as it will focus more air on your roots. You can also use duckbill clips to add some lift to your roots. Use them to clip up small sections of your hair, angling the clips towards the roots from underneath. This will give you added volume when your hair dries. [5] X Research source"
    },
    {
      "title": "Start braiding.",
      "content": "Start braiding. With your hair partially dry, separate it into small sections and create braids all over your head. The smaller your braids, the tighter your waves will be. This will work the best if you part your hair where you want it for your final style before you start braiding. You can also try twisting your hair into small buns and pinning it up if you don't want to do braids."
    },
    {
      "title": "Continue drying.",
      "content": "Continue drying. With your braids secured, continue blow drying your hair until it feels completely dry. Then remove your braids. Your results will not be as good if your hair is not fully dry, so be thorough. Depending on the thickness of your hair, it will probably take between 5 and 10 minutes to dry completely. You can use whichever heat and speed settings you want, but your hair will dry faster if it is on high."
    },
    {
      "title": "Finish your look.",
      "content": "Finish your look. Using the diffuser attachment for your blow dryer on a cool, low speed setting, gently scrunch your hair. Depending on the texture of your hair, you may want to apply more texturizing spray and/or a finishing product to ward off frizz. To scrunch your hair, simply grab a section of your hair in the palm of your free hand and close your fingers around it. This encourages waves to form. Start at the ends of your hair and work your way up. You can also use the diffuser to scrunch by holding it at the ends of your hair and pushing your hair up towards the roots with it."
    },
    {
      "title": "Apply a smoothing product.",
      "content": "Apply a smoothing product. To start this look, apply your favorite smoothing product to your hair while it is still wet. Use a product that controls frizz well for your hair type. [6] X Research source"
    },
    {
      "title": "Blow dry it straight.",
      "content": "Blow dry it straight. If you have naturally curly hair that you want to style into loose waves using just your blow dryer and a brush, it's best to start by blow drying it straight. To do this, hold your round brush under a section of your hair near the roots. Then pull the brush straight down towards the ends of your hair while you hold the hair dryer against the top of the brush with your other hand. It may help to work in small sections. Pin up the rest of your hair as you work to blow dry one area at a time. Use the flat nozzle attachment for your blow dryer for the best results. Your goal should be to get your hair as straight as possible during this step, as you will be adding in waves later on. Using the high heat and speed settings on your blow dryer will help you achieve this."
    },
    {
      "title": "Twist in some waves.",
      "content": "Twist in some waves. Once your hair is dry, twirl each section around your round brush and continue to apply heat with the blow dryer. Before you release the brush, blow cool air onto it for a few seconds to set the waves. Try experimenting with different sized brushes. A smaller brush will give you a tighter wave. The length of time you will have to hold the blow dryer to your wave to make it hold will depend on the thickness and texture of your hair. Applying hair spray while your hair is twisted around the brush may help it hold the wave."
    },
    {
      "title": "Finish with anti-humidity spray.",
      "content": "Finish with anti-humidity spray. If your hair is prone to frizziness, keep it at bay by applying some anti-humidity finishing spray when you're done styling."
    }
  ]
}