{
  "url": "https://www.wikihow.com/Buy-a-Present-for-Your-Ex",
  "title": "How to Buy a Present for Your Ex",
  "steps": [
    {
      "title": "Choose a gift that fits in with their interests or hobbies to show you care.",
      "content": "Choose a gift that fits in with their interests or hobbies to show you care. As their ex, you have intimate knowledge about them, such as their favorite things to do and what they want in life. Use your history together to find a gift that only someone who really knows them will get. This will show your ex that you really care about them and see them for who they really are. [1] X Research source For example, let’s say your ex wants to be a writer. You might buy them a nice notebook, a fancy pen, a book of writing prompts, and a sticker that says, “I write.” This shows them that you were listening to their dreams and are supportive. As another example, you might buy them memorabilia from their favorite band or a movie still from their favorite movie. Reader Poll: We asked 609 wikiHow readers, and 52% thought that the best gifts are ones related to the recipient’s hobbies and interests . [Take Poll]"
    },
    {
      "title": "Pick out something small that represents something special from your relationship.",
      "content": "Pick out something small that represents something special from your relationship. This is a great way to give them a meaningful gift without breaking your budget. Think about your best times together or a special memory you made with them. Then, look for a gift that will remind your ex of that time in your relationship. The memory may make them feel nostalgic about their time with you, which could lead to a second chance. For example, you might give them a seashell from the beach where you met or postcard from the amusement park where you first said “I love you.”"
    },
    {
      "title": "Surprise them with something they’ve always wanted.",
      "content": "Surprise them with something they’ve always wanted. Think about the things they talked about having or doing while you were together. Were they saving up to buy something? Have they always dreamed of going to a certain place or event? Do they have a favorite band? Giving them what they’ve always wanted will show them you will go out of your way to make them happy. [2] X Research source For example, you might buy them concert tickets to see their favorite band or a record player so they can start collecting records."
    },
    {
      "title": "Make sure your gift won’t remind them of past disagreements.",
      "content": "Make sure your gift won’t remind them of past disagreements. Unfortunately, your gift may backfire if it triggers painful memories. Think about the hard times in your relationship, such as fights you had or times you broke up. Where were you located at the time? What were you doing? Being aware of these things will help you avoid making things worse with your gift. [3] X Research source For instance, let’s say you and your ex broke up because you got both them and your friend red roses on Valentine’s Day. In this case, anything involving red roses or Valentine’s Day would likely make your ex mad."
    },
    {
      "title": "Pick the right time to give them the gift.",
      "content": "Pick the right time to give them the gift. Timing is really important when it comes to gift-giving. Choosing the wrong time can make your gift fall flat or might make your ex uncomfortable. Here are some things to consider: [4] X Research source Don’t give your ex a gift right after you broke up if they asked for space. Doing this will make them feel like you aren’t honoring their wishes. If your ex is in a new relationship, hold off on trying to win them back. It’s rude to try to break up a couple, and it might create more tension between you and your ex, as well as you and their new partner. If your gift is really special and meaningful, try to give it to them alone. For instance, you might pull them aside at their birthday party instead of putting your gift with the other presents."
    },
    {
      "title": "Get them something practical.",
      "content": "Get them something practical. Pick a nice gift that they can use but isn’t typically considered romantic. This shows them you still care about them as a person but aren’t thinking of them as a partner. [5] X Research source For example, you might get them a book or a blender. If you’re in doubt, ask yourself if you would buy this gift for a relative. If it’s something you would buy for Uncle Earl, then it’s likely a safe gift to give your ex."
    },
    {
      "title": "Choose something impersonal.",
      "content": "Choose something impersonal. This is a great option for when you can’t think of anything they really need. Look for something you might buy a coworker or boss. Good options might include prepared gift baskets, holiday-themed items, food, or alcohol. [6] X Research source As an example, you might get them a holiday treat box or a snack sampler. During the holiday season, your local department store might have an entire aisle dedicated to these types of gifts. If he drinks consider getting a good bottle of wine, or a good bottle of scotch or whiskey."
    },
    {
      "title": "Give them a gift card to ensure your gift isn’t seen as romantic.",
      "content": "Give them a gift card to ensure your gift isn’t seen as romantic. A gift card is a simple, easy solution to your gift-giving dilemma. Choose a store that you know they like, then pick an amount that you typically spend on their gift. This ensures they’ll enjoy the gift but shows that you’re not putting too much thought into it. [7] X Research source"
    },
    {
      "title": "Think about how they will feel when they receive the gift.",
      "content": "Think about how they will feel when they receive the gift. In some cases, gifts can stir up trouble, especially if there are unresolved feelings. Be careful that you don’t buy your ex a gift that may make them think you still love them or may make them feel manipulated by you. Make sure your intentions are purely focused on friendship, and pick a gift that is appropriate for one friend to give another. [8] X Research source For instance, do not buy them anything a partner would normally get, like jewelry, perfume, or lingerie. If your ex is mad at you for something you did, don’t try to get them a gift to say you’re sorry. This can be perceived as manipulative."
    },
    {
      "title": "Help your children choose age-appropriate gifts, based on the kids’ age.",
      "content": "Help your children choose age-appropriate gifts, based on the kids’ age. Your kids should give your ex gifts that make sense for a child of their age. For instance, a 6-year-old might give their mom a box of candy and a teddy bear on Mother’s Day, not a ring. Let your kids pick out something they want to give their other parent, then help them pay for it. [9] X Research source"
    },
    {
      "title": "Give older kids a budget and let them pick out the gift.",
      "content": "Give older kids a budget and let them pick out the gift. Keep your involvement in the gift-giving process to a minimum. As soon as your kids can pick out and purchase a gift on their own, encourage them to do it. Not only will this help you feel more comfortable about helping your kids buy a present, it will also make the gift more special because it comes directly from your child. [10] X Research source For instance, you might give your 12-year-old child $20 and let them pick out a gift at your local department store while you make other purchases."
    },
    {
      "title": "Opt for a keepsake gift to stay focused on the kids.",
      "content": "Opt for a keepsake gift to stay focused on the kids. This can include something like a hand-painted coffee mug, a photo of your child with Santa, or a painting made by your child. These types of gifts are clearly from your child, so they’re a great way to avoid awkwardness when buying for an ex. [11] X Research source As an added bonus, giving a keepsake gift may also allow you an opportunity to make memories with your child. For instance, you might take your child to a shop that lets you paint your own pottery to paint gifts together. Similarly, taking your child to see Santa will be a great memory for you and the perfect gift for your ex."
    },
    {
      "title": "Have your kids make a homemade gift for a budget-friendly option.",
      "content": "Have your kids make a homemade gift for a budget-friendly option. It’s okay if you can’t afford to buy your ex a present, especially if you’re going through hard times. It’s not necessary to buy a gift, but your kids feel like they missed out if they can’t give their other parent a gift. The best solution to this is to let them make something special, even if it’s just a card. [12] X Research source Let your kids use whatever craft supplies you have on hand, like paper, crayons, and glitter. You might also look for tutorials on wikiHow, YouTube, or Pinterest to help your kids create something really special."
    },
    {
      "title": "Avoid giving your ex a gift that feels like it’s from you, like nice jewelry.",
      "content": "Avoid giving your ex a gift that feels like it’s from you, like nice jewelry. Once you’ve split up with your ex, gifts that might seem nice may suddenly be upsetting to them. Your ex may not react well to a gift that feels like it’s from you, so it’s a waste of your time and money. [13] X Research source When in doubt, let your child pick out the gift."
    }
  ]
}