{
  "url": "https://www.wikihow.com/Clean-Turmeric-Stains-from-Plastic",
  "title": "How to Clean Turmeric Stains from Plastic",
  "steps": [
    {
      "title": "Cover the stain completely with a baking soda paste for 15 minutes.",
      "content": "Cover the stain completely with a baking soda paste for 15 minutes. Take equal amounts of tap water and baking soda and mix them into a paste. Spread the paste over all of the turmeric stain, so the baking soda can do its thing. Wait at least 15 minutes, or until the baking soda paste dries, then scrub off the paste with warm water. Create enough baking soda paste to cover the entire stain. For instance, if you’re dealing with a big turmeric stain, you might need ½ cup (115 g) of baking soda and 1 ⁄ 2 c (120 mL) of water to get the job done."
    },
    {
      "title": "Coat the stain with oxygen bleach for 30 minutes.",
      "content": "Coat the stain with oxygen bleach for 30 minutes. Create a paste with equal amounts of oxygen bleach powder and water. Rub this paste all over the stained plastic container, letting it sit for up to 30 minutes. Once the time is up, rinse off the paste and finish washing the plastic with dish soap and water. To be safe, read through any usage instructions on the oxygen bleach before using it to clean your plastic. For example, products like OxiClean work well for this."
    },
    {
      "title": "Rub over the stain with melamine foam until it disappears.",
      "content": "Rub over the stain with melamine foam until it disappears. Grab one of these special cleaning sponges and wipe off the pesky turmeric from your plastic. Melamine foam sponges are rough along the surface, and should be able to remove the bulk of the stain. Once you’ve cleaned out your dish with this sponge, it’ll be ready to use again. “Magic Eraser” is a common name for melamine sponges."
    },
    {
      "title": "Treat the stain with a glycerine solution for 10-15 minutes.",
      "content": "Treat the stain with a glycerine solution for 10-15 minutes. Create a cleaning mixture with 2 c (470 mL) of water, 1 ⁄ 4 c (59 mL) of liquid dish soap, and 1 ⁄ 4 c (59 mL) of glycerine. Mix all of these ingredients together, then blot the mixture on top of the turmeric stains. Wait about 10-15 minutes for the mixture to do its magic, then rinse it off with warm water. [1] X Research source"
    },
    {
      "title": "Soak the plastic container in a diluted chlorine bleach solution overnight.",
      "content": "Soak the plastic container in a diluted chlorine bleach solution overnight. Fill a large basin or container with 2 c (470 mL) of water and 1 c (240 mL) of bleach. Set your stained plastic in the solution and let it soak overnight. The next day, clean off the bleach with warm water and soap, and see if your plastic looks any better. [2] X Research source Try a different cleaning option if you don’t see any results overnight. Always clean your plastic in diluted bleach instead of concentrated bleach, so you don’t damage your container."
    },
    {
      "title": "Let the plastic soak in a diluted lemon juice or light-colored vinegar mixture.",
      "content": "Let the plastic soak in a diluted lemon juice or light-colored vinegar mixture. Whip up a mixture with 2 c (470 mL) of hot water and 1 c (240 mL) of something acidic, like white vinegar or lemon juice. Pour the mixture into a big container or basin and let the plastic soak overnight. In the morning, take a quick look and see if the turmeric stains are gone."
    },
    {
      "title": "Dissolve denture tablets in water and soak the container in the mixture.",
      "content": "Dissolve denture tablets in water and soak the container in the mixture. Fill the stained container all the way with warm water. Pop in 2 denture tablets, letting them dissolve into the water. Leave the denture solution to sit and soak the stains overnight. The next day, wash out your plastic with dish soap and water to finish cleaning it. [3] X Research source Two denture tablets should be enough to clean most containers."
    },
    {
      "title": "Set the plastic in direct sunlight for a day if you’re not in a rush.",
      "content": "Set the plastic in direct sunlight for a day if you’re not in a rush. Over time, direct sunlight can fade the stains on your plastic. While this isn’t a very speedy solution, you might notice your turmeric stains lightening up after an afternoon in the sun. For extra fading power, dry your plastic in direct sunlight after washing or soaking the stains."
    }
  ]
}