{
  "url": "https://www.wikihow.com/Clear-a-Sinus-Infection",
  "title": "How to Clear a Sinus Infection",
  "steps": [
    {
      "title": "Recognize the basic symptoms.",
      "content": "Recognize the basic symptoms. Sinusitis generally presents itself with the same basic symptoms. Symptoms of acute sinusitis often worsen after 5-7 days. Symptoms of chronic sinusitis may be milder, but are more long-lasting. [2] X Research source Headache Pressure or tenderness around the eyes Nasal congestion Runny nose Sore throat and post-nasal drip (the sensation of “dripping” or running mucus at the back of your throat) [3] X Research source Fatigue Cough Bad breath Fever"
    },
    {
      "title": "Consider how long you have had symptoms.",
      "content": "Consider how long you have had symptoms. Sinusitis can be acute (lasting less than four weeks) or chronic (lasting longer than twelve weeks). [4] X Research source Having symptoms for a long time does not necessarily mean your sinusitis is more severe or dangerous. Acute sinusitis can be caused by many things, but viral infection is the most common cause (90-98% of cases). You may get acute sinusitis after having a cold. Acute sinusitis due to a viral infection will usually improve within 7-14 days. Allergies are the most common cause of chronic sinusitis. You may also be more susceptible to chronic sinusitis if you have asthma, nasal polyps, or if you smoke."
    },
    {
      "title": "Check for a fever.",
      "content": "Check for a fever. Allergic sinusitis usually is not associated with a fever. Sinusitis caused by an infection, such as the common cold, may present with a fever. [5] X Research source A high fever (over 102F) is often a sign of bacterial sinus infection. If you have a fever above 102F, consult with your doctor."
    },
    {
      "title": "Look for dark yellow or green mucus.",
      "content": "Look for dark yellow or green mucus. Dark yellow or green mucus with a bad smell or taste may be a sign of bacterial sinus infection. If you think you have a bacterial sinus infection, consult with your doctor. S/he may prescribe an antibiotic such as such as amoxicillin, augmentin, cefdinir, or azithromycin. Physicians will often wait for further observation before prescribing an antibiotic. Many cases of bacterial sinusitis improve without antibiotic treatment. Doctors try to avoid prescribing antibiotics unless truly necessary, because too much antibiotic use can increase your risk of developing an antibiotic-resistant infection. Antibiotics will only help to treat bacterial sinusitis. They will not help other types of sinus infection. Only 2-10% of acute sinusitis is caused by bacterial infection."
    },
    {
      "title": "Know when to see a doctor.",
      "content": "Know when to see a doctor. In addition to high fever and dark yellow or green mucus, there are other symptoms that signal you should see a doctor. A doctor will evaluate you and determine whether a bacterial infection is likely and whether antibiotics are needed. If you have any of the following symptoms, consult with your physician to determine what treatment she recommends: Symptoms that last longer than 7-10 days Symptoms such as headache that do not respond to over-the-counter medications [6] X Research source Productive cough with dark yellow, green, or bloody mucus Shortness of breath, heaviness of your chest, or chest pain Stiff neck or severe neck pain Ear pain Vision changes, redness, or swelling around the eyes Development of an allergic reaction to any medication. Symptoms may include hives, swelling of the lips or face, and/or shortness of breath Worsening of asthma symptoms in individuals with asthma If you have been suffering from chronic sinusitis, it’s a good idea to see a doctor. S/he can help you treat long-term sinusitis. S/he may also refer you to an allergist or otolaryngologist (Ear-Nose-Throat doctor) to help determine the possible causes."
    },
    {
      "title": "Consult a doctor.",
      "content": "Consult a doctor. If you are going to take a prescription medication, you will obviously need to see a doctor first. However, you may need to call your doctor before taking a non-prescription medication in some cases as well, especially if you have medical conditions or take other medications. While many over-the-counter medicines are safe for healthy adults, there are many circumstances which would complicate self-treatment with OTC medicines. Never give medication to children that is meant for an adult, as many cold medicines are not recommended for children. Women who are pregnant are likewise restricted from many cold medicines, and nursing mothers may need to check with a care provider or lactation consultant before taking OTC medications."
    },
    {
      "title": "Use antibiotics as directed.",
      "content": "Use antibiotics as directed. If your physician prescribes antibiotics for a bacterial sinus infection, be sure that you take the entire course of antibiotics, even after you begin to feel better. This will minimize the possibility of the infection to return or become resistant to the antibiotic. Antibiotics commonly used for bacterial sinus infections include amoxicillin (most commonly), augmentin, cefdinir, or azithromycin (for individuals who may be allergic to amoxicillin). [7] X Research source Side effects common to these antibiotics include nausea, vomiting, diarrhea, and a skin rash. More serious side effects such as fainting, trouble breathing, or hives should be reported to your doctor right away. [8] X Research source"
    },
    {
      "title": "Take an antihistamine for allergies.",
      "content": "Take an antihistamine for allergies. If your sinus problems are associated with seasonal or systemic allergies, antihistamines may help. Antihistamines are medications that directly work against your body’s reaction to allergens by preventing histamine from attaching to receptors in your cells. Antihistamines can stop the symptoms of allergic sinusitis before they start. Antihistamines generally come in pill form, such as loratidine (Claritin), diphenhydramine (Benadryl), and Cetirizine (Zyrtec). Liquid, chewable, and dissolvable forms may also be available, particularly for children. Consult with your doctor or pharmacist to determine which antihistamine will be most effective for you. Do not take an antihistamine for acute sinusitis without consulting with your doctor. Antihistamines may complicate acute sinusitis by thickening your nasal secretions. [9] X Research source"
    },
    {
      "title": "Take an OTC pain reliever.",
      "content": "Take an OTC pain reliever. Pain relievers will not cure a sinus infection, but they can reduce some of the unpleasant symptoms associated with it like headaches and sinus pain. [10] X Research source Acetaminophen/paracetamol (Tylenol) or ibuprofen (Advil) help relieve pain from headaches, sore throat, and can reduce fever. Be mindful that ibuprofen should not be given to children under 6 months of age."
    },
    {
      "title": "Try a nasal spray.",
      "content": "Try a nasal spray. An over-the-counter nasal spray may provide some immediate relief to blocked sinuses. There are three main types of nasal sprays; saline sprays, decongestant sprays, and steroid sprays. Decongestant sprays such as Afrin should not be used for more than 3-5 days, as doing so can actually worsen your congestion. [11] X Research source Saline sprays can safely be used frequently and help clear out mucous. Fluticasone (Flonase) is a steroid nasal spray that is used to treat symptoms of allergies. This type of nasal spray can be used longer than decongestant sprays, but may not help with sinus infections, as it is meant to help with allergy symptoms."
    },
    {
      "title": "Try a decongestant.",
      "content": "Try a decongestant. These medications can help relieve stuffy noses and sinus pain. Do not take a decongestant for more than 3 days. Using a decongestant for too long can cause “rebound” congestion. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Common choices include phenylephrine (Sudafed PE) or pseudoephedrine (Sudafed 12-hour). Some antihistamines include a decongestant, such as Allegra-D, Claritin-D, or Zyrtec-D. Many medicines marked as “D” contain pseudoephedrine and may be held behind the pharmacy counter due to purchasing restrictions. Some decongestants contain acetaminophen. Do not take additional acetaminophen if you are taking a decongestant that already contains it. Overdose can cause serious complications. [13] X Research source"
    },
    {
      "title": "Consider a mucolytic.",
      "content": "Consider a mucolytic. A mucolytic (such as guaifenesin/Mucinex) thins mucous secretions, which may help improve drainage from your sinuses. [14] X Research source There is not strong evidence that these help treat sinusitis, but you may have success with the medication."
    },
    {
      "title": "Get some rest.",
      "content": "Get some rest. If you're continuing to not get enough sleep or work excessive hours, it will take your body longer to get rid of the infection. If at all possible, try to have a full 24 hour period of complete rest. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Try to sleep with your head elevated. This will help promote drainage and reduce congestion. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Drink plenty of fluids.",
      "content": "Drink plenty of fluids. Staying hydrated will help thin the mucus and reduce the feeling of blockage. [17] X Research source Water is the best option, but non-caffeinated tea, sports drinks containing electrolytes, and clear broths are also good options. Men should drink at least 13 cups (3 liters) of fluids per day. Women should drink at least 9 cups (2.2 liters) of fluids per day. If you’re sick, you may need even more. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Avoid alcohol. It can actually make the swelling in your sinuses worse. [19] X Research source Caffeine may dehydrate you, which could make the mucus thicker. [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Try a Neti pot or nasal syringe.",
      "content": "Try a Neti pot or nasal syringe. Flushing your sinuses (also known as “irrigating” them) can help clear out built-up mucus naturally. You can do this several times a day with minimal side effects. [21] X Research source Use a sterile saline solution in the pot or syringe. You can buy a prepared solution or make your own using distilled, boiled, or sterile water. Tilt your head at about a 45-degree angle. You will want to do this over a sink or in the shower, to make cleanup easier. [22] X Research source Place the spout of the Neti pot (or the tip of the syringe) into your top nostril. Gently pour the solution into your nostril. It should run out the other nostril. Repeat on the other side."
    },
    {
      "title": "Inhale steam.",
      "content": "Inhale steam. Steam will help keep your sinuses moist and may make it easier for you to breathe. Take a hot shower or inhale the steam from a bowl. [23] X Research source Using a mentholated “shower bomb” can help. To use a bowl, carefully pour boiling hot water into a temperature-safe bowl. (Do not inhale steam from water that is still on the stove!) Put the bowl on a table or at a comfortable height so you can lean over it. Lean your head over the bowl. Do not get so close that the water or steam burns your face. Cover your head and the bowl with a light towel. Inhale the steam for 10 minutes. If desired, you can add 2-3 drops of eucalyptus oil or other decongesting oil to the water. Use 2-4 times per day. [24] X Research source If using this method with children, use extreme caution around the hot water and do not leave children unattended with the hot water treatment."
    },
    {
      "title": "Run a mist humidifier.",
      "content": "Run a mist humidifier. Dry, hot air irritates sinus passages, so running a humidifier while you sleep will help make breathing easier. A warm or cool mist humidifier should work equally well. You can also add a few drops of essential oils like eucalyptus into the water in the humidifier, which will help further reduce congestion (but check the humidifier’s user manual before adding anything to the water). [25] X Research source Watch for mold. If the air is too humid, mold may begin to grow on or around your humidifier. Clean the humidifier regularly to keep it sanitary."
    },
    {
      "title": "Apply a warm compress.",
      "content": "Apply a warm compress. To ease facial pressure and pain, apply a warm compress to the affected areas. Moisten a small towel and microwave it for about 30 seconds. The towel should be quite warm, but not hot enough to be uncomfortable. Place the compress on your nose, cheeks, or near the eyes to reduce your pain. Leave on for 5-10 minutes. [26] X Research source"
    },
    {
      "title": "Eat spicy foods.",
      "content": "Eat spicy foods. Some research suggests that spicy foods, such as hot peppers or horseradish may help clear your sinuses. [27] X Research source The capsaicin in peppers and spicy foods may help thin mucus and promote drainage. [28] X Research source Other “spicy” foods such as ginger may also help you feel better."
    },
    {
      "title": "Drink tea.",
      "content": "Drink tea. Hot, non-caffeinated tea may help soothe a sore throat, especially if it contains ginger and honey. This can also help reduce coughing. However, you should avoid teas with too much caffeine, as these may dehydrate you or cause you to lose sleep. You can make a simple ginger tea at home. Grate about 1 ounce of fresh ginger per cup of boiling water and allow to steep for at least 10 minutes. One traditional herbal tea, “Throat Coat,” has been shown to significantly relieve sore throat pain vs. a placebo tea. [29] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Benifuuki green tea may help reduce nasal and allergic symptoms when drunk regularly."
    },
    {
      "title": "Treat your cough.",
      "content": "Treat your cough . Often, a sinus infection will be accompanied by a cough. To ease your discomfort and the inconvenience of a cough, you should stay well hydrated, drink warm liquids such as herbal tea, and take honey (only for individuals over the age of 1)."
    },
    {
      "title": "Stop smoking",
      "content": "Stop smoking . Cigarette smoke, even secondhand smoke, causes irritation of the sinus lining and promotes sinus infections. [30] X Research source Secondhand smoke contributes to as many as 40% of the chronic sinusitis cases in the United States each year. You should stop smoking and avoid secondhand smoke while you have a sinus infection. To prevent future sinus infections and promote better overall health, stop smoking entirely. Smoking harms basically every organ in your body and can take years off your life expectancy. [31] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Treat symptoms of allergies and colds.",
      "content": "Treat symptoms of allergies and colds. Inflammation in the nose caused by allergies and colds predisposes you to developing a sinus infection. Get a flu vaccine. This reduces your likelihood of catching the influenza virus, which is another common culprit causing viral acute sinusitis. [32] X Research source"
    },
    {
      "title": "Avoid pollution.",
      "content": "Avoid pollution. Exposure to polluted environments and contaminated air may irritate the nasal passages and aggravate your sinusitis. Chemicals and strong fumes may irritate your sinus linings."
    },
    {
      "title": "Practice good hygiene.",
      "content": "Practice good hygiene. Viral infections are the most common causes of sinusitis. You can reduce your risk of catching these infections by washing your hands frequently with soap and water. Wash your hands after shaking hands, touching public surfaces (such as bus poles or door handles), and before and after preparing food."
    },
    {
      "title": "Drink lots of water.",
      "content": "Drink lots of water. Water increases the amount of moisture in the body and helps to prevent congestion. It also helps to thin the mucus for proper drainage."
    },
    {
      "title": "Eat plenty of fruits and vegetables.",
      "content": "Eat plenty of fruits and vegetables. These foods are rich in antioxidants and vitamins, which help keep your body strong and healthy. [33] X Research source Foods such as citrus fruits have high levels of flavonoids, a compound which may help boost your immune system and fight viruses, inflammation, and allergies. [34] X Research source Yao LH, et al. “Flavonoids in food and their health benefits.” Plant Foods Hum Nutr. 2004 Summer;59(3):113-22. [35] X Research source"
    }
  ]
}