{
  "url": "https://www.wikihow.com/Boil-Baby-Bottles",
  "title": "How to Boil Baby Bottles",
  "steps": [
    {
      "title": "Wash the bottles",
      "content": "Wash the bottles with warm soapy water first. Before you boil the bottles, wash them using warm water, dish soap, and a bottle brush. Clean all the bottles, nipples, and lids. Then, rinse the bottles and their parts in cool or warm water to get all of the soap off. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source You can also place the bottles into your dishwasher to clean them before you boil them."
    },
    {
      "title": "Fill a large pot about 2/3 full with water and place the bottles in it.",
      "content": "Fill a large pot about 2/3 full with water and place the bottles in it. A large stockpot works best for boiling bottles. Make sure that the pot is clean, and then fill it about 2/3 of the way full with tap water. Submerge the bottles in the water completely and angle them so they are upside down. Make sure that there are no pockets of air trapped inside of the bottles causing them to float above the surface. All of the bottles should be fully submerged. However, it’s okay if the other parts of the bottles are floating in the water since they are smaller and will move around more easily. You may need to add a little more or less water to your pot depending on how deep it is. Just make sure that you can fully submerge the bottles in the water."
    },
    {
      "title": "Turn on the burner on medium-high heat and bring the water to a boil.",
      "content": "Turn on the burner on medium-high heat and bring the water to a boil. Bringing the water to a boil may take around 15 to 20 minutes or longer depending on the size of your pot. Check the water every 5 minutes or so to see when it starts boiling."
    },
    {
      "title": "Keep the water boiling for 10 minutes.",
      "content": "Keep the water boiling for 10 minutes. Once the water starts to boil, set a timer for 10 minutes. Keep the heat on medium-high and let the water boil for a full 10 minutes. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If any of the bottles or parts start to float on the surface of the water, use a clean metal or wooden spoon to gently push them back under."
    },
    {
      "title": "Turn off the heat and place the bottles on a clean, dry dishcloth.",
      "content": "Turn off the heat and place the bottles on a clean, dry dishcloth. Use a pair of tongs to carefully remove each of the bottles from the water. Pour the water in the bottles back into the pot as you pull them out. Place each of the bottles and their parts on a clean, dry dishcloth to dry. Invert the bottles on the dishcloth or mat to help them dry faster. You can also place the bottles and parts onto a bottle drying mat or rack if you have one. The bottles will take around 1 hour to dry completely."
    },
    {
      "title": "Check to ensure that it is safe to boil your bottles in the microwave.",
      "content": "Check to ensure that it is safe to boil your bottles in the microwave. Not all bottles are microwave-safe, so check the manufacturer’s instructions for sterilizing before you microwave your bottles and any bottle parts, such as nipples and lids. [5] X Expert Source Mor Levy Volner, IBCLC, RDN International Board Certified Lactation Consultant Expert Interview. 5 May 2020. There may be special guidelines you need to follow, or a special kit that is recommended for sterilizing in the microwave. [6] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source For example, your bottles may be microwave-safe, but the nipples might not be. Or, you might need to use a special steam bag to sterilize bottles in the microwave."
    },
    {
      "title": "Wash the bottles and parts with warm soapy water.",
      "content": "Wash the bottles and parts with warm soapy water. Clean the bottles and bottle parts with a bottle brush, warm water, and dish soap. Then, rinse the bottles and parts with warm or cool water to remove all of the soap. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Note that you can also clean the bottles in a dishwasher before you boil them in the microwave."
    },
    {
      "title": "Fill the bottles halfway with tap water and place them in the microwave.",
      "content": "Fill the bottles halfway with tap water and place them in the microwave. Arrange the bottles so that they are upright and evenly spaced. Also, make sure that the turntable you set them on is level. [9] X Research source To ensure that all of the bottles get the same amount of heat, you may want to arrange them in a circle on the turntable."
    },
    {
      "title": "Run the microwave on high for 1 to 2 minutes.",
      "content": "Run the microwave on high for 1 to 2 minutes. Watch the water through the door to see when it begins to boil. If it is not boiling by the time the minute is up, then add another 30 seconds. Once the water boils, let the microwave run for another 5 seconds and then shut it off. [10] X Research source For example, if the water boils at 1 minute and 20 seconds, then you could let it go for another 5 seconds and then shut the microwave off at 1 minute and 25 seconds."
    },
    {
      "title": "Leave the bottles in the microwave to cool for 10 minutes.",
      "content": "Leave the bottles in the microwave to cool for 10 minutes. After you shut off the microwave, leave the bottles in there for another 10 minutes. This will allow the hot water and steam to penetrate the bottles and also make it safer for you to you remove them. [11] X Research source Be cautious even after letting the water cool for 10 minutes! It may still be quite hot when you handle the bottles."
    },
    {
      "title": "Put on oven mitts and carefully dump out the remaining water.",
      "content": "Put on oven mitts and carefully dump out the remaining water. After you have allowed the bottles to cool in the microwave for 10 minutes, take them out 1 at a time. Grasp 1 bottle with the oven mitt and carefully dump the remaining water into the sink. [12] X Research source Repeat this for all of the bottles."
    },
    {
      "title": "Let the bottles air dry on a clean, dry dishcloth.",
      "content": "Let the bottles air dry on a clean, dry dishcloth. Place the bottles upside down on a clean, dry dishcloth. Let them dry in this position for about 1 hour or until no water is visible on them. Once the bottles are dry, they are sterilized and ready to use! [13] X Research source"
    },
    {
      "title": "Boil bottles once before the first use if the bottles are new or secondhand.",
      "content": "Boil bottles once before the first use if the bottles are new or secondhand. If you have clean drinking water and your baby does not have any health concerns, then you only need to boil your baby’s bottles before the first use. After that, you can wash them by hand or in your dishwasher after each use. This is true whether the bottles are brand new or you got them secondhand. [14] X Research source Remember to wash the bottles first, and then boil them in a pot of water or in the microwave to sanitize them."
    },
    {
      "title": "Sanitize your baby’s bottles in boiling water daily for health reasons.",
      "content": "Sanitize your baby’s bottles in boiling water daily for health reasons. If you only want to sanitize your baby’s bottles before the first use, then you will only have to boil them 1 time. However, you may need to boil your baby’s bottles before each use in certain situations. These include: [15] X Research source If your baby has been sick. If your baby has health issues or was born prematurely. If you don’t have clean drinking water on tap."
    },
    {
      "title": "Stop boiling bottles if you notice any damage to the bottles or parts.",
      "content": "Stop boiling bottles if you notice any damage to the bottles or parts. If the bottles or parts start to warp, crack, or show other signs of damage after boiling them, then do not continue to boil them and discard the damaged bottles and parts. Not all bottles will hold up well against repeated boiling, so pay close attention to any changes to the bottles or their parts. [16] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    }
  ]
}