{
  "url": "https://www.wikihow.com/Contact-British-Gas",
  "title": "How to Contact British Gas",
  "steps": [
    {
      "title": "Call 0333 202 9532 to contact customer service.",
      "content": "Call 0333 202 9532 to contact customer service. Calling this number will connect you to a British Gas customer service representative that can direct you to the right department. This is a quick way to speak to a customer service representative over the phone. You can also use this number to make a customer complaint. [1] X Research source Customer service is available Monday through Friday from 8 am to 8 pm and 8 am to 6 pm on Saturday. Customer service is closed on Sunday."
    },
    {
      "title": "Call 0333 200 8899 if your services aren’t working.",
      "content": "Call 0333 200 8899 if your services aren’t working. Call this number if your gas supply isn’t working properly. You should also call this number if you have leaking gas powered hot water heating pipes. Once you speak to someone, British Gas will schedule an appointment for a technician to come out and fix the issue. If the problem is easily fixable, they may even be able to troubleshoot the problem over the phone. [2] X Research source Representatives at this number are available 24 hours a day, seven days a week."
    },
    {
      "title": "Dial 0333 200 8899 to pay or view bills.",
      "content": "Dial 0333 200 8899 to pay or view bills. If you want to pay, view, or discuss your bill with a representative, you should call this number. Similar to the customer service line, representatives at this number will be available Monday through Friday from 8 am to 8 pm and 8 am to 6 pm on Saturday. The service is closed on Sundays. [3] X Research source"
    },
    {
      "title": "Escalate your issue by calling 0333 202 9774.",
      "content": "Escalate your issue by calling 0333 202 9774. Call this number to escalate your issue to the Customer Service Directors Team and connect with a manager. It’s best to go through the other contact methods before escalating the issue to a director. [4] X Research source For example, if you spoke to the customer service and the representative was rude and didn't resolve your issue, you should escalate the issue to a manager. If you tried calling the other numbers and can't get through, call this number."
    },
    {
      "title": "Call 0800 111 999 if you smell gas in your house or any domestic property you are in.",
      "content": "Call 0800 111 999 if you smell gas in your house or any domestic property you are in. If you smell gas or are worried that there may be a carbon monoxide leak , call this number to contact the Gas Emergency Services emergency line. This service is available 24 hours a day, seven days a week. [5] X Research source"
    },
    {
      "title": "Chat with a customer service representative online.",
      "content": "Chat with a customer service representative online. Visit https://www.britishgas.co.uk/help-and-support/ and click the blue \"Chat\" button in the lower-right corner to bring up a live chat with a representative. This person will usually be able to resolve simple issues with your account and bill or give you the number to the department that you need. [6] X Research source"
    },
    {
      "title": "Escalate complaints by accessing their customer complaints page.",
      "content": "Escalate complaints by accessing their customer complaints page. If you’ve contacted British Gas using other methods and they don’t respond, you can escalate the issue to their customer complaints department. Visit https://www.britishgas.co.uk/complaints.html and find the section that best describes your issue to determine the correct email address to use. Make sure to describe your experience and the issue you’re having with their service in the body of the email. This method should be saved for the last resort. If you're unhappy with boiler and central heating system installation, you can email: installationcomplaints@britishgas.co.uk If you have a complaint about your boiler loan, you can email: Loancomplaints@britishgas.co.uk If you have an issue with an electric vehicle charger installation, you can email: ev@britishgas.co.uk For other complaints, visit https://www.britishgas.co.uk/complaints.html to determine the correct email address or phone number to use."
    },
    {
      "title": "Contact British Gas on Twitter or Facebook.",
      "content": "Contact British Gas on Twitter or Facebook . You shouldn’t use this method unless you’ve tried contacting them directly with no results. You can contact British Gas online by tweeting @BritishGas or @BritishGasHelp. This may get enough attention for someone to contact you and resolve your issue. [7] X Research source"
    },
    {
      "title": "Send British Gas a letter.",
      "content": "Send British Gas a letter. Send British Gas a letter to praise them for their service or to log an official complaint. Address the letter to British Gas, PO Box 227, Rotherham S98 1PD. Remember to use sufficient postage payment so your letter doesn't get sent back. [8] X Research source Type the letter if you have poor handwriting."
    },
    {
      "title": "Log a formal complaint if your issue hasn’t been resolved in eight weeks.",
      "content": "Log a formal complaint if your issue hasn’t been resolved in eight weeks. If you have an ongoing issue that British Gas refuses to fix, you can log an official complaint with the energy ombudsman service. To log a complaint, send an email to osenquiries@os-energy.org, call 0330 440 1624, or send a letter to Ombudsman Services: Energy, PO Box 966, Warrington WA4 9DF. [9] X Research source Energy Ombudsman Services will investigate and resolve the issue."
    }
  ]
}