{
  "url": "https://www.wikihow.com/Cook-Frozen-Pizza",
  "title": "How to Cook Frozen Pizza Perfectly (In the Oven & Microwave)",
  "steps": [
    {
      "title": "Preheat the oven temperature between 375–425 °F (191–218 °C).",
      "content": "Preheat the oven temperature between 375–425 °F (191–218 °C). Different brands have different temperature recommendations, so follow the instructions specified on the box. To ensure that your pizza cooks evenly, set your oven to either “bake” or “convection.” [1] X Research source Alternatively, turn your oven up as high as it can go to mimic the intense heat of a commercial pizza oven. If you try this, though, watch your pizza closely—it’s more likely to burn. Avoid using the broiler. The one-directional heat is likely to get your pizza too done on top while leaving the rest undercooked."
    },
    {
      "title": "Remove your pizza from the box.",
      "content": "Remove your pizza from the box. Keep your pizza frozen until you plan to cook it. Pull away the tear strip sealing the opening of the box and separate the cardboard flaps, and slide the palm of your hand underneath the pizza and pull it out, making sure it’s facing up. Then, peel away and discard the outer plastic wrap and cardboard base. [2] X Research source You may need a knife or a pair of scissors to help you get the plastic wrap open. Make sure to hold your pizza facing up so the toppings don’t fall off or end up distributed unevenly. Never cook (or refreeze) thawed pizza, especially if it’s been outside of the refrigerator for more than 2 hours. It can cause an uneven bake or even make you sick. [3] X Research source"
    },
    {
      "title": "Brush the crust with olive oil for additional flavor and crunch.",
      "content": "Brush the crust with olive oil for additional flavor and crunch. Dip a basting brush in extra virgin olive oil and go over the ring of crust around the edges of the pizza. As it heats up in the oven or microwave, it will absorb into the crust, producing a smooth, subtle taste and extra crispy texture. [4] X Research source A light coating of olive oil will also help brown the cheese next to the crust nicely."
    },
    {
      "title": "Place the pizza on a nonstick baking sheet.",
      "content": "Place the pizza on a nonstick baking sheet. Position the pizza so that it's lying perfectly flat at the center of the sheet. If necessary, take a moment to rearrange loose or clustered toppings so that they cover more of the pizza. If you don’t have a nonstick baking sheet, line a regular baking sheet with non-stick aluminum foil. [5] X Research source If you’re using a pizza stone , go ahead and stick it in the oven while it’s preheating. Pizza stones absorb excess moisture, which also helps keep the crust light and flaky."
    },
    {
      "title": "Slide the pizza into the oven on the center rack.",
      "content": "Slide the pizza into the oven on the center rack. Place your pie on the center rack so it’s not too close to the heating element at the top or bottom of the oven. Then, shut the oven door to prevent any heat from escaping. If you’re cooking your pizza directly on the rack, set it down slowly and carefully to avoid burning yourself. If you prefer an overdone, almost-burnt pizza, place the pizza on the bottom rack instead."
    },
    {
      "title": "Cook your pizza for 15-25 minutes.",
      "content": "Cook your pizza for 15-25 minutes. Depending on the size and amount of toppings on your pizza, it may take longer to cook. Follow the recommended length of time on the box, and be sure to set a timer so you don’t forget about it while it’s in the oven. Your pizza is done when the cheese turns a light golden brown color and begins to bubble steadily. If you crank your oven to the highest temperature, it can take as little as 5-7 minutes to cook completely."
    },
    {
      "title": "Remove your pizza from the oven with the aid of an oven mitt.",
      "content": "Remove your pizza from the oven with the aid of an oven mitt. When your cook time is up, open the oven door, reach inside carefully, and pull out the pizza from the edge of the baking sheet. Place the baking sheet on a flat, heat-safe surface. To take out a pizza that’s been baked directly on the rack, use a metal spatula, pie server, or similar utensil to slide it onto an awaiting baking sheet, or simply remove the whole rack."
    },
    {
      "title": "Let your pizza cool for 3-5 minutes before slicing it.",
      "content": "Let your pizza cool for 3-5 minutes before slicing it. “Rest” your pizza so it reaches a safe temperature for eating and gives the melted cheese time to firm back up a little. Avoid handling your pizza or the baking sheet it's sitting on—both will be extremely hot when they first come out of the oven. Cooling the pizza makes slicing much easier and less messy (so you won’t pull all the cheese and toppings off of each piece)."
    },
    {
      "title": "Cut your pizza into equal slices with a pizza cutter.",
      "content": "Cut your pizza into equal slices with a pizza cutter. Run your pizza cutter over the center of the pizza, rolling the blade along with a back-and-forth motion a few inches at a time. Then, turn the pizza 90 degrees and slice through the center again, crossing your first cut. Continue turning and cutting until you have as many slices as you want to serve. [7] X Research source If you want to cut a pizza into 7 slices , cut the pizza in half, then cut one half into thirds. Slice the remaining half into fourths and enjoy! If you don’t have a pizza cutter handy, you can also use a sharp chef’s knife. Press down on the back of the blade with your palm to “chop” through the crust in a perfectly straight line."
    },
    {
      "title": "Take the pizza out of the packaging and brush the crust with olive oil.",
      "content": "Take the pizza out of the packaging and brush the crust with olive oil. Pull off any plastic wrap surrounding the pizza and toss out the cardboard box. Then, dip a basting brush in olive oil and lightly coat the crust to help improve the taste and texture. [8] X Research source"
    },
    {
      "title": "Place the pizza on a microwave-safe plate.",
      "content": "Place the pizza on a microwave-safe plate. Choose a dish that’s big enough to hold the entire pizza, then set it in the center of your microwave. If your microwavable pizza comes packaged with a silver heat-reflective tray, position it under your pizza so it comes out extra crispy. [9] X Research source Never use metal cookware or foil in the microwave. It can cause permanent damage to your microwave or even start a fire."
    },
    {
      "title": "Microwave the pizza on high heat for 3-4 minutes.",
      "content": "Microwave the pizza on high heat for 3-4 minutes. Follow the recommended time on the box, and watch your pizza closely so it doesn’t get too done. You can cook most microwave pizzas for 3-4 minutes, but large or thick varieties may take closer to 5-6 minutes. [10] X Research source Cook times may vary for pizzas made with garlic bread, flatbread, or other special types of crusts."
    },
    {
      "title": "Allow the pizza to cool for 2-3 minutes before eating it.",
      "content": "Allow the pizza to cool for 2-3 minutes before eating it. Be careful removing the plate from the microwave since it’s hot. If you like, you can cut your pizza into smaller pieces to make it shareable after you let it cool. Enjoy!"
    }
  ]
}