{
  "url": "https://www.wikihow.com/Act-Like-a-Man",
  "title": "How to Act Like a Man",
  "steps": [
    {
      "title": "Be self-reliant.",
      "content": "Be self-reliant. Entitlement is your enemy! Stop looking for handouts. If you haven’t earned it, don’t expect it from anyone. Be the guy others lean on for support. [1] X Research source"
    },
    {
      "title": "Practice self-denial.",
      "content": "Practice self-denial. Life is a marathon and real life isn't full of immediate gratification. Understand this, and conduct yourself as such. If you feel that you struggle with self-denial, reflect on your day-to-day routine and take out all the junk. This could be TV, junk food, or even pornography."
    },
    {
      "title": "Make the best of every situation.",
      "content": "Make the best of every situation. Make the observation that there's someone who could have the life you live, and win with it. In order to make wise decisions you cannot be afraid to stand alone on your principles and values. [2] X Research source Men don't need groups or numbers to validate decisions that work best for everyone. No matter how dark a situation is, learn to always see the light at the end of the tunnel. Look at the lives of the greatest leaders and philosophers of all time: Mandela, Gandhi, MLK Jr.; all had the profound capability to make the best of every situation. No matter what turn their journey took, they always remained courageous within. This characteristic is so necessary that those who have it become heroes."
    },
    {
      "title": "Pursue meaning over money.",
      "content": "Pursue meaning over money. Compile a mental wish list right now. Was it all materialistic things? If so, understand that your life’s meaning cannot be found in things, or even considered valuable because you have money. Money with no meaning leads to an expensive funeral. As you grow older, you realize that. You may even began to feel that these 'things' lack meaning in your life, that they go from you owning \"it\" to the feeling \"it\" owns you. Fill your life with meaning. Live for experiences and adventure. Live for others, and the money will follow."
    },
    {
      "title": "Speak with your actions, not your mouth.",
      "content": "Speak with your actions, not your mouth. Most talk, but don’t do. Men who are meek and simple get it done. Live deliberately and be firm with your actions and wise with your words. [3] X Research source"
    },
    {
      "title": "Have a sense of humor.",
      "content": "Have a sense of humor. Laugh daily, especially at yourself. It’s important not to take yourself too seriously. Use humor as a scapegoat in life. Make jokes about yourself because it's medicine for the soul. Not only will humor help you socially and make you more likable, but it’s a great exercise to build confidence. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Read often.",
      "content": "Read often. Read everything. Read the experiences of other heroes. It will help you put things in perspective for your own life. Read about the industry you’re in, read about your community, and even read what you think you already know. The formula for your self-discovery may be hidden in a book. [5] X Research source"
    },
    {
      "title": "Don't ever walk past someone in need.",
      "content": "Don't ever walk past someone in need. Gentlemen were knights. Since the beginning of time, men were protectors. They protected the hut, the family, and the village. Never ignore injustice, because men never turn away from violence on the defenseless."
    },
    {
      "title": "Practice kindness.",
      "content": "Practice kindness. Be kind . Help others without looking for anything in return. Entitlement is weakness. Do what ought to be done because it's the right thing to do. [6] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source"
    },
    {
      "title": "Accept responsibility for your actions.",
      "content": "Accept responsibility for your actions. Go out of the way to take the blame. A coward rarely sees their own faults, and blames others for their lack of success. Take ownership of your life. Realize that if you don't accomplish anything in life, it won’t be anybody's fault but yours. [7] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    }
  ]
}