{
  "url": "https://www.wikihow.com/Attach-Garden-Hose-Fittings",
  "title": "How to Replace & Attach Garden Hose Fittings",
  "steps": [
    {
      "title": "Attach a faucet connector if the threads don't match.",
      "content": "Attach a faucet connector if the threads don't match. Some outdoor faucets are made with threads on the inside of the tap. However, standard garden hoses also have interior—or female—threads. The easiest way to fix this is to screw a faucet connector into the faucet. This is a small piece with male threads on both ends. It basically acts as a converter, so you simply screw one end into your faucet, then attach your hose to the other end. [1] X Research source Faucet connectors are sometimes held in place by a connector clip so they won't pop out when the water is on full power. Female ends have inner threads, while male ends have exposed outer threads."
    },
    {
      "title": "Screw the hose fitting onto the faucet or faucet connector.",
      "content": "Screw the hose fitting onto the faucet or faucet connector. Push the end of the hose over the end of the faucet—or the faucet connector, if one is attached. Then, twist counterclockwise until the hose is attached snugly to the faucet. Turn on the tap and check for leaks or drips. [2] X Research source If you see any leaks or drips, tighten the connectors a little more."
    },
    {
      "title": "Push the connectors together if you have quick-release fittings.",
      "content": "Push the connectors together if you have quick-release fittings. Quick-release connectors slide over your existing fittings. If you're using these, you don't have to screw and unscrew the hose each time you connect it to the faucet. Instead, you pull down a spring-loaded ring, fit the end of the hose onto the faucet, and release the ring. The hose will then be connected securely to the faucet. [3] X Research source"
    },
    {
      "title": "Use an adapter if your faucet and hose are different sizes.",
      "content": "Use an adapter if your faucet and hose are different sizes. This isn't super common, but it does happen. For instance, your faucet might be 3 ⁄ 4 in (1.9 cm) and your hose fitting might be 5 ⁄ 8 in (1.6 cm). In his case, you'd use an adapter that's 3 ⁄ 4 in (1.9 cm) at one end and 5 ⁄ 8 in (1.6 cm) at the other end. Just make sure the adapter has the right male or female threads. [4] X Research source Most residential hoses have a 5 ⁄ 8 in (1.6 cm) diameter, although some inexpensive hoses are smaller at 1 ⁄ 2 in (1.3 cm). Professional or high-flow hoses are usually 3 ⁄ 4 in (1.9 cm) in diameter. There are also different thread sizes, or pitches , but in the U.S., the standard thread size is 11.5NH (National Hose) per inch. It's pretty uncommon for taps or fittings to be a different size."
    },
    {
      "title": "Turn off the water and disconnect the hose.",
      "content": "Turn off the water and disconnect the hose. You don't want to get sprayed while you're replacing the end fitting of your garden hose! Head to your outdoor tap and turn it all the way off, then unscrew the hose to detach it. If you have any attachments on the other end of the hose, remove those as well. [5] X Research source Do this no matter which end of the hose you'll be working on. Detaching the hose makes it easier to work with, and removing the attachments prevents them from getting damaged."
    },
    {
      "title": "Use a sharp blade to cut the old fitting off the hose.",
      "content": "Use a sharp blade to cut the old fitting off the hose. Place the hose on the ground and slice with a blade just below the existing end fitting—the metal or plastic piece at the end of your hose. Be sure to cut in a straight line, and make sure there aren't any little burrs left sticking up, or the hose might not sit correctly in the new fitting. [6] X Research source There are hose cutters made specifically for this, but you can use a heavy-duty utility knife if you don't have one."
    },
    {
      "title": "Add a drop of dishwashing liquid inside the hose.",
      "content": "Add a drop of dishwashing liquid inside the hose. Dishwashing liquid acts as a lubricant, making it easier to push the hose onto the fitting. You can also use soapy water or an all-purpose lubricant like WD-40 , if you prefer. [7] X Research source You can also try putting the soap onto the fitting."
    },
    {
      "title": "Push the end of the hose onto the fitting.",
      "content": "Push the end of the hose onto the fitting. Most hose fittings have a slightly narrower end that fits inside your hose called the barb . Place the barb in the opening of the hose and push down firmly until the hose is seated all the way against the rim of the fitting. [8] X Research source This might take a bit of force—just work slowly so you don't damage the hose."
    },
    {
      "title": "Tighten the collar or clamp on the fitting.",
      "content": "Tighten the collar or clamp on the fitting. How you do this depends on how your fitting is made. Some have a collar you spin, which tightens the fitting down onto the hose. Others use a clamp with a small screw—you'll need to tighten the screw with a screwdriver to secure the fitting in place. [9] X Research source If your hose doesn’t have a collar or clamp, purchase a hose clamp separately. Slide it onto the hose before you attach the fitting. [10] X Research source If you're using a clamp, make sure it's lined up over the barb of the fitting before you tighten it. Otherwise, it won't hold the fitting in place."
    },
    {
      "title": "Check for any leaks.",
      "content": "Check for any leaks. Once the fitting is securely in place, reattach the hose. Then, turn the tap on about a quarter of a turn—just enough so the water starts to flow. Examine the base of the fitting carefully to make sure there aren't any beads or drips forming. If there are, you may need to push the hose more firmly into the fitting or tighten the clamp a little more. If the fitting isn't secure, it could pop loose when the water is on full force."
    },
    {
      "title": "Replace your hose gaskets every 3 to 10 years.",
      "content": "Replace your hose gaskets every 3 to 10 years. Small rubber gaskets inside the fittings help prevent leaks, but these usually wear out faster than the fittings themselves. Disconnect your hose and pull out the old O-shaped gasket with needle-nose pliers. Then, press a new gasket into the fitting and reconnect the hose. It's that simple! [11] X Research source You can also use a flathead screwdriver to pop out the old gasket. [12] X Research source"
    },
    {
      "title": "Add a water stop hose connector for convenience.",
      "content": "Add a water stop hose connector for convenience. This small fixture has female threads on either end and stops water flow from your hose unless you activate the sprayer. This way, you don’t have to go all the way to the faucet to turn off the hose. To install , place the opening on your sprinkler or handheld sprayer over the water-stop connector on the end of your hose. Then, twist the hose and accessory together until they're tightened snugly. These aren't strictly necessary, but they can be very convenient, especially if you don’t want to get sprayed in the face when changing your hose accessories. If you have a quick-connect attachment on your sprayer and hose, just push the end of the sprayer into the connector on the end of your hose. You'll hear a click when it snaps into place. [13] X Research source"
    },
    {
      "title": "Use a double male connector if you want to link two hoses.",
      "content": "Use a double male connector if you want to link two hoses. A double male connector is a small piece—usually plastic—with male threads on either end. To use it, simply screw or push one end of the double male connector into the water stop connector on the end of your garden hose, then attach another hose the same way to the other end. This is a great option if you might need to disconnect the hoses later, because it's easy to remove. [14] X Research source If you have one hose with threads on the outside, you'll need a male-female hose connector . For a more permanent solution, use a coupler with barbed ends . Slide one end of the coupler into the end of one of the hoses and tighten the ring on the coupler to crimp the hose onto the barbs. [15] X Research source Then, attach the other hose to the other side of the coupler."
    },
    {
      "title": "Branch off multiple hoses with a 3-way adapter.",
      "content": "Branch off multiple hoses with a 3-way adapter . A 3-way hose adapter or splitter is useful if you need hoses for different purposes at the same time, like washing your car while you run a sprinkler. To use it, connect one end of a hose to the faucet and the other end to the 3-way adapter. Then, attach another two hoses to the remaining openings on the connector. This connector is also called a Y-connector because it's shaped like the letter Y."
    },
    {
      "title": "Which end of the hose connects to the tap?",
      "content": "Which end of the hose connects to the tap? Typically, the female end of the hose attaches to the male end of the tap. The female end has threads on the inside, whereas the male end has threads on the outside. [16] X Research source"
    },
    {
      "title": "Are all garden hose connectors the same?",
      "content": "Are all garden hose connectors the same? No, not all garden hose connectors or fittings are the same. The most common types of garden hose fittings are threaded connectors, hose couplings, barbed fittings, hose splitters, and quick-connect hose fittings. [17] X Research source Threaded connectors are the most common and have two threaded ends. Hose couplings join the end of a hose with another piece of equipment, like a nozzle. Barbed fittings attach hoses together. Hose splitters attach a hose to an outdoor faucet and divide a water source. Quick-connect hose fittings help accessories snap on and off the hose quickly."
    },
    {
      "title": "What is a water hose thread size?",
      "content": "What is a water hose thread size? Most water hoses in the United States and Canada have a thread size of ¾” or 11.5 NH (National Hose). There are three common hose fitting sizes: ¾”, ⅝”, and ½”. The inside diameter of the threaded fitting determines the thread size of the hose or accessory. Make sure the NH or GHT (Garden Hose Threads) size matches up between your hoses and accessories for the most secure fit. [18] X Research source"
    }
  ]
}