{
  "url": "https://www.wikihow.com/Clean-Flip-Flops",
  "title": "How to Clean Flip Flops",
  "steps": [
    {
      "title": "Use a washing machine.",
      "content": "Use a washing machine. This is a quick solution, although it may use more water than other methods. Put the flip flops into the washing machine on a cold cycle, with a bit of soap and a quick program. If possible, choose a no-spin cycle. Be aware that too much detergent might damage the shoes. [1] X Research source"
    },
    {
      "title": "Spray the flip flops.",
      "content": "Spray the flip flops. Use a water hose, a shower jet, or a powerful faucet to shoot water at the shoes. Try to knock dirt loose with water pressure. Keep going until you get most of the dirt off – and try scrubbing afterward to complete the effect. [2] X Research source"
    },
    {
      "title": "Rinse your flip flops with cold water.",
      "content": "Rinse your flip flops with cold water. This first step should wash away the heaviest grime from extremely dirty flops. If a standard faucet doesn't do the trick, try using a powerful jet-stream or blocking off the tip of a hose with your thumb."
    },
    {
      "title": "Soak the flip flops.",
      "content": "Soak the flip flops. First, fill a bucket with warm, soapy water. Dunk the flip flops in the water. Consider weighting them so that they are completely submerged. Leave the flops to soak for at least two hours. [3] X Research source Use concentrated dish soap, if you have it. If your flip flops are white and incredibly dirty, you can add bleach – but be careful not to get it on your skin. For a deeper cleaning, try spraying some 3% peroxide hydrogen on the flip flops and letting it set for a couple of minutes before rinsing."
    },
    {
      "title": "Scrub the flip flops.",
      "content": "Scrub the flip flops. After a few hours, remove the flops from the bucket. Rub the dirty surfaces vigorously with a toothbrush or a sponge. If the grime runs especially deep, try using steel wool or another highly abrasive surface – but be careful not to wear down the surface of the flops!"
    },
    {
      "title": "Rinse your flip-flops again with cold water.",
      "content": "Rinse your flip-flops again with cold water. This step should wash away the soap, the suds, and any other cleaning agents that you used. Rinse away any grime that you dislodged with your scrubbing."
    },
    {
      "title": "Repeat until clean.",
      "content": "Repeat until clean. If the flip-flops won't get clean, be persistent. Keep rinsing and scrubbing until they are."
    },
    {
      "title": "Let the flops air-dry.",
      "content": "Let the flops air-dry. Avoid running them through a drying machine, and don't expose the material to excessive heat. Put the flip flops out in the direct sun, and they should dry within a matter of hours."
    },
    {
      "title": "Clean with a sponge.",
      "content": "Clean with a sponge. Choose a slightly-used sponge – not the one you're going to use on your dishes. Soak the sponge in hot water, along with a bit of dish soap. Rub the flip flops vigorously to remove any grime or mud. If it's hard to remove: put on some gloves, and use a thin towel or napkin to help you get the mud off. [4] X Research source A bush might be needed to scrape off dirt that sponges sometimes aren't able to remove."
    },
    {
      "title": "Cover scratches with shoeshine.",
      "content": "Cover scratches with shoeshine . If the flip flops are scratched or dented, you can mask the blemishes with shoeshine. If you find a product that is made for the material of your flip flops, you should be able to hide most of the damage. Try different shine products in order to see which you like best. If you don't want to buy shoeshine, try learning to spit shine shoes."
    },
    {
      "title": "Use a toothbrush.",
      "content": "Use a toothbrush. Find an old toothbrush, or a buy a very cheap new brush. Wet the toothbrush, then grind the bristles into a bar of soap. Then, start scrubbing away at your shoes. Make sure to get into all of the cracks! The toothbrush tactic works best on fuzzy flip flops. The bristles can work between the fuzz in a way that other cleaning products cannot."
    },
    {
      "title": "Scrub with a hot, wet towel.",
      "content": "Scrub with a hot, wet towel. First, soak an old towel or dishrag in hot water. Use a bit of soap, if you like, although this is not necessary. Wipe the dirtiest spots with the towel, and remove as much as you can."
    }
  ]
}