{
  "url": "https://www.wikihow.com/Apply-Curd-on-Hair",
  "title": "How to Apply Curd on Hair",
  "steps": [
    {
      "title": "Apply curd by itself for a dose of hydration.",
      "content": "Apply curd by itself for a dose of hydration. Use 1 cup (240 mL) of curd on your hair whenever you want to deeply nourish the follicles. Be sure to stir up the curb before you put it on to avoid clumps. Curd packs your hair full of vitamins, making it soft, shiny, and hydrated. [1] X Research source While you can technically use curd by itself, mixing it with other ingredients helps nourish your hair. Although you can use your hands to apply the curd, it's better to comb it through your hair. This will help you evenly distribute the curd, and it makes less of a mess. Be sure to wash the comb afterwards."
    },
    {
      "title": "Mix curd with egg and mayonnaise to promote hair growth.",
      "content": "Mix curd with egg and mayonnaise to promote hair growth. Grab a medium-sized bowl, and add 1 egg, 1 cup (240 mL) of plain curd, and 1 cup (240 mL) of mayonnaise. Mix the ingredients together with a spoon until it is a smooth paste. This combination works great to strengthen your hair, and it may make your hair grow faster."
    },
    {
      "title": "Use honey with your curd to make your hair soft and shiny.",
      "content": "Use honey with your curd to make your hair soft and shiny. Scoop 1 cup (240 mL) of curd and pour 2 teaspoons (9.9 mL) of honey into a small bowl. Use a metal or wooden spoon to mix up the ingredients to create your hair mask . [2] X Research source This is a great idea if your hair is dry and damaged and you want to revitalize the follicles. Honey is a great natural moisturizer that helps reduce dryness. However, keep in mind that honey can lighten or fade your hair color, especially if you use if frequently."
    },
    {
      "title": "Add banana to your curd to deeply condition your hair and reduce frizz.",
      "content": "Add banana to your curd to deeply condition your hair and reduce frizz. Chop up 1 ripe banana into small chunks. Then, place the chunks in your blender. Add 2 tablespoons (30 mL) of curd and 2 tablespoons (30 mL) of honey into the blender, and use a medium speed setting to mix up your ingredients. Blend until this becomes a smooth paste. Then, use a mesh strainer to get rid of any large chunks. For best results, you want a completely smooth paste. Banana and honey are both great moisturizing agents, and they also eliminate frizz and dullness. Remember, honey can lighten your hair color, so use it with caution. If you have extremely dry hair, add 2 tablespoons (30 mL) of coconut oil for a deeply moisturizing option."
    },
    {
      "title": "Use black pepper, vinegar, lemon, egg, fenugreek, or Besan for dandruff.",
      "content": "Use black pepper, vinegar, lemon, egg, fenugreek, or Besan for dandruff. Curd in general works great as a dandruff treatment because of the vitamin B5 and proteins. However, you can mix other ingredients into your mask for a more effective anti-dandruff treatment. Use 1 added ingredient for mild dandruff, or try 2 for severe dandruff. To use black pepper, mix 1 to 2 teaspoons (4.9 to 9.9 mL) of black pepper to 1 cup (240 mL) of curd, then apply it as a hair mask. If you want to use vinegar, stir 1 to 2 teaspoons (4.9 to 9.9 mL) of vinegar into 1 cup (240 mL) of curd to create a hair mask that will leave your hair shiny. Keep in mind that the mask may have a strong smell, but you can wash away the scent with shampoo once the treatment is over. When using lemon, add 1 to 2 teaspoons (4.9 to 9.9 mL) of lemon to 1 cup (240 mL) of curd. Use caution with lemon, however, as it can lighten your hair color, especially if you use it frequently. To use egg, simply mix 1 egg into 1 cup (240 mL) of curd to create a moisturizing mask. If you want to use fenugreek seeds, soak 2 teaspoons (9.9 mL) overnight, then grind them up. Mix them into 1 cup (240 mL) of curd to form a paste, which you can use as a mask. When using Besan flour, mix 2 teaspoons (9.9 mL) into 1 cup (240 mL) of curd to make a paste, then smooth it onto your hair."
    },
    {
      "title": "Store your mask in an airtight container in the fridge for up to 2 days.",
      "content": "Store your mask in an airtight container in the fridge for up to 2 days. After you make your mask, you can use it right away. If you don't want to use it right then, scoop the mask into an airtight container, such as a glass jar or Tupperware. Then, place the mask in the fridge so the curd does not go bad. Use your hair mask within 2 days. You can do this for any of the masks above. However, blend the banana before you use it for optimum freshness."
    },
    {
      "title": "Apply your hair mask",
      "content": "Apply your hair mask from your roots to the ends of your hair. To use curd on your hair, scoop up the mask with a spoon or your fingers, and rub it over your hair starting at the roots and working toward the ends. Cover the front, back, and sides with your mask so all of your hair is thoroughly saturated. [3] X Research source Be careful not to oversaturate your hair. While you want all of the follicles coated in the mask, using too much can make your hair greasy. Although you can use your hands to apply the mask, it's best to use a color brush, which allows you to evenly apply it."
    },
    {
      "title": "Cover your head with a shower cap.",
      "content": "Cover your head with a shower cap. Stretch the edge of the shower cap around your head so all of the hair is inside. This way, your hair is covered as it processes. [4] X Research source The extra heat generated from inside the plastic shower cap also helps your hair absorb the curd. Additionally, the shower cap will prevent your mask from drying out. If it dries, it won't provide as many benefits."
    },
    {
      "title": "Let your mask sit for about 30 minutes to 1 hour.",
      "content": "Let your mask sit for about 30 minutes to 1 hour. After about 30 minutes, the curd and added ingredients should deeply penetrate your hair. For maximum absorption, let your hair process for about 1 hour. As you wait, you can read a book, flip through a magazine, or watch TV, for example. If you’d like, set a timer on your phone or kitchen clock to easily keep track of how long the mask is on your hair."
    },
    {
      "title": "Rinse out the mask thoroughly in cool water.",
      "content": "Rinse out the mask thoroughly in cool water. When you are ready to wash out the mask, take off your shower cap, and rinse your hair thoroughly in cool water. Use cool water for best results. Cool water works best to keep the hair follicle closed, which is helpful after you nourish your hair. You can use warm water if you prefer."
    },
    {
      "title": "Cleanse your hair with shampoo.",
      "content": "Cleanse your hair with shampoo . Once the majority of the mask is out of your hair, use a dime-size or quarter-size amount of shampoo to cleanse your hair. Massage your scalp, and work the shampoo from the roots to the end of your hair. Then, rinse out the shampoo thoroughly. If you have dry hair, you can apply conditioner and rinse it out afterwards, though this is not required."
    },
    {
      "title": "Apply your curd hair mask once every 1-2 weeks for healthy, shiny hair.",
      "content": "Apply your curd hair mask once every 1-2 weeks for healthy, shiny hair. Use your curd hair mask at least once every 15 days. For best results, you can use the mask once or twice a week. Regularly using a curd hair mask may promote hair growth, increase hair thickness, and improve overall hair health."
    }
  ]
}