{
  "url": "https://www.wikihow.com/Administer-a-Rabies-Vaccination",
  "title": "How to Administer a Rabies Vaccination",
  "steps": [
    {
      "title": "Wash your hands before putting on gloves.",
      "content": "Wash your hands before putting on gloves. Use warm water and antibacterial soap to wash your hands. Dry your hands with paper towels, and use the paper towel to turn off the faucet. Put on sterile gloves. [1] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Prepare the vaccine according to the instructions on the package insert.",
      "content": "Prepare the vaccine according to the instructions on the package insert. There are a few brands of rabies vaccine. Most come as a powder that must be mixed with sterile water. The package on the vaccine will indicate how much sterilized water you must mix with the powder. Roll the vial between your hands to gently mix the powder until it appears mostly clear. [2] X Trustworthy Source Immunization Action Coalition Nonprofit organization focused on promoting the use of vaccines by distributing information about vaccines and the diseases they prevent. Go to source Always prepare the vaccine immediately before you are about to administer it. Make sure to check the expiration dates on both the powder and the water. If either is expired, do not use it."
    },
    {
      "title": "Gather a clean syringe with a new 25-gauge needle.",
      "content": "Gather a clean syringe with a new 25-gauge needle. If you don’t have a pre-assembled syringe, attach a new needle to a clean syringe. Do not reuse needles from another vaccination. The size of the needle will depend on the age of the patient. [3] X Research source For adults, use a needle that is between 1–1.5 inches (2.5–3.8 cm). For children over the age of 1, use a 1 inch (2.5 cm) needle. For children under the age of 1, use a needle between 7 ⁄ 8 –1 inch (2.2–2.5 cm). If you are vaccinating multiple people at once, always use a separate syringe and needle for each injection. [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Fill the syringe",
      "content": "Fill the syringe with 1 dose of vaccine. Before filling the needle, pull back the plunger to measure the correct dose. Insert the syringe into the vial at a 90-degree angle and press down on the plunger. Flip over the vaccine bottle. Pull back the plunger to fill the syringe. Tap the barrel of the syringe and push gently on the plunger to release any air bubbles. [5] X Research source In most cases, one dose of this vaccination is 1 ml of liquid, but depending on the brand of the vaccine and age of the patient, this may vary from 0.5 ml up to 2 ml."
    },
    {
      "title": "Educate the patient about the vaccine before you administer it.",
      "content": "Educate the patient about the vaccine before you administer it. Explain the procedure of giving a vaccine. Warn them that there might be some slight redness and swelling at the injection site. Allow the patient to ask any questions. [6] X Research source Remind the patient that the vaccine is necessary if bitten by an animal that has a high risk of carrying rabies, such as a raccoon, squirrel, bat, or feral dog. You may want to emphasize that the vaccine is almost 100% effective in preventing the development of rabies. Once rabies develops, however, it is nearly almost always fatal. Tell the patient to watch out for side effects after the vaccine, such as confusion, dizziness, diarrhea, seizures, muscle weakness, burning at the injection site, or swelling around the eyes. Advise them to get immediate treatment if they notice these symptoms."
    },
    {
      "title": "Choose an appropriate injection site.",
      "content": "Choose an appropriate injection site. For anyone over the age of 1, give the vaccine on the deltoid muscle, which is the rounded muscle on the upper arm near the shoulder. Children under the age of 1 should be injected on the gluteal area on the outer thighs. [7] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Make sure that the site is not bruised, wounded, or injured. If one arm is injured, inject the vaccine into the other arm. Never administer the vaccine to an adult on the gluteal area. This may reduce the effectiveness of the vaccine."
    },
    {
      "title": "Wipe the chosen site with cotton balls soaked in rubbing alcohol.",
      "content": "Wipe the chosen site with cotton balls soaked in rubbing alcohol. Move from the inner to the outer part of the injection site to eliminate harmful microorganisms. Let the area dry. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Inject the vaccine into the muscle at a 90-degree angle.",
      "content": "Inject the vaccine into the muscle at a 90-degree angle. Press down on the plunger with your thumb to release the vaccine. Once you are finished, pull it out, keeping the syringe and needle straight as you do so. [9] X Trustworthy Source Immunization Action Coalition Nonprofit organization focused on promoting the use of vaccines by distributing information about vaccines and the diseases they prevent. Go to source"
    },
    {
      "title": "Apply pressure to the site with a cotton ball and apply a bandage.",
      "content": "Apply pressure to the site with a cotton ball and apply a bandage. This will prevent any blood from leaking. Do not rub the area as this may irritate the injection site."
    },
    {
      "title": "Discard the used syringe and needle in a puncture proof container.",
      "content": "Discard the used syringe and needle in a puncture proof container. Do this immediately after giving the vaccine to prevent pricking yourself or the patient. Throw the cotton balls in the trash can. [10] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source"
    },
    {
      "title": "Remove the sterile gloves and wash your hands thoroughly.",
      "content": "Remove the sterile gloves and wash your hands thoroughly. Do this with antibacterial soap and clean water. To avoid infections and transmission of diseases, never reuse needles or syringes. Always use a new set for each vaccination. [11] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Give 3 doses over 1 month for a pre-exposure vaccination.",
      "content": "Give 3 doses over 1 month for a pre-exposure vaccination. After the first dose on day 0, give the second dose on day 7 and the third dose on either day 21 or 28. The pre-exposure prophylaxis is usually given to people who face a high risk of rabies, such as wildlife workers and veterinarians. [12] X Research source With the pre-exposure vaccine, a few days difference in timing on the third dose does not matter."
    },
    {
      "title": "Inject 4 doses over 2 weeks to an un-immunized patient after exposure.",
      "content": "Inject 4 doses over 2 weeks to an un-immunized patient after exposure. An un-immunized patient is someone who has not received the pre-exposure vaccine. The first injection is given on day 0. The next injections on days 3, 7, and 14. It is usually given to someone who has been bitten by wildlife or who has come into contact with bats. [13] X Research source If there is a visible wound, you may also need to apply human rabies immune globulin to the wound. Consult your practice or hospital’s protocol for further information. With the post-exposure vaccination, it is important to stay on track with the timing of the dose. If the patient has a compromised immune system, provide an additional dose on day 28."
    },
    {
      "title": "Give 2 doses over 1 week to an immunized patient after exposure.",
      "content": "Give 2 doses over 1 week to an immunized patient after exposure. Even if a patient has received the pre-exposure prophylaxis, they still need a post-exposure vaccination if bitten. Administer the second dose 3-7 days after the first. [14] X Research source"
    }
  ]
}