{
  "url": "https://www.wikihow.com/Blow-Your-Nose",
  "title": "How to Blow Your Nose",
  "steps": [
    {
      "title": "Hold a tissue or handkerchief over your nose.",
      "content": "Hold a tissue or handkerchief over your nose. Place the tissue or handkerchief over your nose and hold it there. Tissues prevent the spread of germs because you throw them away after use while handkerchiefs are more likely to spread germs, but are more environmentally friendly than tissues. [1] X Research source If you have the cold, flu, or another virus, it may be beneficial to use tissues to prevent the spread of germs. If you have allergies, a handkerchief may be the better option. If you don’t have tissues or a handkerchief, you can use toilet paper as an alternative. Avoid blowing your nose with coarser materials like paper towels or napkins. If you have sensitive skin, consider purchasing tissues that have lotion in them."
    },
    {
      "title": "Press a finger against one of your nostrils to close it off.",
      "content": "Press a finger against one of your nostrils to close it off. You shouldn’t be able to breathe out of that nostril. Keep the tissue or handkerchief over your nose so that you don’t get mucus on your hands. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source It's generally polite to excuse yourself from the table when you blow your nose. If you're in a public situation, consider going to the bathroom or closing your office door before blowing your nose."
    },
    {
      "title": "Blow the open nostril into the tissue or handkerchief gently.",
      "content": "Blow the open nostril into the tissue or handkerchief gently. Blow with as little force as you possibly can. Blowing too hard could cause mucus to go up into your sinuses which could cause an infection and worsen your symptoms. If you blow and nothing comes out, do not blow again. [3] X Research source Remember to wipe up excess mucus on the outside of your nose when you've finished blowing. Blowing your nose too hard could also make the blood vessels in your nose more inflamed. If nothing comes out, it means that your mucus is too thick or your nose is clogged higher up."
    },
    {
      "title": "Repeat the process on the other nostril.",
      "content": "Repeat the process on the other nostril. Press down on your other nostril and gently blow the mucus out the nostril you held closed before. If done properly, you’ll have properly blown your nose without infecting your sinuses. [4] X Research source Blowing one nostril at a time will help expel mucus easier. Throw away the tissue after you blow your nose so that you don't spread germs."
    },
    {
      "title": "Squeeze the mucus out of your nose instead of blowing it.",
      "content": "Squeeze the mucus out of your nose instead of blowing it. Squeeze at the center of your nose and push down towards your nostrils to push the mucus out. This is an alternative to blowing your nose that will prevent you from accidentally blowing too hard. [5] X Research source"
    },
    {
      "title": "Wash your hands",
      "content": "Wash your hands . Lather your hands with soap and rinse them thoroughly under the faucet. Then, dry them off with a towel or rag. This will prevent the spread of germs and will reduce the chance of getting other people sick. [6] X Research source Antibacterial soap is no better at removing germs than traditional soap."
    },
    {
      "title": "Take decongestants or antihistamines to prevent mucus.",
      "content": "Take decongestants or antihistamines to prevent mucus. Over-the-counter decongestants and antihistamines may reduce the amount of mucus and congestion from a sinus infection or cold. These medicines usually come in pill or spray form and can be found at pharmacies. [7] X Expert Source Monica Kieu, DO, FACS Board Certified Otolaryngologist Expert Interview. 20 October 2020. Antihistamines are more effective at treating symptoms of hay fever or allergies and are less effective at treating a cold or flu."
    },
    {
      "title": "Spray a saline spray",
      "content": "Spray a saline spray up your nose. You can purchase a saline spray over the counter at a pharmacy or department store. Hold the spray near the opening of your nostril and spray the solution into each nostril. [8] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Saline spray reduces mucus buildup in your nose."
    },
    {
      "title": "Apply a warm compress over your nose to loosen mucus.",
      "content": "Apply a warm compress over your nose to loosen mucus. Hold a washcloth under hot running water and wring it out. Press the compress over your nose and forehead for 1-2 minutes. This should reduce your congestion and potentially loosen any mucus in your nose. [9] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Inhale steam with eucalyptus oil in it to help your sinuses drain.",
      "content": "Inhale steam with eucalyptus oil in it to help your sinuses drain. Boil a pot of water over your stovetop and put a couple drops of eucalyptus oil in it. Once it starts boiling, inhale the steam that comes off the water. This should reduce your congestion and make blowing your nose much easier. [10] X Research source If you don't have eucalyptus, then inhaling steam may still reduce your runny or stuffy nose."
    },
    {
      "title": "Avoid known allergens to prevent clogged sinuses.",
      "content": "Avoid known allergens to prevent clogged sinuses. Reducing your exposure to the allergens will cut down on your runny nose and congestion so that you don’t have the urge to blow it as often. Commonly people are allergic to animal dander and pollen. [11] X Research source You can ask your doctor to take an allergy test if you’re unsure if you have any allergies. If your nose is stuffy due to allergies, taking an over-the-counter allergy medication can help. [12] X Expert Source Monica Kieu, DO, FACS Board Certified Otolaryngologist Expert Interview. 20 October 2020."
    }
  ]
}