{
  "url": "https://www.wikihow.com/Calculate-BTU-Per-Square-Foot",
  "title": "How to Calculate BTU Per Square Foot",
  "steps": [
    {
      "title": "Measure the square footage",
      "content": "Measure the square footage of your entire home. If you're installing a furnace, find the square footage of each room in your home and add them together. This will give you the total square footage of your space so you can choose a furnace that will adequately heat your home. For a rectangular room, multiply the length and width, measured in feet. [1] X Research source For a triangular room, multiply the length and width, then divide by 2. For a circular room, measure the radius (“r” which is the distance from the center to the edge). Plug the radius into the following equation, using 3.14 for π: πr 2 For rooms with odd shapes, divide them into regular shapes and measure each shape separately. If the room is not rectangular, you can try to break it up into rectangles so that you can calculate several lengths times widths. [2] X Research source For example, if your room is L shaped, break that up into two non-overlapping rectangles. Then calculate length times width for both rectangles and add them up. [3] X Research source"
    },
    {
      "title": "Find out which climate zone you live in to determine the heating factor.",
      "content": "Find out which climate zone you live in to determine the heating factor. Look for a climate zone map online and figure out which zone you live in to help you determine the heating factor, or the number of BTUs you need per square foot to adequately heat your home. In general, the further from the equator you live, the greater the number of BTUs you’ll need. [4] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source"
    },
    {
      "title": "Multiply your square footage by the heating factor for your zone.",
      "content": "Multiply your square footage by the heating factor for your zone. All you have to do to find out what capacity furnace is best for your home based on its location is to multiply the square footage of the space by the heating factor. For instance, if you live in Zone 2 and have a 1,200-square-foot home, multiply 1,200 by 35-40 to get a BTU range of 42,000-48,000."
    },
    {
      "title": "Use the lower end of the range if your home is well insulated or the higher end if it’s not.",
      "content": "Use the lower end of the range if your home is well insulated or the higher end if it’s not. Better insulated homes need fewer BTUs per hour per square foot than older homes. If your home is new or well insulated, you can use the lower of the 2 numbers for your climate zone; if it is older or poorly insulated, use the higher number of the range. [5] X Research source Say that you live in a brand new home in Zone 1. Multiply your square footage by 30 BTUs to find out what capacity furnace you need. Alternatively, if you live in an older home in Zone 6, multiply your square footage by 60 BTUs to ensure you purchase a furnace with enough capacity to heat the space. Note that newer homes tend to be better insulated than older homes because of revisions to building codes over the years."
    },
    {
      "title": "Take the efficiency rating of the furnace into account.",
      "content": "Take the efficiency rating of the furnace into account. Furnaces are rated not by the actual BTU output you receive but by the amount of heat they generate. How much of the heat a furnace generates (input heat) that actually reaches you (output heat) is a measure of how efficient the furnace is. The efficiency is expressed in percentage as a ratio of the output to input heat. Most modern furnaces are rated as either 80 or 90% efficient. [6] X Research source For example, a 100,000 BTU/h input furnace would not be enough to heat a home needing an output of 100,000 BTUs per hour. An 80% efficient furnace would deliver an output of only 80,000 BTU/h (100,000 x 0.8). To find an 80% efficient furnace that does provide enough power, divide the BTU/h rating you need by 0.8. So, 100,000 BTU/h ÷ 0.8 = 125,000 BTU/h, meaning you'd need a furnace rated to 125,000 BTU/h input."
    },
    {
      "title": "Measure the square footage",
      "content": "Measure the square footage of the space you plan to cool. If you want to install a central air-conditioning unit, measure the square footage of each room and add all of the numbers together to find the total square footage of your home. Alternatively, if you’re only going to install an A/C unit to cool a single room, find the square footage of that room. [7] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source Multiply the length by the width, in feet, to find the square footage of a rectangular room. Multiply the length and width of a triangular room, then divide that number by 2 for a triangular room. Measure the radius of a circular room (“r” which is the distance from the center to the edge), square the number, then multiply that by π (3.14) (the formula is: πr 2 ). Divide rooms with odd shapes or alcoves into regular shapes and measure each shape separately."
    },
    {
      "title": "Multiply your square footage by 20 BTUs to get a general estimate.",
      "content": "Multiply your square footage by 20 BTUs to get a general estimate. Typically, plan to purchase a heating or cooling unit with 20 BTUs for every square foot of space you have. However, keep in mind that factors such as your climate zone, sun exposure, and the number of people living in your home may require you to adjust this figure. [8] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source For instance, if you live in a home that’s 800 square feet, you’ll need a unit with 16,000 BTUs. On the other hand, if you live in a 5,000-square-foot home, get a unit with 100,000 BTUs."
    },
    {
      "title": "Select an A/C unit with a lower capacity if you don’t have a lot of sun exposure.",
      "content": "Select an A/C unit with a lower capacity if you don’t have a lot of sun exposure. The position of your home also affects how many BTUs you need to properly heat or cool it. Reduce the capacity by 10% if your home or room gets a lot of shade, or increase the capacity by 10% if your home or room is usually in the sunshine. [9] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source Take a look at your sun exposure during the middle of the day in the summer season to help you gauge this accurately."
    },
    {
      "title": "Increase the capacity if more than 2 people live in your home.",
      "content": "Increase the capacity if more than 2 people live in your home. If you have a lot of family members, you’ll need an air conditioner that has a higher capacity. Add 600 BTUs per person for a family of more than 2. [10] X Research source For instance, if there are 6 people living in your home, multiply 600 by 4 to get 2,400. Add 2,400 BTUs to the number you calculated by multiplying your square footage by 20 to ensure your unit will cool your space well."
    },
    {
      "title": "Get a system with more BTUs if it will be in the kitchen.",
      "content": "Get a system with more BTUs if it will be in the kitchen. Kitchens have lots of appliances that give off heat, including stoves and dishwashers. If you’re installing an A/C unit in your kitchen, select one with 4,000 more BTUs than you need based on the square footage alone."
    },
    {
      "title": "Factor in the unit’s efficiency rating.",
      "content": "Factor in the unit’s efficiency rating. While furnaces are rated by their effectiveness in delivering the heat they generate, air conditioners are rated by how efficiently they use electricity over the course of a typical operating year. One such rating is the Seasonal Energy Efficiency Ratio (SEER) rating, created by the Air Conditioning, Heating, and Refrigeration Institute, which is the ratio of the unit's cooling output in BTUs divided by the energy in watt-hours needed to run it for the entire operating year. (Note that 1 kilowatt-hour equals 1,000 watt hours.) [11] X Research source For example, take a 4,000 BTU/hour air conditioner run for 1,000 hours during an operating year using 400,000 watt-hours of electric power. This air conditioner would have a SEER rating of 10, since 4,000 x 1,000 / 400,000 = 10. To find the average power consumption, divide the unit's power in BTUs per hour by the SEER rating. Since the SEER rating is in units of BTU per Watt-hour, your answer will be in terms of watts. In the example above, (4,000 BTU/h) / (10 BTU/Wh) = 400 W. Central air conditioners manufactured in the United States since January 2006 are required to have a SEER rating of at least 13, or 14 to be Energy Star qualified. Room air conditioners are currently exempt from this requirement; many have SEER ratings closer to 10."
    }
  ]
}