{
  "url": "https://www.wikihow.com/Build-a-DNA-Model",
  "title": "How to Build a DNA Model",
  "steps": [
    {
      "title": "Purchase a pack of multicolor pipe cleaners.",
      "content": "Purchase a pack of multicolor pipe cleaners. Try to look for a pack of pipe cleaners that has at least 6 colors in it. You’ll need different colors for the different parts of your DNA model. Plus, they’ll make your model more vibrant and interesting to look at! [1] X Research source If you can’t find a pack of pipe cleaners with 6 colors in it, that’s okay. You can use the same colors for different sections of your DNA model if necessary. You can find pipe cleaners at your local craft store or department store, or you can order some online."
    },
    {
      "title": "Choose 2 colors for the outer strands and 4 colors for the inner strands.",
      "content": "Choose 2 colors for the outer strands and 4 colors for the inner strands. Your DNA model will have strands that run along the outside of the model and strands that are on the inside. The colors you choose for the strands don’t matter, but try to use 6 different colors if you can. [2] X Research source For example, you could choose blue and pink pipe cleaners for the outer strands and green, yellow, purple, and red pipe cleaners for the inner strands. The 2 colors for the outer strands will represent sugar (deoxyribose) and phosphate, while the 4 colors for the inner strands will be the cytosine, thymine, guanine, and adenine."
    },
    {
      "title": "Grab a pipe cleaner in each outer-strand color and twist them together.",
      "content": "Grab a pipe cleaner in each outer-strand color and twist them together. To twist the pipe cleaners together, start by holding them so they’re parallel and their sides are touching. Then, use your hands to twist them together, starting at one end and working your way down to the opposite end. [3] X Research source When you’re finished, you should have one long, twisted strand made up of 2 different color pipe cleaners."
    },
    {
      "title": "Repeat with 2 pipe cleaners in the same colors to make the other strand.",
      "content": "Repeat with 2 pipe cleaners in the same colors to make the other strand. When you’re done, you should have 2 matching, twisted outer strands. Make sure you use the same 2 colors for both of the outer strands you make. [4] X Research source For example, if you used pink and blue pipe cleaners to make the first outer strand, you’ll want to use pink and blue pipe cleaners to make the second outer strand as well."
    },
    {
      "title": "Take a pipe cleaner in each inner-strand color and cut it into 5 equal pieces.",
      "content": "Take a pipe cleaner in each inner-strand color and cut it into 5 equal pieces. To cut the pipe cleaners into 5 equal pieces, start by measuring out the 5 sections with a ruler (or eyeballing it if you’d prefer) and bending the pipe cleaners where you’ll make each cut. Then, use a pair of scissors to cut through the creases along each of the pipe cleaners so that each one is divided up into 5 equal parts. Since you’ll be using 4 pipe cleaners and cutting each one into 5 equal pieces, you should end up with 20 pieces in total."
    },
    {
      "title": "Pair 10 inner strand pieces with each outer strand.",
      "content": "Pair 10 inner strand pieces with each outer strand. It doesn’t matter which inner strand pieces you pair with each outer strand, but try to only use 2 inner-strand colors per outer strand. [5] X Research source Make sure all the nitrogenous bases (adenine, thymine, cytosine, and guanine) are represented on each outer strand. In order to do this, assign a particular color to each base. For example, you could use red for adenine, blue for thymine, green for cytosine, and yellow for guanine. After you’ve assigned the colors, you can accurately pair the complementary bases. Adenine always pairs with thymine, while guanine pairs with cytosine. So, if you have a red (adenine) pipe cleaner on one side, put a blue (thymine) pipe cleaner in the same spot on the other side, and so on. Once you’ve paired up the inner and outer strands, keep them separated so you don’t get all of the pipe cleaners mixed up."
    },
    {
      "title": "Attach the inner strands to their corresponding outer strand.",
      "content": "Attach the inner strands to their corresponding outer strand. To attach the strands, wrap the inner strands around their outer strand so they’re evenly spaced apart up and down the strand. Alternate colors as you go. Leave about 1 inch (2.5 cm) of each inner strand extending off of the outer strand it’s attached to. [6] X Research source You want the ends of the inner strands that are extending off of the outer strands to all be going in the same direction."
    },
    {
      "title": "Line up the inner strands on both outer strands and tape them together.",
      "content": "Line up the inner strands on both outer strands and tape them together. When you line up the strands, the pipe cleaners should look like a ladder. To tape the inner strands together, simply line up the ends so they’re overlapping slightly and then wrap a piece of clear tape around them. Do this for each set of inner strands along your model. [7] X Research source If you don’t have clear tape, that’s OK. You can use different tape instead. It may just be a little visible once your model is finished."
    },
    {
      "title": "Twist the strands into a helix to finish your DNA model.",
      "content": "Twist the strands into a helix to finish your DNA model. To twist your model into a helix, start by grabbing onto each end with your hands and slowly twisting your hands in opposite directions. Once your model has a spiral shape, press your hands together to squish the model flat, which will help the pipe cleaners remain twisted in a helix. Once your DNA model retains its shape, you’re finished! [8] X Research source If your model starts to lose its shape after a while, just twist and compress it with your hands again."
    },
    {
      "title": "Purchase 48 white Styrofoam balls for your project.",
      "content": "Purchase 48 white Styrofoam balls for your project. Look for Styrofoam balls that are around 1 inch (2.5 cm) in diameter. Make sure you get white balls since you’ll need to paint them different colors for your project. [9] X Research source You can find Styrofoam balls at your local craft store or online."
    },
    {
      "title": "Take 24 of the balls and paint 12 green and leave 12 white.",
      "content": "Take 24 of the balls and paint 12 green and leave 12 white. These green and white balls will make up the strands that run along the outside of your DNA model, or the sugar and phosphate of your double helix. To paint half of the balls green, use a paintbrush to apply a thin layer of green, water-based paint. Then, set the balls aside to dry while you work on the rest of your model. [10] X Research source You can find water-based paint at your local craft store or department store. You can also order some online."
    },
    {
      "title": "Split the other 24 balls into piles of 6 and paint each pile a different color.",
      "content": "Split the other 24 balls into piles of 6 and paint each pile a different color. Use red, blue, yellow, and orange to paint the balls in the piles. These balls will make up the inner strands of your DNA model, which represent guanine, cytosine, thymine, and adenine. [11] X Research source When you’re finished painting each ball, set it aside to dry on a sheet of newspaper or a paper towel. You should have 6 red balls, 6 blue balls, 6 yellow balls, and 6 orange balls."
    },
    {
      "title": "Slide 1 red ball and 1 yellow ball onto a toothpick so they’re connected.",
      "content": "Slide 1 red ball and 1 yellow ball onto a toothpick so they’re connected. Your DNA model will be made up of individual “rungs” (like on a ladder), and these 2 balls will be the center of the first rung. Leave a little space between the balls so they’re not touching. [12] X Research source"
    },
    {
      "title": "Attach a white ball to each end of the first rung.",
      "content": "Attach a white ball to each end of the first rung. To attach the white balls, start by inserting toothpicks into the red and yellow balls so that each toothpick is lined up with the toothpick in the center. Then, stick a white ball onto the end of each toothpick. When you’re finished, the first rung should have a white ball on each end and a red and yellow ball in the middle."
    },
    {
      "title": "Insert toothpicks into the tops of the white balls at opposite angles.",
      "content": "Insert toothpicks into the tops of the white balls at opposite angles. These toothpicks—1 on each white ball—will help support the next rung up on your DNA model, so you want them to be sticking up out of the top of the white balls on the first rung. However, to give your DNA model the proper helix shape, you’ll want to angle the toothpicks slightly and insert them so they’re pointing in opposite directions. The angle of the toothpicks doesn’t need to be precise. As long as they’re sticking up at an angle and they’re angled in opposite directions, your model will work."
    },
    {
      "title": "Stick a green ball onto the toothpicks sticking out of each white ball.",
      "content": "Stick a green ball onto the toothpicks sticking out of each white ball. Push the green balls down all the way so they’re touching the white balls. These green and white balls will make up the outer strands of your model, and they’ll help support the next rung. The green balls represent phosphate, while the white ones represent sugar (deoxyribose). Since you angled the toothpicks in the white balls, the green balls should be sitting on top of the white balls at an angle as well."
    },
    {
      "title": "Create the next rung using blue and orange balls this time.",
      "content": "Create the next rung using blue and orange balls this time. The colors should alternate in each rung in your model. Since you used red and yellow balls to make the first rung, you’ll want to use blue and orange balls to make the next one. Just like with the first rung, start by connecting a blue and orange ball with a toothpick. Then, attach a white ball to each end of the rung. In order to accurately represent the complementary base pairs, make sure to always pair red with yellow and blue with orange between the 2 strands. You should also insert a toothpick into each white ball so they’re angled in opposite directions like you did with the first rung."
    },
    {
      "title": "Use toothpicks to attach the second rung to the green balls.",
      "content": "Use toothpicks to attach the second rung to the green balls. Insert a toothpick into each green ball so it’s angled in the same direction as the toothpick in the white ball below it. Then, stick the white balls at the end of the second rung onto these toothpicks. At this point you’ll be able to see the beginning of your DNA model’s helix shape."
    },
    {
      "title": "Continue to attach new rungs until you’ve used all of the Styrofoam balls.",
      "content": "Continue to attach new rungs until you’ve used all of the Styrofoam balls. Remember to alternate the colors you’re using when you’re building the rungs. Also, don’t forget to attach green balls in between each rung in the model. Once you’ve used all of the balls, your DNA model is finished! If you want your model to stand up on its own, attach the rung at the bottom to a Styrofoam block using toothpicks."
    }
  ]
}