{
  "url": "https://www.wikihow.com/Be-a-Fashionable-Teenage-Boy",
  "title": "How to Be a Fashionable Teenage Boy",
  "steps": [
    {
      "title": "Devote time to being fashionable.",
      "content": "Devote time to being fashionable. Developing your personal style takes a certain amount of enthusiasm and passion. Finding a style that you like can really help you when getting started. A great way to start, especially if you don’t know much about men’s fashion, is to read blogs and magazines that are devoted to style, and take tips you like from them. Look at celebrities that you like for style cues. Pick a celebrity you like who has a similar body type as you and see what clothes you already own that look similar. A great way to start is to also simply search “men’s style tips” and see what is currently trending. Then take a look at your current wardrobe and see if you can emulate popular styles."
    },
    {
      "title": "Take stock of your current style.",
      "content": "Take stock of your current style. Compare your style to the current trends and see how you can incorporate any of your clothes into a fashionable look. Look at what’s currently in style in terms of colors, patterns, and fit. For example, clothes that offer a slimmer cut and a more tailored fit might be what’s popular. Perhaps you have a lot of clothes that have patterns that are out of style. Compare what’s popular to what you have and separate outdated items from popular items. While taking stock, you may find that you have some older clothes that have come back into style that you can take out of retirement."
    },
    {
      "title": "Don’t change who you are just for the sake of being fashionable or trying to fit in with what’s popular.",
      "content": "Don’t change who you are just for the sake of being fashionable or trying to fit in with what’s popular. Changing to a certain look or style just because it’s \"the cool thing to do\" doesn't mean it’s right for you. More than anything else, be yourself. Part of being fashionable means feeling comfortable in not only your skin but your clothes. If you have a favorite shirt or sweatshirt, you don’t have to get rid of it just to be fashionable. Keep clothes that make you feel comfortable for now. You may find that when building outfits you can use some of them."
    },
    {
      "title": "Read websites and publications devoted to male fashion.",
      "content": "Read websites and publications devoted to male fashion. These include GQ, Esquire, Fashion Beans, or Reddit’s Male Fashion Advice. [1] X Research source You can find places and forums where people will share style tips and wardrobe ideas. Don’t buy into everything you read. People sometimes get very adamant that there is a right and wrong way to be fashionable. While there are trends in fashion, it is largely subjective. These resources are also a great way to find looks and clothing items that may fit better into your budget. You may see a jacket or pair of jeans that you really like, but are too expensive. You can use these resources to find similar items at a better price. Make a mood board filled with outfit and style inspiration so you can brainstorm different looks. [2] X Expert Source Susan Kim Professional Stylist Expert Interview. 4 May 2021."
    },
    {
      "title": "Look for brands and stores that appeal to you.",
      "content": "Look for brands and stores that appeal to you. When you find a brand or store that has a lot of clothes you really like and that fit you really well, you can easily upgrade your style and feel confident. How clothes fit you play a big role in looking fashionable. Just because you love a particular item doesn’t mean it will always fit you correctly, depending on your body type. Depending on your height, weight, and overall body type, certain clothes will fit you better than others. [3] X Research source If you’re a bigger guy, avoid horizontal stripes and opt for vertical ones. Vertical stripes will draw the eyes downward and make you look slimmer. If you’re a slimmer guy, you can wear clothes that are tighter-fitting and will accentuate a tight waist. In general, being a fashionable teenage boy means wearing clothes that create visual tricks which will make your body look as evenly proportioned as possible. Some people like tighter-fitting clothing while others go for a more relaxed fit, but for the most part, you should avoid overly baggy clothes. A more tailored fit will make a huge difference."
    },
    {
      "title": "Update your wardrobe for current trends.",
      "content": "Update your wardrobe for current trends. Being fashionable requires a bit of creative improvisation. Experiment with new looks and disregard anything that you don't feel comfortable with. Updating your wardrobe can seem like a daunting task and can easily get expensive, which can be difficult especially if you’re still growing and don’t have a lot of extra money, but you can do a lot with a little. Separate your clothes into two categories: clothes you like and wear, and clothes you don’t wear. Clean out your wardrobe by donating or selling the clothes you don’t wear. [4] X Expert Source Susan Kim Professional Stylist Expert Interview. 4 May 2021. Then take a look at your “keep” pile. Note which clothes are fashionable and which ones aren’t. This will help you start to build a base for your updated wardrobe."
    },
    {
      "title": "Organize a shopping trip.",
      "content": "Organize a shopping trip . Ask a parent, older sibling, girlfriend, or any fashionable friend to go shopping with you. They might be able to offer advice and pick out some great clothes for you. Your siblings or your friends will be able to give you advice on what works or doesn’t work for you and can help you pick out something that you might not on your own. Create a list of clothing items that you need as staples. [5] X Research source For example, you may want to get one pair of jeans you can wear for almost any occasion, a pair of chinos, a casual button-down shirt, a dress shirt, and a sweater."
    },
    {
      "title": "Give away any clothes that you don't wear.",
      "content": "Give away any clothes that you don't wear. Often times we hang onto clothes that don't fit or we hardly ever wear. Gather up these clothes and donate them to a charitable organization or sell them to a resale shop. Be prepared that your parents may be reluctant to throw out clothes that still fit you. If your parents are reluctant to let you get rid of the clothes you already have, you can try selling them to earn your own money for new clothes. Just make sure that you are upfront with your parents. Being a teenager can make it hard to find the right fit since you may grow several inches in just a few months. Check out consignment stores for cheaper clothes, or shops like H&M and asos, which offer plenty of trendy items at lower prices. [6] X Research source [7] X Research source Shopping at stores that offer lower prices can also help you to convince your parents to update your wardrobe."
    },
    {
      "title": "Mix and match clothes",
      "content": "Mix and match clothes from your new spiced up wardrobe. It doesn’t take a lot to create several different looks. Think about the occasion that you’re dressing for and pick out items that look appropriate. If you’re going to school, you may want to wear clothes that you’ll feel comfortable in all day. You can also create several fashionable looks with a few staple items like a dark pair of jeans. You can wear jeans with sneakers and a sweater to school, add a blazer or light jacket and change into boots if you’re going somewhere after school. You’ll create a whole new look in a few minutes by adding or changing just a few items. Mix and match items based on your mood. Maybe you’re in less of a classy mood and more in a street-style mood. Pair your sneakers with jeans or joggers, a plain t-shirt, and a light jacket."
    },
    {
      "title": "Accent your wardrobe with accessories.",
      "content": "Accent your wardrobe with accessories. Small accents to your wardrobe will go a long way in enhancing your style. Consider wearing an accessory that can be your signature like a scarf, hat, bracelet, etc. Remember that being fashionable is subjective, and you should feel comfortable with the number of accessories you wear. Look for accessories that you might already have that are sentimental to you like a necklace. Own your style. Maybe you like to wear bracelets, necklaces, and even earrings. Don’t let others’ opinions make you feel awkward for choosing to wear what you wear, because you’ve put in the effort to show off your own style. Use accessories to tie in a color palate or create some pop. One item that people often overlook is socks. Colorful and patterned socks can add some extra style to your look."
    },
    {
      "title": "Wear a watch.",
      "content": "Wear a watch. Being a fashionable guy means looking put together and mature no matter how old you are. One item that really does this is the watch. Even though we may have phones that tell time, a watch is an invaluable accessory and can tie a whole look together. Wearing a watch shows that you’re punctual and reliable and adds a level of maturity to your look. You also don’t have to spend a lot on a nice watch. Get a watch with a nylon band that can easily be switched for another one to match the rest of your outfit. A watch is also a great gift to ask for. And you can tell your parents or whoever may be giving you exactly which one you want."
    },
    {
      "title": "Wear a belt that fits your outfit",
      "content": "Wear a belt that fits your outfit . Besides holding your pants up, belts serve as a way to tie your whole outfit together, and a belt that doesn’t fit right will stand out. Belts are a great way to connect your shoes to the rest of your outfit. Wearing a brown belt that’s the same color as your shoes will make you look more put-together and fashionable. While sometimes it looks good to wear black and brown together, it can be tricky to pull off. Avoid wearing a brown belt on black pants or jeans as it usually looks mismatched. Get a belt that’s the right size for you. Nothing undoes an outfit like having a belt that’s way too big."
    },
    {
      "title": "Wear the right shoes.",
      "content": "Wear the right shoes. The right shoes complete an outfit, so don't become dependent on a single pair. [8] X Research source While one pair of shoes can be paired with several looks, some just aren’t right for every occasion. You don't want to wear skater shoes at a formal event. It’s always easier to wear nicer shoes with a casual outfit than it is to wear sneakers with a dressier one. For example, you can pair loafers or wingtips with jeans and a button-down or sweater and look good. And while it’s not impossible, it’s a lot harder to wear sneakers with a suit. Just because you’re a teenager doesn’t mean that you can’t wear dressier shoes either. Loafers, oxfords, wingtips, and nice boots can go a long way when looking fashionable. If you don’t have the budget to own a bunch of shoes, you can get a lot of mileage out of a few staples. Consider nice sneakers, a pair of boots, and a pair of dressier shoes to start out."
    },
    {
      "title": "Groom yourself.",
      "content": "Groom yourself. Clothes that fit well and that look good will only get you so far. Part of being a fashionable male means taking care of your body. Whether you like your hair long, buzzed, or somewhere in the middle, consider adding some product so that it looks styled and not like you just rolled out of bed. And be sure to wash it on a regular basis. Be honest with yourself about facial hair. Some teenagers can grow a full beard by 16, while other teens (and even adults) can’t. If you can grow facial hair make sure that it’s trimmed nicely and not like you were raised in the wilderness. If you can’t grow facial hair well, or it’s patchy, then shave it. A clean-shaven face always looks better than patches of peach fuzz. Keep your nails clean. Dirty or long nails are never attractive and can make you look like you don’t care about your appearance."
    }
  ]
}