{
  "url": "https://www.wikihow.com/Clean-Octopus",
  "title": "How to Clean Octopus",
  "steps": [
    {
      "title": "Slice off the head if you won't be using it.",
      "content": "Slice off the head if you won't be using it. Cut a firm, straight line just below the eyes through the flesh. A sharp knife or kitchen shears work best. [1] X Research source"
    },
    {
      "title": "Dispose of the internal organs if you want to keep the head.",
      "content": "Dispose of the internal organs if you want to keep the head. Slice through the head membrane at the base, to create a pocket-type structure with the flesh. Turn the pocket inside out, exposing the entrails and internal organs. Pull all of the innards away using your hands, and cut through any membranes. [2] X Research source The internal organs include the stomach sac, which is around the size of an avocado stone, the pipe structure, and many loose membranes. When all of the innards are removed, the head will be empty and look like a hat. [3] X Research source You will be left with an empty, pocket type structure. Flip it back the right way around to continue. [4] X Research source"
    },
    {
      "title": "Detach the eyes.",
      "content": "Detach the eyes. Pinch together the flesh surrounding the eyes, and neatly slice them off. You can use kitchen scissors or a sharp knife. [5] X Research source The eyes are disposed of in the majority of recipes. However, some people enjoy eating the eyes fried. [6] X Research source"
    },
    {
      "title": "Remove the skin.",
      "content": "Remove the skin. Use a knife to make a small incision into the outer membrane. You can then easily peel the skin away using your fingers. [7] X Research source"
    },
    {
      "title": "Spread the tentacles to locate the beak.",
      "content": "Spread the tentacles to locate the beak. The beak is found amid the start of the tentacles. It is black and looks similar to a bird’s beak. The beak is used by the octopus for predation, and is similar in structure to a fingernail. It is solid, muscular, and inedible; not something you want to find in your dish! [8] X Research source"
    },
    {
      "title": "Slice around the base of the beak.",
      "content": "Slice around the base of the beak. Use a paring knife to make a full circular cut around the beak. This will allow it to pop out cleanly. [9] X Research source"
    },
    {
      "title": "Push the beak out.",
      "content": "Push the beak out. Firmly press the soft surrounds of the beak using your thumbs. This will push it through to the other side so that it can be disposed. [10] X Research source"
    },
    {
      "title": "Hold the octopus under cold running water.",
      "content": "Hold the octopus under cold running water. If the head is still attached, begin with it flipped inside out to make sure that any remaining entrails are washed away. Then turn the head back the right way around to rinse off the outside. [11] X Research source It can help to have a large bucket in the sink when you are rinsing the octopus, as the process can get slippery."
    },
    {
      "title": "Flush the eye sockets.",
      "content": "Flush the eye sockets. Run each empty socket under the cold water. This will ensure that any remaining loose pieces are removed. [12] X Research source"
    },
    {
      "title": "Rinse the tentacles.",
      "content": "Rinse the tentacles. Hold each tentacle under running water in turn. Pay special attention to the suckers on the tentacles, making sure they are thoroughly washed out with water. [13] X Research source"
    }
  ]
}