{
  "url": "https://www.wikihow.com/Change-Your-Desktop-Background-in-Windows",
  "title": "5 Quick Ways to Change Your Desktop Wallpaper on Windows",
  "steps": [
    {
      "title": "Right-click an empty space on the desktop.",
      "content": "Right-click an empty space on the desktop. This will open a menu with various options. If you have multiple monitors , right-click on the monitor you want to change. Keep in mind you must have a Windows license to change your desktop background. To quickly change your background, right-click a photo and click Set as desktop background ."
    },
    {
      "title": "Click Personalize.",
      "content": "Click Personalize . This should be the last option in the menu, and will open personalization settings in the settings app. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source A new page will open."
    },
    {
      "title": "Click Background.",
      "content": "Click Background . This will be at the top of the list. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select a background type.",
      "content": "Select a background type. Click the drop-down menu next to Personalize your background to change it. You can choose the display option from the different types below: [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Picture - Allows you to select a picture to display on your desktop. Solid color - Allows you to select a solid color (e.g., gray) to fill your Windows desktop. Slideshow - Displays a series of photos from your computer's default \"Pictures\" folder in a slideshow."
    },
    {
      "title": "Select your background.",
      "content": "Select your background. Depending on your choice in the previous step, you'll be able to select a photo, a color, or an album to use as your background. Picture - There will be a selection of stock images, and images from your computer listed. Alternatively, click Browse and choose a picture from your computer files. You can use the drop-down menu next to \"Choose a fit\" to change the way the picture is displayed (e.g., filling your entire screen). Solid color - Select a color from the selection, or click Custom color to select a new one. Slideshow - To change this folder, click Browse and select a new folder. You can also choose the frequency of how often the image is changed, under the dropdown menu next to 'Change picture every:'. Finally, you can choose to shuffle the order of the pictures, or to turn off the slideshow on battery power (this will help conserve your battery life). It's best to make a new folder dedicated for your desktop background slideshow that contains the pictures you want as a background. For example, you could create a folder called \"Desktop Slideshow\" under the \"Pictures\" section of File Explorer , and save all your background images here."
    },
    {
      "title": "Right-click an empty space on the desktop.",
      "content": "Right-click an empty space on the desktop. Doing so will prompt a drop-down menu. Keep in mind you must have a Windows license to change your desktop background. To quickly change your background , right-click a photo and click Set as desktop background ."
    },
    {
      "title": "Click Personalize.",
      "content": "Click Personalize . This option is at the bottom of the drop-down menu. [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source A new window will open."
    },
    {
      "title": "Click the box beneath the \"Background\" heading.",
      "content": "Click the box beneath the \"Background\" heading. You can click one of the following options: [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Picture - Allows you to select a picture to display on your desktop. Solid color - Allows you to select a solid color (e.g., gray) to fill your Windows desktop. Slideshow - Displays a series of photos from your computer's default \"Pictures\" folder in a slideshow."
    },
    {
      "title": "Select your background.",
      "content": "Select your background. Depending on your choice in the previous step, you'll be able to select a photo, a color, or an album to use as your background. Picture - Recent and sample pictures will be listed and can be used by clicking one. You can also click Browse and choose a picture if you don't like the stock photos. Furthermore, you can click the box beneath \"Choose a fit\" to change the way the picture is displayed (e.g., filling your entire screen). Solid color - Select a color from the selection, or click Custom color to select a new one. Slideshow - To change the folder, select Browse and select a new folder. It's best to make a new folder dedicated for your desktop background slideshow that contains the pictures you want as a background. For example, you could create a folder called \"Desktop Slideshow\" under the \"Pictures\" section of File Explorer. When you're finished, click X to exit the window."
    },
    {
      "title": "Right-click an empty space on the desktop.",
      "content": "Right-click an empty space on the desktop. Doing so will prompt a drop-down menu. [6] X Research source"
    },
    {
      "title": "Click Personalize.",
      "content": "Click Personalize . This option is at the bottom of the drop-down menu. [7] X Research source"
    },
    {
      "title": "Click \"Desktop Background\".",
      "content": "Click \"Desktop Background\". This link should be in the bottom-left corner of the window."
    },
    {
      "title": "Click a picture.",
      "content": "Click a picture. Doing so will select it as your desktop background. [8] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source You can also click the Windows Desktop Backgrounds dropdown menu near the top of the window to pick a different pictures folder (e.g., \"Pictures\"). If you want to look for a specific picture, click Browse . Clicking the checkbox in the top-left corner of two or more pictures will place them on a slideshow rotation. You can change the default time between photos and transition style from the bottom of the window."
    },
    {
      "title": "Click the box beneath the \"Picture position\" heading.",
      "content": "Click the box beneath the \"Picture position\" heading. You'll see options for displaying your picture here. A few common options include: Fill - Your picture will take up the whole screen. Tile - Multiple thumbnails of your picture will display in a grid on your desktop. Center - Your picture will be centered in the middle of your screen with a black border."
    },
    {
      "title": "Click a picture position option.",
      "content": "Click a picture position option. You'll see a preview."
    },
    {
      "title": "Click Save changes.",
      "content": "Click Save changes . It's at the bottom of the \"Desktop Background\" window. Your changes will be applied. [9] X Research source"
    },
    {
      "title": "Right-click an empty space on the desktop.",
      "content": "Right-click an empty space on the desktop. Doing so will prompt a drop-down menu."
    },
    {
      "title": "Click Personalize.",
      "content": "Click Personalize . This option is at the bottom of the drop-down menu. [10] X Research source"
    },
    {
      "title": "Click \"Desktop Background\".",
      "content": "Click \"Desktop Background\". It's the second link from the top of this window. [11] X Research source"
    },
    {
      "title": "Click a picture.",
      "content": "Click a picture. Doing so will select it as your desktop background. You can also click the Windows Wallpapers box near the top of the window to pick a different pictures folder (e.g., \"Pictures\"). If you want to look for a specific picture, click Browse ."
    },
    {
      "title": "Click a picture positioning option.",
      "content": "Click a picture positioning option. This section is beneath the \"How should the picture be positioned?\" heading. Your options (from left to right) include a full-screen version of the picture, a grid comprised of your photo, and a centered version of the picture."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . It's at the bottom of the window. Doing so will apply your selected picture to the desktop background."
    },
    {
      "title": "Right-click an empty space on the desktop.",
      "content": "Right-click an empty space on the desktop. Doing so will prompt a drop-down menu. [12] X Research source"
    },
    {
      "title": "Click Properties.",
      "content": "Click Properties . It's at the bottom of the drop-down menu. [13] X Research source"
    },
    {
      "title": "Click the Desktop tab.",
      "content": "Click the Desktop tab. You'll see this at the top of the \"Properties\" window. [14] X Research source"
    },
    {
      "title": "Click a desktop image option.",
      "content": "Click a desktop image option. You'll see several options below the \"Background\" heading; clicking one will preview it in the window near the top of the page. [15] X Research source You can also click Browse to pick a custom picture. For a solid color, click None as the background. Then click the box below \"Color\" in the bottom-right corner of the window, and pick a color."
    },
    {
      "title": "Click the box below the \"Position\" heading.",
      "content": "Click the box below the \"Position\" heading. It's at the bottom-right side of the \"Properties\" window. You'll see three options here: Stretch - Your picture will take up the whole screen. Tile - Multiple thumbnails of your picture will display in a grid on your desktop. Center - Your picture will be centered in the middle of your screen with a black border."
    },
    {
      "title": "Click a picture position.",
      "content": "Click a picture position. Doing so will apply the position to your picture."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . It's at the bottom of the window. Doing so will save your changes."
    }
  ]
}