{
  "url": "https://www.wikihow.com/Add-Music-from-iTunes-to-iPod",
  "title": "How to Put Music on an iPod Using iTunes",
  "steps": [
    {
      "title": "Connect your iPod and open iTunes.",
      "content": "Connect your iPod and open iTunes. To begin the process of adding music to your iPod, open iTunes. If you haven't already connected your iPod, do so as soon as iTunes opens. Within a few moments, iTunes should recognize your device — you should see a small \"iPod\" button with a picture of an iPod appear in the upper right. Click this button. Note that for iPads, iPod Shuffles, and other iTunes-compatible devices, the process will be nearly the same, though the label on the button that appears will change."
    },
    {
      "title": "Click \"Music\" on the next screen.",
      "content": "Click \"Music\" on the next screen. After clicking the \"iPod\" button, you'll see a screen displaying an array of information about your iPod, including its name, storage capacity, and several other options. We don't need to deal with any of these — simply click \"Music\" at the top of the window to proceed."
    },
    {
      "title": "Choose whether to sync your entire library or select songs.",
      "content": "Choose whether to sync your entire library or select songs. When it comes to putting music on your iPod, you have two options: iTunes can automatically transfer your entire library to your iPod, or it can allow you to manually choose which songs you want to add. Check the bubble next to \"Entire music library\" if you'd like to add your entire library, or check the bubble next to \"Selected playlists, artists, albums, and genres\" if you'd like to pick your songs manually. At this point, you may also want to check the boxes for other miscellaneous options below. For instance, if you'd like to add any music videos you have in your library, check \"Include music videos,\" and so on."
    },
    {
      "title": "If you chose to add manually, pick your playlists/artists.",
      "content": "If you chose to add manually, pick your playlists/artists. If you chose the manual option for adding songs to your iPod, you'll want to use the menus on the bottom half of the iTunes window to choose which songs you want to add. Scroll through the menus for playlists, artists, genres, and albums, checking the boxes next to the choices you'd like to add to your iPod. For instance, if you want to add all of your Al Green songs to your iPod, you would scroll through the list of artists until you found Al Green, then check the box next to his name. On the other hand, if you only wanted to add the songs from his greatest hits album, you would scroll through the list of albums until you found Greatest Hits by Al Green, then check the box next to it. Don't worry if some of your choices overlap — iTunes won't add the same song to your iPod twice."
    },
    {
      "title": "Click \"Sync\" to add your songs.",
      "content": "Click \"Sync\" to add your songs. Whether you chose the manual or automatic option for adding songs, click the \"Sync\" (short for \"Synchronize\") button on the bottom right of the screen when you're ready to add your songs to your iPod. iTunes should immediately begin to add the songs you selected to your iPod. You can monitor your progress by watching the progress bar that should appear at the top of the iTunes window. Don't disconnect your iPod during this process. This will disrupt the syncing process, preventing you from getting all of your songs. In addition, this can also cause iTunes to freeze or stop working properly."
    },
    {
      "title": "Enjoy your music!",
      "content": "Enjoy your music! Congratulations! You've successfully added songs to your iPod. To play your songs, disconnect your iPod, plug in a pair of headphones, select a song from the \"Music\" option at the bottom right of the iPod's main menu, and start listening. Note that, while this guide describes how to add music to your iPod, the process is nearly identical for other forms of media. For instance, if you want to add movies to your iPod, you would click \"Movies\" at the top of the iTunes window after clicking the \"iPod\" button, then proceed in basically the same fashion."
    },
    {
      "title": "Deselect your sync options to remove songs.",
      "content": "Deselect your sync options to remove songs. To take songs off your iPod, connect it to your computer and proceed as you normally would to the Syncing screen. If it isn't already selected, click the bubble next to the \"Manual\" option for adding songs. Now, scroll through the windows of artists, playlists, etc. and uncheck the boxes next to the selections you'd like to remove from your iPod. When you're done, click \"Sync\" to apply your changes."
    },
    {
      "title": "Download and install iTunes.",
      "content": "Download and install iTunes. If you don't already have iTunes, you will probably want to download and install it before beginning. Though it's possible to add music to your iPod without iTunes (see above), this is by far the most common way to do so. In addition, iTunes is free, simple to download and install, and offers a variety of helpful features, including in-program access to the iTunes Store and options for automatically syncing your iPod library to the library on your computer. To download iTunes, simply visit iTunes.com and click the \"Download iTunes\" link in the upper right. Supply your email address and click \"Download Now\" to start the download."
    },
    {
      "title": "Connect your iPod to your computer.",
      "content": "Connect your iPod to your computer. Your new iPod should be packaged with a white USB cord. This cord allows you to transfer media between your computer and the iPod. Connect the skinny, flat end of the cord to your iPod (there should be a corresponding port on the bottom of the iPod) and the other end to one of your computer's USB ports to begin. Note that models of iPod other than the standard version (like, for instance, the iPod shuffle) will have cords with differently-shaped plugs. However, all varieties of iPod cord will have one end that plugs into a USB port."
    },
    {
      "title": "Wait for iTunes to recognize the iPod.",
      "content": "Wait for iTunes to recognize the iPod. When you connect your iPod, iTunes should launch automatically. If it doesn't, you may open it manually. Within a few moments, iTunes should recognize the iPod. You will know this is happening if you see the trademark Apple logo appear on your iPod without prompting. You may also notice a progress bar appear at the top of your iTunes window indicating that iTunes is downloading data required to interface with your iPod. Wait for iTunes to complete before proceeding — this may take several minutes. If iTunes doesn't seem to be recognizing your device automatically, don't despair. iTunes is somewhat notorious for experiencing problems with new devices. Try disconnecting your iPod and reconnecting it, opening and closing iTunes, and restarting your computer before reaching out to iTunes support . Additionally, if your iPod is low on power, you may need to wait for it to charge off of your computer's power supply for several minutes until iTunes is able to recognize it."
    },
    {
      "title": "Follow the prompts that display.",
      "content": "Follow the prompts that display. Eventually, iTunes should automatically launch a large welcome message. Click \"Continue\" to proceed. Next, you'll see a screen that says \"Sync with iTunes\". Click \"Get Started\" on this screen. You will be brought to a screen that presents you with a variety of options, including: Updating your iPod software to the latest version. If your iPod software isn't current, clicking \"Update\" will download and install the latest version of the software. This keeps your iPod up-to-date with all of the features and security fixes. Creating a backup of your iPod data. If this is the first time you're using your iPod, you won't have any data to back up, but choosing an automatic backup location (either your computer or the iCloud) ensures you won't have to worry about it in the future."
    },
    {
      "title": "Click \"Done\".",
      "content": "Click \"Done\". To exit the current screen, simply click the blue \"Done\" button in the top right of the iTunes window. When you do this, you'll be brought back to whatever you were looking at in iTunes before you began. From here, you can add music to your iPod as you normally would (see \"Using iTunes\" section above)."
    }
  ]
}