{
  "url": "https://www.wikihow.com/Calculate-Annual-Salary",
  "title": "3 Ways to Determine Your Annual Income & Market Value",
  "steps": [
    {
      "title": "Check your payment schedule to see if you’re a wage earner.",
      "content": "Check your payment schedule to see if you’re a wage earner. A wage earner (also called a non-exempt employee) is paid by the hour. Your paycheck may be steady or vary from week to week depending on the number of hours you work. Regardless, if you are paid per hour, you are considered a wage earner. [1] X Research source"
    },
    {
      "title": "Calculate your hourly salary.",
      "content": "Calculate your hourly salary. If you are not sure how much you earn per hour, ask your supervisor, talk to someone in human resources, or check your pay stub . To find your hourly salary using your pay stub, check the total gross pay listed on the bill. Then, divide that amount by the number of hours you worked during that stub’s pay period. [2] X Research source Gross pay is your total salary before deductions for taxes and benefits. For example, suppose your gross pay was $190 for a week in which you worked 10 hours. Divide $190 by 10 hours. 190/10 = 19. Your hourly salary is $19 per hour."
    },
    {
      "title": "Multiply your hourly salary to determine your annual income.",
      "content": "Multiply your hourly salary to determine your annual income. After you’ve figured out what your hourly rate is, multiply your hourly salary by the number of hours you work per week to calculate your weekly salary. Then, multiply your weekly salary by 52 (the number of weeks per year) to figure out your annual salary. [3] X Research source For instance, if you work 40 hours per week and you earn $19 per hour, calculate your weekly salary by multiplying 40 x $19 = $760. Then calculate your annual salary by multiplying $760 x 52 = $39,520"
    },
    {
      "title": "Average your weekly number of hours if necessary.",
      "content": "Average your weekly number of hours if necessary. If you work a different number of hours each week, keep track of your weekly hours for one month. Write them down in a journal or type them up on an app. Then, find the average number of hours per week you worked, and multiply that figure to find your annual salary. [4] X Trustworthy Source State of New York Official website for the State of New York Go to source For example, suppose in one month you worked 30 hours the first week, 25 hours the second week, 35 hours the third week and 40 hours the fourth week. Find the average weekly hours with the equation (30 + 25 + 35 + 40) / 4 = 32.5. If you earn $19 per hour, then calculate your annual salary with the equation (32.5 x $19) x 52 = $32,110. Keep track of your weekly hours with a spreadsheet software or time-tracking app. Some time-tracking apps are marketed to managers who have to keep track of hours for multiple employees. But you can use them to manage your productivity too. [5] X Trustworthy Source US Department of Labor Federal department responsible for promoting the wellbeing of workers Go to source"
    },
    {
      "title": "Add in overtime payments if applicable.",
      "content": "Add in overtime payments if applicable. Your employer must pay you overtime if you work more than 40 hours per week. The rate of overtime is one and a half times your regular rate of pay. Keep track of your regular and overtime hours each week for a period of four weeks. Then, multiply your overtime pay by 1.5 and add this number to your average weekly salary. Multiply your average weekly pay + your average overtime pay by 52 to calculate your annual salary. [6] X Trustworthy Source US Department of Labor Federal department responsible for promoting the wellbeing of workers Go to source Suppose in a four-week period, you work 50 hours, 45 hours, 42 hours and 47 hours. If anything over 40 hours is overtime, then your weekly overtime is 10 hours, 5 hours, 2 hours and 7 hours. Calculate your average weekly overtime hours with the example (10 + 5 + 2 + 7) / 4 = 6. If you earn $19 per hour, then calculate your overtime rate with the equation $19 x 1.5 = $28.5 Calculate your average regular weekly salary with the example $19 x 40 = $760. Calculate your average weekly overtime pay with the example $28.5 x 6 = $171. Add these two totals to get your total weekly salary $760 + $171 = $931. Multiply to find your annual salary with the equation $931 x 52 = $48,412."
    },
    {
      "title": "Adjust for sick time, vacation, and/or leaves of absence.",
      "content": "Adjust for sick time, vacation, and/or leaves of absence. If you are paid for vacation or sick leave, then you do not need to adjust any of your calculations. However, if you do not get paid for these absences, subtract the number of weeks you were absent from 52 to calculate your annual salary. [7] X Trustworthy Source US Department of Labor Federal department responsible for promoting the wellbeing of workers Go to source Suppose, for example, that you take 2 weeks of unpaid vacation time per year. Then your work year is only 50 weeks instead of 52. You would then multiply your weekly salary by 50. To get an exact number, subtract hours for days each year when you don't work (holidays, vacation days). Only subtract these hours if they’re unpaid. For example, if you only missed two days per year, subtract $19 x 8 hours x 2 days ($304) from your annual salary."
    },
    {
      "title": "Determine if you are a salaried employee.",
      "content": "Determine if you are a salaried employee. Salaried employees (also known as exempt employees) receive a fixed amount of gross pay in their paychecks. This amount is not linked to the number of hours worked. Your annual salary is divided by the number of pay periods per year to calculate the amount of gross pay for each paycheck. [8] X Research source"
    },
    {
      "title": "Read your pay stub to determine your gross and net pay.",
      "content": "Read your pay stub to determine your gross and net pay. Your pay stub provides a great deal of information. It lists your total earnings (or gross pay) as well as any deductions, including federal taxes, state taxes, local taxes, Social Security, and Medicare contributions. Other deductions include health insurance premiums, retirement savings plans, and flexible spending accounts. Subtract all of the deductions listed on your pay stub from your gross salary to determine your net salary (or take home salary). [9] X Research source For example, if your paystub is monthly with a gross income of $5,000, but your company puts aside $16 for federal taxes, $14 for state taxes, $40 for healthcare, and $50 for Social Security, subtract $5,000 - $14 - $16 - $40 - $50 = $4,880. Your net pay (monthly income) is $4,880. You should still receive a pay stub even if you get direct deposit. Some companies keep pay stub information in an online database. Contact your payroll department to find out how to log in to obtain that information or to receive a hard copy of your pay stub."
    },
    {
      "title": "Verify your payroll schedule.",
      "content": "Verify your payroll schedule. Employers choose a payroll schedule that best suits their company and employees. The payroll schedule determines when and how often you will receive a paycheck. Knowing your payroll schedule will tell you how many paychecks to expect per year. You will need this information to calculate your annual salary from your pay stub. If you are not sure about your payroll schedule, ask your supervisor or the payroll department of your company. Monthly paychecks are paid at the end of the month. Employees receive 12 paychecks per year. [10] X Research source Semi-monthly paychecks are paid on the 1st and 15th of the month or the 15th and 30th. Employees receive 24 paychecks per year. Biweekly paychecks are paid every two weeks, usually on Friday. Employees receive 26 paychecks per year. [11] X Research source Weekly paychecks are paid once per week, usually on Friday. Employees receive 52 paychecks per year."
    },
    {
      "title": "Determine overtime pay.",
      "content": "Determine overtime pay. Recent changes to overtime pay laws have extended overtime protections for salaried workers. As of 2016, any salaried worker making less than $47,476 per year ($913 per week) is entitled to overtime pay at a rate of 1.5 times their usual pay rate for hours worked over 40 hours each week. If your salary is under this threshold and you work more than 40 hours per week, you can increase your expected pay by the amount of your overtime earnings. [12] X Trustworthy Source US Department of Labor Federal department responsible for promoting the wellbeing of workers Go to source For example, a salaried employee paid $41,600 per year ($800 per week or $20 per hour) that works 45 hours (5 overtime hours) each week can expect overtime pay in the amount of 1.5 times their usual hourly pay. This would be $150 per week."
    },
    {
      "title": "Multiply your gross earnings to calculate your annual salary.",
      "content": "Multiply your gross earnings to calculate your annual salary. Find your total gross earnings, before deductions, on your pay stub. Multiply this amount by the number of paychecks you receive each year to calculate your total annual salary. [13] X Research source Suppose you are paid biweekly, and your total gross salary is $1,900. Calculate your annual salary with the equation $1,900 x 26 = $49,400."
    },
    {
      "title": "Add in bonuses if applicable.",
      "content": "Add in bonuses if applicable. Depending on the type of company you work for and the position you hold, you may be entitled to bonuses. Bonuses are paid at different times during the year and they are added to your fixed annual salary. Different kinds of bonuses include profit sharing, rewards for achievement, sign-on bonuses, holiday bonuses, and sales commissions. The amount and frequency of bonuses varies depending on how your company awards them. Add bonuses when calculating your total annual salary. [14] X Trustworthy Source US Bureau of Labor Statistics U.S. government agency that collects and reports labor-related information Go to source For example, suppose you earn an annual salary of $49,400 before bonuses and your company has decided to award you a 2.5% profit-sharing bonus. Calculate the amount of the bonus with the equation $49,400 x .025 = $1,235. Then, add these numbers with the equation $49,400 + $1,235 = $50,635. Your total annual salary is $50,635."
    },
    {
      "title": "Use your salary information to plan your life.",
      "content": "Use your salary information to plan your life. Now that you know your annual salary, assess your financial needs and plan your budget , breaking down all necessary costs like housing, groceries, and hobbies. Then, determine if your annual salary is going to be enough to pay all of your bills and support your lifestyle. Also, learn about other important ways your work compensates you besides your annual salary. Know your benefits like tuition reimbursement, retirement plans, and health insurance. And find out if there is room for advancement so you have the potential to earn more money. [15] X Research source"
    },
    {
      "title": "Research salary information for different careers.",
      "content": "Research salary information for different careers. If you aren't already established in an industry or are thinking about switching careers, use online resources to learn about the kind of salary you are likely to earn in different industries. Search for the basic salary information and benefits packages of all the jobs you’re considering. Then, compare salary averages and hourly wage rates in different locations of the country. [16] X Research source You may also be wondering if you're being paid properly for your current work. If so, you can estimate your market value by researching compensation for similarly-experienced and employed workers in your industry and area. Use websites like SalaryExpert and Glassdoor to determine whether or not you are being paid adequately."
    },
    {
      "title": "Develop realistic expectations for your salary.",
      "content": "Develop realistic expectations for your salary. As you research annual income for different occupations, understand the difference between “average” and “entry level.” If you are new to an industry or just starting out in an occupation, do not expect to earn the average salary right away. Entry level salaries are typically lower than the average rate. However, your salary should increase as you gain experience. Research the potential for salary growth in your chosen industry. Although experience is valuable and important, it's also really important to compare yourself and your skills to the people around you. Recognize what other skills you're bringing to the table that they might not have. This might help you get a better salary, even when changing industries. Do your best to present yourself as a great fit for the job!"
    },
    {
      "title": "Choose the right career for you.",
      "content": "Choose the right career for you. You may find yourself in a position to compare the salaries of two or more jobs. Perhaps you’re looking for a job. Or maybe you’re considering leaving your current job for something else. Naturally, the total salary offered is a major consideration. Other factors that may also be valuable to you include benefits, the potential for growth, the location, and the length of your commute. [17] X Trustworthy Source Internal Revenue Service U.S. government agency in charge of managing the Federal Tax Code Go to source Consider taking a job with a lower salary if the company has great growth opportunities, a good location, or a supportive workplace culture."
    },
    {
      "title": "Use your market value in future salary negotiations.",
      "content": "Use your market value in future salary negotiations. Once you know your total annual salary and you have a realistic expectation of what you should be earning in a specific field, you can use this information to negotiate salaries in future jobs. Compare the total annual salary you currently earn with others in your field or in other industries you are considering. If your research indicates that you could be earning more, arm yourself with solid data and negotiate a better salary. Move from up from an entry-level position to something more advanced. Or request a review of your salary based on your education level or your special skills or qualifications. [18] X Research source Your market value is influenced by your education, experience, and other assets you bring to the table. Consider every way in which you create value for your employee when determining your market value."
    }
  ]
}