{
  "url": "https://www.wikihow.com/Aquarius-Love-Language",
  "title": "What is Aquarius’s Love Language? 10 Tips to Show Them Love",
  "steps": [
    {
      "title": "Words of Affirmation",
      "content": "Words of Affirmation When someone’s love language is Words of Affirmation, they feel loved when their partner offers supportive, encouraging words. [1] X Research source Talkative Aquarians respond especially well to this love language because they love to connect through conversation. Once they’re aware of your feelings, they’ll likely express their admiration for you verbally, too! Aquarians are naturally intelligent, and they tend to intellectualize love. If they like you, they might spend all their time thinking about it, rather than acting on it. To get the ball rolling, clearly communicate your romantic interest , and tell them why you like them. This will help Aquarius get out of their head."
    },
    {
      "title": "Acts of Service",
      "content": "Acts of Service When someone has Acts of Service as their love language, they feel loved when their partner does helpful things for them. [2] X Research source Aquarians are forward-thinking humanitarians, and they want to make the world a better place. [3] X Research source Serving their community comes naturally to them, but all this focus on others might keep Aquarians from taking care of themselves. Show an Aquarius you care with acts of service. Your thoughtfulness could win them over! [4] X Research source If an Aquarius has a busy day, bring them a latte from their favorite coffee shop, or surprise them with a home-cooked meal when they get home from work. They’ll truly appreciate your thoughtfulness!"
    },
    {
      "title": "Words of Affirmation",
      "content": "Words of Affirmation If your love language is Words of Affirmation, you feel loved when your partner shares supportive, affirming words. If you're happiest when your partner tells you how nice you look or congratulates you on a job promotion, this might be your love language! [5] X Research source Fiery Aries and chatty Gemini tend to have Words of Affirmation as their love language. [6] X Research source"
    },
    {
      "title": "Acts of Service",
      "content": "Acts of Service If your love language is Acts of Service, you feel loved when your partner does helpful things for you. If you feel loved and supported when your partner does something thoughtful, like cooking you a meal after a busy day or helping you tidy up your living space, this is likely your love language! [7] X Research source Practical Virgo and balanced Libra often have Acts of Service as their love language. [8] X Research source"
    },
    {
      "title": "Receiving Gifts",
      "content": "Receiving Gifts If your love language is Receiving Gifts, you feel most loved when your partner gives you thoughtful presents. If you feel happiest when your partner surprises you with a thoughtful gift, like a beautiful edition of your favorite book or tickets to your favorite musical artist’s concert, this could be your love language! [9] X Research source Hardworking Capricorn and bold Leo tend to have this love language. [10] X Research source"
    },
    {
      "title": "Quality Time",
      "content": "Quality Time If your love language is Quality Time, you feel loved when you spend meaningful time with your partner. If you feel happiest when you and your partner do fun activities together or spend a cozy night at home, this is might be your love language. [11] X Research source Sensitive Cancer and emotional Pisces often have this love language. [12] X Research source"
    },
    {
      "title": "Physical Touch",
      "content": "Physical Touch If your love language is Physical Touch, you receive love through physical affection. If you feel most loved and happy when you’re snuggling, hugging, or kissing your partner, this could be your love language! Intense Scorpio and sensual Taurus tend to have this love language. [13] X Research source"
    },
    {
      "title": "Start with friendship.",
      "content": "Start with friendship. Aquarians tend to blend love and friendship. For them, there isn’t always a clear line where one ends and the other begins. Because of this, Aquarians often end up dating people in their friend group, and many of their relationships start out as friendships. If you have a crush on an Aquarius, start by getting to know them better as a friend. If you’re a good match, this platonic connection could develop into something more."
    },
    {
      "title": "When you’re ready, make your romantic interest clear.",
      "content": "When you’re ready, make your romantic interest clear. Aquarians are most comfortable in the realm of the mind. Romance can become a thought game for them, and they can get so lost in their heads that they forget to act on their feelings. On top of this, Aquarians love making platonic connections, so it’s easy to get stuck in the friend zone. If you’ve been hanging out with an Aquarius, tell them directly about your feelings to move things along. They’ll appreciate your boldness!"
    },
    {
      "title": "March to the beat of your own drum.",
      "content": "March to the beat of your own drum. Aquarians are unconventional free-thinkers, and they deeply value their individuality. [14] X Research source Be yourself unapologetically to show an Aquarius you can meet them on their level. If you have a unique or niche hobby you love, share your passion with Aquarius. [15] X Research source This is a surefire way to pique their interest! Maybe you have an encyclopedic knowledge of comic books, or you can make a killer loaf of sourdough bread. Or, maybe you play the flute or love birdwatching. Whatever your passion is, invite Aquarius to experience it with you. The more unique your hobby is, the better!"
    },
    {
      "title": "Take fashion risks.",
      "content": "Take fashion risks. Forward-thinking Aquarians are natural trendsetters. Impress them with quirky, cutting-edge fashion choices. A daring hat, a vintage brooch, or some statement boots could really catch their eye! Be sure to compliment their fashion sense, too. They’ll love that you recognize and appreciate their individuality."
    },
    {
      "title": "Skip the small talk.",
      "content": "Skip the small talk. Aquarians love having meaningful conversations, and they hate small talk. [16] X Research source They’re deep thinkers, and they enjoy talking about all of their groundbreaking ideas and personal philosophies. To win over an Aquarius, jump right into talking about the important things. Discuss big ideas, like the meaning of love. Aquarians will jump at the chance to dive into the deep end with you."
    },
    {
      "title": "Share your intellectual side.",
      "content": "Share your intellectual side. Aquarians need to feel intellectually connected with their partner to consider a long-term relationship. Share your intellect with an Aquarius to show them you could be their match. Talk to them about your favorite books, or tell them about the academic subjects that interest you. Aquarius will love going toe-to-toe with you intellectually."
    },
    {
      "title": "Embrace the unconventional.",
      "content": "Embrace the unconventional. Aquarians tend to be a bit quirky, and they don’t often follow the beaten path. [17] X Research source Because of this, typical romantic gestures like chocolates, flowers, or fancy dinners don’t usually work to win them over. To impress an Aquarius, plan a unique and unexpected date . Find out their favorite movie, and then plan a themed movie night, complete with decorations and on-theme snacks. Take them to a silent disco, a poetry reading, or a cooking class. There are tons of unique options to sweep Aquarius off their feet!"
    },
    {
      "title": "Make them laugh.",
      "content": "Make them laugh. Aquarians love to laugh, and they’re deeply attracted to people who share their sense of humor. [18] X Research source Show them your silly side, and let them know that you think their jokes are funny. This will help Aquarius open up and get comfortable with you."
    },
    {
      "title": "Respect their independence.",
      "content": "Respect their independence. Aquarians value personal freedom, and they definitely need their space. If an Aquarius seems a bit distant at times, don’t overthink things. They might just need some alone time to reset. When this happens, show them that you respect their boundaries, and give them some space. This will show Aquarius that you understand their needs."
    },
    {
      "title": "Make the world a better place together.",
      "content": "Make the world a better place together. Aquarians are natural-born humanitarians, and they care deeply about doing good in the world. [19] X Research source To impress Aquarians, show them you share their passion for helping others. Pick a cause you care about, and invite the Aquarius in your life to volunteer with you. You’ll get to do something good for your community while getting to know each other better!"
    },
    {
      "title": "Forward-thinking Aquarians will show love in unconventional ways.",
      "content": "Forward-thinking Aquarians will show love in unconventional ways. They won’t profess their love with the typical gestures, like buying you roses or taking you to dinner and the movies. Instead, they’ll make unique shows of affection to win you over. They’ll write you a love sonnet, crochet you a scarf, or make a power-point presentation on the things they love about you. If you’re dating an Aquarius, prepare to be wowed by their inventiveness and originality! [20] X Research source"
    },
    {
      "title": "Intelligent Aquarius will open your mind.",
      "content": "Intelligent Aquarius will open your mind. Aquarians love to connect intellectually. They’ll bounce ideas off of you and encourage you to share your unique perspective. Together you’ll inspire each other to think deeply and learn more about the world around you. Go to the bookstore and pick out a book to read together. As you read, share your thoughts and opinions with each other. Take a class together on a subject that interests you both. Explore philosophy or learn to write poetry together. Trying something new will bring you closer!"
    },
    {
      "title": "Freedom-loving Aquarians will respect your independence.",
      "content": "Freedom-loving Aquarians will respect your independence. Aquarius values their own freedom deeply, so they’ll be careful to respect yours. They recognize the importance of space in a relationship, and they’ll encourage you to nurture your own individual friendships and passions while you build your connection as a couple."
    },
    {
      "title": "Aquarians will be both a lover and a best friend.",
      "content": "Aquarians will be both a lover and a best friend. For Aquarians, love and friendship tend to be enmeshed. They'll focus on building a friendship with you while also cultivating your romantic connection. If you’re in a relationship with an Aquarius, you’ll truly be able to say that your partner is your best friend!"
    }
  ]
}