{
  "url": "https://www.wikihow.com/Answer-%22What-Do-You-Like-About-Me%22",
  "title": "What to Say When Someone Asks “What Do You Like About Me?”",
  "steps": [
    {
      "title": "Say something nice about who they are as a person.",
      "content": "Say something nice about who they are as a person. If the question catches you off guard or makes you nervous, take a deep breath and think for a second. Whether the person asking is a friend, family member, crush, or significant other, think about what makes them, well, them ! Then craft a compliment that’s unique to who they are. [1] X Research source “You’re a really amazing friend to me.” “You’re such a thoughtful boyfriend.\" “You’re a guy’s dream girl.” “You are the most wonderful partner I could ask for.” “You’re the best friend ever.”"
    },
    {
      "title": "Think about what they add to your life and why you like being together.",
      "content": "Think about what they add to your life and why you like being together. To a friend, you could say something like, “I like the fact that you’re always there for me. You make me feel so supported.” To a significant other, you could say, “You’re so caring. You always put a lot of thought into our relationship.” Here are some other examples: [2] X Research source \"You're the first person to treat me like I'm truly special.\" \"I look forward to our hangouts all week long. I have so much fun with you.\" “I truly feel like myself whenever we’re together.” “You always manage to bring me out of the dumps.”"
    },
    {
      "title": "Consider what sets them apart.",
      "content": "Consider what sets them apart. When you think about this person and their personality, what’s the first good thought or word that comes to mind? Are they funny? Smart? Determined? Talented? Happy? Attractive? Energetic? Whatever it is, speak your mind and tell them about it! Say things like: [3] X Research source “I like how funny you are. You always make me laugh when we hang out!” “I like that you’re a happy and positive person. You create a good vibe around yourself, and I like being around you.” “You’re so ambitious when it comes to reaching your dreams.” “I love how, no matter how early it is, you’re always ready for an adventure.” “Whenever I see you, you always look so well put together.”"
    },
    {
      "title": "Use words that are unique to their qualities.",
      "content": "Use words that are unique to their qualities. Instead of saying something vague like, “You’re good at school,” try something like, “You’re so talented in art class. Your last project was great. I wish I could draw that well!” Instead of a generic answer like, “You’re always nice to everyone,” you can say, “You really go out of your way to be kind and compassionate to other people.\" Use specific words like “talented” and “compassionate.” Try things like: [4] X Research source “You’re fearless! I love how brave you are.” “I see how patient you are with others you meet.” \"You're so knowledgeable and passionate about music! Every time we hang out, you share new bands with me.\" “No challenge seems to get you down. You persevered when you had to pass the hardest math course, even when it seemed impossible.” “You’re so empathic when your siblings have problems; they can always depend on you to help them through.” “Being positive is so important to you, especially where your future is concerned.”"
    },
    {
      "title": "Mention a time when they exemplified admirable qualities.",
      "content": "Mention a time when they exemplified admirable qualities. You could tell a friend, “You were really there for me when my dog Lucy died. I was so upset, and you took the time to comfort me.” You could say to a significant other, “You really showed your thoughtfulness when you planned a picnic for us on our two-month anniversary.” Here are some other things you can say: “You’re so funny! I still laugh about the practical joke we played on your brother last summer.” [5] X Research source “You called to check on me when I was sick. No one else did.” “You’re so smart. I aced the last algebra exam because you helped me study.” “You showed how thoughtful you are when you took care of your grandma after her fall.” “You cherish our relationship so much when I think of how you planned my birthday party last summer.”"
    },
    {
      "title": "Say something authentic and genuine.",
      "content": "Say something authentic and genuine. Share your true feelings to give them a caring, meaningful response to “ What do you like about me? ” Think about your inside jokes, the time you’ve spent together, and things you know about them that no one else does. Show them that you like them for exactly who they are. [6] X Research source \"You've been my best friend since we were five years old. We've been through so much together. I can't imagine my life without you in it.\" “You stole my heart from the first moment we met and have made me so happy ever since. I’ll always be by your side.” “I was drawn to you right away. The way you stand up for others and speak your mind captivates me.” It’s unlikely, but if you are asked this question by someone that you don’t like or don't know well, try to be nice to them about it. Answer as sincerely as you can. You could say, \"I don't know you that well, but you seem like a really nice person.\""
    },
    {
      "title": "A compliment means more if it’s about something a person has control over.",
      "content": "A compliment means more if it’s about something a person has control over. It’s okay to tell someone they are pretty or handsome, but if looks are the only thing you mention, they might feel like their outward appearance is the only likable thing about them. Say things like: [7] X Research source “You’re a great listener. You were there for me after my breakup.” “You inspire me every time we talk. You convinced me to apply to graduate school, and I got in!” \"You have a good heart. You’re always taking care of your little brother when he needs you.” “You’re such a genius. You managed to get a scholarship to the school of your dreams.” “You make me feel important. Whenever we go out, I never want the night to end.”"
    },
    {
      "title": "Reassure them about how much they mean to you.",
      "content": "Reassure them about how much they mean to you. Encourage the person with statements that bolster their self-esteem. Help them realize how important they are as a friend or partner in your life. Say things like: [8] X Research source \"I've never felt this strongly about someone. You mean everything to me.\" \"My friendship with you is the reason I believe in the goodness of people.\" “I’d go to the ends of the earth if you needed me to.” “I’ve never had a friend as special as you and never will!” “You’re my dream guy—I can’t believe I’m lucky enough to have you.”"
    }
  ]
}