{
  "url": "https://www.wikihow.com/Bowl-an-Easy-Bowling-Strike-in-Wii-Sports",
  "title": "How to Bowl an Easy Bowling Strike in Wii Sports",
  "steps": [
    {
      "title": "Press right on the D-pad on the Wii remote (Be sure that you have move as opposed to turn selected) to move right.",
      "content": "Press right on the D-pad on the Wii remote (Be sure that you have move as opposed to turn selected) to move right."
    },
    {
      "title": "Get the red guideline that pops up when you are moving your Mii in line with the two last notches on the bowling alley floor (These notches are slightly closer together than the rest).",
      "content": "Get the red guideline that pops up when you are moving your Mii in line with the two last notches on the bowling alley floor (These notches are slightly closer together than the rest)."
    },
    {
      "title": "Press and hold 'b' and roll the 'ball' as hard as you can.",
      "content": "Press and hold 'b' and roll the 'ball' as hard as you can. [1] X Research source"
    },
    {
      "title": "Release it when your arm is pointing straight down, so that the ball will roll along the alley, and won't hop when you release it.",
      "content": "Release it when your arm is pointing straight down, so that the ball will roll along the alley, and won't hop when you release it. If done correctly, the ball will then curve, and crash directly into the first pin. You should get a strike. [2] X Research source"
    },
    {
      "title": "Another way to get a lot of strikes is to keep swinging your arm with the B button down, until your Mii gets to the start of the lane.",
      "content": "Another way to get a lot of strikes is to keep swinging your arm with the B button down, until your Mii gets to the start of the lane. Let go just as the arm swings up. [3] X Research source Hold and swing the wii remote as instructed. Do not release the button. Before doing so, swing it back, and then swing it forward again, and then release the button. This makes the shot straighter, and usually results in you getting a strike. You can also swing so you get a fast throw that goes across the ground normally. Do not twist your wrist unnaturally. If it spins too much, move your mii closer to the side that you bowl from best. Practice until it spins just the right amount to hit the front pin. [4] X Research source"
    }
  ]
}