{
  "url": "https://www.wikihow.com/Be-a-Man",
  "title": "How to Become the Kind of Man You Want to Be",
  "steps": [
    {
      "title": "Learn who you are as a person and express yourself unapologetically.",
      "content": "Learn who you are as a person and express yourself unapologetically. Find out who you are and be happy with that person. Don’t be ashamed to express yourself. There's no one way to be a man. A 'real' man can be a logger who wears plaid and doesn't shower for 10 days; a 'real' man can also be a professor who talks about Milton and Shakespeare. All men, however, know who they are and respect themselves in and out. [1] X Research source Express who you are by talking about your interests and standing up for the things that you believe in, like equal rights or affordable housing."
    },
    {
      "title": "Pursue knowledge in a field you’re passionate about.",
      "content": "Pursue knowledge in a field you’re passionate about. It doesn't really matter what it is, but you should consider yourself pretty familiar with one area of expertise . Men may not know or want to use fancy, two-dollar words, but when it comes time to getting things done, they know how to act. They use their smarts to get it done. What area of expertise do you know? Here are just a few areas you might consider diving into. [2] X Research source General knowledge . Become a jack of all trades. You could win a pretty penny on Jeopardy! if you cared at all about being on TV. History. The man who's a student of history gives himself the benefit of a very wide lens when contemplating problems: he can draw on Roman artillery strategy, Cold War negotiating tactics, and obscure French economic policy, among others. He knows that history isn't just about preventing the mistakes of the past from happening in the future. Read books. Books provide you with knowledge about plenty of different topics. If you want to know more about how internet algorithms work, read a book like “Filterworld” by Kyle Chayka. If you want to really get to know people, read something like “How to Know a Person: The Art of Seeing Others Deeply” by David Brooks."
    },
    {
      "title": "Take responsibility for your actions and mistakes.",
      "content": "Take responsibility for your actions and mistakes. The main difference between a man and a boy is that men are responsible . Men clean up after themselves (figuratively and literally). Men honor their commitments, accept their duties and are accountable for their actions. There's nothing wrong with making a mistake. Only insecure men think making a mistake is bad, as they’re not comfortable with who they are in the first place. [3] X Research source Men know that anyone can father a baby, but only a man who understands and accepts responsibility can be a good father . Men refuse to make anyone do anything they themselves are unwilling to do. As a result, they appreciate the difficulty and risk other people take on their behalf. Confident men know when they're wrong and aren't afraid to admit it. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Learn to say \"I'm sorry\" . An apology goes a long way, especially when it is heartfelt and genuine."
    },
    {
      "title": "Find a role model with similar values and emulate them.",
      "content": "Find a role model with similar values and emulate them. Whether it’s a fictional hero, a figure from history, or an athlete who you admire for their work ethic, choose someone who you look up to and emulate specific behaviors that align with you. For example, if you’re a fan of Goku from Dragon Ball Z because of his world outlook, emulate his work ethic and love for family. [5] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Emulating these values will make them a part of you, give you more depth, and make you more of a man."
    },
    {
      "title": "Be organized when it comes to your goals and responsibilities.",
      "content": "Be organized when it comes to your goals and responsibilities. Everyone has responsibilities, but a man is proactive about getting things done. Stay organized by making regular to-do lists, marking important events on your calendar, and keeping a journal to clear your mind of clutter. By being organized, you’ll lessen stress, improve your sleep, and have more time to do the things you love. [6] X Research source Simply making your bed in the morning can help with organization, as it provides you with a good, clean start to the day. To create a healthy morning routine, love & empowerment coach Jennifer Butler says to dedicate small amounts of time to the routine. Wake up 10 minutes early, drink a glass of water, and write things you’re grateful for."
    },
    {
      "title": "Be willing to take advice from others.",
      "content": "Be willing to take advice from others. There are plenty of men who have been where you are. Who have dealt with the challenges you’re facing. If you need advice, reach out to someone you trust and ask them what they would do in the situation. Be specific and thoroughly explain the situation. If you don’t agree with the advice, you don’t have to take it. [7] X Research source By asking others for advice, you will have a wider range of options to choose from when you’re deciding to move forward. Choose what would work best for you and your loved ones."
    },
    {
      "title": "Learn how to manage stress.",
      "content": "Learn how to manage stress. A man knows how to properly manage their stress. As a boy, you may find it easy to lash out at others, but this won’t fly as a man. To properly manage stress, take time to do things that you enjoy, talk to loved ones when you’re stressed, and be aware of signs of stress, like irritability or a short temper. [8] X Research source"
    },
    {
      "title": "Be present, but don’t forget about your future.",
      "content": "Be present, but don’t forget about your future. Running from your future can leave you ill-prepared when a challenge arises. To be a man, balance being present with preparing for the future. Build your savings account, be mindful of what you’re putting in your body, and think of how your actions will impact your future. Constantly thinking about your future can make you anxious. To be more present, life coach Leah Morris suggests practicing the 5-4-3-2–1 technique. Take notice of five things you can see, four things you can hear, three things you can smell, two things you can touch, and one thing you can taste."
    },
    {
      "title": "Let go of self-destructive thoughts or customs.",
      "content": "Let go of self-destructive thoughts or customs. Understand that all men in all cultures may have, to some extent, been socialized in ways that may be psychologically and culturally damaging, and may bring unhappiness. The first step in creating a sense of self in manhood is to examine the environment in which you were raised, as objectively as you can. [9] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Did you grow up in a culture where it was acceptable to abuse someone, whether physically or verbally, who was \"out of line\" or insubordinate? Violence is more often the result of cowardice than a genuine impulse to solve a problem. Using violence or threats against friends or family to \"show your authority\" is unhealthy and damaging. Were you taught that being \"tough\" means suppressing emotion, holding in tears, and never exposing vulnerability? The drawback here is that you also learn to internalize and suppress these emotions which then fester and get worse. Focus on being a different kind of tough : be a reliable, strong figure who can handle adversity. Were you taught to hate/fear anyone who's homosexual? Understand that only one thing makes you gay: having a romantic and sexual preference for people of the same gender. The kind of music you like, the clothes you wear, whether you cry at sad movies, buying your wife flowers, being sensitive or nice to others — none of that makes you gay. Outward displays of homophobia point to a man's own sexual insecurity, not his prowess and is not cool in any way, shape or form."
    },
    {
      "title": "Learn about the man-code.",
      "content": "Learn about the man-code. The man-code (aka the bro-code ) is an unwritten set of rules that some men live by, often evolving but rarely changing. By following the man-code, you will show other men that you respect them as much as you respect yourself. But remember, every man is different. If this list doesn't resonate with you or mean anything to you, do not feel as though you have to go out of your way to achieve these things. [10] X Research source Here are a few items on the list: Dating no-nos. You may never date another friend's sister (or sibling), unless you actually intend on marrying them. You may never date another friend's ex unless you have his explicit permission. Explicit permission means actually asking him. Share your possessions when possible. If a friend asks for a pair of work boots, a drill, or a crock-pot a day in advance, you should be kind enough to loan it to him. Cars, lucky items, or partners are not necessarily applicable. Birthday presents for other men are always optional. If pressed for information, you may always lie and tell them your significant other ordered you to act. Never initiate conversation with other men at a urinal station. It is never acceptable to choose a urinal immediately adjacent to another man if an open, further-removed urinal is available. No smiley-faces or emoticons are necessary when texting another guy. Although acceptable (not preferable) to use when texting love-interests, keep use to a bare minimum."
    },
    {
      "title": "Shower and bathe regularly.",
      "content": "Shower and bathe regularly. A man benefits from showering when he is dirty or smelly. Some may choose to stay dirty or smelly for a good reason (working on a car, or about to work out). Also, cut your hair and fingernails regularly. Most men like no-nonsense haircuts, although some men prefer hair that is a little longer or style and that is fine also. You don't have to shave every day, especially not if you are growing a beard, but try to keep your facial hair neat and trimmed. If you’re using a beard trimmer, professional barber Timmy Yanchun says to use a guard or comb to avoid taking a chunk out of your beard. Freehanding in the mirror can lead to an uneven cut. You don't have to shave or trim your chest hair, back hair or any body hair in general. Some men are very hairy, others are totally smooth, either way, be proud of your body and all of your physical attributes."
    },
    {
      "title": "Exercise regularly.",
      "content": "Exercise regularly. Being a man doesn't mean you need to be ripped. It does mean you need to take care of your body (For some men, that does mean lifting weights.) Adjust to the responsibility of being by keeping fit: do cardio , yoga or pilates (not only for women), strength training, bodybuilding, or sports, combined with a healthy diet . At the very least, walk about 30 minutes a day to burn fat and build some muscle. Personal trainer Julian Arana says “Finding ways to make exercise more fun and enjoyable does wonders for increasing motivation. Playing sports, riding your bike in a beautiful setting, and participating in fitness challenges/competitions with friends or coworkers are all ways to make exercise more exciting.” Team sports are a great way to exercise and learn the importance of teamwork, how to work with other personalities, and generosity. Join an organized team or play with the people at your local park."
    },
    {
      "title": "Eat healthy meals.",
      "content": "Eat healthy meals. As you get older, your body and metabolism will begin to slow down. You won’t be able to put back four slices of pizza and wash it down with a milkshake anymore. Improve your eating habits by incorporating more fibrous foods, like fruits, vegetables, and whole grains, into your daily diet. Fiber can reduce the risk of diabetes, heart disease, and certain cancers. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The Mediterranean diet is a great way to eat healthy. It consists of veggies, fruit, whole grains, and extra virgin olive oil and can reduce the risk of cardiovascular disease. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Wear clothes that fit you.",
      "content": "Wear clothes that fit you. Your clothes don't need to be designer or cost an arm and a leg. They do, however, need to fit you . Not all men are muscular and stocky, and therefore don't look great in baggy, loose-fitting clothes. All men will need: Great jeans. One pair of casual jeans, one pair of work jeans, and one pair of formal jeans should round out your wardrobe. Build around the basics. Some button-down shirts. Again, a couple casual items, a couple for work, and a couple formal button-downs should be enough for the average man. Decent shoes. Men probably want between three and five different kinds of shoes : formal shoes (for work and/or big occasions), tennis shoes, work boots, casual shoes (chukkas, lace-ups, sneakers, etc.), or slightly-less-than-formal shoes (oxfords, top-siders, loafers, etc.). Mix and match depending on your needs and habits."
    },
    {
      "title": "Develop your own principles.",
      "content": "Develop your own principles. A man isn't always comfortable being judge, jury, and executioner, but he knows right from wrong and expects others to play by the same rules. Look inside yourself and ask: would I want someone else doing that to me? This should help you develop principles to live by. A man never steals, even if he is desperate. A desperate man learns to ask others to help him instead of helping himself to something he is not entitled to. A man helps others in need. He knows when others are down on their luck and need a helping hand, even if the utility lies in the gesture itself. A man trusts his friends, significant others, and family. He follows through with what he says he'll do and expects others to do the same. A man never lies — to himself or others. He develops a conscience that gives him good feedback and allows him to be comfortable with the truth, even if it hurts."
    },
    {
      "title": "Be ambitious in your own way.",
      "content": "Be ambitious in your own way. Men are naturally ambitious . We want to be breadwinners and have the admiration and respect of our peers. Not all men choose the same career paths, however, so ambition doesn't always amount to the same thing. Whatever career or profession you choose (you may have many), set goals for yourself, live up to or exceed them, and reinvent yourself whenever you need to. Define your own idea of success. [13] X Research source"
    },
    {
      "title": "Learn to make sacrifices for the people you love and care about.",
      "content": "Learn to make sacrifices for the people you love and care about. Making sacrifices is part of growing up, whether you like it or not. The difference between a man and a boy is that a man steps up to the plate, while a boy hesitates or complains. Especially for the people in his life that he loves, a man looks at sacrifice — whether it means devoting time, money or other resources to people aside from himself — as his duty."
    },
    {
      "title": "Stand up for what you believe in.",
      "content": "Stand up for what you believe in. In the face of opposition, a man stands on his beliefs. If you believe something is wrong, express that! Whether it’s a racist or homophobic comment from someone in your friend group or a personal attack, speak up and tell the person that you won’t tolerate that. Don’t be aggressive, as you may come off as irate or reactionary. [14] X Research source Know when to pick your battles. If a random person is yelling at you as you pass them on the street, arguing with them isn’t worth it. If you feel like something needs to be said, whether a person is on the fence about an issue or you feel like enough is enough, calmly, yet passionately, express your beliefs."
    },
    {
      "title": "Mind your manners.",
      "content": "Mind your manners. A man doesn’t question why he has to use manners, he just uses them. Manners are a great way to show people that you care about them, which goes a long way. Be mindful of your words, avoid swearing in inappropriate settings, actively listen , and thank others. [15] X Research source Manners express good character and show others that you have respect for them. By being courteous and helping others , you will display respect and care for the people around you, which is a hallmark of manhood."
    },
    {
      "title": "Be selfless and display humility.",
      "content": "Be selfless and display humility. On the journey to manhood, it’s easy to believe you should be stoic and cold, but real men show that they care about the people around them. Show up for others without expecting something in return, help them when they need it, and don’t be afraid to ask for help yourself. You’ll strengthen your relationships and feel accomplished. [16] X Research source Service provides you with the opportunity to show up for the people you care about. Help your grandparents around the house or help an old person cross the street to further your journey to manhood. Don’t forget to show up for yourself. You can’t help others unless you help yourself."
    },
    {
      "title": "Be a gentleman.",
      "content": "Be a gentleman. Your inner gentleman tells you the things to do that you know you should — but sometimes are too lazy — to do: [17] X Research source Paying for dates is the gentleman thing to do, especially if you asked them on a date. Some people are willing to go 50/50, so if you need help, don’t be afraid to ask! Opening doors, helping into chairs, and saying \"please\" and \"thank you.\" Generally putting the lover in question ahead of yourself out of respect. Doing domestic duties. Some men who are already in long-term relationships shirk their domestic duties: forgetting to take out the trash, do the dishes, change the diapers. Real men know that they must share in domestic duties, as unpleasant as they may be. Being a gracious loser. Men are naturally competitive, making this a tough one for some. Accept defeat with the same grace that you accept victory. Easier said than done."
    },
    {
      "title": "Don't kiss and tell.",
      "content": "Don't kiss and tell. Men love the chase of romance, but too often get lured into bragging about the conquest. Don't fall victim to the notion that if you don't brag about it, it didn't happen. Success in love speaks loud enough for itself. A quiet confidence will perhaps even suggest to your friends that you're a regular Lothario, even if you're not."
    },
    {
      "title": "Always treat your significant other with respect.",
      "content": "Always treat your significant other with respect. To have a healthy relationship, you must respect your partner, as they’re showing you sides of themselves that they don’t show to anyone else. It’s your responsibility to respect their vulnerability and expression. A simple list of dos and don'ts: Do : Listen to what they have to say. Forgive them when they make a simple mistake. Follow through on what you say you'll do. Treat them the same way you'd like to be treated. Don't : Hold them to unrealistic expectations. Manipulate them to get whatever you want. Treat them as an object instead of a person. Assume that you know how they'll feel or react."
    },
    {
      "title": "Don't rush a relationship.",
      "content": "Don't rush a relationship. Lots of guys rush people into uncomfortable situations. By doing this, they not only alienate the lover but also keep themselves from getting what they want. By letting the other person set the pace, the man sets the relationship up for success and usually ends up richer in the bargain. The best thing in a relationship is the communication . Talk to your partner!"
    },
    {
      "title": "Keep a little mystery in the tank.",
      "content": "Keep a little mystery in the tank. Being intriguingly puzzling can be very alluring and seductive to some. Being mysterious does not mean being the strong, silent type. It just means holding back a little for a later time, surprising with an unexpected skill, trait or gesture."
    },
    {
      "title": "Choose your partner wisely.",
      "content": "Choose your partner wisely. When you’re young, you’re still learning how to love. As you become a man, you will have to put what you’ve learned into practice. That won’t be useful if you and your partner aren’t compatible . To ensure a healthy relationship, choose a partner who communicates effectively, shares your values, respects you, and stands on their own. [18] X Research source Make sure you’re ready for a relationship before entering one. You don’t want to put your unresolved feelings and baggage onto someone else. If you want to approach someone you’re interested in, be mindful of the location. If they seem open to conversation, dating coach John Keegan says to approach them and give them light compliments, like “I like your shirt.”"
    }
  ]
}