{
  "url": "https://www.wikihow.com/Cook-Fish",
  "title": "How to Cook Fish",
  "steps": [
    {
      "title": "Source the freshest fish available.",
      "content": "Source the freshest fish available. Of course, fresh ingredients are important anytime you're cooking, but with fish, it's especially important. You can disguise some three-day old chicken pretty easily, but it's much tougher to disguise some cod that's been sitting around for three days. In order to cook the best fish of your live, you'll want to get cozy with your fishmonger. [1] X Research source The best trick to getting the freshest fish available is to simply ask. Go up to the fishmonger manning the fish in your local grocery store and ask them what's fresh today. This will sometimes require being flexible about the kind of fish you cook, but it's for the better. Fresh fish almost invariably tastes better than old fish, whether it's salmon, mackerel, tuna, or swordfish — the list goes on. The freshest fish will smell of the sea (briny) but not fishy; the gills should be bright and moist; the meat firm and springy; and the scales should not be dull or flake off easily. [2] X Research source"
    },
    {
      "title": "Get familiar with your thermometer.",
      "content": "Get familiar with your thermometer. The secret to cooking fish is knowing the temperature at which they're finished cooking. In order to do this, you'll want to use a food thermometer until you get the hang of things and can tell whether your fish is done by touching or merely looking at it. Most fish are perfectly cooked when they reach an internal temperature of 120° - 145°F (~49° - 63°C). [3] X Trustworthy Source FoodSafety.gov Online portal combining food safety information from the U.S. Food and Drug Administration, the Food Safety and Inspection Service, and the Centers for Disease Control and Prevention Go to source"
    },
    {
      "title": "Know that it's okay to undercook most fish.",
      "content": "Know that it's okay to undercook most fish. Ever heard of sushi ? Or how about ceviche? These are two fish dishes that are not cooked at all. Unlike undercooked poultry, which carries the risk of salmonella, fish are okay to eat undercooked or even raw. [4] X Research source Some fish are better raw (or undercooked)! Fish like tuna are often given a light sear on both sides before removing from the heat and serving. Tuna tartar, famously, isn't cooked at all. Understand that there is always a small risk when eating raw and undercooked fish. Microbes and parasites can cause food poisoning or infection. [5] X Trustworthy Source EatRight.org Organization associated with the Academy of Nutrition and Dietetics providing advice about food, health, and fitness Go to source"
    },
    {
      "title": "Know the three basic kinds of fish.",
      "content": "Know the three basic kinds of fish. Fish come in three basic varieties, each of which tends to be cooked in a different way and contains different nutritional properties. [6] X Trustworthy Source EatRight.org Organization associated with the Academy of Nutrition and Dietetics providing advice about food, health, and fitness Go to source Knowing your way around the basic varieties will help you become a better cook: White fish — cod, plaice , sole, hake and haddock, among others. These fish have translucent skin that turns an opalescent white when being cooked. Usually battered and deep fried, they form the basis of the classic English fish and chips. Oily fish — salmon, trout, kipper and sardines, among others. Oily fish are oilier than other varieties, but contain good oils (omega 3 fatty acids). They are often grilled, baked, or steamed. Shellfish — shrimp, scallops, mussels, and oysters, among others. Shellfish are categorized either as \"crustaceans\" (shrimp) or \"mollusks\" (oysters). Commonly bottom feeders, shellfish are harder to digest than either white or oily fish."
    },
    {
      "title": "Experiment with marinades, but know that most fish taste wonderful with just salt and pepper.",
      "content": "Experiment with marinades , but know that most fish taste wonderful with just salt and pepper. There are tons of different marinades that you can experiment with when cooking fish — soy sauce and honey works great on salmon, while olive oil and lemon work nice on whitefish. But ultimately, great fish — like great meat — tastes exquisite when you let the taste of the actual fish, and not the marinade, take over."
    },
    {
      "title": "Cook with your fish as dry as possible.",
      "content": "Cook with your fish as dry as possible. Dry off your fish before cooking, whatever method of cooking you decide to use. Especially important for frying or pan-frying, excess moisture will cool down hot oil. Try to pat down fish fillets or steaks with a dry paper towel before cooking for best results. [7] X Research source"
    },
    {
      "title": "Thaw your fish",
      "content": "Thaw your fish before cooking. For best results, of course, you'll want to use fresh fish. But let's face it — fresh fish is expensive, a luxury that not all of us can afford. Frozen fish is a nice alternative, but you'll want to thaw your fish for a day in the refrigerator before cooking for best results. [8] X Research source Oh, and remember to pat it down to remove excess moisture before cooking! You can bake frozen fish, for example, but you'll want to double the normal cooking time from your recipe. Cooking frozen fish is very tricky however, and shouldn't be done as a rule of thumb if you can afford it."
    },
    {
      "title": "Try grilling fish",
      "content": "Try grilling fish . Perfect for summer months, grilling fish is both easy and enjoyable. With your coals or gas grill, you'll want to try to make a hot pile and a cold pile, so that you can cook the fish over low heat for the majority of the time, and then give it some color by finishing the cooking over high heat at the very end. Be sure to use the thermometer to get the temperature correct, and remember that fish cooks extremely quickly! [9] X Research source When grilling fish, be sure to oil the grill and the fish generously before cooking. A well-oiled fish and grill will keep the fish from sticking to the grate when you choose to flip it. If you want to, you can also use an aluminum foil pouch to keep the fish in as it cooks; this saves cleanup time and cooks the fish very nicely. Remember to choose the right kind of fish for grilling. Meaty, hearty fish like salmon, halibut, and swordfish work best on the grill, especially if you can get them cut into steaks. [10] X Research source Delicate white fish like cod, flounder, or sole tend to fall apart easier on the grill, making for a less than ideal marriage between grill and fish."
    },
    {
      "title": "Bake, bake away",
      "content": "Bake, bake away . Probably the healthiest cooking option available, baking relies on dry heat and less oil to thoroughly bring the fish to perfection. Line a baking tray with wax paper or aluminum foil, thoroughly oil the fish (or paint with a dab of melted butter), and cook at a lower heat for a longer time. Here's some more specific pointers for you to remember as you bake fish: [11] X Research source If you're baking with a fish fillet that has a thicker center and thin sides, curl the thin sides underneath the fish as it cooks. [12] X Research source That way, the sides won't be overcooked be the time the rest of the center is done. Decide on your cooking temperature. Because fish are delicate and dry out easily, a lot of cooks recommend baking fish at low temperatures (think 250° F) for longer periods (20 minutes for fillets). For thicker (center cut) fish, many chefs recommend cooking at higher temperatures (400°F) for less time (15 minutes), although cooking times depend on the thickness of the cut. Try the 10-minute rule for baking fish, or \"Canadian cooking method.\" Measure the cut of fish at its thickest point. For every inch of thickness, cook for 10 minutes at 400° - 450°F. [13] X Research source Pro-rate the ratio for uneven thicknesses. For example, a 1.5 inch (3.8 cm) center cut piece of salmon should be cooked for 15 minutes at around 425° F. For added flavor and moisture, think about adding herbs and aromatics to your baked fish. Lemon and capers or dill works great with salmon as well as with other types of fish. Bread crumbs work well with white fish, particularly tilapia."
    },
    {
      "title": "Pan-fry your fish to perfection",
      "content": "Pan-fry your fish to perfection . Pan frying gives you the option of being a little more creative with your fish. Not only can you dredge your fish in flour or cornmeal to get a nice crunchy exterior, but you can also make sauces from the juices leftover in the bottom of the pan. Here are some secrets for pan-frying fish to perfection. [14] X Research source Start off with enough oil and a hot pan. Oil your steel pan generously but not excessively and get it hot . Starting off hot helps cook the skin on the fish quickly, allowing it to adhere to the meat of the fish for nice presentation and an even nicer feel in the mouth. Always pan-fry with skin side down to begin with. That way, your skin browns evenly and adheres to the meat of the fish. After a minute or two on medium or high heat, turn the heat down to medium-low or low. Cook the fish slowly from here on out. Cook too hot at the moisture will evaporate from the fish before it's fully cooked, leading to a drier fish. Flip once! Start off cooking the fish skin side down at high temperature. Turn the temp down significantly, and continue cooking for a little bit. Flip the fish once, and only once. Continue cooking the fish until your thermometer reads about 137°F. If you don't have a thermometer, you can tell that the fish is cooked if you can easily cut and flake the meat with a fork."
    },
    {
      "title": "Poach your fish",
      "content": "Poach your fish . The idea behind poaching is to cook the fish through by submerging it in a hot or simmering, but not boiling, liquid inside a covered pan. The liquid should consist mostly of water, but other ingredients are usually added to increase the flavor. White wine and salt are commonly used, along with herbs (thyme, rosemary, parsley, etc.) and/or vegetables (onions, celery, carrots, etc.). Try poaching with court bouillon, an excellent poaching liquid. Court bouillon is commonly made out of water, salt, white wine, vegetables (usually mirepoix) and a bouquet garni, or herb bouquet. There are two ways to poach: The \"deep\" poach, which is completely submerging the fish in a poaching liquid, or the \"shallow\" poach, where the fish is partially submerged in poaching liquid. Deep poached fish typically do not need a cover for the pot, while shallow poached fish typically do. In general, your poaching liquid should only be about 160 - 180ºF. This means a slight shimmering or quivering on the surface of the liquid, and maybe a bubble or two there. For hotter, simmering poaching liquids, the cooking time will decrease significantly. Which fish are great for poaching? Arctic char, barramundi, halibut, mahi mahi, striped bass, sturgeon, and tuna all work excellent in poaching liquid."
    },
    {
      "title": "Fry fish",
      "content": "Fry fish . Fried fish feeds the soul. Although it is less healthy than poaching or baking, it can elevate an \"ordinary\" fish like catfish into an art form. Fish are usually battered and then dunked into a hot pan filled with oil. Here are some basics for you to remember as you fry fish: Decide on dredge vs. batter. You can dredge your fish in flour and egg, making for a lighter fish, or whip up a batter out of beer or buttermilk for a thicker, crunchier shell. Cooking times do not vary significantly for either method. You'll most likely want your oil to be at around 375ºF when you start frying, and cook the fillets for about 3 to 4 minutes, or until golden brown. One trick for determining whether you've got the right heat for frying is to float a strike-anywhere match on top of the frying liquid. The match has a flash point of 365ºF, around the ideal cooking temperature. It's not a Martha Stewart-approved trick, but it will definitely get the job done!"
    },
    {
      "title": "Make almond crusted salmon",
      "content": "Make almond crusted salmon . The crisp nuttiness of almonds marries perfectly with the rich, unctuousness of the salmon. A no-nonsense alternative to breaded salmon! [15] X Research source"
    },
    {
      "title": "Grill up a whole sea bass",
      "content": "Grill up a whole sea bass . That's right, a whole fish. In many cultures the eyes and cheeks of a fish are considered a delicacy. Stuffed with some fruits, veggies, or herbs, this makes a truly transcendent dish. [16] X Research source"
    },
    {
      "title": "Try fennel topped trout",
      "content": "Try fennel topped trout . This recipe involves fennel, which doesn't overpower the delicate trout. Add in ginger, shallot, and lemon peel, and you've got a nice little slaw to go over your trout."
    },
    {
      "title": "Make some lemon-baked cod",
      "content": "Make some lemon-baked cod . Cod can be baked to perfection with just a little bit of butter, lemon, and onion. Delicious! [17] X Research source"
    },
    {
      "title": "Fry up some flounder.",
      "content": "Fry up some flounder. This bottom-feeding fish with two eyes on one side of its face is surprisingly delicate, seeing as it doesn't move around very much and thus has a high fat content. For a quick but tasty morsel. [18] X Research source"
    }
  ]
}