{
  "url": "https://www.wikihow.com/Boil-Vegetables",
  "title": "How to Boil Vegetables",
  "steps": [
    {
      "title": "Trim your vegetables and clean them.",
      "content": "Trim your vegetables and clean them. Vegetables like broccoli or green beans must be trimmed to remove tough and inedible portions of the veggie. For broccoli, this would entail removing the thick bases at the bottom of their stems. For green beans this would include snapping off the inedible ends. Rinse your vegetables under cold water after trimming them. For vegetables with tough stems like broccoli, cauliflower, or asparagus, you can use a knife to cut off the bottom parts of the vegetable. [2] X Research source For corn, you want to remove the thick stem and husk it, or remove the green outer leaves. Most frozen vegetables can be boiled before they are thawed. [3] X Research source Leafy greens also possess thick, fibrous stems that should be removed before boiling. [4] X Research source If you are cooking leafy greens like lettuce or cabbage, you will need also need to remove the core. [5] X Research source"
    },
    {
      "title": "Cut your vegetables into similar sized pieces.",
      "content": "Cut your vegetables into similar sized pieces. All pieces of your green vegetables should be a similar size to ensure even cooking among different greens. If you are cooking leafy greens like cabbage, cutting the leaves into smaller pieces will help you fit more of the cabbage into the pot. For some vegetables like green beans or broccoli, you may have to cut down larger pieces, to accommodate the varying sizes of each piece."
    },
    {
      "title": "Bring a pot of water with a pinch of salt to a boil.",
      "content": "Bring a pot of water with a pinch of salt to a boil. Boiling softer green vegetables is more effective if you are starting off with boiling water. Because they are not as thick as root vegetables, and don’t possess a hard exterior, green vegetables usually cook faster. Salt raises the boiling point of water and can also help season your boiled vegetables. [6] X Research source"
    },
    {
      "title": "Carefully place vegetables into the boiling water.",
      "content": "Carefully place vegetables into the boiling water. Once your water is a at a rolling boil, gently place the vegetables into the boiling pot of water. You can use a slotted spoon for this. Cabbage typically takes 5-10 minutes to fully cook through. [7] X Research source Green beans will take anywhere from 5 to 15 minutes depending on how they are cut. [8] X Research source Broccoli only takes 3–4 minutes to boil in water. [9] X Research source Corn on the cob takes 5 minutes to fully cook through on the stovetop. [10] X Research source It’s advised you don’t boil frozen vegetables because they may become mushy. [11] X Research source However, if you must it should only take 3–5 minutes, depending on the vegetable. Make sure to read the back of the package for boiling times. Be careful not to plop your vegetables into the water or it may splash you."
    },
    {
      "title": "Let the water start boiling again and then reduce heat.",
      "content": "Let the water start boiling again and then reduce heat. When you put your vegetables into the pot, it will likely stop boiling. Wait for the water to fully boil again, and reduce the heat. You can prevent this by placing smaller portions of vegetables in at a time, instead of dumping them all in."
    },
    {
      "title": "Put the lid on the pot and check the vegetables every 3–5 minutes for firmness.",
      "content": "Put the lid on the pot and check the vegetables every 3–5 minutes for firmness. You can test your vegetables by poking them with a fork or knife. Putting the lid on the pot and reducing the heat will prevent your pot from overboiling."
    },
    {
      "title": "Drain vegetables of water once cooked to preference.",
      "content": "Drain vegetables of water once cooked to preference. Once your vegetables reach the desired firmness, drain the excess water out of the pot. Leaving your vegetables in water can make them mushy."
    },
    {
      "title": "Peel and clean your vegetables.",
      "content": "Peel and clean your vegetables. Run your vegetables under cold running water to prevent you from getting sick from pesticides or bacteria. [12] X Trustworthy Source FoodSafety.gov Online portal combining food safety information from the U.S. Food and Drug Administration, the Food Safety and Inspection Service, and the Centers for Disease Control and Prevention Go to source Although boiling water will remove most of the bacteria that can be found on vegetables, you can still be exposed to it by handling them. If you don’t plan on peeling a vegetable, make sure you scrub it with a produce brush to remove dirt. Dry off any vegetables you’ve peeled or washed with a paper towel or clean cloth."
    },
    {
      "title": "Cut your vegetables into uniform pieces.",
      "content": "Cut your vegetables into uniform pieces. Cutting your vegetables into comparable sizes will ensure that they all cook at the same speed. While you don’t need to get the size of your vegetable pieces exact, try to get as close as you can. If you cut different sizes, smaller pieces will overcook, while larger pieces will remain raw. [13] X Research source Root vegetables typically take longer to cook. If you want to cut down on cooking time, cut smaller pieces. [14] X Research source"
    },
    {
      "title": "Put your pieces of vegetable into a pot.",
      "content": "Put your pieces of vegetable into a pot. Take your pieces of vegetable and place them into a deep pot that has an accompanying lid. If you don’t have a big enough pot to boil all your vegetables, you can cook 2 batches of vegetables individually, in a smaller pot."
    },
    {
      "title": "Fill your pot with cold water, completely submerging your vegetables.",
      "content": "Fill your pot with cold water, completely submerging your vegetables. Root vegetables such as beets, turnips, carrots, radishes, and potatoes cook better when they start in cold water. The gradual heat-up makes the vegetables resistant to overcooking, and ensures the outside and inside of your vegetable cooks uniformly. [15] X Research source Fill your pot so the water rises a half-inch above your vegetables. Seasoning with salt at this stage will add more flavor to your vegetables."
    },
    {
      "title": "Set your stovetop on high and bring the water to a boil.",
      "content": "Set your stovetop on high and bring the water to a boil. Bring the water to a rolling boil. You’ll know you’ve achieved this when numerous bubbles begin to break on the water’s surface. You can cover your vegetables while the water comes to a boil to quicken the rate of boiling. [16] X Research source A full rolling boil can not be dissipated by stirring."
    },
    {
      "title": "Reduce the heat to a simmer, and cover your pot with the lid.",
      "content": "Reduce the heat to a simmer, and cover your pot with the lid. Different vegetables require different cooking times. Root vegetables take longer than all other types of vegetable because of the starch that can be found in them. Often root vegetables are also larger than regular vegetables, which can also increase boiling times. [17] X Research source Check on your vegetables often to ensure that you don’t overcook them. Beets need to be boiled for 45 minutes to an hour. [18] X Research source Turnips will take around 25 minutes if cut into smaller pieces. Typically potatoes will take 10–15 minutes to boil. [19] X Research source Carrots will usually take 8–10 minutes, with smaller pieces taking anywhere from 5 to 10 minutes. [20] X Research source Look online for specific boiling times for the root veggie that you want to cook. If you continue to boil at the highest temperature, you’ll have water loss and run the risk of your water overboiling, or spilling out of the sides of your pot. This is why reducing the heat is so important after the water begins to boil. [21] X Research source"
    },
    {
      "title": "Test if your vegetables are done by poking them with a fork.",
      "content": "Test if your vegetables are done by poking them with a fork. You can check on your vegetables every 5 minutes if you’re unsure how long you should cook them. If you’re having a hard time getting through the vegetable with your fork, or the fork gets stuck in the vegetable, you need to cook it longer. If your fork goes in and out, then your vegetables are adequately cooked. [22] X Research source Frequently check back so you don’t overcook your vegetables. Over boiled vegetables get mushy."
    },
    {
      "title": "Drain the pot of water.",
      "content": "Drain the pot of water. You can either use a strainer or a colander to drain your pot of water. Make sure that you begin draining as soon as you turn off your stove, because the vegetables will still be cooking while sitting in the water, and you don’t want to overcook them."
    },
    {
      "title": "Put a pot of water on the stove and bring it to a boil.",
      "content": "Put a pot of water on the stove and bring it to a boil. You begin blanching and shocking vegetables in the same manner that you would normally use to boil them. Make sure that before you boil your vegetables, you peel, trim, and cut them. You should have enough water boiling to fully submerge your vegetables. You can blanch and shock nearly every vegetable, whether it be a root or green veggie."
    },
    {
      "title": "Place vegetables into the pot of boiling water and reduce the heat.",
      "content": "Place vegetables into the pot of boiling water and reduce the heat. Lower your vegetables into the pot of boiling water carefully once your water has reached a rolling boil. Use a heat resistant spoon to lower your vegetables into the water."
    },
    {
      "title": "Stir vegetables with a wooden spoon until they become softer or greener.",
      "content": "Stir vegetables with a wooden spoon until they become softer or greener. A great sign of your veggies being boiled is if they get softer or greener. Make sure that your vegetables are still a little firm so they retain their crunch. [23] X Research source Soft vegetables such as asparagus or peas would require a lower cooking time than a hard vegetables like carrots. Asparagus takes 2-4 minutes to blanch. Green beans, rutabaga and turnips take 3 minutes to blanch. [24] X Research source Watch your pot while your vegetables are cooking so that you don’t overcook them. A general rule of thumb is that vegetables should only be cooked long enough so that they are tender and crunchy."
    },
    {
      "title": "Fill up a large bowl with water and ice and set it aside.",
      "content": "Fill up a large bowl with water and ice and set it aside. This bowl of water will be used later to shock your vegetables so that they immediately stop cooking and retain their crunchy texture. Don’t place your ice water too close to the stove or your ice may melt."
    },
    {
      "title": "Plunge your boiled vegetables into the bowl of ice water.",
      "content": "Plunge your boiled vegetables into the bowl of ice water. Putting the boiled vegetables into ice cold water will stop the vegetable from cooking internally, and is a way to prevent them from getting mushy even after you take them out of boiling water. This step is also known as “shocking” the vegetables. You can use tongs or a slotted spoon to get your vegetables from your pot to the bowl of ice water. [25] X Research source"
    },
    {
      "title": "Drain the vegetables well, and allow them to dry.",
      "content": "Drain the vegetables well, and allow them to dry. Once your green vegetables have been cooled, you can drain them using a strainer or colander. They should retain their firmness, but taste cooked through. You can buy a strainer or colander at most home goods or department stores."
    },
    {
      "title": "Put your vegetables into a microwaveable-safe bowl.",
      "content": "Put your vegetables into a microwaveable-safe bowl. After cutting and peeling your vegetables, place them in a microwaveable-safe bowl. Make sure to avoid any bowls that have metals or that can crack under extreme heat. This is one of the best methods to use when boiling frozen vegetables. Certain plastics may leach into food when heated and could be detrimental to your health. You can use glass or ceramic bowls in the microwave. [26] X Research source"
    },
    {
      "title": "Add water to the bowl.",
      "content": "Add water to the bowl. Add enough water so it is 1/8th up the side of your bowl. This will help boil and steam your vegetables. You can use either cold or hot water for this."
    },
    {
      "title": "Apply plastic wrap over the bowl and create ventilation holes.",
      "content": "Apply plastic wrap over the bowl and create ventilation holes. Make sure that there is proper ventilation on the surface of your plastic wrap. You can poke holes through the top with a fork or a knife. You can also use a ceramic plate and place it over the cover of your bowl. [27] X Research source"
    },
    {
      "title": "Microwave on high for 4–5 minutes.",
      "content": "Microwave on high for 4–5 minutes. Make sure that you have a rotating plate inside of your microwave. This will ensure that all your vegetables are cooked evenly. Set the power on your microwave to high before you input the time. Certain microwaves have higher or lower power levels. This may have an effect on the consistency of your vegetables. Broccoli will only take 3–5 minutes. [28] X Research source You can put less time on your microwave and stir to ensure that your vegetables aren’t getting mushy."
    },
    {
      "title": "Take the film off the bowl and stir the vegetables.",
      "content": "Take the film off the bowl and stir the vegetables. Your vegetables may need extra time in the microwave if they are too tough or hard. If that is the case, then you can repeat the steps, but set the timer to 1-1.5 minutes. Be careful of the steam that will escape your bowl once you remove your plastic wrap."
    }
  ]
}