{
  "url": "https://www.wikihow.com/Become-an-Honor-Student",
  "title": "How to Become an Honor Student",
  "steps": [
    {
      "title": "Find your motivation.",
      "content": "Find your motivation. Why do you want to be an honors student? To get a well-paid job? To make your parents happy? For the sheer love of academics? Motivation can come from inside or outside. The best way to start towards your goal is to know exactly what is motivating you. Studies suggest that intrinsic motivation, or feeling motivated to do something because it aligns with something you believe or value, is more powerful than extrinsic, or external, motivation. Intrinsic motivation is driven by three basic needs: competence (doing something successfully), relatedness (connecting with other people), and autonomy (feeling in charge of your own life). [1] X Research source For example, if you're motivated to become an honor student because you love performing well at your studies, or because it makes you feel like you're in charge of your education, this is intrinsic motivation. If you are motivated to pursue honor status because you want your parents to be proud of you, or to enhance your resume, this is extrinsic motivation. Extrinsic motivation isn't a bad thing, but it isn't as strong as intrinsic motivation. [2] X Research source"
    },
    {
      "title": "Organize",
      "content": "Organize yourself. School can throw a lot at you. Take a systematic approach. Have all your books and assignments ready every day and know what's coming. Organization is a key characteristic of honor students. Do you tend to forget assignments? Try using a daily planner as a way to remember. You can even enter in reminders on your phone or in an online calendar such as Google Calendar or Apple's iCloud Calendar. [3] X Research source Keep separate folders for each course or subject. Make sure you keep all your assignments, notes, rubrics, etc. for the course in this folder. When it comes time to study for an exam or write an essay, you'll have all your material in one place. Set deadlines for yourself. Your teachers likely have deadlines for projects, but setting your own deadlines ahead of these will help you stay on track. Break large projects down into smaller sub-tasks and set a mini-deadline for each task. For example, instead of \"term paper due December 4,\" figure out how much time you will need for each stage of that paper. You'll need time to plan, research, write a draft, revise it, and turn it in (preferably ahead of the due date). Set deadlines for each of those stages. [4] X Research source"
    },
    {
      "title": "Set a routine.",
      "content": "Set a routine. High achievers often keep very regular schedules. The German philosopher Immanuel Kant was so routine that his neighbors set their watches to him! Doing the same tasks regularly, at the same time and place every day, is part of being organized and will put you in a proper mental space. [5] X Research source A routine prepares you to work. Set aside a time each day or each week to work on a subject without distractions. Or, give yourself a quota to meet each day -- so many pages to read or words to write. Make appointments with yourself for study time. Fill them in on your calendar just as you would going to class or soccer practice. Keep these appointments faithfully. Get in the habit of studying for a set amount of time, such as 45 minutes, followed by a 15-minute break. This method is much more effective than trying to study for huge chunks of time. [6] X Research source [7] X Research source"
    },
    {
      "title": "Create a good study space.",
      "content": "Create a good study space . Having a good work-space is important. You need a place that helps you focus on your studies without distractions or interruptions. Figure out what works best for you, and create a study environment that matches those needs. [8] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020. Some people work best in silence. Others prefer to work to music or background noise. Avoid studying in bed, as this can encourage you to goof off or take a nap instead. [9] X Research source Change up your study locations at times. A desk at home, a library carrel, or a table at a quiet cafe are good choices."
    },
    {
      "title": "Go to class.",
      "content": "Go to class. School is filled with distractions, from your friends to sports and parties, and once you get to college no one will call your parents if you skip class. But try to make academics your priority. You won’t be an honors student if you are chronically absent. You cannot excel if you aren't there to learn and discuss the material. Many honors courses have additional requirements, such as class participation or class discussion. If you miss class, you miss out on this part of your grade. A good circle of friends or study partners can hold you accountable. Consider making a deal with your study-buddies to keep each other in class."
    },
    {
      "title": "Get help from others.",
      "content": "Get help from others. Schools usually have resources available to help you reach your highest potential. You just have to ask. It should be possible to find a study group, for example, and some schools even have special centers for tutoring in subjects like math. Be aware of what's available. [10] X Research source Talk with your teacher if you're having difficulty, or you'd just like to understand a topic more clearly. As long as it's not an hour before the test, most teachers are happy to answer your questions. Join a peer tutoring program if you need more intensive one-on-one help. Peer tutors know their stuff -- you have to do well in a subject in order to become one. They can guide you through assignments and major concepts, build up your base of knowledge, or help you prepare for an upcoming exam. Don't despair if your school doesn't offer these resources. It's always possible to form your own study circle. But be careful if your study circle consists only of close friends. Minimize your distractions and remember to hit those books!"
    },
    {
      "title": "Take good notes in class.",
      "content": "Take good notes in class. You forget 47% of the information you encounter within twenty minutes. You forget 68% in a day. Take good notes for every subject in order to remember what you’ve covered in reading and lectures for later review. [11] X Research source Taking notes is an art form. It will take you some time to learn how to listen and read effectively and identify the most important things. Oftentimes school writing centers offer students tips for this. [12] X Research source How you take notes – whether by computer or hand – is up to you. Studies suggest that taking notes by hand is better for comprehension and recall, though. [13] X Research source Some (but not all) teachers are also fine with students recording them in class. Just make sure to ask for their permission beforehand. Many honor students like using the Cornell method , which involves taking notes during class and then later returning to them to review and condense. This method is great for courses that cover clearly-defined subjects, such as math, science, and history. It is less useful for more abstract courses that focus less on memorization and recall, such as a discussion-heavy literature course."
    },
    {
      "title": "Do your assignments.",
      "content": "Do your assignments. Whether essays, lab reports, or problem sets, assignments will usually make up a big part of your total grade in a course. Missing just one might mean a reduction in your final mark. It might mean more. It can be the difference between a final B+ and an A. [14] X Research source There are also reasons to do your homework besides just the grades. Studies have shown that completing your homework is linked to higher achievement and to the development of skills like time management, responsibility, and good study habits. Turn in your assignments early when possible. If your paper is due online at midnight, it's practically a guarantee that there will be a dozen students trying to upload it at 11:59, which could cause system crashes. Do your assignments as soon as possible, and definitely turn them in early when you can. [15] X Research source A strong history of turning in your assignments on time also makes teachers more likely to be flexible if you have a genuine emergency. If you've only turned in a third of your homework to start with, though, your teacher is unlikely to be impressed by your excellent excuse for not doing it this time."
    },
    {
      "title": "Be honest about your work.",
      "content": "Be honest about your work. While it's usually a good thing to study with classmates, there can be a thin line between cooperating and cheating. Your teachers will expect you to hand in your own work. If you aren't clear on what's acceptable, talk with your teacher beforehand. Be especially careful when it comes to homework assignments. Unless it's a group project, it may be inappropriate to do an assignment with others. Never plagiarize. Using another person's answers, or copying words from a book or website into an essay, are forms of plagiarism and academically dishonest. Plagiarism can cause you to fail an assignment or course or even get you expelled. [16] X Research source"
    },
    {
      "title": "Study often and early.",
      "content": "Study often and early. Being an honor student probably means hitting the books more than your peers. Review your lessons and notes at home or before class. Review with friends or alone. Review while on the bus or watching TV. You can also try as much as possible to read ahead, as this will help you to ask reasonable questions and allow you to understand new topics more easily. [17] X Research source Try bringing flashcards with you on the bus or public transit. You can review them while you're riding to school, or even while you're standing in line at the store. By reviewing your material in smaller chunks frequently, you're more likely to commit it to long-term memory. Try studying with a friend. Sometimes studying with someone else can help you both stay motivated. [18] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020."
    },
    {
      "title": "Forget trying to multitask.",
      "content": "Forget trying to multitask. Many students seem to believe that they're great multitaskers. [19] X Research source However, many studies show that multitasking, or trying to focus on several tasks at the same time, simply doesn't work. You just end up spreading your attention out thinly over several areas, rather than focusing it on one. [20] X Research source So put the cell phone away, log off social media, and turn off the TV while you're studying. This works the other way around, too. Even the most dedicated honor student needs time to decompress and relax, or you'll burn out. Schedule in some dedicated \"me time\" and keep it faithfully. If you're on a half-hour break, try not to think about homework."
    },
    {
      "title": "Stay focused.",
      "content": "Stay focused. Getting good grades for an entire academic year is a challenge that requires mental focus. At times it will be a slog. Remember your original motivation and keep it in mind. [21] X Research source Motivations change sometimes. Maybe having the perfect resume was really motivating in August but isn't so much in November. Try thinking about your long-term goals and how being an honor student plays into them. Try to find sources of intrinsic motivation when you can. It can be much harder to stay focused and dedicated if you're doing something to make someone else happy, rather than yourself. [22] X Research source"
    },
    {
      "title": "Talk to your teachers.",
      "content": "Talk to your teachers. Teachers are there to help you – it’s their job and they generally like it when students show interest. If you introduce yourself, they will not only remember you but also appreciate your questions. [23] X Research source Being willing to admit that you need help and ask questions actually reflects well on you as an honor student. It ultimately shows that you understand the need for collaboration and growth. Teachers will often make time before or after class to field students’ questions. It is usually a good idea to approach them then. However, if before or after class doesn't work, talk with your teacher about meeting another time. Often, teachers are happy to accommodate you if you have genuine questions and curiosity. In college, professors also generally hold weekly office hours. Find out where and when they are and visit a couple of times during the semester. But have a clear reason for going. They will appreciate your visit so long as you do not waste their time."
    },
    {
      "title": "Don’t get discouraged.",
      "content": "Don’t get discouraged. A scholastic career is not complete without one or two whiffs – a bad grade, for example, or a poorly received essay. It is important to use these as lessons for the future and not give up. Remind yourself that everyone makes mistakes. Making a mistake, or even a failing grade, is not the same as being \"a failure.\" Students who hold themselves to unreasonable standards of perfection often suffer increased levels of depression and anxiety, and may not even perform as well as those who have more reasonable standards. Perfectionism is not the same as the healthy quest for excellence that being an honor student represents. When you have a perfectionist approach, you use all-or-nothing thinking: a single bad grade represents total failure, which is unacceptable. You also tend to internalize mistakes, as though doing poorly on a quiz says something negative about you as a person. [24] X Research source Instead, set yourself standards that are high, but that don't demand utter perfection. Remember that learning is a process and not a product. Channel any frustrations into productive energy. Try to accept criticism and use it to improve in the future. View mistakes not as failures, but as opportunities to grow and learn so you can perform differently next time."
    },
    {
      "title": "Maintain a healthy school/life balance.",
      "content": "Maintain a healthy school/life balance. Beware of too much of a good thing. Classes are important; they are why you are in school in the first place. But too much focus on academics can lead to stress, anxiety, and depression. Give yourself time to enjoy a social life, activities you enjoy, and decompress from the stresses of being an honor student. [25] X Research source Do things to keep yourself healthy and in good spirits. Consider joining an extracurricular activity. Not only will you have fun, extracurricular activities often look great on a resume or college application. Have a support network. Friends can help you catch up when you are absent on a particular day, but they are also invaluable for your overall well-being. An active social life can be a great release and give you a much-needed break from studying. Family is important, too. There will probably be times when you’ll need to lean on them for moral support."
    },
    {
      "title": "Eat right and exercise.",
      "content": "Eat right and exercise. It may sound strange, but we now know that there are clear links between diet, exercise, and high cognitive performance in children as well as adults. The right food and regular exercise will prime you for learning. Eat breakfast every day, preferably one that incorporates sources of quality protein such as eggs, yogurt, and whole grains. [26] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Incorporate plenty of fresh, dark-colored fruits and vegetables into your diet. These foods are high in vitamins and antioxidants and are literally \"brain food.\" [27] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Get enough glucose. Studies have shown that glucose is important for brain function. If you're diabetic, of course, you need to follow instructions from your physician. In general, though, sources of glucose such as potatoes and whole-grain bread, and even the occasional glass of lemonade or chocolate, will help boost your memory and attention. Get enough daily exercise. Even 30 minutes a day of moderate aerobic exercise, such as running, dancing, or kickboxing, will keep you de-stressed and healthy. [28] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    }
  ]
}