{
  "url": "https://www.wikihow.com/Calculate-GPA",
  "title": "How to Calculate GPA",
  "steps": [
    {
      "title": "Find a grading scale.",
      "content": "Find a grading scale. The most common grading scale for schools in the United States is a four-point scale. Using this scale, a grade of A = 4 points, B = 3 points, C = 2 points, D = 1 point, and F = 0 points. This is called an unweighted GPA. Some schools use a weighted GPA, which allots 5 points for more rigorous classes, such as honors, Advanced Placement (AP), and International Baccalaureate (IB). Other classes are weighted the same. Students who take the 5-point classes can end up with GPAs above a 4.0. [1] X Research source Some schools use plus and minus grading, which values a plus as +.3 and a minus as -.3. For instance, a B+ is worth 3.3, a B is worth 3.0, and a B- is worth 2.7 points. [2] X Research source If you’re unsure what your school uses, try asking your teacher or an administrator."
    },
    {
      "title": "Collect the most recent grades you can by asking your teacher, an office administrator, or registrar.",
      "content": "Collect the most recent grades you can by asking your teacher, an office administrator, or registrar. You might also be able to figure out what grades you've received by going back over old report cards or transcripts. [3] X Research source You want to collect the final grades for each of your classes. Individual class grades, midterm grades, or grades on mid-semester report cards do not count. Only final grades for the semester, term, or quarter factor into your GPA."
    },
    {
      "title": "Record the point value for each grade.",
      "content": "Record the point value for each grade. Write down the correct point value next to each grade using the four-point scale. So, if you have an A- in a class, record a 3.7; if you have a C+, record a 2.3. [4] X Research source For easy reference, use this chart from the College Board to help assign the correct 4.0-scale value."
    },
    {
      "title": "Add up all the values of your grades.",
      "content": "Add up all the values of your grades. After recording the scores for your grades, add the values up. So, let's say you received an A- in Biology, a B+ in English, and an B- in Economics . You'd add up the totals in the following way: 3.7 + 3.3 + 2.7 = 9.7."
    },
    {
      "title": "Take this final number and divide it by the number of classes you are taking.",
      "content": "Take this final number and divide it by the number of classes you are taking. If you have a value of 9.7 on a 4-point scale for three classes, you will calculate the GPA using the following equation: 9.7 / 3 = 3.2. You have a GPA of 3.2. [5] X Research source"
    },
    {
      "title": "Determine the number of credits.",
      "content": "Determine the number of credits. For some schools, especially college courses, each course has a number of credit hours. Credit hours are units schools use to measure the work load. Generally, credit hours are based on mode of instruction, number of hours spent inside the classroom, and number of hours spent studying outside the class. Find out the number of credit hours assigned to each course you are taking. It should be listed on your transcripts or in the school catalogue. [6] X Research source Some schools mostly offer 3 credit hour courses, other colleges 4 credit hour courses, and some schools do a mixture. For many schools, labs are 1 hour. If you cannot find the credit hours for each of your courses, talk to an administrator or the registrar."
    },
    {
      "title": "Assign the appropriate scale value for each letter grade.",
      "content": "Assign the appropriate scale value for each letter grade. Use the common 4-point GPA scale to assign the values: A = 4 points, B = 3 points, C = 2 points, D = 1 point, and F = 0 points. [7] X Research source If your school allots 5 points for upper level classes, such as Advanced Placement (AP) or International Baccalaureate (IB), you will be using a weighted GPA scale. Add .3 for each plus value or subtract .3 for each minus value. If you have an A- in a class, mark it as 3.7. Match up each letter grade with its scale value and write it next to the grade (e.g. B+ = 3.3, B = 3.0, B- = 2.7)."
    },
    {
      "title": "Calculate the weighted scores.",
      "content": "Calculate the weighted scores. To find the GPA, you must do a little bit of math to determine the different values for the scores that go into the overall GPA. [8] X Research source Multiply each scale value grade by the number of credit hours to get the grade points. For example, if you made a B in a 4 credit hour class, you would multiply the scale value of 3 for the B by 4 credit hours, which gives you 12 grade points for that class. Add the weighted grade points for all of your classes together to calculate your total grade points."
    },
    {
      "title": "Find your total weighted credits.",
      "content": "Find your total weighted credits. Add together the number of credit hours you have taken in total to get the total credits. If you took 4 classes that were 3 credit hours each, you will have a total of 12 credit hours. [9] X Research source"
    },
    {
      "title": "Divide the grade points total by the credit hours total.",
      "content": "Divide the grade points total by the credit hours total. For example, if you have a total of 45.4 grade points in a total of 15.5 credit hours, you would have the following math problem: 45.4 / 15.5 = 2.92. Your credit hour-weighted GPA is 2.92. [10] X Research source"
    },
    {
      "title": "Set up your initial columns.",
      "content": "Set up your initial columns. In the A column, type in the names or numbers of the subjects you're taking. In the B column, type in the letter grades you want to factor into your GPA. [11] X Research source"
    },
    {
      "title": "Input the scale values in column C.",
      "content": "Input the scale values in column C. Determine the numerical scale values of the grades you are inputting. To complete this step, you will have to decide if your school uses a weighted or unweighted GPA scale. [12] X Research source The common 4-point GPA scale is as follows: A = 4 points, B = 3 points, C = 2 points, D = 1 point, and F = 0 points. If your school uses a weighted GPA scale, they allot 5 points for upper level classes. Ask an administrator, teacher, or registrar for this information. You can also look on your report card or final grade sheets. Add .3 for each plus value or subtract .3 for each minus value. For example, B+ = 3.3, B = 3.0, B- = 2.7."
    },
    {
      "title": "Type an equals sign (=) into the first cell of column D.",
      "content": "Type an equals sign (=) into the first cell of column D. All excel equations begin with an equals sign, so you should use one every time you do a new calculation. [13] X Research source"
    },
    {
      "title": "Type the letters SUM.",
      "content": "Type the letters SUM. This will indicate to the program that it will be calculating a sum (adding) equation."
    },
    {
      "title": "Fill in your equation.",
      "content": "Fill in your equation. The equation you will use to calculate your GPA will be determined by how many grades you have, but the basic format is =SUM(C1:C6)/6 . [14] X Research source C1 is the cell number (C- column, 1-row) of the first grade in your column. The number on the right side of the colon should be the cell number of the final grade on your list. The number after the slash should be the total number of courses that you are calculating. In this case, 6 courses are being calculated. If you have 10 courses listed, you will replace the 6 with a 10."
    },
    {
      "title": "Press the Enter key.",
      "content": "Press the Enter key. You should be greeted with a single number in the D column, which is your final calculated GPA."
    },
    {
      "title": "Know the kinds of classes you've got.",
      "content": "Know the kinds of classes you've got. Certain classes have weights which alter the 'strength' of the class. A regular (also called on-level) class is multiplied by 1, or left alone. A PAP (which stands for Pre-Advanced Placements which can also be called Honours) is multiplied by 1.05. An AP (Advanced Placement, also called College or College Level) is multiplied by 1.1. Let`s say a person N. has 5 classes, and these are his grades; PAP Literature=94, Regular Chemistry=87, AP World Civilizations=98, PAP Pharmaceuticals Training=82 and Track=100 (lf unspecified, assume regular)."
    },
    {
      "title": "Multiply the grades according to their weight.",
      "content": "Multiply the grades according to their weight. PAP Literature had a 94 which gets multiplied by 1.05 for 98.7%AJ (AJ=adjusted). Chemistry and Track are regular classes so they are left at their grades, respectively 87 and 100. PAP Pharmaceuticals Training is 82, multiplied by 1.05 is 86.1%AJ, and AP World Civilizations` 98 gets multiplied by 1.1 for a 107.8%AJ."
    },
    {
      "title": "Find the mean or average.",
      "content": "Find the mean or average. The formula is very simple; (g+g+g...)/#g, when g=grade. Or in words, add the grades and divide by the number of grades added together. So 98.7+87+100+86.1+107.8=479.58. 479.58/5=95.916. So after rounding, Perso N. has a 95.2 or 96 GPA Percentage. lf the number seems too high or too low, be sure to check your math. lf on a calculator, be sure to use parenthesis or mistakes may occur."
    }
  ]
}