{
  "url": "https://www.wikihow.com/Be-the-Cute-and-Hot-Teen-(Girls)",
  "title": "How to Be the Cute and Hot Teen (Girls)",
  "steps": [
    {
      "title": "Find your personal style.",
      "content": "Find your personal style. Look through magazines and fashion websites to identify some of the style icons you relate to the most. Then, when you're shopping for clothes and accessories, choose pieces that will help you get the look you're going for. When you know what style suits you the best, you'll be cuter—and hotter. [1] X Research source For instance, if you have more of a classic style, you might look to icons like Audrey Hebpurn, Michelle Obama, and Lily Collins. Opt for polished pieces like button-down shirts and A-line dresses. Also, stick to timeless accessories like pearl earrings, tennis bracelets, and loafers or flats. If your style is more bohemian, look for inspiration from figures like Stevie Nicks, Chaka Khan, and the Olsen Twins. For instance, you might wear flared jeans with a flowy top, sandals, and a long scarf, or you might opt for a belted maxi dress with sneakers, a floppy hat, and layered necklaces. If you consider yourself more daring and edgy, borrow inspiration from style icons like Rihanna, Zendaya, and Kylie Jenner. Mix and match your favorite pieces to create a look that's all your own. For instance, you might pair an oversized sweatshirt with a destroyed denim skirt, a cool pair of sneakers, and aviator sunglasses for a bold, unique outfit."
    },
    {
      "title": "Choose colors that flatter your skin tone.",
      "content": "Choose colors that flatter your skin tone . To find the colors that look best on you, take a good look at your skin. In addition to your complexion, or the shade of your skin, your skin tone is also determined by your undertones , which can be warm, cool, or neutral. Try looking at the veins under the skin on your wrist. If they look blue or purple, your skin tone is cool. If they're green, your skin tone is warm, and if they're purple, your skin tone is neutral. [2] X Research source If you have a warm skin tone, try wearing earth tones and warm shades like gold, mustard, beige, olive green, magenta, and chocolate brown. If your skin tone is cool, try wearing turquoise, rose pink, lilac, and cool neutrals like white and grey. If you have a neutral skin tone, you're lucky—you can wear pretty much any color you like!"
    },
    {
      "title": "Wear clothes that fit you neatly.",
      "content": "Wear clothes that fit you neatly. No matter what your style is, opt for clothing that skims close to your body without being too baggy or too tight. If your clothes are too tight, you'll look and feel uncomfortable, and it can be unflattering. If you wear something that's too big, you'll hide your figure, so you won't look as hot as if your clothing fits well. [3] X Research source To ensure your clothes fit well, try them on before you make a purchase. Don't just go by the number that's on the label—inconsistent sizing across the fashion industry means that you might wear very different sizes across different brands, or even within the same store. If you're deliberately wearing an item that's too big, try to balance it out so you can still show off your figure. For instance, wear a large sweater with leggings or skinny jeans, or belt a flowy maxi dress around the smallest part of your waist. If you have an item that fits well for the most part but is just a little off, consider having it professionally altered. For instance, you can hem a pair of jeans to the right length, or have a dress taken in to fit your waist ."
    },
    {
      "title": "Show a little skin, but not too much.",
      "content": "Show a little skin, but not too much. Being hot means being comfortable in your own skin, but if you want to balance cute and hot, you may not want to take that too far. If you're wearing one piece that's more revealing, opt for pieces that provide more coverage for the rest of your body. For instance, if you wear a crop top that shows your midriff, you might pair that with high-waisted jeans. If you're wearing short shorts, you could wear a flowy, high-necked blouse."
    },
    {
      "title": "Use accessories to jazz up any outfit.",
      "content": "Use accessories to jazz up any outfit. Sometimes it just takes a small detail to take a look from basic to amazing. Pick accessories that show off your personal style. However, try to keep your accessories balanced so they don't overwhelm your look. For instance, you might wear a stack of bangles and a cool ring to dress up your casual jeans-and-tee look. A long necklace, a pair of pretty earrings, and ankle boots will take a sweater-and-legging combo to the next level."
    },
    {
      "title": "Wash your face",
      "content": "Wash your face and moisturize twice a day. If you want to look your best, it's important to keep your skin healthy and glowing. Use a cleanser that's formulated for your skin type . Work the cleanser into a lather, then massage it into your face in a circular motion. When you're finished, rinse your face thoroughly and pat it dry. Follow that by applying a lightweight facial moisturizer. [4] X Research source For instance, if you have oily, acne-prone skin, you might use a foaming cleanser with salicylic acid to help fight breakouts. Then, you might use a lightweight water-based moisturizer that won't clog your pores. If your skin tends to be dry, use a moisturizing face wash and a hydrating facial cream."
    },
    {
      "title": "Use concealer and foundation to hide blemishes and smooth out your complexion.",
      "content": "Use concealer and foundation to hide blemishes and smooth out your complexion. While you don't have to wear makeup to be cute, it can be helpful if you have any skin concerns you want to hide. Use your fingers, a brush, or a makeup sponge to dab a little concealer on any blemishes or dark spots, or under your eyes if you have dark circles. Then, apply a light layer of foundation if you need to cover up any redness on your cheeks, nose, forehead, or chin. [5] X Research source Apply your foundation to the center of your face, then blend it outwards for the most natural look. The best way to match your foundation to your skin tone is to go to a beauty store and ask a consultant to help you. If you have oily skin, tend to sweat, or live in a humid climate, you can apply a thin layer of primer to your skin before your concealer and foundation. This can help keep it in place longer."
    },
    {
      "title": "Set your makeup with powder to keep it in place.",
      "content": "Set your makeup with powder to keep it in place. Once you've applied your foundation and concealer, use a brush or a powder puff to dust on translucent or tinted powder. This will help create a smooth base for the rest of your makeup, and it will also help set your makeup to help it last longer. [6] X Research source Make sure your powder matches your foundation perfectly if it's tinted."
    },
    {
      "title": "Brush on a little blush to make your cheeks look rosy and full.",
      "content": "Brush on a little blush to make your cheeks look rosy and full. When you apply blush to the fullest part of your cheeks, it can give you a soft glow that's essential to looking cute. Swirl a blush brush across your brush palette, then apply the blush to the tops of your cheeks in a circular motion. [7] X Research source Try using a rosy pink or peach-colored blush for a cute, youthful look."
    },
    {
      "title": "Use mascara, eyeliner, and eyeshadow to accentuate your eyes.",
      "content": "Use mascara, eyeliner, and eyeshadow to accentuate your eyes. Try showing off your eyes by dusting on a light layer of neutral eyeshadow onto your lids. Then, blend a slightly darker color into the crease. Line along your lash lines with an eyeliner that's close to the color of your eyelashes, then swipe brown or black mascara onto your lashes to make them look longer and thicker. If you're having a day where you want to channel more cute than hot, keep your eyeshadow subtle and use a lighter-hued eyeliner. For days when you're feeling a little more glam, use a darker eyeshadow color in your crease, and opt for darker eyeliner."
    },
    {
      "title": "Wear lip gloss or lipstick to draw attention to your mouth.",
      "content": "Wear lip gloss or lipstick to draw attention to your mouth. If the rest of your face is made up, it can look a little unbalanced if you don't wear anything on your lips. If you're going for more of a subtle look, apply a light layer of lip gloss or wear a nude-colored lipstick. For days when you're feeling bold, wear a brightly-colored or dark lipstick, instead. Experiment with different shades to see the ones you like best! For instance, you'll never know that you look great in bright red lipstick unless you try it on, first."
    },
    {
      "title": "Style your hair each day.",
      "content": "Style your hair each day. You don't necessarily have to spend hours straightening or curling your hair each day to look hot, but do take at least a little time to detangle and style your hair. Wash your hair every 2-3 days to keep it clean, and experiment with different hair styles and hair accessories to see what suits your style and face shape the best! For instance, if your hair is long, you might wear it down in loose waves or tight curls, up in a messy bun, or braided down your back. If you have short hair, you might wear a headband or a pretty barrette. For medium-length hair, trying wearing it half-up, half-down, styled with a side part, or pinned into a low bun."
    },
    {
      "title": "Be outgoing and friendly.",
      "content": "Be outgoing and friendly. You can be cute and still be shy, but coming across as hot usually takes a big dose of confidence. Smile and look people in the eyes when you greet them, and try to strike up conversations with a lot of different people throughout the day. When others see you being outgoing, you'll instantly seem hotter, just because of how self-assured you look! [8] X Research source Try to talk to people from all different social groups—don't just limit yourself to people who are like you! If you really want to give off hot-girl vibes, imagine that you're flirting with the people you're talking to. For instance, you might lightly touch someone on the shoulder when they're talking. However, don't go too far with this, since you don't want anyone to get the idea that you like them if you really don't."
    },
    {
      "title": "Act like you're confident even when you don't feel that way.",
      "content": "Act like you're confident even when you don't feel that way. You don't necessarily have to feel confident every second of the day to come across that way. Project confidence by sitting or standing with your back straight, shoulders back, and head up. When you're talking to someone, speak in a clear, steady voice, and take a few moments to think about what you're going to say first so you can deliver it with conviction. [9] X Research source Not only can these simple tricks help you look more confident, but they can actually make you feel more self-assured, as well!"
    },
    {
      "title": "Be kind towards others.",
      "content": "Be kind towards others. Just like having confidence is a major key to seeming hot, being kind is essential to coming across as cute. Avoid gossiping or talking bad about other people. Instead, look for ways to speak well of others, be friendly toward people who might not have a lot of friends, and be helpful whenever you see someone in need. For instance, if someone drops their notebook and papers fly all over the hallway, don't laugh at them or step on their papers. Instead, take a moment to help them gather everything up."
    },
    {
      "title": "Stay busy with extracurriculars.",
      "content": "Stay busy with extracurriculars. Cute, hot teenagers always seem to have somewhere to go, so don't just stay cooped up in your room after school. Try joining clubs, sports teams, or groups that match up with your interests. You'll get a chance to know people you might not have met otherwise, and pursuing what you love can help you look and feel more confident. For instance, if you love movies, you might join your school's film club. If you're always asking questions, the newspaper might be perfect for you. In addition to helping you make new friends, extracurriculars look great on a college application!"
    }
  ]
}