{
  "url": "https://www.wikihow.com/Clearer-or-More-Clear",
  "title": "Is It \"Clearer\" or \"More Clear\"?",
  "steps": [
    {
      "title": "Both “clearer” and “more clear” are perfectly acceptable.",
      "content": "Both “clearer” and “more clear” are perfectly acceptable. Although English grammar rules do say that “clearer” is the grammatically correct version, both expressions are frequently used in everyday conversations. [2] X Research source “Clearer” is used about twice as frequently as “more clear”, but both phrases will be easily understood. [3] X Research source As you’ll see in the sentences below, either flows nicely: “You cleaned the window? It looks clearer now!” vs “You cleaned the window? It’s more clear now!” “He explained the math problem really well. The steps are clearer to me now!” vs “He explained the math problem really well. The steps are more clear to me now!”"
    },
    {
      "title": "Comparative adjectives are used to compare two objects.",
      "content": "Comparative adjectives are used to compare two objects. [4] X Research source Clearer would be the comparative form of the word “clear”. Generally, if an adjective has only one syllable, it can be transformed into a comparative adjective by simply adding -er to the end. However, if an adjective has multiple syllables, you’ll have to add the word “more” before the adjective to make it comparative. Since clear has only one syllable, this is why “clearer” is more grammatically correct between “clearer” and “more clear”. The word “tall” has one syllable, so you would add -er to the end to make it a comparative adjective, like “Tim is taller than Jane.” The word “beautiful” has multiple syllables, so you would add “more” to the beginning of it to make it a comparative adjective, like “My house is more beautiful than yours.”"
    },
    {
      "title": "“More clearer” is incorrect.",
      "content": "“More clearer” is incorrect. Since clearer is already the comparative form of “clear”, and “more” is also used to make comparisons, using the two together would be repetitive and grammatically incorrect. [5] X Research source Incorrect: “Thanks for cleaning my glasses! They’re more clearer now.” Correct: \"Thanks for cleaning my glasses! They're more clear now\" or \"Thanks for cleaning my glasses! They're clearer now.\" [6] X Research source"
    },
    {
      "title": "“More clear” is not more formal than “clearer”.",
      "content": "“More clear” is not more formal than “clearer”. It’s a common misconception that “more clear” is a formal version of “clearer”, but because English grammar rules say “clearer” is the correct comparative form, “more clear” would actually be considered conversational and less formal. This is because “more clear” breaks English grammar rules, but is understood and accepted so well due to its frequency of use in everyday speech. [7] X Research source"
    }
  ]
}