{
  "url": "https://www.wikihow.com/Brainstorm",
  "title": "How to Brainstorm",
  "steps": [
    {
      "title": "Look at your goal.",
      "content": "Look at your goal. Before you look at what you want to do, think about what you're trying to achieve. This can give you a good starting point, a sort of light at the end of the tunnel. [1] X Research source Do you want to brainstorm for your business? Are you trying to make a big decision or life change? Are you trying to come up with an idea for your next work of art? Maybe you're trying to come up with an idea for an article you have to write?"
    },
    {
      "title": "Understand any requirements.",
      "content": "Understand any requirements. If you have a teacher, boss, client, or someone that will be evaluating your work, find out what they're expecting or what they need. If not, just think about the limitations you must work within and what the final product should accomplish. While breaking requirements can sometimes result in a better experience and final product, knowing all of the limitations will give you a good framework to start working in. [2] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source For example, do you need to keep to a certain budget? Do you need to use only certain materials? Does the project need to be done by a certain time? Do you need to do more research to better understand the needs and limitations of the project?"
    },
    {
      "title": "List out and evaluate your assumptions.",
      "content": "List out and evaluate your assumptions. You'll naturally be assuming some things about your project. What are people looking for? What are your limitations? What is acceptable or normal? What should it generally look like? List these assumptions so that you can play on them later. For example, with an art project, we might assume that people are looking for a particular color scheme that fits with the theme of a gallery show. For a business project, we might assume that customers are wanting a particular something that our competitor's product does not provide. If you are focusing on making a life change, list out the things you want to change and why. This may help you get to the heart of what you really want or need."
    },
    {
      "title": "Evaluate what you have to work with.",
      "content": "Evaluate what you have to work with. Take a hard look at what you've done in the past, what you've done already, and what you have available to you in terms of resources. This will help give you some boundaries to work with. What kind of tools do you have to use? What materials or people have you not made use of in a long time? What was something you tried last year and how could it be better? Ask others for their opinions."
    },
    {
      "title": "Do some research.",
      "content": "Do some research. Do some research on what people working on similar projects have been doing. Google is your friend in this adventure. You should not be looking at what others are doing in order to copy them. Instead, you should be seeing where their ideas fall short or what pieces of their project might fit into yours. [3] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source"
    },
    {
      "title": "Look at what the innovators are doing.",
      "content": "Look at what the innovators are doing. Once you see what run-of-the-mill folks are doing, find out what the innovators are doing. Seek out the cutting edge and fringe ideas or techniques that other people are experimenting with. You might want to similarly experiment! Such innovation can set you apart, making what you do unique, memorable, and appealing."
    },
    {
      "title": "Go somewhere.",
      "content": "Go somewhere. Get outside of your usual environment. This is a great way to break yourself out of the standard creation loop and think of things that you've never thought of before. Go for a walk, go to a local artisan or farmer's market, or work in a cafe for a while. Any change of environment can help you think in different ways. [4] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source"
    },
    {
      "title": "Keep a journal next to your bed.",
      "content": "Keep a journal next to your bed. Always have a journal next to your bed. You'll also want to keep a waterproof note-taking option in your shower area. Good ideas often sneak up on us when we're doing these other activities, but then get lost as we get distracted with whatever else it is we're doing. By having a pen and paper nearby, you'll be able to quickly jot down the things you think of before they fly away!"
    },
    {
      "title": "Take breaks!",
      "content": "Take breaks! It's important to take breaks, to keep your mind clear of negative response loops. A lot of the time, when you're thinking and coming up with nothing, you get too focused on the fact that you're coming up with nothing, making it impossible to really think. [5] X Research source Try having a healthy snack, catch up with a coworker, or do a quick chore (such as cleaning up your mess from dinner)."
    },
    {
      "title": "Shut out criticism.",
      "content": "Shut out criticism. During the brainstorming process, criticism isn't helpful. You'll need the freedom of minimal boundaries in order to get to new ideas. Leave criticism for once you have a long list of possibilities. [6] X Research source If you're brainstorming with other people, you might need to remind some people to keep negative opinions to themselves until the brainstorming activity is done. Try to frame your brainstorming as your time to collect new ideas and materials. You can and should sort through them later, but allow your brainstorming time to be dedicated simply to taking them in."
    },
    {
      "title": "Warm up.",
      "content": "Warm up. Don't try to brainstorm with just a cold start. This is like breaking out into a full run without a light jog first! Do a quick exercise that gets your head in that space, such as making a menu for your next week's worth of dinners, or coming up with a wish list of things you'd like to accomplish in work, school, or whatever it is you're doing."
    },
    {
      "title": "Change your perspective.",
      "content": "Change your perspective. Put yourself in the shoes of your competitor, looking at what you're doing now and trying to figure out how to be better than you. How would they look at what you're doing and do things better? What would they change? Where would they go next?"
    },
    {
      "title": "Introduce roadblocks.",
      "content": "Introduce roadblocks. Giving yourself new roadblocks to reaching your goals, such as a lower budget, a new deadline, or a specific material to be used, can make you more creative and innovative. It may even give you an idea if you couldn't come up with one before."
    },
    {
      "title": "Make a mind map.",
      "content": "Make a mind map. Mind maps are one of the most popular brainstorming techniques. This is where you write down an idea (or several!) on a notecard. Pin the notecard to a wall and then build on the idea. Write down every little thing you think of and start connecting the ideas."
    },
    {
      "title": "Create idea categories.",
      "content": "Create idea categories. Create three categories: easy ideas, tough ideas, and crazy ideas. Try to come up with at least five ideas for each category. Usually, in coming up with ideas we think we can't or shouldn't actually carry out, we find ourselves with ideas that we actually can use."
    },
    {
      "title": "Write a poem",
      "content": "Write a poem , analysis , or review . Write a poem that describes what you're trying to do. You can also write a theoretical analysis or review of the thing you're hoping to create. By outlining what you're hoping to get out of the project, you may have an easier time thinking of ways to do it."
    },
    {
      "title": "Bring an old technique into the new age.",
      "content": "Bring an old technique into the new age. Take something you've done before, a long time ago, and find a way to update it. You can also take old concepts that aren't yours and find a way to bring them into this era. For example, Twitter was basically telegrams for the internet. Some of the most popular products right now make use of classic designs."
    },
    {
      "title": "Use an online idea generator.",
      "content": "Use an online idea generator. Online idea generators can be really helpful in getting you started, even if it's just used as a warm-up. Don't feel burdened by or tied to the ideas that it gives you, but try to use them as a jumping-off point. Try this: http://ideagenerator.creativitygames.net/"
    },
    {
      "title": "Keep asking questions.",
      "content": "Keep asking questions. Always ask questions. Ask questions of yourself. Ask questions of the people you're brainstorming with. Ask questions of your friends and family members. Questions lead us to really think through things that we might have glazed over in our minds. Ask detailed questions and questions that really get at the heart of the issue. And don't go for the short, obvious answer. Why do I want to paint with oils? Why does my customer want this product? You can even incorporate these questions into your mind map. You won't have all the answers yet because you're just starting your project, but you will be able to chart your thoughts."
    },
    {
      "title": "Don't waste time.",
      "content": "Don't waste time. There are lots of little exercises, like mind maps, that can be really useful. But a lot of the time they're also a distraction and can hold you back from really getting work done. Don't waste too much time on brainstorming activities, and instead try to just get down to business as quickly as possible."
    },
    {
      "title": "Do some free-writing.",
      "content": "Do some free-writing. Freewriting is where you start writing and you just don't stop. This also involves some free association, where you naturally follow the course that your thoughts take instead of trying to direct the current. Just write down a sentence that deals with the topic you're trying to brainstorm on and then follow your brain, writing down every word that ambles through your internal dialogue without stopping to think. You never know where it will lead you! [7] X Research source"
    }
  ]
}