{
  "url": "https://www.wikihow.com/Clean-a-Vornado-Fan",
  "title": "How to Clean a Vornado Fan",
  "steps": [
    {
      "title": "Clean out dust in the outer grills using a vacuum cleaner brush.",
      "content": "Clean out dust in the outer grills using a vacuum cleaner brush. Turn the fan off before doing anything else. You can use a brush attachment on a vacuum cleaner to clean out all of the dust from the outer grills. Make sure the fan is unplugged before vacuuming. Go slowly when vacuuming to ensure you clean out as much dust as possible. [1] X Expert Source Alicia Sokolowski Green Cleaning Specialist Expert Interview. 15 September 2020. This will only clean the outer part of the fan, not the inside blades."
    },
    {
      "title": "Use compressed air if you want to target specific dust spots.",
      "content": "Use compressed air if you want to target specific dust spots. If you have an air compressor, you can use it to clean out your tower fan. You can also buy a can of compressed air to clean out the fan, simply pointing the nozzle at the dust and spraying air through the vents to clean them out. Make sure to take your tower fan outside — keeping it unplugged — before using an air compressor or compressed air can so that dust isn’t flying around your house. Follow the instructions for the air compressor or compressed air can carefully. Don’t shake your can of compressed air. Air compressors can cost anywhere from $50-$500, while compressed air cans cost $10-$20. They can be bought at a home improvement store or online. Wear a mask to prevent yourself from breathing in dust or dirt."
    },
    {
      "title": "Blow away dust if you have a leaf blower.",
      "content": "Blow away dust if you have a leaf blower. If you have access to a leaf blower, you can use it to blow away dirt and dust particles from the tower fan. Blow the air inside of the grill of the fan after you’ve turned on the blower. Take the fan outside to use the leaf blower, and make sure the fan stays unplugged. This is a more heavy-duty method — you won’t be able to blow specific spots, but it should ensure maximum coverage. Wearing a mask and safety glasses will prevent dirt from getting into your eyes, nose, or mouth."
    },
    {
      "title": "Wipe down the outer body of the fan using a cloth.",
      "content": "Wipe down the outer body of the fan using a cloth. Use a soft, clean cloth or rag to wipe down the outside of the tower fan. This will get rid of any remaining dust or dirt particles. You don't need to use any water or cleaning chemicals when wiping down the fan. [2] X Expert Source Alicia Sokolowski Green Cleaning Specialist Expert Interview. 15 September 2020. A duster would help clean your fan as well."
    },
    {
      "title": "Use a handheld vacuum or feather duster for general cleaning.",
      "content": "Use a handheld vacuum or feather duster for general cleaning. Use a handheld vacuum to suck up dust particles on the outer section, or inlet ribs, of the box fan. You can also use a feather duster to wipe away dust or dirt. Make sure the fan is unplugged before cleaning, and don’t use any water on the outer ribs. [3] X Research source Wipe away tough dirt spots with a clean cloth."
    },
    {
      "title": "Remove the grill to clean the fan thoroughly.",
      "content": "Remove the grill to clean the fan thoroughly. To remove your fan’s grill, follow the instructions related to the specific model of Vornado box fan. You will most likely need to remove screws around the grill and release the grill clips. [4] X Expert Source Alicia Sokolowski Green Cleaning Specialist Expert Interview. 15 September 2020. You can find instructions on how to remove the grill in your owner’s manual or online."
    },
    {
      "title": "Clean the grill by dusting it or washing it with dish soap.",
      "content": "Clean the grill by dusting it or washing it with dish soap. Once the grill has been properly removed, you can dust it using a cloth or feather duster. If you’d rather wash it, it's okay to use water on the grill. Use dish soap and water to get rid of any dust and dirt particles. [5] X Research source Never put the grill in the dishwasher to prevent it from warping due to the heat."
    },
    {
      "title": "Wipe down the blades using a damp cloth.",
      "content": "Wipe down the blades using a damp cloth. To clean the blades, use a soft cloth dampened with plain water to wipe off any dust particles. Using water on the blades is okay, just make sure to dry them off. If your fan was in a greasy environment like a kitchen, you can use a mild soap to wash the blades. [6] X Research source"
    },
    {
      "title": "Put the fan back together once it's completely dry.",
      "content": "Put the fan back together once it's completely dry. Once all of the pieces have dried off, reassemble the fan by screwing the grill back into place using the screws you took out. If you need help, refer to the fan's instruction manual. Make sure the blades and grill are completely dry before reattaching the pieces and plugging the fan into an outlet."
    }
  ]
}