{
  "url": "https://www.wikihow.com/Break-in-Patent-Leather-Shoes",
  "title": "How to Break in Patent Leather Shoes",
  "steps": [
    {
      "title": "Buy shoes that fit well.",
      "content": "Buy shoes that fit well. Minimize the need for stretching or breaking in by getting patent leather shoes that are already a good fit for you. Since patent leather is stiff and unforgiving, you're not going to be able to change the fit very much – maybe a quarter of a shoe size, at most. [3] X Research source Have yourself fitted for shoes in the store, and try on a few pairs before you buy. [4] X Expert Source Penny Simmons Shoe Care Specialist Expert Interview. 19 November 2020. Look out for the following when you try on patent leather shoes: [5] X Research source Make sure that your toes do not feel squeezed or crushed. Pick a shoe that is comfortable in the heel. The back of the shoe should not rub your heel or slip off when you walk. Make note of how the shoe feels around the ball of your foot. This is the widest part of your foot, so look for a shoe that allows the ball of your foot to sit comfortably. Test out the shoes with the kind of socks you would normally wear with those shoes. Make sure they fit comfortably with your usual socks. Try out the shoes at the end of the day, when you're a little more tired. That way, you'll get a better idea of how it'll feel to be on your feet for a long time and wear the shoes. [6] X Expert Source Penny Simmons Shoe Care Specialist Expert Interview. 19 November 2020."
    },
    {
      "title": "Increase the wear time gradually, by 10-minute increments.",
      "content": "Increase the wear time gradually, by 10-minute increments. You may be tempted to immediately take your new shoes for a night out on the town, but this is a recipe for aching feet. Buy your patent leather shoes in advance of when you plan to wear them, and spend a few days wearing them for short periods at home or at work. [7] X Expert Source Marc Sigal Shoe Care Specialist Expert Interview. 15 January 2020. Start by wearing them for 10 minutes at a time, and then increase your wear time by another 10 minutes. Keep doing this over several days until you are comfortable wearing (and walking around in) the shoes for a full hour. The total break-in time will depend on a lot of factors, including what kind of material the sole is made of and how well the shoes fit to begin with. Your shoes may take anywhere from a few days to a few weeks to feel comfortable. Shoes with leather soles take longer to break in than shoes with rubber soles. The first time you wear your shoes out, try to keep your wear time to no more than 2-3 hours."
    },
    {
      "title": "Wear your shoes with thick socks 1-2 hours a day for a few days.",
      "content": "Wear your shoes with thick socks 1-2 hours a day for a few days. Thick socks can both stretch the shoes and protect your feet from pinching and blisters as your shoes adjust to your feet (and vice versa). Spend a couple of hours every day wearing your shoes around the house with thick socks. Eventually, the shoes should expand a little and feel more comfortable with regular socks or stockings on. [8] X Research source"
    },
    {
      "title": "Pad the problem areas to prevent blisters and pain.",
      "content": "Pad the problem areas to prevent blisters and pain. While you and your shoes are adjusting to each other, you can minimize your discomfort by putting protective coverings on sensitive spots, such as your heels and any corns or bunions. [9] X Research source Check your pharmacy or shoe store for products that fit your needs, such as: Blister cushions Bunion pads Adhesive bandages Surgical tape"
    },
    {
      "title": "Hydrate your feet to reduce friction.",
      "content": "Hydrate your feet to reduce friction. A lot of shoe-related discomfort is caused by shoes rubbing on your feet. Minimize blisters and friction-related pain by rubbing a little lotion, petroleum jelly, or antiperspirant on your feet before slipping on your shoes. Focus on the spots that tend to get the most irritated. [10] X Research source"
    },
    {
      "title": "Give your feet a break if they start to hurt.",
      "content": "Give your feet a break if they start to hurt. If your feet start to hurt or develop blisters, give them some time to heal before you wear the shoes again. Consider bringing a comfortable pair of shoes to change into if you have to wear your patent leather shoes for a long stretch of time during the break-in period. It's also a good idea to keep adhesive bandages and blister cushions on you, in case you end up stuck without a change of shoes."
    },
    {
      "title": "Store your shoes on a shoe tree to help them keep their shape.",
      "content": "Store your shoes on a shoe tree to help them keep their shape. Any time you're not wearing your shoes, put them on a shoe tree. A shoe tree is a foot-shaped device, much like a shoe stretcher. The shoe tree will help maintain your shoe's shape when it is not in use, which is very helpful during the break-in period. Shoe trees are variable in price and design, but tend to cost anywhere from US$10 to US$35. Some shoe trees also function as shoe stretchers."
    },
    {
      "title": "Put on a pair of thick socks.",
      "content": "Put on a pair of thick socks. Use some heavy thermal socks, or layer on a few pairs of regular cotton crew socks. The thick socks will help force your shoe open a little wider as you stretch it. [11] X Research source"
    },
    {
      "title": "Put on your patent leather shoes.",
      "content": "Put on your patent leather shoes. Once the socks are on, squeeze your feet into the shoes you wish to stretch. [12] X Research source This may take a bit of effort, but the thick socks will help protect your feet from rubbing and pinching."
    },
    {
      "title": "Blow hot air onto your shoe with a hair dryer in 20-second bursts.",
      "content": "Blow hot air onto your shoe with a hair dryer in 20-second bursts. With your shoes and socks on, gently pass hot air from a hair dryer over the tight parts of your shoe. Set the dryer on medium heat. [13] X Research source Don't do this for more than 20 seconds at a time, since too much heat can damage the leather and the finish. Let your shoes cool down for a bit, and then go over them again. Aim for a total heating time of 2-3 minutes."
    },
    {
      "title": "Move and stretch your feet as you heat your shoes.",
      "content": "Move and stretch your feet as you heat your shoes. While you are applying the heat, flex your feet inside the shoes. Getting the leather moving will help soften it up and make it more pliable. [14] X Research source"
    },
    {
      "title": "Let your shoes cool off on your feet.",
      "content": "Let your shoes cool off on your feet. Don't yank off your shoes as soon as you're done blasting them with hot air. Allowing the shoes to cool with your feet still in them will help them conform to the size and shape of your feet. [15] X Research source Walking around while your shoes are cooling can also help loosen up the leather and mold it to your foot."
    },
    {
      "title": "Try your shoes on with regular socks after they've cooled.",
      "content": "Try your shoes on with regular socks after they've cooled. After you've blasted your shoes with heat a few times and allowed them to cool off, take off your shoes and strip off the extra thick socks. Try your shoes on again with the socks or stockings you would normally wear, and see how they fit. [16] X Research source If they still feel a bit tight, repeat the heat treatment. You may need 2-3 treatments to see a difference."
    },
    {
      "title": "Stretch problem spots with a ball-and-ring stretcher.",
      "content": "Stretch problem spots with a ball-and-ring stretcher. A ball-and-ring stretcher, which looks a bit like a giant pair of pliers, gives a targeted stretch on one particular part of the shoe (e.g., over a bunion). Put a plastic sandwich bag over your shoe to protect the finish. Insert the ball part of the stretcher into the shoe at the point where you want to stretch it out, and squeeze the stretcher shut. Tighten the clamp on the handles to hold it in place, and leave overnight. [17] X Research source Since patent leather shoes are pretty inflexible, you may need to repeat this process several times to get enough stretch. You'll notice a bump on your shoe after you take off the stretcher. As you wear the shoe, this bump will eventually disappear. Ball-and-ring stretchers can be pricey, with less expensive models starting at around US$40, and more expensive models running around US$70."
    },
    {
      "title": "Add length and width with a 2-way shoe stretcher.",
      "content": "Add length and width with a 2-way shoe stretcher. Two-way shoe stretchers fit into your shoe like a foot, and can be expanded length- and width-wise. Insert the shoe stretcher into your shoe, and slowly turn the crank to expand the stretcher inside the shoe. Once you have opened up the stretcher to the desired length and width, leave it in the shoe for 24-48 hours. Repeat as needed. [18] X Research source Take care not to stretch your shoe too much or too quickly, or you may damage the shoe. Gradually add more stretch by expanding the stretcher with one full turn of the crank once every 8 hours. Two-way shoe stretchers come in a variety of styles, and some can be fitted with “pressure relief pods” to target problem areas. Lower-end models start around US$10 and more expensive models cost around US$50."
    },
    {
      "title": "Use a sock or some newspaper for a more gentle stretch.",
      "content": "Use a sock or some newspaper for a more gentle stretch. If you're afraid that a shoe stretcher might be a bit too harsh on your delicate patent leathers, you can gently expand the inside of your shoe by pushing a rolled-up sock, some wadded up newspaper, or even a foot-sized potato into the toe and leaving it overnight."
    },
    {
      "title": "Apply shoe-stretching sprays with caution.",
      "content": "Apply shoe-stretching sprays with caution. There are a variety of shoe-stretching sprays and treatments available to condition leather and make it easier to stretch. [19] X Research source However, the special plastic finish on patent leather shoes may limit the effectiveness of this treatment. If you choose to try shoe-stretching spray, check the label to make sure the product is safe for use on patent leather."
    },
    {
      "title": "Leave it to the professionals if you're worried about your shoes.",
      "content": "Leave it to the professionals if you're worried about your shoes. [20] X Expert Source Marc Sigal Shoe Care Specialist Expert Interview. 15 January 2020. If you're not confident in your ability to stretch your shoes without damaging them, take them to a shoe repair professional. Someone who is experienced in handling delicate and expensive shoes may have a better idea of how much stretching your shoes can take, and what techniques will work best to get the desired result. [21] X Expert Source Penny Simmons Shoe Care Specialist Expert Interview. 19 November 2020."
    }
  ]
}