{
  "url": "https://www.wikihow.com/Activate-a-Replacement-Verizon-Wireless-Phone",
  "title": "How to Activate a New Verizon Phone",
  "steps": [
    {
      "title": "Make sure you know your account holder's PIN.",
      "content": "Make sure you know your account holder's PIN. If your new phone is activation-locked, you'll be prompted for the four-digit PIN that you use to log into Verizon services (or identify yourself in Verizon stores). If you aren't the account holder, speak to the Verizon account holder for your plan to obtain the code. You may instead need to know the last four digits of the account holder's Social Security Number."
    },
    {
      "title": "Ensure that you have an account for your phone.",
      "content": "Ensure that you have an account for your phone. If you're switching over to an iPhone or an Android smartphone, you'll need to have an iCloud or a Gmail account set up, respectively. If you don't already have such an account, set one up before proceeding: iPhone — Create an iCloud account for your iPhone. Android — Create a Gmail account for your Android."
    },
    {
      "title": "Back up your old phone.",
      "content": "Back up your old phone. If you want to save your contacts and other information on your phone, back the information up before proceeding. This process will vary depending on your current smartphone: iPhone — You can use iCloud or use iTunes to back up an iPhone. Android — You can use your Android's settings to back it up."
    },
    {
      "title": "Turn off iMessage if necessary.",
      "content": "Turn off iMessage if necessary. If you're switching from an iPhone to an Android smartphone (or a flip phone), you'll need to disable iMessage on your iPhone before proceeding: [1] X Research source Open Settings. Scroll down and tap Messages Tap the green \"iMessage\" switch."
    },
    {
      "title": "Turn off your old phone.",
      "content": "Turn off your old phone. Press and hold the phone's \"Power\" button, then select the Power Off option if prompted. For some phones, holding the \"Power\" button for long enough will turn off the phone."
    },
    {
      "title": "Remove the old phone's SIM card",
      "content": "Remove the old phone's SIM card . This is only necessary if you want to use the same phone number on your new phone as you used on your old phone. Skip this step if you're using a brand-new SIM card from Verizon."
    },
    {
      "title": "Insert the SIM card into your new iPhone",
      "content": "Insert the SIM card into your new iPhone . It will only fit one way into your iPhone's SIM tray."
    },
    {
      "title": "Turn on your new iPhone.",
      "content": "Turn on your new iPhone. Press and hold the iPhone's \"Power\" button, which is in the upper-right corner of the iPhone's housing, until you see the Apple logo appear. If you see a battery outline appear instead, or if the screen doesn't light up, you'll need to attach your iPhone to a charger ."
    },
    {
      "title": "Enter your Verizon PIN if prompted.",
      "content": "Enter your Verizon PIN if prompted. This is the four-digit code your account holder uses to identify themselves to Verizon. You may instead be prompted for the last four digits of the account holder's Social Security Number. You won't always be asked for the Verizon PIN, so don't worry if you don't see this option."
    },
    {
      "title": "Follow the on-screen setup instructions.",
      "content": "Follow the on-screen setup instructions. Once your iPhone is on, you will arrive at a greeting screen. You can then follow the on-screen prompts to set up your iPhone, which will include customizing the following: Language Country Wi-Fi network Location settings Passcode"
    },
    {
      "title": "Restore your backup.",
      "content": "Restore your backup. When you arrive at the backup page, you can restore your previous iPhone's backup by tapping Restore from iCloud Backup (or Restore from iTunes Backup ) and following the on-screen instructions. [2] X Research source If your previous phone wasn't an iPhone, you'll need to sync your contacts later instead."
    },
    {
      "title": "Complete the rest of the setup.",
      "content": "Complete the rest of the setup. Follow the rest of the on-screen instructions to finish setting up your iPhone."
    },
    {
      "title": "Tap Get Started when prompted.",
      "content": "Tap Get Started when prompted. This option will appear when the setup process is complete. Once you tap this button, you will see a progress bar at the top of the screen; when the activation is complete, the progress bar will disappear and the word \"Verizon\" will appear at the top of the screen. [3] X Research source If you are asked if you want help from Siri, just tap Dismiss . The activation process can take several minutes."
    },
    {
      "title": "Activate 4G or a pre-paid service plan.",
      "content": "Activate 4G or a pre-paid service plan. Depending on your service plan and the SIM card you're using, you may need to activate one or both of these options: [4] X Research source Activate 4G — Dial (877) 807-4646 on a different phone, then follow the spoken prompts. Skip this step if you used your old phone's SIM card. Activate a Pre-Paid Plan — Dial *22898, then follow the spoken prompts. Skip this step if you were prompted for your pre-paid plan information during setup."
    },
    {
      "title": "Contact Verizon if you run into trouble.",
      "content": "Contact Verizon if you run into trouble. If you can't activate your replacement phone, call (800) 922-0204 to speak with a Verizon support. You can also visit a Verizon retail outlet to have the employees activate your iPhone for free."
    },
    {
      "title": "Insert your SIM card into the new Android",
      "content": "Insert your SIM card into the new Android . Your SIM card should only insert one way."
    },
    {
      "title": "Insert the new Android's battery if necessary.",
      "content": "Insert the new Android's battery if necessary. Since some Android phones come without the battery attached, you may need to plug the battery into the back of the Android before proceeding. Consult your smartphone's manual for specific instruction on battery installation if you need help."
    },
    {
      "title": "Turn on your new Android.",
      "content": "Turn on your new Android. Press and hold the Android's \"Power\" button until the screen lights up. If the screen doesn't light up or if you see a battery icon, you'll need to hook up your Android to a charger before trying again."
    },
    {
      "title": "Enter your Verizon PIN if prompted.",
      "content": "Enter your Verizon PIN if prompted. This is the four-digit code your account holder uses to identify themselves to Verizon. You may instead be prompted for the last four digits of the account holder's Social Security Number. You won't always be asked for the Verizon PIN, so don't worry if you don't see this option."
    },
    {
      "title": "Follow the on-screen setup instructions.",
      "content": "Follow the on-screen setup instructions. These will differ for each Android, but you'll usually have to sign into your Gmail account, set a passcode, select a Wi-Fi network, and so on."
    },
    {
      "title": "Restore your backup.",
      "content": "Restore your backup. If prompted to restore your Google backup, follow the on-screen instructions."
    },
    {
      "title": "Select the link to activate your phone when prompted.",
      "content": "Select the link to activate your phone when prompted. Again, the screens are different on every phone, but once the initial setup is complete, you will arrive at a screen that says something like Activate Now . The activation process may take a few moments to complete. [5] X Research source When the phone is activated, you will see the word “Verizon” at the top of the screen. You may be prompted to restore your Android at this point if you weren't already prompted to do so."
    },
    {
      "title": "Activate 4G or a pre-paid service plan.",
      "content": "Activate 4G or a pre-paid service plan. Depending on your service plan and the SIM card you're using, you may need to activate one or both of these options: Activate 4G — Dial (877) 807-4646 on a different phone, then follow the spoken prompts. Skip this step if you used your old phone's SIM card. Activate a Pre-Paid Plan — Dial *22898, then follow the spoken prompts. Skip this step if you were prompted for your pre-paid plan information during setup."
    },
    {
      "title": "Contact Verizon if you run into trouble.",
      "content": "Contact Verizon if you run into trouble. If you can't activate your replacement phone, call (800) 922-0204 to speak with a Verizon support. You can also visit a Verizon retail outlet to have the employees activate your Android for free."
    },
    {
      "title": "Back up your current phone.",
      "content": "Back up your current phone. If your phone has Verizon Backup Assistant, open it and follow the on-screen instructions to make a backup of your phone's contacts and other information. [6] X Research source You may also be able to attach your phone's SD card to a computer and copy its contents into a folder there."
    },
    {
      "title": "Turn off your current phone.",
      "content": "Turn off your current phone. Press and hold the Power or End button to do so."
    },
    {
      "title": "Install and charge the battery in your new phone.",
      "content": "Install and charge the battery in your new phone. Depending on the phone you're using, you might skip this step. Consult your phone's manual for specific steps on installing the battery and charging the phone if necessary. You shouldn't need to insert a SIM card into your phone if it's a flip phone. [7] X Research source"
    },
    {
      "title": "Turn on your new phone.",
      "content": "Turn on your new phone. Press and hold the phone's Power or Send button until the screen lights up."
    },
    {
      "title": "Dial the update number.",
      "content": "Dial the update number. Open the phone's dialer if necessary, then use the dial pad to type in *228 and press Send . [8] X Research source"
    },
    {
      "title": "Follow any on-screen or spoken prompts.",
      "content": "Follow any on-screen or spoken prompts. This will allow you to register your new flip phone with the most up-to-date directory."
    },
    {
      "title": "Restore your old phone's backup.",
      "content": "Restore your old phone's backup. If your new phone supports Verizon Backup Assistant, open it and follow the on-screen instructions to download your data."
    },
    {
      "title": "Activate a pre-paid service plan.",
      "content": "Activate a pre-paid service plan. If you're using a pre-paid plan on your phone, dial *22898 and follow any prompts to set up the plan as necessary."
    },
    {
      "title": "Contact Verizon if you run into trouble.",
      "content": "Contact Verizon if you run into trouble. If you can't activate your replacement phone, call (800) 922-0204 to speak with a Verizon support. You can also visit a Verizon retail outlet to have the employees activate your flip phone for free."
    }
  ]
}