{
  "url": "https://www.wikihow.com/Celebrate-Friendship-on-Facebook",
  "title": "How to Celebrate Friendship on Facebook",
  "steps": [
    {
      "title": "Navigate to your News Feed on your computer or device.",
      "content": "Navigate to your News Feed on your computer or device. Log in to Facebook with your username and password. Logging in should automatically take you to your News Feed. You can also click on either “Home” or the Facebook logo on the top bar of the Facebook website. For the mobile device site or Facebook app, click on the News Feed logo in the top or bottom left of your screen."
    },
    {
      "title": "Click on “On This Day” on the left hand side of your screen.",
      "content": "Click on “On This Day” on the left hand side of your screen. On This Day is listed under the “Explore” tab on the website. It should be about halfway down your screen. [1] X Research source For the mobile device site or Facebook app, click on the three bars tab to find the On This Day page. It’ll be listed under “Apps” or “Explore.”"
    },
    {
      "title": "View your memories from the day and select one to share.",
      "content": "View your memories from the day and select one to share. On This Day will list examples of your Facebook activity from this date since you became a Facebook user. At the bottom of the page, you’ll also see other memories Facebook thinks you might enjoy. Look for a “Share” button at the bottom of each post. You can then decide who you’d like to share the content with. [2] X Research source If the post was originally private, you won’t be able to share it. This is why you won’t see a “Share” option on some posts. Sharing an On This Day post will make it appear on the News Feeds of whoever you decide to share it with. You can also tag friends in the post and say something about the memory when you share it. Only you will see On This Day posts unless you share them."
    },
    {
      "title": "Share an anniversary video on the day you became Facebook friends.",
      "content": "Share an anniversary video on the day you became Facebook friends. Occasionally, On This Day will tell you that you became Facebook friends with someone on this date a certain number of years ago. When that happens, Facebook may make a video compiling examples of your Facebook interaction and friendship. This post is extra special, and you should share it to show your friend how excited you are about your friendship! [3] X Research source Be aware that Facebook only automatically generates these videos for friends you connect with a lot. They won’t come up for everyone. [4] X Research source Unfortunately, anniversary videos aren’t available all the time. The videos will also automatically delete at the end of the day."
    },
    {
      "title": "Filter your memories if you’d like to.",
      "content": "Filter your memories if you’d like to. Sometimes, Facebook may accidentally celebrate moments you’d rather forget. On This Day gives you the option to exclude certain people and dates from the feature. Just click on “Preferences” once you’re on the On This Day page and select the people and/or dates you don’t want Facebook to commemorate. [5] X Research source No one but you needs to know that you’ve excluded them from this feature. Your friend won’t get an online notification that you’ve made this choice."
    },
    {
      "title": "Refresh your News Feed each day.",
      "content": "Refresh your News Feed each day. Most On This Day features and other memory recaps will appear in your News Feed. To make sure you don’t miss an opportunity to celebrate a friendship, check your feed once each day."
    },
    {
      "title": "Share a recap of memories compiled by Facebook.",
      "content": "Share a recap of memories compiled by Facebook. At the top of your Feed, you may occasionally see that Facebook has put together a collection of memories from the past month, year, or season. These collections will generally include photos that you’ve either posted or been tagged in. Each memory recap includes an option to share at the bottom of the post. [6] X Research source You can also include a message like “I had such an amazing summer spending time with my friends Kayla and Emma!”"
    },
    {
      "title": "Check to see if you have a celebratory message from Facebook.",
      "content": "Check to see if you have a celebratory message from Facebook. Facebook may also let you know when you’ve reached a new and exciting benchmark with your Facebook friends. These messages will also appear at the top of your News Feed. For now, only you can see these celebrations. But if you want to share them, take a screenshot and post a pic! [7] X Research source These benchmarks might be something like making 100 Facebook friends or having friends like your posts 1000 times. Facebook may eventually make these celebrations shareable as well."
    },
    {
      "title": "Stay up to date on Facebook’s new features.",
      "content": "Stay up to date on Facebook’s new features. Facebook is constantly coming up with new ways to celebrate your friendship using their site or app. On This Day is only 2 years old! To be sure you’re staying up to date, Google “new Facebook features” every month or so. [8] X Research source"
    }
  ]
}