{
  "url": "https://www.wikihow.com/Block-Internet-Ads",
  "title": "How to Block Internet Ads",
  "steps": [
    {
      "title": "Open Google Chrome .",
      "content": "Open Google Chrome . Its app icon resembles a red, yellow, green, and blue sphere."
    },
    {
      "title": "Open uBlock's website.",
      "content": "Open uBlock's website. Go to https://www.ublock.org/ to do so."
    },
    {
      "title": "Click Download.",
      "content": "Click Download . It's a green button in the middle of the page. Doing so prompts a menu to appear below the Download button."
    },
    {
      "title": "Click Chrome.",
      "content": "Click Chrome . This option is in the menu below the Download button. The uBlock extension page will open."
    },
    {
      "title": "Click ＋ ADD TO CHROME.",
      "content": "Click ＋ ADD TO CHROME . It's a blue button in the upper-right corner of the extension window."
    },
    {
      "title": "Click Add extension when prompted.",
      "content": "Click Add extension when prompted. Doing so will install uBlock for Google Chrome."
    },
    {
      "title": "Right-click the uBlock icon.",
      "content": "Right-click the uBlock icon. It's the maroon stop sign-shaped icon in the top-right corner of the Chrome window. Doing so will prompt a drop-down menu. If you don't see the icon here, first click ⋮ in the top-right corner of the Chrome window. You should see the uBlock icon at the top of the resulting drop-down menu. If you can't right-click the icon, click ⋮ , select More tools , click Extensions , and find the \"uBlock\" heading."
    },
    {
      "title": "Click Options.",
      "content": "Click Options . It's in the drop-down menu. This will open the uBlock settings menu. If you had to go to the Extensions page instead, you'll find Options below the uBlock heading."
    },
    {
      "title": "Click the 3rd-party filters tab.",
      "content": "Click the 3rd-party filters tab. It's at the top of the settings page."
    },
    {
      "title": "Click Update now.",
      "content": "Click Update now . You'll find this in the upper-left corner of the page. Doing so will ensure that all of uBlock's filters are up-to-date. Your browsing should now be relatively ad-free. You can check filter boxes on the 3rd-party filters page to add specific types of blocking to your browser, though doing this enough will eventually slow down your browsing speed."
    },
    {
      "title": "Open Firefox.",
      "content": "Open Firefox. Its app icon resembles an orange fox wrapped around a blue globe."
    },
    {
      "title": "Open the uBlock Origin site.",
      "content": "Open the uBlock Origin site . While the uBlock ad-blocker used in Chrome isn't available for the latest version of Firefox, uBlock Origin—which is virtually identical in function—is."
    },
    {
      "title": "Click Add to Firefox.",
      "content": "Click Add to Firefox . It's a blue button on the right side of the page."
    },
    {
      "title": "Click Add when prompted.",
      "content": "Click Add when prompted. This option is at the top of the window. Doing so will install uBlock Origin for your Firefox browser."
    },
    {
      "title": "Click OK when prompted.",
      "content": "Click OK when prompted. It's in the upper-left side of the window."
    },
    {
      "title": "Click ☰.",
      "content": "Click ☰ . You'll find this in the top-right corner of the Firefox window. A pop-out menu will appear."
    },
    {
      "title": "Click Add-ons.",
      "content": "Click Add-ons . It's in the pop-out menu. Doing so opens the Add-Ons page."
    },
    {
      "title": "Click the Extensions tab.",
      "content": "Click the Extensions tab. This is on the left side of the Add-Ons page."
    },
    {
      "title": "Open uBlock Origin's \"Options\" page.",
      "content": "Open uBlock Origin's \"Options\" page. Find the \"uBlock Origin\" heading, then click Options to the right of this heading."
    },
    {
      "title": "Click 3rd-party filters.",
      "content": "Click 3rd-party filters . This tab is at the top of the page."
    },
    {
      "title": "Click Update now.",
      "content": "Click Update now . It's in the upper-left corner of the page. Doing so ensures that all of uBlock Origin's filters are up-to-date, allowing you to browse relatively ad-free. You can check filter boxes on the 3rd-party filters page to add specific types of blocking to your browser, though doing this enough will eventually slow down your browsing speed."
    },
    {
      "title": "Open Start .",
      "content": "Open Start . Click the Windows logo in the bottom-left corner of the screen."
    },
    {
      "title": "Type in store.",
      "content": "Type in store . This will search your computer for the Store app."
    },
    {
      "title": "Click Store.",
      "content": "Click Store . It's a bag-shaped icon at the top of the Start window. The Store app will open."
    },
    {
      "title": "Search for the AdBlock extension.",
      "content": "Search for the AdBlock extension. Click the search bar in the top-right side of the window, then type in adblock ."
    },
    {
      "title": "Click AdBlock.",
      "content": "Click AdBlock . It's a stop sign with a hand on it that you should see in a drop-down menu below the search bar. The AdBlock page will open."
    },
    {
      "title": "Click Get.",
      "content": "Click Get . This button is on the left side of the AdBlock page. Clicking it prompts AdBlock to begin installing onto your computer. If you've downloaded AdBlock before, this button will say Install instead."
    },
    {
      "title": "Click Launch.",
      "content": "Click Launch . It's a button that appears in place of the Get button once AdBlock finishes installing."
    },
    {
      "title": "Select Microsoft Edge when prompted.",
      "content": "Select Microsoft Edge when prompted. Click Microsoft Edge in the pop-up window, then click OK at the bottom of the window. If Microsoft Edge opens without a prompt, skip this step."
    },
    {
      "title": "Click Turn it on when prompted.",
      "content": "Click Turn it on when prompted. You'll see this prompt in the upper-right side of the Edge window. Edge will open to a donations page for AdBlock. While you don't have to pay to use AdBlock, donating a few bucks is considered common courtesy."
    },
    {
      "title": "Right-click the AdBlock icon.",
      "content": "Right-click the AdBlock icon. It's in the upper-right corner of the Edge window. Doing so will prompt a drop-down menu."
    },
    {
      "title": "Click Manage.",
      "content": "Click Manage . This option is in the drop-down menu. The AdBlock add-on page will open."
    },
    {
      "title": "Click Options.",
      "content": "Click Options . It's below the AdBlock heading. Doing so opens AdBlock's Options page."
    },
    {
      "title": "Uncheck the \"Allow some non-intrusive advertising\" box.",
      "content": "Uncheck the \"Allow some non-intrusive advertising\" box. You'll see this box near the top of the page. Unchecking it immediately removes \"non-intrusive\" ads from AdBlock's whitelist."
    },
    {
      "title": "Click the FILTER LISTS tab.",
      "content": "Click the FILTER LISTS tab. It's at the top of the page."
    },
    {
      "title": "Uncheck the \"Acceptable Ads\" box.",
      "content": "Uncheck the \"Acceptable Ads\" box. This option is at the top of the page. Depending on your version of AdBlock, this box may already be unchecked."
    },
    {
      "title": "Click update now.",
      "content": "Click update now . It's a grey button near the top of the page. This will update your AdBlock's filters, ensuring that your browsing is relatively ad-free going forward. You can check filters' boxes to apply them to your browsing, but selecting more than a few additional filters will eventually slow down your browsing speed."
    },
    {
      "title": "Open Safari.",
      "content": "Open Safari. Click the blue, compass-shaped Safari app icon in your Mac's Dock."
    },
    {
      "title": "Go to the AdGuard extension page.",
      "content": "Go to the AdGuard extension page . While AdGuard is usually a paid service, the browser extension is free to use on Safari."
    },
    {
      "title": "Click DOWNLOAD.",
      "content": "Click DOWNLOAD . It's in the upper-left corner of the browser window. This will prompt the AdGuard extension to begin downloading."
    },
    {
      "title": "Click the \"Downloads\" arrow.",
      "content": "Click the \"Downloads\" arrow. You'll find this in the upper-right side of the Safari page. A menu will open."
    },
    {
      "title": "Double-click the AdGuard extension name.",
      "content": "Double-click the AdGuard extension name. It's in the menu."
    },
    {
      "title": "Wait for AdGuard to install in Safari.",
      "content": "Wait for AdGuard to install in Safari. You may need to follow some on-screen instructions to install it as well. Once AdGuard is installed, you shouldn't have to change any settings. You may be prompted to confirm that you want to install this add-on before you can proceed. If you do need to change your AdGuard settings, click Safari , click Preferences... , click Extensions , and click AdGuard on the left side of the page, then adjust any settings on the main page as needed."
    },
    {
      "title": "Download AdGuard.",
      "content": "Download AdGuard. AdGuard will block ads in the mobile version of Safari. Open your iPhone's App Store , then do the following: Tap Search Tap the search bar at the top of the screen. Type in adguard Tap Search Tap GET Enter your Touch ID or Apple ID password."
    },
    {
      "title": "Close the App Store.",
      "content": "Close the App Store. Press your iPhone's Home button to do so."
    },
    {
      "title": "Open your iPhone's Settings.",
      "content": "Open your iPhone's Settings. Tap the Settings app, which resembles a grey box with gears on it."
    },
    {
      "title": "Scroll down and tap Safari.",
      "content": "Scroll down and tap Safari . It's about a third of the way down the Settings page."
    },
    {
      "title": "Tap Content Blockers.",
      "content": "Tap Content Blockers . You'll find this option in the middle of the page."
    },
    {
      "title": "Tap the white \"AdGuard\" switch .",
      "content": "Tap the white \"AdGuard\" switch . The switch will turn green . Your iPhone's Safari browser will now use AdGuard's filters to hide ads from your browsing. You can edit your AdGuard filters by opening the AdGuard app, tapping Filters on the main page, and checking or unchecking filters as needed."
    }
  ]
}