{
  "url": "https://www.wikihow.com/Apply-a-Butterfly-Bandage",
  "title": "Butterfly Bandages: Easy Steps to Use a Steri-Strip",
  "steps": [
    {
      "title": "Rinse the cut with cool water.",
      "content": "Rinse the cut with cool water. Take a cup full of cool water and pour it slowly over the injury. You can also place the cut under cool, running water. This will flush out any dirt or debris. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Avoid pouring antiseptics or hydrogen peroxide over the cut. These harsh cleansers can actually irritate the injury."
    },
    {
      "title": "Wash the skin around the wound.",
      "content": "Wash the skin around the wound. Gently rub soapy water on the skin surrounding the cut. Ensure that soapy water doesn't run into the cut. Then rinse the soapy water away with cool water and pat it dry with a clean cloth. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The butterfly bandage will stay in place better if it's secured to clean, dry skin. If you have some, apply a dab of antibiotic ointment onto the wound. This will speed up the healing process and prevent infection."
    },
    {
      "title": "Hold the wound shut with your fingers.",
      "content": "Hold the wound shut with your fingers. Use your non-dominant hand to line up the edges of the cut. Bring the edges together using your thumb and index finger. Keep pressing the cut to keep the wound closed. [3] X Research source"
    },
    {
      "title": "Set half of the bandage on 1 side and pull it to the other side of the cut.",
      "content": "Set half of the bandage on 1 side and pull it to the other side of the cut. Take the butterfly bandage and remove the backing to reveal the adhesive. Press 1 half of the bandage on a side of the cut. Then bring the other half across the cut and press down on the bandage. [4] X Research source Never apply a butterfly bandage lengthwise along the cut. It needs to cross the cut so the wound edges are closed or almost closed. [5] X Research source"
    },
    {
      "title": "Apply 1 more butterfly bandage above and below the cut.",
      "content": "Apply 1 more butterfly bandage above and below the cut. To encourage healing and keep the cut closed, open another butterfly bandage and put it directly above the main bandage you just applied. Open another butterfly bandage and put it directly below the main bandage. [6] X Research source"
    },
    {
      "title": "Put 2 butterfly bandages vertically across the bandages.",
      "content": "Put 2 butterfly bandages vertically across the bandages. Open 2 more butterfly bandages and place 1 vertically to 1 side of the cut. Then put the other butterfly bandage vertically on the other side of the cut. [7] X Research source Placing vertical bandages will hold the 3 butterfly bandages in place. You don't need to put a protective covering over the butterfly bandages since this will secure them."
    },
    {
      "title": "Leave the butterfly bandage on until it falls off.",
      "content": "Leave the butterfly bandage on until it falls off. After several days the butterfly bandage should start to curl up and peel away from the skin. It's fine if the strips fall off because it means that the cut is healing. Be sure to keep the area clean. Also, avoid picking at the butterfly bandage or you could accidentally open the wound."
    },
    {
      "title": "Apply pressure to stop the bleeding.",
      "content": "Apply pressure to stop the bleeding. Press a clean cloth or towel against the injury for up to 5 minutes. If it's a minor cut, the bleeding should stop. If the cut is more serious and continues to bleed after applying pressure for 10 to 15 minutes, you'll need to get medical attention. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you can't slow the bleeding, go to an urgent care center or emergency room."
    },
    {
      "title": "Inspect the wound to see what type of injury it is.",
      "content": "Inspect the wound to see what type of injury it is. Look at the injury to see if it's a cut, if the skin's been torn, or if the skin's been scraped. Butterfly bandages are useful for holding together shallow cuts with clean edges. If you see torn skin that's jagged, it will probably need stitches. [9] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Butterfly bandages aren't effective at covering abrasions. If you see scraped skin, apply a large or liquid bandage."
    },
    {
      "title": "Determine how deep and long the cut is.",
      "content": "Determine how deep and long the cut is. Use a butterfly bandage if the cut is less than 1/4 in (6 mm) deep and less than 3/4 in (19 mm) long. If the cut is longer or deeper than this, it will need stitches. [10] X Research source If you can see muscle or fat, the cut will need stitches in order to heal properly."
    },
    {
      "title": "Avoid using a butterfly bandage on animal bites or joints.",
      "content": "Avoid using a butterfly bandage on animal bites or joints. Get medical attention if the injury was caused by an animal bite or if there's dirt embedded in the skin. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You should also avoid using butterfly bandages on cuts that are on joints such as elbows or knees because the bandage won't be able to hold the skin in place. Don't use butterfly bandages on skin that's oily or hairy since the bandage will have trouble staying in place."
    }
  ]
}