{
  "url": "https://www.wikihow.com/Blanch-Carrots",
  "title": "How to Blanch Carrots",
  "steps": [
    {
      "title": "Wash and peel the carrots.",
      "content": "Wash and peel the carrots. After rinsing, use a vegetable peeler to peel the outer skin. This will improve the taste and texture of the blanched carrots, and make them look more appealing."
    },
    {
      "title": "Slice the carrots.",
      "content": "Slice the carrots. Carrots will blanch more quickly and have an improved texture if you cut them into smaller pieces. This helps them cook evenly and prevents you from having to cook them too long. Chop off the root end and trim any bruised areas, then slice the carrots into smaller pieces. Slice them into medallions for a great salad add-on. Slice them into sticks for a convenient snack. Slice them into quarters if you're planning on freezing them for later use. Try to make sure the carrot pieces are the same size, so they'll cook evenly."
    },
    {
      "title": "Prepare a bowl of ice water.",
      "content": "Prepare a bowl of ice water. You'll need this to stop the carrots from cooking after you boil them."
    },
    {
      "title": "Heat a saucepan of water.",
      "content": "Heat a saucepan of water. Use a saucepan large enough to hold the carrots, and fill it about 3/4 the way full. Heat the water on the stove top on the highest heat. Season the water to taste by adding salt. Wait until the water is at a high rolling boil."
    },
    {
      "title": "Add the carrots to the water and set a timer for 2-5 minutes.",
      "content": "Add the carrots to the water and set a timer for 2-5 minutes. Generally allow more time for full size carrots as opposed to baby or chopped carrots. Stay near the stove and take the carrots off the heat as soon as the timer goes off."
    },
    {
      "title": "Transfer the carrots to the bowl of icy cold water.",
      "content": "Transfer the carrots to the bowl of icy cold water. Set the timer and let them cool for the same amount of time as they spent blanching. If they blanched for 3 minutes, let them cool for 3 minutes."
    },
    {
      "title": "Take them out of the water when the timer goes off.",
      "content": "Take them out of the water when the timer goes off. Drain the carrots and pat them dry with a paper towel. Use straight away if desired or set aside to use in another recipe."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}