{
  "url": "https://www.wikihow.com/Become-an-MP",
  "title": "How to Become an MP",
  "steps": [
    {
      "title": "Get to know the political and electoral system in your area.",
      "content": "Get to know the political and electoral system in your area. If you are planning to take on a government position; it’s important to know the history of the system and how it functions. Go to the website of the election authority in your area and browse through it. Contact them to see if they can send you additional materials or offer any suggestions for further reading. [1] X Research source You can also get to know how your political system works by watching the news, reading a newspaper, and paying attention to the key political figures and major issues under discussion. For example, if you are seeking election as an MP in the UK, it’s important to know that each of the 650 constituencies in the UK will select their own individual MP to stand at general elections on a five-year cycle. In the United Kingdom, it is a requirement by law under the Fixed-Term Parliaments Act 2011 that general elections are held every five years. Previously, the Prime Minister of the United Kingdom could call general elections whenever they wished, as many were held on a four-year basis. However, an early election can be held if a two-thirds majority of the House of Commons vote in favour of doing so. The first time this happened was on 18 April 2017, when Theresa May called for a snap general election to be held on Thursday 8 June 2017; where 522 MPs voted in favour of doing so and 13 voted against the motion."
    },
    {
      "title": "Hone your public speaking skills.",
      "content": "Hone your public speaking skills. If you are in school, enroll in extra classes, such as speech or debate, focusing on preparing and giving presentations to a variety of different audiences. If you are not in school, then join a local speaking club, such as Toastmasters. Or, volunteer to serve as the public face of a non-profit organisation in your area. [2] X Research source"
    },
    {
      "title": "Join a political party.",
      "content": "Join a political party. Be aware of the established parties that already have MPs in your country. You can choose to get involved with one of these groups. Or, you can decide to run as an independent candidate or even start your own party. Going with the establishment will give you additional resources, but may be tough to break into. [3] X Research source If you want to be a traditional party MP, then you’ll need to start working years in advance. These parties often select their parliamentary candidates very early on and groom them to follow party ideals. For example, in the UK, the three main parties are: the Conservatives, Labour, and the Liberal Democrats."
    },
    {
      "title": "Volunteer for a political party.",
      "content": "Volunteer for a political party. If you decide to go with an established party, reach out to a local branch of the organisation offering your services as a volunteer. Working as a volunteer will give you inside knowledge regarding how the party structure works, and you’ll also form personal relationships with the people involved in the selection process. [4] X Research source If you are unsure about joining a party, this is also a great opportunity to get to know an organization without committing for the long-term. Be patient with doing \"grunt work\" as a volunteer. Try to work your way up the ladder of responsibility, but know that it might take some time."
    },
    {
      "title": "Work on an MP’s staff.",
      "content": "Work on an MP’s staff. Make contact with an MP and offer to serve on their staff as a volunteer or paid employee. This is an especially great approach for someone with limited political experience or expertise in a related area. You might work as a researcher, speech writer, caseworker, or even community contact. [5] X Research source"
    },
    {
      "title": "Serve as a political activist or organizer.",
      "content": "Serve as a political activist or organizer. Find an issue that concerns you and work to address it on a broader scale. This can be a major problem in your local community, such as drug use; which may help you to gain a political reputation. Working as an activist or organizer will also prepare you for the various tasks associated with running a large political campaign. [6] X Research source Roughly 1 in 6 members of the UK Parliament worked as activists or organizers prior to holding office."
    },
    {
      "title": "Meet the basic requirements.",
      "content": "Meet the basic requirements. Talk with your local electoral commission regarding the age, citizenship, employment, and criminal record requirements to stand as a parliamentary candidate. To become an MP in the UK, for example, you must be over 18 years of age, be a British citizen, and not be currently employed as a civil servant. You also must not have served more than one year in jail for any criminal offence. [7] X Research source There are also more obscure requirements. For example, a parliamentary candidate in the UK cannot be currently involved in any type of bankruptcy proceedings."
    },
    {
      "title": "Get on the approved list if you plan to run with an established party.",
      "content": "Get on the approved list if you plan to run with an established party. Each party maintains a list of potential MP candidates who meet their initial criteria. To start with, you’ll usually need to write to the party headquarters, describing your willingness to serve and attaching a copy of your CV. You’ll also probably need to provide a list of references and maybe undergo a series of interviews with senior MPs. Reach out to party headquarters as soon as you know that you are interested in standing as an MP and they will provide you with additional details regarding how to apply. If your request for approval is denied, you may to reapply at a later date or switch your party affiliation entirely."
    },
    {
      "title": "Identify a constituency.",
      "content": "Identify a constituency. Each constituency is an area that gets to send at least one person (sometimes more in certain jurisdictions) to serve in Parliament. Most MPs run from their hometown or at least an area that they know really well. If you are unfamiliar with a constituency, then make an effort to get to know local customs. [8] X Research source For example, some MPs will even take classes to learn the local accent if they aren’t originally from the constituency they're seeking election at. This makes it easier to communicate with the locals and connect with them."
    },
    {
      "title": "Submit your nomination paperwork.",
      "content": "Submit your nomination paperwork. Most Election Commissions will require that you submit a packet containing a certain number of signatures from your constituents stating that they agree to you serving as their candidate. Your packet will also include a letter from you stating that you agree to serve. For example, in the UK, you’ll need to provide a total of ten verified signatures from your constituency. [9] X Research source You’ll also need to provide a monetary deposit in order to reserve your spot as a candidate. For example, in the UK the deposit is £500 and you’ll get it back only after winning over 5% of the vote. [10] X Research source"
    },
    {
      "title": "Hold constituent meetings.",
      "content": "Hold constituent meetings. As soon as you decide to run a campaign, set up a calendar of events in your constituency where the people of the area can get to know you and where you stand on the issues. These can take the form of public speeches, Q&A sessions, or even just random meet and greets."
    },
    {
      "title": "Select an electoral agent.",
      "content": "Select an electoral agent. This is a person who will manage the financial aspects of your campaign. They will track any donations and will complete and submit any necessary paperwork to election authorities. It’s sometimes possible to serve as your own agent, however, this will require a great deal of work on your part. If you are working with an established party, they will likely provide you with a list of suggested agents."
    },
    {
      "title": "Raise campaign funds.",
      "content": "Raise campaign funds. It usually costs a great deal of money to run a successful MP campaign. Your party organization may provide some of these funds. However, you’ll also need to be actively fundraising from day one. It’s also important that you learn the rules on donations and follow them carefully. Solicit donations from wealthy donors, push for small donations across your constituency, and use the funds that you have wisely."
    },
    {
      "title": "Work with your party organization.",
      "content": "Work with your party organization. If you are working as an independent candidate, then you’ll get to make up more of your own rules. However, traditional party candidates will need to conform more closely to party guidelines regarding campaigning, such as only giving interviews in certain venues. In return, you’ll get to draw upon the experience and resources of your party. [11] X Research source Your party may also ask other MPs to campaign for you. This can boost your election returns if that particular MP is popular with your constituents."
    },
    {
      "title": "Win your election or be selected as a party representative.",
      "content": "Win your election or be selected as a party representative. Parliamentary systems vary by country. In some places, like the UK, you can get a spot by winning more votes than any of your opponents in an election. In other countries, such as Germany, you can either win an election or get a seat as part of the proportional allotment given based on each party’s voting numbers. You’ll usually be sworn in prior to taking your place in the Parliament as an MP. During the swearing in ceremony, you’ll also be asked to give an oath of office."
    }
  ]
}