{
  "url": "https://www.wikihow.com/Avoid-Gagging-While-Brushing-Your-Tongue",
  "title": "How to Avoid Gagging While Brushing Your Tongue",
  "steps": [
    {
      "title": "Learn how to brush your tongue.",
      "content": "Learn how to brush your tongue. The gag reflex is just that: a reflex. It is triggered when you touch an area too far back in your mouth (including the tonsils, back of the tongue, or uvula). In order to avoid triggering the gag reflex, you have to avoid touching these areas. Brush and floss your teeth first, and then gently brush your tongue using a soft-bristled brush moistened with water. You can use your regular toothbrush, or you can purchase a special \"tongue brush\" which has shorter bristles meant to better clean the crevices of the tongue. [1] X Research source Begin brushing the tongue toward the tip, working in small circular motions. Gradually work your way back toward the back of the throat, rinsing the brush periodically. Stop short of the area that triggers the gag reflex. If you gag, you've gone too far."
    },
    {
      "title": "Alter your tongue brushing technique.",
      "content": "Alter your tongue brushing technique. If these basic tips aren't working for you, there are slight alterations you can try that might help. Hold your toothbrush perpendicular to your tongue, brushing from the side. Putting your toothbrush in the long way will make it easier to \"slip\" into the overly sensitive danger zone, and makes your toothbrush less likely to crowd the back of the throat and induce a gag. Push the tongue down hard into the lower part of the mouth behind the teeth as you brush it. As soon as the tongue starts to wobble, stop, give it a few moments to retrieve your strength and try again. Exhale through your mouth while brushing your tongue. At the same time, relax your tongue and throat muscles as much as possible. Keep practicing until it becomes a normal habit."
    },
    {
      "title": "Try a psychological trick.",
      "content": "Try a psychological trick. Your gag reflex is your body's way of protecting you from choking or swallowing things you shouldn't, but you can try to outsmart your body by distracting your mind from what is going on in your mouth as you brush your tongue. Distract yourself with pain. Clench the fingers of one of your hands into a fist, gently digging your nails into your palm. Don't hurt yourself badly, just enough to distract yourself from the gag reflex. Distract yourself with thoughts. Before you begin brushing your teeth, find a riddle or difficult math problem to solve. While you begin to gently brush your tongue, starting in the front, mentally focus on the riddle or problem and try to solve it as you work your way back to the back of your tongue. Don't go too far back, and you might find that the mental distraction helped to alleviate the gag reflex."
    },
    {
      "title": "Try a tongue scraper.",
      "content": "Try a tongue scraper. Tongue scrapers or cleaners can be purchased at the pharmacy or big box stores like Target or Walmart. They may feel less invasive than a larger, wider-surfaced toothbrush. A tongue scraper is a small tool made of plastic or metal that gently removes debris and plaque from the tongue. [2] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 20 May 2020. To use a tongue scraper, place its edge toward the back of your tongue and gently pull forward. Repeat as needed to cover the surface of the tongue, rinsing between scrapes. [3] X Research source To reduce the gagging reflex, simply do not place the tongue scraper as far back into your mouth as you use it. Find the farther point you can place it without gagging, and start there."
    },
    {
      "title": "Try flossing your tongue.",
      "content": "Try flossing your tongue. If the tongue scraper method does not work, you can use dental floss to clean the surface of the tongue. Take a normal length of dental floss and drag it down across your tongue. This works well for individuals with a particularly high gag reflex, but it does not remove as much debris from the tongue as other methods. As with the tongue scraper, to reduce the gag reflex you will need to find the farthest distance back on the tongue that you can place the floss without gagging."
    },
    {
      "title": "Try using a washcloth.",
      "content": "Try using a washcloth. If a tongue scraper or floss still triggers your gag reflex, a simple wet washcloth might be all you need. Use a soft, clean washcloth and moisten it with warm water. You can add a bit of toothpaste if you like, but it isn't necessary, especially if the taste of the toothpaste contributes to your gag reflex. Wrap the cloth around one finger and gently rub the surface of the tongue to remove plaque and debris. Go as far back on the tongue as you can without gagging, rinsing the cloth periodically."
    },
    {
      "title": "Use mouthwash.",
      "content": "Use mouthwash. People with very strong gag reflexes or sensitive tongues may not find a tongue cleaning method that works for them, but the use of a good mouthwash can eliminate most of the problematic bacteria and leave the mouth healthy and clean. Look for an antimicrobial mouthwash containing fluoride and alcohol. Be sure to rinse the teeth for 30 seconds then spit the mouthwash out completely. Do not drink water or rinse the teeth for at least 30 minutes after using mouthwash. Brands like Listerine Total Care are effective at reducing bacteria in the mouth and leaving the breath fresh. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Ask your dentist about a prescription for an oral rinse of chlorhexidine gluconate. Using this twice a day may eliminate the need for tongue brushing and help you battle gingivitis."
    },
    {
      "title": "Prevent bacteria build-up.",
      "content": "Prevent bacteria build-up. The tongue's unique texture and large surface area makes it host to millions of bacteria, which can travel to the teeth and gums and cause cavities and gingivitis. The teeth gather plenty of bacteria themselves, but unlike the teeth, the tongue is not a smooth surface. It follows that even more bacteria accumulate in the taste-buds and small pits on the tongue. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Just rinsing the mouth with water is insufficient to remove the bacteria on the tongue, primarily because the bacteria gather in what is called a \"biofilm\"-- a sticky, gooey, living layer of bacteria. It must be disrupted by rubbing or scraping to fully remove it. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Removing bacteria from the tongue is always important, but it's especially crucial if you need to heal cracks that developed on your tongue . Food occasionally gets stuck on your tongue. Scraping or brushing your tongue removes this food and keeps your mouth clean. [7] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 20 May 2020."
    },
    {
      "title": "Prevent bad breath.",
      "content": "Prevent bad breath. The bacteria that live on the tongue cause a chemical reaction that produces volatile sulfur compounds, which results in bad breath. [8] X Research source Tongue brushing can also remove traces of odorous foods like garlic and onions, which can also improve your breath. Many people with bad breath are not aware that they have it. It's a good idea to practice good oral hygiene, including regularly cleaning the tongue, in order to reduce the chance that you are one of them."
    },
    {
      "title": "Prevent discoloration.",
      "content": "Prevent discoloration. Certain foods and health conditions can cause a colored or filmy appearance on the surface of the tongue. Brushing the tongue can eliminate this problem. Foods containing dyes like cupcakes, lollipops, or popsicles can temporarily dye the surface of the tongue. Brushing the tongue can reduce the coloration of the tongue, making it less noticeable to others. Some illnesses like oral thrush or syphilis can cause a buildup of bacteria or fungi on the tongue that cause a filmy, white appearance. In some cases, the white film cannot be brushed off. Be sure that you see your doctor if you suspect that your filmy tongue is caused by an illness. Certain medications like antibiotics or Pepto-Bismol as well as certain illnesses can also cause a startling discoloration of the tongue called \"black hairy tongue,\" which is caused by an overgrowth of yeast in the mouth. The condition is not serious and the discoloration can be brushed off with a toothbrush or washcloth, although it might be a good idea to see your doctor to determine the cause."
    }
  ]
}