{
  "url": "https://www.wikihow.com/Clean-a-Horse-Shoe",
  "title": "How to Clean a Horse Shoe",
  "steps": [
    {
      "title": "Brush away any loose dirt and grime with an old toothbrush.",
      "content": "Brush away any loose dirt and grime with an old toothbrush. Make sure to get into all the cracks and crevices! You may even want to use a small pick to dislodge dirt from the grooves of the horseshoe if it’s caked in. [1] X Research source If you don’t have a toothbrush, use a scrub brush. You may want to wear gloves during this process. Depending on where you found the horseshoe or what condition it’s in, there might be some poop or other things you don’t want to get on your hands."
    },
    {
      "title": "Rub away surface rust with a steel wool pad.",
      "content": "Rub away surface rust with a steel wool pad. Small flakes of rust will come away with just a little bit of elbow grease, which will make the rest of the cleaning process a bit easier. Just grab the steel wool and scrub the entire horseshoe with it until there’s no more rust coming away. [2] X Research source If you don’t have steel wool, you could also use sandpaper or a wire brush. This process also helps remove more dirt if any is left on the horseshoe."
    },
    {
      "title": "Remove nails that are sticking out of the horseshoe with a pair of pliers.",
      "content": "Remove nails that are sticking out of the horseshoe with a pair of pliers. Sometimes you might find a horseshoe that still has nails or bits of metal coming out of it. If you want to use the horseshoe for games or decoration, you’ll need to remove these. You should be able to grasp the end of the nail with a pair of pliers and wiggle it loose. [3] X Research source Make sure to discard of the nails! You don’t want to drop one and accidentally step on it later. If the nails are too hard to remove, wait until after you’ve treated the horseshoe for rust and then try again. They should be looser at that stage."
    },
    {
      "title": "Remove light rust by soaking the horseshoe in white vinegar for 24 hours.",
      "content": "Remove light rust by soaking the horseshoe in white vinegar for 24 hours. Place the horseshoe in a plastic container. Add enough white vinegar so that the horseshoe is completely covered. Let it sit for 24 hours, then take it out and scrub it down with a steel wool pad or scrub brush. [4] X Research source If the rust is particularly bad, you may need to soak the horseshoe in white vinegar a second time."
    },
    {
      "title": "Use lemon juice and salt for an all-natural way to remove stubborn rust.",
      "content": "Use lemon juice and salt for an all-natural way to remove stubborn rust. Place the horseshoe in a clean plastic container and sprinkle it with about 1/2 cup (150 grams) of white table salt. Pour lemon juice (fresh or bottled) over the horseshoe so that it’s completely saturated. Let it sit for 2-3 hours, then scrub the horseshoe with a steel wool pad. Repeat the salt-and-lemon process on the other side of the horseshoe. [5] X Research source You could also try scrubbing the horseshoe with the lemon rind. This process should take about 3 hours in all, but you can repeat it 2 or 3 times if needed."
    },
    {
      "title": "Soak a heavily-rusted horseshoe in citric acid for a more abrasive treatment.",
      "content": "Soak a heavily-rusted horseshoe in citric acid for a more abrasive treatment. In a plastic container, mix 2 cups (470 mL) of hot water and 6 tablespoons (120 grams) of citric acid. Submerge the horseshoe and let the citric acid do its work over the next 12 hours or so. In the morning, rinse and scrub the horseshoe to remove the rest of the rust. [6] X Research source You can buy citric acid online or from a health food store. Some grocery stores carry it now, too. Citric acid comes from citrus fruits. It’s naturally abrasive and is a chemical-free compound that is safe to clean with."
    },
    {
      "title": "Opt for a commercial rust remover if the horseshoe is extremely rusty.",
      "content": "Opt for a commercial rust remover if the horseshoe is extremely rusty. This is also an option if you tried another method but couldn’t get all the rust off. Depending on what brand and type of rust remover you purchase, it may take anywhere from 30 minutes to 24 hours for the chemicals to work. Look for a bottled product that you can pour into a container so the horseshoe can soak in it, rather than a product in a spray bottle. [7] X Research source When working with chemical products, remember to wear protective gear. Gloves, protective eyewear, and even a face mask can help keep you safe. If possible, work in a well-ventilated area so you aren’t breathing in dangerous fumes. Always read the directions and follow them carefully."
    },
    {
      "title": "Smooth and shine the horseshoe with an angle grinder.",
      "content": "Smooth and shine the horseshoe with an angle grinder . An angle grinder is a type of power tool that you can use to grind away rough surfaces to reveal smooth metal underneath. You’ll need either a brush or sandpaper attachment. After turning it on, move the angle grinder back and forth over the surface of the horseshoe until the metal beneath is revealed. [8] X Research source Wear safety goggles and thick gloves to protect your eyes and hands while you work. If loud noises bother you, you may also want to wear earplugs. It may help to hold the horseshoe in a clamp so that you can use both hands on the grinder without worrying about the horseshoe slipping around."
    },
    {
      "title": "Use elbow grease and a piece of sandpaper if you don’t have an angle grinder.",
      "content": "Use elbow grease and a piece of sandpaper if you don’t have an angle grinder. Coarse sandpaper, or 40-80 grit sandpaper, should work well for this type of project. To make things easier on your hand, invest in a manual hand sander. You may also want to use a sanding sponge to help you get around the curves of the horseshoe more easily. [9] X Research source Rub the sandpaper back and forth over the horseshoe until you see the metal underneath peeking through. You can buy hand sanders, sanding sponges, and sandpaper at your local hardware store."
    },
    {
      "title": "Rub a metal polish into the horseshoe if you want it to shine.",
      "content": "Rub a metal polish into the horseshoe if you want it to shine. This may be particularly helpful if you’re planning to use the horseshoe as a decorative accent. Each product is a little different, but generally, you’ll apply a little bit of polish to a clean rag and rub or massage it into the metal until it gleams. To get into all the cracks and crevices, you could use a cotton swab dipped in polish. Wear gloves and clothes you don’t mind getting dirty while you’re doing this. If you get the polish on your outfit, it can be really hard to wash out."
    },
    {
      "title": "Coat the horseshoe with clear varnish to keep it from rusting again.",
      "content": "Coat the horseshoe with clear varnish to keep it from rusting again. Look for a clear spray-on varnish or lacquer at your local hardware or art supplies store. Spray one side of the horseshoe, let it dry, and then spray the other side. Don’t forget to get the sides of the horseshoe, too. If you prefer, you could even spray paint the horseshoe a different color. This could be cool if you’re using the horseshoe to decorate."
    }
  ]
}