{
  "url": "https://www.wikihow.com/Address-a-Letter-to-an-Embassy",
  "title": "How to Address a Letter to an Embassy",
  "steps": [
    {
      "title": "Type your letter on a computer.",
      "content": "Type your letter on a computer. Handwritten letters are hard to read, and may not get any response. If you want your letter to be read and taken seriously, it's important to type it neatly using a recognized business letter format. Use a standard word-processing application , even if you plan to deliver the letter using email . It typically is better to send an attachment than to write your letter in the body of an email. However, you should probably check with the embassy first to see what is preferred. Most word-processing applications have a template that you can use to create a business letter. These templates typically will set your margins and paragraph styles for you. Use a standard, readable font such as Times New Roman or Helvetica, in a 12-point size. Do not use script fonts."
    },
    {
      "title": "Search for templates.",
      "content": "Search for templates. In most cases, you'll be writing to the embassy regarding an immigration issue – either on your own behalf or for a friend or family member. There are a number of immigration assistance websites that have letter templates for various issues. [2] X Research source These templates give you suggested language to use so you can more easily write and address your letter. Don't copy them verbatim, though. Read them carefully and make sure the suggested language suits your situation. If any of it doesn't apply, don't include it. Look into the background of the website before you use their suggested language. Most of these websites have an \"about\" page where you can find out who is in charge of the website. Make sure it's an individual or organization you can trust."
    },
    {
      "title": "Use block paragraphs.",
      "content": "Use block paragraphs. Traditional business letters are written in single-spaced, left-justified paragraphs with a double space between paragraphs. Using a double-space means you don't have to indent the first line of each paragraph. [3] X Research source If you're writing in a language that is read from right to left, such as Arabic or Hebrew, your paragraphs would be right-justified."
    },
    {
      "title": "Put the date at the top.",
      "content": "Put the date at the top. The first line that you type will be the date that you are sending the letter. Your word-processing program may automatically insert the date if you're using a template. [4] X Research source If you don't plan on mailing your letter for a few days, you'll need to adjust this date to reflect the date of mailing. Generally, you shouldn't worry if you end up being a day off. For example, you could finish your letter intending to mail it that day, but not make it to the post office until after the close of business. That would mean you'd have to mail your letter the next day, but you wouldn't have to print up a new letter with the different date. However, while delaying a day or two is fine, if you end up not being able to mail the letter for a week or longer, you probably want to print a fresh copy with an adjusted date. Your reader will expect the date on the letter to be identical or close to the date of the postmark."
    },
    {
      "title": "Find the appropriate address.",
      "content": "Find the appropriate address. The top of your letter will include an area for you to write your own name and address, then the name and address of the person to whom you're writing. Call the embassy or check its website to learn the address to which you should mail your letter. [5] X Research source Keep in mind that many larger embassies will have different addresses for you to use depending on the reason for your letter. If you don't already know, you'll also need to find out the correct person to address who can help you with your issue. Internet sites, such as Project Visa or Embassy World, as well as Internet searches for the country and the word \"embassy\" can help you identify the right person. You also can call the embassy directly to identify the best contact. Type the name of the person you are addressing, the name of the embassy and the address of the embassy to which you are writing. Write this in the same format as you would write it on an envelope for mailing. For example, if you're writing to an embassy staff member at the Canadian embassy, you would write \"Mr. Potter, Canadian Embassy\" on the first line of the address block, followed by the physical address. If Mr. Potter is the ambassador, you would write \"The Honorable Mr. Potter, Ambassador of Canada, Canadian Embassy.\" Note that for many countries the correct title for an ambassador is \"Excellency,\" as in \"His Excellency Mr. Potter, Ambassador of Canada, Canadian Embassy.\""
    },
    {
      "title": "Write a subject line.",
      "content": "Write a subject line. Following the addresses, include a line that lets the recipient of your letter know why you are writing and what the letter is about. You don't have to include your name in the subject line, and it doesn't have to be a full sentence. [6] X Research source For example, you might write \"Request for tourist visa for parents\" or \"Invitation to French Consulate party.\" If you're writing in English, the subject line typically is preceded by the letters \"RE,\" a Latin abbreviation that essentially means \"regarding.\" Your subject line enables the person who receives your letter to direct it to the right member of embassy staff, in the event that you've sent it to the wrong person. With a subject line, they can do this quickly without having to read the whole letter. For this reason, a subject line is particularly important if you haven't been able to identify a specific person."
    },
    {
      "title": "Research the etiquette used in the country to which you are writing.",
      "content": "Research the etiquette used in the country to which you are writing. Different countries have their own formalities and diplomatic protocol for addressing ambassadors and other members of embassy staff. You may be able to find this information on the embassy's website, or by doing a quick internet search using the country's name with words such as \"etiquette,\" \"diplomatic protocol\" or \"forms of address.\" Keep in mind that in countries that have a monarchy and recognize nobility, there may be nobles who serve as ambassadors or in other embassy positions. These titles may supersede any general title for members of embassy staff. Your letter should be written in a formal tone, using the utmost in politeness and courtesy. If you're writing in a language that has a formal \"you,\" such as French or Spanish, you should use that. Pay careful attention when writing to the ambassador specifically, as the title differs depending on whether you are a citizen of the country for which the individual is serving as an ambassador. If you are a citizen of the same country as the ambassador, you may address them as \"The Honorable.\" However, if you are a citizen of a different country, you typically must call them \"Her [or His] Excellency,\" following diplomatic custom. Make sure you have the correct gender – don't just assume based on the name."
    },
    {
      "title": "Start with your greeting.",
      "content": "Start with your greeting. After you've finished the address blocks and subject line of your letter, you're ready to begin the letter itself. Use a formal greeting and address the person to whom you're writing by their full title. [7] X Research source To address the person correctly, you'll need to follow the correct etiquette or diplomatic protocol based on your research. If you're addressing the consul general or any other embassy employee, you'll generally use their full name. For example, you might write \"Dear Mr. Potter.\" However, pay attention to any other titles the person might have, such as if they are a member of the nobility or have a doctorate. Use \"Dear Honorable Ambassador\" if you are addressing the ambassador directly. If you don't know the name or gender of the person to whom you're writing, you can begin your letter \"Dear Sir or Madam.\" However, you should make every effort to address your letter to a specific person. If you get the wrong person, it can always be rerouted. Follow the greeting with the punctuation customary in the embassy's country. In some, a comma is appropriate, while others follow the greeting with a colon."
    },
    {
      "title": "Introduce yourself.",
      "content": "Introduce yourself. Double-space after your greeting and begin your letter by letting the receiver know who you are. Include any identification information necessary, such as any application numbers or reference numbers that are related to the subject of your letter. [8] X Research source The first sentence should state your name and your country of citizenship. Follow that with any additional identification information that is relevant to your reason for writing. Follow the first sentence with a brief description of your reason for writing. This should be no longer than a sentence or two."
    },
    {
      "title": "Explain your reason for writing.",
      "content": "Explain your reason for writing. In the remaining paragraphs of your letter, you will elaborate on the background of your case, including any information the recipient will need to properly respond to your letter. [9] X Research source The length of your letter, and the contents of the remaining paragraphs, will depend on your reason for writing. If you need to give an extended background or timeline of a situation to which you want the ambassador or another embassy official to respond, this may be lengthy. If you're writing for a procedural reason, such as to request a visitor visa, your letter typically shouldn't be more than three paragraphs long, and shouldn't go for more than a page or two at most. Keep your writing clear and concise, and use formal language throughout. If you address the person to whom you're writing anywhere in the body of your letter, use their official title and follow any other rules of etiquette you gleaned from your research."
    },
    {
      "title": "Add your closing.",
      "content": "Add your closing. The final paragraph of your letter typically is only a sentence or two that tells the recipient what action you want them to take in response to your letter. If you expect a response within a certain time frame, it should be mentioned here. [10] X Research source If you need something specific from the person, state what that is and the timeframe within which you need it. Remember to allow for time for mailing. Be careful giving a deadline, particularly if you're writing to the ambassador or a higher-ranking staff member. Instead of making a demand, say something like \"Please be advised that I must have the document I requested within one month or I'll not be able to complete my application,\" or \"Please respond by the end of this month so I can meet my deadline.\" Follow that with a sentence thanking the recipient for their time and attention. For example, you might write \"I appreciate that you have many demands on your time. Thank you for your prompt attention to this matter.\" If you are unsure whether you sent your letter to the correct person, you may want to include a note to that effect. For example, you might write \"If there is someone else at the embassy better capable of handling my issue, I ask that you kindly forward this letter to them.\""
    },
    {
      "title": "Finalize your letter.",
      "content": "Finalize your letter. When you've finished writing your letter, proofread it carefully and correct any typographical errors and mistakes in grammar or punctuation. You may want to read your letter out loud to make sure it reads easily. [11] X Research source End your letter with a closing greeting such as \"Sincerely yours,\" and leave a few blank lines for your signature. Below that, type your name and address, along with any other identification or contact information you think is necessary, such as your phone number or email address. If you're including any other documents with your letter, list them at the bottom of your letter so the reader knows what attachments to expect. You also can use this list as a checklist for yourself to make sure you've included everything necessary. Print your final letter and sign it using a pen with blue or black ink. Check the date on your letter before you send it and make sure you don't need to adjust it forward. When you've signed your letter, make a copy of the signed letter for your own records."
    },
    {
      "title": "Gather any attachments.",
      "content": "Gather any attachments. If there are any additional documents that you need to include with your letter, make copies of them. [12] X Research source Find out if you are expected to send originals or if copies will suffice. If you must send originals, make a copy for your own records before you send the document. If you're sending original documents, it's generally best to use a larger manilla envelope that will allow you to mail them without folding them. For copies, use a standard letter-sized envelope unless you have more than three or four sheets, in which case it's generally better to use a larger manilla envelope and leave them flat rather than folding them. Mark each copy or document carefully in case they get separated from each other."
    },
    {
      "title": "Mail",
      "content": "Mail your letter. Once you have everything in an envelope, you'll need to make a trip to the post office to ensure you have correct postage on the letter and have formatted the address correctly, particularly if you are mailing it to a foreign country. Include your name and the return address on the envelope. This will be written either on the back of the envelope or on the upper-right-hand corner, depending on the country's custom. The name and address of your recipient should be written in the middle or lower-right portion of the envelope, again depending on the country's custom. Use the recipient's formal title if applicable. You may want to wait until you get to the post office to address your envelope, or research formatting ahead of time. If you're handwriting the addresses on the envelope, use a ballpoint pen so the ink won't smear, and print carefully or write in all caps. Don't write in cursive or script on the envelope, as it is difficult to read."
    }
  ]
}