{
  "url": "https://www.wikihow.com/Browse-4Chan",
  "title": "How to Use 4chan: Accessing Forums, Finding Info, & Staying Safe",
  "steps": [
    {
      "title": "Visit the homepage to view the list of boards.",
      "content": "Visit the homepage to view the list of boards. Navigate to the 4chan homepage. You’ll find a brief description of the site and a full list of the boards. Since 4chan doesn’t have a system of usernames and passwords, you don’t have to sign up for anything before browsing."
    },
    {
      "title": "Read the rules and FAQ.",
      "content": "Read the rules and FAQ. You’ll find links to the rules and FAQ pages just below the site description on the home page. If you plan on posting anything, it’s worth your time to familiarize yourself with them in order to prevent getting banned. For example, according to the rules, you must be 18 years or older to access the site. You can’t post or discuss anything illegal, advertise, or complain about 4chan policies. If you post on a board that deals with specific content, like technology, your post has to relate to that board’s topic. [1] X Research source"
    },
    {
      "title": "Click on a board and agree to the disclaimer.",
      "content": "Click on a board and agree to the disclaimer. The first time you click on a board, you’ll be required to agree to a disclaimer before you can browse. The most popular board is Random, or /b/, which is notorious for spawning many mainstream internet memes. Note you’ll almost certainly encounter pornography, gore, and otherwise offensive content on the Random board. If you’re not interested in that kind of imagery, there are plenty of other topics to browse. [2] X Research source Technology, Video Games, and the Paranormal are filled with interesting conversations on their respective topics. LGBT covers issues like coming out, transitioning genders, and marriage rights with an unexpected degree of seriousness. The Auto, Fitness, and Do It Yourself boards can offer constructive content focused on these respective topics."
    },
    {
      "title": "Browse through a board’s pages.",
      "content": "Browse through a board’s pages. Read through the first page’s threads, then use the page numbers at the bottom to navigate to other pages. Stick to “lurking,” or browsing without posting, when you’re just starting out. Lurking on a board’s threads for two or three weeks will help you get a feel for its culture and vocabulary."
    },
    {
      "title": "Navigate boards using the alphabetical links at the top of the page.",
      "content": "Navigate boards using the alphabetical links at the top of the page. Once you're on a board, you'll see a list of letters and abbreviations at the top of the page. These are links to 4chan's other boards. You can use these links to go to another board without having to return to the homepage. If you hover your cursor over a letter or abbreviation without clicking it, a tooltip will appear letting you know which board it links. For example, /g/ links to the Technology board, /o/ links to Auto, and /diy/ links to Do It Yourself."
    },
    {
      "title": "Use catalog or archive views.",
      "content": "Use catalog or archive views. The standard view shows a board's original posts, or OPs, and their top five replies. You can also click on the catalog link just above the board's first post for a single-page gallery view of all OPs without replies. Clicking the archive link next to the catalog link will let you see a list of expired posts from the last three days."
    },
    {
      "title": "Search a thread for an original post.",
      "content": "Search a thread for an original post. You can enter a keyword into the search bar on the standard view to filter posts. Your search results will appear in the catalog view, along with options to sort the posts by date or popularity. In the catalog view, the search bar is located at the far right of the screen. Type your search term in there to start a new search, or delete your search terms to see the full catalog of posts."
    },
    {
      "title": "Use the image search feature to find an image’s source.",
      "content": "Use the image search feature to find an image’s source. If you’d like to find out where an image came from, you can press the grey triangle just after the thread title. When you click on it, it’ll give you the option to image search through Google Images or IQDB. [3] X Research source If you are interested in an image, consider saving or screenshotting it. Posts on 4chan disappear after a few days."
    },
    {
      "title": "Look up unfamiliar slang.",
      "content": "Look up unfamiliar slang. There are a number of slang words, phrases, and abbreviations common across all of 4chan. In addition, many boards have their own unique jargon and slang. When you come across an unfamiliar word, meme, or thread, search for it on Google or Urban Dictionary."
    },
    {
      "title": "Steer clear of upsetting or extremist content.",
      "content": "Steer clear of upsetting or extremist content. Some boards, like Random and Politically Incorrect, are filled with racial slurs, Nazi imagery, and other content that would be horrifying to the average person. Other board titles note that they deal with pornography and other adult topics. [4] X Research source 4Chan has become notorious for racism, white supremacy, and political extremism. [5] X Research source It has been described as a place that can \"incubate\" far-right terrorists. [6] X Research source You can use the filter drop-down menu at the top of the list of boards and select “Show Work-Safe Boards Only.” You can also use this menu to select “Show Not Safe for Work Boards Only.”"
    },
    {
      "title": "Avoid giving out personal information.",
      "content": "Avoid giving out personal information. Never give out any personal or contact information on 4chan or any other online forum. 4chan encourages anonymity, doesn’t allow contact requests, and won’t provide you or another user with anyone’s contact information. [7] X Research source Note that 4chan can keep track of your IP address and, if necessary, use it to ban you or give the information to authorities. [8] X Research source"
    },
    {
      "title": "Don’t click on unfamiliar links.",
      "content": "Don’t click on unfamiliar links. You could download a virus or malware by clicking on a strange link. Avoid clicking on any external links that you might see on 4chan. You can click on the images themselves for a larger view or save without much worry since, according to the rules, the images can’t include any additional sound, document, or other data. [9] X Research source"
    },
    {
      "title": "Don’t follow unsafe advice.",
      "content": "Don’t follow unsafe advice. Sometimes posts on 4chan might encourage viewers to do obviously unsafe things. For example, a 2014 post suggested that readers should microwave their cell phones to activate a hidden feature. Use your best judgment when you see a thread offering advice and when in doubt, don’t try it at home. [10] X Research source"
    }
  ]
}