{
  "url": "https://www.wikihow.com/Become-a-Hafiz",
  "title": "How to Become an Islamic Hafiz",
  "steps": [
    {
      "title": "Choose a suitable time to learn.",
      "content": "Choose a suitable time to learn. Start memorizing your new lessons (also known as sabaq , i.e. a few lines or pages) after Fajr salah. Learning it in the morning is ideal, as you won't have any stress. Reading in the morning also allows you to revise your sabaq before you have to read it to your teacher, which is often in the evening. You should also read in the evening so that you become familiar with the next day's sabaq. Study shows that studying before sleeping is helpful in remembering what you learnt after you wake up. Learn before sleeping, and there is chance that you will remember the lesson better when you wake up. Even if you have a bunch of homework/work to do, if you decide to revise even just a few ayahs, Allah(SWT) will make it easier to complete your work."
    },
    {
      "title": "Everyday, read the new lesson (sabaq).",
      "content": "Everyday, read the new lesson (sabaq). You should also read your old lessons, known as manzil or dohr . These are often the past five to seven sabaq's you read. This is done so that you don't forget your old sabaq, as there's no point moving forward if you forget everything else you learnt."
    },
    {
      "title": "Push yourself.",
      "content": "Push yourself. Everyday, you should also read a complete juz (part) of the Qur'an that you've previously learnt. This is similar to your manzil or dohr, but instead of revising a couple of pages, you're revising a full part. Some students opt to do this once a week (such as on Fridays), as it's a time-consuming task."
    },
    {
      "title": "Try to learn Arabic.",
      "content": "Try to learn Arabic . This is the language of the Qur'an. It's better to read the Qur'an and understand it, since you will learn about what you are reading, how to act as a muslim, what humans will face on the Day of Judgement, etc. Some people find that understanding certain Arabic words can help them remember what comes next when reading it from memory."
    },
    {
      "title": "Start from the end of the Qur'an.",
      "content": "Start from the end of the Qur'an. The ending of the Qur'an, also known as Juz Amma, is the easiest part, as most of the surahs (chapters) are short. You should try to learn one chapter a day, starting from chapter 114 (Surah Naas). Because these are short surahs, you should make even more of an effort to learn the meaning, which shouldn't be too hard. However, if this pressurizes you, then learn the whole of Quran once and take a diverse course to understand it's translation."
    },
    {
      "title": "Find learning techniques.",
      "content": "Find learning techniques . For example, repeat the verse looking at the Qur'an until you know it, then repeat it without looking a couple of times [2] X Research source . Keep on reviewing your sabaq so that you don't forget it. If you feel comfortable, move on to another part. If you want to go further, learn a few more lines or another page. However, don't push yourself too far. Learn how much is just right for you."
    },
    {
      "title": "Stay in a quiet room.",
      "content": "Stay in a quiet room. This will maintain your focus. You can try to listen to recitations of the Qur'an. Put it on loop mode to get the verse into your head, then try to follow along. Some find this distracting, so see what works for you."
    },
    {
      "title": "Read your sabaq to someone.",
      "content": "Read your sabaq to someone. It's no fun doing hifz on your own when nobody has no interest. Ask one of your parents to test you on your lesson. Make sure they're able to read and have wudu before giving them the Qur'an. When you have finished memorizing, read it to someone else, preferably, a sheik, and do it on daily basis."
    },
    {
      "title": "Always ask for Allah's help.",
      "content": "Always ask for Allah's help. Regularly make du'a to help you with your memorization. Have patience and willpower. If you think you can't do anymore, don't give up and forget all about it. It's obligatory for anyone who has memorized the Qur'an to remember what they have memorized, whether it is a page or the full Qur'an."
    }
  ]
}