{
  "url": "https://www.wikihow.com/Become-Jason-Bourne",
  "title": "How to Actually Become Jason Bourne",
  "steps": [
    {
      "title": "Shed the extra weight and get in shape with regular cardio.",
      "content": "Shed the extra weight and get in shape with regular cardio. Doing cardio is essential if you want to be Jason Bourne. Start by jogging a few days a week. Work your way up from 5- to 10-minute runs to longer jogs. Alternatively, you could start cycling or start playing pickup basketball. So long as you’re moving—and moving regularly—you’ll start building the stamina you need to be Jason Bourne. [1] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Aim to get at least 150 minutes of cardio a week. It doesn’t have to be all at once, and remember that things like biking to work or going on a long walk add up!"
    },
    {
      "title": "Improve your strength by lifting weights.",
      "content": "Improve your strength by lifting weights. Look, Matt Damon doesn’t get the ladies going just because of that pretty face—the six-pack and broad shoulders are doing a lot of the work. Bulk up by beginning to lift weights. You can join a local gym or buy some dumbbells to start lifting in the privacy of your own home . [2] X Research source If you need help getting motivated and sticking with a weightlifting program, hire a personal trainer. If you can’t afford a personal trainer, find a workout buddy to lift with. Having someone who will keep you accountable is huge."
    },
    {
      "title": "Choose a martial art to study and practice.",
      "content": "Choose a martial art to study and practice. Bourne was a fighter. While he might have been judo-chopping secret agents who were trying to kill him out of nowhere, you’ve luckily got enough time on your hands to prepare. Choose a martial art that seems interesting to you and sign up at your local gym or dojo for a class. [3] X Research source Kali is the martial art used in the Bourne movies. It’s a Filipino fighting style that focuses on knife fighting and hand-to-hand combat. Boxing is probably the most popular option in the West. It focuses on punching, dodging, and competitive fighting. Karate is the most popular martial art in the East. It’s a complex system that emphasizes a variety of different offensive and defensive techniques. Other options include Krav Maga, Judo, aikido, taekwondo, and muay Thai."
    },
    {
      "title": "Learn a second language (or more).",
      "content": "Learn a second language (or more). Jason Bourne spoke German, French, Russian, Dutch, Spanish, and Swedish. You don’t have to speak all of those, but picking up another language of your choice will give you that international-man-of-mystery energy Bourne exudes. The best way to learn a new language is to take a class and immerse yourself in the language. Watch foreign films in the language, talk to native speakers, and practice daily. [4] X Research source Don’t tell people you’re learning a new language! Just break it out randomly whenever it’s appropriate and play it off like it’s no big deal."
    },
    {
      "title": "Learn how to climb walls or rappel.",
      "content": "Learn how to climb walls or rappel. Bourne was a master climber. While we can’t recommend you start scaling fire escapes and jumping from rooftop to rooftop, we can definitely suggest joining a local rock climbing gym. If rock climbing is a little too mundane for your adventurous tastes, you could sign up for a rappelling class near you! [5] X Research source Once you learn how to climb in a controlled environment at the gym, you can start exploring rock climbing in nature. There’s nothing more Bourne-esque than scaling some obscure rock formation."
    },
    {
      "title": "Sharpen your situational awareness and memory recall.",
      "content": "Sharpen your situational awareness and memory recall. Learn situational awareness by staying alert and focused at all times. When you walk into a room, scan it and note where the entrances and exits are. If you’re going out somewhere, sit where you can see the entrance to the building. Keep an eye out for threats, strange people, or anything that might be out of the ordinary. [6] X Research source Test yourself by trying to memorize little details about other people in your environment. When you sit down in a restaurant, ask yourself, “How did the hostess have her hair? What kind of shoes is the person at the table next to you wearing?” These kinds of questions can help you sharpen your observational skills."
    },
    {
      "title": "Get into parkour and learn how to run with style.",
      "content": "Get into parkour and learn how to run with style. Anyone familiar with Jason Bourne knows he does a lot of running. You may not be able to outrun everybody, but if you learn how to do parkour you won’t have to. Look online for a parkour class near you, or hop on social media and look for a nearby parkour club. Parkour enthusiasts love teaching people their hobby, so it won’t be hard to find friends to teach you. [7] X Research source Parkour is also really intense cardio exercise, so parkour practice is a great way to cross two things off of your to-do list at the same time!"
    },
    {
      "title": "Dress in unprovocative clothing with dark colors.",
      "content": "Dress in unprovocative clothing with dark colors. Bourne dressed like someone who didn’t want to stand out in the crowd. Navy T-shirts, black cargo pants, dark red jackets, whatever you wear, keep it dark and simple. [8] X Research source For the full look, you also need: Boots or athletic shoes. Zip-up rainproof jacket with a hood. A really nice watch, preferably stainless steel (Bourne wore a TAG Heuer Link Chronograph , model number CT1111.BA0550, to be specific). A black knit hat."
    },
    {
      "title": "Keep your hair short, but decidedly un-military.",
      "content": "Keep your hair short, but decidedly un-military. Bourne’s hair is one of the big signals in the movie that he’s not like other characters by having a hairstyle that’s only slightly unacceptable to military standards. However, Bourne can’t stand out from the crowd. Go for a simple, easy-to-style men’s cut , like a short pompadour, crew cut, or undercut."
    },
    {
      "title": "Obtain (at least) a passing interest in firearms.",
      "content": "Obtain (at least) a passing interest in firearms. You don’t need to go out and buy a gun if you aren’t a gun person. However, Bourne was a firearms expert, so you should at least learn the difference between a revolver and a pistol. Beyond that, you might familiarize yourself with long guns, automatic rifles, and other types of weaponry. [9] X Research source If you think you might be a gun person, go down to your local range and talk to the owner! They’ll introduce you to all the basics and teach you how to shoot ."
    },
    {
      "title": "Open at least one foreign bank account.",
      "content": "Open at least one foreign bank account. You don’t need to put a lot of money in the account—the goal here is just to be able to reference the foreign account in passing conversation so that you can play it off like it’s no big deal. Seriously, even if you just keep $50-100 in the account and keep it active enough to avoid fees, you’re good to go. Just don’t forget to report the accounts to the IRS! [10] X Trustworthy Source Internal Revenue Service U.S. government agency in charge of managing the Federal Tax Code Go to source It’s notoriously easy to open an account in the Cayman Islands if you don’t know where to open one. Every country is different when it comes to foreign accounts. The easiest options are Switzerland, Belize, Georgia, Armenia, Portugal, Hungary, and Dominica. You can normally just open foreign accounts online—you don’t have to actually go there."
    },
    {
      "title": "Get another passport.",
      "content": "Get another passport. If you don’t already have a passport for the country you live in, start by getting your passport . Then, if you have the time, money, and effort, find another country to try and establish residency. If you have relatives living abroad, look into the residency requirements there—you can normally get a passport if you have family already living there. Beyond that, you can buy your way into a passport in countries like St. Kitts, Panama, Nevis, and Dominica if you invest or buy property there. Uruguay, Brazil, and Paraguay all offer very easy routes to citizenship. This is sort of the cherry on top for becoming Jason Bourne. It can take a lot of time and money to get a second passport, so don’t worry if it’s not in the cards for you."
    },
    {
      "title": "Focus on your mission and always have a goal.",
      "content": "Focus on your mission and always have a goal. Every day, start by spending a few minutes visualizing what you accomplish. Ask yourself, “How does this help me achieve my current goal?” If you aren’t sure what your goals are, set some concrete and actionable goals for the day. Jason Bourne always had a mission, and while you may not need to hunt down any black op agents tasked with killing you, it’s still good to focus on the key tasks ahead of you. [11] X Research source If you don’t have any actionable goals for a day, set a goal to improve your physical fitness or finally complete that household chore you’ve been putting off."
    },
    {
      "title": "Maintain a cool, calm demeanor at all times.",
      "content": "Maintain a cool, calm demeanor at all times. Jason Bourne doesn’t get rattled—he does the rattling. Behave like nothing could ever possibly bother you. Be cooler than a polar bear’s toes . Break the occasional quick smirk, and feel free to wink at the cute girl at the end of the bar, but avoid looking stressed—even if you are dealing with some emotional pressure. [12] X Research source If you find yourself getting rattled, try practice mindful breathing ."
    },
    {
      "title": "Make eye contact and speak with confidence.",
      "content": "Make eye contact and speak with confidence. If you watch the first few Bourne films, Jason Bourne was phenomenal at locking in with people and remaining present when he talked to them. Speak with a stern and serious confidence and keep your eyes locked on whoever you’re speaking to. [13] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Jason Bourne never said “uh” or “um.” Choose your words carefully and speak with certainty. Bourne never spoke for no reason. If you don’t have anything productive or meaningful to say, just sit back and study your environment."
    },
    {
      "title": "Do everything with conviction and self-assuredness.",
      "content": "Do everything with conviction and self-assuredness. When Jason Bourne made a decision, he didn’t fuss about or complain. He just did it. When you make a decision to talk to a cute stranger, don’t beat around the bush like you’re nervous. If you’re going to apply to a new job, go out and do it now . Once you make your mind up about something, pursue it immediately with conviction and energy. [14] X Research source Remember, not making a decision is a kind of decision. If you’re going to choose something, “something” is better than nothing!"
    },
    {
      "title": "Be prepared for geopolitical events or disasters.",
      "content": "Be prepared for geopolitical events or disasters. Keep an emergency kit in your home in case there’s some kind of crazy civil unrest or natural disaster. Put a spare charger for your car battery in the trunk and never go anywhere without something to protect yourself. Bourne was always ready for anything, and you should be too! [15] X Research source If you aren’t licensed to carry a weapon, pepper spray may be legal where you live. Always have a weapon on hand in case things get crazy."
    }
  ]
}