{
  "url": "https://www.wikihow.com/Clean-Chrome-and-Remove-Rust-Without-Expensive-Cleaners",
  "title": "How to Clean Chrome and Remove Rust Without Expensive Cleaners",
  "steps": [
    {
      "title": "Mix some water and dish soap.",
      "content": "Mix some water and dish soap. Clean the chrome first to remove dirt, marks, and grime, and to help expose any rust that may have formed. Fill a bucket with lukewarm water. Add five to 10 drops of liquid dish soap. Swish your hand in the water to work up some suds. To wash submersible items like small parts, pots, or pans, use your kitchen sink rather than a bucket."
    },
    {
      "title": "Wipe the chrome with the cleaning solution.",
      "content": "Wipe the chrome with the cleaning solution. Dip a sponge or microfiber cloth into the soapy water. Wring out some of the excess water so it doesn’t drip everywhere. Scrub the chrome with the soapy water, making sure you cover every inch of the metal. Dip the sponge back into the soapy water regularly to clean it off and make sure it stays saturated with the cleaning solution. [1] X Research source To access hard-to-reach nooks and crannies, use a soft-bristled toothbrush dipped in the soapy water. For the best results, clean the chrome weekly, or as soon as it starts to look dull."
    },
    {
      "title": "Rinse.",
      "content": "Rinse. When the chrome has been cleaned to your satisfaction, dump your cleaning water. Rinse the bucket, and fill it with plain water. Rinse your sponge thoroughly under running water. Wring out some of the excess water, and go over the chrome again with the wet sponge to remove leftover cleaning solution. For items that you're cleaning in the kitchen sink, simply rinse them under running water to remove excess cleaning solution. For outdoor items like car and bike parts, rinse them with a garden hose."
    },
    {
      "title": "Clean stubborn stains with vinegar.",
      "content": "Clean stubborn stains with vinegar. Sometimes you'll encounter stains or marks that didn’t come off with soap and water, and you can tackle these with a mildly acidic vinegar solution. In your bucket or sink, mix equal parts vinegar and water. Soak your sponge or microfiber cloth, wring it out, and go over the tough spots with the vinegar and water solution. [2] X Research source When you're satisfied with the cleanliness of the chrome, rinse it again with plain water. This is a fairly simple process to keep chrome shining, and you can do it on a regular basis."
    },
    {
      "title": "Dry the chrome and inspect for rust.",
      "content": "Dry the chrome and inspect for rust. With a clean microfiber cloth, towel dry the chrome. Chrome tends to show water spots, so you shouldn’t let it air dry. As you dry the chrome, check it for rust. If you find any rust, you'll have to address it with a rust-cleaning method."
    },
    {
      "title": "Cut some squares of aluminum foil.",
      "content": "Cut some squares of aluminum foil. Tear off a 3-inch (7.6 cm) strip of aluminum foil from the roll. Cut the strip into three equal pieces. Each one will be about 3 to 4 inches (7.6 to 10 cm) in length. You will rub the chrome with the aluminum foil to remove rust. Aluminum foil is ideal for cleaning chrome, because it’s a softer metal and won’t scratch the chrome. Steel wool is not recommended for chrome, because it requires more effort, and can leave the chrome looking dull."
    },
    {
      "title": "Fill a bowl with water.",
      "content": "Fill a bowl with water. Grab a small bowl from the kitchen and fill it with plain water. The water will act as a lubricant between the chrome and the aluminum foil, but it’s actually the chemical reaction between the two metals that removes the rust. [3] X Research source It’s not necessary to use cola or vinegar as the lubricant to clean chrome."
    },
    {
      "title": "Scrub the rust with foil.",
      "content": "Scrub the rust with foil. Dunk a piece of aluminum foil into the bowl of water to get it wet. Lightly rub the wet foil against the rusted chrome surface. You don’t need to press hard or use a lot of elbow grease, because only minor friction is needed to produce the aluminum oxide that will dissolve the rust. As you rub, the rust will disappear and the surface of the chrome will become shiny and smooth. [4] X Research source If you're working with a large area, switch to a new piece of foil after every 10 inches (25 cm) of area you cover."
    },
    {
      "title": "Use a foil wad to work on pitted areas.",
      "content": "Use a foil wad to work on pitted areas. Chrome is susceptible to pitting, especially in areas where there has been rust. You can remove rust and smooth these areas with an aluminum foil wad. Tear off another 3-inch (7.6-cm) strip of foil. Crumple it into a loose ball. Wet the ball and gently rub any pitted areas with the foil. As you rub the area with the foil, the edges on the foil ball will help to smooth out the pits in the surface of the metal, and remove rust in the process."
    },
    {
      "title": "Rinse and dry the area.",
      "content": "Rinse and dry the area. Once all the rust has been removed, use a sponge or hose to rinse away any brown paste that’s formed when you scrubbed the rust. When all the paste and excess rust has been washed away, dry the area with a clean microfiber cloth. Don’t let chrome air dry, as it’s likely to form water spots."
    },
    {
      "title": "Buff the chrome with a cloth.",
      "content": "Buff the chrome with a cloth. Use a clean and dry microfiber cloth to rub the entire surface of the chrome. Apply gentle pressure and rub the metal in a circular motion. This will help to remove any leftover water, dirt, and rust, and help to buff the metal to a shine. [5] X Research source You can also use an electric hand polisher with a clean and dry buffing pad to buff the chrome."
    },
    {
      "title": "Apply a layer of baby oil.",
      "content": "Apply a layer of baby oil. Baby oil, which is actually mineral oil, makes a great polish for woods and metals. Not only will it smooth out the surface of the metal, but it will also help bring it to a beautiful shine. Squirt a few drops of baby oil over the surface of the chrome, spreading it out so there's a drop every 1 to 2 inches (2.5 to 5 cm). You can also use car wax, Turtle Wax, or carnauba wax to polish and protect chrome."
    },
    {
      "title": "Rub the area with a cloth.",
      "content": "Rub the area with a cloth. Use a clean and dry microfiber cloth to rub the baby oil into the surface of the chrome. Use a circular motion, and apply gentle pressure as you work. Once you’ve gone over the entire area, repeat with a clean cloth to remove any excess oil from the surface. [6] X Research source As you rub the oil and polish the metal, the chrome will come to a bright, shiny, mirror finish."
    }
  ]
}