{
  "url": "https://www.wikihow.com/Cook-Mud-Crab",
  "title": "How to Cook Mud Crab",
  "steps": [
    {
      "title": "Purchase live-mud crabs.",
      "content": "Purchase live-mud crabs. Find crabs that look healthy and that don’t have missing claws or legs. You’ll know the mud crab is alive and healthy if it moves its legs and claws when you touch it. Healthy adult mud crabs will be between 1.5–2 pounds (680–910 g). You can find live mud crabs at a fish market or in the seafood section of the grocery store. [1] X Research source If the crab doesn’t move or react when you touch it, find another one that is more responsive. Cooking dead crabs will result in a mushy and undesirable texture and could give you food poisoning."
    },
    {
      "title": "Wash the crab under cold water.",
      "content": "Wash the crab under cold water. Grab the crab’s body from behind and leave the crab under the running faucet to remove any dirt that’s on its shell. Be careful when handling the mud crab so that it doesn’t pinch you with its claws. [2] X Research source Mud crab claws are incredibly powerful and could cause serious injury. Most stores will wrap rubber bands around the crab’s claws so that they can’t pinch you. You can wear a pair of thick protective gloves to prevent injury."
    },
    {
      "title": "Put the crab in a large bowl and place a damp towel over it.",
      "content": "Put the crab in a large bowl and place a damp towel over it. Line the bottom of the bowl with wet paper towels. Keeping the crab in a bowl will prevent it from moving around when you put it in the freezer. Crabs don't like the light, so you should place a towel over the bowl to prevent them from becoming agitated while you store them. [3] X Research source You can keep a live mud crab for up to 24 hours out of the water before it dies."
    },
    {
      "title": "Place the bowl in the freezer for 45-60 minutes.",
      "content": "Place the bowl in the freezer for 45-60 minutes. Placing the crab in the freezer will shock it and prevent it from suffering when you cook it. The crab shouldn’t move when you take it out of the freezer. [4] X Research source Don’t leave the crab in the freezer too long or it will kill the crab and freeze the meat."
    },
    {
      "title": "Cut the strings or bands off the crab and cook or clean it immediately.",
      "content": "Cut the strings or bands off the crab and cook or clean it immediately. Use a scissor to cut the bands or strings holding the crab’s claws shut so that you don’t boil them in the water with the crab. Discard the strings in the garbage and cook or clean the crab immediately. [5] X Research source Don’t let the crab warm up or it will start moving around and suffer as you crack and clean it."
    },
    {
      "title": "Flip the crab over and remove the tail flap.",
      "content": "Flip the crab over and remove the tail flap. Boiling the individual pieces of the crab may be easier than boiling it whole because mud crabs are so large, which is why you may opt to take the crab apart before boiling it. The tail flap will be a V or U shaped flap on the bottom of the crab. Fit your fingers under the flap and pull up and twist to remove it. [6] X Research source"
    },
    {
      "title": "Pull off the top of the crab shell.",
      "content": "Pull off the top of the crab shell. Place your thumbs against the top shell and the crab's body. Pry off the top of the crab shell to remove it. This should reveal the inside of the crab’s body. [7] X Research source Watch out for the sharp edges on the front of the crab’s shell."
    },
    {
      "title": "Twist off the crab’s eyes.",
      "content": "Twist off the crab’s eyes. Hold the crab so that the underside is facing you. Pull and twist to remove the eyes of the crab. These pieces are not edible, so discard them after you remove them. [8] X Research source"
    },
    {
      "title": "Remove the gills on the inside of the crab's body.",
      "content": "Remove the gills on the inside of the crab's body. Run your fingers down each side to remove the phalanges on the inside of the crab’s body. These will look like fingers inside of the crab’s body. Remove both sets on each side of the crab’s body. [9] X Research source The gills inside of the crab’s body are also not edible."
    },
    {
      "title": "Cut through the center of the crab’s body.",
      "content": "Cut through the center of the crab’s body. Place the crab on a paper towel so that it doesn’t slip when you cut it. Center a kitchen knife on the body of the crab and apply downward pressure on the knife with your other hand to cut through the shell. [10] X Research source Be careful when cutting through the crab so that you don’t cut yourself."
    },
    {
      "title": "Wash out the inside of the crab’s body.",
      "content": "Wash out the inside of the crab’s body. Run the crabs body under cold water to clean out the gunk in the center of the crab. Some people like to eat the body of the crab while others prefer to discard it. [11] X Research source"
    },
    {
      "title": "Cut off each arm.",
      "content": "Cut off each arm. Use the knife to cut each arm at the joint closest to the body of the crab. You have now disassembled the crab and are ready to cook the individual pieces."
    },
    {
      "title": "Fill a large stock pot 3/4ths of the way with water.",
      "content": "Fill a large stock pot 3/4ths of the way with water. Use a pot that’s large enough to fit the crab. If you're cooking the crab whole, cook each crab individually. Don’t fill the pot all the way with water or it will overflow when you put the crab in it. [12] X Research source If you put too much water in the pot, you can ladle the excess out."
    },
    {
      "title": "Add salt, bay leaves, and pepper to the pot.",
      "content": "Add salt, bay leaves, and pepper to the pot. Season the water generously with salt and pepper and add 3 bay leaves to the water. This will impart more flavor into the crab. [13] X Research source You can also add another seasoning to the water including paprika or garlic powder."
    },
    {
      "title": "Bring the water to a rolling boil.",
      "content": "Bring the water to a rolling boil. Turn the stovetop to high and wait 10-15 minutes for bubbles to vigorously break the surface of the water. Then, turn the heat to medium-high so that the water is still boiling. [14] X Research source"
    },
    {
      "title": "Cook the crab for 12 minutes.",
      "content": "Cook the crab for 12 minutes. Use a pair of tongs to lower the crab or crab pieces into the water and place a lid over the pot. As the crab cooks, the shell should start to turn red. Don’t cook the crab for more than 12-15 minutes or the meat will get tough. [15] X Research source"
    },
    {
      "title": "Remove the crab from the pot and put it in an ice bath for 5 minutes.",
      "content": "Remove the crab from the pot and put it in an ice bath for 5 minutes. Fill a bowl up with cold water and ice cubes then place the cooked crab into the bowl. Plunging the crab in the ice water will stop the cooking process. [16] X Research source"
    },
    {
      "title": "Serve the crab or store it in the refrigerator.",
      "content": "Serve the crab or store it in the refrigerator. Either serve the crab immediately or store it in the refrigerator for 3-5 days. You can also freeze the crab for 3-5 months if you plan on eating it later. To eat the crab, crack the arms and claws with a shell food cracker and pull the meat out of the shell. [17] X Research source You can dip the crab meat into melted butter as you eat it."
    }
  ]
}