{
  "url": "https://www.wikihow.com/Change-Your-Look",
  "title": "How to Change Your Look",
  "steps": [
    {
      "title": "Change your hair color for a new look.",
      "content": "Change your hair color for a new look. Get highlights or lowlights, dye your hair a fun color (like blue or purple or pink), experiment with ombre, go platinum blonde or raven black, or any other look that draws your eye and excites you! You can also use things like hair chalk and color sprays to temporarily change your hair color. Pay attention to what repeatedly catches your eye—if you’re drawn to it, maybe it’s something you should take a chance on. Try paying attention to your skin tone and letting that guide your hair coloring decisions. You can visit a professional salon to have your hair done, or you can try dyeing it on your own or with a friend."
    },
    {
      "title": "Get a haircut or add extensions for a more permanent change.",
      "content": "Get a haircut or add extensions for a more permanent change. You could go from long locks to a pixie cut, get bangs, try out an asymmetrical style, have extensions attached, or choose from dozens of other different hairstyles. You could even buzz off all of your hair for a dramatic change! Try choosing a hairstyle that flatters your face . [1] X Research source If you don’t want to do anything drastic to your hair, try getting a simple trim. Even if it’s not a noticeable change, you’ll know it happened and it can help make you feel “fresh.” If you want to try out a new, dramatic style, but aren’t ready to commit to the cut yet, you could try out a wig for a week to see if you like the look. Some different apps that let you “try on” new hairstyles are Virtual Hairstyle, Hair Color Booth, and NewDo."
    },
    {
      "title": "Style your hair differently to explore new looks without commitment.",
      "content": "Style your hair differently to explore new looks without commitment. If you don’t want to make any other changes, try changing how you actually style your hair. You could part your hair on the opposite side or try braiding your hair for a unique style. Try a half-bun, a low ponytail, or a top knot for a change. [2] X Research source The great thing about trying a new hairstyle is that it isn’t permanent! Look up some tutorials on YouTube or Pinterest to learn how to pull off some different looks. You could also try adding some accessories to your hair, like ribbons, clips, headbands, or a flower crown."
    },
    {
      "title": "Get a professional makeover to learn new makeup techniques.",
      "content": "Get a professional makeover to learn new makeup techniques. Many makeup and beauty counters will do free makeovers—visit one and ask the worker to explain how and why they are doing what they’re doing. If you have a particular look in mind, you could even ask them to show you how to pull off that look. [3] X Research source You can buy the products that are used in your makeover, or you can find similar products on your own at the store or online. Pay attention to the colors that are used, if certain products were designed for a specific skin type, or if any special ingredients were used."
    },
    {
      "title": "Watch how-to videos and tutorials to learn new makeup styles.",
      "content": "Watch how-to videos and tutorials to learn new makeup styles. Maybe you want to learn how to do the perfect cat eyeliner , or perhaps you love the way contouring looks. Check out YouTube or other tutorials on wikiHow to watch videos and learn how to pull off these looks. [4] X Research source Doing something new with your makeup may take some extra time at first, but with practice, you’ll get better and faster!"
    },
    {
      "title": "Start wearing less makeup for a more natural look.",
      "content": "Start wearing less makeup for a more natural look. Maybe you are searching for a simpler style—try limiting how much makeup you wear by eliminating different parts of your routine, like blush or eyeliner or eyeshadow. Or, simply change out bold looks (like dark eyeshadow) for more natural shades. [5] X Research source A lot of people find it freeing to stop wearing makeup, though you may feel a little “naked” without it at first. Try taking a picture of yourself bare-faced and study it to appreciate what your face looks like in its natural state."
    },
    {
      "title": "Find a “signature” lip color to wear every day.",
      "content": "Find a “signature” lip color to wear every day. From pinks to reds to purples to nudes to blues, there are so many different shades you can choose from! Find a color that draws your eye and that goes well with your skin tone, and start wearing it every day to establish a “signature” look. For example, if you have an olive skin tone, look for a pink, orange or red shade. If you have pinker skin, look for something with purple shades in it. Alternately, you could try wearing a different lip color every day to express your creativity and love of color!"
    },
    {
      "title": "Learn how to do your eyeliner in a different way.",
      "content": "Learn how to do your eyeliner in a different way. Choose cat eyeliner to enhance your eyes. Learn how to do winged eyeliner for a more dramatic look. You could even learn how to do designs with your eyeliner for a really creative option. You can use different colored eyeliner, too, for even more variety. Green and brown eyeliners look great with hazel eyes; dark brown or dark blue eyeliners enhance blue eyes; purple, teal, and green eyeliners really make brown eyes stand out."
    },
    {
      "title": "Choose clothing that suits your personal style and body shape.",
      "content": "Choose clothing that suits your personal style and body shape . Try highlighting a certain area of your body by placing a detail there (like a belt around the waist). If you’re curvy, avoid wearing clothes that make you look boxy. Do you see certain outfits or styles on people who you admire? Try imitating their look, even if it feels foreign to you at first. Following your instincts is the best way to change your look in a positive way. [6] X Research source There are also services available like image consultants, where a professional will come in and evaluate your closet and style and make recommendations for what kinds of clothes will look best on you. If you're plus size, look for clothing made from lightweight, flowy fabrics, like jersey and rayon, with soft lines. Avoid anything that's very tight, since you'll look your best if you feel comfortable. [7] X Research source Katie Quinn. Stylist. Personal interview. 8 May 2020. You don’t necessarily need to listen to what the “experts” say you should do for your particular body style—the most important thing is that you feel comfortable in your clothes and that you like the way you look."
    },
    {
      "title": "Acquire pieces in neutral tones for a classic look.",
      "content": "Acquire pieces in neutral tones for a classic look. Visit thrift stores, department stores, local boutiques, and online shops to find items that are subtle. Grays, blacks, creams, and tans are good colors for tops and bottoms. Then you can get some different color accessories and jackets to complement your wardrobe. You don’t have to overhaul your entire wardrobe at once; just start small and expand it over time. If you are trying to add more color to your look, add a bright cardigan, a colored pair of jeans, and a brightly colored purse to your wardrobe. Or, you could try adding baseball caps, styled belts, or specific kinds of shoes depending on what kind of look you’re going for."
    },
    {
      "title": "Invest in athletic shoes for a sportier look.",
      "content": "Invest in athletic shoes for a sportier look. Or if you are looking for a more classic look, plain tan, brown, or black flats, sandals, or shoes would be more fitting than brightly colored and patterned ones. For a more creative look, search for shoes that are brightly colored, that have designs on them, and that are different styles, like sandals, wedges, and high heels. [8] X Research source If you’re going for a simple look, try to find shoes that pair with most of your outfits. If you’re looking for a varied and creative look, your shoes may be somewhere you can express your style."
    },
    {
      "title": "Emulate a fashion icon.",
      "content": "Emulate a fashion icon. When you're revamping your style, it can help to choose an icon to reference for direction. Try finding fashion blogs and magazines that you enjoy to find new, contemporary styles. Choose clothing items that reflect that style, like large, round glasses, colorful tops, and big pieces of jewelry. A few famous fashion icons are Iris Apfel, Coco Chanel, Christian Dior, Ralph Lauren, Vera Wang, and Audrey Hepburn. If you're inspired by style from a certain decade, work that into your look! For instance, style in the 1950s often featured nipped-in waists, full skirts, and fitted cardigans. [9] X Research source Katie Quinn. Stylist. Personal interview. 8 May 2020."
    },
    {
      "title": "Try some new accessories to complement your outfits.",
      "content": "Try some new accessories to complement your outfits. Pay attention to designers or fashion icons you like to see what kinds of things they pair with their outfits. It’s totally okay to copy them! From sunglasses, purses, wallets, belts, and jewelry, making a simple switch can really change your look drastically. [10] X Research source For example, adding a statement necklace to a plain outfit can really change the style. Try pairing your statement with an open neckline like a V-neck, or with a button-down or crewneck. However, avoid wearing them with square necklines, as this can look a little dated, and don't pair them with statement earrings. [11] X Research source Katie Quinn. Stylist. Personal interview. 8 May 2020."
    },
    {
      "title": "Buy a new pair of glasses, whether or not you need a prescription.",
      "content": "Buy a new pair of glasses, whether or not you need a prescription. A new pair of frames can really update your look! Go to a store in person to try out new looks, or load your picture to a frames-specific website to virtually try on different styles. You could get bold, dark frames, cat-eye glasses, brightly colored ones, or even gold-rimmed glasses. Don’t be afraid to try something different from what you’ve done in the past! You could even get several pairs of glasses to mix and match with your outfits."
    },
    {
      "title": "Develop a new exercise routine for more energy.",
      "content": "Develop a new exercise routine for more energy. Exercise also helps you feel more confident and boosts endorphins. If there are specific things about your body that you would like to change, like having toned legs or a slimmer waist, look up exercises that specifically address that thing. In general, doing some cardio and some weight lifting nearly every day is enough to make gradual changes to your appearance, and you will feel better, too! [12] X Research source For example, if you want toned legs, try doing different types of squats , like the sumo deadlift and the wide stance squat. Do 3 sets of 15 squats every day. Exercising also increases the blood flow in your body, which makes your skin look better. You can join a gym or do workouts at home , whichever makes you feel most comfortable and will ensure that you actually do the work."
    },
    {
      "title": "Start a new skincare routine.",
      "content": "Start a new skincare routine . Take a few minutes to think about and examine your skin. Is it oily or dry? Do you have acne? If you have oily skin, look for products that reduce oiliness. If you have dry skin, look for items that will moisturize your skin. In general, a good skincare routine is repeated in the morning and in the evening before bed, and it includes washing, toning , and moisturizing ."
    },
    {
      "title": "Get 7-9 hours of sleep every night.",
      "content": "Get 7-9 hours of sleep every night. An hour before bed, turn off your electronics, wash your face, and start winding down for the night. Sleep in a cool room with little to no light. When your alarm goes off in the morning, get up right away rather than hitting that snooze button. Getting enough sleep not only makes you more energized and productive, but it will make your skin look better, and you’ll feel more confident if you’re well rested. [13] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Getting enough sleep also helps lower your stress levels and helps you maintain a healthy weight—and both of these things can really change your outlook on life and your physical look! A lack of sleep can give you dark circles under your eyes, increase wrinkles, and make your skin look sallow."
    },
    {
      "title": "Build your self esteem through positive thinking.",
      "content": "Build your self esteem through positive thinking. If you treat yourself well and say good things about yourself, even internally, that attitude projects itself onto the people around you. Try starting every morning with a positivity mantra, like: “I love, respect, and adore my body.” If you struggle with constant self-doubt and negative self-talk, it’s okay to seek professional help to get to the root of those feelings. Mental health is just as important to your look at your physical appearance!"
    },
    {
      "title": "Keep your shoulders open and your back straight for confident posture.",
      "content": "Keep your shoulders open and your back straight for confident posture . Don’t hunch over or keep your head down to the ground. Walk with your head up high so you can make eye contact with others if you want to, and leave your arms down at your side, rather than crossed in front of you. [14] X Research source How you hold yourself teaches others what you think about yourself—if you want to appear a certain way (bold, confident, assured), try to carry yourself that way."
    }
  ]
}