{
  "url": "https://www.wikihow.com/Act-in-a-Relationship-(Girls)",
  "title": "How to Behave in Healthy Relationship: Key Advice for New Couples",
  "steps": [
    {
      "title": "Listen to your partner.",
      "content": "Listen to your partner. [1] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 11 June 2020. One of the best ways to show your partner that you genuinely care for them is to listen to them when they talk. Listening is different from hearing. When you listen, it shows that you respect their opinions and feelings. [2] X Research source When your partner is talking, set aside your phone and computer in order to give them your undivided attention. Look them in the eyes when they are talking. Try to not interrupt them when they are talking. Hear them out, first. Verbalize understanding of what they said. For example, you might say something like, “It sounds like you are saying ____. Is that right?” Make sure to follow through with change when necessary. For example, if your partner asks you to call the next time you are going to be late for dinner, then make sure that you do so."
    },
    {
      "title": "Learn to make compromises.",
      "content": "Learn to make compromises. Both you and your partner should have a say in the kinds of activities you do together. It shouldn’t be one-sided all the time. If it is, it could turn into a power struggle with one person fighting to get his or her way all the time. [3] X Research source For example, if you chose the last two movies, let your partner decide which movie you guys will see next time. Show interest in your partner by trying things they like to do. For example, if they like going to the art museum, then offer to go to the museum the next time you guys are deciding what to do. Go with an open, positive mind and focus on trying to enjoy yourself. Do not punish your partner with negative words or attitude."
    },
    {
      "title": "Support your partner.",
      "content": "Support your partner. You should be supportive of your partner in both good times and bad times. When your partner is going through a rough time, lend a shoulder to cry on. [4] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 11 June 2020. On the other hand, if your partner has a reason to celebrate, offer to take them out, and express how proud you are of them. [5] X Research source For example, if your partner didn't get the job they applied for you can say, “Don't worry. There are plenty of jobs you can apply for. Try not to let one job get you down. I am here to help if you need it.” On the other hand, if your partner did get the job you can say, “I am so proud of you. You worked really hard to get that job.” Respond positively to your partner, but also avoid speaking ill of other people."
    },
    {
      "title": "Set boundaries.",
      "content": "Set boundaries. Teach your partner how to respect you by setting boundaries. If your partner does not respect your boundaries, then this is a red flag. This is especially important in regards to sex. [6] X Research source Does your partner understand and support your boundaries? If not, consider ending the relationship. Does your partner stop right away when you say no, or when you’re not comfortable doing something? If not, you need to re-evaluate the person and your relationship with them. For example, if your partner is ready to have sex, and you are not, do they pressure you by saying, \"Come on, it is just sex. If you don't have sex with me, then I will break up with you.\" If they do, then they are not respecting your boundaries."
    },
    {
      "title": "Admit when you are wrong.",
      "content": "Admit when you are wrong. By admitting that you were wrong, it shows that you have integrity and courage. It also encourages your partner to do the same thing when they are wrong. Remember to take responsibility for your mistakes and be sincere when offering an apology. [7] X Research source Admit that you were wrong by saying, “I made a mistake, and I am sorry. I want to apologize because it was me who misunderstood the situation. How can I make it up to you?”"
    },
    {
      "title": "Give your partner space.",
      "content": "Give your partner space. If you are secure in your relationship, you will not feel the need to be with your partner all the time. However, you may still want to have a discussion about what boundaries you think are appropriate in regard to other people. Try to remember that your partner had a life before you two got together. Encourage your partner to spend alone time with their friends and family. [8] X Research source You can say, “We have been hanging out a lot lately. We should try to spend more alone time with our friends.” Remember to hang out with your friends and family, as well. Don’t ignore them just because you have a new boyfriend or girlfriend."
    },
    {
      "title": "Don’t lie.",
      "content": "Don’t lie. The best way to lose your partner’s trust is to lie, which may include not telling the whole truth. Try to be open and honest with your partner all the time. [9] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 11 June 2020. If you feel like you have to lie to your partner, then you should reassess the relationship. Also, hold your partner to the same standards you hold yourself to. [10] X Research source If your partner catches you in a lie, it will be hard for them to trust you again. If you catch your partner in a lie, bring it up. You can say, “You told me that you were going to have dinner with your family Friday night, but someone told me that they saw you at the movies with your friends. I feel bad that you had to lie to me. Why did you feel like you needed to lie?”"
    },
    {
      "title": "Be open about your feelings.",
      "content": "Be open about your feelings. Never keep a feeling bottled up because you’re afraid of your partner’s reaction, or because you’re afraid of sounding silly. If you need time to think about something before you are ready to talk, your partner should respect you and give you space. [11] X Research source If your partner asks if you are all right, don’t say, “No, nothing's wrong,” if something is actually wrong. Tell them exactly what is bothering you, and how you feel. You can say, “Actually, the other day when you were talking to Samantha, I was kind of jealous. Do you like her more than you like me?”"
    },
    {
      "title": "Ask questions if you don’t understand.",
      "content": "Ask questions if you don’t understand. Try to avoid miscommunication by asking clarifying questions. If you don’t understand what you’re partner is trying to say, don’t shrug it off, or assume that you know. [12] X Research source You can say, for example, “I’m not really sure I understood what you meant when you said that you needed some space. Does that mean you want to break up, or does it mean that you want to spend more alone time with your friends and family?”"
    },
    {
      "title": "Don’t be judgmental.",
      "content": "Don’t be judgmental. If your partner expresses an opinion that you disagree with or don’t understand, try not to judge them in a negative way. Instead, try to understand their perspective. By seeing things from their perspective, you will be able to get to know them better. You might even learn something new, or change your mind about something. [13] X Research source For example, if your partner says, \"I don't understand why people become vegetarian. It seems pointless to me.\" Then, ask, \"Why do you think being a vegetarian is pointless? What is your perspective?\""
    },
    {
      "title": "Have fun.",
      "content": "Have fun. Have fun with your partner by doing things that both of you have never done before, and by creating routines or traditions for the two of you. By exploring new experiences and making new memories together, you and your partner can strengthen your bond. New experiences will create memories that you and your partner can reminisce and laugh about in the future, as well. [14] X Research source If you live near the beach, you can learn to surf or paddle board together. Or, have you ever bungee jumped off of a bridge? If not, this might be something that you and your partner find exciting. It can also be something simple, too, like taking a photography class together."
    },
    {
      "title": "Spend quality time together.",
      "content": "Spend quality time together. Quality time can also strengthen a relationship. These are activities where you and your partner can explore your feelings for each other. [15] X Research source For example, plan a romantic getaway for you and your partner. You don't need to travel far for it to be romantic. Make a reservation at a bed and breakfast in the city you live in, or in a city or the countryside that is only a couple hours away."
    },
    {
      "title": "Be affectionate.",
      "content": "Be affectionate. Be more affectionate with your partner by checking in during the work day to see how their day is going. Whether it's a text or email, sign your messages by saying, \"Thinking of you\" or \"Thanks sweetie.\" [16] X Research source You can also be more affectionate by kissing your partner more passionately. Instead of a peck kiss or a kiss on the check, let your lips linger and maintain eye contact after the kiss. You can even say something like, \"I missed you, today\" or \"I missed kissing you.\" Holding hands is also a simple, yet casual way of showing that you care for your partner."
    }
  ]
}