{
  "url": "https://www.wikihow.com/Build-a-Garden-Tractor-Snowplow",
  "title": "How to Build a Garden Tractor Snowplow",
  "steps": [
    {
      "title": "Make sure your tractor can handle the weight of the plow blade.",
      "content": "Make sure your tractor can handle the weight of the plow blade. Your tractor will also need to be able to bear the weight of the plough blade on its frame. Don’t attempt the conversion unless you are sure it can handle it. Rather than risk converting the mower yourself, consider purchasing one that already has a snow plough attachment available from the manufacturer. John Deere tractors offer this as an option."
    },
    {
      "title": "Get your tractor serviced before putting the plow on.",
      "content": "Get your tractor serviced before putting the plow on. You’re advised to get your tractor serviced before you begin. Check the frame carefully for rust. Rust will weaken the structure, making it less likely that it will be able to bear the weight of a snow plough blade at the front while also being able to push snow out of the way."
    },
    {
      "title": "Consider putting snow chains on your tires.",
      "content": "Consider putting snow chains on your tires. Remember also that garden tractor tires aren’t usually intended for use on snow. You might like to consider fitting snow chains to the tires in addition to converting the front fitting. [1] X Research source Wheel weights may also help rebalance the vehicle."
    },
    {
      "title": "Double check that your tractor has what it takes to hold the plow.",
      "content": "Double check that your tractor has what it takes to hold the plow. Not all ride-on tractor mowers will be suitable for turning into a snow plough. Some cheap models won’t be heavy or sturdy enough or have enough horsepower to push deep snow out of the way."
    },
    {
      "title": "Choose your materials for the plow.",
      "content": "Choose your materials for the plow. You’ll need to find something to form the shovel or blade of your snowplow. Items you can use to make this include: [2] X Research source A half oil drum or piece of flat steel sheet about a quarter inch thick."
    },
    {
      "title": "Form your steel sheet into a plow.",
      "content": "Form your steel sheet into a plow. If using a steel sheet, cut a piece about twice as wide as your tractor and about one and a half times as tall as the front of the tractor. Using a piece of chalk, mark out five sections of equal height along the vertical length of what will be your plow bucket. You’ll want to fold in the top and bottom quarters of the bucket to create curved edge to scoop the snow."
    },
    {
      "title": "Bend the sheet.",
      "content": "Bend the sheet. You can bend this sheet by scoring the metal (cutting a shallow groove in it, not all the way through). This will enable you to bend the steel into shape by hammering it between pieces of wood. Once bent, weld the sheet into place at the bend to make sure it retains its shape."
    },
    {
      "title": "Try using an oil drum if you don’t have a steel sheet.",
      "content": "Try using an oil drum if you don’t have a steel sheet. If you don’t have sheet metal, you could try using an old oil drum cut in half or something like an old hot water tank. Oil drums are likely to be lightweight, which means that they will work better for a lighter frame tractor. They will also cut through the snow well but they are also likely to buckle under pressure. [3] X Research source Remember that there will be sharp edges where you cut so make sure to store it where someone, like a child, will not be able to reach it."
    },
    {
      "title": "Make a bracket on the frame of your tractor.",
      "content": "Make a bracket on the frame of your tractor. On most models of tractor you’ll need to make a bracket on the frame and bring that forward slightly in order to position the plowing blade at the front. [4] X Research source You can use reclaimed steel joists, or something like metal trusses, as these are adaptable and usually strong enough for the purpose. A welding tool is likely to be useful in attaching the bracket to the vehicle’s frame. Try to remove the motor deck and cutting tool before doing this, both for safety reasons and ease of access."
    },
    {
      "title": "Weld the plough bucket onto the frame.",
      "content": "Weld the plough bucket onto the frame. You now need to attach the plough bucket or blade to the frame using a welding tool. Try to incorporate a pin or lever to allow the plough bucket to manoeuvre side to side. Add a hand-operated lever to the bucket so it can be pushed to manoeuvre it while you are sitting on the tractor. [5] X Research source If you are left-handed, consider doing this on the left-hand side."
    },
    {
      "title": "Make a lift.",
      "content": "Make a lift. If you want to incorporate a lift mechanism, you may need to modify the frame slightly to allow for this. You’ll probably need to create a hand or foot lever so the bucket can be lifted by the person riding the mower."
    },
    {
      "title": "Make sure you get the right size of snow chain for your wheels.",
      "content": "Make sure you get the right size of snow chain for your wheels. Special garden equipment snow chains are available. Check the tire to see what the wheel size it (it should be written on the tire). Your local garden store may carry these, or you can purchase them online."
    },
    {
      "title": "Put your snow chains on.",
      "content": "Put your snow chains on. Start fitting your snow chains by laying the chain out on the ground by the side of the tractor wheel. Remove any tangles and check for any damage. Drape the chain over the wheel. You’ll then need to move the tractor forward a few inches to wrap the chain around the tire. Finally, clip the chain into place and do up the rest of the fittings so it is securely fastened around the tire and tight enough to grip the snow as required."
    },
    {
      "title": "Put some weight on the back end of your tractor.",
      "content": "Put some weight on the back end of your tractor. For stability, consider adding some weight onto the back end of your tractor to balance out the new weight at the front added by the snowplow blade. To do this: [6] X Research source Strap bricks to the back of the tractor. Wheel weights may also help stabilize and balance your tractor."
    }
  ]
}