{
  "url": "https://www.wikihow.com/Choose-Makeup-for-Your-Skin-Tone",
  "title": "How to Choose Makeup for Your Skin Tone",
  "steps": [
    {
      "title": "Look at your skin in natural lighting to determine your overtone.",
      "content": "Look at your skin in natural lighting to determine your overtone. The overtone of your skin refers to the initial color you see and how dark or light that color is. Go somewhere with natural lighting and then look closely at your skin to determine your overtone accurately. If your skin is an ivory or cream color, it’s likely considered light. You probably have medium skin if your overtone is closer to a caramel or tan color. If your skin is a chocolate or mocha brown color, your skin is probably dark."
    },
    {
      "title": "Use a piece of white paper to determine your undertones.",
      "content": "Use a piece of white paper to determine your undertones. Stand in front of a mirror and hold up a piece of white paper next to your face. Then compare your skin color to the white of the paper. [1] X Research source If your skin looks more yellow than the paper, you likely have warm undertones. If your skin looks pinker than the paper, you probably have cool undertones. If your skin looks peachy, or neither yellow nor pink, then you likely have neutral undertones."
    },
    {
      "title": "Look at your veins to clarify your undertones.",
      "content": "Look at your veins to clarify your undertones. If the white paper test doesn’t quite give you an answer, take a look at the veins in your wrists. Stand near a window or outside and hold your hands palm up. Look closely at the veins in your wrists. [2] X Research source If your veins look blue or purple, you probably have cool undertones. If your veins look green, you likely have warm undertones. If you have some bluish veins and some greenish ones, you probably have neutral undertones."
    },
    {
      "title": "Look for foundations that match your overtone and undertones.",
      "content": "Look for foundations that match your overtone and undertones. Most foundations will say right on the bottle which overtone they’re meant for. You can also tell which undertones the foundations are meant for by the names of the colors. Pick a few colors that you think might work. If you have a warmer skin tone and you use a foundation meant for cooler complexions, the makeup will look yellow on your skin. On the other hand, if you have cooler skin and you use a neutral-warm foundation or powder, it will oxidize and leave a ring around your face. [3] X Expert Source Frankie Sanderson Makeup Artist & Stylist Expert Interview. April 14, 2020."
    },
    {
      "title": "Test the foundation on your jawline.",
      "content": "Test the foundation on your jawline. It’s important to test the foundation on you face, instead of your wrist or neck, because that’s where it will be applied. However, it’s also important that you pick a foundation that’s not too far from your neck color, as you want the foundation to provide a seamless transition from your face to your neck. By applying the foundation to your jawline, you’ll be able to make sure it matches your face, and also see how it compares to your neck. [4] X Research source Try visiting a beauty store where you're allowed to try out the products before you buy them. You can even ask a makeup artist to match you with a product that's right for your skin type and color. [5] X Expert Source Frankie Sanderson Makeup Artist & Stylist Expert Interview. April 14, 2020."
    },
    {
      "title": "Examine the foundation under different lighting sources.",
      "content": "Examine the foundation under different lighting sources. To make sure that your foundation is a true match, you should see how it looks under different lighting. The store you're in will likely have fluorescent lighting. You can also move toward a window (if possible) to see how it looks in natural light."
    },
    {
      "title": "Select the foundation that fully blends into your skin.",
      "content": "Select the foundation that fully blends into your skin. If your foundation is a match, it will basically disappear when you put it on. In other words, your skin will look airbrushed – more even – but won’t change color. When you're looking for makeup products, choose a quality product that gives you a good color payoff. [6] X Expert Source Frankie Sanderson Makeup Artist & Stylist Expert Interview. April 14, 2020. If you prefer less coverage, try using a tinted moisturizer to add just a little color to your skin. You can even build it up to get a little more coverage in areas that need it. [7] X Expert Source Frankie Sanderson Makeup Artist & Stylist Expert Interview. April 14, 2020."
    },
    {
      "title": "Create a custom color if you can’t find 1 color that works.",
      "content": "Create a custom color if you can’t find 1 color that works. Depending on your overtone and undertones, you might not be able to find a single foundation that works for you. In that case, you can either mix 2 colors of foundation together to create a custom shade, or add some bronzer or blush to 1 color of foundation. Getting the exact color of foundation you need with this approach can take a lot of experimenting, so be patient! When in doubt, go with a foundation that’s slightly lighter than your overtone. You can easily add warmth and color with bronzer to make it a little darker, but it can be challenging to lighten a foundation that’s slightly too dark. You may need to adjust your foundation with the seasons. If you tan in the summer, make sure to use a slightly darker shade during that time of year."
    },
    {
      "title": "Go for a peach if you have fair skin and warm undertones.",
      "content": "Go for a peach if you have fair skin and warm undertones. Peach is a light, soft color that won’t likely look too stark against your light skin. Also, the soft orange in the peach should highlight your natural yellow and golden undertones. [8] X Research source"
    },
    {
      "title": "Opt for plum if you have fair skin and your undertones are cool.",
      "content": "Opt for plum if you have fair skin and your undertones are cool. Plum is a great choice for this skin color because it shouldn’t stand out too harshly against your light skin. Plum blushes should complement your blue or pink undertones nicely. [9] X Research source"
    },
    {
      "title": "Use a mauve blush for medium skin with warm undertones.",
      "content": "Use a mauve blush for medium skin with warm undertones. This skin color is often also referred to as “olive.” Go for a mauve blush to highlight both your warm overtone and warm undertones if your skin is olive."
    },
    {
      "title": "Go for plums and pinks if you have medium skin and cooler undertones.",
      "content": "Go for plums and pinks if you have medium skin and cooler undertones. These colors should go well with your skin’s pink or blue tint. Additionally, pinks and plums shouldn’t be too stark against your medium skin, but they also aren’t too light to show up on your skin. [10] X Research source"
    },
    {
      "title": "Stick with orange blushes if your skin is dark and your undertones are warm.",
      "content": "Stick with orange blushes if your skin is dark and your undertones are warm. If you’ve got a more chocolate overtone and you undertones are yellowish, this is the way to go. While oranges would look too intense on other skin colors, they’ll likely look flattering on yours."
    },
    {
      "title": "Try a shimmery berry color if you have dark skin with cool undertones.",
      "content": "Try a shimmery berry color if you have dark skin with cool undertones. Berry-colored blushes should play off of your bluish, reddish, or pinkish undertones well. Additionally, this color should complement your darker overtone."
    },
    {
      "title": "Pick a blush based on your overtone alone if your undertones are neutral.",
      "content": "Pick a blush based on your overtone alone if your undertones are neutral. Those with neutral undertones can typically wear both blushes that are warmer, such as peach, and cooler, such as berry. If you have neutral undertones, just go with a blush color that’s more vibrant if you have darker skin and a little softer if you have lighter skin. Try oranges or berries if you have dark skin, mauves or pinks if you have medium skin, and plums or peaches if you have light skin."
    },
    {
      "title": "Use a highlighter with a white sheen on fair skin.",
      "content": "Use a highlighter with a white sheen on fair skin. Highlighters that have an icy-white, champagne, or ivory sheen look great on fair skin. They’ll make your skin look bright without washing you out. If you’re worried about looking too pale, apply a light pink blush to your cheeks first and then swipe your highlighter over it. [11] X Research source"
    },
    {
      "title": "Choose a peach highlighter for medium skin with cool undertones.",
      "content": "Choose a peach highlighter for medium skin with cool undertones. The peach in the highlighter will complement the cool undertones in your skin. It will also give your medium skin a warm, rosy glow. [12] X Research source"
    },
    {
      "title": "Use a gold highlighter on medium skin with warm undertones.",
      "content": "Use a gold highlighter on medium skin with warm undertones. Medium skin with warm undertones naturally lends itself to tanning in the summer. Using a gold-colored highlighter on warm, medium skin will create a similar look. [13] X Research source"
    },
    {
      "title": "Use rose-gold or bronze highlighter on dark skin.",
      "content": "Use rose-gold or bronze highlighter on dark skin. Make sure your highlighter has a lot of pigment – you don’t want to use a highlighter that’s too light. Stay away from any opalescent shades: instead of making your skin look dewy, it can make it look gray. [14] X Research source"
    },
    {
      "title": "Wear softer colors if you have light skin.",
      "content": "Wear softer colors if you have light skin. Soft colors such as pinks, beiges, or golds can give your eyes a pop of color without appearing too intense against your light skin. Try using these as your primary shadow, and then apply a conservative amount of a similar shimmery shade on the center of your lids and near your tear ducts to take your look up a notch. Avoid bold eye shadow colors. If you have warm undertones, pinks and beiges will look great. Golds and tans look great if you have cool undertones."
    },
    {
      "title": "Use caramel and honey shades for a natural look on medium skin.",
      "content": "Use caramel and honey shades for a natural look on medium skin. These dewy, warm shades will complement your overtone without making your makeup look too overwhelming. But if you have medium skin you can also try bolder, brighter colors and pastels. Caramel is best for medium skin with warm undertones. Honey looks great on medium skin with cool undertones."
    },
    {
      "title": "Use burnt metallic or bright berry colors if you have dark skin.",
      "content": "Use burnt metallic or bright berry colors if you have dark skin. Your dark skin will complement pretty much any bold, deep color you can get your hands on! Burnt metallics like copper or bronze will look great on your eyes. So will bright berry colors like plum and dark blue. A burnt metallic like copper or bronze will look great on dark overtones with warm undertones. Bright berries like raspberry or grape will highlight dark overtones with cool undertones."
    },
    {
      "title": "Choose pink lipsticks for very fair skin.",
      "content": "Choose pink lipsticks for very fair skin. For a regular daytime look, soft pink lipsticks or clear lip glosses may look best on light skin. Go for a brighter pink or even a red lipstick for a bold look on a night out."
    },
    {
      "title": "Use red lipstick if you have fair skin with cool undertones.",
      "content": "Use red lipstick if you have fair skin with cool undertones. Dark red lipsticks tend to have cooler undertones themselves, so they’ll complement your skin. They’ll also make the rest of your face look very bright. [15] X Research source"
    },
    {
      "title": "Wear orange hues if you have fair skin with warm undertones.",
      "content": "Wear orange hues if you have fair skin with warm undertones. The orange in your lipstick will complement the warmth in your skin without overwhelming your fair coloring. Orange-hued shades will also brighten your skin. [16] X Research source"
    },
    {
      "title": "Choose from a variety of nudes, pinks, and reds for medium skin.",
      "content": "Choose from a variety of nudes, pinks, and reds for medium skin. If you have medium skin, there are likely a lot of different shades that will be flattering. If going for a more daytime look, focus on natural pinks and mauve-browns that make your lips look like a slightly brighter version of themselves. [17] X Research source If you’re going for a nighttime look, opt for vibrant pinkish red lipsticks. [18] X Research source Mauves look best if you have warm undertones. Browns look better if you have cool undertones."
    },
    {
      "title": "Choose purples and berries for dark skin.",
      "content": "Choose purples and berries for dark skin. Your dark skin will be beautifully complemented by darker lipstick shades, especially purples or berries. Dark, dark reds will also look great on your lips. [19] X Research source The darkest reds look best if you have warm undertones. Berries and purples will complement cool undertones."
    }
  ]
}