{
  "url": "https://www.wikihow.com/Build-a-LEGO-Car",
  "title": "How to Build a LEGO Car",
  "steps": [
    {
      "title": "Gather your LEGO materials.",
      "content": "Gather your LEGO materials. If you are following a set of instructions for an official LEGO car set, make sure you have the instructions and all the pieces needed for your car. If you are designing your own car, make sure you have a variety of LEGO pieces handy so that you can create whatever you want. For a very basic LEGO car, you will need a minimum of 4 tires of the same size, 2 axles of the same size, and at least one long LEGO piece to connect them. LEGO also manufactures pieces like steering wheels, seats, windshields, and car doors that you may enjoy adding to enhance your car’s details."
    },
    {
      "title": "Find a safe, clear space to build the car.",
      "content": "Find a safe, clear space to build the car. A table or desk near a bright lighting source is a good place to build a LEGO car. You want to find a space that’s big enough for you to spread out your pieces (and instructions, if you’re using them). LEGO pieces are small and can pose a choking hazard to pets and small children if they’re left lying around. If they’re left on the floor they might also be stepped on, which can be painful. Building on the floor will work, but keep an eye on your pieces to make sure they stay in a contained area."
    },
    {
      "title": "Spread your LEGO pieces neatly in front of you.",
      "content": "Spread your LEGO pieces neatly in front of you. Organize the pieces by size and shape, so it is easier to pick the pieces you need. If working with small children, make sure the children do not put the LEGO pieces in their mouths, as they are a choking hazard."
    },
    {
      "title": "Gather your pieces.",
      "content": "Gather your pieces. This simple car can be built using LEGO pieces that almost everyone has. You will need several different types of pieces for this car, and you can vary the pieces used based on what you have. Measurements for LEGO pieces are given in \"stud\" count (the \"dots\" on many LEGO pieces). A brick that is 2 studs wide by 4 studs long is a 2x4. For the chassis you will need 4 tires of the same size, 2 rectangular axles of the same size, and a thin 4x12 plate (the long, thin LEGO pieces). For the body, you will need 2 2x2 bricks, 6 2x4 bricks, 4 1x2 bricks, 1 1x4 brick, 2 2x2 clear angular bricks, 1 LEGO windshield, and 1 LEGO steering wheel piece."
    },
    {
      "title": "Snap tires to axle pieces.",
      "content": "Snap tires to axle pieces. The axle pieces are small square or rectangular pieces that have prongs on either side. Snap one tire to each prong. When finished, you should have two sets of wheels connected by the axles. Make sure the axle pieces and tires fit together snugly. The tires should be secure, but still able to spin freely. Make sure your tires and base piece are proportionate. Tiny tires will not adequately support a larger LEGO car, and will impede speed and movement."
    },
    {
      "title": "Build the front hood.",
      "content": "Build the front hood. You’ll need 2 2x2 square bricks and two 2x2 clear angular bricks. Alternately, you could use one 2x4 brick and two 2x2 clear angular bricks. Snap the clear bricks to the top of the square bricks. Attach the pieces you just completed to the front end of your car. Make sure the end of the plate is flush with the edge of the pieces you attached."
    },
    {
      "title": "Build the windshield section.",
      "content": "Build the windshield section. This piece will sit directly behind the hood you just built. You will need 2 2x4 bricks and a 2x4 LEGO windshield piece. Stack two 2x4 bricks together. Snap on the windshield piece. Attach this section to the plate just behind the piece you attached in Step 3."
    },
    {
      "title": "Build the cab.",
      "content": "Build the cab. You will need 1 2x4 rectangular brick, 2 1x2 rectangular bricks, and a 1x2 LEGO steering wheel piece. Snap the 1x2 bricks to either end of the 2x4 brick. It should look a little like a short “u” when you’re finished. Position the steering wheel in the space between the 1x2 bricks. The piece should be on the back row of studs with the wheel facing you. Press into place. Attach this section to the base just behind the windshield section. Build the body of the car. You will need 1 2x4 brick and 2 1x2 bricks. Snap these together to form a “u.\" Attach this section to the plate just behind the cab."
    },
    {
      "title": "Build the back end and “spoiler.”",
      "content": "Build the back end and “spoiler.” You will need 2 2x4 bricks, 1 1x4 brick, and 1 2x4 plate (thinner than the bricks). Stack the two 2x4 bricks. Snap the 1x4 brick to the back of this stack. Press the plate onto the 1x4 brick so that it hangs off the back of the structure a little. It should look like the little “wing” on the back of a sports car. Attach this section to the base just behind the body section."
    },
    {
      "title": "Press your axle pieces onto the underside of the plate.",
      "content": "Press your axle pieces onto the underside of the plate. One should go under the front of the base and one under the rear. The front edge of the front wheels should line up approximately with the front end of the base piece. The back edge of the rear tires should line up approximately with the rear end of the base piece. If the tires are obstructed, change the width of the base piece, or find two longer, matching axle pieces."
    },
    {
      "title": "Select a LEGO figurine.",
      "content": "Select a LEGO figurine. Bend the figurine at its waist so it’s sitting and place it in the space behind the steering wheel."
    },
    {
      "title": "Enjoy your car!",
      "content": "Enjoy your car! If it moves too slowly, the car may be too big for the base piece and the tires. You can experiment with different designs to get the look and power you want."
    },
    {
      "title": "Select your bricks.",
      "content": "Select your bricks. You will need some specialized bricks for this build, such as bricks with holes in them, thin rod-type axles, and separate wheel rims and tires. These come in LEGO Technic sets, or you can buy them separately from a LEGO Store or online. [1] X Research source You will need 2 1x10 bricks with holes in the sides, 1 2x4 plate (thinner than a 2x4 brick), 1 8x4 plate, 1 1x4 brick, 1 2x4 brick, 1 2x2 brick, 1 2x8 brick, 2 Technic axles, 4 LEGO wheel rims, and 4 LEGO tires. [2] X Research source You will also need 2 rubber bands."
    },
    {
      "title": "Attach the tires to the wheel rims.",
      "content": "Attach the tires to the wheel rims. For optimal energy transfer, you should have two larger wheels for the back and two smaller wheels for the front. Set these aside for now."
    },
    {
      "title": "Build the car chassis.",
      "content": "Build the car chassis. Place the 1x10 bricks side by side, like railroad tracks. Snap the 2x4 plate and 8x4 plate to the tops of the bricks. Now you should have a chassis that is 4x10."
    },
    {
      "title": "Build the car body.",
      "content": "Build the car body. This will be the structure that the rubber band attaches to in order to create the power to move the car. Snap the 1x4 brick to the very front of the chassis. Forming a “T” shape, snap the 2x4 brick to the middle of the plate just behind the brick you just placed. Snap the 2x2 brick to the very back of the chassis. Place it in the middle of the plate so there is 1 stud on either side. Attach the 2x8 brick so that it covers the last 2 studs of the “T” shape. The back of this brick should hang out over the back end of the chassis."
    },
    {
      "title": "Tie the rubber bands in a cow hitch knot.",
      "content": "Tie the rubber bands in a cow hitch knot. This is an easy knot you can tie with two closed loops (like rubber bands are). Wrap one rubber band around the finger and thumb of your non-dominant hand. Slip the other band through the center of band #1 and pull about halfway through. Slide one end of band #2 through the loop formed by its other end and pull to secure."
    },
    {
      "title": "Place the back axle.",
      "content": "Place the back axle. Slide one axle through the last hole of the 10x1 bricks at the very back of your car. Attach a wheel to either end of the axle."
    },
    {
      "title": "Attach the knotted rubber bands to the back axle.",
      "content": "Attach the knotted rubber bands to the back axle. To do this, slide one end of one band up and under the axle until you can see a little loop. Thread the other end of the bands and pull to secure."
    },
    {
      "title": "Pull the rubber band up and over the top of your car body.",
      "content": "Pull the rubber band up and over the top of your car body. The band should run under the whole length of the chassis. Slip the end of the rubber band under the protruding part of the very top brick."
    },
    {
      "title": "Place the front axle.",
      "content": "Place the front axle. Slide the other axle through the first hole of the 10x1 bricks at the very front of your car. Make sure the rubber band is under the axle. Attach a wheel to either end of the axle."
    },
    {
      "title": "Make the car go.",
      "content": "Make the car go. To wind up the car, place the car on a flat, smooth surface and pull the it backwards. This will build up tension in the rubber band. When you let go, it should go speeding away!"
    },
    {
      "title": "Build a basic LEGO car.",
      "content": "Build a basic LEGO car. The design in this part creates a “dragster”-style car that is very light and has a low, stable center of gravity. You can design your own car, but try to keep it lightweight and low to the ground. For this design, you will need 2 rectangular axles, 4 tires of equal size, 4 2x8 bricks, 8 2x4 bricks, 2 1x2 bricks, and a thin plate at least 2x4 (but a longer plate is better). You will also need one small party balloon. [3] X Research source"
    },
    {
      "title": "Place the 2x8 bricks together end-to-end in two rows.",
      "content": "Place the 2x8 bricks together end-to-end in two rows. Each row should be 2x16 now. Snap a 2x4 brick to the top of each row to connect the 2x8 bricks."
    },
    {
      "title": "Turn the connected bricks over.",
      "content": "Turn the connected bricks over. Snap the thin plate to the bottom of both rows so that they are connected. Attach the tires to the axles. Place an axle at each end of the car. Turn the body over. You should now have a car body that is 4x16 with the two 2x4 bricks on top and wheels on the bottom."
    },
    {
      "title": "Stack 5 2x4 bricks together.",
      "content": "Stack 5 2x4 bricks together. Snap this column to the back of your car body. Make sure the bricks are connected snugly, but don’t press too hard or you might break the car body. Snap the 1x2 bricks to the top of the 2x4 column. Place one at each end to create a little hollow in the middle. Attach the final 2x4 brick to the top of the column. You should have a small hole in the middle of the column near the top."
    },
    {
      "title": "Thread the balloon through the hole.",
      "content": "Thread the balloon through the hole. In order to propel your car, you will want the body of the balloon to be placed over the body of your car. Slip the neck of the balloon through the hole, but don’t pull the balloon all the way through."
    },
    {
      "title": "Inflate the balloon.",
      "content": "Inflate the balloon. You may find it easier to blow up the balloon if you pick up the car and hold it close to your face while you inflate it. When the balloon is inflated, pinch the neck with your fingers to keep the air in."
    },
    {
      "title": "Place your car on a flat, smooth surface.",
      "content": "Place your car on a flat, smooth surface. Release the neck of the balloon. Your car should speed away from you as the air pushes out of the balloon!"
    }
  ]
}