{
  "url": "https://www.wikihow.com/Clean-Grip-Tape",
  "title": "How to Clean Grip Tape",
  "steps": [
    {
      "title": "Buy a soft wire brush.",
      "content": "Buy a soft wire brush. The bristles should be sturdy, but not sharp enough to tear your grip tape. You can buy a good metal brush for a few bucks at your local hardware store, or get a specialty one from your local skate shop. Small brushes allow for precision. A firm toothbrush will also work."
    },
    {
      "title": "Brush the grip tape thoroughly.",
      "content": "Brush the grip tape thoroughly. Start from one end of the board and work your way to the other, going section by section. This brings deeper dirt to the surface, and you’ll be able to sweep most of it off with your hand. Don’t push so hard that the grip tape starts tearing. Avoid stripping the grit. Keep going until there are no more dirty spots. If there are deep stains that won’t come out, you might want to replace the grip altogether."
    },
    {
      "title": "Remove leftover grime with grip gum.",
      "content": "Remove leftover grime with grip gum. Most skate shops sell grip gum meant specifically for skateboards, and they’re great products for cleaning. Rub at the grip tape like you would with a pencil eraser, then brush away the residue. Doing a thorough pass with grip gum will leave your board looking brand new. A rubber cement eraser from an art store is a cheap alternative."
    },
    {
      "title": "Buy a soft wire brush.",
      "content": "Buy a soft wire brush. Pick up a cheap metal brush with stiff bristles at your local hardware store, or buy one from your a skate shop. Small brushes allow for precision. A firm toothbrush will also work."
    },
    {
      "title": "Fill a bowl with soapy water.",
      "content": "Fill a bowl with soapy water. Longboards are thicker and more resistant to water than shortboards, so it’s okay to use liquids on them. Mix tap water with a little bit of soap to brew up the ideal skateboard cleaning concoction. You should only need a medium-sized bowl to wash every inch of your grip tape. Add lemon for a clean smell. Don’t submerge your longboard. Window cleaner can also be used to clean grip tape on longboards."
    },
    {
      "title": "Dip your brush in the bowl and scrub your grip tape.",
      "content": "Dip your brush in the bowl and scrub your grip tape. Start at one end of the board and work your way to the other, taking time to really dig into the messier spots. Longboards have thick grip tape and it may take a while to loosen all of the dirt. Rinse your brush in the bowl whenever it gets dirty. Don’t let water pool on your board. Liquids can seep into the wood and do damage to the structure. Pushing too hard will tear the grip and strip grit from the tape."
    },
    {
      "title": "Dry the grip and board with a microfiber cloth.",
      "content": "Dry the grip and board with a microfiber cloth. Lay the cloth across the top of your board and pat to soak up moisture. Then fold the cloth and press against the grip tape until the tape is mostly dry. Make sure the bottom wood is also dry. Don’t use paper towels, as that will break apart and make a huge mess. Grip tape might start to peel if it’s not dried thoroughly."
    },
    {
      "title": "Allow your board to dry for at least three hours.",
      "content": "Allow your board to dry for at least three hours. Riding a wet or damp skateboard can have negative effects. If, by chance, water got into the wood of your longboard, riding it might bend or warp the whole thing. Then it might not roll straight. Just be safe and let your board dry completely before using it."
    },
    {
      "title": "Use grip gum if there is still residue.",
      "content": "Use grip gum if there is still residue. Rub it across the grip tape like you would with a regular pencil eraser, then brush away the residue left behind. Stop by your local skate shop to buy some grip gum. You can also use a cheap rubber cement eraser from an art store."
    }
  ]
}