{
  "url": "https://www.wikihow.com/Change-Snooze-Time-on-iPhone",
  "title": "Easy Ways to Adjust the Snooze Time on an iPhone",
  "steps": [
    {
      "title": "Open the Clock app.",
      "content": "Open the Clock app. This app icon looks like a black and white clock face. [1] X Research source You can open the app by tapping the icon on the Home screen or you can open it from Control Center. Set up multiple alarms without the default snooze time to create your own snooze alarms."
    },
    {
      "title": "Tap Alarm, then tap +.",
      "content": "Tap Alarm , then tap + . This will create a new alarm that you can customize. [2] X Research source"
    },
    {
      "title": "Set a wake-up time.",
      "content": "Set a wake-up time. Change the dial to represent the time you want your alarm to go off, like 7:00am."
    },
    {
      "title": "Tap the toggle next to \"Snooze\" to turn it off .",
      "content": "Tap the toggle next to \"Snooze\" to turn it off . A grey switch means the default 9-minute snooze alarm is disabled."
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . This will save your alarm. [3] X Research source You'll see an alarm in your Alarms tab for your set time."
    },
    {
      "title": "Tap + again.",
      "content": "Tap + again. This will create another new alarm that you can customize."
    },
    {
      "title": "Set a wake-up time.",
      "content": "Set a wake-up time. Change the dial to represent the time you want your alarm to go off, like 7:05am."
    },
    {
      "title": "Tap the toggle next to \"Snooze\" to turn it off .",
      "content": "Tap the toggle next to \"Snooze\" to turn it off . A grey switch means the default 9-minute snooze alarm is disabled."
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . This will save your alarm. You will see two alarms in your Alarms tab: one goes off at 7:00am and another will go off at 7:05am."
    },
    {
      "title": "Create and save any additional alarms you want to use as snooze alarms.",
      "content": "Create and save any additional alarms you want to use as snooze alarms. You can create as many alarms as you need this way. Remember to disable the default \"Snooze\" setting. [4] X Research source"
    },
    {
      "title": "Open Progressive Alarm Clock.",
      "content": "Open Progressive Alarm Clock. This app icon features a sunrise. If you don't have this app, you can get it cheaply from the App Store. [5] X Research source This app claims that it will wake you up gently using Tibetan singing bowl sounds that gradually increase in loudness."
    },
    {
      "title": "Set your alarm time.",
      "content": "Set your alarm time. Tap the drop-down next to \"Alarm Time\" to set when you want the alarm to go off."
    },
    {
      "title": "Tap Options.",
      "content": "Tap Options . You'll see this under the alarm time drop-down."
    },
    {
      "title": "Tap Snooze Time.",
      "content": "Tap Snooze Time . It's near the top of the menu."
    },
    {
      "title": "Choose your preferred snooze time.",
      "content": "Choose your preferred snooze time. You can opt for your alarm to sound again between 1- and 30-minutes."
    },
    {
      "title": "Navigate back to the alarm menu and tapStart.",
      "content": "Navigate back to the alarm menu and tap Start . You can tap the back arrow next to \"Options\" at the top of your screen to return to the main menu. Tapping Start will turn the alarm with your snooze times on. You'll find tons of apps for iPhone that claim to work like this, which include apps like Sleep Cycle - Sleep Tracker, Alarm Clock for Me, and Wake Up Time."
    },
    {
      "title": "Open Alarmy.",
      "content": "Open Alarmy. This app icon features an old-fashioned alarm clock icon. If you don't have this app, you can get it for free from the App store. [6] X Research source Alarmy claims that it's not a normal alarm, and will prompt you to get out of bed with different missions, like to take a photo of your room or complete a few math problems."
    },
    {
      "title": "Tap your alarm.",
      "content": "Tap your alarm. If you don't see a list of alarms, you can tap the clock icon at the bottom of your screen. To add a new alarm, tap + ."
    },
    {
      "title": "Tap Snooze.",
      "content": "Tap Snooze . You'll then see options so you can customize the snooze time on your alarm."
    },
    {
      "title": "Tap a snooze duration, then tap Done.",
      "content": "Tap a snooze duration, then tap Done . You can set up a 1- to 60-minute snooze, then tap Done to continue. Your selected snooze time will have a checkmark next to it so you know what you've selected. When you tap Done , the snooze menu will close and your alarm will work with the snooze time you indicated. You'll find tons of apps for iPhone that claim to work like this, which include apps like Sleep Cycle - Sleep Tracker, Alarm Clock for Me, and Wake Up Time."
    }
  ]
}