{
  "url": "https://www.wikihow.com/Breed-Canaries",
  "title": "How to Breed Canaries",
  "steps": [
    {
      "title": "Purchase breeding supplies.",
      "content": "Purchase breeding supplies. In addition to the basic supplies you should already have for your birds, you will need a large cage for the canaries to breed in, a nest for the female to lay its eggs in, and nesting material the female will use to build up the nest. You may also need a light to shine on the cage if your region is getting less than 14 hours of light each day. There are special breeding cages available that first allow the male and female canary to become accustomed to one another without allowing contact. These cages have a divider down the middle that can be removed when you are ready to allow your canaries to mate. Nests for breeding canaries are available from specialty pet supply providers. If you buy a pre-made nest, you will also need to buy your canaries some nesting material that they can add to the pre-made nest."
    },
    {
      "title": "Keep canaries separated until time to breed.",
      "content": "Keep canaries separated until time to breed. Unless actively breeding, canaries must be kept in their own cages. Males tend to fight and a male might kill the female if she is not ready to breed. Their cages can, however, be kept in the same room."
    },
    {
      "title": "Watch for signs that the canaries are in \"condition,\" or ready to breed.",
      "content": "Watch for signs that the canaries are in \"condition,\" or ready to breed. Breeding usually occurs in the Spring. Canaries like to breed when the temperature is around 70 degrees and there are about 14 hours of light. These conditions can be replicated indoors, in order to promote breeding. Male and female canaries act differently when they are ready to breed. Male canaries will usually come into condition before the female. Signs that they're ready to mate include dropping their wings when they sing and singing harsher and louder songs. They may also dance around on their perch and be more territorial when other males are nearby. Females will most often begin to tear paper, as if readying a nest, when they come into condition. The most certain sign of their readiness, however, is when their vent appears red and swollen. They may also raise their tails and appear to squat when males are nearby."
    },
    {
      "title": "Place the male and female canaries near each other, but not in the same cage.",
      "content": "Place the male and female canaries near each other, but not in the same cage. [1] X Research source Put their cages side by side or place both birds in a special breeding cage that has a central divider. This will get the birds used to each other and their behavior with each other will tell you if they are ready to mate."
    },
    {
      "title": "Add a nest to the female's side of the breeding cage.",
      "content": "Add a nest to the female's side of the breeding cage. If you are just using a large cage instead of a breeding cage, simply place the nest in the female's cage. Once the female has begun adding nesting material to her nest, it is a sign that she is getting ready to mate. [2] X Research source"
    },
    {
      "title": "Feed a proper diet.",
      "content": "Feed a proper diet. Nesting canaries should be fed a proper diet that consists of pelleted food, enriched seed, soft food, and additional calcium from a few weeks before breeding until they are done feeding their chicks. A cuttle-bone or grit is recommended to give the hen the additional calcium required for producing healthy eggs. These specialty foods are available through pet supply companies."
    },
    {
      "title": "Place the canaries together once there are signs they are ready to breed.",
      "content": "Place the canaries together once there are signs they are ready to breed. This can be indicated by kissing between the canaries and the female beginning to putting nesting material in the nest. If both are in condition, your male and female canaries will begin to \"kiss\" through the bars of the wire partition by touching beaks. Kissing may happen right away or it may take a few days after you place the canaries near each other. Once they are ready to breed, you can put them in the same cage. Watch for any fighting. If they begin to fight, separate them immediately and watch for signs that they're still both in condition. However, mating can be relatively aggressive, so be sure that you are not witnessing breeding instead of regular fighting."
    },
    {
      "title": "Watch for breeding behavior.",
      "content": "Watch for breeding behavior. This will begin with the male courting the female canary. Once she is ready, she will crouch down, signaling her willingness. The male will then mount the female is short, successive bursts."
    },
    {
      "title": "Look for eggs in the nest.",
      "content": "Look for eggs in the nest. The female canary can lay anywhere from 2 to 6 eggs. The female will lay one egg a day, usually in the morning. It typically takes 14 days for canary chicks to hatch. They should hatch without any assistance."
    },
    {
      "title": "Keep chicks with male and female canaries until they begin eating on their own.",
      "content": "Keep chicks with male and female canaries until they begin eating on their own. This usually happens when the chicks are around 3 weeks of age. At first the mother canary will stay with the babies all the time and the father will bring the mother food. Then, gradually, the father will take over feeding the chicks, making sure that they get enough to eat. [3] X Research source Once the chicks begin eating on their own and are fully fledged, meaning their wing feathers have developed enough to fly, you may remove them to their own cage. At this point you should also separate the parents again as well."
    }
  ]
}