{
  "url": "https://www.wikihow.com/Be-a-Good-Catholic",
  "title": "How to Be a Good Catholic",
  "steps": [
    {
      "title": "Receive God's provision.",
      "content": "Receive God's provision. The important thing is to know God's love! Realize Jesus gave his all, as He died to give us life! No matter what, as Catholics, we believe that through the Sacrament of Confession or Reconciliation, God forgives our worst sins. Do not despair but hope in God. If we look at the lives of the saints, many of them were as far away from God as you could ever imagine; but they were able to change their lives around, serve God, and enter joyfully into His Heavenly Kingdom."
    },
    {
      "title": "Respect Him in prayer and revere His presence!",
      "content": "Respect Him in prayer and revere His presence! God is with us at all times, even when we think we are alone. Try to be aware of His presence which is all powerful, all knowing, and all loving. Try to be in a quiet area and to truly focus on his love. Love Him who first loved the world. Love Him with everything you've got. [1] X Research source"
    },
    {
      "title": "If you are not already Catholic, please go to a local church, and talk to the priest about becoming Catholic.",
      "content": "If you are not already Catholic, please go to a local church, and talk to the priest about becoming Catholic. Do some research by going to your local library, looking at some good Catholic websites such as catholic.com, and sit in a pew and observe Mass at the local church. If you want to enroll in RCIA classes talk to your local priest."
    },
    {
      "title": "Pray and participate in the Sacraments.",
      "content": "Pray and participate in the Sacraments. Mass is the source and summit of our Faith as the Bread and Wine offered at Mass according to Church doctrine becomes the Body, Blood, Soul, and Divinity of Our Lord Jesus Christ. Also frequently praying and partaking of the Sacraments brings us closer to God and makes us stronger in our Faith. There are numerous prayers that have been written throughout the Catholic Tradition. Some parishes sell Catholic prayer books to help you with your prayer. Pray the Rosary (at the bottom of the article), say the Our Father, the Jesus Prayer, or just have a conversation with God. Remember to ask for the intercession of Jesus Christ to the Father, and that of Holy Mary, the Mother of God and the saints in your prayer. We are not worshiping the saints and Mary but praying (communicating) with them to God. [2] X Research source"
    },
    {
      "title": "Read the Bible every day.",
      "content": "Read the Bible every day. Pick a passage or set a time of maybe ten minutes to read the Bible each day. You can also look for Catholic Bible commentaries that may be sold at a parish or through an online Catholic website to assist you with trying to understand the Bible more"
    },
    {
      "title": "\"Love thy neighbor as thyself,\" Jesus said, and:",
      "content": "\"Love thy neighbor as thyself,\" Jesus said, and: \"By this ye shall know ye are my disciples; 'That ye love one another.'\" Give charity to the poor, visit those in prison, give food to the hungry, forgive, clothe the naked, give drink to the thirsty, and bury the dead."
    },
    {
      "title": "Keep the Ten Commandments.",
      "content": "Keep the Ten Commandments. The 10 commandments are 1. I am the Lord your God who brought you out of the house of Egypt. You shall have no other Gods before me. 2. Thou shall not take the Lord's name in vain. 3. Keep Holy the Sabbath 4. Honor your father and mother 5. Thou shall not kill 6.Thou shall not commit adultery 7. Thou shall not steal 8.Thou shall not bare false witnesses against thy neighbor 9. Thou shall not covet their neighbors wife 10. Thou shall not covet their neighbors goods."
    },
    {
      "title": "Avoid the 7 deadly sins:",
      "content": "Avoid the 7 deadly sins: lust, gluttony, greed, sloth, anger, envy, and pride. [3] X Research source"
    },
    {
      "title": "Go to church regularly.",
      "content": "Go to church regularly. Catholics are required to attend church on every Sunday and Holy Day of Obligation (HDOs for the Byzantine Metropolitan Church of Pittsburgh are listed in the tips)."
    },
    {
      "title": "Follow the teachings of the Church.",
      "content": "Follow the teachings of the Church. The leader of the Church as a whole is the Pope, although various Churches have their own leaders (e.g. the Metropolitan of Pittsburgh of the Ruthenians; the Patriarch of Antioch of the Maronites; the Metropolitan of L'viv of the Ukrainians, etc.). Hold true to the Traditions of the Faith as the Faith has been passed down from Jesus Christ to the Apostles to their disciplines through the numerous saints to this present day. Research and look into what the Church actually teaches by going to good Catholic websites and by reading good Catholic books. The Catechism of the Catholic Church lays out point by the point what the Church teaches and believes."
    },
    {
      "title": "Know that there are nearly 25 different Churches sui iuris that make up the Catholic Church.",
      "content": "Know that there are nearly 25 different Churches sui iuris that make up the Catholic Church. The most common of these is the Roman Church. The others are known as the Eastern Catholic Churches. Almost all of them (except for the Maronite and Italo-Albanian Churches) have an Orthodox counterpart. The members of Eastern Catholic Churches are not pleased when people refuse to accept the fact that they are in full communion with the Bishop of Rome."
    },
    {
      "title": "Know your heresies and how to beat them.",
      "content": "Know your heresies and how to beat them."
    },
    {
      "title": "Byzantine Catholics ought to already be doing everything above.",
      "content": "Byzantine Catholics ought to already be doing everything above. This is just a supplemental section covering traditions that we have but aren't necessarily present in other Churches. [4] X Research source"
    },
    {
      "title": "Know your Church's traditions!",
      "content": "Know your Church's traditions! It is important that you are able to easily give an outline (however rough) of your Church's particular features."
    },
    {
      "title": "Read the Fathers.",
      "content": "Read the Fathers. They know best."
    },
    {
      "title": "Learn common prayers of the Eastern Churches.",
      "content": "Learn common prayers of the Eastern Churches. The Jesus Prayer, for example, is simple and powerful: Lord, Jesus Christ, Son of God, have mercy on me, a sinner."
    },
    {
      "title": "Make the sign of the Cross one of the traditional ways, for example:",
      "content": "Make the sign of the Cross one of the traditional ways, for example: thumb, index, and middle finger held together, with the ring finger and pinky tucked in. Forehead, abdomen, right shoulder, left shoulder. [5] X Research source"
    }
  ]
}