{
  "url": "https://www.wikihow.com/Clean-Yourself-in-the-Bath",
  "title": "How to Clean Yourself in the Bath",
  "steps": [
    {
      "title": "Clean your bathtub.",
      "content": "Clean your bathtub. In order to have clean bathwater, you need to scrub your tub. All you have to do is mix 3 cups of hot water with 1 cup of laundry detergent in a spray bottle. Spray the solution all over your tub and scrub with a long-handled bathtub cleaning tool that you can buy almost anywhere cleaning supplies are sold. Here are some other items you might want to help you clean. [1] X Research source protective gloves mild abrasive cleansing product scrubber, brush or sponge"
    },
    {
      "title": "Gather all the things that you are going to need or want for your bath.",
      "content": "Gather all the things that you are going to need or want for your bath. Whether you are looking to just lay in the bath or you want to add in another relaxing activity like reading, you will want to have those items ready before you get in the tub. Bath bubbles are a great way to liven up your bath experience and get clean. Bath salts are great skin moisturizers and also come in various scents like lavender that can help you relax. A bath head pillow will support your neck and head as you lay in the tub. They are waterproof so you don't have to worry about it getting wet. Reading a good book is a perfect bath time activity. A cup for rinsing yourself. A bath rug is important to have because they will help prevent you from slipping once you get out of the tub."
    },
    {
      "title": "Get a clean towel.",
      "content": "Get a clean towel. You may want to have several clean towels handy. You will want one larger towel that you will use to dry off and wrap around your body, one for your hair, and another smaller towel to keep by the tub in case you need to dry off your hands and face during your bath."
    },
    {
      "title": "Create a relaxing mood.",
      "content": "Create a relaxing mood. Baths should be a time where you can let go of worries and melt away the stress from the day. Try lighting candles, dimming the light, or playing soft music to help you relax. Relaxation music comes in a wide range of varieties that you can choose from. If playing music, just be sure that any electronics and cords are several feet away from the bath for safety. Get the room to a warm temperature."
    },
    {
      "title": "Make sure the water is warm but not hot.",
      "content": "Make sure the water is warm but not hot. Hot water comes with several risks including a drop in blood pressure, dizziness and poor balance, nausea and vomiting, and it dries out your skin which leads to dehydration. Warm water will still relax you and protect you from potential dangers. [2] X Research source If you aren't sure how to tell if the water is too hot, you can buy a rubber duck specially designed for bath water temperature control. They have an indicator that changes color when the water is too hot. You can find them at most places baby merchandise is sold."
    },
    {
      "title": "Add bath solutions.",
      "content": "Add bath solutions. If you decide to add products to your bath, put them in while you are filling the tub with water. This will help them dissolve and spread throughout the entire bath water. If you have sensitive skin, make sure you read the instructions on your bath products to see what type of risks there are. You may want to test a small amount on your hand before you use it on your entire body."
    },
    {
      "title": "Fill your tub with the right amount of water.",
      "content": "Fill your tub with the right amount of water. You do not want to overflow your tub and end up with water on your bathroom floor. Remember that water rises when you enter the tub so filling it up half way should be just enough. Also, if you are using bubbles, the tub will be even fuller as the bubbles fluff up. You can always add more water if you want once you get into the tub."
    },
    {
      "title": "Choose a good shampoo and soap.",
      "content": "Choose a good shampoo and soap. Just like the before mentioned bath solution, if you have sensitive skin, use something that has a sensitive skin label. You can use a bar of soap or try a liquid body wash. Some soaps are more mild than others, so you may want to research the type you buy to make sure the product will be easy on your skin."
    },
    {
      "title": "Start from the top.",
      "content": "Start from the top. When getting clean in the bath, you will want to start with washing your hair. Dunk your head under the water to get your hair completely wet. Then, depending on how much hair you have, put about a quarter size of shampoo in your palm. Lather in the shampoo and massage your scalp. You do not want to scratch your scalp with your nails, instead try using your finger tips."
    },
    {
      "title": "Leave on the conditioner.",
      "content": "Leave on the conditioner. Baths are a great time to take advantage of a deep conditioner treatment that might require anywhere from 5-15 minutes of leave in time. After you put on the hair conditioner, you can wash the rest of your body or just lay and relax as your hair is getting treated. [3] X Research source The best way to rinse your hair is to take a cup and fill it with clean water from the faucet. Keep pouring it over your hair with your head tilted back so the shampoo and conditioner doesn't get in your eyes."
    },
    {
      "title": "Spend enough time in the bath.",
      "content": "Spend enough time in the bath. For optimal relaxation, you will want to spend at least 20 minutes in the bath. Soak in the bath for at least ten minutes to get rid of the dirt and eliminate bacteria. This will open up your pores and soften your skin so you can get a better clean. [4] X Research source Keep soaking for several minutes after to make sure everything is cleaned off. While scientists say it is safe to bathe for over an hour as long as the bath isn't too hot, make sure you get out before you get too tired. Falling asleep in the tub could be dangerous and lead to drowning."
    },
    {
      "title": "Use a soft scrub or washcloth to exfoliate your skin.",
      "content": "Use a soft scrub or washcloth to exfoliate your skin. Exfoliation removes dead skin cells, leaving your skin glowing and smooth. You can start at your shoulders, using circular motions, and then work your way down to your feet. You don't want to scrub your skin too hard because that can cause skin irritation. Gently applying pressure is all you need for a good clean. Select exfoliating cleansers that contain sea salt, sugar, ground almonds, walnuts, seeds or other grainy components. [5] X Research source There are many types of tools you can use to exfoliate including an exfoliating cleanser, loofah, pumice stone, body brush or exfoliating gloves. Be extra gentle when exfoliating your face and neck because the skin is extra sensitive in those areas. Don't use a body wash on your face. Use only face washes specifically designed for faces."
    },
    {
      "title": "Get out of the tub slowly.",
      "content": "Get out of the tub slowly. The floor might be wet as well as your feet so you need to be extra careful to prevent yourself from falling. Also, your blood pressure might be slowed down and you could get a head rush when you stand up. Pull the plug and pour cold water in to gradually bring your core temperature down then slowly stand. If you can, hold on to something stable as you stand up."
    },
    {
      "title": "Rinse yourself off with clean water.",
      "content": "Rinse yourself off with clean water. If you have dry skin, you may want to rinse off with clean water from the faucet to get off any soap residue from your bath. You can do this by filling up a cup and repeatedly pouring water over your body. You can also turn on the shower to have a quick rinse. If you decide to use the shower, wait until at least half of the bath water drains out so water doesn't splash on the floor and the tub won't over flow."
    },
    {
      "title": "Wrap your hair and body.",
      "content": "Wrap your hair and body. Put a towel around yourself to soak up the water left on your skin. To keep your head warm and dry your hair, take another towel and wrap it around your head. This will help prevent additional water from dripping on the floor that you could slip on. Pat yourself dry and apply lotion or cream to your body and face to help moisturize your skin(optional)."
    },
    {
      "title": "Make sure you clean the bathroom afterwards.",
      "content": "Make sure you clean the bathroom afterwards. Just unplug the bath tub, put everything back and wipe up any spills or footprints. You can also spray an after shower cleaner that doesn't involve any wiping and will help keep your tub clean. Natural cleaning products that don't use chemicals are safe to use and better for the environment. [6] X Research source"
    }
  ]
}