{
  "url": "https://www.wikihow.com/Connect-My-Phone-to-My-TV",
  "title": "4 Easy Ways to Connect an iPhone or Android to a TV",
  "steps": [
    {
      "title": "Connect your phone and TV to the same Wi-Fi network.",
      "content": "Connect your phone and TV to the same Wi-Fi network. You can use screen mirroring to display your phone's screen on your TV and hear your phone's audio through your TV's speakers. This lets you display photos, videos, movies, games, and other content on a larger screen. To screen mirror, your phone and TV must be connected to the same Wi-Fi network. The way you connect your TV to Wi-Fi varies by model, but you'll usually find the option in your settings menu under \"Network\" or \"Internet.\" If you don't have Wi-Fi, you can set up a mobile hotspot on your phone and connect your TV to your phone's mobile hotspot. Just be aware that there may be data charges. Check with your mobile phone carrier to see how much mobile data your plan includes."
    },
    {
      "title": "Enable screen mirroring on your TV.",
      "content": "Enable screen mirroring on your TV. While most TVs allow screen mirroring by default, you may have to enable it on your TV. You can usually find this option on your TV's home menu or Settings menu. If you're using an iPhone, your TV must support AirPlay to use screen mirroring. If your TV doesn't support AirPlay, you can connect a streaming device that does, such as a Roku streaming stick , and mirror that way. If you're using an Android, you can mirror to any TV that supports Miracast or Chromecast. If your TV doesn't support these technologies, you can connect any Chromecast-enabled device, such as a Chromecast with Google TV . Not all TVs support screen mirroring. If you don't have a smart TV or a streaming device that supports screen mirroring, you can connect to your TV using an HDMI cable ."
    },
    {
      "title": "Open the screen mirroring function on your phone.",
      "content": "Open the screen mirroring function on your phone. The way you do this varies by phone model. Use one of the following steps to access the screen mirroring option. Android/Samsung Galaxy: Swipe down from the top of the screen with two fingers to display the Quick Access menu, then tap SmartView , Screen Mirror , Screen Cast , or similar. iPhone: Swipe down from the upper-right corner of the Home screen to access the Control Center. Tap the icon that resembles two screens overlapping on top of each other. [1] X Research source If your iPhone has a Home button/Touch ID, swipe up from the bottom of the Home screen instead."
    },
    {
      "title": "Select your TV.",
      "content": "Select your TV. Once you tap the option to start screen mirroring on your TV, it should display a list of compatible devices on your Wi-Fi network. Select the TV or streaming device you want to mirror to. You should see your phone screen displayed on your TV. Depending on your TV, it may display a code you'll need to enter into your phone to start mirroring. If you're mirroring a movie or video from your phone to your TV, enabling the app's full-screen mode should make the video play full-screen on your TV."
    },
    {
      "title": "Disconnect from the TV.",
      "content": "Disconnect from the TV. When you are ready to stop screen mirroring, swipe down from the top of the screen with two fingers (Android) or reopen Control Center (iPhone), then tap the screen mirroring option to disconnect."
    },
    {
      "title": "Open the app you want to cast from on your phone.",
      "content": "Open the app you want to cast from on your phone. Most popular video, streaming, and music apps support casting to your TV. This includes YouTube, Netflix, Hulu, Disney Plus, Amazon Prime, Spotify, Twitch, and more. Casting is a great way to stream movies, shows, and music from your phone to your TV without sharing the entire screen. As with screen mirroring, your phone and TV must be connected to the same Wi-Fi network to cast to your TV."
    },
    {
      "title": "Start playing the content you want to cast.",
      "content": "Start playing the content you want to cast. Use the app to browse the content selection and start the movie or show you want to view on your TV."
    },
    {
      "title": "Tap the cast icon .",
      "content": "Tap the cast icon . The icon resembles a TV screen with Wi-Fi waves over it. It's usually in the upper-right corner of the video playback. If you don't see this icon, tap the center of the screen to display the playback controls."
    },
    {
      "title": "Select your TV or streaming device.",
      "content": "Select your TV or streaming device. Tapping the cast icon will display a list of compatible devices connected to the same network. Tap the name of your TV or streaming device, then wait for your phone to connect to your TV."
    },
    {
      "title": "Use your phone to control the playback.",
      "content": "Use your phone to control the playback. You can use the user interface on your phone to pause the video, skip forward or backward, or use the slider bar at the bottom of the video to scroll through the video to a specific spot. You can even use the volume buttons on your phone or the slider bar in the user interface to control the volume on your TV."
    },
    {
      "title": "Disconnect your phone.",
      "content": "Disconnect your phone. When you are finished watching TV and want to disconnect your phone, tap the Cast icon again. Then tap Disconnect . [2] X Research source"
    },
    {
      "title": "Determine what type of adapter you'll need.",
      "content": "Determine what type of adapter you'll need. if you are not able to connect your phone to your TV wirelessly , you can use a wired connection . To use a wired connection, you will need to determine what type of connection your phone and TV use. Most newer phones have a USB-C port, but many iPhone models have Lightning ports. Most modern TVs have an HDMI port you can connect to, so you'll need an adapter that will fit into your phone on one end and an HDMI port on the other. To connect an iPhone that has a Lightning port to a TV, you'll need a Lightning to HDMI adapter . To connect any phone with a USB-C port to an HDMI port, you'll need a USB-C to HDMI adapter ."
    },
    {
      "title": "Connect your phone to your TV with the adapter.",
      "content": "Connect your phone to your TV with the adapter. Connect the USB-C or Lightning end of the adapter to your phone. Connect an HDMI cable to the HDMI port on the adapter. Plug the other end of the HDMI cable into your TV's HDMI port."
    },
    {
      "title": "Select the HDMI source with your TV's remote control.",
      "content": "Select the HDMI source with your TV's remote control. Press the Source or Input button on your TV remote until it switches to the HDMI port to which your phone is connected. Once you've reached the right source, you'll see your phone's screen on your TV."
    },
    {
      "title": "Download the official app for your TV or streaming device.",
      "content": "Download the official app for your TV or streaming device. In most cases, you will need to download an app for your TV brand or streaming device (i.e., Samsung SmartThings app, Roku app, Amazon Fire TV app, etc.) to your phone. You can find these apps in the Google Play Store on Android devices or the App Store on iPhone and iPad. If your phone has an IR blaster, you can download a universal remote app instead. [3] X Research source Some smartphones come with remote capabilities built-in for the same brand of smart TVs. For example, SmartThings comes preinstalled on Samsung Galaxy devices, and you can use it to control a Samsung smart TV. Likewise, you can use your iPhone as a remote for Apple TV and the Google TV app on Android devices to control Google TV devices."
    },
    {
      "title": "Open the remote app on your phone.",
      "content": "Open the remote app on your phone. Once you download the app for your TV manufacturer or streaming device, tap the icon to open it, then tap the option to access the remote."
    },
    {
      "title": "Control the TV with your phone.",
      "content": "Control the TV with your phone. You can use the remote user interface on your phone to control your TV just like you can with your remote. You can power your TV on and off, control the volume, change channels, select different sources, access the Home menu, and more."
    }
  ]
}