{
  "url": "https://www.wikihow.com/Car-Wont-Turn-over-but-Has-Power",
  "title": "Car Not Starting, but Still Has Power? These Are the Most Common Causes",
  "steps": [
    {
      "title": "Your car’s battery may not be producing enough power.",
      "content": "Your car’s battery may not be producing enough power. This is the most frequent cause of a car having power, but not turning over. A low battery can occur if you accidentally leave your lights on overnight, or if your battery is too old and past its expiration date. If you don’t hear a noise when you turn the key or press the start button, your battery probably isn’t providing enough electricity to start your engine, even if the headlights and electronics are working. [1] X Research source Check the date code printed at the top of your car’s battery to determine its expiration date. The code consists of a letter for the month (A is January, B is February, etc.) and a number for the last digit of the year. So for example, D5 means April, 2025. [2] X Research source Jump-start your car to charge a low battery . If the problem occurs again after you jump the car, your battery may be malfunctioning . Replace your car’s battery if it’s malfunctioning or past its expiration date, or have a mechanic replace it for you. [3] X Research source"
    },
    {
      "title": "The starter isn’t working correctly.",
      "content": "The starter isn’t working correctly. If you hear a loud click or whirring when trying to start the car, but the engine won’t turn, you could have a bad starter . The starter is the actual “crank” that gets your engine moving. When it malfunctions, your engine won’t start, even if all other components in the car are working normally. [4] X Research source Ask a mechanic to inspect your car’s starter and replace it if necessary."
    },
    {
      "title": "Your vehicle’s electrical wiring could be damaged.",
      "content": "Your vehicle’s electrical wiring could be damaged. You may have a blown fuse , the battery terminals may be corroded, or there may be a damaged wire somewhere in your car’s electrical system. Any of these problems could prevent electricity from reaching your car’s starter—the device that physically starts the engine. [5] X Research source Check your car’s battery terminals for buildup and corrosion. Avoid touching the battery terminals directly to prevent electric shocks. To remove corrosion from the battery terminals , disconnect the battery cables and scrub the terminals with baking soda and water. Wear acid-resistant worker’s gloves to prevent chemical burns, and remember to reconnect the battery cables when finished. Have a mechanic check your car’s fuse box and wiring. Have them remove battery corrosion if you prefer not to do it yourself."
    },
    {
      "title": "The alternator may be malfunctioning.",
      "content": "The alternator may be malfunctioning. If your car’s battery is functioning normally and you hear a rapid clicking sound when attempting to start the car, you may have a faulty alternator. The alternator converts power from your engine into electricity, recharging the battery and powering the electronics as you drive. Your car may not start with a bad alternator. [6] X Research source Your car’s electronics will still work if the battery is functioning normally, but the battery will slowly lose power if it’s not charged by the alternator. Have a mechanic service your alternator and replace it if needed."
    },
    {
      "title": "Your car’s security system may not be working properly.",
      "content": "Your car’s security system may not be working properly. If your key or keyfob isn’t recognized by your car’s security system, the onboard computer will not allow the vehicle to start. Your car’s immobilizer—the device that keeps the car from moving when it’s off—will remain locked, and the car’s security light will flash. This is meant to prevent theft, but in this case, it may prevent you from starting the car. [7] X Trustworthy Source National Highway Traffic Safety Administration U.S. government agency responsible for writing and enforcing Federal Motor Vehicle Safety Standards Go to source Your key/keyfob’s battery may be dead. Replace the battery , then try starting your car again. Try starting your car with a spare key, or a valet key, if you have one. If your key/keyfob is broken or damaged, such as from immersion in water, visit a dealership to have it replaced."
    },
    {
      "title": "The steering might be locked and stuck.",
      "content": "The steering might be locked and stuck. To help prevent theft, many cars have steering wheels that lock automatically when the car is off. The wheel should unlock when you turn the key or press start—but if it remains locked, your car may not start at all. This sometimes happens when your tires are jammed against a curb. [8] X Research source After turning the key or pressing start, try wiggling the steering wheel until it unlocks. If it remains stuck, turn the car off and on a few times to reset the lock, then try again. If your key gets stuck in the ignition slot and won’t turn, don’t force it. You may break the key. If your steering wheel won’t unlock after several tries, have your vehicle towed to a mechanic to fix the problem."
    },
    {
      "title": "Your car is not in park or neutral.",
      "content": "Your car is not in park or neutral. If you drive an automatic transmission (as most people do), your car will not start unless it’s in park or neutral. This is called the “neutral switch” and it prevents the car from suddenly lurching forward or backward when the engine starts. In rare cases, the neutral switch may malfunction, preventing the car from starting even when it’s in neutral or park. [9] X Research source If your car is not in neutral or park, press the brake and put the car in neutral or park. Keep your foot on the brake and start the car normally. If the car still won’t start, have it taken to a mechanic to get the neutral switch fixed."
    },
    {
      "title": "Your car’s manual transmission has a safety mechanism enabled.",
      "content": "Your car’s manual transmission has a safety mechanism enabled. If your car has a manual transmission—also called a “stick shift” or “standard” transmission—the vehicle may have a special safety switch that prevents the car from being started until the driver is ready to use the transmission. Don’t worry: this is not a glitch, and there’s nothing wrong with your car if this happens. [10] X Research source To start your car , press the clutch while turning the key or pressing the start button. Make sure to press the brake before shifting into first gear."
    },
    {
      "title": "You may be low on diesel exhaust fluid (diesel cars only).",
      "content": "You may be low on diesel exhaust fluid (diesel cars only). Diesel cars inject a special fluid into their exhaust systems, which reduces the amount of pollutants released into the air. This is required by law, and your car may not start if the diesel exhaust fluid gets too low. If you drive a diesel car, your vehicle may have a sensor that alerts you when the exhaust fluid level gets low. [11] X Research source To add diesel exhaust fluid to your engine, open your car’s fuel cover and remove the blue cap labeled “AdBlue/DEF,” located next to the gas cap. Pour the fluid directly into this blue port, then screw the blue cap when finished. Avoid pouring diesel exhaust fluid directly into the gas tank. Only use the blue port with the blue cap. You can purchase diesel exhaust fluid online, or from an auto supply store."
    },
    {
      "title": "No noise when attempting to start the car: Battery problems",
      "content": "No noise when attempting to start the car: Battery problems You may have a low battery, expired battery, or connection issues. Your car may have full power, but the headlights and dashboard display may appear dimmer than normal. [12] X Research source Some of your car’s electronics may not work correctly, either. For instance, your windows may go up and down very slowly, or the stereo system may not have enough power to function."
    },
    {
      "title": "A single click or whirring sound: Faulty starter",
      "content": "A single click or whirring sound: Faulty starter The starter may need to be replaced, or there may be a wiring or other electrical issue directly related to the starter. The starter relay—the switch that directs power to the starter—may also be malfunctioning. [13] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source If you hear multiple clicks, there may be other problems, such as issues with the car’s electrical system."
    },
    {
      "title": "Rapid clicking when trying to start: Electrical problems",
      "content": "Rapid clicking when trying to start: Electrical problems Your battery may be low, but still producing enough power to make the starter click—though it won’t be enough to actually start the car. You may also have a faulty alternator, blown fuse, failed ignition switch , or some other electrical glitch. [14] X Research source Your car’s warning lights may indicate a specific problem, like a bad alternator. The specific warning lights on your car may vary depending on the make and model."
    },
    {
      "title": "Jump-start your car to recharge a low battery.",
      "content": "Jump-start your car to recharge a low battery. If your battery is low but otherwise in good condition, you start your car with another car’s battery, then run your car’s engine to recharge your battery. A jump-start won’t fix other electrical problems, such as a bad alternator or faulty battery that cannot hold a charge. [15] X Research source To jump-start your car , place your vehicle in front of another vehicle with a working battery, front bumper to front bumper. Identify the battery terminals in your battery. Connect the red clamp on one end of your jumper cables to your battery’s positive terminal, then connect the black clamp on the same end of the cables to the negative terminal. Attach the black clamp on the opposite end of your jumper cables to the negative terminal on the other car’s battery, then attach the other red clamp to an unpainted metal component on the other car, such as the engine bracket. Start your car normally, then disconnect the cables and run your engine to charge your battery. Drive your vehicle for at least 20 minutes after a jump to ensure the battery charges fully. [16] X Research source"
    },
    {
      "title": "Have a mechanic fix mechanical and electrical problems.",
      "content": "Have a mechanic fix mechanical and electrical problems. Wiring issues, a bad starter, bad alternators, engine trouble, and other malfunctions are best left to an expert. Have your vehicle towed to a local repair shop, or drive there if you’re able to start your car but worry that it’ll die again. [17] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source You cannot jump a car with a bad alternator, bad starter, or other major electrical or mechanical issues. For your safety, avoid tinkering with your car’s engine or electronics unless you have experience working with cars and are comfortable with the risks."
    }
  ]
}