{
  "url": "https://www.wikihow.com/Apply-Latisse",
  "title": "How to Apply Latisse",
  "steps": [
    {
      "title": "Wash your face and remove your contacts before applying.",
      "content": "Wash your face and remove your contacts before applying. It’s important to apply Latisse to a freshly washed face. Use warm soap and water to wash your face, then pat it dry with a towel. You don’t want to get any of the Latisse product anywhere near your contacts or your actual eyeballs. Make sure you remove your contacts before applying the Latisse to your eyelids to avoid the possibility of contamination or painful [1] X Research source You can also use a makeup remover wipe to get rid of any makeup you may have on your face."
    },
    {
      "title": "Remove an applicator from the tray and hold it horizontally.",
      "content": "Remove an applicator from the tray and hold it horizontally. Take one of the sterile applicators from tray package and hold it horizontally between your fingers. Make sure that you only hold the applicator by the end without the bristles. [2] X Research source Keep your fingers away from the application end to prevent bacterial infections."
    },
    {
      "title": "Put one drop of Latisse on the top side of the applicator tip.",
      "content": "Put one drop of Latisse on the top side of the applicator tip. Holding the applicator horizontally, place one drop of the Latisse solution on the top of the applicator tip. Make sure that you only use one drop, or you will have too much and risk getting it in your eyes. [3] X Research source Do not put the drop directly on the tip of the applicator, as it may drip and it will make the application process harder. Instead, put it on the top side of the applicator tip."
    },
    {
      "title": "Draw the applicator tip along the skin of your eyelid where it meets the lashes.",
      "content": "Draw the applicator tip along the skin of your eyelid where it meets the lashes. Take the applicator and hold it carefully above your eyelid with the Latisse side facing down. Move the applicator across the skin of your eyelid where it meets your eyelashes. [4] X Research source Start at the corner of your eye and pull the applicator across toward the outer edge of the eye. Do not apply Latisse along your lower lashline or to your lower eyelid. [5] X Research source"
    },
    {
      "title": "Use a tissue to dab up any excess Latisse solution.",
      "content": "Use a tissue to dab up any excess Latisse solution. Once you have completed the application, you need to make sure there is no excess solution that could drip down into your eyes. Use a tissue or cotton swab to wipe away any excess just below your eyelid. [6] X Research source Throw away the applicator and repeat the process for the other eye – using a brand new sterile applicator."
    },
    {
      "title": "Use a new applicator for each eye.",
      "content": "Use a new applicator for each eye. Remember to always use a clean applicator from the package when you start applying the solution to a new eye. You don’t want to cross-contaminate germs by reusing the same applicator. When you finish using an applicator, throw it away in the trash and grab a fresh one for the next eye."
    },
    {
      "title": "Wait 15 minutes after applying Latisse before putting your contacts back in.",
      "content": "Wait 15 minutes after applying Latisse before putting your contacts back in. Typically, Latisse is applied right before you go to bed. If, however, you need to put your contacts back in after you applying Latisse, you will need to wait at least 15 minutes. Touching your eyes before the Latisse dries, even just to insert contacts, can promote contamination. [7] X Research source Getting Latisse solution in your eyes can be quite painful. Make sure the solution is completely dry before you begin touching your eyes."
    },
    {
      "title": "Follow the prescribed dosage.",
      "content": "Follow the prescribed dosage. Latisse should be applied only once every day. Increasing your usage will not give you bigger, longer, or fuller eyelashes. Apply one small drop to the applicator for each eye. Do not add additional Latisse solution, as excess will run down onto your skin. [8] X Research source Your daily application should be done at night for best results."
    },
    {
      "title": "Wipe off any excess on your skin.",
      "content": "Wipe off any excess on your skin. It’s possible for excess hair to start growing in any place where the skin comes into regular contact with the Latisse product. If you don’t wipe off the excess Latisse, you may have to deal with this unwanted side effect. [9] X Research source Wipe any extra solution off as soon as you finish applying it to minimize the negative effects."
    },
    {
      "title": "Use only the sterile applicator that came with your Latisse product.",
      "content": "Use only the sterile applicator that came with your Latisse product. You should only use the sterile applicator that was included in the packaging for your Latisse product. Do not use a Q-tip or any other kind of object for the application. [10] X Research source Each applicator should only be used once, then thrown away in the trash. So for each application, you’ll use two applicators – one for each eye."
    },
    {
      "title": "Keep the applicator and the tip of the bottle away from any unclean surfaces.",
      "content": "Keep the applicator and the tip of the bottle away from any unclean surfaces. In order to prevent contamination, you should make sure that the tip of the applicator and the dispensing end of the Latisse bottle don’t ever touch anything except when you add a drop of the Latisse solution to the tip of the applicator. [11] X Research source Don’t let your fingers or any other contaminated surfaces touch the applicator tip or the top of the Latisse bottle."
    }
  ]
}