{
  "url": "https://www.wikihow.com/Change-Oil-in-a-Deep-Fryer",
  "title": "How to Change Oil in a Deep Fryer",
  "steps": [
    {
      "title": "Sniff the oil to tell if it smells rancid instead of neutral.",
      "content": "Sniff the oil to tell if it smells rancid instead of neutral. If you open the lid to your deep fryer and catch a whiff of acrid, nasty smelling oil, it's definitely time to change it! Usable oil should smell neutral so it doesn't add an unpleasant flavor to your food. [1] X Trustworthy Source Food Safety and Inspection Service of the USDA Food safety information provided by the U.S. Department of Agriculture. Go to source If you're frying food and it smells like the oil is burning, it might be because there are too many food particles in the oil that are burning."
    },
    {
      "title": "Pay attention to a burnt flavor in your fried food.",
      "content": "Pay attention to a burnt flavor in your fried food. Your fries, wings, or donuts should taste delicious, not stale or burnt! If your fried food starts tasting off or stale, switch out the oil and fry a new batch. You'll probably be surprised at the difference. [2] X Research source"
    },
    {
      "title": "Replace the oil when it looks cloudy or your fried food looks darker than usual.",
      "content": "Replace the oil when it looks cloudy or your fried food looks darker than usual. Scoop out some of the oil in a clear glass so you can see it easily. If the oil looks cloudy, dark, has foam on top, or you see dark bits at the bottom, it's probably old. Don't forget to pay attention to the color of your fried food. If you're noticing foods are looking darker, particles in the oil might be burning as you fry. [3] X Research source Still not sure if you should keep the oil? Hold up a fresh bottle of oil and compare the colors. If your oil is considerably darker, change it."
    },
    {
      "title": "Change the oil more often if you frequently fry breaded food.",
      "content": "Change the oil more often if you frequently fry breaded food. When you fry breaded things like fish sticks or chicken tenders, bits of the breading fall off and break down in the oil. Plan on changing the oil after 3 or 4 uses if you mainly fry breaded things. [4] X Research source Battered foods like onion rings also leave behind particles, but they're not as big so you can get away with about a dozen uses before changing the oil."
    },
    {
      "title": "Replace oil every 1 to 2 months regardless of how it looks or smells.",
      "content": "Replace oil every 1 to 2 months regardless of how it looks or smells. It's easy to spot signs that your oil needs replacing if you fry with it a lot. However, if you don't fry very often, the oil might not look bad even though it might be turning rancid. Plan on changing the oil at least every 2 months so you know you're frying in the best-tasting oil. [5] X Research source Make a note when you change the oil so you know the next time you need to replace it."
    },
    {
      "title": "Unplug the fryer and let the oil cool completely.",
      "content": "Unplug the fryer and let the oil cool completely. It's really easy to burn yourself with oil that's still hot, so turn off the fryer and unplug it. Leave the oil alone for at least 2 hours or until it's at room temperature. [6] X Trustworthy Source Food Safety and Inspection Service of the USDA Food safety information provided by the U.S. Department of Agriculture. Go to source Cooling the oil gives the deep fryer a chance to cool down too."
    },
    {
      "title": "Set a funnel in a sturdy disposable container.",
      "content": "Set a funnel in a sturdy disposable container. If you kept the original oil containers, great! You can fill them back up with the old oil. Don't worry if you didn't hang on to them—use any sturdy container with a screw-on lid. Open your container and set a funnel in it to minimize the mess. [7] X Research source For example, use an empty plastic milk jug or soda bottle. If you're draining a commercial deep fryer, you'll probably want to drain the oil into a large disposable bucket. Oil is a liquid, but that doesn't mean it's safe for your pipes! If you pour oil in the sink or flush it down the toilet, it will coat the pipes and can lead to serious clogs so never pour it down the drain."
    },
    {
      "title": "Drain the old oil into the disposable container and seal it closed.",
      "content": "Drain the old oil into the disposable container and seal it closed. Remove the fryer basket and set it aside. Then, lift the removable pot that holds the oil and slowly pour it through the funnel into the container. It might help to have someone hold the funnel in place while you pour. [8] X Research source Some home or commercial deep fryers have a spout in the side that you open to let the oil drain out. If yours has a spout, just put your container right under it to catch the flowing oil."
    },
    {
      "title": "Strain the oil through cheesecloth if you plan on using it again.",
      "content": "Strain the oil through cheesecloth if you plan on using it again. If you're planning to reuse the oil, place a fine-mesh strainer into a large bowl and line the strainer with cheesecloth. Pour the oil through the cheesecloth and then transfer your purified oil to a clean storage container. [9] X Trustworthy Source Food Safety and Inspection Service of the USDA Food safety information provided by the U.S. Department of Agriculture. Go to source Store the oil in the fridge until you're ready to fry again and plan on using the oil within 3 months."
    },
    {
      "title": "Check for used oil drop spots in your community.",
      "content": "Check for used oil drop spots in your community. Don't want to throw away all that oil? Check your city's waste management website to find out if recycling sites accept used oil. Sometimes, the oil can be used to make biodiesel fuel. Your community might accept the oil at specific sites or at hazardous waste collection events. [10] X Research source If you're not finding much info on your community's site, run a search on a recycling website like www.earth911.com."
    },
    {
      "title": "Throw the container of used oil in the trash if you can't recycle it.",
      "content": "Throw the container of used oil in the trash if you can't recycle it. Once you screw the lid on the container, just stick it into your regular trash for pick up. Most liquid cooking oils won't harden so don't wait or try to chill your container of oil before you put it in the trash. [11] X Trustworthy Source Food Safety and Inspection Service of the USDA Food safety information provided by the U.S. Department of Agriculture. Go to source Are you cleaning a commercial deep fryer? Check your restaurant's grease disposal policies before you throw oil in the trash since many restaurants pay for grease removal and recycling."
    },
    {
      "title": "Read your owner's manual to find out which parts of the fryer to wash.",
      "content": "Read your owner's manual to find out which parts of the fryer to wash. The manual tells you which parts are safe to stick in the dishwasher or which ones you should wash by hand. Don't forget to clean the fryer basket too. Then, thoroughly dry all the parts of the deep fryer before you put it back together. [12] X Research source Never use harsh cleansers like oven cleaner on your deep fryer since you can damage it."
    },
    {
      "title": "Scrub the inside of the fryer if you're cleaning a commercial fryer.",
      "content": "Scrub the inside of the fryer if you're cleaning a commercial fryer. Since commercial deep fryers have different cleaning guidelines, read the manual for your model. You'll probably need to scrub away built-on grease with a wire brush and fill the fryer half full of hot water. Then, toss in a fryer boil-out puck or 1 cup (240 ml) of degreaser and bring the liquid to a boil for 15 minutes. Don't forget to rinse and dry the fryer thoroughly before you add fresh oil. [13] X Research source You can drain the rinsed solution directly into your restaurant's floor drain if it's near the fryer. If it isn't, drain it into a bucket and pour it out. It's a good idea to wear gloves and eye protection when you work with degreaser since it can splatter onto your skin while you're working."
    },
    {
      "title": "Pour new cooking oil into your deep fryer when you're ready to use it again.",
      "content": "Pour new cooking oil into your deep fryer when you're ready to use it again. You can leave oil in the deep fryer in between uses, but it will turn rancid faster since it's exposed to more oxygen. Instead, wait until you're ready to fry something before you fill the fryer with fresh cooking oil. Remember to use an oil with a high smoke point. Fry with corn, canola, or peanut oil, for instance."
    }
  ]
}