{
  "url": "https://www.wikihow.com/Be-a-Great-Cook",
  "title": "How to Be a Great Cook",
  "steps": [
    {
      "title": "Visit your local library.",
      "content": "Visit your local library. Go to the cookbook section and borrow some cookbooks that tickle your fancy. Try to stick with less complicated recipes to begin with though––you don't want to be put off before you've even started. [1] X Research source Basics cookbooks are very good books, to begin with. These books tend to explain terminology and techniques, as well as providing samples of simple but essential recipes. You can learn a lot from even just one such book, and then graduate onto cookbooks that seem like favorites to you. When reading a cookbook, check out how recipes are written and look for the basic terms and methods. Also notice that particular types of food (for example, bread, soup, meat, cake, etc.) have specific requirements in common to many recipes within that type of food."
    },
    {
      "title": "Check out free recipes on the internet.",
      "content": "Check out free recipes on the internet. There are recipes everywhere on the internet, including on wikiHow. You have so many choices that it is important to work out which sites you like and trust instead of spending all day collecting recipes, so be discerning in your selection. It also helps to find recipes that allow comments; that way, you can see what others say about the recipes and what changes or additions they suggest. [2] X Research source Get to know the food bloggers. There are bound to be some you love because they cook the sort of food you like and share interesting anecdotes that make reading their blog worthwhile. You can usually subscribe to such blogs to get regular updates and when you're game, you can also share comments about your experiences of the recipes they're suggesting."
    },
    {
      "title": "Watch cooking shows to get some more ideas.",
      "content": "Watch cooking shows to get some more ideas. Cooking shows are all over the TV nowadays, so it won't be hard to find one you like. This can help you learn techniques, find food of interest to you and maybe even get fired up about improving your cooking skills. [3] X Research source Warning: Cooking shows can be addictive. Try to keep them in perspective and ration the TV viewing."
    },
    {
      "title": "Talk to other cooks.",
      "content": "Talk to other cooks. Learn what motivates and inspires other cooks. Observe them and ask questions. This can fun and socially engaging way to learn more about cooking."
    },
    {
      "title": "Don't wait.",
      "content": "Don't wait. Get started today. It doesn't matter if it doesn't work, you're learning and you'll learn faster by doing than by thinking about it. Expect to make mistakes and some stuff that doesn't taste so great. And for now, don't worry how it looks––work on how it tastes to begin with. Indeed, some people never get beyond how it tastes, and that is just fine because everyone loves good tasting food! A word of advice: Don't try anything that requires expensive ingredients, has a very long list of steps, or is notoriously difficult at first. Give yourself a chance!"
    },
    {
      "title": "Begin with affordable ingredients.",
      "content": "Begin with affordable ingredients. That way, the errors aren't so costly and you can repeat until you get it right. And have fun in the process!"
    },
    {
      "title": "Choose simple recipes for your cheap ingredients.",
      "content": "Choose simple recipes for your cheap ingredients. That way, you won't get frustrated and you won't be stuck at a hot stove or cranky mixing bowl for more than a few minutes at a time. [4] X Research source"
    },
    {
      "title": "Keep reading and keep experimenting with your cooking.",
      "content": "Keep reading and keep experimenting with your cooking. Taste the food you make, then practice how to make it taste better. A great cook can tell by mere taste what else needs to be added to improve a bland or strange tasting dish and most of this comes from sheer practice and innate decisions. On your side is the fact that you care enough about food to give this a go, so you'll get the hang of flavoring food in no time. [5] X Research source It really helps know what kinds of flavors you like and try to get them in your dish."
    },
    {
      "title": "Fix your errors.",
      "content": "Fix your errors. There are basic techniques for repairing mistakes, such as thickening or thinning a food, lessening saltiness and turning a failure into a completely different dish (with nobody the wiser). That said, some mistakes can't be fixed, such as burnt food (the taste goes all the way through). Learn when to simply throw out something and try again and when you can completely transform an error. [6] X Research source"
    },
    {
      "title": "Be confident.",
      "content": "Be confident. In order to be a great cook, you need to be confident. Sometimes, being nervous can spoil your dish. Fake it until you make it (or bake it) and something good is bound to come out! Some people truly believe that emotions get cooked into food. Hence, it would be advisable not to cook when you're angry if you follow this belief."
    },
    {
      "title": "Find a brave friend or family member to taste test your new creations.",
      "content": "Find a brave friend or family member to taste test your new creations. Ask this person to give you honest feedback and to make suggestions for changes. Be prepared to accept constructive feedback; you can't improve your skills without this."
    }
  ]
}