{
  "url": "https://www.wikihow.com/Be-Patient",
  "title": "How to Be Patient",
  "steps": [
    {
      "title": "Pick up on the thoughts and physical feelings of being impatient.",
      "content": "Pick up on the thoughts and physical feelings of being impatient. If you’re in a stressful situation, be alert to thoughts that hint that you might be getting impatient, such as “This is taking forever,” or “This person is being so annoying.” When you pick up on these impatient thoughts, stop and check in with your body to see what you’re feeling, physically. You’ll probably be able to recognize signs of impatience right away, and identifying them can help you start to counteract your frustration. Some physical signs could include: [1] X Research source Tension in your muscles Restless, jiggling feet or legs Clenching your hands Short breaths An elevated heart rate Irritability or anger"
    },
    {
      "title": "Figure out what’s causing your impatience.",
      "content": "Figure out what’s causing your impatience. Once you’ve recognized that you’re feeling impatient, it’s time to hunt down the cause. Think past your immediate frustration and ask yourself, “Why am I actually feeling this way?” Some common causes of impatience are: [2] X Research source Your environment not conforming to your expectations. For example, you might hit unexpected traffic, or a restaurant might be more crowded than you’d thought, making you feel irritated and frustrated. Other people not behaving the way you want them to. For instance, you might get impatient that someone in front of you at the grocery store is blocking the whole aisle or chatting with the clerk for too long. When you can’t master a new skill fast enough. You might get impatient, for example, if you can’t figure out a new math or computer concept. You may have an unrealistic expectation that you will quickly grasp all new concepts. When you can’t control your thoughts. You might get impatient with yourself for not being able to dictate what emotions and thoughts pop up in your mind, even if you recognize there’s not much you can do to stop it."
    },
    {
      "title": "Take a moment to ground yourself.",
      "content": "Take a moment to ground yourself. Taking small, easy actions can break up the cycle of your impatience before it can progress, giving you a chance to regroup yourself. Focusing on your movements and the physical sensations of your actions will distract you from your impatience. [3] X Research source One good way to ground yourself is to focus on your environment. For example, you might take a few moments to think about how your feet feel when you are standing on the floor, what it feels like to sit in a chair, or the sensation of an object in your hand. You can also try a simple grounding exercise like looking for 3 things in your environment that are blue. These simple actions help bring you back into the present moment."
    },
    {
      "title": "Take 5 deep breaths to slow your heart rate down.",
      "content": "Take 5 deep breaths to slow your heart rate down. Close your eyes and inhale deeply into your belly. Hold it for a second, the let the air out slowly. Feel your body calm down and let that physical relaxation flow into your mind, soothing your impatient thoughts. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Besides calming your body, taking a few deep breaths will force you to slow down before you say or do anything rash."
    },
    {
      "title": "Shift your perspective about your situation if you can.",
      "content": "Shift your perspective about your situation if you can. Most situations that make you feel impatient are ones that can’t easily be changed (if there was an easy solution, you probably would have found it already!). Instead of focusing on this feeling of powerlessness, concentrate on what can be changed: your attitude and perspective of the situation. Say to yourself, “Since I can’t remove myself completely from this situation, how can I make it better?” [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you’re frustrated with an essay you’re writing, for example, you could focus on making your environment more pleasant. Put on music that helps you concentrate, make some tea, or have a snack. You can also address head-on what’s really bothering you about the situation, such as the fact that the essay is taking a long time to write. For example, you could cover up your clock so you don’t feel a time crunch."
    },
    {
      "title": "Find something good or interesting in the situation if you can.",
      "content": "Find something good or interesting in the situation if you can. If you can’t change your situation, the best thing you can do is change your perspective on it. Ask yourself to find something positive about where you are right now and focus on that instead of your impatience. It might be hard at first--like a lot of negative emotions, impatience can make you feel good and powerful in the moment--but forcing yourself to focus on the positive will make you feel much better in the long run. [6] X Research source If you’re stuck in traffic, for example, chat with another person in the car or, if your car has Bluetooth capability, call a friend or family member. Change the radio station or put in a new CD and sing along. If you are stuck in a tedious or frustrating situation, try making productive use of your time. For example, if you’re driving, listen to an interesting audiobook. If you have to sit in a doctor’s office for a long time, try to bring a project with you to work on."
    },
    {
      "title": "Keep a journal to look for patterns in your impatience.",
      "content": "Keep a journal to look for patterns in your impatience. Carry a small notebook around with you and make a note of every time you feel impatient. Write down the date, the time, what you’re feeling impatient about, and how that impatience makes you feel physically and emotionally. After 2 weeks, read back your journal and look for what kinds of situations make you feel the most impatient. [7] X Research source For example, you might realize that your impatience stems from getting frustrated at other people. You might write, “June 1, math class, 2pm. I felt impatient because John was working so slowly. My muscles started feeling tense.” Journaling about your frustrations has the added bonus of letting you vent your emotions, which can make you feel calmer and less stressed. Your impatience might be triggered by situations, environmental stimuli, or even your physical state. For example, you may find that you feel more impatient when you spend a lot of time on social media. [8] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Some people also feel more impatient when they eat or drink certain things, such as coffee and other caffeinated beverages. [9] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Reader Poll: We asked 213 wikiHow readers if it was their experience that eating healthy made them feel better, and 86% of them said Yes. [Take Poll]"
    },
    {
      "title": "Create a personal strategy to counteract your triggers.",
      "content": "Create a personal strategy to counteract your triggers. Sit down with your journal and write out a list of the things that seem to trigger your impatience most often. Ask yourself what you can do to neutralize your impatience in these situations and write down a step-by-step list of things you can do anywhere and anytime they come up. [10] X Research source For example, if you often get impatient with your friends or family members, your strategy might be: “Take 3 deep breaths. Explain why you’re feeling frustrated. Take a break and walk away if you’re still feeling impatient.” If you find that your impatience is made worse by certain foods or drinks, try cutting them out of your diet. If social media frustrates you and gets you down, consider turning off your phone alerts or using an app or plugin that prevents you from logging on for a few hours during the day. Get creative with your solutions and try different things to see what works best. Give yourself time to change; it won’t happen overnight, but you’ll be able to improve yourself in time."
    },
    {
      "title": "Practice short meditations to use when you feel impatient.",
      "content": "Practice short meditations to use when you feel impatient. Take each moment of potential impatience as an opportunity to focus on your breath and check in with yourself. Center yourself on your feet or in your chair, and breathe deeply, noticing the pattern of your inhalations and exhalations. Close your eyes if you can, or focus on a still point across the room. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Practice doing these quick meditations a few times a day, even when you’re not feeling impatient. Getting comfortable meditating when you’re calm will make it easier to do so in the heat of the moment."
    },
    {
      "title": "Adjust your expectations.",
      "content": "Adjust your expectations. The world will not always conform to your hopes, and you will be very frustrated if you constantly get upset when people, places, or things do not meet up to impossible standards. If you are impatient, it may be because you need to re-think the expectations. For example: If you are impatient in your weight loss plan, you may need to remind yourself the excess weight did not all go on in a week, and it will take time for it to come off. If you find yourself impatient because of traffic, you may need to rethink your belief that your commute takes 20 minutes if in reality it usually takes an average of 35. Just because that one time it took 20 minutes does not mean every trip to work should be expected to take 20 minutes. If you get frustrated that your partner chronically forgets your anniversary, and this is upsetting to you, instead choose to accept that remembering this date does not come as naturally as it does for you. Put the date on a shared calendar and ask him a week in advance to plan together some enjoyable activities."
    },
    {
      "title": "Exercise regularly to relieve pent-up stress.",
      "content": "Exercise regularly to relieve pent-up stress. Try to fit in a little bit of exercise every day, even if it’s just a quick walk or a jog up and down the stairs. Getting exercise will burn off the stress hormones that are shortening your fuse, making it easier to maintain your cool in intense situations. [12] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you have time, try to incorporate more intense physical activity too, like jogging, swimming, biking, or doing light weights. Sometimes you can use exercise to counteract your impatience in the moment. If you’re feeling impatient while working on a project, for example, get up from your desk and take a five-minute walk. If you’re stuck in traffic, try moving your arms and head to the beat of your music."
    },
    {
      "title": "Be prepared to fend off impatience caused by long waits.",
      "content": "Be prepared to fend off impatience caused by long waits. Many people get impatient when they’re forced to wait for a long time, like at a slow restaurant or doctor’s office. If you can distract yourself with other activities while you wait, it will be much easier to stay patient. For example, you could pack a book, a crossword puzzle, or a travel-size game when you think you might have to wait for a while, such as at the doctor’s office or a crowded grocery store. You can also distract yourself with whatever is at hand. Listen in on other people’s conversations, look at the other drivers stuck in traffic with you, or read the headlines of magazines or newspapers while you wait in line."
    },
    {
      "title": "Ask for help when you’re feeling overloaded.",
      "content": "Ask for help when you’re feeling overloaded. Impatience can be a sign of burnout. If you feel stressed, irritable, or impatient a lot of the time, these are signs that you’re under too much pressure. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Look for tasks that you can delegate and talk to a friend, family member, or co-worker to see if they can help. Taking some of the pressure off of yourself will lower your stress levels and make you less likely to get impatient in the first place. [14] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, if you’re feeling frustrated about a project, talk to your boss or teacher about getting some help from or a co-worker or fellow student. Say, “I’ve been working really hard on this, but it’s becoming too much for me my own. Could I get a partner to divide the work with?” Never feel bad about asking for help, especially when it has to do with your mental health. People will often be happy to help, and you’ll feel much more relaxed when you’re able to share the burden."
    },
    {
      "title": "Practice putting your impatience in perspective.",
      "content": "Practice putting your impatience in perspective. When you’re caught up in a task in the heat of the moment, it might feel crucial for something to get done right now--and thinking about what might happen if it doesn’t get done is what fuels your impatience. Instead, ask yourself, “Why am I in such a hurry?” Even if the task is finished a little late, it will still get done and everything will work out. [15] X Research source In true cases of life or death, broadening your perspective might not help. For example, if you’re waiting for an ambulance to help an injured person, it may matter very much whether the ambulance arrives late. In this situation, channel your impatience into doing whatever you can, whether that’s making the person comfortable or giving more information to the emergency line operator."
    },
    {
      "title": "Be kind to yourself",
      "content": "Be kind to yourself about your own shortcomings. If your impatience centers around getting frustrated with yourself, take a step back and realize that you can only expect so much from yourself. It’s great to want to improve yourself and learn new skills, but beating yourself up will only make you lose self-confidence. Instead, face your shortcomings head-on and see how you can work around them, or even make them into positives. [16] X Research source Feeling impatient with yourself often stems from the idea that it’s always better to go faster, which isn’t necessarily true. By proceeding slowly and patiently, you’ll understand the concept more deeply, and might even enjoy yourself more along the way. Remember that most things take time and effort to master. Being patient with yourself is the best gift you can give yourself."
    },
    {
      "title": "Accept that your expectations might not always be met.",
      "content": "Accept that your expectations might not always be met. Most impatience comes from being frustrated that people or situations don’t match up to what you expect. Instead of needing things to be a certain way, loosen your grip on your expectations and look forward to the surprises that come your way. Accept that people and situations will never be perfect and take life’s twists and turns with grace and humor. For example, instead of losing your patience when a friend spills a drink, remember that it was an accident and no one is perfect. Take a moment to breathe, reassure them that it’s okay, and move on."
    },
    {
      "title": "List the things you feel grateful for every day.",
      "content": "List the things you feel grateful for every day. Studies have shown that people who show gratitude in their day-to-day life are more likely to be patient and have better self-control. Practice this by coming up with 3-4 things every day that you’re grateful for. Take a moment to savor the feeling of thankfulness and center yourself in it. [17] X Research source You might say, for example, that you’re grateful to have a roof over your head, dreams and goals for the future, and friends that love you."
    },
    {
      "title": "Build your self-confidence",
      "content": "Build your self-confidence and have faith you’ll find other solutions. Everyone comes up against obstacles in their lives that seem impossible to overcome. Cultivating your self-confidence will help you realize that you’re smart and strong enough to find ways around these obstacles, no matter how impatient or upset you might feel. [18] X Research source For example, you might feel frustrated when you’re applying to jobs but can’t seem to catch a break. Being confident in yourself will keep you optimistic and help motivate you to keep working hard until things look up."
    }
  ]
}