{
  "url": "https://www.wikihow.com/Accent-Trees-With-Outdoor-Lighting",
  "title": "How to Accent Trees With Outdoor Lighting",
  "steps": [
    {
      "title": "Position an in-ground, well light directly underneath a narrow tree.",
      "content": "Position an in-ground, well light directly underneath a narrow tree. Small, spindly, or narrow trees will often appear more dramatic when up-lighted. Plant in-ground lights directly next to the tree's trunk, and face them upwards. This technique gives small trees, like dwarf palms, an arresting impact despite their diminutive size."
    },
    {
      "title": "Aim a spotlight directly up the trunk of a large, bushy tree.",
      "content": "Aim a spotlight directly up the trunk of a large, bushy tree. Position the spotlight (you can use one or several) close to the tree's trunk and aim it upwards, into the foliage. This technique will highlight the intricacy of its foliage, and illuminate the texture and form of the tree's trunk and branches. Use this technique when you want to accent a tree with an especially interesting trunk shape."
    },
    {
      "title": "Arrange a spotlight further away from a tree’s trunk for texture.",
      "content": "Arrange a spotlight further away from a tree’s trunk for texture . This type of up-lighting will cast more shadows, and create a dramatic background surrounding your tree. Position the light at a 45 degree angle upwards to dramatize the tree’s trunk and foliage. [1] X Research source"
    },
    {
      "title": "Make your tree a focal point.",
      "content": "Make your tree a focal point. Use two or more spotlights to create a cross-beam of light. This will reduce shadows and cast an arresting and enchanting glow directly focused on the tree. To make the most of this technique, pick a tree that has impressive height, girth, or intricacy of branches. Arrange these spotlights further away from the tree than you would if you were up-lighting."
    },
    {
      "title": "Avoid spotlighting windows.",
      "content": "Avoid spotlighting windows. Spotlights that may shine directly or indirectly into a window in your own or a neighbor’s home can be a nuisance. If a tree is near a window, try down-lighting it, instead. [2] X Research source"
    },
    {
      "title": "Use spotlights as a safety feature.",
      "content": "Use spotlights as a safety feature. Try spotlighting a tree close to your front or back door, or in a part of your lawn that looks too dark. Spotlights tend to be brighter, and may deter unwelcome visitors. [3] X Research source"
    },
    {
      "title": "Create dramatic silhouettes by lighting trees against walls.",
      "content": "Create dramatic silhouettes by lighting trees against walls. If you have a tree that is placed near the wall of your home, try placing a bright spotlight in front of it and aiming it towards the wall. This will cast a dramatic shadow of the tree's form onto the wall. [4] X Research source If lit from below, trees will cast a shadow that appears larger than the plant's actual size. For a more subtle effect, try lighting from above or using multiple lights to soften the individual shadows. A garage or fence can also be used as a backdrop for silhouette lighting."
    },
    {
      "title": "Use a floodlight for a large, open area.",
      "content": "Use a floodlight for a large, open area. Place a floodlight far from the tree or area of lawn you wish to illuminate. Aim the light at the tree and its foliage, and towards a structure behind it. This technique is especially suited for trees with interesting shapes, as well as shrubs and topiary. Because this technique provides a wash of light over the wall of your house, it also increases security ."
    },
    {
      "title": "Isolate focal trees.",
      "content": "Isolate focal trees. If you have multiple trees in front of a wall, place a floodlight closer to the tree you wish to silhouette. This will ensure that you project only one, distinct silhouette against the wall behind it. By choosing a focal tree, you will create a more distinct accent than if many trees were silhouetted in close proximity to each other. [5] X Research source"
    },
    {
      "title": "Use a narrow spotlight for a crisp beam of light.",
      "content": "Use a narrow spotlight for a crisp beam of light. [6] X Research source A narrow-style bulb will create greater contrast with the surrounding darkness. You can also space out narrow beams of light, or choose only one tree to silhouette within a ten-foot area."
    },
    {
      "title": "Install a small spotlight on the trunk of your tree.",
      "content": "Install a small spotlight on the trunk of your tree. This will create a moonlight effect within the tree’s foliage or against its root system, depending on which direction you angle the light. Try positioning multiple lights on a tree’s trunk. By pointing lights both upwards and downwards, you will create a fuller, more natural moonlight effect."
    },
    {
      "title": "Position a swiveling spotlight within the tree's foliage.",
      "content": "Position a swiveling spotlight within the tree's foliage. If you have a tree with lots of loose foliage, consider placing a spotlight facing downwards directly onto one of the tree's branches. This will cast enchanting shadows of the tree's foliage onto the surrounding ground, creating a dappled wash of light. [7] X Research source"
    },
    {
      "title": "Shine a swiveling spotlight down on your tree.",
      "content": "Shine a swiveling spotlight down on your tree. Place a light high up and away from your tree for this technique. Tilt the spotlight at a 30 degree angle to the tree for a natural looking diffusion of light—it should shine through the branches and onto the ground or foliage below it. This will also make your tree a more subtle focal point of the yard, and lend a warm glow to the tree’s surroundings. Conversely, this type of downlighting can also cast an eerie glow on the ground around your trees, especially in the fall and winter when foliage is more sparse."
    }
  ]
}