{
  "url": "https://www.wikihow.com/Buy-Dry-Ice",
  "title": "Where to Buy Dry Ice (and How to Store it Properly)",
  "steps": [
    {
      "title": "Purchase dry ice online or at your local grocery or big box store.",
      "content": "Purchase dry ice online or at your local grocery or big box store. Any person can buy dry ice, but some sellers may require you to be at least 18 years old. Buy dry ice at chain grocery and super stores like Safeway, Walmart, Albertsons, Whole Foods, Kroger, Publix, Wegmans, HEB, and Costco. Some of the larger gas stations out there, like 7-Eleven and Sheetz, often sell dry ice. Since dry ice has a short shelf-life, pick it up right before you plan on using it. Dry ice will begin to sublimate (evaporate) within 24 hours. [1] X Research source If you need to buy dry ice in bulk, it'll probably be cheaper to go through dry ice suppliers rather than individual sellers. Google dry ice suppliers and check out the options available."
    },
    {
      "title": "Look for dry ice in block or pellet form.",
      "content": "Look for dry ice in block or pellet form. Dry ice typically comes in block form. Things like performing school experiments and creating fog effects require blocks of dry ice. Dry ice is sold by weight, and the price ranges anywhere from $1.00 to $3.00 per pound. The pellet form of dry ice is mainly used for dry ice blasting to clean surfaces, or for medical transportation."
    },
    {
      "title": "Place blocks of dry ice inside an insulated cooler with ventilation.",
      "content": "Place blocks of dry ice inside an insulated cooler with ventilation . Your freezer isn't cold enough for dry ice, but an insulated ice chest will do the trick for transportation and storage. Always choose an insulated container with ventilation; never store dry ice in an airtight container. Dry ice melts from a solid directly into a gas, and an airtight container will cause gas to build up until it bursts. [2] X Research source A styrofoam chest with a loose fitting lid is another great storage option. Open and close the container as little as possible. To slow down sublimation even more, fill the open space in the cooler with wadded paper to limit dead space."
    },
    {
      "title": "Put the insulated cooler in your car and roll down the windows.",
      "content": "Put the insulated cooler in your car and roll down the windows. Remember that dry ice is solid carbon dioxide, which makes it very harmful if inhaled in large quantities. The dry ice is in a ventilated container, so it's always seeping out just a bit. When you're traveling with dry ice in the car, open the window so the carbon dioxide doesn't build up around you. [3] X Research source Fresh air is especially important if you're transporting dry ice for longer than 15 minutes. Being in a poorly ventilated area with dry ice can cause rapid breathing and headaches and can be lethal if breathed over long periods. Symptoms of carbon dioxide exposure include headache, difficulty breathing, nausea, and vomiting. If you experience symptoms like these after being around dry ice, make an appointment with your doctor or head to the emergency room. [4] X Research source"
    },
    {
      "title": "Handle dry ice with insulated gloves or large tongs.",
      "content": "Handle dry ice with insulated gloves or large tongs. Never handle dry ice with your bare hands! Since dry ice is extremely cold, it can cause severe frostbite if it touches your bare skin. Insulated gloves or an oven mitt are the best options since the blocks will be easier to maneuver with your hands (but you can use tongs in a pinch). [5] X Research source A towel can also work, but won't offer the same protection as gloves. If your skin is burned by dry ice contact, treat the burn like a typical burn . If your skin blisters or comes off, treat the area with antibiotic ointment and wrap with a bandage. Consult a doctor immediately in cases of extreme burns."
    },
    {
      "title": "Store dry ice in a well-ventilated space and use it within 24 hours.",
      "content": "Store dry ice in a well-ventilated space and use it within 24 hours. Keeping large quantities of dry ice in airtight areas can create an oxygen deficient atmosphere and a buildup of carbon dioxide in the space, so put the cooler somewhere safe. Make sure you store dry ice away from young children and pets, as well. [6] X Research source The dry ice will sublimate within 24 hours, so use it as soon as you can to get the most bang for your buck. A locked storage shed in your backyard will have good air circulation and won't be in danger of suffocating people or animals. Open doors and windows immediately if the dry ice is spilled to ventilate the space faster. Dry ice is heavier than oxygen and will accumulate in low areas. Avoid putting your face near pits or other low, confined areas as these places will have the highest concentration of carbon dioxide. Air out storage areas that have previously housed dry ice before entering."
    },
    {
      "title": "Dispose of dry ice",
      "content": "Dispose of dry ice at room temp in a well-ventilated space. If you find yourself with extra dry ice, remember that it's constantly undergoing sublimation and simply needs to be left alone in order to evaporate. Make sure the dry ice is safely out of reach of others for at least 24 hours. [7] X Research source Your backyard porch is a good place to dispose of dry ice. You can also use a fume hood to dispose of dry ice (if you have one). Never dispose of dry ice in the sewer, sink, toilet, or garbage disposal. You will likely freeze the water in the pipes and may even cause them to rupture. The extreme compactness of a pipe will also cause dry ice to expand quicker and may cause an explosion. [8] X Research source"
    }
  ]
}