{
  "url": "https://www.wikihow.com/Act-Around-Your-Girlfriend-at-School",
  "title": "How to Act Around Your Girlfriend at School",
  "steps": [
    {
      "title": "Give her your full attention when she speaks.",
      "content": "Give her your full attention when she speaks. [1] X Expert Source Cher Gopman Dating Coach Expert Interview. 17 May 2019. It’s easy to get distracted in a school environment when your friends and teachers are around, but stay focused on your girlfriend when she is talking to you. Maintain eye contact with her and don’t do anything else while she’s speaking. Make sure not to interrupt her. When she finishes speaking, respond appropriately to what she said. [2] X Research source If she’s talking during class when it’s not appropriate, politely tell her that you will talk to her after class."
    },
    {
      "title": "Be faithful to her.",
      "content": "Be faithful to her. Typically, being faithful means not kissing, engaging in sexual behavior, and essentially not doing anything with another girl that would hurt your girlfriend. You should also avoid flirting with other girls. Talk to your girlfriend about what being faithful means to her and come to an agreement. Stay faithful to her as long as she is your girlfriend. [3] X Research source There may be temptation to cheat, but remember that you could lose your girlfriend and gain a reputation as a cheater if you do cheat. Of course you can talk to other girls, but only casually. For example, it's totally okay to ask a female classmate for a pencil if you lost yours."
    },
    {
      "title": "Exhibit appropriate behavior in a school environment.",
      "content": "Exhibit appropriate behavior in a school environment. Avoid being overly physical with your girlfriend during school. Your girlfriend may not appreciate it, and even if she doesn’t mind, it could get both of you in trouble. Talk to your girlfriend about what she would be comfortable with. Ask her if a brief hug between classes, holding her hand while walking down the hall, or a quick kiss when no one is around would be okay with her. Respect your girlfriend's answer and don't push her into contact that she is not comfortable with. Go at her pace."
    },
    {
      "title": "Give her sincere compliments.",
      "content": "Give her sincere compliments. Compliment her on anything you like about her. Tell her how beautiful you think she is, especially when it’s obvious she put effort into her outfit that day. You should also compliment her on her strengths and accomplishments. For example, tell her how awesome you think it is that she does well in school. Or, congratulate her when she makes it onto a team. [4] X Research source You could say something like “I think you’re so intelligent. I’m so impressed by how hard you work and what you accomplish in and outside of school.” It’s great to compliment her, but don’t overdo it. Complimenting her on anything and everything will make your compliments seem less sincere."
    },
    {
      "title": "Give her plenty of space.",
      "content": "Give her plenty of space. Having a close relationship is great, but being overly attached can have a negative effect on your relationship. Being clingy could mean following them around constantly, overanalyzing their interactions with others, and checking in on your girlfriend when you know she’s busy. You can avoid being clingy by being confident in yourself and trusting your girlfriend. [5] X Research source Listen to your girlfriend and respect her wishes if she says she needs some space. This goes for outside of school as well. Don't be clingy after class and stalk her on social media."
    },
    {
      "title": "Don't brag about what happens between you and your girlfriend.",
      "content": "Don't brag about what happens between you and your girlfriend. It’s okay and encouraged to brag about how wonderful your girlfriend is. It’s not okay to brag about what happens between you and your girlfriend. For example, if your girlfriend lets you kiss her for the first time between classes, don’t tell all of your friends about it. Things get around quickly at school, and she may not be happy about everyone knowing about her personal matters. You should also avoid bragging on social media. That can carry over into your school environment. Another reason to avoid bragging is that things can get twisted as information gets passed on. A simple kiss may turn into something more intimate further down the line."
    },
    {
      "title": "Show her affection.",
      "content": "Show her affection. First, it is important to know what type of affection she is okay with. [6] X Expert Source Cher Gopman Dating Coach Expert Interview. 17 May 2019. Her limit could be holding hands or kissing. Then, keep in mind that you are at school. It usually isn’t acceptable to show a lot of affection during school hours. If you do show affection, be private about it. Hug her when no one is around, or kiss her quickly in an empty area. [7] X Research source Ask her what she is and isn’t okay with. Keep her answers in mind throughout the relationship. If you're feeling spontaneous, remember to ask first. For example: “Is it okay if I kiss you right now?”"
    },
    {
      "title": "Leave a note in her locker.",
      "content": "Leave a note in her locker. If you have a locker, write a short and sweet note and slip it in between the cracks of the door. If you don’t have a locker, you can put the note into her notebook. Write something like “You look pretty today,” or “Great job on the presentation today.” Try to do this once a day or at least a few times a week. [8] X Research source Take your note to the next level by personalizing it. Doodle a heart or her favorite animal. If you don't know what to write, leave her a funny comic or picture instead. You could draw it yourself, or print it off the computer."
    },
    {
      "title": "Carry her books to her next class.",
      "content": "Carry her books to her next class. You don’t have to do this all the time, but it’s nice to do every once in a while. Offer to carry her books when it seems like she is carrying more than usual or when she appears stressed out. If she says no, offer once more in case she is being shy and then respect her answer. [9] X Research source If you ask her this on several occasions, and she keeps saying no, then respect her answer and don't ask anymore. There are lots of other ways to be helpful to your girlfriend. For example, if she lost her pencil case, you could give her some new pens and pencils."
    },
    {
      "title": "Save her a seat next to you.",
      "content": "Save her a seat next to you. You can do this in class if you don’t have assigned seats, or you can save her a seat at the lunch table. This will make her feel special and let her know that you think of her. You could even find a special place for just the two of you to have lunch—like a bench outside if it’s allowed. [10] X Research source Don't kick someone out of their seat just so you can save your girlfriend a seat. This is very rude, and she won't appreciate it if she finds out."
    },
    {
      "title": "Bring her a gift for a birthday or holiday.",
      "content": "Bring her a gift for a birthday or holiday. The gift doesn’t have to be expensive or cost anything at all. A simple gesture, like baking cookies, will let her know that you were thinking of her on a special occasion. For Valentine’s Day, write her a note and bring her a flower. For her birthday, consider what she would like. If she likes a certain band, draw her a picture of one of their album covers. [11] X Research source If you have a creative hobby, like knitting, utilize that hobby for her gift. Knit her a hat or scarf. Don't stress too much about the gift. Remember, it is the thought that counts!"
    },
    {
      "title": "Help her with her studies and activities.",
      "content": "Help her with her studies and activities. Let your studies and extracurricular activities bring you closer together. This will be beneficial for your grades, achievements, and your relationship. Help her study for a test during lunch or in the library before school starts. If she’s auditioning for the basketball team, offer to practice with her before tryouts. Help her study by making index cards with questions that might be on the test and quiz her on them. Encourage your girlfriend to stay on track and focus on her goals."
    },
    {
      "title": "Believe",
      "content": "Believe in yourself. [12] X Expert Source Cher Gopman Dating Coach Expert Interview. 17 May 2019. It is important to believe that you are cool, fun, and whatever else you want to be. Thinking poorly of yourself will reflect in your behavior around your girlfriend. Believing in yourself will build confidence, which will help when you’re around your girlfriend and with life in general. [13] X Research source Don’t give into thoughts that tell you that you’re acting weird or uncool. Remember that she agreed to be your girlfriend for a reason."
    },
    {
      "title": "Don’t try too hard.",
      "content": "Don’t try too hard. Trying too hard means acting like you wouldn’t normally act around friends, thinking about conversations before they happen, and simply not acting like yourself. You should make an effort to treat your girlfriend with kindness and respect, but that doesn’t mean acting unlike you normally would. [14] X Expert Source Cher Gopman Dating Coach Expert Interview. 17 May 2019. Be in the moment with your girlfriend. Don’t plan ahead how you’re going to act, look, or what compliments you’re going to give her. Also, don't act like how you think she'd want you to act. After all, she chose to be your girlfriend because she liked how you are right now."
    },
    {
      "title": "Avoid planning conversations.",
      "content": "Avoid planning conversations. It’s important to be in the moment as much as possible. The interaction could become awkward if you’ve planned for it to go in a certain direction but it doesn’t. Listen closely to your girlfriend and go off of what she says. If you’re a very nervous person, you can plan a few conversation topics, but don’t plan out the entire conversation. If she isn’t contributing to the conversation, ask about her day, what she has planned for the week, or what she has been working on in class. Let her answers generate new conversations. When asking questions, avoid ones with \"yes\" or \"no\" answers. Instead of asking \"did you have a good weekend?\" ask \"What did you do over the weekend?\""
    },
    {
      "title": "Relax",
      "content": "Relax . Feeling nervous is totally normal, but don’t let that feeling control your behavior. Take a few deep breaths and remember how great the situation is. You have a girlfriend at a wonderful time in your life. Remember how great that is so you can enjoy your time with her without the worry. If you’re very nervous, think of things that make you happy to help you calm down. For example, think of a favorite song or movie."
    },
    {
      "title": "Avoid overanalyzing the situation.",
      "content": "Avoid overanalyzing the situation. Awkward moments will happen during a relationship. You or her may say something that doesn’t come out as intended. Or, one of you may simply be in a bad mood one day. Don’t take it wrong if she seems quieter than usual, doesn’t hug you at the beginning of the day, or compliments another guy or girl. Simply ask if something is bothering her if you feel the need to do so. [15] X Research source Don’t get angry with her or act upset over a small situation—like her forgetting to say bye after class. Don't get ahead of yourself. Just because she is liking a lot of pretty dresses on social media doesn't mean she's planning anything big for you. She might just like dresses."
    },
    {
      "title": "Don’t expect anything from your girlfriend.",
      "content": "Don’t expect anything from your girlfriend. Expecting a certain outcome can take a toll on your confidence. It can affect your confidence if the outcome you imagine doesn’t happen. For example, your behavior can change if you expect your girlfriend to let you kiss her after you compliment her. Or, expecting a certain outcome can make you overbearing or approval seeking. Accept whatever happens. [16] X Research source"
    }
  ]
}