{
  "url": "https://www.wikihow.com/Convince-Your-Parents-to-Let-You-Homeschool",
  "title": "How to Convince Your Parents to Let You Homeschool",
  "steps": [
    {
      "title": "Write out a list of reasons why you want to be homeschooled.",
      "content": "Write out a list of reasons why you want to be homeschooled. Think about why you want to be homeschooled. Make sure you have a clear reason (or set of reasons) that you can explain to your parents when the time comes. [1] X Research source Stating your reasons and explaining how they line up with your values is a good negotiation tactic. There are lots of reasons students give for wanting to switch to homeschool: not being challenged (or being too challenged) by the material in school, being bullied by classmates, struggling to focus, or feeling unsafe or anxious in the classroom. [2] X Research source"
    },
    {
      "title": "Research different homeschooling styles.",
      "content": "Research different homeschooling styles. To really convince your parents that this is the right option for you, you need to prove that you have a solid grasp of what it actually means to be homeschooled. Read reviews, ask questions on homeschooling forums, talk to other homeschooled kids or parents in your community, and figure out which program (or mix of programs) fits well with your learning style. [3] X Research source Some of the options include: complete curriculum packages from companies like Oak Meadow or Calvert, virtual schooling, and interest-led learning. [4] X Research source When thinking about what option is best for you, also consider the amount of time and money you think your parents can contribute."
    },
    {
      "title": "Outline your academic goals for being homeschooled.",
      "content": "Outline your academic goals for being homeschooled. Think about what kinds of things you’d like to accomplish during your first year of homeschooling. Chart your goals, including the types of records you’ll need to keep, how you intend to chart your progress, and what books and resources you might need. [5] X Research source Your parents can also help you with this. Let them know you’re putting together a plan to show them how much you’ll be able to learn and achieve in homeschool."
    },
    {
      "title": "Find the right time to present your plan to your parents.",
      "content": "Find the right time to present your plan to your parents. Don’t spring this conversation on your parents with no warning. Mention in advance that you’d like to talk to them about homeschooling, then suggest a time later that day or week when everyone has the time to sit down and concentrate on the discussion."
    },
    {
      "title": "Create a visual aid to help with the conversation.",
      "content": "Create a visual aid to help with the conversation. Put together the research that you’ve gathered into an easy-to-understand format like a Powerpoint or poster. This will add an air of maturity and preparation to your request. Plus, it can help you stay on-topic if you get nervous or flustered during the conversation. [6] X Research source Consider including a recommended reading list for your parents. Include books by well-known proponents of homeschooling such as Grace Llewellyn, John Gatto, and John Holt. [7] X Research source"
    },
    {
      "title": "Stay calm and mature during the conversation.",
      "content": "Stay calm and mature during the conversation. If your parents react negatively to your request, it can be easy to get angry or upset. But throwing a tantrum or screaming at your parents will make it harder for them to believe that you’re responsible enough to handle your own education. If things get heated, take a break and restart the conversation at a later time once things have calmed down. You might say, \"I'm going to wait until we're all feeling a little bit calmer because I think the conversation will go better. Thank you for being willing to listen to me—let's talk later.\""
    },
    {
      "title": "Don’t expect an answer right away.",
      "content": "Don’t expect an answer right away. Switching to homeschool is a major decision for both you and your parents. They will likely need some time to think about the decision. Your request to be homeschooled might make your parents sad at first, or make them worry that they’ve failed you as a parent. Give them some time to work through their feelings—and the logistics of switching to homeschooling."
    },
    {
      "title": "Refute common myths about homeschooling.",
      "content": "Refute common myths about homeschooling. Although homeschooling is an increasingly accepted alternative to other forms of schooling, there are many misconceptions that still exist about the practice. [8] X Research source See if you can debunk any of the concerns they may have. One of the biggest misconceptions about homeschooling is that it leads to underdeveloped social skills. Research has shown, however, that homeschooled children actually have significantly lower problem-behavior scores than those enrolled in conventional school. [9] X Research source Or, if your parents are worried that homeschool students are less likely to get accepted to college, tell them that 74% of homeschool students will earn college credits, compared to 46% of their conventionally-schooled peers. [10] X Research source"
    },
    {
      "title": "Talk about low-cost or free alternatives, if they are worried about money.",
      "content": "Talk about low-cost or free alternatives, if they are worried about money. Your parents might be concerned about the extra costs associated with homeschooling. Work together to figure out a cost-effective way to homeschool—for instance, you could borrow or rent curriculum packages from friends or a homeschool support group, instead of buying them outright. Consider offering to pay for some of the textbooks yourself, using income from a summer job or allowance money you have saved. [11] X Research source"
    },
    {
      "title": "Figure out a plan that works with your parents’ schedules.",
      "content": "Figure out a plan that works with your parents’ schedules. Your parents may be worried about fitting in time to teach you—especially if they work a full-time job. Talk to them about the various solutions other families have found to this problem. Do your research to see what homeschool resources are available in your area that can help make it easier for your parents. Some families collaborate with other families and trade kids on different days; others use homeschool cooperatives or university model homeschool academies, where kids actually attend class for part of the week. [12] X Research source"
    },
    {
      "title": "Compromise with your parents.",
      "content": "Compromise with your parents. If your parents aren’t on board with your original plan, figure out why, specifically, they turned you down. Think about which issues you will need to address to turn their “no” into a “yes.” Figure out if you can find a middle ground. [13] X Research source Consider proposing a trial period during summer break, for example. Your parents would get a taste of what homeschooling was like without having to commit."
    }
  ]
}