{
  "url": "https://www.wikihow.com/Comfort-a-Friend-Who-Has-Been-Sexually-Molested",
  "title": "How to Comfort a Friend Who Has Been Sexually Molested",
  "steps": [
    {
      "title": "Tell your friend you believe them.",
      "content": "Tell your friend you believe them. The most important thing you can do is let your friend know that you believe what they are telling you. Too often, victims are greeted with statements like, “Are you sure?” Instead, tell them, “I believe you. I hear what you are saying.” [1] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source It’s really difficult for most people to tell someone about abuse. Resist the urge to ask your friend for details, such as what happened and who did it. Make sure that your friend knows you are there for them and not to satisfy your own curiosity."
    },
    {
      "title": "Assure your friend that they are not to blame.",
      "content": "Assure your friend that they are not to blame. Many assault victims feel ashamed or even guilty after the incident. One way to comfort them is by telling them that nothing about this is their fault. [2] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source You can say, “I understand that you’re feeling lots of emotions, but remember that none of this is your fault.”"
    },
    {
      "title": "Remind them that they are not alone.",
      "content": "Remind them that they are not alone. Any type of sexual assault might leave your friend feeling isolated. That can increase their fear and make them even more emotional. Tell your friend that you are an ally and will be right there with them, and you will stay by their side. [3] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source Try something like, “I know this is scary, but I’m right here with you, and I will make sure you are safe.”"
    },
    {
      "title": "Be aware that many victims do not want to be touched physically.",
      "content": "Be aware that many victims do not want to be touched physically. Your friend might feel uncomfortable being touched, even if it is meant to be comforting. That's completely normal, and you should respect their wishes. Make sure you ask before trying to hug them or make any other comforting gestures. If they say they want a hug, by all means give them one!"
    },
    {
      "title": "Acknowledge that this has impacted their life and will do so for a long time.",
      "content": "Acknowledge that this has impacted their life and will do so for a long time. Your friend needs to feel like they are being heard. Tell them, “I know this is going to impact your life. I understand that you might feel like you can’t just move on or forget about it.” [4] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source Try to avoid saying things like, “It’s okay, it happens to lots of people.” Don’t say, “Now that it’s over you can just put it out of your mind.” Say something encouraging like, \"This will be difficult, but I believe in you. You're a survivor and while it may take a while, you can make it.\""
    },
    {
      "title": "Allow your friend to make their own decisions.",
      "content": "Allow your friend to make their own decisions. Remember that you are there to provide comfort and support. Even if you think you know best, avoid pressuring your friend to do something they are not comfortable with. For example, do not push them to contact the authorities if they are not ready for that. You should also let them decide who else they want to tell and when. If your friend is still indecisive, then you can help them by narrowing their choices while still empowering them to choose. Try asking questions like, \"Would you like to __ or __?\""
    },
    {
      "title": "Apologize if you do say the wrong thing.",
      "content": "Apologize if you do say the wrong thing. This is a tough situation and you might not be able to find the exact right words to say. If your friend reacts negatively to something you say, offer an immediate apology. Remember, everyone makes mistakes. Try saying, \"I can see that I really upset you. I'm so sorry. I won't say that again.\" You can also affirm your friend's experience. For example, if you accidentally implied that the perpetrator misread your friend's signals, say, \"I'm sorry I said he might have misread your signals. It was his responsibility to ask you if he was confused. You didn't do anything wrong.\" Make sure to be firm in your support of your friend and reiterate that it was not their fault. You may even have to speak in a strong voice and say something like, “It is NEVER okay to hurt someone like that!”"
    },
    {
      "title": "Talk to a trusted adult.",
      "content": "Talk to a trusted adult. If you or your friend (or both of you) are kids or teens, don't try to handle this on your own. It might be scary, but the best way to get help is to tell an adult what happened. Parents, teachers, coaches, aunts/uncles, and grandparents are some examples of who you can talk to about this."
    },
    {
      "title": "Locate a sexual assault crisis center in your area.",
      "content": "Locate a sexual assault crisis center in your area. Try to find a local sexual assault crisis center and contact them first. They can help your friend to navigate the reporting process and provide other resources to help them, such as medical resources. Check your local phone book or run an internet search to find a crisis center in your area."
    },
    {
      "title": "Contact the police if your friend wants you to.",
      "content": "Contact the police if your friend wants you to. At your friend’s request, call the non-emergency number for your local police station. Tell them that your friend would like to report sexual assault. The next step will be for an officer to take a written record of your friend’s statement. Your friend has the right to choose the location--it could be their home, the hospital, or anywhere that they feel comfortable. You can help your friend by being there to support them. You can offer encouraging statements and remind them that they are not alone. Remember that many victims feel uncomfortable contacting the authorities. That’s okay. Don’t pressure them. You may even want to look up the laws for reporting sexual assault in your state or country because in some places you can still report a crime years later. Letting your friend know that they can still report it later if they choose to may help to reassure them."
    },
    {
      "title": "Help your friend seek medical care if they want to.",
      "content": "Help your friend seek medical care if they want to. If your friend mentions medical care, you can remind them that they have several options. They can seek treatment at a hospital or private doctor’s office. If your friend is a student, they could visit the campus health clinic. This will probably feel really scary and intimidating for your friend. Keep offering them comfort and supportive statements, but encourage them to seek treatment as soon as possible to get checked for STDs and receive emergency contraception if needed. [5] X Research source It might reassure your friend to have you there while the exam is conducted. Just remember to let them make their own decisions. Keep in mind that DNA evidence from a sexual assault is only good if it is collected within 72 hours of the assault. Find a hospital with a forensic nurse (also known as a SANE nurse) who can collect this evidence, which can be used in court if needed. However, make sure your friend knows that whether or not to use the evidence is up to them."
    },
    {
      "title": "Give your friend important websites and phone numbers.",
      "content": "Give your friend important websites and phone numbers. Your friend might feel alone and frightened. Letting them know that there are lots of resources available might make them feel better. You can give them a list of organizations that they can contact. RAINN is the largest anti-sexual assault network in the U.S. Your friend can call the helpline 24/7 at 1-800-656-HOPE or live chat through the website. [6] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source Most states in the U.S. have statewide hotlines. For example, in Iowa, you could contact the Iowa Sexual Abuse Hotline at 1-800-284-7821."
    },
    {
      "title": "Offer to help them seek counseling.",
      "content": "Offer to help them seek counseling. After an assault, your friend will likely be experiencing a wide range of emotions. They might be in shock, scared, angry, or ashamed. A mental health specialist can help them process and manage these emotions. You can gently suggest going to see someone. [7] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source Try saying, “It might help to talk to a professional. Would you like me to contact the student health center and see what counseling services they provide?” If they say yes, you can find some options to give them. If they say no, leave it at that. Many communities also have rape crisis centers that offer free counseling to survivors. Check to see if there is one in your community. If not, try to help your friend find a therapist who is experienced with sexual assault survivors."
    },
    {
      "title": "Go to a community or campus support center.",
      "content": "Go to a community or campus support center. If your friend feels isolated, it might be helpful for them to connect with other survivors. Ask them if they would like to visit a support group. If they say yes, you can help them find one at a community center or on campus. Showing your friend that there are resources available to them can be a great way to comfort and support them. [8] X Research source"
    },
    {
      "title": "Be patient with your friend.",
      "content": "Be patient with your friend. Abuse is not something that your friend will just “get over.” The healing process can take a long time. It’s great to provide your friend immediate comfort, but don’t forget that you’ll need to continue to do so. Understand that for a while they might at times seem irritable or withdrawn. That’s normal. [9] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source Avoid saying things like, “Aren’t you feeling better yet?” or “Wow, you’re still not over that?”"
    },
    {
      "title": "Check in periodically.",
      "content": "Check in periodically. Your friend might not show any outward signs that they are still dealing with being sexually abused. But that doesn’t mean that they have completely healed. Every so often ask your friend how they are doing. You could also just send a text that says, “I’m thinking of you. Let me know if you need to talk.” [10] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source Keep asking your friend to do things. Don’t assume that your friend no longer wants to do anything fun. Keep inviting them to do things like take a walk or go to a movie."
    },
    {
      "title": "Encourage your friend to practice self-care.",
      "content": "Encourage your friend to practice self-care. Show your friend that you care by reminding them to take good care of themselves. Many victims of abuse might feel shame or like they’re not worthy of good things. Encourage your friend to do things that they enjoy and even allow themselves special treats. [11] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source For example, you might encourage your friend to get a cupcake from their favorite bakery. Self-care can also mean making sure to eat healthy foods and get exercise. Encourage your friend to take good care of themselves."
    },
    {
      "title": "Invite your friend to social activities that do not involve alcohol or drugs.",
      "content": "Invite your friend to social activities that do not involve alcohol or drugs. Be sure to invite your friend to do things with other groups of friends as well, but keep in mind that they may not feel comfortable being in big groups for a while. Let them know that you are also there for them if they just want to hang out one-on-one. Some activities you might consider inviting your friend to do include going: Bowling, golfing, or to an exercise class with a group of friends. Out to a restaurant for a meal or for coffee. Hiking or biking. To see a movie."
    },
    {
      "title": "Take care of your own needs.",
      "content": "Take care of your own needs. Comforting your friend is important, but it can also be really difficult. You’ll likely deal with your own wide range of emotions, such as frustration and anxiety. Remember to be kind to yourself. Spend time with other friends, make sure your own needs are met, and seek counseling for yourself if necessary. [12] X Research source"
    }
  ]
}