{
  "url": "https://www.wikihow.com/Choose-a-Cat",
  "title": "How to Choose a Cat",
  "steps": [
    {
      "title": "Commit to a long-term investment.",
      "content": "Commit to a long-term investment. Cats can live for up to 20 years. If you adopt or purchase a cat, it could be at home with you for as long (or even longer!) as your children are. Make sure that you’re committed to giving your furry buddy a “forever home.”"
    },
    {
      "title": "Make sure that you’re allowed to have a cat at home.",
      "content": "Make sure that you’re allowed to have a cat at home. Cats can be a great choice for people with limited space, such as apartment-dwellers. However, you should check with your landlord, homeowner’s association, etc., to make sure that you’re allowed to have a cat live with you. Cats should actually not be “outdoor” cats. Indoor cats in general live longer, healthier lives than outdoor cats and are at a lower risk of developing diseases and injuries. Indoor cats are also more comfortable with humans."
    },
    {
      "title": "Make sure you'll have enough time for a cat.",
      "content": "Make sure you'll have enough time for a cat. Cats don’t usually require as much companionship as dogs do, but nevertheless, it’s important to consider how much time you’ll have to spend with your cat. If you won’t have the time to play with your cat, give it the necessary food and attention, and bond with it, now may not be the right time for you to get a cat. You should be able to give at least one hour per day of time to your cat. This will help you bond and will keep the cat feeling happy and healthy. [2] X Research source Daily grooming, which can take up to 20-30 minutes, may also be necessary if you adopt a long-hair breed. Talk with your vet or the animal shelter about your time commitments. They may recommend that you adopt a pair of cats, particularly if you find siblings. More than one cat means they can keep each other company when you’re away at work or gone for a long weekend. Kittens often require more upfront time commitment because they must be trained to use a litter box, not scratch on furniture, etc."
    },
    {
      "title": "Examine your budget.",
      "content": "Examine your budget. Feeding and caring for a cat is not free. The cost can range between $500-$1,000 a year on average. [3] X Research source Your expenses will vary depending on whether you have a kitten or an adult cat, as well as the type of breed you have. Veterinary care and grooming are common expenses that can add up over time. Kittens are usually more expensive to start with, as they usually need vaccinations, dewormings, and neutering or spaying. They are going to grow up and become cats, so why wait? Adopting an older cat is just as good, especially since they are calmer. Although cats naturally groom themselves, long-haired breeds may require additional grooming. Cats with brachycephaly, or \"pushed in\" faces (like Persians and Himalayans) will often need the area around their eyes cleaned to prevent infection. [4] X Research source Look at the prices of quality cat food and treats in your area. This can help you get an idea of what it will cost to feed your cat."
    },
    {
      "title": "Consider your household.",
      "content": "Consider your household. You need to consider what your home environment is like before you adopt a cat. Here are some questions to ask yourself: Do you already have other pets? How will a new cat fit in with them? Do you have young children? Young children may be too rough with kittens and can accidentally harm them. [5] X Research source What’s the activity level in your household? Are you energetic, on-the-go? Or do you prefer calmly chilling on the couch? Kittens tend to be very active and will need constant supervision. Adult cats are often calmer and need less supervision, although this can vary by breed and even individual cat."
    },
    {
      "title": "Account for health issues.",
      "content": "Account for health issues. If you or someone in your household has allergies or other health issues, consider how a cat could affect these. [6] X Research source Millions of people are allergic to things like pet dander, saliva, dead skin, and urine. [7] X Research source Considering the breed’s hair length can help prevent allergy troubles. A short-hair (smooth glossy coat) breed is best for most people. These cats usually do not require extensive grooming. While they shed, you can clean up fur fairly easily with a vacuum or brush. Medium-hair (modestly fluffy coat) and long-hair cats (long, flowing coats) require grooming. You will need to brush and comb their fur regularly. With long-haired cats, grooming is often required daily. A few breeds have no hair (and are hypoallergenic). However, these cats routinely get very cold and require things like sweaters to keep them warm. They’re also not furry when you pet them, which is undesirable to some people."
    },
    {
      "title": "Choose the right type of cat companion for you.",
      "content": "Choose the right type of cat companion for you. The type and age of cat you adopt will affect the type of relationship you have with it. Do you want a cat that will sit on your lap and just chill with you? Would you prefer a cat that will keep you entertained and interact with you? Considering what you hope to get out of having a cat will help you decide what type of cat is right for you. Kittens’ personalities aren’t fully developed, so it can be harder to know what kind of attitude and relationship they’ll have with you until they’re older. Consulting a breed encyclopedia, such as Animal Planet’s Cat Breed Directory [8] X Research source , can help you learn about the common characteristics of particular breeds, such as their speech, independence, and intelligence. Keep in mind that every cat is different, though."
    },
    {
      "title": "Research cat breeds.",
      "content": "Research cat breeds. Purebred cats have advantages and disadvantages. Cat breeds have distinct characteristics that are often passed down through generations, such as a Siamese’s tendency to meow all the time or a Siberian’s willingness to be handled. If it’s very important that your cat have a particular characteristic, you might consider a purebred cat, but remember that there’s no guarantee that any trait will be present in every individual cat. [9] X Research source Purebred cats also tend to have particular health problems. For example, Persian and Himalayan cats tend to have heart and kidney disease problems, while Maine Coons have hip problems and heart disease issues."
    },
    {
      "title": "Visit your local shelter.",
      "content": "Visit your local shelter. Animal shelters, humane societies, and foster networks have a great selection of cats who need loving homes. In the United States, 6-8 million pets are in shelters every year, but only about half are adopted. Visit your local humane society or animal shelter, or look online to see if there are cats in need of a home in your area. Pets adopted from shelters often cost less than purchasing a cat from a breeder or pet store. Cats from pet stores and breeders can cost hundreds, even thousands of dollars, but it’s rare for a shelter or foster network to charge more than $100 or $200 to rehome a cat. You don’t have to buy from a breeder to adopt a purebred cat. There are many rescue organizations that rescue abandoned or mistreated purebreds. In fact, up to 25% of pets in animal shelters are purebreds. Talk with the employees or volunteers at the shelter. They often can tell you the history of the cat, as well as any medical or behavioral issues the cat has."
    },
    {
      "title": "Visit a breeder.",
      "content": "Visit a breeder. Investigate any breeder’s reputation before purchasing a cat. If you can, visit and examine the conditions the cats are being kept in for yourself. The last thing you want to do is contribute to breeders mistreating animals. If you see cats being mistreated or feel that the breeder is not being upfront with you, don’t buy a cat from the operation. [10] X Research source Look for telltale signs of cat abuse, such as piles of cat hair everywhere, overwhelming odor, injured animals, and overgrown nails. The cats should be healthy and should seem happy. Ask about the cat you’re considering. Ask the breeder about whether it will be likely to have any health issues, behavioral problems, or special needs. The breeder should sound knowledgeable and honest about any issues. Make sure the cats are comfortable with other animals and people. Be very suspicious of unreasonably low prices. A designer breed that should cost thousands of dollars being sold for a few hundred suggests that the breeder is either cutting corners or being dishonest about the cat. On the other hand, sky-high prices don’t guarantee quality."
    },
    {
      "title": "Search online.",
      "content": "Search online. You may find ads online or in the newspaper for cats that are for sale or “free to a good home.” While it’s certainly possible to adopt a cat from a neighbor or even a stranger on craigslist, you should be aware that there are risks to this. The person offering the cat may not know much about its temperament, history, or breed. Make sure that you get any medical records or other paperwork from the person offering the cat. If it is a cat for sale, you may have a hard time getting your money back if the cat turns out to be different than you were promised."
    },
    {
      "title": "Go to the pet store.",
      "content": "Go to the pet store. Pet stores may sell cats they have purchased from a breeder, or they may have an “adoption center” where rescued cats can be adopted. Be aware that employees at pet stores may love animals, but they rarely have the same level of knowledge about the cats that the people who work with animal shelters or rescue groups do. Always ask the store where they get their cats and kittens for sale. Stores may acquire their cats from kitten mills that breed cats under unethical, harmful conditions. Research the breeders that provide the cats. They should seem knowledgeable about the breed, any potential behavior or health issues, and the cat’s personal history (family, etc.). Purebred cats should also have documentation from a local vet and paperwork, such as registration papers or health certificates. [11] X Research source If your pet store offers adoption from shelters or adoption agencies, choose one of those cats. Adopting a cat rather than purchasing one will ensure you do not send profit to an unethical kitten mill."
    },
    {
      "title": "Adopt a stray.",
      "content": "Adopt a stray. Sometimes, a cat may just show up at your doorstep and ask for love. While this is certainly one way to include a cat in your life, there are a few things to consider: Make sure that the cat doesn’t belong to someone else. Sometimes, “stray” cats have eluded their owners, who really want them back. Place an ad in the classifieds or on the internet describing the cat you’ve discovered. Call your local animal shelters to see if a missing animal has been reported. Remember that stray cats may have behavioral issues. Life on the streets is hard, and a stray cat may have trouble integrating into a new home life, especially if you already have other pets. Get the cat examined by a veterinarian before taking it into your home. Cats can carry diseases and infections. Before you adopt a stray cat and let it live with you, have it examined by a vet to make sure it’s healthy."
    },
    {
      "title": "Look past the cat’s looks.",
      "content": "Look past the cat’s looks. Much like humans, cats should not be judged by their outer beauty alone. While there’s nothing wrong with feeling drawn to an adorable face, make sure you consider more than the cat’s appearance when making your decision. [12] X Research source"
    },
    {
      "title": "Ask about adoption counseling.",
      "content": "Ask about adoption counseling. Many shelters and foster networks offer free adoption counseling, where they will ask you about your needs, lifestyle, and personality and make recommendations from there. This is a great way for you to meet cats that will mesh with you and your needs. [13] X Research source"
    },
    {
      "title": "Bring along everyone the cat will interact with.",
      "content": "Bring along everyone the cat will interact with. It’s helpful to get an idea of how the cat will interact with everyone in your household, especially children. If you can, bring everyone when you meet the cat to see how everyone gets along."
    },
    {
      "title": "Ask to hold the animal you like.",
      "content": "Ask to hold the animal you like. Ask an employee or volunteer to show you how to handle the cat. Every cat has individual preferences about how it is handled that the workers will probably be more familiar with. This can help prevent things like biting and scratching. If the cat resists, don't force it. Some cats are very affectionate, but just do not like to be held. Other cats may simply be uncomfortable in an unfamiliar environment and will warm up over time. Make your hand into a fist and extend it towards the cat. This is a human method for mimicking a feline greeting. [14] X Research source If the cat head-butts your hand, this is a friendly greeting. If he/she looks away or backs away, the cat may not like meeting new people. If the cat attempts to scratch or bite you, this doesn’t mean you shouldn’t adopt it. Many cats scratch or bite when they are anxious or afraid. However, a cat who bites or scratches may not be a good choice for a household with small children."
    },
    {
      "title": "Check the cat for signs of illness.",
      "content": "Check the cat for signs of illness. Make sure that the cat is healthy. If you do see problem areas, it isn’t a sign you shouldn’t adopt the cat -- sometimes, cats in shelters or foster homes have health problems that just need a little love and care to clear up. Here are some things to look for: Eyes. They should be bright and free of discharge or buildup. Nose. It should not have any discharge, and the cat should not display excessive sneezing. Ears. They should be free of dark wax or buildup and should not smell bad. The cat should not shake its head frequently or paw at its ears. Chest. The cat’s breathing should sound clear, without wheezing or coughing. Fur. It should be clean and free of any parasites, such as fleas or ticks. Look in the armpits and on the belly for signs of fleas. Skin. It should be clean and undamaged. If the cat does have old wounds, they should be clean and well-tended. Bottom. It should be clean and should not have any signs of diarrhea or worms. (Check the litter box for signs of diarrhea or parasites, too.)"
    },
    {
      "title": "Ask about the cat’s history.",
      "content": "Ask about the cat’s history. It’s important to get as much information about the cat as you can before you make your decision. Some good questions to ask include: [15] X Research source ttp://princetonvet.net/10-tips-to-choose-the-right-shelter-cat/ How long has the cat been there? Why is the cat there? How does the cat interact with other cats, the staff, and other animals? What is the cat’s personality like? Does the volunteer/employee/breeder have any concerns? Does the cat have any health issues?"
    },
    {
      "title": "Ask how the cat has been socialized.",
      "content": "Ask how the cat has been socialized. Especially with purebred kittens, it's important that they be socialized with a variety of different people, sights, sounds, smells, and other experiences in their first 12 weeks of life. Without proper socialization, the kitten could grow up into a cat that doesn't like people, or is even aggressive. Studies show that kittens who get plenty of human contact in their first 7 weeks are more likely to mature into friendly, well-developed cats. [16] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Good socialization includes holding and petting kittens for at least a few minutes every day soon after they're born. However, newborn kittens should not be taken away from their mother for more than a few seconds at a time. Doing so could make her anxious or even cause her to reject the kitten. Other important socialization processes include playing with toys, interacting with people in games such as chasing and pouncing, and exploring different types of objects, such as cardboard boxes, paper bags, and scratching posts. Make sure that the kitten has not been socialized to consider fingers and toes as toys. Kittens may accidentally scratch or bite while playing, but this behavior should not be encouraged. The kitten should always be redirected to an appropriate toy if scratching or biting happens. Kittens should also encounter many different people so they're less likely to be shy of strangers."
    },
    {
      "title": "Consider an older cat.",
      "content": "Consider an older cat. With all the tiny kittens available, it can be tempting to go straight for the cute and forget about older cats. However, older cats pose some advantages: Their personalities are usually set, so you are likely to know more about how the cat will behave and what its attitude is like. Older cats are often litter box-trained and don’t require as much supervision. Older cats are usually calmer and are better with small children. If your older cat wasn't properly socialized as a kitten, you can still teach her remedial socialization. It may take a lot longer, but with patience and training, even an adult cat can become less skittish. [17] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Find out whether the cat you're interested in is one of a bonded pair.",
      "content": "Find out whether the cat you're interested in is one of a bonded pair. Cats sometimes come into shelters with another cat with whom they have already bonded, or form a bond while in the shelter. If separated they may suffer emotionally and have difficulty forming future bonds with other pets. [18] X Research source If you are looking to adopt two cats, an already bonded pair is a good choice, as they will comfort each other through the stress of relocation."
    },
    {
      "title": "Check the cat’s veterinary records.",
      "content": "Check the cat’s veterinary records. If available, see which tests and vaccinations the cat has already had. This can help you determine the cat’s overall health and plan for any future health expenses. It’s common to check cats for the Feline Immunodeficiency Virus (FIV) and Feline Leukemia (FeLV) before bringing the new pet to a home that has another cat. These diseases are easily transmissible to other animals. It’s a good idea to test your potential cat before adoption, whether or not you have another cat at home."
    },
    {
      "title": "Ask whether there is a veterinarian visit included or available with the purchase/adoption.",
      "content": "Ask whether there is a veterinarian visit included or available with the purchase/adoption. In many cases, this is included -- even required -- when acquiring a new cat. Typically, you will be allowed a certain amount of time to schedule this initial visit, which will catch anything you may have missed. This can be helpful to discuss with the vet any needs that your new cat has. If you have other cats or pets in your household, it’s recommended that you take your new cat to the vet before you bring it home."
    },
    {
      "title": "Ask about a sleepover option.",
      "content": "Ask about a sleepover option. Many shelters and foster networks will allow you to bring a cat home for a short \"trial\" period (usually a few nights to a week). If you are able to do this, it is very helpful for ensuring that the cat will blend in with your family and any other animals you have. Remember that the cat may be very anxious in your home at first. Be patient as the cat becomes adjusted to its new environment."
    }
  ]
}