{
  "url": "https://www.wikihow.com/Clear-System-Data-on-Mac",
  "title": "Easy Guide to Safely Deleting System Data on Mac",
  "steps": [
    {
      "title": "“System” is a catch-all storage category on Mac.",
      "content": "“System” is a catch-all storage category on Mac. If you’ve ever looked at the storage breakdown on your Mac, you might have noticed a mysterious category called “System,” “System Data,” or “macOS,” depending on which version of macOS you’re using. In older versions of macOS (Monterey and earlier), some of this data was put in a category called “Other.” Whatever it’s called, this category typically contains items that don’t fit neatly into other storage categories, such as: Temporary files generated by apps Browser and system caches System backups Disk image or installer files Plug-ins and extensions"
    },
    {
      "title": "The right way to check System storage depends on your OS.",
      "content": "The right way to check System storage depends on your OS. If you want to see how much space System Data is taking up on your Mac, here’s how to do it: In macOS Ventura: Click the Apple menu in the top left corner of the screen, then click System Settings > General > Storage . Wait for your computer to finish calculating your storage, then hover over the System Data category to see how much space it’s taking up. In pre-Ventura versions of macOS: Go to Apple > About This Mac > Storage ."
    },
    {
      "title": "Open the Apple menu.",
      "content": "Open the Apple menu . Time Machine snapshots are backups that let you restore your files in case something goes wrong with your system. Some of these snapshots may be stored locally on your Mac, which can take up a lot of space. Fortunately, it’s easy to delete them. To get started, click the Apple menu in the top left corner of your screen. [1] X Research source"
    },
    {
      "title": "Select System Settings.",
      "content": "Select System Settings . Or, if you’re using macOS Monterey or earlier, click System Preferences ."
    },
    {
      "title": "Click General.",
      "content": "Click General . You’ll find it in the sidebar on the left side of the System Settings window. If you’re using macOS Monterey or earlier, skip this step."
    },
    {
      "title": "Click Time Machine.",
      "content": "Click Time Machine . This will open the Time Machine settings window. #*If you never activated Time Machine, you’ll see a button saying Add Backup Disk… ."
    },
    {
      "title": "Click Options.",
      "content": "Click Options . If you’re using macOS Monterey or earlier, skip this and just toggle off the switch next to Back Up Automatically instead."
    },
    {
      "title": "Select Manually from the Back up frequency menu.",
      "content": "Select Manually from the Back up frequency menu. Click Done to save your selection. After you turn off automatic backup, your local Time Machine snapshots will be deleted automatically. Wait a few minutes for the process to finish, then turn automatic backup back on if you want Time Machine to keep backing up your files."
    },
    {
      "title": "Use caution when clearing the system cache.",
      "content": "Use caution when clearing the system cache. System cache files are temporary files that your Mac stores to help your operating system run smoothly. While it is sometimes possible to delete these files safely, it’s usually best to leave them alone. Don’t mess with your system cache files unless you have some specific reason to do so (e.g., if you’ve been instructed to do so in the developer’s documentation for an app). If you do need to delete these files: Back up your Mac before making any changes. Open the Finder and click Go in the menu bar at the top of the screen, then select Go to Folder . Type /Library/Caches into the text field, select the top result, and tap return . Open the cache folder that contains the file(s) you want to delete, locate the files, and drag them to the Trash."
    },
    {
      "title": "Clear application caches if your apps are glitchy.",
      "content": "Clear application caches if your apps are glitchy. Your individual apps also save a lot of cache files to help the apps load faster. However, if you’ve noticed an app isn’t running the way it’s supposed to, clearing the cache for the app might help. First, check if there’s a way to clear the cache from within the app itself (for instance, this is an option for most browsers). Otherwise, you can do it manually from the Finder: Go to Finder > Go > Go to Folder . Type /Users/[YourUserName]/Library/Caches into the text field, but replace [YourUserName] with the username for your account on the Mac. Select the first result and hit enter . Go into any of the folders in the list and drag the cache files to the Trash to delete them."
    },
    {
      "title": "Clear your browser caches safely at any time.",
      "content": "Clear your browser caches safely at any time. Whenever you surf the web, your browser will save cache files to help websites load faster the next time you visit them. If your browser is slow or you’re worried about the cache taking up extra room on your Mac, you can safely delete these files. Here’s how: Safari: Click the Safari menu at the top of the screen, then select Clear History . Select the time range for which you want to delete the cache, then click Clear History . Chrome: Go to Chrome > Clear Browsing Data and select all the types of data you want to clear (such as your browsing history, cookies, and cached images and files). Click Clear data . Firefox: Click History in the menu bar at the top of the screen, then select Clear Recent History . Check which types of history you want to delete (make sure Cache is checked), then click Clear Now ."
    },
    {
      "title": "You can safely delete old DMG files once you’ve installed an app.",
      "content": "You can safely delete old DMG files once you’ve installed an app. DMG or .dmg files (also called disk image files) are used to install applications on Mac. Once you’ve used the DMG file to install your software, you don’t need to keep it. You can get these old installation files off your Mac in a few simple steps: Open a Finder window and click the Search icon in the top right corner. Type in dmg and select Disk Image under the Kinds header in the dropdown list of results. Select any DMG files you don’t need anymore and drag them to the Trash . Open the Trash and click Empty to permanently delete them."
    },
    {
      "title": "Open a Finder window.",
      "content": "Open a Finder window. If you’ve ever backed up an iPhone or iPad to your Mac, the backup files can take up a lot of space. If you don’t need them anymore, free up room by deleting them. There are a few different ways to do this, but the easiest is to delete them directly from the backup folder. Start by opening the Finder from your Dock. [2] X Research source"
    },
    {
      "title": "Click Go and select Go to Folder.",
      "content": "Click Go and select Go to Folder . You’ll find the Go menu in the menu bar at the top of the screen. Choose Go to Folder to open a search box."
    },
    {
      "title": "Paste ~/Library/Application Support/MobileSync/Backup/ into the box.",
      "content": "Paste ~/Library/Application Support/MobileSync/Backup/ into the box. Click on the results and hit Return to go to the backup folder."
    },
    {
      "title": "Select and delete your old backups.",
      "content": "Select and delete your old backups. If you have any backups in the folder that you don’t need anymore, select them and drag them to the Trash. You can also select them and then press command+delete . Don’t forget to empty the trash when you’re done! You can also delete old iOS backups via the Finder (or iTunes, on older Macs) if your iOS device is plugged into your computer. In Finder, click your device in the left sidebar, then open the General tab and select Manage Backups . Ctrl-click or right-click any backups you want to delete and select Delete Backup , then click OK when you’re done. In iTunes, click the Devices tab, then select any backups you don’t want from the Device backups list and click Delete Backup ."
    },
    {
      "title": "Avoid deleting most hidden files.",
      "content": "Avoid deleting most hidden files. The “System” category contains a lot of hidden files that are there to help your Mac run smoothly. Many cannot be safely moved, modified, or deleted without destabilizing your computer. However, if you want to reveal these hidden files and decide if you want to delete some of them, here’s how to see them: Open a Finder window and press command + shift + H to go to the Home folder. Right-click or control-click the window and select Show View Options from the pop-up menu. Check the box next to Show Library Folder , then return to the Home window in Finder . Open the Library folder to view the System files."
    },
    {
      "title": "You can delete log files safely.",
      "content": "You can delete log files safely. In general, it’s best to leave System files alone unless you have some very specific reason for changing or deleting them. However, it’s safe to delete .log files. You’ll find these in the Logs folder in your Library. Go through the folders and delete any old .log files to clear out a bit of extra space on your Mac. [3] X Research source However, do not throw away the subfolders in the Log folder! Just throw out the files inside."
    },
    {
      "title": "Try a disk cleanup app for a more streamlined process.",
      "content": "Try a disk cleanup app for a more streamlined process. If you don’t feel like going through and manually deleting all these separate kinds of files, there are third-party apps that can make it easier for you. These apps will automatically search for and delete unneeded files that are taking up space on your lhard drive , including files in the System category. Many of the most popular options, including CleanMyMac, MacCleaner Pro, and DaisyDisk are paid apps. However, most of them offer free trials. There are also a few freeware or open source options, such as Disk Drill and Clean Me."
    }
  ]
}