{
  "url": "https://www.wikihow.com/Cancel-a-YMCA-Membership",
  "title": "How to Cancel a YMCA Membership",
  "steps": [
    {
      "title": "Contact your local YMCA about their cancellation policy.",
      "content": "Contact your local YMCA about their cancellation policy. Start by calling or emailing your local YMCA branch for information on their specific cancellation policy. Look for their contact number on their website or on the back of your YMCA membership card. You can also visit your local YMCA branch in person and speak to a representative at the front desk for more information. [1] X Research source"
    },
    {
      "title": "Give notice 10 to 30 days in advance.",
      "content": "Give notice 10 to 30 days in advance. The required advanced notice will depend on your YMCA branch’s policy. Some YMCA branches require you to give them 10 days notice before the payment for your membership is due. Other branches require as much as 25 to 30 days notice. Make sure you know the required amount of days notice and plan ahead so you can cancel your membership on time."
    },
    {
      "title": "Provide in person or written notice, if necessary.",
      "content": "Provide in person or written notice, if necessary. At some branches, you can give notice by filling out a cancellation form. You can do this in person at your local YMCA or by mail. You may not be able to provide notice of cancellation on the phone for security and processing purposes."
    },
    {
      "title": "Fill out a cancellation form.",
      "content": "Fill out a cancellation form. Some YMCA branches have an online cancellation form on their website that you can complete and submit from the comfort of your home. Other branches require you to visit them in person and complete the form there. [2] X Research source To fill out the form, you will need to provide your first and last name, your email, the reason why you are cancelling your membership, and the name of the YMCA branch where you are a member. [3] X Research source You may also need to provide your YMCA membership number."
    },
    {
      "title": "Submit the form by fax, email, or in person.",
      "content": "Submit the form by fax, email, or in person. Once you have filled out the cancellation form, submit it to your local YMCA branch by emailing or faxing it to a representative. Ask your local YMCA for the correct fax number or email address for the form. You can also submit the form in person at your local YMCA branch."
    },
    {
      "title": "Confirm your membership has been cancelled.",
      "content": "Confirm your membership has been cancelled. It may take several days for your request to process. You should then call or email your local YMCA branch to confirm your membership has been cancelled. If you set up direct deposit with your YMCA, you can also check your bank account to confirm your payments to the YMCA for your membership have been stopped. YMCA memberships are non-refundable. But you will not be charged a fee to cancel your membership."
    },
    {
      "title": "Renew your membership within 30 days to avoid an enrollment fee.",
      "content": "Renew your membership within 30 days to avoid an enrollment fee. If you decide to renew your YMCA membership , make sure you do so within 30 days of your cancellation. Most YMCA branches will waive your enrollment fee if you renew within 30 days. [4] X Research source"
    }
  ]
}