{
  "url": "https://www.wikihow.com/Accepting-Job-Offer-Email",
  "title": "How to Accept a Job Offer via Email",
  "steps": [
    {
      "title": "Write \"Acceptance of Job Offer\" or \"Job Offer Response\" in the subject line.",
      "content": "Write \"Acceptance of Job Offer\" or \"Job Offer Response\" in the subject line. Communicate the purpose of your email clearly and concisely in the subject line so the manager or recruiter knows what you're writing to them about. [1] X Research source If you decide to accept the job offer, write some variation of \"Acceptance of Job Offer.\" If you need to ask for more time to review the offer or are asking for certain conditions to be met, write, \"Job Offer Response.\" Use professional, polite language rather than informal, enthusiastic phrases like, \"I Accept!!\" or \"Yes, I Want the Job.\""
    },
    {
      "title": "Address the individual who sent the email by name with a polite salutation.",
      "content": "Address the individual who sent the email by name with a polite salutation. Begin the email with a salutation like, \"Dear,\" \"Good morning,\" or \"Hello.\" Follow it up with the name of the individual who sent the job offer, and use their preferred title. [2] X Research source For example, if they end all their emails with their first name, it's okay to call them by their first name in your email. If they end with a title like, \"Mr.,\" \"Ms.,\" or \"Dr.,\" use that instead. \"Dear Chad,...\" \"Good morning, Dr. Wilson,...\" \"Hello, Ms. Erin,…\""
    },
    {
      "title": "State your acceptance of the job offer.",
      "content": "State your acceptance of the job offer. Based on your subject line, the recipient already knows you're accepting or responding to their job offer. Launch right into your acceptance so they don't have to get past several sentences or a whole paragraph to find your answer. This is also a great time to express your gratitude for the offer, whether you plan to accept it right away or not. [3] X Research source \"Thank you for offering me the position. I'm happy to accept it.\" \"I appreciate the job offer and am writing to you to let you know I accept it.\" \"I'm pleased to accept the job offer.\""
    },
    {
      "title": "Confirm the agreed-upon salary, start date, work hours, and job location.",
      "content": "Confirm the agreed-upon salary, start date, work hours, and job location. Look over the job offer carefully and make sure you understand all the job terms you're agreeing to. Then list them out and state that you accept or agree to them. It's important to acknowledge conditions like your salary, start date, work hours, and job location so your employer knows you're not confused or being misled on any of that information. [4] X Research source It also leaves a record in case they try to change the terms without your knowledge or consent in the future. \"Per the job offer, I agree to a salary of $20/hr, a 9-5 Mon-Fri work schedule, and a start date of July 10th.\" \"I accept your $50,000/yr salary offer with paid holidays.\" \"I agree to a start date of May 7th at the store location on 50th St.\""
    },
    {
      "title": "Negotiate the terms of the offer if you don't think they're reasonable.",
      "content": "Negotiate the terms of the offer if you don't think they're reasonable. If you don't agree to some or any of the job offer terms, you may choose to negotiate instead of accept. Before taking this step, make sure you can justify your reasons for negotiating different conditions. [5] X Research source For example, if you're asking for higher pay, mention your experience and skill level or reference the current competitive job market. \"I appreciate the offer. I’d like to have a starting salary of $55k, rather than the offer of $45k, due to my years of experience in a similar position at Tech Corp. Is that amenable to you?\" \"Thank you for sending this job offer! Would it be possible to change my shift from 11 AM-5 PM to 9AM-3PM? The later shift would be a challenge since I have to pick up my kids from school at 4:30.\" \"Is it an option to change the job location? The one you mentioned is an hour away from my house and is a long commute. If not, do you have a gas compensation program I can enroll in?\""
    },
    {
      "title": "Ask any questions you have about starting the new job.",
      "content": "Ask any questions you have about starting the new job. By the time you receive a job offer, you should have already asked questions about your job terms, like how much you're going to be paid and what days of the week you're expected to work. But you can use your job acceptance email to ask questions about starting the job, in case they didn't include that information in the job offer. [6] X Research source \"Which location should I go to on the first day?\" \"Is there any other documentation you need from me to get started?\" \"When does training begin?\""
    },
    {
      "title": "Close with a professional sign-off and your name.",
      "content": "Close with a professional sign-off and your name. After accepting the job offer, confirming the terms, and asking questions (if you have any), end the email by saying you look forward to the next steps. Then close with a sign-off like, \"Sincerely\" or \"Regards,\" followed by your first and last name. [7] X Research source \"I'm looking forward to moving on to the next steps. Sincerely, Jane Grady\" \"I'm excited about this new opportunity and will wait for more details about my start date. Regards, Larry Green\" \"I'll see you on my start date. Have a great week, Hannah Lowe\""
    },
    {
      "title": "Example 1: Basic Job Offer Acceptance Email",
      "content": "Example 1: Basic Job Offer Acceptance Email Subject line: Acceptance of Job Offer Good morning, [Recruiter's Name], I'm writing to accept the job offer you sent me for the position of [Position Name] at [Company Name]. I appreciate your interest in having me on board, and I look forward to becoming part of the team. I also accept the salary rate of [Salary Amount], the working hours of [Hours and Days], and a start date of [Start Date]. Please let me know if you need anything else from me before my first shift. I look forward to your follow-up and confirmation of this email. Sincerely, [Your Name]"
    },
    {
      "title": "Example 2: Job Offer Acceptance with Questions",
      "content": "Example 2: Job Offer Acceptance with Questions Subject line: Job Offer Acceptance (+ Questions) Hello, [Recruiter's Name] I'm writing to accept the job offer you sent me for the position of [Position Name] at [Company Name]. It sounds exciting and I'm looking forward to starting soon. On that note, I have a couple of questions. When do you want me to start? Also, do you need me to send you any information in the meantime? Thank you for your prompt reply. Warm regards, [Your Name]"
    },
    {
      "title": "Example 3: Job Offer Acceptance for Relocation",
      "content": "Example 3: Job Offer Acceptance for Relocation Subject line: Acceptance of Job Offer & Relocation Hello, [Recruiter's Name] I'm happy to accept the position of [Position Name] at [Company Name]. I'm excited to relocate to [Location Name] and start this journey. I also accept the salary rate of [Salary Amount], the working hours of [Hours and Days], and a start date of [Start Date]. Thank you for this opportunity, and I look forward to meeting you in person soon. Sincerely, [Your Name]"
    },
    {
      "title": "Example 4: Job Offer Response Asking for Time to Review",
      "content": "Example 4: Job Offer Response Asking for Time to Review Subject line: Request to Review Job Offer Hello, [Recruiter's Name] Thank you for sending me a job offer for [Position Name] at your company. I'm looking forward to reviewing it in full. I can give you my official response by [Date], if that's acceptable. I look forward to reconnecting with you about the offer as soon as possible. Thank you, [Your Name]"
    },
    {
      "title": "Example 5: Job Offer Response Asking for Negotiation",
      "content": "Example 5: Job Offer Response Asking for Negotiation Subject line: Job Offer Negotiation Request Hello, [Recruiter's Name] Thank you for the job offer you sent me for the position of [Position Name] at [Company Name]. I appreciate this opportunity. I'd just like to go over some conditions I'd like to add to the offer. I agree to the working hours specified, but I'd like to see if you'd be willing to raise the salary to [Amount] in consideration of my experience and skill level. Thank you for your time. I look forward to your response. Sincerely, [Your Name]"
    },
    {
      "title": "Example 6: Job Offer Acceptance After Negotiation",
      "content": "Example 6: Job Offer Acceptance After Negotiation Subject line: Offer Acceptance w/ New Conditions Hello, [Recruiter's Name] I'm writing to accept the new offer you made me for the [Position Name] position. I appreciate your willingness to take the time to come to an arrangement we all agree on. I accept the salary rate of [Salary Amount], the working hours of [Hours and Days], and a start date of [Start Date]. I'm also happy to provide any documentation or information you need upon request. I look forward to working with you. Regards, [Your Name]"
    },
    {
      "title": "Avoid accepting the offer immediately (even if you plan on doing so later).",
      "content": "Avoid accepting the offer immediately (even if you plan on doing so later). As excited as you are to get a job offer, don't send your acceptance email right away! Instead, take a few minutes or up to 2-3 days to review the offer thoroughly. [8] X Research source \"What that'll do,\" says career coach Alyson Garrido, \"is… give you a moment to just absorb what's happening and understand what exactly is in the offer.\" Make sure you don't miss any important details, like whether the day they want you to start conflicts with something on your calendar. Taking time to review the offer doesn't mean you won't accept it! It just means you're going into it knowing your new employer's expectations. Remember to email the recruiter to let them know if you're going to take a day or two to review the offer. Write, \"Thank you for the job offer. I'm eager to look over it and send you my final response as soon as possible.\""
    },
    {
      "title": "Avoid using exclamation points and sounding overexcited.",
      "content": "Avoid using exclamation points and sounding overexcited. Getting a job offer is a wonderful thing, but expressing your enthusiasm with lots of exclamation points and gushing is unprofessional. Reign in your emotions and stick to formal language, with only 1-2 exclamation points at most (in fact, it may be best not to use them at all unless the person you're communicating with includes them in their emails)."
    },
    {
      "title": "Avoid sending the acceptance email without proofreading.",
      "content": "Avoid sending the acceptance email without proofreading. Read your response carefully before sending it off. [9] X Research source Make sure it's professional in tone, yet still conveys your enthusiasm for the offer. Also, consider again if you really want to agree to the terms they sent. Do you feel you deserve higher pay, or is the shift they want you to work difficult for you to accommodate? Remember you can always negotiate, but you must do it before you accept the offer."
    },
    {
      "title": "Send a follow-up email 1-2 weeks after their last response.",
      "content": "Send a follow-up email 1-2 weeks after their last response. Give the recruiter or manager some time to reply. It's possible they haven't replied because they're out of the office or they're still waiting for final approval to hire you from their higher-ups. If a couple of weeks have gone by and you still haven't heard back, send them a polite email asking for an update. [10] X Research source Write a clear subject line such as \"Job Offer Acceptance Follow-Up.\" Remind them you sent an acceptance email (include the date you sent it) and ask if there's anything else they need to proceed with the hiring process."
    },
    {
      "title": "Send your acceptance email within 1-2 days of receiving a job offer.",
      "content": "Send your acceptance email within 1-2 days of receiving a job offer. This gives you time to consider the offer terms more carefully and decide if you want to negotiate for higher pay or a different shift. When you're ready to officially accept, begin the email by thanking the recipient for the offer and stating your acceptance in clear language. Clarify that you agree with the terms stated in the offer (such as your salary and start date), ask any remaining questions you have, and then close with a polite sign-off."
    }
  ]
}