{
  "url": "https://www.wikihow.com/Attract-a-Boy-Who-Ignores-You",
  "title": "How to Attract a Boy Who Ignores You",
  "steps": [
    {
      "title": "Flashing a smile helps him notice you from across the room.",
      "content": "Flashing a smile helps him notice you from across the room. Boys find you more attractive when you smile, so grab his attention by showing off your grin whenever he’s around. He’ll think you’re in a good mood and that you’re more approachable, so he may feel more interested coming up to talk to you. [1] X Research source"
    },
    {
      "title": "Locking your eyes briefly shows that you’re interested.",
      "content": "Locking your eyes briefly shows that you’re interested. Whether you’re across the room or see him walking by, try to look directly into his eyes, even if it’s just for a second. As you meet his gaze, give a small smile before looking away. [2] X Expert Source Christina Jay, NLP Matchmaker & Certified Life Coach Expert Interview. 11 February 2020. Just a brief moment of eye contact could be enough to make him interested in you too. [3] X Research source Be careful not to stare at him so long that he gets uncomfortable. A quick glance is usually enough to convey that you want him to talk to you. [4] X Expert Source Christina Jay, NLP Matchmaker & Certified Life Coach Expert Interview. 11 February 2020."
    },
    {
      "title": "Show the boy you’ve noticed him with this quick gesture.",
      "content": "Show the boy you’ve noticed him with this quick gesture. If you make eye contact from across the room, quickly raise your eyebrows for a split second before lowering them back down. Since the gesture is a form of recognition, the guy may try to figure out how he knows you and feel encouraged to come talk to you. [5] X Research source Some guys are nervous to approach someone if they don’t think they’re interested in them, so this lets him know you’re open to conversation."
    },
    {
      "title": "This tells him that you’re playful and open for a conversation.",
      "content": "This tells him that you’re playful and open for a conversation. Try twirling your hair around your finger, running your fingers through your hair, or gently caressing a necklace or bracelet. You’ll look fun and flirty to the guy, especially if you look in his direction while you do it. [6] X Research source"
    },
    {
      "title": "Boost your confidence and attractiveness with this simple trick.",
      "content": "Boost your confidence and attractiveness with this simple trick. Keep your shoulders relaxed and look straight forward. Keep your back straight to help you seem more confident in how you look. The guy you’re crushing on may notice a slight change in how you look and be more willing to talk with you. [7] X Research source Be careful not to make yourself look closed off. Avoid crossing your arms and legs or leaning away from the person."
    },
    {
      "title": "Studies show that guys are more attracted to you in this bright color.",
      "content": "Studies show that guys are more attracted to you in this bright color. Look for a fun red top or accessory to add to your wardrobe so you can wear it around the boy you like. Since people associate warm and positive feelings, the guy you’re interested in might be more willing to reach out to you and ask you out. [8] X Research source You could also try putting on red lipstick to accentuate your lips."
    },
    {
      "title": "Flaunting your neck and shoulders catches his eye and makes him want more.",
      "content": "Flaunting your neck and shoulders catches his eye and makes him want more. Look for tops that are off-the-shoulder or have a lower neckline so you’re baring a little more skin. Things like body-slimming halters and tube tops work great too. If you’re a guy, try wearing clothes that show off your arms or a deeper V-neck. These confident and sexy looks discreetly make you more attractive to men without seeming like you’re desperate for their attention. [9] X Research source If you’re in school, make sure the clothes you’re wearing follow the dress code so you don’t get in trouble. Try to draw attention to your neck dimple, which is the small indentation right above your collarbone, with a necklace."
    },
    {
      "title": "Choosing a unique scent helps him remember you whenever he smells it.",
      "content": "Choosing a unique scent helps him remember you whenever he smells it. Find a subtle, good-smelling perfume or cologne to spritz on whenever you go out. Choose something that you haven’t smelled anyone else wearing since it’ll make you stand out better. Whenever the boy you like smells the perfume, it’ll remind him of you and make him more likely to talk to you. [10] X Research source Avoid scents that are strong or harsh since it could cause the guy to get a headache."
    },
    {
      "title": "A subtle touch lets a guy know you’re into him.",
      "content": "A subtle touch lets a guy know you’re into him. Try to make it seem like you weren’t trying to touch him on purpose. You could accidentally brush your hand against his leg as you walk by or accidentally bump into him on the way to class. Since you’ve made physical contact, you have a good excuse to chat with him. [11] X Research source Be careful that you aren’t too obvious when you bump into him, or else he may catch on and think you’re trying too hard."
    },
    {
      "title": "He’ll find you more attractive when surrounded by a group of friends.",
      "content": "He’ll find you more attractive when surrounded by a group of friends. When you’re around the guy that you like, try to be with at least 1 or 2 of your friends at the same time. It doesn’t matter if you’re hanging out with guys or girls. If the guy sees you in a small group, there’s a good chance they’ll be more attracted to you than if you were alone. [12] X Research source Once you get to know the guy a little better, you can break off from the group to spend time with him."
    },
    {
      "title": "Break the ice with a fun question to get them talking.",
      "content": "Break the ice with a fun question to get them talking. Try to ask a question that’s about something you can both relate to. Keep it open-ended rather than asking a yes-or-no question to encourage the guy to talk to you even more. Whenever he answers, be sure to respond back with your thoughts too so he gets to know you better. [13] X Research source For example, if you run into a guy at a cafe, you can ask, “Excuse me, what’s your favorite drink to get here?” As another example, if you’re at school, you may ask, “What did you think of that math test?” Reader Poll: We asked 1025 wikiHow readers what conversation topics they like to bring up with their crush, and 62% of them said hobbies and fun things they’ve done recently. [Take Poll]"
    },
    {
      "title": "Saying something nice shows that you want to talk to them more.",
      "content": "Saying something nice shows that you want to talk to them more. Point out something small that you notice about his appearance and mention it to him. Even saying something quick in passing can make the guy feel better about himself and invite him to say something nice in return. [14] X Research source For example, you could say, “Oh I love that pin you’re wearing!” or “Those are really cool shoes.” Try pairing your compliment with a question to keep talking. For example, you could say, “I really like that shirt. Where’d you get it?”"
    },
    {
      "title": "Let him come after you if he doesn’t respond to your advances.",
      "content": "Let him come after you if he doesn’t respond to your advances. Sometimes, guys will act like they’re not interested if you’re chasing after them. Instead, do exactly what they’re doing to you. Whenever you pass by them, don’t look at or take notice of them. Before long, he may be the one chasing after you. [15] X Research source Ignoring them also helps you get some space from the guy and move on if things don’t work out."
    }
  ]
}