{
  "url": "https://www.wikihow.com/Administer-a-Flu-Shot",
  "title": "How to Administer a Flu Shot",
  "steps": [
    {
      "title": "Avoid pre-filled vaccine syringes.",
      "content": "Avoid pre-filled vaccine syringes. The term \"pre-filled vaccine syringes\", in this case, is not referring to influenza vaccine syringes specifically manufactured as individual doses by the vaccine manufacturer, and, instead, refers to multiple, individual dose syringes filled from either single-dose or multi-dose vials before patients arrive at the clinic. If you are running a flu-shot clinic, try not to use pre-filled vaccine syringes. This can help avoid administration errors. [3] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source The Centers for Disease Control (CDC) suggests that the person who administers the vaccine should be the one who draws it from the vial. [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Take patient safety precautions.",
      "content": "Take patient safety precautions. Before administering the vaccine, you want to take several precautionary measures with the patient, including ensuring that he hasn't already had his annual vaccination. This can help ensure that the patient isn’t overexposed to the virus or has a history of bad reactions to the vaccine. Always inquire about allergies to avoid giving a medication to a patient with previous reactions. If the patient is unclear, request formal medical record. Always use a two step identification process asking for the patient's name and date of birth, to ensure the right patient is receiving the injection. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Get a copy of the patient’s medical history. This can prevent medical errors. [6] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Ask the patient if he’s had a history of bad reactions to the flu shot. Fever, dizziness or muscle pain may are common side effects of receiving the flu shot and should go away with time. Signs of severe allergy can include difficulty breathing, hives, wheezing, weakness and dizziness or heart palpitations. These symptoms are serious and should be evaluated immediately. [7] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source The Flublok influenza vaccine may be a good option for those people who have had allergic reactions in the past. It is prepared without the use of eggs, which can sometimes be the cause of an allergic reaction. It also does not use the actual flu virus itself to create a vaccine."
    },
    {
      "title": "Provide the patient with a Vaccine Information Statement (VIS).",
      "content": "Provide the patient with a Vaccine Information Statement (VIS). Every person who receives a flu shot must receive this statement. It explains the type of vaccine they received and how it works to keep them safe and eliminate flu epidemics. [8] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Document the date you provided the patient with the statement. Write it in the patient's chart or other vaccination record, if available. Ask the patient if she has any questions before continuing on to administer the dosage. In the medical record, it is important to include the expiration date of vaccine and lot number in case this information is needed in the future. The Centers for Disease Control also offers copies of the VIS on their website for informative purposes. [9] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. Use soap and water to wash your hands before giving an injection of any kind. This can help prevent the spread of the flu virus or any other bacteria you or the patient may have. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You don’t need special soap to clean your hands, any type will do; however, it is recommended to use an antibacterial soap if possible. Wash your hands thoroughly with soap and warm water for at least 20 seconds. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you like, use a hand sanitizer after you’ve washed your hands to kill any other bacteria you may have missed. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Clean the area where you will administer the shot.",
      "content": "Clean the area where you will administer the shot. Most flu vaccines are injected on the deltoid muscle of the right arm. Using a newly opened alcohol pad, lightly clean the deltoid area of the upper arm. This can help ensure the that no bacteria enters the injection site. [13] X Trustworthy Source Immunization Action Coalition Nonprofit organization focused on promoting the use of vaccines by distributing information about vaccines and the diseases they prevent. Go to source Make sure to use single-dose alcohol pad. [14] X Trustworthy Source Immunization Action Coalition Nonprofit organization focused on promoting the use of vaccines by distributing information about vaccines and the diseases they prevent. Go to source If the person has a large or especially hairy arm, consider using two alcohol pads to help ensure the deltoid area is clean."
    },
    {
      "title": "Select a clean, single-use needle.",
      "content": "Select a clean, single-use needle. Choose a needle appropriate for the size of your patient. Make sure it is a single-use needle that was sealed prior to the vaccine, which can help prevent the spread of diseases. [15] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Use a needle 1 to 1.5\" (2.5 to 3.8 cm) in length for an adult who weighs 132 lbs (60 kg) or more. This is a standard-sized needle, 22 – 25 gauge. [16] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Use a needle 5/8\" (1.58 cm) in length for children and adults who weigh less than 132 lbs (60 kg). Stretch the skin tightly when using a smaller needle. [17] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Place the needle on a new syringe.",
      "content": "Place the needle on a new syringe. Once you’ve selected the proper sized needle for your patient, place it on the syringe into which you will fill the vaccine. Make sure to select a new, single-use syringe to minimize the risk of infecting your patient with bacteria or other diseases. [18] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Fill the syringe with the flu vaccine.",
      "content": "Fill the syringe with the flu vaccine. Using a vial of the flu vaccine, or TIV-IM, fill your syringe with the appropriate dosage for your patient. The patient's age determines the proper dosage amount. [19] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Give 0.25 mL (0.05 tsp) to children from 6 months to 35 months in age. [20] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Give 0.5 mL (0.1 tsp) to all patients older than 35 months. [21] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source For adults age 65 years and older, you may give 0.5 mL of high-dose TIV-IM. [22] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you do not have 0.5ml syringes, you may use two single 0.25ml syringes. [23] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Inject the needle into the patient's deltoid muscle.",
      "content": "Inject the needle into the patient's deltoid muscle. Gather your patient’s deltoid muscle between your fingers and hold it somewhat tightly. Ask your patient which is his dominant hand, and inject the vaccine in the opposite arm to help prevent soreness. [24] X Trustworthy Source Immunization Action Coalition Nonprofit organization focused on promoting the use of vaccines by distributing information about vaccines and the diseases they prevent. Go to source If this is your first time administering a flu shot, you should have a seasoned nurse is monitoring your technique. Find the thickest part of the deltoid, which is often above the armpit and below the acromion, or top of the shoulder. [25] X Trustworthy Source Immunization Action Coalition Nonprofit organization focused on promoting the use of vaccines by distributing information about vaccines and the diseases they prevent. Go to source Firmly guide the needle into deltoid in one smooth action. The should be at a 90 degree angle to the skin. [26] X Trustworthy Source Immunization Action Coalition Nonprofit organization focused on promoting the use of vaccines by distributing information about vaccines and the diseases they prevent. Go to source For a child under four, inject the shot into the outer quadricep muscle, because they do not have enough muscle in the deltoid area. [27] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Administer the vaccine until the syringe is empty.",
      "content": "Administer the vaccine until the syringe is empty. Make sure to deliver the entire amount of vaccine in the syringe. Your patient needs the full dosage for optimum efficacy. [28] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If your patient is showing signs of discomfort, soothe or distract her by talking to her or putting a tv show on."
    },
    {
      "title": "Remove the needle from your patient.",
      "content": "Remove the needle from your patient. Once you administer the entire dosage, take the needle out of your patient. Apply pressure to the injection site to minimize pain and cover with a bandage. [29] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Tell your patient that some soreness is normal and shouldn't be cause for alarm. [30] X Trustworthy Source Immunization Action Coalition Nonprofit organization focused on promoting the use of vaccines by distributing information about vaccines and the diseases they prevent. Go to source Make sure to remove the needle and apply pressure simultaneously. [31] X Trustworthy Source Immunization Action Coalition Nonprofit organization focused on promoting the use of vaccines by distributing information about vaccines and the diseases they prevent. Go to source You can choose to cover the injection site with a bandage. You may find that this also calms many patients. [32] X Trustworthy Source Immunization Action Coalition Nonprofit organization focused on promoting the use of vaccines by distributing information about vaccines and the diseases they prevent. Go to source"
    },
    {
      "title": "Document the vaccine in the patient's medical record or immunization record.",
      "content": "Document the vaccine in the patient's medical record or immunization record. Include the date and place of vaccination. The patient will need these records in the future, and you may, too, if you remain their primary caregiver. It can help ensure that the patient doesn’t get too many doses of or overexposure to the vaccine."
    },
    {
      "title": "Inform parents of young children that they will require a second shot.",
      "content": "Inform parents of young children that they will require a second shot. For children between six months and eight years old, a second dose of the vaccine may be required four weeks after the first dose. [33] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If the child has never been vaccinated or his vaccination history is unknown, or if he has not received at least two doses of the vaccine before July 1, 2015, then he will need to follow up with a second shot. [34] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Instruct the patient to report any side effects.",
      "content": "Instruct the patient to report any side effects. Tell your patient to be aware of any side effects from the vaccine such as fever or aches. Although most side effects will go away on their own, if they are serious or persistent, instruct your patient to contact you. [35] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Make sure you have emergency medical protocol available if a worst-case situation happens. In addition, have the patient's emergency contact information on hand."
    },
    {
      "title": "Wash your hands frequently.",
      "content": "Wash your hands frequently. One of the most effective ways to prevent the flu is thorough and frequent hand-washing. This minimizes the spread of bacteria and the flu virus from surfaces that many people touch. Use a mild soap and water and wash your hands in warm water for at least 20 seconds. Use a hand sanitizer if soap and water are not available."
    },
    {
      "title": "Cover your nose and mouth when coughing or sneezing.",
      "content": "Cover your nose and mouth when coughing or sneezing. If you have the flu, and out of common courtesy, cover both your nose and mouth when you cough or sneeze. If possible, cough or sneeze into a tissue or the crook of your elbow to avoid contaminating your hands. Covering your nose and mouth minimizes the risk of spreading flu to those around you. Make sure you are sanitizing your hand with a thorough hand-washing after you sneeze, cough, or blow your nose."
    },
    {
      "title": "Stay away from crowded spaces.",
      "content": "Stay away from crowded spaces. The flu is very contagious and spreads most easily in places where crowds congregate. Staying away from crowded spaces can help minimize your risk of contracting the flu. Make sure to wash your hands after touching anything in crowded spaces, such as handles in public transportation. If you have the flu, stay home for at least 24 hours to help minimize the risk of spreading the flu to others."
    },
    {
      "title": "Disinfect shared surfaces and spaces often.",
      "content": "Disinfect shared surfaces and spaces often. Germs spread easily in places such as bathrooms or on kitchen surfaces. Cleaning and disinfecting these spaces frequently may help prevent spreading the flu virus. [36] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    }
  ]
}