{
  "url": "https://www.wikihow.com/Add-Labels-on-Google-Maps-on-PC-or-Mac",
  "title": "7 Easy Steps to Add Private Labels to Google Maps on Mac or Windows",
  "steps": [
    {
      "title": "Open Google Maps in an internet browser.",
      "content": "Open Google Maps in an internet browser. Type maps.google.com into your browser's address bar, and hit ↵ Enter or ⏎ Return on your keyboard."
    },
    {
      "title": "Log in to your Google account.",
      "content": "Log in to your Google account. Click the SIGN IN button on the top-right, and log in with your email and password."
    },
    {
      "title": "Click the Search bar.",
      "content": "Click the Search bar. The Search bar is located in the upper-left corner of your screen. It will allow you to enter an address, and find its location on the map."
    },
    {
      "title": "Enter an address into the search bar.",
      "content": "Enter an address into the search bar. This will drop a pin icon on all the matching locations on the left, and list them on the left-hand side."
    },
    {
      "title": "Click a location on the list.",
      "content": "Click a location on the list. This will open the selected location's details on the left panel. Here you can find the location's full address, and other available information, such as phone number, hours, and website. Alternatively, you can click a pin on the map. This will also open the location details."
    },
    {
      "title": "Find and click Add a label on the left panel.",
      "content": "Find and click Add a label on the left panel. This option is listed next to a blue flag icon towards the bottom of the location details."
    },
    {
      "title": "Enter a label into the text field.",
      "content": "Enter a label into the text field. Click the Add a label field on the top-left corner, type in the label you want to add, and hit ↵ Enter or ⏎ Return on your keyboard. This will save your new location label to your Google account."
    }
  ]
}