{
  "url": "https://www.wikihow.com/Contact-Jeff-Bezos",
  "title": "How to Contact Jeff Bezos",
  "steps": [
    {
      "title": "Email jeff@amazon.com for direct attention from Bezos or his Executive Team.",
      "content": "Email jeff@amazon.com for direct attention from Bezos or his Executive Team. Bezos widely advertises his own email address so customers can get in touch with him. Although he doesn’t respond to most of these emails personally, he claims to read most of the messages that come into his inbox. [1] X Research source According to many Amazon employees, Bezos will forward emails in need of follow up to the relevant manager with one character: “?” Amazon employees report that this “?” means “figure out what this is about and fix it.” If your message gets forwarded like this, you can expect a response within as little as two hours. [2] X Research source In your email to Bezos, insiders recommend being succinct and direct. Avoid rude language and try not to go too in-depth on the background of the situation. Instead, make sure to provide the vital, relevant details of your case. Briefly describe how previous Amazon employees have been unable to help. By making a strong case for why he should pay attention to you, you’re more likely to win Bezos’ attention and a “?” forward. [3] X Research source You can start the email message with a salutation and greetings . Then close with warm regards or best regards. If you send an attachment , see if it is correct before sending."
    },
    {
      "title": "Tweet @JeffBezos if you want to contact him on social media.",
      "content": "Tweet @JeffBezos if you want to contact him on social media. Although Bezos isn’t known for responding to customers via Twitter, you can try tweeting at Bezos directly or responding to one of his posts. In the past, he has solicited feedback and suggestions via Twitter so, if you’re hoping to pitch an idea, try following @JeffBezos to keep an eye out for opportunities. [4] X Research source To reach Bezos this way, you'll need your own account on Twitter. If you don't have one already, you can easily make a Twitter account on the website or mobile app."
    },
    {
      "title": "Send a letter to Bezos at Amazon's headquarters if you'd prefer to write.",
      "content": "Send a letter to Bezos at Amazon's headquarters if you'd prefer to write. While Bezos doesn't necessarily read his own mail, your message may be escalated to his attention by a member of his team if deemed necessary. As with an email, try to keep your letter as succinct and direct as possible. People are more likely to pay attention to your issue if they understand the problem and the potential solution quickly. [5] X Research source Mail your letters to: Jeff Bezos, Amazon Headquarters, 410 Terry Ave. N, Seattle, WA 98109."
    },
    {
      "title": "Use the instant messaging option for simple questions and concerns.",
      "content": "Use the instant messaging option for simple questions and concerns. Begin by navigating to https://www.amazon.com/gp/help/customer/contact-us/ . Click the “Start chatting” button to begin an online conversation with Amazon’s messaging assistant (a computer system). Once the messaging window opens, explain your problem by typing it into the text box or clicking one of the pre-filled options such as “An item I ordered” or “Issue with my account or Prime.” [6] X Research source When you’re done with the conversation, the messaging assistant will post any updates and next steps to the “Your Orders” or “Your Account” page of your Amazon account. Since you'll be chatting with an automated computer system rather than a real person, the instant messaging option is most helpful for simple problems, such as tracking a package or processing a return."
    },
    {
      "title": "Have Amazon customer service call you for more complicated issues.",
      "content": "Have Amazon customer service call you for more complicated issues. Start at https://www.amazon.com/gp/help/customer/contact-us/ . Click the “Call me” button to chat with a live Amazon customer service representative over the phone. You’ll have to answer a few questions about what you’d like to speak about and then enter your phone number. Depending on how busy the customer service center is, you may receive the call right away or have to wait for up to 15 minutes. [7] X Research source This method is better for more complex issues since it will connect you with a live representative."
    },
    {
      "title": "Call 1-888-280-4331 if you’d like to speak to a customer service representative directly.",
      "content": "Call 1-888-280-4331 if you’d like to speak to a customer service representative directly. This line is open 24 hours a day, 7 days a week. Once you dial, the automated system will ask to verify your account using a phone number, but you can also proceed without one. You will be asked to describe your issue so that you can be directed to the correct department. You may be put on hold for a few minutes before being connected with an employee. [8] X Research source Try using simple phrases to describe your problem, such as “I don’t have my package” or “problem with my order,” to get through the automated system more easily. You can also say “speak to a representative” several times to override the system."
    },
    {
      "title": "Email customer service",
      "content": "Email customer service to document your correspondence. If you need a record of your conversation with Amazon (for legal or other reasons), email might be a better method than phone. Primary@amazon.com is good for general inquiries, while cis@amazon.com is better for issues with your account, such as billing disputes. Note, however, that response time is often up to 48 hours or more. [9] X Research source"
    },
    {
      "title": "Contact Amazon via their social media sites for a more public forum.",
      "content": "Contact Amazon via their social media sites for a more public forum. If you prefer to communicate via social media, you can message Amazon on Twitter, Facebook, or Instagram. If you don’t hear back within a few days, try leaving a comment on one of their recent posts or tweets. While this may not be the most direct way to resolve your problem, it can help draw attention to your issue from different parts of the company. [10] X Research source Amazon’s Twitter account is @amazon. [11] X Research source Amazon’s Facebook page is https://www.facebook.com/Amazon . Amazon’s Instagram handle is @amazon. [12] X Research source"
    }
  ]
}