{
  "url": "https://www.wikihow.com/Bend-Sheet-Metal",
  "title": "How to Bend Sheet Metal",
  "steps": [
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. Having the right tools on hand will help this process go smoothly and quickly. To bend your sheet metal with a vise and hammer, you will need: 2 wooden or metal form blocks Block of hardwood and heavy-duty hammer or mallet (optional) Calculator or online bend calculator Marker Protractor Rubber, plastic, or rawhide mallet Ruler or tape measure Sheet metal Vise"
    },
    {
      "title": "Determine the thickness of your sheet.",
      "content": "Determine the thickness of your sheet. You can use a tape measure or ruler to measure the thickness of your sheet metal. This measurement will be necessary for calculating your bend allowance. If your sheet metal is too thick, you may need special machinery, like a brake or a torch, to bend your sheet into the desired shape."
    },
    {
      "title": "Calculate your bend allowance.",
      "content": "Calculate your bend allowance. The bending you will be doing will warp your sheet metal so that it is physically bigger. To calculate the expansion that will take place on the outside of your bend angle, you will need to know your bend allowance. You can find your bend allowance with the following formula: (π/180) x B x (IR + K x MT) = bend allowance (BA), where B is the angle complementary to your desired bend angle (1 to 180 degrees), MT is the thickness of the material, IR is the inside radius, and K is the K-factor. [1] X Research source [2] X Research source [3] X Research source To ascertain your K-Factor, inside radius, and material thickness (expressed as a decimal), you should use an Bend Allowance Chart . As an example, if you want to bend 24 gauge sheet metal at a 90° angle, the calculation would be: 0.017453 x 90 x (0.020 + 0.33 x 0.024) = 0.0438558984 inch bend allowance Keep in mind that some metals are more brittle than others. Bending a brittle metal beyond its limits could cause the metal to snap and break. [4] X Research source"
    },
    {
      "title": "Mark your bend lines.",
      "content": "Mark your bend lines. Now that you know your bend allowance, take your protractor and draw a clear line with your marker across the point at which you will bend your sheet metal. Then use your bend allowance to draw your second bend line, the intervening distance between your bend lines (bend radius). The space between your bend lines will expand with the application of your bend."
    },
    {
      "title": "Cut your sheet to size.",
      "content": "Cut your sheet to size. You should leave a little trim to your sheet, approximately ¼\" is recommended. Be sure you file and smooth your sheet, as nicks and rough edges can cause cracks to form in your metal. [5] X Research source"
    },
    {
      "title": "Place your forms in your vise.",
      "content": "Place your forms in your vise. Your forms will have an edge that should match the angle of your desired bend. Situate your forms in the vise with the form block guide angle facing upwards out of your vise. [6] X Research source One edge of your form will typically be rounded to the degree of your bend radius, thus helping you achieve your desired bend. [7] X Research source"
    },
    {
      "title": "Clamp your sheet metal in your vise.",
      "content": "Clamp your sheet metal in your vise. Now that your forms are placed, you should clamp your sheet between your form blocks very firmly. Take care to keep your bend line even with the guide angle of your forms."
    },
    {
      "title": "Support your excess sheet metal.",
      "content": "Support your excess sheet metal. If you have sheet metal hanging a considerable distance outside of your form blocks, you will need to support this segment so that it does not bounce too wildly and negatively impact your bend. [8] X Research source Consider having a friend or a colleague stabilize this piece with their hand. Be sure to wear gloves to prevent any accidental cuts."
    },
    {
      "title": "Bend the metal with your mallet.",
      "content": "Bend the metal with your mallet. To prevent damage or unsightly dents, it's best to use a rubber, plastic, or rawhide mallet to gently tap the metal. Do this until it bends toward the form block and achieves your desired angle gradually and evenly. [9] X Research source Your tapping should start at one end of the evolving bend. Slowly work back and forth between your bend lines until the sheet metal is bent to the desired angle."
    },
    {
      "title": "Verify the value for material thickness in your bend allowance calculation.",
      "content": "Verify the value for material thickness in your bend allowance calculation. This particular value is deceptively named. Contrary to first impression, this number must be expressed as decimal for your calculation to be correct, and is based off of standard gauge thickness. [10] X Research source"
    },
    {
      "title": "Double-check your bend angle.",
      "content": "Double-check your bend angle. If your bend allowance calculation seems off, a likely place you have made a mistake is with your bend angle. If you are attempting to bend at an angle less or greater than 90°, it is necessary that you take the complementary angle to that of your desired bend. For example: if your desire bend is 45°, you will subtract this number from 180°, which will give you a bend angle of 135°. [11] X Research source"
    },
    {
      "title": "Adjust your vise.",
      "content": "Adjust your vise. The pressure you will be applying to bend your sheet metal will be significant. If you do not have a vise up to the challenge, or if you have not secured your vise sufficiently, your forms may slip, or you may bend your sheet metal in a way you hadn't intended."
    },
    {
      "title": "Apply heat for difficult bends.",
      "content": "Apply heat for difficult bends. This should be done with extreme caution and care. In the event that you are bending a thick piece of sheet metal, you can apply heat from a blowtorch along the seam of your bend line to facilitate your bend. Keep in mind that many kinds of fabricated metal have extremely high melting points, and applying your torch injudiciously could cause damage or do harm to your sheet metal or equipment."
    }
  ]
}