{
  "url": "https://www.wikihow.com/Burn-Wii-Games-to-Disc",
  "title": "How to Burn Wii Games to Disc",
  "steps": [
    {
      "title": "Install the Homebrew Channel",
      "content": "Install the Homebrew Channel to rip and play games. Whether you plan on ripping games using your Wii or ripping them with your computer, your Wii will still need to be modded in order to play ripped games. You can install the Homebrew Channel using a special exploit called \"LetterBomb.\""
    },
    {
      "title": "Update your Wii to the latest available version.",
      "content": "Update your Wii to the latest available version. You'll need to be running the final version of the Wii software (4.3) that was released in September 2010. This is required in order for the exploit to work. Select the \"Wii\" button from the Wii main menu. Select \"Wii Settings.\" Select \"Wii System Update\" from the third page. Select \"Yes\" and then \"I Accept\" to begin downloading and installing the system update. Some games also have a Wii system update. Insert the disc, select the Disc Channel from the Wii menu and the Wii will prompt you to install the update. You can also update your Wii system after successfully connecting it to the internet."
    },
    {
      "title": "Get an SD card that is 2 GB or smaller.",
      "content": "Get an SD card that is 2 GB or smaller. You'll need an SD card that is 2 GB or smaller in order to successfully mod your Wii. The card should be a standard SD card, not SDHC or SDXC. Check the list at wiibrew.org/wiki/SD/SDHC_Card_Compatibility_Tests if you aren't sure if your card is compatible."
    },
    {
      "title": "Format your SD card",
      "content": "Format your SD card on your computer. Insert your SD card into your computer's card reader. If your computer doesn't have a card reader, you'll need a USB reader. Format the card in FAT32 format by doing the following: Windows - Open Windows Explorer ( ⊞ Win + E ). Right-click on your SD card and select \"Format.\" Choose \"FAT32\" from the \"File system\" menu and click \"Start\" and then \"OK.\" Mac - Open the Disk Utility from the Utilities folder. Select your SD card, then click the \"Erase\" button. Select \"MS-DOS (FAT)\" from the \"Format\" menu and click \"Erase\" two more times."
    },
    {
      "title": "Determine your Wii's MAC address.",
      "content": "Determine your Wii's MAC address. This is the address that is unique to your Wii. You can find out the MAC address from the Wii's Settings menu: Click the \"Wii\" button on your Wii's main menu. Select \"Wii Settings\" and then select \"Internet\" from the second page. Select \"Console Information\" and then write down the MAC address."
    },
    {
      "title": "Visit .",
      "content": "Visit . please.hackmii.com on your computer's browser. This is the website that will generate a LetterBomb exploit specifically for your Wii."
    },
    {
      "title": "Enter your Wii's MAC address into the fields.",
      "content": "Enter your Wii's MAC address into the fields. Each field will get two characters for the MAC address."
    },
    {
      "title": "Select your region in the \"System Menu Version\" section.",
      "content": "Select your region in the \"System Menu Version\" section. If you aren't sure, you can see which version you're running by opening the \"Wii Settings\" menu again and looking in the upper-right corner."
    },
    {
      "title": "Click \"I'm not a robot\" and then click one of the download buttons.",
      "content": "Click \"I'm not a robot\" and then click one of the download buttons. It doesn't matter if you \"Cut the red wire\" or \"Cut the blue wire,\" both will download the ZIP file."
    },
    {
      "title": "Double-click the downloaded ZIP file.",
      "content": "Double-click the downloaded ZIP file. This will display the contents. You should see a \"private\" folder and a \"boot.elf\" file."
    },
    {
      "title": "Copy the folder and file from the ZIP file to your SD card.",
      "content": "Copy the folder and file from the ZIP file to your SD card. Drag and drop the \"private\" folder and the \"boot.elf\" file directly into your SD card. This will place them in the correct locations on the card."
    },
    {
      "title": "Remove your SD card from your computer and insert it into your Wii.",
      "content": "Remove your SD card from your computer and insert it into your Wii. You'll find the SD card port on the front of the Wii, behind the panel that folds down."
    },
    {
      "title": "Click the Messages button on the Wii's main menu.",
      "content": "Click the Messages button on the Wii's main menu. You should see a red envelope with a bomb tucked in it. You may need to press the \"-\" button to go back a day or more to find it. Double-check that the \"private\" folder and the \"boot.elf\" file are in the root of the SD card if the LetterBomb does not appear."
    },
    {
      "title": "Select the red letter to launch the LetterBomb exploit.",
      "content": "Select the red letter to launch the LetterBomb exploit. You'll see a black screen with white text appear, much like the Command Prompt or PowerShell in Windows."
    },
    {
      "title": "Press \"1\" and then \"A\" on your Wii remote to continue when prompted.",
      "content": "Press \"1\" and then \"A\" on your Wii remote to continue when prompted. This will start the installation process. If your Wii remote turns off when the HackMii installation begins, your Wii remote might be too new. Newer Wii remotes will turn off when the hack is detected. You'll need to find a Wii remote made before 2009."
    },
    {
      "title": "Select \"BootMii\" and press \"A.\"",
      "content": "Select \"BootMii\" and press \"A.\" This will let you configure BootMii, which allows the Homebrew Channel to load. [1] X Research source"
    },
    {
      "title": "Select \"Prepare an SD card\" and then \"Yes, continue.\"",
      "content": "Select \"Prepare an SD card\" and then \"Yes, continue.\" This will add files to your SD card for the BootMii software."
    },
    {
      "title": "Select \"Install BootMii as IOS.\"",
      "content": "Select \"Install BootMii as IOS.\" Select \"Yes, continue\" twice to confirm. This will install the BootMii software."
    },
    {
      "title": "Return to the main menu and select \"Install The Homebrew Channel.\"",
      "content": "Return to the main menu and select \"Install The Homebrew Channel.\" Select \"Yes, continue\" to confirm, then select \"Continue\" when it finishes."
    },
    {
      "title": "Select \"Exit\" after installation to load the Homebrew Channel.",
      "content": "Select \"Exit\" after installation to load the Homebrew Channel. If the Homebrew Channel loads after a few moments, you've successfully modded your Wii. Next up you'll be installing the software necessary to rip games and play backups from an external hard drive or flash drive or from a burned disc. [2] X Research source"
    },
    {
      "title": "Format an external hard drive or flash drive on your computer.",
      "content": "Format an external hard drive or flash drive on your computer. Plug an external hard drive or flash drive into one of your computer's USB ports. As with the SD card, format it as FAT32, which will allow you to save Wii games and GameCube games. The games you rip or download will be stored on the drive. Windows - For drives that are 32 GB or smaller, open Windows Explorer ( ⊞ Win + E ). Right-click on your drive and select \"Format.\" Choose \"FAT32\" from the \"File system\" menu, and click \"Start\" and then \"OK.\" If your drive is between 64 GB and 2 TB, download FAT32 Format from ridgecrop.demon.co.uk/index.htm?guiformat.htm . Run the utility, select your drive, and click \"Start\" and then \"OK.\" Mac - Open the Disk Utility from the Utilities folder. Select your drive, then click the \"Erase\" button. Select \"MS-DOS (FAT)\" from the \"Format\" menu and click \"Erase\" two more times."
    },
    {
      "title": "Download the IOS236 v6 installer.",
      "content": "Download the IOS236 v6 installer. This is a homebrew application that will install the necessary system software to install other homebrew system software (IOS files). You can find the installer in various locations online. Perform a Google search for \"ios236 v6 installer.\" The installer will download as a ZIP file."
    },
    {
      "title": "Download the d2x cIOS installer.",
      "content": "Download the d2x cIOS installer. This program installs system software that changes the way your Wii access storage, allowing you to use USB Loader programs. Download the latest available version from code.google.com/archive/p/d2x-cios-installer/downloads"
    },
    {
      "title": "Download the Configurable (CFG) USB Loader.",
      "content": "Download the Configurable (CFG) USB Loader. This is the homebrew program that manages your game backups and allows you to rip games from discs. You can use it to rip Wii games and GameCube games. Download the Cfg_USB_Loader_70.zip file from code.google.com/archive/p/cfg-loader/downloads ."
    },
    {
      "title": "Extract the CFG files onto your SD card.",
      "content": "Extract the CFG files onto your SD card. Extract these files to your card first to create the folder structure that the other two ZIP files will use. Insert the SD card from your Wii into your computer. Double-click the Cfg_USB_Loader_70.zip and navigate to the \"inSDroot\" folder. You'll see two folders: \"apps\" and \"usb-loader.\" Drag both of these folders into the root of your SD card."
    },
    {
      "title": "Extract the IOS236 v6 and d2x cIOS installers into the new \"apps\" folder.",
      "content": "Extract the IOS236 v6 and d2x cIOS installers into the new \"apps\" folder. Once you've copied your CFG Loader files, you can double-click each of the other ZIP files you downloaded and drag the folders inside to the new \"apps\" folder on the SD card."
    },
    {
      "title": "Download the replacement XML file for CFG Loader.",
      "content": "Download the replacement XML file for CFG Loader. Visit gwht.wdfiles.com/local--files/usb-loader/meta.xml in your browser. Press Ctrl + S (Windows) or ⌘ Command + S (Mac) and save the file as \"meta.xml.\""
    },
    {
      "title": "Replace the meta.xml file in your SD card's apps\\USBLoader directory.",
      "content": "Replace the meta.xml file in your SD card's apps\\USBLoader directory. Open this directory on your SD card and drag your new meta.xml file into it. Confirm that you want to Overwrite or Replace the existing file."
    },
    {
      "title": "Open the \"sample_config.txt\" file.",
      "content": "Open the \"sample_config.txt\" file. This will open the file in your browser."
    },
    {
      "title": "Add the following two lines to the bottom of the file.",
      "content": "Add the following two lines to the bottom of the file. Enter these two options, each on a new line at the bottom: ntfs_write = 1 fat_split_size = 0"
    },
    {
      "title": "Click the File menu, select \"Save As,\" and rename the file to \"config.txt.\"",
      "content": "Click the File menu, select \"Save As,\" and rename the file to \"config.txt.\" This will activate the configuration file and ensure that CFG Loader uses your new settings."
    },
    {
      "title": "Insert the SD card back into your Wii and open the Homebrew Channel.",
      "content": "Insert the SD card back into your Wii and open the Homebrew Channel. This will read your SD card and show the installers in the Homebrew Channel. Make sure any GameCube memory cards you may have inserted have been removed. Make sure your Wii is connected to the internet so that it will be able to download the necessary files."
    },
    {
      "title": "Select the \"IOS236 Installer v6\" option and click \"Load.\"",
      "content": "Select the \"IOS236 Installer v6\" option and click \"Load.\" This will start the installer and a bunch of white text will appear on the screen, much like the Command Prompt or PowerShell in Windows."
    },
    {
      "title": "Press \"1\" on the Wii remote to begin the installation.",
      "content": "Press \"1\" on the Wii remote to begin the installation. IOS236 will begin installing."
    },
    {
      "title": "Select \"<Download IOS from NUS>\" when prompted.",
      "content": "Select \"<Download IOS from NUS>\" when prompted. This will download the essential files."
    },
    {
      "title": "Press \"A\" when prompted to begin installation.",
      "content": "Press \"A\" when prompted to begin installation. Files will begin installing, which should just take a few moments."
    },
    {
      "title": "Press \"2\" to finish the installation.",
      "content": "Press \"2\" to finish the installation. Regardless of what you're planning on using the custom firmware for, do not press \"1.\" [3] X Research source"
    },
    {
      "title": "Return to the Homebrew Channel and select \"D2X cIOS Installer.\"",
      "content": "Return to the Homebrew Channel and select \"D2X cIOS Installer.\" Press \"Load\" to start it up. Press any button on the disclaimer screen to continue."
    },
    {
      "title": "Set your installer menus.",
      "content": "Set your installer menus. Use the text menus at the top of the screen to set your installation preferences: Select \"<d2x v6>\" from the \"Select cIOS\" menu. Select \"<56>\" from the \"Select cIOS base\" menu. Select \"<248>\" from the \"Select cIOS slot\" menu. Select \"<21006>\" from the \"Select cIOS revision\" menu."
    },
    {
      "title": "Press \"A\" to begin the installation, then highlight Slot 248 and press \"A\" again.",
      "content": "Press \"A\" to begin the installation, then highlight Slot 248 and press \"A\" again. This will install d2x using the settings you entered. The installation may take a little while to complete."
    },
    {
      "title": "Load \"D2X cIOS Installer\" from the Homebrew Channel again.",
      "content": "Load \"D2X cIOS Installer\" from the Homebrew Channel again. You'll need to install it again with slightly different settings. If you are still in the installer after some settings have been entered, press \"A\" to move on to the next step of the installation."
    },
    {
      "title": "Set your installer menus again.",
      "content": "Set your installer menus again. Enter the following, slightly different installer settings: Select \"<d2x v6>\" from the \"Select cIOS\" menu. Select \"<57>\" from the \"Select cIOS base\" menu. Select \"<247>\" from the \"Select cIOS slot\" menu. Select \"<21006>\" from the \"Select cIOS revision\" menu."
    },
    {
      "title": "Press \"A\" to begin the installation, then highlight Slot 247 and press \"A\" again.",
      "content": "Press \"A\" to begin the installation, then highlight Slot 247 and press \"A\" again. This will install d2x again in Slot 247. You'll need it installed in both slots before you can use CFG Loader. [4] X Research source"
    },
    {
      "title": "Plug your formatted external hard drive or flash drive into your Wii.",
      "content": "Plug your formatted external hard drive or flash drive into your Wii. Plug this in before you launch CFG Loader for the first time. Use the bottom USB port on the back of the Wii. If you're prompted by your Wii to format the drive, select \"Cancel.\" If you click \"Format,\" you'll need to go back to your computer and format it as FAT32 again."
    },
    {
      "title": "Open the Homebrew Channel and select \"Configurable USB Loader.\"",
      "content": "Open the Homebrew Channel and select \"Configurable USB Loader.\" Select \"Load\" to start the program."
    },
    {
      "title": "Select \"USB\" when prompted.",
      "content": "Select \"USB\" when prompted. This will set CFG to load backups from your external hard drive or flash drive. When prompted to select your partition, you should only have one available. Select it to continue."
    },
    {
      "title": "Ensure IOS 248 is selected and start the program.",
      "content": "Ensure IOS 248 is selected and start the program. This will launch CFG Loader with your settings."
    },
    {
      "title": "Save your settings.",
      "content": "Save your settings. You'll want to save your device and IOS settings so you're not prompted for them each time you start: [5] X Research source Point at the bottom of the screen to open the menu. Select \"Settings\" and then \"System.\" Select \"Save Settings.\""
    },
    {
      "title": "Insert a game that you want to copy into your Wii.",
      "content": "Insert a game that you want to copy into your Wii. You can copy any Wii game or GameCube game by using CFG Loader. Insert the disc and it will appear in the CFG Loader program."
    },
    {
      "title": "Open Configurable USB Loader if it isn't already.",
      "content": "Open Configurable USB Loader if it isn't already. You'll be using this homebrew program to rip the games from your Wii and GameCube discs to your external hard drive or flash drive."
    },
    {
      "title": "Press \"+\" in the CFG main menu.",
      "content": "Press \"+\" in the CFG main menu. This will open the installation screen for the game that is inserted."
    },
    {
      "title": "Click \"Install.\"",
      "content": "Click \"Install.\" This will begin copying the game files from your disc to your external hard drive or flash drive. This may take a while to complete, especially for newer, larger games."
    },
    {
      "title": "Select an installed game in CFG Loader.",
      "content": "Select an installed game in CFG Loader. Once you have some games installed, they'll appear in the main window of CFG Loader. Select one to view details and launch it."
    },
    {
      "title": "Press \"A\" to launch the game.",
      "content": "Press \"A\" to launch the game. With the game selected, press \"A\" to start playing. You'll see some text as the game loads, and then it will start."
    },
    {
      "title": "Continue installing games.",
      "content": "Continue installing games. You can keep installing games from any disc, legitimate or burned. All of the games will be added to your external hard drive or flash drive, and you won't need the discs to play them."
    },
    {
      "title": "Consider using the USB Loader instead of burning your games.",
      "content": "Consider using the USB Loader instead of burning your games. Besides the convenience that a USB Loader program and an external hard drive or flash drive provide, newer Wii models cannot read DVD+Rs. This means that a burned disc is useless on Wiis that were made in 2008 or later. If you download games, you can copy them to the external hard drive or flash drive that the USB Loader uses and they will appear in your USB Loader program library. You don't need to burn them, just to rip them with your Wii."
    },
    {
      "title": "Obtain some Wii game image files.",
      "content": "Obtain some Wii game image files. If you do want to burn games to disc instead of using your USB Loader, you'll need the game image files. There are a couple of ways you can obtain these: Wii and GameCube ISO files can be created by placing a legitimate disc into your disc burner and using a disc ripping utility such as InfraRecorder or a paid one like MagicISO. This is a safe way to rip games with your computer. If you followed the above methods, you can use games that you've installed to your external hard drive or flash drive with your USB Loader program. Plug the external hard drive or flash drive into your computer and open the \"games\" directory. Games will be named by their GAMEID, so perform a quick Google search if you're not sure which is which. Drag the file you want to your computer. It may take a while to copy."
    },
    {
      "title": "Convert image files copied from your external hard drive or flash drive",
      "content": "Convert image files copied from your external hard drive or flash drive . If you ripped games using your Wii and copied the files to your computer, you'll likely notice that the files are in WBFS format. This will need to be converted to ISO before you can burn it: Visit . wbfstoiso.com and download the free program. Run the installer after downloading it and follow the prompts. No adware will be installed. Open WBFS to ISO and select your WBFS file. You can click the \"Open\" button to browse for it. Click \"Convert\" to begin converting the file. This may take a while to complete. You'll find the ISO file in the same location as your WBFS file."
    },
    {
      "title": "Visit .",
      "content": "Visit . imgburn.com and download ImgBurn. This disc burning utility will allow you to burn the ISO file to a blank DVD+R. Download the latest version from the ImgBurn website."
    },
    {
      "title": "Start the ImgBurn installation process.",
      "content": "Start the ImgBurn installation process. Double-click the installer to begin the installation."
    },
    {
      "title": "Uncheck the Ask Toolbar ads while installing.",
      "content": "Uncheck the Ask Toolbar ads while installing. After you select the location to install ImgBurn, you'll see a screen for the Ask Toolbar. Make sure to uncheck all of the boxes before proceeding."
    },
    {
      "title": "Launch ImgBurn after installing.",
      "content": "Launch ImgBurn after installing. Once the installation is finished, launch ImgBurn from the shortcut on your desktop."
    },
    {
      "title": "Select \"Write image file to disc\" from the ImgBurn menu.",
      "content": "Select \"Write image file to disc\" from the ImgBurn menu. This will open the disc writer tool."
    },
    {
      "title": "Insert a blank DVD+R into your disc burner.",
      "content": "Insert a blank DVD+R into your disc burner. You'll need to have a disc burner installed for ImgBurn to work. Be aware that if your Wii is newer than 2008, the burned discs will not work."
    },
    {
      "title": "Select your Wii ISO file as the Source.",
      "content": "Select your Wii ISO file as the Source. Click the Browse button to navigate to it, or drag it into the window."
    },
    {
      "title": "Select a low write speed.",
      "content": "Select a low write speed. To help ensure that the burn process works, select a slow writing speed such as 1X. This will result in a longer burn but will increase your chances of the disc working."
    },
    {
      "title": "Click the Burn button in the lower-left corner.",
      "content": "Click the Burn button in the lower-left corner. This will begin writing the file to your disc."
    },
    {
      "title": "Wait for the burn to complete.",
      "content": "Wait for the burn to complete. This may take a while, especially for larger games. The disc will eject when it is finished."
    },
    {
      "title": "Insert the burned disc with your game image file into your Wii.",
      "content": "Insert the burned disc with your game image file into your Wii. Once the disc is finished burning, you can insert it in your Wii's disc drive, and run it with your USB Loader program. This will allow you to play it without having to install any additional hacks. See the previous section for details."
    }
  ]
}