{
  "url": "https://www.wikihow.com/Care-for-a-Sick-Child",
  "title": "How to Care for a Sick Child",
  "steps": [
    {
      "title": "Provide emotional support.",
      "content": "Provide emotional support. Being sick is uncomfortable and your child may be worried or upset because of how he or she feels. Giving your child some extra attention and care may help. For example, you can: Sit with your child. Read your child a book. Sing to your child. Hold your child’s hand. Hold your baby in your arms."
    },
    {
      "title": "Elevate your child or baby’s head.",
      "content": "Elevate your child or baby’s head. A cough can get worse if your child is lying flat on his or her back. To keep your child’s head elevated, try putting a book or towel under the mattress of your baby’s crib or under the legs at the head of the crib or bed. You can also give your child an extra pillow or use a wedge pillow to help your child stay upright."
    },
    {
      "title": "Turn on a humidifier.",
      "content": "Turn on a humidifier. Dry air can make a cough or sore throat feel worse. Try using a humidifier or cool-mist vaporizer to keep the air in your child’s room moist. This can help to reduce coughing, congestion, and discomfort. Make sure to change the water in your humidifier frequently. Wash the humidifier according to the manufacturer's instructions to prevent mold from growing in it."
    },
    {
      "title": "Provide a quiet environment.",
      "content": "Provide a quiet environment. Keep your home as quiet and peaceful as possible to make it easier for your child to rest. Stimulation from television or computers prevents sleep and your child needs as much rest as possible, so you may consider removing devices from your child’s bedroom or at least limiting your child’s use of devices."
    },
    {
      "title": "Keep your home at a comfortable temperature.",
      "content": "Keep your home at a comfortable temperature. Your child may feel hot or cold depending on the illness, so adjusting the temperature in your home may help your child to feel more comfortable. It may be helpful to keep your home between 65 and 70 degrees, but you can also adjust this temperature if your child is too hot or too cold. [1] X Research source For example, if your child is complaining that he or she is too cold, then turn up the heat a bit. If your child complains that he or she is hot, then turn on an air conditioner or fan."
    },
    {
      "title": "Give your child plenty of clear liquids.",
      "content": "Give your child plenty of clear liquids. Dehydration can make matters worse when your child is sick. Prevent dehydration in your child by making sure your child drinks fluids frequently. Offer your child: [2] X Research source Water Ice pops Ginger ale Diluted fruit juice Electrolyte-enhanced beverages"
    },
    {
      "title": "Provide foods that are easy to digest.",
      "content": "Provide foods that are easy to digest. Give your child nutritious foods that won’t upset their stomach. Choice of food might depend on your child’s symptoms. Good options include: [3] X Trustworthy Source EatRight.org Organization associated with the Academy of Nutrition and Dietetics providing advice about food, health, and fitness Go to source Salty crackers Bananas Applesauce Toast [4] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Cooked cereals Mashed potatoes"
    },
    {
      "title": "Give your child chicken soup.",
      "content": "Give your child chicken soup. Although it will not cure your child, warm chicken soup helps relieve cold and flu symptoms by making mucus thinner and acting as an anti-inflammatory. There are a number of recipes for making your own chicken soup, although many commercial varieties work well, too. [5] X Trustworthy Source EatRight.org Organization associated with the Academy of Nutrition and Dietetics providing advice about food, health, and fitness Go to source"
    },
    {
      "title": "Give your child plenty of rest.",
      "content": "Give your child plenty of rest. Encourage your child to sleep as often as he or she likes. Read your child a story or have your child listen to an audio book to make it easier to fall asleep. Your child needs as much rest as they can get. [6] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Use over-the-counter medications with caution.",
      "content": "Use over-the-counter medications with caution. If you decide to give medicine, try to stick to one product, such as acetaminophen or ibuprofen, rather than alternating medications or giving combinations of medications. Ask your doctor or pharmacist about which medicines might be appropriate for your child. Do not give ibuprofen to a child under 6 months old. [7] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Do not give cough and cold medicines to a child under 4 years old, and preferably not until at least 8 years old. These medicines have the potential to cause life-threatening side effects and have not been shown to be very effective either. [8] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Do not give infants, children, or teenagers acetylsalicylic acid (aspirin) because this can cause a rare but serious illness called Reye’s syndrome. [9] X Research source"
    },
    {
      "title": "Encourage your child to gargle with warm salt water.",
      "content": "Encourage your child to gargle with warm salt water. Add ¼ teaspoon of regular table salt into 8 ounces of lukewarm water. Have your child gargle and spit out the salty water when finished. Gargling with salt water can help relieve throat pain. [10] X Research source For younger children or for nasal congestion, you can also use salt water (saline) nasal drops or sprays. You can make a saline spray yourself or buy some at the pharmacy. For infants, you can use a bulb syringe to suction the nose after using the drops. [11] X Research source"
    },
    {
      "title": "Keep your home free of irritants.",
      "content": "Keep your home free of irritants. Avoid smoking around your child and avoid wearing especially strong perfumes. Postpone activities like painting or cleaning. The fumes can irritate your child’s throat and lungs and make their illness worse. [12] X Research source"
    },
    {
      "title": "Air out your child’s room.",
      "content": "Air out your child’s room. Periodically open the windows in your child’s room to keep the air fresh. Do this when the child is in the bathroom so they don’t get cold. [13] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Give your child extra blankets as necessary."
    },
    {
      "title": "Determine whether your child has the flu.",
      "content": "Determine whether your child has the flu. Take symptoms of an infection with the influenza virus seriously. It is a potentially dangerous illness that often develops suddenly. Contact your child's doctor if you think your child may have the flu, especially if your child is under age 2 or has medical problems such as asthma. Symptoms of the flu include: [14] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source High fever and/or chills Cough Sore throat Runny nose Body or muscle aches Headache Tiredness and/or weakness Diarrhea and/or vomiting"
    },
    {
      "title": "Take your child’s temperature.",
      "content": "Take your child’s temperature. Check to see if your child has chills, a flushed appearance, is sweating, or feels very warm to the touch if you do not have a thermometer."
    },
    {
      "title": "Ask your child if he or she has any pain.",
      "content": "Ask your child if he or she has any pain. Ask your child how much pain he or she is in and where the pain is located. You may also want to apply gentle pressure to the spot your child is complaining about to get an idea of how severe it is."
    },
    {
      "title": "Watch for signs of serious illness.",
      "content": "Watch for signs of serious illness. Pay careful attention to signs that indicate your child needs to be seen by a medical professional immediately. These include: [15] X Research source Fever in a child under three months old Severe headache or a stiff neck Changes in breathing patterns, especially any trouble breathing Changes in skin color, such as looking very pale, reddish, or bluish Child refuses to drink fluids or stops urinating No tears when crying Severe or persistent vomiting Child is difficult to wake up or is unresponsive Child is unusually quiet and inactive Signs of extreme irritability or pain Pain or pressure in the chest or stomach Sudden or prolonged dizziness Confusion Flu-like symptoms improve but then get worse"
    },
    {
      "title": "Visit your local pharmacist.",
      "content": "Visit your local pharmacist. Talk to your local pharmacist if you are not sure whether your child needs to be seen by a doctor. She or he can help determine if your child’s symptoms require medical attention and can offer advice on medications if they are needed. [16] X Research source You can also call your doctor's office, as there is almost always someone available to help you decide what to do and to provide home care advice."
    }
  ]
}