{
  "url": "https://www.wikihow.com/Beat-Toriel-in-Undertale",
  "title": "How to Beat Toriel in Undertale",
  "steps": [
    {
      "title": "Start by pressing the \"Act\" button when Toriel blocks the way.",
      "content": "Start by pressing the \"Act\" button when Toriel blocks the way. Once you press the \"Act\" button, select \"Talk\", or whatever you have to use. If you have played the game before, and started by killing Toriel, you will need to select \"Act\", then \"Talk.\" If you have played the game before 11 times, she will not hurt you at all, sending out a completely harmless attack. If you've played 12, and spared her all 12 times, she will not attack at all. You do not have to heal yourself, because the fight with Toriel does not kill you. You will get to one or 2 HP, and an attack where fire balls drop from the top of the box will start, and you cannot hit them even if you try to. Save the Butterscotch Pie for the fight with Asgore (It helps a lot, put it in a box and don't use it.)"
    },
    {
      "title": "Select the \"Mercy\" button, then select \"Spare\".",
      "content": "Select the \"Mercy\" button, then select \"Spare\"."
    },
    {
      "title": "Keep repeating this process until she gives up.",
      "content": "Keep repeating this process until she gives up. You will need to do this 24 times. It seems like a lot, but you will not die in this battle. She will have dialogue inbetween them, give up, hug you, and run away after a piece of short dialogue."
    },
    {
      "title": "Proceed through the door.",
      "content": "Proceed through the door. You have spared Toriel, and you are now in 'Snowdin' Forest! These images are from \"Hard Mode\" in Undertale. If you name the character \"Frisk\" at the onset of the game, you will enter Hard Mode, where the characters and enemies are much harder. You will encounter entirely different characters, but the route ends after the Battle with Toriel."
    },
    {
      "title": "Select \"Fight\" once in battle.",
      "content": "Select \"Fight\" once in battle. When the white bar swings across the screen after you press \"Fight\", press Z or (enter depending on your computer) when it's in the center on the screen."
    },
    {
      "title": "Keep doing this until Toriel looks different.",
      "content": "Keep doing this until Toriel looks different. She will say a few things and turn into dust."
    },
    {
      "title": "Go through the door into Snowdin Forest.",
      "content": "Go through the door into Snowdin Forest."
    }
  ]
}