{
  "url": "https://www.wikihow.com/Clean-a-Concrete-Patio",
  "title": "How to Clean a Concrete Patio",
  "steps": [
    {
      "title": "Remove all furniture and other objects.",
      "content": "Remove all furniture and other objects. Before getting started, you’ll want to make sure your patio is completely clear. Find a place away from your work area to stash patio furniture, dining sets, planters, grills, toys and anything else that may be damaged by free-flowing water or cleaning solutions. Your work area should ideally be as empty as you can get it. [1] X Research source Bring lightweight furniture inside, and move heavier pieces to the yard, sidewalk or a covered porch. Prolonged exposure to moisture can cause metal furniture and appliances to rust. [2] X Research source"
    },
    {
      "title": "Sweep away excess dirt.",
      "content": "Sweep away excess dirt. Use a broom to dislodge as much loose debris from the patio as you can. This will make it easier to reach the more stubborn stains underneath, as well as give you an idea how extensive the cleaning methods you employ will need to be. [3] X Research source Substances like compact dirt, dried mulch or sidewalk chalk may need to be scrubbed by hand using an abrasive sponge."
    },
    {
      "title": "Spray the patio with a garden hose.",
      "content": "Spray the patio with a garden hose. Once you’ve swept the concrete, hose it down with a heavy stream of water. Push the dirt off to an adjoining section of the yard to drain. The concrete will then need time to dry before you can move on to other, more involved methods. [4] X Research source If it’s been awhile since you last cleaned your patio, add some mild liquid dish detergent to a bucket of warm water to make a soapy rinse. The surfactants in the soap will help break up dirt and oil more effectively. [5] X Research source In some cases, a good hosing may be all you need to remove a thin layer of dirt and sediment."
    },
    {
      "title": "Combine distilled white vinegar with warm water.",
      "content": "Combine distilled white vinegar with warm water. Pour the vinegar and water into a large bucket in equal quantities and stir them together. Vinegar is naturally acidic, and can help lift and dissolve stains from within the shallow pores of the concrete better than water alone. Use a ratio of two parts vinegar to one part water if your patio has been affected by moss or mildew growth. [6] X Research source If you don’t happen to have vinegar on hand, the same concentration of hydrogen peroxide should also do the trick. [7] X Research source For slightly heavier or more persistent grime, add half a cup of baking soda to the vinegar solution."
    },
    {
      "title": "Douse the dirty concrete with the vinegar solution.",
      "content": "Douse the dirty concrete with the vinegar solution. Slosh the contents of the bucket directly over the surface of the patio. Making sure to cover as much area as you can so that the vinegar will be able to clean the concrete evenly. [8] X Research source Apply the solution liberally. Vinegar isn’t damage concrete, so you won’t have to worry about accidentally using too much. It may be necessary to mix up more solution if you’re cleaning a particularly large area."
    },
    {
      "title": "Allow the vinegar to sit for several hours.",
      "content": "Allow the vinegar to sit for several hours. While vinegar makes an effective natural cleaner, it is relatively mild, which means it will take time to work. The solution will gradually seep down into the concrete, breaking up trapped and solidified dirt. [9] X Research source Plan your cleaning project for a day with good weather to reduce the chances that unexpected rainfall will wash away the vinegar. Make better use of your time by tackling other household cleaning and maintenance tasks while the concrete is soaking."
    },
    {
      "title": "Scrub the patio clean.",
      "content": "Scrub the patio clean. After a few hours have passed, you’ll most likely notice that the vinegar has whisked away the worst of the mess. If any traces of dirt or discoloration remain, work them out by hand using a stiff-bristled push broom. Afterwards, hose off the patio once again and let it dry completely before replacing your belongings. You can also use an abrasive sponge to scour your patio with a little extra elbow grease. Avoid using wire scrubbers on concrete, as these can scratch or mark up smooth surfaces. [10] X Research source"
    },
    {
      "title": "Equip a high-powered pressure washer.",
      "content": "Equip a high-powered pressure washer. The majority of common concrete stains can be coaxed out with enough force. For more noticeable stains like rust, mold and compacted dirt, a pressure washer may be just the thing you need. [11] X Research source Pressure washers unleash a concentrated stream of water, chiseling difficult messes from smooth, hard surfaces. You can typically rent pressure washers from home improvement stores and gardening centers for just a few dollars a day. [12] X Research source"
    },
    {
      "title": "Spray off the surface of the patio.",
      "content": "Spray off the surface of the patio. Aim the nozzle of the pressure washer downward and away from your body. Use slow vertical sweeping motions to push the dislodge dirt off of the patio [13] X Research source Concrete is not easily damaged, so don’t be reluctant to use the pressure washer on a higher setting. [14] X Research source Make sure the surrounding area is set up for proper drainage. Otherwise, you could be left with standing water to deal with."
    },
    {
      "title": "Wait for the concrete to dry.",
      "content": "Wait for the concrete to dry. Keep the patio clear until all remaining water has been drained and evaporated. It may be possible to speed the process along by wiping off excess water with a squeegee or dabbing it with a clean, dry towel. Once it’s dry, you can put all furniture and other items back into place. Concrete patios need to be pressure washed an average of once or twice a year to keep them free from buildup that may eventually cause structural damage. Covering damp concrete with furniture can keep it from drying as quickly, and may provide a moist, shady place for mold to begin growing."
    },
    {
      "title": "Mix together chlorine bleach and warm water.",
      "content": "Mix together chlorine bleach and warm water. Pour both liquids into a deep bucket or similar container, being careful not to let them spill or splash. Aim for approximately one quarter of bleach for every three quarts of water you use. Stir the bleach solution using a wooden dowel. [15] X Research source Chlorine bleach is a caustic chemical that can be extremely harmful if ingested, inhaled or contacted with bare skin. Whenever possible, wear gloves, eye protection and a ventilator or breathing mask when working with bleach. Never combine bleach with hot water—the steam emitted from the water can carry bleach fumes with it, creating a potential breathing hazard. Heat may also partially neutralize the effects of bleach. [16] X Research source"
    },
    {
      "title": "Brush the bleach over the stained concrete.",
      "content": "Brush the bleach over the stained concrete. Apply the bleach solution using a long-handled brush or roller. As an alternative, you could place the chlorine mixture in a sprayer to avoid making a mess and exposing your extremities to harsh chemicals. Pay special attention to spotted mildew growth and areas with especially heavy discoloration. Test a sample of diluted bleach on an out-of-the way area of the concrete to make sure it won’t leech the color out of a treated surface. Be sure to work in a well-ventilated space. If your patio is partially covered, leave the doors and windows open and plan on spending no longer than about ten minutes at a time inside the enclosure."
    },
    {
      "title": "Leave the bleach to sit for 15 minutes.",
      "content": "Leave the bleach to sit for 15 minutes. The stain-fighting power of the bleach should take effect very quickly. [17] X Research source To be on the safe side, it’s a good idea to go somewhere else while the bleach is soaking into the concrete. If even bleach isn’t enough to do away with trouble stains like hard water or rust, try using a sprinkle of trisodium phosphate."
    },
    {
      "title": "Pressure wash the patio.",
      "content": "Pressure wash the patio. Finish by spraying the patio with a pressure washer to blast away any visible dirt or residue dissolved by the bleach. When you’re finished, your concrete should look as good as it did when it was first poured! Give the patio ample time to dry, then have a few friends over to enjoy your clean, inviting outdoor space. A quick pressure washing or hosing will also help clear the air of irritating bleach fumes."
    }
  ]
}