{
  "url": "https://www.wikihow.com/Adjust-Hunter-Sprinklers",
  "title": "How to Quickly Adjust a Hunter Sprinkler Rotor Head",
  "steps": [
    {
      "title": "Insert the hex end of your Hunter key into the radius reduction screw.",
      "content": "Insert the hex end of your Hunter key into the radius reduction screw. The hex end is the slim, metal bar that sticks out on one side of your Hunter wrench key . The radius reduction screw is a small hole at the center of the arrow with a tiny “x” in the middle. You'll find it on your sprinkler cap. [2] X Research source If you’ve lost your Hunter wrench key, no worries! You can use a normal 3/32 Allen key to make this adjustment. [3] X Research source You can make this adjustment with the water on or off."
    },
    {
      "title": "Rotate the hex bar clockwise to decrease the radius.",
      "content": "Rotate the hex bar clockwise to decrease the radius. Turn it slowly and stop when you’re happy with the radius or when you feel resistance. [4] X Research source Your hex bar will stop turning when you’ve reduced the radius by 25%. You can’t reduce the radius more than this. Try to avoid turning the adjustment screw clockwise more than 5 times. This may result in a lost radius adjustment screw. [5] X Research source"
    },
    {
      "title": "Turn the hex bar counterclockwise to increase the radius.",
      "content": "Turn the hex bar counterclockwise to increase the radius. If your radius gets too small, simply turn the hex bar back the other way. [6] X Research source The radius will expand again up to the full preset radius. You may need to adjust the radius back and forth to get your desired sprinkler coverage. If you can’t get the radius you want, switch out your nozzle to a bigger nozzle for a wider radius or a smaller nozzle for a smaller radius. [7] X Research source You can find instructions on how to do this in the Precipitation Rate section below."
    },
    {
      "title": "Find the arrow on top of the sprinkler cap to locate the nozzle.",
      "content": "Find the arrow on top of the sprinkler cap to locate the nozzle. Look for a raised, rubber circle with the outline of an arrow on it. Follow the arrow to find where the water sprays out of the sprinkler nozzle. [9] X Research source You can adjust your sprinkler with the water on or off."
    },
    {
      "title": "Check the current arc by spinning the head to the left and right.",
      "content": "Check the current arc by spinning the head to the left and right. Use your hand to gently twist the sprinkler head as far to the left as it will go. Note where the arrow is pointing—this is the left stop of your arc. Spin the head toward the right as far as it will go and check where the arrow is pointing—this is the right stop. [10] X Research source This step can tell you how far you need to adjust the sprinkler arc so it will spray the areas of your lawn that need water."
    },
    {
      "title": "Insert the plastic end of the Hunter key into the lifting socket.",
      "content": "Insert the plastic end of the Hunter key into the lifting socket. The lifting socket looks like a circle with a line or rectangle running through the center of it. Push the plastic end of your Hunter wrench into this hole. [11] X Research source"
    },
    {
      "title": "Twist the key and pull up on the socket to remove the sprinkler head.",
      "content": "Twist the key and pull up on the socket to remove the sprinkler head. The entire sprinkler head will pop out of the base so you can adjust the inner assembly. Now, you can check your arc distance and change it if necessary. [12] X Research source Remove the Hunter wrench while the sprinkler head is pulled up to make adjustments to the left. You can adjust the sprayer toward the right without the key."
    },
    {
      "title": "Twist the sprinkler head to line up the arrow with your right stop.",
      "content": "Twist the sprinkler head to line up the arrow with your right stop. Use your hand to gently tighten the sprinkler head. Keep going until the arrow is pointing where you want the sprinkler to stop spraying on the right side of its arc. [13] X Research source If your base won’t tighten anymore, grab the entire sprinkler cap and turn it clockwise to loosen it. Lift the inner assembly out of the sprinkler base. [14] X Research source Spin the cap all the way to the right, then put it back in the base with the arrow pointing where you’d like your right stop to be. Twist the cap clockwise to tighten it into the base."
    },
    {
      "title": "Insert your Hunter wrench key into the plus/minus slot on the cap.",
      "content": "Insert your Hunter wrench key into the plus/minus slot on the cap. The plus/minus arc adjustment slot has a big “X” in the center and a “+” and “-” on the outside. Push the key end of your Hunter wrench into this hole to make adjustments to the left stop. [15] X Research source You may be able to make plus/minus adjustments by inserting a 1 ⁄ 4 inch (0.64 cm) screwdriver or hex wrench into the slot. [16] X Research source However, Hunter Industries states that you need the key to make this adjustment. [17] X Research source"
    },
    {
      "title": "Hold the sprinkler head while turning the key clockwise to widen the arc.",
      "content": "Hold the sprinkler head while turning the key clockwise to widen the arc. Use your hand to hold the sprinkler head in place so the arrow stays pointing on your right stop. Then, turn the key clockwise to widen the arc. Each full turn will widen the arc by 90 degrees. Stop if you meet resistance or hear a grinding sound. [18] X Research source The highest you can widen your arc is 360 degrees. When you reach this point, the key will either stop moving or you’ll hear a grinding sound. Clockwise is the plus, or positive, direction."
    },
    {
      "title": "Check the arc to make sure the stop points are correct.",
      "content": "Check the arc to make sure the stop points are correct. Turn your sprinkler head to the right, then to the left. Make sure the arrows line up with your desired right and left stop points. [19] X Research source"
    },
    {
      "title": "Turn the key counterclockwise to shorten the sprinkler arc.",
      "content": "Turn the key counterclockwise to shorten the sprinkler arc. If you widen the arc too far, simply turn the Hunter wrench key in the counterclockwise direction to shorten your arc. [20] X Research source Counterclockwise is the minus, or negative, direction."
    },
    {
      "title": "Push down on the sprinkler head to close it.",
      "content": "Push down on the sprinkler head to close it. Once your adjustments are complete, slide your sprinkler head back down into the base. You’re all set to water your lawn! [21] X Research source"
    },
    {
      "title": "Insert the plastic end of your Hunter wrench key into the lifting socket.",
      "content": "Insert the plastic end of your Hunter wrench key into the lifting socket. The lifting socket looks like a circle with a line or rectangle through it. Turn the key 90 degrees and lift the inner assembly. [22] X Research source You won’t be able to change the nozzle without using a Hunter wrench key."
    },
    {
      "title": "Put the hex bar into the radius reduction screw and turn counterclockwise.",
      "content": "Put the hex bar into the radius reduction screw and turn counterclockwise. The hex bar is the slim, square metal bar on your Hunter wrench key. The radius reduction screw is the hole on the arrow on your sprinkler cap. Twist the bar as far as it will go counterclockwise to uncover the nozzle. [23] X Research source If the bar doesn’t move, you can go on to the next step. The arrow points to where your nozzle is, so the nozzle will be just below the arrow."
    },
    {
      "title": "Turn on the water to push out the nozzle.",
      "content": "Turn on the water to push out the nozzle. Remove the hex bar if you haven’t already. The force of the water can blow out the nozzle since nothing is holding it in. Turn off the water so you can install the new nozzle. [24] X Research source Alternatively, grab the edge of the nozzle with needle-nosed pliers and pull outward to remove it. [25] X Research source Keep the nozzle if it’s not damaged so you can reuse it later."
    },
    {
      "title": "Install a larger nozzle for higher precipitation if your soil tends to be dry.",
      "content": "Install a larger nozzle for higher precipitation if your soil tends to be dry. Gently push your new nozzle into the hole below the arrow on your sprinkler cap. Reinsert the hex bar so you can tighten the nozzle range screw. [26] X Research source"
    },
    {
      "title": "Insert a smaller nozzle for lower precipitation if your soil gets too wet.",
      "content": "Insert a smaller nozzle for lower precipitation if your soil gets too wet. Slide the new nozzle into the hole under the arrow on your sprinkler cap. Tighten the nozzle range screw using the hex bar. [27] X Research source"
    },
    {
      "title": "Turn the sprinkler on while you adjust it so you can see the spray.",
      "content": "Turn the sprinkler on while you adjust it so you can see the spray. You want the water on so you can see which area of your lawn is getting watered. Observe the direction and arc of the spray so you know what adjustments you need to make. [28] X Research source"
    },
    {
      "title": "Slowly turn the sprayer to your right stop point.",
      "content": "Slowly turn the sprayer to your right stop point. You’ll hear a ratcheting noise with each turn, which is normal. Stop turning the sprinkler when the water is spraying toward your desired right stop point. If you go too far, just spin the sprayer back toward the left."
    },
    {
      "title": "Spin the nozzle clockwise to decrease the arc.",
      "content": "Spin the nozzle clockwise to decrease the arc. The nozzle on a spray nozzle sprinkler is the top cap where the water comes out. As you turn the nozzle, the water spray will start to narrow, covering less ground. Stop turning the nozzle when you reach your desired arc. You don’t need any special tools to adjust spray sprinklers. If you go too far, just twist it back the other way."
    },
    {
      "title": "Twist the nozzle counterclockwise to increase the arc.",
      "content": "Twist the nozzle counterclockwise to increase the arc. Use your hand to grip the edges of the nozzle cap and turn it. Watch the spray expand until the water reaches as far as you'd like. Stop spinning the cap when you’re happy with the arc. If the arc gets too wide, simply spin the nozzle back counterclockwise."
    },
    {
      "title": "Reduce the radius by turning the nozzle screw clockwise.",
      "content": "Reduce the radius by turning the nozzle screw clockwise. The nozzle screw is at the center of the sprinkler cap. Insert a 1 ⁄ 4 inch (0.64 cm) flat-head screwdriver into the screw head. Slowly spin the screwdriver to shorten the radius, or how far the water reaches, until you’re happy with your sprinkler coverage. [29] X Research source If you need to reduce the radius more than 25%, install a smaller radius nozzle."
    },
    {
      "title": "Increase the radius by turning the nozzle screw counterclockwise.",
      "content": "Increase the radius by turning the nozzle screw counterclockwise. Find the nozzle screw at the center of the sprinkler cap. Use your 1 ⁄ 4 inch (0.64 cm) screwdriver to slowly turn the screwdriver counterclockwise to widen your radius, or how far the water sprays, until you’re happy with your sprinkler coverage. [30] X Research source"
    }
  ]
}