{
  "url": "https://www.wikihow.com/Call-Germany-from-the-USA",
  "title": "How to Call Germany From US: Mobile, Landline, & More",
  "steps": [
    {
      "title": "Dial 011.",
      "content": "Dial 011. To place any international call from a U.S. landline, start by dialing this number combination. 011 is the “exit number” for phone calls from North America. [1] X Research source This is also the first step to dialing any international number (outside of North America) from Canada. If you are calling from a cell phone, you can press the 0 key to use a \"+\" instead of the exit code."
    },
    {
      "title": "Enter 49.",
      "content": "Enter 49. This is the country code for Germany. You will need to dial it after the exit number and before the actual phone number. [2] X Research source The country code is necessary for making the call go through correctly, so don’t leave it out!"
    },
    {
      "title": "Punch in the area code if you’re calling a landline.",
      "content": "Punch in the area code if you’re calling a landline. If you’re dialing a landline, you’ll need to enter an area code after the country code and before the main number. The area code may be anywhere from 2 to 5 digits long. [3] X Research source If you see a leading 0 on the area code, leave it off—the 0 is only used when making calls within Germany. Don’t enter an area code if you are calling a cell phone number."
    },
    {
      "title": "Dial the phone number.",
      "content": "Dial the phone number. After dialing the area code (if applicable), you can enter the main phone number. German landline numbers can be anywhere from 3 to 13 digits long, including the area code. German cell phone numbers are 10 or 11 digits long. [4] X Research source If you’re calling a landline, you might dial something like 011-49-480-123456789. For a cell phone, you might dial something like 011-49-12345678910."
    },
    {
      "title": "Make a direct call to another user of the same VoIP software.",
      "content": "Make a direct call to another user of the same VoIP software. VoIP services such as Skype, WhatsApp, and Facebook Messenger allow you to make free online calls to other users anywhere in the world over the internet. Simply select the name of the person you would like to call from your list of contacts (or send a request to connect if they are not already in your contacts) and select the voice or video call option to connect. Make sure the person you are trying to call has the same software downloaded and set up so that the call will be free for both of you. Some services (like Skype) also allow you to make video calls."
    },
    {
      "title": "Use Skype",
      "content": "Use Skype to call a German landline or cell phone. If the person you are trying to call doesn’t have Skype or an equivalent VoIP service, you can call their phone directly over Skype . To do this, you'll need to download Skype on your phone or computer, sign up for a free account or log in, then dial the number just like you would on a regular phone. [5] X Research source Skype has a number of plans that allow you to call Germany. Their recommended plan gives you 400 minutes to call German landlines and mobile phones for $8.38 per month. [6] X Research source"
    },
    {
      "title": "Try using Google Voice.",
      "content": "Try using Google Voice . If you have a Google Voice account , you can use it to call German numbers from your phone or computer. You will need to add some money to your Google Voice account before you call, which you can do by navigating to “Payments” in the dropdown menu at voice.google.com or in your Google Voice app. To place the call: [7] X Research source If you’re using a phone or other mobile device, open your Google Voice app and click the “Calls” button at the bottom. Open the keypad and dial “+49” followed by the number you wish to call, then hit the call button. To call from your computer, go to voice.google.com. Open the “Calls” tab and select “Make a Call.” Enter “+49” followed by the number you wish to call, then hit the “call” button. Once you initiate the call, you’ll hear or see a message confirming that your call is being routed through Google Voice and telling you how much the call will cost. You can view rates for calling Germany here: https://www.google.com/voice/rates ."
    }
  ]
}