{
  "url": "https://www.wikihow.com/Check-and-Repair-a-Blown-Head-Gasket",
  "title": "How to Check and Repair a Blown Head Gasket",
  "steps": [
    {
      "title": "Look for a high engine temperature.",
      "content": "Look for a high engine temperature. High temperatures can cause your gasket to blow, and once this has occurred, your engine temperature will only continue to rise. If your car is constantly overheating, this could be a sign that your head gasket has blown. [1] X Research source"
    },
    {
      "title": "Check for lower coolant levels.",
      "content": "Check for lower coolant levels. If your head gasket is blown, coolant may be leaking from the cooling system."
    },
    {
      "title": "Look out for milky or frothy oil.",
      "content": "Look out for milky or frothy oil. Check the colour of your oil. If it’s white and milky looking, or if your oil dipstick reveals a frothy substance, chances are your oil has mixed with the coolant and your head gasket has blown. [2] X Research source"
    },
    {
      "title": "Beware of light smoke emerging from the exhaust pipe.",
      "content": "Beware of light smoke emerging from the exhaust pipe. If you spot white smoke emerging from your exhaust pipe, this could mean that the coolant has leaked into the combustion chamber. [3] X Research source"
    },
    {
      "title": "Disconnect the negative battery terminal, located at the top of the car battery.",
      "content": "Disconnect the negative battery terminal, located at the top of the car battery. [4] X Research source"
    },
    {
      "title": "Remove the intake hose and airbox.",
      "content": "Remove the intake hose and airbox."
    },
    {
      "title": "Take off the air conditioner compressor; this will require you to remove several bolts.",
      "content": "Take off the air conditioner compressor; this will require you to remove several bolts. Once the compressor is free, lay the device on its side in order to access the cylinder head."
    },
    {
      "title": "Disconnect the water pump hose, by using a screwdriver to loosen the clamp.",
      "content": "Disconnect the water pump hose, by using a screwdriver to loosen the clamp."
    },
    {
      "title": "Remove the alternator.",
      "content": "Remove the alternator. You won’t need to take off the entire alternator harness; simply remove the bolts."
    },
    {
      "title": "Drain the radiator and remove the radiator hoses.",
      "content": "Drain the radiator and remove the radiator hoses. Disconnect all the lines running to the air conditioner. [5] X Research source"
    },
    {
      "title": "The head gasket should now be visible.",
      "content": "The head gasket should now be visible. Refer to your service manual and pay close attention to the tightening sequence for the head bolts that hold the head gasket in place, as these must be loosened in the correct reverse order."
    },
    {
      "title": "Remove the old blown head gasket.",
      "content": "Remove the old blown head gasket. Be sure to thoroughly clean the cylinder head, so that the new head gasket sits correctly."
    },
    {
      "title": "Once you have fitted the new head gasket into the space, tighten the bolts again in the correct order.",
      "content": "Once you have fitted the new head gasket into the space, tighten the bolts again in the correct order. You’ll need a torque wrench to do so, as the bolts must be torqued to a specific tightness, relevant to your particular vehicle. It’s crucial that these bolts are torqued correctly, as otherwise you may cause damage to your new head gasket. [6] X Research source"
    },
    {
      "title": "Replace the components.",
      "content": "Replace the components. Reconnect the hoses in the order in which you disconnected them, replace the alternator, and ensure that all necessary parts are once again in place."
    },
    {
      "title": "Fill the cooling system with fresh coolant and turn on the engine, allowing it to idle until it reaches operating temperature.",
      "content": "Fill the cooling system with fresh coolant and turn on the engine, allowing it to idle until it reaches operating temperature. [7] X Research source Allow the engine to run for several minutes before switching it off and checking your new head gasket for any leaks."
    }
  ]
}