{
  "url": "https://www.wikihow.com/Calculate-Heart-Rate-from-ECG",
  "title": "How to Calculate Heart Rate from ECG",
  "steps": [
    {
      "title": "Be aware of how a normal \"wave form\" looks on an ECG trace.",
      "content": "Be aware of how a normal \"wave form\" looks on an ECG trace. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source This will allow you to determine what area of the ECG represents one heart beat. From the length of a heart beat on the ECG trace, you will be able to calculate the heart rate. A normal heart beat contains a P wave, a QRS complex, and an ST segment. The one you will want to pay particular attention to is the QRS complex, as this is the easiest one to use to calculate heart rate. The P wave is a small semi-circular shape located right before the tall QRS complex. It represents the electrical activity of the atria (\"atrial depolarization\"), which are the two small chambers located at the top of the heart. The QRS complex is the tallest most visible aspect of the ECG trace. It is usually pointy, like a tall, thin triangle and very easy to recognize. It represents the electrical activity of the ventricles (\"ventricular depolarization\"), which are the two large chambers located at the bottom of the heart that forcefully pump blood throughout the body. The ST segment directly follows the tall QRS complex. It is actually the flat area prior to the next semi-circular shape on the ECG (which is the T wave). The importance of this flat segment (the ST segment), located right after the QRS complex, is that it provides important information to physicians about things such as potential heart attacks."
    },
    {
      "title": "Identify the QRS complex.",
      "content": "Identify the QRS complex. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The QRS complex is normally the tallest part of the pattern that repeats on the ECG. It is a tall and skinny spike (for a person with normal heart function) that occurs repeatedly at the same rate across the ECG trace. Every time one QRS complex occurs, it is an indication that one heart beat has taken place. Therefore, you can use the space between QRS complexes on the ECG to calculate the heart rate."
    },
    {
      "title": "Count the space between QRS complexes.",
      "content": "Count the space between QRS complexes. [5] X Research source The next step is to determine the number of large squares on the ECG trace separating one QRS complex from the next QRS complex. The ECG normally has both small squares and large squares. Be sure you are using the large squares as your reference point. Go from the peak of one QRS complex to the peak of the following QRS complex. Note the number of large squares separating the two points. Often, it will be a fractionated number as the complexes will not land exactly on the squares; for instance, 2.4 squares or 3.6 squares may separate adjacent QRS complexes. There are normally 5 little squares embedded in each large square, allowing you to approximate the distance between QRS complexes to the nearest 0.2 units (because 1 big square divided into 5 small squares gives you markings every 0.2 units)."
    },
    {
      "title": "Divide the number 300 by your answer above.",
      "content": "Divide the number 300 by your answer above. Once you have calculated the number of big squares separating QRS complexes (let's use 3.2 as an example), perform the following calculation to determine heart rate: 300/3.2 = 93.75. Round your answer to the nearest whole number. In this case, the heart rate would be 94 beats per minute. [6] X Research source Note that a normal heart rate is between 60 to 100 beats per minute. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Knowing this can help to guide whether you are on course with your heart rate calculations. However, 60 to 100 beats per minute is only a loose guideline. Many athletes who are in excellent physical shape have lower resting heart rates. [8] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source There are also disease states that can provoke unhealthy slower heart rates (called pathological bradycardias), and diseases that can lead to an unnaturally accelerated heart rate (called pathological tachycardias). Speak to a physician if the person you are calculating heart rate for appears to have an abnormal value."
    },
    {
      "title": "Draw two lines on the ECG trace.",
      "content": "Draw two lines on the ECG trace. The first line should be near the left-hand side of the paper containing the ECG trace; the second line should be exactly 30 large squares subsequent to the first line. 30 large squares on an ECG trace represents exactly 6 seconds. [9] X Research source"
    },
    {
      "title": "Count the number of QRS complexes between the two lines.",
      "content": "Count the number of QRS complexes between the two lines. [10] X Research source As a reminder, the QRS complex is the tallest peak of each wave form that represents one heart beat. Tally up the total number of QRS complexes between your two lines and write down this number."
    },
    {
      "title": "Multiply your answer by 10.",
      "content": "Multiply your answer by 10. [11] X Research source Because 6 seconds x 10 = 60 seconds, multiplying your answer by 10 will give you the number of heart beats that have occurred in one minute (in other words, the \"beats per minute,\" which is the standard measurement of heart rate). For example, if you count 8 beats in the 6 second period, then your heart rate calculation gives you 8 x 10 = 80 beats per minute."
    },
    {
      "title": "Understand that this method is particularly effective for irregular heart rhythms.",
      "content": "Understand that this method is particularly effective for irregular heart rhythms. If the heart rate is regular, the first method of simply determining the distance between one QRS and the next can be very effective, because the distance between all the QRS complexes is presumably the same with a regular heart rate. On the other hand, with an irregular heart rate (where the QRS complexes are not at regular distances from one another), the 6 second method works better because it averages the distance between heart beats, giving a more accurate overall number. [12] X Research source"
    }
  ]
}