{
  "url": "https://www.wikihow.com/Bob-Slap-Battles",
  "title": "How to Find & Unlock the Bob Glove in Roblox Slap Battles",
  "steps": [
    {
      "title": "Unlock the “Replica” glove for 4,000 slaps.",
      "content": "Unlock the “Replica” glove for 4,000 slaps. Getting bob requires using the Replica glove, so you’ll need to have that first! Replica costs 4,000 slaps to unlock, which you can acquire by slapping other players, collecting Slapples, or winning a Slap Tournament or Slap Royale match. You can also get slaps by claiming the Hitman’s quests or through daily rewards and codes. [1] X Research source Normally, the Replica glove’s ability spawns a clone of the player that starts slapping other players nearby. However, Replica also has a chance of spawning the bob entity instead—which is how the bob glove is acquired."
    },
    {
      "title": "Use the Replica glove’s ability to spawn bob.",
      "content": "Use the Replica glove’s ability to spawn bob. Getting bob is actually just a matter of luck; there’s a 1 in 7,500 (0.01333%) chance of spawning bob by using Replica’s ability. So, after acquiring Replica, you’ll just have to use its ability until bob spawns. However, ensure there’s someone else you can target—you’ll only get the bob badge if bob has a target in the area. [2] X Research source You’ll need the bob badge to equip the glove, which is why you need to make sure bob has a target! The bob glove has a neon black texture, with bob’s face appearing across the front. The glove’s banner says that its power and speed are “bob and “bob,” but the actual values are around 52 and 16, respectively (when compared with other gloves)."
    },
    {
      "title": "Try grinding with the Replica glove in a private server.",
      "content": "Try grinding with the Replica glove in a private server. “Grinding” with the Replica glove just means using its ability over and over until bob spawns. To grind as effectively as possible, join a private server and have either an alt account or a friend waiting nearby (so you can get the bob badge). That way, you can grind for long periods uninterrupted. [3] X Research source Since the Replica glove’s ability can push you back sightly, use it in places you won’t easily fall off (like the castle or on a cloud). You can manually grind, or do AFK (away from keyboard) using an auto-clicker to keep triggering the Replica ability. Just remember that you can’t spawn bob while ragdolled or stunned!"
    },
    {
      "title": "Use a macro to get the bob glove faster.",
      "content": "Use a macro to get the bob glove faster. Macros are basically just automations to make things easier in-game—and you can use a macro in Slap Battles to shorten the amount of time it takes Replica to respawn (bringing it from 12 seconds down to 3-5). Even though it can still take a long time to spawn bob this way, it’s more efficient. For the macro, record the following inputs: [4] X Research source Use Replica's ability with [E] (and a 0-second delay). Open the escape menu with [ESC] (and a 0.1-second delay). Click the “Respawn” button with [R] (and a 0.1-second delay). Confirm the reset with [ENTER] (and a 0.1-second delay)."
    },
    {
      "title": "The bob glove has the ability “bob (bob really likes people).”",
      "content": "The bob glove has the ability “bob (bob really likes people).” This ability summons the evil entity, bob: a black humanoid with a dark aura. Bob immediately targets the closest player, accelerating based on their distance and blinding the target as they come closer to bob. When the target gets too close, they’ll be sucked into bob and killed—after which bob will despawn. [5] X Research source Targeted players will notice the map become darker as bob closes in, with a wide black platform spawning under the Cube of Death. A message reading \"S̸̙̅̔̌̐́̀̍̂̏̏A̷̢̠̦̪̫͇̲͖̙̬͕̦̜͆̀̿̍̊͒̐̑͒̏̕͝V̸̙̰̻̝̖̗̣̩̂̈E̸̛̤̪̻̭̲̔̆̆͐̑̂͜͠͝ ̴̡̣̰̬̣͎̥̜̙̌̓̿͛͆̓͒̑̊͊́͑͘ͅY̶̺̤͔̭͙̣̮̪̟̓̇͌͐̆̍̇̍̕O̴̙̱̓͂̆̕̚͝U̶̢͓̻͚̩̻͕̣̔̏͆ͅR̴̨̧̨̙̩̘̤̭͙̃͜S̶̪͍̗̠͆̾̚Ě̶̡̡͎̼̲̯̝͓͍͕̌̓̈̄̓͛͗̽̈́̓̔̒͝L̷̡̻̰̜̲͕̮̗͇͓̭̂̽̽̒̓͋̃̽͌̈̓͋͘̕ͅF̸̨̨̥̮̼͖̦̦̮̬̺̫̺̖̿̈\" will appear above the cube. Bob can hover over the void and slopes when chasing targets. However, if bob is led into the cube, it’ll die (with a loud scream sound effect playing when it happens)."
    },
    {
      "title": "The bob glove is also used to trigger the Eternal BOB boss fight.",
      "content": "The bob glove is also used to trigger the Eternal BOB boss fight. You can access the Eternal BOB fight with a Reaper, Killstreak, Tycoon, God’s Hand, and bob glove. This boss fight is required to get the rob glove (and corresponding Clipped Wings badge). The fight itself is a long one, usually taking up to 1 hour to complete—although times vary by player. [6] X Research source To trigger the battle, the following also needs to happen: The Reaper and Killstreak gloves must have at least 3 kills. Reaper, Killstreak, Tycoon, and God’s Hand must be together using the Timestop ability. While this is happening, bob must be spawned and chasing somebody (with the other four gloves close to bob)."
    },
    {
      "title": "The bob and rob gloves have a special interaction.",
      "content": "The bob and rob gloves have a special interaction. Each gloves spawns its respective entity, and when rob and bob collide, the collision creates a portal that can pull in any nearby players and kill them. Eventually, the portal will explode—increasing the cooldown of both abilities by over a minute. Additionally, players with the Default glove equipped get sent to The Null Zone when entering the portal."
    },
    {
      "title": "Pros",
      "content": "Pros On the plus side, the bob glove doesn’t have a range limit on its abilities, along with decent power and speed. Bob can also float over the void, which can help you target enemies in a Cloud, and bypass abilities like God’s Hand, Shield, and the Reverse gloves. Furthermore, bob can be spawned anywhere (except in the void). [7] X Research source The glove has multiple properties that can help you target other players. For example: Bob has a blindness effect that makes it hard for players to see bob coming or reach the island with the cube of death. Bob can also be used to kill players trapped in a cutscene before they get the chance to move. Bob can ride the Firework and Cloud abilities, as well as bypass the Guardian angel’s blessing."
    },
    {
      "title": "Cons",
      "content": "Cons Bob’s main con is that it can only target one player at a time—and, depending on how far away the player is, they can run away from bob (since bob slows down as it gets closer to the target). Bob can also be killed in a number of ways: the Cube of Death, el gato, MEGAROCK, and CUSTOM can all kill it, for example. Bob can’t reach players who go onto the Plate and can’t kill players using invincibility abilities like Golden, Phase, rob, Firework, and Glovel. Bob can actually get stuck if spawned under its invisible platform (on the Slapple Island chain or under Cannon Island, for example)."
    }
  ]
}