{
  "url": "https://www.wikihow.com/Burn-a-DVD",
  "title": "How to Burn a DVD",
  "steps": [
    {
      "title": "Learn what formats of disc are suitable for your drive, burning software, purpose, and devices, as well as the playback equipment you intend to view it on.",
      "content": "Learn what formats of disc are suitable for your drive, burning software, purpose, and devices, as well as the playback equipment you intend to view it on. Before you invest money on new blank DVD, do a little research and get to know which formats are compatible with your devices. Knowing this before you purchase a huge pack of discs will prevent frustrating and costly mistakes. DVD+R means the disc is rewritable and you can (with appropriate software) delete files off the disc and replace with new ones. The file will just hide under the new ones and take up some disc space. DVD-R means the disc is not erasable and cannot be reused although files can be copied to another drive and burned on a new disc. ROM means it's Read Only Media that can not be erased and is permanently burned onto the disc. RW states the old file is erased completely taking no disc space at all after being rewritten or re-burned."
    },
    {
      "title": "Look at the format symbols/icons on the packaging, the disc themselves, in the device user manuals or the device.",
      "content": "Look at the format symbols/icons on the packaging, the disc themselves, in the device user manuals or the device. Not every DVD disc is made for burning with a computer and some discs will allow you burn a movie and menus of a DVD on the disc but not work in DVD players. Note which brands work better on the devices too. Some players are finicky about the brands of disc being played in them. Also some brands are thicker and more durable than others. Professional movie discs are an expensive grade of disc."
    },
    {
      "title": "Before purchasing a disk set, look for the icon Video DVD (video with a disc) on the burning and playback devices.",
      "content": "Before purchasing a disk set, look for the icon Video DVD (video with a disc) on the burning and playback devices. Purchase DVDs with the same icon. This format will very likely to work properly with the used device. Purchase only DVD-R disc formats for this purpose. Many players don't play discs with DVD+R format correctly, and the menus on the DVD may not function right when burned on that format. You can tweak the settings of the authoring program to fix this problem but it's best left to more advanced users."
    },
    {
      "title": "Download and install a DVD authoring program.",
      "content": "Download and install a DVD authoring program. If you want to burn a video file to a DVD so that it can be played in any DVD player, you'll need a special kind of burning program, referred to as \"DVD authoring\" programs. These programs will convert the video file(s) to the format that is recognized by standalone DVD players. These programs typically don't come installed on your computer, though you may have a trial or basic version that came with your DVD burner. Below are a few of the most popular free options for the major operating systems: [1] X Research source WinX DVD Author - winxdvd.com/dvd-author/ (Windows) Burn - burn-osx.sourceforge.net (Mac) DeVeDe - rastersoft.com/programas/devede.html (Linux; Windows no longer free) DVD Styler - dvdstyler.org/en/ DVD Flick- dvdflick.net/ (out of date but is operational and with practice you can create your own custom backgrounds and buttons; for Windows)"
    },
    {
      "title": "Create a new Video project in your DVD authoring program.",
      "content": "Create a new Video project in your DVD authoring program. The process varies a little bit depending on the program you are using, but generally you'll be presented with a menu when you start your program, allowing you to pick the type of DVD you are creating. Choose the \"Video\" option or tab."
    },
    {
      "title": "Add your video file(s) to the new project.",
      "content": "Add your video file(s) to the new project. After starting your new project, you can add your first video file. Most DVD authoring programs support all the major video formats, so you typically don't need to worry about converting the files first. Click and drag the video into the authoring window, or browse for the video file on your computer. You can usually fit one full-length movie onto your DVD, or several hour-long TV episodes."
    },
    {
      "title": "Start the conversion process.",
      "content": "Start the conversion process. Oftentimes the video files that you add are not in the proper MPEG-2 format required to make a playable video DVD. The extension name for this is ,MPEG OR .MPG. Most DVD authoring programs will convert your video file either as you add it to the project, or after you're finished adding files. Converting the video may take a while to complete. If prompted during the video conversion, select the correct region for your DVD player. The US and Japan use NTSC, while most of Europe uses PAL. If you are using DeVeDe, the conversion happens at the end of the authoring process. If you are receiving errors when attempting to convert the file, you may need to use a dedicated conversion program like Handbrake. Click here for instructions on using Handbrake to convert your files to a DVD compatible format. Flash-Integro (or VSDC Movie Editor free version) also converts movies into needed formats and offers many editing options like cutting and splitting as well. Go to the Flash-Integro site and not the other fake ones. You can also record a video in a media player like VLC or PotPlayer in MPEG format to convert a file as well. It takes as long as the movie duration."
    },
    {
      "title": "Create the menu.",
      "content": "Create the menu. Many DVD authoring programs have basic menu creation tools. These allow you to create a custom menu for your video. You don't need a menu for the video to be playable, as you can have it just automatically start playing when the disc is inserted. In Burn for Mac, click the Gear button and select \"Use DVD theme\" to enable a basic menu for your DVD. When creating the menu, avoid placing buttons along the very edge of the frame. The edge is often cut off by older TVs and DVD players."
    },
    {
      "title": "Insert a blank DVD.",
      "content": "Insert a blank DVD. Once the video is converted and the menu has been created, you can start the burning process. Insert a blank DVD-R into your computer's DVD burner. This is the best disc format for creating video DVDs, as DVD-R is compatible with the widest range of DVD players. Some older DVD players will not be able to play any burned DVDs, regardless of format. If your computer opens the AutoPlay window when you insert the blank disc, just close it."
    },
    {
      "title": "Open the Burn menu in the authoring program.",
      "content": "Open the Burn menu in the authoring program. Again, the process will vary depending on the program you are using. There are a few settings that you'll want to check before you actually burn the project to the disc: Set the \"Write Speed\" low. While it may be tempting to set the speed to MAX or another high value, this can lead to errors on the disc which will prevent it from playing. The best way to ensure that your disc will work is to burn at 2X or 4X only. If you haven't been prompted to select your region yet, check the Burn menu for the NTSC for PAL option and select the appropriate one."
    },
    {
      "title": "Burn the disc.",
      "content": "Burn the disc. After reviewing your settings, start the burn process by clicking Start or Burn. If your videos weren't converted yet, they'll be converted before being burned. The entire process may take a while, especially if you've lowered the burn speed. Try to avoid using your computer while it is converting and burning, as this could slow the process down or cause errors. If you're using DeVeDe, the program will only create an ISO (disc image) file. You'll need to then burn the ISO file yourself. See this section for more information."
    },
    {
      "title": "Play the burned disc.",
      "content": "Play the burned disc. Once the burning and converting process is complete, you should be able to play your new disc in most DVD players. Remember, not all DVD players support burned DVDs, especially older models."
    },
    {
      "title": "Insert a blank DVD into your DVD burner.",
      "content": "Insert a blank DVD into your DVD burner. If you're creating archives of your data, or don't want someone else overwriting what you've put on the disc, use a DVD-R or DVD-R DL (Dual Layer). [2] X Research source If you want to be able to rewrite and edit the content on the disc, use a DVD-RW."
    },
    {
      "title": "Open the DVD in your computer's file explorer.",
      "content": "Open the DVD in your computer's file explorer. Most modern operating systems allow you to burn data DVDs directly from your file explorer without any additional software. Opening the blank disc will allow you to add files and folders. [3] X Research source In Windows 7 and later, you'll be prompted to select whether you want to use the disc like a USB drive, or like a traditional finished DVD. Selecting \"Like a USB flash drive\" will allow you to rewrite the disc, even if it isn't a rewriteable disc, but it will only work in Windows. Selecting \"With a CD/DVD player\" will make the disc act like a traditional disc that will need to be finalized and can only be used once. [4] X Research source If you are using OS X, the blank disc will appear on your desktop. Double-click it to open it in the Finder. [5] X Research source"
    },
    {
      "title": "Drag files and folders into the blank disc's window.",
      "content": "Drag files and folders into the blank disc's window. You won't lose the original copies of the files. You can fit about to 4.38 GB worth of data onto a single blank DVD-R. The status bar at the bottom of the window will display how much space you have left."
    },
    {
      "title": "Burn the disc.",
      "content": "Burn the disc. Once you're finished adding files, you can finalize your disc and eject it so that you can use it on other computers. The process is a little different depending on your operating system and settings. If you selected \"Like a USB flash drive\" in Windows, just eject your disc after you're finished adding files and the disc will be made ready to use on other Windows computers. This may take a minute or so. If you selected \"With a CD/DVD player\" in Windows, click the \"Finish burning\" button to finalize the disc. This may take a few minutes. If you're using OS X, click the Burn button next to the disc name in the left sidebar."
    },
    {
      "title": "Identify the disc image file.",
      "content": "Identify the disc image file. Disc image files are exact copies of a DVD or CD that need to be burned to a blank disc before thy can be used. This will turn the disc into a copy of the original. There are a variety of disc image file types that you may have downloaded. The most common file type is ISO, and you can use built-in software in Windows 7 and later or in OS X to burn these to a blank disc. Other disc image formats include CDR, BIN/CUE, DMG, CDI, and NRG. If you are using Windows Vista or XP, or you are trying to burn an image file other than ISO, you'll need to install an image burning program. One of the most popular programs for Windows is ImgBurn ( imgburn.com )."
    },
    {
      "title": "Insert a blank DVD into your burner.",
      "content": "Insert a blank DVD into your burner. Burning an image file to your disc will finalize it, and it won't be able to be rewritten. For best results, use a DVD-R format disc."
    },
    {
      "title": "Open the image burning software.",
      "content": "Open the image burning software. The process varies depending on your operating system and installed software: Windows 7, 8, and 10 - Right-click on the ISO file and select \"Burn to disc\". This will open the Windows Disc Image Burner utility. OS X - Launch the Disk Utility program, which you can find in the Utilities folder. Drag your ISO file into the left frame of the Disk Utility window. [6] X Research source Windows Vista and XP, or non-ISO files - Launch your image burning program and load the image file."
    },
    {
      "title": "Start the burning process.",
      "content": "Start the burning process. Click the \"Burn\" button to begin burning your ISO or other disc image file to your blank DVD. This process will take several minutes, depending on the speed of your burner and the size of your image file."
    }
  ]
}