{
  "url": "https://www.wikihow.com/Accept-That-He%27s-Just-Not-That-Into-You",
  "title": "How to Accept That He’s Not Into You",
  "steps": [
    {
      "title": "Learn the signs that he’s not into you.",
      "content": "Learn the signs that he’s not into you. Whether you’re in a relationship or just hoping that a crush likes you back, there are some sure signs that your relationship is one-sided or he’s not interested in dating you. Some common signs that he’s just not that into you may include: [1] X Research source He never tries to initiate physical intimacy with you, especially in public. He only reaches out when he wants to have sex, then disappears after. He doesn’t call you often or respond to your messages promptly. He doesn’t ask questions about your personal life beyond a superficial level. He forgets important things about you, like your birthday or if you have siblings. He never initiates plans and often cancels on you. He avoids talking about the future or any vulnerabilities he has. He talks about other women and his interest in them. He doesn’t like you touching his phone or looking over his shoulder. He doesn’t make you feel special."
    },
    {
      "title": "Take notice of the red flags you’ve been ignoring.",
      "content": "Take notice of the red flags you’ve been ignoring. You may ignore red flags because you have strong feelings for this person and want things to work out. However, when you’re honest with yourself about his behavior, you’ll free yourself to find a more balanced relationship with someone who deserves your love. If you’re constantly questioning where things stand or whether you're seriously dating, then he probably isn’t that into you. [2] X Research source If he tells you that he doesn’t know what he wants , take him at his word! He is not reciprocating your interest; you deserve a relationship with someone who doesn’t make you question your place in his life. If he calls you only on the weekend but drops off the face of the earth during the week, he's not committed enough to the relationship to find the time to communicate with you. [3] X Research source If he talks about his ex often , he most likely isn’t over them yet and is therefore not ready or available for a relationship with you. [4] X Research source"
    },
    {
      "title": "Avoid magical thinking or over-romanticizing.",
      "content": "Avoid magical thinking or over-romanticizing. When you think that you have met “the one,” that fate has brought you together, or that the two of you are meant to be, it can be difficult to let go of the hope that he will eventually see that you are the perfect girl for him. [5] X Research source The truth is, there is no “perfect” person or relationship. Magical thinking is unhealthy because it creates fairy-tale standards that no real person could live up to. Take off your rose-colored glasses. Allow yourself to see through your idealized version of him and notice his flaws. Let go of unhealthy beliefs and rituals, like getting up on a certain side of the bed every morning in the hope that doing so will make him call you that day."
    },
    {
      "title": "Manage your expectations.",
      "content": "Manage your expectations. The expectation that today will be the day that he asks you out, wants to get back together, or finally realizes that you are the girl of his dreams only serves to keep you in the painful cycle of getting your hopes up and then disappointing you over and over. [6] X Research source Instead, center your expectations on things you have some control over, like having lunch with a friend, getting to class on time, or finishing your book. Begin each day with a positive outlook. Resist the urge to base your happiness on whether or not he reaches out to you. Be open to any possibility. For example, if he hasn’t called you in several days, stop stressing yourself out with the notion that it might happen today. By letting go of your expectations, you release yourself from the pain of them not being fulfilled."
    },
    {
      "title": "Be honest with yourself about what you want.",
      "content": "Be honest with yourself about what you want. Consider whether this relationship is really benefiting your life or if your feelings are more intense simply because they aren’t returned. [7] X Research source If you’re in a casual relationship because you initially said you were okay with that, remember you’re allowed to change your mind. It’s normal to “start out thinking you want something casual,” explains marriage and family therapist Elvina Lui. “But as time goes by, your feelings can grow stronger and change to wanting a long-term relationship.” Keep in mind that there are things you can't control. You can’t control whether or not someone falls in love with you or wants to pursue a long-term relationship with you."
    },
    {
      "title": "Acknowledge your feelings.",
      "content": "Acknowledge your feelings. Your feelings are real and valid, and it can help to know that falling in love with someone is a perfectly normal, healthy human behavior. Even if the love is not reciprocated, acknowledging that you feel deeply about someone is important. [8] X Research source Talk it out with a trusted friend or a find a counselor to help you work through your feelings and to avoid the urge to suppress them just because they are painful. Give yourself permission to think about how you feel about him, but try to limit your thoughts to just a few minutes each day so they don’t become all-consuming and obsessive. If you never were in a relationship with this person in the first place, “be happy with the fact that this is happening early on,” advises Single in the City founder Laura Bilotta. If you were further down the road or more committed to this person, this could all feel a lot worse."
    },
    {
      "title": "Let yourself grieve.",
      "content": "Let yourself grieve. Be gentle with yourself, as you are likely embarrassed and reprimanding yourself for putting your heart on the line. Remember that you are just a human being—give yourself time to cope with your heartbreak and process your feelings. [9] X Research source Talk to your friends and family, and let them comfort you. Almost everyone has experienced something like this in their lives. [10] X Research source Take yourself out on a date to a movie you’ve been wanting to see, pamper yourself with a hot bubble bath, or take a trip to the nail salon. Listen to sad love songs or even scream into a pillow! Be patient with the healing process. It can take time for your heart to recover from the pain of unrequited love."
    },
    {
      "title": "Try to reduce your time together.",
      "content": "Try to reduce your time together. It can be rather difficult to swallow your feelings for someone when you’re always around him, especially if you work with him or have a class together. Rather than focus on him and your uncomfortable feelings, concentrate on doing your best work or work on a project with someone new. [11] X Research source Make plans to be somewhere else right after class or work so you won’t have to worry about making awkward small talk with him. Always be kind yet reserved when you do have to talk to him."
    },
    {
      "title": "Delete his contact information.",
      "content": "Delete his contact information. Delete his phone number so you’re not tempted to call or text him. Unfriend or unfollow him on social media so you can't reach out to him and won't get your heart broken all over again by seeing a picture of him with another girl. [12] X Research source Delete his voicemails and texts so you can’t go back and re-read or listen to them. Besides not calling or texting him, avoid bad-mouthing him to mutual friends in real life or on social media. These actions will only make you look bad."
    },
    {
      "title": "Write him a letter, but don’t send it.",
      "content": "Write him a letter, but don’t send it. Express your feelings by writing them down, and don’t hold back! Writing a letter may be a helpful tool to get your thoughts and emotions out of your head. Instead of sending it to him (which we do not recommend), rip the letter up or safely burn it. If journaling and writing your feelings on paper help you, try making a list of the ups and downs in your relationship. As licensed therapist Elvina Lui advises, “Contrasting [your guy’s] love-worthy qualities with his disgusting qualities should actually help you get closure.” This exercise can help you identify how he hurt you while, as Lui explains, also helping you “recognize what it is you loved…[and] inform you on what you will want from your next partner.”"
    },
    {
      "title": "Fill up your calendar.",
      "content": "Fill up your calendar. Get involved with new activities and enjoy your own life. Now is the time to sign up for that art class you’ve been wanting to take or go on a trip somewhere! Make standing dates with friends and family, or develop an enjoyable daily routine. Staying active and busy is essential to getting over someone, claims relationship consultant Joshua Pompey. Pompey explains that, when you’ve been with or crushed on someone for a long time, \"it's hard to enjoy things without them because everything you do makes you think of them or want them to be around.” By surrounding yourself with friends, family, and things you love to do, Pompey says, “You’re going to slowly start to feel like life is good and life is fun without that person.”"
    },
    {
      "title": "Focus on self-love and rebuilding your self-esteem.",
      "content": "Focus on self-love and rebuilding your self-esteem. Treat yourself kindly and make lists of all your amazing qualities. Immerse yourself in activities that make you feel confident, such as playing your favorite sport or making dinner for your family. Set aside time in your life for the things that make you happy and fulfilled. [13] X Research source Create a mantra . Think of a brief positive phrase that you can say to yourself when feeling down. Your mantra can be something specific to you or something more simple, like “Keep your head up and your heart open.” Spend a few minutes each day meditating in a quiet place. Consider this experience an opportunity for personal growth, and remember that you won’t always feel this way. The way you deal with your loss will help you grow stronger as a person. “Focus on you and what makes you happy,” advises matchmaker Laura Bilotta. “Self-love makes you that much more attractive.”"
    },
    {
      "title": "Learn about healthy relationships.",
      "content": "Learn about healthy relationships. Observe the romantic relationships in your life, whether that means your parents' relationship or your best friend’s relationship with her boyfriend. Ask the people in these seemingly happy, healthy relationships for advice and information. You can also research online or check out a self-help book on healthy relationships from the library. It’s important that you don’t carry the baggage of this experience into your next relationship."
    },
    {
      "title": "Date other people.",
      "content": "Date other people. By being open to seeing other people, you will probably realize that the guy who broke your heart wasn’t right for you after all. However, it’s okay to take some time before jumping back into the dating pool. [14] X Research source Before you enter into a rebound relationship with another person, say to yourself, \"I am not hoping to meet the one. I am not in a fairy tale, and I am already complete. I don't need a guy to be happy.\" Relationship expert Joshua Pompey believes that “the best way to get over someone is to start dating again. Even if you're not necessarily ready to jump into a relationship, just seeing what's out there…will speed forward the process.” However, Pompey does clarify that this strategy can “make things worse at the beginning because you might compare the first couple of dates to your ex…but the more people you go out with, the more…you'll be able to get over it.”"
    },
    {
      "title": "Remember that you deserve more.",
      "content": "Remember that you deserve more. You deserve someone who loves you for exactly who you are. If your (former) boyfriend or crush comes crawling back the moment you move on, remind yourself of how he treated you. Decide if you want to take him back or move on to someone who didn’t need to lose you to appreciate you. In the words of expert dating coach Laura Bilotta, “You deserve to be treated a certain way. If you aren’t being treated that way, then they just may not be the right person for you.”"
    }
  ]
}