{
  "url": "https://www.wikihow.com/Add-a-PDF-to-a-PowerPoint",
  "title": "How to Add a PDF to a PowerPoint",
  "steps": [
    {
      "title": "Open PowerPoint.",
      "content": "Open PowerPoint. You’ll find this either on your Start Menu or in your Applications folder. Using this method, you will insert only a clip of your PDF, not the entire page or pages. You can also go to the online version of PowerPoint at https://office.live.com/start/PowerPoint.aspx?omkt=en-GB ."
    },
    {
      "title": "Create a new presentation or open an existing one.",
      "content": "Create a new presentation or open an existing one. This will be where your PDF will go. Within the online version, you are immediately, upon login, presented with options to load a previous presentation or create a new one. With the software, you’ll need to go to “File” and “New”."
    },
    {
      "title": "Navigate to the slide where you want to add the PDF.",
      "content": "Navigate to the slide where you want to add the PDF. This is where your PDF screenshot will go."
    },
    {
      "title": "Open the PDF in a PDF viewer.",
      "content": "Open the PDF in a PDF viewer. You need to have this window of your PDF open and available to screenshot."
    },
    {
      "title": "Zoom in on the part of the PDF you want in your slide.",
      "content": "Zoom in on the part of the PDF you want in your slide. You’ll take a screenshot of this and use it as an image in your PowerPoint."
    },
    {
      "title": "Change the active window back to PowerPoint.",
      "content": "Change the active window back to PowerPoint. Make sure you can still switch over to that PDF."
    },
    {
      "title": "Click the Insert tab.",
      "content": "Click the Insert tab. The menu ribbon will change."
    },
    {
      "title": "Click Screenshot.",
      "content": "Click Screenshot . You’ll find this in the “Images” grouping. A menu will drop down labeled “Available Windows” with previews of all your open windows."
    },
    {
      "title": "Click Screen Clipping.",
      "content": "Click Screen Clipping . This is under the thumbnail previews of the “Available Windows”. Your screen will take on a frosted appearance and your cursor will look like crosshairs (+), and your PDF will become the active window."
    },
    {
      "title": "Click and drag your mouse to select the content of the PDF you want.",
      "content": "Click and drag your mouse to select the content of the PDF you want. You can also press Esc if you want to start over. Your selection shows up in the PowerPoint presentation, and you can edit this from the “Picture Tools Format” tab in the ribbon."
    },
    {
      "title": "Open PowerPoint.",
      "content": "Open PowerPoint. You’ll find this either on your Start Menu or in your Applications folder. Using this method, you will insert the entire PDF into the presentation as an interactive object that you can double-click to open. You will see and be able to interact with the PDF as an object. That means you can scroll through the pages of the PDF while in the PowerPoint presentation. Make sure you do not have the PDF open on your computer before continuing. You can also go to the online version of PowerPoint at https://office.live.com/start/PowerPoint.aspx?omkt=en-GB ."
    },
    {
      "title": "Create a new presentation or open an existing one.",
      "content": "Create a new presentation or open an existing one. This will be where your PDF will go. With the online version, you are immediately, upon login, presented with options to load a previous presentation or create a new one. Within the software, you’ll need to go to “File” and “New”."
    },
    {
      "title": "Navigate to the slide where you want to add the PDF.",
      "content": "Navigate to the slide where you want to add the PDF. This is where your PDF will go."
    },
    {
      "title": "Click the Insert tab.",
      "content": "Click the Insert tab. The menu will change."
    },
    {
      "title": "Click Object.",
      "content": "Click Object . A window will pop up."
    },
    {
      "title": "Click to select Create from file.",
      "content": "Click to select Create from file . You can either use the browse feature to look for your PDF or you can type in the file name along with its location. You can choose to use the file as a thumbnail instead of the actual PDF. In this case, you will not see any of the content from the PDF, but there will be a thumbnail that links to it instead. You’ll also need to set an action to this thumbnail since it doesn’t do anything when it’s added into the slide. You’ll find options to create actions by right-clicking the thumbnail, clicking “Presentation Object” and “Open”."
    },
    {
      "title": "Click Ok to confirm.",
      "content": "Click Ok to confirm. The box will disappear and the PDF will load as an object in the current slide. If the quality of the PDF preview is too low, you can double-click the PDF to open it in full."
    }
  ]
}