{
  "url": "https://www.wikihow.com/Chandelier-Drinking-Game",
  "title": "How to Play the Chandelier Drinking Game (with Bonus Rules)",
  "steps": [
    {
      "title": "Gather up to 10-15 players around a table.",
      "content": "Gather up to 10-15 players around a table. Like most drinking games, Chandelier is best played in a large group. Grab some friends and position them around a large table. About 6-8 players is the sweet spot, and ensures the game isn’t too crowded, but feel free to play with as many players as can fit around the table. [1] X Research source Technically, you might play with just 2-3 players, but we like the drama of a larger group"
    },
    {
      "title": "Fill a cup ⅓ full for each player and arrange the cups in a circle.",
      "content": "Fill a cup ⅓ full for each player and arrange the cups in a circle. Count up your players. For each player, fill a plastic cup about ⅓ full of beer, or with a shot of the liquor of your choice. Then, arrange the cups in a circle in the center of the table, making sure each cup is in reach of its respective player. If you’re hosting a dry event, go ahead and use water, juice, soda, or another non-alcoholic beverage."
    },
    {
      "title": "Place a full cup in the center of the circle, on top of an overturned cup.",
      "content": "Place a full cup in the center of the circle, on top of an overturned cup. Place an empty cup upside down in the center of the circle of filled cups. Then, fill a cup with beer and place it on top of this overturned cup, creating a centerpiece for your beautiful plastic “chandelier.”"
    },
    {
      "title": "Take turns trying to bounce a ping pong ball into the center cup.",
      "content": "Take turns trying to bounce a ping pong ball into the center cup. The first player attempts to bounce the ping pong ball off the table and into the raised center cup. If they’re unsuccessful, they pass the ping pong ball to the player on their left, who also tries to land the ball into the center cup. Play moves around the table clockwise. Select the first player at random, play a quick Rock-Paper-Scissors tournament, or simply choose the youngest player to decide who goes first. Each player gets just a single attempt per turn."
    },
    {
      "title": "Chug your own cup if the ping pong ball lands inside it.",
      "content": "Chug your own cup if the ping pong ball lands inside it. If any player, including yourself, bounces the ping pong ball into your cup while they’re trying to land it in the center cup, take your cup and pound it back. Then, refill it and return it to the circle. After, the player to the left takes their turn."
    },
    {
      "title": "Drink and try to flip your cup if a player lands a ball in the center cup.",
      "content": "Drink and try to flip your cup if a player lands a ball in the center cup. If a player bounces the ping pong ball into the center cup, everyone plays a quick game of Flip Cup . At the same time, every player races to chug the cup immediately in front of them. When it’s empty, they place the cup on the edge of the table and flick its bottom to make it flip and land upside-side down, onto its rim. The last player to successfully flip their cup drinks the center cup, as well. After, the player to the left of the person who threw the ball takes their turn. Sometimes, cups might swivel on their rims for a moment before coming to a rest. Your cup only counts as flipped when it stops moving!"
    },
    {
      "title": "Keep playing until everyone’s had 2-3 turns.",
      "content": "Keep playing until everyone’s had 2-3 turns. Chandelier is a pretty casual drinking game, since there aren’t exactly any winners or losers, depending on the rules you’re using. End the game after each player has had 2-3 turns bouncing the ping pong ball, or just until you’ve all hit your limits or are ready to play another drinking game like Beer Pong or Boom Cup ."
    },
    {
      "title": "Start a flip cup duel by bouncing the ball into another player’s cup.",
      "content": "Start a flip cup duel by bouncing the ball into another player’s cup. In this version, bouncing the ping pong ball into another player’s cup initiates a Flip Cup duel, where you and the other player race 1-on-1 to see who can drink and flip their cup the fastest. The player who loses the duel is eliminated from the game, so act fast! With this rule, the last player standing at the table wins the overall game of Chandelier. Another variation gives the other player 3 attempts to flip their cup. If they succeed, they’re still in the game. If they don’t, they’re eliminated."
    },
    {
      "title": "Eliminate players who lose the group Flip Cup.",
      "content": "Eliminate players who lose the group Flip Cup. For a much more intense game, add some higher stakes when someone lands the cup in the center of the chandelier. In this version, the last player to drink and flip their cup is eliminated, making for an ever-dwindling competition where only 1 player will emerge victorious."
    },
    {
      "title": "Catch the ping pong ball to take the next turn.",
      "content": "Catch the ping pong ball to take the next turn. With this rule, players can catch the ping pong ball if another player misses their shot, but only after the ball goes off the table. If you do catch it, you take the next turn. This can make for some killer combos and brutal rivalries."
    },
    {
      "title": "Track your points to determine a winner.",
      "content": "Track your points to determine a winner. For a slightly more intense game, keep track of how many times each player sinks their ball into a cup. Landing it in someone else’s cup gives you 1 point, landing it in the center cup earns you 5, and landing it in your own cup subtracts a point. The first to 10 points wins."
    },
    {
      "title": "Make a tournament bracket for a more competitive game.",
      "content": "Make a tournament bracket for a more competitive game. If you’re playing an elimination game, it’s less fun for people who go out without a chance to sink a ping pong ball. Remedy that by making a tournament bracket. The first 5 or so eliminated players move to a second table and play a runners-up game, then the winner of the runners-up table plays the winner at the first table in a 1-on-1 duel to take the crown."
    }
  ]
}