{
  "url": "https://www.wikihow.com/Clean-a-Stain-off-Enamel-Ware",
  "title": "How to Clean a Stain off Enamel Ware",
  "steps": [
    {
      "title": "Boil water in your enamel cookware.",
      "content": "Boil water in your enamel cookware. When you are cleaning a stain from inside your enamel glazed pot or pan, you can speed up the process by boiling water in the pan. You only need enough water to cover the surface covered with the stain and allow for evaporation when boiling. [1] X Research source This method works well on food stains, but is not especially effective on rust. This method eliminates the need for an overnight soak."
    },
    {
      "title": "Add baking soda to the boiling water.",
      "content": "Add baking soda to the boiling water. Once the water comes to a boil, add two tablespoons of baking soda. Using a wooden spoon, thoroughly mix the baking soda in water until it is evenly dispersed. [2] X Research source Simmer the mixture for a few minutes. Reduce the heat to a lower setting and allow the baking soda mixture to simmer in the cookware for several minutes. After it has simmered for a few minutes, turn off the heat. Baking soda is mildly abrasive, but only enough to help scrape away the stain. It is safe to use on your enamel cookware."
    },
    {
      "title": "Scrape the cookware with a wooden spoon.",
      "content": "Scrape the cookware with a wooden spoon. Scrape the surface of your cookware with a wooden spoon to remove the stains. They should come up easily with little effort. [3] X Research source It is important to use a wooden spoon. Metal spoons can scratch the enamel surface and cause rust stains where the cast iron is exposed in the cracks. A wooden spoon with a flat edge will make scraping easier."
    },
    {
      "title": "Scrub salt and lemon juice into the stain.",
      "content": "Scrub salt and lemon juice into the stain. Use as much table salt as needed to cover the stain in your enamel. Cut a lemon in half and squeeze the juice over the salt to soak it into the stain. [4] X Research source Continue squeezing lemon juice until you have covered all of the salt and made a paste over the stain. Scrub the area of the stain. Use a sponge or cloth to scrub the salt and lemon juice mixture into the area of the stain. Watch to see if the stain appears to be coming out. [5] X Research source"
    },
    {
      "title": "Rinse the surface with warm water.",
      "content": "Rinse the surface with warm water. Once the stain begins lifting, rinse the area with warm water. Wipe away any remaining residue using a clean cloth, then dry the surface with a clean, dry towel. [6] X Research source"
    },
    {
      "title": "Allow the mixture to sit for tough stains.",
      "content": "Allow the mixture to sit for tough stains. If the stain persists, add more salt and lemon to create a paste on top of the stain. Let it sit for one hour. Squeeze more lemon juice over the paste and scrub the stain with a sponge or cloth until it is removed. [7] X Research source Rinse the entire area with warm water and wipe it with a clean cloth. If you are cleaning a porcelain enamel covered cast iron bathtub, and cannot get the stains out, you can have the tub reglazed by a professional."
    },
    {
      "title": "Choose your product.",
      "content": "Choose your product. Products are available in powder and a liquid forms. Both contain abrasive particles, but the liquid version already dilutes some of the abrasive material, making it a gentler option. For tough stains, the powder product is going to give a deeper scrub and be more effective. [8] X Research source Look for cleansers which are labeled as being safe for use on enamel. Avoid scouring powders like Ajax and products with high acidic content like Vinegar. [9] X Research source Be sure that the cleanser you choose for a bathtub is 100% water soluble so it does not build up in the tub and cause a slippery surface. [10] X Research source"
    },
    {
      "title": "Scrub the stain with cleanser and rinse.",
      "content": "Scrub the stain with cleanser and rinse. Wipe the surface area of the stain with a wet rag. Pour cleanser over the stain. Scrub gently with a wet cloth adding pressure as you go if the stain is tough to remove. Once the stain is removed, rinse all of the cleanser from the surface using warm water. [11] X Research source"
    },
    {
      "title": "Let the cleanser sit on tough stains.",
      "content": "Let the cleanser sit on tough stains. If simply adding the cleanser and scrubbing does not remove your stain, let the cleanser sit before you scrub the stain away. Add the cleanser to a wet surface, spread it over the stain with a wet cloth, then let it sit on the surface for 1-10 minutes depending on the intensity of the stain. The product will dry during this process, but is still easily removed with a wet cloth. If you are leaving the product for more than one minute, test it on a small, inconspicuous area before using this technique on a large surface. Thoroughly rinse the cleanser from the surface once you have finished."
    },
    {
      "title": "Keep the enamel clean.",
      "content": "Keep the enamel clean. Clean your enamel before and after every use to avoid build up, and the need for scraping and abrasive cleaning. After bathing, it is best to rinse the tub and dry it with a clean towel. [12] X Research source Coat your cookware with oil, cooking spray or butter before cooking to avoid sticking. Scrape residue from your cookware immediately after using it to keep the residue from caking on the enamel."
    },
    {
      "title": "Protect your enamel from chips and scratches.",
      "content": "Protect your enamel from chips and scratches. Don’t use abrasive sponges like steel wool, or metal objects such as spoon and forks with your enamel. If you are stacking enamel cookware, separate the items with rubber bumpers or another soft layer to avoid friction. [13] X Research source"
    },
    {
      "title": "Adjust the heat gradually.",
      "content": "Adjust the heat gradually. When heating enamel, warm and cool it gradually. Don’t start with high heat. Begin with your heat at a low temperature and gradually increase it to the desired heat. Allow cookware to cool slowly. Let it sit on the stove top or a cooling rivet before running cold water over it. Gradual temperature change helps avoid warping."
    },
    {
      "title": "Use enamel cookware only on conventional cook tops.",
      "content": "Use enamel cookware only on conventional cook tops. These include gas, electric, induction and ceramic cook tops. Do not use enamel cookware in microwaves or over open flames like grills and campfires. [14] X Research source"
    }
  ]
}