{
  "url": "https://www.wikihow.com/Control-Your-Feelings-Around-the-Person-You-Like",
  "title": "How to Control Your Feelings Around the Person You Like",
  "steps": [
    {
      "title": "Identify your feelings and their source.",
      "content": "Identify your feelings and their source. This can help you figure out whether or not your feelings like if your feelings are mutual or something more serious. It will also help you talk yourself through your feelings when you feel them. Is this infatuation? Lust? When you feel a warm blush start to spread across your face or a similar feeling, acknowledge the emotion, and positively talk yourself through it. [1] X Research source \"I'm just nervous because I think he's cute. I've been around other cute boys and it's no big deal. I'm going to be OK.\" \"I know that I sometimes get anxious around him. But that's alright; people sometimes get anxious around crushes. I'm going to do my best anyway.\""
    },
    {
      "title": "Root out fixation.",
      "content": "Root out fixation. Fixation occurs when you have an unhealthy obsession about the person that you like and are unable to see them as an imperfect human being. [2] X Research source When you are too fixated on a crush, it can put you in a situation in which you can be taken advantage. Beat fixation by first recognizing and acknowledging it and then restoring perspective by listening all the positive and negative points. [3] X Research source If you have difficulty doing this, talk with a trusted adult and ask them to help you."
    },
    {
      "title": "Write a journal.",
      "content": "Write a journal. Not only will writing a journal help you be physically healthier, it is also a safe place for you to vent your emotions. [4] X Research source Writing a journal will also give you the opportunity to clarify your thoughts and come to a deeper understanding of yourself, which could lead to you feeling more grounded when you run into that special someone."
    },
    {
      "title": "Allow yourself to feel your feelings.",
      "content": "Allow yourself to feel your feelings. It can be easy for you to feel embarrassed around the person you like, and this is completely natural. When you feel embarrassed or self-conscious, you might be tempted to hide your feelings, or to ignore them, which can lead you to feeling even less in control around your potential romantic partner. Try to act confidently natural when you're around your crush. Make eye contact, smile, and listen to what they're saying. Also, try not to fidget too much, since that can make you look more nervous. [5] X Expert Source Collette Gee Relationship Coach & Certified Violence Prevention Specialist Expert Interview. 1 May 2020."
    },
    {
      "title": "Take a brief break to regain composure.",
      "content": "Take a brief break to regain composure. When you are with others or in a situation where it isn't appropriate for you to express your feelings, you might be able to restore emotional control by removing yourself from the situation briefly. Simply excuse yourself and return when you feel better. Some ways to exit a social situation gracefully: Excuse yourself to the restroom. Tell your friends you need to step outside for some air. Explain that you are feeling restless and have decided to take a short walk."
    },
    {
      "title": "Tell your crush.",
      "content": "Tell your crush. This may seem like the last thing in the world that you want to do, but talking with the person you like about your feelings will get rid of the uncertainty that is amplifying your uneasiness. [6] X Research source Try to use soft language, as coming on too strong might make your crush uncomfortable. When talking with your crush, instead of saying, \"I love you,\" it may be best to say something like: \"I've been noticing lately that I really enjoy your company and I always have so much fun with you, so I was thinking if you're up for it we could go to a movie?\" Reader Poll: We asked 937 wikiHow readers about the best ways to ask out or confess feelings to a friend, and 81% agreed that it’s best to have a face-to-face conversation about your romantic interest. [Take Poll]"
    },
    {
      "title": "Coach yourself through difficult moments.",
      "content": "Coach yourself through difficult moments. There are going to be times when you feel especially self-conscious, whether because of circumstance or personal factors, and when this happens use your internal voice to guide yourself through the situation. Remind yourself that this is only a feeling, one that you'll likely have again if you haven't already, and tell yourself in encouraging words how you will proceed. An example you might consider: \"Alright. I'm really nervous, but that's OK. I've been nervous around guys I like before. I know I can get this work done, all I have to do is focus. So I'm going to turn my attention to this for a while, and I can think about him later.\""
    },
    {
      "title": "Breathe.",
      "content": "Breathe. When strong feelings threaten to overwhelm you, it is natural to respond unconsciously by taking shallow breathes. To improve your breathing, for a few breathes try to pay attention only to your inhale and exhale. This will restore your conscious attention to your body and its need for full, relaxed breathing. [7] X Research source"
    },
    {
      "title": "Practice thought saturation.",
      "content": "Practice thought saturation. When you find your thoughts returning over and over again to that particular person, you may benefit from a period of sustained thought about that person. For a set period of time, even 10 minutes can be enough, think only about that person. [8] X Research source Doing this can lessen the intensity of the feeling, leaving you calmer. Try not to think about your future together or what might come; focus your thoughts only on that person and their characteristics for the entirety of the time."
    },
    {
      "title": "Distract yourself.",
      "content": "Distract yourself. Sometimes, all you need is the right distraction to get your mind off your potential lover. Past happy experiences can restore perspective by interrupting the strong feelings you have for that person. [9] X Research source Think of past times when you've had fun, or a place where you feel safe and protected. Repeat a mantra that you find soothing. Some examples: \"Everything's going to be OK.\" \"I am calm, cool, and collected.\" \"With every breath, I release anxiety and become more calm.\" \"I overcome my fear and live life courageously.\""
    },
    {
      "title": "Find and combat triggers.",
      "content": "Find and combat triggers. In some situations, people become so nervous around those they like that they become clumsy or inarticulate. If this happens to you, find the trigger and think about how you might combat it. If you have difficulty talking to him, bring up a topic you're passionate or knowledgeable about. If you find that when he's around you're all thumbs, invite him for coffee or something that requires little dexterity."
    },
    {
      "title": "Write two letters.",
      "content": "Write two letters. Your first letter will celebrate your feelings and all the reasons why you feel the way you do. In your second letter, write all the worries, concerns, and sources of anxiety related to the person you like. Try to make a case for moving forward, after all, you are a worthy person regardless if your affections are returned."
    },
    {
      "title": "Condition opposite responses to negative thoughts.",
      "content": "Condition opposite responses to negative thoughts. Too often, people talk themselves into a negative loop that makes feelings more overwhelming with every passing instant. If you suffer with this condition, find out any automatic negative thoughts you have and interrupt those with an opposing positive thought. For example: \"If he doesn't like me I'll be so embarrassed and then people will think I'm a loser. Wait a minute. I had friends before I started liking him, so I know I'll have friends afterwards, too. I guess it's silly to put so much self-worth on this.\""
    },
    {
      "title": "Exaggerate your greatest fear.",
      "content": "Exaggerate your greatest fear. Tell the entire dramatic story playing in your head to yourself several times. Make sure you complete the story by taking it to its natural extreme. By the third or fourth time, you should be better able to recognize the absurdity of these extreme, yet natural, thoughts. \"If I ask him out on a date and he rejects me, everyone will talk about it forever. I'll never stop hearing, for the rest of my life, about the one time I asked this guy out. It will haunt me through college and my professional life, because everyone will already know.\" NOTE: this technique is intended to reveal warped perspective to the person using it. If you find yourself truly believing these things and unable to see how your perspective is off kilter, talk to an adult or a mental health professional."
    },
    {
      "title": "Reach out to your support group.",
      "content": "Reach out to your support group. Though feelings of embarrassment or the knowledge of your own infatuation might make you hesitant, sharing your feelings with those you trust can help you come to terms with the normalcy of your situation, and leave you feeling less isolated. Family members and trusted friends can be a great source of strength through the storm of romantic feelings you might now be suffering."
    }
  ]
}