{
  "url": "https://www.wikihow.com/Convert-Images-to-PDF",
  "title": "How to Convert Images to PDF",
  "steps": [
    {
      "title": "Open Start",
      "content": "Open Start . Click the Windows logo in the bottom-left corner of the screen. The Start menu will pop up. Alternatively, if you have a picture that you want to convert on your desktop or in another similarly accessible location, right-click the picture, select Open with , and click Photos to open the picture in the Photos app . You can skip to Step 5 if you do this."
    },
    {
      "title": "Type photos.",
      "content": "Type photos . This will search your computer for the Photos app, which is where all of your computer's pictures are stored."
    },
    {
      "title": "Click Photos.",
      "content": "Click Photos . It should be at the top of the Start menu."
    },
    {
      "title": "Select a picture to convert.",
      "content": "Select a picture to convert. Click a picture that you want to turn into a PDF to open the picture. If you want to create a PDF with more than one image in it, first click Select in the upper-right side of the Photos window, then click each photo that you want to add to the PDF. If you don't see the image you're looking for, click the More tab and select Folders . You can then click Add a folder and select the folder to which you've saved your photo so it will be indexed by the Photos app."
    },
    {
      "title": "Click the printer icon.",
      "content": "Click the printer icon. You will see this in the upper-right corner of the window. Alternative, you can press Ctrl + P to open the print dialog screen."
    },
    {
      "title": "Select Microsoft Print to PDF as the printer.",
      "content": "Select Microsoft Print to PDF as the printer. To do this, just click the drop-down menu at the upper-left corner of the window, and then choose this option. If it was already selected, there's no need to make any changes here. [1] X Research source"
    },
    {
      "title": "Click the Print button.",
      "content": "Click the Print button. It's at the bottom-left corner of the window. Don't worry, this won't actually print your document—it will virtually \"print\" it as a PDF file instead."
    },
    {
      "title": "Enter a file name.",
      "content": "Enter a file name. Type a name for your PDF into the \"File name\" text box near the bottom of the window."
    },
    {
      "title": "Select a save location.",
      "content": "Select a save location. Click a folder on the left side of the window to select it as your PDF's save location."
    },
    {
      "title": "Click Save.",
      "content": "Click Save . It's one of the two buttons in the bottom-right corner of the window. This saves your photo as a new PDF file. [2] X Research source"
    },
    {
      "title": "Open the image you want to convert in Preview.",
      "content": "Open the image you want to convert in Preview. To do this, just double-click the image on your computer—it will open in Preview by default. If the image opens in an app other than Preview, right-click (or press Control as you click) the image, choose Open with , and then select Preview . If you want to add more images to the current file that you plan to turn into a PDF, click the View menu at the top and select Thumbnails . Then, drag any additional photos you want to add to the sidebar. [3] X Research source If you want to rearrange the order of the images in the file, drag their thumbnails to the desired positions in the sidebar."
    },
    {
      "title": "Click the File menu.",
      "content": "Click the File menu. It's at the upper-left corner of the screen."
    },
    {
      "title": "Click Export on the menu.",
      "content": "Click Export on the menu. This opens options for exporting the document. If you are using newest version of macOS, you can also click on Export as PDF and then skip to Step 5 for saving the pdf version of image. [4] X Research source"
    },
    {
      "title": "Select PDF from the \"Format\" menu.",
      "content": "Select PDF from the \"Format\" menu. When you choose this option, you can also choose to encrypt the file by adding a password, or to add a Quartz filter (such as a sepia tone) to the final document. [5] X Research source"
    },
    {
      "title": "Name the document and click Save.",
      "content": "Name the document and click Save . This save the image(s) as a PDF file. [6] X Research source"
    },
    {
      "title": "Open the Photos app.",
      "content": "Open the Photos app. It's the multicolored flower icon on your home screen or in your App Library."
    },
    {
      "title": "Tap the photo you want to convert.",
      "content": "Tap the photo you want to convert . You can tap the Albums tab at the bottom first to browse by album, or select Library at the bottom-left to scroll through your camera roll. If you want to select multiple photos to add to your PDF, tap Select at the top-right corner of the screen, then tap each photo that you want to select."
    },
    {
      "title": "Tap the \"Share\" icon .",
      "content": "Tap the \"Share\" icon . It's the blue square with an arrow at the bottom-left corner of the screen. This opens the sharing menu."
    },
    {
      "title": "Tap Print on the sharing menu.",
      "content": "Tap Print on the sharing menu. If you don't see this option, swipe up on the sharing menu to display the options below the icons."
    },
    {
      "title": "Zoom in on the image preview to open it in PDF view.",
      "content": "Zoom in on the image preview to open it in PDF view. On the \"Printer Options\" page that expands, you'll see a preview of your image (or, if you selected multiple images, a preview of the first image). To view it as a PDF, place two fingers on the image preview and spread them away from one another—a reverse pinch motion. This opens the selected picture(s) in a PDF preview. If your iPhone has 3D Touch, you can press down on the preview to open it in a new window and then press down harder to open the PDF preview."
    },
    {
      "title": "Tap the \"Share\" icon .",
      "content": "Tap the \"Share\" icon . This time, you'll see this blue square with an up-arrow at the top-right corner. in the top-right corner of the screen. This will open a menu at the bottom of the screen."
    },
    {
      "title": "Tap Save to Files.",
      "content": "Tap Save to Files . This option icon is in the bottom row of the menu. If you don't see it, swipe up on the sharing menu first. [7] X Research source"
    },
    {
      "title": "Select a save location.",
      "content": "Select a save location. First, you'll notice that the top of the screen says \"Photo.pdf\" will be saved to (location).\" That means your iPhone now knows to create a PDF from the selected photo(s). Choose the location on your iPhone or iPad where you'd like to save the PDF. If you have iCloud Drive enabled, you can select it as your saving location instead of your iPhone or iPad. [8] X Research source No matter where you save the image, you can create a new folder by tapping the folder icon with a plus sign in the upper-right corner if you'd like."
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . It's at the top-right corner of the screen. This saves the PDF to the selected location."
    },
    {
      "title": "Download the Image to PDF Converter app from the Play Store .",
      "content": "Download the Image to PDF Converter app from the Play Store . Type image to pdf converter into the search bar and press Enter . Scroll down and select the app called Image to PDF Converter that has a black icon with a green sheet of paper, the word \"PDF,\" and an arrow. The developer is DLM Infosoft. [9] X Research source Tap INSTALL ."
    },
    {
      "title": "Open Image to PDF Converter.",
      "content": "Open Image to PDF Converter. Tap OPEN in the Google Play Store once the app finishes downloading, or tap the \"Image2PDF\" icon in your Android's app list—it's the same black-and-green icon you saw before."
    },
    {
      "title": "Tap the plus button ＋.",
      "content": "Tap the plus button ＋ . It's at the bottom-right corner."
    },
    {
      "title": "Tap Gallery.",
      "content": "Tap Gallery . This tells the app to open your image gallery. If it's your first time using the app, you'll be asked to give it permission to access files on your Android first."
    },
    {
      "title": "Tap the image(s) you want to convert.",
      "content": "Tap the image(s) you want to convert. You can select one or more images to add to your PDF. You should see a checkmark appear at the center of each selected picture."
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . It's at the top-right corner. This prepares a PDF document containing the selected image(s)."
    },
    {
      "title": "Tap the PDF icon.",
      "content": "Tap the PDF icon. It's a white sheet of paper with a red design (the Adobe logo), and you'll see in the upper-right corner of the screen."
    },
    {
      "title": "Enter the PDF details.",
      "content": "Enter the PDF details. Type a name for the PDF into the top field. Then, you can make some optional adjustments, such as locking the file with a password or compressing it to a smaller size."
    },
    {
      "title": "Tap OK to save the file.",
      "content": "Tap OK to save the file. It's at the bottom-right corner of the window. This saves the PDF to a folder called DLMImageToPdf in your Android's default storage location. You'll be taken to this location immediately once the file is created."
    }
  ]
}