{
  "url": "https://www.wikihow.com/Cancel-Aflac",
  "title": "How to Cancel Aflac: Individual & Employer-Provided Policies",
  "steps": [
    {
      "title": "Reach out to your Aflac agent directly for the easiest cancelation.",
      "content": "Reach out to your Aflac agent directly for the easiest cancelation. Call your Aflac agent or schedule an appointment at their office and let them know that you want to cancel your policy. Provide your agent with the type of coverage and the policy numbers for what you want to cancel. Your agent will walk you through any processes that you need to follow to easily end your coverage, but they will be able to handle the majority of the work for you. Your coverage will last until the end of the month before it gets canceled. If you cancel Aflac life insurance and it has a cash value, you will receive that amount back when your policy ends."
    },
    {
      "title": "Call 1-800-992-3522 if you want to cancel your coverage over the phone.",
      "content": "Call 1-800-992-3522 if you want to cancel your coverage over the phone. Once you dial the number, follow the prompts so you can speak to a representative to manage your policy. Say that you wish to cancel your policy and follow any instructions they have for you. Have your policy number and personal information ready so you can tell them to the representative. Usually, the representative will be able to cancel your policy within about 15–20 minutes. [1] X Research source You can call the Customer Service Center 24 hours a day at any time during the year. You will have coverage until the end of the month that you canceled your insurance."
    },
    {
      "title": "Fill out the Customer Service contact form if you want to cancel Aflac online.",
      "content": "Fill out the Customer Service contact form if you want to cancel Aflac online. Provide your personal information, like your full name, address, birthday, and email address, so Customer Service can reach out to you with any other comments or questions. Include the policy number for the account you want to close and select “Billing Question/Request” from the dropdown menu for the request type. Submit the form when you’re finished and wait for a response back from a representative to continue the process. [2] X Research source You can find the customer service form here: https://www.aflac.com/contact-aflac/contact-customer-service.aspx . Your coverage should cancel at the end of the month when you made your request. If you don’t hear back from Aflac before that, talk to your agent or call the Customer Support line to find out the status of your account."
    },
    {
      "title": "Wait until an insurance open enrollment period to cancel your account.",
      "content": "Wait until an insurance open enrollment period to cancel your account. An open enrollment period refers to a 4–6 week period where you can opt in for new healthcare options. While you can cancel a policy at any time, you won’t be able to sign up for a new plan until the next enrollment dates. Typically, the open enrollment period occurs in November or December so you can apply for insurance for the following year. [3] X Research source You will be able to sign up outside of an enrollment period if you’ve recently gotten married, divorced, or gained a new dependent."
    },
    {
      "title": "Get a Request of Cancelation form from your employer’s HR department.",
      "content": "Get a Request of Cancelation form from your employer’s HR department. Unlike an individual policy, you need to alert your employer if you plan on canceling insurance through them. Reach out to your employer’s human resource office and let them know that you want to cancel the Aflac insurance policy that you have from them. The HR department will have printed forms to give you that allow you to cancel your service. You can also find a generic form to use here: https://webordering.aflac.com/PDF/M0784.PDF . Forms may vary between employers."
    },
    {
      "title": "Fill out the form with your personal and policy information.",
      "content": "Fill out the form with your personal and policy information. Use black or blue ink when you fill out the form so it’s easy to read. Put in your name, Social Security number, and any other information the form asks for. Write down the types of coverage and the numbers for each policy you want to cancel before you sign and date the bottom of the document. [4] X Research source Write as legibly as you can so there’s no confusion when you submit your forms. If you don’t know your policy numbers, you can find it on old bills you’ve paid or you may call Aflac’s customer service support at 1-800-992-3522."
    },
    {
      "title": "Have your employer sign the form if you have pre-tax deductions.",
      "content": "Have your employer sign the form if you have pre-tax deductions. Pre-tax deductions are taken from your wages before they charge taxes so they affect your amount of taxable income. Take the form to your employer and tell them that you want to cancel your Aflac coverage so they can change tax information accordingly. [5] X Research source You also need a signature from your employer if you’re making changes to your insurance information due to marriage, divorce, or change in dependents outside of an enrollment period."
    },
    {
      "title": "Return the form to the HR department or the Aflac Policyholder Services.",
      "content": "Return the form to the HR department or the Aflac Policyholder Services. Take the completed form back to your company’s HR representative and let them review the information. The department will then send or fax the information to an Aflac office so they can cancel your account. If your HR department wants you to send the form directly to Aflac, then you can address an envelope to Aflac Policyholder Services, 1932 Wynnton Road, Columbus, GA 31999. [6] X Research source Your policy will cancel at the end of the month you requested on the form if you had post-tax deductions, or on January 1st of the following year if you had pre-tax deductions. Aflac won’t be able to process your information if any of it is incomplete or missing."
    }
  ]
}