{
  "url": "https://www.wikihow.com/Convince-Yourself-That-You-Can-Do-Something",
  "title": "How to Convince Yourself That You Can Do Something",
  "steps": [
    {
      "title": "Create an argument as to why the task should be done.",
      "content": "Create an argument as to why the task should be done. Research shows that the best way to convince yourself of something is to develop a strong argument. It seems people will put in more effort to convince themselves of something they do not believe in than they will for things they already believe in. [1] X Research source Therefore, if you want to convince yourself to do something, you need to develop a strong premise for doing it. Grab a sheet of paper and make a list of all the pros for doing this. For example, if you're trying to convince yourself that you can earn a college degree, you might list out increase your skills within a certain industry, get job prep and training, network with industry leaders within the field (e.g. professors and other students), and earn a broad worldview. Think of all the benefits you stand to gain by doing this and list them out. Then, go over this list aloud, telling yourself why this task is so important. Repeat these benefits daily or whenever you need motivation."
    },
    {
      "title": "Assess what skills you have to complete the job.",
      "content": "Assess what skills you have to complete the job. Sometimes, we argue ourselves out of doing something by giving all the ways we are unfit to carry out the task. Anticipate and counteract this issue by figuring out all the ways you are exactly the right person to do the task. [2] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source For instance, in the case of going to college, you can cite your grades, leadership abilities, extracurricular involvement, writing and speaking skills all as potential assets for helping you earn your degree. These are all strengths that you can identify to increase your resolve and boost your confidence for actually going through with it. [3] X Expert Source Adrian Klaphaak, CPCC Career Coach Expert Interview. 18 December 2018. If you are having trouble identifying your strengths, seek input from others. Talk to a parent, teacher, boss, or friend who can expound on some of your positive traits."
    },
    {
      "title": "Educate yourself about what is required.",
      "content": "Educate yourself about what is required. [4] X Expert Source Adrian Klaphaak, CPCC Career Coach Expert Interview. 18 December 2018. One potential reason you may not believe you can do something is your tendency to overestimate what it takes to do it. You encounter an unknown and you simply assume that the task is too hard or impossible to achieve. However, getting more information or clarifying what you already do know can help the task seem more feasible. Here are some ways you can become more educated about the task: Conduct research. Finding out all the information out there about a given topic boosts your knowledge-base and improves your confidence about doing it. Ask someone who has done it. Talking to someone else about the task can allow you to have questions answered and some of your concerns alleviated. Shadow someone who is currently doing it. Actually seeing another person completing a task helps you to know exactly what steps are taken to execute it. Plus, the person may not have any special skills or training in the task. If he can do it, so can you. [5] X Expert Source Adrian Klaphaak, CPCC Career Coach Expert Interview. 18 December 2018."
    },
    {
      "title": "Lay out the steps as if you were teaching them to someone else.",
      "content": "Lay out the steps as if you were teaching them to someone else. Once you have educated yourself on what it takes to complete this task, outline these steps for someone else. Learning through experience is one of the most thorough ways to solidify your knowledge of a topic. [6] X Research source By teaching someone else, you can confirm that you have a firm grasp on what you're talking about. Be sure the other person has the ability to comprehend and ask questions about the specific topic. If you can outline what needs to be done, and answer any clarifying questions that the other person poses, you are probably equipped to take on the task."
    },
    {
      "title": "Repeat a powerful mantra.",
      "content": "Repeat a powerful mantra. Your knowledge of mantra may be the sounds that are recited during yoga or meditation. Your line of thinking is correct, but also limited. A mantra can be any phrase that energizes and transforms your thinking. These words are positive utterances that position you in a place of success. Mantras can be anything from single words to empowering quotes, such as \"Either I will find a way, or I will make one.\" Find words that motivate you and repeat them frequently throughout your day."
    },
    {
      "title": "Examine the lives of people you admire.",
      "content": "Examine the lives of people you admire. Role models aren't just for children or young adults. No matter your age, you can learn and receive inspiration from someone else. Look for a teacher, coworker, boss, or public figure who leads a life that you find admirable. Watch this person and learn from their actions. When you are led by someone with strong ethics, you will behave more positively in your own life. [7] X Research source But, this leadership does not have to come from someone you know. You can be inspired by world leaders, authors, and entrepreneurs. Pick up a book or watch a documentary about this person's life and learn what he or she has experienced on the journey to success. [8] X Research source"
    },
    {
      "title": "Spend time with others who believe in you.",
      "content": "Spend time with others who believe in you. [9] X Expert Source Adrian Klaphaak, CPCC Career Coach Expert Interview. 18 December 2018. Believing in yourself is truly exhilarating. But, when you are short on motivation, it can be highly motivating to be around others who do believe in you. [10] X Research source Recognize that the people you spend the most time with are heavily influencing your life--whether positively or negatively. Choose to surround yourself with people who pour into your cup, and with whom you can, in return, support and encourage."
    },
    {
      "title": "Visualize success.",
      "content": "Visualize success. [11] X Research source Visualization is a mental practice in which you activate your imagination and senses to reach a particular state. Visualization helps you to train your brain for real performance. [12] X Research source Therefore, its usefulness is unparalleled when it comes to achieving success. To use visualization, establish what it is you want to achieve. Then, see yourself at the finish line. This might be your dream career or after a major weight loss. Think about the sensations associated with the success. Who is with you? What thoughts are going through your head? What are your emotions? What sounds do you hear? What smells? Practice this exercise daily, in the morning or at night."
    },
    {
      "title": "Commit to working for a short amount of time.",
      "content": "Commit to working for a short amount of time. You can easily become overwhelmed by a huge task if you think about it in terms of how long it will take you. However, to be most productive, less time allotted to a task can produce greater results than more. In fact, researchers demonstrate a cycle called the ultradian rhythm in which your body goes from levels of high alertness to lower ones. [13] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Tell yourself you will work for 90 minutes on a certain task, then have a break. Doing this gives you the chance to work with clear and reflective thinking and then give yourself time to rest and rejuvenate before starting a new increment of work. In order to do this, you must prepare to complete tasks ahead of time. Therefore, you are not forced to work for long hours on end."
    },
    {
      "title": "Identify your values and beliefs.",
      "content": "Identify your values and beliefs. [14] X Research source Lacking an understanding of your personal values is like going on a trip without a GPS or a map of any kind. Values help us navigate through different circumstances, so that we lead a life that is personally fulfilling. [15] X Expert Source Adrian Klaphaak, CPCC Career Coach Expert Interview. 18 December 2018. To figure out some of your personal values, answer the following: Which individuals have your greatest respect? What traits do they hold that you admire and why? If your home were on fire (any people and animals are already considered safe), what 3 objects would you save and why? What moments in your life were incredibly satisfying? What about the moment made you feel satisfied?"
    },
    {
      "title": "Set goals that align with your personal values.",
      "content": "Set goals that align with your personal values. After you have narrowed down a short list of important values, you must develop S.M.A.R.T goals that support these values. Once you have developed goals that allow you to live out your values, do one thing that lets you move toward these goals daily. S.M.A.R.T. goals are: Specific - clearly answer the \"who, what, when, where, which, and why\" Measurable - outline how you will assess your progress towards the goal Attainable - able to be achieved with the resources, skills, and abilities you have Realistic - the goal provides a challenge but also represents an objective that you are both willing and able to meet Timely - the determined time-frame must be feasible, while including some urgency"
    },
    {
      "title": "Eliminate excuses.",
      "content": "Eliminate excuses. The most common mental barriers to getting things done are often what we are telling ourselves on a daily basis. If asked why you haven't reached a particular goal, your response is because all the variables are not perfectly in place. These are excuses and you must remove them from the equation in order to achieve your goals. [16] X Research source Remove excuses by getting serious with yourself. Whatever you are using as an excuse is probably just a way to protect yourself from having to change. Setting SMART goals should help you to alleviate some of your excuses. For others, such as not having time, money, or resources, closely examine your life to determine what you can afford to cut out. Remove an insignificant activity or cost to prioritize a significant one. [17] X Research source Don't wait until all the variables fall magically into place. Purposefully change your life so that it supports you reaching your goals."
    }
  ]
}