{
  "url": "https://www.wikihow.com/Clean-Under-Your-Fingernails",
  "title": "The Best Way to Clean Dirt Out From Under Your Nails Fast",
  "steps": [
    {
      "title": "Get an orange stick.",
      "content": "Get an orange stick. Orange sticks are wooden sticks that have a point on one end and a sloping flat edge on the other side, similar to a flat head screwdriver. You can find them in the beauty department near the nail care items. Alternatively, use a wet wipe wrapped around a manicure stick or an eyelash spoolie to clean under your fingernails. You can also use a cuticle pusher or a clean toothpick, but they are harder to use than the orange stick. [1] X Research source"
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. Start by clearing away dirt and excess oil. Scrub your hands under warm water, paying special attention to under your nails. Wash away as much of the grime as you can using the soap and water. Turn your hands so that the water runs over the underside of your nails. Pull back your fingers and work the soap under your nails using the pads of your fingers. Pat your hands dry when you finish. It will be hard to use an orange stick if your hands are wet."
    },
    {
      "title": "Push the edge of the orange stick under your fingernail.",
      "content": "Push the edge of the orange stick under your fingernail. Gently press the stick under your nail, being careful not to break the skin. You need to go as deep as you can without separating the skin from the nail. If you do, then you’ll create a haven for dirt and bacteria. [2] X Research source You may find it easier to use the pointed end to remove the grime under your nails; however, it is riskier to use the pointed end because you may accidentally break the skin."
    },
    {
      "title": "Slide the orange stick under the nail.",
      "content": "Slide the orange stick under the nail. Start at one corner of your finger and gently insert the edge of the orange stick. Press it down until you feel resistance from your finger. [3] X Research source"
    },
    {
      "title": "Push the dirt and debris out from under your nail.",
      "content": "Push the dirt and debris out from under your nail. Move the orange stick from one corner to the other. Wipe the grime onto a napkin and repeat until the orange stick comes away clean. [4] X Research source"
    },
    {
      "title": "Get a nail brush.",
      "content": "Get a nail brush. Nail or manicure brushes are great for cleaning under your fingernails. These brushes are slim and rectangular with soft bristles. They are similar to a toothbrush, but they are larger and don’t have a long handle. You can find them in the beauty supply section of most department stores. [5] X Research source You can use a nail brush daily in the shower instead of doing a full cleaning. [6] X Research source You can use a clean toothbrush instead of a nail brush. [7] X Research source"
    },
    {
      "title": "Mix soap into warm water.",
      "content": "Mix soap into warm water. Add soap to a bowl of warm water and stir until they are well blended. You can use any kind of soap, but liquid soap blends better. [8] X Research source"
    },
    {
      "title": "Dip the nail brush in soapy water.",
      "content": "Dip the nail brush in soapy water. Submerge the brush so that the bristles hold onto water. The brush needs to be wet in order to get your nails clean. [9] X Research source"
    },
    {
      "title": "Angle the brush downward.",
      "content": "Angle the brush downward. Hold your hand up, with the brush pointed down. Push the bristles under your nail. [10] X Research source You can brush under each nail individually or across all four nails of your index finger through your pinky finger at one time. Brushing them individually takes more time but gets them cleaner. You can also brush the front side of your nails for extra cleaning."
    },
    {
      "title": "Brush side-to-side.",
      "content": "Brush side-to-side. Scrub under your nail to remove stubborn grime. Dip the brush back into the water regularly to clean the brush and add more soapy water. [11] X Research source Continue brushing under each fingernail until all of them are clean. Rinse the brush in the water before changing fingers. It'll be easier to clean under your fingernails after a bath or shower, as the warm water will have softened the debris."
    },
    {
      "title": "Put toothpaste onto your nail brush.",
      "content": "Put toothpaste onto your nail brush. Add a pea-sized amount of toothpaste to your nail brush. Work the toothpaste into the brush bristles for a more even application. [12] X Research source Choose a whitening toothpaste. It’s okay to add more toothpaste if you want."
    },
    {
      "title": "Rub the toothpaste under your nails.",
      "content": "Rub the toothpaste under your nails. Just as you did when you cleaned your nails with the brush, scrub under your nails to apply the toothpaste. Make sure that a thin layer of toothpaste remains under your nail. [13] X Research source"
    },
    {
      "title": "Leave the toothpaste under your nails for three minutes.",
      "content": "Leave the toothpaste under your nails for three minutes. The toothpaste needs time for the whitening action to work. After the three minutes, wash the toothpaste from your fingernails. [14] X Research source"
    },
    {
      "title": "Add lemon juice to a bowl.",
      "content": "Add lemon juice to a bowl. Squeeze the juice from two lemons, or use a container of lemon juice. Do not add water to your lemon juice. [15] X Research source You will just need enough lemon juice to soak your fingertips. You can find pre-squeezed lemon juice in the grocery store."
    },
    {
      "title": "Let your hands soak for ten minutes.",
      "content": "Let your hands soak for ten minutes. Leave your fingertips in the bowl to give the lemon juice time to whiten your nails. After the ten minutes, rinse your hands in clean water. [16] X Research source"
    },
    {
      "title": "Make a baking soda paste.",
      "content": "Make a baking soda paste. Pour two tablespoons (30 milliliters) of baking soda into a bowl. Add enough warm water to make a thick paste. [17] X Research source If you accidentally put in too much water, it’s ok to add some more baking soda to thicken the paste."
    },
    {
      "title": "Apply the baking soda paste.",
      "content": "Apply the baking soda paste. Smooth the paste under your fingernails. Allow it to sit for five minutes before washing it off with warm water. [18] X Research source"
    },
    {
      "title": "Wash your hands and apply lotion.",
      "content": "Wash your hands and apply lotion. Use soap and water to clean away any remaining residue from the whitening treatments. After you dry your hands, apply a moisturizing hand cream. [19] X Research source"
    }
  ]
}