{
  "url": "https://www.wikihow.com/Add-a-Device-to-Google-Play-on-iPhone",
  "title": "How to Add a Device to Google Play on iPhone",
  "steps": [
    {
      "title": "Open Settings.",
      "content": "Open Settings. This app icon features some gears on a light grey background. [1] X Research source"
    },
    {
      "title": "Tap Mail.",
      "content": "Tap Mail . You'll find this next to an icon of a white envelope on a light blue background. Alternatively, you can tap Contacts to add your Google account without email."
    },
    {
      "title": "Tap Add Account.",
      "content": "Tap Add Account . You may need to tap Accounts first to see this option. [2] X Research source"
    },
    {
      "title": "Tap Google.",
      "content": "Tap Google . Since you're adding a Google account, you'll want to tap Google to continue. [3] X Research source"
    },
    {
      "title": "Enter your Google account email address and tap Next.",
      "content": "Enter your Google account email address and tap Next . You can also tap Create account if you don't have a Google account already."
    },
    {
      "title": "Enter your password and tap Next.",
      "content": "Enter your password and tap Next . If you're not sure if you typed it correctly, tap the box next to \"Show password\" to reveal what you've entered."
    },
    {
      "title": "Choose what data you want to sync with your Google account.",
      "content": "Choose what data you want to sync with your Google account. If you have an email address with Google, you'll most likely want to tap the toggle next to Mail so your mail syncs. If you're just adding a Google account to use Google Play apps, you don't need to sync anything here. [4] X Research source"
    },
    {
      "title": "Go to your Google Play payment methods.",
      "content": "Go to your Google Play payment methods . You can use any desktop or mobile web browser to navigate to this page."
    },
    {
      "title": "Click or tap Add a payment method.",
      "content": "Click or tap Add a payment method . You'll see this at the bottom of the page next to a + icon. [5] X Research source"
    },
    {
      "title": "Select your payment type.",
      "content": "Select your payment type. You're offered to add a credit or debit card, PayPal, or redeem a code."
    },
    {
      "title": "Follow the on-screen instructions to add your payment method.",
      "content": "Follow the on-screen instructions to add your payment method. If you opted to add a PayPal account, you'll be redirected to PayPal to approve the changes before you can continue. If you selected to add a credit or debit card or redeem a code, you'll need to enter the information on your screen, which may include a card number and expiration date, or a promo code. Once you're done, that payment method will be used any time you make a purchase via a Google Play app, like Google Play Books. [6] X Research source"
    },
    {
      "title": "Navigate to The Google Play Store.",
      "content": "Navigate to The Google Play Store . Since the Google Play apps (like Google Play Books) don't support in-app purchases on iOS, you'll need to use an Android or a computer web browser to navigate to the store and make purchases."
    },
    {
      "title": "Select the Store you want.",
      "content": "Select the Store you want. Using the panel on the left side of the page, you can decide if the content you want to purchase is in Movies & TV or Books ."
    },
    {
      "title": "Go to the content you want to purchase.",
      "content": "Go to the content you want to purchase. You can browse categories like \"New Releases\" or use the search bar at the top of your page to search for the content you want."
    },
    {
      "title": "Click or tap the purchase button.",
      "content": "Click or tap the purchase button. What this says depends on the type of content you're looking at. For example, a movie will give you the options to Rent or Buy and then give you the SD or HD options for quality. Meanwhile, a book has a (price) ebook button instead."
    },
    {
      "title": "Open the App Store.",
      "content": "Open the App Store. This app icon looks like three popsicle sticks forming an \"A.\""
    },
    {
      "title": "Download \"Google Play Movies & TV\" and \"Google Play Books.",
      "content": "Download \"Google Play Movies & TV\" and \"Google Play Books. \" These two apps are the Google Play apps that you can use on an iPhone or iPad. [7] X Research source You can tap the search tab at the bottom of your screen to search for these apps instead of browsing for them."
    },
    {
      "title": "Open Google Play Movies & TV or Google Play Books.",
      "content": "Open Google Play Movies & TV or Google Play Books. As long as you used the same Google account that these two apps are using and the one that purchased the content, it will appear in these apps. You can watch or read the content you purchased using an Android or computer. [8] X Research source Since you've already added a Google account to your iPhone , you shouldn't need to log in again, but if you do, make sure it's the same account that purchased the content (from Movies & TV or Books)."
    }
  ]
}