{
  "url": "https://www.wikihow.com/Clean-Faucet-Aerator",
  "title": "Easy Steps for Cleaning a Faucet Aerator",
  "steps": [
    {
      "title": "You can take off the aerator by hand or by using a wrench.",
      "content": "You can take off the aerator by hand or by using a wrench. The aerator is usually a small cylinder on the end of your faucet. Try turning the aerator by hand to see if you can easily unscrew it. If you can’t get it off by hand, put a piece of masking tape around the aerator. Grip the aerator with a pair of pliers and turn it to loosen it. Masking tape keeps you from scratching the aerator with your tools. If you don’t see the aerator, then it’s hidden inside the end of the faucet. Push a faucet aerator key wrench into the end of the faucet and turn it to unscrew the aerator. Put a towel in the bottom of your sink or plug the drain so you don’t lose any pieces if they fall down. [1] X Research source"
    },
    {
      "title": "Taking apart the aerator lets you thoroughly clean each piece.",
      "content": "Taking apart the aerator lets you thoroughly clean each piece. Aerators usually come apart in 3 pieces: a rubber washer, a mesh screen, and a cylindrical metal housing. Take each of the individual pieces off the aerator and arrange them in the order you took them off. [2] X Research source Snap a picture of the aerator as you take it apart so you can remember how to put it back together later on."
    },
    {
      "title": "Removing the buildup caught in the screen improves your water pressure.",
      "content": "Removing the buildup caught in the screen improves your water pressure. Debris can get into your tap water from the pipes, but the mesh aerator screen catches it before it reaches your glass. Hold the screen upside-down under running water and tap the sides to clean out the residue. You can still use the faucet after you take the aerator off. Just avoid drinking the water until you finish cleaning the aerator since it could contain residue from your pipes."
    },
    {
      "title": "White vinegar breaks down tough residue stuck in your aerator.",
      "content": "White vinegar breaks down tough residue stuck in your aerator. Fill a small bowl or cup with white vinegar and set the pieces of your aerator inside. Most of the residue should loosen up after about 5 minutes, but you can leave it in for longer if the screen and pieces are really gunked up. [3] X Trustworthy Source State of Michigan Official website for the State of Michigan Go to source If you can’t get the aerator off of the faucet, fill a plastic bag with vinegar. Put the end of the faucet inside the bag. Secure the bag to the faucet with a rubber band and let it sit for 20 minutes. If you don’t have vinegar, you can instead use a calcium, lime, and rust remover ."
    },
    {
      "title": "The bristles on a toothbrush break apart any leftover gunk in the aerator.",
      "content": "The bristles on a toothbrush break apart any leftover gunk in the aerator. Wet the bristles of the toothbrush and gently scrub each of the aerator pieces. Give the aerator pieces one final rinse under clean water to get rid of the residual gunk and vinegar. Hold the mesh screen up to a light and check for any dark spots that are still clogged with debris. Scrub the mesh a little more with your toothbrush before rinsing it again."
    },
    {
      "title": "Assembling the pieces in order ensures your aerator works properly again.",
      "content": "Assembling the pieces in order ensures your aerator works properly again. Put the pieces together in the same order that you took them apart to ensure the aerator works properly. Once you’ve got all the pieces back together, just screw it back onto the end of your faucet until it’s hand-tight. Turn on your faucet to make sure it’s working properly. If the water doesn’t come out through the aerator, take it off and try reassembling it again."
    },
    {
      "title": "Checking the aerator twice a year helps stop buildup from forming.",
      "content": "Checking the aerator twice a year helps stop buildup from forming. The next time you deep clean your sink, take a few minutes to unscrew the aerator from your faucet and quickly check it for debris. Give it a quick rinse and scrub before you put it back on your faucet. [4] X Trustworthy Source State of Michigan Official website for the State of Michigan Go to source Clean out the aerator once a month if you’re having work done on your plumbing or water line."
    },
    {
      "title": "It’s easier to get a replacement aerator than trying to fix an old one.",
      "content": "It’s easier to get a replacement aerator than trying to fix an old one. If the rubber washer looks cracked or if the mesh screen has holes, it’s time to get a new aerator. Get an aerator that’s the same size and style as the old one to make sure that it fits onto your faucet. [5] X Research source"
    }
  ]
}