{
  "url": "https://www.wikihow.com/Clean-a-Trumpet",
  "title": "The Best Way to Clean a Trumpet",
  "steps": [
    {
      "title": "Pull out all of the slides from your trumpet.",
      "content": "Pull out all of the slides from your trumpet. Your trumpet has 4 slides that you can easily pull off by hand. Carefully grip the end of the slide and pull it straight off of your trumpet. Set the slides on a towel once you remove them. [1] X Research source The tuning slide is the largest piece that connects directly to the lead pipe, which is where you attach the mouthpiece. The first valve slide is on the back of the trumpet on the right side. It connects the first cylindrical valve casing. The second valve slide is the short piece sticking out from the middle valve on the right side of the trumpet. The third valve slide is on the left side of the trumpet. You may need to unscrew a set screw on the slide to remove it completely. Take a picture of your trumpet before you take it apart so you can easily remember where the pieces fit when you reassemble them. If the slides are stuck, don’t try to force them out since you could damage your trumpet. Take your horn to a music shop to have a professional remove them for you."
    },
    {
      "title": "Unscrew and remove the valves and valve caps.",
      "content": "Unscrew and remove the valves and valve caps. The valves are the 3 cylindrical pieces with the buttons in the middle of your trumpet. One at a time, unscrew the top caps on the valves and carefully pull them straight out. Lay the valves gently on your towel. Then unscrew the caps on the bottoms of the valve casings as well. [2] X Research source Most valves are numbered 1, 2, or 3 so you remember where to put them back. If your valves don’t have numbers, lay them out in the same order you took them out of your trumpet. Trumpet valves are hollow and very fragile, so be careful not to scratch or dent them."
    },
    {
      "title": "Take out your trumpet’s mouthpiece.",
      "content": "Take out your trumpet’s mouthpiece. Hold your trumpet in your non-dominant hand and grip the mouthpiece with your dominant hand. Turn the mouthpiece counter-clockwise and pull it straight out to take it off. [3] X Research source If your mouthpiece is stuck in your trumpet, avoid trying to force it out since you could damage the horn. You can clean your trumpet with the mouthpiece attached, but take it into a music shop to have a professional remove it when you can."
    },
    {
      "title": "Put a towel in your tub and fill it with sudsy water.",
      "content": "Put a towel in your tub and fill it with sudsy water. You don’t want your trumpet to scratch the finish on your tub when you wash it, so lay down a towel. [4] X Research source Then, turn your faucet on and add about 4 inches (10 cm) of water to your tub, which is enough to completely submerge your trumpet. Add in a squirt of mild dish soap and mix it up until the water is sudsy. If you don’t have a bathtub, use a large plastic tote bin instead."
    },
    {
      "title": "Soak your trumpet, mouthpiece, and slides for 15–30 minutes.",
      "content": "Soak your trumpet, mouthpiece, and slides for 15–30 minutes. Lower your trumpet, mouthpiece, and slides into the water, and place them on the towel. Leave your trumpet in the tub so the water can work through the tubing and break apart any residue that’s stuck inside. [5] X Research source"
    },
    {
      "title": "Run a snake brush through the slides and trumpet tubing.",
      "content": "Run a snake brush through the slides and trumpet tubing. A snake brush has stiff bristles attached to a wire so it can easily move through your trumpet. Feed the end of the brush into the tubing on your trumpet and slowly push it through to the other side so you can pull it out. Work the snake brush through all of the open tubing on your trumpet. Then, pull the brush through each of the slides. Be careful not to force the snake brush around curves if it gets stuck since it could get stuck or break. You can get a trumpet cleaning kit that has all the brushes and supplies you’ll need to take care of your instrument. Avoid running a snake brush through the vertical valve casings since it could leave scratches that affect the sound of your trumpet. If you don’t have a snake brush, then just scrape out any visible dirt in the tubing with a cotton swab or toothpick."
    },
    {
      "title": "Use a valve casing brush to scrub inside the casings.",
      "content": "Use a valve casing brush to scrub inside the casings. A valve casing brush is cylindrical and has softer bristles than a snake brush. Push the brush through the 3 vertical valve casings and gently spin it to remove any gunk or build-up inside. [6] X Research source If you don’t have a valve casing brush, then set a clean cotton cloth on top of the casing. Push the cloth through the casing with a pencil to wipe the insides."
    },
    {
      "title": "Scrub the inside of the mouthpiece with a mouthpiece brush.",
      "content": "Scrub the inside of the mouthpiece with a mouthpiece brush . A mouthpiece brush has a tapered cone shape so it easily fits into either end of your mouthpiece. Push the brush into your mouthpiece and spin it around to remove any residue inside. Then, move the brush back and forth through the mouthpiece to scrub it more thoroughly. If you don’t have a mouthpiece brush, then scrape out any residue with a toothpick."
    },
    {
      "title": "Rinse all the pieces with clean water.",
      "content": "Rinse all the pieces with clean water. Empty your tub to drain the soapy water. You can either fill your tub with clean water and dunk each of the trumpet pieces or use a cup to pour fresh water over and into each piece. Keep rinsing your trumpet until you don’t see any more suds. [7] X Research source If you pour water through your trumpet, it may come out of any of the slide openings, so be careful not to get yourself wet."
    },
    {
      "title": "Wipe water off your trumpet pieces and let them air-dry.",
      "content": "Wipe water off your trumpet pieces and let them air-dry. Use a soft cotton cloth to pat all of the excess water off of your trumpet, slides, and mouthpiece. Set your trumpet and all the pieces on a towel in a well-ventilated area so it can air-dry completely, which should take about an hour. [8] X Research source Shake your trumpet and the slides to help get excess water out from the inside."
    },
    {
      "title": "Soak the bottom halves of the valves and caps for 10 minutes in soapy water.",
      "content": "Soak the bottom halves of the valves and caps for 10 minutes in soapy water. Fill a cup halfway with water and add a squirt of dish soap. Submerge the pistons, which are the bottom sections of the valves that have holes, in the water and leave them to sit for at least 10 minutes to break up residue that’s stuck on them. [9] X Research source Avoid getting the tops of the valves or the buttons wet since the water could damage the felt or cork pieces inside."
    },
    {
      "title": "Clean inside the valve pistons with a soft cotton cloth.",
      "content": "Clean inside the valve pistons with a soft cotton cloth. After 10 minutes, pull out the valves one at a time from the cup. Carefully rub the valve pistons with the cloth to gently scrub any gunk that’s still stuck on them. Use the corner of the cloth to clean inside the holes as well. Avoid using a snake brush to clean your valves since you could leave scratches that affect the sound of your trumpet."
    },
    {
      "title": "Wipe out the valve caps with a damp paper towel.",
      "content": "Wipe out the valve caps with a damp paper towel. Pull the valve caps out from the cup and rub the insides with your paper towel. Continue cleaning out the valve caps until you don’t see any more residue lift up. [10] X Research source"
    },
    {
      "title": "Rinse the valves and valve caps with clean water.",
      "content": "Rinse the valves and valve caps with clean water. Run the bottoms of the valves and valve caps under warm running water to clean out any soapy water. Make sure you rinse the valves and caps until you don’t see any more suds. Keep the buttons and tops of the valves dry while you’re rinsing them."
    },
    {
      "title": "Set the valves and caps out to air-dry.",
      "content": "Set the valves and caps out to air-dry. Drying valves with a towel could leave lint or residue that affects the sound of your trumpet, so just set the valves and caps out to drip dry, which should take about an hour. [11] X Research source"
    },
    {
      "title": "Apply slide grease to each of the slides.",
      "content": "Apply slide grease to each of the slides. Slide grease helps keep the slides lubricated so they’re easier to move. Rub a fingertip-sized amount of grease over the part of the slide that inserts into your trumpet. Spread it out in a thin layer and wipe off any excess with a paper towel. Continue greasing all 4 slides. Too much grease can gum up your valves and cause dirt to build up on the outside."
    },
    {
      "title": "Push the slides back into your trumpet.",
      "content": "Push the slides back into your trumpet. Carefully guide the slides back into the tubing on the trumpet. Make sure you put each of the slides back where you pulled them out so your instrument works properly. Move the slide in and out a few times to spread the grease and lubricate the inside of the tubing. [12] X Research source If more grease builds up around the tubing when you push the slides in, clean it off with a paper towel. Since you removed the tuning slide, you’ll have to tune your trumpet once it’s put back together"
    },
    {
      "title": "Screw the valve caps on the bottoms of the casings.",
      "content": "Screw the valve caps on the bottoms of the casings. Position the valve caps on the bottoms of the cylindrical casings. Turn the valve caps clockwise until they’re hand-tight and secured to your trumpet. [13] X Research source"
    },
    {
      "title": "Put valve oil on the valves before reinserting them.",
      "content": "Put valve oil on the valves before reinserting them. Put one valve back in your trumpet at a time so it’s easier to oil your valves . Insert the bottom of the valve into the casing and squirt a few drops of valve oil on the piston. Spin the valve in the casing to spread the oil before screwing the top cap down. Continue putting the rest of the valves back in. [14] X Research source Make sure you put the first valve in the casing closest to the mouthpiece, the second valve in the middle casing, and the third valve in the casing closest to the bell, or the flared end of the trumpet. If the valves are in the wrong position, your trumpet won’t play."
    },
    {
      "title": "Insert the trumpet’s mouthpiece.",
      "content": "Insert the trumpet’s mouthpiece. Gently slide the mouthpiece into the opening on the leadpipe and give it a quarter-turn clockwise. Avoid tapping the mouthpiece in with your palm since you could make it stuck. [15] X Research source You only need to insert your mouthpiece if you plan on playing your trumpet right away. Otherwise, you can just put it away in its case."
    },
    {
      "title": "Wipe the outside of your trumpet with a cloth after each time you play.",
      "content": "Wipe the outside of your trumpet with a cloth after each time you play. Keep a soft cotton cloth in your trumpet case so you have easy access to it. When you’re finished playing, wipe off any fingerprints or oils that are left on the surface to keep your trumpet looking pristine. [16] X Research source Leaving fingerprints and oils on the outside of your trumpet could damage the finish."
    },
    {
      "title": "Empty the water keys whenever you play.",
      "content": "Empty the water keys whenever you play. The water keys, or spit valves, are on the tuning slide and third valve slide. When you take a break from playing, press the button on the water key and blow through the mouthpiece to force any spit or moisture out from inside your horn. [17] X Research source If your trumpet makes a gargling sound when you play, it’s a sign that you need to empty out the water key."
    },
    {
      "title": "Apply oil to the trumpet valves every day.",
      "content": "Apply oil to the trumpet valves every day. Once a day, unscrew the top cap on each valve and pull them out halfway. Put a few drops of valve oil on the pistons and turn the valves in the casings to spread the lubricant. Position the valves back to their original positions and screw the top caps back in. Lubricating your valves daily ensures they won’t get stuck or feel sticky while you’re playing."
    },
    {
      "title": "Clean your mouthpiece 3 times a week.",
      "content": "Clean your mouthpiece 3 times a week. Since your mouthpiece directly touches your lips, it needs a little extra care since build up forms faster. Rinse your mouthpiece with water and run your mouthpiece brush through it to break up any gunk. [18] X Research source"
    },
    {
      "title": "Grease the trumpet slides once a week.",
      "content": "Grease the trumpet slides once a week. When your slides start to feel a little stiff or sticky, pull them out all the way and wipe them with a clean cotton cloth. Reapply a fingertip-sized amount of grease and rub it into a thin layer. When you’re finished, push the slides back into your trumpet. [19] X Research source Make sure you wipe up any excess with a paper towel."
    },
    {
      "title": "Store your trumpet in its case or on a trumpet stand.",
      "content": "Store your trumpet in its case or on a trumpet stand . Your trumpet could easily fall and get damaged if you leave it on a chair, table, or floor. When you’re not playing or holding onto your trumpet, lay it down in its case or set the bell onto a trumpet stand so it stays safe. Avoid putting things on top of your trumpet when it’s in its case since you could damage your horn."
    }
  ]
}