{
  "url": "https://www.wikihow.com/Attach-Rhinestones-to-Nails",
  "title": "How to Attach Rhinestones to Nails",
  "steps": [
    {
      "title": "Paint your nails with gel polish.",
      "content": "Paint your nails with gel polish. You can totally attach rhinestones to natural or acrylic nails, but start with a coat of your favorite gel nail polish as a base. [1] X Research source Make sure that your nails are completely clean and dry before you paint them. This helps the polish stick to your nails. If you're going for a super glam, sparkly look, get your nails done with a clear, glittery polish that shimmers when the light hits it."
    },
    {
      "title": "Let your nails dry completely.",
      "content": "Let your nails dry completely. Give your nails time to completely cure before you attach the rhinestones. This way you don't disturb your perfectly painted fingers! If you have one, stick your hands under a nail curing lamp to speed up the process. Otherwise, wait about 15 minutes before you apply the rhinestones. [2] X Research source"
    },
    {
      "title": "Brush a thick coat of gem gel onto your nails.",
      "content": "Brush a thick coat of gem gel onto your nails. Dip a nail brush in a medium-to-firm gem gel and spread it evenly on each nail that you want rhinestones on. The thick coat of gel gives the stones something to anchor into so don't skimp on the product. [3] X Research source Want to apply a single large rhinestone instead of a bunch? It's fine to apply a single bead of gem gel that's the size of the rhinestone you're applying. If you're applying gems that have pointy backs, the gel should be thick enough to come up to the girdle or widest part of the crystal."
    },
    {
      "title": "Apply a non-wipe top coat over the gem gel.",
      "content": "Apply a non-wipe top coat over the gem gel. Don't wait for the gel to dry or cure before you do this. Just brush a coat of the top coat over it. This way, you won't end up with a tacky layer, which is tricky to remove once the crystals are in place. [4] X Research source Again, you don't have to dry or cure your fingernails just yet. They'll stick better if you just work quickly. A non-wipe top coat is fantastic when you're working with rhinestones since you don't need to wipe off sticky residue that's normal with a regular top coat."
    },
    {
      "title": "Press a rhinestone onto your nail.",
      "content": "Press a rhinestone onto your nail. There are lots of tools you can use to pick up individual crystals, so play around to find one that works best for you. You might use tweezers or a wax-tipped picking pen to pick up a rhinestone and set it in place. [5] X Research source It can help to pour your rhinestones into a small dish or flat plate. This way the tool can push against the surface to pick up the crystal. Attach larger rhinestones before you apply small rhinestones. This just makes it easier to fill in the gaps between the large crystals with smaller ones. Most waxed-tipped picking pens have a conical wax tip that you press onto the crystal. The other end usually has a thin metal point that you can use to position the crystal. Using a really large rhinestone? If the crystal keeps sliding to the side of your nail, press it in place and cure it under your nail lamp for 10 seconds so it stays put."
    },
    {
      "title": "Cure your rhinestone nails for about 90 seconds.",
      "content": "Cure your rhinestone nails for about 90 seconds. When you're happy with your rhinestone placement, stick your nails under a curing lamp for 90 seconds. This will stop the crystals from moving around. If you've got really big rhinestones, you may want to give them a few more seconds. [6] X Research source Read the instructions that came with your curing lamp since it may recommend curing them for a different amount of time."
    },
    {
      "title": "Avoid brushing a top coat over the rhinestones.",
      "content": "Avoid brushing a top coat over the rhinestones. You might be tempted to apply a top coat if you're worried the rhinestones won't stick but don't do it! The rhinestones get their sparkle from light reflecting off of the facets. If you brush anything over them, they'll lose their shimmer and shine. [7] X Research source A standard top coat leaves a tacky layer on your nail that you need to wipe off. If you do this with rhinestones on your fingers, you might accidentally pop off some of the crystals. It's totally fine to seal the edges of your nails with a top coat—just avoid getting it on the rhinestones."
    },
    {
      "title": "Paint your nails with your favorite polish.",
      "content": "Paint your nails with your favorite polish. You can use basic nail polish for a quick set or longer-lasting gel polish. Just pick a color that you'd like to see surrounding the rhinestones since it will be visible. [8] X Research source For extra sparkle, use shimmery, glittery nail polish. You'll be able to see this under the rhinestones."
    },
    {
      "title": "Let your nails dry completely before you attach rhinestones.",
      "content": "Let your nails dry completely before you attach rhinestones. Sure, your nails will probably be dry within a few minutes, but they can really smudge easily at this point. It's better to wait until your nails don't feel tacky at all. If you're using basic nail polish, this can take up to an hour. If you're using gel polish with a curing lamp, your nails should dry within a few minutes. Using gel nail polish? Lightly buff the shine off of your nails with a nail file. This can help the rhinestones stick to the surface of your nail better."
    },
    {
      "title": "Squeeze a drop of quick-set nail glue onto a plastic dish.",
      "content": "Squeeze a drop of quick-set nail glue onto a plastic dish. For easier cleanup, use a disposable dish or plate. Squirt just a drop of the glue since a little goes a very long way and you can always add more if you need it. [9] X Research source You might have seen people recommend using superglue to attach rhinestones, but this isn't advised. Superglue can irritate your skin if you come into contact with it and it's harsher on your nails than nail glue."
    },
    {
      "title": "Dab a drop of quick-set glue onto your nail.",
      "content": "Dab a drop of quick-set glue onto your nail. Dip the thin metal end of a waxed-tipped picking pen or cuticle stick into the glue. Then, tap it on the nail where you want to place the rhinestone. Try to use a light touch so excess glue doesn't pool around the crystals. [10] X Research source"
    },
    {
      "title": "Place a rhinestone on the nail.",
      "content": "Place a rhinestone on the nail. Pick up a rhinestone with the waxed-tipped end of a picking pen or tweezers. Set it onto the glue so the sparkly side faces up. You can use glass or synthetic rhinestones for strong crystals that really sparkle. [11] X Research source You can buy rhinestones at your local beauty supply store, craft shop, or online. If the rhinestone slides to the side of your nail, use a cuticle stick or the thin metal end of your picking pen to push the rhinestone back into place."
    },
    {
      "title": "Apply a top coat around the crystals.",
      "content": "Apply a top coat around the crystals. If you're worried the rhinestones might fall off, you can apply a clear top coat around them to help hold them in place. Keep in mind that if you brush the top coat over the rhinestones, it will dull the shine. [12] X Research source You can also dab a little more glue around the base of the rhinestones for extra strong hold."
    }
  ]
}