{
  "url": "https://www.wikihow.com/90s-Blowout-Hair",
  "title": "Mastering and Maintaining a 90s Blowout",
  "steps": [
    {
      "title": "Wash your hair with volumizing shampoo and conditioner.",
      "content": "Wash your hair with volumizing shampoo and conditioner. If your hair is already washed and 70% dried, jump down to the next section. If you're starting off with a shower, the focus here is on the right shampoo. Since the 90s blowout is all about creating lots of volume, volumizing shampoo and conditioner will be the proper foundation to set the stage. [1] X Research source Alternately, if you already have thick or voluminous hair, you can use smoothing shampoo and conditioner to help combat any frizz from the heat.Towel dry your hair to remove extra moisture. When applying products, you don’t want your hair to be dripping wet. Simply towel dry your hair as you normally would in this step."
    },
    {
      "title": "Apply a volumizing mousse.",
      "content": "Apply a volumizing mousse. The main area you’re looking for volume is at the roots of your hair, so volumizing mousse will provide the extra texture and hold needed to help create that volume. [2] X Research source To apply mousse, flip your head over and massage a generous amount into your hair, focusing on the roots and working your way down to the ends."
    },
    {
      "title": "Use a heat protectant.",
      "content": "Use a heat protectant. Achieving a signature 90s blowout involves a generous amount of heat, whether that’s from the blow-dryer or other hot tools you may want to use to enhance the look. As such, protecting your locks from heat with heat protectant is crucial in the prep stage. Many heat protectants use nourishing and moisturizing ingredients, which can also help to combat any frizz the heat may put into your hair. [3] X Research source Frizz and flyaways aren’t a part of the 90s blowout look, so this step is key to keeping the looks smooth and shiny."
    },
    {
      "title": "Use a blow-dryer to roughly dry your hair until it’s 70% to 80% dry.",
      "content": "Use a blow-dryer to roughly dry your hair until it’s 70% to 80% dry. Getting your hair mostly dry is going to save you a lot of time when it’s time to go in with a round brush, as well as provide additional body at the root. [4] X Research source"
    },
    {
      "title": "Section your hair starting at the bottom.",
      "content": "Section your hair starting at the bottom. You’ll want to create sections that are manageable sizes and have easy access to the root. [5] X Research source"
    },
    {
      "title": "Use the round brush to dry the hair from roots to ends.",
      "content": "Use the round brush to dry the hair from roots to ends. Taking the brush, lift the roots away from your head and you guide the blow-dryer directly behind the brush.< https://www.revlonprofessional.com/blog/90s-blowout/ </ref> For this step, your blow dryer needs to have a nozzle on the end to prevent frizz."
    },
    {
      "title": "Wrap each section of hair into a hook-and-loop fastener roller while it’s still hot.",
      "content": "Wrap each section of hair into a hook-and-loop fastener roller while it’s still hot. By wrapping the hair while it’s still hot, the hair will cool into the shape of the roller and set in place. [6] X Research source The bigger the roller, the more volume you will get, while the smaller the roller, the tighter of a curl you’ll create. Play around with different sized rollers until you find a look that feels comfortable to you. While rolling, always start from the bottom of the hair and roll towards the root. [7] X Research source"
    },
    {
      "title": "Allow your hair to completely cool before taking out the rollers.",
      "content": "Allow your hair to completely cool before taking out the rollers. Ideally, you’ll want to keep the rollers in as long as possible to ensure your style isn’t going to move, but if you’re in a rush, keep them in until cool at the very minimum."
    },
    {
      "title": "Gently remove the rollers.",
      "content": "Gently remove the rollers. Taking out the rollers as gently as possible will help eliminate frizz. Once they’re out, use your fingers to rake through your hair and set your style into place. [8] X Research source"
    },
    {
      "title": "Finish with a flexible hold hair spray.",
      "content": "Finish with a flexible hold hair spray. Spritz your hairspray all over to ensure your style holds up well. You can even flip your head upside down and spray the underneath section for even more added volume."
    },
    {
      "title": "Use a silk scrunchie while sleeping.",
      "content": "Use a silk scrunchie while sleeping. Pulling your hair up into a messy bun on top of your head with a scrunchie is the best method for protecting your style. [9] X Research source Although a silk scrunchie is best for not tugging on your hair too much, you can also use a claw clip or silk turban or bonnet."
    },
    {
      "title": "Sleep on a satin or silk pillowcase.",
      "content": "Sleep on a satin or silk pillowcase. As you sleep, friction from your pillowcase can cause frizz and damage to your 90s blowout. [10] X Research source Keep things gentle on your hair with a silk or satin pillowcase."
    },
    {
      "title": "Use a terry cloth-lined shower cap.",
      "content": "Use a terry cloth-lined shower cap. Moisture is volume’s worst enemy! Even steam from the shower can deflate those gorgeous, bouncy locks you just created, so a terry-lined shower cap in perfect for shielding your 90s blowout from water and steam. [11] X Research source"
    },
    {
      "title": "Invest in a good dry shampoo.",
      "content": "Invest in a good dry shampoo. If you really want to stretch how long your blowout lasts before your next wash, keep your scalp oil at a minimum with dry shampoo. On the plus side, dry shampoo can add back a lot of volume that likely began to deflate in the days following your 90s blowout. [12] X Research source"
    },
    {
      "title": "Put on a sweat-absorbing headband before the gym.",
      "content": "Put on a sweat-absorbing headband before the gym. Sweat causes moisture all over the top of the head, and volume can’t stand moisture. With a headband, you’re adding an extra layer of protection against all of the dirt, oil, and sweat that comes with working out. On top of using a sweat-absorbing headband, tie up your hair before you go to the gym or workout to ensure the ends of your hair aren’t touching your back, shoulders, and neck."
    },
    {
      "title": "Touch up with your curling iron or flat iron.",
      "content": "Touch up with your curling iron or flat iron. Reach for the curling iron when you want to reintroduce some much-needed body, or flat iron any pieces that may be looking a little less than desirable. Before going in with the hot tools, spritz some water in your hair and allow it to dry completely. This will provide any body or volume your hair might be lacking, but this doesn’t do the trick, it’s time for some heat. [13] X Research source"
    },
    {
      "title": "A 90s blowout is a hairstyle created with tons of volume, body, and soft, glamorous waves.",
      "content": "A 90s blowout is a hairstyle created with tons of volume, body, and soft, glamorous waves. One of the key characteristics of a 90s blowout is the signature bouncy movement that comes with it, giving off a “done but undone” look. [14] X Research source The 90s blowout can be done on long or short hair. As long as you see a lot of volume at the root with an iconic flip and bounce at the end, you’ve got the right look!"
    },
    {
      "title": "The 90s blowout is a high-maintenance style that requires a blow-dryer or rollers.",
      "content": "The 90s blowout is a high-maintenance style that requires a blow-dryer or rollers. This is a look that definitely takes quite a bit of work to achieve and maintain. It is created with a blow-dryer and round brush, or with heated or hook-and-loop fastener rollers."
    },
    {
      "title": "The 90s blowout ruled the runways of the decade.",
      "content": "The 90s blowout ruled the runways of the decade. Whether it was Cindy Crawford, Naomi Campbell, or Cher from Clueless, you could catch this signature style on just about anyone during the 90s. [15] X Research source While the look often was a bit unkempt and full of volume, minimal frizz and high shine were also key components."
    },
    {
      "title": "Blow-dryer",
      "content": "Blow-dryer First and foremost, you’ll need a blow-dryer to create a 90s blowout. While any blow-dryer will work, make sure to use one that comes with a nozzle attachment. The nozzle is ideal for directing the flow of air that’s aimed towards your hair, which is a big part of preventing frizz. [16] X Research source Aside from minimizing frizz, the nozzle attachment aids in creating volume at the root and smoothing out the ends."
    },
    {
      "title": "Round brush",
      "content": "Round brush The round brush is what you will use to lift the roots, smooth the ends, and create soft waves and body. Because you’re not trying to curl the hair, but rather add volume, choose a large round brush that is at least 2 to 3 inches. [17] X Research source"
    },
    {
      "title": "Hair clips",
      "content": "Hair clips The artistry behind the 90s blowout involves sectioning your hair (so every strand is bouncy and volumized). To prevent any kinks or creases clips may cause, reach for ones that are made specifically for non-creasing, such as alligator clips ."
    },
    {
      "title": "Curling iron",
      "content": "Curling iron If you want to add more body and bounce to hair after the blow-drying step is complete, use a large-barrel curling iron to work in some extra waves and loose curls. [18] X Research source"
    },
    {
      "title": "Hook-and-loop fastener rollers",
      "content": "Hook-and-loop fastener rollers If you’re trying to avoid heat, hook-and-loop fastener rollers are a great way to give your blowout some extra volume and movement. The larger the rollers you use, the more volume and soft waves you’ll achieve."
    },
    {
      "title": "Teasing comb",
      "content": "Teasing comb A teasing comb isn’t always necessary, but it’s fantastic for getting some extra lift at your roots and volume wherever you feel like you need a boost."
    }
  ]
}