{
  "url": "https://www.wikihow.com/Adjust-Office-Chair-Height",
  "title": "How to Adjust Office Chair Height",
  "steps": [
    {
      "title": "Look for hand controls.",
      "content": "Look for hand controls. Most office chairs have levers located just below the seat, attached to the base. There might be several to control features like the seat height and angle. You can adjust the height by pulling up on the proper lever if you're already in the chair. [1] X Research source For some models, you will turn a knob instead of pulling on a lever. If aren't sure which lever controls the height, you can either read the chair's instructions, or just pull the levers until you find the right one."
    },
    {
      "title": "Raise and lower the seat until it's comfortable.",
      "content": "Raise and lower the seat until it's comfortable. With most chairs, once you've pushed the right lever, the seat will raise and lower freely. Move it until you find the “sweet spot” that's just right for you. Do this gently, slowly moving the chair only inches (or centimeters) at a time. When you're done, move the lever back to the original position. Some models may require you to pull up on the lever to raise the seat, but push down on it to lower it. Pneumatic models will allow you to “pump” the lever (push it repeatedly up or down to raise or lower the seat)."
    },
    {
      "title": "Try adjusting from a standing position if you can't seem to get it right.",
      "content": "Try adjusting from a standing position if you can't seem to get it right. Stand in front of the chair, and push the proper lever. Raise or lower the seat of the chair until the tip of it is just below your knee cap. You should now be able to sit comfortably in the chair with your feet flat on the floor. [2] X Research source"
    },
    {
      "title": "Stay eye level with the monitor when working on a computer.",
      "content": "Stay eye level with the monitor when working on a computer. Ideally, the monitor will be just below your eye level and the keyboard at elbow level. If you can't raise or lower your monitor, you can adjust the seat height to accommodate. [3] X Expert Source Mayami Oyanagi Physical Therapist Expert Interview. 27 January 2021."
    },
    {
      "title": "Keep your elbows at desk height when working on its flat surface.",
      "content": "Keep your elbows at desk height when working on its flat surface. This applies when you're doing things like reading a book or something on paper, writing by hand, drawing, etc. Lower or raise your chair height until your elbows and arms can rest comfortably on the desk. [4] X Expert Source Mayami Oyanagi Physical Therapist Expert Interview. 27 January 2021."
    },
    {
      "title": "Rest your feet on the floor during extended periods of sitting.",
      "content": "Rest your feet on the floor during extended periods of sitting. If you have to stay put for a while, such as during a meeting, its especially important to be sitting properly. Change your chair height until your feet are flat on the floor so you don't have to sit awkwardly. [5] X Expert Source Mayami Oyanagi Physical Therapist Expert Interview. 27 January 2021."
    },
    {
      "title": "Adjust the height of the armrests, if the chair has them.",
      "content": "Adjust the height of the armrests, if the chair has them. If you're working at a desk for typing or similar tasks, raise the armrests until they allow you to keep your arms just about level with the desk. If you don't need the arm support, you may be able to remove the armrests, or just lower them so they aren't in your way. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Lower or remove the armrests if they prevent you from sliding your knees comfortably under your desk."
    },
    {
      "title": "Change your sitting position every 15-30 minutes.",
      "content": "Change your sitting position every 15-30 minutes. This helps prevent strain and other issues. If you don't need to adjust your chair height because of your work, you can still try shifting your position. For instance, lean forward briefly, then go back to a fully seated position. You could also shift your weight slightly from one side of the chair to the other. [7] X Expert Source Mayami Oyanagi Physical Therapist Expert Interview. 27 January 2021."
    },
    {
      "title": "Get a footrest if your chair is too high.",
      "content": "Get a footrest if your chair is too high. It may be that there's just no way to lower your chair so that your feet sit comfortably on the floor while keeping your arms at a comfortable working height. If that's the case, slide an office footrest underneath your desk and prop your feet on that. Footrests can be found at office supply stores, and are usually adjustable as well."
    }
  ]
}