{
  "url": "https://www.wikihow.com/Clean-Jewelry-with-Baking-Soda",
  "title": "How to Clean Tarnished Jewelry at Home with Baking Soda",
  "steps": [
    {
      "title": "Fill a bowl with enough hot water to cover your jewelry.",
      "content": "Fill a bowl with enough hot water to cover your jewelry. Choose any small bowl that’s wide and deep enough to hold all the pieces you’re cleaning. Either use the hottest water setting from your faucet, or heat water in your microwave until it’s steaming. Add about 1 cup (240 ml) of water to the bottom of the bowl so you can submerge your jewelry. [1] X Research source If you’re cleaning a lot of jewelry at once or have larger pieces that don’t fit well in a bowl, use a large baking dish instead. Baking soda and dish soap work well for cleaning any type of jewelry, whether they’re necklaces, bracelets, or rings. If you’re cleaning gemstones , then avoid using baking soda so you don’t scratch them."
    },
    {
      "title": "Add a squirt of dish soap and 2 tsp (9.6 g) of baking soda to the bowl.",
      "content": "Add a squirt of dish soap and 2 tsp (9.6 g) of baking soda to the bowl. Squeeze a few drops of standard dish detergent you’d use to wash dishes into the bowl. Use a measuring spoon to scoop the baking soda into the bowl and stir the ingredients together. Keep mixing your cleaning solution until the baking soda completely dissolves. [2] X Research source If you are having trouble mixing the baking soda into the water, heat the solution in the microwave for about 30 seconds or so to make it dissolve easier. If you’re cleaning gold or cleaning gold-plated jewelry, just use dish soap without any baking soda. Baking soda could be too abrasive and scratch the softer metal. [3] X Research source"
    },
    {
      "title": "Soak your jewelry in the baking soda solution for 20 minutes.",
      "content": "Soak your jewelry in the baking soda solution for 20 minutes. Lower all your pieces of jewelry into the bowl and make sure they’re completely submerged in your cleaning solution. Set a timer for about 20 minutes to let the baking soda work its magic and remove the tarnish. [4] X Research source The baking soda solution helps strip off surface dirt and debris to restore the metal’s shine."
    },
    {
      "title": "Clean off stains and tarnish with a baby toothbrush.",
      "content": "Clean off stains and tarnish with a baby toothbrush . A baby toothbrush has softer bristles that will still break apart dirt and grime without damaging your jewelry. Gently rub the brush bristles against your jewelry in circular motions to spread the baking soda and remove any other dirt or stains still on the metal’s surface. [5] X Research source When you dissolve baking soda, it still acts as a fine abrasive to break apart surface stains without leaving noticeable marks. Avoid using any abrasive sponges or stiff-bristled brushes since they could leave small scratches on the surface."
    },
    {
      "title": "Rinse your jewelry with clean water.",
      "content": "Rinse your jewelry with clean water. If you have small rings or earrings, fill a second bowl with fresh water. Dip your jewelry in the water and swish it around to get rid of any baking soda on the surface. If you have larger pieces of jewelry, hold them under cold running water from your faucet. [6] X Research source Plug your drain so your jewelry doesn’t fall into your pipes if it slips out of your hand."
    },
    {
      "title": "Pat the jewelry dry with a clean microfiber towel.",
      "content": "Pat the jewelry dry with a clean microfiber towel . Set your pieces of jewelry on your towel and pat them dry right away. Leave your jewelry on the towel for a few minutes so the water trapped in the nooks and crannies fully air-dries. [7] X Research source Store your jewelry in a jewelry box to keep it protected from tarnish when you’re not wearing it."
    },
    {
      "title": "Mix ¼ c (45 g) of baking soda and 2 US tbsp (30 ml) of water into a paste.",
      "content": "Mix ¼ c (45 g) of baking soda and 2 US tbsp (30 ml) of water into a paste. Add your baking soda and water to a small dish and stir it up until it forms a thick paste. If the paste doesn’t mix together easily, add in a few more drops of water and keep stirring it in. If your paste is too watery, sprinkle in a pinch more baking soda instead. [8] X Research source Baking soda paste acts as an abrasive, and works best for sterling silver and silver. Try using the paste on necklaces or bracelets since the cleaner can work into tight areas, like clasps. You can try cleaning gold with baking soda, but you could risk scratching the soft metal. Test the baking soda on an inconspicuous spot of your jewelry to make sure the cleaner doesn’t damage it. Avoid using baking soda paste on any gold-plated pieces, since a deep scratch could expose the metal underneath. Baking soda paste may also damage soft gemstones, so don’t use it to clean pearls or scrub opals. If you’re cleaning brass jewelry , use 3–4 teaspoons (14.4–19 g) of baking soda with the juice from half a lemon instead. The lemon juice will help make the brass patina shine, but the acid could be too strong on other metals."
    },
    {
      "title": "Scrub the paste gently onto your jewelry with a soft-bristle toothbrush.",
      "content": "Scrub the paste gently onto your jewelry with a soft-bristle toothbrush . Hold the piece you’re cleaning in your hands or place it on a paper towel for better leverage. Scoop some of the baking soda paste onto the toothbrush’s bristles and apply it to your jewelry. Coat the entire surface of your jewelry with the paste and set it down on a clean towel. [9] X Research source Alternatively, use a soft sponge or microfiber towel to apply the paste to your jewelry. Avoid aggressively scrubbing the paste against your jewelry to prevent it from getting damaged."
    },
    {
      "title": "Leave the baking soda paste on your jewelry for 3–4 minutes.",
      "content": "Leave the baking soda paste on your jewelry for 3–4 minutes. After you finish scrubbing the paste on, leave the baking soda on the surface so it has time to set in. The baking soda will help loosen up stubborn stains and clean tarnished spots so your jewelry has a natural shine again. [10] X Research source"
    },
    {
      "title": "Rinse the paste off with clean water.",
      "content": "Rinse the paste off with clean water. Either dip your jewelry in a cup of fresh water or run it under your faucet to remove the paste. Hold your jewelry in the water for about 30 seconds or so you can completely rinse off the remaining baking soda. [11] X Research source Put a plug in the drain if you’re rinsing jewelry in your sink so it doesn’t slip down your pipes if you drop it."
    },
    {
      "title": "Buff your jewelry dry with a soft cloth.",
      "content": "Buff your jewelry dry with a soft cloth. Lay down a clean microfiber towel, and put your jewelry on top after you rinse it clean. Pat the jewelry as dry as you can with the towel before leaving it for another 5-10 minutes to air-dry. [12] X Research source"
    },
    {
      "title": "Line a dish or bowl with aluminum foil.",
      "content": "Line a dish or bowl with aluminum foil . Cut a piece of aluminum foil to the size and shape of the bowl. Make sure the shiny side of the foil faces up and set it inside the bowl. Press the foil down and smooth it out so it lines the bottom and sides of the container. [13] X Research source If you’re cleaning a lot of jewelry at the same time, use a disposable aluminum dish instead. Baking soda, salt, and aluminum foil work best for removing tarnish from sterling silver and silver rings, bracelets, and necklaces without gemstones. The foil method is too intense for gold and gemstones since vinegar could damage them."
    },
    {
      "title": "Add 1⁄2 c (120 ml) each of hot water and white vinegar to the dish.",
      "content": "Add 1 ⁄ 2 c (120 ml) each of hot water and white vinegar to the dish. Heat 1 ⁄ 2 c (120 ml) of water on the stove or in your microwave until it’s steaming. Put the hot water in the bowl lined with foil along with 1 ⁄ 2 c (120 ml) of distilled white vinegar from your kitchen. Stir the solution together so it’s mixed thoroughly. [14] X Research source"
    },
    {
      "title": "Pour 1 tbsp (17 g) of salt and 1 tbsp (14.4 g) of baking soda into the dish.",
      "content": "Pour 1 tbsp (17 g) of salt and 1 tbsp (14.4 g) of baking soda into the dish. While the water is still warm, stir in your salt and baking soda so it completely dissolves in the water. You may notice the solution fizzing a bit, but that’s normal as the baking soda reacts with the vinegar. [15] X Research source Baking soda and salt are both slightly abrasive, so they help remove stains and tarnish on the surface of your jewelry."
    },
    {
      "title": "Soak your jewelry in the solution for 5-10 minutes.",
      "content": "Soak your jewelry in the solution for 5-10 minutes. Use a pair of tongs to submerge your jewelry in the solution. Make sure each piece that you're cleaning makes contact with the aluminum foil. Leave all of your jewelry in the solution for about 5 minutes before fishing them out. [16] X Research source The baking soda and foil create a chemical reaction that removes sulfur dioxide from the surface and gets rid of the tarnished appearance. [17] X Research source"
    },
    {
      "title": "Rinse your jewelry off with clean water.",
      "content": "Rinse your jewelry off with clean water. Fill a second bowl with clean water and swish your jewelry in it to remove the excess cleaning solution. Alternatively, hold your jewelry under running water from your faucet to rinse it out. Keep each piece of your jewelry under the water until you don’t see any residue leftover from the cleaner. [18] X Research source Put the plug in your sink so you don’t accidentally lose any jewelry down the drain."
    },
    {
      "title": "Dry your jewelry with a microfiber cloth.",
      "content": "Dry your jewelry with a microfiber cloth . Set your jewelry on a clean towel and pat it as dry as you can. Then, leave your jewelry for about another 10 minutes until it’s air-dry. After that, wear or store your jewelry. [19] X Research source"
    }
  ]
}