{
  "url": "https://www.wikihow.com/Clean-a-Drain-Pipe",
  "title": "How to Clean a Drain Pipe",
  "steps": [
    {
      "title": "Bring two liters of water to a rolling boil.",
      "content": "Bring two liters of water to a rolling boil. Measure two liters (8 cups) of water and pour it into a pot and place it over your stovetop. Turn the stove to high until the water starts to bubble. [1] X Research source You can also use a kettle or electric water heater to heat up the water."
    },
    {
      "title": "Add dishwashing detergent to the water.",
      "content": "Add dishwashing detergent to the water. Combine three tablespoons (44.36 ml) of dishwashing detergent to the water as it boils. Then, turn off the heat on the stovetop and carefully lift the pot of water and take it to your drain. [2] X Research source"
    },
    {
      "title": "Pour the water down the drain.",
      "content": "Pour the water down the drain. Carefully tip the pot or kettle so that the water goes down the drain. If you have plastic pipes, you should allow the water to cool for four to five minutes before pouring it down the drain. [3] X Research source"
    },
    {
      "title": "Flush the drain with hot water from the faucet.",
      "content": "Flush the drain with hot water from the faucet. After the hot water has drained, turn on your faucet on the highest heat. If the drain is clogged or slow, you may have to repeat the process to remove bigger grease obstructions and unclog it. [4] X Research source"
    },
    {
      "title": "Purchase a drain cleaner from the store or online.",
      "content": "Purchase a drain cleaner from the store or online. Decide which kind of drain cleaner that you want to use. Options include traditional cleaners, foaming cleansers, and enzyme cleaners. Traditional and foaming cleansers may contain chemicals that are harmful to the environment while enzyme cleansers are made of natural ingredients. [5] X Research source"
    },
    {
      "title": "Read the instructions on the packaging.",
      "content": "Read the instructions on the packaging. Because all drain cleaners are different, it's important that you read the instructions so that you know how long you should let the drain cleaner sit before flushing it. Enzyme cleaners work best in warm water rather than hot water. Do not combine two different types of chemical drain cleaners or it can create toxic fumes."
    },
    {
      "title": "Pour the drain cleaner down the drain.",
      "content": "Pour the drain cleaner down the drain. Pour the appropriate amount of drain cleaner down the sink according to the directions. If your drain is clogged, you'll see the solution settle near the top of your drain pipe. [6] X Research source"
    },
    {
      "title": "Flush the drain with hot or boiling water.",
      "content": "Flush the drain with hot or boiling water. After letting the drain cleaner sit in the drain, you will have to flush the rest of the cleaner down the drain with warm or hot water. Follow the directions on the packaging for the optimal results."
    },
    {
      "title": "Close the sink drain and fill the sink up halfway with water.",
      "content": "Close the sink drain and fill the sink up halfway with water. You'll need to fill the sink up to create suction so that you can push out the obstruction. Fill the sink up about halfway so that there's enough water to fully submerge the plunger. [7] X Research source"
    },
    {
      "title": "Put the plunger in the water and create a seal.",
      "content": "Put the plunger in the water and create a seal. Dip your plunger into the sink filled with water and press down on the bottom of your sink to remove all the air inside of it. Put a rag in the other sink's drain if you have a double sink to create a closed seal. [8] X Research source"
    },
    {
      "title": "Plunge up and down over the drain.",
      "content": "Plunge up and down over the drain. Use the straight handle on the plunger to push up and down on it. The seal ensures that you force water, not air, down the drainpipe. This will dislodge any obstructions or food particles that are clogging up your sink. [9] X Research source Keep towels around to clean up the water that spills."
    },
    {
      "title": "Rinse the drain with hot water.",
      "content": "Rinse the drain with hot water. Finish cleaning your drainpipe by running hot water from the faucet. You can also flush the pipe with boiling water. [10] X Research source"
    },
    {
      "title": "Remove the stopper.",
      "content": "Remove the stopper. Unscrew or pull out the stopper in your drain. Some tubs also have an overflow plate under the faucet that you'll have to unscrew to remove the drain. As you remove the stopper, you may pull up some hair that's stuck down the drain pipe. Clean off the bottom of the stopper and wipe down the area if there is any gunk or hair that you've pulled up. [11] X Research source"
    },
    {
      "title": "Insert the snake down the pipe.",
      "content": "Insert the snake down the pipe. You can get a more heavy duty drain snake from a hardware store, or you can use a disposable snake that comes with drain pipe cleaners. If you are using a piece of equipment from the hardware store, it will most likely have a crank that you must rotate to feed the snake down the drain. [12] X Research source There are also are gas and electric powered commercial grade drain snakes that you can rent from the hardware store."
    },
    {
      "title": "Rotate the snake until it grabs hold of the hair.",
      "content": "Rotate the snake until it grabs hold of the hair. Turn the snake as it goes down the drain so that it scrapes the side of the drainpipe. Continue to rotate it until you break through the clog or the snake won't go any further. As the snake is rotated, it should collect the hair that's clogging your drain. [13] X Research source When you feel resistance, it means that you've reached the clog."
    },
    {
      "title": "Slowly pull the drain snake out of the drain.",
      "content": "Slowly pull the drain snake out of the drain. Slowly remove the snake from your drain. If you're using a residential grade drain snake, you'll have to rotate the snake's handle the other way to retract it. As the snake comes out of the drain, it should pull out any hair that was stuck in the pipe"
    },
    {
      "title": "Run water from the faucet to see if it's still clogged.",
      "content": "Run water from the faucet to see if it's still clogged. Run hot water from your faucet to see if you've cleared the hair that was clogging your drain. If the drain is still clogged, repeat the process until you clear the hair out of the drain."
    },
    {
      "title": "Pour 1/2 cup (170 g) of baking soda down your drain.",
      "content": "Pour 1/2 cup (170 g) of baking soda down your drain. Measure a half cup (170 g) of baking soda in a measuring cup and pour it down your drain, coating the sides of the drain pipe. [14] X Research source"
    },
    {
      "title": "Boil 1 cup (236.58 ml) of water in a pot.",
      "content": "Boil 1 cup (236.58 ml) of water in a pot. Turn your stovetop to high and pour 1 cup (236.58 ml) into the pot. Continue to heat the pot until the water boils. [15] X Research source"
    },
    {
      "title": "Add 1 cup (236.58 ml) of vinegar to the pot.",
      "content": "Add 1 cup (236.58 ml) of vinegar to the pot. Purchase white vinegar from the grocery store. Pour a cup of the vinegar in a measuring cup. Turn off the stovetop and combine the vinegar with the hot water. [16] X Research source"
    },
    {
      "title": "Pour the water and vinegar mixture down the drain.",
      "content": "Pour the water and vinegar mixture down the drain. Transport the pot of water over to the drain that needs cleaning and slowly and carefully pour it down your drain. [17] X Research source If you have plastic pipes, let the boiling water cool down for 4 - 5 minutes before you pour it down your drain."
    },
    {
      "title": "Let the solution sit for 10 minutes.",
      "content": "Let the solution sit for 10 minutes. The baking soda should start to react to the vinegar and foam up. The foam will help clean grime and oil from the inside of your drainpipe. [18] X Research source"
    },
    {
      "title": "Flush the drain with another pot of boiling water.",
      "content": "Flush the drain with another pot of boiling water. Boil 2 cups (473.17 ml) of water in your pot. Slowly pour the water down the drain to flush the foam down the sink."
    }
  ]
}