{
  "url": "https://www.wikihow.com/Break-in-a-Softball-Glove",
  "title": "How to Break in a Softball Glove",
  "steps": [
    {
      "title": "Use the glove to play catch.",
      "content": "Use the glove to play catch. The most surefire way to break in a stiff new softball glove is to use it to play catch frequently. This way, you’re using it for what it was designed for, and won’t have to worry about damaging the glove’s materials using unorthodox methods. The downside of simply playing catch to break in your glove is that it can take many hours of catching to soften the glove up enough. [1] X Research source [2] X Research source When catching a softball with a new glove, concentrate on enveloping and squeezing the ball with the area around the thumb and forefingers to form what is known as a “pocket.” This will give the glove a natural contour the size and shape of a softball and make catching easier as a result."
    },
    {
      "title": "Knead the glove by hand.",
      "content": "Knead the glove by hand. Use both hands to bend, pull, stretch, squeeze and roll the glove. Working the glove manually can also be a time-consuming way to break it in, but the upside is that it can be done absent-mindedly while you’re busy with other things. After a while, the repetitive contact will cause the leather of the glove to loosen up. [3] X Research source Try kneading your new glove while you’re watching TV, talking with friends or sitting in traffic. The natural oils on your hands can also be good for conditioning a stiff glove."
    },
    {
      "title": "Rough up the glove.",
      "content": "Rough up the glove. Take out your aggression on your new glove and soften it up in the process. Punch it, kick it, stomp on it, hit it with a bat or throw it against the wall. It may seem odd to be so destructive to a new glove, but the abuse you dole out will simulate the pounding it will eventually take on the field. Just make sure you don’t damage any weaker areas of the glove, like the stitching. [4] X Research source Softball gloves are fashioned from thick, durable leather, so you’re unlikely to damage the glove, as long as you don’t employ extreme measures like running it over in a car or dropping it off a cliff."
    },
    {
      "title": "Sleep on the glove.",
      "content": "Sleep on the glove. One traditional method for breaking in a new glove is to fold it around a ball, stick it under your mattress and sleep on it for a night or two. What makes this effective is the constant heat and pressure from having your body weight on top of it for an extended period. As the glove warms up, it will begin to conform to the shape of the ball, while positioning your shifting mass over it while you sleep will massage away tension in the new leather. [5] X Research source Make sure there is a ball in your glove before sleeping on it. The point is to form a defined pocket, not to flatten the glove out. Play catch with your new glove by day and sleep on it at night. Between the two, the glove should be thoroughly broken in in no time."
    },
    {
      "title": "Apply oil to soften the glove.",
      "content": "Apply oil to soften the glove. Buy a bottle of conditioning oil to use on your glove. Squirt a dime-sized amount of the oil into a washcloth or applicator sponge and rub it into the palm area, fingers and stitching of the glove. Glove oils serve to soften the leather, and, once they’ve had a chance to set in, can protect it from hard impacts, dirt, scrapes and other elements of hard play. [6] X Research source It’s important to treat the stitching and webbing of the glove with oil, as these parts absorb most of the strain from catching and gripping and need to be pliable. Go easy on the oil. Use just enough to lightly coat the glove, and wipe away any excess oil that’s beading up on the leather. Too much oil can oversaturate the leather, making it heavy and susceptible to cracking. [7] X Research source"
    },
    {
      "title": "Wrap the glove tightly with a band.",
      "content": "Wrap the glove tightly with a band. Place a softball firmly in the pocket of the glove, fold the glove around the ball and then secure it with thick rubber bands, twine or a set of unused shoelaces. Stretch or tie the bands in an “X” shape so that the glove is constricted at both the top, near the fingers, and bottom, at the base of the palm. Store the glove overnight, letting it rest around the ball. With time, the glove will relax and begin to take the shape of the ball. [8] X Research source Since you’re breaking in a softball glove, make sure you don’t wrap the glove using anything smaller than a regulation size softball. You can also wrap an ace bandage around your glove. [9] X Expert Source Haley Snyder Softball Player Expert Interview. 23 June 2021."
    },
    {
      "title": "Strike the glove with a mallet or bat.",
      "content": "Strike the glove with a mallet or bat. If you don’t have anyone to play catch with, and don’t feel like slapping a ball into the glove repeatedly on your own, you can use a ball mallet, baseball bat or other similarly shaped object to simulate the impact of the ball. Use the striking surface to beat the glove in the center of the palm and in the space between the thumb and forefinger where the ball will rest. Oil the glove when you’re not using it to safeguard it against continual impact. [10] X Research source In professional baseball, this is known as “manhandling,” and can be used to break in new gloves or keep them supple between games. [11] X Research source Grip the striking implement firmly as you make impact to get used to squeezing around an object, the way you would when catching a ball. This will also give the stitching a bit of stretch."
    },
    {
      "title": "Leave a ball in the glove when you’re not using it.",
      "content": "Leave a ball in the glove when you’re not using it. Anytime you’re not using the glove for games or practice, place a full-sized softball in the pocket and stash it away. If you make a habit of this, the glove will eventually conform permanently around the ball. [12] X Expert Source Haley Snyder Softball Player Expert Interview. 23 June 2021. This is a basic way to break in a new glove, but doubles as a form of maintenance, as the leather of a glove tends to change shape and texture over time. [13] X Research source You can choose whether to wrap the glove and ball with bands when you put it away. Once the glove is mostly broken in, there won’t be much of a need to wrap it anymore. Just keeping a ball in the pocket will be enough to help it hold its shape."
    },
    {
      "title": "Put the glove in the microwave.",
      "content": "Put the glove in the microwave. Submerge the new glove in water, shake or wring out the excess and then place the glove in the microwave. Only leave the glove in the microwave for less than a minute at a time—otherwise, the leather can scorch, melt or warp. This is a bizarre and potentially destructive break-in strategy that is nonetheless advocated by some of the top players in the MLB. [14] X Research source Despite the fact that this method is used by professional players, it is not recommended if you’re worried about keeping your glove in good shape for the long haul. Heating can cause the glove to shrink or crack, and as a result it may deteriorate faster with use. Do not try to microwave your glove if it contains any metal parts."
    },
    {
      "title": "Heat the glove in the oven.",
      "content": "Heat the glove in the oven. Preheat your oven to around 300 degrees. Rub some oil or shaving cream into the glove to condition it. Place it in the oven for around 3 minutes, just long enough to soften the leather and let the oil soak in. After you take the glove out of the oven, allow it to cool to the touch and then put it on and play a few passes of catch with it. [15] X Research source This is an altogether safer method of heating a new glove than microwaving it, but a lengthy stay in intense heat may still damage the glove’s materials. This is a good option for leather gloves, as the leather will soften a lot more quickly. [16] X Expert Source Haley Snyder Softball Player Expert Interview. 23 June 2021."
    },
    {
      "title": "Steam the glove.",
      "content": "Steam the glove. Steaming is arguably the safest and most reliable way to heat-treat a softball glove. Take the glove to a professional to have it done safely for a small fee, or do it yourself at home. Simply fill a stock pot with water, bring it to a boil and hold the glove over the pot to allow the steam to hit it. Turn your hand slowly to expose each part of the glove to the steam, and make sure to place a ball in the pocket so the glove will conform around it as it softens. [17] X Research source Wearing the glove while you steam it will help it shape itself to your hand, and also protect your hand from the heat of the steam. Steaming will infuse moisture into your glove gradually, without the need to soak or submerge it, which can ruin the leather."
    },
    {
      "title": "Leave the glove in a hot car.",
      "content": "Leave the glove in a hot car. If you’re breaking in a new softball glove during the summer months, wait until the next scorcher and leave the glove on your dashboard or in the trunk for a few hours. That’s it! The heat will begin to work on the leather, and the humidity in the atmosphere will loosen the glove and increase its flexibility. This is one of the easiest ways to break in a glove using heat, and there’s very little chance of damaging it in the process. [18] X Research source [19] X Research source It may be best to leave the glove out of direct sunlight, as the intensity of the sun’s rays may warp the leather or cause it to shrivel up."
    }
  ]
}