{
  "url": "https://www.wikihow.com/Confront-Someone",
  "title": "How to Confront Someone",
  "steps": [
    {
      "title": "Propose a time and place to talk in person.",
      "content": "Propose a time and place to talk in person. While it can be tempting to confront someone through a phone call or via text or email, it should be avoided if at all possible. [3] X Research source Talking face-to-face is a much more powerful way to resolve an issue efficiently and effectively. Try the following approaches for proposing a meeting to engage in a constructive confrontation: “Elise, I notice that we seem to be butting heads a lot when we meet as a group for our school project. Can we sit down and talk about our different views and see if we can find a way to collaborate so that this project gets done?” “Paul, it would be great to have the opportunity to talk about how we communicate with each other. Would you be able to find time this afternoon to sit down and have this conversation?”"
    },
    {
      "title": "Say your point with composure.",
      "content": "Say your point with composure. Keep your confrontation calm, composed, and collected. It is usually best to confront someone with a few brief, factual, succinct statements. Say what you need to say, but try not to blame the other person. Keep in mind it might not be all their fault. [4] X Research source For example, “I was upset when you gave a presentation to our boss and didn’t mention the contributions I made,” instead of “You never give me recognition for any of my work.” Reader Poll: We asked 431 wikiHow readers which rude behavior they think they need to work on most, and 57% of them said speaking in an inappropriate tone or volume. [Take Poll] Keep your tone in mind so you don’t accidentally escalate the situation."
    },
    {
      "title": "Be as open, honest, and direct as possible.",
      "content": "Be as open, honest, and direct as possible. [5] X Research source Even if you disagree with someone on a certain issue, it is important for you to be able to attempt a mature conversation regarding your issue. Reciting what you have prepared will help you present your issue in the best possible way. Don’t throw insults or call names and stay away from inflammatory comments. [6] X Research source This is a sure-fire way to guarantee that your point is not heard or respected. Maintaining as much professionalism as possible during a confrontation will lead to a more positive outcome."
    },
    {
      "title": "Listen to the other person.",
      "content": "Listen to the other person. A productive conversation depends on both parties alternating between contributing and listening. Listening to the other person will help them feel respected and heard. Even if you don’t agree with what is being said, give the person an opportunity to share their thoughts—don't just assume you know exactly what they're going to say in advance. [7] X Expert Source Tracy Carver, PhD Licensed Psychologist Expert Interview. 7 January 2021. To show that you are actively listening, look the other person in the eye while they’re speaking. Use open posture, nod on occasion, and mirror the speaker’s body language. Don’t interrupt or talk over them. This is true for every type of conversation but is especially important in a tricky social interaction like a confrontation. Try to be emotionally non-threatening. [8] X Research source Stick to the facts that support your side of the confrontation and don’t allow emotions to get involved."
    },
    {
      "title": "Expect the other person to get defensive.",
      "content": "Expect the other person to get defensive. People often will get defensive when they are confronted as it is not a pleasant feeling to be attacked. [9] X Research source Even if you feel that the points you are making are well-supported and you are presenting them in a logical and non-insulting way, it is still very likely that the person who you are confronting will put their guard up and get defensive. The best way to handle a defensive person is to listen to them. While you may not agree with the point they are making, you should give them the chance to speak their mind. Try to avoid arguing. It is easy to argue with someone who is getting defensive; however, it is undoubtedly unproductive. Try your best to keep a calm and collected demeanor instead. Letting the other person know that you're listening to what they have to say might help them not become overly defensive. [10] X Expert Source Tracy Carver, PhD Licensed Psychologist Expert Interview. 7 January 2021."
    },
    {
      "title": "Stand by your point.",
      "content": "Stand by your point. You confronted the person for a reason, and it is important that you stick to your guns even if they are disagreeing with you or acting defensively. Point out that this is not meant to start a fight, but it’s an issue that you feel needs to be dealt with head-on. If you are armed with facts and examples and present these with composure and clarity, your point should be heard. Keep in mind that your opinion matters, and being able to speak honestly is worth engaging in an uncomfortable social interaction. [11] X Research source"
    },
    {
      "title": "Identify why you are confronting the person.",
      "content": "Identify why you are confronting the person. Before you confront someone, it is important to identify why you are confronting the person and also consider if confrontation is the most effective manner in which to handle the issue. Understand that confrontation isn’t about starting a fight, it’s about addressing and resolving issues that are causing tension. [12] X Research source It is important to identify the REAL issue that is inciting this confrontation. People tend to project emotions or moods onto other people or other situations. Before you decide to confront someone, take the time to parse out what the issue is that you want to approach and why you feel like a face-to-face confrontation is the best way to go about resolving this issue."
    },
    {
      "title": "Evaluate what you are thinking and feeling.",
      "content": "Evaluate what you are thinking and feeling. Try to separate your feelings about the issue you want to talk about from other confounding situations or emotions that aren’t relevant to the discussion at hand. [13] X Research source When you do finally have your confrontation, the only statements you should make are ones that are directly relevant to the issue that spurred your confrontation. Separate problems from emotions. [14] X Research source For example, are you upset because your coworker forgot to turn in a report and caused you an extra 6 hours of work on a Friday evening? Or are you upset because you got stuck with extra work that you won’t get credit for? Don’t bring up any issues or vendettas from the past. Past actions or feelings that are not directly related to the issue at hand have no place in your confrontation. Don’t start to throw in other frustrations that you’ve kept bottled up."
    },
    {
      "title": "Decide what you want to say.",
      "content": "Decide what you want to say. You will want to explain to the person what happened, what you heard, what they did, etc. that you want to talk about. You will also want to explain why you feel the need to talk about it, and how it made you feel. Here is an example of how you may want to frame your confrontation using “I statements”: [15] X Research source “I heard from one of our colleagues that you told our boss I didn’t put in my fair share of work on the project.” (What you heard) “I feel like I worked really hard and I’m really confused as to why you said this.” (Why you want to talk about it) “I’m hurt that you would say this to a superior behind my back.” (How it made you feel)"
    },
    {
      "title": "Write your main points down on paper and rehearse them.",
      "content": "Write your main points down on paper and rehearse them. You want to make sure you say everything that’s on your mind in a logical and composed way, and this can be hard to do without some prior preparation. Writing your thoughts out on paper before your confrontation can help you to ensure you say everything you want to say to the other person. Rehearsing the main points that you want to make during your confrontation can make you feel more comfortable and prepared for the actual confrontation event. Start by rehearsing alone in a room while looking in a mirror. If you have someone that you trust, you may want to practice in front of them as well. Try to memorize your main points. This will be much more effective than reading from a piece of paper during your confrontation. Don't write out everything you want to say word-for-word. If it's too scripted, your words won't flow naturally while you're talking, and the other person is more likely to become defensive. [16] X Expert Source Tracy Carver, PhD Licensed Psychologist Expert Interview. 7 January 2021."
    },
    {
      "title": "Allow your anger to subside before your confrontation.",
      "content": "Allow your anger to subside before your confrontation. While sometimes we lash out at a person when we feel anger, we generally shy away from planned and controlled confrontation. However, a controlled confrontation can be a positive and effective way to deal with a problematic issue or person. It is important, however, to ensure that you are mentally ready for your confrontation; you want to feel calm and ready to have a discussion. Determine if you still feel anger toward the person or about the issue you want to discuss. If you still feel anger, it is likely not the best time to have a constructive confrontation. Postpone your confrontation until your anger subsides and you can have a rational, factual, and emotion-free conversation. [17] X Research source The angrier you are, the more likely that your conversation will turn into an argument. Take a few minutes to calm yourself—like by breathing deeply or listening to music—before the conversation. That will help you regulate your emotions, including anger. [18] X Expert Source Tracy Carver, PhD Licensed Psychologist Expert Interview. 7 January 2021."
    },
    {
      "title": "Remember the positive aspects of confrontation.",
      "content": "Remember the positive aspects of confrontation. While confrontation is uncomfortable, awkward, and difficult, it can also be a rewarding experience. The benefits from confrontation can improve your own emotional state as well as your relationships with others. Confrontation can release you from the burden or tension of a situation. If there is something that has been weighing on your mind, confronting the issue head-on is a great way to relieve yourself from this unnecessary stressor. Confrontation encourages honesty in a relationship. You learn more about yourself than you would otherwise, and you gain the confidence to express the way you honestly feel. In addition to encouraging honesty in a relationship, confrontation usually strengthens a relationship."
    },
    {
      "title": "Visualize a positive and productive outcome to your confrontation.",
      "content": "Visualize a positive and productive outcome to your confrontation. [19] X Research source Picture yourself coming to some sort of agreement or finding a resolution: this is the goal of your confrontation. Remember that confrontation often does have positive effects. Deciding the outcome that you want from your confrontation can help you move the conversation productively. [20] X Research source"
    },
    {
      "title": "Confront someone if the issue is recurring.",
      "content": "Confront someone if the issue is recurring. Consider the “Rule of 3”—if someone performs a behavior (such as “forgetting” their wallet, not responding to an email, etc.) 3 times, it is likely a behavioral trend and is probably worth a confrontation. [21] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Approach someone if they are causing wider problems.",
      "content": "Approach someone if they are causing wider problems. If the person you are considering confronting is causing problems in a wider arena (such as in the workplace, within the family, etc.), the situation may only be resolved through confrontation. In particular, workplace confrontations can be particularly difficult. If you feel like someone is taking advantage of you, or intentionally undermining you, it may be worthwhile to confront the person. If you are worried about confronting the person in private due to fear of the issue escalating, you may want to contact your human resources (HR) department and explain the issue to them. When confronting a co-worker, it is especially critical to be armed with facts. These facts should support your side of the issue you want to discuss. For example, you might mention specific days that your colleague came to work late or particular presentations that you feel he or she did not contribute sufficiently to."
    },
    {
      "title": "Beware of any behavior that poses a threat.",
      "content": "Beware of any behavior that poses a threat. If a person’s behavior poses a threat to him or herself and/or anyone around them, it is recommended to confront the person in order to stop the behavior from repeating or escalating. Assess the unique situation. If you feel unsafe confronting someone on your own, you might need to bring a trusted friend with you or have the confrontation in a public place. Put your own (and others') safety first."
    },
    {
      "title": "Pick your battles.",
      "content": "Pick your battles. There are definitely situations that will benefit from direct confrontation; however, this is not universally true. There is no need to confront everyone, every time. Sometimes, a smile and basic “okay,” or simply walking away from the issue is a better way to resolve tension than staging a confrontation. Because each situation and each individual is different, it is important to determine if confrontation is the right way to handle things on a case-by-case basis."
    }
  ]
}