{
  "url": "https://www.wikihow.com/Care-for-a-Toad",
  "title": "How to Care for a Toad",
  "steps": [
    {
      "title": "Get a properly sized container.",
      "content": "Get a properly sized container. You will need to purchase a ten gallon tank for one or two toads. You should generally not put more than three toads together in a tank, as many toads can become aggressive. Do not house different kinds of toads together. [1] X Research source"
    },
    {
      "title": "Buy substrate that your toad will enjoy.",
      "content": "Buy substrate that your toad will enjoy. Substrate is ground covering that is specifically made for terrariums. Putting at least three inches of substrate down on the floor of your terrarium will allow your toad to burrow when he feels like hiding. The type of substrate will depend on your specific type of toad. In general ‘frog moss’, which is sold at pet stores, makes for good covering, as does additive-free potting or topsoil purchased at a garden store. Pulverized coconut fiber is also an excellent form of substrate. If in doubt about which type of substrate you should buy, ask an amphibian specialist at a reptile or pet store. Do not use artificial turf or gravel, as these ground coverings are too harsh for your toad’s delicate skin."
    },
    {
      "title": "Give your toad some hiding spots.",
      "content": "Give your toad some hiding spots. You can choose which sort of hiding spots you would like to give your toad. You could put a stone, tree bark, or piece of slate down that your toad could burrow under. Other toad owners prefer to buy store-made hiding places or to provide their toad with an empty coconut shell to climb into. [2] X Research source"
    },
    {
      "title": "Give your toad a swimming pool.",
      "content": "Give your toad a swimming pool. The pool should be roughly half the toad’s height and four times as long as your toad. It is very important that the water you use to fill the pool is dechlorinated--toads can die if given chlorinated water. Make sure that there is a ramp of some kind that the toad can walk up when he is done frolicking in the water, as toads are relatively poor swimmers. An easy way to make a water bath for your toad is to buy a shallow plastic bowl. Make a hole in the substrate so that the bowl’s mouth is level with the rest of the substrate on the floor of the terrarium. Put a sturdy plank of some kind into the bowl so that your toad can get in and out of the water easily. [3] X Research source"
    },
    {
      "title": "Keep your toad’s home at the right temperature.",
      "content": "Keep your toad’s home at the right temperature. Again, the temperature you keep your toad’s tank at will depend on the type of toad you are housing. A toad’s preferred temperature can range from 65°F to 82°F (18°C to 27°C), depending on the type of toad you have. [4] X Research source It is advisable to place a reptile heating pad under one end of the tank if your variety of toad needs heat. Putting the pad under one end of the tank allows the toad to choose to be either on the heated side or the cooler side. For your toad’s specific temperature needs, check with your local reptile and amphibian store."
    },
    {
      "title": "Use the right sort of lights to keep your toad happy.",
      "content": "Use the right sort of lights to keep your toad happy. Toads should have roughly 12 hours of ‘sunlight’ each day. Use a daylight lamp or a low UV level lamp, but only you have provided your toad with hiding places (so he can get away from the light if he feels like it.) If you want to be able to see your toad at night, you can install a red lamp to light up his home at night. Toads are most active at night. Toads can’t see red light, so they will think they are moving around in the dark but you will still be able to see them."
    },
    {
      "title": "Make sure the terrarium has enough moisture.",
      "content": "Make sure the terrarium has enough moisture. While toads do not enjoy the water as much as true frogs do, they still need a relatively moist habitat. Use a mist bottle daily to mist one side of the tank (the side with the water bowl) so that the toad can choose whether he wants to be on wet or dry terrain. Only use water that you are positive is chlorine free!"
    },
    {
      "title": "Do not take a toad from the wild.",
      "content": "Do not take a toad from the wild. Wild animals should not be taken from their home in the wilderness, no matter how cute you think a toad’s goofy face is. The fact is, many types of toads are endangered because we have been leveling their homes and turning them into construction sites. Wild toads should be left alone in their natural habitat."
    },
    {
      "title": "Feed your toad the type of food he will want to eat.",
      "content": "Feed your toad the type of food he will want to eat. Standard toad fare includes recently fed crickets, waxworms, and mealworms. Your toad’s age will determine how often you feed him. If you have a young juvenile toad, you should feed him every day. If you have an adult toad you should plan to feed him two to three times a week. You should give your toad four to six standard-sized food items (standard being the size of a cricket) when you feed him. Toads will recognize a routine. Try to feed your toad at the same time every other day or so. Only feed your toad store-bought crickets. Crickets caught in the wild could be carrying parasites that will make your toad sick."
    },
    {
      "title": "Give your toad vitamin supplements.",
      "content": "Give your toad vitamin supplements. To give the toad the proper amount of nutrients, you should consider dusting their food with multivitamin or calcium powder. As a general rule, it's best to dust their food with calcium powder every time you feed your toad, and with multivitamin powder once a week."
    },
    {
      "title": "Make sure your toad has water.",
      "content": "Make sure your toad has water. It is incredibly important that you only give your toad dechlorinated water. Toads are very sensitive to chemicals like chlorine and you could very easily cause harm to your toad if you give him chlorinated water."
    },
    {
      "title": "Remove uneaten food every day.",
      "content": "Remove uneaten food every day. In general, toads will eat their fill within the first 15 minutes of food being introduced to their home. Wait 15 minutes or so and then remove any uneaten food. You should also change the water every day."
    },
    {
      "title": "Do not handle your toad very often.",
      "content": "Do not handle your toad very often. Toads don’t really like to handled and can get scared easily. These animals are much more of a ‘see, don’t touch’ sort of pet. When you do have to handle your toad, like when you clean his cage, you must remember to be very gentle with him. Toads are delicate creatures, despite their bumpy, rugged appearances. Never throw your toad around or drop him."
    },
    {
      "title": "Take precautions when handling your toad.",
      "content": "Take precautions when handling your toad. You should always wear gloves when you have to pick your toad up. A toad's skin is mildly toxic and will cause some people skin irritation --however, the oils on human skin can also be damaging to toads. Wash your hands after you handle your toad. [5] X Research source Toads are known to be carriers of diseases like Salmonella. You should always wash your hands after you have held your toad, particularly if you didn’t wear gloves while doing so. Make sure you wash your hands with warm water and soap."
    },
    {
      "title": "Clean your toad’s tank often.",
      "content": "Clean your toad’s tank often. You should try to clean the tank once a week. In order to do this, you must move your toad to a holding area where he cannot escape. Remove all of the old substrates, clean the tank and any props (like hiding places), fill the tank with the fresh substrate, and put everything back in its proper place (including the toad)."
    },
    {
      "title": "Know the specifics for your type of toad.",
      "content": "Know the specifics for your type of toad. While this article goes over the basics of how to keep a pet toad happy and alive, some types of toads are pickier than others. If you have any questions about your specific toad type, you can click on the name of your type of toad below. Remember, when in doubt, call on the help of a knowledgeable amphibian specialist at a reptile or pet store in your area. Fire-Belly toads American toads Wild Southern toads Gulf Coast toads Sand toads"
    }
  ]
}