{
  "url": "https://www.wikihow.com/Cook-Hot-Links",
  "title": "How to Cook Hot Links",
  "steps": [
    {
      "title": "Preheat a grill.",
      "content": "Preheat a grill. Turn on a gas grill to medium-low heat. If you're using a charcoal grill , heat the briquettes until they're hot and ashy. Dump the coals onto one half of the grill grate. [1] X Research source"
    },
    {
      "title": "Arrange the hot links on the grill.",
      "content": "Arrange the hot links on the grill. Place the hot links on the grill so they're not directly over the coals. Put the lid on the grill. [2] X Research source"
    },
    {
      "title": "Turn and grill the hot links for 8 to 10 minutes.",
      "content": "Turn and grill the hot links for 8 to 10 minutes. Lift the lid and use long tongs to turn the hot links every few minutes. This will ensure that the hot links brown easily as they grill. Grill the hot links until they're completely hot throughout. This should take 8 to 10 minutes. [3] X Research source"
    },
    {
      "title": "Serve the grilled hot links.",
      "content": "Serve the grilled hot links. Remove the hot links from the grill and place them into sausage or hot dog buns. Top the hot links with your favorite condiments (such as barbecue sauce, ketchup, mustard, coleslaw, or relish). [4] X Research source You can store the grilled hot links in the refrigerator in an airtight container for 3 to 4 days."
    },
    {
      "title": "Set a hot link on a plate.",
      "content": "Set a hot link on a plate. Get out a microwave-safe plate and put 1 hot link on it. Lay a paper towel over the hot link. [5] X Research source If you want to microwave several hot links, microwave them 1 at a time so they cook evenly."
    },
    {
      "title": "Microwave the hot link for 30 to 35 seconds.",
      "content": "Microwave the hot link for 30 to 35 seconds. You should hear the hot link sizzle and swell up a little as it becomes completely hot. [6] X Research source"
    },
    {
      "title": "Rest the hot link for 1 minute.",
      "content": "Rest the hot link for 1 minute. Turn off the microwave and let the hot link rest on the plate for 1 minute before you serve it. [7] X Research source"
    },
    {
      "title": "Serve the microwaved hot link.",
      "content": "Serve the microwaved hot link. Wear oven mitts to remove the hot link from the microwave and serve it immediately. You could place it in a bun and add your favorite toppings. Or cut up the hot link and add it to pasta, gumbo, or stew. [8] X Research source You can store the grilled hot links in the refrigerator in an airtight container for 3 to 4 days."
    },
    {
      "title": "Preheat the oven",
      "content": "Preheat the oven and set up roasting tray. Turn the oven on to 350 °F (177 °C). Get out a rimmed baking sheet and set a wire rack on it."
    },
    {
      "title": "Cut the hot links if they're still connected.",
      "content": "Cut the hot links if they're still connected. If you bought hot links that are still strung together, use a sharp knife or scissors to cut in between the links."
    },
    {
      "title": "Arrange the hot links on the wire rack.",
      "content": "Arrange the hot links on the wire rack. Place as many hot links as you want to roast on the wire rack. Leave a few inches (about 5 cm) between each link so they brown evenly."
    },
    {
      "title": "Roast the hot links for 10 minutes.",
      "content": "Roast the hot links for 10 minutes. Place the wire rack on the baking sheet in the preheated oven and cook the hot links for 10 minutes.."
    },
    {
      "title": "Turn and roast the hot links for 10 more minutes.",
      "content": "Turn and roast the hot links for 10 more minutes. Use tongs to turn the hot links over and put them back in the oven. Roast them until they're completely browned on both sides and hot all the way through. This should take another 10 minutes."
    },
    {
      "title": "Serve the roasted hot links.",
      "content": "Serve the roasted hot links. Wear oven mitts to remove the wire rack and baking sheet from the oven. Use caution because grease may have dripped onto the baking sheet while the hot links were cooking. Serve the hot links with your favorite sides or cut the links up to use as part of another entree. Store leftover roasted hot links in the refrigerator. You can keep them in an airtight container for 3 to 4 days."
    },
    {
      "title": "Bring water to a boil in a skillet.",
      "content": "Bring water to a boil in a skillet. Pour 2/3 cup (160 ml) of water into a skillet that will be large enough to hold your hot links. Set the skillet on the stove and turn the heat to high. [9] X Research source"
    },
    {
      "title": "Add the hot links and reduce the heat.",
      "content": "Add the hot links and reduce the heat. Once the water boils, slowly lower as many hot links as you want to cook into the skillet. Try to fit them in a single layer. Turn the heat down to medium so the water bubbles gently. [10] X Research source"
    },
    {
      "title": "Simmer the hot links for 5 to 6 minutes.",
      "content": "Simmer the hot links for 5 to 6 minutes. Put the lid on the skillet and let the hot links bubble gently for 5 to 6 minutes. [11] X Research source"
    },
    {
      "title": "Turn and simmer the hot links for 5 to 6 more minutes.",
      "content": "Turn and simmer the hot links for 5 to 6 more minutes. Use an oven mitt to take the lid off of the skillet. Use tongs to turn the hot links over and return the lid to the skillet. Keep simmering the hot links until they're completely hot throughout. This should take another 5 to 6 minutes. [12] X Research source"
    },
    {
      "title": "Brown the hot links.",
      "content": "Brown the hot links. If you'd like slightly crispy and browned hot links, pour the hot water out of the skillet. Let the hot links continue to cook in the skillet over medium heat for 3 to 4 minutes. Turn the hot links occasionally so they brown evenly."
    },
    {
      "title": "Serve the hot links.",
      "content": "Serve the hot links. Remove the hot links from the skillet and serve them while they're still hot. Store any leftover hot links in the refrigerator for 3 to 4 days. [13] X Research source"
    }
  ]
}