{
  "url": "https://www.wikihow.com/Clean-a-Plastic-Bottle",
  "title": "6 Quick and Easy Ways to Wash Your Plastic Water Bottle",
  "steps": [
    {
      "title": "Fill your bottle ⅕ of the way with white vinegar, then add water.",
      "content": "Fill your bottle ⅕ of the way with white vinegar, then add water. Be sure to use distilled white vinegar instead of something like apple cider vinegar. Once you’ve added the vinegar, fill your bottle to about the halfway point with warm water. [1] X Research source White vinegar will sanitize your water bottle as well as get rid of any odors. Another option is to use ¼ cup (59 ml) of hydrogen peroxide and not add any water. [2] X Research source Use some of the white vinegar solution to clean around the outside of your bottle. For example, if you have a bottle with a twist-off lid, dip a paper towel or napkin into the solution and use it to sanitize the rim of the bottle where you usually put your mouth."
    },
    {
      "title": "Shake your water bottle then let it sit overnight.",
      "content": "Shake your water bottle then let it sit overnight. Keep shaking your bottle for about 30 seconds to make sure that the entire interior surface is coated with the vinegar-water solution. Then, leave the bottle to sit overnight so that the vinegar has an ample amount of time to sanitize it. [3] X Research source"
    },
    {
      "title": "Rinse out the bottle with clean water and completely dry it.",
      "content": "Rinse out the bottle with clean water and completely dry it. Dump out the vinegar-water solution and rinse out your bottle once last time with clean, warm water. Then, use a clean kitchen towel or paper towel to completely dry out the inside. Or, let your bottle sit out with the lid off to air dry. If there are still some stubborn spots, go in with a bottle brush or something like a toothbrush to scrub at those spots. Use some of the vinegar solution to also clean the bottle’s lid, mouthpiece, or any other accessories that come with it, such as a reusable straw. Use a straw brush or a pipe cleaner to clean out reusable straws and rubber mouthpieces."
    },
    {
      "title": "Mix ¼ cup (68 g) of baking soda with 4 cups (946 ml) of water.",
      "content": "Mix ¼ cup (68 g) of baking soda with 4 cups (946 ml) of water. Make sure to use warm water for this mixture. Then, pour the mixture into your water bottle until it reaches the top. [4] X Research source If you have any cleaning solution left over, put the water bottle lid, reusable straw, and any other accessories in it to soak."
    },
    {
      "title": "Let the solution sit overnight, then scrub out your bottle.",
      "content": "Let the solution sit overnight, then scrub out your bottle. After letting the ingredients activate overnight, dump out the solution and go in with a bottle brush , sponge, or toothbrush to scrub away any stubborn buildups on the inside of the bottle. [5] X Research source Use a straw brush or pipe cleaner to clean out the inside of reusable straws or the mouthpiece on the lid of your water bottle."
    },
    {
      "title": "Rinse everything with warm water, then dry your bottle.",
      "content": "Rinse everything with warm water, then dry your bottle. Give everything one last rinse, then use a clean towel or paper towel to thoroughly dry the inside and outside of your bottle and any accessories. Or, leave your bottle disassembled and set it out to air dry overnight. [6] X Research source Don’t store your bottle or put the lid back on when it’s still wet since this can cause it to grow bacteria and mildew that’ll render your hard work useless."
    },
    {
      "title": "Fill the bottle halfway with warm water and add dish soap.",
      "content": "Fill the bottle halfway with warm water and add dish soap. Add 3-5 drops of dish soap to the bottle, then screw the lid back on. Any mild dish soap, preferably without added scents, will work for cleaning your plastic bottle. [7] X Research source Clean your bottle with soap and water at the end of each day, especially if you bring it to a place that might have a lot of germs, such as the gym, your office, or school. Avoid leaving water and other beverages in your bottle for a long period of time and dump out liquids whenever you’re not using your bottle."
    },
    {
      "title": "Shake your water bottle to mix the soap and water.",
      "content": "Shake your water bottle to mix the soap and water. For a speedy clean, shake the soapy water around in your bottle with the cap on for about 30 seconds. Then, dump the soapy water out and rinse your bottle with clean, warm water."
    },
    {
      "title": "Scrub any stubborn buildup with a sponge or bottle brush.",
      "content": "Scrub any stubborn buildup with a sponge or bottle brush . Use a bottle brush to reach deep into the bottle, paying extra attention to the bottom and the rim near the opening. Squeeze a bit more dish soap on your brush if the spots are particularly tricky to scrub away. When you’re done, rinse the bottle one more time with clean water. If you don’t have a brush, use a sponge to clean near the top of the inside of the bottle or a clean toothbrush (that you don’t use to brush your teeth) to get spots closer to the bottom. Use a straw brush or pipe cleaner to clean out the small crevices in your bottle’s lid and in the insides of any reusable straws or plastic or rubber mouthpieces you have."
    },
    {
      "title": "Leave your bottle open to air dry.",
      "content": "Leave your bottle open to air dry. It’s recommended to wash your bottle in the evening so you can leave it out overnight to air dry. If you can’t do this, dry your bottle completely with a clean dish towel or paper towel before using it. Leave the lid off of your water bottle when you let it air dry. Screwing the cap on while there’s still water inside can cause bacteria to grow."
    },
    {
      "title": "Check your bottle for a dishwasher-safe symbol.",
      "content": "Check your bottle for a dishwasher-safe symbol. Most products today are safe in the dishwasher, but check your bottle just to be sure. Take the top parts off of the bottle and be sure those go into the dishwasher too. The symbol usually looks like a small picture of a dishwasher, or illustrations of dishes or cutlery. [8] X Research source If your bottle also comes with a reusable straw, make sure that it’s also dishwasher-safe. If you’re unsure about whether your bottle and its accessories can be put in the dishwasher, check the site of the manufacturer your bottle came from."
    },
    {
      "title": "Load your bottle into the top rack of your dishwasher.",
      "content": "Load your bottle into the top rack of your dishwasher. Unscrew the lid from your bottle and remove any other accessories, such as a reusable straw. Then, place the separate pieces onto the top rack. Many dishwashers have a heating element in the bottom for the dryer setting that can warp or melt plastic if it’s on the bottom rack. [9] X Research source"
    },
    {
      "title": "Run the dishwasher and select the drying cycle as well.",
      "content": "Run the dishwasher and select the drying cycle as well. Add your detergent and run your dishwasher with the plastic bottle on the top rack just like you would regularly run a load of dishes. Leave the dryer setting on so that the bottle gets completely dried. [10] X Research source Or, take the water bottle out as soon as it’s done being washed and dry it thoroughly with a kitchen towel or paper towel."
    },
    {
      "title": "Create a solution of 1 part bleach and 9 parts water.",
      "content": "Create a solution of 1 part bleach and 9 parts water. You only need a little bit of bleach to give your water bottle a deep clean and sanitize it thoroughly. Pour this mixture into your water bottle, place the lid back on, and gently swirl the water bottle around to make sure the entire inside is covered in the solution."
    },
    {
      "title": "Scrub the inside of the bottle and any accessories.",
      "content": "Scrub the inside of the bottle and any accessories. Use a bottle brush to scrub at bacteria or potential mold on the inside of your bottle. Then, use a straw brush to clean out the insides of reusable straws or the mouthpiece on your bottle. Finally, dip a paper towel or sponge in the solution and wipe down the outside of your water bottle. [11] X Research source If you don’t have a bottle brush or straw brush, items like an old toothbrush, sponge, or pipe cleaner will work just as well."
    },
    {
      "title": "Completely rinse off the bleach solution and dry your bottle.",
      "content": "Completely rinse off the bleach solution and dry your bottle. Bleach is toxic if ingested, so thoroughly rinse the inside and outside of your bottle, as well as any accessories you washed, with clean, warm water. Rinse everything 2 or 3 times to really make sure you’ve gotten rid of all of the bleach, then dry everything with a dish towel or paper towel. [12] X Research source Another option is to leave your water bottle to air dry overnight with the lid off."
    },
    {
      "title": "Fill your bottle with clean water and drop in 1 tablet.",
      "content": "Fill your bottle with clean water and drop in 1 tablet. Many denture tablets contain common household ingredients you might use during cleaning, such as baking soda, peroxide-based bleach, and soda ash. If you also need to clean your bottle’s lid and other accessories, fill a bowl with water and add another tablet. Then, place your lid, straw, and other accessories in there to soak. [13] X Research source"
    },
    {
      "title": "Let the tablet dissolve for around 30 minutes.",
      "content": "Let the tablet dissolve for around 30 minutes. Denture tablets are great because all you have to do is sit and wait. While most tablets will take around 30 minutes to dissolve, make sure to check the specific instructions on the tablets you bought to see how to use them. [14] X Research source"
    },
    {
      "title": "Dump out the solution and scrub off any residue.",
      "content": "Dump out the solution and scrub off any residue. Use a bottle brush , sponge, or toothbrush to scrub the inside of your water bottle and make sure to get all the way toward the bottom and around the inside of the rim. Then, use a straw brush or something like a pipe cleaner to get in the smaller spaces in straws and mouthpieces."
    },
    {
      "title": "Rinse out your bottle and thoroughly dry it.",
      "content": "Rinse out your bottle and thoroughly dry it. Use clean, warm water to rinse off the inside and outside of your water bottle, as well as any accessories you cleaned. Then, dry everything off with a dishcloth or paper towel, or leave your water bottle disassembled and let everything air dry overnight. [15] X Research source"
    }
  ]
}