{
  "url": "https://www.wikihow.com/Be-a-Good-Student-Without-Being-Teacher%27s-Pet",
  "title": "How to Be a Good Student Without Being Teacher's Pet",
  "steps": [
    {
      "title": "Ask questions in moderation.",
      "content": "Ask questions in moderation. Instead of asking questions every time your teacher finishes their sentence, limit them to one or two insightful and relevant questions. If you want, you can prepare these questions before class. They could be insights from last night’s homework, or general clarifying questions. By limiting your questions, you are allowing other students the opportunity to ask the teacher questions, as well. [1] X Expert Source Ashley Pritchard, MA Academic & School Counselor Expert Interview. 4 November 2019. When the teacher announces something, wait a few seconds to see if others have the same question before you ask your question. If you have more questions, speak with your teacher after class or schedule a time to talk with your teacher instead of asking too many questions during class."
    },
    {
      "title": "Let others volunteer.",
      "content": "Let others volunteer. Volunteering to help your teacher clean the chalkboard, pass out worksheets, or send a message to another class once in a while is fine. However, limit these opportunities to once or twice a week. Let other students volunteer their time to help the teacher with smaller tasks. Instead, volunteer for the tasks that you enjoy doing, and leave the other ones to other students. For example, if you like passing out worksheets, then just volunteer to pass out worksheets. Let other students clean the chalkboard, send messages, or take attendance."
    },
    {
      "title": "Sit in a different spot.",
      "content": "Sit in a different spot. Unless you have poor eyesight or poor hearing, it would not hurt to sit in the middle or the back of the classroom from time to time. Sure, sitting in the front of the class every day makes you look engaged and ready to learn, but you do not want to monopolize the front seats. There is nothing wrong with being a teacher's pet, but don't act like you aren't trying to look like a teacher's pet, because it's cringey. Be confident and have pride with being a teachers pet if that is what you want, because there is nothing wrong with that. If someone has a problem with that, then they are just being jealous and its cringey in itself to be jealous. By sitting in the middle or the back of the class, you are giving others the chance to sit in the front of the class. Remember that the teacher can see you no matter where you sit, and you can still be engaged even from the back of the classroom."
    },
    {
      "title": "Don’t go out of your way.",
      "content": "Don’t go out of your way. A lot of students get labeled “teacher’s pet” because they go out of their way to impress the teacher. They try their very hardest to please the teacher by bringing them gifts, complimenting them, or by taking their side versus the class’ side. These are not bad things to do, but try to limit your compliments and gifts to rare occasions. [2] X Research source For example, only give your teacher gifts during holidays, or when it is their birthday. Compliment your teacher when they truly deserve it, for example, when you find their lesson particularly interesting."
    },
    {
      "title": "Don't brag about your grades.",
      "content": "Don't brag about your grades. You should feel proud about your grades, and the time you spent studying to get them. However, bragging to your peers about how well you did in class can be bothersome. When you brag, you are emphasizing differences between you and your classmates and friends. This creates distance between you and them, and your peers might start to resent you. [3] X Research source When talking about your achievements, highlight commonalities between you and your peers. For example, instead of saying, \"I got the highest grade in the class,\" say, \"Like you guys, I worked really hard on this project, and I worked even harder to get the grade that I got.\""
    },
    {
      "title": "Avoid being a tattletale.",
      "content": "Avoid being a tattletale. Don't go out of your way to inform the teacher about every little thing students do. Instead, use your judgment to decide whether it is important enough to tell your teacher. If it is, then tell your teacher discreetly, instead of outing the person in front of the whole class. [4] X Research source Try to remember that it is your teacher’s job to keep every one in line, not yours."
    },
    {
      "title": "Don't worry about what others think of you.",
      "content": "Don't worry about what others think of you. Don't feel like you need to make major personal changes, or risk your academic success, to get others to like you or stop calling you \"teacher's pet.\" Remember that true acceptance comes from within. Therefore, as long as you accept who you are, what others think of you is a small matter. [5] X Research source Plus, what others think about you is out of your control. Instead, focus your energy on bettering yourself and moving forward instead of changing what others think of you."
    },
    {
      "title": "Break the rules.",
      "content": "Break the rules. It is ok to break the rules once in a while. One little mark is not going to tarnish the reputation your teacher has of you. If anything, it makes you seem more human and relatable to your peers. Don’t be afraid to whisper to your friend, pass a note, or make a joke during class. As long as you don’t make a habit out of it, and keep it moderation, you should be fine."
    },
    {
      "title": "Make friends.",
      "content": "Make friends. A tell-tale sign that you are a teacher’s pet is if your only friend is the teacher. This isn’t necessarily bad, but it can be lonely at times. Try to branch out and befriend other students. Make friends with students whom you have things in common with. Perhaps you love to eat chocolate, read books, or love the Christmas season. These are pretty common things that you can use to connect with other people. [6] X Research source Revealing tiny secrets that are slightly embarrassing is a good way to deepen a friendship. By sharing intimate details about yourself, you are showing the other person that you are human, and thus, relatable."
    },
    {
      "title": "Be motivated.",
      "content": "Be motivated. A great student is a student that is motivated, and you can be motivated without being teacher’s pet. Instead of channeling your energy into pleasing the teacher (we know it takes a lot of energy and time), channel your energy into your interests. For example, try starting a photography, book, fashion club, or any kind of club at school. If you like planning events, you can help plan school events, like pep rallies, Christmas parties, and field days, for example."
    }
  ]
}