{
  "url": "https://www.wikihow.com/Catch-Groudon-Without-Using-a-Master-Ball",
  "title": "How to Catch Groudon Without Using a Master Ball",
  "steps": [
    {
      "title": "Buy 10 Timer Balls.",
      "content": "Buy 10 Timer Balls. These can be obtained from Rustboro City Poké Mart."
    },
    {
      "title": "Go to the Cave of Origin in Sootopolis City.",
      "content": "Go to the Cave of Origin in Sootopolis City. Have at least level 35 to 45 Pokémon, preferably with high hit points."
    },
    {
      "title": "Go inside.",
      "content": "Go inside. Wander your way to Groudon (Level 45) and your Red Orb will start to glow. This will cause Groudon to walk toward you."
    },
    {
      "title": "Groudon's moves are Bulk up, Fire Blast, Slash, and Earthquake.",
      "content": "Groudon's moves are Bulk up, Fire Blast, Slash, and Earthquake. Send out a Flying-type first and stall the Groudon. The Timer Balls' catch rate doesn't go up if the Pokémon is weak, just if a lot of turns have been taken, so the more you stall, the better chance you have at catching it."
    },
    {
      "title": "Eventually after a decent amount of turns, you should catch him with one of your timer balls.",
      "content": "Eventually after a decent amount of turns, you should catch him with one of your timer balls."
    },
    {
      "title": "Get a Quick Ball and loads of Timer Balls.",
      "content": "Get a Quick Ball and loads of Timer Balls."
    },
    {
      "title": "Get some Pokémon with no weakness to his moveset and high hp.",
      "content": "Get some Pokémon with no weakness to his moveset and high hp."
    },
    {
      "title": "Find Groudon.",
      "content": "Find Groudon. Start battle. His standard moveset = Earthquake, Fire Blast, Solarbeam, Slash."
    },
    {
      "title": "Throw Quick Ball on the first turn.",
      "content": "Throw Quick Ball on the first turn."
    },
    {
      "title": "If it doesn't work, wait 10+ turns, then start throwing Timer Balls.",
      "content": "If it doesn't work, wait 10+ turns, then start throwing Timer Balls. If you run out, revert to the previous save."
    }
  ]
}