{
  "url": "https://www.wikihow.com/Color-Stubble",
  "title": "How to Color Stubble",
  "steps": [
    {
      "title": "Choose a beard dye that is a shade lighter than the color you want to achieve.",
      "content": "Choose a beard dye that is a shade lighter than the color you want to achieve. The dye will look a lot darker than it does on the box when you’re done applying it. Always pick a shade that’s a bit lighter than what you’re envisioning. [1] X Research source If you want a more natural look, make sure you pick a color that’s close to your natural hair color. For instance, if you have light brown hair, jet-black stubble probably isn’t going to look natural. You can buy beard dye online or wherever they sell men’s grooming products like hair dye and shaving supplies, such as a supermarket or pharmacy. Never use normal hair dye on your stubble. Stubble has a much different consistency than the hair on your head, so it requires a special type of dye."
    },
    {
      "title": "Start with an unwashed face and stubble.",
      "content": "Start with an unwashed face and stubble. The natural oils in your beard hairs help it absorb the dye and also help prevent skin irritation. Washing your face will remove these oils, so always apply beard dye without showering or washing your stubble beforehand. Try to wait at least a day since you last showered or washed your stubble before applying the beard dye. For example, you could do it on a Saturday morning if the last time you washed your facial hair was Friday morning. If you absolutely need to shower on the day you’re planning to dye your stubble before you get a chance to do it, you could just wash your body from the neck down and avoid getting your head and face wet."
    },
    {
      "title": "Mix the color base and the color developer in equal parts in the provided tray.",
      "content": "Mix the color base and the color developer in equal parts in the provided tray. Squeeze equal amounts of the color base cream and the developer cream from their respective tubes into the tray that comes with them. Stir them together using the backside of the applicator brush until the liquid is a uniform color. [2] X Research source Always read the instructions on your beard dye kit’s box to check for any special instructions about preparing the dye. You can get multiple applications out of a single box of beard dye, so don’t squeeze out everything from the tubes at once. There’s no way to know exactly how much beard dye you need your first time, so just start with a little bit and mix more later on if you need more to cover all your stubble."
    },
    {
      "title": "Brush the dye lightly onto your stubble using the provided applicator brush.",
      "content": "Brush the dye lightly onto your stubble using the provided applicator brush. Dip just the tips of the bristles into the mixed dye. Brush it all over your stubble using light downward strokes, dipping the brush back into the dye as needed, until you cover all your stubble. [3] X Research source You can also apply the dye with a comb or a disposable mascara wand. [4] X Expert Source Matt King Director of Education, Fox and Jane Salon Group Expert Interview. 31 August 2021. Try not to press the bristles of the brush all the way down through your stubble onto your skin to avoid staining the skin underneath your facial hair. Brush it onto the hairs themselves as lightly as possible. Do your best not to get the dye on any of your bare skin adjacent to your stubble or elsewhere because it will dye any skin it comes into contact with. Apply the dye to the lightest or patchiest areas of your stubble first, so it works there the longest. Keep in mind that the dye will stain anything else it comes into contact with, so don’t do this while you’re wearing your favorite shirt! You can do it shirtless or in an old T-shirt that you don’t care about."
    },
    {
      "title": "Wipe dye off your skin around the edges of your stubble with alcohol wipes.",
      "content": "Wipe dye off your skin around the edges of your stubble with alcohol wipes. Use any kind of alcohol-based wipes meant for your skin, such as some kind of makeup removal wipe. Carefully wipe along all the borders where your stubble meets your bare skin to remove any dye that spilled over onto your skin. [5] X Research source Try to do this whole process as quickly as possible. The dye only needs about 5 minutes or so to color your stubble, so ideally you should be ready to wash it out just a few minutes after you apply it. You can also use the wipes to remove dye from anywhere else on your skin like your neck or chest."
    },
    {
      "title": "Jump in the shower and wash the dye out after about 5 minutes.",
      "content": "Jump in the shower and wash the dye out after about 5 minutes. The recommended amount of time to leave beard dye in is usually just 5 minutes, but double-check the instructions for your dye kit as times may vary. Get in the shower after the required amount of time is up and wash your stubble thoroughly with shampoo or soap to remove all the dye. You can leave the dye for a few minutes longer if you have a lot of white stubble or you just want a bit darker of a shade, but it generally doesn’t work for any longer than about 10-15 minutes. It can also damage your hair or irritate your skin if you leave it in too long. The dye will last for 2 weeks or so, or until you trim your stubble. You can just apply more using the same method whenever the color starts to fade. Make sure not to get any dye in your eyes, mouth, or nose. [6] X Expert Source Matt King Director of Education, Fox and Jane Salon Group Expert Interview. 31 August 2021. Don't use your normal skincare products for at least 24 hours after applying the dye—these could irritate your skin. [7] X Expert Source Matt King Director of Education, Fox and Jane Salon Group Expert Interview. 31 August 2021."
    },
    {
      "title": "Pick a shade of brush-on beard color that matches your natural stubble color.",
      "content": "Pick a shade of brush-on beard color that matches your natural stubble color. Brush-on beard color is basically like mascara for your beard. Choose a shade from the available colors that is the closest to your natural facial hair color as possible to achieve a natural look. You can purchase brush-on beard color online. It’s available in colors like brown, brown/black, brown/auburn, and black. Brush-on beard color is an easy-to-use alternative when you want to color your stubble without the hassle of mixing and applying beard dye. Keep in mind that it is also less permanent and each application only lasts a day."
    },
    {
      "title": "Wash and dry your beard before applying brush-on color.",
      "content": "Wash and dry your beard before applying brush-on color. Brush-on beard color works best on clean, dry stubble. Thoroughly wash your face and facial hair in the shower or in front of the sink using soap, then pat it dry and wait until your stubble is completely air dry to put the color on. The natural oils on your skin and in your facial hair can repel the colorant, so it may not stick as well if you don’t wash your stubble first. Once you apply the color, it is water-resistant. You don’t have to worry about it rinsing off in the rain or if you splash some water on your face throughout the day."
    },
    {
      "title": "Brush the beard color onto your stubble using short, brisk upward strokes.",
      "content": "Brush the beard color onto your stubble using short, brisk upward strokes. Unscrew the lid, pull out the brush, and wipe off any excess colorant on the rim of the tube. Brush it onto your stubble using upward strokes wherever you want to apply the color. [8] X Research source You can either color all your stubble or just use the colorant to touch up certain areas where your stubble is patchy or has white and gray hairs. Play around with it to find the technique that works best for you! Dip the brush back into the tube as needed whenever you run out of colorant. You don’t have to worry about brush-on beard color staining your skin. It wipes off easily if you get it anywhere other than your stubble."
    },
    {
      "title": "Rub a beard brush over the areas you colored using downward strokes.",
      "content": "Rub a beard brush over the areas you colored using downward strokes. Brush your stubble all over if you colored it all or just go over the areas you colored if you only touched up certain spots. This evens out areas where there is more or less color to achieve a more blended shade. [9] X Research source A beard brush is just a medium-stiff-bristled brush used to groom a beard. You can get one online or at a men’s grooming supply shop or barber shop if you don’t already have one."
    },
    {
      "title": "Pat a drop of argan oil all over your stubble to give it a natural sheen.",
      "content": "Pat a drop of argan oil all over your stubble to give it a natural sheen. Squeeze a drop of argan oil out from a vial onto the palm of one of your hands, then rub the palms of your hands together to get it all over them. Pat your stubble gently all over to apply the oil. [10] X Research source Argan oil is a natural plant oil made from the kernels of the argan tree that is used often for cosmetic purposes. You can buy it online or wherever they sell essential oils. You could also use any kind of beard oil blend you have handy."
    },
    {
      "title": "Wash the beard color out before you go to bed.",
      "content": "Wash the beard color out before you go to bed. The colorant rubs off on your pillows and sheets if you don’t wash it off. Give your face a thorough wash and rinse out all the brush-on beard color before you hit the hay to avoid staining your bedding. [11] X Research source If you want to color your stubble every day, just use this same method each day. A single tube of colorant may last you about a month if you use it daily."
    }
  ]
}