{
  "url": "https://www.wikihow.com/Be-a-Good-Boyfriend",
  "title": "21 Ways to Be a Better Boyfriend: Everything You Need to Know",
  "steps": [
    {
      "title": "Be upfront about your expectations and desires for the relationship.",
      "content": "Be upfront about your expectations and desires for the relationship. It might feel like everyone is playing it cool and avoiding labels—but that can lead to misunderstandings. Transparency is the best way to show someone you’re serious about the relationship! Let your partner know how you view the relationship and what your intentions are going forward. [1] X Research source For example, if you’re dating someone casually and want to be official (or exclusive), say so openly. That way, there’s no possibility of being misunderstood. Tell them how you feel going forward, too! Don’t make your partner wonder where they stand with you or how much you like them. Tell them directly how you feel about them, and remind them often how much you care."
    },
    {
      "title": "Make one-on-one time a priority to show your commitment.",
      "content": "Make one-on-one time a priority to show your commitment. Being a good boyfriend means going out of your way to spend time with your partner, just the two of you together. So, schedule time each week to spend with them—whether that means dates, meals, or even just setting aside an hour to watch your favorite show together. [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Try sitting down with your partner once a week (or month) to determine when you can spend time together. Relationship expert Joshua Pompey emphasizes the importance of putting the effort in. Take the initiative to plan dates, and try choosing activities that show you’re paying attention to your partner’s interests."
    },
    {
      "title": "Honesty is always the best policy in relationships.",
      "content": "Honesty is always the best policy in relationships. If you're honest from the beginning of your relationship, then you'll be less likely to run into trouble (or miscommunications) down the line. Then, accept their honesty as well; sometimes the truth isn’t always what you might want to hear, but it’s important to respect their honest perspective instead of rejecting it. [3] X Research source Tell them what they need to know without overwhelming them. For example, if you had a serious past relationship, you can talk about it without revealing every detail about your ex. Temper your honesty with kindness . Don't feel like every response should seem like a compliment; just offer an alternative. For example, if they ask you if you like something they’re trying on, say something like, “It might work, but the blue is my favorite so far. It shows off your eyes and stunning personality!”"
    },
    {
      "title": "Give your partner reasons to trust you, too.",
      "content": "Give your partner reasons to trust you, too. Trust should form the foundation of your relationship. This will help you create a stronger and more open relationship and give you a greater understanding of their feelings and needs. Give your partner the benefit of the doubt, and believe them when they tell you what they’re doing or where they’ve been. [4] X Research source Show that you trust your partner by telling them something many people don't know about you. Secure their trust in you by showing your concern if they tell you something personal and important to them. If you start to feel jealous, make an effort to deal with your jealousy in a healthy way. Ask for reassurance from your partner instead of letting jealousy affect the relationship."
    },
    {
      "title": "Show them you’re interested and fully engaged when they’re talking.",
      "content": "Show them you’re interested and fully engaged when they’re talking. Instead of thinking about the next thing you want to say (or something else entirely) while your partner talks, focus on listening to them . Dating coach John Keegan says it’s important to let your partner express themselves (and pay attention) so they feel heard and understood. If your partner tells you about an important experience, make a mental note. Remembering is just as important as acknowledging their words! Don’t assume you know how your partner feels, even if you’ve been together for a while. Be curious and ask them questions to learn more about them. Use those questions to get to know your partner’s innermost thoughts, feelings, dreams, and fears."
    },
    {
      "title": "Strike a balance between speaking and listening.",
      "content": "Strike a balance between speaking and listening. If you’re too quiet, they might think you’re losing interest—but if you’re so talkative they can’t get a word in edgewise, they might get frustrated! Remember that conversations (and relationships) are about give and take; they can’t succeed when they’re one-sided. [5] X Research source Of course, there’ll be occasions when you talk a lot (like when something exciting or important happens) or when you’re quiet (like when something bad happens). Overall, though, just do your best to aim for balanced conversations. Ask your partner about their day! Find out what’s happening in their world—and, in turn, become their confidant. Conversations like this can build intimacy and trust."
    },
    {
      "title": "Make the goal of each argument to ensure you both feel understood.",
      "content": "Make the goal of each argument to ensure you both feel understood. Psychotherapist Kelli Miller explains that it’s important to communicate respectfully instead of avoiding conflict. Wait until you and your partner are calm, and be honest about what’s bothering you while using a neutral tone. Don’t try to “win” the dispute or prove your point; simply explain your perspective and listen to theirs. Miller also recommends starting off with something positive before saying what’s bothering you. For example, you could say, “I love how much fun we have together,” before saying, “One thing I’ve noticed is that you’re on your phone a lot, and it would mean a lot to me if you were more present.” Remember not to yell at your partner, tear them down, or make mean-spirited jokes. Yelling can be frightening for them, and verbal attacks can really hurt their self-esteem. Learn to apologize , take responsibility for your actions, and validate your partner’s feelings. Don’t say things like, “I’m sorry you feel that way,” or “Sorry if I hurt you.”"
    },
    {
      "title": "Compromise is a big part of successful communication.",
      "content": "Compromise is a big part of successful communication. If you and your partner can't disagree without getting into a big fight or one person immediately giving in to the needs of the other, there’s a problem. To compromise, talk about your needs and wants while understanding where your partner is coming from (instead of ignoring their side of the story). [6] X Research source After you and your partner discuss your thoughts on a certain situation, you can work together to make a pros and cons list and decide what’s best for both of you. Sometimes, you and your partner might have to give in to one another. That's okay, as long as you're taking turns. If they pick the movie for date night, for example, you should pick the dinner location next time."
    },
    {
      "title": "Support can build a sense of security in the relationship.",
      "content": "Support can build a sense of security in the relationship. Do your best to uplift your partner in order to build their confidence. Cheer them on, show interest in what they tell you, be available to them, and be attentive to their needs. Make them feel like they can do anything simply by reminding them that you believe in them. [7] X Research source For example, be there when they have to study for a big exam or finish college applications, or when they're stressed about anything else that can affect their future. If they're having a busy week or month, support them by doing small favors, like picking up lunch or giving them a ride to class, to make their days easier. Help them solve problems if they need a hand! When your partner is going through a difficult time, they might need you to be a sounding board or a helper to talk them through the issue."
    },
    {
      "title": "Try to put yourself in their shoes when they’re upset.",
      "content": "Try to put yourself in their shoes when they’re upset. Understand where they’re coming from; if it means something to them, it should mean something to you. It doesn’t matter if you wouldn’t be interested in the issue if it weren’t for them—a relationship is about sharing experiences and being supportive. Don’t dismiss their feelings because you think it’s not that big of a deal. [8] X Research source If you don't feel like you’re genuinely sorry or empathizing with them , try to change how you think and consider the situation from their perspective. Sometimes, they may just want to cry and to be comforted. In those cases, don’t try to fix their problems right away. Wait for them to deal with their emotions before being practical. If they're upset, it's important to ask, \"Do you want to talk about it?\" And if they're not ready to talk about it yet, don't pry."
    },
    {
      "title": "Demonstrate your love for your partner with affection.",
      "content": "Demonstrate your love for your partner with affection. Small touches, hugs, kisses, and maybe a little public display of affection (PDA) are just some of the ways you can connect through affection. Many times, even a light touch is appreciated; kiss them on the forehead or hug them from behind so you don’t interrupt what they’re doing. You could even just send a romantic text! [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Upon seeing them for the first time in a couple of days, you might say, \"I missed you...\" and weave your arms around their hips, then give them a loving hug. It’s important to show your partner that you’re just as willing to be affectionate with them in public as in private—but don’t overdo it. Your partner might not be a big fan of PDA—and if you’re not sure, just ask. Depending on their preferences, try giving a light kiss on their lips, cheek, forehead, or neck—or just kiss their hand by clasping it and bringing it to your lips."
    },
    {
      "title": "Appreciation lets them know that you truly care.",
      "content": "Appreciation lets them know that you truly care. If you want your partner to feel loved, relationship expert Connell Barrett recommends doing something daily to make them feel special and appreciated, even if it’s just a compliment or a flirty text message. Compliment your partner not only on their looks but their personality; that way, they’ll know you really care about them for who they are. The more specific you are, the more appreciative the comment. For example, don’t just say, \"You look nice.\" Instead, say, \"That really makes your eyes shine,\" or \"Your haircut really suits the shape of your face.\" Even small, seemingly silly compliments can be meaningful. Saying, \"You have beautiful handwriting!\" or \"You're awesome at parallel parking,\" can be confidence-builders! Give them extra compliments when it’s clear they made an effort to look their best (on a date, for example). If they get a new haircut or outfit, show them you’ve noticed (and tell them they look amazing)."
    },
    {
      "title": "Gifts and gestures can demonstrate your interest and affection.",
      "content": "Gifts and gestures can demonstrate your interest and affection. No healthy relationship can survive on gifts alone, no matter what they are. However, giving meaningful gifts can be exciting and delightful for your partner, showing them that you’re conscious of who they are and the kinds of things they really like! [10] X Research source Relationship expert Joshua Pompey adds that “Sometimes the best gifts can be free or as little as a few dollars…you just want to have a courtship that shows you’re interested and you want to make them happy.” Think of special touches, like having their name on a necklace representing something they care about (as a snowflake if they love to ski or a musical note if they play an instrument). Don't just think of tangible items––experience gifts can be far more exciting and fun than a list of things. Sometimes, get them a gift \"just because.\" Pick something out of the blue and give it to them just because you were \"thinking of them.\""
    },
    {
      "title": "Show your partner off to your family and friends.",
      "content": "Show your partner off to your family and friends. They’ll appreciate getting to meet the people who are most important to you—and will likely feel reassured knowing you want those people to be aware of your relationship. When you feel ready, schedule a day to introduce your partner to a friend or family member you care about! [11] X Research source"
    },
    {
      "title": "Contribute to the household if you live together.",
      "content": "Contribute to the household if you live together. Get actively involved with cooking, cleaning, and completing any other chores that have to get done around the house (or in your partner’s house if you tend to spend a lot of time there). When you’re both taking on some of the work, it lightens the load for both of you, too! [12] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Try keeping track of the chores and assign someone to each one so you’ll always know what you’re responsible for. Your partner will likely appreciate a boyfriend who pulls his weight (compared to a guy who has to be cared for like a child)."
    },
    {
      "title": "Consider what’s best for your partner, even if it’s inconvenient.",
      "content": "Consider what’s best for your partner, even if it’s inconvenient. Show your partner that their needs are one of your top priorities—and that you care about making them happy. Avoid doing anything that might make them uncomfortable or hurt them, and go out of your way to help out when they need it. A great boyfriend looks out for their partner, even during hard times or conflict. [13] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, an argument shouldn’t get in the way of caring for your partner when they’re sick or going to pick up your partner when their car breaks down. Prioritize your partner’s sexual needs, too. Find out what your partner likes in bed and focus on their pleasure—not just your own. Respecting your partner’s boundaries is a huge part of prioritizing their well-being. Don’t push or guilt your partner into doing anything they’ve said they don’t want to do (both in and out of the bedroom)."
    },
    {
      "title": "Be vulnerable and honest about your needs.",
      "content": "Be vulnerable and honest about your needs. Talk to your partner when something is bothering you (or exciting you), and tell them all about your greatest dreams, aspirations, and fears. In short, let yourself be vulnerable around them and see the real you, even if it feels scary. Opening up to your partner builds intimacy and brings the two of you closer together! [14] X Research source Let them know when you need something, even if you’re hesitant to accept support. Leaning on your partner and confiding in them is a good thing! When you keep your troubles under wraps, your partner won’t have the chance to help—and you won’t be able to build the intimacy and trust that comes with confiding in one another."
    },
    {
      "title": "Follow through on your promises and say what you mean.",
      "content": "Follow through on your promises and say what you mean. It’s tough to date someone who acts differently from one day to the next. So, even though everyone has ups and downs, aim for overall consistency so your partner knows what to expect each day; ensure your actions line up with the things you say, and talk to your partner when you change your mind about something so they’re not left feeling confused. [15] X Research source That being said, spontaneity isn’t a bad thing—so long as you’re using it to bring a little happiness and excitement to the relationship. For example, you can mix things up by visiting a new place, taking a surprise trip, or doing something offbeat with your partner (like dancing without music or challenging them to an impromptu race while walking)."
    },
    {
      "title": "Work on becoming a better person than you were the day before.",
      "content": "Work on becoming a better person than you were the day before. A great boyfriend is someone who wants to be the best person they can be for their partner and is willing to do the work needed to make changes. Nobody is perfect, and it’s normal to mess up sometimes. However, as you discover things that need to change to maintain the relationship, do your best to make those adjustments. [16] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, you might find that you struggle with vulnerability—but if you’re willing to grow and practice sharing more with your partner, you can help the relationship flourish. Take care of yourself, too! Focus on being hygienic and neat for your partner, and set goals related to your career or hobbies. The more you take responsibility for yourself, the better you’ll be as a boyfriend."
    },
    {
      "title": "Prioritize showing affection using your partner’s love language.",
      "content": "Prioritize showing affection using your partner’s love language. The 5 love languages are words of affirmation, physical touch, acts of service, quality time, and gifts. Everyone has a primary love language that indicates how they want to be loved. Figure out what your partner’s love language is so you can show affection in the way that they’ll most appreciate! [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Each love language refers to a different style of showing affection. For example: Words of affirmation mean expressing love through compliments, kind words, and verbal validation. Physical touch means showing love through non-verbal affection like hugs, kisses, cuddles, and loving touches. Acts of service mean showing love by doing tasks for someone—like making their favorite dinner or doing their chores. Quality time means showing love by spending time with someone, being attentive and focused while you do. Gifts mean getting the people you love thoughtful and meaningful gifts that show you truly care. Learn your partner’s attachment style, too. Their attachment style describes how they form attachments (based on their relationships early in life) and can offer insight into insecurities that might come up in the future. Not sure what your love language is? Take our quiz to find out!"
    },
    {
      "title": "Give your partner the space they need as well.",
      "content": "Give your partner the space they need as well. Independence is vital in healthy relationships. Just because they’re your significant other doesn’t mean they’re “yours.” You don’t have to be attached at the hip to have a great partnership! They’ll likely appreciate you even more if you let them pursue their own interests without checking in every 5 seconds and pursue your own solo interests too. [18] X Research source Find a balance that lets you both spend some time alone, spend time with your individual friends, and spend time with each other. Spending time alone and with your separate friends will make you appreciate each other even more when you see each other again! Maintaining different social schedules will also give you something to \"report back\" when you are together again. Keep up the hobbies that you had before each of you met. Although it’s great to find an activity you both like, you shouldn't force them to do things they don’t like (and vice versa). Maintaining your separate interests will help you maintain a sense of individuality, even as you grow together and build a stronger relationship."
    }
  ]
}