{
  "url": "https://www.wikihow.com/Control-an-Algae-Bloom",
  "title": "How to Control an Algae Bloom",
  "steps": [
    {
      "title": "Perform a partial water change in your tank.",
      "content": "Perform a partial water change in your tank. Partial water changes are one of the most efficient ways of combating algal blooms in your tank. By removing a portion of the water and replacing it with algae-free water, you'll essentially dilute the algae content of the water. You should generally do a partial water change every two weeks to protect the water quality in your tank. [1] X Research source Drain or siphon off about 25% of the water in your tank. For severe algal blooms, you may need to replace more than 25% of the water. Do not change more than 50% of your tank's water at any given time. This can upset the pH of your tank and could stress your fish, which may be fatal. Test the pH before and after performing a partial water change. The pH should not go up or down by more than 0.2 units to avoid stressing your fish. Changing the water will also remove some of the pollution that supports the algae bloom. A partial water change will dilute some of the heavier concentration of nitrate in the water, which is one of the main causes of algae bloom."
    },
    {
      "title": "Scrape algae off the glass walls.",
      "content": "Scrape algae off the glass walls. One way to help control ongoing algae blooms is to physically remove the existing algae from your tank. This can be done while you're performing a partial water change, as you'll have easier access to the walls of your tank when the water level is lower. Scrape or wipe down the walls of your tank at least once every week. [2] X Research source Be careful if using a sponge. In addition to harboring microorganisms, reusable sponges may trap grains of sand, which could scratch the glass."
    },
    {
      "title": "Consider using an algicide in your tank.",
      "content": "Consider using an algicide in your tank. A commercially-available chemical algicide can help kill algae quickly and efficiently. However, you'll need to be careful with chemical agents like this, as they can upset the balance in your tank if used improperly. [3] X Research source Do not use algicide if you have live plants in your tank, as algicide will most likely kill them."
    },
    {
      "title": "Introduce algae-eating fish and invertebrates.",
      "content": "Introduce algae-eating fish and invertebrates. You can easily remove algae from your home aquarium by employing algae-eating fish and invertebrates to the tank. These living additions will eat algae off the plants, substrate, and even off the glass walls of the tank. [4] X Research source Check with a knowledgeable employee at your local pet store to find aquatic or marine organisms that can help control the algae in your tank. Most species of aquatic snail will eat algae, whether in a freshwater or marine tank. Just be sure that you check at the pet store to ensure the snail you get can live in your tank at home. Bristle stars, bristle worms, aquatic hermit crabs, Nassarius snails, and sea cucumbers will all help control algae in a marine tank by removing organic detritus from the substrate of your tank."
    },
    {
      "title": "Try adding allelopathic plants.",
      "content": "Try adding allelopathic plants. Some plants produce and release chemicals that can help inhibit algal growth in a home aquarium. Fast-growing plants tend to be the most allelopathic. Some well-known allelopathic plants that can be added to your aquarium include Cabomba, Egeria, Ceratopteris, Hygrophila, and Vallisneria. [5] X Research source"
    },
    {
      "title": "Feed your fish less food or feed them less frequently.",
      "content": "Feed your fish less food or feed them less frequently. Overfeeding of fish is one of the biggest causes of algal blooms in home aquariums. You may be tempted to feed your fish multiple times a day or to add more food to ensure that your fish are well-fed, but all that extra food that isn't eaten ends up settling into the substrate and decomposing in the water. This fuels algal growth, and it can quickly turn an otherwise clean tank into a mess. Try switching to a fish food that's low in phosphates. The label should state the contents and levels of each ingredient. Try feeding your fish only once per day. Some fish experts even recommend feeding fish every other day instead of every day, if the fish can handle such a feeding schedule (ask a fish expert at your local pet store). Experiment with how much food is enough for your fish. Usually a few pellets or flakes per fish are all that can be eaten before the excess food falls to the bottom of the tank. If you're worried that may not be enough food for all of your fish, try feeding them a second time later in the day. However, be sure you feed them smaller portions for both meals."
    },
    {
      "title": "Reduce the lighting in your tank.",
      "content": "Reduce the lighting in your tank. Food and light are the two biggest factors that permit an algal bloom. If you have a tank light over your aquarium, you may need to reduce how often you use it. [6] X Research source In addition to reducing the amount of time your tank is lit, you should also replace the light bulbs in your tank. Various types of algae tend to thrive in differing wavelengths of light, and as your light bulbs age they tend to change from one wavelength to another. [7] X Research source Try turning off the tank light altogether while you are battling with an active algal bloom. Reduce the amount of time you light your tank once the algae is under control. Try to limit the light time to just a few hours per day. Change fluorescent bulbs once every year, and change VHO lamps at least twice every year."
    },
    {
      "title": "Regulate the water temperature in your tank.",
      "content": "Regulate the water temperature in your tank. Algae can grow in any temperature or condition. However, studies have shown that algae generally thrive the most easily in warmer temperatures. [8] X Research source If you use a heater for your tank, try lowering the temperature by a few degrees. Just make sure that your fish can survive in the temperature range you're considering before you adjust the tank's temperature. Check with a fish expert at your local pet store to determine what water temperature range your fish need to survive."
    },
    {
      "title": "Test your tap water.",
      "content": "Test your tap water. Algae thrive when water contains high levels of phosphate and nitrate. Though municipal tap water is safe for consumption and generally low in phosphates and nitrates, there is always a chance that your water source is adding these algae-friendly nutrients to the tank every time you change the water. The best way to ensure that you're adding quality water to your tank is to test your tap water with a home testing kit. Tap water should ideally be at 0 parts per million (ppm) when you test for nitrates and phosphates. If your tap water tests higher than 0 ppm, you'll need to filter your water before adding it to the tank. You can purchase a water quality testing kit and a water filter at many pet stores or through an online retailer."
    },
    {
      "title": "Install a protein skimmer in your tank.",
      "content": "Install a protein skimmer in your tank. Protein skimmers will help remove organic material like waste and excess nutrients from the water in your tank. That way, if you accidentally overfeed your fish or if fish waste accumulates in the tank, you'll still be able to keep the water relatively clean. A proper protein skimmer should run continuously 24 hours a day. You can discontinue or decrease use of the protein skimmer once your aquarium is free of algae."
    },
    {
      "title": "Change your filter media on a monthly basis.",
      "content": "Change your filter media on a monthly basis. The filter on your home aquarium can easily build up organic wastes and nutrients. Even though the filter removes these elements from the water, a dirty filter will eventually start to leak those algae-friendly additives back into the tank. To combat this, the filter media should be changed every month. You should also rinse off the filter media every time you perform a partial water change to ensure that the nutrients and detritus do not build up inside the filter."
    }
  ]
}