{
  "url": "https://www.wikihow.com/Contact-Activision",
  "title": "How to Contact Activision Support: Phone & Online Options",
  "steps": [
    {
      "title": "Create a support ticket on their website.",
      "content": "Create a support ticket on their website. According to many gamers, this is the best way to get support from Activision, although you won’t receive help immediately. Visit Activision’s support page and select the game you need help with. Then, select the platform you’re playing on, the topic of your issue, and the issue you’re facing. Once you do this, you will be taken to the Support Options page. On the Support Options page, scroll down and select Submit a ticket. This will open the option to create a Support ticket. In 1000 characters, provide a detailed description of your issue, then submit your ticket. Ticket response time varies. It can take anywhere from a few days to a month depending on your issue."
    },
    {
      "title": "Call the Activision support number at +1 (310) 255-2000.",
      "content": "Call the Activision support number at +1 (310) 255-2000. Calling them should help you get in contact with someone directly, but we’ve heard mixed reports about this actually being an effective solution. Many gamers report that the phone number doesn’t work or just takes you through an automated menu. It certainly doesn’t hurt to try, though! Hopefully, you’ll reach a member of their team who can help. [1] X Research source Full disclosure: we’ve tried calling this number multiple times and the call disconnects immediately. Unfortunately, this is the only phone number that Activision has made available."
    },
    {
      "title": "Visit the Activision support page to troubleshoot common issues.",
      "content": "Visit the Activision support page to troubleshoot common issues. If you're having trouble with your Activision account or games, head to their support page . Once you get to the landing page, choose the game you're having trouble with. Then, select the platform you're using. From there, use the drop-down menu to choose the topic that best fits your problem, like \"Game Performance\" or \"Activision Account.\" Then, select the issue you're dealing with, like \"Unable to access account or \"Can't connect online.\" [2] X Research source Then, follow the onscreen directions that pop up. For most common issues, you'll be taken to a troubleshooting page. However, some options—like problems with your ranking or stats—may take you to a live chat. If you don't see a choice that helps solve your problem, click \"More solutions\" for additional help."
    },
    {
      "title": "Browse Activision’s community forum to get help from other players.",
      "content": "Browse Activision’s community forum to get help from other players. Search previously-answered questions or ask a new one. Activision has an active community, so if you have a question, try browsing the forum to see if someone has already answered it. There are tons of posts, so chances are good there will be some helpful information! If no one's asked it before, post it and see if someone comes along who can help you. You can find the Community page at here . From the main page, type your question in the box that says, \"Have a Question? Ask here!\" As you type, any previous posts that might match your query will come up in a drop-down box."
    },
    {
      "title": "Check the Blizzard website for support options.",
      "content": "Check the Blizzard website for support options. Blizzard's site offers support for their online games . Activision is a parent company to a number of different brands. One of their biggest brands is Blizzard—they're home to games like Warcraft , Diablo , and StarCraft . If you're having trouble with one of those games, try checking Blizzard's support page at here . [3] X Research source From the main support page, you have a few options for finding help. Either do a search for your issue, choose \"Account, App, & Shop,\" or click on the specific game you're having problems with. [4] X Research source If you don't find the answer to your problem in the support pages, you can choose \"Still need help? Contact us\" to be taken to a form where you can describe your problem and attach any relevant files."
    },
    {
      "title": "Visit King’s support page for help with their games.",
      "content": "Visit King’s support page for help with their games. They provide a troubleshooting form where you can ask a question. King is one of Activision's popular subsidiaries—they make some of the web's most popular mobile games. If you're having trouble with your King account or a game like Candy Crush Saga , Pet Rescue Saga , or Farm Heroes Super Saga , go to King's contact page and submit a request for support. [5] X Research source When you open the contact form, fill it out with your email address, name, the game you're asking about, and the general topic your problem involves. Then, type your issue in the provided box and submit your form. You should hear back from a representative within a day or two!"
    },
    {
      "title": "File a complaint with the Better Business Bureau.",
      "content": "File a complaint with the Better Business Bureau. Try this if you have a serious issue with Activision. If you have a complaint about Activision as a company, visit Activision's BBB page , scroll down, and click on \"File a Complaint.\" Then fill out a form explaining your issue and why you need Activision to contact you. [6] X Trustworthy Source Better Business Bureau Nonprofit organization dedicated to promoting marketplace trustworthiness by educating consumers and reviewing businesses Go to source The BBB will email you shortly with a Complaint Case number regarding your complaint. You'll typically receive a response within 14 days, although this isn't always the case. You may receive an email from the BBB stating that Activision replied to your complaint. Activision may also call you or email you directly."
    },
    {
      "title": "Send a tweet to @ATVIAssist.",
      "content": "Send a tweet to @ATVIAssist. Check Activision Support's Twitter feed for updates. The Activision support team frequently posts about updates and shares what's going on in the gaming industry on their Twitter feed. You can send them a tweet in hopes that someone will see what's on your mind, although bear in mind they probably won't respond to you. [7] X Research source You won't be able to send a DM through Twitter unless the @ATVIAssist follows you back."
    },
    {
      "title": "Browse and comment on Activision’s Facebook posts.",
      "content": "Browse and comment on Activision’s Facebook posts. Visit [8] X Research source to see their feed. Activision posts fairly frequently to their Facebook page, and their posts are open for public comment. If you have something to say, try leaving it on a relevant post —there's a chance someone who monitors the account will see it. However, do be aware that they aren't very responsive to comments, so don't be surprised if you don't hear anything back."
    },
    {
      "title": "Comment on their Instagram page @Activision.",
      "content": "Comment on their Instagram page @Activision. Browse shots from Activision's latest and upcoming releases. Activision posts to their Instagram fairly often, so if you see something that sparks your interest, share your thoughts on one of their pics. Activision isn't super interactive on the page, but if you leave a comment , someone from the team might come across it. If you're a fan, follow the account for news about contests, challenges, updates, new releases, and more. It's also a great way to connect with other players!"
    },
    {
      "title": "Comment on Activision’s LinkedIn updates.",
      "content": "Comment on Activision’s LinkedIn updates. Activision's LinkedIn deals with industry-related updates. You can comment on these posts if you have something interesting or relevant to share. Their main LinkedIn account is their Activision Blizzard page, but they also maintain several affiliate pages. [9] X Research source The affiliate pages include Activision, the Activision-Blizzard Media Team, Blizzard, Call of Duty Endowment, and King."
    },
    {
      "title": "Send a letter to Activision’s publishing location.",
      "content": "Send a letter to Activision’s publishing location. Direct your mail to Activision Publishing's Santa Monica location. If you have something really important to say, try putting it in a letter. However, keep in mind that if you don't address the letter to a specific person or department, there's a good chance that no one will read it, so take the time to research exactly who you want to be the recipient of your letter. [10] X Research source Claytor says that if you have to address a formal business, you can write Mr or Ms. Then put the person's name, title, and business name. After writing the name, title, and business name, Claytor says to write the street, the city-state, and the zip code. Activision's Santa Monica address is: Activision Publishing, Inc. 3100 Ocean Park Boulevard, Santa Monica, CA 90505. Chances are, it will be a lot faster to reach out to Activision through one of their dedicated support channels."
    },
    {
      "title": "Email Activision’s PR department for media requests.",
      "content": "Email Activision’s PR department for media requests. The PR department can help if you're writing a story or article . If you work for the media and you want to talk to Activision's press team, email them at pr@activisionblizzard.com. However, do not use this email for customer support—they won't be able to assist you with problems with your games or account. [11] X Research source You can also contact Blizzard's PR team by emailing them at pr@blizzard.com. If you need to contact King's press team, email them at press@king.com ."
    },
    {
      "title": "Gather evidence against your ban and submit an appeal form.",
      "content": "Gather evidence against your ban and submit an appeal form. If you’ve been banned by Activision, you can file an appeal form to try and get your account back. Compile evidence, like screenshots and videos of your gameplay, chat logs that show you weren’t engaging in toxic behavior, and other relevant information. Then, visit the Activision support website, log into your account, navigate to the ban appeal section, then fill out the appeal form. [12] X Research source When writing your appeal, be honest and thorough. Explain why you believe the ban is unjust and provide evidence to support your claim. Remain polite, professional, clear and concise. If you’ve committed any wrongdoing and it played a part in your ban, admit to it in your claim. Honesty can show that you’re willing to improve, which may help with your appeal."
    },
    {
      "title": "Response time is typically anywhere from a few days to a few weeks.",
      "content": "Response time is typically anywhere from a few days to a few weeks. When it comes to appeals, Activision doesn’t have a standard response time. After submitting your request, you will get an email with a confirmation number and information relating to your appeal. Once Activision begins the review process, it can range from a few days to a few weeks. They will carefully review the appeal and evidence before responding with a decision, so be patient. [13] X Research source"
    },
    {
      "title": "Head to Activision’s recovery page and file a request.",
      "content": "Head to Activision’s recovery page and file a request. When your Activision account is hacked, file a request and let them know what’s going on with your account. Head to their recovery page, select My Account Was Hacked, and select the option that most describes your issue. Then, select any details that apply to you, complete the form, and submit your request. [14] X Research source Once you file your request, Activision will take up to 2 days to process it. You will receive an email notification once your request is complete. If you’re unable to access your account at all, create a temporary Activision account to file the request."
    },
    {
      "title": "Choose a strong password.",
      "content": "Choose a strong password. Whether you’re making a new account or changing your password, it’s important to choose a strong, unique password to prevent online hackers from gaining access. Choose a password that’s at least 15 characters. Use a combination of uppercase and lowercase letters, symbols, and numbers with random words. [15] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source Alternatively, choose an automatically generated password (if your browser or device has that feature). Avoid using common phrases, song lyrics, or quotes that can be easily guessed."
    },
    {
      "title": "Enable 2-Factor Authentication.",
      "content": "Enable 2-Factor Authentication. 2-Factor Authentication (2FA) is a protective measure that uses 2 different login methods to verify your identity, some of which are linked to specific accounts or devices to prevent hackers from accessing your account. To enable 2FA, log into your Activision account and navigate to the Privacy & Settings section. Then, select Enable Two-Factor Authentication and follow the on-screen instructions to finish setting up 2FA. [16] X Research source Activision offers different ways to use 2FA. You can use Authy, Duo Mobile, Google Authenticator, or Microsoft Authenticator. After setting up 2FA, Activision will provide you with 10 backup codes to use if you can’t access your authenticator app. Keep them somewhere safe and accessible."
    },
    {
      "title": "Only enter your information on verified Activision websites.",
      "content": "Only enter your information on verified Activision websites. Scammers often use phishing emails, text messages, and fake websites when they’re attempting to get your information. To avoid getting scammed, only enter your information on verified Activision websites. If you’re unsure if a website is valid or not, stay safe and avoid using it. Contact Activision support to verify whether claims or requests are valid or not. [17] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source Don’t click on a link, unexpected email, or text if you’re unsure of its origin. Instead, contact Activision support via phone or their support site."
    }
  ]
}