{
  "url": "https://www.wikihow.com/Approach-the-Guy-You-Like",
  "title": "How to Approach the Guy You Like",
  "steps": [
    {
      "title": "Make sure he knows who you are.",
      "content": "Make sure he knows who you are. This is easy if you are already lab partners in science class or you work together in the same office. However, you may have a crush on a guy whom you’ve never actually talked to. If this is the case, there are several ways you can let him know who you are without seeming like you’re stalking him. [1] X Research source If you have mutual friends, have one of them introduce you. If he works at a store or café you frequent, make sure to go there regularly when he works. Ask him questions about items on the menu or things that they sell. Be friendly and thank him for helping you. Like his photos or posts on social media if you are connected that way. If you’re coworkers or classmates but don’t normally interact, find a reason to. Organize an office party and see if he wants to volunteer. Sit near him in class and ask to borrow a pencil."
    },
    {
      "title": "Look your best.",
      "content": "Look your best. You never know (or maybe you do) when you’ll run into this guy. Just in case you do, you want to look good so that you’ll feel confident about the interaction. Wear clothes that you feel show off your personality and make you look and feel special. If you have a favorite accessory, such as a special hat, wear it. It can become part of your trademark look and help boost your confidence and make you seem memorable. You want to look your best, but make sure you also dress appropriately. You don’t want to show up to work in something too revealing just to impress him, or wear your fanciest outfit to a regular day at school."
    },
    {
      "title": "Introduce yourself.",
      "content": "Introduce yourself. This can be an intimidating step if you’re naturally shy. However, most people are happy to meet a new person and feel at ease when someone takes the time to introduce themselves politely. [2] X Research source Keep it simple. If you frequent his place of work and he’s become familiar with your face, simply say, “Hi, I’m Jane. I don’t think I’ve gotten your name yet,” next time you go in there. You can say, “I see you around a lot, but I don’t think we’ve actually met. I’m Monique.”"
    },
    {
      "title": "Compliment him.",
      "content": "Compliment him. People always remember when someone compliments them. It’s flattering and lets them know that you noticed something about them. Find something you can tell him you appreciate about either his appearance or something he’s done. He’ll associate you with the positive feelings of the compliment. [3] X Research source Tell him you like a piece of clothing, particularly if there’s something you can identify about it. For example, you could say, “Nice T-shirt. I love that band, too.” Compliment him on his work. You can say, “You always make the best lattes,” or “You’re a really good lab partner.”"
    },
    {
      "title": "Make flirtatious eye contact.",
      "content": "Make flirtatious eye contact. Flirtatious eye contact can come in a few different forms. Generally, you need to maintain eye contact for at least four seconds before coyly looking down or away. Holding his gaze this long lets him know you’re flirting. If you’re feeling really bold and sexy, you can subtly lick your lips. This is considered rather forward, so make sure you know what you’re doing. There’s a difference between flirting and staring. Make sure you’re reading his signals and responding, not just staring at him."
    },
    {
      "title": "Smile.",
      "content": "Smile. It may seem obvious, but if you’re feeling very nervous or shy, you may forget to smile. However, smiling is important. It sends the signal that you’re friendly and approachable. It also shows that you may be interested. Smiling with your teeth showing and your eyes creasing around the edges conveys warmth and gives the appearance that you’re genuinely excited to see him. Reader Poll: We asked 162 wikiHow readers and 82% of them agreed that smiling helps to boost your mood . [Take Poll] So just a simple smile may make you feel more relaxed and confident, and make your crush feel that way too!"
    },
    {
      "title": "Say “hi.”",
      "content": "Say “hi.” This is another example of something that may be easier said than done. If you feel very shy around this guy, that’s perfectly normal. However, you want to feel comfortable enough to at least say, “hello.” [4] X Research source You can wait until he looks at you or catches your eye. Once he does, say, something casual, like, “Hi. How’s it going?” If you generally say hi to him in the halls or at his or your place of work, bump it up a notch by adding something like, “Good morning,” or “Nice to see you.”"
    },
    {
      "title": "Like or “friend” him on social media.",
      "content": "Like or “friend” him on social media. This can be an easier step than saying hello in real life. If it wouldn’t seem strange, become his friend on Facebook or another social media platform. This works particularly well if you have mutual friends or run in similar circles. If he’s someone you’ve been following on an online dating site or app, you can use the app to indicate through your profile that you like his profile. When you like his profile or request to be friends, it can be a natural time to send a brief message. Even something like, “Hey! I really like those pictures you just posted” can be a conversation starter."
    },
    {
      "title": "Make a statement.",
      "content": "Make a statement. This can make you look and sound very confident. Say something to him about your surroundings. This invites conversation and lets him know you’re interesting to talk to. [5] X Research source You can say something like, “Wow, this weather is incredible, isn’t it?” or “The coffee at this place is incredible.” You can also ask him for help or directions. Say something like, “I’ve never been here before. Do you have a type of coffee you’d recommend?” or “Can you help me figure out how to get to the library from here?”"
    },
    {
      "title": "Make sure he’s available.",
      "content": "Make sure he’s available. You can save yourself a lot of embarrassment by knowing if the guy you like is available before you do something about it. If you don’t know him, you can try to find out a number a of ways. Check for a wedding ring. Online, check for photos of him with a significant other. Listen when he talks. Does he reveal a lot about himself and his life without mentioning a partner? Does he keep his eyes moving around the room, looking at people? This can be a sign that he’s single and looking for love."
    },
    {
      "title": "Do something nice for him.",
      "content": "Do something nice for him. Doing something nice for him is a great way to let him know you like him without having to actually say anything. It can be a small gesture, but make sure it’s something he’ll notice and appreciate. If you notice that he always shows up to class without a pen or pencil, bring one in special for him. Give it to him and say something like, “I noticed you usually could use one of these.” If you work somewhere that he frequents, give him a small freebie or a discount if you won’t get in trouble. If you frequent his place of work, leave a generous tip or bring him something. For example, you could say, “You always make such great sandwiches. I thought I’d bring you some cookies that I made myself.”"
    },
    {
      "title": "Be direct.",
      "content": "Be direct. If you can’t tell if he likes you or is getting the signals you’re sending, you can always be direct. This can be very exciting for guys, since they won’t have to spend time guessing about your intentions. [6] X Research source You can be direct without being demanding. Say something like, “I’d really like to get together sometime, if you’re interested.” In being direct, you can let him know what you like about him. Say something like, “You seem like a really interesting person. Would you like to hang out sometime?” Some people like to be direct and say, “I have to tell you that I have a really big crush on you.” This can be seen as charming, but can sometimes put a guy off. He might not know what to do with this information or might feel put on the spot."
    },
    {
      "title": "Write him a note.",
      "content": "Write him a note. This can be a cute way to let him know you’re interested. It can also be a way to slip him your number so that the ball is in his court. Keep it simple. You don’t need to profess your undying love right this second. Write your number on a piece of paper and hand it to him. You can say something flirty like, “I believe you wanted this?” If you’ve never met before or you have no mutual friends, you may not want to give out your number for safety reasons."
    },
    {
      "title": "Send a text or online message.",
      "content": "Send a text or online message. Of course, you have to have his number or be connected to him on social media to do this. However, if it’s possible, this can be a fun and low key way to connect with him. [7] X Research source Say something more personal and interesting than simply, “what’s up?” Ask him something based on his profile or ask him for advice about something. For example, you can say, “Hey, how was that new restaurant I saw you posted pictures of? I was thinking I might try it this week.”"
    },
    {
      "title": "Invite him to an event.",
      "content": "Invite him to an event. You may be afraid to ask this guy out, but he’ll likely be flattered. Most guys don’t get asked out very much, so it will probably be extra exciting for him. Think ahead of a fun event you want to invite him to. [8] X Research source Choose something that happens on a specific day, such as a concert or a sporting event. Don’t just choose something like getting a drink. Say something like, “Hey, I’ve got an extra ticket to ____. Maybe you’d like to come with me?” You can start off small; there's no need to invite him to a grand party the first time you do something with him."
    }
  ]
}