{
  "url": "https://www.wikihow.com/Apply-Bondo",
  "title": "How to Apply Bondo",
  "steps": [
    {
      "title": "Find a flat surface and a disposable tool for mixing.",
      "content": "Find a flat surface and a disposable tool for mixing. Disposable options such as a sheet of cardboard make for an easier clean-up, but you can also purchase reusable plastic sheets. For a mixing tool, use a clean plastic spreader or something disposable, like a popsicle stick. It’s best not to use screwdrivers or dirty tools for mixing because they are much harder to clean and could add grease or oil into the mixture."
    },
    {
      "title": "Mix only as much Bondo and hardener as you can use in 10 minutes.",
      "content": "Mix only as much Bondo and hardener as you can use in 10 minutes. Bondo hardens quickly, so it’s important to mix it in small, usable amounts. Start with a golf-ball sized amount of filler and mix up more as needed. The ratio is also crucial—too much hardener will cause the mixture to gel too quickly, and too little may keep the mixture from hardening at all. [1] X Research source Finding the right ratio takes experience, but you can get close by estimating that each inch of raw filler diameter requires an inch-length of hardener. For example, if you use an amount of Bondo with a 3 inches (7.6 cm) diameter, you would mix it with a 3 inches (7.6 cm) line of hardener. If you’re struggling with finding the right ratio, look at the product instructions or ask a professional for assistance. [2] X Research source"
    },
    {
      "title": "Fold together the Bondo and hardener.",
      "content": "Fold together the Bondo and hardener. Use the spreader or popsicle stick to scrape and press the two ingredients together until they’re combined and you can’t see any streaks. This will help prevent air bubbles from forming. Make sure to apply the mixture within 3 minutes of combining. If you wait longer, the mixture will turn into a gel and won’t stick to anything."
    },
    {
      "title": "Use a plastic or metal spreader to apply thin coats of filler.",
      "content": "Use a plastic or metal spreader to apply thin coats of filler. Load up your spreader with some Bondo mixture and scrape an 1 ⁄ 8 inch (0.32 cm) layer over the damaged area. Press down with the spreader to push the filler into the metal. [3] X Research source Keep applying thin coats until all the dings are filled, up to a total thickness of 1 ⁄ 4 inch (0.64 cm). Never use Bondo for any imperfections deeper than 1 ⁄ 4 inch (0.64 cm). Using the product on a ding deeper than 1 ⁄ 4 inch (0.64 cm) will likely not adhere or hold up well, and the Bondo will eventually shrink and either crack or fall off. If you applied masking tape beforehand, let the filler sit for several minutes before gently removing the tape. [4] X Research source"
    },
    {
      "title": "Wait 3-10 minutes for the Bondo to fully cure.",
      "content": "Wait 3-10 minutes for the Bondo to fully cure. Since you’ll be sanding and applying pressure after it dries, make sure the filler has time to fully harden and cure. [5] X Research source"
    },
    {
      "title": "Level the filler with 36-grit sandpaper.",
      "content": "Level the filler with 36-grit sandpaper. Start sanding with a heavier grit to even out the dried filler quickly. Sand in alternating directions until the filler-covered section is level and smooth. [6] X Research source To avoid scratching the surrounding area, keep the sandpaper on the filler only and don’t let it slide onto the painted surface. Sanding in straight lines creates waves in the filler, so always sand in a criss-cross pattern."
    },
    {
      "title": "Remove any scratches with 80-grit sandpaper.",
      "content": "Remove any scratches with 80-grit sandpaper. The finer 80-grit will help smooth out any scuffing from the 36-grit sandpaper. You can start to feather out the edges of the filler and sand out onto the paint for a seamless effect. Keep sanding until all of the 36-grit scratches are sanded out. [7] X Research source This can be a long and tedious process, but all of your sanding will soon pay off with a smooth, even application!"
    },
    {
      "title": "Prime and paint the area to blend it in with the rest of the car.",
      "content": "Prime and paint the area to blend it in with the rest of the car. Once the filler is sanded down smooth, you can paint over it. Let the paint cure, and the body of your car will look as good as new."
    }
  ]
}