{
  "url": "https://www.wikihow.com/Catch-a-Cheating-Boyfriend",
  "title": "Practical Ways to Catch a Cheating Boyfriend",
  "steps": [
    {
      "title": "Consider if he is more concerned with his physical appearance than usual.",
      "content": "Consider if he is more concerned with his physical appearance than usual. Has he started working out more, dressing better, grooming himself with more care, or using a new musky cologne? While self improvement through physical fitness and grooming are healthy life choices, consider if he is trying to improve his physical appearance for someone else. [1] X Research source"
    },
    {
      "title": "Notice if his sleeping habits or daily schedule start to change.",
      "content": "Notice if his sleeping habits or daily schedule start to change. If your boyfriend is usually in bed by 9 and is suddenly out all night or sneaking around the house late at night, this may be a sign of cheating. Similarly, if he usually sticks to a set routine of going to the gym in the morning or heading home from the office by 5, but he is now sleeping in or staying at the office late, these adjustments in his daily schedule could hint at time spent elsewhere, possibly in the company of someone else. [2] X Research source"
    },
    {
      "title": "Ask yourself if he seems more distracted or distant.",
      "content": "Ask yourself if he seems more distracted or distant. If he is usually a very attentive, supportive partner who asks you how your day is and enjoys having long conversations with you over dinner, and then suddenly appears uninterested in your day or bored by long conversations with you, this may be a sign his interest or engagement is focused elsewhere and not on you. Your partner may also lose interest in domestic activities like spending time with the kids, fixing up the house, mowing the lawn, etc. He may also spend more time on his phone texting or on the computer in private chat rooms or social media pages. If his phone or computer use goes up dramatically or if he becomes secretive about his phone or computer use, this may be a red flag. [3] X Research source"
    },
    {
      "title": "Note any changes or shifts in your sex life.",
      "content": "Note any changes or shifts in your sex life. Perhaps there has been a decline in the amount of sex you are having or a strange, sudden increase in sexual activity, with new sexual preferences or tastes that you did not experience with him previously. [4] X Research source [5] X Research source You may start wondering where he learned a certain sexual move or what caused him to develop a certain preference in bed. One possible reason is he may be trying out new moves with someone else. He may also have a lower sex drive or spurn off your attempts at being intimate with excuses like “I'm tired,” or “Maybe another night.”"
    },
    {
      "title": "Notice if he gets defensive or angry at you easily and more often.",
      "content": "Notice if he gets defensive or angry at you easily and more often. If he seems to be picking a lot of fights, get angry at you for something small he would usually not be upset about, or gets defensive when you ask him about his night out with the boys, these may be signs of cheating. [6] X Research source Changes in his normal behavior that involve anger towards you could in fact be a reflection of his guilt for cheating or fear that you may find out about his affair."
    },
    {
      "title": "Pay attention to how he handles the aftermath of a fight.",
      "content": "Pay attention to how he handles the aftermath of a fight. Does he leave, get some space, and then return to apologize? Or does he neglect to apologize or show remorse for hurtful words he said to you? If he is usually good at forgiving and forgetting after a fight and this is not happening anymore, this may be a red flag. [7] X Research source It's important to remember that your boyfriend's inner turmoil has nothing to do with you and is a reflection of his own anxieties and fears. Try not to take his anger towards you personal or put pressure on yourself to try to make him forgive you or feel better, as this could also mean he is actually feeling guilty about an affair."
    },
    {
      "title": "Write down any suspicious changes in your boyfriend's behavior.",
      "content": "Write down any suspicious changes in your boyfriend's behavior. This will help you compile evidence of his cheating and determine the times, dates, excuses given, etc, that helped him lie to you about the affair. A cheating spouse is likely to change their story, question your memory or deny your accusations, so keeping a record of their activity is critical."
    },
    {
      "title": "Read How to Detect Lies.",
      "content": "Read How to Detect Lies . This article will help give you the skills to determine if your boyfriend is lying. Most people are bad liars, so if you use the right technique to detect his lies, you may be able to get him to confess to his affair. Keep in mind that once he knows you're suspicious of his behavior, he might work overtime to cover his tracks. If so, you'll need to be more vigilant and work harder to get evidence of his cheating."
    },
    {
      "title": "Consider talking to him about your suspicions.",
      "content": "Consider talking to him about your suspicions. If you are noticing shifts or changes in his behavior, it is possible he may be treating you this way not because he's cheating, but because he is dealing with other internal issues like depression, grief, severe anxiety, etc. Talking to him about your suspicions rather than resorting to drastic measures like snooping around or encroaching on his privacy, will show that you care about the relationship and about making it work."
    },
    {
      "title": "Take note of his cell phone activity.",
      "content": "Take note of his cell phone activity. Notice if he has been making long phone calls at strange times of night or receiving text messages from other girls. He may also have new phone etiquette where he needs privacy or space when talking to someone, he hangs up as soon as you walk into the room or he brushes you off when you ask him who he is talking to on the phone. [8] X Research source If you can get your hands on his cell phone bill (on paper or online), you can look at every call made for that month, which will give you a chance to check for any long conversations at odd times, or lots of calls to one particular number that you don't recognize. You can also try to check his phone messages and voicemail, though this may be an easy way to get caught snooping around. A good time to check his phone is when he is in the shower or out for a walk and has placed it on the charger. [9] X Research source If your boyfriend tends to misplace his phone, another thing you can do is simply take it and let him assume he lost it. This way you can see who is calling or texting him on a daily basis."
    },
    {
      "title": "Notice if he has changed all the passwords for his computer or moved his computer to a private area or room.",
      "content": "Notice if he has changed all the passwords for his computer or moved his computer to a private area or room. Be wary if his computer activity becomes sneaky or secret and if he gets defensive or distant if you use his computer or ask to see what he is looking at on his screen. [10] X Research source This may be a sign he is trying to limit your access to his computer and hiding something on his hard drive or browser history. Try to get access to the computer when he is out and check the hard drive for hidden folders with images of other girls or partners, as well as love notes. See How to Find Hidden Files and Folders in Windows for how to do this."
    },
    {
      "title": "Check his social media accounts.",
      "content": "Check his social media accounts. This could be his email, Facebook, Instagram, and instant messaging accounts. Many times, cheaters use the Internet to carry on their sneaky business, especially if they are worried about you checking their phone or monitoring their calls. Some cheating partners may be using cheating websites like meet2cheat or ihookup [11] X Research source . Search the computer's browser history to see if he has visited any of these cheating sites. Some cheaters may also create different Facebook profiles to then find other people online to message or meet up with and have an affair. So check if he bookmarked or viewed any Facebook profiles or pages multiple times. [12] X Research source You can also search for your spouse's hidden online profiles using a service like Spokeo or Rapleaf. There are websites that set out to expose “liars, cheats, and bastards” by posting stories about cheating men as warnings to others about a bad spouse. [13] X Research source"
    },
    {
      "title": "Look through his apartment or his side of the bed for love notes, gifts, and photographs.",
      "content": "Look through his apartment or his side of the bed for love notes, gifts, and photographs. Consider where he would hide personal items or things he doesn't want you to see. Examine any physical evidence of cheating closely to make sure you are not misinterpreting a note or item that may have sentimental, rather than romantic value. Just because he kept his ex girlfriend's picture or his first love's note doesn't necessarily mean he is cheating on you. It's important to get solid evidence of his cheating before you confront him, so look at any notes, gifts, or photographs with a discerning eye."
    },
    {
      "title": "Download spy software to his computer.",
      "content": "Download spy software to his computer. Keyloggers spy software, like SpyPal, are available for download online and can be installed in a computer without the person knowing they are running in the background. [14] X Research source These types of programs can record information like passwords, emails typed, pages visited, or even record a video of the screen as your boyfriend uses the computer. Keep in mind, however, that many of these types of spyware are highly illegal, so be very careful when downloading them. Also, a watchful boyfriend can find a key logger or screen recorder, so download a high-end logger that keeps its files hidden and under password. Some of these can still be found, but with great difficulty. However, some spyware can be made completely invisible both to the user and to the operating system. You probably won't need this last option unless your boyfriend is a professional computer engineer or a professional hacker. [15] X Research source"
    },
    {
      "title": "Attach a GPS monitor to his car or track him with his phone.",
      "content": "Attach a GPS monitor to his car or track him with his phone. If you're looking to catch your partner red handed, place a GPS device on the underside of his car and track his movements so you can pounce on him if his pants end up around his ankles in a sleazy roadside motel. [16] X Research source The “Find Your Phone” app can also be used to “Find Your Cheating Boyfriend”. If you have access to your boyfriend's iCloud, you can log in and watch his phone move in real time right into the immediate proximity of someone else. [17] X Research source"
    },
    {
      "title": "Create a fake social media profile.",
      "content": "Create a fake social media profile. You can then use the profile to log onto websites that promote cheating on spouses to see if your partner has a profile on the site or is using one of the sites to arrange hook ups. [18] X Research source You could also bait your boyfriend by using the fake account to friend him on Facebook. You could then start flirting with him over a period of time and see how he responds to you. If he starts sending your fake profile naked pictures or inquire about a meet up at a hotel, he is clearly not being monogamous with you."
    },
    {
      "title": "Set up the ideal opportunity for him to cheat.",
      "content": "Set up the ideal opportunity for him to cheat. While this may be the most elaborate option, as it requires some planning and setup on your end, it is another way to catch your boyfriend red handed. Provide an excuse like a hair appointment or a meet up with a friend and then watch from across the street or in your car down the block to see if your boyfriend uses your absence as an opportunity to meet up with someone. Keep in mind this is also the riskiest option as it involves lying convincingly to your partner and then staking out his movements until he slips up."
    },
    {
      "title": "Consider hiring a private investigator.",
      "content": "Consider hiring a private investigator. Private investigators are licensed to do surveillance and are knowledgeable about the best and most legal tactic to uncover evidence of infidelity. If you are in a long term relationship where your finances are tied or if you are married, so your finances are legally bound, it's a good idea to hire a PI. Look for a PI that specializes in infidelity investigations."
    }
  ]
}