{
  "url": "https://www.wikihow.com/Clean-Deer-Antlers",
  "title": "How to Clean Deer Antlers",
  "steps": [
    {
      "title": "Saw the antlers off the skull cap.",
      "content": "Saw the antlers off the skull cap. Get a hacksaw and place it against the antlers, at the point where the antlers meet the skull. Saw both the antlers off, while securing the skull so that it doesn’t move, altering the trajectory of the saw so that the cut is uneven. Consider using a clamp to hold the skull in place, so that it doesn’t move while you saw it. [1] X Research source"
    },
    {
      "title": "Scrub the antlers with a wire brush.",
      "content": "Scrub the antlers with a wire brush. You need to remove all remaining organic material from the antlers. Scrub every part of the antler well, but give special attention to the area where the antlers met the skull cap. This is where hair and tissue are most likely to be hiding. Wire brushes are available at most hardware stores. They are abrasive enough to pick up tissue without requiring too much force."
    },
    {
      "title": "Boil the antlers outside.",
      "content": "Boil the antlers outside. Fill a large cooking pot with water and, for best results, a pinch of salt. Allow it to reach a boil on a stove or a fire pit. Once it boils, submerge the entire antler in the cooking pot and allow to boil for 30 minutes. This step is important for removing dangerous bacteria from the antlers. You should boil the antlers outside, otherwise they will stink up your house. Before beginning, test to see if the cooking pot is large enough to fit the antlers inside. All of the antlers should be submerged during boiling. If you don’t have any pots large enough, you can try using prongs to force them underwater or adjust them periodically during the boiling process."
    },
    {
      "title": "Remove antlers from the boiling water after 30 minutes.",
      "content": "Remove antlers from the boiling water after 30 minutes. Keep prongs on hand that you can use to remove the antlers without burning yourself. The antlers will feel soft when you pull them out of the cooking pot, but they will harden up after a few minutes. [2] X Research source"
    },
    {
      "title": "Allow the antlers to air dry for a day.",
      "content": "Allow the antlers to air dry for a day. Leave the antlers outside somewhere safe, where they will get sun and dry off. Do not, however, allow them to be out in the sun for more than 24 hours. The sun will erode the color of the antlers after more than a day of constant exposure."
    },
    {
      "title": "Apply water and soap to a towel.",
      "content": "Apply water and soap to a towel. Too much water can damage the antlers, so be sure that the towel is only damp, not wet. Squeeze excess water out of the towel. Apply a nonabrasive soap—not bleach. Bleach and bleach-based cleaners can damage the antlers."
    },
    {
      "title": "Scrub the antlers with the towel.",
      "content": "Scrub the antlers with the towel. Feel free to use force when scrubbing the antlers. Scrub until all dust and grime has been removed."
    },
    {
      "title": "Dry the antlers with a towel.",
      "content": "Dry the antlers with a towel. You do not want the antlers to remain wet. Use a new towel that is dry to go over them, picking up excess moisture. It is alright if the antlers are still somewhat damp at the end of the process."
    }
  ]
}