{
  "url": "https://www.wikihow.com/Be-Shy-at-School",
  "title": "How to Be Shy at School",
  "steps": [
    {
      "title": "Be meek.",
      "content": "Be meek. To be meek means to be quiet, or to have a kind of gentle demeanor. Even though these are traits of a shy person, they can also be good qualities to possess. Meekness can lend itself to approachability, which can actually make you appear more marketable during things like job interviews in the future. Keep to yourself, especially if there is any kind of drama going on. Be humble and kind, and don’t let your ego get inflated. [1] X Research source Even if your goal is to keep people at a distance and not interact much with others, it still pays to practice being approachable for the future when it will pay off in your favor."
    },
    {
      "title": "Avoid speaking too much.",
      "content": "Avoid speaking too much. In class, you might sit closer to the back of the room and keep to yourself. Avoid raising your hand and volunteering during class discussions. If people are hanging out and talking in the hall, don’t join in. The less you speak up, the more shy you’ll appear. Don’t let acting shy make you also appear rude. Don’t blatantly ignore someone if they speak to you, especially if it’s a teacher or person of authority."
    },
    {
      "title": "Avoid participating at events or activities outside school.",
      "content": "Avoid participating at events or activities outside school. Shy people tend to stay away from social situations. Shy people can be socially awkward sometimes, and gathering in groups can be a source of anxiety. You can choose to not attend these events, but if you do go, keep to yourself at them. Sit quietly by yourself. You could bring a book to read or play on your phone. This will make you appear shy. Events like parties, pep rallies, and sporting events are usually full of people being loud and crazy, so if you want to appear shy, you’ll want to act the opposite."
    },
    {
      "title": "Let other people start conversations.",
      "content": "Let other people start conversations. Shy people have trouble initiating conversations. If you want to act shy, don’t approach people and start conversations. Let others talk first, whether one-on-one or in groups. Shy people also have trouble keeping conversations going. Keep your conversations short and to the point."
    },
    {
      "title": "Keep a small circle of friends.",
      "content": "Keep a small circle of friends. Since many shy people have difficulty getting close with people, try to only keep a few good friends that you spend time with regularly. Having a huge group of friends might make you come off as a popular or outgoing person, which isn’t really what you’re going for. Feel free to act more like yourself around these close friends. Just because you want to act shy at school doesn’t mean you’ll want to cut yourself off from having any meaningful relationships at all."
    },
    {
      "title": "Keep a book with you at school.",
      "content": "Keep a book with you at school. Keeping your nose in a book when you’re in social situations can help you appear shy. It will make you look studious, rather than just socially awkward sitting there silently doing nothing. If you keep a novel with you to read at lunchtime, for example, it can help you keep to yourself."
    },
    {
      "title": "Keep to yourself in class.",
      "content": "Keep to yourself in class. As mentioned, you’ll want to avoid participating in class discussions, and only answer if the teacher calls on you directly. If the class breaks up to do group work, hang back on your own and do your own work. If you must be part of a group, do your work quietly and keep your eyes down on your paper. Don’t avoid speaking to the teacher if they call on you. You don’t want to end up getting scolded or in trouble because you are acting shy."
    },
    {
      "title": "Wear muted or neutral colors.",
      "content": "Wear muted or neutral colors. Rather than wearing bright or neon colors, wear lighter, more neutral tones. These tones are usually black, white, shades of brown, or even gray. These colors are far less likely to stand out in a crowd. Shy people want to blend in rather than stand out, so neutral clothing colors are a way to do that. The advantage to stocking your closet with neutrals is that they are great universal colors. On days you want to stand out a little more, or maybe when you’re outside of school, these neutrals will pair well with brighter colors in outfits."
    },
    {
      "title": "Avoid wearing flashy prints.",
      "content": "Avoid wearing flashy prints. Again, the goal is to blend in rather than stand out. Loud or flashy prints on your clothing don’t do a very good job at helping you blend in. Try to stick to solid colors, or simple prints like horizontal stripes. Consider avoiding t-shirts with logos, band names, or any other writing. These things could act as conversation starters, or reasons for strangers to approach you and ask about what’s printed on your shirt."
    },
    {
      "title": "Wear simple outfits.",
      "content": "Wear simple outfits. Keep your hemlines modest, and try not to show too much skin. Try comfortable cardigans, simple jeans, and plain shoes. Try to avoid layering on accessories like costume jewelry. If you wear makeup, keep it to a minimum. Stick to neutral and natural colors. [2] X Research source Fashion is a quick way to draw attention to yourself. From the colors and prints of your clothing to how you style it, it’s best to always lean towards the muted, and subtle side of things when trying to act shy."
    },
    {
      "title": "Keep a simple, traditional hairstyle.",
      "content": "Keep a simple, traditional hairstyle. If you’re trying to blend in, dying your hair bright pink or putting it in a mohawk won’t really help your case. Keep your haircut simple and traditional, like a bob for girls or a simple crew cut for guys. Anything that doesn’t really stand out is a good option. You still want to feel comfortable and good about yourself, so you’ll still want to pick a hairstyle you actually like!"
    },
    {
      "title": "Keep it modest.",
      "content": "Keep it modest. If you’re trying to act shy in a way that makes you come across as cute, then you’ll want to make sure the clothes you choose are modest. A cute, shy person wouldn’t wear revealing clothing. This kind of clothing would end up drawing attention to you rather than diverting it. A shy person in modest clothing can appear cute, approachable, and innocent."
    },
    {
      "title": "Avoid too much eye contact.",
      "content": "Avoid too much eye contact. When walking in the hallways, making eye contact, especially with people you know, could result in them starting a conversation. A shy person will want to avoid this. Keep your eye contact to a minimum so you can keep to yourself. Not looking at people is a sign to them that you aren’t interested in talking or interacting. If you’re at lunch and want to be left alone, consider reading a book or doing homework. This way, you won’t find yourself looking around and end up inviting attention or unwanted conversation."
    },
    {
      "title": "Keep some distance between yourself and other people.",
      "content": "Keep some distance between yourself and other people. Even in crowded school hallways, try to keep to yourself physically. Shy people are sometimes made anxious by being physically close to other people. By keeping some distance between yourself and others, you’ll also be sending the message that you don’t want to interact with them. If you are talking to someone, don’t stand close. Keep a few feet between your bodies. This will send a signal to the other person that you’re ready to leave at any moment, and they might end the conversation sooner."
    },
    {
      "title": "Fold your arms.",
      "content": "Fold your arms. Folding your arms across your body is a defensive signal in body language. It’s sort of like you’re trying to protect yourself from the outside world, which is exactly what a shy person would do. Folded arms generally mean someone doesn’t want to be approached. Remember: you’re trying to look shy, not bold or irritated. Fold your arms loosely, sort of like you’re giving yourself a hug, rather than folding them tightly and looking assertive. Keeping your shoulders a bit slouched and your head down will also help."
    }
  ]
}