{
  "url": "https://www.wikihow.com/Clean-Your-Ear-Piercing",
  "title": "A Guide to the Best Ear Piercing Cleaning Solutions (& How To Use Them)",
  "steps": [
    {
      "title": "Remove the earrings and clean your skin with saline solution.",
      "content": "Remove the earrings and clean your skin with saline solution. Before treating your infected piercing , wash your hands with antibacterial soap. Then, saturate a cotton ball with the saline solution and gently wipe down both sides of your pierced skin to disinfect the area and soften any crusted skin. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Symptoms of an infected piercing include discharge coming out of the piercing, fever, redness, warmth or swelling around the piercing, and pain. Handling an infected piercing with dirty hands could cause more complications, so be sure to scrub up!"
    },
    {
      "title": "Wipe the earring posts with rubbing alcohol 3 times a day.",
      "content": "Wipe the earring posts with rubbing alcohol 3 times a day. Germs and bacteria collect on the earrings posts, which fuels the infection. To kill the germs, remove your earrings and wipe the posts thoroughly with rubbing alcohol. Do this 3 times a day until your infection clears. [2] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source"
    },
    {
      "title": "Cover the posts with antibiotic ointment before reinserting them.",
      "content": "Cover the posts with antibiotic ointment before reinserting them. Use a new cotton swab to apply ointment to the post of the earrings. You only need a small amount of OTC antibacterial ointment for this. Be sure to do this each time you sterilize the posts with alcohol. [3] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source Applying alcohol and ointment before reinserting the earrings ensures the medication gets inside your earring holes. Gently rotate the earrings a few times once you've put them back in."
    },
    {
      "title": "Apply a warm compress",
      "content": "Apply a warm compress to ease the pain and swelling. To make a warm compress, soak a clean washcloth in warm water. Gently press the cloth over the piercing for 3-4 minutes. You can do this several times throughout the day if you need to. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Taking NSAIDs like ibuprofen (Advil, Motrin) and naproxen (Aleve) also help with pain relief and swelling. Be sure to read and follow all instructions on the medicine label. [5] X Research source"
    },
    {
      "title": "See a doctor if your symptoms last longer than 5-7 days.",
      "content": "See a doctor if your symptoms last longer than 5-7 days. Most infections can be resolved at home with cleaning and OTC ointment. If the infection doesn't clear up after a week, check with your doctor. You may need to get a prescription for oral antibiotics to knock out the infection. [6] X Research source"
    },
    {
      "title": "Wash your hands",
      "content": "Wash your hands thoroughly with antibacterial soap. Before handling your new piercing , scrub your hands with warm water and soap to remove germs and dirt. If you transfer germs to your piercing, you could get an infection. [7] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source When you're away from home, carry a bottle of hand sanitizer in your bag. That way, if you can't wash your hands, you can at least sterilize your fingers before touching your piercing. Try to avoid touching your piercings between cleanings."
    },
    {
      "title": "Dip a cotton ball or swab in saline cleaning solution.",
      "content": "Dip a cotton ball or swab in saline cleaning solution. Many piercing professionals will provide you with an ear piercing cleaning solution after you get your piercing (which is typically a saline solution). If you need to make your own saline solution at home, mix 1/4 teaspoon (3 g) of sea salt or table salt into a 1 cup (237 ml) of warm water. [8] X Research source Avoid using rubbing alcohol or hydrogen peroxide to clean your new piercing since they can slow down the healing process."
    },
    {
      "title": "Swab around the pierced area with the cotton ball or swab.",
      "content": "Swab around the pierced area with the cotton ball or swab. Gently sweep the solution over both sides of each ear at the site of the piercing so it's saturated with saline solution. The saline cleans the area and softens any loose or crusted skin around the piercing. If you don't have saline, wash the pierced area with mild, fragrance-free soap and warm water instead. [9] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source You don't need to use antibiotic ointment on a new piercing unless it's irritated or infected. For daily cleaning, saline solution is all you need. Remember not to pick at any crusted skin since that could cause an infection. Soften it with the saline solution and gently wipe it away. [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Rotate the earring posts a few times while the area is still wet.",
      "content": "Rotate the earring posts a few times while the area is still wet. Gently grasp the post between your fingers and turn it clockwise, then counterclockwise. Rotating the posts helps to keep the skin from getting attached or stuck to your piercing. [11] X Research source"
    },
    {
      "title": "Clean your piercing with the saline solution twice a day.",
      "content": "Clean your piercing with the saline solution twice a day. Making it part of your morning and bedtime routine is a good way to get into the habit of daily cleaning. It just takes a few minutes and can save you from getting a painful infection. [12] X Research source To speed up healing time, apply a thin coat of petroleum jelly around the opening of each piercing. Petroleum jelly keeps the piercings moist (and moist wounds heal faster). [13] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Keep your earrings in your ears until they heal.",
      "content": "Keep your earrings in your ears until they heal. Removing new earrings too soon can cause the earring holes to close up. Most ear piercings are fully healed after 6-8 weeks; after that, it's fine to take the jewelry out whenever you'd like. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Just don't leave them out too long! Even if the piercings are healed, they can still close up if your body heals super fast. Some ear piercings can take longer to heal. For instance, a cartilage piercing could take 4 months to a year to fully heal. Avoid swimming until your piercings are fully healed."
    },
    {
      "title": "Take your earrings out every night once they've healed.",
      "content": "Take your earrings out every night once they've healed. Taking earrings out while you sleep will prevent your earrings from snagging during your sleep. It also allows air to circulate around the skin, which helps to keep your pierced ears healthy. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Clean your earrings with rubbing alcohol when you remove them.",
      "content": "Clean your earrings with rubbing alcohol when you remove them. Dip a cotton swab in alcohol. Rub it over the posts when your earrings are out for the night. Doing this regularly will help keep the earring free of germs that can cause infection. [16] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source"
    },
    {
      "title": "Clean your lobes with alcohol or saline solution regularly.",
      "content": "Clean your lobes with alcohol or saline solution regularly. Treating healed ear piercings on a weekly or monthly basis reduces the chances of future infections. If your piercings ever begin to feel tender, disinfect the posts with alcohol and apply OTC antibacterial ointment before reinserting them. [17] X Trustworthy Source Michigan Medicine The University of Michigan's medical center, which provides patient care, supports research, and educates the public on health topics Go to source"
    }
  ]
}