{
  "url": "https://www.wikihow.com/Beat-Night-2-of-Five-Nights-at-Freddy%27s:-Sister-Location",
  "title": "How to Beat Night 2 of Five Nights at Freddy's: Sister Location",
  "steps": [
    {
      "title": "When you hide under the desk, click and drag to block the opening with a metal sheet.",
      "content": "When you hide under the desk, click and drag to block the opening with a metal sheet."
    },
    {
      "title": "Wait for the sheet to begin to open.",
      "content": "Wait for the sheet to begin to open. To stay safe, you must simply hold the sheet in place with the cursor. It is best to click and hold to keep it in place, as clicking and dragging is ineffective. Failing to do this will result in a jump scare and a Game Over."
    },
    {
      "title": "Keep at it.",
      "content": "Keep at it. After you have prevented the sheet from opening twice, you will be told to report to Ballora Gallery."
    },
    {
      "title": "Crawl through Ballora Gallery, housing the animatronic Ballora, to reach the Breaker Room.",
      "content": "Crawl through Ballora Gallery, housing the animatronic Ballora, to reach the Breaker Room. Listen for Ballora's music playing, as the loudness of the music indicates her proximity."
    },
    {
      "title": "Move slowly.",
      "content": "Move slowly. You can move quickly as long as you stop moving when Ballora's music grows louder. Moving while Ballora's music has grown too loud will result in a jump-scare, causing a Game Over."
    },
    {
      "title": "Arrive in the Breaker Room, which houses the animatronic Fun-time Freddy, and his hand-puppet, Bon-Bon.",
      "content": "Arrive in the Breaker Room, which houses the animatronic Fun-time Freddy, and his hand-puppet, Bon-Bon. Your task is to restart the systems, using a monitor. You have the ability to play audio to drive Freddy away when he gets near. Opening the monitor will cause Freddy to approach, restarting a system even more so."
    },
    {
      "title": "Restart part of a system, close the monitor, drive Freddy away with an audio clip, re-open the monitor and repeat.",
      "content": "Restart part of a system, close the monitor, drive Freddy away with an audio clip, re-open the monitor and repeat. If Freddy reaches you while the monitor is up, he will jump-scare you and cause a Game Over. Take caution when winding the last two breakers, because he is very aggressive on the last two breakers."
    },
    {
      "title": "Once this task is done, return through Ballora Gallery, in no danger, and complete the night.",
      "content": "Once this task is done, return through Ballora Gallery, in no danger, and complete the night."
    }
  ]
}