{
  "url": "https://www.wikihow.com/Board-Game-Storage",
  "title": "Creative Ways to Store and Organize Your Board Games",
  "steps": [
    {
      "title": "Display your board games openly on a large shelf.",
      "content": "Display your board games openly on a large shelf. Any shelf space you have in your home works great as long as they’re deep enough for the game boxes. Try to keep your board game boxes organized by color and size so they look aesthetically pleasing on your wall. IKEA shelves are really common storage options for board gamers. Common shelves that work well for games are the Kallax , Billy , and Eket . [1] X Research source Allplay allows you to build custom modular shelves so you’re able to store everything in your board game collection. BoxThrone stores board game boxes horizontally and has adjustable racks so you can easily change the heights of the shelves."
    },
    {
      "title": "Put your board games inside of a cabinet.",
      "content": "Put your board games inside of a cabinet. If you have a large cabinet or built-ins in your home, then clear out a little space so you can keep your board games out of sight. Store the ones you play most in the most easily accessible part of the cabinet so you don’t have to dig for them and make a mess. Smaller card games may even fit into drawers or smaller cabinet spaces in a desk or hutch."
    },
    {
      "title": "Tuck the games into your closet if you have extra space.",
      "content": "Tuck the games into your closet if you have extra space. If you have some shelving in your closet, hide your games away there when you’re not playing. Find a spot that you can easily reach and avoid putting games you play frequently up high so you don’t have to reach for them. Smaller card games fit well into a shoe organizer that hangs on the back of a closet door."
    },
    {
      "title": "Put your games in a hanging organizer to save space.",
      "content": "Put your games in a hanging organizer to save space. Hanging organizers usually give you space for folded clothes or cleaning supplies, but they’re also the perfect size for your board games. Hang the organizer from a sturdy rod or hook, and place your board games inside. This works best for lightweight games that don’t have a ton of pieces. If your board game boxes feel really heavy, opt for a sturdier shelf or cabinet instead."
    },
    {
      "title": "Slide games under your bed to keep them out of the way.",
      "content": "Slide games under your bed to keep them out of the way. Put your board games into under-bed storage containers to keep all of them grouped together. Keep the container under your bed, and simply pull it out any time you want to grab something to play. Some bed frames have built-in storage shelves or drawers where you can store your games as well."
    },
    {
      "title": "Store small games in a small basket that’s easy to access.",
      "content": "Store small games in a small basket that’s easy to access. If you have smaller card games and the boxes don’t take up that much room, put them all into a decorative basket and keep them in your main living space. That way, you can easily look through them and pull them out whenever you want to play. Wrap rubber bands around smaller boxes to help keep them closed so you don’t spill cards and pieces inside the basket."
    },
    {
      "title": "Hide your games in a table or ottoman with built-in storage.",
      "content": "Hide your games in a table or ottoman with built-in storage. Some coffee tables and ottomans have hidden storage compartments that are perfect for board games. Just tuck as many games as you can into the storage areas so they don’t clutter up any other areas of your home."
    },
    {
      "title": "Store the game pieces in clear plastic totes for uniform storage.",
      "content": "Store the game pieces in clear plastic totes for uniform storage. Take out all of the board game’s components and transfer them into a shallow plastic tote bin. Then, cut the game’s name off of the box and tape it to the inside of the lid. Stack or stand the totes up on a shelf or in your closet for quick access. [2] X Research source Attach labels to the sides of the tote bins as well so you can tell what game is inside from any angle. If you own a label maker, you can also make your own custom labels."
    },
    {
      "title": "Put the games in mesh bags to make them compact and portable.",
      "content": "Put the games in mesh bags to make them compact and portable. Take all of the game pieces out and slide them into a large mesh bag with a zipper. Cut out the name of the game from the front of the game box and tape it to the inside or outside of the bag. Then, just store the bags in a closet or cabinet until you’re ready to play. [3] X Research source For an even easier way to see what game is in each bag, print off a small version of the box art and tape it onto the zipper."
    },
    {
      "title": "Frame game boards to display them as art.",
      "content": "Frame game boards to display them as art. Slide the game’s board into a frame or make your own frame . Store the game pieces in a resealable plastic bag attached to the back of the frame or in a nearby cabinet. Then, just hang the board up on your wall and take it down whenever you want to play. This works best for games that you maybe don’t play as often since it may be a little annoying to take the frame down each time."
    },
    {
      "title": "Can I store board games in a garage?",
      "content": "Can I store board games in a garage? No, it’s best to keep your games inside in a place with a controlled temperature. Your garage can go through big changes in temperature and humidity, which can lead to mold growth. Mold spores easily attach to paper and cardboard, so it puts your board games at risk. [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Similarly, avoid keeping board games in an attic or unfinished basement to prevent any mold or mildew. This is especially important if you’re trying to preserve old or vintage board games."
    },
    {
      "title": "Should I store board games vertically or horizontally?",
      "content": "Should I store board games vertically or horizontally? Storing your games vertically is typically better so you don’t have to stack the boxes. When you stack games on top of each other, the lowest box in the pile supports a lot of weight and could get damaged over time. However, placing your games vertically can cause the pieces to rearrange inside the box. [5] X Research source It’s okay to stack 1 or 2 games on top of each other when you store them, but large stacks of 4 or 5 games can start getting too heavy."
    },
    {
      "title": "How do I keep game pieces organized inside the boxes?",
      "content": "How do I keep game pieces organized inside the boxes? While many games come with inserts to hold the pieces in place, you may also store the components in bead holders or plastic storage bags . Organize all of the pieces into separate compartments or bags and seal them so they don’t mix together. [6] X Research source Some stores like The Broken Token and Etsy sellers may sell custom inserts to help keep your games organized. Just search for the name of the game followed by “custom insert” to find one meant to fit inside the box."
    },
    {
      "title": "How do I keep track of board games in my collection?",
      "content": "How do I keep track of board games in my collection? If you have a lot of games, start an account on BoardGameGeek to log your collection. Find the games that you own, and click “Add to Collection” on the page to catalog it. You can also note down what edition you have, when you got it, and give it a rating. BoardGameGeek also helps you discover new games and log all of your play sessions."
    }
  ]
}