{
  "url": "https://www.wikihow.com/Breed-a-Grumpyre-in-My-Singing-Monsters",
  "title": "An Easy Guide to Breeding Grumpyre, Rare Grumpyre, & Epic Grumpyre",
  "steps": [
    {
      "title": "Verify you’re at level 9 or higher in My Singing Monsters.",
      "content": "Verify you’re at level 9 or higher in My Singing Monsters. The Grumpyre can only be bred once you’ve reached level 9. Your current level status is displayed at the top left corner of your screen. To start advancing toward level 9 , tap on “Goals” and complete the list of required goals."
    },
    {
      "title": "Place a Breeding Structure on Cold Island.",
      "content": "Place a Breeding Structure on Cold Island. You can only breed a Grumpyre on Cold Island when you’re breeding it from other monsters, so make sure you have a Breeding Structure on the island. Once you have a Grumpyre , you can only breed with it on Ethereal Island. You can use a Grumpyre to breed additional Grumpyres and other monsters. If you haven’t placed a breeding structure on either island , tap on “Market,” tap on “Structures,” then select the option to purchase a breeding structure for 200 gold coins or 10 shards. Consider upgrading your Breeding Structure for 25 Diamonds to reduce the breeding time. [1] X Research source"
    },
    {
      "title": "Light Wishing Torches on the island to increase the breeding odds.",
      "content": "Light Wishing Torches on the island to increase the breeding odds. Wishing Torches are items you can add to any island to help increase the chances of a successful breeding. Each torch increases your chances by 1%, and you can add up to 10 torches. This increases your chance of getting a Grumpyre by up to 10%. [2] X Research source The base chance of breeding a Grumpyre is only 1% , so lighting any torches you have is a great way to help boost your odds! Wishing Torches are available once you reach level 12. Each Wishing Torch costs 10,000 Coins or 10 Shards to buy. It then costs 2 Diamonds to light one. Wishing Torches stay lit for 24 hours, so aim to light them right before you’re ready to breed a Grumpyre."
    },
    {
      "title": "Tap on the breeding structure located on Cold Island.",
      "content": "Tap on the breeding structure located on Cold Island. Then, tap “Breed” to start the breeding process. This opens up a menu where you can select the monsters you want to breed. [3] X Research source"
    },
    {
      "title": "Breed a Deedge with a Congle, Bowgart, Spunge, or Thumpies.",
      "content": "Breed a Deedge with a Congle, Bowgart, Spunge, or Thumpies. Select a four-element monster from one column and a three-element monster from the other column. At this stage of the game, your four-element monster is a Deedge. The three-element monsters you can choose are the Congle, the Bowgart, the Spunge, and the Thumpies. For the best chance of creating the Grumpyre, pair the Deedge with the Congle. [4] X Research source Use your highest-level monsters, as higher levels can increase the odds of a successful breeding. Breed the Deedge by pairing monsters that provide equal parts of the elements Air, Plant, Water, and Cold. Examples of successful monster pairings that can breed the Deedge are Spunge + Mammott, Thumpies + Toe Jammer, and Congle + Potbelly. [5] X Research source Breed the Congle by pairing monsters that provide equal parts of the elements Air, Water, and Cold. Examples of successful monster pairings that can breed the Congle are Tweedle + Maw, Toe Jammer + Pango, and Mammott + Quibble. [6] X Research source"
    },
    {
      "title": "Tap “Breed” at the bottom of the screen after selecting your monsters.",
      "content": "Tap “Breed” at the bottom of the screen after selecting your monsters. The breeding structure will start flashing to indicate that your monsters are now breeding. The breeding period for the Grumpyre lasts 1 day and 12 hours on Cold Island. [7] X Research source If your Breeding Structure is upgraded, the breeding period takes 1 day and 3 hours. To avoid waiting for the breeding period to end , accept the offer to pay 36 diamonds after tapping on “Breed.”"
    },
    {
      "title": "Log back into My Singing Monsters after the breeding period ends.",
      "content": "Log back into My Singing Monsters after the breeding period ends. After the breeding period ends, the Grumpyre egg will automatically be relocated to the Nursery to incubate. The egg is a dark gray-green color and has 2 horns on the top. The incubation time can take at least 1 day and 12 hours. [8] X Research source Remember, Grumpyre has a 1% chance of being bred. It’s very rare, so it may take you multiple tries to get it. Just be patient and keep trying! If your breeding attempt was unsuccessful , return to the breeding structure, tap on “Retry,” and either select the same monsters you used previously or try a different monster pairing. According to gaming statistics for My Singing Monsters, you may need to execute about 70 attempts for a 50% chance of breeding a Grumpyre. It may take about 690 attempts for a 99.9% chance of breeding a Grumpyre. [9] X Research source"
    },
    {
      "title": "Tap on the Nursery once Grumpyre hatches.",
      "content": "Tap on the Nursery once Grumpyre hatches. You’ll receive a notification informing you that the Grumpyre egg has hatched. You can now sell the Grumpyre or select the option to place the Grumpyre on Cold Island. Once Grumpyre reaches level 15 , you can move it to Ethereal Island to breed it."
    },
    {
      "title": "Grumpyre is an Ethereal monster with the Shadow Element.",
      "content": "Grumpyre is an Ethereal monster with the Shadow Element. Grumpyre is a dark gray-green and bat-like monster. As one of the single-element Ethereal monsters, it’s pretty rare! Below are some of Grumpyre’s stats, including its likes and breeding capabilities: Likes : Maw, Arackulele, Saggle Tree, Dragon Tower, Bass String Bridge Song : On Cold Island : “Boom-Shika-La-Shika” On Ethereal Island : “Boom-Shika-La, Boom-Shika-La-La-La-La” Breeding capabilities : (can only breed on Ethereal Island) Whisp or Rare Whisp : Grumpyre + Ghazt Arackulele or Rare Arackulele : Grumpyre + Reebro Boodoo or Rare Boodoo : Grumpyre + Jeeode Kazilleon or Rare Kazilleon : Grumpyre + Humbug Grumpyre or Rare Grumpyre : Grumpyre + any other monster Earning rate : Cold Island : 14-194 Coins (Level 1-20, 0% happiness) Ethereal Island : 2-27 Shards (Level 1-20, 0% happiness) Monsters that like Grumpyre : Nebulob, Sox, Rare Grumpyre Selling price : 750,000 Coins or 20 Shards"
    },
    {
      "title": "Breed a Deedge with a Congle, Bowgart, Spunge, or Thumpies on Cold Island.",
      "content": "Breed a Deedge with a Congle, Bowgart, Spunge, or Thumpies on Cold Island. Rare Grumpyre is another Ethereal monster, so you also get it by breeding a four-element monster with a three-element monster. The best chances for breeding a Rare Grumpyre are the same as for getting a regular Grumpyre: breed a Deedge with a Congle, Bowgart, Spunge, or Thumpies. [10] X Research source The base odds of breeding a Rare Grumpyre are less than 1%. So, it can take multiple attempts to get one. Increase your odds of getting a Rare Grumpyre by lighting Wishing Torches and choosing high-level monsters to breed with. Rare Grumpyre’s egg is black with 2 large horns on the top and 4 small ones on the bottom. The hatched monster is black with 6 wings and multiple horns on its body. Breeding time : 1 day and 21 hours."
    },
    {
      "title": "Breed a Grumpyre with any other monster on Ethereal Island.",
      "content": "Breed a Grumpyre with any other monster on Ethereal Island. If you have a regular Grumpyre already, you can use it to breed a Rare Grumpyre. Once your Grumpyre is level 15, transport it to Ethereal Island and breed it with any other monster. [11] X Research source Using a single-element monster as the other parent might improve your odds of getting a Rare Grumpyre. For instance, breed Grumpyre with Ghazt, Reebro, Jeeode, or Humbug. The odds of getting a Rare Grumpyre on Ethereal Island are also less than 1%. Breeding time : 12 hours and 38 minutes."
    },
    {
      "title": "Breed a Bowgart with a Dandidoo on Cold Island.",
      "content": "Breed a Bowgart with a Dandidoo on Cold Island. Epic Grumpyre is an Epic and Ethereal type monster. The best chance of getting an Epic Grumpyre is by breeding a Bowgart and a Dandidoo. [12] X Research source Like the other Grumpyres, Epic Grumpyre has about a 1% chance of being bred successfully. So, it can take a lot of attempts to get it. Boost your chances by lighting the Wishing Torches and using high-level monsters for breeding. Epic Grumpyre’s egg is white with 2 horns on the bottom. The hatched monster is white with 2 wings and large bat ears. Breeding time : 1 day and 4 hours."
    },
    {
      "title": "Breed a Nebulob and Fung Pray on Ethereal Island.",
      "content": "Breed a Nebulob and Fung Pray on Ethereal Island. If you have the ethereal monsters Nebulob and Fung Pray, you can use them to breed an Epic Grumpyre, too. Simply take these monsters to Ethereal Island and use the Breeding Structure to breed them. [13] X Research source Epic Grumpyre also has a 1% chance of being bred on Ethereal Island. Breeding time : 7 hours and 46 minutes."
    }
  ]
}