{
  "url": "https://www.wikihow.com/Automatically-Redirect-Incoming-Messages-to-Another-E-Mail-Account-in-Outlook",
  "title": "How to Automatically Redirect Incoming Messages to Another E Mail Account in Outlook",
  "steps": [
    {
      "title": "Navigate to the Outlook sign in page.",
      "content": "Navigate to the Outlook sign in page. If you are using a work or school email address, you can log in at https://login.microsoftonline.com . If you are using a personal email account, you can log in at https://www.outlook.com . If you are using a free Outlook email account, you cannot redirect email."
    },
    {
      "title": "Enter your email address and click Next.",
      "content": "Enter your email address and click Next . Type your email address in the light-blue box and then click the blue button that says Next ."
    },
    {
      "title": "Enter your password and click Sign In.",
      "content": "Enter your password and click Sign In . Type your password in the light-blue box and then click the blue button that says Sign In . If you can't remember your email address or password, click Can't access your account? and follow the instructions, or contact your administrator."
    },
    {
      "title": "Click the Settings button.",
      "content": "Click the Settings button. It's the button that resembles a gear in the upper-right corner of the Outlook Web Application."
    },
    {
      "title": "Click Options.",
      "content": "Click Options . It's at the bottom of the Settings menu. This displays the Options menu in a sidebar to the left."
    },
    {
      "title": "Click Organize Email.",
      "content": "Click Organize Email . It's in the Options sidebar on the left side of the screen."
    },
    {
      "title": "Click Inbox Rules.",
      "content": "Click Inbox Rules . It's below \"Organize Email\" in the sidebar to the left."
    },
    {
      "title": "Click the arrow in the \"New Rules\" tab.",
      "content": "Click the arrow in the \"New Rules\" tab. It's next to the plus sign (+) under the \"New Rules\" tab. This displays a drop-down menu."
    },
    {
      "title": "Click Create a new rule for arriving messages.",
      "content": "Click Create a new rule for arriving messages . It's in the drop-down menu that appears when you click the arrow next to the plus sign."
    },
    {
      "title": "Type a name for the rule (optional).",
      "content": "Type a name for the rule (optional). If you want to create a name for the new rule, type it in the box labeled \"Name\". This is not required. [1] X Research source"
    },
    {
      "title": "Select Apply to all messages under \"When messages arrive\".",
      "content": "Select Apply to all messages under \"When messages arrive\". Use the drop-down menu below \"When messages arrive\" to select \"Apply to all messages\"."
    },
    {
      "title": "Select Redirect the message to under \"Do the following\".",
      "content": "Select Redirect the message to under \"Do the following\". Use the drop-down menu under \"Do the following\" to select \"Redirect the messages to\". This displays a list of your contacts."
    },
    {
      "title": "Select or enter an email address.",
      "content": "Select or enter an email address. If the email address you want to redirect to is in your list of contacts, click the contact to select the contact's email address. Otherwise, type the email address you want to redirect to in the field next to \"To:\". Then press Tab ↹ to deselect the email."
    },
    {
      "title": "Click Ok.",
      "content": "Click Ok . It's above the \"To:\" field. This returns you to the \"New Rule\" window."
    },
    {
      "title": "Click Save.",
      "content": "Click Save . It's at the top of the \"New Rule\" window. This takes you back to the \"Inbox Rules\" tab. [2] X Research source"
    },
    {
      "title": "Click File.",
      "content": "Click File . It's in the menu bar at the top of the page. This displays a drop-down menu."
    },
    {
      "title": "Click Info.",
      "content": "Click Info . It's the first option in the sidebar to the left. This displays Account Information page."
    },
    {
      "title": "Click Manage Rules and Alerts.",
      "content": "Click Manage Rules and Alerts . It's the third option on the Account Information page. It has an icon with an envelope and a bell."
    },
    {
      "title": "Click New Rule.",
      "content": "Click New Rule . It's the first button at the top of the \"Rules and Alerts\" window."
    },
    {
      "title": "Click Apply rule on messages I receive.",
      "content": "Click Apply rule on messages I receive . It's under \"Start from a blank rule\" at the bottom of the Rules Wizard window."
    },
    {
      "title": "Click Next.",
      "content": "Click Next . It's in the bottom-right corner of the Rules Wizard window."
    },
    {
      "title": "Click the checkbox next to \"sent only to me\" and \"when my name is in the To or Cc box\".",
      "content": "Click the checkbox next to \"sent only to me\" and \"when my name is in the To or Cc box\". They are in the box labeled \"Step 1: Select condition(s)\" in the Rules Wizard window. You can also check any other conditions you want to apply. You can select conditions such as emails that contain a specific word, or are from specific people or group, as well as emails that are marked as important or sensitive. Then click the blue link in the \"Step 2\" box at the bottom of the Rules Wizard window to select the specific word or group of people you want to be redirected."
    },
    {
      "title": "Click the checkbox next to \"forward it to people or public group\".",
      "content": "Click the checkbox next to \"forward it to people or public group\". It's under the box labeled \"Step 1: Select action(s)\" in the Rules Wizard window."
    },
    {
      "title": "Click People or public group.",
      "content": "Click People or public group . It's the blue text in the box labeled \"Step 2: Edit the rule description\" at the bottom of the Rules Wizard window."
    },
    {
      "title": "Enter a new email address and click Ok.",
      "content": "Enter a new email address and click Ok . This is the email you want your email messages to be forwarded to. You can either click an email from your address book or type it in the line labeled \"To:\" at the bottom of the window. Then click Ok in the lower-right corner of the window."
    },
    {
      "title": "Click Next twice.",
      "content": "Click Next twice. It's in the lower-right corner of the window."
    },
    {
      "title": "Type a name for this rule and click Finish.",
      "content": "Type a name for this rule and click Finish . Use the line below \"Step 1\" at the top of the page to type a name for the rule. Then click Finish in the lower-right corner of the window."
    },
    {
      "title": "Click Apply and then click OK.",
      "content": "Click Apply and then click OK . This applies the rule changes and takes you back to the Account Info screen. [3] X Research source You can also forward Gmail messages to another account."
    }
  ]
}