{
  "url": "https://www.wikihow.com/Connect-Gopro-Hero-3-to-the-Gopro-App",
  "title": "How to Connect Gopro Hero 3 to the Gopro App",
  "steps": [
    {
      "title": "Get the GoPro App from the Play Store (Android) or App Store (iOS).",
      "content": "Get the GoPro App from the Play Store (Android) or App Store (iOS). You can get it on your phone or tablet for free. The next few steps are using your camera, so you can set your phone aside."
    },
    {
      "title": "Press the Power/Mode button on the camera to turn it on.",
      "content": "Press the Power/Mode button on the camera to turn it on. The POWER/MODE button is on the front of the camera next to the lens."
    },
    {
      "title": "Press the Wi-Fi button twice .",
      "content": "Press the Wi-Fi button twice . This button is on the side of your camera with the Wi-Fi symbol."
    },
    {
      "title": "Press the Shutter/Select button.",
      "content": "Press the Shutter/Select button. It's on the top of the camera with a circle icon. This button combination enters the camera into the Wi-Fi menu."
    },
    {
      "title": "Use the Power/Mode button to navigate to GoPro App and press the Shutter/Select button.",
      "content": "Use the Power/Mode button to navigate to GoPro App and press the Shutter/Select button. Doing so will make your camera use the \"GoPro App\" Wi-Fi network. Now you're done using your camera and will use your phone again."
    },
    {
      "title": "Connect",
      "content": "Connect to the GOPRO-BP network on your phone. The network name should also contain a series of numbers and letters after the name, but the base \"GOPRO-BP\" should be similar to what you see available. The default password for this connection is \"goprohero\" in lowercase letters. If you're using an Android, swipe down from the top of your home screen, then tap and hold the Wi-Fi icon. Once a list of available networks appears, tap the \"GOPRO-BP\" network and enter \"goprohero\" as the password. Tap Connect to continue. If you're using an iPhone or iPad, go to Settings > Wi-Fi and tap the \"GOPRO-BP\" network. Enter \"goprohero\" for the password and tap Join ."
    },
    {
      "title": "Open the GoPro App.",
      "content": "Open the GoPro App. Your phone should be connected to your camera via Wi-Fi network and it will show up in the app. [1] X Research source If you've previously connected the two devices and it's suddenly not working, try updating the software on both your camera and phone, then erase those connections (Bluetooth and/or Wi-Fi). Finally, repair and reconnect them. [2] X Research source"
    }
  ]
}