{
  "url": "https://www.wikihow.com/Change-Your-VPN-on-PC-or-Mac",
  "title": "How to Change Your VPN on PC or Mac",
  "steps": [
    {
      "title": "Click the Windows Start button.",
      "content": "Click the Windows Start button. It's the button with the Windows logo. By default, it can be found in the task bar in the lower-left corner of your screen. This opens the Windows Start menu."
    },
    {
      "title": "Click Settings .",
      "content": "Click Settings . It's the icon that resembles a gear in the left sidebar of the Windows 10 Start menu. This opens the Settings menu."
    },
    {
      "title": "Click Network & Internet.",
      "content": "Click Network & Internet . It's next to an icon that resembles a globe in the Settings menu."
    },
    {
      "title": "Click VPN.",
      "content": "Click VPN . It's in the side menu to the left of the Network & Internet menu."
    },
    {
      "title": "Click + Add a VPN Connection.",
      "content": "Click + Add a VPN Connection . It's the first option in the VPN menu."
    },
    {
      "title": "Select Windows (built-in) under \"VPN provider\".",
      "content": "Select Windows (built-in) under \"VPN provider\". Use the drop-down menu under \"VPN provider\" at the top of the VPN menu to select \"Windows (built-in)."
    },
    {
      "title": "Type a name under \"Connection Name\".",
      "content": "Type a name under \"Connection Name\". This can be any name you choose. It can be the name of your provider, or a location, or something like \"My VPN Connection\"."
    },
    {
      "title": "Type the server name or address.",
      "content": "Type the server name or address. Type this information in the box labeled \"Server name or address\". You can get this information from your VPN provider."
    },
    {
      "title": "Select a VPN type.",
      "content": "Select a VPN type. If you are not sure what type of VPN type to select, select automatic, or contact your VPN provider to what type of VPN connection they use. Your options are as follows: Automatic . Point to Point Tunneling Protocol (PPTP) . L2TP/IPsec with certificate L2TP/IPsec with pre-shared key Secure Socket Tunneling Protocol (SSTP) IKEv2"
    },
    {
      "title": "Select a Sign in type.",
      "content": "Select a Sign in type. Select the type of sign in used to by your VPN provider to sign in to your VPN. Your options are as follows: User name and password Smart card One-time password Certificate"
    },
    {
      "title": "Type your user name and password.",
      "content": "Type your user name and password. If it is required, use the last two lines to type the user name and password you use to sign in to your VPN. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Save.",
      "content": "Click Save . It's below the form you use to set up your VPN. This takes you back the to VPN menu under Network & Settings menu. The VPN connection you just created will be listed at the top under \"VPN\"."
    },
    {
      "title": "Click the VPN connection you just created.",
      "content": "Click the VPN connection you just created. All VPN connections are listed under \"VPN\" at the top of the VPN menu, just below \"+ Add a VPN Connection\"."
    },
    {
      "title": "Click Connect.",
      "content": "Click Connect . This connects you to the VPN. You can connect to any VPN connection you have created in this menu. You can also disconnect from a VPN connection by click \"Disconnect\". [2] X Research source If you need to edit the VPN info or specify additional settings, click Advanced options below the VPN connection name in the list of VPN connections."
    },
    {
      "title": "Click the Apple menu.",
      "content": "Click the Apple menu. It's in the upper-left corner in the menu bar at the top of the screen."
    },
    {
      "title": "Click System Preferences….",
      "content": "Click System Preferences… . It's the second option in the Apple menu. This displays the System Preferences applications."
    },
    {
      "title": "Click the Network icon.",
      "content": "Click the Network icon. It's the icon that resembles a blue globe with white arcs."
    },
    {
      "title": "Click +.",
      "content": "Click + . It's below the list of network connections to the left in the Network menu."
    },
    {
      "title": "Select VPN under \"Interface\".",
      "content": "Select VPN under \"Interface\". Use the drop-down menu next to \"Interface\" to select VPN as the interface type. It's near the bottom of the Interface drop-down menu."
    },
    {
      "title": "Select the VPN type.",
      "content": "Select the VPN type. Use the drop-down menu next to \"VPN Type\" to select the connection type. Consult your VPN provider to learn which connection type is required. The three options are as follows: L2TP over IPSec Cisco IPSec IKEv2"
    },
    {
      "title": "Type a connection name.",
      "content": "Type a connection name. Type a name for the connection next to \"Service Name:\" You can name it anything you choose. You can name it after the VPN provider, or a location, or something like \"My VPN connection\"."
    },
    {
      "title": "Click Create.",
      "content": "Click Create . This creates a VPN connection, but it still needs to be configured."
    },
    {
      "title": "Type the server address.",
      "content": "Type the server address. Use the line labeled \"Server address\" to enter the server address provided to you by your VPN provider."
    },
    {
      "title": "Type the Account Name, or Remote ID and Local ID.",
      "content": "Type the Account Name, or Remote ID and Local ID. If you are using \"L2TP over IPSec\" or \"Cisco over IPSec\" VPN type, you will be required to provide the account name. If you are using an \"IKEv2\" VPN type, you will be required to provide the remote ID and local ID. This information is provided by your VPN provider. You can leave the Configuration drop-down menu as Default ."
    },
    {
      "title": "Click Authentication Settings.",
      "content": "Click Authentication Settings . This displays the menu where you include your authentications settings, such as your password."
    },
    {
      "title": "Select the authentication type.",
      "content": "Select the authentication type. Click the radial button next to the authentication type your VPN uses. If you are using a password to sign in to the VPN, select \"Password\" at the top of the list and type the password you use to sign in to your VPN in the bar next to it. If you are using a different method of authentication, such as a Certificate, select that in the list of options and follow the instructions."
    },
    {
      "title": "Type the shared secret.",
      "content": "Type the shared secret. Select \"Shared Secret\" under \"Machine Authentication\" and then type the shared secret password in the box next to \"Shared Secret\". Consult your VPN provider if you are unsure what the Shared Secret is. If you are using a certificate, select \"Certificate\" under User Authentication and Machine Authentication. Then click Select . Select the certificate from the list of certificates, and click Ok ."
    },
    {
      "title": "Click Ok.",
      "content": "Click Ok . It's in the bottom right-corner of the Authentication Settings window. This saves your Authentications settings."
    },
    {
      "title": "Click Advanced….",
      "content": "Click Advanced… . It's the button in the lower-right corner of the connection settings. This displays the Advanced VPN options."
    },
    {
      "title": "Check \"Send all traffic over VPN connection\" and click Ok.",
      "content": "Check \"Send all traffic over VPN connection\" and click Ok . This ensures that all your internet activity is done through the VPN. Click Ok in the lower-right corner to close the advanced options."
    },
    {
      "title": "Click Apply.",
      "content": "Click Apply . It's in the lower-right corner of the Network menu. This applies your VPN connection settings."
    },
    {
      "title": "Click Connect.",
      "content": "Click Connect . This connects to the VPN. If the connection is successful, it will say \"Connected\" at the top of the Network menu. [3] X Research source When you are connected to a VPN, a rectangular icon with bars through appears in the menu bar at the top. It has a timer next to it that says how long you have been connected to the VPN. You can click this icon to display a list of all VPN connections. Click any one of the VPNs in this list to connect to a VPN."
    }
  ]
}