{
  "url": "https://www.wikihow.com/Check-a-Microwave-for-Leaks",
  "title": "How to Check a Microwave for Leaks",
  "steps": [
    {
      "title": "Find a light bulb that reacts to microwaves.",
      "content": "Find a light bulb that reacts to microwaves. Certain objects react to microwave frequencies: A straight fluorescent light bulb (not a compact one) [1] X Research source A neon \"NE-2\" bulb from an electronics store, powered and hooked up to a voltage divider so it is just barely glowing [2] X Research source Cheap, consumer-grade microwave testers are often inaccurate, but fine as a first test [3] X Research source A professional-grade microwave tester can cost several hundred dollars USD. [4] X Research source This is only necessary in professional contexts."
    },
    {
      "title": "Darken the room.",
      "content": "Darken the room. If you are using a light bulb, dim the lights so you'll be able to see the bulb glow. Skip this step if you are using a microwave testing device."
    },
    {
      "title": "Put a glass of water in the microwave.",
      "content": "Put a glass of water in the microwave. Running an empty microwave exposes the magnetron (the part that actually creates the microwaves) to high power levels, which can damage or destroy it. A small glass of water (roughly 275 mL / a little over 1 cup) will reduce this risk, while still leaving plenty of un-absorbed microwaves to test for leaks. [5] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source This is especially important for older microwaves, which may have lower quality shielding around the magnetron. [6] X Research source"
    },
    {
      "title": "Turn on the microwave.",
      "content": "Turn on the microwave. Set it to run for one minute."
    },
    {
      "title": "Move the object slowly around the microwave.",
      "content": "Move the object slowly around the microwave. Hold the light bulb or tester at least 5 cm (2 inches) away from the surface of the microwave, including the handle. Move the object slowly (about 2.5 cm / 1 inch per minute) around the door seal and any areas that look damaged. [7] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source The microwave's power decreases rapidly with distance. Consider testing it at the distance you normally stand from the microwave, for instance the edge of the kitchen counter. If the microwave stops before you are done, replace the glass of water and run the oven for another minute."
    },
    {
      "title": "Look for a reaction.",
      "content": "Look for a reaction. If your microwave leaks, the fluorescent tube will glow, or the neon bulb will become noticeably brighter. Electronic testers react in different ways, so check the manual. If the tester displays a measurement, anything about 5 mW/cm 2 at a distance of 5 cm (2 inches) is cause for concern. [8] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source All of these methods are just quick tests, even the consumer-grade tester. These results do not necessarily mean your microwave is dangerous, but it does mean it's worth taking steps to address the problem ."
    },
    {
      "title": "Find two WiFi-enabled devices.",
      "content": "Find two WiFi-enabled devices. Some WiFi networks use roughly the same frequency as microwave ovens (about 2.4 GHz), so the oven's shielding should block the WiFi too. [9] X Research source To test whether the oven can do this as intended, you'll need a laptop that fits inside your microwave, plus a second device that can connect to your home WiFi network. The instructions below assume you are using two computers, but you can use WiFi-enabled phones instead if you know how to use them to ping each other. You can use Find my iPhone to ping an iPhone or an iPad or Find my Device to ping an Android. Make sure that the device's data is turned off and that the device is connected to a 2.4 GHz connection."
    },
    {
      "title": "Set your WiFi to 2.4GHz.",
      "content": "Set your WiFi to 2.4GHz. If you're not sure how to change your WiFi frequency, access your router settings and look for the \"802.11 mode\" info (usually under advanced settings): [10] X Research source 802.11b or 802.11g means you are on a 2.4 GHz network. Continue to the next step. 802.11a or 802.11ac means you are on a 5 GHz network. Some routers give you the option to switch to another standard. If your router does not have this option, this test won't work. 802.11n can operate on either frequency. Look for the frequency setting and set it to 2.4GHz. If the router produces two WiFi networks, one of these is 2.4 GHz."
    },
    {
      "title": "Unplug your microwave from the power socket.",
      "content": "Unplug your microwave from the power socket. Remove the whole electric plug from the wall socket rather than simply turning off the switch. You'll be putting your computer inside the microwave, and the last thing you want is to accidentally turn the oven on."
    },
    {
      "title": "Prepare the computer.",
      "content": "Prepare the computer. Turn your laptop on and connect to the local WiFI connection. Check the energy saver or display settings so the computer won't go to sleep while it's in the microwave."
    },
    {
      "title": "Find your computer's IP address",
      "content": "Find your computer's IP address . You'll need this to send a signal to your laptop. Here's how to find it: Windows: Open Control Panel. Go to Network and Sharing... → View network connections → select your WiFi connection → click the chevron to expand (if necessary) → View status of this connection → Details . Look for the number next to \"IPv4.\" [11] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Mac: Open System Preferences. Click Network . Select WiFi on the left and find your IP address on the right."
    },
    {
      "title": "Place the laptop in the microwave.",
      "content": "Place the laptop in the microwave. Do not turn the microwave on! You're just testing whether the microwave's shielding can block the WiFi signal."
    },
    {
      "title": "Ping from the other device",
      "content": "Ping from the other device . Open Command Prompt (on Windows) or Terminal (on Mac). Type ping , then a space, then your computer's IP address. For example, type ping 192.168.86.150 ."
    },
    {
      "title": "Wait for a response.",
      "content": "Wait for a response. If the ping is answered, the computer has successfully returned the signal through the microwave door. This means your microwave is leaking. If the packets time out, the microwave has blocked the signal from returning. This is not a guarantee that your microwave isn't leaking (since the microwave in operation produces much more powerful waves), but it is a good sign. Microwaves are legally allowed to leak a certain, safe amount. If your router is in the same room as your microwave or on the other side of a wall, a working ping doesn't necessarily mean a dangerous leak. As a rough estimate, a router with a strong signal strength (-40 dBm) should be at least 20 feet (6m) from the microwave (based on US and Canada regulations). [12] X Research source [13] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source [14] X Research source"
    },
    {
      "title": "Check the seals around the door.",
      "content": "Check the seals around the door. Microwave leaks are often the result of worn or broken elements on the microwave oven's door. If you have detected a leak, look for these common causes: Cracks on the hinges Worn areas or cracks on the seal Dents or breaks in the door itself Broken door hinges or door that fails to close firmly Damage to the metal mesh of the door (especially holes wider than 4.7 in / 12 cm) Broken door latch that does not immediately turn off the oven when you open the door. [15] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source"
    },
    {
      "title": "Take the microwave to a professional repair shop.",
      "content": "Take the microwave to a professional repair shop. An electronics repair shop has access to much more accurate microwave testing equipment. Its staff can confirm whether your microwave is safe, and identify the problem in need of repair. You may be able to convince a repair shop to rent you the testing equipment for a smaller fee. [16] X Research source However, these devices do require calibration and training to use, so hiring a professional may give more accurate results."
    },
    {
      "title": "Report a leaking microwave.",
      "content": "Report a leaking microwave. If your microwave is leaking, especially if it is new and undamaged, consider contacting the manufacturer. In the United States, all manufacturers are required to pass on your report to the FDA. [17] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source You can also report it to the FDA directly at this form . Outside of the US, report the issue to consumer safety organizations or government health departments."
    },
    {
      "title": "Understand the danger.",
      "content": "Understand the danger. Microwave radiation is the same kind of \"radiation\" as visible light and radio waves, not the ionizing radiation that can cause cancer or radioactivity. The only known risk of a leaking microwave is the high levels of heat it produces. This is most dangerous to the eye (where it can lead to cataracts) and the testes (where it can cause temporary sterility). [18] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Extreme levels of microwave radiation can cause skin burns. If you do not notice any symptoms and you stop using the leaking microwave, lasting damage is very unlikely."
    }
  ]
}