{
  "url": "https://www.wikihow.com/Be-Honest",
  "title": "How to Be Honest",
  "steps": [
    {
      "title": "Figure out why you lie and who you lie to.",
      "content": "Figure out why you lie and who you lie to. We've all lied at one time or another, to different people, to ourselves, and for different reasons. But coming up with a systematic plan for becoming more honest will be difficult unless you try to define those reasons and those people for yourself. Lies to make ourselves look better might include exaggerations, embellishments, and flat-out tall-tales we tell to others, and ourselves, to make ourselves feel better about our inadequacies. When you're unhappy about something, it's much easier to fill it in with lies than tell the truth. We lie to peers we think are better than us, because we want them to respect us as we respect them. Unfortunately, being dishonest is disrespectful in the long run. Give people more credit for their ability to empathize and understand you on a deeper level. Lies that avoid embarrassment might include lies told to cover up bad behaviors, transgressions, or any activity we're not proud of. If your mom found a pack of cigarettes in your jacket, you might lie and say that they're your friend's to avoid punishment. We lie to authoritative figures to avoid embarrassment and punishment, including ourselves. When we've done something we feel guilty about, lies are told to eliminate the guilt, avoid the punishments, and get back to the objectionable behavior we're forced to lie about. It's a vicious cycle."
    },
    {
      "title": "Anticipate behaviors that will make you feel guilty.",
      "content": "Anticipate behaviors that will make you feel guilty. [1] X Research source To break the chain of embarrassment and lying, it's important to learn to anticipate things that you'll likely feel guilty about in the future, and avoid those behaviors. When you lie, you're covering up some uncomfortable truth that's more easily couched in a lie. You can either get comfortable with the truth, or abandon the behavior that makes you embarrassed. [2] X Research source If you smoke cigarettes, you won't have to lie if everyone knows it's true. Own up to it. If a behavior is un-own-upable, it's probably best to avoid it. It would be humiliating for your partner to find out that you had an inappropriate relationship with a coworker, but you won't have to lie if you don't do it."
    },
    {
      "title": "Stop comparing yourself to others.",
      "content": "Stop comparing yourself to others. Sometimes we lie to make ourselves seem bigger and better than we really are. Because we're constantly competing and comparing ourselves to others, any inadequacies can be most-easily overcome with a quick and creative lie. If you stop feeling competitive with others and give yourself the value you deserve, you won't feel the need to lie to bring yourself up, because you're already up! [3] X Research source Forget what you think other people want to hear from you. Give other people the benefit of the doubt, and assume that they're not running \"game\" on you, or being manipulative. Speak from your heart and tell the truth, without even the slightest bit of concern about whether or not it will make you look \"bad.\" People respect honesty, even when the truth is uncomfortable. Let your honesty impress people, not your exaggeration. Lots of dishonesty results from attempts to impress our peers with elaborate tales that will one-up everyone else at the table. If you're unable to contribute to the round of anecdotes about European travel, just listen quietly and wait until the subject changes, instead of making up a ruse about your study-abroad in Majorca."
    },
    {
      "title": "Accept the consequence and decide to face them.",
      "content": "Accept the consequence and decide to face them. Sometimes, it's better to own up to lies, to deceits, and to prior behaviors that you're embarrassed about, rather than continue weaving an elaborate web of lies. It can be liberating and extremely healthy to come clean. [4] X Expert Source Laura Richer Licensed Mental Health Counselor Expert Interview. 24 September 2021. Even if there will be some consequences at the end of the admission, it'll be the honest consequences that you deserve. [5] X Research source"
    },
    {
      "title": "Do things that make you feel pride.",
      "content": "Do things that make you feel pride. You don't have to lie if you feel good about yourself! Surround yourself with caring, understanding people who will respect you for who you are. Do things that give you pleasure and that make you feel proud of yourself. [6] X Research source Getting super-drunk every night might make you feel good for a couple hours, giving you pleasure, but the ice-pick in your brain the next morning at work will have you feeling embarrassed and guilty when you can't make it into work. Take care of yourself, mentally and physically. Don't do things you're embarrassed to do."
    },
    {
      "title": "Avoid situations in which you'll have to lie for others.",
      "content": "Avoid situations in which you'll have to lie for others. Be wary when someone tells you something in confidence that you know that you should share with someone else (e.g., knowledge of a crime, a lie, or a harmful act against another). Hearing such information puts you in a difficult position, especially when the truth eventually emerges and reveals to the affected person that you knew all along. [7] X Research source If someone begins a sentence with \"Don't tell so-and-so about this, okay?\" be prepared to offer your own disclaimer: \"If it's something that I'd want to know about were I them, then please don't tell me. I don't want to be responsible for anyone's secrets but my own.\""
    },
    {
      "title": "Distinguish between what the person you are conversing with needs to know and what you want to say.",
      "content": "Distinguish between what the person you are conversing with needs to know and what you want to say. Sometimes, we feel a burning urge in our guts to make ourselves be heard. Telling off a rude roommate, confronting your spouse, or arguing with a teacher can all seem like moments that require our complete and uncorked honesty, but pulling out the stopper can be a quick way to sour relationships and say things you don't actually mean. To avoid over-sharing, try to figure out the difference between things that you need to say because another person needs to hear it, and things that you want to say to make yourself feel better. Someone else needs to know if they're missing something that will cause them physical or emotional harm, or if they're doing something that's affecting other people in the same way. Your roommate might need to know that their excessive drinking is making you uncomfortable in your own house, but not that you think a new date is \"trashy.\" You might want to say something in a fit of anger or high emotion that, upon reflection, you might be able to couch in a more friendly way. In the middle of an argument about a lackluster relationship, you may want to say, \"You're gaining weight and now I'm not attracted to you,\" and this might be important for your spouse to hear in some ways, though not in others. However, \"I think we could be healthier\" puts the same sentiment in the language of something your spouse needs to know, in a much more polite way."
    },
    {
      "title": "Exercise tact",
      "content": "Exercise tact . Everyone likes a straight-shooter, but sometimes a straight-shooter's aim can be off by a couple inches. Consider the effect of your words and learn to rephrase possibly-offensive or uncomfortable language. Learn to volunteer appropriate opinions. [8] X Research source Use \"I\" statements when sharing uncomfortable truths. When you're sharing your opinions and truths with others, try to keep your honesty tamed. Focus on talking about your feelings, and your opinions, to stay respectful of others. [9] X Expert Source Laura Richer Licensed Mental Health Counselor Expert Interview. 24 September 2021. Try to add the phrase \"In my experience...\" or \"Personally, I've observed that...\" at the beginning, or end it with \"...but that's just my observation/experience, that might not be how things are everywhere\". Learn to listen quietly while others are speaking, even if you disagree with what they're saying, or feel the need to dissent. When you take a turn to speak, they'll offer you the same courtesy, making the exchange both more honest and more comfortable."
    },
    {
      "title": "Give yourself an objective appraisal.",
      "content": "Give yourself an objective appraisal. It's important to look in the proverbial mirror every now and then and take stock of how you feel. What do you like about yourself? What do you need to work on? It's possible to build up elaborate psychological barriers that force us into dishonest behaviors, opinions, and activities that could be avoided by giving ourselves an objective appraisal. Write down a list of your strengths and weaknesses in a notebook, not to take stock of your self-worth, but to find things to improve and to celebrate your achievements. Identify your strengths. What are you good at? What do you do better than most people you know? What do you contribute to daily life? What are proud of? In what ways are you better than you once were? Identify your weaknesses. What embarrasses you about yourself? What could you do better? Have you gotten worse at something specific, over the years?"
    },
    {
      "title": "Confront the things about yourself that you dislike.",
      "content": "Confront the things about yourself that you dislike. A big source of dishonesty in our lives comes from an unwillingness to confront the things about ourselves that we're ashamed of, embarrassed about, or just plain disgusted by. Without dwelling on them, try to define them honestly. Maybe you always hoped to have published that debut novel by the time you turned 30, a goal that's no closer now than it was 5 years ago. Maybe you know you need to get in shape, but find it easier to keep up the same old routine. Maybe your relationship is stale and you're unhappy in it, but can't bring yourself to make any considerable changes. As much as you can, try to eliminate excuses from your mind. It doesn't matter why this particularly uncomfortable truth about you is so, because you can't go back into the past to change it. You can, however, change your behavior now and start making yourself happier."
    },
    {
      "title": "Create opportunities for yourself to improve.",
      "content": "Create opportunities for yourself to improve. From your list of strengths and weaknesses, try to identify specific areas for improvement, and specific ways that you might improve yourself. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source What was necessary for your strengths to become strengths? What did you do that you're especially proud of? In what way could that truth inform your desire to improve some of your weaknesses? What threatens your ability to improve yourself? Are these threats external, like a lack of funds necessary to buy a gym membership and lose a few pounds, or internal, like a lack of desire to research DIY weight-loss options?"
    },
    {
      "title": "Take action.",
      "content": "Take action. When you decide to act, carry through with your decision. Lying to yourself is easy. It's easy to come up with a couple hundred reasons not to do something you don't want to do. That's why we let it happen so often! Make it hard on yourself. When you decide to end a relationship, or start working, start doing it. Make it happen. Now. Don't wait until you come up with a litany of reasons that it's \"not the right time.\" When you make a decision, set it in motion. Make it easy on yourself to be successful in accomplishing your improvements. Set up a risk-and-reward exchange when you accomplish a daunting task, like buying yourself that new guitar after ending your ugly relationship, or treating yourself to a vacation after losing a couple pounds. Accomplish your tasks with digital aid: you can sign up with Skinny-Text to receive exercise reminders on your phone, or even consider using Pact, which will charge you a specific amount of money if you choose not to exercise."
    },
    {
      "title": "Don't add color to your stories.",
      "content": "Don't add color to your stories. One all-too-tempting and common little lie is in filling in extra details to make a story more entertaining. It can be tempting to make it a bear that wandered into your campsite, rather than a raccoon, but you might be setting a precedent that opens up reasons and opportunities for more lies. Let the truth be the truth and be as honest as possible."
    },
    {
      "title": "Get creative with \"white lies.\"",
      "content": "Get creative with \"white lies.\" We've all been there, when someone asked something dreaded, like: \"Do I look fat in this?\" or \"Is Santa Claus real?\" Sometimes, we feel we must lie to make someone else feel better, or to lessen the blow or some uncomfortable truth, but the choice between being honest and lying isn't always a choice between A and B. [11] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Emphasize the positive . Shift the focus away from what, in all honesty, you think is negative. Instead of saying \"No, I don't think you look good in those pants\" say \"They're not as flattering as the black dress—that dress really looks amazing on you. Have you tried it on with those stockings you wore to my cousin's wedding last year?\" Keep some opinions to yourself . It might be true that you're not crazy about the cowboy-themed restaurant and bar that your best friend wants to visit on her only night in town, but it's not necessarily \"honest\" to share that opinion. What you want is to serve the greater good of the evening–you've only got one night together!–to keep fun moving forward. Instead of saying, \"I don't like this place. Let's go somewhere else,\" say \"Although it's not my favorite place, I want to do what you want to do. Let's make it awesome.\" Deflect the question. If your child wants to know if Santa Claus is real, tell them you're not sure, and engage them. Ask them what seems to be true for them: \"What do you think? What do kids say at school?\" You don't have to decide between a flat-out lie and the total truth. The real world is more complicated than that."
    },
    {
      "title": "Stay silent if you need to.",
      "content": "Stay silent if you need to. If you're in a tense situation, in which getting honest would disrupt everyone's mood and happiness, it's not necessarily dishonest to remain silent. If you've got the option of staying out of it, stay out of it. It takes courage to stay silent in an awkward situation sometimes. Choose the high road. In a disagreement, more opinions don't make the issue easier to untangle, necessarily. You don't have to tell a white lie to get an argument to end, nor do you need to continue dropping truth-bombs. Stay out of petty disagreements entirely, rather than reigniting the flame."
    }
  ]
}