{
  "url": "https://www.wikihow.com/Calculate-Electronegativity",
  "title": "How to Calculate Electronegativity",
  "steps": [
    {
      "title": "Understand that chemical bonds occur when atoms share electrons.",
      "content": "Understand that chemical bonds occur when atoms share electrons. To understand electronegativity, it's important first to understand what a \"bond\" is. Any two atoms in a molecule that are \"connected\" to each other on a molecular diagram are said to have a bond between them. [2] X Research source This means that they share a set of two electrons with each atom contributing one electron to the bond. The exact reasons for why atoms share electrons and bonds are a little beyond the scope of this article. If you want to learn more, try this article on the bond basics or WikiHow's own How to Study the Nature of the Chemical Bond (Chemistry)."
    },
    {
      "title": "Understand how electronegativity affects the electrons in the bond.",
      "content": "Understand how electronegativity affects the electrons in the bond. When two atoms share a set of two electrons in a bond, they don't always share them equally. When one atom has a higher electronegativity than the atom it's bonded to, it pulls the two electrons in the bond closer to itself. An atom with very high electronegativity may pull the electrons all the way to its side of the bond, barely sharing them at all with the other atom. [3] X Research source For example, in the molecule NaCl (sodium chloride), the chlorine atom has a fairly high electronegativity and the sodium has a fairly low one. Thus, the electrons will get pulled towards the chloride and away from the sodium ."
    },
    {
      "title": "Use an electronegativity table as a reference.",
      "content": "Use an electronegativity table as a reference. An electronegativity table of the elements has the elements arranged exactly like in a periodic table, except that each atom is labeled with its electronegativity. These can be found in a variety of chemical textbooks and technical articles as well as online. Here is a link to an excellent electronegativity table. Note that this uses the Pauling electronegativity scale, which is the most common. [4] X Research source However, there are other ways to measure electronegativity, one of which will be shown below."
    },
    {
      "title": "Remember electronegativity trends for easy estimations.",
      "content": "Remember electronegativity trends for easy estimations. If you don't have an electronegativity table handy, you can still estimate the strength of an atom's electronegativity compared to the strength of another element's atom based on where it is located on a normal periodic table . [5] X Research source Although you will not be able to calculate a number value, you can evaluate the difference between the electronegativities of 2 different elements. As a general rule: An atom's electronegativity gets higher as you move to the right in the periodic table. An atom's electronegativity gets higher as you move up in the periodic table. Thus, the atoms in the top right have the highest electronegativities and the atoms in the bottom left have the lowest ones. For example, in the NaCl example from above, you can tell that chlorine has a higher electronegativity than sodium because it's almost all the way in the top right. On the other hand, sodium is far to the left, making it one of the lower-ranking atoms."
    },
    {
      "title": "Find the electronegativity difference between the two atoms.",
      "content": "Find the electronegativity difference between the two atoms. When two atoms are bonded together, the difference between their electronegativities can tell you about the qualities of their bond. Subtract the smaller electronegativity from the larger one to find the difference. For example, if we're looking at the molecule HF, we would subtract the electronegativity of hydrogen (2.1) from fluorine (4.0). 4.0 - 2.1 = 1.9"
    },
    {
      "title": "If the difference is below about 0.5, the bond is nonpolar covalent.",
      "content": "If the difference is below about 0.5, the bond is nonpolar covalent. Here, the electrons are shared almost equally. These bonds don't form molecules that have large charge differences on either end. Nonpolar bonds tend to be very difficult to break. [6] X Research source This is because the atoms are sharing electrons, making their bond stable. It requires a lot of energy to break this bond. [7] X Research source For example, the molecule O 2 has this type of bond. Since the two oxygens have the same electronegativity, the difference between them is 0."
    },
    {
      "title": "If the difference is between 0.5-1.6, the bond is polar covalent.",
      "content": "If the difference is between 0.5-1.6, the bond is polar covalent. These bonds have more electrons at one end than the other. This makes the molecule a little more negative at the end with the electrons and a little more positive at the end without them. The charge imbalance in these bonds can allow the molecule to participate in certain special reactions, such as joining with another atom or molecule or pulling a molecule apart. This is because it's still reactive. [8] X Research source A good example of this is the molecule H 2 O (water). The O is more electronegative than the two Hs, so it holds the electrons more tightly and makes the entire molecule partially negative at the O end and partially positive at the H ends."
    },
    {
      "title": "If the difference is over 2.0, the bond is ionic.",
      "content": "If the difference is over 2.0, the bond is ionic. In these bonds, the electrons are completely at one end of the bond. The more electronegative atom gains a negative charge and the less electronegative atom gains a positive charge. These sorts of bonds allow their atoms to react well with other atoms and even be pulled apart by polar molecules. An example of this is NaCl (sodium chloride or salt). The chlorine is so electronegative that it pulls both electrons in the bond all the way towards itself, leaving sodium with a positive charge. NaCl can be broken apart by a polar molecule, such as H2O (water). In a water molecule, the hydrogen side of the molecule is positive, while the oxygen side is negative. When you mix the salt into the water, the water molecules break down the salt molecules, dissolving the salt. [9] X Research source"
    },
    {
      "title": "If the difference is between 1.6-2.0, check for a metal.",
      "content": "If the difference is between 1.6-2.0, check for a metal. If there is a metal in the bond, the bond is ionic . If there are only non-metals, the bond is polar covalent . Metals include most of the atoms on the left side and the middle of the periodic table. This page has a table that shows which elements are metals. [10] X Research source Our HF example from above falls in this range. Since H and F aren't metals, they have a polar covalent bond."
    },
    {
      "title": "Find the first ionization energy of your atom.",
      "content": "Find the first ionization energy of your atom. Mulliken electronegativity is a slightly different way of measuring electronegativity than is used in the Pauling table above. To find Mulliken electronegativity for a certain atom, find that atom's first ionization energy. This is the energy required to make the atom discharge a single electron. This is something you'll probably have to look up in chemistry reference materials. This site has a good table you may want to use (scroll down to find it). [11] X Research source As an example, let's say that we're trying to find the electronegativity of lithium (Li). In the table on the site above, we can see that its first ionization energy is 520 kJ/mol ."
    },
    {
      "title": "Find the electron affinity of the atom.",
      "content": "Find the electron affinity of the atom. This is a measure of the energy gained when an electron is added to an atom to form a negative ion. Again, this is something you'll need to look up in reference material. This site has resources you may want to browse. [12] X Research source The electron affinity of lithium is 60 kJ mol -1 ."
    },
    {
      "title": "Solve the Mulliken electronegativity equation.",
      "content": "Solve the Mulliken electronegativity equation. When you're using kJ/mol as units for your energies, the equation for Mulliken electronegativity is EN Mulliken = (1.97×10 −3 )(E i +E ea ) + 0.19 . Plug your values into the equation and solve for EN Mulliken . [13] X Research source In our example, we would solve like this: EN Mulliken = (1.97×10 −3 )(E i +E ea ) + 0.19 EN Mulliken = (1.97×10 −3 )(520 + 60) + 0.19 EN Mulliken = 1.143 + 0.19 = 1.333"
    }
  ]
}