{
  "url": "https://www.wikihow.com/Alphabetize-Apps-on-iPhone",
  "title": "3 Easy Ways to Organize iPhone Apps in Alphabetical Order",
  "steps": [
    {
      "title": "Open Settings .",
      "content": "Open Settings . This is the grey cog icon. Make sure to update your iPhone . [2] X Research source This method will reset all default apps to their default locations and alphabetize all third-party apps. This will also erase any existing app folders on your home screen. If you don't want to lose unique folders, try manually organizing the apps instead."
    },
    {
      "title": "Tap General.",
      "content": "Tap General . This can be towards the middle of Settings . [3] X Research source"
    },
    {
      "title": "Tap Transfer or Reset iPhone.",
      "content": "Tap Transfer or Reset iPhone . You can find this towards the bottom, above Shut Down . [4] X Research source"
    },
    {
      "title": "Tap Reset.",
      "content": "Tap Reset . A pop-up menu will open."
    },
    {
      "title": "Tap Reset Home Screen Layout.",
      "content": "Tap Reset Home Screen Layout . This will reset your Home screen to its default settings with default apps. All third-party apps you have installed will be organized alphabetically. [5] X Research source If you're looking for new ways to organize your iPhone, consider an aesthetic Home screen layout ."
    },
    {
      "title": "Tap and hold an app on your Home screen.",
      "content": "Tap and hold an app on your Home screen. If you added apps to your Home screen, you can easily organize them how you want. [6] X Research source Use this method to manually alphabetize your Home screen apps."
    },
    {
      "title": "Drag the app to a new location.",
      "content": "Drag the app to a new location. Doing so will put your Home screen in Edit mode, and the apps will shake. [7] X Research source You can also long-press an app and tap Edit Home Screen ."
    },
    {
      "title": "Release the app.",
      "content": "Release the app. This will place the app in the designated position."
    },
    {
      "title": "Repeat for all remaining apps.",
      "content": "Repeat for all remaining apps. Use steps 1 to 3 to manually place the apps in alphabetical order."
    },
    {
      "title": "Click Done when finished.",
      "content": "Click Done when finished. This will exit Edit mode. Alternatively, click anywhere on the Home screen to exit Edit mode."
    },
    {
      "title": "Swipe left on your Home screen.",
      "content": "Swipe left on your Home screen. If you have more than one page for your Home screen, continue to swipe until you see the App Library . [8] X Research source The App Library contains a list of pre-alphabetized apps."
    },
    {
      "title": "Click the search bar at the top.",
      "content": "Click the search bar at the top. Your apps will be displayed in alphabetical order. [9] X Research source Scroll up and down to view the apps, or use the letters listed on the right side to navigate."
    }
  ]
}