{
  "url": "https://www.wikihow.com/Bend-a-Note-on-Guitar",
  "title": "How to Bend a Note on Guitar",
  "steps": [
    {
      "title": "Use bends for a unique, bluesy way to transition between notes.",
      "content": "Use bends for a unique, bluesy way to transition between notes. Bending guitar strings are how you put personality into your notes, taking basic scales like the blues pentatonic and molding it to fit your unique musical ideas. Bends, appropriately, are a way to add \"tone color\" to your playing. They are accent notes, used for emphasis and improvisation. [1] X Research source All of the techniques and rules here should be, to pardon the pun, bent. Experiment with bends and strings to get the tones you want for your playing."
    },
    {
      "title": "Hold down the note you want to bend with your ring finger.",
      "content": "Hold down the note you want to bend with your ring finger. You can, of course, bend with any finger you want. However, using your ring finger will allow you to put the middle and index fingers behind the fret as well, giving you three fingers to help bend the strings instead of one. [2] X Research source The thicker your strings, the harder they are to bend. As such, acoustic guitars are often harder to bend, and you'll need 2-3 fingers to really manipulate the string."
    },
    {
      "title": "Pivot your wrist up and away from your body to bend.",
      "content": "Pivot your wrist up and away from your body to bend. Keeping your fingers firmly in place, use your whole hand to bend the notes. The power comes from your forearm, which you should feel moving as you bend. Think of it as turning your wrist to push your index finger, and thus the string, as high as you can. [3] X Research source"
    },
    {
      "title": "Learn how to read bends in written guitar music.",
      "content": "Learn how to read bends in written guitar music. Bends are almost always simply notated, whether you're reading tab or a guitar score. A bend, remember, makes your note higher pitched. As such, all written music tells you wen to bend, and how high to bend the note -- telling you which fret the note should sound like when bent the right amount. The following two methods of writing bends are the most common: [4] X Research source Tab: Usually written with a \"b\" for bend an a \"r\" for release, when the bend ends: G|---------4b5r4------| would mean \"bend the 4th fret up so it sounds like the 5th fret, then release back to the 4th.\" Guitar scores: Will have a small upward arrow drawn on the staff, like the one in the video. It will tell you how far to bend the note, as well as when to come back down. Half-bends only go up one fret. Full-bends go up two frets. Over bends push the note three frets or higher. [5] X Research source"
    },
    {
      "title": "Work on \"landing\" your bends on other notes in the scale.",
      "content": "Work on \"landing\" your bends on other notes in the scale. A half-step bend is a bend that moves down one fret, meaning the note you've bent so it sound's exactly like one fret down. A full-step bend moves two frets down. To really improve as a guitarist, check your tone at the top of the bend. Get used to moving right down to other notes in the scale, keeping your playing melodic and on-key. [6] X Research source Check your tone against a normally picked note. For example, bend the 3rd fret all the way to the 5th fret. Then pick the 5th fret normally to check if they sound the same."
    },
    {
      "title": "Wrap your thumb over the top of the fretboard for extra power on big bends.",
      "content": "Wrap your thumb over the top of the fretboard for extra power on big bends. If you're bending heavy strings or just want a little extra stretch for a huge bend, you can hook your thumb over the top of the neck, allowing you to squeeze your fingers and thumbs together like a clamp. This little extra leverage can make all the difference for a big bend."
    },
    {
      "title": "Bend strings down, instead of up, when playing on the thicker strings.",
      "content": "Bend strings down, instead of up, when playing on the thicker strings. You do not always have to push up on the strings. You get the exact same effect by pulling down -- and this is much easier with the high strings anyway. Use whatever direction feels comfortable for you in the moment, since neither is wrong or right. When bending down, it can help to angle your fingers slightly above the string, allowing you to pull them down towards your palm."
    },
    {
      "title": "Shake your bends a bit for tasty, melodic vibrato.",
      "content": "Shake your bends a bit for tasty, melodic vibrato. Vibrato is when you lightly bend the string back and forth, making the note waver or vibrate. A lot of players will shake the note in or out of the bend, or shake it slightly at the top of their bend, for a little extra flavor on the note. [7] X Research source If you're playing electric, try using the wammy bar for similar effects. [8] X Research source"
    },
    {
      "title": "Know where you can use bends effectively.",
      "content": "Know where you can use bends effectively. Remember, it is best to bend to another note in the scale for the best effects. As such, you need to practice playing your scales with bends to find out where everything sounds best. Try playing the blues pentatonic scale first, as the simple, boxy form is perfect to practice bends. For example, look at some of the possible bends you have in a simple A-minor pentatonic scale: Half-Step Bends: 5th string -- 5th and 6th frets. 3nd string -- 7th fret Full Bends: 6th string -- 8th fret 5th string -- 5th fret 4th string -- 5th fret 3rd string -- 5th fret, 7th fret 2nd string -- 8th fret 1st string -- 8th fret [9] X Research source"
    }
  ]
}