{
  "url": "https://www.wikihow.com/Clean-up-Dog-Urine",
  "title": "How to Clean up Dog Urine",
  "steps": [
    {
      "title": "Absorb the mess.",
      "content": "Absorb the mess. Tear several pieces of paper towel off the roll. Lightly place the paper towels over the spill. Let them soak up the urine; add more paper towels if necessary. [1] X Research source"
    },
    {
      "title": "Wipe up the urine.",
      "content": "Wipe up the urine. Put on rubber or plastic gloves. Pick up the wet paper towels. Place the paper towels in a thick, plastic bag and tie it shut to block out the odor of the urine. Throw the bag in the garbage. [2] X Research source"
    },
    {
      "title": "Clean and disinfect the floor.",
      "content": "Clean and disinfect the floor. Spray an enzyme cleaner on the part of the floor where you wiped up the urine. Using a damp cloth, wipe down the area thoroughly. Allow to air dry. [3] X Research source Do not use bleach to clean urine off of the floor; the combination of the ammonia in the urine and the bleach will give off harmful fumes."
    },
    {
      "title": "Blot the area.",
      "content": "Blot the area. To remove dog urine from the carpet, start by adding water and a few drops of dish soap to a thick cluster of paper towels. Place over the area of the carpet that your dog urinated on. Using your foot or a gloved hand, press down the mess lightly to absorb as much as possible. [4] X Research source"
    },
    {
      "title": "Make a cleaning solution.",
      "content": "Make a cleaning solution. Mix one cup of white vinegar and one cup of water. Add a tablespoon of baking soda, stir and pour the mixture into a spray bottle. Spray a thick layer of the mixture onto the soiled area of the carpet and let it sit for 5-6 minutes. [5] X Research source You can also opt for a store-bought carpet cleaning spray, but avoid products containing chlorine, ammonia and sodium lauryl sulfate, which can be harmful to pets."
    },
    {
      "title": "Pat down the area.",
      "content": "Pat down the area. With a fresh cloth, gently blot the area to absorb the solution. Let the carpet air dry. Keep pets away from the damp carpet while it dries. [6] X Research source"
    },
    {
      "title": "Rent a carpet cleaner.",
      "content": "Rent a carpet cleaner. If the area is still stained, or if it still smells like urine after your first attempt to clean it, consider renting a carpet cleaner. Cleaners are usually available at local hardware stores or grocery stores for rental periods of 24 hours or more. Opt for a hot water extraction cleaner, the rates for which start at $20 a day for less expensive models. [7] X Research source Be sure to follow directions carefully when using a rented carpet cleaner."
    },
    {
      "title": "Rinse thoroughly.",
      "content": "Rinse thoroughly. Before washing, rinse the soiled items under cold water. Keep rinsing until you have flushed out as much of the urine as possible. Wring out excess water. [8] X Research source"
    },
    {
      "title": "Presoak the items.",
      "content": "Presoak the items. Pretreat urine stains with a liquid detergent that contains enzymes; look for enzymes commonly used in cleaning products (proteases, amylases, lipases, cellulases and mannanases) in the ingredients list on the product label. [9] X Research source Fill a sink or bathtub with cold water and soak the soiled bedding or clothing for 30 minutes. Remove the items and wring them out again. [10] X Research source"
    },
    {
      "title": "Load the washing machine.",
      "content": "Load the washing machine. Place the items in the washing machine. Set a hot water wash cycle. Add detergent; if you are washing your dog's bedding, use a mild detergent that will not cause irritation to its skin. [11] X Research source"
    },
    {
      "title": "Add vinegar to the wash.",
      "content": "Add vinegar to the wash. Add 1/2 cup of white vinegar to the softener dispenser of the machine. Start the wash cycle. If there is no softener dispenser in your machine, run it as usual and add the vinegar at the beginning of the final rinse cycle. [12] X Research source If the urine smell is too strong for these quantities, add a full cup of vinegar to the final rinse cycle."
    },
    {
      "title": "Dry the items.",
      "content": "Dry the items. Run items through the dryer. Alternatively (and if possible) hang the items on a clothesline to dry. The outdoor air will help neutralize the odor of urine and freshen the fabric. Avoid using dryer sheets, which may irritate your dog's skin."
    }
  ]
}