{
  "url": "https://www.wikihow.com/Bleed-a-Slave-Cylinder",
  "title": "How to Bleed a Slave Cylinder",
  "steps": [
    {
      "title": "Jack up the vehicle.",
      "content": "Jack up the vehicle. In order to gain access to the slave cylinder in your vehicle, you will likely need to jack it up off the ground . Slide the jack beneath one of the vehicles front jack points and either raise and lower or turn the handle (depending on the style of jack) to lift it off of the ground high enough to work beneath. [1] X Research source Always place jack stands beneath a vehicle you work on. You can find the designated jack points for your vehicle in the owner’s manual."
    },
    {
      "title": "Put on the appropriate protective equipment.",
      "content": "Put on the appropriate protective equipment. Brake fluid can be an irritant for your eyes and skin. Before you start working with it, put on gloves and safety glasses to help protect you from any brake fluid that may leak or drip onto you while you work. [2] X Research source Because you will be working under the vehicle, you may want to use goggle style eye protection instead of traditional safety glasses. Neoprene or latex gloves will prevent your hands from getting covered in brake fluid."
    },
    {
      "title": "Insert a clear hose into a soda bottle.",
      "content": "Insert a clear hose into a soda bottle. Cut a to eight to ten-inch length of clear hose with a 1/8 inch inside diameter. Insert one end into an empty soda bottle. This will serve as your brake fluid catch can once you begin the bleeding process. [3] X Research source The hose will direct the path of the brake fluid you drain from the system. The bottle will catch the brake fluid as it drains."
    },
    {
      "title": "Purchase the correct brake fluid.",
      "content": "Purchase the correct brake fluid. It is integral that you refill the brake master cylinder with the correct type of brake fluid as you flush the old fluid out of the slave cylinder. You can find what kind of fluid to purchase in your vehicle’s owner’s manual or sometimes it’s written on the top of the master cylinder reservoir in your engine bay. [4] X Research source You can ask the clerk at your local auto parts store to look up the correct type of brake fluid for your application. Using the wrong kind of brake fluid could damage the system or cause it to fail."
    },
    {
      "title": "Check the fluid level in the master cylinder.",
      "content": "Check the fluid level in the master cylinder. Open the cap to the brake fluid reservoir on the master cylinder and check the level of the fluid inside. The fluid should reach the full line on the reservoir. If it doesn’t, add fluid to it to ensure there is enough to keep the system from sucking air in as you bleed it. [5] X Research source It’s okay if you overfill the reservoir, as you will be draining a good amount of fluid from the system in the bleeding process."
    },
    {
      "title": "Locate the bleed screw on the slave cylinder.",
      "content": "Locate the bleed screw on the slave cylinder. The slave cylinder in your vehicle should be located in close proximity to the transmission, though its exact mounting location will vary from application to application. You will find the bleed screw on the bottom or the underside of the slave cylinder. It looks like a bolt with a nozzle sticking out of it. If you have difficulty locating the slave cylinder or bleed screw, refer to the service manual for your vehicle."
    },
    {
      "title": "Attach the hose to the bleed screw.",
      "content": "Attach the hose to the bleed screw. Press a clear hose onto the slave cylinder bleed screw and place the other end in an empty soda bottle. This will control the direction the released brake fluid will travel in as you bleed the system and provide a container to catch it in. Ensure the hose is securely pressed onto the nozzle. Set the soda bottle down on a flat surface like the ground or a box to ensure it doesn’t tip over."
    },
    {
      "title": "Open the bleed screw on the slave cylinder.",
      "content": "Open the bleed screw on the slave cylinder. Use an open ended wrench to turn the bleed screw counter clockwise with the hose attached to it. This will open the system and allow fluid to be pressed through into the hose. [6] X Research source Be sure to leave the hose attached to the nozzle at all times to avoid spilling brake fluid. Leave the screw open for now."
    },
    {
      "title": "Have a friend press the clutch pedal in and hold it.",
      "content": "Have a friend press the clutch pedal in and hold it. With the bleed screw open and the hose in place, have a friend press the clutch pedal down to the floor and hold it there. It is extremely important that your friend not let the pedal release until you close the bleed screw, so be sure you tell them so. [7] X Research source As your friend presses the pedal downward, brake fluid will be drained into the bottle through the hose on the bleed screw. Make sure you are positioned so you can see the fluid draining through the hose."
    },
    {
      "title": "Close the bleed screw.",
      "content": "Close the bleed screw. With your friend pressing the clutch pedal to the floor, use the open ended wrench to turn the bleed screw clockwise to tighten it again. This will once again seal the hydraulic clutch system, preventing air from getting sucked back into the system through the bleed screw. [8] X Research source If your friend releases the pedal before you close the bleed screw, air will be sucked into the system, making the bleeding process significantly longer. Don’t overtighten the bleed screw, as you will need to open and close it repeatedly."
    },
    {
      "title": "Have your friend release the clutch pedal.",
      "content": "Have your friend release the clutch pedal. With the bleed screw closed, have your friend release the clutch pedal. Once the pedal is all the way back to the top of its clutch throw, you can begin the bleeding process once again to remove the remainder of the air bubbles in the system. Be sure the pedal has been released completely before you open the bleed valve again."
    },
    {
      "title": "Add more brake fluid between each round of bleeding.",
      "content": "Add more brake fluid between each round of bleeding. One round of bleeding the slave cylinder is complete when your friend lifts their foot off of the clutch pedal. With the bleed valve closed and your friend’s foot off of the pedal, open the brake fluid reservoir on the master cylinder and add brake fluid to it to ensure it doesn’t run dry as you go. [9] X Research source Bleeding the slave cylinder with an empty reservoir will suck air into the system again. Check the reservoir regularly to ensure it does not run out of fluid."
    },
    {
      "title": "Look for air bubbles in the hose as it drains.",
      "content": "Look for air bubbles in the hose as it drains. As your friend presses on the clutch pedal, look at the clear hose so you can see any debris or air bubbles that drain with the fluid. Air bubbles may look like bubbles, or they may look like gaps in the fluid as it passes through the hose. When there are no air bubbles for a few round of bleeding, you are finished. [10] X Research source Air bubbles in the system can lead to your clutch system only delivering intermittent pressure. Intermittent pressure in the clutch system can cause the clutch to fail to disengage."
    },
    {
      "title": "Repeat the process as needed.",
      "content": "Repeat the process as needed. Do as many rounds of bleeding the clutch as necessary for the bubbles to stop coming out of the hose. If bubbles continue to appear no matter how much you bleed the system, there may be a leak somewhere in the lines or at the master cylinder. [11] X Research source Once the bubbles stop coming you can seal the bleed screw and place the cap back on the reservoir. If there is a leak somewhere in the system, you will need to seek a professional to identify and repair it."
    }
  ]
}