{
  "url": "https://www.wikihow.com/Confront-a-Bully",
  "title": "How to Confront a Bully",
  "steps": [
    {
      "title": "Confront the bully in public.",
      "content": "Confront the bully in public. You never know for sure what a bully might do, so confronting the bully in a place with many witnesses can make the confrontation safer. It also means there will be many witnesses if the bully tries anything physically violent. You can confront the bully it in the hall at school, in the cafeteria, etc. Choosing a place where there will be adults is also preferable because they can help keep the situation from escalating."
    },
    {
      "title": "Stand up and be confident.",
      "content": "Stand up and be confident . Bullies thrive on your insecurity and will often pick on people who they think are easy targets. By physically standing up to them, you are sending the message that you aren’t afraid. Sometimes simply standing up to a bully will make them back off. [1] X Research source Tell the bully in a confident and certain tone to stop. Don’t get emotional. Simply tell them, in a matter of fact way, to stop."
    },
    {
      "title": "Bring a friend with you when you confront the bully.",
      "content": "Bring a friend with you when you confront the bully. Having a friend for moral support can make a big difference when confronting a bully. Having a friend with you can also isolate the bully and make it more difficult for he or she to continue their abuse. Therefore, having a friend with you makes you a more difficult target for bullying. Also, be there for your friends when they need to confront a bully. [2] X Research source Your friend does not need to say anything or even actively participate. Their presence alone can make the difference."
    },
    {
      "title": "Show the bully that you don’t care.",
      "content": "Show the bully that you don’t care. A bully wants you to be upset. Do your best to show the bully that you do not care what they say. It can be very difficult to stay cool when you are being bullied, but it can make a big difference. Keep a neutral face. Don’t show your anger, even if you feel it. No matter how mean the bully is, respond with phrases like “that’s interesting” and “ok, thanks.” This will help to disarm the bully."
    },
    {
      "title": "Tell a teacher or other trusted adult.",
      "content": "Tell a teacher or other trusted adult. Do not be afraid to go to an adult when bullying becomes a problem. Sometimes you will be unable to deal with the problem by yourself. In these cases, get help. You may feel pressure not to get an adult involved, but when bullying becomes serious, it is the right thing to do. You will not get into trouble for reporting, you can ask the teacher or trusted adult to not give away your name to the Bully so they will not know who reported them."
    },
    {
      "title": "If the confrontation escalates to physical violence, walk away.",
      "content": "If the confrontation escalates to physical violence, walk away. Staying and fighting will only make things worse and can get you in trouble too. Always report physical violence to a teacher, principal or other trusted adult in the school."
    },
    {
      "title": "Interrupt the bullying when it happens.",
      "content": "Interrupt the bullying when it happens. Do not wait until later. Whether you see someone else being bullied, or someone is behaving in a way you do not appreciate, act in the moment. Be specific. Deal with one problem at a time. Explain why the behavior is unacceptable and how it should change. [3] X Research source Studies have shown that taking action immediately has a slightly better chance of stopping the behavior, then waiting until later."
    },
    {
      "title": "Confront the bully in private, if possible.",
      "content": "Confront the bully in private, if possible. If you have a problem with how someone is acting, meet with them in private and explain the situation. This will prevent either of you from having to be embarrassed in front of other co-workers. Address the bully personally, in a friendly tone. [4] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Remember that you are speaking with a colleague or co-worker, even if they haven't treated you with the same respect."
    },
    {
      "title": "Tell the bully that stopping their behavior is in their own best interest.",
      "content": "Tell the bully that stopping their behavior is in their own best interest. Bullies might not care about other people, but they will care about themselves. In a corporate or office environment, this will be particularly true. Their personal advancement can be at stake. [5] X Expert Source Nancy Lin, PhD Licensed Clinical Psychologist Expert Interview. 27 May 2021. Tell the bully that their behavior is embarrassing themselves in front of their co-workers and preventing the office from achieving the expected results. [6] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Document every instance of bullying.",
      "content": "Document every instance of bullying. If the situation escalates, you want to have records of everything that has happened. Make sure that you keep your emotions in check too. The bully has the same ability to document. If you are respond emotionally or aggressively, it can hurt your ability to make a case to your superiors."
    },
    {
      "title": "Go to the people who can help.",
      "content": "Go to the people who can help. There will usually be someone you can go to in your organization that can help in cases of bullying and other kinds of harassment in the workplace. Go through the proper channels and report each instance. [7] X Research source If you go to a superior or to HR, make sure you bring your documentation with you."
    },
    {
      "title": "Go to law enforcement if the situation ever escalates to physical violence.",
      "content": "Go to law enforcement if the situation ever escalates to physical violence. Be sure to appraise the relevant division within your company whenever any unwanted physical contact occurs in the workplace. [8] X Research source"
    }
  ]
}