{
  "url": "https://www.wikihow.com/Build-a-Model-Airport",
  "title": "How to Build a Model Airport",
  "steps": [
    {
      "title": "Choose the scale you want for your airport.",
      "content": "Choose the scale you want for your airport. Decide where you will keep your model when it’s finished and the space you have available. Compare the sizes for common model-building scales to find one that will fit the dimensions for the space you have. Look for modeling scales on hobbyist and model railroad enthusiast websites. The most common scales for model airplane hobbyists are 1/48 (1¾” or 31.8 mm) and 1/72 (1” or 25mm)."
    },
    {
      "title": "Seek inspiration from real-world airports.",
      "content": "Seek inspiration from real-world airports. Study books that show plans and photos of airports around the world. Visit other models at airports and transportation museums. Check out Knuffingen Airport, which is a model based on Hamburg Airport. Some of its features include 15,000 figurines, 500 cars, 50 trains, 300 buildings and 40 planes. [1] X Research source Look at layouts for airports in the UK through NATS and in the US through Federal Aviation Administration ( https://www.faa.gov/airports/runway_safety/diagrams/ )."
    },
    {
      "title": "Sketch a design for your airport.",
      "content": "Sketch a design for your airport. Plan where things like an air traffic control tower, terminal buildings, planes, shuttle buses, and people will go. Include parking lots, aprons, taxiways, and runways. Consider including an airplane fueling facility and hangars for airplane service, maintenance, and storage. [2] X Trustworthy Source NASA Independent agency of the U.S. government in charge of the aerospace research and the space program Go to source"
    },
    {
      "title": "Build a base.",
      "content": "Build a base. Choose cardboard, wood, or plastic for the base of your model. Cut it to size according to your scale and the design you’ve sketched for the airport. Make sure you have room for all of the structures, runways, parking, walkways, and taxiways."
    },
    {
      "title": "Lightly pencil in your design on the base.",
      "content": "Lightly pencil in your design on the base. Use a ruler to make sure you can fit everything on the base according to your scale. Eliminate structures, runways, or other items if you don’t have enough space on the base you’ve chosen. Alternatively, cut a larger base to accommodate everything that you’ve planned to build. After you’ve sketched your design on the base, place it on a table so you can start adding your structures."
    },
    {
      "title": "Build your terminal buildings, hangars, and parking garages.",
      "content": "Build your terminal buildings, hangars, and parking garages. Use modeling kits in the scale you’ve chosen for your airport. You can also build these from scratch using stiff cardboard or balsa wood. Make at least one terminal and one hangar if you are creating a model from scratch. If you’re basing your model on a real-world airport, aim to make the same number of buildings that can be found at that airport. Build simple, large gray buildings with double doors large enough to accommodate an airplane for your hangars. Terminals can be simple, long structures with jetways on the side of the terminal facing the runways. Make two levels on the side facing the parking lot, with multiple doors for passengers. Parking garages can match real-world parking garages with multiple levels of parking lots stacked in a building. Position the terminals on your base according to where you have them in your design."
    },
    {
      "title": "Paint large, rectangular aprons around the terminal buildings.",
      "content": "Paint large, rectangular aprons around the terminal buildings. The aprons should be long rectangles adjacent to the jetway side of the terminal buildings. Make them wide enough to accommodate the planes you plan to park at the terminals. Paint at least one apron for each terminal. Use black or dark gray paint for the aprons. You can also cut out rectangles from poster board and glue these down to use as the aprons. [3] X Research source Aprons are the same as ramps."
    },
    {
      "title": "Paint on taxiways leading from the aprons to the runways.",
      "content": "Paint on taxiways leading from the aprons to the runways. Make the taxiways look like wide roads leading from the apron to the runway. Use black paint for the basic taxiways. Add a solid yellow centerline. Paint on yellow arrows or chevrons that point to the runways. Create one taxiway for each apron."
    },
    {
      "title": "Paint the runways on the base in black paint.",
      "content": "Paint the runways on the base in black paint. Design the runway to look like a wide road with a solid white line down the middle. Runways lead from the taxiways to the point where the plane lands or departs. Mark the landing areas with eight white bars. Add white chevrons to indicate the direction of the runways. Planes take off near the chevrons. [4] X Research source Make at least one runway if you’re designing your own airport. If you’re basing your model on a real-world airport, make the same number of runways found at that airport. Number the runways using the block, geometric font used for runway designators. You can see examples of this font at https://www.tc.gc.ca/eng/civilaviation/regserv/cars/part3-standards-325-325-160.htm ."
    },
    {
      "title": "Build",
      "content": "Build some model airplanes. Get some model airplane kits in the scale you chose for your model airport. Assemble the airplanes. Smooth them with sandpaper if needed. Next, paint them to match the types of airlines you’ve chosen for your airport. Add decals for authenticity. Put the airplanes on the aprons, taxiways, and runways."
    },
    {
      "title": "Put down some patches of grass with ground foam.",
      "content": "Put down some patches of grass with ground foam. Buy some ground foam at a hobby store. Paint the foam green and let it dry. Spread some white glue on your base where you want the grass. Crumble up some ground foam and spread the crumbles over the glue. Put down the foam first, then spray it lightly with some white glue if you don’t want to crumble the foam. If you will crumble the foam, also paint the board under the grassy sections green before adding the foam to make the grass more vibrant."
    },
    {
      "title": "Add bushes with lichen.",
      "content": "Add bushes with lichen. Get some lichen from real trees or buy it at a hobby store. Glue some clumps of lichen around the grassy areas as bushes. Break some toothpicks in half to use as bases for bushes. Slide some lichen onto the toothpicks and glue the bottom of the toothpick to your base. [5] X Research source Cover the tops of small twigs covered in lichen and glue the twigs to the base for trees. [6] X Research source"
    },
    {
      "title": "Make signs with toothpicks and paper.",
      "content": "Make signs with toothpicks and paper. Decide the types of signs you’d like to have. Cut out small pieces of white paper in the shape of the signs you want. Color in the paper with markers, colored pencils, or paint. Use a permanent marker to write the text of the signs. Glue the paper to toothpicks and glue the bottom of the toothpicks to the base where you want the signs. Make stop signs, parking signs, and signs indicating the location of aprons and jetways on the runways. Add names or other designators to your buildings. Write them freehand or use a stencil with paint or permanent marker."
    },
    {
      "title": "Include people and other finishing touches.",
      "content": "Include people and other finishing touches. Buy figurines from craft stores, model stores, or stores that sell miniatures. Try to get them in the scale you chose for your airport. Look for figurines dressed as pilots and flight attendants, people in coveralls for working on the aprons and around the hangars. Don’t forget families and other figurines to be the passengers and public. Glue the figurines around the airport in appropriate places. Find miniature cars, tankers, fire engines, shuttle buses, and other vehicles that belong at the airport. Get these in your scale and place them around the airport."
    }
  ]
}