{
  "url": "https://www.wikihow.com/Cook-Peppers",
  "title": "How to Cook Peppers",
  "steps": [
    {
      "title": "Preheat the oven or broiler.",
      "content": "Preheat the oven or broiler. You can bake or broil any variety of pepper, but usually, large bell peppers should be roasted in an oven preheated to 425 degrees Fahrenheit (218 degrees Celsius) while smaller peppers should be roasted in a broiler that has been preheated for 5 to 10 minutes. [1] X Research source Either way, prepare a baking sheet by lining it with aluminum foil. If you are using a broiler with separate “high” and “low” settings, preheat it to “high.”"
    },
    {
      "title": "Cut the peppers or leave them whole.",
      "content": "Cut the peppers or leave them whole. Small peppers should be left whole. Large peppers, like bell peppers, can be cut in halves or quarters to speed up the cooking process. Place cut peppers on the prepared baking sheet cut-side-down."
    },
    {
      "title": "Coat the peppers with cooking spray.",
      "content": "Coat the peppers with cooking spray. Spray cooking spray over the surface of each pepper or brush a little olive oil on the skins. [2] X Research source Cooking spray or oil helps with making sure that the peppers don't stick to the foil or the pan when you're ready to remove them."
    },
    {
      "title": "Cook the peppers until roasted.",
      "content": "Cook the peppers until roasted. The exact amount of time will vary based on size and cooking method, but usually, bell peppers should be roasted in your preheated oven for 20 to 25 minutes while smaller hot peppers should be broiled for 5 to 10 minutes per side. Turn the peppers periodically so that the skins become evenly charred on all sides. When ready, the skins should be dark and bubbly."
    },
    {
      "title": "Serve warm.",
      "content": "Serve warm. Wrap the peppers in aluminum foil for 10 to 15 minutes, or until they become cool enough to handle with your bare hands. At that point, unwrap them and use or enjoy as desired. Before serving, peel the skins off the peppers using your fingers. If you allowed them the steam inside of foil while they cooled, the skins should slip off with relative ease."
    },
    {
      "title": "Heat a little oil in a skillet.",
      "content": "Heat a little oil in a skillet. Pour 1 to 2 Tbsp (15 to 30 ml) of cooking into a large skillet. Heat it over medium-high for a couple of minutes."
    },
    {
      "title": "Cut the peppers into smaller pieces.",
      "content": "Cut the peppers into smaller pieces. Peppers should be cut into rings, strips, or small bite-sized pieces before you stir-fry them. Generally, hot peppers are cut into rings, while sweet bell peppers are cut into strips or bite-sized pieces. Keep in mind that the size will determine how long the pieces will need to cook for. Strips, large bell pepper rings, and pieces that are over 1 inch (2.5 cm) in size may need a minute or two more than small pepper rings and small chunks under 1 inch (2.5 cm)."
    },
    {
      "title": "Cook the peppers in the hot oil.",
      "content": "Cook the peppers in the hot oil. Add the peppers to the hot oil and cook, stirring frequently, for about 4 to 7 minutes, or until the peppers are crisp-tender. [3] X Research source Frequent stirring is very important in this method. You do not want to burn the pepper skins or the pepper flesh, but if you let the pieces stay still for too long, the sections touching the pan are more likely to become charred."
    },
    {
      "title": "Use as desired.",
      "content": "Use as desired. Stir-fried peppers are usually prepared with other ingredients, but you can enjoy them on their own or use them in any recipe calling for some variety of cooked pepper. For a quick side dish or a light lunch, you could toss the peppers with cooked rice and a drizzle of your favorite dressing—soy sauce, Italian dressing, and so on."
    },
    {
      "title": "Preheat the grill.",
      "content": "Preheat the grill. The grill should be set to medium heat, whether that grill is a charcoal type or a gas type. [4] X Research source Spread a moderate amount of coals into a charcoal grill, light, and wait until the fire dies down and white ash forms on the coals. The peppers will be placed directly over the heat. For a gas grill, preheat the grill completely before reducing the heat to medium. Again, the peppers will be placed directly over the heat."
    },
    {
      "title": "Brush the peppers with oil.",
      "content": "Brush the peppers with oil. Coat all sides of each pepper with olive oil or cooking spray. Again, this helps to keep the peppers from becoming stuck. Olive oil also imparts a nice flavor. Note that peppers should be grilled whole instead of cut."
    },
    {
      "title": "Grill the peppers, charring on all sides.",
      "content": "Grill the peppers, charring on all sides. Place the prepared peppers on the grill, turning them as they cook so that all sides get evenly charred. Large peppers, like bell peppers, will need about 25 to 30 minutes total. [5] X Research source Smaller peppers usually need about 8 to 12 minutes. Leave the grill uncovered if you have a charcoal grill. Cover the grill if you have a gas grill, though."
    },
    {
      "title": "Let stand before serving.",
      "content": "Let stand before serving. Remove the peppers from the grill and wrap them in aluminum foil. Let them slowly drop in temperature for about 15 minutes, until they are just barely cool enough to handle with your hands. If you steamed the peppers by wrapping them in aluminum foil as they cooled, you should be able to peel off the charred skins with your fingers, making it easier to serve the fire-roasted flesh beneath."
    },
    {
      "title": "Boil a small amount of water.",
      "content": "Boil a small amount of water. Pour 1 to 2 inches (2.5 to 5 cm) of water into a large skillet with high sides. Heat this over medium-high on the stove. After the water begins to boil, add about 1 Tbsp (15 ml) of salt. The salt helps to draw out the flavor of the pepper, but adding the salt before the water boils will increase the amount of time you have to wait before the water reaches a steady boil."
    },
    {
      "title": "Cut the peppers into rings or strips.",
      "content": "Cut the peppers into rings or strips. If working with small hot peppers, cut them into rings. For larger bell peppers, cut them into rings or strips. Keep in mind that larger pieces will take longer to cook than smaller pieces. No matter what size you use, you should at least try to keep the pieces consistent in size."
    },
    {
      "title": "Cook the peppers in the boiling water.",
      "content": "Cook the peppers in the boiling water. Place the peppers in the boiling water and cook, stirring frequently, for 5 to 7 minutes, or until they feel crisp-tender. The peppers will ideally still have a little “crunch” to them, but the flesh should be notably softer than when the peppers were raw."
    },
    {
      "title": "Serve while warm.",
      "content": "Serve while warm. You can enjoy the peppers on their own or you could add them to any recipe calling for pre-cooked peppers."
    },
    {
      "title": "Boil water in a steamer.",
      "content": "Boil water in a steamer. Fill the bottom of a steamer with about 1 inch (2.5 cm) of water. Sit the steaming basket on top, making sure that the bottom does not come into contact with the water, and boil the water over high heat. If you do not have a steamer, you could use a large stockpot and a metal/wire mesh colander. Just make sure that the colander fits onto the rim of the pot but that the bottom of the colander does not touch the bottom of the pot. Also make sure that the lid of the stockpot will still fit on the stockpot with the colander inside."
    },
    {
      "title": "Cut the peppers into smaller pieces.",
      "content": "Cut the peppers into smaller pieces. Cut small peppers into rings and large peppers into rings or strips. Keep the pieces consistent in size and shape to ensure even cooking."
    },
    {
      "title": "Steam the peppers until crisp-tender.",
      "content": "Steam the peppers until crisp-tender. Add the peppers to the steamer basket. Cover and cook for 10 to 15 minutes. [6] X Research source The cover must stay on the pot during the cooking process so that the steam will remain trapped inside. If you lift the lid off too often, you will release too much steam, thereby increasing the amount of time the peppers will need to cook for."
    },
    {
      "title": "Serve warm.",
      "content": "Serve warm. Remove the peppers from the steamer and enjoy them on their own or in any recipe calling for pre-cooked peppers."
    },
    {
      "title": "Cut the peppers into smaller pieces.",
      "content": "Cut the peppers into smaller pieces. Cut the peppers into rings, slices, or bite-sized pieces. Small hot peppers are usually cut into rings, but larger sweet peppers can be cut into any of those three forms. Make sure that the pieces are even in size. Otherwise, if some pieces are larger than others, they may take longer to cook while other pieces will already be done or overcooked."
    },
    {
      "title": "Place the pieces in a microwave-safe dish with a little water.",
      "content": "Place the pieces in a microwave-safe dish with a little water. Transfer the pieces into a microwave-safe casserole dish and add 2 Tbsp (30 ml) of water, just enough to cover the bottom without completely covering the peppers."
    },
    {
      "title": "Microwave until crisp-tender.",
      "content": "Microwave until crisp-tender. Cover the dish and microwave on high power for 90 seconds to 2 minutes per 1 cup (250 ml) of peppers. Stir once in the middle of the process. [7] X Research source Most of the cooking action taking place results from the steam building up inside of the dish, so keeping the lid on is important in order to keep that steam trapped."
    },
    {
      "title": "Serve warm.",
      "content": "Serve warm. Drain out any remaining water and enjoy the peppers alone or serve them with another dish."
    }
  ]
}