{
  "url": "https://www.wikihow.com/Be-Who-You-Want-to-Be",
  "title": "How to Be Who You Want to Be",
  "steps": [
    {
      "title": "Write down what makes you unique.",
      "content": "Write down what makes you unique. Before you can understand who you want to be, it is key to know what makes you stand out. Learning what makes you different is a process called differentiation, and it is an essential part of self-discovery. Everybody has special gifts and talents that make them unique from people around them. By listing positive qualities that are a core part of who you are, you separate yourself from the potentially toxic influence and pressure of those around you. [1] X Research source"
    },
    {
      "title": "Identify what makes you happy.",
      "content": "Identify what makes you happy. Try to think of all of the things that make you smile. Perhaps you feel fulfilled when you are playing music, or maybe you enjoy being out in nature. Make a list of everything you enjoy in life. Next ask yourself why these make you happy. Do they relax you during hectic times? Do they provide excitement in an otherwise dull life? By uncovering why they make you happy, you may also learn what makes you unhappy. [2] X Expert Source Camber Hill Life Coach Expert Interview. 16 June 2020. Once you discover what makes you happy, try spending more time on those activities and practices."
    },
    {
      "title": "Discover what is holding you back.",
      "content": "Discover what is holding you back. Fears, anxieties, insecurities, and self-criticism can prevent you from changing yourself for the better. Such self-destructive thoughts stop you before you can even begin your reinvention. Every time you feel a burst of fear or self-doubt, stop yourself and ask “why do I feel this way?” Once you know why you are nervous, you can take steps to overcome those insecurities and obstacles. [3] X Expert Source Camber Hill Life Coach Expert Interview. 16 June 2020. Talking through your fears with your friends or a therapist can also help you identify the causes of your self-doubt. Try writing in a journal when you feel anxious. Whenever you are feeling bad about yourself, write it down. Not only will it make you feel better but you can reflect on your entries later to figure out the source of your insecurities."
    },
    {
      "title": "Find out which needs are not being met.",
      "content": "Find out which needs are not being met. Everyone has needs and desires. If you have certain psychological or spiritual demands that are not being fulfilled, you may feel something lacking in your life. Create a hierarchy of your needs, and record what is and is not being satisfied. [4] X Research source Are your basic needs (food, water, shelter) being met? Do feel safe in your current relationships or in your physical location? Do you feel loved by those around you? Do you feel as though what you do matters? Are you fulfilled by your job/social life/school? Do you have a creative outlet?"
    },
    {
      "title": "Write down your goals.",
      "content": "Write down your goals. Before you can become who you want to be, you have to realize who this new person is. Record all of your aspirations and goals. Make these dreams as specific as possible. Afterwards, go back through the list. Each goal should be realistic, and positive while focusing on yourself. [5] X Expert Source Camber Hill Life Coach Expert Interview. 16 June 2020. Realistic means that the dream is reasonable and can be achieved. If you’ve never played golf before, it might not be realistic that you will become a famous golfer, but it may be realistic that you can learn how to play. Positive means that the goals are good things that will happen to you. Erase any negativity from your dream list. Affirmation will put you further than doubt and uncertainty will. The goal should be about yourself, not other people. Instead of saying, “I want my boss to like me more,” try framing it as “I want to become more assertive and responsible in the workplace.\" Reader Poll: We asked 435 wikiHow readers who've set self-improvement goals, and 55% of them agreed that the best area to focus on is mental and physical health. [Take Poll]"
    },
    {
      "title": "Create a vision board.",
      "content": "Create a vision board. Visualizing your dreams on a daily basis can help motivate you. A vision board is a collage of all your aspirations and dreams. Find pictures that represent what you want out of life. These could be images of material objects such as a nice house, pictures related to your ideal career, or photos of a happy social life. You create the board by gluing these pictures onto a poster or cardboard. Hang the board somewhere where you will see it every day, such as on your bedroom wall or in your kitchen. Seeing the board will remind you of your dreams and give you affirmation that you can achieve them. [6] X Research source"
    },
    {
      "title": "Set a schedule.",
      "content": "Set a schedule. It will be more manageable for you to become a new person if you set a schedule for yourself. Where do you want to be in a week? How about two weeks? A month? A year? Write down your schedule in a book or calendar. Set specific benchmarks with tasks that you are able to achieve. As you complete tasks off your schedule, check them off. You will see yourself coming closer to your goals every day. [7] X Research source Your tasks on your schedule should be specific and easy to achieve. Instead of writing, “Become less shy by Tuesday,” write “talk to three strangers today” or “rehearse small talk for five minutes in front of the mirror.”"
    },
    {
      "title": "Give yourself room for failure.",
      "content": "Give yourself room for failure. You may face setbacks on your road to reinvention. If you fail, don’t stop and give up. Realize that failure is an opportunity to learn and grow. Furthermore, if you throw yourself into this new persona, you may experience burnout. This can cause you to revert back to bad habits. If you can, plan for failure, and when it occurs, look back on your list of goals to remind yourself why you’re doing this. [8] X Research source"
    },
    {
      "title": "Break bad habits",
      "content": "Break bad habits . Breaking bad habits is a process that involves looking closely at your behavior and trying to determine what triggers your bad habit. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source However, you can break bad habits by identifying the things that trigger your habit, learning how to break the cycle, and rewarding yourself when it works. You can also develop a plan to help you deal with your triggers. [10] X Research source > Choose a good time to try to break a habit. It might be easier to try to break a bad habit while you are on vacation. [11] X Research source Although it might not be possible to wait to break a habit until you go on vacation, you might at least want to choose a time when you are not too stressed to work on breaking a bad habit. Try to be patient. Keep in mind that it can take anywhere from 18 to 66 days to break a habit. Don’t become discouraged if you find it difficult to break the habit at first. Remember to reward yourself. If you’ve had a great day where you did really well in your new habits and routines, praise yourself and give yourself a reward. Maybe eat a bowl of ice cream or go see a movie. Little rewards can affirm your progress, and they teach your brain to associate these new routines with pleasure. [12] X Research source"
    },
    {
      "title": "Find a mentor.",
      "content": "Find a mentor. Perhaps you are struggling in a new career or you want to make a difference in your community. Ask an experienced person in that area to mentor you. Meet once a week or month to discuss your goals. Your mentor will share the struggles that they faced getting to the point where they are now. They can give you advice on your own hurdles and help you realize your potential. [13] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Form a support group.",
      "content": "Form a support group. As you reinvent yourself, talk to your close friends about your progress. Tell them the kind of person you want to be, and as you face success and failure, talk through your thoughts and feelings. Good friends will provide positive affirmation, and a strong support group can increase your chances of success. If your friends tell you that you don’t need to change, try not to listen to them. They may have good intentions, but if you are unhappy with your current state of being, such advice can be discouraging. Thank them for their concern, but emphasize that this is something you want to continue. True friends will remain with you through the journey."
    },
    {
      "title": "Take care of your needs first.",
      "content": "Take care of your needs first. Other people may want you to be someone who you are not. They may ask things of you that make you uncomfortable, anxious, or burdened. Realizing that not everyone will like you is liberating, as it allows you to take care of your own needs. Put your own happiness first. This does not mean you have to be selfish; rather, it is a simple awareness that by taking care of yourself, you are better positioned to take care of other people. [14] X Research source"
    },
    {
      "title": "Stop blaming other people for your problems.",
      "content": "Stop blaming other people for your problems. Being who you want to be means taking responsibility for your actions. By realizing that you can change, you also realize that you have control over your own actions. While other people may try to stop you or obstruct your dreams, you have the power to ignore them and to make your own choices."
    },
    {
      "title": "Start loving yourself as though you are that new person",
      "content": "Start loving yourself as though you are that new person . Every day, remind yourself of what makes you a great person. You can do this by praising yourself in the mirror or by writing down positive notes to yourself. Higher positivity leads to higher confidence and self-respect, and it will help you become more comfortable in your individual personality. [15] X Expert Source Camber Hill Life Coach Expert Interview. 16 June 2020."
    },
    {
      "title": "Cut out toxic relationships",
      "content": "Cut out toxic relationships . Don't be surprised if old friends and acquaintances don't support you. Some people will try to convince you that it's just not possible to change. They may even try to make you feel guilty for trying. Don’t argue with people who criticize your choices. Simply say something like, \"I was unhappy before, and I am working towards being a better person.\" You can also say, \"Thank you for your concern. No matter who I become, I will always love you.\" If you have a friend or loved one who still bothers you about the changes you are making, then you may want to take some time away from the person."
    }
  ]
}