{
  "url": "https://www.wikihow.com/Care-for-Limelight-Hydrangeas",
  "title": "How to Care for Limelight Hydrangeas",
  "steps": [
    {
      "title": "Water 'Limelight' as often as necessary to keep the soil lightly moist during the first year after planting.",
      "content": "Water 'Limelight' as often as necessary to keep the soil lightly moist during the first year after planting. In general, 1 ⁄ 3 to 2 ⁄ 3 inch (0.8 to 1.7 cm) of water two to three times each week will be plenty but this depends on the soil and weather."
    },
    {
      "title": "Keep the type of soil in mind when watering your plant.",
      "content": "Keep the type of soil in mind when watering your plant. When 'Limelight' is planted in soil that drains more slowly, it may only need to be watered twice each week. If the soil is sandy loam and drains quickly, it may need to be watered every other day when the weather gets hot."
    },
    {
      "title": "Check the soil by sticking a finger in to a depth of 2 inches (5.1 cm) or so before watering.",
      "content": "Check the soil by sticking a finger in to a depth of 2 inches (5.1 cm) or so before watering. Hydrangeas prefer not to dry out, but they don't like standing water either. If the soil is moist, wait another day or two to water. If it is dry, water immediately."
    },
    {
      "title": "Reduce the amount of watering you do as your hydrangea grows.",
      "content": "Reduce the amount of watering you do as your hydrangea grows. After the first year, water 'Limelight' once per week, giving it 3 to 6 gallons (11.4 to 22.7 L) or 1 to 2 inches (2.5 to 5.1 cm) of water each time, depending on how quickly the soil dries."
    },
    {
      "title": "Use a soaker hose to water the shrub or water it by hand using a watering can to avoid getting the leaves wet.",
      "content": "Use a soaker hose to water the shrub or water it by hand using a watering can to avoid getting the leaves wet. Keeping the leaves dry will reduce the likelihood of fungal disease."
    },
    {
      "title": "Set a 1-inch deep dish or can next to the hydrangea.",
      "content": "Set a 1-inch deep dish or can next to the hydrangea. This is to measure how much water is delivered in inches when using a soaker hose. Check the can periodically. When it is full, the hydrangea has received 1 inch (2.5 cm) of water."
    },
    {
      "title": "Spread a 2- to 3-inch depth of mulch over the soil around the shrub to help reduce moisture loss through evaporation.",
      "content": "Spread a 2- to 3-inch depth of mulch over the soil around the shrub to help reduce moisture loss through evaporation. When “Limelight” is not getting enough water, it will wilt in the afternoon. If this happens, water it immediately, check the soil more often and water the shrub when the soil begins to dry. This shrub may also wilt when the soil is kept too wet. If it wilts and the soil is damp, do not water it again until the soil begins to dry."
    },
    {
      "title": "Fertilize 'Limelight' in the spring as soon as is begins putting on new leaves.",
      "content": "Fertilize 'Limelight' in the spring as soon as is begins putting on new leaves. Use a slow-release fertilizer with a balanced ratio like 10-10-10 or 16-16-16. This type of fertilizer will give the shrub a steady supply of the nutrients it usually needs."
    },
    {
      "title": "Sprinkle the fertilizer over the soil around the hydrangea.",
      "content": "Sprinkle the fertilizer over the soil around the hydrangea. Extend the fertilizer out to 6 inches (15.2 cm) to 1 foot beyond the outer edge of the leaves. This is where most of the roots are and where the fertilizer needs to be. A common application rate is 1/4 to 1/2 cup but this varies, depending on how the fertilizer is formulated. Follow the manufacturer's recommendations carefully. Do not give 'Limelight' too much fertilizer."
    },
    {
      "title": "Alter the fertilizer if your plant is not blooming.",
      "content": "Alter the fertilizer if your plant is not blooming. If 'Limelight' does not bloom or blooms very little, give it fertilizer with a 10-30-10 ratio the following spring. The middle number represents the amount of phosphorus in the fertilizer. Phosphorus promotes better flowering. Yellowing leaves at the center of the shrub indicate it is not getting enough nutrients. If this should occur, give it ¼ to ½ cup of fast-release, 10-10-10 or 16-16-16 granular fertilizer for a quick boost in addition to the slow-release fertilizer. If 'Limelight' has plenty of lush, green leaves but does not bloom, it is getting too much nitrogen. If this should occur, use fertilizer with a 0-30-10 or similar ratio. The first number listed on the bag represents nitrogen."
    },
    {
      "title": "Prune your plant in the spring.",
      "content": "Prune your plant in the spring. 'Limelight' can be pruned in late winter or very early spring to reduce its size, improve its appearance or encourage it to produce larger flowers. It produces flowers on new stems each year so pruning it in the winter or early spring will not reduce the number of flowers it produces."
    },
    {
      "title": "Trim the stems back by no more than 10 to 20 percent in the shrub's first winter or early spring.",
      "content": "Trim the stems back by no more than 10 to 20 percent in the shrub's first winter or early spring. They do not have to be trimmed at all but can be to even up the branches and tidy up their appearance. Dead branches should be removed at the base of the branch whenever they are noticed."
    },
    {
      "title": "Prune your plant more intensely as it ages.",
      "content": "Prune your plant more intensely as it ages. After 'Limelight' has been growing for a year or two, all of the stems can be pruned back to about 6 inches (15 cm) tall to keep it from getting too big. Thin the shrub to five to ten main branches in the spring to get larger flower clusters. [2] X Trustworthy Source Missouri Botanical Garden Oldest botanical garden in the U.S. and center for botanical research and science education Go to source Select five to ten new healthy branches to keep then prune the rest of the branches back to a height of 4 to 6 inches (10.2 to 15.2 cm). This will let 'Limelight' devote more energy to fewer branches resulting in larger flowers."
    },
    {
      "title": "Always use sharp hand pruners to prune one branch at a time.",
      "content": "Always use sharp hand pruners to prune one branch at a time. Hedge shears will tear the leaves and make 'Limelight' look ragged."
    },
    {
      "title": "Check your plant for pest activity.",
      "content": "Check your plant for pest activity. 'Limelight' is occasionally attacked by slugs, snails, aphids, spider mites, spittle bugs and thrips. Check the leaves for snail and slug activity. They chew on the flowers, leaves and stems. [3] X Trustworthy Source Missouri Botanical Garden Oldest botanical garden in the U.S. and center for botanical research and science education Go to source"
    },
    {
      "title": "Combat slugs and snails.",
      "content": "Combat slugs and snails. If they become a problem, either pick them off the shrub in the morning and drop them into a bucket of soapy water to drown or sink tuna or cat food cans into the soil around the shrub and fill them with beer. Snails and slugs will crawl into the beer and drown. The edge of the can should be level with the surrounding soil. Check the cans each afternoon. Dump the dead snails and slugs into the garbage, replace the cans and fill them with fresh beer."
    },
    {
      "title": "Know what aphids, thrips, spittle bugs, and spider mites look like.",
      "content": "Know what aphids, thrips, spittle bugs, and spider mites look like. Aphids are little soft-bodied, slow-moving insects that can be almost any color. [4] X Trustworthy Source Missouri Botanical Garden Oldest botanical garden in the U.S. and center for botanical research and science education Go to source Spider mites are actually tiny spiders that can barely be seen without a magnifying glass. They spin a fine webbing between the leaves and stems. Thrips are also very tiny. They are yellow to black and leave black excrement on the undersides of the leaves which take on a dusty appearance as the thrips feed. The flowers usually develop brown streaks. Spittle bugs are 1 ⁄ 4 to 1 ⁄ 3 inch (0.6 to 0.8 cm) long and can be brown, green or yellow. They deposit a frothy white substance on shrub stems."
    },
    {
      "title": "Use water to combat these pests.",
      "content": "Use water to combat these pests. All of these insects suck plant juices from the leaves and stems of shrubs. They can usually be controlled by spraying 'Limelight' in the morning several times each week with a forceful spray from a garden hose. Be sure to spray the tops and bottoms of the leaves as well as the stems."
    },
    {
      "title": "Spray the shrub with insecticidal soap if the pests persist and are causing serious damage.",
      "content": "Spray the shrub with insecticidal soap if the pests persist and are causing serious damage. Be sure to coat the tops and bottoms of the leaves and the stems until the soap begins to drip. Insecticidal soap is available already diluted in spray bottles or in concentrate form. Insecticidal soap concentrate is commonly diluted at a rate of 5 tablespoons (73.9 ml) per gallon of water. Spray the shrub in the morning or evening. Spraying it in the afternoon when the sun is hottest or when temperatures rise above 85 °F (29 °C) can cause damage to the leaves. Hose the insecticidal soap off the shrub after an hour or two. The soap will only kill the pests that are sprayed. There is no benefit to leaving it on the shrub and it could damage the leaves."
    },
    {
      "title": "Watch out for certain diseases.",
      "content": "Watch out for certain diseases. Bud blight, leaf spots, rust and mildew will occasionally afflict 'Limelight'. Bud blight causes brown flecks on the flower petals and mature flowers to rot. When the weather has been cool and damp, brown spots and gray mold may appear on the leaves and stems. Leaf spots are caused by fungi that cause brown or black spots. [5] X Trustworthy Source Missouri Botanical Garden Oldest botanical garden in the U.S. and center for botanical research and science education Go to source Rust is also caused by a fungus that coats the leaves with an orange, powdery substance. Mildew can become a problem for 'Limelight.' Powdery mildew makes the leaves appear white and powdery while downy mildew will cause yellow spots on the leaves with gray fluffy mildew underneath."
    },
    {
      "title": "Monitor your watering habits to combat these diseases.",
      "content": "Monitor your watering habits to combat these diseases. All of these maladies are caused by fungi. To help prevent them, do not get the leaves wet when watering and water in the morning so that the leaves can dry before evening if they do get wet."
    },
    {
      "title": "Prune away diseased parts of the plant.",
      "content": "Prune away diseased parts of the plant. If 'Limelight' gets any of these diseases, prune off the diseased leaves, flowers and stems immediately and put them in the trash. Disinfect the pruners by soaking them for 5 minutes in household disinfectant then rinse them off before using them to prune other shrubs. Rake up any fallen leaves and debris from around the base of the shrub and dispose of that, too. Fungal spores live in the debris and will be splashed back onto the shrub when it rains."
    },
    {
      "title": "Fight bacteria.",
      "content": "Fight bacteria. Bacterial wilt is another disease that can infect 'Limelight' hydrangeas. Bacteria infect the shrub at the base, interrupting the flow of moisture and nutrients to the rest of the shrub. Unfortunately, there isn't much that can be done for the shrub if it becomes infected with bacterial wilt. The leaves and stems will wilt and the whole shrub may die within weeks. If this occurs, appropriate watering is all that can be done to help it. If the soil seems wet, let it dry before watering again. If it is dry, water the shrub more often."
    }
  ]
}