{
  "url": "https://www.wikihow.com/Attend-Movie-Premieres",
  "title": "How to Attend Movie Premieres",
  "steps": [
    {
      "title": "Check media outlets for contests and special events.",
      "content": "Check media outlets for contests and special events. Newspapers, radio stations, and TV channels are often given complimentary tickets by movie studios, with the understanding that the tickets will be given away to the general public. Local radio stations frequently hold contests with movie premiere tickets as the prizes. Use speed dialing or “last number dialed” to quickly redial and make more attempts to win, whether you're trying to answer a trivia question or just be the 100th caller. [2] X Research source TV channels, newspapers, and radio stations might also give out a “redemption code” as a movie premiere contest prize. You’ll be given instructions on how to redeem the code for a ticket, which is often done online. [3] X Research source"
    },
    {
      "title": "Look out for exclusive movie premieres from membership organizations.",
      "content": "Look out for exclusive movie premieres from membership organizations. If you belong to certain specialized organizations or charities, your membership might include perks such as tickets to advance movie screenings. Keep an eye on the organizations’ newsletters for news items about exclusive movie premieres. [4] X Research source AARP is known for offering access to movie premieres. Check your local AARP newsletter, which is available online, for all the latest discounts and deals. [5] X Research source Special interest groups such as religious organizations, charities, or nonprofits sometimes receive premiere tickets for films in their area of focus. If you belong to such a group, keep an eye on their website or newsletter for members-only movie premiere offers. [6] X Research source"
    },
    {
      "title": "Snag an invitation as a member of the media.",
      "content": "Snag an invitation as a member of the media. Whether you write movie reviews for your town paper or host a popular blog or YouTube channel that critiques films, you may receive movie premiere passes as a courtesy to encourage you to publicize a film. [7] X Research source"
    },
    {
      "title": "Sign up for a movie premiere website.",
      "content": "Sign up for a movie premiere website. These are sites dedicated to helping you find and attend movie premieres. You can usually create an account for free; a few of them offer apps you can use on the go. Some of the top sites are Gofobo.com, SeeItFirst.net, and AdvanceScreenings.com. [8] X Research source RSVP/redemption codes are given out over social media (usually, via Twitter or Facebook); they can also be found in newspapers and magazines. Sometimes, they’re awarded as prizes for radio contests. [9] X Research source Gofobo.com lets you redeem prize codes for tickets to a particular film premiere. You can search for premieres by the name of the film, or by your city or ZIP code. [10] X Research source"
    },
    {
      "title": "Use websites and apps to find contests.",
      "content": "Use websites and apps to find contests. Sites like AdvanceScreenings.com show you a list of local contests you can enter to win the tickets. Simply select a film you’d like to see, then choose the theater nearest you from the list of locations. For each location, you’ll see one or more opportunities to get premiere tickets, linked directly to available contests or special offers. [11] X Research source Check out ZayZay.com’s Giveaways page for chances to win movie premiere tickets, called “advance screenings” on the site. You can increase your chances to win by entering multiple times, providing details like your contact info and your preferred theater location as part of the entry process. #Follow movie studios on social media. Movie studios and PR companies alike announce premiere ticket contests and giveaways through social media channels. [12] X Research source Look for hashtags relating to movie premieres, giveaways, contests, or the names of new films you’d like to see. Let your computer do some of the work for you: You can set up email alerts for certain hashtags or keywords through free media management software, so you won’t miss an opportunity to get tickets."
    },
    {
      "title": "Join movie premiere mailing lists.",
      "content": "Join movie premiere mailing lists. Studios and PR companies use mailing lists to deliver movie premiere news right to your inbox. [13] X Research source Make sure that the email addresses of these sites are “whitelisted,” so that these emails will not be sent to your Spam folder by mistake."
    },
    {
      "title": "Sign up with a mystery shopping company.",
      "content": "Sign up with a mystery shopping company. These are market research businesses that pay people to do everyday activities such as eating out at restaurants, buying clothing at department stores, trying a new website—and going to the movies. They do this in exchange for in-depth information from the consumer's point of view. [14] X Research source One of the leaders in the industry is Certified Field Associates (part of Market Force). Another company to try is Checker Patrol."
    },
    {
      "title": "Apply to do “in-theater checks.”",
      "content": "Apply to do “in-theater checks.” This is a series of tasks that are used to discover information like how many people go to see a new film at a certain time, or which trailers are shown before the feature film runs. You can get paid about $10 - $20 per hour for this work, in addition to scoring a free movie premiere ticket for yourself (and, often, a guest). [15] X Research source There are at least a half-dozen different kinds of in-theater checks, including “sneak checks” (watching a movie premiere and documenting the number of people who attend, as well as demographics such as their age ranges) and “on-site evaluations” (reporting on the condition of the theater, how you were treated by the staff, the visibility of promotional materials for the film, and other facets of the customer experience). [16] X Research source"
    },
    {
      "title": "Take lots of detailed notes.",
      "content": "Take lots of detailed notes. In order to report your findings to the mystery shopping company, you’ll need to complete a checklist of tasks and data-gathering while at the theater. Your extensive notes will form the basis of the report you'll submit to the company. Depending on your assignment, you might need to document anything from audience demographics to the quality of the butter flavor on the popcorn."
    }
  ]
}