{
  "url": "https://www.wikihow.com/Bleed-a-Fish",
  "title": "How to Bleed a Fish",
  "steps": [
    {
      "title": "Locate the fish’s brain directly behind its eye.",
      "content": "Locate the fish’s brain directly behind its eye. Wait until 15-30 minutes after you catch the fish to bleed it so it gets exhausted and doesn’t move around as much. Lay the fish on its side on a cutting board or flat surface, and hold it in place with your nondominant hand. Feel the area directly behind the fish’s eye with your dominant hand to find a soft spot, which is where the fish’s brain is located. [1] X Research source Wear gloves if you’re worried about the fish moving around or hurting you while you locate the brain."
    },
    {
      "title": "Push a knife into the brain to stun the fish.",
      "content": "Push a knife into the brain to stun the fish. Keep the fish in place with your nondominant hand and line up the point of a sharp pocket knife with the soft spot behind its eye. Push the knife through the fish’s skin and press it down into the brain to stun it. The fish may twitch or jerk as soon as you cut into it, but it will stop moving soon after. Push the knife completely through the fish to sever the nerves and remove it once the fish stops twitching. [2] X Research source If the fish still struggles after you stab into it with the knife, try positioning the knife 1 inch (2.5 cm) from the original cut and stabbing it again. Keep your fingers away from the blade of the knife so you don't accidentally cut yourself."
    },
    {
      "title": "Cut behind the gills of the fish to bleed out the arteries.",
      "content": "Cut behind the gills of the fish to bleed out the arteries. Lift up the gills with your nondominant hand and guide your knife behind the red fleshy parts. Slice through the fish around the gills from the bottom to the top of the fish to cut the main arteries. Flip the fish over to the other side and repeat your cut on the other set of gills so the fish bleeds out. The fish will start bleeding on your cutting board, so make sure it doesn’t spill anywhere that could stain. You can also buy specialty fish cleaning stations that have raised edges so the blood won’t spill anywhere else."
    },
    {
      "title": "Dunk your fish in cold water for about 30 seconds to drain the blood.",
      "content": "Dunk your fish in cold water for about 30 seconds to drain the blood. Fill a large bucket or livewell with cold water and soak your fish in it after you make your cuts. Move the fish around underwater so the water can get into the veins and rinse out. Keep the fish in the water for at least 30 seconds to drain the blood before removing it. [3] X Research source You can also use a hose to rinse out the fish if you have one available."
    },
    {
      "title": "Cut off the fish’s head so you can access the main arteries.",
      "content": "Cut off the fish’s head so you can access the main arteries. Place the fish on its side and hold it in place with your nondominant hand near the middle of its body. Start a pocket knife directly behind the fish’s gills and cut from its belly up toward its spine. Flip the fish over and make the same cut on the other side so its head comes off. You can either save or discard the fish head once you remove it. [4] X Research source The fish head has tender meat that you can use and cook if you want. The fish will start to bleed as soon as you cut off the head, so make sure it doesn’t spill or get on anything that can stain."
    },
    {
      "title": "Gut and clean",
      "content": "Gut and clean your fish. Make a slit in the center of the fish’s belly starting from the base of the tail and cutting toward its throat. Stop 1 inch (2.5 cm) from the cut you made when you removed the fish’s head. Pull the fish apart along the slit you just made and scoop out its innards with your finger or a spoon. [5] X Expert Source Michael Reynolds Professional Fishing Instructor Expert Interview. 26 February 2021. Locate the long brown or black strip inside the fish along its spine, also known as the blood line, and scrape it out with your spoon. [6] X Research source You can throw the fish guts back in the water so other animals can feed on them or you can use them to make compost . Wear gloves while you work if you don’t want to get your hands dirty."
    },
    {
      "title": "Rinse the body of the fish out with a hose.",
      "content": "Rinse the body of the fish out with a hose. Use cold water and run it through the fish’s body to rinse off any blood that pooled inside of it. Rub the meat and flesh with your hands to force more blood out of the meat. When the water runs clear, turn off the hose so you can continue. [7] X Research source If you’re on a boat, you can either dip the fish in the water to rinse it or buy a hose with a compressor to use on your boat."
    },
    {
      "title": "Attach a pipette to the end of your hose.",
      "content": "Attach a pipette to the end of your hose. A pipette is a thinner hose that you can screw onto the end of your hose to clean your fish more thoroughly. Screw the end of the pressure control valve on the pipette onto the end of your hose and open the valve by turning it counterclockwise. Once you attach the pipette, you can use it for cleaning your fish. [8] X Research source You can buy pipettes online or from outdoors supply stores."
    },
    {
      "title": "Feed the pipette into the fish’s arteries and turn on the water.",
      "content": "Feed the pipette into the fish’s arteries and turn on the water. Locate the fish’s main artery where you removed the head just below its spine. Push the end of the pipette into the artery and turn the water on for your hose with low pressure. The water will go through the fish’s veins and arteries and force more of the blood out. As the water flows through the fish, rub on the meat to help push out the blood. [9] X Research source Make sure you don’t use too high of water pressure or else you could damage the meat and ruin the fillets."
    },
    {
      "title": "Turn off the water once it runs clear and store the fish on ice.",
      "content": "Turn off the water once it runs clear and store the fish on ice. As the water pumps through the fish’s veins, it will have a reddish tint due to the residual blood. Keep pumping the water through the fish until you see it come out of the fish clean. Pull the pipette out from the artery and then place your fish in a container filled with clean ice so it stays cold and fresh until you eat it. [10] X Research source"
    }
  ]
}