{
  "url": "https://www.wikihow.com/Add-Large-Numbers",
  "title": "How to Add Large Numbers",
  "steps": [
    {
      "title": "Write any two or more multi-digit numbers in a vertical column.",
      "content": "Write any two or more multi-digit numbers in a vertical column. This method is sometimes called \"the traditional method.\" It involves adding the numbers in units of single digits, then by units of tens, then by units of hundreds. This is accomplished by working from right to left. Start by adding the figures 383 + 412 + 122. [1] X Research source Draw a line below the numbers. This line is equivalent to the equal sign in linear math. You will write your final sum below this line, starting on the right and moving to the left. Careful placement of each number is essential in this method. Make sure you are careful to place each number directly below the one above it. That is, 3, 1, and 2 should each be in a column of their own - these are the single digits. 8, 2, and 2 should be in a column - these are the units of tens. 3, 4, and 1 should be in a column - these are the hundreds. You may wish to use graph paper to help you keep your lines straight. Beginning learners may even draw templates of horizontal rows and vertical columns to practice lining their numbers up correctly."
    },
    {
      "title": "Start on the column farthest to the right.",
      "content": "Start on the column farthest to the right. Add these numbers, and write the sum directly below this column, below the line. In the example above, adding 3 + 2 + 2 = 7. Write the 7 below the line. [2] X Research source You can also choose to add these numbers individually: 3 + 2 = 5. 5 + 2 = 7. Add the number from the next column to the left. In our example, this would be 8 + 1 + 2. Continue working in this way from right to left until all numbers are added. It is the same sequence no matter how many columns of numbers you have. You can have as few as two columns, and as many as your page will hold. It is also the same sequence no matter how many numbers are in your columns. Use this sequence to add any two or more large numbers."
    },
    {
      "title": "Carry the extra digit.",
      "content": "Carry the extra digit. If the sum is more than one digit, you will need to \"carry\" the extra digit. This means that you will need to add an additional number into the next column to the left. [3] X Research source You easily do this by writing a small number one to the top of your next column. This is called \"showing your work.\" For example, add the sum 982 + 247 + 475, then draw a line beneath. Using the right-to-left method, add 2 + 7 + 5. The sum is 14. Write the 4 beneath the line on the right side as the sum, and write a small number 1 above the next column to the left. When you are adding the next column, simply include the additional 1 as a part of your sum. For example, the next column would be the equation 8 + 4 + 7 (+1) = 20. Write the 0 below the line, and write the 2 above the next column to the left. Your next column will now read: 9 + 2 + 4 (+2). Add these numbers. Because there is no additional column, you can now write your sum entire, whether it's one digit or two. In this case, the sum is 17. Look at the sum now written below the line: 1704. This is your total."
    },
    {
      "title": "Group the numbers into larger units by rearranging them into units of ten.",
      "content": "Group the numbers into larger units by rearranging them into units of ten. This process can be done either mentally or on paper, and consists of rearranging the digits you're adding for easier arithmetic.This technique works well when adding long columns of numbers. Either mentally or with a pencil, go down the vertical column of numbers you need to add, and group them into units of 10. [4] X Research source For instance, in the vertical column 9 + 3 + 7 + 2 + 4 + 7 + 4 + 1, you can find three units of 10 (3 + 7, 2 + 4 + 4, 9 + 1) with 7 left. Therefore, your sum of this single column will be 37. If you have a second vertical column, write the 7 at the base of the right column, and carry the 3. Repeat this process until all columns have been added."
    },
    {
      "title": "Write any two or more numbers in a column, of at least 2 digits.",
      "content": "Write any two or more numbers in a column, of at least 2 digits. This method is sometimes called \"new math\" because it only gained popularity as an instructional method in the 1990s. It is also known as \"partial sums algorithm.\" [5] X Research source This method only works for numbers greater than 10. This method relies on recognizing the \"place value\" of each digit. The organizing principle of our common method of writing numbers is based on positional numeration: that is, writing numbers in categories, or units, of tens. [6] X Research source For example, in the figure 4357 refers to 4 thousands, 3 hundreds, 5 tens and 7 ones. To add multiple numbers, write them in a vertical column, and draw a line beneath them. However, instead of a simple sum below the line, you will be writing your secondary, simpler math steps."
    },
    {
      "title": "Add multiple numbers by placing them in vertical columns, then writing the resulting sums vertically beneath the line.",
      "content": "Add multiple numbers by placing them in vertical columns, then writing the resulting sums vertically beneath the line. [7] X Research source For example, to add 4357 to 3212 involves adding 4 thousand to 3 thousand (7,000), 3 hundred to 2 hundred (500), 5 tens to 1 ten (60), and 7 ones to 2 ones (9). Beneath your line, write the sums of each place digit, starting on your left. For example, using the example above, the first number below the line will be 7,000, followed by the next sum (500), followed by 60, followed by the number 9. Next, add these together. Because there will be only one number in each column, you can easily see that the resulting sum will be 7,569."
    },
    {
      "title": "Work more complex problems by repeating these steps, not changing them.",
      "content": "Work more complex problems by repeating these steps, not changing them. Sometimes a sum from one place value will need to be added to another place value. This results in a multiple step problem, but it is not more complex. It is simply the same steps, repeated. For example, when adding the two numbers 587 + 474, you will need to add 5 hundred to 4 hundred, writing the sum (900) below the line. Then add 8 tens to 7 tens, resulting in 15 tens, which can also be understood as 1 hundred and 5 tens. Write this below the above number (900). Finally, add 7 ones to 4 ones, resulting in 11, or 1 ten + 1 one. Write this number at the bottom of your problem. Now, take the new figures and add them. This time you do NOT have to write all the 0's to keep your number in its proper place, because your other numbers will do that. 9 hundred to 1 hundred = 1000. 5 tens + 1 ten = 60. The 1 is left as is. Your final sum is therefore 1061. Use a zero as a placeholder for unused mathematical units. In the example above, for instance, a zero is used to indicate the fact that between the thousand and the sixty, there are no hundreds in this number."
    },
    {
      "title": "Add three or more numbers using this method by simply repeating the process.",
      "content": "Add three or more numbers using this method by simply repeating the process. For example, to add 982 + 247 + 475, you'll need to add 900 to 200 to 400 (1500). Then add 80 to 40 to 70 (190). Finally add 2 + 7 + 5 (14). Next, break apart these numbers to their value places: 1500 = 1000 + 500. 190 + 100 + 90. 14 = 10 + 4. Then repeat the addition, continuing to work left to right: thousands, then hundreds, then tens, then ones. In this case, your figure will be 1000 (total), then 500 + 100 (600), then 90 + 10 (100), then 4. Repeat the addition, if necessary, until all units are resolved into their proper place value. In the example given above, the 1000 is resolved. You have two numbers in the hundreds which need to be added (600 + 100 = 700), no tens (0) and 4 ones. The process is complete when all numbers are in their proper units. In the case above, you can see that the sum will be 1 thousand, 7 hundreds, 0 tens, and 4 ones, or 1704. This is your total."
    },
    {
      "title": "Round (by raising) your numbers to the nearest multiple of 10 or 100.",
      "content": "Round (by raising) your numbers to the nearest multiple of 10 or 100. For example, the number 37 would be rounded to 40 by adding 3; the number 392 would be rounded to 400 by adding 8. [8] X Research source To add two numbers together using this method, round each number individually. For example, when adding 39 and 97, round the 39 up to 40 by adding 1, and round the 97 up to 100 by adding 3. Now your math problem is 40 + 100, which is easily added to result in 140. Find your final sum by adding together the two single digits that you've added to each number, and subtracting it from your initial sum. In the example above, you've added 1 (to 39) and 3 (to 97). Now add 1 + 3, resulting in the answer 4. Next, subtract this second number from your first sum. In this case, you'll subtract 4 from 140. 140 - 4 = 136. This is your final sum."
    },
    {
      "title": "Add larger two numbers together using the same method.",
      "content": "Add larger two numbers together using the same method. You will still round each number individually, but you may choose to round them to a larger unit. The goal of rounding numbers is to make the addition simple. Sometimes you may wish to round more than once. For example, when adding 982 + 247 + 475, start by rounding 982 to 990 (+8), 247 to 250 (+3), and 475 to 480 (+5). Now your math problem reads: 990 + 250 + 480. You can employ the rounding method a second time, by rounding 990 up by 10 to 1000, and 480 up by 20 to 500. Now your addition problem reads 1000 + 250 + 500. The total is 1750. Next, add the numbers you've added to round up. Start with the first numbers you added: 8 + 3 + 5. This total is 16. Because you rounded a second time, add these numbers as well: 10 + 20. This total is 30. Finish by adding all totals together. In this case, you'll add 16 + 30 to result in the number 46. Finish by subtracting 46 from 1750. The resulting, final sum is 1704."
    },
    {
      "title": "Practice using this form of adding large numbers by counting money.",
      "content": "Practice using this form of adding large numbers by counting money. You probably use this form of adding large numbers already, perhaps without knowing it. Notice how often prices are listed in numbers that can easily be rounded up to the nearest dollar. For example, frequently a price is listed as $9.95 which is easily rounded to $10.00. Prices are also often rounded to the nearest half-dollar, as $3.49 is commonly rounded to $3.50. To pay for a series of items, you'll need to follow the steps of rounding up individually, then adding to see the total. For example, a grocery list of items might contain a gallon of milk for $3.98 (rounded to $4.00), a box of cereal for $4.38 (rounded to 4.50), two pounds of bananas for $1.97 (rounded to $2.00) and a loaf of bread for $3.47 (rounded to $3.50). Added together, this total grocery bill would be rounded up to $14.00. You have added a total of 20-cents, or $.20, which should be subtracted for your total (pretax!) purchase price of $13.80."
    }
  ]
}