{
  "url": "https://www.wikihow.com/Cite-a-Working-Paper",
  "title": "How to Cite a Working Paper",
  "steps": [
    {
      "title": "Start your Works Cited entry with the author's name.",
      "content": "Start your Works Cited entry with the author's name. All MLA citations start with the name of the author. Put the last name first, followed by a comma, then the first name. If the paper has more than one author, list the rest of their names in first name-last name format, separated by commas. Type the word \"and\" before the last author's name, then place a period at the end. [2] X Research source Example: Foarta, Dana and Massimo Morelli."
    },
    {
      "title": "Add the title of the paper in quotation marks.",
      "content": "Add the title of the paper in quotation marks. Type the title of the paper using title case, in which you capitalize the first word plus any nouns, pronouns, adjectives, adverbs, and verbs. Place a period at the end of the title, inside the closing quotation marks. [3] X Research source Example: Foarta, Dana and Massimo Morelli. \"Equilibrium Reforms and Endogenous Complexity.\""
    },
    {
      "title": "Include the name of the place where you found the paper in italics.",
      "content": "Include the name of the place where you found the paper in italics. Type the title of the website or institution that published or posted the working paper. Place a comma after the name. [4] X Research source Example: Foarta, Dana and Massimo Morelli. \"Equilibrium Reforms and Endogenous Complexity.\" Stanford Graduate School of Business Faculty Working Papers ,"
    },
    {
      "title": "List the year the paper was completed.",
      "content": "List the year the paper was completed. Working papers typically include a year they were completed. You could also use the year the paper was submitted or published on the site. Place a comma after the year. [5] X Research source Example: Foarta, Dana and Massimo Morelli. \"Equilibrium Reforms and Endogenous Complexity.\" Stanford Graduate School of Business Faculty Working Papers , 2018,"
    },
    {
      "title": "Provide a direct URL where the paper can be found.",
      "content": "Provide a direct URL where the paper can be found. Copy the direct URL for the paper and paste it into your citation. Leave off the \"http://\" portion of the URL. Place a period at the end. [6] X Research source Example: Foarta, Dana and Massimo Morelli. \"Equilibrium Reforms and Endogenous Complexity.\" Stanford Graduate School of Business Faculty Working Papers , 2018, www.gsb.stanford.edu/faculty-research/working-papers/equilibrium-reforms-endogenous-complexity. In most citations, this will be the last element. However, there's an optional element you can use if you need to add more information to describe the source. For example, if you have to download the paper to read it, you might add \"PDF download\" so your readers know that. You can also use this element to label the source (\"Working paper\") if you didn't identify it as a working paper in your text."
    },
    {
      "title": "Use the author's last name and the page number for in-text citations.",
      "content": "Use the author's last name and the page number for in-text citations. MLA actually requires 2 citations — one in the Works Cited list at the end of your paper, and one at the end of any sentence where you paraphrase or quote from the source. In parentheses, write the author's last name and the page number (or range) where the paraphrased or quoted material is found. Place the closing punctuation for the sentence outside the closing parenthesis. If the source has 2 authors, include both last names, linked by the word \"and.\" If the source has 3 or more authors, just type the first author's last name, then add the abbreviation \"et. al.\" [7] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source For example, you might write: Decision makers have trouble evaluating proposed reforms if they're not aware of the competence of the person proposing the reform (Foarta and Morelli 1)."
    },
    {
      "title": "Put the author's name first in your Reference List entry.",
      "content": "Put the author's name first in your Reference List entry. Type the author's last name, followed by a comma, then their first initial. If you have multiple authors, separate their names with commas as well, adding an ampersand (&) before the final author's name. [8] X Research source Example: Berndt, A., Duffie, D., & Zhu, Y."
    },
    {
      "title": "Add the year the paper was completed.",
      "content": "Add the year the paper was completed. The next element of your Reference List entry typically would be the year of publication. Since working papers haven't technically been published yet, use the year of completion. Type it in parentheses with a period at the end, following the closing parenthesis. [9] X Research source Example: Berndt, A., Duffie, D., & Zhu, Y. (2020)."
    },
    {
      "title": "Include the title of the paper in italics followed by the paper number.",
      "content": "Include the title of the paper in italics followed by the paper number. Type the title of the paper in sentence case, capitalizing only the first word and any proper nouns. After the title, type the words \"Working Paper No.\" followed by the number of the paper in parentheses. Don't italicize this parenthetical. Place a period at the end, outside the closing parenthesis. [10] X Research source Example: Across-the-curve credit split indices (Working Paper No. 3884)."
    },
    {
      "title": "List the name of the site or institution where you found the paper.",
      "content": "List the name of the site or institution where you found the paper. Type the full name of the website or institution that posted the paper. Then, put a period at the end. Use the same capitalization or acronyms that the site uses. [11] X Research source Example: Berndt, A., Duffie, D., & Zhu, Y. (2020). Across-the-curve credit split indices (Working Paper No. 3884). Stanford Graduate School of Business Faculty Working Papers."
    },
    {
      "title": "Close your Reference List entry with a URL for the paper.",
      "content": "Close your Reference List entry with a URL for the paper. Copy the direct URL for the paper, then paste it as the last element of your Reference List entry. Unlike other elements, don't put a period at the end of the URL. [12] X Research source Example: Berndt, A., Duffie, D., & Zhu, Y. (2020). Across-the-curve credit split indices (Working Paper No. 3884). Stanford Graduate School of Business Faculty Working Papers. https://www.gsb.stanford.edu/faculty-research/working-papers/across-curve-credit-spread-indices"
    },
    {
      "title": "Use the author's last name and the year for in-text citations.",
      "content": "Use the author's last name and the year for in-text citations. For a standard APA in-text citation, place a parenthetical at the end of any sentence in which you use material from the source, inside the sentence's closing punctuation. In your parenthetical, include the last name of the author, followed by a comma, then the year the paper was completed. [13] X Research source For example, you might write: The across-the-curve credit spread index could serve as a benchmark for risk management (Berndt, Duffie, & Zhu, 2020). If you use the author's name in the text of your paper, place a parenthetical with the year immediately after their name. For example, you might write: Berndt, Duffie, and Zhu (2020) created a weighted index to measure the average cost of unsecured debt held by banks. If you quote directly from the source, add a comma after the year and put the page number (or range) where the quoted material can be found in your parenthetical citation."
    },
    {
      "title": "List the author's name first in your Bibliography entry.",
      "content": "List the author's name first in your Bibliography entry. Start with the first author's name inverted so that the last name is listed first, followed by a comma, then the first name. Use first name-last name format for any other authors, placing a period between each author's name. Add the word \"and\" before the last author's name, then place a period at the end. [14] X Research source Example: Van Loon, Austin, Amir Goldberg, and Sameer Srivastava."
    },
    {
      "title": "Add the title of the paper in quotation marks.",
      "content": "Add the title of the paper in quotation marks. Type the title in title case, capitalizing the first word plus all nouns, pronouns, adjectives, adverbs, and verbs. Place a period at the end of the title, inside the closing quotation marks. [15] X Research source Example: Van Loon, Austin, Amir Goldberg, and Sameer Srivastava. \"Differences Beyond Identity: Perceived Construal Distance and Interparty Animosity in the United States.\""
    },
    {
      "title": "Provide publication information for the paper.",
      "content": "Provide publication information for the paper. Start this element by typing the words \"working paper\" to indicate the type of paper it is, followed by a comma. Then, type the institution or company that sponsored the paper. Place a comma after that name, then add the year the paper was completed. Place a period at the end. [16] X Research source Example: Van Loon, Austin, Amir Goldberg, and Sameer Srivastava. \"Differences Beyond Identity: Perceived Construal Distance and Interparty Animosity in the United States.\" Working paper, Stanford Graduate School of Business, 2020."
    },
    {
      "title": "Close your Bibliography entry with the URL for the paper.",
      "content": "Close your Bibliography entry with the URL for the paper. Copy the direct URL for the paper and paste it into your entry as the last element. Place a period at the end of the URL. [17] X Research source Example: Van Loon, Austin, Amir Goldberg, and Sameer Srivastava. \"Differences Beyond Identity: Perceived Construal Distance and Interparty Animosity in the United States.\" Working paper, Stanford Graduate School of Business, 2020. https://www.gsb.stanford.edu/faculty-research/working-papers/differences-beyond-identity-perceived-construal-distance-interparty."
    },
    {
      "title": "Change the punctuation and add page numbers for footnotes.",
      "content": "Change the punctuation and add page numbers for footnotes. For your first footnote, include all the same information as your Bibliography entry. Since the footnote is formatted to read more like a sentence, put all the authors' names in first name-last name format. Change the periods between the elements to commas and put the publication information (description, name of the institution, and year) in parentheses. Add the page number (or range) where the material you're citing appears after the publication information, then close with the URL. [18] X Research source Example: Austin Van Loon, Amir Goldberg, and Sameer Srivastava, \"Differences Beyond Identity: Perceived Construal Distance and Interparty Animosity in the United States,\" (working paper, Stanford Graduate School of Business, 2020), pp. 12-14, https://www.gsb.stanford.edu/faculty-research/working-papers/differences-beyond-identity-perceived-construal-distance-interparty. After your first footnote, use a shortened footnote form with only the author's last name and the title of the paper in quotation marks: Van Loon, Goldberg, and Srivastava, \"Differences Beyond Identity: Perceived Construal Distance and Interparty Animosity in the United States.\""
    }
  ]
}