{
  "url": "https://www.wikihow.com/Care-for-an-Eastern-Box-Turtle",
  "title": "How to Care for an Eastern Box Turtle",
  "steps": [
    {
      "title": "Buy a box turtle from a reputable breeder or rescue group.",
      "content": "Buy a box turtle from a reputable breeder or rescue group. Turtles taken from the wild don’t make good pets because they have a harder time adjusting to captivity. Similarly, turtles from an unreliable breeder might be underfed or ill and are less likely to last when you take them home. Look online to find a trustworthy and well-reviewed turtle seller or shelter where you can purchase an Eastern box turtle. [1] X Research source Shelters and rescue groups often have a wider selection because some owners aren’t able to keep the Eastern box turtle for its full lifespan, which averages 40 to 50 years but can be much longer! Depending on its age, the average Eastern box turtle usually costs between $50 and $300, so budget accordingly. Keeping Eastern box turtles may be illegal or require special permits in some areas. Check your local laws and guidelines to make sure you are allowed to keep an Eastern box turtle as a pet."
    },
    {
      "title": "Check the turtle over for signs of illness or injury.",
      "content": "Check the turtle over for signs of illness or injury. Once you've found a turtle you like, pick it up gently using both hands. It should feel heavy in your hands, have no scratches or tears on its skin, and its shell should be hard with no visible blemishes. Check that its eyes are bright and clear, indicating a healthy turtle. If you see any discharge around the turtle’s eyes, nose, or mouth, it may be sick. [2] X Research source Signs of illness may mean that the turtle won't live for very long once you take it home. This is sad, but ultimately it’s better to choose a healthy turtle so that you can care for them for a long time. If many of the turtles you check look unhealthy or feel quite light, it may be a sign that the pet store or seller isn't taking good care of their turtles—and it’s time to look elsewhere for a seller."
    },
    {
      "title": "Ask if you can feed the turtle.",
      "content": "Ask if you can feed the turtle. Before you purchase your new turtle, ask the seller if you can feed it a little lettuce or some insects. If they don't let you, or if the turtle doesn't eat when offered food, it may be a sign that it hasn't been fed properly or won't accept food in captivity. Ensure your turtle will eat before you take it home. [3] X Research source"
    },
    {
      "title": "Make an outdoor enclosure if you live somewhere warm year-round.",
      "content": "Make an outdoor enclosure if you live somewhere warm year-round. Outdoor enclosures are best for the turtle because they mirror its natural habitat. If you have a large yard where temperatures regularly rise above 70 °F (21 °C), enclose a 4 by 4 ft (120 by 120 cm) area with a chain fence at least 18 inches (46 cm) high. Cover the top of the enclosure with wire mesh to protect the turtle from predators. [4] X Research source Don’t leave your turtle in an outdoor enclosure if you live somewhere with temperatures below 60 °F (16 °C) during the cooler months. Eastern box turtles love to burrow! To stop them from escaping, dig a trench around the perimeter and fill it with a single layer of bricks. Then, cover them with dirt and build the fence (or wall) above the bricks. If you don't want to put up a fence , use cinder blocks or bricks to make an enclosure. Stack them around the perimeter of your space before covering the top with wire mesh to keep the turtle inside. Ensure that all the plants in your yard and any lawn chemicals you might use are safe for the turtle before creating an outdoor enclosure."
    },
    {
      "title": "Create an indoor enclosure",
      "content": "Create an indoor enclosure if you live somewhere with cold winters. Box turtles are cold-blooded and don’t like temperatures below 70 °F (21 °C), so buy a large plastic container , a glass turtle tank , or a wooden tortoise house to keep indoors if you need more temperature regulation. [5] X Research source The tank should be at least 3 by 1 ft (91 by 30 cm). Turtles like to roam, so the more space your turtle has, the better! The tank's walls should be at least 12 inches (30 cm) high, but you don’t need a lid to keep the turtle inside since it’s safe indoors. Glass tanks are a common choice, but it’s a good idea to cover the sides with paper if you get one. If your turtle can see outside the glass, it may try to escape and become distressed."
    },
    {
      "title": "Use heat lamps or natural sunlight to warm half of the enclosure.",
      "content": "Use heat lamps or natural sunlight to warm half of the enclosure. Cold-blooded reptiles like the box turtle need to bask in warm light to regulate their body temperature. Place a heat lamp for reptiles over one end of your indoor enclosure, or ensure there’s enough natural sunlight in an outdoor enclosure to keep one side of the tank around 85 °F (29 °C) during the day. [6] X Research source Natural light is the best source of UVB (Ultraviolet B) and UVA (Ultraviolet A) rays, which your turtle needs to stay healthy. If you invest in a heat lamp, ensure it emits UVB and UVA rays and keep it on for 12 to 14 hours daily. The UV lamp should be placed within 12 inches of your turtle. Replace the lightbulbs in your heat lamp every 6 months, as their UV emission gets lower with time and use, and no longer enough for your turtle. Write down the date on the bulb or make a note in your calendar."
    },
    {
      "title": "Keep the other half of the enclosure shady and cool at 70 °F (21 °C).",
      "content": "Keep the other half of the enclosure shady and cool at 70 °F (21 °C). Give your turtle an area away from direct heat where they can cool down to prevent them from overheating. Plant some small trees or leafy foliage over half of an outdoor enclosure to protect it from the sun, or position the heat lamp so that it only covers half of an indoor enclosure. [7] X Research source Install thermometers on each end of the enclosure to ensure the temperatures are in the right range at all times. Though turtles can tolerate slightly lower temperatures at night, it’s best to keep the temperature above 60 °F (16 °C) and bring the turtle inside if the outdoor temperature drops."
    },
    {
      "title": "Coat the bottom of the tank with a substrate so the turtle can burrow.",
      "content": "Coat the bottom of the tank with a substrate so the turtle can burrow. Your turtle will burrow into the ground to help regulate its temperature or get privacy. Put down a layer of substrate (simply put, a base layer) at least 2 inches (5.1 cm) deep across the floor of the enclosure to help the turtle burrow. Choose from wood chip mulch , substrate pellets , or terrarium moss to make your substrate layer. [8] X Research source In a larger outdoor enclosure, you can set up a smaller area designed for burrowing. Cover around half of the shaded area of your enclosure with a substrate to give your turtle a cool spot to dig in. Don't use gravel, sand, potting soil, cat litter, or anything else particularly gritty as a substrate. Your turtle may end up ingesting it and become ill as a result."
    },
    {
      "title": "Place a large, shallow dish of fresh water in the enclosure.",
      "content": "Place a large, shallow dish of fresh water in the enclosure. Eastern box turtles need water for drinking and soaking in. Place a large saucer no more than 1 in (2.5 cm) deep in your turtle's enclosure and fill it with filtered, bottled, or treated water free from chlorine. Position the water away from a direct heat source to keep it fresh and cool for your turtle. [9] X Research source Chlorine, which is found in most tap water, can be harmful to turtles. Use filtered or bottled water, or treat tap water with a water conditioner (available at your local pet store) to neutralize the chlorine."
    },
    {
      "title": "Decorate the enclosure with logs, rocks, and plants for enrichment.",
      "content": "Decorate the enclosure with logs, rocks, and plants for enrichment. Add some decorations to the enclosure to make your turtle feel more at home and give it privacy. Place 1 or 2 large hollow reptile logs and some reptile habitat plants in the enclosure, along with a large, flat terrarium rock in the warmer section that your turtle can use to bask in the heat. [10] X Research source Make sure any decorations you add sit sturdily on the ground and don’t fall over if nudged. Only use flat rocks in the enclosure. Your turtle will climb on the rocks no matter what, and rocks that are too tall may cause your turtle to fall and hurt itself."
    },
    {
      "title": "Feed your turtle once every 24 hours.",
      "content": "Feed your turtle once every 24 hours. Because they’re quite small, typically only growing between 5 inches (13 cm) to 7 inches (18 cm) long, Eastern box turtles only need to eat once every day. Pick a time you can feed them daily; the morning is your best choice since turtles are most active then, but any time of day will work so long as you do it consistently. [11] X Research source Consult your veterinarian to find out exactly how much your turtle should eat daily since the amount varies based on their age and size. Feed your turtle by either dropping food in front of it in the enclosure or by holding the turtle in one hand and feeding it with the other."
    },
    {
      "title": "Give your turtle a diet of 60% animal protein and 40% plant matter.",
      "content": "Give your turtle a diet of 60% animal protein and 40% plant matter. Feed your turtle a mix of animal protein in the form of crickets, earthworms, slugs, mealworms, and grasshoppers. Serve them a variety of plant matter, including lettuce, kale, spinach, clover, and collard greens. Box turtles also tend to enjoy brightly-colored vegetables like carrots, squash, bell peppers, cucumbers, and tomatoes. [12] X Research source Purchase feeder insects at your local pet store. Cut up hard vegetables into small pieces that your turtle can easily eat. Some turtles enjoy being fed, whereas others prefer hunting for their food. Try both methods of feeding to see which one your turtle enjoys more!"
    },
    {
      "title": "Offer your turtle a small amount of fruit in their meals as a tasty treat.",
      "content": "Offer your turtle a small amount of fruit in their meals as a tasty treat. Turtles love sweet fruits but shouldn’t eat them as much as veggies because of the high sugar levels—roughly 10% of the plant matter you prepare for your turtle's meal should be fruit. Give your turtle fruits like strawberries, apples, bananas, grapes, blueberries, raspberries, cantaloupe, kiwis, and mangoes. [13] X Research source Chop tough or hard fruits into small, bite-sized pieces for your turtle. It might take some experimentation to find a treat that your turtle enjoys. Try different types of berries and fruits until you find something they love."
    },
    {
      "title": "Add calcium supplements to your turtle’s food 2 or 3 times a week.",
      "content": "Add calcium supplements to your turtle’s food 2 or 3 times a week. While turtles get calcium from their diet, adding supplements keeps their shell strong and healthy. Purchase a calcium supplement for turtles that doesn't contain phosphorous or vitamin D3, and sprinkle a small pinch over your turtle's food. [14] X Research source"
    },
    {
      "title": "Pick up your turtle gently in both hands to minimize its stress.",
      "content": "Pick up your turtle gently in both hands to minimize its stress. Keep your fingers under the bottom shell and your thumbs resting on the top shell so you can hold the turtle carefully but firmly. Box turtles typically don’t like being handled, so while it’s necessary to handle your turtle sometimes, ensure you’re holding it properly to keep the turtle as comfortable as possible. [15] X Research source Wash your hands before and after handling your turtle to protect yourself from Salmonella. Check to see if your turtle is sleeping or eating before picking them up, as it’s best not to interrupt them. Behaviorally, box turtles are more shy than aggressive. If you see your turtle retreat fully into its shell, that’s a sign of stress. Give the turtle plenty of hiding spots around the enclosure to help them feel less exposed."
    },
    {
      "title": "Interact with your box turtle regularly.",
      "content": "Interact with your box turtle regularly. Although they initially don’t like being handled, frequent interactions with your box turtle will help them feel more comfortable around you, even when you pick them up. Gently handle your box turtle regularly, especially during feeding time, and offer the turtle a bit of food to help lower their stress levels before picking them up. [16] X Research source Once turtles become comfortable around their human (you), they can actually be quite social! After regular interactions, they might start recognizing your face and voice when you visit."
    },
    {
      "title": "Offer your box turtle toys to keep them happy and healthy.",
      "content": "Offer your box turtle toys to keep them happy and healthy. While toys may not seem important for a slow little box turtle, they can really improve the turtle’s quality of life. Toys are another valuable form of enrichment and keep the turtle entertained! Give your turtle toys like a plastic ping pong ball , a moss ball , a floating bath toy , or a treat ball for turtles stuffed with leafy greens. Turtles can push around a ball for stimulation. Plus, a treat ball can help pique their interest during feeding time. Don’t give your turtle anything small enough to accidentally swallow (unless it’s safe and edible, like moss balls)."
    },
    {
      "title": "Bring your turtle to an exotic animal veterinarian once a year.",
      "content": "Bring your turtle to an exotic animal veterinarian once a year. Eastern box turtles are considered exotic animals, so find a veterinarian specializing in turtle care—most run-of-the-mill veterinarian offices mainly care for cats, dogs, and other common pets. Look online for a vet with experience treating exotic animals or turtles and set up yearly check-ups for your pet. [17] X Research source Yearly check-ups can give you peace of mind and ensure your turtle is happy and healthy throughout life. Your veterinarian can also give you extra advice on caring for your turtle!"
    },
    {
      "title": "Keep an eye out for common health problems like infections or shell rot.",
      "content": "Keep an eye out for common health problems like infections or shell rot. Take your turtle to the veterinarian if they stop eating, have swollen eyelids, get red spots or dry skin, develop abnormal or smelly spots on their shell, or seem to be acting differently. Respiratory infections, shell rot, and ulcers are all common problems associated with a poor diet or dirty living space. If your turtle lives outside, it could also be at risk for gastrointestinal parasites. Signs include a poor appetite and off-colored excrement."
    },
    {
      "title": "Mist the enclosure daily to maintain high humidity levels.",
      "content": "Mist the enclosure daily to maintain high humidity levels. Eastern box turtles thrive in humid environments, so maintain humidity levels between 70% and 80% in your turtle’s enclosure. Do this by manually misting the enclosure with clean water or installing an automatic fogger in the enclosure to keep it humid for you. [18] X Research source If you want to know exactly how humid the enclosure is, purchase and install a tank hydrometer . Only use filtered, bottled, or treated, chlorine-free water to mist the enclosure."
    },
    {
      "title": "Clean and replace your turtle’s water every day.",
      "content": "Clean and replace your turtle’s water every day. Since your turtle spends a lot of time in the water, it’ll get dirty fast. Toss out the dirty water, scrub the water dish, and refill it with fresh filtered, bottled, or treated water daily to ensure your turtle always has clean water. Clean the dish with only water and a brush, as soap residue irritates your turtle. If you keep multiple turtles, you may need to change the water more frequently to ensure it stays clean."
    },
    {
      "title": "Use a small scoop to remove droppings from the enclosure daily.",
      "content": "Use a small scoop to remove droppings from the enclosure daily. While you don't need to clean out the entire enclosure daily, do a small spot clean every day to get rid of excrement in the enclosure. Check-in every morning and scoop out any waste you see before disposing of it. A clean enclosure decreases the chance of your turtle getting sick and keeps it happier! If you notice your turtle's droppings become a white or grey color, it may be a sign that the turtle is ill. Take it to a vet as soon as possible for a checkup."
    },
    {
      "title": "Clean out the entire tank",
      "content": "Clean out the entire tank every 2 to 3 weeks. Start by removing all of the substrate material in the enclosure and disposing of it. Then, take out all the decorations and rinse them thoroughly with water. Lay down a fresh substrate layer and let the decorations dry before returning them to the enclosure. To ensure you don’t miss a cleaning, pick a designated day every couple of weeks that you can set aside to clean your turtle's enclosure."
    },
    {
      "title": "Keep your turtle safe, warm, and healthy during hibernation.",
      "content": "Keep your turtle safe, warm, and healthy during hibernation . If you live in a cold area or expose your turtle to cold weather, they may want to hibernate for 3 to 4 months. Bring your turtle to the veterinarian to ensure that they’re healthy enough to hibernate. Give your turtle plenty of substrate to burrow under, keeping them warm while they hibernate. [19] X Research source Feed your turtle a healthy, vitamin and fiber-rich diet in the summer months with enough nutrients to carry them through hibernation. Your vet may encourage you to keep the turtle inside and in a temperature-regulated area to keep them from hibernating if they’re not equipped for hibernation."
    }
  ]
}