{
  "url": "https://www.wikihow.com/Cook-Frozen-Lobster",
  "title": "How to Prepare and Cook Frozen Lobster",
  "steps": [
    {
      "title": "Buy frozen lobster that has never been thawed.",
      "content": "Buy frozen lobster that has never been thawed. Check that it was blanched before freezer storage and stored at extremely low temperatures, around 0 °F (−18 °C). Sometimes you won’t want to cook the lobster immediately. Store the frozen lobster in an airtight freezer bag. If vacuum-sealed, it can be stored in a freezer for up to one year. Of course, you can also purchase lobster that is not frozen. When kept on ice in the refrigerator, not freezer, live lobsters can last for several days."
    },
    {
      "title": "Choose quality frozen lobster.",
      "content": "Choose quality frozen lobster. You can buy two different kinds of lobster, either warm-water or cold-water tails. The different tails vary in taste and quality. You can buy either frozen lobster tails or claws. It's rare to find a frozen whole lobster that has not been pre-cooked. [1] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Warm-water lobsters, also known as spiny lobster, are not as tasty because the meat can become mushy. These originate from Latin America, the Caribbean, and Florida. The tails from the Caribbean have yellow spots and tails with yellow bands. The meat in cold water lobster, also known as Maine lobster, is more desirable. It’s whiter, sweeter and more tender. However, it can also be more expensive. Cold-water lobsters come from South Africa, New Zealand, Australia and, Northeast America. If the store doesn’t know whether the tails came from cold water, less expensive is usually indicative of the warm-water variety. Frozen lobster claws contain less meat than as tails and thus are less expensive. You can find them in the frozen food section of many grocery stores. Avoid buying any lobster tails with black spots or gray tails. The lobster probably died during the processing in those cases. [2] X Research source If you want whole lobster, it is best to cook them live if you can get them."
    },
    {
      "title": "Buy enough lobster.",
      "content": "Buy enough lobster. It’s important to know how many people a lobster will serve to make sure that you have enough food for everyone. Lobster tails in particular are full of meat. You should also be aware that different cultures will have different preferences when it comes to cooking lobster. For example, in Canada, lobster tends to be cooked longer than it is in France. Personal preference also plays a part. Just remember you can always cook your lobster a little longer, but you can't uncook it so take it out sooner rather than later. Generally speaking, you will want 1 to 1 ½ pounds of lobster for every person you are serving. You can cook lobster as whole, tails or claws."
    },
    {
      "title": "Thaw the lobster tails.",
      "content": "Thaw the lobster tails . [3] X Expert Source Ed Kuoha Chef Expert Interview. 9 November 2021. It’s absolutely essential that you thaw the lobster, whole, tails or claws, before you cook them. If you don’t, you are likely to end up with meat that tastes very tough. It’s ideal to thaw the lobster for about 24 hours in the refrigerator before you cook it or at least overnight. A good way to thaw theme faster is to place in a plastic bag, put the plastic bag in a pot full of water, and into the refrigerator. You may need to change the water at least once. [4] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source If you are in a great hurry, it’s possible to defrost the a bit in a microwave before cooking them. Although this is a better idea than cooking frozen tails, it’s not as ideal as thawing the lobster more slowly. It’s a bad idea to thaw lobster in warm water or room temperature. Lobster claws also need to be defrosted completely before cooking. Another alternative if you're in a hurry is to put the lobster in plastic and immerse in cold water without refrigerating. Change the water every 5-10 minutes but don't let it sit out too long. About 30 minutes tops. After that, finish thawing in the fridge."
    },
    {
      "title": "For cooking tails, cut the shell of the lobster.",
      "content": "For cooking tails, cut the shell of the lobster . [5] X Expert Source Ed Kuoha Chef Expert Interview. 9 November 2021. Once you’ve thawed the frozen lobster, before you cook it, cut the shell down the middle of the tail’s back, using scissors. To do this, put the point of kitchen shears or scissors between the lobster meat and the shell. Leave the tail fan in place. Lift the meat through the slit you’ve created in the top of the shell. You’ve now created what is called a “piggyback lobster tail.” Another method is to start at the tail, and peel back the soft under shell of the lobster. Then, discard the undershell. Bend the tail backwards. If you crack some of the overshell joints, it will stop the lobster from curling while you cook it."
    },
    {
      "title": "Boil",
      "content": "Boil the lobster. Boiling lobster is one of the most common ways to cook it. Start by boiling water in a large pot. You want to make sure you have enough water in the pot to cover the lobster tails completely. [6] X Research source For each quart of water, add 1 tablespoon of salt. Place the thawed lobster into the water, cover and let the water simmer for 5 minutes for each 4-ounce tail (and one extra minute for each additional ounce of lobster that you are cooking). You can tell the lobster is done when the shells are bright red and the meat tender if you poke at it with a fork. If you cut into the tail a properly cooked lobster will be just to the white. If translucent, put back and cook a little longer."
    },
    {
      "title": "Broil",
      "content": "Broil the lobster. Set your oven on broil. Be aware that broiling is a very fast process, so keep a close eye on the lobster to make sure you don’t burn it. [7] X Research source Arrange the lobster tails on a broiler pan. Place them on the pan shell side up, and then broil it for only about 4 minutes. You want to keep the lobster meat about 5 inches away from the heat. If you are broiling very large lobster tails, you might want to split them lengthwise to make two servings from each. Turn them over. Brush with butter. Broil the other side 5 minutes more. Serve the tails."
    },
    {
      "title": "Steam",
      "content": "Steam the lobster. One healthy way to cook lobster is to steam it. You want to start by putting a half inch of water in the pot with a tablespoon of salt and a tablespoon of vinegar. [8] X Research source Put the lobsters in the pot. Cover the pot, and, if whole, let them steam for 10 minutes for a 1-pound lobster or 7-8 minutes per pound. Tails may take less time. You can also steam lobsters by placing them on a rack. Boil about two inches of water in a pot that is below the rack holding the lobster."
    },
    {
      "title": "Poach the lobster.",
      "content": "Poach the lobster. Poaching is similar to steaming but the liquid is kept just below the boiling point. Added aromatics and seasonings enhance the flavor. [9] X Research source To poach a lobster, prepare a poaching liquid in a large enough pot with cover, by adding lemon, chives, onion and celery to a little water. You can also add chicken or vegetable broth for added flavor. Seasonings can be added or substituted to your taste. You don't need more than and inch or two of your poaching liquid. Bring to a boil, lower heat to medium and simmer for a few minutes. Put the lobster in the poaching liquid, cover the pot tightly and simmer 7-8 minutes per pound. If the liquid is boiling use less time but check to make sure it's done. Try not to let the liquid boil. You will know it’s done if an antenna or small leg pulls away easily when you tug on it and the tail meat has just gone to white. If it's still translucent, allow it to cook a few minutes longer."
    },
    {
      "title": "Grill",
      "content": "Grill the lobster. To grill the lobster, find the cross that is located on the back of its head. Pierce it with a heavy knife. Cut down the back of the tail, splitting the lobster lengthwise. [10] X Research source Place the lobster on the grill. You will want to place the flesh side of the lobster down on the grill, and leave it there for about 8 to 10 minutes. There is no need to turn the lobster over. Before you grill it, brush it with butter or olive oil. You could also put a metal skewer through the tails before grilling them."
    },
    {
      "title": "Bake the lobster",
      "content": "Bake the lobster . You can bake lobster tails or try baking lobster claws instead. [11] X Expert Source Ed Kuoha Chef Expert Interview. 9 November 2021. First preheat heat your oven to 400 °F (204 °C). [12] X Research source Bundle the claws together. Wrap them in a pocket of aluminum foil, and place them on a cookie sheet. You will bake them for about 10 minutes. You can tell the lobster claws are done when they look pink. Many grocery stores have lobster claws in the frozen food section."
    }
  ]
}