{
  "url": "https://www.wikihow.com/Avoid-an-Ex-Boyfriend-or-Girlfriend",
  "title": "How to Avoid an Ex Boyfriend or Girlfriend",
  "steps": [
    {
      "title": "Don’t call or text.",
      "content": "Don’t call or text. Use your phone’s settings to help you avoid contact with your ex. For example, you can change your ex’s name in your address book to “DO NOT ANSWER” to remind you what you must do. Some phones or services will also allow you to block a particular number entirely. [1] X Research source"
    },
    {
      "title": "Keep any contact short and sweet.",
      "content": "Keep any contact short and sweet. If you must talk to your ex, keep the communication brief but friendly. Never flirt, however tempting it may seem. If you start to repeat old arguments or bad patterns, end the conversation immediately: say, “I’m sorry, this conversation isn’t going well. I need to end it.” [2] X Research source"
    },
    {
      "title": "Ask teachers, bosses, or coworkers for help in limiting your exposure to your ex.",
      "content": "Ask teachers, bosses, or coworkers for help in limiting your exposure to your ex. Working together closely in class, being assigned to the same project, or getting put at the same work table could derail your effort to avoid your ex. You may need to ask others at school or work for help to avoid these situations. For example, you might explain to a teacher that you would prefer not to do a group project with your ex. Or, you could ask your guidance counselor for help in arranging your schedule so that you are not in class with your ex."
    },
    {
      "title": "Plan your schedule to avoid awkward encounters.",
      "content": "Plan your schedule to avoid awkward encounters. If you don’t run into your ex, you won’t accidentally start speaking with him. And you won’t see him flirting with someone else, either. If you are in school together, use your knowledge of his schedule to avoid crossing paths in the hallway or by the lockers. Avoid visiting his workplace. For example, if he works for a café, get your hot drinks somewhere else now. Don’t go to his favorite hangouts or to his events. If your ex plays basketball, don’t go to those games. If he always took you bowling, don’t go bowling for a while."
    },
    {
      "title": "Keep in contact with mutual friends, but make your boundaries clear.",
      "content": "Keep in contact with mutual friends, but make your boundaries clear. Don’t keep socializing with your ex just because you have mutual friends. [3] X Research source Respect that your friends might want to remain friends with both of you. While it can be tempting to try to convince everyone to side with you, it’s not healthy. It may be helpful to talk through different scenarios with your friends. For example, you might say: “I don’t feel comfortable continuing our movie nights as a small group right now. But, if you throw a big party, it’s ok to invite both of us.” Recognize that your needs will change over time. Keep your friends up to date: if it’s ok to invite you both to a dinner party now, say so. Leave his friends to him. Just as you need the support of your friends and family as you navigate the break-up, so does your ex. Let your ex rely on his own network of friends and family."
    },
    {
      "title": "Recognize signs of stalking and abuse.",
      "content": "Recognize signs of stalking and abuse. Stalking is defined as a pattern of unwanted attention or behavior directed at you that would make a reasonable person fearful. For example, it is stalking to send repeated, intrusive, scary calls, messages, or gifts. A stalker may follow or wait for you in places where she knows she’ll find you. Or, he may make threats to harm you or your friends or family. [4] X Trustworthy Source United States Department of Justice Official website of the U.S. Department of Justice Go to source Rely on your instincts: if you feel you are being stalked, seek help, including calling the police. Don’t downplay threatening behavior. [5] X Trustworthy Source United States Department of Justice Official website of the U.S. Department of Justice Go to source Keep a record of contact made by a stalker as well as keep any police reports. [6] X Trustworthy Source United States Department of Justice Official website of the U.S. Department of Justice Go to source"
    },
    {
      "title": "Set and communicate your own boundaries.",
      "content": "Set and communicate your own boundaries. Sometimes, an ex’s behavior might not rise to the level of stalking. Perhaps she just keeps asking to be friends or to get back together. Or perhaps he’s telling you that it’s normal for exes to spend a certain amount of time together. You get to set your own boundaries with an ex, even if you feel guilty about ending the relationship. Decide on what boundaries make you feel most able to enjoy your own life. Remember that you don’t owe your ex your time and attention. Naming your own boundaries, to yourself and your friends, is the first step. [7] X Research source Pay attention to feelings of resentment or discomfort. They are often a sign that you feel your boundaries are being violated or that you haven’t set boundaries that truly make you comfortable. [8] X Research source Be direct about what your boundaries all. Don’t be afraid to sound like a broken record if you need to. Tell your ex: “I’m not ready to be friends. If and when I am ready, I will let you know.” If your ex keeps texting you or sending you gifts or other items, stay firm with your boundaries and don’t engage. Reader Poll: We asked 673 wikiHow readers who've had an ex send them gifts, and 66% of them agreed that the best way to handle the situation is by ignoring them. [Take Poll]"
    },
    {
      "title": "Rely on your friends and family.",
      "content": "Rely on your friends and family. They are a helpful resource and the first line of defense in preventing your ex from contacting you. [9] X Research source Ask your family for help in limiting contact with your ex. For example, your parents might be able to screen calls or other ways that your ex tries to contact you. [10] X Research source Don’t tolerate friends who won’t respect your decision to end contact with your ex. If your friends try to use the situation to stir up drama, they are not real friends."
    },
    {
      "title": "Ask for help in enforcing boundaries and staying safe at school or work.",
      "content": "Ask for help in enforcing boundaries and staying safe at school or work. You have the right not to be forced into unwanted contact with an abusive or stalking ex. At school, you might want to start by speaking with a guidance counselor; at work, with Human Resources or a trusted supervisor."
    },
    {
      "title": "Don’t be taken in by promises that your ex will change.",
      "content": "Don’t be taken in by promises that your ex will change. If you have been in abusive relationship, your ex might promise that he won’t abuse you any more if you get back together. This is part of the cycle of abuse. While your ex might be able to change in time, if he does a lot of work and gets a lot of professional help, you need to be out of the relationship now. [11] X Research source"
    },
    {
      "title": "Seek legal help if necessary.",
      "content": "Seek legal help if necessary. If your ex absolutely won’t leave you alone, in spite of anything you or others say, you might need to get a restraining order. This is a legal document that states the limits on the contact your ex may make with you. [12] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source"
    },
    {
      "title": "Commit to making a clean break.",
      "content": "Commit to making a clean break. While it’s possible to be friends with someone you used to date, you need time to recover from the break-up before that’s possible. [13] X Research source Friendships between exes are often less satisfactory, in the long run, than friendships between people who never dated. [14] X Research source Mark a date on a calendar to solidify for yourself how long it really is. If you had a reasonably healthy relationship, you might be able to say to your ex: “I hope that we can interact as friends in the future. But for now, I need a certain amount of time to work on my own healing. That means I won’t accept your calls or talk to you until this date at the soonest.”"
    },
    {
      "title": "Remember that not contacting your ex is about moving on, not re-starting the relationship.",
      "content": "Remember that not contacting your ex is about moving on, not re-starting the relationship. You need to develop a new sense of yourself that is not based in your old relationship. Rather than focusing on her, focus on your friends and your family relationships, your studies, your work, and your hobbies. Now is a good time to reach out to that friend you really like that you haven’t seen for a while. Consider taking up a new hobby, so that you meet new people and build confidence in a new context."
    },
    {
      "title": "Avoid your ex on social media.",
      "content": "Avoid your ex on social media. [15] X Research source Staying connected on social media may hold you back from healing and moving on after the end of a romantic relationship. [16] X Research source Your focus should be on personal growth, not pictures of her night out or status updates about her new partner – or how lonely she is. [17] X Trustworthy Source Pew Research Center Nonpartisan thinktank conducting research and providing information on public opinion, demographic trends, and social trends Go to source Unfriend your ex on Facebook. In addition, there are apps and plug-ins that can block your ex’s updates from appearing in your feed and remove any posts that mention him. Unfollow your ex on Twitter, Snapchat, and Instagram. Use a “block your ex” plug-in to remove references to your ex from your internet browser altogether. These can be helpful if you just can’t resist searching her name from time to time."
    },
    {
      "title": "Don’t fantasize about your ex.",
      "content": "Don’t fantasize about your ex. The drama of infatuation and romantic relationships can mimic addiction. Recognize that your fantasies are shaped by the best aspects of the relationship and are not an accurate depiction of what it was really like to be with him."
    },
    {
      "title": "Write a journal entry about the positive aspects of the relationship – and of ending it.",
      "content": "Write a journal entry about the positive aspects of the relationship – and of ending it. Personal growth often results from a break-up. Writing a short, personal essay that focuses on the positive effects of the break-up helps to increase positive emotions like gratitude, hopefulness, relief, and satisfaction. [18] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source"
    },
    {
      "title": "Talk to a counselor or therapist.",
      "content": "Talk to a counselor or therapist. If you find yourself unable to get over your ex, or overwhelmed with feelings of sadness, despair, or fear, you should talk to a therapist. A counselor will also be able to help you develop strategies for any interactions you need to have with your ex. Take time to find the right therapist for you. You might need to talk to a few different people or get recommendations from several different sources, including your school and your doctor’s office. It’s worth it to find someone you feel comfortable with."
    },
    {
      "title": "Stay away from drugs and alcohol.",
      "content": "Stay away from drugs and alcohol. Increased substance abuse often occurs when someone is experiencing a break-up. [19] X Research source But relying on alcohol or drugs will only cause new problems for you."
    },
    {
      "title": "Take your time to figure out what happened.",
      "content": "Take your time to figure out what happened. While your friends might advise you to get over a relationship quickly by finding someone new, you’re better off taking time to understand what went wrong first. Talk to a counselor or trusted, mature friend about the relationship and how it ended. [20] X Research source"
    }
  ]
}