{
  "url": "https://www.wikihow.com/Call-Mexico-from-the-United-States",
  "title": "How to Dial Mexico from the USA: Everything You Need to Know",
  "steps": [
    {
      "title": "Enter 011 (landline) or dial + (mobile).",
      "content": "Enter 011 (landline) or dial + (mobile). The exit code you enter will be a little different depending on whether you're calling Mexico from a landline or your mobile phone. [1] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source If you're using a landline, you will need to dial 011 (the United States exit code). If you're calling from a cell phone, dial + , which shares a key with 0 on most phones. You will be able to dial any foreign number after you dial 011 or + , including Mexico."
    },
    {
      "title": "Enter Mexico's international calling code 52.",
      "content": "Enter Mexico's international calling code 52 . After the exit code, enter 52 to call Mexico. You can call any landline or cell phone in Mexico with this code. [2] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source"
    },
    {
      "title": "Enter the area code.",
      "content": "Enter the area code. Mexican phone numbers are 10 digits long, beginning with a two or 3-digit area code. For example, 55 is the area code for Mexico City, and 444 is the area code for Acapulco. If you don't have the area code of the city or region in Mexico you're trying to call, check out our Mexican area code list . If you see the prefix 01, 044, or 045 in front of the area code of the number you want to call, don't dial it. These trunk codes were only to be used when calling within Mexico, and have been dropped altogether as of 2019."
    },
    {
      "title": "Dial the 7 to 8-digit phone number.",
      "content": "Dial the 7 to 8-digit phone number. Altogether, the number you enter after the country code should be 10 digits long. Once you have entered all the digits, your phone will dial Mexico (if you're using a landline). If you're using a mobile phone, press the Call button or phone icon to place the call. Some phone carriers give the option to block international calls, so if your call does not go through, make sure you are capable of making international calls from your phone."
    },
    {
      "title": "Check with your phone provider for current rates.",
      "content": "Check with your phone provider for current rates. Many mobile phone providers, including T-Mobile and AT&T, offer free calls to Mexico and Canada from the United States with certain plans. [4] X Research source If free calls to Mexico aren't included in your plan, you may be able to add an unlimited international calling feature for an affordable rate—much more affordable than paying by the minute with a calling card. Most US-based landline phone providers, including Verizon, Vonage, and Spectrum, offer affordable packages with unlimited calls to Mexico."
    },
    {
      "title": "Use Viber, Google Voice, or other VoIP apps to call and text phones in Mexico.",
      "content": "Use Viber, Google Voice, or other VoIP apps to call and text phones in Mexico. You can call landlines and cell phones directly from these apps, even if the person you're calling doesn't have them. However, if both you and the person you're calling both have internet connections, you can also use these apps and more to talk on the phone for free. On Viber , you can buy credits to call Mexico for as low as 1.8 cents per minute (mobile numbers) or 1.2 cents per minute (landline numbers). Alternatively, you can opt for their $5.99 unlimited plan. [5] X Research source Google Voice advertises rates of $.01 per minute to call landlines in Mexico. While they previously listed a $.02 to call cell phones in Mexico, they do not currently list a mobile rate. [6] X Research source"
    },
    {
      "title": "Buy voice credit online to call Mexico.",
      "content": "Buy voice credit online to call Mexico. There are companies that provide transparent policies, inexpensive rates, and easy-to-use services that allow you to call Mexico from your cell phone or landline. Simply search online using terms like \"buy credit to call Mexico.\" Once you do, sign up, download an app on your computer or smartphone, and buy credit for as little as $5. These services often have much more transparent policies and fees and cost less than calling cards."
    },
    {
      "title": "Avoid using calling cards.",
      "content": "Avoid using calling cards. The majority of international calling cards have unclear terms and fees. It is more affordable to use web-based calling like Google Voice or to buy phone credit through an online company because the services are less costly and more transparent. [7] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source If you do have to use calling cards, use cards with lower cost-per-minute rates and an inexpensive connection fee unless you will be using all of your minutes in one phone call. Find cards that advertise specifically for Mexico. These cards can be less expensive than buying general international calling cards. Buy cards from stores that let you look at the card before you buy it. Check to see what the rates are and whether there are service fees. Compare cards and find the best deal for your needs."
    },
    {
      "title": "WhatsApp",
      "content": "WhatsApp WhatsApp , an app you may already use to chat with international friends and family members, makes it easy to place free voice and video calls from the United States to Mexico over the internet. Both you and the person you're calling will need to install WhatsApp on your phones, and then add each other to your contact lists."
    },
    {
      "title": "Facebook Messenger",
      "content": "Facebook Messenger If you and the person you're calling in Mexico have Facebook accounts, you can use the Messenger app on your computer, phone, or tablet to call each other for free. Messenger also makes it easy to invite other people to join in on your call, which can be great for family conversations."
    },
    {
      "title": "FaceTime",
      "content": "FaceTime If you have an iPhone, iPad, or Mac, you can use FaceTime to place free international calls with video to Mexico. Even if the person you're calling doesn't have an Apple device, you can send them a FaceTime join link they can use on their Android or computer as long as they have internet access. [8] X Research source"
    },
    {
      "title": "Why can't I call Mexico from the US?",
      "content": "Why can't I call Mexico from the US? Make sure you have international calling on your phone plan. Whether you're calling Mexico from a United States-based cell phone or landline, you must have international calling enabled on your phone plan to place a call to Mexico."
    },
    {
      "title": "Can the US call Mexico for free?",
      "content": "Can the US call Mexico for free? Even though Mexico and the United States are adjacent, calling Mexico from the US is still considered long distance, thus not always free. However, you can call Mexico for free over the internet using apps like WhatsApp and Viber, though both you and the person you're calling will need internet access."
    },
    {
      "title": "Can I call Mexico with Google Voice?",
      "content": "Can I call Mexico with Google Voice? You can call Mexico using Google Voice from the United States. However, you can't sign up for Google Voice if you created your Google account in Mexico–if you're in the United States but were living in Mexico when you created your Google account, you won't be able to use Google Voice. [9] X Research source"
    },
    {
      "title": "What is an example of a Mexican phone number?",
      "content": "What is an example of a Mexican phone number? If you want to call Costco in Tijuana from a United States cell phone, you'd dial +52 664 633 3555. To call from a landline, you'd dial 011 52 664 633 3555."
    },
    {
      "title": "Find the area code for the city, town, or region you are calling.",
      "content": "Find the area code for the city, town, or region you are calling. Area codes in Mexico are 2-3 digits. [10] X Research source Acapulco - 744 Aguascalientes (state) - 449, 458, 465, 495, 496 Baja California (state) - 616, 646, 653, 658, 661, 663, 664, 665, 686 Baja California Sur (state) - 612, 613, 615, 624 Cabo San Lucas - 624 Campeche (state) - 913, 938, 981, 982, 983, 996 Cancún - 998 Celaya - 461 Chiapas (state) - 916, 917, 918, 919, 932, 934, 961, 962, 963, 964, 965, 966, 967, 968, 992, 994 Chihuahua (state) - 614, 621, 625, 626, 627, 628, 629, 635, 636, 639, 648, 649, 652, 656, 657, 659 Cd. Lazaro. Cardenas - 753 Cd. Oregon - 644 Cd. Sahagun - 791 Cd. Valles - 481 Cd. Victoria - 834 Coahuila (state) - 671, 842, 844, 861, 862, 864, 866, 867, 869, 871, 872, 873, 877, 878 Coatzacoalcos - 921 Colima (state) - 312, 313, 314 Cuernavaca - 777 Culiacan - 667 Chetumal - 983 Chihuahua (state) - 614, 621, 625, 626, 627, 628, 629, 635, 636, 639, 648, 649, 652, 656, 657, 659 Chilpancingo - 747 Durango (state) - 618, 629, 649, 671, 674, 675, 676, 677, 871, 872 Fresnillo - 493 Guadalajara - 33 Guadalupe Victoria - 676 Guamuchil - 673 Guanajuato (state) - 352, 411, 412, 413, 415, 417, 418, 419, 421, 428, 429, 432, 438, 442, 445, 456, 461, 462, 464, 466, 468, 469, 472, 473, 476, 477, 479 Guasave - 687 Guaymas - 622 Guererro (state) - 721, 727, 732, 733, 736, 741, 742, 744, 745, 747, 753, 754, 755, 756, 757, 758, 762, 767, 781 Hermosillo - 662 Hildalgo (state) - 441, 483, 591, 738, 743, 746, 748, 759, 761, 763, 771, 772, 773, 774, 775, 776, 778, 779, 789, 791 Huatabampo - 647 Iguala - 733 Isla Mujeres - 998 Ixtapan de la Sal - 721 Jalapa - 228 Jalisco (state) - 33, 312, 315, 316, 317, 321, 322, 326, 341, 342, 343, 344, 345, 346, 347, 348, 349, 354, 357, 358, 371, 372, 373, 374, 375, 376, 377, 378, 382, 384, 385, 386, 387, 388, 391, 392, 393, 395, 424, 431, 437, 457, 474, 475, 495, 496, 499 Juarez - 656 La Paz - 612 Leon - 477 Manzanillo - 314 Maravatio - 447 Matamoros - 868 Mazatlan - 669 Mérida - 999 Mexicali - 686 México (state) - 55, 56, 427, 588, 591, 592, 593, 594, 595, 596, 597, 599, 711, 712, 713, 714, 716, 717, 718, 719, 721, 722, 723, 724, 725, 726, 728, 729, 743, 751, 761, 767 Mexico City - 55, 56 Michoacán (state) - 313, 328, 351, 352, 353, 354, 355, 356, 359, 381, 383, 393, 394, 421, 422, 423, 424, 425, 426, 434, 435, 436, 438, 443, 447, 451, 452, 453, 454, 455, 459, 471, 711, 715, 753, 767, 786 Minatitlan - 922 Monclova - 866 Monterrey - 81 Morelia - 443 Morelos (state) - 731, 734, 735, 737, 739, 751, 769, 777 Nayarit (state) - 311, 319, 322, 323, 324, 325, 327, 329, 389, 437 Nuevo Laredo - 867 Nuevo León (state) - 81, 488, 821, 823, 824, 825, 826, 828, 829, 867, 873, 892 Oaxaca (state) - 236, 274, 281, 283, 287, 741, 757, 924, 951, 953, 954, 958, 971, 972, 994, 995 Orizaba - 272 Pachuca - 771 Patzcuaro - 434 Poza Rica - 782 Puebla (state) - 220, 221, 222, 223, 224, 226, 227, 231, 232, 233, 236, 237, 238, 243, 244, 245, 248, 249, 273, 275, 276, 278, 282, 746, 764, 776, 797, 953 Puerto Vallarta - 322 Querétaro (state) - 414, 419, 427, 441, 442, 446, 448, 487 Quintana Roo (state) - 983, 984, 987, 997, 998 Saltillo - 844 San Felipe - 686 San Luis Potosí (city) - 440 San Luis Potosí (state) - 440, 444, 458, 481, 482, 483, 485, 486, 487, 488, 489, 496, 845 Sinaloa (state) - 667, 668, 669, 672, 673, 687, 694, 695, 696, 697, 698 Sonora (state) - 622, 623, 631, 632, 633, 634, 637, 638, 641, 642, 643, 644, 645, 647, 651, 653, 662 Tabasco (state) - 913, 914, 917, 923, 932, 933, 934, 936, 937, 993 Tamalpais (state) - 482, 831, 832, 833, 834, 835, 836, 841, 867, 868, 891, 894, 897, 899 Tampico - 833 Tapachula - 962 Taxco - 762 Tehuacan - 238 Tepic - 311 Tequisquiapan - 414 Texcoco - 595 Teziutlan - 231 Tijuana - 664 Tlaxcala (city) - 246 Tlaxcala (state) - 222, 223, 241, 246, 247, 248, 276, 748, 749 Toluca - 722 Torreon - 871 Tulancingo - 775 Tuxpan - 783 Tuxtla Gutierrez - 961 Valle de Bravo - 726 Veracruz (state) - 225, 226, 228, 229, 232, 235, 271, 272, 273, 274, 278, 279, 282, 283, 284, 285, 287, 288, 294, 296, 297, 489, 746, 765, 766, 768, 774, 782, 783, 784, 785, 789, 833, 846, 921, 922, 923, 924 Veracruz (city) - 229 Villahermosa - 993 Yucatán (state) - 969, 985, 986, 988, 990, 991, 997, 999 Zacatecas (city) - 492 Zacatecas (state) - 346, 433, 437, 457, 458, 463, 467, 478, 492, 493, 494, 496, 498, 499, 842"
    }
  ]
}