{
  "url": "https://www.wikihow.com/Complete-Fafsa-Without-Your-Parents",
  "title": "How to Complete Fafsa Without Your Parents",
  "steps": [
    {
      "title": "Select “I am unable to provide information about my parent(s).”",
      "content": "Select “I am unable to provide information about my parent(s).” You’ll see it when the FAFSA form asks you to fill out your information about your legal guardian(s). If you’re using the mystudentAID app, click on “learn more” to select this option. [1] X Research source"
    },
    {
      "title": "Choose a special circumstance option.",
      "content": "Choose a special circumstance option. Read through all the info about special circumstances, then pick the one that pertains to your situation. If your parents are incarcerated, if you left home due to an abusive environment, if you don’t know where your parents are, or if you’re between the ages of 21 and 23 and you’re at-risk of being homeless, you can submit your FAFSA without a parent’s tax return. [2] X Research source If you do submit your FAFSA form without a tax return, it won’t be fully processed. You need to talk to the financial aid office of the school you’re attending to figure out your next steps. If you don’t qualify for a special circumstance (if your parents just refuse to give you their tax information), you can still submit your FAFSA form. However, you won’t be eligible for federal aid, just subsidized loans."
    },
    {
      "title": "If your parents are no longer supporting you, you’re independent.",
      "content": "If your parents are no longer supporting you, you’re independent. To qualify as an independent, you can either be: 24 years or older, married, a graduate or professional student, a veteran, a member of the armed forces, an orphan, a ward of the court, or an emancipated minor. [3] X Research source You may also qualify as an independent if you’re homeless or at risk of being homeless. The FAFSA form will ask you these questions to help you determine whether you qualify as an independent or not."
    },
    {
      "title": "If your parents don’t have an SSN, enter all zeros into the field.",
      "content": "If your parents don’t have an SSN, enter all zeros into the field. Even if they have a Taxpayer ID Number, just enter zeros. Your parents won’t be able to make an FSA ID, so you’ll need to print out the last page of the FAFSA form, have them sign it, then mail it in. [4] X Research source"
    },
    {
      "title": "If your parents don’t file taxes, select “Not going to file.”",
      "content": "If your parents don’t file taxes, select “Not going to file.” The FAFSA form will ask if your parents have filed or not. Once you select that, you can enter in information about how much your parents earned instead of specific tax form information. [5] X Research source"
    },
    {
      "title": "You need to be 24 years or older.",
      "content": "You need to be 24 years or older. If you’re 24 already or you’re turning 24 by January 1st of the school year you’re applying for, you can submit your form as an independent. You won’t need to include information about your parents on the FAFSA form. [6] X Research source For example, if you’re applying to start school in August of 2021, you must be at least 24 years old by January 1st, 2021."
    }
  ]
}