{
  "url": "https://www.wikihow.com/Ask-Your-Boss-for-a-Letter-of-Recommendation",
  "title": "How to Ask Your Boss for a Letter of Recommendation",
  "steps": [
    {
      "title": "Ask well in advance.",
      "content": "Ask well in advance. Employers tend to be busy, and will likely answer with a polite “no” if you ask them to write a letter only a couple of days before it’s due. Ask your boss for a letter of recommendation at least two or three months in advance, so that they’ll have enough time to reflect on your work and can write a thoughtful letter that isn’t rushed. [1] X Research source If you’ll be leaving the company to seek further employment, and would like a letter of recommendation from your boss, consider asking up to six months in advance. This will give your boss enough time to look for a suitable replacement."
    },
    {
      "title": "Make your request at an opportune moment.",
      "content": "Make your request at an opportune moment. Even if you’re asking for a letter of recommendation well in advance, it would be unwise to present your question to your boss when there’s a looming deadline, or in the middle of an office crisis. Time your request so that you’re asking during a period of relative calm. [2] X Research source For example, if you’re in the middle of a project, wait until you’ve completed the work. Then, when asking your boss for the letter, mention the hard work that you put into the project."
    },
    {
      "title": "Ask to meet in person.",
      "content": "Ask to meet in person. Ask your supervisor if they have time to meet with you face-to-face during the next week or two. [3] X Research source Let your boss pick the time and date, and if your boss is curious as to why you’re asking to meet, you can say something brief, like “I’d like to ask you for a professional favor.” It’s always wise to ask for a letter of recommendation in person; asking via email can seem impersonal or distant. That said, if you or your boss are traveling for a long period of time, or if the letter is time-sensitive, you can ask via email if necessary."
    },
    {
      "title": "Make your request direct and clear.",
      "content": "Make your request direct and clear. There’s no reason to be subtle or ambiguous when asking for a letter. If you’re meeting face-to-face, speak clearly and confidently: ask if your boss will write you a letter of recommendation, explain the context for which you need the letter, and give the date by which you’ll need the letter in hand. For example, say something like: “I’m applying to graduate school, and hoping to begin next fall. I know the letters of recommendation will carry a lot of weight with the selection committee and, since you’ve been my supervisor for several years, I’d appreciate if you would write a letter recommending me on the strength of my work and my work ethic.”"
    },
    {
      "title": "Present your request positively.",
      "content": "Present your request positively. Your boss may be disappointed to find out that they’re losing an employee, especially if you’re requesting the letter of recommendation to apply to a different company. So, frame the request in a positive light: remind your boss of the good work you’ve done at the company, and make it clear that the recommendation will help you advance your career. [4] X Research source Say something like, “I’ve enjoyed my 10 years of work here, and during that time I feel that I’ve contributed valuable work to the company. I’ve decided to advance my career by applying for a position at XYZ Company. Would you be willing to write me a letter of recommendation for the new position?”"
    },
    {
      "title": "Explain to your boss why you’re asking them.",
      "content": "Explain to your boss why you’re asking them. Regardless of the context in which you’re asking for a letter of recommendation (e.g. housing application, volunteer position, or new job), your boss will need to know why you’re asking them specifically. When making your request, use specific language so your boss understands why you want their letter of recommendation. For example, say: [5] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source “I’d like you to write this letter because I think you have a good understanding of my work ethic and how much I devote myself to projects and assignments that come my way.” “A recommendation from you would show my new supervisor that I get along well with people in management and can follow directions well.”"
    },
    {
      "title": "Provide a loose template.",
      "content": "Provide a loose template. “Letter of recommendation” can be a broad category, so in order to make the task easier on your boss—and in order to receive a better letter—provide them with some specifics about what you’d like them to mention in the letter. You don’t want to come across as singing your own praises or trying to write the letter for them. But, by giving your boss an idea of the template the letter could follow, you’ll make their task easier and receive a better letter. [6] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source For example, say something like: “I’d appreciate if you mentioned early in the letter that we’ve worked together for 10 years; that should give your endorsement more authority.” “Since this is for a housing application, it would help if you mentioned my ability to keep my workspace clean and to meet financial deadlines.”"
    },
    {
      "title": "Confirm that your boss will give you a positive recommendation.",
      "content": "Confirm that your boss will give you a positive recommendation. Even if your boss agrees to write you a letter, you should double-check to make sure that the letter will describe you as a strong candidate for the job, volunteer position, or housing situation that you’re applying for. If you don’t, you run the risk of finding out after the fact that your boss gave you a negative or lukewarm recommendation. [7] X Research source Say something like, “I just wanted to make sure that the letter you’re going to write will be a strong endorsement of me and not contain negative information.”"
    },
    {
      "title": "Provide your boss with the necessary documents.",
      "content": "Provide your boss with the necessary documents. In order to write a convincing and detailed letter of recommendation, your boss will need information and documents regarding your professional achievements. Send your boss a copy of your CV or résumé, an example of recent work that you’ve produced, and details about the position or program that you’re applying to. Also be ready to refresh your boss’s memory regarding details work you’ve done in your current position. Most supervisors manage many employees, and will need reminding about specifics of work that individuals have performed. [8] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Allow your boss to say “no”.",
      "content": "Allow your boss to say “no”. Despite your best efforts, your supervisor may decline to write you a letter of recommendation. This could be because they’re unhappy that you’re leaving to pursue a different job or have been dissatisfied with your performance at work, among other reasons. While you’re welcome to inquire as to your boss’s reasoning, you should not attempt to convince or cajole them into writing the letter. [9] X Research source If your boss declines (whether over email or face-to-face) to write you a letter, remain polite and do not become angry. Say something brief, such as: “I understand your reason for declining. Thank you for at least considering my request.”"
    }
  ]
}