{
  "url": "https://www.wikihow.com/Charge-NiMH-Batteries",
  "title": "How to Charge NiMH Batteries",
  "steps": [
    {
      "title": "Get a smart charger made for NiMH batteries.",
      "content": "Get a smart charger made for NiMH batteries. Avoid using chargers that aren’t specifically made for NiMH batteries since you could accidentally overcharge them. Instead, find a smart charger that has a microprocessor and thermistor, which are used to detect the battery’s capacity and temperature while it’s charging. You can get chargers with a set or adjustable current outputs. Check local electronics or hobbyist stores to see what chargers they have available. [1] X Research source NiMH battery chargers usually cost between $20–30 USD."
    },
    {
      "title": "Take the battery out of the device.",
      "content": "Take the battery out of the device. Look for the slot or compartment on your device that contains the battery or battery pack and remove the cover panel. If the batteries are standard sizes, simply pop them out from the compartment by hand. If you have a larger battery pack, you may need to unplug wires connecting to the device first. [2] X Research source You may need a screwdriver to access the battery compartment depending on the device. If you aren’t sure how to access the battery in your device, check the instruction manual."
    },
    {
      "title": "Find the capacity printed on the battery.",
      "content": "Find the capacity printed on the battery. Take the battery out of the device whenever you’re going to charge it. Check the battery for a number labeled in milliamp-hours (mAh) to find your battery’s total capacity. If you can’t find the capacity listed on the battery, check the packaging or search for the brand and size online so you can find out. [3] X Research source Rechargeable batteries slowly lose capacity the more you use them, but your charger will still be able to detect the maximum charge it can hold."
    },
    {
      "title": "Slot or plug the batteries into the charger.",
      "content": "Slot or plug the batteries into the charger. If you have standard size batteries, such as AA, AAA, or D, look for the slot of the same size on the charger. Push the negative end against the spring so the positive terminal presses against the other side of the slot. If you have a battery pack with wires, plug it into the port on the side of the charger. [4] X Research source"
    },
    {
      "title": "Charge the battery at C/10 for the safest and slowest option.",
      "content": "Charge the battery at C/10 for the safest and slowest option. Divide the battery’s capacity by 10 to find the safest C-rate, which is the charger’s output in milliamps (mA). Use a charger that has that set energy output, or use the buttons to adjust the output level. Leave the battery connected to the charger alone overnight. While it will take the longest for your battery to fully charge, it’s less likely to overheat or break since there isn’t a strong current flowing through it. For example, if you have a battery with a 2,400 mAh capacity, then you would use a 240 mA C-rate on your charger. Don’t charge your batteries in parallel since the current won’t be distributed evenly. [5] X Research source"
    },
    {
      "title": "Use a charger with a timer and at a C/3.33 rate for a fully discharged battery.",
      "content": "Use a charger with a timer and at a C/3.33 rate for a fully discharged battery. Chargers that have timers run for a set amount of time before automatically shutting off. Divide the capacity by 3.33 to find the optimal output setting for your charger. Cycle through the charger settings using the menu buttons until you reach the output you need. Once you attach your battery to the charger, leave it plugged in until the charger finishes running. Unplug the battery as soon as it’s done just in case there are any issues with the timer. [6] X Research source Avoid using a charger with only a timer if you don’t know the actual capacity of your battery since you could easily overcharge it. The timer in your charger may reset if there’s a power surge or an electrical issue."
    },
    {
      "title": "Set a 1C rate for the quickest charge.",
      "content": "Set a 1C rate for the quickest charge. Click the button’s on your charger’s output settings to change it to the same reading as your battery’s capacity. Don’t leave the battery unattended while it’s charging since it’s more likely to overheat or get damaged. Your charger will track the capacity and the temperature of your battery and stop providing a current when it’s finished. [7] X Research source Usually, charging at a 1C rate will take less than 2 hours to get a full charge."
    },
    {
      "title": "Calculate how long to leave the battery on the charger with (C x 1.2) ÷ C-rate.",
      "content": "Calculate how long to leave the battery on the charger with (C x 1.2) ÷ C-rate. Plug the battery’s capacity into the equation and multiply it by 1.2, or 120%, since NiMH batteries require more power to charge than what they output. Then divide that answer by the charger’s C-rate to find out how long it will take for your battery to fully charge. [8] X Research source For example, if you have a 1,200 MHA battery and your charger outputs 100 mA, your equation would look like: (1,200 mHa x 1.2) ÷ 100 mA. Simplify the parenthetical: (1440) ÷ 100 mA. Divide by the C-rate: 1440 ÷ 100 mA = 14.4. So it would take 14 hours to fully charge your battery."
    },
    {
      "title": "Charge your battery at room temperature.",
      "content": "Charge your battery at room temperature. If you recently used the battery and it still feels warm, allow it to cool down before you start charging it. Keep the charger and battery away from direct sunlight or heat sources since it can make the battery overheat and affect the capacity. Avoid letting the battery drop below 10 °C (50 °F), or else it won’t charge effectively."
    },
    {
      "title": "Unplug the charger as soon as your battery is finished charging.",
      "content": "Unplug the charger as soon as your battery is finished charging. Avoid overcharging your battery since it will reduce the maximum capacity and it could overheat. Keep track of how long you’ve left your battery plugged in or watch the timer on the charger so you know how much longer you need to leave it plugged in. When it’s finished, disconnect the charger from power before taking your battery out."
    },
    {
      "title": "Store your battery at room temperature with a 40% charge.",
      "content": "Store your battery at room temperature with a 40% charge. Don’t leave your battery plugged into a device because it’s more likely to discharge. If the battery has a full charge, plug it into a device and use up some of the power. Otherwise, your charger may have a discharge function to drain the battery’s capacity. Keep the battery in a cool, dry place, like a drawer, desk, or cabinet. Recharge your battery after 6 months if you haven’t used it."
    },
    {
      "title": "Recycle the battery when it stops working.",
      "content": "Recycle the battery when it stops working. Your battery will usually last through 500 charging cycles, but it may vary depending on how often you use it and the brand. When it doesn’t seem to hold a charge, contact your local waste management facility to see if you can put it in with your normal recyclables. Otherwise, you may need to go to a drop-off location to dispose of it safely. [9] X Research source Many electronics stores have battery drop-offs. Simply take your battery into the store, find the drop-off box, and put your battery inside."
    }
  ]
}