{
  "url": "https://www.wikihow.com/Be-Confident-Around-Your-Crush",
  "title": "How to Be Confident Around Your Crush",
  "steps": [
    {
      "title": "Be yourself.",
      "content": "Be yourself. If there's only one thing you do to boost your confidence, make it this. Try not to fall for the trap of changing your normal behavior to impress your crush. This is a bad idea for a few reasons. First, it puts pressure on you to be someone you're not, which can add to your stresses because it's not something you're used to. Second, it gives your crush a false idea of who you are. This can lead to confusion and hurt feelings when you drop the act. On the other hand, if you're true to yourself, you don't have to worry about keeping any lies straight. [1] X Research source This basic idea can extend to things as simple as casual conversations. For example, if your crush says that they love the movie Fight Club and you haven't seen it, don't say \"Me too!\" to try to impress. This is setting yourself up for embarrassment if, for instance, your crush asks what your favorite part is."
    },
    {
      "title": "Look your best, but don't obsess over your looks.",
      "content": "Look your best, but don't obsess over your looks. In the grand scheme of things, looks are only a single, fairly shallow part of what makes someone attracted to someone else. However, putting a little extra effort into your looks can be very useful if it helps you keep your confidence high. Consider spending a little extra time each morning putting yourself together if you know your crush is going to be around. Loving the way that you look in the mirror will help you feel positive about yourself later in the day. [2] X Research source However, you'll never want to spend too much time worrying about the way you look. Remember that your crush is most likely to like you for your personality, not the way you look. Stressing out about whether or not you look perfect will only lower your confidence and make it harder for you to act natural when you're around your crush."
    },
    {
      "title": "Use confident body language.",
      "content": "Use confident body language. The way you carry yourself can have a big effect on how confident you look — and feel. While sitting or walking, keep your shoulders back, your head slightly raised, and your chest slightly stuck out. Above all, wear a classy smile. People are generally much more likely to start conversation with people who appear friendly and open. [3] X Research source On the other hand, \"nervous\" behaviors can make you look and feel less confident. Try to avoid fiddling with your hair, biting your nails, and similar gestures. Reader Poll: We asked 1670 wikiHow readers, and 67% of them agreed that the best way to look confident around your crush is by making eye contact and smiling. [Take Poll]"
    },
    {
      "title": "Think of him as an ordinary person (not an idol).",
      "content": "Think of him as an ordinary person (not an idol). When you're absolutely infatuated with someone, it's easy to forget that they're an ordinary person. In addition to the things that make them amazing, crushes have flaws, fears, and insecurities just like you do. They are complex, imperfect people, so don't think of them like movie stars or royalty. Instead, try to think of them the same way you'd think of any casual acquaintance. [4] X Research source This is especially important if you eventually start a relationship with this person. Sooner or later, if you spend enough time together, you will find things about each other that you don't like. This can be a very unpleasant realization if you have the idea that your significant other is perfect."
    },
    {
      "title": "Don't over-think things.",
      "content": "Don't over-think things. Scrutinizing every single action that you make around your crush (or that your crush makes around you) is a sure fire way to turn yourself into a nervous wreck. Odds are that you don't always choose the perfect thing to say or do when you're around your friends and family, so there's no reason to worry about this when you're with your crush. Ironically, stressing out about every single thing that happens just makes it more likely that you'll make a mistake, so stay cool! If, during a conversation, you find yourself thinking, \"Oh my gosh, why did I just say that?\", relax. Most minor mistakes will go completely unnoticed. If they don't, your crush may even find them amusing. Most people won't get offended or angry over a minor slip-up. Besides, if they do, they aren't good crush material."
    },
    {
      "title": "Flirt a little to test the waters.",
      "content": "Flirt a little to test the waters. Flirting is a great way to judge whether your crush is reciprocating your feelings. There are many different ways to flirt. For example, you can try gently teasing your crush about a mistake, as long as you keep things good-natured. You might also try delivering a suave compliment or making a subtle innuendo while you're talking with each other. Touch is also a good idea — try reaching out and touching your crush's shoulder when s/he says something that makes you laugh, for instance. If your crush goes along with your flirting or returns it, this is a good sign. See our flirting article for many more tips."
    },
    {
      "title": "Spend a little time with each other before you make any decisions.",
      "content": "Spend a little time with each other before you make any decisions. Crushes aren't always logical. If you're captivated by someone's looks and confidence, you may get a crush for this person before you have a good idea of who this person is. You don't want to make a move on someone only to find out later that you're not actually attracted to this person, so try to spend at least a little time together (alone or in groups) before you take the plunge. If you're nervous about spending casual time with your crush, pick activities that you know you're good at. Your natural confidence will make it easier to keep your cool while you're interacting. For example, if you're good at tennis, you might challenge your crush to a few friendly volleys."
    },
    {
      "title": "Be direct with your intentions, but keep things casual.",
      "content": "Be direct with your intentions, but keep things casual. No matter how confident you are, asking a crush out can cause some major butterflies. A good way to \"defuse\" the situation is to make your request a casual one. This takes some of the pressure off — your crush isn't deciding whether to express his or her undying love for you, just deciding whether to spend a little time together. You don't even have to bring up the idea of romance yet. For instance, you might simply ask your crush, \"Hey, do you want to go get some Mexican food after school?\" If you hit things off on your first hang-out session, then you can start hinting that you'd like to be more than friends."
    },
    {
      "title": "Don't put too much weight in your crush's reply.",
      "content": "Don't put too much weight in your crush's reply. Crushes aren't the end of the world. Try not to let yourself get too invested in the outcome of asking your crush out. For one, a \"no\" may have nothing to do with you — there may simply be other commitments that make romance impossible. More important, though, is the fact that one person's opinion of you doesn't matter. Crushes come and go, so don't let one determine how you feel about yourself. [5] X Research source"
    }
  ]
}