{
  "url": "https://www.wikihow.com/Clean-Sliding-Glass-Door-Tracks",
  "title": "How to Clean Sliding Glass Door Tracks",
  "steps": [
    {
      "title": "Open the door and vacuum the tracks.",
      "content": "Open the door and vacuum the tracks. Use a vacuum attachment to reach into the corners of the tracks. Try to lift up any larger pieces of dirt or debris so that it's easier to complete the rest of the cleaning."
    },
    {
      "title": "Mix 1 cup (240 ml) of water with a drop of nonabrasive cleaner.",
      "content": "Mix 1 cup (240 ml) of water with a drop of nonabrasive cleaner. Put a couple drops of cleaner, such as Murphy Soap, denatured alcohol, or dish soap, into a bucket with a cup of warm water. Mix the solution together. [1] X Research source"
    },
    {
      "title": "Scrub the tracks with a wire brush and cleaning solution.",
      "content": "Scrub the tracks with a wire brush and cleaning solution. If you don't have a wire brush, you can use a toothbrush instead. Dip the brush into the solution and scrub on the inside of the tracks. Work your way from one side of the tracks to the other and concentrate on problem areas where there is stuck-on dirt. [2] X Research source"
    },
    {
      "title": "Wipe down the tracks with a rag or paper towels.",
      "content": "Wipe down the tracks with a rag or paper towels. Once you've scrubbed the tracks, wipe them down with a paper towel or dry rag. Remove any traces of dirt in the tracks. [3] X Research source"
    },
    {
      "title": "Close the door and vacuum and scrub the other door's tracks.",
      "content": "Close the door and vacuum and scrub the other door's tracks. Slide the door closed and vacuum and scrub the other door's tracks to complete the cleaning. Once you're done, your tracks should be cleaner. [4] X Research source"
    },
    {
      "title": "Clean your tracks once a week to keep your doors running smoothly.",
      "content": "Clean your tracks once a week to keep your doors running smoothly. A simple cleaning once a week will help keep dirt and grime out of your tracks and will keep your door working smoothly. Don't let dirt build up in your tracks."
    },
    {
      "title": "Mix equal parts of cold water and white vinegar in a spray bottle.",
      "content": "Mix equal parts of cold water and white vinegar in a spray bottle. Shake the bottle after you fill it with the vinegar and water to mix it together. This will act as your cleaning solution."
    },
    {
      "title": "Open your door and sprinkle baking soda onto the tracks.",
      "content": "Open your door and sprinkle baking soda onto the tracks. Sprinkle extra baking soda onto areas that have a lot of dirt buildup. Continue to sprinkle the baking soda until you've covered all the dirt."
    },
    {
      "title": "Spray the tracks with the vinegar solution and let it fizz.",
      "content": "Spray the tracks with the vinegar solution and let it fizz. Soak the entire track in the vinegar solution. Let the solution fizz for 5-10 minutes. This will help pull up stubborn dirt and grime."
    },
    {
      "title": "Scrub the area down with a toothbrush or wire brush.",
      "content": "Scrub the area down with a toothbrush or wire brush. Use a wire brush or toothbrush to remove the grime that may have built up on the tracks. Start on one side of the tracks and work your way to the other side. The solution should have loosened up the dirt, making it easier to clean."
    },
    {
      "title": "Wipe down the area with paper towels or a rag.",
      "content": "Wipe down the area with paper towels or a rag. Use the rag to lift up excess dirt and grime. Spray the tracks with more of the vinegar solution if they are still dirty. Continue to scrub the tracks from one side to the other until all of the dirt is removed."
    },
    {
      "title": "Open the door and repeat the process on the other side.",
      "content": "Open the door and repeat the process on the other side. Slide the door open and apply baking soda to the area that you didn't cover. Repeat the process and clean the area down with the vinegar and water solution. Once you wipe it dry, your tracks should be clean. [5] X Research source"
    },
    {
      "title": "Spray a silicone lubricant onto the tracks.",
      "content": "Spray a silicone lubricant onto the tracks. It's important that you clean your tracks first before you lubricate them. You can purchase a silicone lubricant online or at a department store. Point the end of the nozzle towards the tracks and pull the trigger to spray the lubricant into the tracks. [6] X Research source"
    },
    {
      "title": "Wipe down the tracks with a dry rag.",
      "content": "Wipe down the tracks with a dry rag. Once you're done spraying the tracks, wipe down the excess lubricant with a rag. This will also help spread the lubricant so that it's equally distributed on your tracks. [7] X Research source"
    },
    {
      "title": "Spray lubricant into the hole on the edge of the door.",
      "content": "Spray lubricant into the hole on the edge of the door. Your sliding glass will probably have a hole on the side. Look for the hole in the door over the tracks or on the inside of the door. Place the straw attached to the lubricant into the hole and press the trigger. This will lubricate the wheels that are inside of your door. [8] X Research source"
    },
    {
      "title": "Open and close the door several times to break it in.",
      "content": "Open and close the door several times to break it in. Sliding the door back and forth 5-10 times will help lubricate the wheels attached to the door. [9] X Research source"
    },
    {
      "title": "Lubricate your tracks once every 2 months to keep it working smoothly.",
      "content": "Lubricate your tracks once every 2 months to keep it working smoothly. If you notice that your tracks are sticking, lubricating them should help loosen them up. Regular maintenance will prevent this from happening altogether."
    }
  ]
}