{
  "url": "https://www.wikihow.com/Adjust-the-Fill-Valve-on-a-Toilet",
  "title": "How to Adjust 3 Kinds of Fill Valves on a Toilet",
  "steps": [
    {
      "title": "Check the flush valve or tank for the proper water level height.",
      "content": "Check the flush valve or tank for the proper water level height. Look for the water level line on the flush valve, which is the vertical pipe where water flows out if it gets too high. Compare it with the actual water level to see if it’s higher or lower than the line. If the toilet is always running, the water level is too high and you’ll notice it pouring into the flush valve. If there isn’t a water line indicator on the valve and your toilet ran well in the past, check the walls on the inside of the tank for calcium buildup and water stains. These signal where the water normally sits and you can easily compare it to the water level. If you want to mark a fill line on the valve, mark the location where the water should be with electrical tape after drying the spot with a clean towel."
    },
    {
      "title": "Check if you have a ballcock, float-cup, or internal fill valve.",
      "content": "Check if you have a ballcock, float-cup, or internal fill valve. The fill valve is usually on the left side of the tank next to the toilet flapper. There are 3 main types of fill valves and they all operate and adjust a little differently. If you don’t see a ballcock, you have a newer fill valve, usually called a tube valve or a floatless valve. Inspect your tank to see what kind of fill valve you have. [1] X Research source Ballcock fill valves have a rubber ball on a rod that floats on top of the water. When water fills the tank, the ball raises until it shuts the water off by sliding a cover over the valve. Float-cup fill valves have a cylindrical cup that slides up and down on a pipe. The cup floats on the surface and shuts the valve when the tank is full. Internal fill valves have a large plastic top and a cylindrical bottom. The float is inside the vertical cylinder and runs more quietly than other valves."
    },
    {
      "title": "Close the water line",
      "content": "Close the water line and flush the tank to drain it. Check for a valve on the wall connected to the bottom of your toilet tank that supplies water to your toilet. Twist the valve counterclockwise until it won’t turn anymore to close it and shut off the water. Flush your toilet to empty all of the water from your tank so the valve is easier to work with. [2] X Expert Source James Schuelke Professional Plumber Expert Interview. 1 October 2019. You don’t need to turn the water off if there’s a screw on top of the fill valve connecting to the float. While the water in the toilet bowl isn’t sanitary, the water inside of your tank is fine. Don’t feel yucky or grossed out getting your hands wet in the tank!"
    },
    {
      "title": "Turn the screw on the fill valve to raise or lower the water level.",
      "content": "Turn the screw on the fill valve to raise or lower the water level. Follow the tube or metal strip connecting the ballcock to the fill valve to locate the adjustment screw. If the water level is too high, twist the screw counterclockwise with a screwdriver to lower the amount of water needed to trigger the fill valve shutoff. If the water level is too low, tighten the screw by turning it 2-3 times clockwise. [3] X Research source Position the bottom of the ballcock so it’s level with the fill line."
    },
    {
      "title": "Bend the rod up or down if the ballcock doesn’t have an adjustment screw.",
      "content": "Bend the rod up or down if the ballcock doesn’t have an adjustment screw. On an older model, the ballcock might be permanently attached. Hold onto the middle of the rod with one hand. Carefully bend the ball float up if you want to raise the water level or bend it down if you want to lower the water level in your tank. [4] X Research source This works best if the ballcock uses a metal rod. Plastic rods may break or snap instead of bending."
    },
    {
      "title": "Turn your water back on and test your tank.",
      "content": "Turn your water back on and test your tank. Turn the dial on the supply line behind your toilet counterclockwise to open the water back up. Let your tank fill up and watch the ballcock rise. When the ballcock stops moving, check to see if the water is level with the fill line. Make any additional adjustments if the water still isn’t on the line. [5] X Expert Source James Schuelke Professional Plumber Expert Interview. 1 October 2019. It may take a couple of tries to get the ballcock adjusted to the correct level."
    },
    {
      "title": "Adjust the screw on top of the float cup to raise or lower the water level.",
      "content": "Adjust the screw on top of the float cup to raise or lower the water level. Look for the plastic adjustment screw attached to the top of the metal rod and the float cup. If the water level is too high, turn the dial to the clockwise 1-2 rotations. If the water level is too low, turn the dial to the counterclockwise 1-2 rotations. The screw on top of the fill valve might be labeled “tank water” or “tank level” so it’s easy to locate."
    },
    {
      "title": "Turn your water back on and check the water level.",
      "content": "Turn your water back on and check the water level. Turn the dial on your supply line under the tank to turn the water back on. Let the tank fill with water and look to see where the water rests compared to the fill line. [6] X Expert Source James Schuelke Professional Plumber Expert Interview. 1 October 2019."
    },
    {
      "title": "Flush your toilet and make any further adjustments you need.",
      "content": "Flush your toilet and make any further adjustments you need. If the water level didn’t match up to the fill line, just flush your toilet again and turn the screw while your tank is filling up again. Only turn the screw 2–3 rotations at a time and check the water level. [7] X Research source Typically, turning the screw about 8 times will raise or lower the water level by 1 ⁄ 2 inch (1.3 cm)."
    },
    {
      "title": "Unlock the valve by turning it counterclockwise.",
      "content": "Unlock the valve by turning it counterclockwise. Hold onto the upper half of the fill valve and gently turn it. The valve will snap into the unlocked position so you can easily adjust the water level. [8] X Research source"
    },
    {
      "title": "Move the top of the valve up or down to raise or lower the water level.",
      "content": "Move the top of the valve up or down to raise or lower the water level. If you need to raise the water level in the tank, pull the top half of the fill valve up. To lower the water level, push the fill valve down. Align the water level on the fill valve with the marked line on the flush valve or toilet tank. When you’re finished, turn the valve clockwise to lock it back into place. [9] X Research source"
    },
    {
      "title": "Turn your water supply back on to fill up your tank.",
      "content": "Turn your water supply back on to fill up your tank. Open the valve behind your toilet by turning it clockwise so water fills the toilet tank again. Check that the surface of the water reaches the marked line and stays below the top opening of the flush valve. [10] X Research source"
    },
    {
      "title": "Remove the fill valve’s cap by twisting or removing the screws.",
      "content": "Remove the fill valve’s cap by twisting or removing the screws. The fill valve cap is the top plastic top of your fill valve. Remove any screws on top of the cap with a screwdriver. If the cap doesn’t have any screws, try pressing down on it and spinning the cap counterclockwise to loosen it. [11] X Research source If you have a ball float, disconnect the chain attaching it to the fill valve or unscrew it completely before trying to remove the fill valve cap."
    },
    {
      "title": "Flip the cap over and remove the rubber washer.",
      "content": "Flip the cap over and remove the rubber washer. Turn the cap upside-down, and find the rubber washer along the inside rim. Pop it out with your fingernail or pry it out with a flathead screwdriver to completely remove it. [12] X Research source The washer in your fill valve helps seal off the water when your toilet isn’t running. Every fill valve is different, but the washer is almost always a different color than the rest of the mechanism."
    },
    {
      "title": "Rinse the washer under cool water and rub it clean.",
      "content": "Rinse the washer under cool water and rub it clean. The washer collects minerals and grime as you use your toilet, so it may make your fill valve hiss after it builds up. Hold the washer under a faucet of cold water and rotate it to rinse it off completely. Rub both sides of the washer between your fingers to get any unwanted buildup off. [13] X Research source If the rubber washer is damaged, replace it with one made by the same manufacturer as the valve since the pieces aren’t universal."
    },
    {
      "title": "Put the cap on the fill valve and turn the water on to flush debris.",
      "content": "Put the cap on the fill valve and turn the water on to flush debris. Flip the cap upside-down and place it on top of the hole on top of the fill valve. Turn the valve on the wall clockwise to turn the water supply back on, and let it run for 5-6 seconds. Water will come up through the fill valve and force out any blockages or debris that was stuck inside. Keep the cup over the valve so the water doesn’t spray outside of the tank."
    },
    {
      "title": "Shut the water off quickly and reinstall the washer and cap.",
      "content": "Shut the water off quickly and reinstall the washer and cap. Twist the water valve’s knob counterclockwise again to shut it off. Put the rubber washer back into your fill valve’s cap and reinstall the cap on top where it used to be. Replace any screws that you had to remove to secure the cap to the valve. [14] X Research source Remove any debris that comes out of your fill valve before refilling the tank."
    },
    {
      "title": "Turn the water back on and refill your tank.",
      "content": "Turn the water back on and refill your tank. Once your fill valve is reassembled, turn your water back on. Once the water is flowing again, let it refill your tank completely to see if there are still any issues. Flush your toilet one more time to make sure any unwanted noises are gone and that the toilet is filling as it should. [15] X Research source If your fill valve is still acting up or making noise, you may need to replace it ."
    }
  ]
}