{
  "url": "https://www.wikihow.com/Block-No-Caller-ID",
  "title": "How to Block No Caller ID Calls & Hide Your Own",
  "steps": [
    {
      "title": "Silence unknown callers in settings.",
      "content": "Silence unknown callers in settings. While you can’t officially “block” all no caller ID calls on iPhone, silencing them sends them directly to voicemail so the notifications don’t disturb you. [1] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source Go to “Settings,” then click “Phone.” Scroll down until you find “Silence Unknown Callers” and click the button to enable it. Similarly, stop no caller ID calls by using “Do Not Disturb.” Go into your “Do Not Disturb” settings, click “People” under “Allowed Notifications,” then select “All Contacts” under “Calls From.” This means you’ll only receive call notifications from people in your contacts."
    },
    {
      "title": "Make a fake contact for no caller ID calls.",
      "content": "Make a fake contact for no caller ID calls. Open your contacts and click the plus (+) icon to create a new contact. In the “First name” field, type “No Caller ID.” Click “add phone” and enter “000 000 0000.” Tap “Done” to save the contact, then add it to your list of blocked callers. Any caller who has no caller ID info will be sent straight to voicemail. [2] X Research source To block individual numbers , tech consultant Mitch Harris says, “Tap ‘Favorites’, ‘Recents’, or ‘Voicemail’. Tap next to the number or contact you want to block, scroll down, then tap ‘Block this Caller’. Or, open ‘Contacts’, tap the contact you want to block, scroll down, then tap ‘Block this Caller.’”"
    },
    {
      "title": "Block unknown numbers in the “Phone” app.",
      "content": "Block unknown numbers in the “Phone” app. Open the “Phone” app, then access your settings by clicking the 3 dots or a gear icon. Depending on your phone, look for an option like “Block numbers” or “Caller ID & Spam.” Then, enable the setting to block calls from private or unknown numbers, usually called “Block unknown callers.” [3] X Research source"
    },
    {
      "title": "Check your phone’s manual for instructions.",
      "content": "Check your phone’s manual for instructions. There are several landline phone models and each one is different, so there isn’t one specific way to block no caller ID calls. However, many models have a “Block” button or option in the call log, so be sure to review your owner’s manual. Some also allow you to set up “Anonymous Call Rejection” through a code (*77 in the United States). [4] X Research source If you can’t find instructions in your manual, contact your service provider for assistance. To block individual spam numbers, Harris says, “Open your ‘Phone’ app, tap ‘More’, tap ‘Call History,’ tap a call from the number you want to block, [then] tap ‘Block / report spam.’”"
    },
    {
      "title": "Use a third-party call-blocking app.",
      "content": "Use a third-party call-blocking app. These apps are available for both iPhone and Android. Visit the App Store or Google Play Store and search for call-blocking apps. Be sure to check the reviews before installing one to ensure it’s reputable. Then, install and set up the app according to its instructions. [5] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source Remember, there’s always a risk when installing and using third-party apps, even if most of the reviews are positive. Be sure to do your research. These apps often offer additional features like caller ID lookup and spam detection. CTIA, a trade association representing the United State’s wireless communication industry, has compiled a list of robocall abatement apps for both iPhone and Android . There you’ll find a list of several reputable call-blocking apps, their price, and their features."
    },
    {
      "title": "Contact your phone carrier to see if they offer call-blocking features.",
      "content": "Contact your phone carrier to see if they offer call-blocking features. Many phone carriers have call-blocking features that allow you to block No Caller ID calls at the network level, meaning they won’t reach your device. Services and fees vary depending on the carrier, so be sure to contact them directly to see what they offer. [6] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source For example, AT&T offers AT&T Call Protect, Verizon offers Call Filter, and T-Mobile offers Scam Shield. These services offer free basic versions with payment options for advanced features. Depending on your carrier, it may be possible to access and set up these features by logging into your online account. Others require you to call them to set them up. Check to see which option or options your service provider allows."
    },
    {
      "title": "Report suspicious calls to the authorities.",
      "content": "Report suspicious calls to the authorities. If you’re being harassed, threatened, or suspect the calls you’re receiving are related to illegal activity, report them to your phone carrier or local authorities as soon as possible. Report scam calls to the Federal Communications Commission (FCC) or Federal Trade Commission (FTC) in the United States. [7] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source"
    },
    {
      "title": "Do not engage with potential spam calls.",
      "content": "Do not engage with potential spam calls. In general, if you receive a call from a no caller ID number and you’re not expecting a call from a business, it’s best to ignore it. If it’s from someone important, they’ll leave a message. Do not offer these calls any personal information. [8] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source Remember to check your voicemail often, especially if you silence no caller ID calls so they go straight to voicemail. Sometimes, these calls come from legitimate businesses and organizations, and you don’t want to miss an important message."
    },
    {
      "title": "Register for the National Do Not Call Registry.",
      "content": "Register for the National Do Not Call Registry. The National Do Not Call Registry lists the phone numbers of individuals who have requested not to be contacted by telemarketers. Certain companies and callers are required by federal law to respect this request. Adding your number to the registry won’t stop all no caller ID calls, but it will cut down on the amount you receive from legitimate telemarketers . Sign up by visiting the registry’s website . [9] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source"
    },
    {
      "title": "Use selective call forwarding.",
      "content": "Use selective call forwarding. Selective call forwarding is a service that allows you to choose which callers’ calls are forwarded to another number. When enabled, calls from a selected list of numbers will be rerouted to a different phone number while others will come through on your phone. This process varies depending on what phone you have and can work with both cell phones and landlines. [10] X Research source"
    },
    {
      "title": "Create a whitelist instead of blocking numbers.",
      "content": "Create a whitelist instead of blocking numbers. Creating a whitelist means you choose which phone numbers you receive calls and notifications from. On iPhone, this is the same as silencing unknown callers. On Android, open the Google Fi app, then go to “Phone Settings,” “Privacy and security,” and “Manage contact settings.” From there, turn on “Only receive calls and texts from your phone contacts.” [11] X Research source"
    },
    {
      "title": "Dial *67 before the number you want to call.",
      "content": "Dial *67 before the number you want to call. *67 is a vertical service code that allows you to hide your caller ID from the person you’re about to call. Simply dial the code and then the person’s phone number to activate the feature. This is a quick, temporary way to block your caller ID, and it works on both smartphones and landlines. [12] X Research source If you want to permanently block your number from a specific person, add them as a contact and save their number with *67 at the front. Be careful not to confuse *67 with *69, which dials your last incoming call and only works on landlines."
    },
    {
      "title": "Have your carrier put a block on your number permanently.",
      "content": "Have your carrier put a block on your number permanently. Call your phone service provider and ask them to put a block on your number. You’ll likely need to provide a reason for the change, and some companies charge a fee for the service. Make sure they fully explain the process before you agree to it. [13] X Research source"
    },
    {
      "title": "Change your smartphone’s settings, if available.",
      "content": "Change your smartphone’s settings, if available. Some phones and service providers allow you to block your number manually. Open your settings, then click “Phone.” If it’s available, click the “Show My Caller ID” option, then click the button to toggle it off. [14] X Research source This process may vary slightly depending on what type of phone you have."
    },
    {
      "title": "“No caller ID” means the caller has hidden their phone number.",
      "content": "“No caller ID” means the caller has hidden their phone number. This could be a personal decision made by an individual or a way for companies to remain anonymous and control how others use their contact information. These calls may come from legitimate callers or from scammers or stalkers to conceal their identity. [15] X Research source"
    },
    {
      "title": "“Unknown caller” means your provider can’t identify the caller.",
      "content": "“Unknown caller” means your provider can’t identify the caller. This is typically due to network issues and can even happen with people in your contact list. It may also occur when someone is trying to call you from abroad, as your service provider may not recognize a foreign caller ID due to different telecommunication systems. [16] X Research source"
    },
    {
      "title": "If you block a number, can they still call you with no caller ID?",
      "content": "If you block a number, can they still call you with no caller ID? In most cases, blocking a number prevents that specific number from contacting you regardless of if the caller ID is available. However, calls can sometimes slip through if you don’t have all no caller ID calls blocked. [17] X Research source"
    },
    {
      "title": "Does *67 still block caller ID?",
      "content": "Does *67 still block caller ID? Yes, dialing *67 before a phone number will block your caller ID from the recipient on most carriers in the United States. The person you’re calling will typically see “Blocked” or “Private” instead of your phone number. [18] X Research source"
    },
    {
      "title": "Can you trace a no caller ID call?",
      "content": "Can you trace a no caller ID call? There are a couple ways you can trace a caller ID , though it can be challenging. First, contact your phone carrier to see if they have tools or services that allow you to trace malicious calls. They may offer a feature called “Trap Call” that can reveal the number of the next no caller ID call you receive. Alternatively, file a police report if you’re receiving threatening no caller ID calls; they may be able to work with your carrier to trace them. [19] X Research source"
    },
    {
      "title": "Who calls from no caller ID?",
      "content": "Who calls from no caller ID? Practically anyone can use no caller ID, but this feature is frequently used by telemarketers, scammers, prank callers, or harassers to avoid being identified and/or blocked. Additionally, some businesses, like debt collectors or healthcare providers, may use no caller ID to protect their clients’ privacy. Private individuals may also use the feature for personal reasons. [20] X Research source"
    },
    {
      "title": "What does *57 do?",
      "content": "What does *57 do? *57 is a vertical service code that allows you to trace the last call you received, even if it was from a no caller ID. The availability of this feature varies depending on your location and phone carrier, though, so contact your carrier directly to see if it’s available in your area and what it does. [21] X Research source"
    }
  ]
}