{
  "url": "https://www.wikihow.com/Catch-a-Stray-Kitten",
  "title": "How to Catch a Stray Kitten",
  "steps": [
    {
      "title": "Use a trap.",
      "content": "Use a trap. Whether you are making a homemade trap or purchasing one, make sure that you are using one that is humane. [1] X Expert Source Carrie Seay, MS-CABAC, KPA-CTP, CBCC-KA Feline Behavior Consultant Expert Interview. 1 March 2022. You don't want to risk injuring the kitten that you are working so hard to rescue. (You also want to make sure not to injure yourself--no one wants to get their finger caught in a trap). One of the best ways to safely trap a kitten is to use food to bait the kitten into the trap. Canned fish is an effective and inexpensive food item that you could try. A humane trap is one that will not injure or kill the kitten. If you are going to purchase a trap, ask a local vet for suggestions on which brand to buy. Try shopping at your local pet store or hardware store. If you plan to make a trap, make sure you research ones that will neither harm nor kill the kitten. Use a trap door that will close gently but quickly and firmly after the kitten enters the trap. Ask for tips about materials at your neighborhood hardware store. Don't try to trap the kitten the first time you stop it. Instead, prepare your trap, and spend a few days placing food in there--while leaving the door of the cage open. That way, the kitten will begin to head into the trap willingly after it begins to associate it with food."
    },
    {
      "title": "Be compassionate.",
      "content": "Be compassionate. Above all, you want to be as kind as possible to the kitten. Remember, it doesn't have much experience with humans. Being caught is going to be a pretty traumatic experience. Be as quiet, calm, and gentle when you are near the kitten."
    },
    {
      "title": "Take a break.",
      "content": "Take a break. Catching a kitten can be a frustrating experience. You will need to be patient, not only with the kitten but with yourself. Make sure to give yourself plenty of time to carry out your plan. Remember, it's best to learn some information about the kitten (age, the status of the mom) so that alone is going to take some time. After doing that, try taking a break before you start the actual trapping process. The more relaxed and confident you are, the more smoothly the whole process will go. [2] X Research source"
    },
    {
      "title": "Lure the kitten into a confined space.",
      "content": "Lure the kitten into a confined space. If you are nervous about using a trap, don't worry, you have some other options. You can try gently \"herding\" a kitten into a confined space. Use the same method you would use if you were trying to tempt the kitten into a trap--food. Once you have the kitten corralled in a confined space (think a corner where it doesn't have an easy escape route), you can gently guide the kitten into a small pet carrier. Make sure to have a carrier (or even a box with a lid) handy before you try this method. [3] X Research source"
    },
    {
      "title": "Earn the kitten's trust.",
      "content": "Earn the kitten's trust. It is possible that you won't have to lure or trap the kitten. If you can invest enough time and patience in the process, you might be able to befriend the animal enough that you can easily transport it home with you. In order to gain the kitten's trust, be a reliable force in its life. Feed it regularly, and at the same time for several days. Be calm and gentle in its presence. [4] X Expert Source Carrie Seay, MS-CABAC, KPA-CTP, CBCC-KA Feline Behavior Consultant Expert Interview. 1 March 2022. After enough time has passed (this could be days or weeks), the kitten might gradually come to accept your presence without fear."
    },
    {
      "title": "Determine if the mother cat is nearby.",
      "content": "Determine if the mother cat is nearby. When you see a kitten who appears to be alone, your first step is to figure out if the mother cat is still in the picture. It is possible that she has abandoned her kitten, but it could also be that she is simply out hunting for food. The only way to know whether the kitten is motherless is to wait. You will need to observe the situation for more than just a few minutes. Try watching from a spot where the kitten won't notice you and be frightened away. [5] X Expert Source Carrie Seay, MS-CABAC, KPA-CTP, CBCC-KA Feline Behavior Consultant Expert Interview. 1 March 2022. Be patient--remember, you want to help the kitten, not unnecessarily remove it from its mother. Mother cats usually search for food in the mid-afternoon, while her kittens are sleeping. If you are seeing the kitten alone in the morning, it's an added sign it has been abandoned. [6] X Research source"
    },
    {
      "title": "Estimate the age of the kitten.",
      "content": "Estimate the age of the kitten. While you won't be able to get an exact number, it is very important that you attempt to figure out how old the kitten is. Mother cats usually begin to wean their litters at about 6 weeks. You'll need to know if the kitten is younger than that so that you will be prepared to care for it. There are a few ways that you should be able to get a rough estimate on the kitten's age. Kittens open their eyes at about 10 days; if their eyes are not open yet, you know you're dealing with an infant. Another good way to tell is to gauge the kitten's activity level. Typically, kittens begin to walk at about 3 weeks. If you see a kitten who seems to be able to walk and play without too much wobbling, you can be pretty sure that your kitten is at least 4 weeks old. [7] X Research source"
    },
    {
      "title": "Talk to your neighbors.",
      "content": "Talk to your neighbors. You definitely want to make sure that the kitten in question is actually a stray. Even though it is young, it could still be somebody's missing pet. Take some time to try to investigate. Chat with the people who live near you to see if they have noticed the kitten and if they have any information about where it belongs. You could also post flyers around your area, in addition to chatting face to face with your neighbors."
    },
    {
      "title": "Learn about feral cats.",
      "content": "Learn about feral cats. A stray kitten may also be called a feral (wild) cat. When you are dealing with any non-domesticated animal, you will want to be cautious. It's good to be aware that stray cats are very different from the kitties you see in a pet store or at your friend's house. They are skittish, and not used to humans. [8] X Research source Also, you can't be sure what the medical history of a stray cat is, so it's good to be a little wary (no matter how cute it is). Try calling a local vet or animal shelter to ask if they have any good information on cats living in your area."
    },
    {
      "title": "Make a plan.",
      "content": "Make a plan. Obviously, you want to do the right thing to ensure the kitten's safety. But that is going to take some consideration and planning on your part. There are several questions to ask yourself. For example, do you have the amount of time you need to do this right? Catching a stray cat can take a few days, and you will also need to schedule some time to care for the kitten after you catch it. Make sure you have all of the materials you need, and that you have contacted a vet so that you know where to take the kitten for medical care. Whether you plan to keep the kitten or find it another home, you'll want to make sure it is healthy. Make sure you've given some thoughts to the steps you'll take to catch the kitten and to handle it after you succeed. [9] X Research source"
    },
    {
      "title": "Handle the kitten carefully.",
      "content": "Handle the kitten carefully. Catching the kitten is not the end of your project. Once you have it, make sure you are prepared to handle it carefully. When dealing with the kitten, you'll want to keep a pair of gloves handy. [10] X Research source Do not handle the kitten directly until you have had it checked out by the vet. Kittens are cute and can become cuddly, but this one is still a wild animal. If one escapes from its carrier (or box, etc) you can try gently scooping it up with a towel."
    },
    {
      "title": "Try containment.",
      "content": "Try containment. The containment process is crucial when introducing a kitten to a new environment. To keep it from becoming even more traumatized, you want to introduce new things (and people, sounds, and other animals) very slowly. When you first rescue the kitten, make sure you have a safe small place to bring it. This could be a small room, such as your bathroom, or even a comfortable box where it won't be disturbed. [11] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source Make sure your kitten is comfortable in confinement. Provide it with the basics--a towel to sleep on, food, water, and somewhere to go to the bathroom (this can be a newspaper or a small litter box)."
    },
    {
      "title": "Seek medical care.",
      "content": "Seek medical care. You will definitely want to take the stray kitten to a vet in your area. Ask the vet to perform all necessary tests and vaccinations. This could get expensive, so make sure you are prepared for that. Also, remember this is very scary for the kitten, so be ready to transport it to and from the vet as carefully (and quietly) as possible. [12] X Research source You'll want to specifically make sure the vet to check for basic ailments such as worms, distemper, rabies, and respiratory problems. Also, it's a great idea to talk to the vet about having the kitten spayed or neutered. [13] X Expert Source Carrie Seay, MS-CABAC, KPA-CTP, CBCC-KA Feline Behavior Consultant Expert Interview. 1 March 2022."
    },
    {
      "title": "Find an adoptive home.",
      "content": "Find an adoptive home. The kitten is probably adorable, but you may not want to keep it, or not be able to properly care for it. The next best thing is to find it an adoptive home. If you have some time to devote to this (and want visitation rights), try checking with your friends and friends of friends. Post pictures on social media--kittens can be hard to resist! If you can't find a home on your own, contact your local animal shelter. They will be able to help you figure out a safe place for the kitten. [14] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Keep the kitten.",
      "content": "Keep the kitten. Maybe you just can't resist that sweet little face, and you've decided that the best home for the kitten is your home. That's great! Just make sure that you are prepared to be the best pet parent possible. In addition to getting all of the necessities (litter box, food, toys, any medications), you want to also be emotionally prepared. Remember that this is a big adjustment for a stray kitten, and it will take some time to adjust. Seek advice from the vet and the local shelter on how to properly bond with the kitten. Hopefully, in time, you'll have a new best friend! [15] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    }
  ]
}