{
  "url": "https://www.wikihow.com/Check-the-Event-Log-on-PC-or-Mac",
  "title": "How to Check the Event Log on PC or Mac",
  "steps": [
    {
      "title": "Open the Windows search bar.",
      "content": "Open the Windows search bar. If you see the search bar next to the menu, skip to the next step. Otherwise, press ⊞ Win + S to open it now."
    },
    {
      "title": "Type administrative into the search bar.",
      "content": "Type administrative into the search bar. A list of matching results will appear."
    },
    {
      "title": "Click Administrative Tools.",
      "content": "Click Administrative Tools . This opens an Explorer window that contains several administrative options."
    },
    {
      "title": "Double-click Event Viewer.",
      "content": "Double-click Event Viewer . It’s in the main panel. This opens the Event Viewer, where you can view different types of event logs."
    },
    {
      "title": "Click the > next to “Windows Logs.”",
      "content": "Click the > next to “Windows Logs.” It’s in the left column. A list of logs that pertain to Windows will appear."
    },
    {
      "title": "Click a log to view its contents.",
      "content": "Click a log to view its contents. The log will appear in the main panel."
    },
    {
      "title": "Open the Applications folder on your Mac.",
      "content": "Open the Applications folder on your Mac. To do this, click the Go menu and select Applications ."
    },
    {
      "title": "Double-click the Utilities folder.",
      "content": "Double-click the Utilities folder. [1] X Research source"
    },
    {
      "title": "Double-click Console.",
      "content": "Double-click Console . This opens the Console app, which is where you can view system diagnostic logs for all sorts of events."
    },
    {
      "title": "Click All Messages.",
      "content": "Click All Messages . It’s near the top-left corner of the window, right above the left column. This displays all of the messages recorded by each process."
    },
    {
      "title": "Click Errors and Faults.",
      "content": "Click Errors and Faults . It’s next to the “All Messages” button. This refines the log results so it only displays errors."
    },
    {
      "title": "Click a report under the “Reports” header.",
      "content": "Click a report under the “Reports” header. This opens reports of system or user/application events in the right panel."
    }
  ]
}