{
  "url": "https://www.wikihow.com/Clear-iCloud-Storage-on-iPhone",
  "title": "How to Clear iCloud Storage on iPhone",
  "steps": [
    {
      "title": "Open the Photos app.",
      "content": "Open the Photos app. It’s the white icon with a multicolored floral symbol inside. You’ll usually find it on the home screen."
    },
    {
      "title": "Tap Select.",
      "content": "Tap Select . It’s at the top of the screen. [1] X Research source"
    },
    {
      "title": "Tap all photos and videos you want to delete.",
      "content": "Tap all photos and videos you want to delete. This adds a blue and white check mark to the bottom-right corner of each thumbnail."
    },
    {
      "title": "Tap the trash icon.",
      "content": "Tap the trash icon. It’s at the bottom-right corner of the screen. A confirmation message will appear."
    },
    {
      "title": "Tap Delete.",
      "content": "Tap Delete . The button will actually say something like ″Delete 45 Videos″ or ″Delete 2 Photos.″ This deletes the selected media from your iCloud library, which frees up iCloud storage space."
    },
    {
      "title": "Open your iPhone’s Settings .",
      "content": "Open your iPhone’s Settings . You’ll usually find this app on your home screen."
    },
    {
      "title": "Tap your name.",
      "content": "Tap your name. It’s at the top of the menu."
    },
    {
      "title": "Tap iCloud.",
      "content": "Tap iCloud . It’s at the top of the second section. A list of apps currently syncing to your iCloud account will appear with green switches. Apps that are not syncing have white switches. Synced data can take up a lot of space in your iCloud account. If there’s anything you don’t need to sync, it’s best to disable it if space is becoming an issue."
    },
    {
      "title": "Slide an app’s switch to the Off to stop it from syncing.",
      "content": "Slide an app’s switch to the Off to stop it from syncing. A pop-up will appear."
    },
    {
      "title": "Decide what to do with the existing app data.",
      "content": "Decide what to do with the existing app data. If you want to keep the data on your iPhone, tap Keep on My iPhone . To free up space on your iPhone as well, select Delete from My iPhone . The app’s data will now be removed from iCloud. Need more advice about clearing up space on iCloud? Check out what wikiHow users say on our My iCloud storage is full. How can I free up some space? forum ."
    },
    {
      "title": "Open your iPhone’s Settings .",
      "content": "Open your iPhone’s Settings . You’ll usually find this app on the home screen. This method makes more space available on your iPhone, but may use up extra space in iCloud."
    },
    {
      "title": "Tap your name.",
      "content": "Tap your name. It’s at the top of the menu."
    },
    {
      "title": "Tap iCloud.",
      "content": "Tap iCloud . It’s at the top of the second section."
    },
    {
      "title": "Tap Photos.",
      "content": "Tap Photos . It’s the first option under ″APPS USING ICLOUD.″"
    },
    {
      "title": "Tap Optimize iPhone Storage.",
      "content": "Tap Optimize iPhone Storage . This adds a blue check mark to the option, which means that full-resolution photos and videos will now be replaced with optimized (smaller) versions, while the full-resolution versions will be saved to iCloud."
    }
  ]
}