{
  "url": "https://www.wikihow.com/Be-Successful",
  "title": "How to Be Successful",
  "steps": [
    {
      "title": "Define what success means to you.",
      "content": "Define what success means to you. You cannot have success if you do not know what it means for you. Everyone views success differently. [1] X Research source True success comes from achieving what will make you happiest in life. Once you have identified this, you can set goals that are meaningful and important to you. Try writing down your definition of success. Is it earning a certain income, living in a certain area, or supporting a happy family? Would success allow you to travel, save for retirement, or maintain a healthy social life? If you’re struggling, consider what makes you happiest in life. Is it spending time with your family, traveling, pursuing a hobby, or something else? What would you do if money was not a concern? Next, identify what you need in life to achieve that happiness."
    },
    {
      "title": "Identify your ultimate purpose or goal.",
      "content": "Identify your ultimate purpose or goal. Identify the things you love to do, the things that give you satisfaction. Once you identify what you love to do, use this information to find the purpose of your life or the objective of your life. Finding what you love to do will give you motivation along the way. It's much, much easier to persistently chip away at your goal if your goal is something you enjoy doing. Consider where you want to be in 5, 10, and 20 years. What can you do that will help you achieve that dream? If you’re confused about what your goal or purpose might be, try meeting with a career coach or visiting a good psychologist . Your goals should be quantifiable. For example, instead of setting a goal to be better at your job, create benchmarks such as \"My goal is to increase my productivity by 30% and only be late for work five times per year, at the most.\""
    },
    {
      "title": "Break your goal into small steps.",
      "content": "Break your goal into small steps. Focus on streamlining your idea and establish what you need to do to reach that goal. If you have the vision to attack your goal piece by piece, it's easier and less daunting to execute. In addition, if you're able to successfully meet and exceed your smaller goals, you're less likely to get discouraged as you pursue your long-term goals. [2] X Expert Source Sydney Axelrod Certified Life Coach Expert Interview. 30 June 2020. For example, does the goal of starting a technology company seem impossibly unattainable? Break it down into smaller goals. Smaller goals could include writing a business plan, finding investors, getting a loan, or coming up with product ideas. Make sure that your goals are SMART. This means that they are Specific, Measurable, Attainable, Relevant, and Timely. [3] X Research source Ask yourself if each goal fits this criteria. Remember, even a small shift now can make a big difference in the long-run, so don't feel like you necessarily have to make big sweeping changes in your life in order to reach your goals. [4] X Expert Source Sydney Axelrod Certified Life Coach Expert Interview. 30 June 2020."
    },
    {
      "title": "Set a timeline for when you want to achieve your objective.",
      "content": "Set a timeline for when you want to achieve your objective. Give yourself a timeline that is difficult but doable. Make sure you have enough time to accomplish each of your smaller steps. Appearing on a nationally televised comedy show might not be feasible within a year, but booking a comedy gig in front of at least 20 paying customers probably is. Make sure to set guidelines for smaller goals as well. For example, make a goal to join an improv team by the end of the month or to perform at an open mic within 3 months. Try not to have an all-or-nothing mindset. Use your timeline to help keep yourself on track, but be willing to adjust it if you need to work a little harder to reach your goals."
    },
    {
      "title": "Identify what resources you need to achieve your objectives.",
      "content": "Identify what resources you need to achieve your objectives. These might be tools, lessons, budgets, or other resources that will help you reach your goals. You might need certain skills, such as public speaking, or other people, such as employees or consultants For example, to start your own business, you might need a bank loan. To get a bank loan, you need a good credit score and a bank. If you want to become a musician, you may need to invest in your own instrument, music, and website."
    },
    {
      "title": "Set a schedule for yourself.",
      "content": "Set a schedule for yourself. Create a to-do list for each day. For long-term projects, give yourself a daily goal or task to help you complete it. As you finish each task, check them off to help you stay motivated. A schedule can give you structure, even on days when you feel unmotivated. Use a calendar app on your phone or write down your commitments in a planner. Make sure that all of your deadlines are clearly written out. If you forget things easily, set reminders or alarms on your phone to remind you. Be realistic about how long tasks take. Plan more time for each task than you think you'll need. Personalize your schedule based on what works for you. Think about what times of day you work best, and set boundaries to help yourself stay focused when you're working on a task. [5] X Expert Source Sydney Axelrod Certified Life Coach Expert Interview. 30 June 2020."
    },
    {
      "title": "Minimize distractions as much as possible.",
      "content": "Minimize distractions as much as possible. It's almost impossible to be 100% focused on your task 100% of the time, but distractions can keep you from producing work efficiently. Occasional breaks are okay, but when your goals start taking a backseat to petty distractions, it's time to banish them. Work in a quiet place if possible. If your workspace is noisy, wear noise canceling headphones or earplugs to block it out. Ask family and friends not to bother you while you are working on something. Let them know that you need this time to yourself. If necessary, turn your phone off or put it in a drawer while you’re working. Taking 5-minute breaks every hour can help you refocus. Take a short walk, get a snack, or do some stretches. Avoid multitasking. Working on more than 1 thing at a time can reduce your productivity. Give your full focus to 1 task. [6] X Research source"
    },
    {
      "title": "Outsource tasks to other people whenever possible.",
      "content": "Outsource tasks to other people whenever possible. Outsourcing is all about time-management. You may think of yourself as a superman or superwoman, but there are limits to your powers. If you try to take on too many things, chances are that you're going to feel burnt out and overwhelmed. [7] X Expert Source Sydney Axelrod Certified Life Coach Expert Interview. 30 June 2020. Outsourcing certain less essential tasks gives you more time to focus on the things that are absolutely essential to your craft. If you’re writing a novel, ask a friend or a copy editor to read through it for you. Instead of trying to edit yourself, they can proofread it and offer suggestions on the plot. If you need a website for your business, hire a web designer to do it for you. If you do this, you won’t have to learn web design yourself, and the website will still look great."
    },
    {
      "title": "Trust other people to do their job.",
      "content": "Trust other people to do their job. It's hard to be successful if you don't trust the people around you. Being successful is partly about assembling an able team around you. If you can't trust others enough to let them do their job, you probably won't succeed at your own work. Consider many different factors when deciding who to trust for a job. Look at their qualifications, past experience, references from other people, or how reliable they have been in the past. Trust in people because trust can be an incredibly motivating factor. If you trust in someone, they'll want to do well because they want to reward your trust in them. This is a powerful motivator. Trust in people because you need to. Instead of trying to do everything yourself, delegate tasks to other people to get them done. Don’t forget to trust yourself too!"
    },
    {
      "title": "Find a mentor to help guide you.",
      "content": "Find a mentor to help guide you. A mentor is someone, usually with a bit more experience than you, who knows the trade, offers advice, and helps you in your pursuit. You can ask a boss, professor, older family member, or family friend to be your mentor. Mentors get satisfaction out of knowing that their guidance has literally bred success. A mentor will help you: Network . Networking is making connections with people who have connections. Networking is mutually beneficial. You offer expertise, opinion, or opportunity to someone in exchange for something back. [8] X Research source Troubleshoot . Troubleshooting is learning about how to make ideas or applications work in difficult situations. Your mentor can help you figure out what you need to change in order to make your idea(s) even better. Strategize . A mentor will probably have more vision than you because they have been in the game longer, with more successes and failures. You can draw on their legacy of experience to strategize about the future."
    },
    {
      "title": "Continue to learn as much as you can.",
      "content": "Continue to learn as much as you can. Never turn your \"learning switch\" off. You never know when your eureka moment will come! Keep listening to others, studying new skills, and learning new things. New information can help you make connections between ideas and use those ideas to make your life better. Read books, watch documentaries, or take online classes to expand your knowledge. Pursue subjects that are interesting to you or that will teach you a necessary skill. Learn as much as you can about your industry, company, hobby, or goal in order to succeed. What do successful people in this field do to help them reach their goals?"
    },
    {
      "title": "Take calculated risks.",
      "content": "Take calculated risks. Successful people think big and act big. Don't wait for opportunities to fall in your lap. Step out of your comfort zone, and sniff them out. Study your risks, make sure the odds are in your favor, and take a leap. Whether you're a long-distance runner or rolling out back-end solutions to technology giants, partnering with the competition may help you pool your resources, motivate you to work harder, and build new relationships. Lead, don't follow. Summon up the courage to do something different. You won't hit a home run with every idea that you come up with, but you can still succeed in projects. Look for projects that will offer you some success, even if they won't make you famous or rich."
    },
    {
      "title": "Look for problems to solve.",
      "content": "Look for problems to solve . Look around and try to think of ways you can contribute. What are people struggling with or complaining about? How can you make life easier for them in an effective way? Can you create a product or provide a service that fills a critical gap? Common problems include: Social problems. Can you think of a similar social problem that needs reinventing? For example, social media reinvented the way people interact with one another. Technology problems. Can you help people use technology to accomplish what they need to do? For example, technology companies design smaller and more powerful computer processors to improve the user experience. Strategic problems. Can you help someone else solve a strategic problem? For example, consultants help other companies and individuals become more productive, profitable, and prudent. Interpersonal problems. Can you help people better get along with one another? For example, psychologists and marriage counselors help other people navigate the complex web of personal relationships."
    },
    {
      "title": "Use technology as a tool, not as a distraction.",
      "content": "Use technology as a tool, not as a distraction. Technology can be incredibly powerful. but it can also sap your energy and productivity. Use technology for productive purposes, but don't let it lead you astray. Use an online planner or app to help you schedule daily goals, meetings, and tasks. Check off tasks as you finish them to help you stay motivated. Music often distracts people as they work. If you do need some music, try listening to soft jazz or classical music, as these are less distracting. Talk to your coworkers and boss in person to avoid being inundated with emails. Organize your inbox so that junk mail and unimportant messages are sent to a different file."
    },
    {
      "title": "Visualize your success.",
      "content": "Visualize your success. The more vividly and accurately you imagine your success, the easier it will be for you to follow through. When you face failure or setbacks, remind yourself that you can achieve your dreams after all. Dedicate a few minutes every day to imagining your success. Imagine yourself in a movie in which you are successful. What are you doing in the movie? What is your success like? Savor the feeling of your success, and use it as motivation to stoke your fire. Make a vision board of what success means to you. Use images and motivational quotes found in magazines or websites to help you create the board. Put it somewhere you will see it often, such as your office or kitchen. Cultivate a healthy motivation when imagining your success. Successful people all believe in themselves and their missions."
    },
    {
      "title": "Express curiosity about everything you face.",
      "content": "Express curiosity about everything you face. Many successful people have an insatiable curiosity. If they don't understand how something works or don't know the answer to a question, they find out. Often, this takes them on a quest of self-discovery, one in which the journey is just as important as the destination. Ask questions about everything you encounter. For example, ask the vet about what makes your dog different from a human or chat with your neighbor about their garden. If you encounter something new, try looking it up or researching more about it. What can you learn from it? Talk to other people about their experiences and successes. You might learn something new about someone you have known for a long time. Curiosity helps you find wonder and joy in everything. It can help you enjoy the journey of discovery rather than just working towards an end goal. [9] X Research source"
    },
    {
      "title": "Surround yourself with other people who are successful.",
      "content": "Surround yourself with other people who are successful. When you're surrounded with people who are highly-driven, it's encouraging. You can bounce ideas off people, and they can even connect you with other people. They can also motivate you and support you through the process. Study famous people through their books, lectures, and biographies. Model some of your approaches around theirs, if possible. Knowledge is as free as it is powerful. Look around in your own life. Do you know someone who has the success that you envision for yourself? What are they doing? How do they approach life? Ask them for advice. Avoid people who discourage you or prevent you from reaching your goals. They will only hold you back on your way to success."
    },
    {
      "title": "Adjust your expectations for a realistic outcome.",
      "content": "Adjust your expectations for a realistic outcome. It's a truism in business that you need to have high self-confidence to get things done, but make sure that your expectations are manageable and are realistic. If your expectations are too high, it will be harder to achieve your goals or overcome failure. Allow there to be some flexibility in your expectations. For example, instead of expecting guaranteed success at your new job, you might think, “Well, it might take me a while to get established. If it doesn't work out, I can find a different job.\" Remember that there will always be variables you can’t control. You can control, however, how you react to situations. For example, if an unexpected expense comes up, tell yourself that it is only a temporary setback. Pay attention to feedback. Even if it is hard to handle sometimes, constructive criticism can help you identify areas where you can improve. Learn to expect failure. It is impossible to achieve success without stumbling at some point along the way."
    },
    {
      "title": "Try again when you face a setback.",
      "content": "Try again when you face a setback. You're going to fail — that much is a given. Never hesitate to be a failure, since life gives many chances. What will define you is how you pick yourself up after you've fallen. Don't give up. If your first attempt didn't work, don't quit.. Don't make excuses. Don't rationalize your failure by placing the blame on someone or something else. Accept when something is your fault. This will help you identify what you need to change to get better. Learn from your failures. Each failure is an opportunity to learn. If you make a mistake and refuse to learn, odds are you'll make that same mistake sometime down the line. If you make a mistake and learn from it, you won't waste your time making the same mistake again."
    },
    {
      "title": "Avoid dwelling on failures or mistakes.",
      "content": "Avoid dwelling on failures or mistakes. Accept that life is unfair. It's a fact. Instead of dwelling on this injustice, consider how you can go out into the world and make it better. Think how to use the situation for your benefit. [10] X Research source For example, if you're working in a toxic work environment, take the initiative to reach out and support your coworkers. Remind them of their successes and motivate them where needed. Sometimes unexpected events happen that can get in the way of your goals. For example, an injury may prevent you from running a marathon. Create new goals or look for alternate ways of achieving your dreams. For example, you might become involved in a sport that is easier on your joints, such as swimming, or make a goal to recuperate through physical therapy."
    },
    {
      "title": "Strive for happiness in other parts of your life.",
      "content": "Strive for happiness in other parts of your life. Remember that success does not guarantee happiness. Success is equated with achieving a goal, but don't assume it will always bring happiness. Instead of focusing only on your goal, make sure that you achieve a balance in your life. Aim for happiness in other parts of your life Don't burn bridges along the way. A lot of life is about personal relationships, so don't forsake them. If you've invented a cheap, efficient way to make nuclear fission, but you don't have a supportive social network, will it be worth it? Value experiences over objects. Experiences, not money or possessions, will make you happier in the long run. [11] X Research source Focus on making great memories with great people along the way, and you should be happy."
    },
    {
      "title": "Focus on staying positive even when you fail.",
      "content": "Focus on staying positive even when you fail. You will be surprised how effective you can be when your thoughts are guiding your actions, not the other way around. If you fail, don't be fearful about starting over; be happy that you've been given a chance to be even more successful."
    }
  ]
}