{
  "url": "https://www.wikihow.com/Build-Antennas",
  "title": "How to Build Antennas",
  "steps": [
    {
      "title": "Strip the insulation off the end of a coaxial cable to create a simple antenna.",
      "content": "Strip the insulation off the end of a coaxial cable to create a simple antenna. Get a coaxial cable that’s long enough to go from your TV to the nearest window so you can get the best reception. Use a pair of wire strippers to remove the last 6 inches (15 cm) of insulation from the end of the coaxial cord. Once the wire inside is exposed, straighten it out by hand and put it vertically near your window. Run the other end of the cord to the port on your TV to attach the antenna. [1] X Research source You may only get 5-10 channels using a simple antenna. You could be able to increase the signal of the antenna by wrapping the exposed end of the coaxial cable in aluminum foil."
    },
    {
      "title": "Try putting an unbent paper clip directly into the coaxial port on your TV.",
      "content": "Try putting an unbent paper clip directly into the coaxial port on your TV. Use a jumbo-sized paper clip to get the most channels from your television. Unbend the paper clip by hand or with a pair of pliers until it has an L-shape. Push the short end of the unbent paper clip into the small hole in the coaxial port on your TV. Once your antenna is in place, you’ll be able to receive a few TV channels. [2] X Research source A paper clip antenna works best if it’s near a window. Attach the antenna to a coaxial splitter and then run a coaxial cord from it to your TV if you want to extend the range more."
    },
    {
      "title": "Create an FM radio antenna by stripping the end from an ethernet cord.",
      "content": "Create an FM radio antenna by stripping the end from an ethernet cord. Use a pair of scissors to cut off one end of an ethernet cord. Strip about 2–3 inches (5.1–7.6 cm) of the insulation off of the ethernet cord so the wires are exposed underneath. Twist the wires together by hand as tightly as you can so they come to a point at the end. Plug the other end of the ethernet cord into your radio receiver and hold the antenna up to receive your stations. [3] X Research source"
    },
    {
      "title": "Cut 8 pieces of copper wire that are each 17 inches (43 cm).",
      "content": "Cut 8 pieces of copper wire that are each 17 inches (43 cm). Get 12-gauge uninsulated copper wire to make your antenna. Measure out 8 separate pieces that are 17 inches (43 cm) long and mark the lengths with a marker. Use a pair of wire cutters to snip the wires on your marks so you have 8 pieces. [4] X Research source You can get uninsulated wire from your local hardware store."
    },
    {
      "title": "Bend the wires into V-shaped ears so the ends are 3 in (7.6 cm) apart.",
      "content": "Bend the wires into V-shaped ears so the ends are 3 in (7.6 cm) apart. You can bend the wire by hand or use a pair of pliers if it’s easier. Grab the ends of one piece of wire and bend it in half so the ends touch one another. Unbend the wire so it looks like a V-shape and the ends are 3 inches (7.6 cm) apart. Repeat the process with the rest of the wire pieces. [5] X Research source Bending the wires helps them pick up frequencies better so you get a clearer image."
    },
    {
      "title": "Drill holes every 8 in (20 cm) on the sides of a 32 in (81 cm) board.",
      "content": "Drill holes every 8 in (20 cm) on the sides of a 32 in (81 cm) board. Put a drill bit in your drill that has a diameter 1 ⁄ 8 in (0.32 cm) smaller than the screws you plan on using. Position the first hole on a 32 in (81 cm) board so it’s along the longest side and 1 inch (2.5 cm) down from the end. Continue adding holes every 8 inches (20 cm) down the length of the board before drilling holes on the other side. [6] X Research source Make sure the holes are in line with one another so the antenna ears are directly across from one another. Don’t drill completely through the board or else the screws may not stay secure later on."
    },
    {
      "title": "Feed screws and washers into the holes you just drilled.",
      "content": "Feed screws and washers into the holes you just drilled. Line up the centers of the metal washers with the holes you just drilled in the wood. Feed the ends of 1 ⁄ 2 in (1.3 cm) wood screws into the holes and turn them clockwise by hand. Continue turning the screws until they’re stuck in the piece of wood. [7] X Research source Don’t tighten the screws completely since you still need to fit wires underneath each of the washers."
    },
    {
      "title": "Wrap the antenna ears around the screws so the ends point out.",
      "content": "Wrap the antenna ears around the screws so the ends point out. Lift one of the washers up so it’s pressed against the top of the screw. Position one of the antenna ears you bent underneath the washer so the ends point out and away from the piece of wood. Make sure the bend in the wire is pulled tightly against the base of the screw so it doesn’t move or shift around. Repeat the process for the other screws. [8] X Research source In total, you’ll have 4 antenna ears on each side of the wooden board. Don’t let the individual antenna ears touch one another since it could negatively affect the signal strength."
    },
    {
      "title": "Thread 34 inches (86 cm) wires between the ears so they zig-zag.",
      "content": "Thread 34 inches (86 cm) wires between the ears so they zig-zag. Cut 2 pieces of your copper wire to 34 in (86 cm) lengths. Wrap the end of the wire once around the topmost screw on the left side of the board. Guide the wire around the second and third screw from the top on the right side of the board. Bend the wire back toward the left side of the board so it goes underneath the bottom left washer. Add the other wire so it starts on the top right screw, crosses and goes around the second and third screws on the left, and ends on the bottom right screw. [9] X Research source These wires are known as the “phasing bars” and they connect the antenna ears to help boost the frequency between them so you receive a better image."
    },
    {
      "title": "Tighten the screws so the washer holds the wires in place.",
      "content": "Tighten the screws so the washer holds the wires in place. Use a screwdriver to finish tightening the screws on your board. Continue turning them clockwise so the washers press down on the wires underneath them and hold the wires securely against the wood. Lightly pull on the wires to make sure they don’t come loose. [10] X Research source If the wires pull out or come loose from under the washers, reposition the wires and continue tightening the screws. Make sure none of the antenna ears touch one another after you tighten the screws or else the signal won’t be as clear."
    },
    {
      "title": "Tape the sections of the phasing bars where the wires intersect to separate them.",
      "content": "Tape the sections of the phasing bars where the wires intersect to separate them. There will be 2 points in the middle of the board where the phasing bars intersect one another. Wrap a piece of electrical tape around each of the wires at the intersection to prevent them from touching one another. Tape the other intersection the same way to keep the wires separate. [11] X Research source If the phasing bar wires touch, it could cause the channels to look fuzzy or short out the antenna."
    },
    {
      "title": "Solder",
      "content": "Solder an impedance-matching transformer to each of the phasing bars. An impedance-matching transformer (IMT) has a coaxial port that connects to your TV and 2 end wires that attach to the phasing bars on the antenna. Position the IMT in the middle of the antenna and bend the ends out so they touch the wires of the phasing bars. Heat up a soldering iron, and solder the ends of the IMT so they’re secured to phasing bar wires. Let the solder dry for about a minute before continuing. [12] X Research source You can buy an IMT from an electronics or hardware store. Don’t touch a soldering iron while it’s hot, or else you could burn yourself."
    },
    {
      "title": "Connect a coaxial cable to the end of the IMT.",
      "content": "Connect a coaxial cable to the end of the IMT. Coaxial cables are standard for attaching your TV to an antenna or cable signal so the image appears clearly on screen. Screw the end of a coaxial cable directly into the port on the IMT until it’s hand-tight. Attach the other end of the coaxial cable to the port on the back of your TV to connect it. [13] X Research source"
    },
    {
      "title": "Position your antenna until you get a clear TV image.",
      "content": "Position your antenna until you get a clear TV image. Keep the antenna vertical so you can get the best signal. Turn on your TV so you can look at the image, and move the antenna around your room until you get a clear picture on the TV. Cycle through the channels to see what’s available from your new antenna. [14] X Research source You may need to reposition the antenna often depending on the channel and signal strength. Don’t put your antenna outside since there is exposed wiring and you could cause it to short out. The channels you receive will vary depending on your location and the strength of the signal."
    },
    {
      "title": "Divide 468 by the frequency you want to tune into to find the antenna length.",
      "content": "Divide 468 by the frequency you want to tune into to find the antenna length. In order to receive the best signal from a radio frequency, you need to find the correct length for your antenna. Choose an FM radio station you listen to the most to choose as the main frequency you’re trying to receive. Divide the number 468 by the frequency to find the total length in feet for the antenna you need. [15] X Research source For example, if you want to receive the frequency 98.3, you would calculate: 468/98.3 = 4.76 feet (1.45 m). You will receive the best signal on 98.3 if the antenna is 4.76 feet (1.45 m) long."
    },
    {
      "title": "Cut an aluminum pole to the antenna length.",
      "content": "Cut an aluminum pole to the antenna length. Get an aluminum pole with a 1 ⁄ 2 in (1.3 cm) diameter so you can make your antenna and mark the length you need with a marker or pencil. Hold the pole securely in place while you cut through the mark with a hacksaw. Work slowly so you don’t damage the pole or saw while you’re cutting. [16] X Research source You can buy aluminum poles from your local hardware store. You may be able to ask the employees to cut the pole to size for you as well. It doesn’t matter if the pole you use is solid aluminum or hollow. If you don’t have an aluminum pole, you can also use an old broomstick as well."
    },
    {
      "title": "Split a speaker wire down the middle to separate the cables.",
      "content": "Split a speaker wire down the middle to separate the cables. Speaker wire has 2 cables that are separately insulated from one another. Use a utility knife to carefully slice through the seam between the 2 cables to separate them. Take one of the cables in each hand and slowly pull them apart. Continue separating the cables until they’re each 1 foot (30 cm) longer than half the antenna length. [17] X Research source For example, if your antenna length is 5 feet (1.5 m), each of your cables should be 3 1 ⁄ 2 feet (1.1 m) long. Secure a zip tie around the speaker wire if you don’t want the cables to separate further."
    },
    {
      "title": "Strip 1 in (2.5 cm) off the ends of the cables.",
      "content": "Strip 1 in (2.5 cm) off the ends of the cables. Clamp a pair of wire strippers around the last 1 inch (2.5 cm) of one of your speaker cables. Squeeze the handles tightly together, and pull the strippers up toward the end to remove the insulation. Repeat the process for the other speaker cable so both ends are exposed. [18] X Research source Stripping the ends of the cables allows the radio frequencies to enter them so they can transmit a signal."
    },
    {
      "title": "Wrap the cables around the pole starting from the center.",
      "content": "Wrap the cables around the pole starting from the center. Place the section of the speaker wire that splits against the middle of the aluminum rod. Take one side of the speaker cable and wrap it tightly around the rod. Leave enough space in between each of the coils so the exposed wire at the end of the cable is still able to reach the end of the pole. Repeat the process with the other cable on the opposite side of the rod. [19] X Research source Make sure to coil the wire in the same direction or else the radio frequency may not come in clearly. It doesn’t matter how many coils your antenna has as long as the wire is tight against the rod."
    },
    {
      "title": "Tape the ends of the speaker wires to the ends of the pole.",
      "content": "Tape the ends of the speaker wires to the ends of the pole. Hold one end of the speaker cable against the end of your aluminum rod so the exposed wire is flush with the edge. Wrap a piece of electrical tape around the wire so the end is still exposed, or else you won’t be able to receive frequencies. Tape the other end of the cable to the opposite side of the rod so it doesn’t uncoil. [20] X Research source You can tape multiple places along the rod if your coils are coming loose. Just leave the ends of the wires exposed."
    },
    {
      "title": "Hang the antenna vertically near a window.",
      "content": "Hang the antenna vertically near a window. The FM radio antenna works best when you stand the rod upright. Find a location that’s close to your radio receiver and near a window so you can get the strongest signal. Position a pipe straps every 12–18 inches (30–46 cm) along the rod and nail them into place on your wall to secure the antenna. [21] X Research source Don’t attach the antenna outside since there are exposed wires and electronics. You don’t need to attach the antenna to your wall if you don’t want to."
    },
    {
      "title": "Plug the other end of the speaker wires into your receiver.",
      "content": "Plug the other end of the speaker wires into your receiver. Run the unsplit end of the speaker wire to the back of your radio receiver, and look for the FM input ports. Push the ends of the speaker wire into the FM port, and turn on your radio to the frequency you made the antenna for. Test other radio stations and frequencies to see if you’re able to pick them up as well. [22] X Research source Sometimes, the FM port has a coaxial connection. If your receiver uses a coaxial port, then attach the port of an impedance-matching transformer (IMT) to the receiver. Splice the speaker wire onto the 2 ends of the IMT to connect the antenna."
    }
  ]
}