{
  "url": "https://www.wikihow.com/Ask-Your-Boyfriend-if-He-Loves-You",
  "title": "How to Ask a Guy How He Feels About You (With Expert Tips)",
  "steps": [
    {
      "title": "Give the relationship some time before you ask.",
      "content": "Give the relationship some time before you ask. Building that level of trust and closeness can take a while. A new relationship is a roller-coaster ride of exciting emotions, but figuring out your feelings can take a while. Don’t rush into asking your boyfriend about the big L right away. Everyone figures things out at their own pace, and putting him on the spot too soon might make him uncomfortable. [1] X Research source Schewitz notes, \"If you’re really invested in getting the “I love you” back, you might want to wait a couple of more months after you start feeling it. However, vulnerability is the birthplace of intimacy, so if you’re feeling something just say it.\" [2] X Expert Source Sarah Schewitz, PsyD Licensed Clinical Psychologist Expert Interview. 15 April 2019. There’s no one right or wrong time in a relationship for someone to say “I love you.” [3] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. Do some soul-searching to try to decide when the time is right. For instance, you might wait until you’re sure that you love him before you start asking how he feels about you . Don’t worry about “rules” like waiting for a certain number of months or having a specific number of dates before you bring up the subject. Every couple is different!"
    },
    {
      "title": "Choose a time when you’re both relaxed and won’t be interrupted.",
      "content": "Choose a time when you’re both relaxed and won’t be interrupted. It’s easier to open up when you’re not under pressure. If you and your boyfriend are stressed or busy, it’s going to be hard to have a good conversation about your feelings. Wait until the two of you can be alone and have plenty of time to chat. [4] X Trustworthy Source Understood Nonprofit organization dedicated to resources and support to people with thinking differences, such as ADHD or dyslexia Go to source For example, don’t ask him when he’s worrying about a big test or trying to finish a bunch of homework. Try saying something like, “Hey, there’s something important I’ve been wanting to ask you. Is this a good time?” It’s also okay to be a little spontaneous if the moment feels right! For example, if you’ve just had an amazing date and are relaxing in each other’s arms, it might be a good moment to talk about your feelings."
    },
    {
      "title": "Lead by letting him know how you feel first.",
      "content": "Lead by letting him know how you feel first. If your guy isn’t sure how you feel, he might be scared to open up himself. Try putting him at ease by spilling the beans first, if you feel ready. Be sincere and tell him exactly what’s on your mind (and heart). [5] X Research source If you say it first, he might let you know how he feels without waiting to be asked! In addition to telling him that you love him, tell him why he’s so special to you. For instance, you could say things like, “You’re always there for me, and I’m so grateful for that. I love the way we can make each other smile and laugh—and I love you.” You don’t have to use the words “I love you” if you’re not comfortable saying it that way. For example, try something like “You mean so much to me,” “I care about you a lot,” or “I’m totally crazy about you.”"
    },
    {
      "title": "Ask directly if you feel comfortable with that.",
      "content": "Ask directly if you feel comfortable with that. Sometimes the best way to get answers is to ask direct questions. You and your boyfriend may know each other pretty well, but you can’t read his mind! If you’re not sure how he’s feeling, just ask. [6] X Research source Once you’ve fessed up about how you feel, say something like, “I know it can be tough to open up about something like this, but it would really mean a lot to me to know how you’re feeling. Do you love me?” If you don’t want to put too much pressure on him, say something like, “I know that’s a big question. You don’t have to answer right away if you’re not ready.”"
    },
    {
      "title": "Write it down if you have trouble asking out loud.",
      "content": "Write it down if you have trouble asking out loud. Sometimes it’s easier to ask a difficult question if you put it on paper. If you just can’t get the words out of your mouth, try writing your boyfriend a note asking how he feels instead. You can write it inside a greeting card or on a sticky note, send him a text, or even hold up signs! For example, you could write a cute note saying, “Do you love me? Check yes or no.” This is also a good way to give your boyfriend extra time to think about his answer. For example, give him a card with a love note inside and tell him he can read it (and answer) whenever he’s ready."
    },
    {
      "title": "Try other questions if you’re nervous about asking directly.",
      "content": "Try other questions if you’re nervous about asking directly. There’s more than one way to talk about love. Maybe directly asking “Do you love me” gives you cold feet. The good news is that there are lots of other questions you can ask to get an idea of where things stand in your relationship. [7] X Research source For example, you might ask things like: “How are you feeling about us right now?” “Do you see us staying together long-term?” “What do you like about our relationship?” “What can I do to help you feel more loved?” “What do you like best about our relationship?” “How do you feel about our intimacy?” “What are some things that I do that make you feel loved?” “Do you see us as being compatible long-term?”"
    },
    {
      "title": "Accept that he might not give you the answer you want.",
      "content": "Accept that he might not give you the answer you want. He may not feel the same way you do, and that’s okay. Asking someone how they feel about you is scary. There’s always a chance your special guy won’t return your feelings. But, as tough as that can be, it’s important to clear the air and get an idea of where things stand. You can always hope for a “yes,” but be prepared for a “no” or even an “I’m not sure yet.” [8] X Research source Whatever he says, respect his answer. Only he can decide how he feels about you! Marriage & Family Therapist Moshe Ratson affirms that, even if he isn’t ready to say “I love you” yet, that doesn’t necessarily mean he won’t get there. He may just need more time to figure out how he feels. [9] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019."
    },
    {
      "title": "Listen for other things he says to express his love.",
      "content": "Listen for other things he says to express his love. “I love you” isn’t the only way to say “I love you.” Pay attention to other things your boyfriend says to you. Does he use kind, respectful, and loving language? Does he use other words to tell you how he feels about you and the relationship? [10] X Research source For example, he may say things like: “I care so much about you.” “You’re awesome!” “I’m so happy when we’re together.” “I’m here for you.” “Thanks for everything you do.” “I’m so lucky to have you.” “I’m so grateful for you.” “It’s easy to think of you as my favorite person.”"
    },
    {
      "title": "See if he shows real interest in you.",
      "content": "See if he shows real interest in you. If he acts like he’s into you, he probably is. Does your boyfriend ask you about your day? Does he pay attention to your fears, hopes, and dreams? Have you noticed that he remembers the things you tell him about yourself? If he makes a point of taking an interest and paying attention, that’s a good sign—it means he cares about you as a person. [11] X Research source On the other hand, if your bae constantly talks about himself and his own interests and doesn’t seem that into anything you have to say, that could mean that his mind and heart are somewhere else."
    },
    {
      "title": "Ask yourself if he’s helpful, considerate, and kind.",
      "content": "Ask yourself if he’s helpful, considerate, and kind. When it comes to love, actions definitely speak louder than words. Watch for the things your guy does to show you how much he cares, whether it’s offering to cook a meal for you, bringing you little gifts, or cheering you on before a big test. [12] X Research source Pay attention to how he acts with you in both good and bad times. For example, is he there to comfort you when you’re feeling down? Does he celebrate with you when things are going well?"
    },
    {
      "title": "Pay attention to how he touches you.",
      "content": "Pay attention to how he touches you. A touch, a kiss, or a hug can say a lot. Think about what it’s like when your boyfriend gets physical with you. Does he give you lots of affectionate touches? Do his touches feel loving and respectful? [13] X Research source Loving touches can include things like hugs, holding hands, backrubs, or even just a gentle pat on the shoulder from time to time. You might notice that he likes to snuggle up close or lean against you when you’re sitting together. Sexual touching can definitely be a sign of love and affection, but it’s important that these kinds of touches are respectful and that it’s something you both want. Have an honest conversation with your boyfriend about what sex means to both of you."
    },
    {
      "title": "Watch for signs that he respects your boundaries.",
      "content": "Watch for signs that he respects your boundaries. Boundaries are super important in a healthy relationship. A loving boyfriend should be there for you. But, also pay attention to whether he’s willing to back off and give you space when you ask him to. [14] X Trustworthy Source New York State Government Official website for the State of New York Go to source If he respects your boundaries, that’s a good sign that he loves and cares about you. For example, if you ask your boyfriend to stop making comments or jokes that bother you, he should apologize and stop. It’s totally normal for people to cross each other’s boundaries sometimes, even in a loving relationship. Watch for how he reacts when you let him know he’s crossed the line, though. He should make a sincere effort not to do it again."
    },
    {
      "title": "Note whether he includes you in his decisions.",
      "content": "Note whether he includes you in his decisions. If he gets you involved in his life choices, he’s probably pretty into you. Your boyfriend doesn’t have to get your input on every little thing he does. And it’s also totally okay if he does things without you from time to time. But if he goes out of his way to get you involved, he likely cares about your opinions and feels like it’s important to do things with you. [15] X Research source For example: Does he ask for your input about what the two of you do together? Does he get your advice when he’s making major decisions that might affect both of you? For instance, if he’s thinking about where he wants to go to college, he might talk to you about it."
    },
    {
      "title": "He’s uncomfortable with how saying “I love you” makes him feel.",
      "content": "He’s uncomfortable with how saying “I love you” makes him feel. Feeling so vulnerable may make him think twice before sharing his deepest emotions with you. It’s also important to remember that he could have been hurt before by someone else, and he’s being extra cautious before saying “I love you” this time."
    },
    {
      "title": "It takes a long time for some people to fall in love completely.",
      "content": "It takes a long time for some people to fall in love completely. It’s possible he doesn’t know exactly how he feels about you yet. Some guys fall head over heels quickly, while others are more practical when addressing their own emotions. Give him time and space to see where your relationship goes, so he knows how he feels when he says it to you."
    },
    {
      "title": "He’s waiting for you to say “I love you” first.",
      "content": "He’s waiting for you to say “I love you” first. He could be thinking, “Why hasn’t she said “I love you yet?” too. If he’s not sure how you feel about him in return, he may be slow to share his feelings with you due to fear of rejection. Show empathy for his feelings by letting him know how you feel the same fears as he might."
    },
    {
      "title": "He’s not sure how he should tell you he loves you.",
      "content": "He’s not sure how he should tell you he loves you. He may be a romantic type who wants to make the moment he says “I love you” really special, but doesn’t think he’s got it planned yet. Have faith in your relationship and give him the chance to make the moment one you’ll remember for a very long time."
    },
    {
      "title": "He’s not interested in a serious relationship.",
      "content": "He’s not interested in a serious relationship. There is always the chance he wants to stay in a relationship with you, but not a long-term one. If you feel this is the case, it’s time to have an open and honest conversation about where he sees the relationship going. Likewise, he may not be in love with you and needs to tell you so. This way, neither one of you will waste too much time in a relationship that isn’t likely to head anywhere. [16] X Research source"
    },
    {
      "title": "Tell your boyfriend if it’s important to you to hear “I love you.\"",
      "content": "Tell your boyfriend if it’s important to you to hear “I love you.\" Your relationship will be much stronger if you can both be clear about your needs, wants, and expectations! You're better off knowing if he's not yet ready to make an emotional commitment and decide what's best for both of you, relationship-wise. [17] X Research source"
    },
    {
      "title": "Some people have a hard time saying “I love you.”",
      "content": "Some people have a hard time saying “I love you.” If your boyfriend struggles to say those 3 not-so-little words, talk to him about ways that he is comfortable expressing his feelings. He may be trying to show you how he feels with considerate actions, by showing affection and taking a genuine interest in your happiness."
    },
    {
      "title": "Think about how well you’re communicating with each other.",
      "content": "Think about how well you’re communicating with each other. If you’re currently in a relationship where you don’t say what you feel, you might not be setting the stage for open communication. Keeping things inside, whether positive reactions to what he does or how you might feel disappointed, can prevent a dialogue from existing between the two of you, about expressing your love or anything else."
    },
    {
      "title": "Consider whether your feelings are affected by your past.",
      "content": "Consider whether your feelings are affected by your past. Do you come from a family where your parents didn’t express themselves as well as they could have? If you had an emotionally-starved childhood that has you overly focused on hearing “I love you” from a guy you’re seeing, take a step back. It could be time to first do some work on your own emotional well-being, so you’re in a better place to receive love when it comes. [18] X Research source"
    },
    {
      "title": "Saying “I love you” means a lot to both people in a relationship.",
      "content": "Saying “I love you” means a lot to both people in a relationship. When you want to ask your boyfriend if he loves you, look at his actions over his words. Consider things he may be going through inside that delay his making the big statement. Be honest with him about your expectations in the relationship and try to keep communication open no matter what."
    }
  ]
}