{
  "url": "https://www.wikihow.com/Become-a-Geisha",
  "title": "How to Become a Geisha",
  "steps": [
    {
      "title": "Start your shikomi training phase at a young age.",
      "content": "Start your shikomi training phase at a young age. Traditionally, a girl could be boarded to geisha house (okiya) during childhood. Today, training to become an apprentice geisha (maiko) starts at roughly age 14 or 15 with the shikomi phase. [2] X Research source You must be introduced to the okasan or proprietress of an okiya before beginning your training. She will decide whether or not to accept you into her okiya. While geishas are traditionally women of Japanese origin, a few non-Japanese women have completed geisha training. If you are in your later teens or even early 20s, it’s possible that an okasan may accept you but it’s not typical. [3] X Research source It used to be common for males to train as geishas (taikomochi), but it is not common today."
    },
    {
      "title": "Commit to being a live-in trainee at an okiya or geisha house.",
      "content": "Commit to being a live-in trainee at an okiya or geisha house. Once you’ve found an okiya, you’ll live and work there until you become a meiko. The skihomi phase can last roughly 10 months. You’ll most likely have to share a room with the okasan. [4] X Research source Kyoto is the center of the geisha world so it’s likely that you’ll be living in one of Kyoto’s geisha districts. [5] X Research source It’s natural to experience some homesickness during this period. Some okiya may allow young girls to undergo a brief trial period. Try this if possible, so you can see how you feel after 1 or 2 weeks at the okiya."
    },
    {
      "title": "Complete chores for your okasan.",
      "content": "Complete chores for your okasan. As a shikomi-san, or girl-in-training, you’ll support the okiya by doing daily chores that she assigns to you. Tasks may include cleaning the rooms of the okiya, washing the bathrooms, doing the laundry, and setting tables for dinner parties. [6] X Research source The work isn’t glamorous but it will teach you discipline which is an essential part of your training."
    },
    {
      "title": "Pay respect to your senior sisters through daily greetings and actions.",
      "content": "Pay respect to your senior sisters through daily greetings and actions. You’ll recite specific phrases when your okasan and other geishas enter and leave the okiya. Additionally, you’ll practice discipline and respect through daily actions like kneeling and bowing. Your okasan will define which greetings and actions you are to practice. You may assist meikos and geikos in getting dressed. [7] X Research source You might be asked to kneel and say “Welcome back, madam” whenever a senior sister returns to the okiya. During this process, resist the temptation to speak out of turn or use casual language like other teenage girls do."
    },
    {
      "title": "Work with a mentor (oneesan) towards the end of your shikomi training.",
      "content": "Work with a mentor (oneesan) towards the end of your shikomi training. Before becoming an apprentice geisha (maiko), you’ll search for an oneesan or “older sister.” [8] X Research source She will act as a mentor and teacher for roughly the last month of your training. [9] X Research source You’ll then enter the brief “watch and learn” minarai phase of your training where you’ll join and observe your oneesan during events and ceremonies. This phase will give you some real-world experience and will expose you to some potential clients. [10] X Research source Your okasan can help you match up with an oneesan. She should be an experienced geisha who is willing to support and sponsor you. Your oneesan doesn’t need to come from the same okiya as you, but she can be."
    },
    {
      "title": "Debut as an apprentice geisha (maiko) during your misedashi ceremony.",
      "content": "Debut as an apprentice geisha (maiko) during your misedashi ceremony. Once you’ve completed the necessary shikomi training, you’ll be promoted to the apprentice geisha phase. This transition typically occurs by age 17. Your okasan will decide when each member of her okiya is ready for their own ceremony. [11] X Research source As part of this ceremony, you’ll be escorted to visit your various teachers and tea houses to participate in a cup exchange ritual (sansankudo) with your oneesan as well as other geiko and the senior maiko from your okiya. [12] X Research source You’ll wear the most formal attire, including a long, trailing kimono and a darari obi that features a crest identifying your okiya. Your okiya will be brightly decorated in red and white to celebrate your debut."
    },
    {
      "title": "Study traditional Japanese arts and hospitality skills.",
      "content": "Study traditional Japanese arts and hospitality skills. As a maiko, you’ll spend hours attending classes (kaburenjo) to practice and develop your skills each day. You’ll focus on include singing, dancing, and playing musical instruments. Additionally, you will become skilled in calligraphy and flower arrangement (ikebana). Beyond these art forms, you’ll focus on mastering the art of conversation and hosting tea ceremonies. Instruments you may practice include taiko drums and the 3-stringed shamisen. [13] X Research source Choose whether you want to specialize in either dancing or the musical arts. [14] X Research source A geisha who specializes in music is called a jikata while one who specializes in dance is called a tachikata."
    },
    {
      "title": "Wear the hairstyle, makeup, and clothes of a maiko.",
      "content": "Wear the hairstyle, makeup, and clothes of a maiko. As a maiko, you’ll wear ornate long-sleeved hikizuri kimono, a heavily-adorned momoware hairstyle with your natural hair, and traditional makeup. [15] X Research source Your ensemble will feature a red collar. You will be responsible for doing your own makeup, but you’ll visit a skilled hairdresser each week to get your hair styled. [16] X Research source Accessories you’ll wear include ornate hair pins (kanzashi) and platformed wooden sandals (okobo). As a maiko, you’ll put chalk-white makeup (oshiroi) on your face and neck, but you’ll leave the nape of your neck uncovered. You’ll paint your lips red and will outline your eyes and brows with red and black makeup. Sleep with your head supported by a takamakura pillow to preserve your hairstyle."
    },
    {
      "title": "Make your geiko debut during your erikae ceremony.",
      "content": "Make your geiko debut during your erikae ceremony. When you’ve completed the maiko and minarai phases, you’ll be ready to debut as a full-fledged geisha. Your erikae or “turning of the collar” ceremony will take place by age 20. [17] X Research source It involves changing your appearance from that of a maiko to that of a geiko. During the week of your erikae ceremony, you will wear a special hairstyle and ensemble for this ceremony, which may reference your region of origin. [18] X Research source During the ceremony itself, you will transition from a maiko’s red collar to a geiko’s white collar. Additionally, your hairstyle will be undone and you’ll cover your natural hair with a wig."
    },
    {
      "title": "Select a professional geisha name (geimei).",
      "content": "Select a professional geisha name (geimei). Your oneesan will help you in choosing a professional name to represent your new career as an artist and entertainer. Pick one that references your oneesan in some way and places you within the lineage of geisha. Choose a unique name that illustrates your beauty and grace, includes aspirational well-wishes for good fortune or health, or includes an alluring reference to the splendor of the karyūkai. For example, a meiko with an oneesan named Tamaryô (Jewel Dragon) may choose the name Tamakichi (Jewel of Fortune). [19] X Research source"
    },
    {
      "title": "Adopt the more discreet appearance of a geiko.",
      "content": "Adopt the more discreet appearance of a geiko. You’ll now wear tsumesode kimono with shorter sleeves and less flamboyant patterns. Additionally, you’ll be able to wear a wig in the shimada mage hairstyle and won’t have to style your natural hair. [20] X Research source As a geiko, you will wear the white and red makeup less frequently. This is partly to distinguish you from the geishas-in-training and partly to showcase your natural beauty. Once you are an experienced geiko or have entered your 30s, you’ll only wear the white and red makeup for special occasions."
    },
    {
      "title": "Earn money to repay your training debts.",
      "content": "Earn money to repay your training debts. Since the costs of your training were covered by your okasan, you’ll repay these debts by working as a geiko. Entertain your clients at dinner parties, tea ceremonies, and performances. [21] X Research source Work on generating a loyal base who will pay the full, high rates for your services. You’ll participate in public festivals and dances (odori) as well as private events with your clients. Once you’ve repaid your training debts, you may continue on as a geisha, mentoring younger trainees and perhaps eventually becoming an okasan. If you prefer, you can transition to another career after your debts are settled. Working as a geisha is not a lifelong commitment."
    }
  ]
}