{
  "url": "https://www.wikihow.com/Become-a-WWE-Superstar",
  "title": "How to Become a WWE Superstar",
  "steps": [
    {
      "title": "Play football",
      "content": "Play football or join the wrestling team . Professional wrestlers come from all kinds of athletic backgrounds. WWE talent scouts recruit new wrestlers based on a criteria of athleticism, charisma, coachability, etc. Athletes are encouraged to apply on their recruiting website WWEPerformanceCenter.com for a chance to be invited to an upcoming tryout. The Rock, \"Stone Cold\" Steve Austin, Bray Wyatt and Roman Reigns all got their start on the football field, not in the squared circle. Other notable stars including Brock Lesnar, Kurt Angle, and Dolph Ziggler, started out as skilled amateur wrestlers before signing deals with WWE. Wrestlers like CM Punk, Chris Jericho, Seth Rollins, and The Hardy Boyz didn't come from athletic backgrounds. Instead, they received training at private wrestling schools, then joined indy wrestling promotions and got good enough to get WWE's attention."
    },
    {
      "title": "Start strength-training",
      "content": "Start strength-training . How did Ryback get so ripped? Hitting the weights at the age of 12. [1] X Research source WWE wrestlers need to be strong enough to pick up a 200+ pound brawler and slam him to the mat safely. Even if you want to be a high-flyer or a mat-wrestler, you need to be strong. Focus on building strength in your upper body, your core , and your legs . While wrestlers used to look like beer-drinking bar-room brawlers, most wrestlers these days have bodybuilder muscles. It takes serious commitment to diet and exercise if you want to be in the WWE. Join a gym and consult a personal trainer if you want to get into WWE shape. Wrestler Triple H also offers a strength and conditioning workout video series you can buy commercially. [2] X Research source"
    },
    {
      "title": "Focus on high-intensity cardio",
      "content": "Focus on high-intensity cardio . Running around the ring between the ropes, landing flat on your back, and doing hip-tosses That's hard. Wrestling will have you gasping for breath pretty quick if you're not in shape. Pro wrestlers need to be in excellent cardio condition, ready to go 10-20 minutes per match at a fast clip. Try grouping your favorite 5-10 strength workouts and do them in short, timed bursts to introduce some cardio to your strength-training routine. Do as many reps as you can with a manageable weight in 60 seconds, then give yourself 15 seconds of rest before moving to the next workout. Do all 10 exercises before taking a two minutes break, then repeat the circuit twice. Former pro wrestler \"Diamond\" Dallas Page leads a wrestling-themed yoga workout that's available commercially, involving low-impact flexibility and cardio exercise. Lots of wrestlers use his method in their training."
    },
    {
      "title": "Take dance classes",
      "content": "Take dance classes or try gymnastics . Pro wrestling is about learning to move with other people, to make the contest look realistic. Moonsaults, bodyslams, and hurricanranas are a lot more like dancing than they are like actual wrestling. You won't see anyone come off the top rope in an amateur contest or do an RKO, so gymnastics and dance are good ways to get coordinated. Learning to tumble and take bumps will be part of your wrestling training, but you'll be a much faster learner if you've got experience doing flips and learning to spot yourself. It's an excellent way to build a foundation."
    },
    {
      "title": "Take acting classes",
      "content": "Take acting classes . The Rock didn't become a movie star by accident. Wrestlers have to be great actors, learning to sell moves and tell a convincing and compelling story in the ring. Even if you've got a ripped bod and a killer finishing move, nobody's going to care if you can't talk on the microphone. Promos used to be improvised in the days of the Hulkster. Now, memorizing lines is a part of the routine in the WWE. If you want to be on TV, you're going to have to learn to read a script and memorize your lines ."
    },
    {
      "title": "Eat a clean diet",
      "content": "Eat a clean diet . A common joke among pro wrestlers is that they eat nothing but grilled chicken breasts, steamed broccoli, and brown rice. Even though you might be on the road 300 days a year, it's not going to be all hamburgers and french fries. You've got to commit to eating a diet rich in lean proteins, vitamin-rich vegetables, and slow-digesting carbohydrates, to keep your body working for you."
    },
    {
      "title": "Join a private wrestling school.",
      "content": "Join a private wrestling school. Learning to do pro wrestling moves needs to happen in person, taught by a wrestling instructor in a proper wrestling ring. Wrestling schools and academies are available in most regions, offering 6-week courses and other packages for interested wrestlers. The best of these will sometimes be offered spots in local promotions. Lots of notable wrestling schools are run by former wrestlers. Shawn Michaels, Lance Storm, Devon and Bubba Ray Dudley, Harley Race, and Killer Kowalski all run esteemed wrestling schools in the US, from which many WWE superstars have graduated. Likewise, many indie promotions like Ring of Honor and Ohio Valley Wrestling also offer training programs. Never, under any circumstances, should you start practicing the wrestling moves you see on television, when you're at home. Done incorrectly, those moves can be deadly."
    },
    {
      "title": "Learn to take bumps.",
      "content": "Learn to take bumps. The big secret to those devastating moves that look like they really hurt? They actually really hurt. Pro wrestlers learn to fall properly, however, to control those falls and protect their heads and necks from more serious injury. While landing flat on your back will never feel great, in training you'll learn to do it safely. Other skills you'll learn in wrestling school involve: Locking up Striking Running the ropes Chain wrestling Taking specific moves Communicating in the ring Selling other wrestlers' moves"
    },
    {
      "title": "Learn to make your matches dramatic.",
      "content": "Learn to make your matches dramatic. Like a good movie, a good wrestling match isn't all shoot-outs and love scenes, even though those might be the best parts. Matches need to be paced properly, mixing high spots and low spots to create drama for the audience. Learning how to do this is one of the most difficult but important parts of learning the art of wrestling. Contrary to popular belief, most wrestling matches aren't actually scripted move-for-move. Lots of the bigger spots and the finish is usually planned out, but getting from point A to point B will usually be called in the ring. [3] X Research source Talk to older and more experienced wrestlers. Take every opportunity to work with them yourself if you want to learn about match pacing. Most beginners rush, going from move to move pretty quickly. Slowing down is a skill that you'll gain with time and effort."
    },
    {
      "title": "Build a unique character.",
      "content": "Build a unique character. Pro wrestling characters are usually flamboyant, over-the-top, larger-than-life personas. Regular guys named Terry and James became Hulk Hogan and the Ultimate Warrior when they set foot in the ring. Connect with a crowd by developing a kind of character they'll be able to relate to if you're a babyface, or despise if you're a heel. Good characters are usually just amplified versions of your real personality. John Cena could really freestyle rap before he became the Doctor of Thuganomics, and Chris Jericho, the Ayatollah of Rock 'n Rolla, really is the singer in a band. Character traits are sometimes called \"gimmicks\" in pro wrestling. Even if you're wrestling under your regular name, you need a good gimmick or prop. Think of Bret Hart's leather jacket and pink sunglasses, or Shawn Michaels' sparkly chaps."
    },
    {
      "title": "Learn to talk well on the mic.",
      "content": "Learn to talk well on the mic. Remember: The wins and losses don't matter. Wrestlers aren't always great because they're the best wrestlers. Some of them just talk so charismatically, they get you to believe they are. Study the work of some promo masters, like Ric Flair, The Rock, Chris Jericho, Paul Heyman, and Randy Savage to learn how to talk smack with the best of them. Practice talking in front of the mirror, perfecting the mannerisms and movements of your character. Become someone else and commit to as wide a range of emotions as possible. [4] X Research source Good catchphrases are important for wrestlers, but cutting an intense promo about your upcoming match is even more important. You can practice promos any time. Pick a wrestler you hate and practice talking in the mirror. Talk how you're going to rip his head off this coming Sunday. Make it intense. Make it entertaining."
    },
    {
      "title": "Learn to do the job.",
      "content": "Learn to do the job. Being a good pro wrestler isn't about winning the most matches, or being the strongest person in the world. It's about getting the crowd interested in your matches enough to want to see you win, or lose. It's a performance, and sometimes the performance won't involve you getting the win. Pro wrestlers usually work as \"heels\" or \"babyfaces.\" If you're a heel, your job is to make the crowd hate you so much they'll pay good money to see you get a beat-down. If you're a babyface, your job is to be sympathetic with the crowd, so they'll want to see you do the beating. Not everyone can be a babyface. Some wrestlers do pretty much nothing but lose. When you first get started, you'll probably be doing \"jobs\" for more experienced wrestlers. It's a great opportunity to learn the ins and outs of the business. Try to keep your ego out of it."
    },
    {
      "title": "Study the history of wrestling.",
      "content": "Study the history of wrestling. WWE wrestlers need to be fans of the product. The WWE Network has an enormous archive of original content available online for cheap, including every pay-per-view event ever, but check out other VOD sources and YouTube to find the classics of the territory days, and try to keep up with what's going on in the current indy promotions as well. [5] X Research source Watch WCW's great cruiserweight matches with Sting and Vader, as well as classics by Dean Malenko, Eddy Guerrero, and Rey Mysterio Jr. Watch Sandman, Raven, and Tommy Dreamer tear it up in the wild days of ECW. Check out NWA classics from the 70s and 80s to see Harley Race, Tully Blanchard, Dusty Rhodes and Ric Flair in their prime. Watch Verne Gagne, Mad Dog Vachon, Nick Bockwinkel, and Larry Zbyszko go head to head in AWA. Lots of current and former wrestlers have podcasts, which include lots of wrestlers talking about the details of the wrestling business and telling stories. It's a great way to learn about what it takes. Check out podcasts by Colt Cabana, Jim Ross, and Steve Austin for a good perspective on the art of pro wrestling."
    },
    {
      "title": "Wrestle for an independent promotion for a while.",
      "content": "Wrestle for an independent promotion for a while. Wrestlers who try out for WWE need at least 3-5 years of pro wrestling experience. [6] X Research source The only wrestlers who go immediately into the WWE are recruited from amateur college wrestling programs or other athletics. Most other wrestlers get started wrestling for some kind of promotion other than the WWE and climb their way through the ranks. Here's a list of regional independent promotions, some of which have training schools as well: Ring of Honor Dragon Force Global Force Wrestling AAA AEW NWA Pro Wrestling Guerilla Combat Zone Wrestling"
    },
    {
      "title": "Hit the road.",
      "content": "Hit the road. Smaller promotions will hire wrestlers who have received training. Many wrestlers start making a living by traveling between promotions in the region, doing a few shows at a time and gradually making connections in the business. Start getting yourself booked in as many territories as possible and working your way between them. In the United States, the northeast is especially friendly to pro wrestling shows and indie wrestlers. Start working the circuit in your area."
    },
    {
      "title": "Market yourself.",
      "content": "Market yourself. Go into business for yourself. Meet as many other wrestlers and promoters as you can and let them know that you're in the business of wrestling. Make yourself available to make appearance at shows of any kind, and try to get as many gigs as possible. Print up and start selling your own merch at events. This is an excellent way to start coming up with some extra money, as well as to get to know other sides of the business. Think about what kind of a shirt people will be likely to buy. Then wrestle in it and sell it after the show. Make up highlight packages of your matches. Start marketing your skills and your abilities in the squared circle by compiling highlight reels of your abilities. Load these up onto YouTube , or a personal website of your own."
    },
    {
      "title": "Go to a WWE tryout.",
      "content": "Go to a WWE tryout. On the WWE website is a career page, which regularly posts job openings in a variety of different departments. Jobs include production, writing, and talent. Regional tryouts are held occasionally, where wrestlers may show off in an attempt to get the recruiters' attention. These tryouts will be posted on the WWE site and held at the NXT facility in Orlando, FL. [7] X Research source According to some estimates, WWE gets as many as 2000 unsolicited wrestler applications every single week. You can send video and press to World Wrestling Entertainment, Inc. Attention: Talent Relations, 1241 East Main Street, Stamford, CT 06902. It's very difficult to get a foot in the door this way. Another way to try out for WWE is to tryout for their reality program, called Tough Enough. The show follows wrestlers who compete for a contract with WWE. The Miz, Ryback, and Big E were all contestants on Tough Enough."
    },
    {
      "title": "Put in your time in NXT.",
      "content": "Put in your time in NXT. Almost all new recruits are sent to NXT, which is the training facility and wrestling promotion located in Orlando, FL, before joining the main WWE roster. There, you'll take promo classes, learn the details of TV production and working the camera, and hone your craft even more with some of the best wrestlers from around the world. At any given time, there are roughly 70 trainees signed to NXT, 10-15 of whom are featured on the NXT programming on the WWE network. Of them, maybe 5 or so from any given group will come to the main roster. NXT has produced such wrestlers as Dean Ambrose, Bray Wyatt, Seth Rollins, Roman Reigns, and Neville."
    },
    {
      "title": "Stand out from the crowd.",
      "content": "Stand out from the crowd. The only sure way to make it to the main WWE roster? Shine. There's an \"it\" factor that every wrestler needs to have. It's something that can't be taught. You've got to have the charisma that will make people want to watch you, buy your merch, and follow your career. Find some way to distinguish yourself from the rest of the wrestlers on the card and take your spot. There's no one way to be, because it's about being different. Daniel Bryan fits nobody's mold of what a WWE wrestler should look like or act like, but he is a huge superstar because of his \"every man\" style. Find yours."
    }
  ]
}