{
  "url": "https://www.wikihow.com/Cook-Pizza-on-a-Pizza-Stone",
  "title": "How to Cook Pizza on a Pizza Stone",
  "steps": [
    {
      "title": "Get your ingredients.",
      "content": "Get your ingredients. Of course, you can skip this entire part and buy pre-made pizza dough at the store. But if you’re looking for the full pizza stone experience, this recipe makes a great Brooklyn Style pizza dough. This recipe makes two pizzas. If you only want one, place half the dough in the freezer when you place the other half in the refrigerator. [2] X Research source 1 tsp. active dry yeast 1/4 cup cold water 1 cup cold water 1 tsp. salt 3 cups bread flour 3 tsp. extra virgin olive oil"
    },
    {
      "title": "Sprinkle yeast over warm water in a large bowl.",
      "content": "Sprinkle yeast over warm water in a large bowl. Let it sit for 5-8 minutes. This will create a bubbling action, or proof, which test the effectiveness of the yeast."
    },
    {
      "title": "Stir in the salt and cold water.",
      "content": "Stir in the salt and cold water. Once you’ve allowed your mixture to proof, mix in the salt and cold water. Follow this with the flour. Stir flour in 1 cup at a time until your dough is together enough to remove from the bowl. [3] X Research source"
    },
    {
      "title": "Knead dough.",
      "content": "Knead dough. On a floured surface, knead your dough until it is smooth. It will take 10-15 minutes. Once you’ve gotten the desired smoothness, divide your dough into two even pieces and form each one into a tight ball. Coat each ball with extra virgin olive oil by brushing it evenly over them. [4] X Research source"
    },
    {
      "title": "Let the dough rise.",
      "content": "Let the dough rise. Place your dough balls in sealed containers with enough room for the dough to rise. They shouldn’t take up more than half of the bowl. Let them sit in the refrigerator for at least 16 hours and then remove them an hour before you’re ready to use them. [5] X Research source"
    },
    {
      "title": "Preheat your oven.",
      "content": "Preheat your oven. With the pizza stone on the bottom rack of your oven, preheat it to 550 degrees."
    },
    {
      "title": "Dust your dough and your work surface with flour.",
      "content": "Dust your dough and your work surface with flour. Using one ball of at a time, lightly dust your dough with flour. Stretch gradually on a flat, floured surface until it is about as big as your pizza stone (typically about 14”). A cutting board, a flat baking sheet, or a peel will work for your surface. A peel is a wide flat tool for your pizza. The front edge is typically tapered so that your pizza can slide easily on and off of it."
    },
    {
      "title": "Top your pizza.",
      "content": "Top your pizza. Once your dough is stretched to the desired size, spread your sauce and add your cheese. Top with the vegetables, meats, and seasonings of your choice."
    },
    {
      "title": "Place your pizza on the stone.",
      "content": "Place your pizza on the stone. This will be much easier if you’ve properly floured your flat surface. Place the tip of your flat surface on the back of the preheated stone and slide your surface out of the oven so that your pizza is left on the stone. If your pizza seems to stick, try using a back and forth jerking motion to help it."
    },
    {
      "title": "Bake your pizza.",
      "content": "Bake your pizza. Your pizza will only have to bake for 4-6 minutes in the oven. Watch it carefully and remove it when the crust begin to brown. Remove the pizza by again sliding your flat surface beneath the pizza. [6] X Research source"
    },
    {
      "title": "Cut and enjoy.",
      "content": "Cut and enjoy. Be careful, the pizza will be extremely hot. Let it sit for a couple minutes before cutting to avoid burning yourself. You now have a crispy stone oven-style pizza."
    },
    {
      "title": "Let the stone cool.",
      "content": "Let the stone cool. Turn the oven off after you’ve cooked your pizza. Let the stone cool completely before you take it out. This will take hours, so feel free to wait until the morning to clean your stone."
    },
    {
      "title": "Use a soft brush, soap, and water.",
      "content": "Use a soft brush, soap, and water. Place the cooled stone in your sink and clean it just as you would any other dish. Brush off any loose bits of food and scrub away anything that has melted to the surface. Don’t let it sit in water for too long because the material is porous and will absorb the water. If this happens, your stone could crack the next time you try to use it. [7] X Research source"
    },
    {
      "title": "Dry your stone.",
      "content": "Dry your stone. Use a dishtowel to wipe your stone dry and let it sit out on the counter to dry completely. Some staining is completely normal. As long as you scrub off any food, your stone is perfectly fine to re-use again and again."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}