{
  "url": "https://www.wikihow.com/Collect-a-Sterile-Urine-Sample",
  "title": "How to Do a Urine Sample: An Instructional Guide",
  "steps": [
    {
      "title": "Get a sterile plastic container from your doctor or a kit.",
      "content": "Get a sterile plastic container from your doctor or a kit. Ask your doctor for a container to collect your sample or buy a kit from your pharmacy. This ensures that your sample will be sterile. [2] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Don’t touch the inside of the cup or lid. Additionally, don’t put anything else in the cup, including soap and water. This can contaminate it."
    },
    {
      "title": "Label the container with your name, your date of birth, and today’s date.",
      "content": "Label the container with your name, your date of birth, and today’s date. Use a marker to write your information on the cup. Make sure your writing is legible so the lab tech knows the sample is yours. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If your container has a sticker label, you may use a pen instead of a marker."
    },
    {
      "title": "Wash your hands",
      "content": "Wash your hands using soap and warm water. Rinse your hands and wrists under a stream of warm water. Then, apply soap to your palm and rub your palms together to work up a lather. Scrub your hands and wrists for at least 30 seconds to make sure they’re clean. Then, rinse away all of the soap under warm water. [5] X Research source Pat your hands dry on a clean towel."
    },
    {
      "title": "Wipe your genital with sanitizing towelettes to prevent contamination.",
      "content": "Wipe your genital with sanitizing towelettes to prevent contamination. It’s normal to have bacteria around your genital area, so you need to clean it. Use a disinfectant towelette to wipe down the area. Your doctor or the kit should provide you a towelette. [6] X Expert Source Scott Tobis, MD Board Certified Urologist Expert Interview. 26 August 2021. [7] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source To clean a vagina, use your fingers to spread your labia, then wipe the inside of your labia from front to back. Next, use a fresh cloth to clean your urethra, which is in front of your vaginal opening. [8] X Expert Source Scott Tobis, MD Board Certified Urologist Expert Interview. 26 August 2021. To clean a penis, wipe down the head of your penis. If you have a foreskin, push it back so that you can clean the entire area. [9] X Expert Source Scott Tobis, MD Board Certified Urologist Expert Interview. 26 August 2021."
    },
    {
      "title": "Begin to urinate into the toilet.",
      "content": "Begin to urinate into the toilet. Sit down on the toilet and begin to urinate. This will wash away any remaining bacteria around your urethra. [10] X Research source If you’re a man, it’s okay to stand in front of the toilet if you’re more comfortable that way."
    },
    {
      "title": "Stop your stream of urine so you can collect a mid-stream sample.",
      "content": "Stop your stream of urine so you can collect a mid-stream sample. After 2-3 seconds of urinating, tighten your pelvic muscles to stop the stream. Then, place your cup under your urethra so you can catch a mid-stream sample of your urine. [11] X Expert Source Scott Tobis, MD Board Certified Urologist Expert Interview. 26 August 2021. [12] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Urinate into the cup until it’s about half full.",
      "content": "Urinate into the cup until it’s about half full. If you can, watch how much urine is going into the cup. Otherwise, stop your stream every few seconds and check to see how much urine is in the cup. Stop urinating into the cup when it’s about halfway full. [14] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source If your doctor told you to fill it more than halfway, follow their instructions."
    },
    {
      "title": "Finish urinating into the toilet.",
      "content": "Finish urinating into the toilet. If your bladder isn't empty, continue urinating into the toilet until you're finished. Then, wipe yourself like you normally would after using the restroom. [15] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Wait to flush the toilet until after you’ve sealed your sample container. This will prevent spray from the toilet from getting into your sample."
    },
    {
      "title": "Seal the container to secure the sample.",
      "content": "Seal the container to secure the sample. Place the lid onto the sample container, then screw or pop it in place. This keeps your sample from spilling and ensures that it won’t get contaminated. [16] X Research source Use the lid that came with your container."
    },
    {
      "title": "Wash your hands using soap and warm water.",
      "content": "Wash your hands using soap and warm water. Wet your hands under a stream of running water, then apply soap to your palm. Rub your hands together for about 30 seconds to work up a lather. Then, rinse your hands under the warm water to remove the soap. [17] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Don’t get soap and water on your sample because it could possibly get contaminated."
    },
    {
      "title": "Provide the urine sample to your medical provider.",
      "content": "Provide the urine sample to your medical provider. If you’re doing the collection in their office, follow their instructions for handing over the sample. You might place it into a lab collection window or hand it to a technician. If you took the collection at home, place the container in a clean plastic storage bag. Then, take it to your medical provider right away. [18] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source If you have any questions about submitting your sample, ask your doctor’s office so that you understand what to do."
    },
    {
      "title": "Store the urine sample in your refrigerator if you need to hold it.",
      "content": "Store the urine sample in your refrigerator if you need to hold it. When your urine sits at room temperature, bacteria can multiply rapidly. This can ruin your test results. To protect your sample, put it in a clean plastic bag and place it in your refrigerator until it’s time to take it to your doctor. [19] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Don’t store your urine longer than 24 hours. At that point, you’ll need to take a new sample using a fresh container."
    }
  ]
}