{
  "url": "https://www.wikihow.com/Bargain",
  "title": "How to Bargain",
  "steps": [
    {
      "title": "Know the situations in which it is appropriate to bargain.",
      "content": "Know the situations in which it is appropriate to bargain. Not all situations call for bargaining. A bazaar may be a great place to bargain, but an expensive shopping mall probably isn't. What's acceptable in one place is bad shopping etiquette in another. If you want to know whether it's acceptable to bargain, say something casual like \"It's just a little too expensive for me.\" If the merchant makes a counteroffer, he's effectively opening the door to bargaining, in which case, haggle away. If he stands pat, it's probably not okay to bargain at that location."
    },
    {
      "title": "Find out what locals pay.",
      "content": "Find out what locals pay. In most places where haggling or bargaining is common, there's a double standard when it comes to the price tag: What locals pay is often far less than what tourists pay. [1] X Research source Even if you find that an alpaca scarf costs 60 for locals but 100 for tourists, don't necessarily expect to be able to bargain down the price of the scarf to 60. Many vendors won't sell the \"locals\" price to tourists out of principle, although you may be able to get pretty close if you're skilled."
    },
    {
      "title": "Determine what the item is worth to you.",
      "content": "Determine what the item is worth to you. This is a tried and true shopping rule that applies to buying things in general. But it especially applies to bargaining. Many bargainers think that if they can cut the price in half, they've gotten a good deal. But many vendors simply triple the first offer in anticipation of this, which means you'd technically be getting a bad deal if you were to buy. If you know what the item is worth to you, it doesn't really matter how the vendor prices his or her item — as long as you're happy with the price paid."
    },
    {
      "title": "Have cash in hand.",
      "content": "Have cash in hand. In many places where it's common to bargain, cash is king. Vendors either won't accept credit cards or will be displeased about them. [2] X Research source There are a couple benefits to carrying cash instead of opting for credit: You won't be enticed to splurge on an item because you'll be limited by how much cash you have. Budget ahead of time and you're guaranteed to stick to your budget. Reaching out with a handful of cash and exclaiming \"It's all the cash I have\" is a good trick that often works. Vendors will be tempted to go ahead and grab the cash in exchange for the item."
    },
    {
      "title": "Know the value of an item for you.",
      "content": "Know the value of an item for you. If an item is worth more to you than you paid for it, it doesn't really matter whether you paid more than the local. By definition, you got your money's worth. If the vendor you're bargaining with refuses to go down to the price at which the item is valuable to you, it should be easy to walk away."
    },
    {
      "title": "Don't project fondness or over-enthusiasm for whatever you're eyeing.",
      "content": "Don't project fondness or over-enthusiasm for whatever you're eyeing. One of the biggest mistakes people make is telegraphing their fondness for an item. As soon as the vendor knows you like something, he has the upper hand in the negotiation. On the other hand, if he believes you're on the fence for the item, you have the upper hand because you can always walk away, or at least pretend to walk away."
    },
    {
      "title": "Start 25% to 30% lower than the listed offer or the first offer.",
      "content": "Start 25% to 30% lower than the listed offer or the first offer. A good rule of thumb is to take whatever the first offer is, quarter it, and begin the bargaining process there. Hack off a half from the first offer and you risk insulting the vendor. Hack off only 10% and you're less likely to get a killer deal. [3] X Research source"
    },
    {
      "title": "Get a friend or spouse to work with you.",
      "content": "Get a friend or spouse to work with you. This trick works better than you might think at delivering the message that life's other responsibilities could easily get in the way of the sale. Here's what you do: Have a friend with you while you bargain. If they pretend to be bored, worried you're spending too much money, or who has an appointment to catch, the vendor could cut straight to the chase and offer you near the lowest or the lowest offer. [4] X Research source"
    },
    {
      "title": "Don't be afraid to walk away from an item, even one that you love.",
      "content": "Don't be afraid to walk away from an item, even one that you love. You'll get the lowest offer, or near the lowest offer, by being prepared to walk away. As soon as you walk away, the vendor loses the sale, and people all over the world hate to lose sales. They should offer you one of their lowest prices. [5] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Be prepared to spend a long time bargaining.",
      "content": "Be prepared to spend a long time bargaining. It's not unheard of to spend hours haggling about price. Vendors in a position to bargain draw out the process because they understand that many people are simply impatient and are willing to pay more for the convenience of getting the item and being done with it. Vendors can feign embarrassment, disappointment, and insult throughout the bargaining process, using emotion to draw the bargaining to an end. Don't bite. [6] X Research source Keep steady and you should get near the price you were looking for. The bargaining process might look something like this: Seller : \"That'll be fifty, ma'am.\" Buyer: \"I'll give you twenty.\" Seller : \"How about forty-five?\" Buyer: \"How about twenty?\" Seller : \"Fine. I'll be willing to settle for thirty-five.\" Buyer: \"And I can settle for twenty-five.\" Seller : \"Thirty?\" Buyer: \"Twenty-five.\" Seller : \"I will take twenty-seven.\" Buyer: \"And I will give you twenty-six.\" Seller : \"Twenty-seven is my final offer.\" Buyer: \"And twenty-six is mine.\" Seller : \"Twenty-six fifty?\" Buyer: \"Twenty-six.\" Seller : \"Twenty-six it is, then, ma'am.\""
    },
    {
      "title": "Don't take the \"final offer\".",
      "content": "Don't take the \"final offer\". This usually isn't the final offer. They may be trying to convince you that that is as low as they'll go. Tell the vendor your final offer, which should be 1-10 below, and work together from there. If that doesn't happen, walk away. He'll call you back and give you a killer deal. After all, to him, although fifty is better than twenty-six, twenty-six is better than nothing."
    },
    {
      "title": "Stop when you get a good price.",
      "content": "Stop when you get a good price. Don't push it, or you'll ruin the whole deal. Take your item and go. Be pleased with your new acquisition and the knowledge that you can bargain with the best of them!"
    }
  ]
}