{
  "url": "https://www.wikihow.com/Buy-Direct-from-a-Wholesale-Company",
  "title": "How to Buy Direct from a Wholesale Company",
  "steps": [
    {
      "title": "Establish your business entity.",
      "content": "Establish your business entity. You should set up the legal form of your business, such as a corporation, limited liability company, partnership, or sole proprietorship. You may have to file forms with your state’s Secretary of State’s office (or an equivalent office). To form an LLC , file Articles of Organization with your state and pay the necessary fee. To form a corporation, you will need to file Articles of Incorporation and pay a fee."
    },
    {
      "title": "Obtain a tax payer’s ID.",
      "content": "Obtain a tax payer’s ID. You’ll need to pay taxes to the government, so you should get a taxpayer ID number. If you are a sole proprietor, you can use your Social Security Number. Otherwise, you should apply for a Federal Employer Identification Number (FEIN) with the IRS. Apply for your FEIN here: https://www.irs.gov/businesses/small-businesses-self-employed/apply-for-an-employer-identification-number-ein-online ."
    },
    {
      "title": "Get a reseller’s permit.",
      "content": "Get a reseller’s permit. This permit allows you to buy goods from a wholesale supplier without having to pay a sale’s tax. Instead, you charge and collect sales tax when you sell to the public. If you buy from a wholesaler without becoming a reseller with the necessary permit, you end up paying taxes to them. [2] X Research source Furthermore, some wholesalers won’t even sell to the public because they don’t want to bother collecting taxes. This permit or license goes by different names, depending on the state. It might be called a resale permit, resale certificate, reseller’s certificate, sales tax ID, or sales tax permit. [3] X Research source Contact your state’s taxing authority to ask how to get the permit. Generally, you’ll need to complete an application. Some states might use your taxpayer ID as your sales tax ID, although others won’t."
    },
    {
      "title": "Search online.",
      "content": "Search online. The easiest way to find wholesale companies is on the Internet. You should search by the product you want to buy and include your zip code to narrow the results. [4] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source For example, if you want to buy T-shirts and are located in Brooklyn, you can type “t-shirt wholesale Brooklyn.” You might also check online wholesale directories, such as Wholesale Central. [5] X Research source You can search by location and merchandise using advanced search."
    },
    {
      "title": "Visit trade shows.",
      "content": "Visit trade shows. Many wholesale suppliers attend industry trade shows. You can find upcoming trade shows by searching trade show directories such as 10times and TSNN. [6] X Research source Search by location and industry. [7] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source For example, if you are in the bridal/marriage business, then don’t search for trade shows catering to the insurance industry. However, think broadly. As part of your bridal business, you might use extensive printing and graphics. You could attend a trade show for the graphics/printing industry if you need to buy printing supplies in bulk."
    },
    {
      "title": "Read trade magazines.",
      "content": "Read trade magazines. Your industry might have a few standard trade magazines. You can find them in your library or research them online. Try to locate a physical copy of the magazine or journal and look at the ads. Wholesale advertisers often put ads in these magazines. [8] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source If your library is small, it probably doesn’t carry trade magazines. However, ask the interlibrary loan department if you can get a copy from another library."
    },
    {
      "title": "Get referrals from business owners.",
      "content": "Get referrals from business owners. Other business owners will know the best wholesale suppliers you can buy directly from. Ask around and write down the names and contact information for the suppliers. Obtaining referrals this way can be tricky because competitors don’t want to let you know where they get merchandise for rock bottom prices. However, you can try to connect with other business owners at out-of-state networking events. [9] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source Also ask business owners in a slightly different industry. For example, you might sell T-shirts as part of a youth apparel business. Someone else might use T-shirts as a free giveaway when consumers purchase computer services. You aren’t direct competitors, though you both use T-shirts."
    },
    {
      "title": "Contact brand manufacturers.",
      "content": "Contact brand manufacturers. Generally, brand manufacturers only sell directly to large businesses because manufacturers sell in large volume. However, you can still call and ask who you can buy from as a small business. The manufacturer can give you the names of distributors or small wholesalers. [10] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source Look for the brand manufacturer’s contact information online. Alternately, you can look at the packaging for some of the products, which may contain a manufacturer’s contact information."
    },
    {
      "title": "Assess potential wholesale suppliers.",
      "content": "Assess potential wholesale suppliers. It can be hard to find information about wholesalers. Unfortunately, there are plenty of shady middlemen who hold themselves out as wholesalers. You should analyze the following: [11] X Research source Is the wholesaler selling to the public? Legitimate wholesalers only sell to retail establishments. Are you charged a monthly fee? Legitimate wholesale companies don’t charge a monthly fee. However, they will charge a fee if you are running a drop-ship business ."
    },
    {
      "title": "Create a wholesale account.",
      "content": "Create a wholesale account. Once you find a wholesale company you want to do business with, you should tell them you want to create an account. They will request information from you to find out if you are a legitimate business. [12] X Research source For example, they will want to see your reseller’s permit, tax ID, and legal documents. You’ll also have to be approved—possibly before they will even negotiate with you about prices."
    },
    {
      "title": "Get quotes from multiple suppliers.",
      "content": "Get quotes from multiple suppliers. Don’t go with the very first person you find. Instead, get quotes from at least three different wholesale companies. [13] X Research source That way, you can be sure to get the best deal. This isn’t always possible. If you need a certain brand, then you might be stuck going with one distributor or wholesaler."
    },
    {
      "title": "Discuss price.",
      "content": "Discuss price. Price is tricky, especially if you are a small business. Wholesalers reduce the price per item when you buy a large number. However, as a small business, you might not be able to store thousands of products at one time. If you are an established business, prove it to the wholesale company. They are more likely to do business with someone who has a track record of selling large quantities of products. [14] X Research source When negotiating, tell the company you are getting other quotes. This knowledge might create an incentive for them to lower their prices. You can negotiate by offering to pay a higher deposit. If you pay 50-70%, you might have more leverage in the negotiation. Be suspicious of extremely low prices, which might be a sign the goods are low-quality. For this reason, you should ask for samples before settling on a contract."
    },
    {
      "title": "Lower prices by negotiating other terms.",
      "content": "Lower prices by negotiating other terms. If the wholesale supplier won’t budge on price, you should try to negotiate other favorable terms which can collectively lower your price. For example, try to get a better deal on the following: [15] X Research source Faster shipping for free. You can improve your client satisfaction by getting the products faster. A more comprehensive or longer warranty. Larger discounts when buying in bulk."
    },
    {
      "title": "Analyze other key terms.",
      "content": "Analyze other key terms. Pay attention to the following terms in the wholesale contract. You need a contract that works for your business, and you should be prepared to negotiate changes to the following if necessary: [16] X Research source Delivery schedule. Will the wholesaler send the goods when you need them? For example, if you can only accept goods in the morning, check that the wholesaler doesn’t only deliver after noon. Minimum orders. Some wholesalers might require a minimum purchase, e.g., 5,000 items. Check that the minimum is reasonable for your business, otherwise go with someone else. Return policy. The products might be defective or not what you were expecting. Make sure the contract allows you to return goods for a refund."
    },
    {
      "title": "Hire a lawyer to review any wholesale agreement.",
      "content": "Hire a lawyer to review any wholesale agreement. Find a business attorney and schedule a consultation. Show the lawyer the contract and ask if anything is missing or how else you can protect yourself. You can find a business lawyer by getting referrals from other business owners. You may also contact your local Chamber of Commerce and ask if they can refer you to anyone. Alternately, you can contact your nearest bar association and get a referral."
    }
  ]
}