{
  "url": "https://www.wikihow.com/Bleach-Your-Hair",
  "title": "How to Bleach Your Hair",
  "steps": [
    {
      "title": "Do your research to find the best products for you.",
      "content": "Do your research to find the best products for you. Find some photos of hair colors that you want to create with bleach and go online to look up what those colors are called and what products work best for creating them. Also consider what hair color you're starting with. Consider looking up something like: “What hair products work best for bleaching black hair?” or “How to bleach red hair platinum blonde.”"
    },
    {
      "title": "Buy bleaching supplies from a beauty supplies store.",
      "content": "Buy bleaching supplies from a beauty supplies store. To properly bleach your hair with professional supplies, you will need to buy a number of products. Each of these is important and will be crucial at different stages of the bleaching process. These products include: Bleach powder: this comes in either packets or tubs. Crème developer: choose this product according to the color of your natural hair. If your hair is already blonde or light brown, use a 10 or 20 volume (10V or 20V) developer. If your hair is dark brown or black, you'll need to use 20V developer and give it more time to process. Talk with a sales clerk to get their opinion on what you should purchase for your hair. Many professionals use 30V or 40V because it processes the bleach faster. Refrain from doing this alone at home because it can cause more damage than lower volumes. Toners even out the color of bleached hair and neutralize unwanted tones and brassiness. [1] X Expert Source Arthur Sebastian Professional Hair Stylist Expert Interview. 29 April 2019. Buy this if you're going for more of a platinum look. Some toners make hair white, and some give a silvery effect. Add red gold corrector to the bleach powder to increase its effectiveness so you don't have to bleach twice. You can use “purple shampoo” to remove brassiness and yellow tones. Don't use it often or it may stain your hair purple. Buy a tint brush, a bowl, and plastic wrap. Buy an extra package of bleach and developer so you have extra in case you run out midstream. Some people's hair will absorb the bleach mixture more quickly than others, and having extra bleach mixture on hand will save you the trouble of running out. You don't want to be halfway through your hair and find you don't have any more bleach mixture."
    },
    {
      "title": "Start with unprocessed hair.",
      "content": "Start with unprocessed hair. No matter what bleaching method you use, it's going to cause your hair to become drier and more fragile than normal. Starting with healthy hair prevents excessive damage from the bleaching process. Don't dye or otherwise process your hair for about a month before you plan to bleach it. Use gentle products, like shampoo and conditioner made from all natural ingredients, to make sure your hair is as healthy as possible before bleaching."
    },
    {
      "title": "Pre-condition your hair with a deep conditioner.",
      "content": "Pre-condition your hair with a deep conditioner. Use a deep conditioner a day or two before bleaching your hair to help build up moisture in your hair. There are many types of deep conditioners, from less expensive ($5-$8) to more expensive ($30+) store-bought ones to more natural, DIY ones. There are recipes to make your own deep conditioner, which typically use foods as their base. Search online for “deep conditioner recipes” for suggestions using bananas, avocados, mayonnaise, yogurt, eggs, coconut oil, or other foods. This step will help minimize ending up with extremely dry and brittle hair after you bleach it by increasing your hair's moisture and elasticity."
    },
    {
      "title": "Test for allergic reactions.",
      "content": "Test for allergic reactions. This step seems time-consuming, especially when you want to get started on bleaching your hair. But it is an important step that will save you a serious skin rash (or worse) if you happen to be allergic to the bleach or any of the other ingredients. To do a patch allergy test, apply a dab of bleach solution on a patch of skin behind your ear. Leave the bleach on for 24-48 hours and check for any allergic reaction, such as a rash, itching or burning on that spot. If you do have an allergic reaction, however mild, you should try a different method for bleaching your hair."
    },
    {
      "title": "Mix up the bleach.",
      "content": "Mix up the bleach. Read the instructions that came with the bleach powder to find out exactly how much to use. Usually, you mix one part bleach with two parts toner, but the instructions will give you precise measurements. Mix these in an old bowl with an old spoon or spatula that you will not be putting back into your kitchen. The mixture will be blue or bluish-white. Add the red gold color corrector if you're going for a more platinum look. Pay close attention to the instructions on the label to ensure your measurements and proportions are exact."
    },
    {
      "title": "Cover your skin and clothing.",
      "content": "Cover your skin and clothing. Peroxide can stain clothing and can be irritating to skin, so take care to cover yourself properly. Wear gloves and cover your clothes with an old towel. Apply a small amount of petroleum jelly along your hairline and neckline to protect your skin. Never apply bleach without gloves; the chemicals can burn your skin."
    },
    {
      "title": "Do a strand test.",
      "content": "Do a strand test. Gather up a small hunk of hair from the nape of your neck. Spray the peroxide onto this strand, starting at the roots and working it towards the ends. Leave it in for about 20-30 minutes. Rinse out the peroxide and check the color against a white towel. This will enable you to check if you like the color before dousing your entire head in peroxide. It will also help you gauge how much time to leave in the peroxide. [2] X Research source"
    },
    {
      "title": "Use hair clips to section your hair.",
      "content": "Use hair clips to section your hair. Divide your hair into a few sections and twist the sections up. Clip these sections into easily removable hair clips; it's best to use hair clips you can put in and take out with only one hand, especially after you start the bleaching process. Don't clip the first section you plan to bleach."
    },
    {
      "title": "Apply the bleach to your hair.",
      "content": "Apply the bleach to your hair. Make sure your hair is completely dry before you begin. Use the tint brush to apply the bleach. Keep the hair that has not been bleached separate from the hair that has been bleached, so you can keep track of where you're at. Use clips or squares of foil to separate sections of your hair. Depending on the style you're going for, you can use the tint brush to apply the bleach in different ways, including: roots to tips, tips to roots, etc. Don't rub the bleach into your head, since the chemicals can burn your scalp. To get salon quality highlights, separate out small sections of your hair that are less than an inch wide. Place foil squares under these sections to protect the rest of your hair from receiving any of the peroxide spray. Spray these sections and wrap them in the foil sheets to keep them from touching the rest of your hair while you let the peroxide sit in your hair. Highlighting your hair is probably easiest to do with a friend helping you. It can be a good idea to just apply bleach to the front section of your hair, allow it to process, and rinse, before doing the back section . Putting the bleach mixture over your whole head takes time, and you may not have enough time to finish the back section before the front section needs to be rinsed out."
    },
    {
      "title": "Check the color of your hair every several minutes.",
      "content": "Check the color of your hair every several minutes. Cover your hair with plastic wrap. Let the bleach start working on your hair. The longer you leave it in, the lighter your hair will be. Keep checking a strand of hair every 10 minutes until you're satisfied with the color of your hair. Don't leave the bleach in your hair for more than 45 minutes total. Several factors, including the volume of your developer and the darkness of your hair, influence how long it will take for the bleach to lift your hair color to the lightness you desire."
    },
    {
      "title": "Rinse out the bleach and wash your hair.",
      "content": "Rinse out the bleach and wash your hair. Rinse out all of the bleach with cool water. Then use the special shampoo for bleached hair. Dry your hair and check out the color. If you like the color, you can stop there. Style your hair normally. Be aware of the different hues that a bleach job will give you, depending on your hair color. Dark brown hair will lighten to chestnut brown, but too much peroxide may result in an orange-brown color. Medium brown will turn to light brown; light brown will turn dark blond; red hair will turn orange, and with enough bleaching, will become strawberry blond; dark blond will turn light blond. [3] X Research source"
    },
    {
      "title": "Decide if you need to use toner.",
      "content": "Decide if you need to use toner. Some people will need to tone their hair to achieve a nice white blond color, or to even out some of the color imperfections that their hair has after bleaching. This may not work for everyone, however, and can result in white-gray hair that you may not like. [4] X Research source The stage for adding toner comes in after you have fully bleached your hair and you will not be trying to bleach your hair further. You should have also already washed and dried your hair so that you can assess the color that your hair has become. Toner can help fix any unwanted orange tones in your roots. [5] X Expert Source Arthur Sebastian Professional Hair Stylist Expert Interview. 29 April 2019."
    },
    {
      "title": "Mix up the toner.",
      "content": "Mix up the toner. Use an old mixing bowl and old spatula and put in the correct parts toner, developer and red gold corrector. Be sure to check the instructions on the box to get the correct proportions and measurements."
    },
    {
      "title": "Apply toner to your hair.",
      "content": "Apply toner to your hair. Dry your hair at least a little bit with a towel. Use a clean tinting brush to apply toner to your hair in sections, using clips or pieces of tin foil to separate sections that have toner on them from those that still need an application. Applying the toner is not as time-sensitive as the bleach application stage, so you can take your time a little more now."
    },
    {
      "title": "Leave the toner in your hair for about 30 minutes.",
      "content": "Leave the toner in your hair for about 30 minutes. This varies depending on the product you are using, but 30 minutes is about the norm. Wait until the toner turns a dark purple in your hair. Check your hair after about 15 minutes to see how it looks by wiping off some of the purple toner. Keep checking every 10 minutes until you have reached the color you want."
    },
    {
      "title": "Rinse out the toner.",
      "content": "Rinse out the toner. Rinse your hair under cool water until all traces of the toner are gone. Cool water is better than warm water since it stops the developing process, which will stop the chemicals from removing more color from your hair."
    },
    {
      "title": "Wash your hair with the purple shampoo.",
      "content": "Wash your hair with the purple shampoo. Purple shampoo is a type of toning shampoo that is used to help distribute purple pigment to counteract brassy hues in your hair. By adding a little bit of purple pigment to your hair, you neutralize some of the reds and yellows in bleached hair, bringing out some blue hues and making your hair a slightly cooler color. Rinse your hair in hot water briefly so that the hair shafts open and are ready to absorb more of the purple hue. Apply shampoo liberally to your hair, let it sit for up to 5 minutes, and then rinse with cool water. The cool water will seal up the hair shafts and help retain the purple tones in your hair. Make sure you rinse it out completely, however, because it will stain towels and it can potentially leave your hair a lavender color if you have white blond hair. There are several different brands and prices for these, from Clairol Professional Shimmer Lights Shampoo for about $10 per bottle to Unite Blonda Toning Shampoo for about $30. Your best bet is to purchase this type of shampoo at a beauty supplies store. Talk to a sales clerk for advice on the best shampoo for your hair."
    },
    {
      "title": "Take care of your hair.",
      "content": "Take care of your hair. Your hair will be brittle and dry after this treatment and will need deep conditioning to restore some moisture and elasticity. Use a deep conditioner (store-bought or natural) at least once a week, leaving it in your hair for 20-30 minutes and then rinsing it out. Results can be improved by heating up your hair with a hair dryer while the deep conditioner is in place. If you have made your own deep conditioner with food, check to make sure it hasn't gone bad. If it's been mixed up for longer than a few days (or a week if kept in the refrigerator), throw it away and mix up a new batch."
    },
    {
      "title": "Buy hydrogen peroxide.",
      "content": "Buy hydrogen peroxide. Hydrogen peroxide is a chemical compound that serves many household uses, from cleaning cuts to disinfecting countertops to removing stains. It can also be used to bleach your hair. Hydrogen peroxide is readily available at grocery or drug stores, costing just a couple of dollars for a 32 ounce (910 g) bottle. Make sure the peroxide strength is no greater than 3% by double-checking the bottle's label of active ingredients. A stronger solution than this can severely damage your hair. [6] X Research source"
    },
    {
      "title": "Start with unprocessed hair.",
      "content": "Start with unprocessed hair. No matter what bleaching method you use, it's going to cause your hair to become drier and more fragile than normal. Starting with healthy hair prevents excessive damage from the bleaching process. Don't dye or otherwise process your hair for about a month before you plan to bleach it. Use gentle products, like shampoo and conditioner made from all natural ingredients, to make sure your hair is as healthy as possible before bleaching."
    },
    {
      "title": "Pre-condition your hair with a deep conditioner.",
      "content": "Pre-condition your hair with a deep conditioner. Use a deep conditioner a day or two before bleaching your hair to help build up moisture in your hair. There are many types of deep conditioners, from less expensive ($5-$8) to more expensive ($30+) store-bought ones to more natural, DIY ones. There are recipes to make your own deep conditioner, which typically use foods as their base. Search online for “deep conditioner recipes” for suggestions using bananas, avocados, mayonnaise, yogurt, eggs, coconut oil, or other foods. This step will help minimize ending up with extremely dry and brittle hair after you bleach it by increasing your hair's moisture and elasticity."
    },
    {
      "title": "Test for allergic reactions.",
      "content": "Test for allergic reactions. This step seems time-consuming, especially when you want to get started on bleaching your hair. But it is an important step that will save you a serious skin rash (or worse) if you happen to be allergic to the bleach or any of the other ingredients. To do a patch allergy test, apply a dab of bleach on a patch of skin behind your ear. Leave the bleach on for 24-48 hours and check for any allergic reaction, such as a rash, itching or burning on that spot. If you do have an allergic reaction, however mild, you should ty a different method for bleaching your hair."
    },
    {
      "title": "Pour peroxide into a spray bottle.",
      "content": "Pour peroxide into a spray bottle. Use a clean spray bottle or a recycled one that has been thoroughly washed and dried. This will help you aim your spray more evenly and accurately when applying it to your hair. Gather some cotton balls to aid in a more precise application. Do a few test squirts to make sure the spray bottle is functioning properly."
    },
    {
      "title": "Cover your skin and clothing.",
      "content": "Cover your skin and clothing. Peroxide can stain clothing and can be irritating to skin, so take care to cover yourself properly. Wear gloves and cover your clothes with an old towel. Apply a small amount of petroleum jelly along your hairline and neckline to protect your skin."
    },
    {
      "title": "Dampen your hair and clip it into sections.",
      "content": "Dampen your hair and clip it into sections. Wet your hair with lukewarm water and pat it dry with a towel. Let it air dry for a few minutes until it's still damp, but not dripping wet. Use hair clips to section your hair. Divide your hair into a few sections and twist the sections up. Clip these sections into easily removable hair clips; it's best to use hair clips you can put in and take out with only one hand, especially after you start the bleaching process. Don't clip the first section you plan to bleach. You can also apply melted coconut oil to your hair before bleaching to help protect your hair. To melt the coconut oil, place the sealed jar into hot water. This will liquefy the oil. Pour the oil all over your head and rub it into your hair. Wrap your hair in a plastic cap and let the oil soak into your hair for a few hours (overnight is best). Do not rinse your hair before applying the bleach."
    },
    {
      "title": "Do a strand test.",
      "content": "Do a strand test. Gather up a small hunk of hair from the nape of your neck. Spray the peroxide onto this strand, starting at the roots and working it towards the ends. Leave it in for about 20-30 minutes. Rinse out the peroxide and check the color against a white towel. This will enable you to check if you like the color before dousing your entire head in peroxide. It will also help you gauge how much time to leave in the peroxide. [7] X Research source Be aware of the different hues that a bleach job will give you, depending on your hair color. Dark brown hair will lighten to chestnut brown, but too much peroxide may result in an orange-brown color. Medium brown will turn to light brown; light brown will turn dark blond; red hair will turn orange, and with enough bleaching, will become strawberry blond; dark blond will turn light blond. [8] X Research source"
    },
    {
      "title": "Spray your hair with peroxide.",
      "content": "Spray your hair with peroxide. Dampen the first section of your hair by spraying it with peroxide from the spray bottle. Make sure to spray it from all sides. The more peroxide solution you use on your hair, the lighter your hair will get. Be careful to only spray directly onto your hair, not your scalp; the peroxide may irritate your skin. Go slowly, paying careful attention to how your hair is reacting to the peroxide as you progress. When the first section is damp, unclip a second section and spray it with peroxide. Repeat until all of your hair has been treated. If you want to highlight a few strands of hair rather than spraying your entire head, dip a cotton ball in the peroxide and rub it on the strands you wish to die. To bleach streaks in your hair, separate out the chunks that you want to bleach. Place foil squares under these chunks to protect the rest of your hair from receiving any of the peroxide spray. Spray these chunks and wrap them in the foil sheets to keep them from touching the rest of your hair while you let the peroxide sit in your hair. Streaking your hair is probably easiest to do with a friend helping you."
    },
    {
      "title": "Let the peroxide sit for about 30 minutes.",
      "content": "Let the peroxide sit for about 30 minutes. The longer you leave the peroxide in, the brighter your hair will become. Be careful not to let the peroxide sit in your hair for more than 45 minutes. If the peroxide begins irritating your scalp, wash it out right away. Using a hair dryer on your hair or another heater during this process may speed up the time it takes to reach your desired color. Even though the hair dryer will speed the process, be aware that the heat can damage your hair and could cause hair damage. [9] X Research source This is not necessary, however, and if you are not sure how your hair reacts to peroxide, you should skip this heating step."
    },
    {
      "title": "Rinse out the peroxide.",
      "content": "Rinse out the peroxide. Use cool water to remove all traces of peroxide from your hair, then use a deep conditioner to restore its moisture. Allow your hair to dry, then style as usual."
    },
    {
      "title": "Revisit the bleaching process in a week.",
      "content": "Revisit the bleaching process in a week. If this first round has not left you with the color that you're aiming for, you can bleach your hair with peroxide again. It's advisable to wait a week between treatments, however, to give your hair time to recover. The bleaching process is highly damaging to your hair and if you bleach your hair two or more times in one day (or even in one week), you risk causing serious damage to your hair (meaning, your hair might even fall out). [10] X Research source"
    },
    {
      "title": "Take care of your hair.",
      "content": "Take care of your hair. Your hair will be brittle and dry after this treatment and will need deep conditioning to restore some moisture and elasticity. Use a deep conditioner (store-bought or natural) at least once a week, leaving it in your hair for 20-30 minutes and then rinsing it out. Results can be improved by heating up your hair with a hair dryer while the deep conditioner is in place. If you have made your own deep conditioner with food, check to make sure it hasn't gone bad. If it's been mixed up for longer than a few days (or a week if kept in the refrigerator), throw it away and mix up a new batch."
    },
    {
      "title": "Have a consultation with a trusted hairstylist or colorist.",
      "content": "Have a consultation with a trusted hairstylist or colorist. Most hairstylists are trained in how to properly bleach hair, but some may be more skilled at it than others. Schedule a brief consultation with your hairstylist so you can strategize how you might want to bleach your hair. Ask your hairstylist how often they've bleached hair, how they've handled different types of hair, etc. Also ask for their recommendations on how to handle your hair and how they think your hair will react to the bleaching process. You should also ask if your hair is healthy enough to bleach. Some colorists won't bleach hair that has already been color-treated, because it is such a damaging process. [11] X Research source"
    },
    {
      "title": "Decide on a hue of bleached hair.",
      "content": "Decide on a hue of bleached hair. Bleached hair does still have variety in terms of hues. You can choose white hair, white blond, platinum blond, or a few other hues. Bring in a picture of someone with the same shade of hair that you'd like. This will help your hairstylist figure out the best approach to bleaching your hair."
    },
    {
      "title": "Be prepared to spend time in the chair.",
      "content": "Be prepared to spend time in the chair. The bleaching process is a slow process and does not happen instantly. The hairstylist needs time to wash your hair, mix up the bleach solution, and apply it to your hair. It needs to sit in your hair for a while (30 minutes or so). Then your hairstylist needs to wash it out and dry your hair. You may need to schedule a second session with your hairstylist if you have very dark hair and you want to go white blond. [12] X Research source Your hairstylist is also skilled at bleaching highlights into your hair. It is also much easier for another person to do this process, rather than trying to do it yourself. They can see your head from above and can apply bleaching solution evenly over your head."
    },
    {
      "title": "Take care of your hair.",
      "content": "Take care of your hair. Your hair will be brittle and dry after this treatment and will need deep conditioning to restore some moisture and elasticity. Use a deep conditioner (store-bought or natural) at least once a week, leaving it in your hair for 20-30 minutes and then rinsing it out. Results can be improved by heating up your hair with a hair dryer while the deep conditioner is in place. If you have made your own deep conditioner with food items, check to make sure it hasn't gone bad. If it's been mixed up for longer than a few days (or a week if kept in the refrigerator), throw it away and mix up a new batch."
    },
    {
      "title": "Start with unprocessed hair.",
      "content": "Start with unprocessed hair. No matter what bleaching method you use, it's going to cause your hair to become drier and more fragile than normal. Starting with healthy hair prevents excessive damage from the bleaching process. Don't dye or otherwise process your hair for about a month before you plan to bleach it. Use gentle products, like shampoo and conditioner made from all natural ingredients, to make sure your hair is as healthy as possible before bleaching."
    },
    {
      "title": "Pre-condition your hair with a deep conditioner.",
      "content": "Pre-condition your hair with a deep conditioner. Use a deep conditioner a day or two before bleaching your hair to help build up moisture in your hair. There are many types of deep conditioners, from less expensive ($5-$8) to more expensive ($30+) store-bought ones to more natural, DIY ones. There are recipes to make your own deep conditioner, which typically use foods as their base. Search online for “deep conditioner recipes” for suggestions using bananas, avocados, mayonnaise, yogurt, eggs, coconut oil, or other foods. This step will help minimize ending up with extremely dry and brittle hair after you bleach it by increasing your hair's moisture and elasticity."
    },
    {
      "title": "Juice several lemons.",
      "content": "Juice several lemons. Depending on how long your hair is and how much of it you want to bleach, you'll need the juice of 2 to 5 lemons. Cut the lemons in half and use a juicer or your hands to squeeze their juice into a bowl. Strain the seeds when you're finished juicing. Don't use lemon juice that comes in a bottle. It contains preservatives that may damage your hair."
    },
    {
      "title": "Dilute the lemon juice.",
      "content": "Dilute the lemon juice. Pouring full-strength lemon juice on your hair can really dry it out, so it's important to dilute the juice with water. Add an amount of water to the bowl that's equal to the amount of lemon juice."
    },
    {
      "title": "Pour the solution into a spray bottle.",
      "content": "Pour the solution into a spray bottle. It's best to use a new spray bottle, which can be purchased at most drug stores, but you can also recycle one you already have at home. If you're using a recycled spray bottle, make sure it is completely clean. Wash it out with soap and water before you fill it with the lemon juice solution. Shake the lemon juice solution well, and do a few test squirts to make sure the spray bottle is functioning properly."
    },
    {
      "title": "Spray your hair with lemon juice solution.",
      "content": "Spray your hair with lemon juice solution. Spray the area you want to bleach liberally with lemon juice solution, making sure the area is completely damp. Spray more lemon juice in the areas that you want to lighten the most. The more lemon juice you use, the lighter it will get. If you want to highlight a few strands of hair instead of bleaching it all over, use a cotton ball to rub lemon juice solution on the parts that you do want to bleach."
    },
    {
      "title": "Sit outside in bright sunshine.",
      "content": "Sit outside in bright sunshine. The sun will react with the lemon juice and cause your hair to lighten. Wait for all the lemon juice solution to completely dry in your hair for about 30 minutes. Be sure to cover yourself with sunscreen and clothing to protect yourself from the sun's rays as you bleach your hair. Remember that this process can dry out your hair. Sitting in the sun for a long time will help your hair get lighter, but it will also cause some damage."
    },
    {
      "title": "Wash your hair.",
      "content": "Wash your hair. After the lemon juice solution has dried, wash it out with shampoo and then condition your hair with a good moisturizing conditioner. Style it as usual. Once your hair is dry, take a look at the color. If you want it to be even lighter, repeat the process again in a few days. Don't bleach your hair with lemon juice more often than once every two or three weeks."
    }
  ]
}