{
  "url": "https://www.wikihow.com/Contact-Shaquille-O%27neal",
  "title": "Easy Ways to Reach Shaquille O’Neal or His Foundation",
  "steps": [
    {
      "title": "Reach out to Shaq through social media.",
      "content": "Reach out to Shaq through social media. Shaquille O’Neal is on Instagram @shaq. If you’d like to reach out to him directly, social media may be your best bet, as Shaq doesn't have a publicly available personal email address. You can send him a direct message via his Instagram page , but be aware that he’s very busy and may not respond to your message. This doesn’t mean it’s not worth reaching out to share how much he means to you, though! You'll need an Instagram account in order to message Shaq. Shaq is also on Facebook and Twitter under the username @shaq, but messaging abilities have been disabled on both platforms. Still, you can give him a follow to keep up to date on his goings-on! You can also leave comments under his posts on Instagram, Twitter, and Facebook to publicly share how much you love Shaq and engage with other fans (then take our quiz to see if you're an NBA expert!). In spring 2020, Shaq posted a phone number to Instagram: (818) 583-8345. You can text it, but know that this number won't connect you directly with Shaq. Instead, you can use it to receive text updates related to Shaq and his work. [1] X Research source"
    },
    {
      "title": "Book Shaq for an event at AthleteSpeakers.com or CelebrityTalent.net.",
      "content": "Book Shaq for an event at AthleteSpeakers.com or CelebrityTalent.net. If you’re looking to book Shaquille O’Neal for a corporate event, private party, social media campaign, fair or festival, or other virtual or in-person event, submit a request through Celebrity Talent’s website . [2] X Research source You can also book Shaq through Athlete Speakers . [3] X Research source The fee range for an event with Shaq in the U.S. is $100,000-$499,000. When requesting booking info, you may be asked for your budget, company contact info, and a description of the event for which you’d like to book Shaq. Note that Celebrity Talent and Athlete Speakers only serve as booking agents for events with Shaquille O’Neal, and they cannot reach out to Shaq on your behalf if you’re interested in sending fan mail or anything unrelated to a booking request."
    },
    {
      "title": "If you’re interested in Shaq’s activism, reach out to his foundation.",
      "content": "If you’re interested in Shaq’s activism, reach out to his foundation. The Shaquille O’Neal Foundation teams up with Boys & Girls Clubs and other organizations aiding underserved youth throughout America. [4] X Research source To ask a question or get involved, you can reach out through their social media accounts or via phone, or write them a letter. [5] X Research source Connect with the Shaq Foundation through Instagram , Facebook , Twitter , or LinkedIn . Write to the Shaq Foundation at 10845 Griffith Peak Dr Ste 520, Las Vegas, NV 89135-1555, United States, or call them at (702) 527-5808. [6] X Research source If you’re looking to request funding from the Shaq Foundation, know that they’re not accepting unsolicited funding requests at this time. [7] X Research source While the Shaq Foundation may be happy to help you with Foundation-related questions or concerns, they stipulate that they’re unable to connect fans with Shaq himself. [8] X Research source"
    },
    {
      "title": "If you’ve purchased Shaq shoes, reach out through their website.",
      "content": "If you’ve purchased Shaq shoes, reach out through their website. If you’re a Shaq customer and need to get in touch with a customer service rep, go to the “contact” page at Shaq.com to reach out. You’ll be asked to leave your name, email address, and phone number in addition to a brief message. [9] X Research source This message is unlikely to get to Shaquille O’Neal himself and will probably only be read by a customer service person, so if you’re dead-set on talking to Shaq himself, this probably isn’t your best bet. But if you’re just so pleased with your Shaq purchase that you can’t keep it to yourself, or if you’ve experienced any issues with your purchase, this is the place to share your feelings."
    }
  ]
}