{
  "url": "https://www.wikihow.com/Build-a-Go-Kart",
  "title": "How to Build a Go Kart",
  "steps": [
    {
      "title": "Draw up detailed plans for the go-kart you want to make.",
      "content": "Draw up detailed plans for the go-kart you want to make. Go-karts can be many different sizes, shapes, and designs. These homemade vehicles are amenable to any design elements you want to throw into them. The basic essentials are a chassis, a simple engine, and a steering/braking system. [1] X Research source Get creative in your planning for the project and produce detailed diagrams to make sure you get enough materials to complete the job. Look at other go-karts for inspiration and learn from kart-makers who've been there before. Alternatively, you can find schematics and plans online for many different types of models, if you'd rather let someone else do the planning. Use a template and modify it as you see fit. For specific chassis sizing, go to the CIK FIA website: http://www.cikfia.com/fileadmin/content/REGULATIONS/Technical/Technical%20Drawings/2017/Drawing_1.pdf"
    },
    {
      "title": "Size the go-kart appropriately.",
      "content": "Size the go-kart appropriately. The size of the go-kart should depend on the age and size of the driver. Make sure you plan the go-kart accurately and using specific measurements, in order to fit the correct materials into the kart. There are three sizes of karts, measured from the center of the kingpin to the middle of the rear axle: Baby kart: Ages 5-8, Frame size: 700 to 900 mm Cadet kart: Ages 8-12, Frame size: 900 mm to 1010 mm Full size kart: Ages 12 and up, Frame size 1040 mm"
    },
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. If you're short on cash, visit a scrap yard and see if you can pick up any low-cost parts. Or, you may be able to salvage parts from an old riding lawnmower or a junk go-kart found at a yard sale. Ask lawn mower repair services for spare parts or junked-out riding lawnmowers and used 4-cycle engines in the 10 to 15 horsepower range, with horizontal shaft and a drive clutch assembly. Here's what you'll need: For the chassis: 30 feet (9.2 m) of 1-inch (2.5 cm) square tubing 6 feet (1.8 m) of 0.75-inch (2 cm) round steel bar stock 6 feet (1.8 m) of 0.5-inch (1.5 cm) bar stock 3/16-inch (0.5 cm) thick steel plate in width and length slightly larger than your engine Plywood or metal (for seat and floorboards) Seat For engine: Engine (try an old lawnmower engine) Chain that fits the sprocket Bolts, washers Gas tank For the drive train: Wheels Steering wheel Gear and handbrake Driveshaft Bearings Steering shaft Brake pedal Throttle/go pedal"
    },
    {
      "title": "Obtain a welder.",
      "content": "Obtain a welder. If you've got no experience welding , you will have to hire a welder for this project. The most essential part of the go-kart is a solid chassis that'll hold you onto it while driving and house the engine. If you're going to weld it together out of pieces of bar stock, the welds should all be made with the proper heat, weld depth/penetration, and uniform weld beads. Otherwise, the welds may be weak, brittle, bubbly, cracked, and/or only surface deep, making your go-kart a death trap. If you don't have experience welding, don't start by putting together a go-kart. Start with other smaller projects if you want to learn."
    },
    {
      "title": "Consider buying a go-kart kit.",
      "content": "Consider buying a go-kart kit. If you're not interested in welding and designing your own go-kart, purchase a no-weld kit that you can put together with simple tools, featuring detailed instructions and schematics to make the job a snap. [2] X Research source [3] X Research source Available widely for about $550, you can have the satisfaction of putting together a go-kart yourself without the hassle of designing it and buying all the materials separately."
    },
    {
      "title": "Cut the metal tubing.",
      "content": "Cut the metal tubing. Cut your lengths of tubing to the appropriate lengths, given your design or schematics. For most designs, the front end will feature a camber angle, narrower than the rear, which will allow the wheels room to turn, allowing the chassis to twist slightly. To do this, mount a King Pin at the front corners where the wheels will be, to allow for easy twist. For an easy eye guide, consider marking up the floor of the garage or the area you're working with sidewalk chalk of the appropriate measurement, to keep you from having to remeasure repeatedly. You could even draw out the whole design on the ground and start laying it on top."
    },
    {
      "title": "Make a jig for your kart (optional).",
      "content": "Make a jig for your kart (optional). A jig is a flat piece of metal with slots for clamps to hold down the tubes. This will help you weld the tubes in the right place!"
    },
    {
      "title": "Weld the frame together according to your design.",
      "content": "Weld the frame together according to your design. Use concrete blocks to keep the frame elevated while you work, making sure all your connection points are solid and the chassis is secure. It needs to be strong enough to hold your weight and the weight of the engine, so it's not the time for a shoddy weld job. For more strength, use gussets at all corners."
    },
    {
      "title": "Assemble the front stub axles.",
      "content": "Assemble the front stub axles. Build your axle with a straight piece of 0.75-inch (2 cm) steel rod, and two bushings attached to your frame. Use washers and cotter pins drilled through the axle to keep the assembly in position. Install the front stubs that'll allow you to turn easily before messing with the steering column and attach your King Pin, to the steering arm. You'll need to have at least 110 degrees of angle on the front wheels, so plan accordingly. [4] X Research source"
    },
    {
      "title": "Install your rear axle and wheel assembly.",
      "content": "Install your rear axle and wheel assembly. You'll likely need to assemble an axle carrier with a bearing bracket for the rear axle, meaning that the axle itself can be welded to the frame while also spinning freely and snugly. [5] X Research source Weld a steel plate onto the chassis, securing the pressure plate outside with high-tensile bolts and lock nuts, to squeeze the bearing. Rather than making your own, you can also purchase these assemblies, sometimes called \"Pillar Bearing Units.\""
    },
    {
      "title": "Build your seat out of plywood and bolt it to the frame.",
      "content": "Build your seat out of plywood and bolt it to the frame. Drill holes in the plywood and install T nuts within the holes to provide support when bolting the seat to the frame. Cover the plywood with 2\" high-density foam, then cover the foam with marine vinyl. Secure the vinyl to the seat by stapling it to the underside or back portion of the plywood. Alternatively, you can try to salvage an old go-kart seat or an appropriately sized car seat from the junkyard to save money. Leave enough room for the steering, engine, and other controls."
    },
    {
      "title": "Install the engine mount.",
      "content": "Install the engine mount. Weld a flat piece of 3/16-inch (0.5 cm) thick steel plate to the rear frame to mount your engine. Place the engine on the plate, and mark the holes for the mounting bolts so that the engine pulley lines up with the drive pulley on your axle. Attach the drive pulley on the axle prior to mounting the axle in the bushings. You can either use a set screw to hold it in position or weld it directly to the axle, but it should be aligned with the pulley on your engine."
    },
    {
      "title": "Assemble your steering linkage.",
      "content": "Assemble your steering linkage. Use the 0.5-inch (1.5 cm) steel rod for linkages, and the 0.75-inch (2 cm) for your axles. To make the 90-degree bends in the 0.75-inch (2 cm) rod, you may have to use a torch to heat the steel. Provide adjustable links for aligning steering, because it is very important to have the proper caster and camber: front-wheel vertical and steering tilt."
    },
    {
      "title": "Install the wheels and brakes.",
      "content": "Install the wheels and brakes. Get some small racing wheels to give your kart the optimum acceleration and control. Fix them onto the axles with hubs and start working on the brakes, so the go-kart will be safe. For the brakes, fix a disc onto the rear axle and a caliper assembly onto the chassis for the most professional system possible. Often, you can acquire these assemblies in relatively good shape from junked motorbikes. They're the appropriate size and will be easy to work with. Install a brake pedal to operate with your foot, regardless of what kind of acceleration you have. Don't leave too much to do with your hands other than steering."
    },
    {
      "title": "Attach the throttle cable to the hand throttle.",
      "content": "Attach the throttle cable to the hand throttle. Depending upon your experience and the kind of engine you're working with, you may be able to put together a foot pedal, or you may just need to make it easy and throttle up like you would a lawnmower."
    },
    {
      "title": "Double-check your brakes and suspension system before test-driving.",
      "content": "Double-check your brakes and suspension system before test-driving. Even if you're going at relatively slow speeds, it's important to make sure you're not going to slip an axle on your first go-around. Double-check your welds, your brakes, and the engine's mounting. Then take 'er for a spin!"
    }
  ]
}