{
  "url": "https://www.wikihow.com/Comebacks-for-Haters",
  "title": "What to Say to Make Your Haters Back Off",
  "steps": [
    {
      "title": "End the conversation with a bang.",
      "content": "End the conversation with a bang. The best part about this one is following through on it. Walking away has never felt so satisfying than when you drop this juicy little quip and promptly wander off to talk to literally anyone else. “I’m just waiting for you to say something interesting. Take your time.” “Sorry, I’ve got literally anywhere else to be right now.”"
    },
    {
      "title": "Remind them that you’ve got better things to worry about.",
      "content": "Remind them that you’ve got better things to worry about. And while you’re at it, ask them why they’re so interested in you, anyway. Is their own life not exciting enough? Guess they just need to find their kicks harassing more interesting people. Pair it with the “Got your nose” gesture, with your thumb poking out from between your fingers. Pat your pockets and say, “Oof, I’m out of crap to give.” “Remind me: am I supposed to care?”"
    },
    {
      "title": "This is for when you’re just done with them altogether.",
      "content": "This is for when you’re just done with them altogether. It’s good to turn and walk away, but it’s even better to send them away from you, instead. Send a hater off with this response, and pair it with a curt “shoo” with your hand. “Oh, stay right there! You’re best from far away.” “Wait, take a step back real quick. And another… And another…”"
    },
    {
      "title": "Shut them down before they can get going.",
      "content": "Shut them down before they can get going. When coming up with a good comeback , short and sweet is often best. These 4 words are sure to stop them in their tracks, giving you plenty of time to saunter off. “Don’t mind me, just looking for your mute button.” “I wish you had a volume slider.”"
    },
    {
      "title": "Remind them why you're a cat person.",
      "content": "Remind them why you're a cat person. Or a dog person or a horse person. They may be rude about your animal obsession, but your preference for anything that’s not people is sometimes justified. Animals aren’t constantly on your nerves. “A pet rock would be more fun than you.” “Oh! Did you escape from the zoo again?”"
    },
    {
      "title": "Let them know you won’t fall for their lies.",
      "content": "Let them know you won’t fall for their lies. Dealing with a serial truth-stretcher ? Some people just can’t help but fib, and you ought to let them know that you see right through it. Stop them in their tracks with this burn. [1] X Research source “Do you smell that? Smells like B.S.”"
    },
    {
      "title": "Don’t let a tacky person get the best of you.",
      "content": "Don’t let a tacky person get the best of you. Whether it’s their fashion, favorite music, or even which soda they prefer at the fountain, bad taste is bad taste. You shouldn’t take anything from someone who doesn’t even know how to coordinate an outfit. “Were you born this lame? Or did you take lessons?” “You remind me of a saltine. Bland and disappointing.”"
    },
    {
      "title": "Fake them out with this one-two punch.",
      "content": "Fake them out with this one-two punch. Make the first sentence real sweet, then follow it up with a deadpan look for the second. Maybe throw in an eye roll. However you deliver this line, it’ll make it clear exactly how you feel about them. “Remember when we first met? Personally, I try not to.” “I wish we could go back to before we met. And then keep it that way.”"
    },
    {
      "title": "Turn the focus back on them.",
      "content": "Turn the focus back on them. Rude people are so busy making themselves other people’s problem, they forget to work out their own problems. A little reality check will remind them to work on themselves before they come for you. “I try not to punch down.” “Insulting you would just be mean. You’ve got enough on your plate without me adding to it.”"
    },
    {
      "title": "You can’t help someone who doesn’t want to be helped.",
      "content": "You can’t help someone who doesn’t want to be helped. And plenty of people don’t want to be helped. They’d rather keep believing what’s easy, even if what’s easy isn’t what’s right. This retort is for those times when their attitude isn’t even worth dealing with. [2] X Research source “I’d agree with you, but then I’d be wrong.” “You’re so wrong that you’re almost right.”"
    },
    {
      "title": "Encourage them to be the best version of themselves.",
      "content": "Encourage them to be the best version of themselves. But don’t be afraid to throw in a little sass when you do it. This one lets them know that you’re living your best life, while they’re just too bothered to live their own. “You need to talk to someone? Not me, obviously. But someone.” “I kinda feel bad for you. Get help.”"
    },
    {
      "title": "Use a classic comeback.",
      "content": "Use a classic comeback. It’s not anything new, but that’s only because it’s stood the test of time. If it ain’t broke, don’t fix it. In their case, though, there’s plenty to fix. For added effect, blow a little kiss as you walk away. That’s the best way to handle jealous people . “Too bad there’s no cure for jealous.” “Let me know when they find out what’s wrong with you.”"
    },
    {
      "title": "Give their nonsense a raincheck.",
      "content": "Give their nonsense a raincheck. If you’re lucky, people like them will run into a whole typhoon sooner rather than later—a real typhoon, or metaphorical one. Whichever comes first. In any case, you’re staying sunny and dry. “Do me a favor and walk into a volcano or something.”"
    },
    {
      "title": "Use this one on someone who’s a real downer.",
      "content": "Use this one on someone who’s a real downer. It takes a lot to turn that iconic fast-food frown upside down, but somehow, they could manage it. Save this comeback for people who always manage to yuck your yum. [3] X Research source “You’re like a Happy Meal toy. Cheap.” “Bet you make onions cry when you chop them.”"
    },
    {
      "title": "Give them a much-needed reality check.",
      "content": "Give them a much-needed reality check. It’s easy to be mean to other people when they think they’re the center of the universe. But the truth is, they’d be lucky to be even an asteroid. Or maybe space dust. Point is, they’re not the main character, and they should know it. “Your ego’s so big it has its own gravity.” “Call me an astronaut ‘cause I space out when I talk to you.”"
    },
    {
      "title": "Tell them how much you admire their self-care practices.",
      "content": "Tell them how much you admire their self-care practices. But then, maybe that self care isn’t quite working, since they seem to care much more focused on annoying other people. On the other hand, you’re out here handling your haters with ease. “Must be nice to never use your brain.”"
    }
  ]
}