{
  "url": "https://www.wikihow.com/Build-Plyo-Boxes",
  "title": "How to Build Plyo Boxes",
  "steps": [
    {
      "title": "Purchase an 8 by 4 feet (2.4 by 1.2 m) piece of plywood.",
      "content": "Purchase an 8 by 4 feet (2.4 by 1.2 m) piece of plywood. This material will become the sides of the jump box. You’ll need to cut 6 rectangles that are 3 different dimensions. You can pick up the plywood at your local home improvement store or order it online. [1] X Research source If you’re going to the store to pick up the plywood, make sure you take a vehicle that can fit the wood."
    },
    {
      "title": "Measure and mark your plywood pieces.",
      "content": "Measure and mark your plywood pieces. To create a jump box, you’ll need 6 rectangles: 2 that are 28 by 20 inches (71 by 51 cm), 2 that are 28 by 22.5 inches (71 by 57 cm), and 2 that are 22.5 by 18.5 inches (57 by 47 cm). Since your plywood is 8 by 4 feet (2.4 by 1.2 m), you’ll have more than enough material to make these 6 rectangles. Use a permanent marker to mark the spots on the plywood where you want to cut."
    },
    {
      "title": "Cut out the rectangles using a skill saw or table saw if you have one.",
      "content": "Cut out the rectangles using a skill saw or table saw if you have one. Run the saw along the pencil markings you made slowly and deliberately. Place one hand on each side of the saw to firmly hold the wood in place. Cut out one rectangle at a time. Once you’ve cut out one rectangle, detach it from the big piece of plywood and put it off to the side. This will make it easier to cut the rest of the rectangles. [2] X Research source Be sure to wear goggles and gloves to protect your eyes and hands from wood"
    },
    {
      "title": "Ask your local hardware store to cut the wood if you don’t have a saw.",
      "content": "Ask your local hardware store to cut the wood if you don’t have a saw. If you’re not comfortable using a saw or don’t have one, go to your local hardware store. All you have to do is bring them the wood and the dimensions and they’ll make the cuts. [3] X Research source If it’s your first time asking a hardware store to cut wood for you, they’ll most likely do it for free. If it’s your second or third time asking, you’ll have to pay a few dollars. Call ahead to set up a time for you to go the hardware store. You never know how busy they’ll be."
    },
    {
      "title": "Put the box together by hand to see if the pieces line up.",
      "content": "Put the box together by hand to see if the pieces line up. Take one of the 22.5 by 18.5 in (57 by 47 cm) rectangles and put it on the floor. This will be the base of your jump box. Then, put the 28 by 20 in (71 by 51 cm) pieces on opposite sides of the bottom rectangle with the 28 in (71 cm) sides going upwards and the 20 in (51 cm) sides on the part of the bottom rectangle that’s 18.5 inches (47 cm) long. Add the 28 by 22.5 in (71 by 57 cm) rectangles to the remaining sides of the bottom rectangle, with the 22.5 in (57 cm) side lined up with the 22.5 in (57 cm) edge of the bottom rectangle. [4] X Research source If the wood doesn’t line up, you’ll have to go back and make cuts to change this."
    },
    {
      "title": "Apply the glue to every edge that touches a different edge.",
      "content": "Apply the glue to every edge that touches a different edge. Apply Gorilla glue in a thick, even coat down the thin sides of the plywood. Work one piece at a time, then press the pieces together. Leave them to dry for 10-15 minutes before moving on to the next piece. [5] X Research source Wipe off the excess glue that drips down the sides of the plywood as you wait."
    },
    {
      "title": "Drill wood screws into the edges of the rectangles to connect the pieces.",
      "content": "Drill wood screws into the edges of the rectangles to connect the pieces. Place these wood screws about 5 inches (13 cm) apart and drill them into all 4 sides of the top and bottom piece of plywood. Then, drill wood screws about 5 inches (13 cm) apart along the left and right sides of the 28 by 22.5 in (71 by 57 cm) rectangles. [6] X Research source The goal is to have screws connecting each piece of plywood to every piece of plywood that it’s touching."
    },
    {
      "title": "Let the box sit for 2 hours before testing it.",
      "content": "Let the box sit for 2 hours before testing it. Though the Gorilla glue dried during application, give your box a few hours to fully set. Then, once the box feels sturdy, gently step on it to test it out. If it holds, lightly jump on it to ensure the box is safe, and not wobbly. [7] X Research source The beauty of having a 28 by 24 by 20 in (71 by 61 by 51 cm) jump box is that it gives you 3 separate heights with which to work. You can start with 20 in (51 cm) box jumps and work your way up to the bigger heights with time and practice."
    },
    {
      "title": "Spray paint your jump box to decorate it.",
      "content": "Spray paint your jump box to decorate it. This is an optional step, but one that give your jump box a professional look. Coat the box with an even spray, using whichever color you’d like. Once you’ve painted each side of the jump box once, add a second coat to each side to give your box a polished finish. [8] X Research source Work in the garage or outside your home and wear a respirator if you have one. If you’re working in your garage, make sure you open the windows and garage doors to properly ventilate the area."
    },
    {
      "title": "Focus on your form before doing full exercises.",
      "content": "Focus on your form before doing full exercises. Set the jump box at 20 inches (51 cm) high to practice your form. Stand in front of your jump box and set your feet shoulder-width apart. Squat down and swing your arms backwards. Then, swing your arms forward and jump off the ground. Try to land on the box as softly as possible. [9] X Research source When you land on the box, you want your feet flat and your knees slightly bent."
    },
    {
      "title": "Keep the jump box 20 inches (51 cm) high to start practicing.",
      "content": "Keep the jump box 20 inches (51 cm) high to start practicing. To get a feel for your new jump box, position it so that the box is 20 inches (51 cm) high. This way, you can gauge how comfortable you are with the jump box without straining your body. Do 5 jumps, taking a short break in between each jump, to start. [10] X Research source When you feel like you can consistently make this jump, flip the box over to try a more challenging jump."
    },
    {
      "title": "Switch your jump box to 24 inches (61 cm) high when you’ve mastered the first height.",
      "content": "Switch your jump box to 24 inches (61 cm) high when you’ve mastered the first height. Start by flipping the box so that the 24 in (61 cm) sides are facing up. Focus on each individual jump to strengthen your body. Do 5 sets of 5 reps apiece and rest for 3-5 minutes in between each set. When you get comfortable with this height, you can switch the box to 28 inches (71 cm) high. [11] X Research source Stop doing box jumps once your form fails. Wait an extra few minutes, reset yourself mentally and physically, and then start doing box jumps again. Make sure to focus on your form. 5 quality box jumps are better than 15 bad box jumps."
    },
    {
      "title": "Do a few reps on the 28 in (71 cm) box to build power and speed.",
      "content": "Do a few reps on the 28 in (71 cm) box to build power and speed. To get explosive power in your legs, work on high box jumps. Do 3 sets of 3 jumps each and take a 1-minute break in between each set. Take your time with each jump and focus on nailing the fundamentals as opposed to just getting through the exercise as quickly as possible. To improve your endurance and foot speed, flip the box to 20 inches (51 cm) high and do 3-4 sets of 20 reps each. Take a 1-minute break in between each set. This is also a great way to burn fat! Alternatively, you can do a dumbbell press on an exercise ball. When you do it, ensure that your feet can touch the ground firmly. Keep your core tight and posture tall. Start with a weight you are comfortable with for a few reps before increasing to a more challenging weight."
    }
  ]
}