{
  "url": "https://www.wikihow.com/Contact-Uber-Eats",
  "title": "6 Easy Ways to Contact Uber Eats About Order Issues",
  "steps": [
    {
      "title": "Dial 1-800-253-9377 on your phone.",
      "content": "Dial 1-800-253-9377 on your phone. If you want to call Uber Eats directly, this phone number is the only official phone number to do so. Uber Eats users have varying levels of success contacting Uber Eats by phone. Some people have had good results using this phone number, but you may need to browse the menus a bit–the options change frequently. If you are a restaurant owner, worker, or other type of merchant, you can call merchant support directly at 1-833-275-3287 ( 1-833-ASK-EATS ). If you are an Uber Eats driver, you can call support, but you'll need to initiate the call using the Uber Eats mobile app. [1] X Research source Skip down to Contacting Driver Support to learn how."
    },
    {
      "title": "Speak to the representative.",
      "content": "Speak to the representative. Let the representative know the issues you're experiencing. They'll walk you through the steps to solve your issue. The call may be monitored and recorded. If you are told to use the app instead, some Uber Eats users were able to speak with customer service by selecting the menu option for merchant support. If you haven't had success with the phone number, try chatting with Uber Eats support . Depending on the time of day, you'll often be able to reach a representative in a few minutes."
    },
    {
      "title": "Open the Uber Eats app on your phone or tablet.",
      "content": "Open the Uber Eats app on your phone or tablet. You can contact Uber Eats' customer service through their chat function. If you're unable to open the app, you'll need to use the website or DM customer support on X instead. Depending on the issue and the time of contact, you may be connected to an Uber Eats support representative immediately through the live chat feature. If live chat isn't available, your concern will be sent to Uber Eats support via email, and you'll receive your response through the app. This is the easiest and fastest way to get help concerning an order you just placed, past orders, and account questions. For issues regarding the Uber rideshare service , you'll need to use the Uber app to dispute a fare ."
    },
    {
      "title": "Tap Account.",
      "content": "Tap Account . The Account tab is at the bottom of the Uber Eats app."
    },
    {
      "title": "Tap Help.",
      "content": "Tap Help . You may have to scroll down a little to find it. A new page will open. You'll see your most recent order at the top of the page, along with common troubleshooting topics underneath All Topics ."
    },
    {
      "title": "Select Help with an order or Help with a Family or Teen order.",
      "content": "Select Help with an order or Help with a Family or Teen order . If you're contacting Uber Eats for yourself, choose Help with an order . If a family member has a problem with their order, choose the Family or Teen order option . These are the only Help options that will allow you to contact Uber Eats directly."
    },
    {
      "title": "Select an order.",
      "content": "Select an order. You'll see a list of all your past orders. Tap the one you need help with."
    },
    {
      "title": "Tap Past Order.",
      "content": "Tap Past Order . This opens a conversation with the Uber Eats support assistant. You'll see a list of possible issues here. [2] X Research source"
    },
    {
      "title": "Tap the issue.",
      "content": "Tap the issue. The Support Assistant will list common problems concerning orders. If you don't see your issue listed, tap More options , then Another Order issue ."
    },
    {
      "title": "Explain your problem in detail.",
      "content": "Explain your problem in detail. By contacting customer service through the app, the agent has immediate access to the details of your order and of your account. In most cases, you'll be asked to provide more information regarding your issue. Tap the camera icon to add a photo. You can add additional information in the Share details textbox."
    },
    {
      "title": "Tap SUBMIT.",
      "content": "Tap SUBMIT . This is the button at the very bottom of the screen. You may need to scroll down to find it. This will send your issue to Uber Eats. Uber Eats will contact you within the app itself or via a text message that redirects you to the app. View your status by tapping Account → Help → View All Messages ."
    },
    {
      "title": "Log into https://x.com/ or open the X app.",
      "content": "Log into https://x.com/ or open the X app. Enter your login details and click Log in . If you don't have an X account, you'll need to make one . You should use this method if you can wait at least 24 hours before receiving an answer."
    },
    {
      "title": "Go to the @Uber_Support profile home page.",
      "content": "Go to the @Uber_Support profile home page. While Uber Eats has a Twitter account, they don't provide customer service. To get support from a real human at Uber Eats, you will need to send a message to the general @Uber_Support account. If you're using the mobile app, tap the magnifying glass icon, type Uber_Support , and select the @Uber_Support profile. On a computer, you can jump right to x.com/uber_support ."
    },
    {
      "title": "Click or tap the envelope to send a direct message.",
      "content": "Click or tap the envelope to send a direct message. If you need to provide Uber Eats Support with specific information about your order, such as your name, address, or phone number, it's best to send that information in a direct message so it's not public. For a general complaint, you can tweet @Uber_Support instead. Jump down to step 5 to learn how."
    },
    {
      "title": "Send your message to Uber Eats.",
      "content": "Send your message to Uber Eats. Enter your question or concern into the message field, including your name and phone number or email address associated with your Uber Eats account. Describe the issue, then click the airplane icon to send your message. When Uber Eats has received your concern, they'll respond in this message window."
    },
    {
      "title": "Compose a new tweet to @Uber_Support (optional).",
      "content": "Compose a new tweet to @Uber_Support (optional). Since this is the most public way of contacting customer service, you should only Tweet out questions about general issues, such as the functionality of the app or quality of service, and not about your personal account or payment plan. To compose a new tweet on a computer, click Post , and a new tweet will be created that's already addressed to @Uber_Support . In the mobile app, tap + at the bottom-right corner of the Uber Support profile page to create a tweet that's addressed to @Uber_Support ."
    },
    {
      "title": "Enter your question into the tweet field.",
      "content": "Enter your question into the tweet field. Be sure to write your question succinctly, since there is a 280-character limit on Tweets. [3] X Research source For best results, focus on the main issue and try to avoid giving any unnecessary background information. For example, if you're having trouble logging into the app on your phone, don't include information in the Tweet about how often you use the app or what you planned to order that day."
    },
    {
      "title": "Click or tap Post to send your tweet, then wait for a response.",
      "content": "Click or tap Post to send your tweet , then wait for a response. There's no set amount of time in which the @Uber_Support account normally responds to tweets/posts, but you can expect them to get back to you as soon as they can. This method is best for general issues or app status. If your app isn't working, you can also monitor the @Uber_Support Twitter account for real-time updates about the app's status. If Uber Eats is aware of the problem, they will Tweet out when they have fixed it. You can also restart your iPhone or restart your Android ."
    },
    {
      "title": "Call Uber Eats driver support.",
      "content": "Call Uber Eats driver support. As an Uber Eats driver, you get 24/7 phone or chat support. If you want to call Uber Eats, you'll need to initiate the call through the Driver app. In the Driver app, tap the menu icon and select Help to access the Help Center. Select the issue you are experiencing. If phone support is available for that issue, select Call Suppor t to speak to someone at Uber Eats. [4] X Research source If you don't see an option to call, return to the list of help topics, then tap Contact Support at the bottom. You will be asked to select Phone , Live chat , or Message (email) support. You will also see each option's projected wait time."
    },
    {
      "title": "Merchants and restaurants can contact Uber Eats by phone or email.",
      "content": "Merchants and restaurants can contact Uber Eats by phone or email. Whether you're already working with Uber Eats or want to learn more about the business, you can call 1-833-ASK-EATS 24/7. Merchants can also email merchants@uber.com to reach a representative via email. [5] X Research source Merchants can also access chat support through Uber Eats Manager. Just sign in to your Uber Eats Manager account and click or tap the chat bubble to start a conversation."
    },
    {
      "title": "Go to [6] X Research source in a web browser.",
      "content": "Go to [6] X Research source in a web browser. If you don't have access to the Uber Eats app, you can use a web browser. [7] X Research source Log in for personalized support with issues concerning past orders or billing. Tap Log in underneath the search bar and enter your login details."
    },
    {
      "title": "Click one of the help options.",
      "content": "Click one of the help options. You might be able to solve your issue by following the prompts to Help with an order , Accounts and payments , Membership and loyalty , or Delivery and pickup basics . You can also type the keywords of your issue in the search bar at the very top of the page."
    },
    {
      "title": "Follow the help article's steps.",
      "content": "Follow the help article's steps. This should help you resolve your Uber Eats issue. If not, you can return to the Help page and select another topic category, topic, and issue to attempt to fix the problem through a different process."
    }
  ]
}