{
  "url": "https://www.wikihow.com/Clean-Copper-Coins",
  "title": "4 Quick & Easy Ways to Clean Copper Coins",
  "steps": [
    {
      "title": "Pour 1⁄4 cup (59 mL) of white vinegar into a small bowl.",
      "content": "Pour 1 ⁄ 4 cup (59 mL) of white vinegar into a small bowl. The coins need to be submerged in the vinegar, so make sure the vinegar doesn’t have too much space to spread out. If you plan on cleaning off a lot of coins at once, use a bigger bowl and add more vinegar as needed. [1] X Research source Some other options to use in place of vinegar include orange or lemon juice. Like vinegar, citrus juice is acidic and wears off copper oxide on coins."
    },
    {
      "title": "Mix 1 teaspoon (5.69 g) of salt with the vinegar.",
      "content": "Mix 1 teaspoon (5.69 g) of salt with the vinegar. Stir the salt until it dissolves into the vinegar. The salt helps lift black spots off of old copper coins. Use more salt as needed to make the solution stronger for particularly worn coins. [2] X Research source Keep in mind that adding more salt to the solution makes it stronger. Mix in extra salt if you wish, but keep a close eye on the coins to avoid damaging them."
    },
    {
      "title": "Soak the coins in the solution for about 5 minutes.",
      "content": "Soak the coins in the solution for about 5 minutes. Drop the coins into the bowl, spreading them out so they are all submerged. Try to arrange them in a single layer so the solution reaches both sides of each coin. [3] X Research source For a more gradual treatment, leave the coins out of the bowl. Instead, dip a soft-bristled toothbrush into the vinegar solution and scrub the coins with it."
    },
    {
      "title": "Rinse the coins immediately with warm water.",
      "content": "Rinse the coins immediately with warm water. Clean the salt and vinegar off of every coin as soon as possible. If you leave the coin alone, the acids continue wearing away the copper. Eventually, exposure to salt causes green spots to form on copper coins. [4] X Research source Hold the coins under a little bit of running water to ensure all of the cleaning solution rinses off. Don’t leave them in a bowl of water, since the vinegar solution and copper oxide will end up in the bowl and on other coins."
    },
    {
      "title": "Dab the coins with a microfiber cloth and let them air dry.",
      "content": "Dab the coins with a microfiber cloth and let them air dry. Set a cloth down on a flat countertop, then place the coins on top of it. Arrange the coins in a single layer so they all have a chance to dry without the risk of picking up leftover vinegar or oxide. After drying the coins off as much as possible, leave them exposed to open air for about 5 minutes to eliminate any remaining moisture. Soak the coins in more salt and vinegar if they still look dirty. It may take a few treatments, so work gradually and wash the coins off each time to avoid damaging them. Vinegar solutions are effective for removing dark spots on coins, but they also tend to make coins look a little dull. Shine the coins to make them look better."
    },
    {
      "title": "Cover the coins with ketchup or another acid.",
      "content": "Cover the coins with ketchup or another acid. Pour some ketchup into a small bowl, enough to cover the coins. Submerge the coins in a single layer in the ketchup. Make sure both sides of each coin are evenly coated. Tomato sauce is acidic, and ketchup is made with salt and vinegar, so it’s extra effective at stripping blemishes off of old coins. [5] X Research source Hot sauce and brown colas are some other household substances that work well on copper coins. [6] X Research source If you don’t have ketchup or another acid, try using a metal polish from a general store. It works similarly to ketchup."
    },
    {
      "title": "Scrub the coins with a soft-bristled toothbrush.",
      "content": "Scrub the coins with a soft-bristled toothbrush. Press the bristles very gently against the coins to avoid scratching them. Use the brush to work the ketchup into the dirtiest spots on each coin, such as around the lettering and outer edge. If you don’t have a brush available, leave the coins submerged in the ketchup for at least 5 minutes. Check back on them every few minutes, especially if you use a highly acidic substance like cola, to avoid damaging them."
    },
    {
      "title": "Rinse the coins off under warm water.",
      "content": "Rinse the coins off under warm water. Clean off all of the ketchup so the salt and acid do not continue to abrade the coins. Most of the patina, the green or brown film on older coins, will come off as well, leaving you with a pink, clean piece of copper. [7] X Research source Newer coins, such as relatively shiny pennies, tend to dull a little when washed in acid."
    },
    {
      "title": "Clear dirt off of the coins with a toothpick.",
      "content": "Clear dirt off of the coins with a toothpick. Scrape away the dirt around the engraved parts of each coin, such as letters or images. Also, remove as much dirt as possible around the edges of each coin. You do not need remove all of the dirt on the coins, only enough to make the engraved portions stand out. [8] X Research source Clearing away the dirt now makes the coin look clearer once you add the oil to it."
    },
    {
      "title": "Rub a small amount of vegetable oil onto each coin.",
      "content": "Rub a small amount of vegetable oil onto each coin. Dip a drop of oil onto each coin. Work the oil in with your fingers. Scrub away and add more oil as needed to make the coin appear shiny and refreshed. [9] X Research source Use sparing amounts of oil to avoid damaging coins. Remember, you can always try cleaning a coin again, but you can’t reverse mistakes."
    },
    {
      "title": "Rinse the coins under a trickle of hot water.",
      "content": "Rinse the coins under a trickle of hot water. Let the water drip from the sink faucet to avoid soaking the coins. As you wash the coins, continue rubbing them with your thumb to reach all of the oil. Any debris will come off, leaving you with pristine coins. [10] X Research source Repeat the treatment with more oil as needed. For a stronger treatment, let the coins soak in oil for about a day, then scrub them with a soft toothbrush."
    },
    {
      "title": "Blot the coin dry with a microfiber cloth.",
      "content": "Blot the coin dry with a microfiber cloth. Lay the coins on the cloth to wick away excess moisture. Tap them with part of the cloth to dry them further. Before storing the coins, leave them out and exposed to open air for about 5 minutes. [11] X Research source"
    },
    {
      "title": "Combine baking soda and water into a paste.",
      "content": "Combine baking soda and water into a paste. Set out a clean bowl, then fill it with about 1 tablespoon (14.4 g) of baking soda. Gradually pour in about 1 ⁄ 3 tablespoon (4.9 mL) of lukewarm water, stirring it the entire time. Stop adding water as soon as the mixture has the consistency of toothpaste. Add more baking soda and water as needed for larger batches of coins. As a general rule, make the paste at a ratio of 3 parts baking soda to 1 part water."
    },
    {
      "title": "Rub the paste over the coins to make them shine.",
      "content": "Rub the paste over the coins to make them shine. Use your fingers to spread a little bit of the paste over each coin. Work the paste into all parts of the coins. When you’re done, the coins will look shinier and the details engraved on them will stand out more. The baking soda isn’t acidic like vinegar and citrus juice solutions, so leaving the paste in place for a while is safe."
    },
    {
      "title": "Wash the coins off with warm water and dry them.",
      "content": "Wash the coins off with warm water and dry them. Rinse them under a little bit of running water to remove the leftover paste. Then, pat the coins dry with a soft cloth or towel. Check the coins when you’re finished to see how shiny they look. If the coins still look a little dull, try treating them with more paste. Very old or dirty coins require the extra effort."
    }
  ]
}