{
  "url": "https://www.wikihow.com/Catch-Your-Crush%27s-Attention",
  "title": "How to Catch Your Crush's Attention",
  "steps": [
    {
      "title": "Spend extra time on your appearance.",
      "content": "Spend extra time on your appearance. Take the extra 10 or 15 minutes you need to look your absolute best before you see your crush. Even just small things can change you from someone in the background to someone who catches their attention. Not only can looking your best make your crush notice you, it can also give you the confidence boost you need to approach your crush. [1] X Research source Pay attention to your hair. Even doing a quick comb through can make a big difference. For girls especially, straightening or curling their hair can give them a confidence boost. If you wear makeup, make sure that it is applied well and will last all day. Also make sure that you are taking care of your body in general by getting enough sleep and taking care of your skin so you look fresh and healthy."
    },
    {
      "title": "Look different.",
      "content": "Look different. Dressing differently than the people around you is a good way to get noticed. This works especially well if you are in an environment where everyone dresses in a similar way. [2] X Research source If people at your school dress similarly or in uniform, wear a statement necklace or a pair of cool sneakers to catch the attention of your crush. If you are in a professional work environment, wear something that is appropriate but different. For instance, wear a collared shirt with an interesting pattern or a sparkly headband."
    },
    {
      "title": "Wear red.",
      "content": "Wear red. If red is your color, go for it. Studies show that both genders are more attracted to people when they wear red. Pull out a red dress or shirt from your closet to get your crush’s attention. If you don’t like wearing red, choose another bright color to help you stand out from the crowd. [3] X Research source"
    },
    {
      "title": "Don’t go overboard with your outfit.",
      "content": "Don’t go overboard with your outfit. When trying to impress a crush, it’s easy to take it too far. You want to look nice, but remember to wear clothing that’s appropriate for the situation. [4] X Research source For instance, if your crush is in your yoga class, don’t dress for class like you’re headed to the red carpet. Remember that everything is better in moderation. This goes for perfume and cologne as well."
    },
    {
      "title": "Make sure your crush has seen you around.",
      "content": "Make sure your crush has seen you around. Do your best to be in the line of sight of your crush. If you are in the same class, try to sit near or in front of them. If you see them at the gym, work out nearby. Do this until you are sure that your crush has seen you and knows that you exist! [5] X Research source Don’t do it to the point where you’re around your crush more than you should be. There’s a difference between making sure your crush sees you around and stalking your crush."
    },
    {
      "title": "Get more involved.",
      "content": "Get more involved. Get involved in whatever space you see your crush. If you go to school with your crush, join a sports team or an extracurricular activity. If you volunteer with your crush, take on more hours. Becoming more involved will make you more visible and show you as a person with drive and purpose, which are both attractive qualities. [6] X Research source"
    },
    {
      "title": "Meet your crush’s friends.",
      "content": "Meet your crush’s friends. If you’re too nervous to talk to your crush, try to talk to their friends. If a friend of yours knows one of your crush’s friends, go up together and chat. If you don’t have any connections to your crush’s friends, try to meet one or two of them by chatting about any circumstances you have in common, like a class or a work project. [7] X Research source You could start a conversation with something as simple as, \"So when's the final project for English due again?\" If you end up talking a lot to your crush’s friends, you’re bound to meet or hang out with your crush before long. Becoming friends with your crush’s friends is a way to get into your crush’s good books. Don’t talk about your crush to their friends. If you start asking about your crush immediately after meeting them, it will be obvious that you like them. Try to play it cool."
    },
    {
      "title": "Flirt nonverbally.",
      "content": "Flirt nonverbally. If you feel nervous about approaching your crush, there are several things you can do to get her attention and appear interested. Make eye contact and smile. Eye contact and smiling shows that you are friendly and approachable, but you have to make sure not to overdo it. If your crush doesn’t respond the first time, don’t keep doing it. Play with your hair, especially if it’s long. Twirl your hair around your finger or brush it to the side. Drawing attention to your hair is a way of highlighting one of your assets. Reader Poll: We asked 1295 wikiHow readers and 60% of them agreed that the best way to subtly get someone’s attention is by making eye contact and smiling . [Take Poll]"
    },
    {
      "title": "Start a conversation.",
      "content": "Start a conversation. If you’ve never spoken to your crush before, it’s time to take the plunge. Find a reason to talk to your crush, preferably when there aren’t many people around so you won’t get interrupted. If you don’t know your crush, talk about something relating to the circumstances that you’re in. [8] X Research source For instance, if you are waiting in line for something, ask your crush, \"Hey, do you think the wait is worth it?\" If you are in the break room at work you could say, \"Have you tried the cookies Susan brought in? They're really good!\" Asking a question is a good way to start a conversation. For instance, if you are in the same class you could ask, “Hey, what did Mr. Feinstein say the homework was again?” You could also ask for help. Whether it be opening a jar, reaching for something, carrying a heavy suitcase, or getting help with homework, asking your crush for help is a great way to start a conversation. It also will make your crush feel good about himself, which is a good way to have your first interaction with him be a positive one."
    },
    {
      "title": "Talk about common interests.",
      "content": "Talk about common interests. Once you have started talking to your crush, talk about anything you may have in common. People are naturally attracted to people that they have things in common with, so talking about shared passions is a good way to create a bond. [9] X Research source For instance, If you are both on the school track team, ask your crush \"So how are you feeling about the next track meet?\""
    },
    {
      "title": "Ask her about herself.",
      "content": "Ask her about herself. Asking your crush a question shows her that you find her interesting and want to learn more about her. Since people like to talk about themselves, it also can be a good way to keep the conversation going. For example, ask your crush, “So how long have you been working here?”, or, “What other classes are you taking this semester?”"
    },
    {
      "title": "Be a good listener.",
      "content": "Be a good listener . After you've asked your crush about himself, you may be worrying about what you are going to say next, how you are going to respond to what he's saying, what to do if there is a lull in the conversation... All of this can be solved by listening. It's difficult to listen to someone and also focus on how nervous you are — listening attentively should take your attention away from yourself and bring it to the subject at hand. Try to respond with meaningful follow-up questions, or something that shows your crush you are interested and listening. If your crush is talking about taking scuba lessons, ask him how he became interested in diving, or where he's taking classes, or how long it will take to become certified. Don't see a pause in the conversation as an opportunity to change the focus over to yourself. Conversations should be give-and-take, so you shouldn't spend the entire time talking about your crush, but it also shouldn't seem like you're just waiting for him to take a breath so you can talk about yourself. Showing that you are a good listener and genuinely interested in your crush and what he has to say can help him feel comfortable around you. If it doesn't make you too nervous, make eye contact with your crush to show that you are listening and engaged. Don't stare — that could be a little too intense — but try to meet his gaze occasionally. Show that you're listening by nodding or making an affirming sound (like \"Mmm hmm\" or \"Right\")."
    },
    {
      "title": "Compliment your crush.",
      "content": "Compliment your crush. As superficial as it is, people love flattery. While you are talking, try to compliment your crush on something. A compliment is also often a good way to keep the conversation going because it puts it on a new course. [10] X Research source If you know your crush through a sport, you could say, “I’ve seen you playing soccer. You’re really good!” You could also just say, “I like your shirt,” or compliment her on some other aspect of her appearance. Limit yourself to one compliment to avoid looking like you are sucking up to her."
    },
    {
      "title": "Laugh at his jokes.",
      "content": "Laugh at his jokes. Another way to flatter and connect with your crush is to laugh at his jokes. It shows your crush that you have a similar sense of humor and that you find him funny. Laughing together is a great way of connecting and sharing a moment. [11] X Research source As you laugh, you can even say, \"You're so funny!\" If you want to be extra flirtatious, touch your crush’s arm while you laugh. This adds another layer of connection and is a way to make your crush feel closer to you."
    },
    {
      "title": "Stay in contact.",
      "content": "Stay in contact. Try to keep running into and talking to your crush. Every time you see your crush in the hall or around town, say hello. Pick up conversations from the last time you talked. If you feel like your crush likes you, amp up your flirtiness or even ask them out!"
    },
    {
      "title": "Define your style.",
      "content": "Define your style. Take a look at your wardrobe. Make sure that all your clothes feel like you, and aren’t just things that you’ve had for years and can’t bring yourself to get rid of. Your clothes are a great way to express yourself and show off your personality. If you have a very defined style, it can give your crush some idea of who you are and what you’re about, which could make your crush interested in talking to you. If you’re a sporty guy, wear your favorite team’s jersey. If you’re feminine and cute, embrace this side of yourself by wearing pastels and lacy clothes. If you’re more of a rebel, wear band shirts and black jeans. Don’t copy your crush’s style. Just because your crush has a very preppy style, don’t think you have to dress like you’re going to a country club if that’s not your look. You need to feel comfortable and feel like yourself in your clothes."
    },
    {
      "title": "Speak your voice.",
      "content": "Speak your voice. Make yourself heard when your crush is around. If you are in a class with your crush, participate and answer questions. Voice your opinions and feedback in work or club meetings. Even just try to chat with friends around your crush. This will give your crush a better idea of what kind of person you are. Try your best to be cheerful and upbeat around your crush. People are naturally attracted to happy and confident people, so do your best to be positive when they are around."
    },
    {
      "title": "Use social media.",
      "content": "Use social media. Social media is a great way to reach your crush in an indirect way. Even if your crush isn’t your Facebook friend or isn’t following your social media, he still may see your posts or pictures through mutual friends. [12] X Research source Try to craft your social media presence to show you in the best possible light. Make sure that your posts and pictures present you as a positive and interesting person. Make sure that you aren’t tagged in any unflattering photos or photos of you doing anything inappropriate."
    },
    {
      "title": "Use confident body language.",
      "content": "Use confident body language. Even if your crush makes you feel nervous, do your best to act confident. Stand up straight with a relaxed smile. Don’t cross your arms, look down at the ground or fidget; these behaviors can make you look protective or nervous. Also try to keep your body turned toward your crush as opposed to away from her."
    }
  ]
}