{
  "url": "https://www.wikihow.com/Cheating-Girlfriend-Snapchat",
  "title": "How to Tell If Your Partner Is Cheating On Snapchat & What to Do about It",
  "steps": [
    {
      "title": "Your partner has become emotionally and/or physically distant.",
      "content": "Your partner has become emotionally and/or physically distant. This is one of the classic signs of infidelity . If you and your partner were formerly very emotionally and physically close and suddenly your partner pulls away, this could be a major red flag. [1] X Research source"
    },
    {
      "title": "Your partner is more possessive of their cell phone.",
      "content": "Your partner is more possessive of their cell phone. While it's normal for someone to expect privacy when it comes to their mobile device, if your partner is acting suspiciously possessive of their phone it could be a sign that they're trying to hide something. [2] X Research source"
    },
    {
      "title": "Your partner is sending a lot of snaps to someone else.",
      "content": "Your partner is sending a lot of snaps to someone else. While you can't see someone else's Snapchat best friends list, you may notice if your own rank has gone down with your partner. [3] X Research source If your Friend Emoji has changed recently, it may mean your partner is spending more time Snapchatting someone else. While this doesn't immediately mean infidelity, it may be a contributing factor."
    },
    {
      "title": "They are spending a lot of private time on their phone.",
      "content": "They are spending a lot of private time on their phone. While everyone needs time alone, if you notice your partner is spending more time apart from you than they did before, it could be cause for concern. This could be compounded if you notice they're spending a lot of time online on Snapchat while they're alone. Reader Poll: We asked 368 wikiHow readers and 65% of them said that they’ll suspect a person of being unfaithful if they’re frequently checking their phone or being secretive about communication . [Take Poll]"
    },
    {
      "title": "Your partner has begun to care more about their appearance.",
      "content": "Your partner has begun to care more about their appearance. Alone this may not seem like a sign of cheating, but if you notice your boyfriend or girlfriend has been putting more time into their appearance alongside some of these other signs of cheating, it could be a red flag. Even though your partner may not be meeting with another person physically, they may be improving their appearance to look better in Snapchat photos and videos. [4] X Research source"
    },
    {
      "title": "Intimacy has abnormally increased or decreased.",
      "content": "Intimacy has abnormally increased or decreased. While it may seem obvious that your partner may become less intimate with you if they are cheating, they may increase intimacy if they are feeling guilty about their infidelity. A sudden change in either direction could be a red flag that points to cheating."
    },
    {
      "title": "Your partner's attitude towards you has changed suddenly.",
      "content": "Your partner's attitude towards you has changed suddenly. If you notice your partner is defensive, angry, judgmental, or irritable, especially if you bring up their Snapchat or technology usage, this could be a sign they are using Snapchat to cheat. They may try to steer the conversation away to avoid discussing it, or they may get defensive of their Snapchat usage."
    },
    {
      "title": "Your partner accuses you of cheating.",
      "content": "Your partner accuses you of cheating. While it might seem backwards, it's common for cheaters to accuse their partners of the very thing they are doing themselves. There are a few reasons for this: it can take the focus off of their behavior, it can make you less likely to bring the subject up, and it can be projecting based on their own behavior. If your partner is accusing you of cheating on Snapchat, they may be doing that themselves. [5] X Research source"
    },
    {
      "title": "Consider all of the evidence.",
      "content": "Consider all of the evidence. If you don't have any hard evidence (screenshots or records of your partner cheating on Snapchat) you will want to carefully review all of your circumstantial evidence. Cheating is a difficult thing to pinpoint, as the behaviors listed above could also be related to other changes in your boyfriend or girlfriend's life."
    },
    {
      "title": "Look for support.",
      "content": "Look for support. If you feel comfortable, talk to a trusted friend, family member, or therapist to get support during this time. This person can also give a third-person perspective of the situation and help you sort through evidence."
    },
    {
      "title": "Prepare yourself emotionally.",
      "content": "Prepare yourself emotionally. Confronting a cheating partner is difficult, and you want to be sure you're in a good headspace. If you need to, write down what you want to say and talking points so you don't forget what you're trying to say in the midst of what may be a heated or painful conversation."
    },
    {
      "title": "Pick a time and place.",
      "content": "Pick a time and place. If you're concerned your partner may get threatening or aggressive, have the conversation in a public place or with a third party present."
    },
    {
      "title": "Have a conversation, not a confrontation.",
      "content": "Have a conversation, not a confrontation. Explain what you've been thinking and feeling recently and allow your partner to either come clean about their infidelity or explain what is going on. There's a chance something else could be going on in your partner's life that is leading to these behaviors that aren't cheating."
    },
    {
      "title": "Don't dig for details.",
      "content": "Don't dig for details. Asking for details will only make the conversation more difficult and painful for you. Simply allow your partner to come clean about their infidelity."
    },
    {
      "title": "Decide how to move on.",
      "content": "Decide how to move on . You may opt to stay with your partner or break up. The choice is up to you, but no matter what you decide to do, ensure you have a healthy support system of friends, family, and/or therapists to help you work through this difficult time."
    },
    {
      "title": "Don't use a third-party app to spy on your partner.",
      "content": "Don't use a third-party app to spy on your partner. There are a ton of apps that promise to allow you to spy on your girlfriend or boyfriend's phone habits, but you should avoid them. While a number of them likely don't work, spying on someone by installing an app on their phone is illegal without consent of the person you're spying on. [6] X Research source Punishments for wiretapping vary by state, but every state treats this offense as a felony or the equivalent of a felony, which leads to prison time and fines."
    }
  ]
}