{
  "url": "https://www.wikihow.com/Be-Cool-in-Middle-School",
  "title": "How to Be Cool in Middle School",
  "steps": [
    {
      "title": "Take good care of your personal hygiene.",
      "content": "Take good care of your personal hygiene . If you want to be cool in middle school, you need to pay attention to how you look and smell. To make sure you're always fresh and clean, brush your teeth and wash your face every morning and night, shower or bathe every day, and put on a combination antiperspirant and deodorant after you get out of the bath. An antiperspirant helps reduce how much you sweat, while a deodorant helps prevent body odors from forming. Shampoo your hair every 2-3 days, or more often if it starts to look oily between washes. In addition to brushing twice a day, you should also floss your teeth every night to remove plaque that can lead to problems like bad breath or cavities."
    },
    {
      "title": "Style your hair each day.",
      "content": "Style your hair each day. Having a great hairstyle instantly makes you look cooler, but looking nice usually takes at least a little work. Every morning when you're getting ready, spend a few minutes taking care of your hair. Depending on your style, that might just mean combing your hair or smoothing it out with your fingers, or it might mean wearing your hair up or adding hair accessories. [1] X Research source You can use styling products like gel, mousse, or salt spray to help you style your hair, but remember to only use a little bit of product or your hair will look wet and greasy. If you have a hair straightener or a curling iron, you can use these tools to style your hair each day. However, heat can be very damaging to your hair, so it's best to wear your hair in its natural texture at least some of the time. When you get your hair cut or trimmed, ask your stylist to help you find a hairstyle that will suit your face. If you're not sure how to style your new cut, ask the stylist to show you before you leave!"
    },
    {
      "title": "Wear clean clothes that fit well.",
      "content": "Wear clean clothes that fit well. Whether you have to wear a uniform or you can wear your own clothes to school, if you want to be cool, you should wear clothes that are clean and free of wrinkles. Also, for the most flattering fit, choose clothes that skim loosely across your body without being too tight or too baggy. [2] X Research source Dirty clothes can smell bad, and wrinkles will make you look sloppy. If you can wear your own clothes to school, keep it casual most days by wearing jeans or shorts and a T-shirt. In cool weather, add a hoodie or a sweater to keep warm. If you want to dress up, like if you have to give a presentation in front of your class, try wearing khaki pants and a button-down or collared shirt. If you have a more feminine style, you might wear a dress, instead."
    },
    {
      "title": "Add trendy accessories to your outfit.",
      "content": "Add trendy accessories to your outfit. Accessories are an easy way to make an outfit cooler. When you're shopping for clothing, check out the accessories as well, and look for pieces that you feel reflect your personality. Then when you get dressed every day, pick 1 or 2 accessories that match what you're wearing. [3] X Research source Try adding a canvas belt and cool sneakers to make jeans and a T-shirt look more interesting. If you wear a uniform, you might show your style with a stylish bracelet, watch, necklace, scarf, colorful socks, or a fun belt. Just make sure it follows your school's dress code! Look at your favorite celebrities and style icons for outfit and accessory ideas."
    },
    {
      "title": "Wear light makeup if you wear any.",
      "content": "Wear light makeup if you wear any. A lot of kids start experimenting with makeup in middle school for the very first time. You can use concealer , powder , and blush to smooth out or brighten your complexion. If you want to define your eyes, lightly line your eyes with eyeliner and apply a little eyeshadow to your eyelids. Then, try a light coat of mascara on your lashes. As you're experimenting with makeup, keep in mind that usually, the more natural you look, the better. If you look like you're trying too hard to change your appearance, you might seem like you're not self-confident. Remember, if you want other people to think you're cool, first, they have to believe that YOU think you're cool!"
    },
    {
      "title": "Be friendly to people from different social groups.",
      "content": "Be friendly to people from different social groups. While it might seem like the only way to be cool is to hang out with the most popular kids you can find, the truth is, being really cool means being friends with a lot of different kinds of people. [4] X Expert Source Ashley Pritchard, MA Academic & School Counselor Expert Interview. 4 November 2019. Take the time to get to know each person you meet, no matter what clique they're a part of. Then, befriend the people you like the most . [5] X Research source Being cool is about more than just being popular. Popularity can change overnight and is based on the opinion of others, while being cool means staying true to yourself no matter who else is around."
    },
    {
      "title": "Avoid gossip",
      "content": "Avoid gossip and sharing secrets. If someone starts talking bad about another person while you're around, either ask them to stop, ignore the conversation entirely, or walk away. You'll seem a lot cooler if you're too laid-back to get involved in rumors and other drama. Be careful what you say about other people, too, so you're not unintentionally the source of any rumors yourself. For instance, if your friend tells you in confidence that her parents are getting a divorce, don't share that information with anyone else."
    },
    {
      "title": "Spend time around people who build you up.",
      "content": "Spend time around people who build you up. Unfortunately, in middle school, you might run into people who are unkind. If you spend time around someone and they put you down or make you feel bad about yourself, try to avoid them as much as possible. Instead, hang out with friends who accept you for who you are and make you feel good about yourself. [6] X Research source If you're frequently the target of teasing or physical aggression , tell a teacher or another adult, and stick close to other students as much as possible to help make yourself less of a target. If you need to, find someone who's sitting alone and say something like, “Those kids over there keep messing with me. Is it okay if I sit here for a few minutes so they'll leave me alone?”"
    },
    {
      "title": "Don't bully people to try to get attention.",
      "content": "Don't bully people to try to get attention. Some people think that teasing other kids will make them seem cool, but this isn't true. Even if you're a victim of bullying yourself, avoid taking it out on someone who's less popular than you are. Instead, be a friend to those who are being bullied and talk in ways that will make them feel better. Being kind to everyone will make people look up to you, which will make you seem cooler. If you see bullying happening at your school, stand up straight, look the bully in the eyes, and tell them to stop . If you're concerned that this will put you in physical danger, report the incident to a teacher, parent, or another responsible adult instead."
    },
    {
      "title": "Have a good sense of humor.",
      "content": "Have a good sense of humor . If you want people to think you're cool, try being funny! Be willing to laugh at yourself, even if you make a mistake. Also, laugh with your friends when they're being funny, and share funny memes or jokes that you come across. For instance, if you spill something on your shirt at lunch, don't get upset about it. Just start laughing, instead! More than likely, other people will laugh with you—which is way more fun than having people laugh at you!"
    },
    {
      "title": "Do your best in school.",
      "content": "Do your best in school. If you want to have a good reputation in middle school, pay attention and try to do well in every class you're in, even if it's something that doesn't come easily to you. Do your homework and turn in all of your assignments, and try not to daydream when the teacher is giving your lessons. [7] X Expert Source Ashley Pritchard, MA Academic & School Counselor Expert Interview. 4 November 2019. Being cool doesn't mean skipping school and failing tests, although you don't necessarily have to have the highest grade in your class, either. If you make a habit of breaking the rules, though, you'll have a reputation as a troublemaker, rather than a reputation for being cool. As a bonus, paying close attention in class might make your after-school assignments easier to finish, so you'll have more time to spend with your friends!"
    },
    {
      "title": "Embrace what makes you an individual.",
      "content": "Embrace what makes you an individual. The coolest people always seem to be the ones who have a great understanding of who they are. Think about what makes you unique—maybe you have a cool eye for fashion, are great at drawing, or you can run really fast. Then, look for ways to express those qualities. [8] X Research source For instance, you might always wear unique, funky outfits if you're into fashion, you might draw illustrations for the school paper if you love art, or you might try out for the track team if you're a runner."
    },
    {
      "title": "Use social media thoughtfully.",
      "content": "Use social media thoughtfully. When you're just starting to use social media, it can be hard to know how to use it without oversharing. Just remember that you can't take anything back once it's online, so keep your most personal business private, and don't share any pictures online that you would be embarrassed for everyone to see. [9] X Research source Also, don't share or post unkind comments about anyone, especially if you wouldn't say those things to that person's face. Internet bullying can be very hurtful, and it won't make you seem cooler. If you see online bullying, do your best to ignore it, even if it's directed at you. However, you can report the bullying, either online or to a parent or teacher."
    },
    {
      "title": "Pay attention to trends.",
      "content": "Pay attention to trends. Keeping up with trends can help you seem like you know what's cool, so when you see a trend you like on TV, online, or at school, don't be afraid to try it out. You don't have to follow every trend that's out there—that will make you seem unoriginal. Just pick the ones you really like! For instance, if you see your favorite celebrity wearing an awesome pair of sunglasses, you might look for a similar pair when you go shopping. If a lot of your friends wear baggy jeans, you might look for a pair of relaxed-fit jeans. However, going against trends can make you seem cool too, so if you want to wear skinny jeans instead, go for it!"
    },
    {
      "title": "Join a club or team at your school.",
      "content": "Join a club or team at your school. If it's possible, try to find clubs, sports, competitive teams, or other activities at your school that fit your personal interests or hobbies. Getting involved in after-school activities can be a great way to expand your social circle. Also, if you're busy with activities, you'll seem cooler than you would if you just went home every day. [10] X Research source For instance, if you're athletic, you might try out for your school's soccer, baseball, cheerleading, or dance team. If you love music, you might join the band or choir. If you're really great at math or science, you might join the robotics team. Don't join a club you don't really like just because you think it will be cool. For instance, if you're not into sports, cheerleading probably isn't a good fit for you, even if that seems like a good way to get popular."
    }
  ]
}