{
  "url": "https://www.wikihow.com/Be-Funny",
  "title": "How to Be Hilarious & Develop Your Sense of Humor",
  "steps": [
    {
      "title": "Figure out what makes you laugh.",
      "content": "Figure out what makes you laugh. While it’s possible to stop yourself from laughing in inappropriate settings, it’s often much harder to laugh on demand. When you try to force a laugh, it’s often obvious to others. [1] X Research source The good news is that you’re about 30 times more likely to laugh in the presence of others. That means it's easy to start laughing when others are laughing. [2] X Research source Many believe we laugh over the misfortunes of others because it makes us feel superior. Others believe that laughter is a way to release pent-up nervous energy. Another reason for laughter is that we are delighted and amused when something surprises us or goes against our expectations. A modern theory that combines these explanations is benign violation, which means that we find humor when ethical, social, or physical norms have been violated, but the violation isn’t serious. [3] X Research source"
    },
    {
      "title": "Pay attention to what other people find funny.",
      "content": "Pay attention to what other people find funny. When you’re trying to learn more about what you find funny, it often helps to do a little people-watching. Notice what your friends and family laugh at. What situations crack them up? What funny movies do they like, and what parts of those movies make them laugh out loud? Just remember, it’s normal for people to find humor in different situations. So, what makes other people laugh might not be funny to you. [4] X Research source While you may not connect with or use that type of humor, seeing other people laugh at it can help you understand humor better. Try watching funny movies and TV shows starring comedians like Bill Murray, Eddie Murphy, Adam Sandler, Kristen Wiig, Steve Martin, or Maya Rudolph. Watch improvisational comedians . Attend an improv show and even take part in it if you can! Try listening to comedy podcasts by comedians like Marc Maron, Conan O’Brien, Julia Louis-Dryefus, and Keke Palmer."
    },
    {
      "title": "Hang around and learn from funny people.",
      "content": "Hang around and learn from funny people. One of the best—and most fun—ways to develop a sense of humor is to surround yourself with funny people. Whether they're professional comedians, your parents, your kids, or your boss, learning from the funny people in your life is a key step to being funny yourself. Pay attention to what they do to be funny…and how they do it. Look for what you admire most in these people. Immersing yourself like this can help you develop a toolbox of techniques you can use to be funny. [5] X Research source Make a note of what your funny friends do and say to be funny so you can think about how you can use it later. Don’t spend all your time observing your funny friends. Take part in the fun by joining in with your own humorous quip!"
    },
    {
      "title": "Make an effort to laugh and smile more in your everyday life.",
      "content": "Make an effort to laugh and smile more in your everyday life. Being able to laugh is key to developing a sense of humor. And a side effect of laughing and smiling more helps you feel better. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Try to find the humor in your life…even in situations you don’t find particularly funny. Laugh at life's little misfortunes and smile as often as possible. Make laughing a priority for yourself and try to share the good feeling you get with others. Certified life coach Rachel Kove recommends setting a timer and then smiling or laughing for a full minute. “It will feel really silly and uncomfortable…[but] the fake laughter will turn to real laughter.” [7] X Expert Source Rachel Kove Life Coach Expert Interview. 27 April 2022. People tend to laugh at jokes that deal with their situations, where they live, or their beliefs. This is why The Office is so funny. The setting seems boring, but it’s relatable to many people, so it's especially funny. Break the ice with a light joke about mundane topics like the weather or traffic in your city. For example, “I was 10 years younger before my commute this morning.”"
    },
    {
      "title": "Have fun, be yourself, and trust your sense of humor.",
      "content": "Have fun, be yourself, and trust your sense of humor. When you first start working on developing your sense of humor, don’t worry so much about making people laugh at every single comment. Public speaking coach Patrick Muñoz suggests that you just try to stay in the moment and react to what’s going on around you. [8] X Expert Source Patrick Muñoz Public Speaking Coach Expert Interview. 15 December 2022 Being funny doesn't come in a \"one-size-fits-all\" package. What makes you funny is unique to you and the way you observe the world. Babies start laughing as early as 3 ½ months old. [9] X Research source So, you already have a sense of humor. All you need to do is bring it out! Just focus on being your authentic self and enjoying the moment. Being yourself makes you feel more relaxed and confident…which makes it so much easier to be funny."
    },
    {
      "title": "Memorize a few simple jokes and one-liners.",
      "content": "Memorize a few simple jokes and one-liners. Sharing a laugh is a great way to connect and make new friends. Learn a few basic jokes and one-liners to use when you want to bring a little humor to your next social function. [10] X Research source Look for funny pictures, witty comments, and hilarious memes that match your style of humor to share with your friends. Just remember, you need a quick wit and good timing to deliver a joke or one-liner. But with a little practice, you’ll have people rolling in the aisles in no time. The writer Dorothy Parker was famous for her one-liners. For example, when commenting about money, she said, “Money cannot buy health, but I'd settle for a diamond-studded wheelchair.” Or memorize a simple joke like: “You know why you never see elephants hiding up in trees? Because they’re really good at it.” For more hilarious ideas, check out wikiHow's \"Tell me your funniest jokes\" forum !"
    },
    {
      "title": "Use the element of surprise to be funnier.",
      "content": "Use the element of surprise to be funnier. People love it when there’s a difference between what they expect and what actually happens. [11] X Research source Funny people are usually able to use surprise by misdirecting your attention in the same way magic tricks do. Instead of waving their hand to direct your eye, they use words to direct your mind. For example: \"What happens to liars when they die?\" Answer – \"They lie still.\" This joke works because you interpret the joke in two ways, and your brain is temporarily confused by its inability to draw on experience to figure it out. Consider Groucho Marx's clever one-liner, \"Outside of a dog, a book is man's best friend. Inside of a dog, it's too dark to read,\" or Rodney Dangerfield's line, \"My wife met me at the door the other night in a sexy negligee. Unfortunately, she was just coming home.\""
    },
    {
      "title": "Strike while the iron is hot for the most laughs.",
      "content": "Strike while the iron is hot for the most laughs. Comedic timing is the use of pacing, delivery, rhythm, and pauses to make a joke land with the most impact. And good comedic timing is vital when delivering a joke or one-liner because even the funniest jokes fall flat if the timing is off. For example, the classic Henny Youngman joke, “Take my wife…please,” relies on that pause (and a little misdirection), or it wouldn’t be funny. Missing the right moment or giving people too much time to work out a joke lets the humor pass by, and then it’s just disappointing…and a little annoying. This is probably why jokes people have heard before don't work, as recognition dulls the humor because the brain can’t be surprised by the misdirection. Wait for the right moment by paying close attention to what the other person is saying in a conversation. That way, you can come up with a one-liner or comeback that makes what they said really funny. Timing is crucial here. Your humorous statement needs to come out quickly and fully formed. For example, your friend says: \"Isn't it weird that we only have hair on our heads and pubic areas?\" You might say: \"Speak for yourself.\" If the timing is all wrong, save your joke for another time. Don't worry! You'll have plenty of chances to show off your wit. If someone says something to you, and you think of a witty comeback two hours later, you're probably better off just keeping it to yourself."
    },
    {
      "title": "Use the Rule of 3 to heighten the humor.",
      "content": "Use the Rule of 3 to heighten the humor. Comedian Kendall Payne says, “Take a simple idea, something that you think is funny, something that made you laugh, and then just find three separate ways to implement it.” [12] X Expert Source Kendall Payne Writer, Director, & Stand-up Comedian Expert Interview. 3 April 2020. One way to do this is to use a comedic triple. This is when you set expectations, build anticipation, and then hit them with a surprising punchline. [13] X Research source An example of the comedic triple is this joke from Jon Stewart: “I celebrated Thanksgiving in an old-fashioned way. I invited everyone in my neighborhood to my house, we had an enormous feast, and then I killed them and took their land.” It’s funny because Stewart sets the expectations in the first sentence with a reference to an old-fashioned Thanksgiving. This makes people picture a traditional Thanksgiving scene. In the first two parts of the second sentence, Stewart builds tension by describing a traditional Thanksgiving. Then, in the third part, he drives the joke home by making a reference to interactions between European settlers and Native Americans."
    },
    {
      "title": "Punch up when you’re making a joke.",
      "content": "Punch up when you’re making a joke. “Punching up” means that you make fun of people who have more power than you, not less. When you punch up, you’re less likely to do any real damage to the person you’re poking fun at. Some refer to this type of comedy as “speaking truth to power,” which is a way to confront injustice. Targets of punching up might be authority figures or members of higher social classes or with more privilege. [14] X Research source Punching sideways refers to making jokes about yourself and your experiences and social class. Many people—including professional comedians—feel that punching down is cruel, unnecessary bullying. Always avoid being belittling or judgemental of people who might actually be hurt by your words."
    },
    {
      "title": "Know your audience—and be careful not to offend them.",
      "content": "Know your audience—and be careful not to offend them. Different things make different people laugh. Try to read the room by listening to what people are talking about and the general mood. If they’re laughing, listen to the types of things they’re laughing at. If everyone is serious, pay attention to that, too. Then, make your humorous comments to match the vibe of the gathering. Muñoz suggests using humor carefully in very serious situations and really paying attention to your audience’s reaction. [15] X Expert Source Patrick Muñoz Public Speaking Coach Expert Interview. 15 December 2022 If people are generally serious, keep your humor low-key. If everyone has a similar interest—like a club for people who like a specific hobby—use that as a subject. Make your jokes as accessible as possible to reach more people. Not everyone knows what it's like to ride in a helicopter, be a millionaire, or have a baby. But most people know what it's like to go fast, fantasize about money, and love another person deeply. When you're in a group of people you don't know, listen to what subjects they're talking about and what's making them laugh. Are they the witty banter type? The slapstick or physical comedy type? Then use that knowledge to make them laugh . Be especially careful about cracking jokes or pulling pranks during funerals and weddings or at places of worship (or religious events) to avoid causing offense. If your humor is unwanted, it could be mistaken for harassment or discrimination, especially if you’re playing a prank that might physically harm somebody."
    },
    {
      "title": "Practice making jokes and funny comments to build your skills.",
      "content": "Practice making jokes and funny comments to build your skills. Because comedy is all about delivery and timing, you can practice and improve your skills to be funnier. Give your sense of humor a workout by making jokes and dropping one-liners until the rhythm feels natural to you. Start by trying out a few funny lines on your friends and family. Let them know you’re working on your delivery and ask them to tell you what they think. [16] X Research source Practicing with people you trust and who can give you constructive feedback is a good way to start. As you get more comfortable, try telling a few jokes to people who aren’t close to you to get outside your comfort zone. Just remember, as you work on your timing and delivery, you may drop a few bombs. But don’t worry! Even the funniest comedians miss their audience’s funny bones from time to time. Payne says, “You just have to develop a little bit of a tough skin, and know that somebody not laughing at your jokes isn't a personal attack on you or your personality.” [17] X Expert Source Kendall Payne Writer, Director, & Stand-up Comedian Expert Interview. 3 April 2020."
    },
    {
      "title": "Learn to appreciate witty wordplay and puns.",
      "content": "Learn to appreciate witty wordplay and puns. Wordplay is when you exploit the twists and turns of language to get a laugh. A pun is a specific type of wordplay that uses the multiple meanings of a word or substitutes a similar-sounding word to make a joke. [18] X Research source The comedy comes from linguistic confusion (unintentional) or linguistic playfulness (intentional), meaning people find things humorous when there's a gap between our words and our meanings. [19] X Research source Freudian slips are linguistic errors that are believed to expose what you were really thinking rather than what you \"meant\" to say. For example, if you’re at work, making a big speech and instead of “Our company values innovation,” you say, “Our company values inebriation.” Witty wordplay is more intentional. For example, \"Why did the chicken cross the road? She wanted to be poultry in motion.\" Or this one, where \"hockey game\" and \"fight\" are switched for comedic effect: \"I went to a fight the other night, and a hockey game broke out.\""
    },
    {
      "title": "Use irony to make your jokes and comments funnier.",
      "content": "Use irony to make your jokes and comments funnier. Irony is when there’s a gap between our expectations of a statement, situation, or image and the actual experience of it. [20] X Research source For example, legendary comedian Jackie Mason used comedic irony in this joke: \"My grandfather always said, 'Don't watch your money; watch your health.' So one day, while I was watching my health, someone stole my money. It was my grandfather.\" Mason’s joke plays with our expectation that grandfathers would only offer their grandsons sincere advice. Then, it presents a thieving grandfather who double-crosses his grandson. Another example of using comedic irony is in the film Dr. Strangelove when the President of the United States says, “Gentlemen, you can’t fight in here. This is the war room!”"
    },
    {
      "title": "Try some observational humor to better relate to your audience.",
      "content": "Try some observational humor to better relate to your audience. Observational humor is when you draw attention to the normal stuff that happens every day in a way that makes you laugh. Using this type of humor requires you to be observant so you can see the ridiculousness of everyday life. Payne says to look for humor in everyday situations to see what other people miss. [21] X Expert Source Kendall Payne Writer, Director, & Stand-up Comedian Expert Interview. 3 April 2020. Often, that unnoticed humor gets the biggest laugh. For example, Jerry Seinfeld once made this observation about ordering food in a restaurant, “I don't wanna know about the specials. I'm sick of the specials. I hate the specials. My feeling is, if the specials were so special, they'd be on the menu.” Jerry Seinfeld, Ali Wong, and Brian Regan have made their careers on making observations about everyday occurrences and experiences."
    },
    {
      "title": "Broaden your horizons to get more material for jokes.",
      "content": "Broaden your horizons to get more material for jokes. It’s much easier to find funny moments in a subject you know well, whether it’s computer programming, 17th-century poetry, or mishaps on your family fishing trips. The more you know about a wide range of subjects, the more people will relate to what you say and find humor in it. For example, if you can find humor in theoretical physics and Paris Hilton, you’ll be able to connect with many different types of people. Drawing an interesting parallel between two wildly different subjects can be very funny if done well. In one sense, being funny is simply showing that you are intelligent enough to find the humorous nuances that others miss. For example, a comic might relate flossing with the breeding practices of chimpanzees to make people see it in a new light…and laugh at it."
    },
    {
      "title": "Read and study the subject of comedy.",
      "content": "Read and study the subject of comedy. Read everything you can get your hands on, especially if it’s funny. Reading and practicing the subject of comedy is the same as chemistry, writing, or any other skill. Plus, you might find reading humorous books might inspire you! When you’re reading joke books, pick them apart to analyze what makes them funny. Then, try to work out why some jokes do not work. Choose works by people like James Thurber, P.G. Wodehouse, Stephen Fry, Kaz Cooke, Sarah Silverman, Woody Allen, Bill Bryson, Bill Watterson, Douglas Adams, etc. (Don't forget children's books by good authors; they can be a terrific source of good humor!) Try reading a few memoirs by funny people, like Bossypants by Tina Fey, Born Standing Up by Steve Martin, Let’s Pretend This Never Happened by Jenny Lawson, and I Can't Make This Up: Life Lessons by Kevin Hart."
    },
    {
      "title": "Be an active listener to learn what people think and feel.",
      "content": "Be an active listener to learn what people think and feel. Listen carefully to others and understand what they're about, especially if they’re funny. Try to notice and relate to the small joys of their lives, too. This helps to make your humor more believable and empathetic to others. [22] X Research source Active listening means giving the other person your full attention without distractions. Maintain eye contact to let the other person know you’re focused on them. Smile, nod, or give verbal affirmations as they speak to show you’re engaging with what they say. Try to avoid thinking about what you want to say next. Listen to everything they have to say and pause to think before speaking."
    },
    {
      "title": "Improve your mental and physical health with humor.",
      "content": "Improve your mental and physical health with humor. Kove says that laughter is one of the most healing things you can do for yourself and recommends making an effort to find the humor in every situation. [23] X Expert Source Rachel Kove Life Coach Expert Interview. 27 April 2022. The benefits of humor are physical, cognitive, emotional, and social. They include reduced stress, increased mood and creativity, and happier relationships with others. A few other benefits of having a sense of humor are: [24] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Decreasing pain Strengthening relationships Boosting immunity Preventing heart disease Relaxing muscles Improving your mood"
    },
    {
      "title": "Laughter helps you deal with stress and anxiety.",
      "content": "Laughter helps you deal with stress and anxiety. Sometimes, the best way to deal with negative emotions or heavy subjects is to use humor to lighten the mood, recommends Muñoz. [25] X Expert Source Patrick Muñoz Public Speaking Coach Expert Interview. 15 December 2022 Laughter is a powerful tool to fight anger, stress, anxiety, and depression. A good joke is a great way to take the pressure off yourself—or others. [26] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source Notice what makes you feel uncomfortable and defensive and find humor in the situation to let go of your defensiveness. Finding the humor in your life can also help you overcome anxiety ."
    },
    {
      "title": "Take yourself less seriously.",
      "content": "Take yourself less seriously. Hold on to your sense of humor, even in those most serious circumstances, recommends Muñoz. [27] X Expert Source Patrick Muñoz Public Speaking Coach Expert Interview. 15 December 2022 Use your most embarrassing moments as fuel for your humor. If you can use these cringe-worthy moments to make people laugh, it’s easier to be more spontaneous and get over any fears that hold you back. Take a page from famous improv comic Colin Mochrie, who said: \"He had the kind of face only a mother could love if that mother was blind in one eye and had that kind of milky film over the other... but still, he was my identical twin.\" Having a sense of humor helps you have fun despite what life throws at you. That means you can laugh at life and poke fun at your situation, which is key to having a great sense of humor. Focus on the positives and be forgiving when other people make mistakes to reduce conflicts in your life. [28] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    }
  ]
}