{
  "url": "https://www.wikihow.com/Be-Less-Perverted",
  "title": "How to Stop Being a Pervert",
  "steps": [
    {
      "title": "Understand that sexual thoughts are perfectly natural.",
      "content": "Understand that sexual thoughts are perfectly natural. Almost everyone has sexual thoughts, and almost everyone has them every day. It’s a natural part of being a human being, and you shouldn’t be too worried just for having them. That goes for fantasies, too—they’re normal and even healthy, so long as they don’t get in the way of living your life. [1] X Research source Your thoughts and your actions are two different things, and it’s your actions that decide who you are. Thoughts are just that—thoughts. Teens and young adults especially have lots of sexual thoughts and urges—it’s a natural part of growing into an adult."
    },
    {
      "title": "Everyone’s sexuality is different.",
      "content": "Everyone’s sexuality is different. It’s hard to pin down what a “healthy” sexuality is, because it’s different for everyone. Some people enjoy engaging in casual sex, while to others this practice would be horrifying; some people enjoy masturbation while others are embarrassed or refuse to masturbate. A healthy sexuality is one that feels healthy for you and which makes your life better. [2] X Research source It means feeling sexually fulfilled and happy without having feelings of shame or hatred toward yourself. Some people’s sexuality is based on their religious beliefs, while others are based on their lifestyle. It’s not one-size-fits-all all! Also, there’s absolutely nothing wrong with same-sex attraction, or being part of the LGBTQ+ community."
    },
    {
      "title": "Sexual thoughts are only a problem if they’re distracting or harmful.",
      "content": "Sexual thoughts are only a problem if they’re distracting or harmful. When sexual thoughts become a problem, or a perversion, is when they get in the way of your everyday life. They might distract you from school or work, or you might have trouble socializing because of those thoughts. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source That doesn’t mean that you’re a bad person, just that you might need to get a hold of those thoughts so that they don’t cause more problems. If your thoughts lead you to hurt other people emotionally or physically, that’s also a huge red flag that you may need professional help. Your sexual thoughts might also be troubling to you, yourself, and cause distress. That’s also a warning sign that you may need assistance."
    },
    {
      "title": "Ask yourself if your sexual thoughts interfere with your life.",
      "content": "Ask yourself if your sexual thoughts interfere with your life. You may spend hours each day obsessing over certain videos or fantasizing about sex in a way that takes away from you living your life. How much is your perversion preventing you from living a productive or happy life? Do people get hurt? How are these thoughts and behaviors causing problems? If these thoughts prevent you or other people from being happy, it’s time for a change. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Reflect on how your thoughts and actions affect your day-to-day life and how your life would change if they were to disappear. Would you free up more time? Would you feel better about yourself? Would other people think differently of you?"
    },
    {
      "title": "Decide what sex and sexuality mean for you.",
      "content": "Decide what sex and sexuality mean for you. What you think of as “perverted” might just be something you’re not sexually comfortable with. That’s okay! But don’t focus on removing all sexuality from your life. Instead, focus on creating a healthy sexual atmosphere for yourself, in your body and within your mind. Remember that it is not realistic to hold yourself to a standard of not having any sexual thoughts or desires. You do, however, have control over your behaviors. [5] X Research source Write a list of what you believe healthy sexuality is to you. Focus on defining healthy thoughts and actions, how you engage with other people in a sexual way, and how you feel about yourself afterward. Think about the things that make you feel good versus the things that make you feel bad. What is the difference between these two things? What do you want to avoid, and what are you comfortable with?"
    },
    {
      "title": "Question your own shame and guilt about your thoughts.",
      "content": "Question your own shame and guilt about your thoughts. “I think that people contend to shame themselves and punish themselves for this issue,” Miller says, but shame isn’t always helpful. Often, sexual shame is a result of what society says is right and wrong. Society is sometimes right, but it’s also often wrong. If your thoughts and urges aren’t hurting anyone, then they’re probably totally normal and natural, and you have nothing to be ashamed of. Recognize when you feel ashamed. Is it after masturbating or after viewing pornography? Is it after having sexual thoughts? Decide how you feel about the action, and if it’s something that actually needs to stop (like if it’s hurting you or someone else), or if it’s the shame itself that has to stop. Where does the shame stem from? Is this a belief that was passed down in your family? Does it relate to deeply held religious beliefs? Understanding the source of the shame can help you work through it."
    },
    {
      "title": "Be kinder to yourself, your body, and your desires.",
      "content": "Be kinder to yourself, your body, and your desires. Your sexual shame may stem from embarrassment about your own body and its processes or appearance. If you feel shame or embarrassment toward your own body, learn to accept yourself as you are. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source The more you accept yourself, your body, and your own sexuality, the less you may experience unhealthy sexuality. Try standing in the mirror and pointing out what part of your body makes you feel bad. Then, say, “I love [that part] because it’s part of me.” You might not celebrate all parts of your body, but take some time to express gratitude for the little things your body does for you and the abilities it gives you. [7] X Research source Your body tells a story. Your skin tone, freckles, and scars each encapsulate a story of ancestry and experience. Celebrate your family and your own unique experiences on your living canvas."
    },
    {
      "title": "Get rid of any sexual images, magazines, or content you might have.",
      "content": "Get rid of any sexual images, magazines, or content you might have. When you have easy access to sexual content, it’s easy to get distracted by it. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Miller tells us it can even become an addiction. Delete any videos or images from your phone or computer. Throw out sexual magazines or books. Discard stickers, T-shirts, or objects that tempt you. This makes it easier to keep your mind clear of unwanted thoughts or urges. Use a parental control tool to stop you from opening porn websites. If you have to unlock that software, this buys you some seconds to think again and direct the impulse somewhere else. If you struggle with consuming pornography, this can also help manage your porn addiction ."
    },
    {
      "title": "Clean up your sense of humor, and keep your interactions nonsexual.",
      "content": "Clean up your sense of humor, and keep your interactions nonsexual. Making sexual jokes may be your way of making sexual comments with the guise of being funny, but in reality the joke can be hostile or disrespectful. [9] X Research source Poking fun at someone’s sexuality is never appropriate, especially when spread as gossip or intended to hurt someone. For many people, sex is only something they joke about with their closest friends, if at all. Don’t crack sexual jokes in front of people you don’t know like that. Avoid bringing up the topic of sex in public, or with other people, unless they broach the topic themselves. Even then, be careful what you say—it may be better not to participate at all. Tone down your compliments , too. Instead of, “You’re hot,” say something neutral and pleasant, like, “I like your earrings.”"
    },
    {
      "title": "Distract yourself with activities you enjoy.",
      "content": "Distract yourself with activities you enjoy. If you catch yourself in a thought or behavior you want to change, redirect your attention. Often, creative activities, like singing or drawing, or thoughtful activities, like solving puzzles or math problems, are great ways to redirect that energy. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you’re having a hard time staying focused, take a break and go to the bathroom, take a walk, or engage in something else altogether."
    },
    {
      "title": "Find healthy outlets for your sexual energy.",
      "content": "Find healthy outlets for your sexual energy. If you think your perversion is because you’re sexually frustrated or repressed , think about healthy ways to manage that pent-up energy. It’s totally normal and even healthy to masturbate now and then to release that energy. [11] X Research source Or, get some physical exercise to let that energy out of your body in a non-sexual way."
    },
    {
      "title": "Respect other people’s physical and emotional boundaries.",
      "content": "Respect other people’s physical and emotional boundaries. If you have sexual thoughts toward certain people, make sure you’re treating them with respect. Remember that they’re complex humans, just like you, and aren’t just sexual objects. This can help you manage your fantasies or urges, and see people as complete and worthy of dignity. [12] X Research source For example, if you fantasize about a particular person often, instead think about their worries, faults, or daily life to remind yourself that they’re not just material for your fantasies—they’re their own person. Respect other people’s boundaries, and remember that no always means no, and only “yes” means yes. In general, keep your hands to yourself."
    },
    {
      "title": "Think before you speak or act in public or with others.",
      "content": "Think before you speak or act in public or with others. Moore says to \"make sure you exercise caution and think long-term not just in the moment.\" Not everyone wants to talk about sex. Some behaviors can even be considered sexual harassment or bullying, which could get you into a lot of trouble. Before you say or do something sexual, ask yourself if it’s the right time or place. Make sure that you avoid: [13] X Research source Making sexual jokes or gestures. Bringing up sex in inappropriate situations, such as during class, while someone is telling you a story, or in other situations you think it might make people feel uncomfortable. Sending sexual text messages or inappropriate pictures to people. [14] X Research source Touching your private parts in public. Touching other people in inappropriate and/or unwelcome ways. Exposing yourself to people."
    },
    {
      "title": "Take responsibility for your mistakes.",
      "content": "Take responsibility for your mistakes. If you’ve done something to make someone uncomfortable, or to hurt someone, it’s important to own up to that and try to make it right. If someone says you did something wrong, listen and learn from them. That way, the people around you know that you’re making an effort to improve, and will trust you more in the future. [15] X Research source Learn to apologize for unwanted remarks. A simple, “I’m sorry. That was uncalled for,” often goes a long way."
    },
    {
      "title": "Manage your stress levels to reduce your sexual frustration.",
      "content": "Manage your stress levels to reduce your sexual frustration. If you feel stressed, you may be more vulnerable to revert back to bad habits. Don’t let stress build up; find ways to decrease stress each day. Engaging in exercise, being social, and avoiding unnecessary stress are excellent ways to manage stress . [16] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Join a running club, start yoga, or go for daily walks with your dog. Call up a friend, host a game night, or plan to see your friends for dinner. If you feel chronically stressed but are not sure how to pinpoint it, start a stress journal and keep track of what stresses you each day/week/month. You may start to find patterns of the stressors you experience, then begin to tackle them one by one"
    },
    {
      "title": "Surround yourself with supportive, understanding people.",
      "content": "Surround yourself with supportive, understanding people. Don’t surround yourself with people who encourage you to think or act in a perverted way. You may need to take a break from certain friends or choose new friends altogether. Allow people in your life to support you and encourage you to live the way you find most beneficial. Having good support in your life helps you combat stress and live the way you want to live. [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If there are people that negatively influence you yet are a fixture in your life, kindly ask them to tone down their comments or behavior, or not to discuss those things in your presence. Tell your friends you’re trying to tone down your own inappropriate comments and behavior. They’ll likely be supportive and understanding, if they’re true friends. Start an accountability group if you and your friends struggle with similar problems. Send supportive texts, meet for lunch, and keep each other on track."
    },
    {
      "title": "See a therapist if the problem feels overwhelming.",
      "content": "See a therapist if the problem feels overwhelming. If you feel like you cannot control your thoughts, feelings, and behaviors and don’t think you can do the journey on your own, see a therapist. A therapist can help you confront your feelings, find coping strategies, and work through the process of decreasing negative sexual thoughts. Your therapist is there to support you and help you live a happier, more fulfilling life. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can also join a support group, either locally or online, such as the Society for the Advancement of Sexual Health or Sex Addicts Anonymous."
    }
  ]
}