{
  "url": "https://www.wikihow.com/Call-Australia-from-Canada",
  "title": "How to Call Australia from Canada",
  "steps": [
    {
      "title": "Dial \"011\" from a landline or cell phone to enter Canada’s exit code.",
      "content": "Dial \"011\" from a landline or cell phone to enter Canada’s exit code. Country exit codes tell your phone provider that you are placing an international call. Canada’s exit code is 011, and it should be the first 3 numbers you dial when making your call. [1] X Research source The start of your call to Australia will look like: 011-xx-x-xxxx-xxxx."
    },
    {
      "title": "Input \"61\" to direct your call to Australia.",
      "content": "Input \"61\" to direct your call to Australia. For international calls, each country has its own code to direct the call. After you input Canada’s exit code, enter “61.” This code directs your call to Australia. [2] X Research source At this point, the phone number should look like 011-61-x-xxxx-xxxx."
    },
    {
      "title": "Enter the city code if you’re calling a landline.",
      "content": "Enter the city code if you’re calling a landline. Each city in Australia has a city code that you’ll need to know if you’re calling a landline. The number will be 2, 3, 7, or 8, depending on the region the city is located. [3] X Research source For example, Melbourne’s city code is 3. Sydney’s city code is 2. If you’re calling someone in Sydney, Australia, your number will look like this: 011-61-2-xxxx-xxxx"
    },
    {
      "title": "Select the number “4” instead of the city code if you’re calling a cell phone.",
      "content": "Select the number “4” instead of the city code if you’re calling a cell phone. If you’re calling a cell phone number, you do not need the city code. Instead, dial the number 4, which is for mobile telephones in any part of Australia. [4] X Research source If you’re dialing a mobile number, it should look like this so far: 011-61-4-xxxx-xxxx."
    },
    {
      "title": "Enter the local telephone number.",
      "content": "Enter the local telephone number. Australia’s telephone numbers are 8 digits long, excluding the city codes. In total, your phone number will be 14 digits long, including Canada’s exit code, Australia’s country code, and the city code. [5] X Research source A correctly dialed Australian cell phone number will look like this: 011-61-4-1234-5678. To call a landline in Sydney, Australia, you would dial “011-61-2” followed by the number. Do not include the trunk code “0” when dialing the number. The trunk number is only used for domestic calls within the country, and not necessary for international calls."
    },
    {
      "title": "Purchase a calling card if your phone plan doesn’t include international calls.",
      "content": "Purchase a calling card if your phone plan doesn’t include international calls. With an international calling card, you pre-pay for the minutes. Visit your local convenience store or shop online to find a calling card. Depending on your cellphone or landline service, it may be much less expensive to use a calling card. [6] X Research source Read reviews and stick with big name companies, and make sure to check the fine print of any calling card you buy. Some companies round up your minutes used in large increments, while others may have connecting fees or service fees in addition to the per-minute charges."
    },
    {
      "title": "Download smartphone apps to make video and voice calls to Australia.",
      "content": "Download smartphone apps to make video and voice calls to Australia. WhatsApp , FaceTime, Skype, Viber , Google Voice and Rebtel all have apps specifically for international communication, and a lot of times, the service is free. [7] X Research source Keep in mind that person you’re calling needs to have the same app on their phone in order to communicate with you. A lot of these apps also allow you to text internationally for free, too."
    },
    {
      "title": "Use your computer to place calls for free.",
      "content": "Use your computer to place calls for free. Use Facebook Messenger , Skype, or Google Hangout from your laptop or tablet to place free international calls without using a phone. [8] X Research source Make sure you’re connected to WiFi and that the person you are calling has access to the same program."
    }
  ]
}