{
  "url": "https://www.wikihow.com/Become-a-Millwright",
  "title": "How to Become a Millwright",
  "steps": [
    {
      "title": "Learn about the job.",
      "content": "Learn about the job. Millwrights tackle a variety of tasks related to industrial machinery. As a millwright, you should expect to install, maintain, and dismantle heavy machinery and equipment across a wide range of industries. Millwrights log plenty of hours at manufacturing plants and construction sites, but they also assist in mining operations, power plants, and commercial sites. You could end up installing an escalator at the mall or a large conveyor belt in a nearby factory. Most of the work involves physical labor, but you'll also need to know how to read blueprints and troubleshoot problems that arise during installation or maintenance."
    },
    {
      "title": "Meet the basic requirements.",
      "content": "Meet the basic requirements. For legal reasons, you'll need to meet a few basic requirements concerning age, working status, and related matters. [1] X Research source You must be at least 18 years old or 17 years old with written parental consent before joining an apprenticeship program. There is no maximum age limit, however. If you aren't currently a citizen or legal resident of the country you plan to work in, you'll need to go through the appropriate paperwork to achieve legal employable status. When working in the United States, you need to be able to read and understand English. This is vital so that you can understand your training courses and on-site instruction. Fluent communication also makes the working conditions safer for both you and your future coworkers."
    },
    {
      "title": "Stay in shape.",
      "content": "Stay in shape. Since so much of the work involves manual labor, you need to be healthy and in physically adequate shape. If you aren't strong enough to lift and move moderately heavy equipment, you won't be strong enough to complete many of the tasks you'll be assigned. You should be able to lift at least 75 lbs (34 kg) on a regular basis, if not more. This will allow you to perform the lift, pull, and hold heavy tools and equipment necessary for the job. Aside from lifting strength, you should also have the endurance to stand, stoop, and move around for long periods of time without rest. For these reasons, this may not be the right job for someone with joint troubles, breathing difficulties, or other chronic physical ailments."
    },
    {
      "title": "Earn your high school diploma.",
      "content": "Earn your high school diploma. All millwrights must have, at minimum, their high school diploma or GED. You should earn your diploma or GED before you attempt to join an apprenticeship program. If you're still in high school, it's a good idea to take courses that will help prepare you for more advanced training later on. Such courses may include advanced mathematics, drafting, mechanical drawing, metal/industrial shop, and other construction classes."
    },
    {
      "title": "Attend technical school.",
      "content": "Attend technical school. While not strictly necessary, you should consider completing an appropriate program at a community college, vocational school, or technical school. Doing so may make it easier to find work. Many millwrights opt for either formal education or training through an apprenticeship program, but you can improve your chances of finding work by completing both. The best way to progress is to complete a few courses at a technical school before looking for work as an apprentice. You can then complete the rest of your schooling and your apprenticeship simultaneously. While completing a technical program, you should expect to cover topics like blueprint reading, hydraulics, mill maintenance, occupational job searching, industrial math, and welding. [2] X Research source"
    },
    {
      "title": "Build related skills.",
      "content": "Build related skills. In addition to the skills directly required for the job, you should also learn knowledge and improve indirectly related skills you'll inevitably use while working as a millwright. [3] X Research source Improve your ability to work through problems. This requires keen attention to detail, analytical thinking, and innovation. Prepare to work both independently and in cooperation with teammates and clients. When working independently, you need to be dependable, eager to take initiative, and capable of exercising self-control. When working with others, you'll need to be patient and capable of showing concern for those involved in the project."
    },
    {
      "title": "Join the union.",
      "content": "Join the union. Millwrights are members of the United Brotherhood of Carpenters and Joiners of America. It'll be much easier to find an apprenticeship and an actual job if you join this union when you first start searching. When you join the union, you'll also get benefits like medical care, dental care, vision care, vacation hours, annuity, and a pension. To join the union, contact the nearest UBC training center or regional council and proceed by following their instructions. [4] X Research source Find the nearest UBC regional council here: https://www.carpenters.org/regional-council/"
    },
    {
      "title": "Complete an apprenticeship program.",
      "content": "Complete an apprenticeship program. Most prospective millwrights break into the field by joining an apprenticeship program. These programs take four to five years to complete and combine classroom instruction with paid on-the-job training. The easiest way to find an apprenticeship will be to contact your local labor-management committee. Call or visit your local millwright union for guidance and assistance. During your apprenticeship, you'll work under the guidance of \"journeymen,\" skill workers who will teach you the things you need to know while on the job. Most programs require you to complete 48 months and 4,800 work hours. You may also need to complete 576 hours of related instruction."
    },
    {
      "title": "Focus on the most needed skills.",
      "content": "Focus on the most needed skills. Certain types of millwright work are in higher demand than others, so training in those areas will improve your chances of finding a full-time job after your apprenticeship ends. [5] X Research source Job availability for the field is expected to grow at a slow rate of only one to six percent through 2016, which is slower than anticipated for most professions. The installation of new machinery and removal of old machinery are the two tasks most needed in the current job market. As such, you should make sure that your apprenticeship gives you experience with machining, welding, and general mechanics."
    },
    {
      "title": "Understand the payment scale.",
      "content": "Understand the payment scale. As with most jobs, you'll start at a fairly low rate when you first enter the field, but your wages will increase as you grow in experience and skill. You will earn money as an apprentice, but typically, you'll only make roughly half the wage of the journeymen you work with. Your wage will increase every six months or so, and by the end of your apprenticeship program, you should reach the low end of the full journeyman's payment scale. The annual salary of most millwrights ranges between $46,658 and $62,166, but the top 10 percent of millwrights earn more than $72,375."
    },
    {
      "title": "Find work.",
      "content": "Find work. After you complete your apprenticeship program, you will be eligible to find work as a fully trained millwright. Start by inquiring with the journeymen and company you've done your apprenticeship with. If they are unable to offer you full-time work, you can seek help from the union or state apprenticeship bureau. You may also need to search through the classifieds and other job ads. Expect to work eight-hour days. You'll usually work indoors, but you may also need to work outdoors depending on the job. Typically, you'll also need to travel long distances for work, especially if you don't live in a densely populated area. The union requires employers and clients to offer over-time pay and travel allowance for such circumstances, however."
    },
    {
      "title": "Work your way up.",
      "content": "Work your way up. As you gain more skill and work experience, you may be promoted to supervisory and team leadership positions. These positions usually come with better pay and may include additional benefits. To further improve your chances of promotion, you should complete additional coursework and continue to earn related certificates from technical schools, training programs, and other institutions."
    }
  ]
}