{
  "url": "https://www.wikihow.com/Call-Brazil",
  "title": "How to Call Brazil",
  "steps": [
    {
      "title": "Obtain your country's exit code.",
      "content": "Obtain your country's exit code. Your country's exit code allows you to dial out of your country. It is also referred to as an “international access code or IDD (International Direct Dialling) code. Every country has a different code. If you do an online search for “<your country> exit code,” the code for your country should come up right away. Exit code examples: USA and Canada = 011, United Kingdom (and many other countries, including Argentina and New Zealand) = 00"
    },
    {
      "title": "Know that Brazil's country code is 55.",
      "content": "Know that Brazil's country code is 55. A country code allows you to call that country from another country — Brazil's country code allows you to call Brazil from outside of Brazil. Country codes consist of one to two digits; you dial them after you've dialed your country's exit code. So far, the numbers you would dial into your phone would be <your country's exit code> + 55: if you are in the United States or Canada, this would be 011-55. If you ever want to look up a country code, the following online search should give you immediate results: “what is <country's> country code.”"
    },
    {
      "title": "Confirm that you have the correct area/city code.",
      "content": "Confirm that you have the correct area/city code. An area code can be 1 to 3 digits long and will narrow your call geographically in the country you are calling. Brazil uses 2-digit area codes. Brazil has many area codes, so which one you use will depend upon which city/area you need to call. If you don't already know the area code, do an Internet search for “<city> Brazil area code.” Brazilian area code examples include Rio de Janeiro = 21, Anapolis = 91, São Paulo = 11: if you were calling somewhere in São Paulo from the United States, the numbers you would dial so far (before the local 8-digit number) would be 011-55-11. It is likely that the area code is already included in the phone number. You might see it in brackets in front of the local number — for example (11) 5555-5555."
    },
    {
      "title": "Double check the local phone number you wish to dial.",
      "content": "Double check the local phone number you wish to dial. This is the direct phone number of the residence/business you are contacting in Brazil. Brazil uses 8-digit local phone numbers. If you are unsure of the number, double check it via email/social media (for a personal contact) or through an Internet search (if it's a business, government body etc.)."
    },
    {
      "title": "Write down the complete international phone number.",
      "content": "Write down the complete international phone number. Before making the call, you might want to write the number down or enter the entire phone number into a text document in case you need to use it again. The order of the numbers will be <your country's exit code> + 55 (Brazil's exit code) + <Brazilian area code> + <8-digit local phone number>. If you were calling the local number 5555-5555 in São Paulo, Brazil, from the USA, you would write down, and then subsequently dial, 011-55-11-5555-5555."
    },
    {
      "title": "Dial the complete international phone number.",
      "content": "Dial the complete international phone number. Once you have gathered the necessary numbers, dial and wait for a ring to signal a proper connection."
    },
    {
      "title": "Use an Internet-based application.",
      "content": "Use an Internet-based application. VoIP (voice over Internet protocol) applications allow you to make international calls for much cheaper than through your phone provider. All you need is a computer, tablet or smart phone, and an Internet connection. Popular applications include Skype, Google+ Hangouts, Viber, and Jitsi. [1] X Research source If you call Brazil often, check to see if your VoIP app offers subscriptions, or monthly flat rates for a predetermined amount of minutes in calls to Brazil. This can significantly reduce your per-minute VoIP costs."
    },
    {
      "title": "Video chat instead.",
      "content": "Video chat instead. If you're calling someone you know, you might consider asking them to video chat with you instead. Many social media sites and applications (including Google+ Hangouts and Skype) provide free video chat services. In the same vein, many applications (WhatsApp, Skype, Facebook) allow for free calls within the applications — meaning that you'd need an Internet connection on both your end and the receiver's end to make the call."
    },
    {
      "title": "Buy an international calling card.",
      "content": "Buy an international calling card. If you have no Internet connection, but you have a landline with free local minutes, a calling card is likely your best option. Calling cards vary greatly in rates and hidden fees. Look for a calling card that offers simple, straightforward pricing and few hidden and/or extra fees. Popular calling cards include Pingo, EnjoyPrepaid, Comfi, Nobelcom, and CallingCards. Unless your mobile phone has unlimited minutes, a calling card is likely not your best option, as you will end up paying for your mobile minutes on top of the calling card minutes: if your mobile phone provider charges you 25 cents per minute and the calling card costs you an additional 2 cents per minute, you'll pay at least 27 cents per minute (not including any connection fees or hidden costs you may need to pay through the calling card)."
    },
    {
      "title": "Consult your phone provider.",
      "content": "Consult your phone provider. If you are consistently making international calls and are either unwilling or unable to use a VoIP application, considering calling your phone provider to see if they can offer you some sort of international long-distance rate package."
    },
    {
      "title": "Check the local time.",
      "content": "Check the local time. There are 4 time zones in Brazil that range from -2 to -5 hours in relation to Greenwich Meridian Time (GMT), which is the international meridian marking the starting point for all other time zones. The official time zone for Brazil (where Rio, São Paulo, and the federal capital of Brasília are located) is -3 hours. Example: If you are calling São Paulo from New York when Daylight Savings Time (DST) is in effect, be aware that São Paulo is one hour ahead of New York at this time. This would be particularly important to pay attention to when calling at night, when the recipient might be asleep."
    },
    {
      "title": "Learn some basic Portuguese.",
      "content": "Learn some basic Portuguese . The official language of Brazil is Portuguese. Knowing some basic phrases will help you avoid confusion if someone other than your intended recipient answers the phone: Hello, my name is… = Oi, meu nome é… Do you speak <insert your language here (ex., English)>? = Você fala <inglês>? May I please speak to… = Por favor, posso falar com… Can I please leave a message? = Eu posso por favor deixe uma mensagem? My phone number is… = O meu número de telefone é… Thank you very much = Muito obrigado (make it Obrigadoa if you're a female) [2] X Research source"
    },
    {
      "title": "Be prepared to follow up.",
      "content": "Be prepared to follow up. Some sources suggest that for Brazilian people, phone calls are not as effective as email and personal visits, and voice messages are rarely returned. If you leave a message for someone and your message is not returned within 2 or 3 days, you might try contacting the person or company by email, or simply calling once more. [3] X Research source Try not to be rude or express frustration at having difficulty communicating via the phone and/or voicemail as it is likely just a cultural difference."
    }
  ]
}