{
  "url": "https://www.wikihow.com/Check-Dpi-of-Image",
  "title": "4 Simple Ways to Find the DPI of an Image on a Computer",
  "steps": [
    {
      "title": "Navigate to the image.",
      "content": "Navigate to the image. If the image is in your Pictures folder , use the File Explorer to navigate there now."
    },
    {
      "title": "Right-click the image and click Properties.",
      "content": "Right-click the image and click Properties . This will be at the very bottom of the pop-up menu. A new window will open."
    },
    {
      "title": "Click Details.",
      "content": "Click Details . This is the tab at the top, between Security and Previous Versions ."
    },
    {
      "title": "View the DPI.",
      "content": "View the DPI. Scroll down to the Image header. You'll find the DPI next to Horizontal resolution and Vertical resolution . If you need to change the DPI, you'll need to use a program such as Adobe Photoshop to convert and/or resize it."
    },
    {
      "title": "Open the File Explorer",
      "content": "Open the File Explorer . Click the Start menu and click the folder icon, or press the Windows key + E ."
    },
    {
      "title": "Click View.",
      "content": "Click View . This is the tab at the top, next to Share ."
    },
    {
      "title": "Click Details.",
      "content": "Click Details . If this isn't already selected, the files will be shown in list format."
    },
    {
      "title": "Right-click the column headers and click More….",
      "content": "Right-click the column headers and click More… . In most cases, you'll already have the column headers: Name, Date, and Type. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source A pop-up window will open."
    },
    {
      "title": "Add \"Horizontal resolution\" and \"Vertical resolution.\"",
      "content": "Add \"Horizontal resolution\" and \"Vertical resolution.\" You'll need to scroll down to find these options. Check the box next to both options and then click OK to add them as column headers in the File Explorer."
    },
    {
      "title": "Navigate to the image's location.",
      "content": "Navigate to the image's location. You should see the DPI immediately underneath the \"Horizontal resolution\" and \"Vertical resolution\" headers."
    },
    {
      "title": "Right-click the image file.",
      "content": "Right-click the image file. A pop-up menu will open."
    },
    {
      "title": "Hover over Open with and click Paint.",
      "content": "Hover over Open with and click Paint . This can be found in your list of applications. If you don't have this program, you can easily download it from the Microsoft Store . The image will open in Microsoft Paint ."
    },
    {
      "title": "Click File.",
      "content": "Click File . This will be at the top-left corner."
    },
    {
      "title": "Click Properties.",
      "content": "Click Properties . You can find this towards the bottom of the menu, next to the checkmark icon. A new window will open."
    },
    {
      "title": "Find the DPI.",
      "content": "Find the DPI. You'll see the image's DPI next to Resolution ."
    },
    {
      "title": "Navigate to the image and right-click it.",
      "content": "Navigate to the image and right-click it . You can use the Finder to locate the file."
    },
    {
      "title": "Select Open With, and then click Preview.",
      "content": "Select Open With , and then click Preview . This program comes pre-built into Mac devices. The image will open in Preview."
    },
    {
      "title": "Click Tools.",
      "content": "Click Tools . This is the tab at the top."
    },
    {
      "title": "Click Show Inspector.",
      "content": "Click Show Inspector . A new panel will open."
    },
    {
      "title": "Find the DPI.",
      "content": "Find the DPI. You can find the DPI next to Image DPI ."
    }
  ]
}