{
  "url": "https://www.wikihow.com/Attach-a-Merkin",
  "title": "How to Attach a Merkin",
  "steps": [
    {
      "title": "Buy a merkin online or from well-stocked wig supply shop.",
      "content": "Buy a merkin online or from well-stocked wig supply shop. The more realistic, natural-looking merkins are made from human hair hand-tied to skin-colored lace or netting. These can get quite expensive. If you are wearing a merkin as a gag, prank, or novelty, you might be interested in a fake-fur one instead. [2] X Research source Some cosmetic salons may be able to apply a merkin for you. These merkins are made from fox fur, and are glued onto your skin."
    },
    {
      "title": "Trim the merkin, if necessary, using a sharp pair of scissors.",
      "content": "Trim the merkin, if necessary, using a sharp pair of scissors. Some merkins come \"oversized\" so that you can cut them down to the right size and shape for your body. Most of the lace-backed merkins are already made to fit, but the novelty fur ones can be cut into all sorts of weird shapes."
    },
    {
      "title": "Wax your pubic hair if you plan on wearing a merkin for more than 2 days.",
      "content": "Wax your pubic hair if you plan on wearing a merkin for more than 2 days. You can still wax your pubic hair, even if you plan on wearing the merkin for just one day. Waxing is recommended for those who wish to wear their merkins longer, because it lasts longer than a shave. Choose a full Brazilian wax, as opposed to a bikini wax or a “landing strip.”"
    },
    {
      "title": "Shave your pubic hair if waxing is too painful, and you plan on wearing the merkin for only 1 or 2 days.",
      "content": "Shave your pubic hair if waxing is too painful, and you plan on wearing the merkin for only 1 or 2 days. Use a shaving gel or cream suitable for sensitive skin and a clean, sharp razor to get the closest shave possible. Because shaving does not last very long, it is not recommended for those who wish to wear their merkins for longer than 2 days."
    },
    {
      "title": "Wait several hours before attaching the merkin to give your skin time to heal.",
      "content": "Wait several hours before attaching the merkin to give your skin time to heal. Whether you shave or wax your pubic area, you will need to wait a few hours before you can apply the merkin. Both of these procedures place a fair amount of stress on your skin, leaving it sensitive and tender. You will need to give the area time to recover. Once the inflammation is gone, you can start applying the merkin."
    },
    {
      "title": "Buy some spirit gum online or from a costume shop.",
      "content": "Buy some spirit gum online or from a costume shop. If you cannot find any spirit gum, try another type of cosmetic adhesive meant for gluing on lace-front wigs, mustaches, and beards. For example, the Telesis 5 silicone matte lace adhesive is designed for use with skin and lace-backed cosmetic items. Try to get something high quality. It may be more expensive, but a cheaper product may irritate your skin. If you have not used spirit gum before, or have sensitive skin, consider doing a patch test on your inner elbow or wrist to see whether or nor you are allergic to the spirit gum. If you are allergic, consider using wig tape instead."
    },
    {
      "title": "Stand in front of a mirror, naked, and figure out where to place the merkin.",
      "content": "Stand in front of a mirror, naked, and figure out where to place the merkin. Place the merkin in your genital area to approximate its proper placement. Draw a guideline with an eyeliner if you do not feel you will be able to apply the glue in the right area. Once you apply the spirit gum, it will be tricky to remove it."
    },
    {
      "title": "Apply the glue to the back, perimeter of the merkin and wait about 20 seconds for it to get tacky.",
      "content": "Apply the glue to the back, perimeter of the merkin and wait about 20 seconds for it to get tacky. Flip the merkin over so that the mesh side is facing you. Twist the cap off the spirit gum, and use the brush to trace the perimeter of the merkin. Most bottles of spirit gum will have a brush attached to the cap, like nail polish. If yours did not come with a brush, use popsicle stick or a clean brush with short, stiff bristles instead."
    },
    {
      "title": "Place the merkin, glue side down, onto your skin.",
      "content": "Place the merkin, glue side down, onto your skin. Position it just above the pubic mound, where the majority of your pubic hair would be. If you need to make any adjustments, do so now."
    },
    {
      "title": "Smooth the merkin down onto your skin, and hold it in place until the spirit gum sets.",
      "content": "Smooth the merkin down onto your skin, and hold it in place until the spirit gum sets. Start smoothing the merkin from the center and move to the edges. Don't worry if the merkin starts to slip; it's simply because the spirit gum has not finished setting. Simply hold the merkin in place until it stays still. It should only take a few seconds for it to finish setting."
    },
    {
      "title": "Wear your merkin, and wash your body as usual if you want to wear for 3 to 4 days.",
      "content": "Wear your merkin, and wash your body as usual if you want to wear for 3 to 4 days. Avoid scrubbing the merkin itself. Spirit gum is typically waterproof and can last a few showers. Remember, this is not a permanent accessory, so you will need to remove it after day or two. Do not wear it for more than 3 to 4 days. Merkins are reusable. If you'd like to wear your merkin more often, take it off, clean it, and reapply it using the same method listed above. You can also secure it using some wig tape instead."
    },
    {
      "title": "Find some spirit gum remover.",
      "content": "Find some spirit gum remover. If you cannot find any, try baby oil or olive oil. Some sources will recommend rubbing alcohol, but this is not a product you'd want close to such a sensitive area. If you must, use some facial toner for sensitive skin instead."
    },
    {
      "title": "Dip a cotton swab in the spirit gum remover, and make sure that the cotton part is saturated.",
      "content": "Dip a cotton swab in the spirit gum remover, and make sure that the cotton part is saturated. You do not want to rip the merkin right off. Spirit gum is very strong, and you could damage your skin this way. You might also end up ripping the merkin itself if it is lace-backed. Be sure to have several cotton swabs handy."
    },
    {
      "title": "Wiggle the cotton swab under a corner of the merkin.",
      "content": "Wiggle the cotton swab under a corner of the merkin. The spirit gum remover will get under the merkin and start dissolving the spirit gum."
    },
    {
      "title": "Once you have the cotton swab under the merkin, run it around the edges.",
      "content": "Once you have the cotton swab under the merkin, run it around the edges. Keep doing this until you can peel the merkin away completely. Do not try to forcibly pull or rip the merkin from your skin. Allow the remover to dissolve the spirit gum."
    },
    {
      "title": "Gently lift the merkin away and set it aside.",
      "content": "Gently lift the merkin away and set it aside. If you feel any resistance, get out a cotton swab, soak it with some spirit gum remover, and run it around the area where you feel resistance."
    },
    {
      "title": "Clean your skin using spirit gum remover, then follow up with soap and water.",
      "content": "Clean your skin using spirit gum remover, then follow up with soap and water. Wipe the area down first using some cotton balls soaked with spirit gum remover. Next, wash the area using some soap and water. Pat yourself dry. Some people recommend applying moisturizer or baby oil to the area to keep the skin soft. [3] X Research source"
    },
    {
      "title": "Clean the merkin using more spirit gum remover.",
      "content": "Clean the merkin using more spirit gum remover. Dampen a soft-bristled brush (such as an old tooth brush) with spirit gum remover. Gently scrub the back of the merkin where the spirit gum is. If the spirit gum is not coming off, try using some 90% rubbing alcohol instead. [4] X Research source Keep doing this until the spirit gum residue is gone. Once it is gone, gently pat the merkin dry. Spirit gum remover can leave behind an oily residue. If this happens, simply wipe it off using a soft cloth soaked with rubbing alcohol."
    }
  ]
}