{
  "url": "https://www.wikihow.com/Address-a-Letter-in-Australia",
  "title": "How to Write an Australian Address for Letters & Parcels",
  "steps": [
    {
      "title": "Write the recipient’s full name in the middle of the envelope or box.",
      "content": "Write the recipient’s full name in the middle of the envelope or box. With dark ink, print their full name neatly in a single line. You can address your letter to multiple people if they live at the same place. If they both share a family name, you can write their first names, and then the last name, like: “John and Jane Rose.” If they do not share a common family name, you can include up to two people’s full names. [1] X Research source If you’re mailing someone at a business, include the name of the business on a new line underneath the recipient’s name. Tip: Professional etiquette coach Tami Claytor advises to use the recipient’s title (“Mr.,” “Mrs.,” “Dr.,” and so on) if you’re sending a formal letter."
    },
    {
      "title": "Write their street address on one line directly below their names.",
      "content": "Write their street address on one line directly below their names. The street address is the number of the house or building and the name of their street. For example: “10 Eastern Road.” [2] X Research source If the recipients live in an apartment complex, place their apartment number followed by a slash before the street number. For example, “14/10 Eastern Road” would be apartment 14 in the building at 10 Eastern Road."
    },
    {
      "title": "Include the town, state abbreviation, and postal code in capitals.",
      "content": "Include the town, state abbreviation, and postal code in capitals. Right below where you wrote the street address, write out the name of their suburb or town. Then, write the abbreviation of their state or territory and their national postal code (like a zip code in the US). All of these items should be on one line of writing and all in capital letters. [3] X Research source Not sure what their postal code is? Enter the name of the recipient’s town or suburb into the Australia Post’s “Find a postcode” web page to confirm their postal code. The Australian state abbreviations are: [4] X Research source QLD: Queensland NSW: New South Wales ACT: Australian Capital Territory VIC: Victoria TAS: Tasmania NT: Northern Territory SA: South Australia WA: Western Australia."
    },
    {
      "title": "Include “AUSTRALIA” or its country code (AU or AUS) in capitals.",
      "content": "Include “AUSTRALIA” or its country code (AU or AUS) in capitals. If you’re sending mail to Australia from another country, you’ll need to include the country’s name or its 2- or 3-digit country code on a new line beneath the town, state, and postal code. If you’re sending mail domestically within Australia, you don’t need to include the country or code. [5] X Research source Sending international mail from Australia? You’ll need to know the country code for the nation you’re sending mail to. Find a list of country codes for mail here ."
    },
    {
      "title": "Write your return address in the top left corner of your envelope.",
      "content": "Write your return address in the top left corner of your envelope. This will be the return address in case your letter can’t be delivered. Format your address the same way you formatted your recipient’s for domestic mail within Australia. Write out your full name, and on the line below, write your street address. Finally, put your suburb, state abbreviation, and postal code on the bottom line. [6] X Research source If your return address is in the USA, you can write your return address in the American format (which is essentially identical to the Australian format, but without all-capital letters in the town and postal code line). Include “US” or “USA” in capital letters as the country code. [7] X Research source"
    },
    {
      "title": "Write a PO Box number instead of a street address under their name.",
      "content": "Write a PO Box number instead of a street address under their name. Addressing mail to an Australian PO Box is simple—instead of a street address on line 2, just write “PO Box” and the Box number instead. The rest of the address is formatted the same as a typical street address. [8] X Research source Here’s an example address: John and Jane Rose PO Box 14610 ST LUCIA NSW 4079 AUS If you’re mailing a business’s PO Box, include the business name on a separate line underneath the recipient’s name and above the PO Box number."
    },
    {
      "title": "Postage for international letters and parcels (mailed from the USA)",
      "content": "Postage for international letters and parcels (mailed from the USA) According to USPS, a letter (in an envelope) can be up to 11.5x6.125 inches (29.2x15.6 cm), no more than ¼ inch (6.4 mm) thick, and weigh less than 3.5 ounces (99.2 g). To mail a letter to any country in the world from the US, you just need 1 First-Class Mail International Global Forever stamp ($.165 USD). Drop it off at any post office location or mailbox to send it. [9] X Research source Most international parcels from the US must have a maximum combined length and girth of 108 inches (2.7 meters). That means the longest side and the girth of the thickest portion of the package must add up to less than 108 inches. [10] X Research source The cost of mailing a parcel depends on the ultimate distance it travels, its weight, and the service you select for shipping. You can get an estimate of postage costs by using USPS’s Retail Postage Price Calculator ."
    },
    {
      "title": "Postage for domestic letters and parcels (mailed within Australia)",
      "content": "Postage for domestic letters and parcels (mailed within Australia) The Australia Post recognizes 2 letter sizes: small letters up to 130x240mm (5.1x9.4 in) and 5mm (0.2 in) thick, and large letters up to 260x360mm (10.2x14.2 in) and 20mm (0.8 in) thick. Anything larger than these dimensions or that contains rigid, inflexible material is considered a parcel. [11] X Research source Attach your stamps to the top right corner of the envelope or parcel. [12] X Research source Here’s the postage you’ll need: Small letters and postcards up to 250g (8.8 oz): 1 stamp ($1.50 AUD) Large letters up to 125g (4.4 oz): 2 stamps ($3 AUD) Large letters up to 250g (8.8 oz): 3 stamps ($4.50 AUD) Large letters up to 500g (17.6 oz): 5 stamps ($7.50) Parcels: Domestic parcel shipping rates and stamps depend on the size and weight of your package. Find pricing details for Australia’s standard Parcel Post here . Note that Priority or Express Post mail will cost more than standard rates. If you have a concession card, you can purchase stamps at a reduced rate. [13] X Research source"
    },
    {
      "title": "Postage for international letters and parcels (mailed from Australia)",
      "content": "Postage for international letters and parcels (mailed from Australia) International letters and parcels can be mailed with your own packaging and stamps (for non-urgent Economy options) or with a prepaid envelope or satchel from the Australia Post for expedited service. The ultimate cost depends on the size, weight, and final destination of your mail. [14] X Research source To get an estimate of what it will cost you, use this Postage Calculator tool from the Australia Post—just enter your location and your mail’s destination to get cost and delivery timeline estimates. Here are some general guidelines to keep in mind: Air Economy letters cost from $4.30 AUD up to 50g (1.8 oz) and from $11.75 AUD up to 250g (8.8 oz) with an arrival time of 15+ business days. [15] X Research source Parcels under 2kg (4.4 lbs) can be mailed by Economy Air and will arrive in 15+ business days. Heavier parcels up to 20kg (44.1 lbs) will be mailed by Sea Mail (select destination zones only) and arrive in 2–3 months. [16] X Research source International shipments must contain a CN23 Customs Form. You can prepare your Customs Declaration on the Australia Post’s site at this link . Besides Economy, the Australia Post also offers a variety of expedited services to deliver your mail more quickly. These services are more expensive and suited for important items or documents, mail that needs to be tracked, or time-sensitive deliveries."
    },
    {
      "title": "Where to post letters and parcels in Australia",
      "content": "Where to post letters and parcels in Australia For domestic letters, drop your mail off at any post office or postal box (you can purchase stamps at a post office if you don’t have any). Post collection time is typically around midday local time, so drop off your mail in the morning to ensure it’s collected the same day. Post carriers don’t work on public holidays or weekends in Australia, so if you drop off your letter then, it’ll sit for a bit before delivery. [17] X Research source International letters can also be dropped off in postal boxes. To ensure you have the correct postage for your letter’s size, weight, and destination, though, it’s often best to go to a post office and pay for postage there. Domestic and international parcels can be sent from any post office location. You may also be able to prepay and print a shipping label for International Express and International Standard through a MyPost account."
    }
  ]
}