{
  "url": "https://www.wikihow.com/Chop-Garlic",
  "title": "How to Chop Garlic",
  "steps": [
    {
      "title": "Push the flat side of a knife on the clove to loosen the peel.",
      "content": "Push the flat side of a knife on the clove to loosen the peel. Take a chef's knife and lay it on the clove so the flat side is resting on top of it. Hold the knife handle with one hand and bring the palm of your other hand down on the flat blade. The pressure of your palm will smash the clove. [1] X Research source You don't need to flatten the clove of garlic as you smash it. Just apply enough pressure to loosen the peel."
    },
    {
      "title": "Pull the peel off of the garlic clove.",
      "content": "Pull the peel off of the garlic clove. Grasp the end of the peel with your thumb and index finger. Then, you can either shake the clove out of its peel or gently tug the peel off using your fingers. [2] X Research source"
    },
    {
      "title": "Smash a whole head of garlic if you need several cloves.",
      "content": "Smash a whole head of garlic if you need several cloves. If you're going to chop more than 3 or 4 garlic cloves, speed up the process. Instead of pulling off individual cloves, place both of your palms on a whole head of garlic and push down so the cloves separate. [3] X Research source"
    },
    {
      "title": "Trim off the dry stem end of the clove.",
      "content": "Trim off the dry stem end of the clove. If you look at the peeled clove of garlic, you'll see a narrow tip at one end and a wide, dry end where it used to be connected to the stem. Use the knife to cut just the dry bit off. [4] X Research source Although the dry stem end is edible, it will be tough and won't cook down in your dish."
    },
    {
      "title": "Slice the clove into thin pieces.",
      "content": "Slice the clove into thin pieces. To prevent cutting yourself, tuck your thumb and fingers towards your knuckles as you hold the garlic clove in place. Hold the chef's knife in your other hand and slice across the entire clove, making the pieces as thin as you like. [5] X Research source If you plan on mincing the garlic, make the slices as thin as possible. For roughly chopped garlic, leaving the slices a little thicker is fine."
    },
    {
      "title": "Turn the knife 90 degrees to cut the garlic into pieces.",
      "content": "Turn the knife 90 degrees to cut the garlic into pieces. Keep one hand on the handle of the knife and position the fingers of your other hand so they're resting on the top of the knife blade near the tip. Rock the knife's blade back and forth so the blade doesn't come away from the cutting board and your fingers stay out of the way of the blade. Cut the garlic in the opposite direction to chop it into rough pieces. [6] X Research source If your recipe calls for coarsely chopped garlic, you can use the pieces now."
    },
    {
      "title": "Keep chopping if you want minced garlic.",
      "content": "Keep chopping if you want minced garlic. If your recipe calls for finely chopped or minced garlic, scoop the garlic back into a pile and continue to chop it until the pieces are as small as you like. [7] X Research source If you'd like to make a rough garlic paste, sprinkle a little kosher salt over the minced garlic. Use the flat part of a knife blade to smash and spread the garlic until it turns into a paste."
    }
  ]
}