{
  "url": "https://www.wikihow.com/Apply-a-Cold-Compress",
  "title": "How to Apply a Cold Compress",
  "steps": [
    {
      "title": "Assess all injuries before deciding on a treatment.",
      "content": "Assess all injuries before deciding on a treatment. There are a multitude of injuries that call for a cold compress. Most of these are minor bumps and bruises that don't require further medical attention. Some, like fractures, dislocations, and concussions, require emergency medical treatment. If you are at all unsure, visit the doctor or emergency room to receive the correct diagnosis and treatment."
    },
    {
      "title": "Check for a fractured bone",
      "content": "Check for a fractured bone . A fracture is a medical emergency that requires immediate treatment. You can apply a cold compress to a broken bone to reduce swelling and pain. This should only be while you're waiting for help from a medical professional, and not in place of medical treatment. If you have any of the following symptoms, either call 911 or get to the emergency room: [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [2] X Research source A deformed or misshapen body part. For example, a visible bend in the forearm would indicate a broken arm. Severe pain that gets worse when the body part is moved or pressure is applied. Loss of function in the injured area. Often the area below a broken bone will lose some or all motion. Someone with a broken leg may find it difficult to move his foot. Bone protruding from the skin. Some serious fractures push the broken bone through the skin."
    },
    {
      "title": "Check for a dislocation.",
      "content": "Check for a dislocation . A dislocation is when one or both of the bones that form a joint are forced from their normal positions. This also requires medical attention. You can apply a cold compress while waiting for medical help, just like with a broken bone. If you exhibit the following symptoms, keep the area immobile, apply a cold compress, and seek medical help: [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [4] X Research source A visibly deformed or out of place joint. Bruising or swelling around a joint. Severe pain. Immobility. It is often difficult or impossible to move areas below the dislocated joint."
    },
    {
      "title": "Examine for a concussion.",
      "content": "Examine for a concussion . While ice packs are often applied for bumps and bruises on the head, you should make sure that you aren't suffering from a concussion. This is a serious injury that requires immediate medical attention. It may be difficult to evaluate yourself for a concussion, so someone else should check you for the following symptoms and seek medical help if a concussion is suspected: [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Loss of consciousness. Even if you only lose consciousness for a few seconds, this could be a sign of a serious injury and you should seek medical help immediately. Severe headache. Confusion, dizziness, and disorientation. Nausea or vomiting. Ringing in ears. Slurred or labored speech."
    },
    {
      "title": "Decide on heat or ice for treatment.",
      "content": "Decide on heat or ice for treatment. When you've properly evaluated the injury and ensured that there is no medical emergency, you can decide on the right course of treatment. For minor injuries, people often ask if heat or cold is the ideal treatment. Both are useful in different situations. [6] X Research source Apply ice directly after an injury takes place. Within the first 48 hours of an injury, ice is usually the best treatment. It will help reduce swelling, pain, and signs of inflammation. Heat is useful for sore muscles not associated with a specific injury. You can also apply heat to your muscles before an activity or sport that often makes you sore to loosen and warm them up."
    },
    {
      "title": "Select a cold compress.",
      "content": "Select a cold compress. When it comes to cold compresses, you have several options. Some of these are available in drug stores and some you can make yourself. While there are unique advantages and drawbacks to each, all work essentially the same way — by keeping an injury cold to prevent swelling and inflammation. Gel-based ice packs. These are full of gel that stays cold when placed in the freezer. Typically these compresses get much colder than the other options since they stay in the freezer. They are also reusable, which is appealing for cost purposes. However, they generally can only be used at home since they start heating up when taken out of the freezer. Instant cold packs. These are filled with two different chemicals separated by plastic. When squeezed, the plastic breaks, causing the two chemicals to react and get cold. Unlike gel packs, these are portable and can be used anywhere as long as the chemicals haven't touched each other yet. This makes them ideal to have on hand for sporting events. They aren't reusable, however. Homemade ice bags . Take a large plastic bag and fill it with ice cubes. Then fill it with just enough water to cover the ice cubes. Squeeze out the air and seal the bag. These are good in a pinch if you don't have a store-bought ice pack. However, they don't last as long and the condensation on the outside of the bag can get you wet. Bags of frozen vegetables. Use bags of smaller vegetables, such as peas or corn, since they will be easier to wrap around the wounded area. Wrap the bag in a cloth before putting it against your skin. You can leave the compress on for up 20 minutes. Ice towels. This is another homemade method you can use. Wet a towel and then wring it out so that it's just damp. Place it in a plastic bag and then leave it in the freezer for 15 minutes. You can then wrap it around the injured area. This option also won't last very long so you'll have to keep putting it in the freezer to keep it cold."
    },
    {
      "title": "Elevate the injured body part.",
      "content": "Elevate the injured body part. This will help drain blood away from the area and fight swelling. Ideally, the body part should be lifted above the heart. So for example, if your wrist is injured, lie back on a couch and place your arm up on the high part."
    },
    {
      "title": "Wrap the compress in a towel.",
      "content": "Wrap the compress in a towel. This is important because if the compress directly touches the skin, it can lead to frostbite. Make sure that for the entire duration of the treatment, the compress remains separated from the skin by a towel."
    },
    {
      "title": "Apply the compress.",
      "content": "Apply the compress. Press it down to ensure that the entire affected area receives adequate icing. [7] X Research source If necessary, you can secure the ice pack with a non-stick bandage or wrap. Loosely wrap this around the ice pack and the injured area. Be sure not to tie this too tight, or you could cut off circulation. If the limb starts to turn blue/purple, the wrap is too tight and should be removed immediately. Keep in mind that a tingling sensation does not necessarily indicate the wrap is too tight — this sensation may be caused by the injury itself."
    },
    {
      "title": "Remove the compress after 15 or 20 minutes.",
      "content": "Remove the compress after 15 or 20 minutes. Don't leave it on any longer than this or you risk frostbite. Make certain that you don't fall asleep while wearing the compress, which could result in you keeping it on for several hours and damaging your skin. Either set an alarm or have someone alert you after 20 minutes. If you used a chemical cold pack, discard it after use. Check to see that your compress can be simply thrown away and does not contain materials that need to be disposed of in a specific way. If you used a gel pack or towel, place it back in the freezer to prepare it for your next round of treatment."
    },
    {
      "title": "Repeat the process in two hours.",
      "content": "Repeat the process in two hours. Make sure that the affected area is no longer numb. If so, wait until you regain feeling to reapply the compress. Continue alternating the treatment of 20 minutes on, two hours off, for three days or until swelling completely subsides. [8] X Research source"
    },
    {
      "title": "Visit the doctor if your symptoms don't improve.",
      "content": "Visit the doctor if your symptoms don't improve. If you've been treating your injury with ice for three days and there is still swelling and no reduction in pain, you may have a fracture or dislocation that wasn't recognized. Visit the doctor to see if you have a more serious injury than you initially expected."
    }
  ]
}