{
  "url": "https://www.wikihow.com/Connect-a-Replacement-Airpod",
  "title": "Simple Steps to Connect a Replacement AirPod",
  "steps": [
    {
      "title": "Place both AirPods in the charging case and charge for 15 minutes.",
      "content": "Place both AirPods in the charging case and charge for 15 minutes. The replacement AirPod and the original AirPod should both be in the case. Connect the charging case to a power source and let your AirPods charge together for about 15 minutes before you continue. [1] X Research source"
    },
    {
      "title": "Open your iPhone or iPad's Settings .",
      "content": "Open your iPhone or iPad's Settings . You'll find this gray gear icon on the Home screen and/or in your App Library."
    },
    {
      "title": "Tap Bluetooth.",
      "content": "Tap Bluetooth . It's in the first group of settings. [2] X Research source"
    },
    {
      "title": "Tap the small \"i\" in a circle next to your AirPods.",
      "content": "Tap the small \"i\" in a circle next to your AirPods. You'll see it under \"My Devices.\" [3] X Research source"
    },
    {
      "title": "Tap Forget This Device.",
      "content": "Tap Forget This Device . A confirmation message will appear. [4] X Research source"
    },
    {
      "title": "Tap Forget Device.",
      "content": "Tap Forget Device . It's at the bottom of the screen. This tells your iPhone or iPad to forget your old AirPods. [5] X Research source"
    },
    {
      "title": "Open the lid of your AirPods charging case.",
      "content": "Open the lid of your AirPods charging case. After a few moments, the status light will flash amber. [6] X Research source"
    },
    {
      "title": "Press and hold the button on the back of the AirPods case.",
      "content": "Press and hold the button on the back of the AirPods case. You can release the button once the light starts flashing white. If the light never turns white, plug the charging case into a power source, close the lid, and press and hold the button on the case for a few seconds. When it starts flashing white, release the button, and open the lid."
    },
    {
      "title": "Go to the Home screen on your iPhone or iPad.",
      "content": "Go to the Home screen on your iPhone or iPad. As long as you are holding the case near your iPhone or iPad, you should see an animation asking you to connect your AirPods. [7] X Research source Bring your AirPods closer to the iPhone or iPad with the lid open if you don't see the prompt."
    },
    {
      "title": "Tap Connect.",
      "content": "Tap Connect . Your AirPods will now pair together with your iPhone or iPad. [8] X Research source"
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . Your replacement AirPod will now work with your existing AirPod. [9] X Research source"
    }
  ]
}