{
  "url": "https://www.wikihow.com/Conduct-a-Self-Analysis",
  "title": "How to Conduct a Self Analysis",
  "steps": [
    {
      "title": "Reflect on your childhood experiences.",
      "content": "Reflect on your childhood experiences. Understanding who you are and why you do the things that you do is not always easy. Much of what drives behavior and self-perception is the result of subconscious attitudes and beliefs. It’s important to dig deep in order to figure out how you truly see yourself on a subconscious level. Here are a few questions you may want to ask yourself: [1] X Research source As a child, did I feel listened to or was I harshly criticized? Was I spoken to respectfully or was I ignored, criticized, or teased? Did I get appropriate attention and affection or was I neglected? Was I physically, verbally, or sexually abused? Were my accomplishments recognized? Were my shortcomings and failures accepted or was I berated? Was I always expected to be perfect?"
    },
    {
      "title": "Keep track of your moods.",
      "content": "Keep track of your moods. Keep a journal with you for an entire day. Whenever you feel a shift in your mood, write down what you are feeling. This is the first step in identifying what your inner voice is communicating to you. [2] X Research source The inner voice is not actually a voice that you hear with your ears. Instead, it is the collection of thoughts that you experience. These thoughts are often so deeply embedded in the subconscious that you may not even recognize them when they occur. Instead you’ll probably just experience a change in mood. Your inner voice is either affirming or self-defeating. [3] X Research source People with healthy self-esteem usually experience an accepting and reassuring inner voice. However, people with low self-esteem generally experience a harsh, punitive, and critical inner voice. Journaling can be tough for some people, especially if you write about past traumas that you have not fully processed. If you find that journaling is upsetting you or causing you difficulty handling everyday life for the day or week after attempting to journal, talk with a counselor who can help you journal productively while keeping you healthy."
    },
    {
      "title": "Write down what you were thinking.",
      "content": "Write down what you were thinking. The thoughts that you were experiencing immediately before your mood shifted is a good reflection of your inner voice. They are called automatic thoughts and generally reflect how you see yourself, others, and the world. Writing down these thoughts throughout the day will help you see if a pattern emerges. [4] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source Automatic thoughts originate in the subconscious so sometimes they are difficult to pinpoint. You can start by asking yourself “What made me feel this way.” Then dig deeper by asking yourself probing questions like “What does that say about me?” “Why did that make me feel that way?” The first few answers are often superficial responses. Keep asking yourself “What else?” until you are able to probe into the deeper automatic thoughts. For example, if a co-worker said something that made you angry, you may initially write down “Andrea said that what I did was wrong.” “That made me angry.” “She tried to make me look like I was incompetent.” And after asking yourself several times “What else?” you may eventually pinpoint a thought that you didn’t realize was there, such as “I’m not as good at this as everyone else.”"
    },
    {
      "title": "Evaluate the thinking patterns.",
      "content": "Evaluate the thinking patterns. After you have written down several automatic thoughts, you’ll probably see a pattern begin to emerge. Ask yourself what the underlying theme is among your thoughts. Are they healthy and liberating or are they negative and self-defeating? Common thought patterns that tend to emerge from negative automatic thoughts include: All-or-none thinking occurs when a person thinks that one misstep makes his or her or the situation a failure. For example, if you make one error at work you may think that you're a failure at your job. Disqualifying the positive is when a person only focuses on what they have done wrong and ignores or forgets about all of the good that they have done. For example, a person may focus on getting one problem wrong on a test when they have correctly answered the rest of the questions. Jumping to conclusions is when a person makes a judgment without having all of the facts. For instance, if you see your best friend running in a direction away from you in a parking lot, you may assume that your friend is trying to avoid you. However, they may have been late for an appointment and not noticed you. Labeling happens when a person applies a label to themself (or someone else) rather than acknowledging the action or behavior. For example, instead of thinking, “I could have handled that differently” you may think, “I’m a bad person.”"
    },
    {
      "title": "Examine if you have healthy or low self-esteem.",
      "content": "Examine if you have healthy or low self-esteem. Healthy self-esteem reflects a person’s belief that they are worthy and worthwhile. Alternatively, a person with low self-esteem often feels poorly about themself and constantly needs other people’s approval. If you notice that you have a lot of negative thinking, then you may be dealing with low self-esteem. Low self-esteem has a negative impact on the way that you see yourself so it’s important to intentionally work on having a healthy and balanced view of who you are. If you’re still not sure it you’re experiencing low self-esteem, consider these three “faces” of negative self-esteem: [5] X Research source The Victim: This person acts like they are helpless and waits for others to come to the rescue. They tend to use self-pity or indifference to mask underlying fears of failure. They tend to be unassertive, may be an underachiever, and excessively relies on others for reassurance. The Imposter: This person acts as if they are happy and all is well when they're really petrified of failure. This person needs to always be successful in order to be happy, often leading to perfectionism, competition, and burnout. The Rebel: This person tries to downplay others, particularly people of authority. They live in constant anger about not being good enough and tends to focus on not being hurt by the criticism of others. This can lead to blaming other people for their own problems and they may frequently oppose authority."
    },
    {
      "title": "Take out a piece of paper and place it in front of you.",
      "content": "Take out a piece of paper and place it in front of you. The paper should be in the landscape position so that the longer edge is facing you. Make sure that a hard surface is available for you to easily write on."
    },
    {
      "title": "Draw five lines vertical across the paper.",
      "content": "Draw five lines vertical across the paper. Make sure that the lines are evenly spaced. You will be writing in the boxes that these lines create, so make sure that there is adequate space in between the lines."
    },
    {
      "title": "Write one of the following terms next to each vertical line:",
      "content": "Write one of the following terms next to each vertical line: “Extraversion,” “Neuroticism,” \"Conscientiousness,\" \"Agreeableness,\" and \"Openness to Experience.” These terms reflect “The Big Five” personality traits. Most researchers agree that these five personality traits reflect the general components of personality that are most important in interpersonal interactions. [6] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source Keep in mind that these “Big Five” traits are not personality types but dimensions of personality. For example, someone may be high in “Agreeableness” (friendliness) but low on “Extraversion” (sociability.) This person is probably not very social, but he or she is in fact quite friendly. The “Emotional Stability” dimension is also sometimes referred to as the “Neuroticism” trait. Neuroticism is on the other end of the Emotional Stability-Neuroticism spectrum. Similarly, Sometimes the “Openness to Experience” dimension is referred to as “Intellect.” The terms are interchangeable."
    },
    {
      "title": "Decide where you are on each of the five dimensions.",
      "content": "Decide where you are on each of the five dimensions. People generally fall in the high spectrum or the low spectrum of each personality dimension. Take a minute to think about where you fall in each area. Write “High” or “Low” in each corresponding box on your paper. Here are descriptions of each trait to guide you with your self-assessment: [7] X Research source Extroversion reflects a keen interest in other people and external events. Highly extroverted people tend to be very confident and have no problem exploring uncharted territories. People who are low in extroversion are often referred to as “introverts” and tend to prefer solace and quiet environments. Neuroticism reflects anxiety level. People who are high in this dimension tend to experience negative emotions stronger than their counterparts. If you find yourself worrying and freaking out a lot, then you may want to rate yourself as high in this area. Openness to Experience indicates a person’s willingness to adjust their thinking when new information arises. If you are high in this area then you are probably unconventional and “free spirited.” If you are low on this dimension, then you are probably more conventional and concrete with your thinking patterns. Conscientiousness refers to how much a person considers other people when making decisions. It also reflects one’s level of self-control. If you are high on this dimension then you are probably disciplined, well organized, and function well with autonomy. If you are low in this area then you are probably quicker to follow your impulses and do well in environments that are fluid and constantly changing. Agreeableness indicates the degree to which a person is compatible with other people. It also reflects how much a person cares about others. If you are high in this area then you are probably quite empathetic and can quickly and easily understand other people. You are probably often described as “nice” and “tender hearted.” If you are low in this area then you put less emphasis on emotions when determining how to behave. There is generally a gender difference on this trait with women generally being higher and men generally being lower."
    },
    {
      "title": "Think about how these five traits influence your personality.",
      "content": "Think about how these five traits influence your personality. People are likely to engage in behavior and select environments based upon what is comfortable for their personality. This self-assessment may give you a huge insight into why you behave the way that you do. People can be high or low in each dimension. However, 45 different personality combinations emerge when all of the different possible combinations are combined."
    },
    {
      "title": "Choose a convenient time.",
      "content": "Choose a convenient time. Be sure to set aside a time when you will have at least one hour for some self-reflection. During this time you’ll want to focus on your habits, goals, competencies, and general performance. An hour will also give you plenty of time to review personal notes and other information that will help you write an accurate self-evaluation of your performance."
    },
    {
      "title": "Write down all of the accomplishments that you’ve amassed in the workplace over the past year.",
      "content": "Write down all of the accomplishments that you’ve amassed in the workplace over the past year. Do not be shy about listing all of the great things that you have done. [8] X Research source In fact, it’s okay to be proud of yourself. The main goal of this kind of self-analysis is to highlight your accomplishments. Consider all of the projects that you’ve worked on, extra duties that you were assigned, and all the ways that you have brought value to your organization. Whenever possible, use specific examples during your self-assessment. Reviewing your emails is a good way to remember some of the things that you accomplished earlier in the year that you may otherwise forget to include. If there is a place where your work is documented on a regular basis, such as a log or computer data entry system, you may be able to jog your memory by reviewing that documentation. Ask yourself questions to help with your self-reflection. For example, you could ask “Did my efforts further the company’s mission?” or “In what ways did I take on leadership roles?”"
    },
    {
      "title": "Use the STAR approach if you're having a hard time pinpointing your accomplishments.",
      "content": "Use the STAR approach if you're having a hard time pinpointing your accomplishments. This method allows you to highlight a specific situation when you brought value to the company. This detailed approach can be used multiple times and before you know it, you will have a comprehensive list of accomplishments. Here is an outline of the STAR approach: [9] X Research source Identify the (S)ituation: Briefly describe a situation when you felt very proud of your job performance. Describe the (T)ask that was at hand regarding this situation. What is it that you had to do? Describe the (A)ction that you took in order to complete the task. Highlight the (R)esults that was achieved through your action."
    },
    {
      "title": "Write down the areas that you would like to improve on.",
      "content": "Write down the areas that you would like to improve on. It can be tempting to only focus on your accomplishments, but it is very important to be objective during your self-analysis. Consider areas where you could be a bit more effective or times when you did not meet your goal. By reflecting on your challenges too, you can get a more accurate reflection of your actual performance. Although you are using this opportunity to do some self-reflection, reviewing your supervisor’s feedback from recent performance evaluations could help you to get some honest feedback on your performance."
    },
    {
      "title": "Make a list of 5-6 goals that you would like to accomplish over the next year.",
      "content": "Make a list of 5-6 goals that you would like to accomplish over the next year. This part of your self-analysis is your action plan and should focus on things that you can do to enhance your work performance. Make sure that the goals clearly demonstrate your commitment to providing more value to the company. [10] X Research source"
    },
    {
      "title": "List any recent life changes.",
      "content": "List any recent life changes. Change can be good, like getting married, having a child, or getting a promotion at work. It can also be not so good; just ask anyone who has lost a job or is in the middle of a divorce proceeding. Keep in mind that change of any kind can be stressful as you get adjusted to your new life experience. [11] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Take a minute to think about and jot down all of the changes that you may have experienced in the last six months that may be causing stress."
    },
    {
      "title": "Think about your values.",
      "content": "Think about your values. When the way that you are living your life contradicts with what you believe and value, this can cause you to experience a significant amount of stress. [12] X Research source For example, if you highly value ambition and competitiveness but feel stuck in a boring dead-end job, you will likely experience stress because your values aren't lined up with your life right now. When your beliefs and value systems are mismatched to your actual life experience, stress and unhappiness can occur. [13] X Research source Here are some questions to ask yourself to determine if any mismatch is contributing to your stress levels: What values do you find very important? Kindness? Honesty? Success? Family time? Does your behavior conflict with these values? For instance, let’s say that you value family time. Do you find yourself spending enough time with your family or are you prevented from doing so by other things? Do your job, relationships, friendships, or other areas of your life conflict with these values? For instance, let’s consider the same example above. Is your job preventing you from spending time with your family?"
    },
    {
      "title": "Evaluate your surroundings.",
      "content": "Evaluate your surroundings. Where you live, work, and spend most of your time can be a significant factor regarding your stress level. If you are surrounded by crime, overcrowding, noise, pollution, litter, or other unpleasant elements in your surroundings, then it can result in increased stress levels. [14] X Research source Consider how much your environment is contributing to your stress."
    },
    {
      "title": "Reflect on your personal problems and social dynamics.",
      "content": "Reflect on your personal problems and social dynamics. Personal problems and social factors can have a huge influence on your level of stress. Here are some dynamics to consider when you are trying to evaluate how these aspects are affecting your level of stress: Finances: Do you have enough money to cover your basic needs such as housing, food, clothing, and transportation? Family: Are their issues with your spouse or children or are you a caregiver to an elderly family member? Health: How is your health and the health of your loved ones?"
    },
    {
      "title": "Track your sleeping.",
      "content": "Track your sleeping. Lack of sleep affects many areas of your life, which of course can increase your stress levels. Log how many hours you are sleeping each night. Although the amount of sleep that is needed varies per person, if you are an adult getting less than 6-8 hours of sleep per night, then other areas of your life are likely being impacted. As a result, your stress levels may be higher than they would otherwise be. Here are some of the areas that lack of sleep may impact: Thinking and learning slows down Accidents increase Health challenges, including elevated risk of diabetes and increased risk of death Increased depression and forgetfulness Lower libido Premature aging and weight gain Impaired judgment"
    },
    {
      "title": "Consider how you can work on decreasing your stress level in these areas.",
      "content": "Consider how you can work on decreasing your stress level in these areas. Make a list of things that you can do to improve your overall life experience. After all, the goal of a self-analysis is to do use reflection to promote growth."
    },
    {
      "title": "Consult a counselor or therapist.",
      "content": "Consult a counselor or therapist. Some people believe that therapy is only for when you have problems that seem insurmountable. However, that's far from the truth. [15] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source A counselor or therapist can help you with your self-analysis because she is a trained, impartial person who understands the common thought traps that humans can fall into. People go to therapy for a variety of reasons, from past traumas to wanting to learn to cope with everyday life. There is no \"bad\" reason to seek counseling, and it's a sign of strength and self-care to seek help when you could benefit from it. [16] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source A therapist also provides a safe, welcoming space for you to explore your own thoughts and feelings in. She will not judge you or make you feel silly for having thoughts. This type of environment can be very productive for self-discovery."
    },
    {
      "title": "Look for an expert in cognitive behavioral therapy (CBT).",
      "content": "Look for an expert in cognitive behavioral therapy (CBT). CBT is a type of psychotherapy focused on the relationship between your thoughts, feelings, and behaviors. For example, if you've identified that you have self-esteem issues, a therapist trained in CBT can help you identify the unhelpful thought patterns that are contributing to that problem, such as negative self-talk. A CBT professional can help you learn new ways of thinking and behaving that will help you lead a happier, healthier life. [17] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source CBT has been demonstrated as a helpful treatment for a range of conditions, including anxiety, depression, and sleep disorders. Even people with chronic pain may be helped by CBT."
    },
    {
      "title": "Search for a trauma specialist if you have had past traumas.",
      "content": "Search for a trauma specialist if you have had past traumas. If during your self-analysis you realize that you have had traumatic experiences that you need to deal with, a therapist who specializes in trauma can help. It can take time and effort to process past injuries and work through them, but a trained specialist can help you through the process. CBT is a very common treatment for people with post-traumatic stress disorder (PTSD). Other types of treatment include exposure therapy, where you learn to overcome the trauma by talking about it repeatedly, and eye movement desensitization and reprocessing (EMDR) therapy, where you focus on bodily stimuli as you think or talk about your traumatic memories. [18] X Research source"
    },
    {
      "title": "Find someone you feel comfortable with.",
      "content": "Find someone you feel comfortable with. There are many ways to find a therapist. You can search online, ask your doctor or friends for a referral, or cold-call various providers or clinics. The key to successful therapy is realizing that it is a relationship, and you should feel comfortable with your provider. That isn't to say you will always feel comfortable with what you discuss, but you should feel like your therapist is there to support you. If after several sessions you just aren't \"clicking\" with your therapist, it's okay to try another one."
    },
    {
      "title": "Distinguish between types of mental health professionals.",
      "content": "Distinguish between types of mental health professionals. Psychiatrists and psychologists aren't the only providers who can offer mental health services, including therapy. There are a range of mental health professionals who can help you, so consider your options. Below are some types of mental health professionals: [19] X Research source Psychiatrists are medical doctors. They can diagnose conditions, prescribe medication, and offer therapy. Because of their specialized and extensive training, they are often rather expensive to see, but they are excellent for people who may have more severe disorders. Psychologists have doctorate degrees in Psychology, such as Ph.D. or Psy.D. In some states, they can prescribe medication, but most cannot. They can diagnose conditions and offer therapy. Licensed clinical social workers (LCSWs) have a master's degree in Social Work and have had extensive clinical experience to earn their license. They can offer therapy and a variety of other services that connect you with community resources. Psychiatric nurses are registered nurses (R.N.s) with specialized training in psychiatry and therapy. They can usually prescribe medications and can offer therapy. Marriage and Family therapists (MFTs) have a master's degree in marriage and family therapy. They have training and clinical experience in offering therapy, but cannot prescribe medications. Licensed Professional Counselors (LPCs) have a master's degree in a professional counseling field. They have training and clinical experience in offering therapy, but cannot prescribe medications. LPCs tend to have a wide range of counseling areas, such as career counseling, in addition to mental health counseling."
    }
  ]
}