{
  "url": "https://www.wikihow.com/Be-Sweet",
  "title": "How to Be Sweet",
  "steps": [
    {
      "title": "Be thoughtful towards others.",
      "content": "Be thoughtful towards others. Part of being sweet means that you are thoughtful towards other people. You can achieve this by showing interest in other people's lives, or by doing nice things for them. For example: Instead of talking about yourself, you can ask your friend about his day. This will show your friend that you are interested in his well-being. If your friend reveals that he is having a bad day, you can show how sweet you are by buying him some ice cream. It is your friend's birthday. Unfortunately, it falls right during Finals week and ends up being forgotten by everyone else as they scramble to complete assignments and catch up on last-minute studying. You can surprise your friend by bringing her a cupcake or a balloon to school."
    },
    {
      "title": "Be caring towards others.",
      "content": "Be caring towards others. Part of being sweet is also being caring, which can be achieved through showing concern for other people. For example, if you notice someone looking upset, ask him or her what is wrong and if there is something you can do to help. This will show him or her that you care, even if he or she does not want any help."
    },
    {
      "title": "Always be polite.",
      "content": "Always be polite. Part of being sweet means that you are polite and have good manners, even towards those you dislike. This means that you say things like \"please,\" and \"thank you,\" and \"excuse me\" or \"pardon me.\" For example: If someone compliments you, smile and say \"thank you!\" If you are eating in a cafeteria, and the salt shaker is too far away, do not reach across someone's face to grab it. Instead, ask: \"Could you pass the salt, please?\" If you are in a hurry and need to get through a crowd quickly, try not to shove your way through. Instead, say \"pardon me\" or excuse me\" and try to weave your way past people instead."
    },
    {
      "title": "Be generous and giving.",
      "content": "Be generous and giving. This does not mean that you have to donate all your clothes to charity and give in to everyone's demands. You want to be generous to a certain extent, but not so much that people begin to take advantage of you. For example: Your friend forgot to bring her lunch to school, and she has no money to buy something from the cafeteria. You can offer part of your lunch to your friend, or lend her some money so that she can buy something to eat from the cafeteria. If the boy sitting next to you forgot to bring a pen or pencil to class, offer him one of yours. If you suspect someone taking advantage of your generosity, it is okay to confront him or her about it, so long as you do it in a gentle, non-accusatory manner. For example, if your friend asks you for lunch money every day, you can try saying: \"Alright, I will help you one last time, but I really cannot afford helping you every day. What about bringing your own lunch from home tomorrow?\""
    },
    {
      "title": "Consider complimenting others.",
      "content": "Consider complimenting others. Not only will complimenting others help boost their self-esteem and make them feel better, but it will also make you appear kind and sweet. For example: If your friend got a new haircut, tell her how cute it looks. She may be feeling self-conscious or uncertain about the change. Your compliment might just give her that much-needed boost of confidence. The boy sitting next to you in class draws almost the time. Instead of just telling him that he draws really well, mention a particular detail, such as hair or eyes. You could say something like: \"Wow, you are really good at drawing! I really like how you did the eyes!\" Do not be over-generous with the compliments however; you might come off as creepy, annoying, or fake. You want your compliments to be genuine (or at least appear that way)."
    },
    {
      "title": "Be helpful towards others.",
      "content": "Be helpful towards others. Sweet people are the ones who are the first to offer help, even if it is not wanted. There are many ways you can help others, and some of those ways are small and almost effortless, such as opening doors. You can show your sweetness by offering help in many situations, such as: A girl has just dropped all of her books. Instead of walking past or laughing at (which a sweet person would never do), go over to her and help her pick the books up. A boy is helping set up for the school charity and has taken on more than he can handle—literally. He is carrying way too much, and all of the boxes are falling out of his arms. Go over to him and offer to help him carry some of the boxes. An elderly man in a wheelchair is about to leave a cafe, but the door is closed. You can show just how sweet you are by holding the door open for him. Don't forget to smile, and say \"You're welcome!\" if he thanks you."
    },
    {
      "title": "Use a softer voice.",
      "content": "Use a softer voice. Sweetness is associated with softness and gentleness, so try to use a softer voice when speaking. This does not mean you must talk at a whisper or use a high-pitched voice. Just soften your voice to a low and gentle level. This will help you sound kinder."
    },
    {
      "title": "Do not swear or curse.",
      "content": "Do not swear or curse. Part of being sweet involves developing good manners, which in turn, involves avoiding bad ones, such as swearing. If you get angry or upset (or stub your toe) bite your tongue and try not to swear or curse. If you really must swear, stay away from any expletives, and say things such as \"drat\" or \"darn\" instead."
    },
    {
      "title": "Do not insult, gossip, or bully.",
      "content": "Do not insult, gossip, or bully. Sweet people are nice people, and nice people generally like everyone—or at least act as though they like everyone. Try to refrain from insulting others or gossiping about them, and never bully anyone. Not only is this negative behavior, but it will show others that you are capable of thinking not-so-nice things about others. This, in turn, may cause those listening to you to wonder what you might think of them. Wondering how you can seem more innocent? Get tips from fellow wikiHow readers on the wikiHow forum post, \"This quiz says I'm innocent.\""
    },
    {
      "title": "Do not react to bullying or swearing.",
      "content": "Do not react to bullying or swearing. Instead, either ignore the bully or pretend that you did not hear the insulting or swearing. Bullies want attention, and you will be giving them just that by reacting to them."
    },
    {
      "title": "Do not slouch, cross your arms, or put your hands in your pockets.",
      "content": "Do not slouch, cross your arms, or put your hands in your pockets. Part of being sweet and kind is being approachable. You can achieve this through maintaining proper posture—this means that your back is straight, your head is held high, and your shoulders are thrown back slightly (but not to the extent of discomfort). Slouching, crossing your arms, and sticking your hands in your pockets will make you appear disinterested, anti-social, or upset, none of which are considered very sweet."
    },
    {
      "title": "Do not partake in drugs or destructive behavior.",
      "content": "Do not partake in drugs or destructive behavior. Not only are drugs harmful to your body, but vandalism can get you in trouble with authority. Sweet people are well-behaved people, and thus tend not to get into trouble. Refrain from vandalizing and destroying property (be it private or public), and try not to do drugs. Some drugs, such as hallucinogens, can lead you to partake in destructive behavior, [1] X Research source while other drugs can deteriorate or permanently damage your health. [2] X Trustworthy Source National Institute on Drug Abuse Leading U.S government agency supporting scientific research on drug use and its consequences. Go to source"
    },
    {
      "title": "Consider altering your look.",
      "content": "Consider altering your look. Anyone can be sweet, regardless of how they look or what they wear, but certain styles and images tend to be associated with specific personality types. The change can be as simple as a gentle smile to as complex as a complete makeover, including a new hairstyle, new makeup, and a new outfit."
    },
    {
      "title": "Dress simply and modestly.",
      "content": "Dress simply and modestly. Sweetness is associated with youthfulness, so refrain from wearing anything too revealing or \"sexy.\" Opt instead for simple or modest outfits. If you are a girl, consider wearing: a shirt with a sweetheart neckline and a knee-length skirt, a peasant blouse and some jeans, or a summery dress. Refrain from wearing anything that reveals too much cleavage or exposes your belly button. You can still look feminine, but be sure your outfit is also modest. If you are a boy, consider wearing: slacks and button up shirts, neutral colors, or a simple T-shirt and jeans. Refrain from wearing anything with inappropriate designs or slogans, muscle shirts, or several sizes too large. You want a proper and modest image."
    },
    {
      "title": "Refrain from studs and spikes.",
      "content": "Refrain from studs and spikes. Anyone can be sweet, regardless of how they dress, but certain shapes are associated with harshness. Wearing lots of spikes and studs might make you appear tough and intimidating, which in turn might make you appear unapproachable. Sweet people generally have a softer appearance, and are easy to approach."
    },
    {
      "title": "Consider wearing light-colored outfits.",
      "content": "Consider wearing light-colored outfits. Light colors, such as pastels, pink, lilac, baby blue, and whites, are often associated with softness, purity, innocence and gentleness. Wearing these colors might help others perceive you as having these qualities."
    },
    {
      "title": "Wear little makeup, if any.",
      "content": "Wear little makeup , if any. Sweetness is associated with youthfulness, which can be achieved through wearing little to no makeup. Consider wearing light eyeshadow, some mascara, and light-colored lipstick or lip gloss. You want your makeup to look simple and innocent, so stay away from dark or glamorous styles, such as smoky eyeshadow and dark red lipstick. Consider wearing makeup that make your eyes appear larger, to lend that doe-eyed look often associated with youthfulness and innocence."
    },
    {
      "title": "Maintain good hygiene.",
      "content": "Maintain good hygiene. Sweet people are often youthful, and youth is associated with good health. You can appear more healthy by taking good care of yourself. This means bathing every day, washing your face and brushing your teeth daily, and combing your hair. If you sweat or have a strong body odor, you may want to consider a deodorant."
    },
    {
      "title": "Maintain a neat appearance.",
      "content": "Maintain a neat appearance. Staying neat will show others that you take care of yourself, which in turn gives others a more positive impression of you. You can make yourself appear tidy and neat by taking care of yourself and your clothes and belongings. This means you comb your hair, mend any rips or tears on your clothes, and wash your clothes if they get dirty. It also means that you take care of your belongings by keeping them clean and not letting them get ruined. For example: You can protect your textbooks by covering them with paper, and storing them carefully so that the corners do not get bent. You can keep your pencils looking neat by not chewing on them, and by sharpening them if they get dull."
    },
    {
      "title": "Smile often.",
      "content": "Smile often. A smile will not only help you appear kinder, but it will also make you appear happier and thus more approachable."
    }
  ]
}