{
  "url": "https://www.wikihow.com/Convince-Your-Mom-to-Let-You-Have-a-Sleepover",
  "title": "How to Convince Your Mom to Let You Have a Sleepover",
  "steps": [
    {
      "title": "Write out a list of reasons why you want to have a sleepover.",
      "content": "Write out a list of reasons why you want to have a sleepover. Think about why you want to have a sleepover and write down a few reasons on a piece of paper. Write down that you want to strengthen your friendships and have a fun time with your friends in a safe environment. Consider what skills you’ll learn from a sleepover, like how to become independent and deal with other people’s differences in a controlled environment. Your mom probably had sleepovers when she was your age, so a reason like, “It’s a rite of passage when you’re young!” is perfectly reasonable. Possible reasons include strengthening friendships, getting new experiences, and learning how to host friends in your home."
    },
    {
      "title": "Ask your friends if they want to have a sleepover and create a guest list.",
      "content": "Ask your friends if they want to have a sleepover and create a guest list. When you tell your mom that you want to have a sleepover, their first question is going to be, “With who?” Ask a few close friends if they want to have a sleepover ahead of time, and write down the names of any friends that say yes. Try to keep the guest list between 2-4 friends for your first sleepover. [1] X Research source"
    },
    {
      "title": "Get your friends to give you their parents’ phone numbers.",
      "content": "Get your friends to give you their parents’ phone numbers. Even if your mom is already friendly with your friends’ parents, try to get their contact information ahead of time. Your mother will have to coordinate pickup and drop-off times for the sleepover with your friends’ parents, and having their phone numbers readily available will make this process easier. [2] X Research source Even if you know your mom already has the phone numbers of the other parents, get them anyway. This will show her that you’re serious about having a sleepover and will demonstrate that you’re mature enough to host one."
    },
    {
      "title": "Come up with plans for the sleepover.",
      "content": "Come up with plans for the sleepover. Where will everyone sleep? What time will you be going to bed? Are there any games that you’re going to play with your friends when they sleep over? While your mom may set limitations on a lot of these questions, write out a few initial ideas to show her that you’re capable of organizing it yourself. [3] X Research source To avoid people fighting about who gets a bed, say, “We can have everybody sleep on the floor in sleeping bags!” Sardines , hide and seek , board games, and card games are all excellent activities for a sleepover."
    },
    {
      "title": "Practice your presentation",
      "content": "Practice your presentation in your room before asking her. Once you’ve got a few reasons that you want to host a sleepover, a guest list, and some plans for the night, practice presenting the information out loud. Walk through each part of your proposal by saying it out loud in your room. Practice in the mirror to see how you look when you’re presenting. [4] X Research source If you get scared when talking to your mother about something you want, try to memorize the first couple of sentences. Start with something like, “I would like to talk to you about having a sleepover. I think that I’m old enough to handle having a few friends over, and this is my idea. I would like to invite Lisa and Sarah and their parents said it was okay. We will go to bed at a reasonable time and will sleep in the living room together.”"
    },
    {
      "title": "Talk to your mother when she’s in a good mood and not busy.",
      "content": "Talk to your mother when she’s in a good mood and not busy. Don’t bring up your idea first thing in the morning or as soon as your mom get home from work. This will make her less likely to hear you out, since she won’t be ready to talk. Instead, find a calm time during the day to bring up the subject. Politely ask her if she has some time to talk to you before stating your case. Approach your mother and say, “Hey mom! Do you have a few minutes to talk about having a sleepover? I really want to have one here and I have a few ideas.”"
    },
    {
      "title": "Ask your mom about sleepovers that she had growing up.",
      "content": "Ask your mom about sleepovers that she had growing up. Your mom probably had sleepovers when she was your age. If you can get her to think back to her childhood, she may be more likely to give you what you want. Ask her questions about what she did at sleepovers when she was your age, and if she has any experience hosting sleepovers when she was a kid. [5] X Research source"
    },
    {
      "title": "Share your ideas in a calm manner and keep your voice down.",
      "content": "Share your ideas in a calm manner and keep your voice down. Use your indoor voice and take a breath between each sentence to collect your thoughts. Staying calm while you’re presenting will show your mother that you’ve thought through your ideas and care deeply about having a sleepover. If your mom is initially against it, don’t worry. If you can show her that you’re capable of having an adult conversation, she may change her mind. [6] X Research source"
    },
    {
      "title": "Keep cool if you don’t get your way.",
      "content": "Keep cool if you don’t get your way. Don’t throw a temper tantrum if the conversation doesn’t go exactly the way you want it to. If your mother initially says no, wait a couple of days and then try asking her again. She may change their mind over the course of a few days, and asking her again may show them that you’re serious. [7] X Research source If you lose your cool, you’re only going to reinforce your mother’s belief that you aren’t old enough to have a sleepover. If you feel yourself getting really angry, slow your breathing down and count from 1-10 in your head to reset yourself."
    },
    {
      "title": "Show gratitude and be willing to compromise.",
      "content": "Show gratitude and be willing to compromise. Even if you didn’t get what you want, thank your mom for hearing you out. If your mother wants to negotiate, be open to modifying your plans. A sleepover at your house will impact your parent too, since they’ll have to prepare their home, coordinate with other parents, and monitor you and your friends, so be willing to accept that they may change your plans. [8] X Research source Say, “Thank you for taking the time to listen to me” at the end of your presentation."
    },
    {
      "title": "Ask your mom if you can have a sleepover at a friend’s house.",
      "content": "Ask your mom if you can have a sleepover at a friend’s house. If your mother isn’t comfortable hosting a sleepover at your house, see if she’d be alright with you attending a sleepover somewhere else. If the problem is that she doesn’t want to supervise you and your friends, she may have no problem with another parent watching over you. [9] X Research source When she turns down the possibility of a sleepover at your place, you can immediately say, “What if my friends and I have a sleepover at Danny’s house? His parents already said that it was okay!”"
    },
    {
      "title": "Consider a “half-over” where your friends don’t stay the night.",
      "content": "Consider a “half-over” where your friends don’t stay the night. If your mom doesn’t want your friends to spend the night, ask her if you can have a half-over. Invite your friends over, dress up in your pajamas, and play all the games that you planned on playing during your sleepover. Arrange it so that your friends get picked up around 9:00 or 10:00 pm instead of spending the night. This may be a good middle ground if your parents have plans the next day or you don’t have the space to accommodate a lot of your friends. [10] X Research source"
    },
    {
      "title": "See if you can go camping in the backyard instead.",
      "content": "See if you can go camping in the backyard instead. If your mother really cares about her personal space, see if she’ll let you and your friends camp in the backyard. Set up a tent out back and have your friends bring sleeping bags. You can play games in the tent and hang out in your backyard throughout the night. [11] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source If you have a fire pit in your backyard, you can ask your mom to help you set up a fire so that you and your friends can roast hot dogs and make smores ."
    },
    {
      "title": "Ask your parents about overnight programs at the local zoo or library.",
      "content": "Ask your parents about overnight programs at the local zoo or library. Zoos, libraries, and schools often host overnight sleepover camps for young people in their area. If your mother is totally opposed to sleepovers, she may be open to you and your friends attending an educational program in a sleepover setting. Overnight programs can be fun because they give you plenty to do in an environment where you don’t normally get to spend the night! [12] X Research source Say, “What if my friends and I attend an educational program? Do you know of any at the zoo or library?”"
    }
  ]
}