{
  "url": "https://www.wikihow.com/Catch-Celebi-in-Pok%C3%A9mon-Emerald",
  "title": "How to Catch Celebi in Pokémon Emerald",
  "steps": [
    {
      "title": "Take a Japanese GameCube, a copy of the Japanese Pokémon Colosseum Bonus Disk, your Game Boy Advance and a Game Boy Advance to GameCube Link Cable.",
      "content": "Take a Japanese GameCube, a copy of the Japanese Pokémon Colosseum Bonus Disk, your Game Boy Advance and a Game Boy Advance to GameCube Link Cable."
    },
    {
      "title": "Trade the Celebi.",
      "content": "Trade the Celebi. Transfer the Celebi (Nicknamed Ageto, translating to Agate) from the Japanese Pokémon Colosseum Bonus Disk over to your Game Boy Advance, and have fun with your new special Event Pokémon!"
    },
    {
      "title": "Go online.",
      "content": "Go online. Search websites such as eBay.com and Gumtree for a used copy of Pokémon Emerald."
    },
    {
      "title": "Check the item's description.",
      "content": "Check the item's description. Check to see if the save file on the copy has collected the special Event Pokémon Celebi, and has it in either their box or in their party ready to trade."
    },
    {
      "title": "Purchase the game.",
      "content": "Purchase the game. Purchase the used copy of the game and wait for it to arrive. From there, you can either choose to trade the Celebi within the bought copy over to your own personal copy of the game or continue to play on the other instead."
    },
    {
      "title": "Collect a Gameshark or Action Replay.",
      "content": "Collect a Gameshark or Action Replay. Purchase a Gameshark or Action Replay cheating device to perform this method (can be purchased at most video game stores and major department stores.)"
    },
    {
      "title": "Enter the codes into the device.",
      "content": "Enter the codes into the device. After obtaining either of these cheating devices, and loading the games data onto the device ready to enter codes into, search online for \"Event Pokemon Cheat Codes Pokemon Emerald\" and click on a reliable source to find a code that you can enter into your device."
    },
    {
      "title": "Obtain Celebi.",
      "content": "Obtain Celebi. Entering the codes will enable a method (dependent on the code that you enter) of which you can obtain Celebi in an illegitimate form, for example you can catch Celebi in the wild (even though Celebi is an Event Pokémon, and cannot be fought in the wild)."
    }
  ]
}