{
  "url": "https://www.wikihow.com/Annual-Profections",
  "title": "A Beginner’s Guide to Annual Profections",
  "steps": [
    {
      "title": "Annual profections are used to identify themes and focal points for the years ahead.",
      "content": "Annual profections are used to identify themes and focal points for the years ahead. Annual profections use a circular chart (similar to your birth chart) divided into 12 equal sections, with each sector signifying a certain astrological house and ruling planet (also known as a Time Lord). By applying your birth chart info to your profection wheel, you can get a better idea of the major themes that’ll define your upcoming year. [1] X Research source An astrological house is a segment of the sky that rules over a specific aspect of your life (like relationships, money, your sense of self, etc.). There are 12 total houses—together, they make up a giant circle, like what you see in an annual profections wheel. [2] X Research source A Time Lord is the planet that is “activated” during a specific year, according to your profections wheel. This planet corresponds to whichever zodiac sign is attached to each “slice” of your profection year chart. In the world of profections, a year starts and ends with your birthday."
    },
    {
      "title": "An annual profections wheel applies to your entire life.",
      "content": "An annual profections wheel applies to your entire life. Each “slice” of the wheel corresponds to a single year of your life as you make your way through the 12 signs. Your chart starts at age 0-1 (the first year of your life); on your next birthday, it segues to the next segment on the wheel (which represents year 1-2). Each year of your life corresponds to the next slice on the wheel as you go around the circle in a 12-year cycle. The specific house and Time Lord order for your wheel ultimately depends on the specific details from your birth chart. Don’t worry, though—it’s super easy to calculate your annual profections wheel on your own."
    },
    {
      "title": "Draw or download a basic annual profections wheel.",
      "content": "Draw or download a basic annual profections wheel. A profection year chart (or profections wheel) is a large circle that’s divided in 12 equal slices and filled with 9 concentric circles (each slice of the circle has 9 total segments). On the innermost circle, label the segment at the 9-o-clock position as “1st” or “Asc” (short for Ascendant). Working in a counterclockwise direction, label the other 11 innermost segments as 2nd, 3rd, 4th, 5th, and so on—these will represent the 12 astrological houses of your birth chart. Don’t feel like making your own wheel? Download a free chart here . Make these innermost segments a little bit bigger than other 8 rows in each slice, since they serve as labels for all the other segments."
    },
    {
      "title": "Fill in the rest of the chart segments with numbers to represent each year of your life.",
      "content": "Fill in the rest of the chart segments with numbers to represent each year of your life. Write 0 in the segment beneath the “1st/Asc” category. Then, working counterclockwise, write 1 beneath the “2nd” category, 2 beneath the “3rd” category, 3 beneath the “4th” category, and so on, ending with 11 beneath the “12th” category. Continue filling in the chart with ascending numbers as follows: 1st: 0, 12, 24, 36, 48, 60, 72, 84 2nd : 1, 13, 25, 37, 49, 61, 73, 85 3rd : 2, 14, 26, 38, 50, 62, 74, 86 4th : 3, 15, 27, 39, 51, 63, 75, 87 5th : 4, 16, 28, 40, 52, 64, 76, 88 6th : 5, 17, 29, 41, 53, 65, 77, 89 7th : 6, 18, 30, 42, 54, 66, 78, 90 8th : 7, 19, 31, 43, 55, 67, 79, 91 9th : 8, 20, 32, 44, 56, 68, 80, 92 10th : 9, 21, 33, 45, 57, 69, 81, 93 11th : 10, 22, 34, 46, 58, 70, 82, 94 12th : 11, 23, 35, 47, 59, 71, 83, 95"
    },
    {
      "title": "Calculate your Rising sign and birth chart.",
      "content": "Calculate your Rising sign and birth chart. Click here to get a free birth chart and general run-down of your astrological profile. This includes your Rising sign (or Ascendant), which represents the 1st house on your birth chart. To find out your Rising sign and other birth chart info, make sure that you know your time of birth , date of birth, and place of birth. Your birth chart resembles a large circle with angled lines and different astrological symbols spread across the surface."
    },
    {
      "title": "Mark down your Rising sign in the 1st/Asc sector.",
      "content": "Mark down your Rising sign in the 1st/Asc sector. Let’s say that your Rising sign is Gemini—you’d either write the word “Gemini” beneath the 1st house slice on your profections wheel, or you could jot down Gemini’s astrological symbol (♊︎)."
    },
    {
      "title": "Calculate the Time Lord of your Rising sign and mark it down.",
      "content": "Calculate the Time Lord of your Rising sign and mark it down. Every sign in the zodiac is ruled by a specific planet (also known as a Time Lord). This Time Lord “activates” whenever you enter a specific profection year—this means that a particular planet’s full potential will be accessible for a single year. [3] X Research source According to the annual profections technique, all of the other signs are “dormant” and represent a person’s potential while just one is activated. Let’s say your Rising sign is Gemini—Gemini’s ruling planet is Mercury, so your Time Lord for the 1st house would be Mercury."
    },
    {
      "title": "Write the sign that follows your Rising sign in the next slice down.",
      "content": "Write the sign that follows your Rising sign in the next slice down. Going in a counterclockwise direction, work your way to the next slice. Your 2nd house falls under the sign that directly follows your Ascendant—in other words, just follow the traditional monthly order of the signs, starting with your Rising sign. So, if your Rising sign/1st house is ruled by Gemini, your 2nd house would be ruled by Cancer. If your 1st house is ruled by Scorpio, your 2nd house would be ruled by Sagittarius. If your 1st house is ruled by Aries, your 2nd house would be ruled by Taurus."
    },
    {
      "title": "Mark each consecutive sign (and ruling planet) on the other 10 sectors.",
      "content": "Mark each consecutive sign (and ruling planet) on the other 10 sectors. Continuing in a counterclockwise direction, write down each sign and its respective Time Lord by each slice. The sign that rules your 12th house should be the sign that’s directly before your Ascendant/1st house. If your 1st house is in Cancer, your 12th house should be in Gemini."
    },
    {
      "title": "Mark down the planetary placements from your birth chart onto your profection wheel.",
      "content": "Mark down the planetary placements from your birth chart onto your profection wheel. Take a look at the birth chart you calculated earlier. Do you see all those symbols on your chart? Many of them represent planets, and signify where the different planets were at the exact moment of your birth. Note exactly where each planet falls your profection wheel—this helps you make a more in-depth analysis later on. ☉: Sun ☽ or ☾: Moon ☿: Mercury ♀: Venus ♂: Mars ♃: Jupiter ♄: Saturn ♅: Uranus ♆: Neptune ♇: Pluto"
    },
    {
      "title": "Find your current profection year on your chart.",
      "content": "Find your current profection year on your chart. This is super easy—just take your current age and find it on the chart. Note which house it falls under, as well as the sign attached to that house. If your 1st house is ruled by Aquarius and you’re currently 23, your current profection year would fall under 12th house (with Capricorn)."
    },
    {
      "title": "Find where your Time Lord sits on your birth chart.",
      "content": "Find where your Time Lord sits on your birth chart. Now that you know the house and sign that your current profection year falls under, it’s time to calculate the Time Lord of that sign. Here’s a cheat sheet to help you out: Mars: Aries and Scorpio Venus: Taurus and Libra Mercury: Gemini and Virgo The Moon: Cancer The Sun: Leo Jupiter: Sagittarius and Pisces Saturn: Capricorn and Aquarius"
    },
    {
      "title": "Analyze the themes of your Time Lord and house.",
      "content": "Analyze the themes of your Time Lord and house. Each Time Lord represents a certain set of themes and concepts, as does each of the 12 houses. Take a closer look at these themes to see what’s in store for you in the coming years. Let’s say that you’re 28 with Virgo in your 5th house. Virgo’s Time Lord is Mercury, which represents themes like technology and communication, while the 5th house represents themes of creativity, fun, romance, and self-expression. This combination might foreshadow you starting a YouTube channel for your favorite hobby, or sparking a casual online hook-up."
    },
    {
      "title": "Take a closer look at your Time Lord’s alignment with other planets on your birth chart.",
      "content": "Take a closer look at your Time Lord’s alignment with other planets on your birth chart. Do any planets show up in your current profection year? Analyzing how your Time Lord interacts with other planets from your birth chart can shine a lot of light on the year come. You can also take a closer look at where your Time Lord planet shows up on your birth chart. Let’s use Lisa Presley’s birth chart and profection wheel as an example. When she was 25 (a 2nd house year), her Time Lord was Mercury (since her 2nd house was ruled by Virgo). At her birth, Jupiter (a planet that symbolizes growth and prosperity) was in her 2nd house (which represents personal finance). As it happened, she received her father’s 100 million dollar estate/inheritance on her 25th birthday. [4] X Research source"
    },
    {
      "title": "Look for any planetary transits that intersect with your current Time Lord.",
      "content": "Look for any planetary transits that intersect with your current Time Lord. Planetary transits refer to how current planetary movements in the sky relate to your birth chart (the way the sky was at the moment of your birth). [5] X Research source Check out an online astrology calendar to see what the planets are up to and how they angle up with the planets in your birth chart. This aspect of astrology can get a little confusing, especially if you’re still learning the ropes. It may help to meet with a professional astrologer who can walk you through what different transits mean for your profection chart."
    },
    {
      "title": "Mars",
      "content": "Mars Astrologically speaking, Mars revolves around concepts like energy , movement, and desire. This planet is all about being on the move and charging into action based on raw urges and instincts. [6] X Research source If your Time Lord is Mars, your upcoming year might center around themes of passion (like getting physically intimate with a partner) and/or taking action in some way. Rules: Aries and Scorpio"
    },
    {
      "title": "Venus",
      "content": "Venus In the world of astrology, the planet Venus revolves around themes like love, romance, relationships, beauty, imagination, and sentiment, as well as finances. Venus is all about following your heart rather than your head, and knowing what you like the most. [7] X Research source If your Time Lord is Venus, your upcoming year might center around themes related to your relationships, finances, or the things you generally enjoy in life. Rules: Taurus and Libra"
    },
    {
      "title": "Mercury",
      "content": "Mercury The planet Mercury centers around communication , curiosity, and the ways that a person can express themselves. This planet also relates to concepts like information and interpretation (the way we process information). [8] X Research source If your Time Lord is Mercury, your upcoming year might revolve around themes like communication, technology, and processing information. Rules: Gemini and Virgo"
    },
    {
      "title": "Moon",
      "content": "Moon In the realm of astrology, the Moon revolves around what lies beneath the surface —we’re talking feelings, needs, and reactions. With the help of the Moon, you can better understand how you respond to tough situations, and discover how you feel the most secure. [9] X Research source If your Time Lord is the Moon, your upcoming year may focus on themes like emotions, family, and security. Rules: Cancer"
    },
    {
      "title": "Sun",
      "content": "Sun Just as the physical Sun sits in the center of the solar system, the astrological Sun revolves around a person’s core identity and the way they view themselves. [10] X Research source If your Time Lord is the Sun, your upcoming year may focus on themes like identity, confidence, and the way you both view and express yourself. Rules: Leo"
    },
    {
      "title": "Jupiter",
      "content": "Jupiter Jupiter revolves around concepts like luck, prosperity, and growth . Through Jupiter, people can better understand how they embody the spirit of giving, and how they can become more knowledgable and wise as they journey through life. [11] X Research source If your Time Lord is in Jupiter, your upcoming year may focus on themes like growth, luck, spirituality, prosperity, and continued education. Rules: Sagittarius and Pisces"
    },
    {
      "title": "Saturn",
      "content": "Saturn Astrologically speaking, Saturn represents the concepts of restraint and limitation . Through Saturn, a person can better understand the boundaries and guidelines of their daily life, and see the world with clearer structure. [12] X Research source Rules: Capricorn and Aquarius"
    },
    {
      "title": "1st House",
      "content": "1st House The 1st house centers around themes like identity, appearance, and any “first” experiences. [13] X Research source"
    },
    {
      "title": "2nd House",
      "content": "2nd House The 2nd house centers around themes like finances, personal values, and the way you view yourself. [14] X Research source"
    },
    {
      "title": "3rd House",
      "content": "3rd House The 3rd house revolves around themes like communication, short-term travel, and knowledge."
    },
    {
      "title": "4th House",
      "content": "4th House The 4th house focuses on themes like home, familial relationships, motherhood, and security."
    },
    {
      "title": "5th House",
      "content": "5th House The 5th house centers on themes like creativity, fun, romance, self-expression, and children."
    },
    {
      "title": "6th House",
      "content": "6th House The 6th house revolves around themes related to work, routine, health, and self-improvement."
    },
    {
      "title": "7th House",
      "content": "7th House The 7th house centers on the theme of relationships (including romantic, platonic, casual, and business relationships)."
    },
    {
      "title": "8th House",
      "content": "8th House The 8th house is rooted in themes like death, transformation, disaster, inheritance, and other people’s money."
    },
    {
      "title": "9th House",
      "content": "9th House The 9th house relates to themes of spirituality, adventure, continued education, and morality."
    },
    {
      "title": "10th House",
      "content": "10th House The 10th house represents themes like career, social standing, and a person’s general impact on society."
    },
    {
      "title": "11th House",
      "content": "11th House The 11th house centers around themes like friendships, goals, and a sense of purpose."
    },
    {
      "title": "12th House",
      "content": "12th House The 12th house revolves around themes of obscurity, like what people keep locked away from others (like secret weaknesses or dreams)."
    }
  ]
}