{
  "url": "https://www.wikihow.com/Afford-Dental-Implants",
  "title": "How to Afford Dental Implants",
  "steps": [
    {
      "title": "Determine if your insurance will cover any of the cost.",
      "content": "Determine if your insurance will cover any of the cost. Dental insurance doesn't often cover a large percentage of dental procedure costs, but some plans do cover a fraction of the overall cost. Although it may not be a lot, every penny the insurance company will pay will help in the long run. Call your insurance company to discuss the best way of paying for your dental implants. It is important to determine if going to an in-network provider will affect the amount the insurance company will cover."
    },
    {
      "title": "Discuss your options with your dentist.",
      "content": "Discuss your options with your dentist. Let your dentist know if the cost of the dental implants is unattainable for you. Some dental offices that do implants may consider offering you a payment plan that would make the implants more affordable. Approach the payment office at your dentist and see if they allow such plans. [1] X Research source Scheduling multiple implants at once is recommended to promote the healing process and for improving benefits for a long term result. Scheduling multiple implants at once might also help you save on the cost of office visits, anesthesia, and other charges. Asking your dentist for a temporary solution until you can afford to get the implants is also a possibility."
    },
    {
      "title": "Ask your dentist if they discount multiple implants.",
      "content": "Ask your dentist if they discount multiple implants. Some dental offices have packages available to help make implants more affordable for their patients. Inquire if they have packages available, or if they provide discounts with multiple implants."
    },
    {
      "title": "Find a dentist that performs all the steps.",
      "content": "Find a dentist that performs all the steps. Dental implants involve many steps, and many times require both a surgeon and a dentist. If you can find a dentist who performs both the surgical and restorative work, you may save money, and there is one person who takes all the responsibility for the entire procedure, which is really important. You also save time this way because the provider is able to combine the visits. It can take multiple appointments to get an implant that feels like a natural tooth, so talk to your clinician to be sure you understand the process from start to finish. [2] X Expert Source Alina Lane, DDS Board Certified Dentist Expert Interview. 21 April 2020."
    },
    {
      "title": "Comparison shop.",
      "content": "Comparison shop. Before deciding, call around to get quotes from different dentists. You want to make sure you are getting the best quality care for the best price. Don't stop at dentists, though; periodontists and oral surgeons also offer dental implants. Make sure you have looked at all your available options. Widen the net for where you get your implants. If you live in a large city, try finding a quality, recommended dentist in a suburb. Many times, dentists in smaller areas will charge less than those in large cities. Look for new practices. Newly opened practices may charge less as they build their reputation and client lists. Be sure to check references, like where they went to school and where they worked previously, their type of experience and methods they use, along with reviews from people in the community who have been to the new practice."
    },
    {
      "title": "Try a dental implant center.",
      "content": "Try a dental implant center. A dental implant center specializes in this kind of oral surgery. The center might charge less because dental implants are what they do on a regular basis, while your dentist might charge more because it is a special surgery. These centers also usually strive to provide lower treatment cost by having one surgical team to work on your mouth, instead of different specialists who charge separate fees."
    },
    {
      "title": "Look into dental schools.",
      "content": "Look into dental schools. Many college and universities have dental schools that provide dental care at reduced costs. Most of these dental schools have recently graduated students working alongside experienced dentists and professors. [3] X Research source They may even have better medical equipment, such as computers that they use for guided surgery."
    },
    {
      "title": "Finance your implants.",
      "content": "Finance your implants. Try health care financing, like CareCredit or Springstone. [4] X Research source Some companies offer special financing for health care related costs at no interest or low, fixed interest rates. Usually these financing option require decent credit scores. If your credit score is low, you can get one or two cosigners on the application to get approved."
    },
    {
      "title": "Look into low-income resources.",
      "content": "Look into low-income resources. Some organizations offer aid to low-income households who need dental care. Some non-profits and dental associations provide aid to certain demographics, such as people with disabilities, women and children, and others. The American Dental Association provides a list by state of local dental societies that can help you find affordable payment options. [5] X Trustworthy Source American Dental Association World's largest dental professional organization and advocate for proper oral health Go to source"
    },
    {
      "title": "Get a dental plan.",
      "content": "Get a dental plan. If your insurance doesn't pay for implants, there are dental insurance alternative plans that offer implant coverage. These plans usually require you to use dentists in their network."
    },
    {
      "title": "Look into dental tourism.",
      "content": "Look into dental tourism. Dental tourism has become a popular method for high priced dental work. Dental implants are cheaper in other countries, such as Mexico, Hungary, Italy, Costa Rica, and many Asian countries. Sometimes, the same dental implants can cost half of the price it would in the US. Dental tourism should be practiced with caution. Different government health standards means that not every dentist will be equal. Research the regulations, licensing standards, procedures, and the dental office carefully before getting work done. Get an international dental referral if at all possible. Also, you need to make sure that the implant you get is a high quality one because there are many companies on the market and dental implants have also started to be manufactured in China. Another risk you need to consider is that you may end up spending more money if the treatment doesn't go as planned and complications appear."
    },
    {
      "title": "Make dental implants a top priority.",
      "content": "Make dental implants a top priority. If dental implants are something you really want and need, consider making that a top priority. Instead of buying a new car or taking a vacation, use that money to help pay for your dental health. When they're placed properly, dental implants can have a very high and long-term success rate, making them a good investment. [6] X Expert Source Alina Lane, DDS Board Certified Dentist Expert Interview. 21 April 2020."
    },
    {
      "title": "Start saving.",
      "content": "Start saving. Once you have determined how much it will cost to get dental implants, start setting aside a designated amount each week or month until you save the desired amount. Saving in small increments may help the overall cost seem less overwhelming. Calculate how long it will take to save up enough money for your dental implants and schedule your appointment for that time."
    },
    {
      "title": "Take it one step at a time.",
      "content": "Take it one step at a time. Don't feel like you need to have all of the dental work done at the same time. If you can only afford to have the teeth extracted at this time, then stop there until you can afford the rest. Dental work is often done in stages, so it is feasible that you may need to pay for one stage at a time until you have completed the process. Even if it takes an extended amount of time, you won't be burdened with the whole bill at once. Dental implants take time to heal in the bone and this process takes at least four to six months. This means you have plenty of time to gather the money for the prosthetic part."
    },
    {
      "title": "Think about a funding campaign.",
      "content": "Think about a funding campaign. If you are in serious need of dental implants but still can't raise the money, think about starting a campaign to raise the money. Websites such as Indiegogo and GoFundMe allow you to raise money for health care. After setting up the account, you can share via social media so friends and family members can donate if they are willing."
    }
  ]
}