{
  "url": "https://www.wikihow.com/Adjust-Door-Hinges",
  "title": "How to Adjust Door Hinges",
  "steps": [
    {
      "title": "Examine the top corner of your door to see if it’s catching on the frame.",
      "content": "Examine the top corner of your door to see if it’s catching on the frame. Over time, the hinges on a door can loosen and cause the door to sag downward. [1] X Expert Source Christopher Lanier Handyman Expert Interview. 25 August 2020. When this happens, the top corner of the door catches on the door frame and prevents the door from closing properly. If the top corner of your door is catching on the frame, you’ll need to adjust the hinges. [2] X Research source Another way you can tell if your door is hanging downward is by looking at the gap between the top of the door and the frame. If the gap gets bigger as you move away from the door hinge, the door isn’t hanging properly."
    },
    {
      "title": "Tighten the screws on the door hinges with a screwdriver.",
      "content": "Tighten the screws on the door hinges with a screwdriver. Tightening the door hinges may solve the problem by pulling the door back toward the jamb (the hinged part of the frame) so it no longer catches on the frame when you try to close it. [3] X Expert Source Christopher Lanier Handyman Expert Interview. 25 August 2020. Tighten the screws on the hinges as much as possible and then try closing the door to see if the problem is fixed."
    },
    {
      "title": "Unscrew the middle screw on the top door hinge if the problem persists.",
      "content": "Unscrew the middle screw on the top door hinge if the problem persists. If tightening the hinges didn’t work, you’ll need to replace the middle screw on the top door hinge. [4] X Research source"
    },
    {
      "title": "Screw a 3 inch (7.6 cm) screw into the top door hinge.",
      "content": "Screw a 3 inch (7.6 cm) screw into the top door hinge. Screwing in a longer screw will help pull the door back toward the jamb. Tighten the screw all the way until the hinge is secure against the jamb. Then, try closing the door. The door should now close without any issue. [5] X Research source"
    },
    {
      "title": "Check the gap between the unhinged side of your door and the frame.",
      "content": "Check the gap between the unhinged side of your door and the frame. If there’s a large gap between the door and the frame, your door may not be closing properly. Instead of installing a new door that’s wider, you can fix the problem by adjusting the hinges on the door. [6] X Research source If there’s a gap only at the top or bottom of the unhinged side of your door, you’ll only need to adjust the hinge that’s level with the gap."
    },
    {
      "title": "Unscrew the bottom door hinge on your door.",
      "content": "Unscrew the bottom door hinge on your door. Use a screwdriver to unscrew each screw on the door hinge. For trickier screws, use a drill. [7] X Research source"
    },
    {
      "title": "Trace half of the hinge on a thin sheet of cardboard 4 times.",
      "content": "Trace half of the hinge on a thin sheet of cardboard 4 times. Lay the hinge on a flat surface so half of the hinge (1 of the hinge plates with screw holes in it) is on the piece of cardboard. Trace the outline of the hinge onto the cardboard with a pencil. Repeat on three other sections of the cardboard. [8] X Research source If you’re only adjusting one of the hinges on your door, you only need to trace the hinge 2 times on the cardboard. If your door has more than 2 hinges you’re adjusting, you’ll need to trace 2 additional outlines for each hinge."
    },
    {
      "title": "Cut out the traced outlines of the hinge plate.",
      "content": "Cut out the traced outlines of the hinge plate. Use scissors or a box cutter. Try to make the cuts as precise as possible. You’re going to be putting the pieces of cardboard behind the hinge on the door, and if they’re too big or small they won’t fit properly. [9] X Research source"
    },
    {
      "title": "Put 2 of the cardboard cutouts in the mortises on the door and jamb.",
      "content": "Put 2 of the cardboard cutouts in the mortises on the door and jamb. The mortises are the indents on the door and jamb that the hinge plates rest in. The cardboard cutouts should fit perfectly in the indents. [10] X Research source"
    },
    {
      "title": "Screw the bottom hinge back on over the cardboard cutouts.",
      "content": "Screw the bottom hinge back on over the cardboard cutouts. Push the screws right through the cardboard cutouts beneath the hinge plates. Tighten the screws all the way so the hinge is secure. When you’re finished, you shouldn’t be able to see the cardboard. [11] X Research source"
    },
    {
      "title": "Unscrew the top door hinge and add the other 2 cardboard cutouts.",
      "content": "Unscrew the top door hinge and add the other 2 cardboard cutouts. Then, screw the top door hinge back in place over the cardboard like you did with the bottom hinge. Now that both door hinges are slightly raised by the pieces of cardboard, the gap between your door and the frame should be smaller. If your door has more than 2 hinges you’re adjusting, unscrew those hinges and add the other pieces of cardboard you cut out."
    },
    {
      "title": "Add more cardboard cutouts if the gap is still too large.",
      "content": "Add more cardboard cutouts if the gap is still too large. Remove the hinges again and put more pieces of cardboard behind them. You may need to use several pieces of cardboard per hinge to solve the problem. [12] X Research source"
    },
    {
      "title": "Examine the gap between the unhinged side of your door and the frame.",
      "content": "Examine the gap between the unhinged side of your door and the frame. If the gap between the door and frame is almost nonexistent, you may have trouble closing and opening your door without it getting stuck. Before you shave off part of the edge of the door to make the gap bigger, try adjusting the door hinges to see if that fixes the problem. [13] X Expert Source Christopher Lanier Handyman Expert Interview. 25 August 2020. One of your door hinges may not be sitting in the mortise (the indent on the jamb that the hinge plate sits in) properly. [14] X Research source If only the top or bottom of your door is pushed too close to the frame, you’ll only need to adjust the hinge that’s level with that part of the door."
    },
    {
      "title": "Unscrew the bottom hinge on your door.",
      "content": "Unscrew the bottom hinge on your door. You can use a screwdriver or drill to unscrew the door hinge. [15] X Research source"
    },
    {
      "title": "Check the edge of the mortise for compression marks.",
      "content": "Check the edge of the mortise for compression marks. If you see compression marks, that means the door hinge plate wasn’t sitting in the mortise properly. If the door hinge isn’t sitting all the way down in the mortise, it will cause the door to push out into the frame more than it should. [16] X Research source"
    },
    {
      "title": "Use a utility knife to cut along the compression mark lines.",
      "content": "Use a utility knife to cut along the compression mark lines. Eventually you'll remove the excess wood along the compression marks so the door hinge is able to sit down in the mortise all the way. Don’t cut any deeper than the rest of the mortise with the utility knife. [17] X Research source"
    },
    {
      "title": "Use a chisel to remove the excess wood from the mortise.",
      "content": "Use a chisel to remove the excess wood from the mortise. Place the sharp end of the chisel at the top of one of the lines you cut. Then, hammer the handle of the chisel so the chisel scrapes up the excess wood. Be careful not to damage the mortise or door jamb. Continue chiseling until all of the excess wood along the compression marks is gone. [18] X Research source"
    },
    {
      "title": "Screw the hinge back onto your door.",
      "content": "Screw the hinge back onto your door. Now that you’ve removed the excess wood from the door jamb, the hinge should fit properly in the mortise. Make sure you screw the screws on the hinge in tightly so the hinge isn’t loose. [19] X Research source"
    },
    {
      "title": "Repeat with the other door hinges.",
      "content": "Repeat with the other door hinges. Unscrew the hinges and check the mortises for compression marks. If there are compression marks, cut them with the utility knife and chisel them out of the mortise. Once you’ve adjusted all of the hinges, the gap between the unhinged edge of your door and the frame should be wider and your door shouldn't get stuck when you open and close it. [20] X Research source"
    },
    {
      "title": "Shave your door down with a hand plane if the problem persists.",
      "content": "Shave your door down with a hand plane if the problem persists. A hand plane is a handheld tool that lets you shave off small amounts of wood from a wooden surface. Use the hand plane to shave the unhinged edge of your door that meets the frame so it doesn't get stuck anymore."
    }
  ]
}