{
  "url": "https://www.wikihow.com/Believe-in-Yourself",
  "title": "How to Believe in Yourself",
  "steps": [
    {
      "title": "Make a list of your past accomplishments.",
      "content": "Make a list of your past accomplishments. Writing out a list of your accomplishments will help you begin to believe in yourself. Sit down and make a list of all of the things that you feel you have excelled at during some point in your life. Include even the most minor activities, like putting together furniture from IKEA or organizing a party for a friend or family member. After you’ve compiled a short list, try to find patterns in the activities. Identify what you have done well over and over again to understand your skills. As you identify the skills that helped you accomplish things, begin to list those skills in a separate column. You can also make a list of stuff that you admire about yourself in a third column. [1] X Research source For example, if you notice that you’ve been successful at caring for dogs or cats, this could mean that you are naturally a compassionate person. In this case, try to find more activities that will help you to use this skill--such as volunteering at a local animal shelter."
    },
    {
      "title": "Talk to people who love you.",
      "content": "Talk to people who love you. If you're having trouble seeing all the wonderful things about yourself, you can always talk to someone who loves you. Sometimes we have difficulty seeing the best things about ourselves, but the people who love us will never struggle to see those things. Say something like, “Lately I have felt like I am not good at anything, but I am trying to move past that and identify my skills. What do you think I am good at?”"
    },
    {
      "title": "Find a cause that you believe in.",
      "content": "Find a cause that you believe in. It may be difficult to believe in yourself if you are always trying to please others. Make sure that you look for causes and projects that appeal to you and that you actually believe in. The passion that you feel for these causes and projects will help you to work harder and see how much you can achieve. [2] X Expert Source Guy Reichard Life Coach Expert Interview. 19 March 2020."
    },
    {
      "title": "Set realistic goals.",
      "content": "Set realistic goals. Setting realistic goals boosts your self-efficacy and helps you to believe in yourself and your ability to accomplish things. Make sure that you develop goals that are in line with your skills and that are attainable. For example, if you have decided that you want to work towards a long-term goal of becoming a veterinary assistant because of your animal handling skills, start by setting a small attainable goal of applying to a veterinary assistant program. Once you accomplish that goal, you can move on to another small, attainable goal that helps to get you closer to your long-term goal. [3] X Research source Be prepared to go outside of your comfort zone now and then. Even though you are setting realistic goals, you might need to do things that you don’t normally do in order to accomplish your goals. After you set a goal, work hard until you achieve it. Don’t abandon a goal because it becomes too difficult. If a goal seems too difficult, try breaking it into a series of smaller goals and focus on one at a time."
    },
    {
      "title": "Reflect at the end of each day.",
      "content": "Reflect at the end of each day. Self-reflection is an important component of self-improvement. It helps you to take stock of what you are doing well and what you still need to work on. Take a few moments at the end of each day to reflect on your experiences. If you have a day where you don’t accomplish as much as you hoped, you would try to learn what you can from the situation to avoid repeating any mistakes you might have made. [4] X Research source For example, if you can’t seem to get yourself up in the morning to go on a hike as planned, you may have learned that you have trouble getting motivated in the morning. Try setting multiple alarms, and maybe even place one of them a few feet away from your bed, so you have to get up and turn it off. Or, you could try to find a different time to hike, instead of forcing yourself to do it in the morning."
    },
    {
      "title": "Be persistent.",
      "content": "Be persistent. Sometimes we feel like giving up because failure is a possibility, but it’s perfectly natural to struggle with something the first time you do it. Instead of blaming yourself for doing something wrong, give yourself permission to experiment without worrying about the consequences. Some of the most successful innovators have found that improvisation requires a sort of “playful” mindset as opposed to one that is fixated on a single goal. [5] X Research source"
    },
    {
      "title": "Connect with people.",
      "content": "Connect with people. Newly emerging perspectives in neuroscience are emphasizing the importance of persistently forging and reworking our relationships with others to support functional brain processes. [6] X Research source As such, we will likely be unsuccessful at changing our habits without first realizing the degree to which our behaviors are conditioned by, or in some way dependent on, others around us. If you find that other people are constantly coming to you for advice, but you rarely feel like you have someone to talk to yourself when you’re unhappy, it could be the case that you’ve come to serve the role of nurturer in your group of friends. There’s nothing wrong with helping others, but it’s also necessary to take care of yourself. In fact, sometimes we help others more than ourselves because we’ve gotten used to doing so. Think about why you are inclined to help others and consider the effect it has on you."
    },
    {
      "title": "Build yourself up.",
      "content": "Build yourself up. Work on thinking positively about yourself and your behavior. Fight the urge to be negative by identifying two of your strengths every day. Make sure that you challenge any unproductive thought that enters your head. If you catch yourself thinking negative thoughts like “I am a loser,” “no one likes me,” and “I can’t do anything right,” stop yourself and challenge the thought. Counter it with productive thoughts, identifying two positive things about yourself. The more that you practice this positive thinking, the easier it will become. [7] X Research source For example, if you catch yourself having a negative thought like, “I am terrible at math,” reframe the thought in a more productive way by saying something like, \"I find math challenging, but I am working hard and improving.\" Reader Poll: We asked 121 wikiHow readers if they think mantras and affirmations help boost their mood, and 74% of them said yes. [Take Poll] Repeating a mantra or affirmation can help you feel more confident!"
    },
    {
      "title": "Find ways to keep moving forward.",
      "content": "Find ways to keep moving forward. Sometimes you might feel stuck in a rut, with no idea how to keep going. In these cases, take a deep breath and try to put the present moment in perspective. People too often focus on the negative, which can lead us to ignore good things. [8] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Sometimes all that’s required is a change of scenery, or perhaps a disruption in your everyday routine. If feelings of dread or hopelessness last for an extended period, you might want to consider talking to a therapist or mental health counselor. Find a way to disrupt your usual routine or behavior. For example, if you feel that you are surrounded by negative people, you could join a sports club or other local group to meet some new people. [9] X Research source"
    },
    {
      "title": "Be proactive.",
      "content": "Be proactive. Procrastinating, or putting things off because they are difficult, sets you up for failure. When you have less time to do a task, you'll rush and miss things. Instead, do things on time so that you have the extra time to do your best! Experiencing the small successes of completed tasks can contribute to believing that you can accomplish greater tasks. For example, you might have a sink full of dishes to clean, but decide to put it off so that you can watch your favorite T.V. show. Before you know it, several other demands might arise, such as the T.V. going out and needing to be fixed or a problem arising with a bill you received, which might end up forcing you to put off the dishes even longer. Instead of letting everyday life demands pile on top of each other, tackle them as soon as you think about it. It might be unpleasant at first, but after a while it will become second nature and your day-to-day affairs will seem to take care of themselves. If you are a chronic procrastinator, you might want to consider talking to a therapist or mental health counselor. Cognitive behavioral therapy (CBT) can help you to stop procrastinating. [10] X Research source"
    },
    {
      "title": "Focus on the positive.",
      "content": "Focus on the positive. Psychologists have found that we often focus on negative comments about ourselves while ignoring the positive ones. We also tend to assume people are focusing on us more than they are. [11] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Try to remind yourself to focus on the positive more than the negative. If you find either yourself or those around you being extra critical, think about making some changes. [12] X Research source"
    },
    {
      "title": "Do things that are hard.",
      "content": "Do things that are hard. If we only take the easy route, it can be easy to think that we aren't capable of doing things that are hard. Prove to yourself that you can take on challenges by doing just that: take on challenges. Do things that will be rewarding, even though they'll be hard work. You can do it! Remember that you can always break down a difficult task into a series of small, easier tasks."
    },
    {
      "title": "Practice speaking up for yourself.",
      "content": "Practice speaking up for yourself. When things are happening around you, and you have an opinion or know a better way to do something, speak up! If you feel dissatisfied, don't just accept things the way they are. Take an active part in the situation. This shows others that you are capable of taking control and expressing your needs or desires to them. Speaking up will also help you to surround yourself with people whose aspirations and concerns are in line with your own. These are all things that are essential to becoming more comfortable in your environment, which research has shown a necessary step towards developing confidence in your ability act on your needs and desires. [13] X Research source For example, if one of your co-workers often makes inappropriate jokes about women, try to come up with a way to bring your concerns about his jokes to his attention in a productive manner. You could simply say, “I am offended by your jokes because they make light of a very serious issue.” The discussion might become heated, but the more you practice speaking up for yourself on important issues, such a gender equality, the easier it will become. If you tend to worry about how others will interpret what you have to say and that often stops you from speaking up, try to break that habit. Practice expressing your thoughts and feelings to others without worrying about how they are interpreted, which might mean having to deal with misunderstandings arising when communicating with other people. [14] X Research source If a miscommunication happens, don’t be afraid to share your personal history, especially how you’ve learned to communicate with others because of where you are from. It’s important for everyone involved to realize that such instances of miscommunication are not anyone’s fault in, but they can be opportunities for everyone involved to grow and learn more about each other’s unique modes of expression."
    },
    {
      "title": "Help others.",
      "content": "Help others. In helping others, we can often get a better view of what we're capable of and feel better about ourselves in the process. Helping others through volunteerism or everyday acts of kindness brings a wonderful sense of fulfillment. It also provides extra opportunities for you to use and develop your skills. [15] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source By helping others, you will find yourself feeling more confident than ever."
    },
    {
      "title": "Pay attention to your appearance and hygiene.",
      "content": "Pay attention to your appearance and hygiene. Believing in yourself may be easier if you feel confident in the way that you look as well. You can make sure that you are looking and feeling your best by keeping a good daily hygiene and grooming routine. [16] X Research source Make sure that you: Shower or bathe Style your hair Trim or file your nails Shave or keep your beard well groomed Brush your teeth (2X daily) Maintain a pleasant body odor by using deodorant, scented lotions, and perfumes Wear clothes that fit well and make you feel good Wear makeup that accentuates your best features"
    },
    {
      "title": "Nourish your body with healthy food.",
      "content": "Nourish your body with healthy food . The food that you eat each day will affect the way that you feel physically and emotionally. If you take the time to prepare a nice meal for yourself, you will feel better than if you just eat a bag of chips and a can of soda for dinner. Make sure that you contribute to your overall well-being by only putting healthy food into your body. [17] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Exercise every day.",
      "content": "Exercise every day. Exercise has long been noted for its ability to help reduce stress and make people feel happier, but some studies have also shown that exercise may help improve one’s confidence levels. Make sure to include at least 30 minutes of exercise into your daily routine to reap the physical and mental health benefits of exercise. [18] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Get plenty of sleep.",
      "content": "Get plenty of sleep. Sleep deprivation can aggravate self-consciousness and other negative emotional tendencies, so it is important to get plenty of sleep every night. [19] X Trustworthy Source Health.gov Online collection of health and fitness standards set by the U.S. Office of Disease Prevention and Health Promotion Go to source Feeling self-conscious and negative will make it harder for you to believe in yourself. Try to get about 8 hours of sleep per night to avoid these adverse effects."
    },
    {
      "title": "Relax every day.",
      "content": "Relax every day. Make sure that you take a little time to relax every day. Incorporating activities like meditation, yoga, deep breathing, aromatherapy, and other soothing techniques will help you avoid negative thoughts and find it easier to believe in yourself. Find something that works for you and add it into your daily routine."
    },
    {
      "title": "Maintain a pleasant environment.",
      "content": "Maintain a pleasant environment. Your surroundings may also affect the way that you feel about yourself, so it is important to maintain a clean and pleasant home for yourself. Keep your house (or at least your room, if you live with others) clean and inviting. Place meaningful objects around the room to help you feel encouraged. [20] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}