{
  "url": "https://www.wikihow.com/Bathe-a-Newborn-Puppy",
  "title": "How to Bathe a Newborn Puppy",
  "steps": [
    {
      "title": "Start bathing your puppy once they're 4 weeks old.",
      "content": "Start bathing your puppy once they're 4 weeks old. Puppies less than four weeks old do not really need to be bathed. At most, bathe your puppy one time if it is very dirty and the mother cannot clean it herself."
    },
    {
      "title": "Hold the puppy close to yourself.",
      "content": "Hold the puppy close to yourself. Holding the puppy close to your chest will keep it warm. [1] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Newborn puppies are very sensitive to temperature. [2] X Research source Don't put the puppy into water because its body cannot regulate temperature well."
    },
    {
      "title": "Use a gentle washcloth.",
      "content": "Use a gentle washcloth. Choose a cloth that is clean and soft because newborn puppies are very sensitive. For very tiny puppies, you can even use a cotton ball or piece of gauze. [3] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Use only water.",
      "content": "Use only water. Wet the clean washcloth in warm water and wring out most of the excess water until it is just damp. Do not use soap or dog shampoo on a puppy under four weeks old, its skin is too sensitive and can dry out from shampoo."
    },
    {
      "title": "Gently wipe the puppy.",
      "content": "Gently wipe the puppy. Use the warm, damp cloth to gently wipe the puppy's coat. Start at the head and wipe softly toward the tail."
    },
    {
      "title": "Dry the puppy.",
      "content": "Dry the puppy. It is very important to dry the puppy to remove any excess moisture. A wet puppy can become too cold very quickly because it has a hard time regulating its body temperature."
    },
    {
      "title": "Return the puppy to its mother.",
      "content": "Return the puppy to its mother. After cleaning and drying the puppy, return it to its mother so she can keep it warm. [4] X Research source If it is not possible to place the puppy with its mother, make sure it stays in a warm area without cold drafts."
    },
    {
      "title": "Decide if your puppy needs a bath.",
      "content": "Decide if your puppy needs a bath. Dogs of all ages do not really need to be bathed unless they have a skin condition or if they are very dirty. If your puppy is very dirty or smelly you can bathe it occasionally. Try not to bathe a puppy more than once a month or so. Most dogs only need to be bathed a couple times a year. [5] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Put the puppy on soft blanket so water doesn’t drip on the floor.",
      "content": "Put the puppy on soft blanket so water doesn’t drip on the floor. Do not put puppies into a bathtub, sink, or tub full of water. It is hard for them to regulate their body temperature and they can become too cold when immersed in water."
    },
    {
      "title": "Brush puppies with a very fluffy coat before bathing.",
      "content": "Brush puppies with a very fluffy coat before bathing. Brush your puppy to remove tangles or mats before you bathe it if it has a long or fluffy coat. It is good to get longer coated and fluffy dogs used to being brushed while they are young."
    },
    {
      "title": "Use a gentle washcloth and warm water.",
      "content": "Use a gentle washcloth and warm water. Choose a soft clean cloth and get it wet in water that is warm but not very hot. Wipe the puppy off with the cloth. Start at the head and wipe gently back towards the tail. Make sure to wipe the underside too."
    },
    {
      "title": "Use gentle shampoo.",
      "content": "Use gentle shampoo. Use shampoo made for puppies or babies. Puppy skin can be sensitive even as they start to grow. Just use a small amount of shampoo. Dry shampoos can be used on older puppies that don't like water. These are rubbed onto the coat without water. [6] X Research source Make sure not to get the suds in the puppy's eyes."
    },
    {
      "title": "Gently wash the puppy.",
      "content": "Gently wash the puppy. Lather the shampoo like you would on your own hair. Wipe the suds away with the cloth, then rinse it in warm water and wipe again. Repeat until the puppy is clean."
    },
    {
      "title": "Dry the puppy off.",
      "content": "Dry the puppy off. Dry the puppy right away with a clean dry towel. It is important to get the puppy dry so it does not get too cold."
    },
    {
      "title": "Put the puppy in a warm area.",
      "content": "Put the puppy in a warm area. Puppies need a place to stay warm since it is hard for them to regulate their own temperature. [7] X Research source Choose an area that is not drafty."
    },
    {
      "title": "Associate bathing with good things.",
      "content": "Associate bathing with good things. Get your puppy used to bathing and make them associate a bath with nice things like toys and treats. Let your puppy have a nice treat after its bath. [8] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Leave newborn puppies with their mother.",
      "content": "Leave newborn puppies with their mother. Mothers usually care for newborn puppies including keeping them very clean. If at all possible leave the bathing of a newborn puppy to its mother for the first four weeks. [9] X Expert Source Kateryna Zabashta Dog Breeder Expert Interview. 19 March 2021. Newborn puppies do not really need to be bathed at all, so resist the urge to try to bathe them. [10] X Expert Source Kateryna Zabashta Dog Breeder Expert Interview. 19 March 2021."
    },
    {
      "title": "Keep the area clean.",
      "content": "Keep the area clean. Make sure to keep the space for the mother and puppies clean. [11] X Research source Line the space with newspapers, cloth, or towels and change them regularly. Use a material that does not contain dyes or chemicals. The mother will take care of all the feeding and removing waste for the first month or so. Just give her a nice clean space."
    },
    {
      "title": "Check in regularly.",
      "content": "Check in regularly. Check to make sure the mother cleans her puppies. In rare cases a mother may abandon or neglect some puppies. [12] X Research source Only clean a newborn puppy if the mother is not cleaning it herself. [13] X Expert Source Kateryna Zabashta Dog Breeder Expert Interview. 19 March 2021."
    }
  ]
}