{
  "url": "https://www.wikihow.com/Address-a-Postcard",
  "title": "How to Address a Postcard",
  "steps": [
    {
      "title": "Look for signs of where to put an address.",
      "content": "Look for signs of where to put an address. The address is normally placed on the right hand side of a postcard and midway down the card. There is usually a printed vertical line denoting the left and the right of the postcard. If not, imagine a line in the centre of the postcard, Choose the right hand side to insert the address. [1] X Research source Many postcards include pre-printed horizontal address lines to show you where to add the address. But not all will do this, so assume that the mid-right of the card is the best placement for the address."
    },
    {
      "title": "Format the position of the address correctly.",
      "content": "Format the position of the address correctly. If you are making your own postcard out of a photo or picture, or you purchase a postcard without lines to fill in an address, you will need to format the back of the postcard yourself. Check with your local post office for specific postcard requirements. However, in general, most postcards will follow these requirements: [2] X Research source The address side of the card must be divided into a right portion and a left portion, with or without a vertical rule. The left portion is the message area. The destination address, postage, and any postal service marking or endorsement must appear in the right portion. The right portion must be at least 2-1/8 inches wide (measured from the right edge of the card, top to bottom inclusive). [3] X Research source"
    },
    {
      "title": "Draw a neat box around the address it to help it stand out.",
      "content": "Draw a neat box around the address it to help it stand out. This is a good way to help point out to postal workers the address on your postcard. It makes their work easier and ensures no mistakes are made. You can also write right up the edge of those lines without having your message clutter or overpower the address."
    },
    {
      "title": "Place the stamp in the upper right hand corner.",
      "content": "Place the stamp in the upper right hand corner. This is the standard placement of all stamps. You may even need to place multiple stamps depending on where you will be mailing it to."
    },
    {
      "title": "Consider writing the address on first.",
      "content": "Consider writing the address on first. In most cases, postcards will have lines designated for an address, but in some cases, a postcard can be completely blank. [4] X Research source Making it a habit to write down the address before writing your message is a good way to ensure you don't take over the postcard with your message, leaving no room for an address."
    },
    {
      "title": "Pasting the address onto your postcard.",
      "content": "Pasting the address onto your postcard. You may have written the address wrong in pen, or completely forgot to write an address. Take a piece of paper and trace the outline of your postcard. Then replicate the back of your postcard within the box you just made. Address your postcard directly and cut and paste your make-shift postcard onto the actual postcard. While the post office won't love you for making a mess of the address, most post offices will do their very best to help deliver your postcard."
    }
  ]
}