{
  "url": "https://www.wikihow.com/Control-Dust-on-Gravel-Roads",
  "title": "How to Control Dust on Gravel Roads",
  "steps": [
    {
      "title": "Wet down your gravel road with water.",
      "content": "Wet down your gravel road with water. Adding moisture to your gravel road will prevent dust from entering the air. You'll want to evenly coat your gravel road with water every few days to help with dust issues. [1] X Research source You can use a handheld liquid sprayer to cover your gravel road with water. If you have a long enough hose, you can attach it to an outdoor water faucet and spray the road. You can also alter the direction of your sprinkler heads to periodically cover the road with water."
    },
    {
      "title": "Install windbreaks near the gravel road.",
      "content": "Install windbreaks near the gravel road. Wind adds to your dust problems by blowing around the dust and depositing it in unwanted places. You can put up a fence or a wall of shrubs along the side of the road to act as a windbreak. For maximum protection, you'll want to install a windbreak on both sides of your road. [2] X Research source If you're only building 1 windbreak, place it on the side of the road that is closest to your home to reduce the amount of dust coming toward your house. Picket and board fences work well for this purpose."
    },
    {
      "title": "Drive slowly on the gravel road.",
      "content": "Drive slowly on the gravel road. The amount of dust released from the road has a direct correlation to how fast you drive on it. Driving slow will prevent the potholes from getting worse and will also reduce the amount of dust released from the road. [3] X Research source Though it might be inconvenient on longer stretches of road, any reduction in speed will help keep the dust down."
    },
    {
      "title": "Measure the size of your road.",
      "content": "Measure the size of your road. Use a rolling measuring device to track the width and length of your road in yards or meters. Multiply the width and length together to calculate the number of squared yards or squared meters. It's ok to round up to the nearest number for this calculation. You'll need these measurements when you're deciding how much calcium chloride to buy."
    },
    {
      "title": "Buy enough calcium chloride to cover your road.",
      "content": "Buy enough calcium chloride to cover your road. You'll want to buy 1 pound (0.45 kg) of calcium chloride for every 1 square yard (0.84 m 2 ) for a previously untreated road. For a road that was treated the previous year, you'll want to get .5 pounds (0.23 kg) of calcium chloride for every 1 square yard (0.84 m 2 ). It is recommended to buy calcium chloride flakes for better storage and easier mixing."
    },
    {
      "title": "Rent a tow-behind liquid sprayer.",
      "content": "Rent a tow-behind liquid sprayer. You can use sprayers from an equipment rental place or farm supply store. Liquid sprayers come in a variety of sizes and you'll want to pick the size that fits your needs. Choose the tank size based upon the size of your road. Most residential properties could spray their road using a tank that holds 25 gallons (95 L)."
    },
    {
      "title": "Mix your calcium chloride and water solution in the liquid sprayer.",
      "content": "Mix your calcium chloride and water solution in the liquid sprayer. You'll want to mix your solution to achieve a 35% concentration of calcium chloride. Mix cool water with the calcium chloride to reduce the heat created by the chemical reaction. Always wear protective gloves, eyewear, and a face mask when handling chemicals. You can use an online ratio calculator to determine how many pounds or kilograms of calcium chloride you should mix with water in your given sprayer tank. [4] X Research source"
    },
    {
      "title": "Attach the water sprayer to your vehicles hitch.",
      "content": "Attach the water sprayer to your vehicles hitch. Back up your vehicle as close as you can to the water sprayers trailer coupler. Use the trailer lift to raise the coupler high enough for the vehicles trailer ball to go under the sprayers coupler. Lower the trailer onto the ball by retracting the trailer lift. Once the coupler is on your vehicles ball, you can secure it with the couplers locking mechanism."
    },
    {
      "title": "Turn on the liquid sprayer pump.",
      "content": "Turn on the liquid sprayer pump. Some sprayers will have a gas-powered pump whereas others will have an electric pump. The procedure for starting the pump will vary depending on the model. It is best to ask the rental place for instructions on how to start the pump for your sprayer. Be sure to stand clear of the sprayer nozzles to avoid exposure to the solution."
    },
    {
      "title": "Pull the sprayer across the road at a slow pace.",
      "content": "Pull the sprayer across the road at a slow pace. You'll want to evenly coat the entire road with the solution. Depending on the size of your sprayer, you might need to make multiple passes on each half of the road. Continue driving and spraying until you have evenly covered the road with the amount of solution you previously calculated. Be sure to keep an adequate amount of solution in your tank to avoid running the pump dry. When you are getting close to being out of solution, turn the pump off and mix in more solution before continuing to work."
    },
    {
      "title": "Purchase a gravel binding solution.",
      "content": "Purchase a gravel binding solution. A gravel binding solution will help harden the fine dust particles so they don't get airborne. You can find various binding solutions at home improvement stores, ranch supply stores, and hardware stores. The chemicals may differ from solution to solution, and some may be more potent than others. [5] X Research source Binding solutions function differently from calcium chloride in the sense that they help harden fine dust particles whereas calcium chloride helps keep the dust moist."
    },
    {
      "title": "Dilute the binder with water if needed.",
      "content": "Dilute the binder with water if needed. Some gravel binders will require you to dilute the solution with fresh water. Read the instructions for the binding solution to determine how much water to mix with the binder. You'll mix some solutions in the product's bucket, while others might recommend you to use a separate container. [6] X Research source Some binding solutions will be pre-mixed or ready to use right out of the package."
    },
    {
      "title": "Pour the mixture into a sprayer or watering device.",
      "content": "Pour the mixture into a sprayer or watering device. To spread the mixture evenly, you'll want to use some sort of spraying device to cover the road. Read the instructions to determine the best size of water sprayer to use for your mixture. [7] X Research source Some binding solutions will allow you to use a simple hand sprayer, whereas others may require you to use a powered sprayer."
    },
    {
      "title": "Spray the mixture onto the road.",
      "content": "Spray the mixture onto the road. Starting at one end of the road, begin spraying an even coat across the top of the road. Refer to the instructions to determine how densely the mixture should be applied. Some solutions may be harmful to grass so be cautious of where you are spraying."
    },
    {
      "title": "Purchase some extra gravel.",
      "content": "Purchase some extra gravel. You can bring a sample of your gravel to a materials dealer and they can help you find the same or similar gravel to what you have. The gravel doesn't need to match perfectly to be used for road repairs. [8] X Research source Only the top three inches of the gravel will have to match the existing gravel to maintain a consistent look. You can use a courser or off colored gravel to fill in the bottom of the low spots. [9] X Research source"
    },
    {
      "title": "Shovel the gravel into low spots and potholes.",
      "content": "Shovel the gravel into low spots and potholes. Take a shovel or a bucket and spread the gravel around the spots that need to be filled. Some gravel will come in bags so you can just pour the gravel straight out of the bag. [10] X Research source Fill the holes with enough material to be slightly higher than the existing road. The gravel will settle once it is compacted. Filling in low spots reduces standing water which can lead to more dust once the water evaporates. [11] X Research source"
    },
    {
      "title": "Compact the gravel with a packing tool or vehicle.",
      "content": "Compact the gravel with a packing tool or vehicle. Using your hands, lift your packing tool up and then slam it down repeatedly onto the newly placed gravel. You can also use your car to drive over the area and pack down the gravel with the wheels. Once packed, the ground should be even in comparison to the surrounding area. [12] X Research source You can buy a packing tool at your local hardware store. You can rake over the area to minimize signs of the repair. Using your foot to pack the gravel will not provide enough pressure to secure it. Keep an eye on these areas and repeat the filling process as needed."
    }
  ]
}