{
  "url": "https://www.wikihow.com/Cancel-a-Geek-Squad-Protection-Plan",
  "title": "How to Cancel a Geek Squad Protection Plan",
  "steps": [
    {
      "title": "Find your original receipt(s) and Protection Plan (\"GSP Plan\") contract documents.",
      "content": "Find your original receipt(s) and Protection Plan (\"GSP Plan\") contract documents. If you have a separate receipt for the item and the GSP Plan, collect both for your call. You may need to provide information such as plan number, item number, store number, and purchase date. Your GSP Plan receipt will include your plan number, labeled as \"GSP #.\" [2] X Research source Cancelling by phone is your best option if you don't have your original receipt(s), particularly if you had the foresight to either photocopy/scan them or jot down key information like item number, GSP number, purchase date, and store number. The Geek Squad website also states that you can call them (1-800-433-5778) regarding a lost receipt."
    },
    {
      "title": "Call 1-800-433-5778 (1-800-GEEK SQUAD).",
      "content": "Call 1-800-433-5778 (1-800-GEEK SQUAD). Follow the voice prompts, saying \"protection plan\" and \"cancel my plan\". If you are calling from the phone number on file, the automated system will walk you through the steps to cancel your plan and you will not be directed to a support staff member. ."
    },
    {
      "title": "Tell the person on the line that you want to cancel your Geek Squad Protection Plan.",
      "content": "Tell the person on the line that you want to cancel your Geek Squad Protection Plan. Provide the requested information regarding your GSP Plan. If the person tries to talk you out of cancelling, remember that he or she is only doing his/her job. Unless you are reconsidering, calmly reiterate that you want to cancel and your decision is final. Note the relevant section of your contract, regarding your right to cancel at any time for any reason, if necessary (Section 10.b.II, page 7 at present). [3] X Research source"
    },
    {
      "title": "Ask the staff member to determine your pro-rated refund amount, if you are owed one.",
      "content": "Ask the staff member to determine your pro-rated refund amount, if you are owed one. The means of determining this amount, along with the actual cancellation date of your GSP Plan, will vary depending upon whether you paid in full or pay monthly. [4] X Research source For plans already paid in full, you will receive a pro-rated refund for the time remaining on the GSP Plan, minus the amount for any services rendered. For instance, if you cancel after one year of a two-year plan, you will receive half of your payment amount back. If, however, you had a repair done, that can be deducted from your refund. For plans that are paid monthly by credit card, you pay in advance for each month of service. Therefore, unless you happen to be right at the end of a payment cycle, your coverage will continue until the end of that cycle, then your GSP Plan will be cancelled."
    },
    {
      "title": "Confirm that your plan is cancelled.",
      "content": "Confirm that your plan is cancelled. Ask for the person's name and a form of confirmation, such as a confirmation number or email, that your GSP Plan is no longer in effect. Mark down the date and time of your call, and keep this evidence until you are sure the cancellation has been made. It may take 60 days for refunds to show up on your credit card. If your card is charged the next month or you do not see a refund in 60 days, you should call back to inquire. Relay the confirmation details as necessary to prove your original cancellation."
    },
    {
      "title": "Find your original receipt(s) and Protection Plan (\"GSP Plan\") contract documents.",
      "content": "Find your original receipt(s) and Protection Plan (\"GSP Plan\") contract documents. Bring the receipt for the product and the GSP Plan, along with the GSP Plan contract, to Best Buy. Your GSP Plan receipt will include your plan number, labeled as \"GSP #.\" [5] X Research source If you cannot locate the original receipts, call Geek Squad customer service (1-800-433-5778) or follow the instructions in this article for cancelling by phone."
    },
    {
      "title": "Visit the customer service desk at your selected Best Buy store.",
      "content": "Visit the customer service desk at your selected Best Buy store. Tell the clerk that you would like to cancel your Geek Squad Protection Plan. Don't be shocked if the clerk acts surprised or confused, or tries to talk you out of cancelling. Best Buy doesn't want customers to cancel GSP Plans, and workers who want to keep their bosses happy will try to prevent cancellations as well. Remember, however, that you can cancel at any time for any reason. If you don't want to tell the clerk why you're cancelling, you don't have to. Show him/her the relevant section of your contract document if necessary (Section 10.b.II, page 7 at present). [6] X Research source"
    },
    {
      "title": "Ask the clerk to determine your pro-rated refund amount, if you are owed one.",
      "content": "Ask the clerk to determine your pro-rated refund amount, if you are owed one. The means of determining this amount, along with the actual cancellation date of your GSP Plan, will vary depending upon whether you paid in full or pay monthly. [7] X Research source For plans already paid in full, you will receive a pro-rated refund for the time remaining on the GSP Plan, minus the amount for any services rendered. For instance, if you cancel after one year of a two-year plan, you will receive half of your payment amount back. If, however, you had a repair done, that can be deducted from your refund. For plans that are paid monthly by credit card, you pay in advance for each month of service. Therefore, unless you happen to be right at the end of a payment cycle, your coverage will continue until the end of that cycle, then your GSP Plan will be cancelled."
    },
    {
      "title": "Confirm that your plan is cancelled.",
      "content": "Confirm that your plan is cancelled. Ask for documentation that your GSP Plan is no longer in effect. Keep this document, along with a receipt for any refunded amount, until you are sure the cancellation has been made. It may take 60 days for refunds to show up on your credit card."
    },
    {
      "title": "Find your original receipt(s) and Protection Plan (\"GSP Plan\") contract documents.",
      "content": "Find your original receipt(s) and Protection Plan (\"GSP Plan\") contract documents. Your GSP Plan receipt will include your plan number, labeled as \"GSP #.\" [8] X Research source If you cannot locate the original receipts, call Geek Squad customer service (1-800-433-5778) or follow the instructions in this article for cancelling by phone."
    },
    {
      "title": "Write or type a letter that briefly yet clearly declares your wish to cancel your Geek Squad Protection Plan.",
      "content": "Write or type a letter that briefly yet clearly declares your wish to cancel your Geek Squad Protection Plan. Include your name, address, contact information (phone and/or email), item number, purchase date, and GSP # in the letter. Affix your signature as well. The body of the letter can be as simple as the following: \"Dear Sir or Madam: I would like to cancel my Geek Squad Protection Plan (GSP # 123456789), effective immediately. Please refund any payments due back to me to the credit card you have on file. Feel free to contact me with any questions at the phone number listed above. Thank you. Sincerely, Joe Wikihow.\""
    },
    {
      "title": "Scan or photocopy your original documents.",
      "content": "Scan or photocopy your original documents. Copy your receipt(s), GSP Plan contract, and signed cancellation letter, and keep them for your records."
    },
    {
      "title": "Mail the letter, original receipts, and GSP Plan contract to the address listed on the contract.",
      "content": "Mail the letter, original receipts, and GSP Plan contract to the address listed on the contract. At present, the address is: [9] X Research source AWG / GSP Plans ATTN: Cancellations P.O. Box 9312 Minneapolis, MN 55440-9312"
    },
    {
      "title": "Keep your copies of the letter, receipts, and contract at least until you have confirmation that your plan has been cancelled.",
      "content": "Keep your copies of the letter, receipts, and contract at least until you have confirmation that your plan has been cancelled. Watch for a refund applied to your credit card, if you are due one. For plans already paid in full, you will receive a pro-rated refund for the time remaining on the GSP Plan, minus the amount for any services rendered. For instance, if you cancel after one year of a two-year plan, you will receive half of your payment amount back. If, however, you had a repair done, that can be deducted from your refund. For plans that are paid monthly by credit card, you pay in advance for each month of service. Therefore, unless you happen to be right at the end of a payment cycle, your coverage will continue until the end of that cycle, then your GSP Plan will be cancelled. You should receive a confirmation letter of cancellation. If your card is charged another monthly payment, any refund due does not appear on your credit card statement within 60 days, or you do not receive a confirmation letter within a reasonable period (perhaps 14 days), contact Geek Squad by phone at 1-800-433-5778."
    }
  ]
}