{
  "url": "https://www.wikihow.com/Become-a-Test-Pilot",
  "title": "How to Become a Test Pilot",
  "steps": [
    {
      "title": "Obtain a Class I medical certificate/student pilot certificate.",
      "content": "Obtain a Class I medical certificate/student pilot certificate. Before running off to flight school and spending money on flight training be sure you are physically eligible for a career as a test pilot. If you cannot pass a Class I medical test, you cannot work as a test pilot. Period. This means being off of most if not all medications, never having had an epileptic seizure, never having had internal organ issues - especially with the heart, never having had a history of mental issues involving psychosis, no criminal convictions, no illicit drug use, and a host of other criteria that may be referenced in the FAR/AIM and a number of websites. Your first Class I medical certificate may be dual-issued with a student pilot certificate."
    },
    {
      "title": "Become a professional pilot.",
      "content": "Become a professional pilot. Find your nearest FAR Part 141 ground school and enroll in flight training. Part 141 is preferred to Part 61 because of its more stringent testing criteria. Aircraft certificates from private pilot to airline transport pilot (ATP) are required as well as instrument and multi-engine ratings. In addition a variety endorsements and type ratings may be obtained in order to expand a test pilot's resume. Proficient and safe operating habits and good \"stick and rudder\" skills are a must."
    },
    {
      "title": "Have a background in and passion for science.",
      "content": "Have a background in and passion for science. Most if not all aircraft manufacturers require an advanced degree in aeronautical engineering for test pilot applicants. This means starting early with mathematics and physics courses in high school and obtaining a bachelor's and master's degree in aeronautical engineering, or a bachelor's in mathematics or physics with a minor in engineering and a master's in aeronautical engineering. Expect a minimum of 6 years in a university and a lot of hard work. If your goal is to enter the military, talk to officer recruiters and join your university ROTC program."
    },
    {
      "title": "Be able to communicate well verbally and in writing.",
      "content": "Be able to communicate well verbally and in writing. Test pilots spend as much time planning their test flights and reporting on how the plane handled after flying it as they do actually flying planes. They work with engineers before the flight and are often called upon to make suggestions to improve a plane's design during its development phase based on the results of their test flights. You need to be able to understand and use the correct terminology in oral and written reports and engineering papers."
    },
    {
      "title": "Go to test pilot school, or join the military.",
      "content": "Go to test pilot school, or join the military. At this point, being a professional pilot and an aeronautical engineer you stand an excellent chance of obtaining a pilot slot in the Marines, Navy, or Air Force. Just be aware that the cut-off age for military pilot entrance is typically 27 years. While at your university you should be in communication with local officer recruiters and be sure to fulfill their criteria - which typically includes GPA requirements as well as physical fitness tests (being able to pass the naval flight physical is a must if entering the Marines or the Navy). Going the civilian route is more difficult. A test pilot certificate from the National Test Pilot School costs around $500,000. For the average person still deep in college debt this is impossible. To become a purely civilian test pilot you must find a company to sponsor your entrance into test pilot school. Be on your best behavior, be sociable, and never burn bridges because the aviation community is a very small place. Network as much as possible and make sure you cultivate the image of a determined, safe, and brilliant pilot and eventually you will find the connection and sponsorship you are looking for. Go to conventions where you can meet other pilots in the industry - including test pilots. Shake hands, talk goals, and exchange email addresses. These connections are extremely valuable and can give you tips on company openings and requirements in order to land a seat at test pilot school."
    }
  ]
}