{
  "url": "https://www.wikihow.com/Anything-but-a-Cup-Ideas",
  "title": "72 Anything but a Cup Container Ideas (& 5 Drink Recipes to Try)",
  "steps": [
    {
      "title": "Bring an item that’s questionable to drink out of.",
      "content": "Bring an item that’s questionable to drink out of. Any item that isn’t supposed to hold party punch is up for grabs—even if it’s a little strange to drink out of. Buy it new if it has touched something harmful to consume (like a gas jerry can or a toilet plunger). If your item is porous (like a boot or bra), tape a plastic bag inside it to hold your drink.The following items can be considered: New gas jerry can New potty training chair Zip-top plastic bag Small toy guitar or ukulele Balloon Frisbee Watering can New foot spa Fake blood bag New multi-purpose sprayer New toilet plunger Plastic party hat Pet water bowl Spray bottle Traffic cone Camera zoom lens Shoe or boot Plastic sand castle mold Empty lightbulb Humidifier/dehumidifier Fish bowl or tank New mop bucket Bra cup Squirt gun Small trash can Bird or hummingbird feeder"
    },
    {
      "title": "Carve out the middle of a fruit to pour your drink into.",
      "content": "Carve out the middle of a fruit to pour your drink into. Bring the vacation to the party by creating your own pineapple or coconut glass. An hour before you go, cut a hole in the top of one of the fruits below to use as your beverage container. Not only is it convenient, but it might infuse your drink with a little delicious fruity goodness. Pineapple Coconut Cantaloupe Watermelon Dragonfruit Honeydew"
    },
    {
      "title": "Pick an unusual drinking vessel that no one will expect.",
      "content": "Pick an unusual drinking vessel that no one will expect. Glasses and cups are things of the future—try reaching into the past for something to hold your drink, like a replica Viking-style drinking horn. You can also use a different drink holder that might seem a little extreme to bring to a party, like a canteen or a water backpack. Flask Viking-style drinking horn Water bottle Canteen Water backpack"
    },
    {
      "title": "Carve out the top of a hollow plastic toy.",
      "content": "Carve out the top of a hollow plastic toy. Another fun idea that might get some laughs is to take a plastic or rubber toy that already has air in the center of it. Use a box cutter to carefully cut a hole in the top that’s large enough to pour your drink into (and drink out of), then you have your glass! Large rubber duck Plastic skull Plastic basketball Large dinosaur Toy truck Baby doll"
    },
    {
      "title": "Grab a vessel from your kitchen, bathroom, or living room.",
      "content": "Grab a vessel from your kitchen, bathroom, or living room. You probably already have a hilarious container to use just sitting around your home—anything that can hold your drink is up for grabs. Just make sure to wash it with soap and water if it usually holds something that might be gross to drink, like a soap dispenser. Frying pan or pot Soap dispenser Mason jar Mortar and pestle Flower pot Jewelry box Bowl Wax warmer Plastic storage container Salad spinner Rice cooker Coffee pot Baby bottle Teapot Flower vase"
    },
    {
      "title": "Reduce, reuse, and recycle an object to drink out of.",
      "content": "Reduce, reuse, and recycle an object to drink out of. If you can’t think of anything else to bring to the party, why not bring something you were already going to throw away? Shampoo, conditioner, sunscreen, or condiment bottles can be super funny to bring, but any glass or plastic container works as long as you wash it out completely first. Milk carton Queso or salsa jar Cookie dough tub Laundry detergent container Soup can Glass alcohol bottle Plastic coffee tin Candle jar Sunscreen bottle Plastic paint palette Shampoo or conditioner bottle Bear-shaped honey bottle Prescription pill bottle Ketchup or mustard bottle"
    },
    {
      "title": "Blue Hawaiian party punch",
      "content": "Blue Hawaiian party punch This refreshingly blue punch is perfect for any spring or summer party. All you need to do is add all the ingredients below to a large bowl or pitcher, then chill it in the fridge. Add ice, then serve with a ladle so your guests can serve themselves. If you’d like, add maraschino cherries on top for a little garnish! [1] X Research source 8 c (1.9 L) Blue Hawaiian Punch Polar Blast Juice or blue raspberry Kool-Aid 1 c (0.24 L) pineapple juice 1 c (0.24 L) vodka 1 ⁄ 2 c (0.12 L) white or coconut rum"
    },
    {
      "title": "Ethiopian party punch",
      "content": "Ethiopian party punch This incredible fruit cocktail punch came from an Ethiopian Kwanzaa celebration and has a sweet and sour taste that your guests will love. Mix all the liquids listed below in a pitcher or bowl, then chill it in the fridge. Before the guests arrive, add ice and the sliced lemons for garnish. [2] X Research source 1 c (0.24 L) cherry juice 1 c (0.24 L) strawberry syrup 1 c (0.24 L) orange juice 1 c (0.24 L) lemon juice 1 c (0.24 L) grape juice 2.5 US qt (2.4 L) carbonated lemon-lime drink (like Sprite) 2 lemons, thinly sliced"
    },
    {
      "title": "Watermelon margaritas",
      "content": "Watermelon margaritas Try this delicious frozen watermelon margarita if you’re having a smaller party. Combine the Triple Sec, tequila, lime juice, and sugar in a pitcher. Pour 1 ⁄ 4 c (59 mL) of the mixture in a blender with chopped watermelon, then strain, mix it back into the rest of the pitcher, and serve! [3] X Research source 3 c (0.71 L) Triple Sec or orange liqueur 2 to 3 c (0.47 to 0.71 L) tequila 1.5 c (0.35 L) freshly squeezed lime juice 1 cup (115 g) powdered or superfine sugar 5 cups (805 g) chopped seedless watermelon 10 to 11 lime wedges for garnish"
    },
    {
      "title": "Pitcher mojitos",
      "content": "Pitcher mojitos This drink is a little fancier, but it’s super tasty. Place the mint leaves and sugar in the pitcher, then muddle (or lightly mash) them together with a wooden pestle or spoon. Add the limes, then muddle the mixture again and add the rum. Pour in the club soda, stir until the sugar dissolves, then add ice and serve! [4] X Research source ½ cup (100 g) white sugar About 36 fresh mint leaves 3 medium limes, quartered 1 c (0.24 L) rum 1 L (4.2 c) club soda"
    },
    {
      "title": "Coquito (Puerto Rican eggnog)",
      "content": "Coquito (Puerto Rican eggnog) If you’ve got a holiday-themed ABC party coming up, you’re in for a real treat. In a large blender, combine all the cans plus the rum, vanilla, and cinnamon. Blend until frothy, then cover and chill it for 4 to 24 hours. Once the party gets started, serve the mixture with cinnamon sticks for garnish. [5] X Research source 1 114 oz (7.1 lb) can cream of coconut 1 114 oz (7.1 lb) can unsweetened coconut milk 1 114 oz (7.1 lb) can sweetened condensed milk 1 112 oz (7.0 lb) can low fat evaporated milk 3 ⁄ 4 c (0.18 L) dark rum 1 US tbsp (15 mL) vanilla 2 tsp (2.6 g) ground cinnamon 8 cinnamon sticks for garnish"
    },
    {
      "title": "It’s a themed party where you bring any container other than a cup.",
      "content": "It’s a themed party where you bring any container other than a cup. An “Anything But a Cup” (or ABC) party is where guests are asked to bring any drinking vessel that you wouldn’t traditionally drink alcohol out of, like a red plastic cup. This adds a unique twist to your party that all your guests can participate in—plus, it’s super fun to see what everyone brings! [6] X Research source To incentivize guests to pick creatively, hold a contest and have everyone vote on who brought the funniest drinking vessel. Some parties ask guests to bring their own beverages, too. If you’re hosting a party, clarify whether they should provide their own drinks. For even more fun, try mixing this theme with seasonal themes. For example, you could have a Halloween party where everyone has to incorporate their container into their costume."
    }
  ]
}