{
  "url": "https://www.wikihow.com/Add-LinkedIn-to-Resume",
  "title": "Add LinkedIn to a Resume: Customize Your URL & Show Your Skills",
  "steps": [
    {
      "title": "Go to https://www.linkedin.com and sign in.",
      "content": "Go to https://www.linkedin.com and sign in. Before you add your LinkedIn profile URL to your resume, you'll want to make sure your resume isn't a messy series of letters and numbers. Start by opening LinkedIn on your computer, Android, iPhone, or iPad."
    },
    {
      "title": "Click Me (computer) or tap your profile picture (mobile app).",
      "content": "Click Me (computer) or tap your profile picture (mobile app). The \"Me\" button with your profile picture is on the right side of the page on your computer while the mobile app displays your profile picture on the left side of your screen. [1] X Research source"
    },
    {
      "title": "Click or tap View profile.",
      "content": "Click or tap View profile . This will redirect you to your profile."
    },
    {
      "title": "Navigate to your profile URL.",
      "content": "Navigate to your profile URL. Getting here varies slightly depending on your platform: [2] X Research source For computers, click Edit public profile & URL on the far right side of the screen, then click the pencil icon in the \"Edit your custom URL\" tile. [3] X Research source In the mobile app, tap the three-dot menu icon (it's to the right of \"Open to\" and \"Add section\") and tap Contact info . Tap the pencil icon next to the \"Contact\" header then tap your current public profile URL. When the next page opens, tap the pencil icon in the \"Edit your custom URL\" tile."
    },
    {
      "title": "Edit your name.",
      "content": "Edit your name. Remove the random letters and numbers that appear in your URL. You want to look professional, not spammy. [4] X Research source To appear straight-foward you can use your name, but if you have a more common name try adding your current profession to the URL, like \"jane-doe-developer.\""
    },
    {
      "title": "Click or tap Save.",
      "content": "Click or tap Save . You can use this (without the \" https://www \" ) to paste to your resume. [5] X Research source Get the URL by going to your LinkedIn profile and copying it from the address bar."
    },
    {
      "title": "Add your LinkedIn Profile URL in your header with your contact information.",
      "content": "Add your LinkedIn Profile URL in your header with your contact information. A resume should have contact information, like your email and phone number, so this is where you should insert your LinkedIn profile URL. Use this method if your LinkedIn profile has recently been updated or polished and your profile URL is customized. There's nothing more embarrassing than including an unfinished or out-of-date LinkedIn profile URL on your resume and then having hiring managers point it out."
    },
    {
      "title": "Leave out the \"https://www\" portion of your URL.",
      "content": "Leave out the \"https://www\" portion of your URL. Not only does this save space, but also entering the shortened version into the address bar of a browser works just as well as using the longer version with \" https://www .\" If your resume is digital (meaning it's not printed on paper) make it a hyperlink . In that case, the person can click the link to visit your LinkedIn profile. On the other hand, don't hyperlink the text if the resume is going to be printed. A hyperlink that's printed out will appear in a bright blue text that's distracting. If the job is mobile, consider putting a QR code instead so the hiring manager can use that instead."
    },
    {
      "title": "Consider using a LinkedIn logo.",
      "content": "Consider using a LinkedIn logo. You can very easily find LinkedIn logos online that you can download and later insert into your resume! Make sure it's not too big, but not too small to see either."
    },
    {
      "title": "A summary.",
      "content": "A summary. This allows you to show off your strengths and weaknesses that your resume can't verbalize. A summary allows you to summarize yourself, your life and career goals, and tell people why you're the best for any job. [6] X Research source"
    },
    {
      "title": "A headline.",
      "content": "A headline. It's the one-liner at the top of your profile. Think of this as your 10-second elevator pitch."
    },
    {
      "title": "Recommendations.",
      "content": "Recommendations. These are references from others for your work and show hiring managers that your skills can be vouched for. You can request recommendations from clients, professors, coaches, peers, and subordinates. [7] X Research source"
    },
    {
      "title": "Skills.",
      "content": "Skills. You want to show off what you can do, right? So add your skills ]."
    },
    {
      "title": "Samples.",
      "content": "Samples. What's better than listing a set of skills? Showing them off. Here, you can show off the skill that you previously added."
    }
  ]
}