{
  "url": "https://www.wikihow.com/Charge-a-Lawn-Mower-Battery",
  "title": "How to Charge a Lawn Mower Battery",
  "steps": [
    {
      "title": "Protect yourself with gloves, glasses, and proper ventilation.",
      "content": "Protect yourself with gloves, glasses, and proper ventilation. [1] X Research source While working with batteries, sparks and electrical mishaps are a possibility. To stay safe, wear thick, rubber mechanic’s gloves. Keep metal (jewelry, tools, etc.) away from your workstation. Look out for signs of damage to your mower before you start working. Stop and call a professional if you notice signs of battery damage, such as: [2] X Research source Frayed connections A bloated, warped, or bulging battery Cracks in the battery's casing"
    },
    {
      "title": "Use a 12-volt (V) charger with no more than 10 Amp-hours (Ah).",
      "content": "Use a 12-volt (V) charger with no more than 10 Amp-hours (Ah). Check your lawn mower battery's label to determine its voltage (older models may be 6V). Then, make sure the charger you use is a 12V charger. Next, check your charger's Amp-hours. To charge lawn mower batteries, this should never be set above 10Ah. Note that some newer battery chargers may have adjustable Amp-hours. [3] X Research source"
    },
    {
      "title": "Find the battery under the seat or hood of your lawn mower.",
      "content": "Find the battery under the seat or hood of your lawn mower. Lift the seat of your machine to find your battery in standard lawn mowers. If it’s not there, consult your lawn mower’s manual. If you don’t have your manual, check online with your mower’s manufacturer. Luckily, you can charge your battery without removing it from your mower—so, go ahead and leave it in place. [4] X Research source"
    },
    {
      "title": "Connect the positive clamp then the negative clamp to the battery.",
      "content": "Connect the positive clamp then the negative clamp to the battery. First, unplug your charger from the wall socket. Next, identify the positive terminal on your battery (signified by the color red, a “+”, “P”, or “Pos”). Connect your positive clamp to this terminal. Find the negative terminal, identified by the color black, a “-”, “N”, or “Neg”. Now, connect your black clamp to the negative terminal. [5] X Research source"
    },
    {
      "title": "Plug your charger into the wall until the battery is finished charging.",
      "content": "Plug your charger into the wall until the battery is finished charging. Note the time when you plug your charger into the wall. After ~1 hour (and longer for lower Ah) or when the battery has fully charged, unplug the charger from the wall. Depending on your charger, it may shut off automatically or have a full charge indicator. [6] X Research source For older batteries, use an hour as a rule of thumb. Overcharging can damage your battery and cause dangerous fumes to leak. So, if your charger isn't automatic, it's especially important to unplug on time."
    },
    {
      "title": "Unplug the charger and remove the charger’s cables from the terminals.",
      "content": "Unplug the charger and remove the charger’s cables from the terminals. If you use a lead-acid battery, wait 5 minutes after unplugging your charger before removing your clamps from your terminals. Unclamp from the negative terminal first and then the positive terminal. [7] X Research source"
    },
    {
      "title": "Use jumper cables only if your lawn mower has a 12V battery.",
      "content": "Use jumper cables only if your lawn mower has a 12V battery. If you don’t have a charger handy, this method can help—but look over your battery carefully first. Your lawn mower probably uses a 12V, but if it doesn’t, you risk doing major electrical damage to your battery. Larger trucks may also send currents larger than 12V, so check your car's battery prior to charging too. [8] X Research source Be aware that sparking, shocks, and explosions are all unlikely, but possible. Make sure to wear thick gloves and use protective glasses. If you’re able, opt for a battery charger instead. [9] X Research source"
    },
    {
      "title": "Park your lawn mower and car near each other on level ground.",
      "content": "Park your lawn mower and car near each other on level ground. Turn off your mower’s ignition and engage the parking brake. Position your car directly behind it, so the hood is nearest to your mower. Open the hood of your car. Then, expose your lawn mower battery, by lifting the seat, for example. [10] X Research source Before you proceed, remove tripping hazards from your area. Locate jumper cables. To use jumper cables, you'll need both ends to comfortably reach the lawn more and car battery at once. Before moving on, check that your vehicles are close enough to do this."
    },
    {
      "title": "Connect your cables to your mower's positive terminal, then your car's positive terminal.",
      "content": "Connect your cables to your mower's positive terminal, then your car's positive terminal. To begin, locate the positive terminals on your mower and car (these will be signified by the color red, a “+”, “pos”, or “P”). Attach your jumper cable’s red clamp onto the lawn mower battery. Next, take the clamp on the other side of the same cable and attach it to your car’s positive battery terminal. [11] X Research source Before moving on, check to make sure both connections are tight and secure."
    },
    {
      "title": "Connect your black jumper cable clamp to your car’s negative terminal.",
      "content": "Connect your black jumper cable clamp to your car’s negative terminal. A negative terminal will be signified by the color black, “N”, “Neg”, or “-”. As you're placing your clamp, stay away from the positive terminal. Bumping the positive terminal with your negative cable could cause a damaging or dangerous surge of electrical currents. Then, double-check that your negative clamp is securely fastened. [12] X Research source"
    },
    {
      "title": "Connect your last black clamp to the lawn mower’s metal frame.",
      "content": "Connect your last black clamp to the lawn mower’s metal frame. Locate the jutting metal piece on the back of your mower, called the hitch. Or, choose another metal extremity that’s far away from your fuel tank and battery. Connect your negative clamp to this metal piece. [13] X Research source This helps ground the electrical circuit. Because sparks can occur when attaching that last clamp, you want this to happen far from flammable hydrogen gas. So to be safe, hook your final clamp to your mower’s metal frame instead."
    },
    {
      "title": "Start your car and let it run for 5 minutes.",
      "content": "Start your car and let it run for 5 minutes. First, check that your lawn mower is turned off. Then, to bring your mower’s battery back to life, turn your car on. It can take the battery up to 30 minutes to fully charge, so wait ~5 minutes before trying your mower. After you've given the battery time to juice up, turn your lawn mower on as well. [14] X Research source As you turn your mower on, expect to see a few sparks. If your jumpstart worked, you’ll hear the lawn mower’s engine turn over. If this doesn’t work right away, give your mower a few more minutes to charge."
    },
    {
      "title": "Disconnect the cables from the negative terminals and then the positive terminals.",
      "content": "Disconnect the cables from the negative terminals and then the positive terminals. Leave your mower and car running while you unhook each clamp in the opposite order to how you initially hooked them. So first, remove the negative cable from your lawn mower’s hitch. Then, unhook your second negative end, then the positive cable attached to your car, and finally, unhook your positive cable attached to your mower. [15] X Research source As you're disconnecting your clamps, make sure you set them where they won’t come into contact with other metal. Once you’re done disconnecting, drive your lawn mower around for ~30 minutes. This will recharge your battery. [16] X Research source"
    }
  ]
}