{
  "url": "https://www.wikihow.com/Color-Hair-With-Food-Coloring",
  "title": "How to Color Hair With Food Coloring",
  "steps": [
    {
      "title": "Lighten or bleach your hair, if needed.",
      "content": "Lighten or bleach your hair, if needed. Food coloring is translucent. This means that it only adds to whatever color is already there. If you have dark hair, the dye may not show up at all. If you have light brown or brown hair, the dye will turn out darker. If having a darker tint does not bother you, then you can skip this step. Be aware that blue may turn out greenish on blond hair, and brownish on brassy hair. If this bothers you, tone your hair to a more neutral color."
    },
    {
      "title": "Protect your work space.",
      "content": "Protect your work space. Find a place that is easy to clean, such as a kitchen or bathroom. If the area is carpeted or hard to clean, spread some newspaper or a large, plastic sheet over the floor. Have all of your supplies laid out and ready."
    },
    {
      "title": "Put on a set of old clothes and plastic or vinyl gloves.",
      "content": "Put on a set of old clothes and plastic or vinyl gloves. If you don't have any old clothes that you don't mind ruining, put on a dark colored shirt instead. It would also be a good idea to wrap a hair dyeing smock or an old towel around your shoulders. If you want, you can buy a nylon cape, like the kind used in salons, from a beauty store. This will protect your clothing."
    },
    {
      "title": "Squeeze white conditioner into a plastic bowl or container.",
      "content": "Squeeze white conditioner into a plastic bowl or container. You will need enough conditioner to cover your hair, at least 2 tablespoons (30 milliliters). Avoid using colored conditioner, as it might affect the color of the dye. You can try a white-colored hair cream or gel. For a permanent option, use 2 tablespoons (30 milliliters) of developer instead. [1] X Research source"
    },
    {
      "title": "Add some food coloring.",
      "content": "Add some food coloring. How much you use depends on how dark you want the color to be; the more food coloring you use, the deeper the color will be. Keep in mind that the color will turn out lighter than what's in the bowl. Be sure to use regular liquid or gel food coloring; do not use vegetable-based dyes as they won't adhere to your hair. [2] X Research source For a permanent option, mix 1 tablespoon of food coloring into the developer. [3] X Research source"
    },
    {
      "title": "Adjust the dye color to neutralize yellow or brassy tones, if needed.",
      "content": "Adjust the dye color to neutralize yellow or brassy tones, if needed. If you lightened your hair earlier, you may be left with yellow or brassy tones. This may affect the outcome of your dye job. If you have yellow or brassy tints in your hair, add some purple or blue to your dye to cancel out the unwanted color. You can also mix up a separate pale blue (for brassy tints) or pale purple (for yellow tints) dye, and use that in your hair first. After you wash and dry your hair, you can dye it the color you want."
    },
    {
      "title": "Divide your hair into sections.",
      "content": "Divide your hair into sections. Plan on having at least four sections. This will make dyeing your hair easier. If you plan on dyeing your hair multiple colors, then divide your hair into sections based on the colors that you want to dye."
    },
    {
      "title": "Apply the dye to your hair, starting from the roots.",
      "content": "Apply the dye to your hair, starting from the roots. You can do this with your hands or a special applicator brush made for hair dye. [4] X Research source Be sure to work the dye into your hair. Don't let the dye create suds, as this can dilute the dye and make it less effective. If you want highlights , apply the dye to thin sections of hair. Wrap each section with plastic wrap or aluminum foil to keep it separate. Don't dye all of your hair. Another way to add highlights would be to poke holes into a shower cap, put the shower cap on, the pull strands of hair through the holes. You can even use frosting caps for this purpose."
    },
    {
      "title": "Tuck your hair under a shower cap.",
      "content": "Tuck your hair under a shower cap. If you need to, twist your hair into a bun, then secure it with a claw clip. Leave it there for up to 2 hours. [5] X Research source If you don't have a shower cap, try plastic wrap or a plastic bag. Secure it with plastic hair clips."
    },
    {
      "title": "Leave the product in your hair for 30 minutes to 3 hours.",
      "content": "Leave the product in your hair for 30 minutes to 3 hours. The longer you leave the dye in your hair, the deeper the color will become. Keep in mind that the lighter your hair is, the faster the color will set. If you are using a developer for a more permanent option, let it sit for about 40 minutes. [6] X Research source The longer you leave the dye in your hair, the deeper it will be. If you want a lighter color, leave it on for a shorter period of time. A 10-volume developer could be used in this dilution, but this would only yield a semi-permanent result. If your hair was pre-lightened with dye formula prior to the peroxide, the formula must be adjusted—3 hours could cause damage to fine, damaged, or high-porosity hair. (In general, proceed with caution when leaving the product on for longer than 45 minutes). Alternatively, rinse out the 10-volume peroxide formula after 45 minutes, towel-dry your hair, reapply as a direct dye with the conditioner and dye solution, and then leave on for another 2-3 hours with the cap if your desired depth isn't achieved with the peroxide."
    },
    {
      "title": "Consider doing a strand rinse test.",
      "content": "Consider doing a strand rinse test. This is only really necessary if you are going for a specific shade, or if this is your first time dyeing your hair with food coloring. Take a strand of hair from an inconspicuous area, and rinse it. If the color is too light, leave the dye on longer. If it just right, move on to the next step. [7] X Research source"
    },
    {
      "title": "Wash the dye out with cool water.",
      "content": "Wash the dye out with cool water. This will seal the hair's cuticle and preserve the color. You can do this over the sink or in the shower. Don't use shampoo and conditioner, however, or it will remove the color. If you dyed your hair multiple colors, keep the dyed sections separate."
    },
    {
      "title": "Blow-dry your hair on a low setting.",
      "content": "Blow-dry your hair on a low setting. You can also towel dry your hair then let it air dry. Make sure that you use an old towel, however, as some of the dye may rub off."
    },
    {
      "title": "Take care of your dyed hair.",
      "content": "Take care of your dyed hair. If you used conditioner, avoid washing your hair for 3 to 5 days. This will help the color set. It would also be a good idea to sleep on colored (preferably dark) pillow cases to avoid staining. Temporary dye jobs will start to fade with each wash. They should last about 2 weeks total, depending on the color and your hair type. [8] X Research source Some dye jobs may come out after only 2 to 3 washes. Permanent dye jobs will last about 3 weeks before they start to fade. [9] X Research source"
    }
  ]
}