{
  "url": "https://www.wikihow.com/Become-a-Flight-Attendant-for-Air-Canada",
  "title": "How to Become a Flight Attendant for Air Canada",
  "steps": [
    {
      "title": "Meet basic requirements.",
      "content": "Meet basic requirements. If you aren’t already, wait until you are 18 years old or over. Earn your high school diploma. If you didn’t finish high school, complete equivalent coursework to obtain a general education diploma (GED). [1] X Research source Visit https://www.gprc.ab.ca/files/forms_documents/GED_Test_Hints_Newsletter.pdf for contact information for your local GED testing center."
    },
    {
      "title": "Obtain a Canadian passport.",
      "content": "Obtain a Canadian passport. Visit https://www.canada.ca/en/immigration-refugees-citizenship/services/canadian-passports/new-adult-passport.html to fill out and print an application. Make copies of all required documentation. Obtain two copies of a passport photo. Have a guarantor fill in and sign the appropriate section of the application, as well as all copies of your documentation and one passport photo. In addition to your guarantor, ask two other people to be cited as your references on your application. Completed applications can be submitted by mail or in person at Service Canada or Canada Post. Documentation, passport photos, and fees must be included with your application. Visit https://www.canada.ca/en/immigration-refugees-citizenship/services/canadian-passports/new-adult-passport.html for more information about current fees and payments methods, acceptable documents, eligibility for guarantors and references, and mailing addresses."
    },
    {
      "title": "Become fluent in more than one language.",
      "content": "Become fluent in more than one language. At the very least, master either English or French (preferably both). Additionally, learn at least one other language used by countries that Air Canada flies to regularly. Sought-after languages include: [2] X Research source Arabic Cantonese Danish Dutch German Greek Hebrew Hindi Italian Japanese Korean Mandarin Portuguese Punjabi Spanish Turkish"
    },
    {
      "title": "Prepare to meet additional requirements.",
      "content": "Prepare to meet additional requirements. Due to the physical demands of the job, expect to have your physical health evaluated during the application process. Make sure you are in adequate shape in order to perform required tasks. Additionally, be aware that, if hired, you will have to apply for security clearance through Transport Canada. [3] X Research source As a flight attendant, you will be expected to lift luggage and equipment; physically assist passengers; have strong footing and balance; be able to stand and work for long periods; be able to work at high altitudes and in a pressurized environment. For more information on Transport Canada’s security clearance, visit https://tc.canada.ca/en/programs/non-funding-programs/transportation-security-clearance-program/transportation-security-clearance-program-aviation/transportation-security-clearance-program-aviation ."
    },
    {
      "title": "Plan to move if needed.",
      "content": "Plan to move if needed. You can apply for a position regardless of where you currently live. However, if you don’t already live within 90 minutes of an airport serviced by Air Canada, start considering which areas you are able to move to. Expect to be required to live nearby in order to report promptly to changes in scheduling. Cities include: Calgary Deer Lake Edmonton Goose Bay Montreal Sept-Iles St. John’s Toronto Vancouver Whitehorse Yellowknife"
    },
    {
      "title": "Look for open positions.",
      "content": "Look for open positions. Regularly check Air Canada and Air Canada Rouge’s websites for job postings. Filter your search by location and position to narrow down your search. [4] X Research source For Air Canada, visit https://aircanada.taleo.net/careersection/flighte/jobsearch.ftl?lang=en&radiusType=K&searchExpanded=true&radius=1&jobfield=21840181102# ."
    },
    {
      "title": "Submit an online application.",
      "content": "Submit an online application. On the appropriate website, follow all prompts to create a user profile. Answer the following questionnaire as directed. Upload your resume and cover letter when prompted. Sign up for emails about new job postings in case someone else is hired for the current opening. Save your profile for future use and update it as needed. [5] X Research source For Air Canada, create or edit your user profile by clicking the “Create/Edit Profile” on the job listings page. For Air Canada Rouge, click “Join Now/Sign In” on their job search page."
    },
    {
      "title": "Wait to be contacted.",
      "content": "Wait to be contacted. First, check your email for a confirmation that your application was successfully submitted. After that, wait for a phone call. If they decide to consider you for the position, expect a recruiter to call and conduct the first interview over the phone. [6] X Research source Only candidates who are considered will be contacted by phone, so if you don’t receive a call, apply for a new position. If your phone interview is a success, your recruiter will provide information regarding additional interviews, events, and training."
    },
    {
      "title": "Look sharp.",
      "content": "Look sharp. Expect your appearance to be taken into consideration. For any in-person interviews or events, groom yourself beforehand. Exact on-the-job requirements regarding appearance will be detailed in training once you are hired, but anticipate a general desire for cleanliness and neatness. Check images of flight attendants posted on Air Canada and Air Canada Rouge’s websites. Model yourself according to their dress, hairstyle, and grooming."
    },
    {
      "title": "Play up past service experience.",
      "content": "Play up past service experience. If you have already worked as a flight attendant, lead with that. If not, emphasize any previous employment that you might have in a similar service industry. Remember: even though a plane is a unique environment, your role as flight attendant is pretty similar to any on-the-ground job that involves keeping customers happy. Such jobs could include sales, food and hospitality, or customer service. Be sure to mention any that involved working with children, which is a highly prized skill for flight attendants."
    },
    {
      "title": "Respond to key concerns.",
      "content": "Respond to key concerns. Remember that, as a flight attendant, you will be working as part of a crew in a unique environment where safety is a top concern. Emphasize your positive attitudes toward teamwork and safety. When discussing your prior work experience, highlight initiatives and other strong points touching on these areas: [7] X Research source Maintaining a courteous demeanor regardless of the situation. Adapting to new situations quickly as they occur. Communicating effectively with fellow staff and customers. Maintaining a safe work environment."
    }
  ]
}