{
  "url": "https://www.wikihow.com/Change-the-Batteries-in-Your-Smoke-Detector",
  "title": "How to Change the Batteries in Your Smoke Detector",
  "steps": [
    {
      "title": "Check the battery type.",
      "content": "Check the battery type. Installing the new batteries incorrectly, or using the wrong type, will cause your smoke detector to not function. Always make sure you are using the correct type of battery and installing the batteries correctly to ensure the detector will work. [1] X Research source Detectors that use lithium batteries will last for ten years. You generally cannot replace the battery, instead, replace the entire detector after its ten year life span is expired. Many detectors will make use of a 9v battery. However, some may require different types of batteries. Use high quality, long lasting batteries. Using rechargeable or low quality batteries may cause your smoke detectors to fail."
    },
    {
      "title": "Remove the smoke detector.",
      "content": "Remove the smoke detector. You will have to take your smoke detector down from its mounting on the ceiling. If your detector is hard-wired into your house's power system, you should turn the power off at the fuse box first. [2] X Trustworthy Source National Fire Protection Association Nonprofit organization devoted to eliminating death, injury, property and economic loss due to fire, electrical and related hazards. Go to source The method you use to remove your smoke detector from its mounting will vary depending on which model it is. Most smoke detectors are removed by twisting or sliding the detector away from the mounting. Some detectors will not require you remove the entire detector. These models require that you remove only the section that covers the internal components and battery. Not all hard-wired smoke detectors will have a backup battery."
    },
    {
      "title": "Open the battery compartment and install the new battery.",
      "content": "Open the battery compartment and install the new battery. To access the battery, you will have to remove the cover that contains it. Exactly where the battery is located, and how it is secured, will vary from model to model. Generally, once you remove the cover of the detector, you will be able to see where the battery is located without trouble. [3] X Trustworthy Source National Fire Protection Association Nonprofit organization devoted to eliminating death, injury, property and economic loss due to fire, electrical and related hazards. Go to source The location of this cover will vary from model to model, and some may be secured with a screw or other fastening. Most coverings will slide off and away from the smoke detector's body. Once open, you can remove the old battery or batteries. Make sure you install the new batteries correctly. Check that the negative and positive connections are matching the labels on the smoke detector Close the battery cover. Check your manual for the smoke detector if you are having trouble locating or removing the battery. If you don't have the physical copy of the manual, you may be able to find it online, at the manufacturers website."
    },
    {
      "title": "Test the batteries.",
      "content": "Test the batteries. Before you reinstall the smoke detector, you will want to make sure that the batteries are working properly. Locate and utilize the button on your smoke detector that will test the batteries. [4] X Trustworthy Source National Fire Protection Association Nonprofit organization devoted to eliminating death, injury, property and economic loss due to fire, electrical and related hazards. Go to source The location of the test button will vary. Most test buttons require you to press the button for a few seconds to engage the test. If successful, the alarm will sound."
    },
    {
      "title": "Double check if the test fails.",
      "content": "Double check if the test fails. If the alarm doesn't sound during the test of the batteries, you will need to recheck them. Never reinstall your smoke detector until it passes this battery test and has demonstrated that it is functioning properly. [5] X Research source Check to see if the batteries are installed correctly. Make sure the positive and negative terminals are matching the correct terminals in the smoke detector. If the batteries are installed correctly, and the test failed, replace the batteries and try again with new ones. If no new batteries are working, your detector may need replacing. You may want to contact the manufacturer, as they may replace the detector if it is under warranty. Some alarms have an LED-light that will indicate if the alarm is working properly. Generally a green light indicates that the alarm is working properly, a red light indicates an issue."
    },
    {
      "title": "Review your smoke detector's instruction manual.",
      "content": "Review your smoke detector's instruction manual. If you still have the manual, review the information to help you better understand your model of smoke detector and to properly maintain its functionality. Finding where the battery is located, and how to access it, can vary from model to model. The manual may also indicate which type of battery is required by your smoke detector. Don't throw the manual away. Keep it in a place that you can store it safely and still access it when needed."
    },
    {
      "title": "Turn off power to your wired smoke detector.",
      "content": "Turn off power to your wired smoke detector. Wired smoke detectors are connected directly into the power supply of your house, which is sometimes also called the mains. The battery in these detectors is intended to power the alarm in the event of a power outage. To cut power to your wired smoke detector, you'll have to press the circuit breaker in your home circuit box. This should turn turn the circuit from \"ON\" to \"OFF.\" [6] X Trustworthy Source National Fire Protection Association Nonprofit organization devoted to eliminating death, injury, property and economic loss due to fire, electrical and related hazards. Go to source Many homes with hard wired circuit breakers will have a breaker specifically labeled for smoke alarms. However, if you do not have a labeled breaker and cannot determine which circuit your detector is on, you can press the main breaker to cut all power to your house, including the smoke alarm. Wired smoke detectors frequently have a small green light that indicates it is receiving power from the mains. When this light turns off, you know the power to the alarm circuit has been cut. Cutting the power to your wired smoke alarm might seem excessive, but this extra precaution will prevent accidental shocks. This can be especially important when dealing with old or excessively dirty smoke detectors."
    },
    {
      "title": "Remove the cover of your smoke detector.",
      "content": "Remove the cover of your smoke detector. Depending on the kind of smoke detector in your home, there are many different ways you might have to remove the cover for your detector. These covers are relatively simple, so through trial and error you should be able to get the cover off in less than a few minutes, though a manual might speed this process. Some common covers include: [7] X Trustworthy Source National Fire Protection Association Nonprofit organization devoted to eliminating death, injury, property and economic loss due to fire, electrical and related hazards. Go to source Push-lock covers. These covers usually have a small, plastic lock that can only be opened by pushing on a specific point indicated on your fire alarm. Look for an arrow indicating the point you need to push, and use a thin screwdriver or pen to release the push-lock. Twist-lock covers. To unfasten these you'll have to twist the cover (usually counterclockwise), or in some cases, push upwards and twist. Hold the alarm as you remove this kind of cover. Once the lock is undone, the cover will fall downwards. Friction-lock covers. These covers are held in place by the friction of a plastic locking mechanism on the inside of your detector. These can often be popped loose by prying the cover free with your fingers using firm, moderate-light pressure."
    },
    {
      "title": "Replace the battery.",
      "content": "Replace the battery. Generally, most smoke detectors use a 9-volt battery for power, though you should always follow the directions that came in your smoke detector manual. Be sure the battery is new so that it lasts the full ten-year life expectancy of most home smoke detectors. [8] X Research source You may want to take a felt tipped marker and use it to write the date you replaced the battery on the inside of the cover. This way, if you forget when you last replaced the battery, you can easily find out by checking the inside of your cover."
    },
    {
      "title": "Reattach the cover and test your smoke detector.",
      "content": "Reattach the cover and test your smoke detector. Use the opposite procedure you used to remove your smoke detector cover to fit it back into place. This will likely involve either twisting the cover clockwise or pressing it until the friction/push locks snap into place. Then you should return power to the circuit by pressing the same breaker you initially pressed to cut power. Once the cover is on, follow your smoke detector user manual to test your battery. Most smoke detectors have a button on the center of the cover. In many cases, to test your smoke detector, all you need to do is press this button for five seconds. You should hear a chirping noise if your battery is good and properly installed. If you find that, no matter how you fit your battery into place inside your smoke detector, the detector still will not give a test-chirp, try another battery. If this battery does not work, you may need to install a new smoke detector."
    },
    {
      "title": "Install a smoke detector to protect your property and life.",
      "content": "Install a smoke detector to protect your property and life. By installing a smoke detector and keeping it in working order, you will greatly increase your chances of saving your property and life in the event of a fire. By not having a functioning smoke detector, you are taking an unnecessary risk. [9] X Research source You increase your chances of property loss by 57% by not having a working smoke detector. Chances of injury increase by 26% if your smoke detector isn't functioning. By not having a smoke detector installed, you are four times more likely to die in a fire. Smoke alarms are not present in three out of five house fire deaths. A properly working smoke alarm will reduce the chance of death in a house fire by 50%."
    },
    {
      "title": "Learn about the different types of smoke detectors.",
      "content": "Learn about the different types of smoke detectors. There are two main types of smoke detector, both of which detect fires using different methods. It is recommended that you install both types in your home or find a model that functions as both in one. [10] X Research source The two types of smoke detectors are photoelectric and ionization based detectors. Photoelectric detectors use light to detect smoke, while ionization detectors utilize radiation sensors to register smoke. Some smoke detectors combine both photoelectric and ionization into one detector. There are special smoke alarms for the deaf or hard of hearing. These generally use a bright, flashing strobe light instead of an audible alarm. Certain smoke detectors can communicate with each other. If one is triggered, all detectors will sound their alarms."
    },
    {
      "title": "Know the cost of smoke detectors.",
      "content": "Know the cost of smoke detectors. A smoke detector is a great investment, and many types of smoke detectors are affordable. If you need to replace old detectors, or install new ones, knowing the price ahead of time can help you budget properly for a detector. [11] X Research source Ionization or photoelectric based detectors usually start at around $6. Models that include both ionization an photoelectric in one start at $24. Some detectors come with a microprocessor, for better and faster detection, and start at $30. Wireless smoke detectors start at $40."
    },
    {
      "title": "Learn where to place smoke detectors.",
      "content": "Learn where to place smoke detectors. You may have smoke detectors installed in your home, however, they may not be placed in ideal locations. Strategically installing your smoke detectors will increase their functionality, allowing them to alert you sooner in the event of a fire. [12] X Research source Install at least one smoke detector per floor in your home. [13] X Research source Bedrooms should have their own smoke detector installed. Any hallways that lead to bedrooms should also have their own detector installed. Most smoke detectors should be placed on the ceiling, as smoke rises. If this isn't an option, place the detector as high up on your wall as you can. Any directly wired smoke detector should be installed by a professional electrician to avoid improper installation."
    },
    {
      "title": "Maintain your smoke detector.",
      "content": "Maintain your smoke detector. Having a smoke detector installed is only the first step in fire safety. You will need to properly maintain your smoke detector in order to make sure you are protected by it. Perform regular checks and replacement of batteries to ensure your protection. [14] X Research source For any standard 9v battery powered detector, test monthly, replace the battery yearly, and replace the detector every ten years. For a long-life battery detector, test the alarm monthly and replace the detector according to your manufacturer's instruction. Most of these are built to last for ten years. For a detector that is directly wired into your homes electrical system, test it monthly and replace the detector every ten years. Replace the backup battery at least once a year. Dust or vacuum your smoke detectors to keep them functioning at their best."
    }
  ]
}