{
  "url": "https://www.wikihow.com/Block-off-a-Heating-Vent",
  "title": "How to Block off a Heating Vent",
  "steps": [
    {
      "title": "Measure the height and length of the vent.",
      "content": "Measure the height and length of the vent. To measure the height of the vent, measure from the bottom edge to the top edge. To measure the length, measure from the left edge of the vent to the right edge. [1] X Research source Write down the measurements you take so you don’t forget them."
    },
    {
      "title": "Buy a sheet magnet that’s at least as big as the vent.",
      "content": "Buy a sheet magnet that’s at least as big as the vent. Sheet magnets are thin, paper-like pieces of magnet that are often used to make bumper stickers or refrigerator magnets. You’ll need a piece that’s at least as big as your vent — if it’s smaller, it won’t work. [2] X Research source You can find a sheet magnet at your local arts and crafts store."
    },
    {
      "title": "Cut the sheet magnet so it's the same size as the vent.",
      "content": "Cut the sheet magnet so it's the same size as the vent. Use the measurements of the vent you took to mark where you’ll need to cut the magnet so it’s the same size as the vent. Then, use scissors to cut the piece of magnet from the sheet. [3] X Research source You can mark sheet magnet with pencil or pen. You can also use a utility knife to cut the sheet magnet if scissors aren’t working."
    },
    {
      "title": "Place the piece of sheet magnet over the vent.",
      "content": "Place the piece of sheet magnet over the vent. Hold the sheet magnet over the vent so all of the edges line up. Then, press the magnet onto the vent — it should easily stick to the vent. [4] X Research source To re-open the vent, all you need to do is pull off the sheet magnet."
    },
    {
      "title": "Unscrew the vent plate.",
      "content": "Unscrew the vent plate. The vent plate is the metal cover that goes over the vent opening. Use a screwdriver to remove the screws that are holding the vent plate in place, then pull the plate away from the vent opening. [5] X Research source If the vent is located on the ceiling, you may need to stand on a step ladder or chair to unscrew the vent plate."
    },
    {
      "title": "Measure the height and length of the grates.",
      "content": "Measure the height and length of the grates. The grates are the slots on the vent plate that allow air to pass through the vent. To measure the height of the section of grates, measure from the bottom of the grates to the top. To measure the length, measure from the outer edge of the leftmost grate to the outer edge of the rightmost grate. Write down the measurements you take so you have them for later."
    },
    {
      "title": "Cut a piece of plywood that’s the same size as the section of grates.",
      "content": "Cut a piece of plywood that’s the same size as the section of grates. Use the measurements you took earlier to mark the plywood where you’ll need to cut it. Then, use a saw, like a circular saw or hand saw, to cut out the piece of plywood. [6] X Research source If you don't have a saw, try taking your plywood to your local home improvement store and asking them to cut it for you. The thickness of the plywood doesn’t matter, as long as the plywood doesn’t have any cracks or holes in it."
    },
    {
      "title": "Tape the wood over the grates on the backside of the vent plate.",
      "content": "Tape the wood over the grates on the backside of the vent plate. Place the vent plate face-down on a flat surface and line the edges of the wood up with the edges of the section of grates. Then, tape the wood to the back of the vent plate using a strong tape, like duct tape. [7] X Research source Tape all 4 sides of the piece of wood to the vent plate so it’s secure."
    },
    {
      "title": "Screw the vent plate back over the vent opening.",
      "content": "Screw the vent plate back over the vent opening. The side of the vent plate that the wood is taped to should be hidden inside of the vent once you screw the plate back on. After the vent plate is screwed back in, the piece of wood should prevent any air from coming through the grates. [8] X Research source If you ever want to re-open the heating vent, just unscrew the vent plate and remove the piece of wood."
    }
  ]
}