{
  "url": "https://www.wikihow.com/Celebrate-St.-Patrick%27s-Day",
  "title": "How to Celebrate St. Patrick's Day",
  "steps": [
    {
      "title": "Go green.",
      "content": "Go green. Unless you want to, you don't have to wear a sweater with a giant shamrock on it. (Though that would certainly help you stand out.) The great thing about this holiday is you are free to go as subtle or as wild as you like. St. Patrick's Day t-shirts have been a common article of clothing to wear proudly. Consider the following suggestions when picking out something to wear: An all green t-shirt with optional Irish-related sayings, for example, \"Kiss me, I'm Irish!\" Note that no real Irish person over the age of ten would be caught dead in one of these. T-shirts with Irish beer monikers such as Harp or Guinness are more acceptable For those who are feeling particularly festive, try buying or making a leprechaun costume, replete with white stockings, green top hat and fake (or real!) red beard. If you're working on March 17th, you can still get into the festive spirit by incorporating a little green into your work attire. Try a green-striped polo or collared shirt, a green or shamrock-dotted tie, or green socks and undies for the closet St. Paddy's Day fans."
    },
    {
      "title": "Accessorize.",
      "content": "Accessorize. Buttons, pins and jewelry are all great ways to dress up an outfit. On St. Patrick's Day, they become ways to express the fun side of fashion. Nothing is too gaudy or outlandish. Buttons with clever (or not so clever) sayings are also encouraged. Small shamrock pins are a great and subtle way to express your support of the holiday. It is a tradition in Ireland for all attending parades and generally celebrating to wear a small collection of Shamrock fastened by a clothespin to your top (in the same place as a badge would be worn). Dying your hair or your pet's fur bright green is also a great way to stand out. Be sure to use a non-toxic dye. It's also common to see kids (and sometimes adults) with their faces painted on St. Patrick's Day, particularly if they're attending the parade. Cute shamrocks on the cheeks are a popular option, along with full-faced Irish flags of green, white and orange."
    },
    {
      "title": "Learn some Irish words and phrases.",
      "content": "Learn some Irish words and phrases. The Irish have their own distinct dialect of the English language, so if you want to sound like a true Paddy on St. Patrick's day, try sprinkling some of these Hiberno-English gems into your conversation: What's the craic? This phrase can be interpreted as either \"How's it going?\" or \"What's going on?\" or \"What's up?\" and is used in non-formal settings. Craic is a very important word in Ireland and can be used to describe your enjoyment of an event or activity, e.g. \"How was the party?\" \"Ah sure, it was great craic altogether!\" Use \"craic\" in the correct context and you'll earn major points with the Irish. Grand. Grand is another multi-purpose word in Hiberno-English. It doesn't mean large or impressive, but rather translates as \"fine\" or \"great\" depending on the context. \"I'm grand\" is a perfectly acceptable reply to the question \"How are you?\" and means the person is doing just fine. If you ask an Irish person \"How did the exam go?\" and they reply \"It was grand\" that means it went okay, it wasn't amazing, but it wasn't a disaster either. Eejit. Eejit is basically the Irish word for idiot. If someone does something silly or stupid, you can comment \"Ah ya big eejit!\" It's not meant to be offensive, rather it's used to make fun of someone in a playful way."
    },
    {
      "title": "Learn to Irish Dance",
      "content": "Learn to Irish Dance . Irish dancing is a form of step dancing which is popular both in Ireland and all over the world. Not only will it impress everyone you know, but it's also a fun way to increase flexibility and burn calories! You can learn how to Irish dance by attending classes in your local area or by copying some of the excellent Irish dancing videos and tutorials online. Whip out a few impressive steps and lifts the next time you hear a reel or a jig and nobody will question your Irish credentials. Get some friends together and learn how to céili (kay-lee) dance - a form of Irish social dancing that can be done with as few as two and as many as sixteen people. If you get good enough you can compete in the many feiseanna or Irish dancing competitions that take place all over the world. Even better, you can volunteer to perform in the next St. Patrick's Day parade!"
    },
    {
      "title": "Learn a little of the history of St Patrick's Day.",
      "content": "Learn a little of the history of St Patrick's Day. St. Patrick's Day has been observed as a religious festival in Ireland for over a thousand years, though it was only recognized as a celebration of Irish culture and heritage in the 1970s. [1] X Research source The day is named in honor of St. Patrick, the patron saint of Ireland, who has been credited with bringing Christianity to Ireland. There are multiple origin stories for St. Patrick, but: Most sources agree that St. Patrick's actual name was Maewyn Succat. They also agree that Maewyn was kidnapped and sold into slavery at age 16 and, to help him endure his enslavement, he turned to God. [2] X Research source Six years after his captivity began, St. Patrick escaped from slavery to France, where he became a priest, and then the second Bishop to Ireland. He spent the next 30 years establishing schools, churches, and monasteries across the country. He brought Christianity widespread acceptance amongst the pagan indigenous peoples. It is thought that St. Patrick used a shamrock as a metaphor for the Trinity (Father, Son, and Holy Spirit), showing how three individual units could be part of the same body. His parishioners began wearing shamrocks to his church services. Today, \"the wearing of the green\" on St. Patrick's Day represents spring, shamrocks, and Ireland."
    },
    {
      "title": "Travel to Ireland.",
      "content": "Travel to Ireland. What better way to celebrate the quintessential Irish holiday than a trip to the land of Saints and Scholars! Dublin, the capital city, usually holds a five-day festival in honor of the holiday and is the location of Ireland's largest and most impressive St. Patrick's Day parade. The city buzzes with life over the course of the festival - thousands of tourists flood the city and the pubs are overflowing with travelers and locals alike, eager to \"drown the shamrock\". So if you're looking to celebrate St. Patrick's Day in true Irish fashion, this is the place to be! Alternatively, you can take a trip down the country to escape from the tourist-ridden streets of Dublin and experience a somewhat quieter, but more authentic version of the holiday. Most towns will have some semblance of a parade - the quality varying from decent to poor - but the real reason to go is for the vibrant pub-scene, where you can enjoy high-quality traditional and contemporary Irish music surrounded by an authentic Irish crowd! As mentioned above, thousands of tourists flock to Ireland every March so it's advisable to book flights and accommodation well in advance, to avoid soaring prices and possible disappointment."
    },
    {
      "title": "Eat traditional Irish food.",
      "content": "Eat traditional Irish food. Beer and spirits are not the only great consumable goods to come out of Ireland. Corned beef, cabbage and lamb stew accompanied by traditional Irish soda bread are tasty ways to \"keep it real.\" Potatoes are about as Irish as you can get and are one of the staples of the Irish diet. Traditional Irish foods include bangers and mash, colcannon, bacon (boiled ham) and cabbage, stew, boxty, Shepherd's Pie, potato bread and black pudding. In Ireland, the day is usually celebrated by eating food such as pink bacon or savory roast chicken. Note that corned beef and cabbage is more of an Irish-American tradition than an authentically Irish one. [3] X Research source"
    },
    {
      "title": "Play some Irish music.",
      "content": "Play some Irish music. Ireland has a long history with music, and many incredible styles have emerged. Celtic, folk and traditional Irish pub songs might just get you in the St. Patrick's Day spirit! You can play some Irish music at home, listen to it on the radio (some stations will have special St. Patrick's Day features) or find out about any Irish bands or musicians playing locally. Find a compilation CD of traditional Irish songs or download some individual songs online. You should easily be able to find traditional Irish music by artists such as The Chieftains, The Dubliners, Planxty and Clannad, for example. If traditional music isn't your thing, don't forget about the many contributions Irish musicians have made to the world of rock and pop. Think U2, Van Morrison, Thin Lizzy and The Cranberries. Alternatively, you can try your hand at some traditional Irish instruments, such as the tin whistle, the bodhrán, the harp, the fiddle or the uilleann pipes. However, you're not likely to produce anything very melodic sounding if it's your first time!"
    },
    {
      "title": "Attend or get involved in local parades.",
      "content": "Attend or get involved in local parades. If you can't make it to the five day festival in Dublin, Ireland, check out the scene locally. Many parades feature the best of local dance troupes, marching bands, gymnasts and musicians in addition to spectacular themed floats and brightly costumed participants. You can enjoy the parade as a spectator or contact your local parade organization committee to get involved. There are many ways to participate in your local parade. You can get dressed up and march in the parade yourself, help design costumes or floats or help out with the organization of the parade. St. Patrick's day is a festive, communal holiday - so get involved! Though small towns aren't likely to have parades, many large cities such as New York City, Boston, St. Louis, San Francisco, Chicago, London, Montreal and Sydney have great celebrations. Savannah, GA boasts the second largest parade in the United States, while out of any US state, Boston has the highest number of Irish descendants by percentage of population, and its South Boston St. Patrick's Day parade is the first recorded anywhere in the world. [4] X Research source"
    },
    {
      "title": "Check out the pub scene.",
      "content": "Check out the pub scene. Most bars and pubs love St. Patrick's Day, as it's one of the few holidays known for a marked increase in alcohol consumption, so many will be catering to patrons with a festive St. Patrick's theme. You may find special prices on draft beer, food and cover charges. Call around to your favorite joints and ask if they have any celebration plans. A pub crawl can be a great way to get some friends together and explore the local pub scene, especially if there are a lot of Irish bars in your area. Make a list of the pubs you want to visit in advance (if you are ambitious you could aim for 17 pubs in honor of March 17th!), then make a rule that everyone needs to have a pint in each pub you visit. 17 US pints (8,000 ml) of Guinness anyone? It would be a shame to drink Budweiser on St. Patrick's Day, regardless of where in the world you are. If Guinness isn't your thing, try a pint of Bulmers (also called Magners) cider, Smithwick's ale, Jameson Irish whiskey or some Bailey's Irish cream. Whatever you drink, avoid any green beer."
    },
    {
      "title": "Consider having a party at home.",
      "content": "Consider having a party at home. If you aren't a fan of the bar scene but still want to celebrate, invite a few friends over and have a St. Patrick's Day themed party. Go as extreme or as laid back as you want: insist that everyone wear green or just have them come as they are and chill out with a few beers. Consider starting a tradition, such as watching a movie, \"The Quiet Man\" with John Wayne and Maureen O'Hara is a fun choice; serve corned beef and cabbage or Irish stew with colcannon (mashed potatoes and cabbage). Make green beer and green chocolate chip cookies for your party. In Ireland it is common to get together with family for St. Patrick's Day, so perhaps you'd like to do this too."
    }
  ]
}