{
  "url": "https://www.wikihow.com/Be-a-Rock-Singer",
  "title": "How to Be a Rock Singer",
  "steps": [
    {
      "title": "Learn how to control your voice.",
      "content": "Learn how to control your voice. [1] X Expert Source Tanisha Hall Vocal Coach Expert Interview. 27 March 2020. Becoming a rock singer requires more vocal control than singing karaoke in a bar. You need to learn how to control the pitch and tone of your voice. [2] X Research source Sing from the stomach instead of the throat. Singing from the throat is like a speaker without a box. You don´t get the fullness of the sound. It will sound squeaky when you try to hit some good notes, especially the high ones. So, mainly use the throat as a conduit. Work on hitting high notes. [3] X Research source Diaphragm pressure is the key to creating the heavier vocals used by rock singers. Your diaphragm controls the air that goes through your vocal chords. Some pressure in your diaphragm can push just enough air through your vocal chords to get that heavy grit out. Practice changing the pitch. Experiment with opening and closing your throat, lips, and teeth to see how much control you have over the sound. Closing your throat can add harshness or grit, while opening it can increase volume and improve timbre. Lips and teeth affect not only the character (what phonics you make) but also how the vibration of your vocal chords is translated into the air around you."
    },
    {
      "title": "Study the fundamentals of rock music and singing.",
      "content": "Study the fundamentals of rock music and singing. As you become more controlled and proficient in using your voice, try to expand your musical vocabulary by learning about the basics of music and singing. Vocal warm-ups, scales, intervals, and timbre are all helpful things to familiarize yourself with but remember the first rule of rock: do it your way. [4] X Expert Source Tanisha Hall Vocal Coach Expert Interview. 27 March 2020. Choose your style of rock. Abandon musical lyricism, tone, and articulation. Rock singing should be rather ambiguous in rhythm, lyrics, and pitch. That is the essence of hard rock."
    },
    {
      "title": "Get a voice coach.",
      "content": "Get a voice coach. [5] X Expert Source Tanisha Hall Vocal Coach Expert Interview. 27 March 2020. Don't try to learn from a cd or machine. Get a great teacher. Many professional rock singers have done so. A voice coach will help you develop your voice and can give you tips in how to protect your voice. [6] X Research source Rock has a vast array of voice styles and methods. An experienced coach can appropriately assess your improvement. A coach will help you improve your vocal range. There are no shortcuts. It takes a long time to learn to sing well. You might have natural talent, but that will take you only so far. You have to have a solid technique to have a stable career. That is why there are so many \"flash in the pan\" performers. They have no technique, and their voices crash and burn quickly."
    },
    {
      "title": "Exercise to strengthen your voice.",
      "content": "Exercise to strengthen your voice. You do have to be able to hold enough breath to push a note loud enough for a microphone or audience to hear it. [7] X Research source Focusing on core exercises such as abdominal, chest, and back muscles will help you tighten your core in order to focus on your breath. Cardio exercise such as biking, jogging, jump rope, and even brisk walking can improve the amount of breath you have for holding notes and can also help a lot if you're an active singer who does a lot of jumping around or headbanging while singing. Take care of your voice . While some singers can smoke and drink and sound like rock stars, that approach might not work for you. It's important to know the limitations of your own voice because nothing is worse than running your voice ragged before your band finishes its first set."
    },
    {
      "title": "Learn your vocal range.",
      "content": "Learn your vocal range. Everybody has a different vocal range, but most male singers fall into the categories of either bass, baritone or tenor, while most females have either a contralto, mezzo soprano or soprano vocal range. Some people have ranges that extend further than these categories. Learning your vocal range is very important because you need to know your limits. Oftentimes, your default conversational pitch is towards the lower end of your singing range. [8] X Expert Source Jonathan Stancato Voice Coach Expert Interview. 31 March 2020. Learn how to scream. Develop a screaming-yelling style to your singing voice. Most rock singers do not utilize the same technique as pop stars do: instead of smooth transitions and mild sounds, they go for the more scream-like voice, making it sound more passionate. Try yelling parts of any rock lyrics without utilizing vocal notes and then replicating that feeling while singing."
    },
    {
      "title": "Learn an instrument and become a good musician first.",
      "content": "Learn an instrument and become a good musician first. Singers have a bad reputation for being bad musicians. Don’t fall into that trap. Be a good to great musician. Anything less, and you're wasting your time and everyone else's. Master the electric guitar . That’s a staple in rock bands. Or study piano . Also know how to read music; even better, know how to write music as well. Be realistic about your talent. If your voice isn’t what you want it to be, learn an instrument instead. Parents are rarely realistic about their children's talent. Have persistence and patience. Don't be in a hurry. It takes time. Perform in small venues until you are used to performing. Being a solid performer takes practice. Get a thick skin. Be prepared for what you might feel is vicious criticism. Don’t get discouraged if you don’t make it big right away. Expect to face a lot of rejection."
    },
    {
      "title": "Write your own songs.",
      "content": "Write your own songs. If you want to become a rock celebrity with your band like blink-182, Angels & Airwaves, or NOFX, then you need to have songwriting chops. [9] X Research source Each of those artists has written unique songs and did not get famous off of singing covers. Perform your own songs. Learn the music fundamentally. Your complete understanding of the notes and rhythms must be solid before you can work on stylizing your performance and songs."
    },
    {
      "title": "Start a rock band.",
      "content": "Start a rock band. You’re not going to be a rock singer if you don’t get out there and play. Rock bands have many parts to them: Lead singer, drummer, bassist, guitarist. There is no substitute for practicing a lot and then performing. Start out small: perform for family and friends. It would also help if you performed to a group consisting of an individual or individuals who know how to sing rock. After you perform, ask for suggestions and feedback. How can I become better? What do I need to tweak?"
    },
    {
      "title": "Create a demo tape.",
      "content": "Create a demo tape . If you're serious about becoming a rock star, you will have to create a demo recording so that producers can hear what you sound like when your voice is mixed on a professional quality CD. These are essential for those hoping to make commercial music. Use only your best songs on it - four to six at the most. The format used depends on who's getting it, and the type of equipment they have. Keep it simple. Start with your absolute best song. [10] X Research source Make sure to label your demo. That way if it gets passed around, no one will forget that the great rock music on it belongs to you. Choose strong lyrics, and make sure the audio has strong clarity. No inappropriate words or intense violence because those may not be suitable for children. You might want to think about getting an agent as well. However, be realistic; of the many thousands vying for stardom, only a few make it, so have a back-up plan and perhaps a day job."
    },
    {
      "title": "Put feeling into your singing.",
      "content": "Put feeling into your singing. [11] X Expert Source Tanisha Hall Vocal Coach Expert Interview. 27 March 2020. Rock is more than screaming. It’s about feeling. It’s about putting your opinions, emotions and beliefs into music. Sing what you believe and feel. If you want to become a rock singer, sing with a passion. Let the words and the tune flow out of your heart. Let the pain, happiness, anger, sadness, anxiety, stress and hopefulness out. Let all your living emotions reach the maximum and explode from you. Let the music flow through your bloodstream. Listen to what you are making and enjoy it. Use your life in your music. Sing what you know so the emotions feel real. Audiences can tell when you're covering up your true emotions and being fake, and they will dislike it. Rather than smiling to show that everything is okay and that you're a performer with a capital P, be at least as relaxed and authentic as you would be when hanging out with a close friend. [12] X Expert Source Jonathan Stancato Voice Coach Expert Interview. 31 March 2020."
    },
    {
      "title": "Showcase your individuality.",
      "content": "Showcase your individuality. Rock aesthetics is built around the concept of individuality and rejection of conformity. Therefore, if you are setting out to emulate a singer or style you already like, you may set yourself back considerably in your learning process. The beginnings and history of rock and roll (which over time \"split\" into what we now call rock and R&B) are replete with artists who made the most of a limited set of tools. Minimalism and sparse resources have always been a cornerstone of the genre. So first and foremost, trust yourself. You have the rock inside you, and no one needs to tell you how to let it out. Find what you do well, and stick with it. You may not have to \"try\" to make your voice unique. Try to sing in the way that is most comfortable for you. This is going to allow you to sing the strongest and longest your voice will allow. If you can only scream, then be the screamer in the band! If you can only hit falsetto notes, then play that into your style. If you feel like you can only sing really low notes, then stick to where your voice is comfortable. A lot of beginning rock singers waste their time trying to emulate their heroes."
    },
    {
      "title": "Listen to more rock music.",
      "content": "Listen to more rock music. Try studying the vocal techniques of the singer in the song you are listening to. Is he/she singing putting more emphasis on the higher notes? The lower notes? Are the noises coming from the back of the singer's throat or from the front of the mouth? Try mimicking specific notes and the way these are sung, as this will help you develop that rock technique. A lot of people say they want to learn how to sing rock but in the end of the day they never actually listen to rock music. Listening to rock music constantly can familiarize you with the beats."
    },
    {
      "title": "Get the wardrobe and hair.",
      "content": "Get the wardrobe and hair. If you want to be a rock singer, you shouldn’t dress like a country singer. You need to master the look, while still keeping true to your own individuality. Male rock singers often wear ripped jeans, ripped T-shirts, scuffed hair, black makeup around the eyes, spiked collars and spray painted black leather jackets. A typical female rock singer’s wardrobe might involve dark colors like black and purple, mini-skirts, T-shirts, leather jackets, boots, spiked bracelets, and long teased hair. Avoid pastels."
    },
    {
      "title": "Develop a stage persona.",
      "content": "Develop a stage persona. The key is confidence. You need to be confident to project both voice and personality when on stage. This may be easier thought about than done––you may wish to join drama class or a club to help you to develop presence before testing yourself in the stage environment playing music. [13] X Research source Strong stage presences are about transparency and a lack of deceit. [14] X Expert Source Jonathan Stancato Voice Coach Expert Interview. 31 March 2020. In some cases, depending on the band you're fronting, it may become more important to be a good entertainer than it is to be a good singer. It won't always be this way though, as it depends on the combination of singing and presentation of your band. You need to interpret the music on stage. Practice your posture. It may not seem like it, but good posture is essential to both good singing and great stage presence. Bad posture can cramp the sound leaving your body and can cause people to think you'd rather shrink to the back of the stage than take it front and center."
    }
  ]
}