{
  "url": "https://www.wikihow.com/Become-an-Army-Sniper",
  "title": "How to Become an Army Sniper",
  "steps": [
    {
      "title": "Be a current soldier.",
      "content": "Be a current soldier. In order to become a sniper, you must be on active duty, or in the Reserve or National Guard. You cannot be on inactive duty (even if you are involved with military activities)."
    },
    {
      "title": "Get experience as an infantry soldier.",
      "content": "Get experience as an infantry soldier. The infantry is the primary combat force of the Army, and is the starting point for a number of specialty positions, including Rangers and Snipers. Before starting Sniper School, you will need to have established a distinguished record as an infantryman. To enter the Infantry, you must have a combat (CO) Armed Services Vocational Aptitude Battery (ASVAB) score of at least 87. Infantry training lasts for 14 weeks, and takes place on the field and in the classroom. Skills to attain as an infantry soldier include weapons usage, the ability to handle stressful situations, ground tactics, and a readiness to accept challenges."
    },
    {
      "title": "Attain sufficient rank.",
      "content": "Attain sufficient rank. Would-be Army Snipers must be classified as Military Occupational Specialty (MOS) 11B (Infantry soldier), 19D (Calvary Scout) or 18 series (Special Forces) in the rank of E3 through E6. Additional Skill Identifier (ASI) B4 (Sniper) can only be given to those soldiers who have attained MOS 11B."
    },
    {
      "title": "Meet or exceed certain test scores.",
      "content": "Meet or exceed certain test scores. In addition to the minimum CO score of 87 that is required to enter the Infantry, to become a sniper you must have a score of 100 or higher on the General Technical (GT) portion of the ASVAB before you can apply to become a sniper."
    },
    {
      "title": "Have good vision.",
      "content": "Have good vision. The tasks of a sniper, such as target identification and long-distance firing, demand excellent vision. In order to begin Sniper training, your vision must either be 20/20, or correctable to 20/20. You must also be able to accurately distinguish color."
    },
    {
      "title": "Have expert rifle skills.",
      "content": "Have expert rifle skills. Superior marksmanship is necessary for all snipers, so you must qualify at the “expert” level with the M4 rifle within six months of attending your sniper course. Snipers are often essentially required to shoot targets about the size of a playing card at a distance of 500 meters."
    },
    {
      "title": "Be in excellent physical shape.",
      "content": "Be in excellent physical shape. Snipers may be called on to move through difficult terrain, often alone. Thus, to become a sniper you must have a minimum physical profile of 111221. You must also have a recent (within the last 12 months) medical examination or physical assessment. A 111221 physical profile references the \"PULHES factor,\" with each digit corresponding to a rating of a given area: Physical capacity or stamina, Upper extremities, Lower extremities, Hearing and ears, Eyes, and Psychiatric health. A rating of 111221 indicates a high level of health and ability in each of these areas. To begin Sniper School, you must have passed an Army Physical Fitness Test (APFT) with a minimum of 70 points in each area within 30 days prior to the start of the training program."
    },
    {
      "title": "Have a clean record.",
      "content": "Have a clean record. Performing as an Army Sniper requires the highest level of conduct, control, and confidentiality. For this reason, you should plan on having a clean military and civilian record, with no record of alcohol or substance abuse, if you want to become an Army Sniper."
    },
    {
      "title": "Pass a psychological examination.",
      "content": "Pass a psychological examination. Being a sniper involves very stressful and dangerous work; you must have good mental health to complete these tasks. A psychological examination must be conducted by an approved psychologist within one year prior to the start date of your sniper training course."
    },
    {
      "title": "Have appropriate security clearance, or be eligible to obtain it.",
      "content": "Have appropriate security clearance, or be eligible to obtain it. Work as a Sniper is often highly classified, and so you must obtain a Secret or interim Secret security clearance before beginning training. If you do not already have this clearance, you must be eligible and apply for it. The Department of Defense (DOD) issues personal security clearances. In order to receive a Secret clearance, you must be a U.S. citizen or naturalized citizen, have a position that necessitates the clearance (at the DOD's discretion), and undergo a background check. [1] X Trustworthy Source US Department of State Official website of the U.S. Department of State Go to source Your security clearance may also need to be periodically renewed."
    },
    {
      "title": "Volunteer to attend Sniper School.",
      "content": "Volunteer to attend Sniper School. The Army sniper training course is neither mandatory nor guaranteed, even if you reach the necessary rank and meet the other entry qualifications. Instead, you must volunteer with a formal request to your Battalion Commander, who then decides whether or not to recommend you for Sniper School."
    },
    {
      "title": "Sign up to attend Sniper School.",
      "content": "Sign up to attend Sniper School. If you meet the basic qualifications, volunteer, are recommended, and then finally accepted into the Army Sniper program, then you will be asked to register for the training course. The School lasts for seven weeks and takes place at Fort Benning, Georgia. During the course, you will study: Marksmanship Range estimation Target detection Stalks Written instruction"
    },
    {
      "title": "Pass the initial exercises.",
      "content": "Pass the initial exercises. On the first day of sniper training, you will be put into a grouping exercise to test your initial abilities and potential for reconnaissance and marksmanship. If you do not pass this exercise, you will not be permitted to take the course."
    },
    {
      "title": "Complete the course.",
      "content": "Complete the course. Each of the seven weeks of Sniper School is devoted to one or more specific aspects of sniper duties. You will study these both in the classroom and in various field exercises. Week 1 is devoted to stalks, range estimation, and target detection. Week 2 is devoted to ballistics as well as marksmanship using the M110 Semi-Automatic Sniper System (SASS). This rifle is lighter and shorter than traditional sniper rifles, but can deliver precision fire to targets up to 800 meters. Week 3 is devoted to strategies for gathering data, as well as a written exam on information covered. Week 4 is devoted to making night shoots and the use of the M2010 Enhanced Sniper Rifle (ESR). Week 5 is devoted to strategies for Unknown Distance (UKD) firing, moving targets, and the use of the M9 pistol. Week 6 is devoted to learning alternate firing positions, and the use of the M107 rifle. In addition, there is a final examination in the sixth week of Sniper School. Week 7 is devoted to field training exercises (FTX) to practice sniper techniques, and to final shooting exercises. At the end of the course, there is a graduation ceremony. Soldiers who successfully pass Sniper School will be awarded a diploma."
    }
  ]
}