{
  "url": "https://www.wikihow.com/Check-if-My-Phone-Supports-Hdmi-Alt-Mode",
  "title": "Does Your Phone Support HDMI Alt Mode? Here's How to Check",
  "steps": [
    {
      "title": "HDMI Alt Mode is a standard for conveying HDMI signals over a USB Type-C cable.",
      "content": "HDMI Alt Mode is a standard for conveying HDMI signals over a USB Type-C cable. This means that if your smartphone supports HDMI Alt mode, you can connect your phone to a TV, monitor, or projector using a USB-C to HDMI cable. You do not need to use an adapter. Due to the popularity of DisplayPort technology (and the prevalence of HDMI-out ports on laptops), HDMI Alt Mode will not be around for much longer. [1] X Research source Existing cables that support HDMI Alt Mode will continue to exist, and you can continue to use HDMI Alt Mode if your phone supports it, but new cables will not be released in the future. HDMI Alt Mode supports the following features: [2] X Research source 4K Ultra HD resolution at 24 frames per second. Deep Color Dolby Digital 5.1 surround sound Audio Return Channel (ARC) 3D video support HDMI Ethernet Channel (HEC) Consumer Electronic Control (CEC) High Bandwidth Digital Content Protection (HDCP 2,2)"
    },
    {
      "title": "Check if your Android phone has a USB Type-C port.",
      "content": "Check if your Android phone has a USB Type-C port. If your phone has a USB Type-C port , it likely supports HDMI Alt Mode—especially if it's a flagship (or top-of-the-line model), such as the Samsung Galaxy S series. Notably, Google Pixel phones do not support HDMI Alt mode even though they have USB Type-C ports. USB Type-C ports are small, thin, and oval-shaped (8.24mm x 2.4mm). You can also check for an HDMI icon on your phone's packaging. If your phone supports HDMI Alt Mode, you'll usually find an HDMI logo somewhere on the original box, or in the phone's manual. Unfortunately, if you have an iPhone, your phone doesn't support HDMI Alt Mode. While future iPhones will have USB-C ports, current models do not. [3] X Research source If your iPhone or iPad uses a Lightning cable, you will need to use a Lightning Digital AV adapter to connect your device to a display. Lightning cable connections are limited to a resolution of 1080p. Alternatively, you can mirror your screen to a display over Wi-Fi. If you're still not sure whether your phone supports HDMI Alt Mode, try connecting , or contact your manufacturer. While there are apps that can check whether your phone supports HDMI Alt Mode, most cost money and are not needed."
    },
    {
      "title": "Use a USB-C to HDMI cable.",
      "content": "Use a USB-C to HDMI cable. Simply connect the USB Type-C end to the charging port on your phone, then connect the HDMI end to an HDMI port on your display or TV. If you're connecting to a TV, use the remote control to select the HDMI source to mirror your phone's screen . If you don't have a USB-C to HDMI cable, you can use an adapter. The adapter will either have an HDMI cable attached to it, or an HDMI port that allows you to connect a separate HDMI cable. This allows you to connect your phone to a display using standard HDMI and USB Type-C cables. If you have an older phone that has a Micro USB port instead of a USB-C, you'll first need to check to make sure your device supports MHL. If it does, then you can use a Micro USB to HDMI adapter to connect your phone to an HDMI-enabled display."
    },
    {
      "title": "HDMI Alt mode supports up to HDMI 1.4b.",
      "content": "HDMI Alt mode supports up to HDMI 1.4b. Any features that require an HDMI 2.0 or HDMI 2.1 will not be supported by HDMI Alt mode. This means HDMI Alt Mode does not support 8K video or 4K video at 60 frames-per-second."
    }
  ]
}