{
  "url": "https://www.wikihow.com/Celebrate-Hanuman-Jayanti",
  "title": "How to Celebrate Hanuman Jayanti",
  "steps": [
    {
      "title": "Begin fasting at sunrise on the day of Hanuman’s birth.",
      "content": "Begin fasting at sunrise on the day of Hanuman’s birth. In order to celebrate this holiday properly, you need to fast for the full day of Hanuman Jayanti. The fasting is part of puja, and begins at sunrise when you first wake up, and concludes at the end of the day, or with a vegetarian feast after temple. [2] X Research source Even though you are fasting for the day, you can sparingly snack on holy foods known as prasad during religious ceremonies. [3] X Research source Puja simply means to perform an act of worship. This is a central part of celebrating Hanuman Jayanti."
    },
    {
      "title": "Attend special religious discourses at a nearby temple of worship.",
      "content": "Attend special religious discourses at a nearby temple of worship. If you are looking for the complete experience on Hanuman Jayanti, go visit a local temple. Temples that practice the holiday offer special ceremonies and prayers to the devotees and to the general public. At temple, you will read from the sacred Hanuman Chalisa, recite poetic shlokas, and sing bhajans, which are spiritual or religious songs. [4] X Research source Make sure you are well-rested the day before as some of these ceremonies can last the entire day. This is because the Hanuman Chalisa, which is 40 verses long, can be prayed as many as 108 times before the ceremony is complete. [5] X Research source If you are visiting Andhra Pradesh, a state in south-east India, or Telangana, a state in south India, be prepared to celebrate Hanuman Jayanti for 41 days. Even though Hanuman Jayanti is celebrated longer in these states, the practices are similar to those that only celebrate for one day. [6] X Research source"
    },
    {
      "title": "Pay your respects to the idol of Hanuman by decorating it.",
      "content": "Pay your respects to the idol of Hanuman by decorating it. You can give respects to the idol by decorating an idol statue with flowers and garlands. It is also custom to pour mustard oil on the idol statue, and light a small ceremonial candle called a “diya of ghee.” During this process, you can simply chant, “Rama,” to impress the god. [7] X Research source In Hanuman temples, you can observe the officiating priest of the ceremony bathe and decorate an idol statue of Hanuman before offering special prayers to the gods. The idol’s body is then smeared with a reddish powder called “sindoor” and oil. [8] X Research source"
    },
    {
      "title": "Paste red markings on your forehead for good luck.",
      "content": "Paste red markings on your forehead for good luck. If you are looking for some extra luck, apply a “tika” marking on your forehead when your puja is complete. At the end of a religious ceremony, devotees will paste markings of sindoor on their foreheads. [9] X Research source These red markings commemorate how Hanuman smeared himself in paste to ensure the immortality of Rama. [10] X Research source"
    },
    {
      "title": "Give bananas offerings to Hanuman and monkeys in the area.",
      "content": "Give bananas offerings to Hanuman and monkeys in the area. While it is said that Hanuman could alter his physical form, he is popularly envisioned as a monkey. To honor Hanuman, give bananas to any local monkeys. If there are no monkeys nearby, you can instead give the banana offering to a Hanuman statue. [11] X Research source If you make an offering while at temple, the temple will gift you prasad, sweets called ladoos, flowers like hibiscus or jasmine, coconuts, tilak, and holy water. [12] X Research source"
    },
    {
      "title": "Read the holy scriptures of Ramayana and Mahabharata.",
      "content": "Read the holy scriptures of Ramayana and Mahabharata. Instead of attending temple on Hanuman Jayanti, stay at home and read from the scriptures of Ramayana and Mahabharata. This can be a private act for yourself to enjoy, or you can read with loved ones. [13] X Research source Meditation is also often practiced instead, or in addition to, attending temple. While meditating, recite mantras and special prayers to Hanuman. [14] X Research source"
    },
    {
      "title": "Attend a local festival or street parade.",
      "content": "Attend a local festival or street parade. Some local communities will host lively festivals or street parades in conjunction with the traditional ceremonial practices of Hanuman Jayanti. Some people will even dress up as Hanuman, and dance in the street to celebrate. If you are looking to take a break from temple and meditation, find an active festival near you to let loose a little on the charitable holiday. [15] X Research source To find out about any local festivities, talk with some of the locals outside of temple. These gatherings can be an annual event, or even impromptu."
    },
    {
      "title": "Wear the color orange proudly.",
      "content": "Wear the color orange proudly. After attending temple, discard your formal attire and get into a festive spirit by wearing orange clothing or a simple orange headband. People who attend festivals or street parades wear vibrant shades of orange as it represents the reddish-orange color of Hanuman’s body. [16] X Research source"
    },
    {
      "title": "Make your own milagu vadai to eat during the fasting period.",
      "content": "Make your own milagu vadai to eat during the fasting period. While this peppercorn fritter can be received at temple or purchased at temple shops, it is also a simple snack to make at home. This is an acceptable food to eat while you are fasting. The fritters are based on a ground lentil and rice flour batter that is flattened into discs and fried until crisp. [17] X Research source"
    },
    {
      "title": "Soak 1 cup (16 tbsp) of black lentils in a bowl with water for 1 hour.",
      "content": "Soak 1 cup (16 tbsp) of black lentils in a bowl with water for 1 hour. The lentils will still be firm, but not hard. If the lentils still seems hard, you can soak it for an additional 30 minutes, and then drain the lentils using a strainer. [18] X Research source"
    },
    {
      "title": "Add the lentils to a food processor and grind them into a coarse paste.",
      "content": "Add the lentils to a food processor and grind them into a coarse paste. If the processor is chopping the lentils instead of grinding it, add a few drops of water to moisten the lentils. Do not add more than 1–2 teaspoons (4.9–9.9 mL) of water to the paste. Adding too much water will make the final batter too soft to mold. [19] X Research source"
    },
    {
      "title": "Season the paste with peppercorns, salt, and cumin seeds, then mix it.",
      "content": "Season the paste with peppercorns, salt, and cumin seeds, then mix it. You need to add about 1 tsp (approximately 3 g) of peppercorns, 1/2 tsp (2.363 g) of salt, and 1/2 tsp (2.363 g) of cumin seeds. Then grind the paste for a few more seconds or until mixed. [20] X Research source"
    },
    {
      "title": "Add the batter, rice flour, and ghee to a bowl, and mix it by hand.",
      "content": "Add the batter, rice flour, and ghee to a bowl, and mix it by hand. You need to add 1 tsp (4.725 g) of rice flour and ghee to the mixture. If you do not have ghee or do not want to use ghee, you can use 1 teaspoon (4.9 mL) olive oil instead. [21] X Research source"
    },
    {
      "title": "Grease a plastic sheet and lay it flat on the counter.",
      "content": "Grease a plastic sheet and lay it flat on the counter. This will be an easy surface for you to mold, flatten, and transfer the batter from. Grease the plastic sheet well, otherwise your batter will stick to it. If you do not have a plastic sheet, you can grease one side of a plastic bag instead. [22] X Research source"
    },
    {
      "title": "Shape a piece of batter into a small ball and place it on the greased sheet.",
      "content": "Shape a piece of batter into a small ball and place it on the greased sheet. Make the ball about the size of a golf ball or a small lime. Pack the batter tightly together so it does not crumble when you flatten it out. [23] X Research source"
    },
    {
      "title": "Pat the ball gently until it becomes a flat disc.",
      "content": "Pat the ball gently until it becomes a flat disc. The disc should be thin, without any cracks along the edges. You can grease your fingers to prevent the batter from sticking to your hands. [24] X Research source If you want, you can make a small hole in the center of the disc with your finger. This will create the traditional cut-out shape for the fritter. This is not necessary though."
    },
    {
      "title": "Use the plastic sheet to flip the disc into your hand.",
      "content": "Use the plastic sheet to flip the disc into your hand. If you did not grease the plastic well, the disc will stick or fall apart. Make sure to reform any discs that break or crumble during this transferring process. [25] X Research source Grease the plastic sheet between making each disc to prevent the batter from sticking to it. [26] X Research source"
    },
    {
      "title": "Drop the disc into hot oil, and fry it until it gets a golden color.",
      "content": "Drop the disc into hot oil, and fry it until it gets a golden color. You can use a pan or a pot to heat the oil in. Just make sure that the pan has high sides to limit splattering. Keep the oil simmering at a medium-high heat. Cold or chilled dough will take longer to brown than warm or freshly made dough, but typically the fritters will be golden-brown within 1 to 2 minutes of frying. [27] X Research source Be extremely careful when working with hot oil. You can easily burn yourself or start a fire if you are not careful. Make sure to have a fire extinguisher nearby, especially if this is your first time frying."
    },
    {
      "title": "Remove the fritter from the oil and rest it on the paper towel.",
      "content": "Remove the fritter from the oil and rest it on the paper towel. The paper towel will help drain the excess oil, so the fritter remains crispy as it cools. Continue this process until all of your batter has been fried. [28] X Research source"
    }
  ]
}