{
  "url": "https://www.wikihow.com/Ask-Out-a-Girl-at-School",
  "title": "How to Ask a Girl at School On a Date",
  "steps": [
    {
      "title": "Get her number if you don't already have it.",
      "content": "Get her number if you don't already have it. Before you can ask a girl out through text, you'll need to be able to contact her! Get her number from a friend, or ask her for her number if you know her. To play it casually, you can ask her for her number in case you have homework questions or another school-related topic. Try saying something like, \"Hey, can I have your number so we can chat about math class?\" Alternatively, you could simply say, \"Hey, what's your phone number?\" if she seems friendly."
    },
    {
      "title": "Friend her on social media if you'd prefer.",
      "content": "Friend her on social media if you'd prefer. If you don't have her number, and aren't sure how to get it, don't worry! She may be reachable on Facebook, Instagram, Twitter, Snapchat, or another social media site! Ask her friends which one she uses, and friend her through the site. Friending people from school is pretty common, so if you're nervous about asking her for her number, this is a great way around that problem! Some people use different last names on social media, so make sure you found the right profile before sending the friend request."
    },
    {
      "title": "Message her casually asking for a date.",
      "content": "Message her casually asking for a date. Sending a message, whether via text or online messaging system, is a laid-back way of asking her out without a whole lot of pressure. There’s no shame in asking someone on a date through messaging these days, and it gives her a chance to reply when she's available! Leave a private message on social media saying, “Hey, what’s up? I’d like to get to know you better. Would you like to hang out this weekend?” [1] X Research source For example, “Are you free on Tuesday or Wednesday evening?” She may ask “Why?” or respond, “Yes.” Follow up with, “Why don’t we hang out for a bit? I have some free time.” [2] X Research source If she says yes to hanging out, suggest a time and place. Be prepared for her to suggest a time that works for her, and try to be available when she is. If you aren't, suggest an alternative to keep the date alive!"
    },
    {
      "title": "Suggest a specific activity if you'd prefer a more planned approach.",
      "content": "Suggest a specific activity if you'd prefer a more planned approach. If asking her out for an open-ended date seems to scary, try asking her to go to specific event with you. For example, you might say something like \"Hey, do you want to go to a concert on Wednesday?\" or \"I heard the new horror movie is really scary, would you want to go watch it with me on Saturday?\" [3] X Research source For example, ask her, “How about we meet later this week for this play in the park?” Or, “How about we meet later this week for some coffee?” Try different ideas, but stuck with things you’re comfortable with. Don’t suggest rock climbing if it’s something you’ve never done before!"
    },
    {
      "title": "Use a more exciting approach to suggest something out of the ordinary.",
      "content": "Use a more exciting approach to suggest something out of the ordinary. This is a good approach if you’ve shown that you have a spontaneous side. Express that you have an interesting idea for something you two can do later in the week, and don't be afraid to be a little mysterious! [4] X Research source For example, say, “Any chance you'd want to come on an adventure with me on Thursday?\" A more humorous approach would be, “Let’s get to know each other better over some caffeine and figure out how much we complement each other in person.”"
    },
    {
      "title": "Invite her to something you already have plans for.",
      "content": "Invite her to something you already have plans for. This is a great way to ask a girl out if you’re already going to an event such as a show, a game, or a local event. You’ll be asking her to go somewhere with you that you would’ve done with or without her, so it’s no big deal if she says no. [5] X Research source For instance, “On Saturday, I’m going to the ball game. Why don’t you join me?”"
    },
    {
      "title": "Read the situation so you don’t embarrass her.",
      "content": "Read the situation so you don’t embarrass her. Depending on the girl, she may not be thrilled to be asked out in front of her friends, family, or in a really public situation. Try to gauge her embarrassment level and what she's into, and create an ask that will appeal to her!"
    },
    {
      "title": "Write a note to let her know you’d appreciate her company if she's more private.",
      "content": "Write a note to let her know you’d appreciate her company if she's more private. Keep it short and simple with something along the lines of, “Will you go out with me?” Then, you can figure out a creative way to get the note to her so its' a surprise! [6] X Research source For example, offer her a piece of gum that’s wrapped in a note with your question written on it. Alternatively, you might try slipping the note into one of her notebooks so she sees it when she gets to class."
    },
    {
      "title": "Use a journal to ask her out romantically.",
      "content": "Use a journal to ask her out romantically. If you're good friends, try recording the time you spend together in a notebook. As you get to know her more, you’ll write more entries expressing your feelings. Once you’re ready to ask her out, write it in the journal and present it to her. [7] X Research source Write a note on a blank page that says, “There are 40 more pages in this journal. The first 19 pages were our memories from my perspective. I’d like the remaining to be memories from our perspective. Be mine?” If you don't know her very well, this may come across as a bit creepy, so make sure she'd like this ask!"
    },
    {
      "title": "Steal her phone to ask her out.",
      "content": "Steal her phone to ask her out. Just take her phone when she’s not looking and change your name in her contacts to “Be My Girlfriend,” and put a cute image of a baby animal as your picture. Give her the phone back and call her. [8] X Research source Only do this if you know that she won’t be put off by you sneaking into her phone."
    },
    {
      "title": "Find common ground by talking to her.",
      "content": "Find common ground by talking to her. If you are in similar classes or you've seen her reading a book you read, bring that up so you have something to talk about together. Bonding over something you have in common is a great way to get to know more about her! Introduce yourself to the girl you like if she doesn't know your name. Try walking up to her and saying, “Hey. my name is Sam. What’s your name?” One way to do this is to ask her how her classes are going and what her favorite class is. Let her talk about her favorite subject and listen rather than interrupt her. Don’t pretend to share the same interests with her just to make her interested in you, because she’ll figure it out and you may lose her trust."
    },
    {
      "title": "Learn more by talking to her about her life.",
      "content": "Learn more by talking to her about her life. Ask her if she has any pets, what her hobbies are, and if she’s involved in any after-school groups. Don’t ask her for her number or say anything about dating right off the bat, because that may make her uncomfortable. [9] X Research source Open a conversation with, “How was the test in English?” or “How’s your day going?” Don’t say, “You look good. Can I get your number?” This isn’t a conversation opener. Reader Poll: We asked 906 wikiHow readers who've asked someone on a date, and 53% of them agreed that the best way to approach it is by taking things slow and getting to know them first. [Take Poll] The more you know about your crush, the easier it will be to ask her on a date you’ll both enjoy!"
    },
    {
      "title": "Compliment her.",
      "content": "Compliment her. Start by complimenting something that’s obvious like her style. Say you like her glasses or hair today. If you know more about her personally, compliment her intelligence or something else you like about her personality. Say something positive about her creativity, her compassion, or anything you like about her. [10] X Research source Remember, sexual harassment is not a compliment. Avoid saying anything about sex if you haven’t gotten her consent to talk about it with her. If you know that she likes to make art, tell her, “You’re very creative. I’d like to see more of your work.” If you’re in the same class, and she made an insightful comment, tell her, “You’re really perceptive.” It will make her feel good about herself!"
    },
    {
      "title": "Be honest about yourself and your accomplishments.",
      "content": "Be honest about yourself and your accomplishments. Talk about your interests, such as hobbies, music, books, shows, and so on. Don’t be insincere and make up stories that you’re on the football team when you’re not, but don't be afraid to talk about things you've accomplished! A girl will want to know you for who you are. The more you share your interests, the more you’ll find out you have in common!"
    },
    {
      "title": "Show her that you’re listening to her while she talks.",
      "content": "Show her that you’re listening to her while she talks. Maybe you don’t like the same books that she does, but remember that conversation you had where she told you what books she likes? That’s where listening is helpful, because you can show your interest by giving her a book by an author she likes as a gift. Anyone would be deeply touched by this. For example, if you’ve been listening to this girl, you might remember that she likes a certain movie franchise, so maybe you can get two tickets to see the next installment. It doesn’t matter whether you like it or not. The point is that you’re demonstrating you’ve been listening to her."
    },
    {
      "title": "Ask her out directly once you've become friends.",
      "content": "Ask her out directly once you've become friends. Once you know more about her, ask her if you can talk to her privately. Then, when you're alone with her, ask her out! [11] X Research source Try not to jump straight into the question. Instead, add her about her day, make small talk, then ask her out. You might ask her if she's doing anything this weekend, and then say something like “I’d like to get to know you better, and I was wondering if you’d like to get some coffee with me this weekend?” Another example would be, “That new movie that you’ve been wanting to see is playing. Would you like to go see it with me?”"
    },
    {
      "title": "Ask her to go with you to an event with your friends to make it seem less like a \"date.\"",
      "content": "Ask her to go with you to an event with your friends to make it seem less like a \"date.\" If you don’t want to show the girl how much you’re feeling yet, then inviting her to a party you’re hosting or an event with a group of friends will allow you to spend time with her without expressing vulnerable emotions early on. [12] X Research source This is a great opportunity to learn more about each other."
    },
    {
      "title": "Be sincere when asking her out.",
      "content": "Be sincere when asking her out. You're more likely to get a \"yes!\" if you don't try to play off your request. Even if she says no, say \"ok\" and respect her decision. It might be tempting to pretend you asker her out as a joke, but that might hurt your friendship in the long run."
    }
  ]
}