{
  "url": "https://www.wikihow.com/Are-Dolphins-Evil",
  "title": "Exploring the Dark Side of Dolphins (Plus, Fun Facts)",
  "steps": [
    {
      "title": "Animals aren’t “evil,” but dolphins can be mean and aggressive.",
      "content": "Animals aren’t “evil,” but dolphins can be mean and aggressive. Assigning a term like “good” or “evil” to an animal that doesn’t behave based on any kind of ethical framework is maybe not the way to go, but we do understand why some people hold a negative opinion of dolphins. They do engage in some nasty behavior, like bullying pod-mates, killing for fun, and sacrificing their children. Dolphins are also some of the most sexually aggressive animals around. They’re aggressive hunters, too. They’ve been seen brutalizing their prey before eating it. Are dolphins dangerous? Yes. Dolphins are carnivores that hunt their prey, so they’re more than capable of doing damage with their razor-sharp teeth. Do dolphins attack humans? Not unless they’re provoked, no. There are a handful of recorded dolphin attacks, but they’re normally more on the “live and let live” side of things. [1] X Research source"
    },
    {
      "title": "They’re sexually aggressive and don’t ask for consent.",
      "content": "They’re sexually aggressive and don’t ask for consent. You may have heard that dolphins have been known to sexually assault one another (and people), and that’s unfortunately true. [2] X Research source In the world of animal mating, dolphins are potentially one of the most violent and unforgiving animals around. [3] X Research source While it’s true that animals aren’t intelligent enough to hold a concept of “sexual consent,” some animals (like many birds) must “convince” their mates to join them in mating, and even the more aggressive animals don’t tend to be as physically violent as dolphins. [4] X Research source Why are dolphins so aggressive? Dolphins have a weird combination of being highly social pack hunters, but also being extremely sexually competitive. This creates some less-than-desirable behaviors when it’s mating season."
    },
    {
      "title": "They kill their young for no reason.",
      "content": "They kill their young for no reason. It’s rare, but there are documented instances of dolphins butchering young calves. Scientists have theories about this behavior, but there’s nothing conclusive out there yet. [5] X Research source The leading theory right now is that dolphins will kill the calves of females they want to mate with to incentivize them to have more children. That doesn’t necessarily make the behavior any more redeemable, though."
    },
    {
      "title": "They’re one of the few animals that kill for fun.",
      "content": "They’re one of the few animals that kill for fun. Outside of humans, there are very few animals that have been proven to kill living beings for no reason. Dolphins are one of them. In fact, they’re known to engage in a practice known as “porpicide” where they bounce a poor porpoise out of the water back and forth like a volleyball until it dies. [6] X Research source Cats are the other major animal, alongside humans and dolphins, that kill for fun. Think of those house cats that leave “gifts” like dead birds and mice around."
    },
    {
      "title": "They use pufferfish toxin to get “high.”",
      "content": "They use pufferfish toxin to get “high.” You read that right. Dolphins like to get high. Dolphins have been documented to capture pufferfish and gently chew on them or mess with them until they release their defensive hormones. Those hormones have an intoxicating effect that puts dolphins into a hallucinogenic trance. Scientists originally thought this was just more “dolphin being jerks to other animals” behavior, but they actually let the pufferfish go after getting stoned. [7] X Research source There are a surprisingly large number of animals that do “drugs.” Horses eat hallucinogenic weeds, elephants are known to get drunk on fermented fruit, and there are plenty of monkeys out there that steal booze from tourists. [8] X Research source"
    },
    {
      "title": "They probably kill more marine life than any other predator.",
      "content": "They probably kill more marine life than any other predator. It’s hard to say simply because we don’t measure animal-on-animal violence, but dolphins are probably among the deadliest predators in the oceans. They’re voracious hunters who hunt in packs and use tools to excavate sea sponges from below the ocean floor. In other words, they kill a lot of stuff. Probably more than most sharks. [9] X Research source Dolphins consume 4-6% of their body weight in fish per day . [10] X Research source Sharks only eat 0.5-3% of their body weight per feeding , which may only happen once a week! [11] X Research source They’re also relatively mean when they do eat. Dolphins are documented as throwing octopuses out of the water repeatedly until their limbs rip apart to make them easier to eat. [12] X Research source"
    },
    {
      "title": "They form cliques and bully the dolphins they don’t like.",
      "content": "They form cliques and bully the dolphins they don’t like. Dolphins are definitely the Mean Girls of the ocean. They’ve been seen bullying pod members they don’t like for no reason at all. They’ve also been seen forming alliances when they want to mate; dolphins will team up to bully the most attractive females with the hopes that they’ll “give in” just to make the social ostracization stop. [13] X Research source Dolphins are social creatures, and the fact that they’ve developed “bullying tactics” is pretty dark. Many other social animals (like otters, bees, and meerkats) do not intentionally bully non-rivals."
    },
    {
      "title": "They get credit for being cute while other creatures are villainized.",
      "content": "They get credit for being cute while other creatures are villainized. Everybody thinks sharks are these crazy predators when sharks only kill about 6 people a year. [14] X Research source Even piranhas only kill a person on rare occasion and we regard them as bastions of unrepentant violence. [15] X Research source Dolphins, on the other hand, are known to attack people for fun. [16] X Research source They may not be as deadly as other aquatic life, but it’s pretty unfair that dolphins get this huge pass when they’re such colossal jerks. The other animal that probably gets way more love and respect than it deserves is the hippo which can be aggressive and dangerous."
    },
    {
      "title": "They seem to care for their dead friends.",
      "content": "They seem to care for their dead friends. It’s possible that dolphins are like humans when it comes to losing loved ones. They seem to mourn when a friend perishes, and they may be capable of experiencing grief. Dolphins have been observed cuddling with dead dolphins from their pod, trying to “bury” them under the sand, and nudging their dead friends as if to say, “please wake up.” [17] X Research source There’s something emotionally touching knowing that other creations on our planet are also attending to their lost loved ones. It makes you feel less alone!"
    },
    {
      "title": "They have a cute permanent smile.",
      "content": "They have a cute permanent smile. Dolphins have a naturally upturned mouth that gives the impression that they’re kind of smirking or smiling. We don’t have much else to say about it—it’s just cute how chipper and happy they look (even if deep down they’re harboring a psychotic rage). [18] X Research source"
    },
    {
      "title": "Their intelligence is admirable.",
      "content": "Their intelligence is admirable. After humans, dolphins are the second-most intelligent creature on the planet. [19] X Research source That puts them in a rare place relative to us. It’s hard to be too angry with dolphins when they’re actually so similar to us. Some researchers believe dolphins actively coordinate different roles and “talk” to one another when they hunt to increase the odds of a successful catch. [20] X Research source You could easily argue that dolphins use tools. They’ve been seen using shells to dig out sea sponges and crabs, and they can use conch shells to set “traps” for tasty fish. [21] X Research source"
    },
    {
      "title": "No, it’s both illegal and unsafe.",
      "content": "No, it’s both illegal and unsafe. Dolphins swimming in the wild are very likely to be hunting, so don’t interrupt them when they’re already in a potentially aggressive state. If they aren’t hunting, you’re disrupting them while they’re bonding with their pod-mates. Beyond that, you may be putting yourself at physical risk. If you want to swim with dolphins, visit your local wildlife sanctuary and do it in a controlled setting. [22] X Research source It’s also illegal to harass dolphins by trying to swim with them in basically every jurisdiction. [23] X Research source"
    },
    {
      "title": "Dolphins teeth tell their age the same way as tree rings.",
      "content": "Dolphins teeth tell their age the same way as tree rings. Dolphins can live anywhere from 20 to 50 years, and the way veterinarians tell their age is super interesting. They count the number of rings inside of each tooth. Each individual ring counts as one year, the same way the rings inside of a tree indicate the number of years it has been growing. [24] X Research source"
    },
    {
      "title": "Dolphins like to blow bubbles for fun.",
      "content": "Dolphins like to blow bubbles for fun. Dolphins are funny for a lot of reasons, but the fact that they get a kick out of blowing bubbles underwater is just hilarious. They blow bubbles to play with one another, communicate interest in interacting with other dolphins, or just to kill the time (some dolphins will blow a bubble then chase after it). [25] X Research source They even use bubbles to hunt! Dolphins have even been observed to blow bubbles beneath prey they’re chasing to push them further to the surface of the water."
    },
    {
      "title": "Dolphins have signature whistles they use to identify one another.",
      "content": "Dolphins have signature whistles they use to identify one another. The same way that people have distinct names they use to introduce themselves, dolphins have distinct whistles. In fact, dolphins will even use another dolphin’s signature whistle when addressing them, which arguably makes dolphins one of the few creatures on the planet (alongside us) to have language. [26] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "They don’t sleep the way other animals do.",
      "content": "They don’t sleep the way other animals do. Dolphins just straight up do not become unconscious—ever. Instead, they do something called “unihemispheric sleep” where they shut down half of their brain and close the corresponding eye to rest it and then swap it back out. Cool, right? [27] X Research source"
    }
  ]
}