{
  "url": "https://www.wikihow.com/Close-a-Yelp-Account",
  "title": "How to Close a Yelp Account",
  "steps": [
    {
      "title": "Log into Yelp.",
      "content": "Log into Yelp. If you aren't logged into your Yelp account, go to https://www.yelp.com/ in your computer's web browser, and click Log In , then enter your email address and password or select your preferred method of logging in (e.g., Facebook)."
    },
    {
      "title": "Delete any reviews or images you want removed immediately.",
      "content": "Delete any reviews or images you want removed immediately. When you close your Yelp account, Yelp will eventually remove your content, but this could take a while. If there are reviews or images you want removed immediately, delete them yourself before closing your account. To delete reviews: Click your profile icon , click About Me in the drop-down menu, click the Reviews tab, and click Remove next to a review. To delete photos: Go to the business page for which you posted the photo, select the photo in question, click Edit caption , and click Remove ."
    },
    {
      "title": "Open the Yelp Account Closure page.",
      "content": "Open the Yelp Account Closure page. Go to https://www.yelp.com/support/contact/account_closure/ in your web browser. This will open an online form."
    },
    {
      "title": "Enter a reason for deleting your account.",
      "content": "Enter a reason for deleting your account. Type a message (or even just one letter) into the text box below the \"Closing your user account\" heading."
    },
    {
      "title": "Click Send.",
      "content": "Click Send . It's a red button below the text box. Doing so will send your reason to Yelp; Yelp will then send a confirmation email to your email address. This is the email address that you used to sign up for Yelp. If you signed up for Yelp through Facebook or Google, it's the email address that you use to log into Facebook or Google, respectively."
    },
    {
      "title": "Open your Yelp email account.",
      "content": "Open your Yelp email account. Go to the inbox of the email address which you used to sign up for Yelp. You should have an email from Yelp here. If you use Gmail, the Yelp email will appear in the Social tab. The email may take a few minutes to arrive, but you should also check your Spam or Junk folder if you can't find the email."
    },
    {
      "title": "Open the email from Yelp.",
      "content": "Open the email from Yelp. Click the \"Yelp Account Closure Confirmation Request\" email from Yelp to do so."
    },
    {
      "title": "Click the confirmation link.",
      "content": "Click the confirmation link. It's the link near the bottom of the email, just above the \"Thank you\" signature. Doing so takes you to the confirmation page."
    },
    {
      "title": "Click Close Account.",
      "content": "Click Close Account . This red button is at the top of the page. Clicking it officially closes your Yelp account."
    },
    {
      "title": "Wait for your content to be deleted.",
      "content": "Wait for your content to be deleted. Once you confirm that you want to close your account, your data will begin to be deleted. This process does not happen all at once, but over the next week or so all of your photos and reviews will be deleted from Yelp."
    },
    {
      "title": "Understand the limitations.",
      "content": "Understand the limitations. You can relinquish control of your Yelp business account, but you cannot remove your business listing from Yelp. The only way that Yelp business owners have gotten listings removed is through lawsuits against Yelp. [1] X Research source"
    },
    {
      "title": "Visit the business account closure page.",
      "content": "Visit the business account closure page. Go to http://www.yelp.com/support/contact/business_unclaim/ in your web browser. This is the only way that you can delete your business' moderator account."
    },
    {
      "title": "Enter your business' details.",
      "content": "Enter your business' details. Type your business' name into the \"Business Name\" text field, then type the business' city into the \"Near\" text field."
    },
    {
      "title": "Find your business.",
      "content": "Find your business. Click Search to the right of the business information fields, then scroll through the results until you find your business' page."
    },
    {
      "title": "Click Select this business.",
      "content": "Click Select this business . It's a red button to the right of your business."
    },
    {
      "title": "Fill out the unclaiming request form.",
      "content": "Fill out the unclaiming request form. Enter any information you want Yelp to have into the \"Additional information\" text box, then type your business account's email address into the \"Your Email Address\" text field. Make sure that you use the email address that you used to sign up for Yelp."
    },
    {
      "title": "Check the \"I'm not a robot\" box.",
      "content": "Check the \"I'm not a robot\" box. This box is near the bottom of the page. You may be prompted to play a minigame to prove that you aren't a robot before proceeding."
    },
    {
      "title": "Click Send.",
      "content": "Click Send . It's a red button at the bottom of the page. This will send your form to Yelp."
    },
    {
      "title": "Wait to be contacted.",
      "content": "Wait to be contacted. Yelp will send a confirmation email to you before removing your access to the business account. This is to prevent someone from removing your access without your permission."
    },
    {
      "title": "Confirm that you want to remove your account access.",
      "content": "Confirm that you want to remove your account access. Open the email from Yelp when you receive it, then click the link in the email and follow any additional prompts to delete your account. [2] X Research source Remember, you cannot remove your business listing from Yelp."
    }
  ]
}