{
  "url": "https://www.wikihow.com/Ace-a-Job-Interview-(Teenage-Girls)",
  "title": "How to Ace a Job Interview (Teenage Girls)",
  "steps": [
    {
      "title": "Feeling prepared with the questions can help you ace the interview.",
      "content": "Feeling prepared with the questions can help you ace the interview. While you're most likely going to get a few questions that are specific to the job you're applying for, a lot of questions will probably be pretty generic. These are pretty common questions you can expect an interviewer to ask you: \"Why do you want to work for us?\" \"Tell me something about yourself.\" \"What are your weaknesses?\" \"What are your biggest strengths?\" \"Tell me about a problem you recently had and how you solved it.\""
    },
    {
      "title": "Ask a friend or family member to quiz you so you can work on your answers.",
      "content": "Ask a friend or family member to quiz you so you can work on your answers. Hand your list of possible questions to them so they can pretend to interview you. When you give your answers, try to come across as confident and concise. Here's how you might answer some of those questions: [1] X Expert Source Shannon O'Brien, MA, EdM Career Coach Expert Interview. 10 December 2019. \"I'd love to work for the company because I share many of the same values like community service.\" This shows them you've done your research on the company. When asked to tell about yourself, give useful information like, \"I'm a junior and I'm in journalism. I love talking to people, so I thought the customer service aspect of this job would be a great fit.\" If asked about weaknesses, never say you don't have any! Admit to something, but explain that you're working on it. For example, say, \"My biggest weakness is that sometimes I have a hard time staying organized. To help me with this, I write lists and check things off as I go.\" When explaining strengths, list things you're proud of and tie them to the job position. Giving an anecdote about a problem is a chance for you to show that you're able to think for yourself and get things done. You might share how a school project didn't work out but you made adjustments and finished the assignment, for instance."
    },
    {
      "title": "You don't need to wear a suit, but dress up a little so you make a good impression.",
      "content": "You don't need to wear a suit, but dress up a little so you make a good impression. Even if you're interviewing for a casual, part-time position, dress up so it looks like you're making an effort. Instead of jeans and a T-shirt, wear slacks and a nice blouse or sweater. Skip the sneakers, heels, or flip-flops and wear closed-toed professional-looking shoes. [2] X Expert Source Shannon O'Brien, MA, EdM Career Coach Expert Interview. 10 December 2019. If you want to wear a skirt, pick one that's at least knee-length. If you wear makeup, keep it light and natural. You don't want your makeup to be too bold or flashy so it distracts from what you're saying during the interview. Take out piercings if you think they'll distract your interviewer, especially if you'll have to remove the piercings while you're working."
    },
    {
      "title": "Arriving on time lets the interviewer know that this job is important to you.",
      "content": "Arriving on time lets the interviewer know that this job is important to you. Aim to get to the interview about 5 to 10 minutes before it starts. Let them know you're there for the interview and they'll probably show you somewhere you can wait. If you're really nervous and don't want to wait at the interview space, it's totally fine to wait outside or in the car. Just don't be late! Don't forget to bring the application, your ID, the application, and maybe a notepad if you'd like to write things down."
    },
    {
      "title": "Remind yourself that you're prepared for this!",
      "content": "Remind yourself that you're prepared for this! It's totally normal to have jitters before an interview but don't let them panic you. Try to focus your thoughts and turn any negative worries into positive statements. It might also help to practice deep breathing which can help your body relax. [3] X Research source For example, instead of thinking to yourself, \"There's no way I'll get this job. There are so many other people applying,\" tell yourself, \"I'm qualified for the position and I'm prepared for this interview.\""
    },
    {
      "title": "Have great manners so the interviewer is impressed.",
      "content": "Have great manners so the interviewer is impressed. A big mistake teenagers make in job interviews is being too informal. Wait to take a seat until the interviewer shakes your hand and directs you where to sit. When you speak, don't interrupt the interviewer and never swear or use slang. If you frequently say, \"um,\" or \"like,\" try to cut them out. Instead, use full, thoughtful sentences to answer the questions."
    },
    {
      "title": "Smile, make eye contact, and be yourself!",
      "content": "Smile, make eye contact, and be yourself! If you come across as self-assured and capable, you might stand a better chance of landing the job. Give your interviewer a firm handshake and sit up straight while you're interviewing. Answer the questions honestly and pay attention to the interviewer. Try to make a personal connection with them so they're more likely to remember you. [4] X Expert Source Shannon O'Brien, MA, EdM Career Coach Expert Interview. 10 December 2019. It's easy to be nervous in an interview, but don't talk over the interviewer or you might look rude. Wait for them to finish speaking before you respond. Take your time when answering a question. Waiting to form an answer shows that you're giving the question serious thought."
    },
    {
      "title": "This usually comes as the interview is wrapping up.",
      "content": "This usually comes as the interview is wrapping up. The interviewer will ask you if you have any questions for them and it's a great opportunity for you to look interested in the job or company. Instead of asking things like, \"When will I hear a decision about hiring?\" or, \"How much does the job pay?\" ask things open-ended questions like: [5] X Research source \"What does a typical shift look like?\" \"What do you like about working here?\" \"How would you describe the company's culture?\""
    },
    {
      "title": "You should also drop them a thank you note or email.",
      "content": "You should also drop them a thank you note or email. When it's time to end the interview, let the interviewer know you appreciate the opportunity. Shake their hand and smile as you say goodbye. Then, send them a thank you note or email the same day. This shows them that you're really interested in getting the job. [6] X Research source The note or email can help you stand out in a crowd of applicants. Your note doesn't have to be long—write a few lines reminding the person which job you applied for and thank them again for their time. Don't be afraid to follow up in a week if you haven't heard back from the company."
    },
    {
      "title": "Find out the requirements for the position so you know if you're a good fit.",
      "content": "Find out the requirements for the position so you know if you're a good fit. Get online and read about the company's values or what they're known for. Don't forget to read through the job descriptions, too! This can help you prepare for questions that an interviewer might ask and you'll come across as more confident and interested in the job. [7] X Expert Source Shannon O'Brien, MA, EdM Career Coach Expert Interview. 10 December 2019. For example, if the job description says you should have communication skills, talk about how great you are with people during your interview. Do you have friends that work for the company? Ask them how they like working there and if they have interview suggestions."
    },
    {
      "title": "Include your job experience, academic experience, and volunteer work.",
      "content": "Include your job experience, academic experience, and volunteer work. If you've had a job before, list your responsibilities and how long you worked there. If this will be your first job, fill your resume with important experiences like academic clubs you belong to, work you've done in your community like babysitting or volunteering, and leadership positions you have at school. [8] X Expert Source Shannon O'Brien, MA, EdM Career Coach Expert Interview. 10 December 2019. Bring your resume to the interview even if the application doesn't call for one. This sets you apart as being professional and will impress your interviewer. Don't have a resume? Don't worry! Ask a teacher or guidance counselor at your school to help out. They might even offer resume-writing workshops, which can help you with formatting and style issues."
    },
    {
      "title": "Bring the finished application with you to the interview so you're prepared.",
      "content": "Bring the finished application with you to the interview so you're prepared. Check over the application to make sure you filled in all of the details since leaving sections blank can reflect poorly on you. For example, if the application asks for references, list people who know you well and give their contact information. [9] X Research source Write clearly so the interviewer can easily read your application. Some companies might ask you to fill it out online and print it off. It's a good idea to let your references know that you've listed them on a job application so they can be prepared to give a character reference."
    }
  ]
}