{
  "url": "https://www.wikihow.com/Breed-Pets-on-The-Sims-3-Pets-(PC)",
  "title": "How to Breed Pets on The Sims 3 Pets (PC)",
  "steps": [
    {
      "title": "Breed your dogs.",
      "content": "Breed your dogs. With Sims, not every attempt results in pregnancy. But when your dog becomes pregnant, you get an on-screen message informing you. Another way to tell is if when pregnant, the interaction 'Try for baby' will not appear until after the dog has had her litters."
    },
    {
      "title": "When it's time, your female dog puts out a random number of puppies with a graphic flourish.",
      "content": "When it's time, your female dog puts out a random number of puppies with a graphic flourish. The pups will have some traits and markings from their parents or grandparents. They might also exhibit other random traits and markings. Puppies might even inherit the ability to do some tricks, if their parents or grandparents know some."
    },
    {
      "title": "You will get a message listing the number of litters and a reminder to name them.",
      "content": "You will get a message listing the number of litters and a reminder to name them. To do so, click on the puppies and click the name pet interaction."
    },
    {
      "title": "A new litter will result in the whole household getting the 'New puppies' powerful positive moodlet.",
      "content": "A new litter will result in the whole household getting the 'New puppies' powerful positive moodlet."
    },
    {
      "title": "Sims looks at puppies and (either autonomously or user directed) say Awwwwwww.",
      "content": "Sims looks at puppies and (either autonomously or user directed) say Awwwwwww. This results in the positive puppies moodlet."
    },
    {
      "title": "Breed your cats.",
      "content": "Breed your cats. Fortunately, cats never accidentally have kittens. Just as with dogs, you must deliberately breed your cats. Also, as with dogs, you need a doghouse on your lot before you can breed. That's right, a doghouse - well, technically, they're pet houses. But cats don't get their own private parlors of armor."
    },
    {
      "title": "As with dogs, cats retire to the privacy of the 'pet' house to conduct their courtship.",
      "content": "As with dogs, cats retire to the privacy of the 'pet' house to conduct their courtship. When they emerge, the female cat has a chance of being pregnant. If so, you will get a message telling you to prepare for kittens. When the cats are mates, ensure that their relationship bar is full. When it's full, and you have a pet house nearby, press the \"Try for kittens\". Get ready for kittens."
    },
    {
      "title": "As with other pets, cats don't make a huge fuss.",
      "content": "As with other pets, cats don't make a huge fuss. They just pop out a few kittens in a sparkly flourish. You then get to name the kittens."
    },
    {
      "title": "Kittens and puppies start eating solid food as soon as they are born.",
      "content": "Kittens and puppies start eating solid food as soon as they are born. Prepare to fill the bowls more often now."
    },
    {
      "title": "Breed your horses.",
      "content": "Breed your horses. You have several options when it comes to breeding horses. First, you could create a male and female horse and optionally set them to mate in edit relationships, which starts their relationship at a higher level than when you started. Then you need a box stall on your lot. Without a box stall, horses simply can't breed. If you have a pair of opposite gendered horses with a high enough relationship and a box stall, you can direct your horse to 'Try for baby'."
    },
    {
      "title": "They enter the box stall and the action is blocked out.",
      "content": "They enter the box stall and the action is blocked out. You can see the typical shower of hearts around the horses. Just as with Sims not every try for baby results in a baby. Keep trying in till you get the message telling you the mare is pregnant."
    },
    {
      "title": "After a few day the mare drops the foal and you can name it.",
      "content": "After a few day the mare drops the foal and you can name it. The foal will typically show characteristics of one or both parents. If the parent horse was trained, there is a chance the foal will inherit some of the relevant ability."
    },
    {
      "title": "You can also get a foal by breeding the mare at the equestrian center and have her bred there.",
      "content": "You can also get a foal by breeding the mare at the equestrian center and have her bred there. This results in a foal for the household. Offering a male as a stud will results in money, not a foal."
    },
    {
      "title": "Raise your new foal.",
      "content": "Raise your new foal. The new foal becomes playable member of the household. Foals have the same needs as horse expect, but they lack a thirst need. For foal, hunger and thirst are both fulfilled from either nursing from the mother or being bottle fed by Sims."
    },
    {
      "title": "Foals don't like being separated from their mothers, nor do mothers like to be separated from their foals.",
      "content": "Foals don't like being separated from their mothers, nor do mothers like to be separated from their foals. They each gain negative moodlets from separation, lose their socialization quickly and generally are not happy until they reunite."
    },
    {
      "title": "What happens if a foal is permanently separated from its mother by sale, adoption or death?",
      "content": "What happens if a foal is permanently separated from its mother by sale, adoption or death? The foal will miss its mother until it gains a friend or higher relationship with a household mare or ages up."
    }
  ]
}