{
  "url": "https://www.wikihow.com/Be-the-Skinny-Girl-in-School",
  "title": "How to Be the Skinny Girl in School",
  "steps": [
    {
      "title": "Eat smart.",
      "content": "Eat smart. When planning meals, try to think about the kinds of foods your body needs to function at its best. Every day, you should try to eat food from all of the main food groups: fruits, vegetables, grains, protein, and dairy. Your exact nutritional needs will depend on many factors, including your age, your weight, and your activity level. You can visit choosemyplate.gov to find out how much of eat food group the United States Department of Agriculture recommends for someone like you."
    },
    {
      "title": "Avoid empty calories.",
      "content": "Avoid empty calories. Empty calories come from foods that are high in calories, but low in nutrition. Try to avoid processed foods and foods that have added sugars. Keep in mind that you get calories from drinks too. Cutting out soda and other sugary drinks from your diet can help you lose weight. Full-fat dairy and fatty meats are also sources of empty calories. Swapping them out for low-fat dairy and lean meats will help you reduce your calorie intake, while still providing you with beneficial nutrients and allowing you to enjoy the same volume of food."
    },
    {
      "title": "Avoid skipping meals.",
      "content": "Avoid skipping meals. It's important to provide your body with regular nourishment. If you skip meals, you won't have as much energy. You may also disrupt your body's natural metabolism, which can make it more difficult to maintain a healthy weight. [1] X Research source"
    },
    {
      "title": "Be active.",
      "content": "Be active. Exercise is a vital component to a healthy lifestyle. Try playing a sport at school to keep you active. If competitive sports aren't for you, do something more independent, like jogging, riding your bike, or practicing yoga. If you're not used to exercise, start small. Going for a short walk is a great place to start. You can also do simple exercises, like sit-ups and push-ups, at home while you're watching television. [2] X Research source Ideally, you should aim for 60 minutes of exercise each day if you want to lose weight. It doesn't have to be 60 consecutive minutes, so feel free to break it up into smaller increments. For the best results, incorporate at least 150 minutes of moderate aerobic exercise or 75 minutes of intense aerobic exercise into your weekly routine. Moderate aerobic exercise can include activities like power walking or swimming. Intense aerobic exercise includes activities like running or dancing. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source It's also important to do some strength training in order to keep your muscles toned as you lose weight. Lifting free weights, using weight machines, or even lifting heavy objects while working outside all count as strength training. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Love yourself!",
      "content": "Love yourself! It's great that you want to get healthy, but try not to compare yourself to others or set unrealistic goals for your weight loss. People who have a positive self-image are better able to stick to healthy habits. To help maintain a positive body image, try reminding yourself every day about all of your positive traits, both physical and otherwise. It's also important to avoid people who have unhealthy relationships with food and to understand that the media often portrays women's bodies in a very unhealthy way. Think about consulting a doctor, wellness coach, or nutritionist to help you lose weight in a healthy way. A professional can help you analyze your habits, find out what's holding you back, and make sure you're not jeopardizing your health in any way. Get immediate help if you start to exhibit any signs of an eating disorder, such as having obsessive thoughts about food, practicing food rituals, severely restricting your calorie intake, exercising excessively, or binging and purging. [5] X Trustworthy Source National Eating Disorders Association Nonprofit organization dedicated to supporting individuals and communities affected by eating disorders Go to source"
    },
    {
      "title": "Eat foods that contain a lot of water.",
      "content": "Eat foods that contain a lot of water. Foods like watermelon, cucumber, lettuce, and broths contain a lot of water and relatively few calories. If you eat these foods before your main meal, they may satisfy you enough to prevent you from overeating. You can also try drinking water shortly before your meal. Sometimes your body mistakes thirst for hunger."
    },
    {
      "title": "Make sure you don't have any vitamin deficiencies.",
      "content": "Make sure you don't have any vitamin deficiencies. You may feel hungry if your body is craving nutrients, so it's important to see your doctor regularly and get periodic lab work to check for deficiencies. If you do have a vitamin deficiency, take the recommended supplements every day."
    },
    {
      "title": "Don't deprive yourself.",
      "content": "Don't deprive yourself. If you never allow yourself to enjoy food, you're more likely to give up on your healthy habits altogether. The key is to allow yourself to indulge in small amounts of the foods you crave every so often. [6] X Research source"
    },
    {
      "title": "Stop eating when you feel satisfied.",
      "content": "Stop eating when you feel satisfied. Instead of eating until you can't possibly eat any more, try to be more mindful and put the fork down as soon as you stop feeling hungry. [7] X Research source Make sure you don't eat too fast, or you might not realize that you have had enough. It's also important to make sure you are actually hungry before you start eating. Try to recognize if you are eating for emotional reasons, or just because you're bored. Once you recognize it, try to replace your snacking with a healthier alternative. Going for a walk can be a great distraction!"
    },
    {
      "title": "Control your portions.",
      "content": "Control your portions. Try to always be conscious of how much you are eating. Instead of eating your snack out of the bag and losing track of how much you've consumed, place an appropriate portion on a plate and then put the bag away. [8] X Research source"
    },
    {
      "title": "Dress for your body type",
      "content": "Dress for your body type . When you put an outfit together, try to think about balancing your upper and lower halves. If you are more bottom-heavy, draw attention to the upper half of your body with bright colors or bold prints. If you're more top-heavy, do the opposite."
    },
    {
      "title": "Wear the right shoes.",
      "content": "Wear the right shoes. Shoes with pointy toes and narrow heels will make your legs look longer and slimmer. [9] X Research source This effect is even more pronounced if you wear heels that are the same color as your skin."
    },
    {
      "title": "Create a focal point.",
      "content": "Create a focal point. If you want to draw attention away from a specific part of your body, wear articles of clothing that highlight other sections. For example, you could wear a top that displays your neck and collarbone in order to bring attention up to your face and away from the lower half of your body. [10] X Research source To avoid drawing unwanted attention to your midsection, avoid stark color contrasts between your top and your bottom. (This includes belts.)"
    },
    {
      "title": "Embrace shapewear.",
      "content": "Embrace shapewear. If you have some bulges you'd like to hide, invest in some high quality spandex shapewear. These are discreet undergarments that hug you in and make you look instantly slimmer, and they come in styles for all different body types. [11] X Research source"
    },
    {
      "title": "Choose the right jeans.",
      "content": "Choose the right jeans. Plain, straight-legged or boot-cut jeans in a dark wash are the most slimming. Avoid styles with embellishments. [12] X Research source"
    },
    {
      "title": "Wear clothes that fit right.",
      "content": "Wear clothes that fit right. Make sure your clothes are not creating unnecessary bulk, but are also not clinging to your every curve. If you're wearing one very tight article of clothing, make sure everything else is a bit looser. Avoid sagging and bulging by making sure your underwear fits properly too."
    },
    {
      "title": "Get the right hairstyle.",
      "content": "Get the right hairstyle. If you want your face to look slimmer, avoid short and stick-straight hairstyles. Long locks that have some waves or curls to them will give you the illusion of a slimmer face. Highlights may also help your face look slimmer."
    },
    {
      "title": "Contour with makeup",
      "content": "Contour with makeup . If you want your face to look instantly slimmer, try applying a bronzer to your cheek bones and under your jaw line. The contrast will help accentuate your natural bone structure. If you want to look slimmer in a bathing suit, you can also get a body contouring spray tan. By strategically applying different shades, the technician can make your whole body look slimmer. Call local tanning salons in your area to see if they offer this service."
    }
  ]
}