{
  "url": "https://www.wikihow.com/Connect-a-Logitech-Wireless-Mouse-to-a-Unifying-Receiver",
  "title": "2 Ways to Pair a Logitech Mouse to a Unifying Receiver",
  "steps": [
    {
      "title": "Install Logitech Unifying Software.",
      "content": "Install Logitech Unifying Software. Logitech's Unifying Software is available for all versions of Windows, including Windows 11 and Windows 10. If you have a Mac, you'll need to have macOS High Sierra or earlier—if you're using a more current version of macOS, use Using Logi Bolt instead. Go to https://support.logi.com/hc/en-us/articles/360025297913-Unifying-Software in a web browser. If you don't have a working mouse at all, check out our guides to using your computer without a mouse and clicking without a mouse . Click the drop-down menu at the top-left and select your operating system. Click Download Now and save the file to your computer. If you're using a Mac, unzip the file . Double-click the downloaded file. Follow the on-screen instructions to install."
    },
    {
      "title": "Open the Logitech Unifying Software and click Next.",
      "content": "Open the Logitech Unifying Software and click Next . If the software doesn't launch automatically, click Logitech Unifying Software in your Start menu or Applications folder to open it."
    },
    {
      "title": "Connect your Unifying receiver and click Next.",
      "content": "Connect your Unifying receiver and click Next . You can insert your Unifying receiver into any free USB port on your PC or Mac. If your receiver is not detected, it may not be a Unifying receiver. Look for an orange sun icon on the receiver—if you don't see this icon, this method won't work. If your receiver has a yellow lightning bolt, you have a Logi Bolt receiver. In this case, you can connect a Logi Bolt-compatible mouse using the Logi Bolt App . If you have a Logitech mouse that was previously connected to your computer, it may be displayed on-screen along with any compatibility information. [1] X Expert Source Spike Baron Network Engineer & Desktop Support Expert Interview. 9 January 2019. If your mouse is compatible with the receiver, click Next to continue. [2] X Research source"
    },
    {
      "title": "Restart your mouse.",
      "content": "Restart your mouse. Your Logitech wireless mouse has an on/off switch on the bottom. Turn the mouse over and flip the switch off and then back on again. Your mouse should pair with the receiver automatically. [3] X Expert Source Spike Baron Network Engineer & Desktop Support Expert Interview. 9 January 2019. If your mouse is not found, it is not Unifying-compatible, or you need to replace (or charge) its batteries."
    },
    {
      "title": "Check to see if the cursor on the screen is moving.",
      "content": "Check to see if the cursor on the screen is moving. Move the mouse and check to see if the cursor on-screen is moving. [4] X Expert Source Spike Baron Network Engineer & Desktop Support Expert Interview. 9 January 2019."
    },
    {
      "title": "Select \"Yes\" and then click Next.",
      "content": "Select \"Yes\" and then click Next . If the cursor on-screen moves when you move the mouse, click the radio option next to Yes to indicate the correct device is connected. Then click Next ."
    },
    {
      "title": "Click Finish.",
      "content": "Click Finish . It's in the lower-right corner. Your Logitech mouse is now connected to the unifying receiver and ready to use. [5] X Research source"
    },
    {
      "title": "Install the Logi Bolt app.",
      "content": "Install the Logi Bolt app. Logi Bolt allows you to connect your compatible Logitech mouse to a Unifying or Logi Bolt receiver. [6] X Research source Keep in mind that if you have a Unifying receiver (the kind with the yellow sun on the housing), you'll only be able to connect a Unifying mouse to it—not a Logi Bolt mouse (and vice-versa). To download: Go to https://support.logi.com/hc/en-us/articles/4418089333655-Logi-Bolt-App . If you don't have a working mouse at all, check out our guides to using your computer without a mouse and clicking without a mouse . Select your operating system from the drop-down menu at the top-left. Click Download Now to save the file to your computer. If you're using a Mac, unzip the file . Double-click the downloaded file, and follow the on-screen instructions to install."
    },
    {
      "title": "Open Logi Bolt.",
      "content": "Open Logi Bolt. Once installed, click Logi Bolt in your Windows Start menu or your Mac's Applications folder."
    },
    {
      "title": "Click ADD NEW DEVICE.",
      "content": "Click ADD NEW DEVICE . A list of receivers will appear."
    },
    {
      "title": "Select Logi Unifying Receiver.",
      "content": "Select Logi Unifying Receiver . Alternatively, if you have a Logi Bolt or Logi USB receiver connected, select that receiver instead."
    },
    {
      "title": "Turn your mouse off and back on.",
      "content": "Turn your mouse off and back on. Your Logitech wireless mouse has an on/off switch on the bottom. Turn the mouse over and flip the switch off and then back on again. Your mouse should pair with the receiver automatically. [7] X Research source Follow the on-screen instructions to test your mouse and close the installer."
    }
  ]
}