{
  "url": "https://www.wikihow.com/Check-Data-Usage-on-an-iPhone",
  "title": "4 Easy Ways to See Data Usage on iPhone (All Major Carriers)",
  "steps": [
    {
      "title": "Open Settings.",
      "content": "Open Settings. It's a grey app with gears that you'll likely find on the Home Screen."
    },
    {
      "title": "Tap Cellular.",
      "content": "Tap Cellular . This option is near the top of the Settings page. On some iPhones, you may see Mobile Data instead. [1] X Research source"
    },
    {
      "title": "Scroll down to view the \"Cellular Data\" section.",
      "content": "Scroll down to view the \"Cellular Data\" section. You'll see two options listed below this heading: Current Period , which reflects all data usage since you last cleared your data usage statistics, and Current Period Roaming , which shows data usage for areas in which your phone wasn't covered by the carrier (e.g., international travel). Current Period data does not automatically reset for your billing cycle. You can reset your data usage statistics by tapping Reset Statistics at the bottom of the page. Data may be listed differently on different cellular carriers and data plans. If you do not see \"Current Period\", tap Usage below the header with your carrier's name to view your data usage."
    },
    {
      "title": "View the list of apps that use Cellular Data.",
      "content": "View the list of apps that use Cellular Data. These will be listed beneath the APPS BY USAGE heading; any app with a green switch to its right is able to use data. The number below an app's name reflects how many kilobytes (KB), megabytes (MB), or gigabytes (GB) that app has used since the \"Current Period\" was last reset. If \"System Services\" appears below APPS BY USAGE , this displays how much data your phone's features have used. Tap System Services to see a list of features and how much data they each use. Tap SORT BY to toggle sorting between Name and Usage . To stop an app from using cellular data, tap the switch to toggle it to the off position (gray)."
    },
    {
      "title": "Call your carrier's data hotline.",
      "content": "Call your carrier's data hotline. While checking the data usage in your Settings will show you how much you've used, it won't show you what your limit is, and sometimes the date and measurement is off compared to your carrier. You can quickly check how close you are to your monthly limit by entering the code for your carrier into the Phone app: Verizon - Dial #DATA or #3282 and press the Call button. You will receive a text message showing all your usage details for that billing cycle. AT&T - Dial *DATA# or *3282# and press the Call button. You will receive a text message showing how much data you've used versus your monthly limit. T-Mobile/Sprint - Dial #WEB# or #932# and press the Call button. You will receive a text message showing how much data you've used versus your monthly limit. [2] X Research source Vodafone Idea (VI) - Dial *199# and press the Call button. Select the option for data balance. You will receive a reply with your usage. [3] X Research source"
    },
    {
      "title": "Download your carrier's app from the App Store.",
      "content": "Download your carrier's app from the App Store . Most cellular carriers have an app you can download to your iPhone; once you do so, you'll be able to monitor your data usage and plan information from within the app. Verizon - Download the My Verizon app. T-Mobile - Download the T-Mobile app. AT&T - Download the myAT&T app. TELUS (CA) - Download the TELUS My Account app. Vodafone - Download the My Vodafone app. Rogers (CA) - Download the MyRogers app."
    },
    {
      "title": "Contact your carrier directly.",
      "content": "Contact your carrier directly. If all else fails, calling your carrier's support line or going to your local carrier's store directly will allow them to tell you how much data you've used and how much remains in your current cycle, as well as upgrade your plan if you feel it would be beneficial. Verizon : 1-800-922-0204 AT&T : 1-800-331-0500 T-Mobile/Sprint : 1-800-937-8997 Telus : 1-866-558-2273 Rogers (CA) : 1-888-764-3771"
    }
  ]
}