{
  "url": "https://www.wikihow.com/Bet-on-Draftkings",
  "title": "A Beginner’s Guide to Betting on DraftKings",
  "steps": [
    {
      "title": "Click the sport and game you want to bet on.",
      "content": "Click the sport and game you want to bet on. Go to the DraftKings homepage on a browser or open their mobile app. Log in (jump to our section on how to set up your account if needed), then use the menu on the left-hand side of the game to choose the sport you want to bet on. [1] X Research source At the top of the left-most menu you’ll see a list of popular options, like NBA, Boxing, and College Baseball. Below that, you’ll see a “Sports Teams” link, where you can search for your favorite team. Below that, you’ll find a list of all of the available sports listed A–Z."
    },
    {
      "title": "Choose your game and the type of bet you want to make.",
      "content": "Choose your game and the type of bet you want to make. When you click on a sport, the homepage will show a list of games being played that day, and usually a few for the following day. Beside each game, you’ll see 3 betting options for each team—these can sometimes vary a little by game, but in general, they’ll be “Spread,” “Total,” and “Moneyline.” We’ll go over the types of bets a little later if you’re not sure which to choose. If you’d like to make multiple bets (or place a parlay bet), you can click on up to 12 betting options at the same time."
    },
    {
      "title": "Use the odds to help you decide how much to wager.",
      "content": "Use the odds to help you decide how much to wager. Beside each type of bet, you’ll see green numbers with a + or -. These are the odds—use these to see how much you would win based on your wager amount. DraftKings defaults to the American odds system, which is based on $100 bets. [2] X Research source If a wager has a negative number—say -110—that means you would have to bet $110 to win $100 (for a total payout of $210). If a wager has a positive number—say +110—that means if you bet $100 and won, you would win $110 (for a total payout of $210)."
    },
    {
      "title": "Enter your bet in the “bet slip” in the upper right-hand corner.",
      "content": "Enter your bet in the “bet slip” in the upper right-hand corner. After you choose a betting option, you’ll see a white box pop up in the upper right-hand corner of the screen. This is your betting slip. Enter the amount you want to bet—you’ll see your potential payout based on the odds for that wager. [3] X Research source On the bet slip, you’ll have the option to place a single bet, bet a parlay (where you bet on multiple outcomes that all have to win), or a round robin, which is multiple parlays in one bet. If you have any rewards, you can check them from your bet slip by clicking the Moneybag symbol (if you’re on the app) or the “Bonus Available” dropdown (if you’re on a browser). Once you’re happy with your wager, click the green “Place Bet” button. [4] X Research source"
    },
    {
      "title": "Use the “My Bets” tab to track your bet.",
      "content": "Use the “My Bets” tab to track your bet. At the top of the screen, you’ll see a tab that says “My Bets.” When you click that, you’ll be able to see any live bets, as well as your upcoming bets and bets that you’ve already won or lost. [5] X Research source There are options to filter your bets to make it easier to navigate. [6] X Research source"
    },
    {
      "title": "Transfer any winnings to your bank account.",
      "content": "Transfer any winnings to your bank account. On the homepage, click on your profile photo, then choose the “Withdraw” option. Once you’re on the “Withdraw Funds” page, enter the amount you want to withdraw, click “Continue,” and choose where you want your winnings to go. Once everything’s set up, click “Request Withdrawal.” [7] X Research source There are limits to how much you can withdraw in a single transaction. For instance, you can withdraw up to $100,000 directly to your bank account, $60,000 to a PayPal account, $25,000 to a debit card, and $20,000 to a Venmo account. [8] X Research source Depending on your withdrawal method, it can take up to 5 days for your withdrawal to be processed. [9] X Research source"
    },
    {
      "title": "Spread",
      "content": "Spread A spread bet is a bet on who will win the game and by how much. You’ll see the point spread listed as a +/- number. The team with the + is the underdog, or the team that’s projected to lose, while the team with the - is the favorite to win. To win a spread bet, the team you pick has to win by more points (or lose by fewer points) than the spread. [10] X Research source If Team A has -5 points and Team B has +5 points, Team A is expected to win the game by 5 points. If you bet on Team A and they win by 6 points or more, you’ll win your bet. If they only win by 4 points, you lose. If they win by exactly 5 points, it’s considered a push and you’ll get your bet back."
    },
    {
      "title": "Total (Over/Under)",
      "content": "Total (Over/Under) A total bet, also called an over/under bet, is a bet on the total number of points that will be scored in the game. It doesn’t matter who scores the points, and it doesn’t matter who wins. [11] X Research source If a game is projected to have 100 total points, the “over” bet will win if the game ends and the combined score is 101 points or more, and the “under” bet will win if the combined score is 99 points or less. If the game ends and both teams scored a combination of exactly 100 points, it’s a push and your bet will be returned. If the game goes into overtime, those points will count toward the over/under."
    },
    {
      "title": "Moneyline",
      "content": "Moneyline Moneyline bets are pretty simple—you’re just betting on who you think will win the game. If you bet correctly, your winnings will be based on the odds that have been set by the Sportsbook. There are two types of Moneyline bets: [12] X Research source 2-way Moneyline bets: You’re betting on the teams to win or lose. If there’s a tie, you get your bet back. 3-way Moneyline bets: In addition to a win/lose scenario, you’re also betting on the game ending in a tie."
    },
    {
      "title": "Team props and player props",
      "content": "Team props and player props Props are special bets on what a specific team or player will do during a game. For instance, you might bet on how many home runs a team will score in baseball or how many assists a certain player will get in a basketball game. [13] X Research source"
    },
    {
      "title": "Bet on one sport that you’re familiar with.",
      "content": "Bet on one sport that you’re familiar with. When you’re first getting started with online sports betting, it’s a good idea to focus on one main sport—preferably one you already watch and know a lot about. That makes it easier to research the teams and players that you’ll be betting on, which gives you a better chance of winning. [14] X Research source If you’re an avid baseball fan, you probably already know which teams are doing well, which are suffering from player injuries, and which underrated player just got traded—giving you an edge from the start."
    },
    {
      "title": "Research the players and games.",
      "content": "Research the players and games. Betting on sports isn’t an exact science, and the sportsbooks won’t always get it right. Sometimes, you’ll be able to win because your research gives you insight into what will happen. For instance, you might notice that the Arizona Diamondbacks are the favorite to win an away game against the Detroit Tigers, but that it’s going to snow and the Tigers have an open stadium. That might give the Tigers an edge, so you might bet against the odds that they’ll win."
    },
    {
      "title": "Check out the DraftKings Promos page to see if any offers apply to you.",
      "content": "Check out the DraftKings Promos page to see if any offers apply to you. DraftKings regularly has special promotions where you can earn credits, bonus bets, or crowns (rewards for placing bets that you can exchange for bonus cash). These promos include bonuses for referring a friend, new player bonuses, weekly prize chests, and more."
    },
    {
      "title": "Use teasers to make bets easier to win.",
      "content": "Use teasers to make bets easier to win. A teaser bet is a type of parlay, where you bet on two teams and adjust the point spread to make it more likely that you’ll win. For instance, if the over/under of a football game is 12, you might place a teaser bet that brings it down to 6. [15] X Research source In exchange for taking an easier bet, you’ll also receive a lower payout."
    },
    {
      "title": "Don’t bet more than you can afford to lose.",
      "content": "Don’t bet more than you can afford to lose. Decide ahead of time how much you’re willing to spend on online sports betting, and do not go over that amount. Don’t keep betting to make up for your losses, and don’t deposit more money if you’ve already spent your budget. It’s a good idea to only wager a certain amount of your total betting budget at any one time—typically only 1–5%. That means if you have $200 to bet with, each individual wager would be somewhere between $2 and $10. [16] X Research source On DraftKings, you can set a variety of limits to help you control your spending, including limits on how much you can deposit or wager at a time or how much time you have to wait between bets. If your betting is getting out of hand, you can even set a cool-off period or self-exclude yourself entirely."
    },
    {
      "title": "Get help if you’re addicted to gambling.",
      "content": "Get help if you’re addicted to gambling. If you’re spending more on sports betting than you should, you feel like you have to hide your gambling, or you’ve tried to quit and can’t, you might have a gambling addiction. Try talking to your friends and family, and stay away from gambling websites or places that allow in-person gambling. [17] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You can also reach out to a peer support group or a mental health professional who specializes in gambling addiction. If you need someone to talk to, call the National Problem Gambling Hotline at 1-800-GAMBLER. [18] X Research source"
    },
    {
      "title": "Make sure you’re in a state where DraftKings online betting is legal.",
      "content": "Make sure you’re in a state where DraftKings online betting is legal. You don’t have to reside in a state where online sports betting is legal, but you do have to be physically present in a legal state before you can place a bet. [19] X Research source If you’re not sure whether DraftKings is legal in your state, you can check out this list . If you place a bet, then leave the state and go into a state where online sports betting isn’t legal, your existing wager will still be valid, but you won’t be able to place new ones. [20] X Research source"
    },
    {
      "title": "Sign up for an account and verify your identity.",
      "content": "Sign up for an account and verify your identity. To sign up for a DraftKings account, you’ll need to enter your email address, create a username and password, and enter your phone number. After that, enter your personal information, like your name, date of birth, last 4 digits of your social, and your home address."
    },
    {
      "title": "Link your payment method and make a deposit.",
      "content": "Link your payment method and make a deposit. After you log in to your account, the green “Log in” button will turn into a green “Deposit” button. DraftKings allows numerous payment types. You can link your bank account or deposit money with a debit or credit card, PayPal account, Venmo account, and more. [21] X Research source Be aware that there may be fees for using certain types of payments, like credit cards."
    },
    {
      "title": "When are the odds posted for a certain game?",
      "content": "When are the odds posted for a certain game? In general, DraftKings will post the odds for a daily game (like basketball or baseball) between 12–20 hours before the game starts. For a weekly game like football, the odds will be posted 6–7 days before the game. [22] X Research source"
    },
    {
      "title": "What if I bet on a player who doesn’t start or is removed?",
      "content": "What if I bet on a player who doesn’t start or is removed? If you place a player prop bet and the player doesn’t start the game at all, your bet will be returned. If they do play but they’re later taken out of the game, your bet will stand. [23] X Research source"
    },
    {
      "title": "How old do you have to be to bet on DraftKings?",
      "content": "How old do you have to be to bet on DraftKings? You have to be at least 21 and live in a state where online sportsbook betting is legal to use DraftKings online betting."
    },
    {
      "title": "How do you cancel a bet that you placed on DraftKings?",
      "content": "How do you cancel a bet that you placed on DraftKings? Once you place a bet with DraftKings, it can’t be canceled. But you may be given an option to Cash Out your bet before the game goes live, so keep an eye on your My Bets page. [24] X Research source"
    },
    {
      "title": "How do you get free bets on DraftKings?",
      "content": "How do you get free bets on DraftKings? DraftKings sometimes offers Bonus Bets as part of a reward or promotion. If you have any Bonus Bets, they’ll be listed on your Rewards page. To use a Bonus Bet, choose the wager you want to make, then go to your Bet Slip and slide the toggle next to the Bonus Bet to activate it. [25] X Research source"
    },
    {
      "title": "How do I bet on DraftKings out of state?",
      "content": "How do I bet on DraftKings out of state? You have to physically be located in a state that allows online sportsbook betting in order to legally place a bet on DraftKings. If you’re in a state that doesn’t allow sports betting, you can still log into your account and deposit or withdraw funds, but you can’t make new wagers. [26] X Research source"
    }
  ]
}