{
  "url": "https://www.wikihow.com/Clean-Gel-Nails",
  "title": "How to Clean Gel Nails at Home",
  "steps": [
    {
      "title": "Use nail polish remover or rubbing alcohol to wipe away fresh marks.",
      "content": "Use nail polish remover or rubbing alcohol to wipe away fresh marks. Dip a cotton ball in nail polish remover or rubbing alcohol. Then, lightly dab at the stain or mark on the gel nail. [1] X Expert Source Mia Rubie Nail Artist Expert Interview. 23 April 2020. However, don't rub too vigorously, so that you don’t remove the gel color. [2] X Research source This works best if you use the nail polish remover or rubbing alcohol very soon after the stain appears on your nail."
    },
    {
      "title": "Spray your gel nail with hairspray to remove stubborn stains.",
      "content": "Spray your gel nail with hairspray to remove stubborn stains. Lay a towel down on a table and place your hand on top. Spray hairspray over the nail with the stain until the nail looks wet. Use a cotton swab to remove the hairspray, which should remove the stain as well. Wash your hands well with soap and water to get the hairspray off of your hand. [3] X Research source You shouldn’t need to rub the gel nail harshly to get the marking off of it."
    },
    {
      "title": "Soak your nail in water and tea tree oil for a natural fix.",
      "content": "Soak your nail in water and tea tree oil for a natural fix. Fill a regular-sized bowl with water and add 3-4 drops of tea tree oil to it. Place the gel nail that needs to be cleaned in the bowl, letting it soak for at least 5 minutes. Wash your hands after removing the nail from the mixture. [4] X Research source If the stain is still there, do the same process over again once a day for several days."
    },
    {
      "title": "Visit your nail salon if you can’t remove the stain yourself.",
      "content": "Visit your nail salon if you can’t remove the stain yourself. Sometimes a mark or stain on your gel nail just won’t come out using at-home remedies, which is when it’s time to turn to professionals. See if your nail salon will redo the one nail that was damaged so that your nail will look good as new. [5] X Research source Some nail salons will do this for free while others will charge a small fee, so ask your nail salon before committing to redoing the nail."
    },
    {
      "title": "Soak your nails in lemon juice and baking soda to remove discoloration.",
      "content": "Soak your nails in lemon juice and baking soda to remove discoloration. Fill a bowl with 1 cup (240 mL) of water. Add the juice from half a lemon and 1 tbsp (8 g) of baking soda. Stir to create a soaking solution. Soak your nails for 15-20 minutes, then rinse with fresh water. [6] X Research source Lemon is a natural stain remover and can remove yellow stains. It's often used as a whitener! Baking soda is also a stain remover."
    },
    {
      "title": "Buff the top of your gel manicure to remove the dingy layer.",
      "content": "Buff the top of your gel manicure to remove the dingy layer. Use a high-grit buffer, such as a 220 or greater. Lightly rub the buffer over the surface of the gel until the dingy layer is gone. You should see the original color of the gel return. [7] X Expert Source Mia Rubie Nail Artist Expert Interview. 23 April 2020."
    },
    {
      "title": "Apply a layer of topcoat over your manicure after you buff it.",
      "content": "Apply a layer of topcoat over your manicure after you buff it. Lightly brush a thin layer of top coat over your nails, then let it completely dry. [8] X Research source This will protect the manicure and help prevent it from getting dingy again. It will also restore the shine to your nails. [9] X Expert Source Mia Rubie Nail Artist Expert Interview. 23 April 2020. You can use your normal top coat over the gel polish. Continue to add a layer of topcoat every few days to keep your manicure looking fresh!"
    },
    {
      "title": "Use a nail file to remove the glossy sheen from your nails.",
      "content": "Use a nail file to remove the glossy sheen from your nails. Rub your nail file against the surface of the gel, filing it until the surface is a bit rough and no longer shiny. This ensures the acetone will reach past the glossy outer coat to remove the gel."
    },
    {
      "title": "Cut pieces of aluminum foil to fit around each nail.",
      "content": "Cut pieces of aluminum foil to fit around each nail. You’ll need 10 pieces of foil, cut just large enough to wrap around each nail separately. Use scissors to cut the foil and put the foil to the side once you’re done. A piece of foil that’s roughly 2 by 4 inches (5.1 by 10.2 cm) should work well."
    },
    {
      "title": "Place cotton balls soaked in acetone on each nail.",
      "content": "Place cotton balls soaked in acetone on each nail. The cotton balls don’t need to be soaking wet, but they should be damp. Place the acetone-soaked side of the cotton ball on the gel to ensure it gets the best treatment."
    },
    {
      "title": "Wrap a piece of foil around each nail to keep the cotton ball in place.",
      "content": "Wrap a piece of foil around each nail to keep the cotton ball in place. Use the pieces of aluminum foil you cut to wrap the cotton balls securely on your nails. If the piece of foil is big enough, you should only have to squeeze each piece around your finger for it to stay in place. Make sure all of the cotton ball is covered up with foil for the best hold."
    },
    {
      "title": "Let the cotton sit for 10-15 minutes before removing the foil.",
      "content": "Let the cotton sit for 10-15 minutes before removing the foil. Set a timer so that you remember when to remove the foil from your nails. When you do remove the foil, look to see if the gel is peeling off of your nails."
    },
    {
      "title": "Push the leftover gel off of your nails gently.",
      "content": "Push the leftover gel off of your nails gently. You can do this using a gel remover tool, or another tool you have around the house that will safely remove the gel without harming your nails. If you’re not able to push the gel off easily, your nails aren’t ready and should be soaked in acetone a little while longer."
    },
    {
      "title": "Wear rubber gloves when doing housework.",
      "content": "Wear rubber gloves when doing housework. This includes doing the dishes or whenever you’re using harsh chemicals. The chemicals, as well as hot water, can damage the gel and cause your manicure to last a shorter amount of time. Pick up rubber gloves at a grocery store or big box store."
    },
    {
      "title": "Wash your hands quickly after you apply makeup or facial creams.",
      "content": "Wash your hands quickly after you apply makeup or facial creams. Your nails can soak up your makeup or the chemicals in your facial creams, especially alpha hydroxy acids (AHAs). If these products sit on your hands, they can damage your gel or make it look dirty."
    },
    {
      "title": "Coat your cuticles in cuticle oil to keep them healthy.",
      "content": "Coat your cuticles in cuticle oil to keep them healthy. Cuticle oil often comes in a bottle that resembles a regular nail polish bottle, making it easy to brush the oil onto your cuticles. Rub the oil around on your cuticles once you’ve applied it to ensure it’s covering your whole nail. [10] X Research source Look for cuticle oil at a drugstore, big box store, or beauty store."
    },
    {
      "title": "Use lotion to nourish your nails and hands.",
      "content": "Use lotion to nourish your nails and hands. This will keep your cuticles and the skin around your nails hydrated and healthy, which is important since the gel process is very drying. Use a regular hand lotion or a lotion designed specifically for nails. [11] X Research source"
    },
    {
      "title": "Apply a top coat to your nails to keep them from chipping.",
      "content": "Apply a top coat to your nails to keep them from chipping. You don’t need to do this super often, just once or twice a week if you notice your nails losing their shine or starting to chip. Apply it in a thin, even layer to every nail for the best results. Look for a nail top coat at a drugstore, beauty store, big box store, or grocery store."
    }
  ]
}