{
  "url": "https://www.wikihow.com/Check-Your-Car%27s-Differential-Gear-Oil",
  "title": "How to Check Your Car's Differential Gear Oil",
  "steps": [
    {
      "title": "Park the car on an even, solid surface.",
      "content": "Park the car on an even, solid surface. Checking your car's differential oil will require jacking it up to a height that you can work on. It also has to be completely level in order to get an accurate idea of how much fluid is inside it. Find an even surface that is strong enough to support the weight of the vehicle beneath a jack and jack stands. [2] X Research source Concrete or black top are the best surfaces to use.. Never jack up a vehicle on grass, dirt or gravel as the jack may topple over."
    },
    {
      "title": "Jack up one rear wheel.",
      "content": "Jack up one rear wheel. Slide a scissor or trolley jack beneath one of the designated jack points on the rear of the vehicle. Lift the vehicle up high enough for you to access the rear differential comfortably and safely. [3] X Research source If you are unsure where to locate your car's designated jack points, refer to the owner's manual for guidance. The height required to comfortably access the differential will vary from vehicle to vehicle."
    },
    {
      "title": "Place a jack stand beneath the car.",
      "content": "Place a jack stand beneath the car. Once you have jacked up one side of the car high enough to work beneath it, you'll need to place a jack stand beneath it so you can lift the opposite side. Slide the jack stand under one of the vehicle's jack points and raise it to the appropriate height to come into contact with the bottom of the car. [4] X Research source Lower the car slowly onto the jack stand, to ensure it is placed properly and will support the weight of the vehicle."
    },
    {
      "title": "Jack up the other side of the car.",
      "content": "Jack up the other side of the car. With the jack stand in place on one side, find the designated jack point on the other side of the car and raise it as well. At this point, the rear of the vehicle should be in the air. Place another jack stand beneath this side of the vehicle to support it as you did on the other side. [5] X Research source While you can sometimes raise the entire rear end of the vehicle from jacking it up from a mid-point, there is a higher likelihood of the vehicle tipping off of the jack and getting damaged when doing so. Be sure the jack stands are holding the vehicle and that it is stable."
    },
    {
      "title": "Repeat the process on the front of the vehicle.",
      "content": "Repeat the process on the front of the vehicle. The entire car will need to be off the ground and level in order to accurately check the level of gear oil in the differential, so all four wheels will have to be off the ground. Jack up the front of the vehicle and place jack stands beneath it to support its weight. [6] X Research source Be sure all of the jack stands are set to the same height so the vehicle is as close to level as possible. If you have access to a lift, it is a much faster and easier way to raise the vehicle at an even height."
    },
    {
      "title": "Locate the rear differential.",
      "content": "Locate the rear differential. Only vehicles that are powered by their rear wheels or all four wheels will have a rear differential. You can locate it by following the drive shaft that travels the length of the car, from the transmission to the rear differential, or by looking for the pumpkin shaped metal object mounted between the rear wheels. [7] X Research source The rear differential is easy to identify, as it connects the transmission to the wheels. Because of its vaguely pumpkin-like shape, rear differentials are often referred to as a car's “rear pumpkin.”"
    },
    {
      "title": "Find the fill/service port on the differential.",
      "content": "Find the fill/service port on the differential. Once you find the differential, visually inspect it for signs of damage and to locate the drain and filler plugs. The drain plug is located on or near the bottom of the differential while the filler/service plug will be on the side and closer to the top. [8] X Research source If the rear differential has been damaged, it will require service from a professional. The fill/service plug is usually not a traditional looking bolt, but rather has an opening for a 3/8 inch drive ratchet."
    },
    {
      "title": "Clean the area around the service port.",
      "content": "Clean the area around the service port. When you open the fill/service port to check the fluid levels, dirt and debris surrounding the port could fall into it, potentially causing damage to the gears inside. To prevent this, clean the area surrounding the service port with brake cleaner and a steel bristled brush. [9] X Research source The brake cleaner will evaporate quickly, leaving a dry surface. Use the brush to remove large deposits of stuck on dirt."
    },
    {
      "title": "Open the fill/service port.",
      "content": "Open the fill/service port. Insert a 3/8 inch drive ratchet (without a socket) into the hole in the service port and turn it counter clockwise (left) to loosen it. It may require a fair amount of force to loosen, as some of the road grime may have caked into the gap between the plug and the differential. [10] X Research source In some applications, the plug may be a bolt. In these cases, find the appropriate sized socket to remove the bolt. Be extremely careful not to strip the bolt. Be sure to use the correct size socket."
    },
    {
      "title": "Check the fluid level with your finger.",
      "content": "Check the fluid level with your finger. The gear oil in the rear differential should reach the bottom of the service port hole. Insert one finger into the open service port. Bend your finger downward slightly to see if it comes into contact with gear oil. [11] X Research source If your finger touches gear oil, there is enough fluid inside. If the fluid level doesn't reach the service port, it is low."
    },
    {
      "title": "Purchase the correct type of gear oil.",
      "content": "Purchase the correct type of gear oil. It is absolutely imperative that you refill the gear oil in your car's rear differential with the correct type of fluid. Refer to the owner's or service manual for your car in order to find the correct type of gear oil to purchase. [12] X Research source You can also ask the clerk at your local auto parts store to assist you in finding the right gear oil. Purchase gear oil that comes in a squeezable plastic bottle with a spout unless you have an oil pump to use."
    },
    {
      "title": "Insert the spout into the filler/service port.",
      "content": "Insert the spout into the filler/service port. Open the container of rear differential gear oil and insert the end of the long spout into the open filler/service port. Squeeze the bottle slowly to push the oil out of the bottle and into the differential until fluid begins to leak out of the hole. [13] X Research source Make sure to wipe up any fluid that leaks out of the open service port. If the differential takes an entire bottle of gear oil, you may want to have the differential looked at by a mechanic to address any possible leaks."
    },
    {
      "title": "Replace the filler plug.",
      "content": "Replace the filler plug. Once the differential is full, reinsert the plug for the filler/service port and turn it clockwise (to the right) until it is tight. Use the appropriate wrench to tighten it enough to ensure it won't vibrate loose as you drive. [14] X Research source Do not overtighten the plug, it needs only to be tight enough to be secure. Remove the jack stands and lower the vehicle back to the ground."
    }
  ]
}