{
  "url": "https://www.wikihow.com/Connect-Broadband-to-Dish-Network-Receiver",
  "title": "Connect Broadband to DISH Network Receiver: Wi-Fi & Ethernet",
  "steps": [
    {
      "title": "Determine the distance between your router and your DISH receiver.",
      "content": "Determine the distance between your router and your DISH receiver. Ethernet cables can transmit a signal for over 100 meters, but if your DISH receiver is in a different room than your router, you may need to buy an extra-long cable and run it along the floor (or the ceiling) or thread it through the walls. You can buy Ethernet cables at most stores that have tech or electrical departments, though it may be cheaper to buy an Ethernet cable online in an environment such as Amazon. If you have an option, opting for an Ethernet cable with PVC shielding will prevent the cable from tearing or breaking if you accidentally trip over it."
    },
    {
      "title": "Connect the Ethernet cable to your router.",
      "content": "Connect the Ethernet cable to your router. Plug one end of the Ethernet cable into one of the free \"Internet\" ports on the back of your router."
    },
    {
      "title": "Plug the other end of the Ethernet cable into your receiver.",
      "content": "Plug the other end of the Ethernet cable into your receiver. It should plug directly into the Ethernet port on the back of the receiver. As long as your router is on and both ends of the Ethernet cable are securely connected, you should now have hard-wired Internet on your DISH TV."
    },
    {
      "title": "Insert a wireless adapter into the front or back USB port.",
      "content": "Insert a wireless adapter into the front or back USB port. To connect your receiver to Wi-Fi, you'll need a wireless adapter. Currently, the Netgear model WNDA3100v2 is the only Wi-Fi adapter supported by Dish Network. [1] X Research source You can buy this adapter from the DISH online store; it should plug into the USB port on the back of your receiver. This method will work on any Hopper, Hopper Plus, and Wally receiver. You won't need an external wireless receiver for Hopper 3, Hopper Duo, or Hopper with Sling receivers, as Wi-Fi is already built into the receiver. [2] X Research source"
    },
    {
      "title": "Turn on your TV and select the receiver's input if necessary.",
      "content": "Turn on your TV and select the receiver's input if necessary. Press your TV's Power button, then switch the input to select the HDMI channel (or other connection) that you use for your receiver."
    },
    {
      "title": "Bring up the DISH menu.",
      "content": "Bring up the DISH menu. Depending on your remote , you'll either press the MENU button once or press the HOME button twice."
    },
    {
      "title": "Select Settings.",
      "content": "Select Settings . You'll find it near the top of the screen. To select it, use your remote's arrows to move the selection to cover it, then press OK or ENTER ."
    },
    {
      "title": "Select Internet.",
      "content": "Select Internet . This option is near the top of the Settings page."
    },
    {
      "title": "Select Wireless Setup.",
      "content": "Select Wireless Setup . It's in the lower-right corner of the screen. Doing so brings up a list of wireless options. If your wireless router has a WPS button, you can select WPS Setup to easily connect your receiver to Wi-Fi without having to type the password manually. Select this option, then press your router's WPS button."
    },
    {
      "title": "Select WI-FI SETUP WIZARD.",
      "content": "Select WI-FI SETUP WIZARD . This option is near the top of the screen."
    },
    {
      "title": "Select a Wi-Fi network.",
      "content": "Select a Wi-Fi network. Choose a network from the list of available networks and then select Next ."
    },
    {
      "title": "Enter your Wi-Fi password and select Save.",
      "content": "Enter your Wi-Fi password and select Save . Using the on-screen keyboard, type in your wireless network's password. If you used the WPS option, this part won't be necessary. Once you select Save , your DISH receiver will be connected to the internet via Wi-Fi."
    },
    {
      "title": "Understand that Joey receivers connect automatically.",
      "content": "Understand that Joey receivers connect automatically. Unless you haven't finished setting up your Joey receiver or it's disconnected from the Hopper, it should currently be connected to the Internet. The only exception to this rule is if the receiver's \"Bridging\" feature is disabled; if so, you can re-enable Bridging from your receiver's settings. [3] X Research source"
    },
    {
      "title": "Turn on your TV and select the receiver's input if necessary.",
      "content": "Turn on your TV and select the receiver's input if necessary. Press your TV's Power button, then switch the input to select the HDMI channel (or other connection) that you use for your receiver."
    },
    {
      "title": "Bring up the DISH menu.",
      "content": "Bring up the DISH menu. Depending on your remote, you'll either press the MENU button once or press the HOME button twice."
    },
    {
      "title": "Select Settings.",
      "content": "Select Settings . It's at the top of the screen."
    },
    {
      "title": "Select Internet.",
      "content": "Select Internet . You'll find this option near the top of the Settings page."
    },
    {
      "title": "Select Advanced.",
      "content": "Select Advanced . Doing so opens the Advanced Settings menu."
    },
    {
      "title": "Select Bridging and switch it to \"On\".",
      "content": "Select Bridging and switch it to \"On\". It's in the middle of the page. Once you've selected it, using the left or right arrows on your remote should scroll through the available options, allowing you to turn on Bridging."
    },
    {
      "title": "Select OK when prompted.",
      "content": "Select OK when prompted. This will ensure that Bridging internet from your Hopper to your Joey is enabled, meaning that your Joey should now be able to connect wirelessly to the Internet."
    },
    {
      "title": "Connect a wireless adapter to your Dish Network receiver.",
      "content": "Connect a wireless adapter to your Dish Network receiver. Currently, the Netgear model WNDA3100v2 is the only Wi-Fi adapter supported by Dish Network. You can buy this adapter from the DISH online store. The adapter must be plugged into the USB port located between the HDMI and Ethernet ports on the back of the receiver."
    },
    {
      "title": "Turn on your TV and select the receiver's input if necessary.",
      "content": "Turn on your TV and select the receiver's input if necessary. Press your TV's Power button, then switch the input to select the HDMI channel (or other connection) that you use for your receiver."
    },
    {
      "title": "Select Setup on the pop-up.",
      "content": "Select Setup on the pop-up. Upon recognizing your wireless adapter, your ViP receiver will prompt you to select an option in a pop-up window; select Setup to do so. [4] X Research source"
    },
    {
      "title": "Select a network.",
      "content": "Select a network. In the list of network names, find and select your network."
    },
    {
      "title": "Select Done.",
      "content": "Select Done . It's near the bottom of the list of network names."
    },
    {
      "title": "Enter your network's password.",
      "content": "Enter your network's password. When prompted, use the on-screen keyboard to type in the password you use to connect to your network."
    },
    {
      "title": "Select Done.",
      "content": "Select Done . Doing so will prompt your receiver to connect to the Internet."
    },
    {
      "title": "Confirm your setup.",
      "content": "Confirm your setup. Select Done when prompted, then select OK when prompted with the signal strength test."
    },
    {
      "title": "Reset your Hopper if it won't connect to the internet.",
      "content": "Reset your Hopper if it won't connect to the internet. If your DISH Hopper receiver won't connect to the internet or has lost its connection, press and hold the red Reset button for about 5 seconds. Allow up to five minutes for the receiver to complete the reset, and then start the setup process again. [5] X Research source"
    },
    {
      "title": "Fix the \"Looking for Hopper\" error.",
      "content": "Fix the \"Looking for Hopper\" error. If you have both a Hopper and a Joey on your network and you see error code 1303 or 1305, there is a communication error between the two receivers. Check your wireless Joey to see if it has power. If not, turn it on. On the Joey, press the Guide button on your DISH. Then, press the Home or Menu button 3 times to access diagnostics. Scroll down and select Whole Home . Under \"Detected devices,\" select the Hopper this Joey should be connected to, then press Select . If you don't see the Hopper, reset the Hopper device by pressing and holding the red Reset button for 5 seconds. Wait 5 minutes for Hopper to come back up. [6] X Research source If you're still getting the error, press and hold the Power button on the front of the Joey receiver for 5 seconds until the device turns off. Wait 5 minutes to see if the error goes away."
    },
    {
      "title": "Contact DISH for support.",
      "content": "Contact DISH for support. If you're having other problems with your DISH receiver connecting to Wi-Fi or via Ethernet, DISH Network support is here to help. Call 1-800-333-3474 between 8 AM and Midnight ET, seven days a week. [7] X Research source"
    }
  ]
}