{
  "url": "https://www.wikihow.com/Avoid-Self-Sabotage-when-You-Feel-Unloved",
  "title": "How to Avoid Self Sabotage when You Feel Unloved",
  "steps": [
    {
      "title": "Resist the temptation to self-medicate.",
      "content": "Resist the temptation to self-medicate. When you feel emotional pain such as rejection from a loved one, you may be drawn to practices that allow you to numb your feelings. Feeling unloved can create both anxiety and depression, and you may try to treat these uncomfortable feelings on your own by using alcohol and drugs. Self-medication with substances may help you escape painful emotions in the short-term, but doing so can escalate into addiction, causing an even greater problem in the long-term. [1] X Research source Some people may also self-medicate with other practices, such as binge-eating on comfort foods, shopping excessively, or having sex with various people to numb undesirable emotions. If you notice yourself engaging in unsafe or unhealthy behaviors, reach out to a friend or a professional counselor for support."
    },
    {
      "title": "Spend time with positive influences.",
      "content": "Spend time with positive influences. There’s a saying that you are the sum of the five people closest to you. If those near and dear to you engage in unhealthy, self-destructive behaviors like using alcohol or drugs, engaging in risky sex, or gambling, you are more prone to do the same. Carefully choosing your social group can make all the difference in the type of behaviors you do regularly. [2] X Research source Make the choice to remove negative influences from your life. Highlight those relationships that influence you to make positive decisions like going to work or school, setting goals, and treating your body well. If you don’t have any positive influences, open yourself up to making new friends. If you find that some people around you are negative influences, tell them, \"I'm sorry, but we're going to have to stop spending time together. I have been making unhealthy choices and I need to reevaluate many of my relationships.\""
    },
    {
      "title": "Find creative outlets for pain.",
      "content": "Find creative outlets for pain. Rather than turning to self-sabotaging behaviors, use your emotional pain for good by getting creative. Exercising your inner creativity can help you channel negative feelings like rejection, disappointment, or hatred into positive activities like writing, painting, music, drama or any other art form. Being creative can help you heal from feeling unloved and decrease feelings of stress or anxiety. Use your emotional pain as a stimulus to draw a picture or write a song. Get out a fresh piece of paper and write a story. Or, you can turn on some soothing music and dance out what you are feeling inside."
    },
    {
      "title": "Challenge negative thought patterns.",
      "content": "Challenge negative thought patterns. Sometimes the script running through your head all day can contribute to your mood. If you are thinking negative thoughts like “Nobody cares about me” or “I will be alone forever,” then your self-talk is steering you down a dark and depressed path. How you interpret situations and the world around you can make a big difference on how you feel. Learn to identify and challenge negative thoughts in order to stop self-sabotaging behaviors. [3] X Research source If you notice yourself feeling particularly low or blue, try to think back to what you have been telling yourself in your head. Your thoughts are probably negative. For example, if you say “Nobody cares about me” because none of your friends or family called you, you can challenge the evidence surrounding this thought. Perform reality testing by asking yourself if your thoughts are facts or just your own interpretations. If you can think of one person who does seem to care for you, then you automatically cancel out the validity of the statement. Reframe negative thoughts to make them more positive and realistic. You might say, “Sometimes, I feel like nobody cares for me. Maybe if I called my loved ones instead of waiting on them to call, I wouldn’t feel like this.”"
    },
    {
      "title": "Ask for support when you need it.",
      "content": "Ask for support when you need it. Often we might complain that no one seems to be there for us, but we don’t actually make requests of loved ones. If you are guilty of wishing friends or family would reach out to you, but never taking the initiative, it’s time to change that. Don’t expect others to read your mind. If you want company, ask for it. If you need a hug, tell someone. You can simply say to a friend, “Jessica, I’ve been feeling very lonely and unloved lately. Can we make plans together this weekend to hang out? I could use some company?” [4] X Research source"
    },
    {
      "title": "Look for shared similarities.",
      "content": "Look for shared similarities. If you are always pointing out the differences between yourself and others, then you are making it hard to belong. When you stop paying attention to differences and focus on common ground, you will find more people with whom you can potentially connect. [5] X Research source Find your tribe by challenging yourself to get out more. Join a book club based on your favorite genre. Participate in a local Meetup of singles in your age group. Take a Pilates class at your community gym. When you enter these social situations look for similarities between you and others. Then, point them out to start conversations. You might say, “Ooh, I love your gym bag! It matches my leggings! Where’d you get it?”"
    },
    {
      "title": "Aim for greater empathy.",
      "content": "Aim for greater empathy. Empathy is basically the ability to experience what another person is experiencing, or walking in their shoes. When you are able to adequately understand the feelings and perspectives of others, you will feel more connected to the larger whole of humanity. [6] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Instead of simply focusing on feeling unloved, strive to show more love and compassion to others through empathy. Start by improving your listening skills. Too frequently, we listen to reply rather than understand. When you are engaged in a conversation, orient towards the other person and make occasional eye contact. Eliminate distractions and fully focus on the other person’s message. Try to imagine what they must be feeling based on their words. Mirror their emotional state by saying “Hmmm” or “Aww” as is appropriate. Then, summarize what you heard by saying “It sounds like you had a really rough time…” After attending to their emotions and clarifying that you received the intended message, you may share your own response."
    },
    {
      "title": "Volunteer.",
      "content": "Volunteer. There is no better way to feel a part of the bigger picture than when you are lending a helping hand to those in need. In addition to allowing you to gain a sense of belonging, volunteering also gives you the chance to make a difference in your community. Community service also lifts your mood, helps you forge connections with others, and helps you spend your time in a meaningful way. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Overcome your feelings of rejection and being unloved by spreading love to others. Sign up at a local civic center, church, nursing home, or school to help those in need."
    },
    {
      "title": "Identify your personal strengths.",
      "content": "Identify your personal strengths. Cultivate a positive self-worth by figuring out your best qualities. Your personal strengths are the abilities, talents, and skills you have that make you an asset to the world around you. When you know what your strengths are you have a higher self-esteem and you feel more capable of managing life’s problems. Make a list of personal strengths that you think may be used to describe you. These may include “loyal,” “intelligent,” or “compassionate.” If you have trouble coming up with ideas, ask a parent, teacher or close friend to give you some suggestions of strengths they see you demonstrate on a daily basis. You might also take a survey such as the VIA Character Strengths survey. Are you creative? Curious? Loving? Humble? A quiz or survey can inspire you. [8] X Research source"
    },
    {
      "title": "Create objective goals and work towards them.",
      "content": "Create objective goals and work towards them. Goal attainment is another route to developing a stronger sense of self-worth. When you feel like you are moving towards something meaningful in your future, you are less likely to sabotage your progress with destructive habits. Plus, accomplishing goals creates a domino effect that will improve your mood and relationships, too. Set S.M.A.R.T. goals that are specific, measurable, attainable, realistic, and time-bound. For example, if you plan to learn a new language, you might say “I want to learn to speak intermediate Spanish within the next 6 months.” Then, you will devise a plan to reach that goal like listening to Spanish tapes, taking a course, and interacting with native Spanish-speakers. [9] X Research source"
    },
    {
      "title": "Promote your passions.",
      "content": "Promote your passions. Doing what you love can go a long way towards encouraging self-worthiness and a brighter mood overall. Think about activities you enjoy and build your days and weeks around doing them. Over time, you will notice that you are starting to live a more purposeful, happier life. Do you like building things? Start a new DIY project to build a piece of furniture for your home. Other hobbies may include writing, archery, gardening, bowling, or graphic design. A hobby can be virtually anything, and you can increase your love of the activity by joining a group of others who do it, too. This creates a sense of belonging and worthiness to help improve your outlook on life. [10] X Research source Trying something new can also be helpful. Take up a brand new hobby or activity – this will get your creative juices flowing, challenge you, and teach you some new things. You may be surprised at what you learn."
    },
    {
      "title": "Nurture your body with a proper diet and exercise.",
      "content": "Nurture your body with a proper diet and exercise. You can enhance your self-worth through self-care. Of course, you already know that you should be consuming a balanced diet and getting regular physical activity. But, you may not know how these factors play into your perception of yourself and the world around you. When you nourish your body with healthy foods and stay active, you will feel more positive about your life and your relationships. When you feel bad about yourself, you may eat unhealthy foods and skip the gym. Show support for your body by eating plenty of fruits and vegetables, whole grains, lean protein, and low-fat dairy. Drink lots of water throughout the day. Go for a walk around your local park. Throw a ball to your dog. Or, ask a friend to join you on a cycling adventure. [11] X Research source"
    },
    {
      "title": "See a therapist.",
      "content": "See a therapist. A professional mental health therapist can help you identify the source of your negative emotions and develop healthy skills to lead a more satisfying life. Your self-worth may have been jeopardized by unhealthy relationships or abuse from your past. Talking about these experiences in a unbiased and supportive context can lead to healing. One recognized form of therapy for those who self-sabotage is dialectical behavior therapy. This treatment approach is directed at gaining a better understanding of your feelings in order to build skills that help you stop problematic behaviors. You may work with your therapist to prevent overeating, stop risky sexual activities, and establish healthy relational patterns. [12] X Research source Another is cognitive behavioral therapy. CBT will help you identify beliefs that fuel your self-worth. Once you identify those beliefs, you can explore their origins and validity and eventually replace them with thoughts and beliefs that are true."
    },
    {
      "title": "Determine if you require medication for depression.",
      "content": "Determine if you require medication for depression. Self-sabotage is prominent in people who feel depressed but do not know how to express or improve their emotions. If feeling unloved has led to depressive symptoms, you need to see a doctor. Depression may manifest as a loss of interest in once pleasurable activities, withdrawing from loved ones, having trouble eating or sleeping, and feeling hopeless. A certain class of prescribed medications known as antidepressants are effective at improve depressive symptoms. This may be advisable if therapy alone does not improve your symptoms."
    },
    {
      "title": "Take part in a support group.",
      "content": "Take part in a support group. Support is imperative for anyone struggling with mental illness. It's vital to build a network of health care providers and loved one who are there for you as you heal. However, meeting with other people who have gone through what you are going through can also be comforting. Ask your mental health provider about support groups for people who are struggling with the same issues as you. Attending these groups can help you learn how others cope with feeling unloved and help you gain a sense of belonging in a supportive group. [13] X Research source"
    }
  ]
}