{
  "url": "https://www.wikihow.com/Accept-Being-Tall-As-a-Teen-Girl",
  "title": "How to Accept Being Tall As a Teen Girl",
  "steps": [
    {
      "title": "Be optimistic.",
      "content": "Be optimistic. You might feel awkward and clumsy now, but you likely won’t stay that way. Give yourself some time to grow into yourself. It always takes time to adjust to a growing body, so don’t think you’ll feel awkward or strange forever. Chances are, you will start to feel more and more beautiful the more comfortable you get both with your body and with yourself. There are many beautiful and admired women who are tall. For example, Cindy Crawford, Michelle Obama, Behati Prinsloo, Angelina Jolie, Venus and Serena Williams, and Maria Sharapova are all tall and admired."
    },
    {
      "title": "See the benefits.",
      "content": "See the benefits. You can reach high stuff many people can't reach. People tend to have more respect for someone who's tall and may even take you more seriously. When you go to a concert or sports game, it’s likely you can see despite the large crowds. These are some of the many benefits of being tall that work in your favor!. [1] X Research source People might think you’re older than you are. They might treat you more maturely or give you more leadership roles. [2] X Research source"
    },
    {
      "title": "Be patient.",
      "content": "Be patient. At the moment, you might be towering over your classmates and friends. Going to dances or doing paired activities may be totally cringe-worthy, but know that this won’t last. It may take a year (or two or three) for other friends to be the same height as you, but it will happen. You can feel a sense of relief when others begin to be taller than you ! [3] X Research source It might feel like the end of the world, but it’s not. You won’t be the tallest person forever."
    },
    {
      "title": "Let go of shame",
      "content": "Let go of shame . Your height may make you feel shame and you may wish more than anything to be shorter or at least feel more “normal.” if you experience shame in your height, recognize that it only harms you and takes away from your happiness. You cannot change your height. Show compassion for yourself. Admit that it’s hard to feel different, but it doesn’t have to feel bad. If you feel ashamed of your height, move into a place of acceptance, not dissatisfaction. Give yourself permission to have feelings about your height, but don’t let them take over your life."
    },
    {
      "title": "Let go of insults.",
      "content": "Let go of insults. Some people might make fun of you for being tall. Don’t take these comments seriously. It’s best just to let them go and not let them bother you. Brush off these insults and remember that being tall is just one part of who you are and in no way defines you. [4] X Research source If you’re upset by someone’s comments, tell an adult like a parent, teacher, or authority. If your friends make fun of you for being tall, tell them to stop. Give them an example of one of their traits being made fun of, and ask them how they would feel. If they don't stop making fun of you, they are not real friends. Find new friends that treat you nicely."
    },
    {
      "title": "Find activities that favor tallness.",
      "content": "Find activities that favor tallness. There are times when being tall is a distinct advantage. If you enjoy sports and athletics, it’s likely that you will excel quickly and naturally due to your height. Did you ever think that because you're taller you'll have less distance to swim in a race? What about catching a rebound in basketball because you can reach higher than your peers? Take advantage of these opportunities and feel good about contributing to your team. If you don’t enjoy team sports, try dancing or rock climbing."
    },
    {
      "title": "Use affirmations",
      "content": "Use affirmations . Your tallness isn’t something that will magically change. For this reason, work toward accepting and embracing your tallness. One way to do this is by using affirmations. Create an affirmation about accepting your tallness and say it to yourself daily. It might feel silly or untrue at first but keep at it. Say an affirmation that affirms your value and worth. For example, say, “I am worthy and valuable just the way I am” or, “I accept my body and love it.” You can also say, “I accept that I am tall,” or \"I can make my tallness work for me.\""
    },
    {
      "title": "Build your self-esteem.",
      "content": "Build your self-esteem. Feeling good about yourself isn’t just about accepting your tallness. Focus on loving all parts of yourself. Find all the things about yourself that make you uniquely you . Surround yourself with people who are positive and who make you feel good about yourself. Reflect on your accomplishments and your positive qualities. For example, you might be compassionate, helpful, kind, a good listener, and generous. If you can't think of any good qualities of yourself, try developing your self-esteem ."
    },
    {
      "title": "Avoid comparing your weight with shorter girls.",
      "content": "Avoid comparing your weight with shorter girls. Undoubtedly, you will weigh more than girls who are smaller than you. Don’t stress over this. If you’re self-conscious about your weight, don’t talk about it or avoid conversations where girls are talking about weight. It’s okay to weigh more than your smaller friends, but it’s also understandable if you don’t want to talk about it. You also don’t have to be ashamed of your weight. You can talk openly about your weight and be okay with it. Just don’t compare your weight or try to lose weight because others weigh less than you. If your friends bring up weight, change the subject or go do something else."
    },
    {
      "title": "Wear clothes that fit.",
      "content": "Wear clothes that fit. You might feel tempted to wear clothes that hide your body or make you feel invisible. Focus on finding clothes that flatter instead of hiding. It might be harder to find clothes that fit, but take the extra time to find the clothing lines that cater to your height. You’ll feel more confident and better about yourself when you see how nice you look in the mirror. Find styles that flatter your tallness and make you feel good. [5] X Research source Shop online for tall fitting sizes. Few mall stores have pants with inseams longer than 35 inches (88.9 cm)."
    },
    {
      "title": "Eat healthfully.",
      "content": "Eat healthfully. Don’t try to lose weight or eat less in order to stop growing.Cutting calories or skipping meals won’t make you any shorter, it will only make you feel sick and lethargic. Eat a healthy diet full of fresh fruits, vegetables, and whole grains. Try getting involved in making your own food or helping prepare meals at home as a way to focus more on nutrition and preparation. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source It’s okay to have sugars and sweets, just eat them on occasion."
    },
    {
      "title": "Recognize that many people feel insecure.",
      "content": "Recognize that many people feel insecure. Remember that most people feel self-conscious as teens. While you’re feeling self-conscious about being tall, many boys are self-conscious about being short or scrawny. Teen girls start comparing their bodies to each other and realize that puberty looks different for each girl. If you feel insecure, it’s more than likely that your friends and classmates do, too. Especially if you’re in the middle of a growth spurt or just completed one, it’s normal to feel different and think you look strange. Your friends are probably thinking the same things about their bodies, too."
    },
    {
      "title": "Talk to other tall people.",
      "content": "Talk to other tall people. If you’re tall, it’s likely that at least one of your parents is tall, too. Talk to them about what it was like to grow up tall and how they dealt with it. They may be able to relate to you and give you some advice. You might also talk to a tall aunt or teacher and get their perspective. Even talking to other tall friends can help you feel less alone and more supported. Talk about the struggles of being tall and ask for advice in how to cope. For example, say, “How did you learn to be comfortable with your height?” or, “How did you cope with being taller than boys?”"
    },
    {
      "title": "Gain some perspective.",
      "content": "Gain some perspective. Talk about height with some of your tall and short friends. Many short women dislike being short. It can be helpful to talk about your experiences with others who struggle with height. It’s also a great way to gain perspective on what it means to be short and the problems that other people face. Ask a short friend to talk. They may even say that they wish they were tall like you."
    },
    {
      "title": "See a therapist.",
      "content": "See a therapist. If your tallness is affecting your self-esteem and you feel bad about yourself, it might be time to talk to a professional. A therapist can help you make sense of the feelings you have and help you improve your sense of self-worth. If you’re dealing with shame, depression, inadequacy, or powerlessness, a therapist can help. [7] X Research source You might want to start at school and talk to your guidance counselor. You can also ask your parents or guardian about seeing a professional therapist through their insurance."
    }
  ]
}