{
  "url": "https://www.wikihow.com/Avoid-Scams",
  "title": "How to Avoid Scams",
  "steps": [
    {
      "title": "Examine common practices.",
      "content": "Examine common practices. A majority of scams follow similar types of fact patterns. This occurs because scammers know what works and what doesn't, and they try to scam you by doing what works best. First, scammers will use fear to try and get you to do something. For example, some scammers might say that a relative has been arrested and needs money. Second, scammers will try to rush you to make a decision quickly. The longer you think about what is happening, the more likely it is that you will not become a victim."
    },
    {
      "title": "Identify popular scams involving money.",
      "content": "Identify popular scams involving money. Just as scammers use common practices like fear and panic, they will also use the same scams over and over again. If you can learn what types of common scams are out there, it will be easier to identify them and avoid them. Scams can take place online, over the phone, through the mail, and even in person. The most common scams include: [1] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source Advance fee scams, which occur when people tell you that you have won a lottery, or that you can invest in something, and all you have to do is pay a small fee upfront. Charity scams, which occur when people tell you they are collecting money for some charitable cause. In reality, once you make a \"donation,\" the scammers keep the money for themselves. Internal Revenue Service (IRS) scams, which occur when people tell you that you owe money in taxes or that they need your personal information to make sure your taxes were filed properly. These people try to get money as well as personal information in order to steal your identity. Phantom debt scams, which occur when people contact you pretending to be debt collectors. They will threaten you and tell you that you owe money that you do not really owe."
    },
    {
      "title": "Recognize possible phishing scams.",
      "content": "Recognize possible phishing scams. Phishing scams occur when individuals contact you claiming there is a problem with some account you might have (e.g., credit card accounts and loan accounts). They will tell you they can fix the problem, but they need to verify your personal information. Once they have your personal information, they use it to steal your identity."
    },
    {
      "title": "Get scam alerts.",
      "content": "Get scam alerts. One of the best ways to keep up-to-date on recent scam schemes is to get government alerts. The Federal Trade Commission (FTC) offers an alert that is sent to your email periodically. The alert will give you tips and advice on how to avoid scams. If you want to sign up, you can do so through the FTC's website. [2] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source"
    },
    {
      "title": "Keep your personal information to yourself.",
      "content": "Keep your personal information to yourself. Because some of the most common scams attempt to gain access to your personal information, one of the easiest ways to avoid scams is to protect that personal information. Keep passwords, account numbers, and sensitive paperwork in a safe place. Do not keep this information on your phone where it can be found. In addition, do not leave your mail somewhere where scammers might be able to get ahold of it. If you can, have your mail deposited directly into your home, as opposed to a mailbox. If you have a mailbox, take your mail out as soon as possible. If you get a solicitation asking you for your personal information, never willingly give it out. Take extra steps to ensure the solicitation is legitimate before you move forward. [3] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source"
    },
    {
      "title": "Conduct online searches.",
      "content": "Conduct online searches. When you get mailings that ask for money or information, follow-up and do some research about the company or person asking for the information. Never assume a solicitation is legitimate. Try doing the following, which should help you avoid scams: [4] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source Type the company's or product's name into an online search. Use words like \"complaint,\" \"review,\" or \"scam.\" Search using phrases and sentences that describe your situation. For example, if you got a call from someone claiming to be from the IRS, search for, \"IRS call asking for Social Security Number.\" Look up the phone number that was used to call you. When you type the number into an internet search engine, some of the top results will usually tell you whether that number has been used for scams before."
    },
    {
      "title": "Call people back using genuine phone numbers.",
      "content": "Call people back using genuine phone numbers. In today's world, it is easy for scammers to manipulate caller IDs and phone numbers. Therefore, you should never trust the name and number as it shows up on your phone. If you get a phone call from someone, ask them for their name and the company they work for, so you can call them back. Once you get off the phone, look up that company's information online and only call back legitimate numbers found on reputable websites. [5] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source For example, assume you get a call from someone claiming to be from the IRS and they need some personal information. Instead of giving it to them right away, hang up the phone. Go online to the IRS's official website and find the customer service phone number. Call that number back and ask whether anyone would have called you asking for personal information."
    },
    {
      "title": "Avoid paying any money upfront.",
      "content": "Avoid paying any money upfront. A lot of scammers will request money in exchange for a promise to send you more in return. Scammers will usually tell you that you have won a prize and that you need to pay taxes or fees in order to collect the prize. They might also ask you to pay in advance for a job, debt relief, or for loan assistance. However, you should never pay any money upfront. Check the legitimacy of these programs and solicitations before giving anyone anything. In general, once you give these individuals money, you will not receive the service or product you were promised. [6] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source It's especially important to be wary of money scams when you’re online dating or looking for a relationship with a sugar momma or daddy. Reader Poll: We asked 539 wikiHow readers, and 64% of them agreed that constantly asking for financial support would make them doubt if a sugar momma is actually wealthy. [Take Poll]"
    },
    {
      "title": "Think about the payment method being requested.",
      "content": "Think about the payment method being requested. Scammers will request money from specific sources in order to avoid detection. Most scammers will request cash, money wires (e.g., Western Union), or prepaid credit cards (e.g., Vanilla). These payment methods are difficult to track and nearly impossible to reverse. No legitimate company will ask you to pay using these methods. Most legitimate companies will ask you to pay using credit cards and personal checks. These payment options offer built in fraud protection and give you the ability to cancel charges and withhold money. [7] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source"
    },
    {
      "title": "Consult people you trust.",
      "content": "Consult people you trust. Before you give out your personal information or money, talk to someone you trust about what is going on. This could be friends, family, or professionals (e.g., a lawyer, a bank employee, or a government employee). Tell them about the solicitation and ask whether they have seen anything similar before. Remember, scammers want you to move quickly without thinking. By stopping and talking to someone else, you are giving yourself a chance to avoid the scam. [8] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source"
    },
    {
      "title": "Read cancellation policies.",
      "content": "Read cancellation policies. A lot of free trials will automatically turn into large monthly charges, and some trials will not even allow you to cancel for a certain period of time. Before you accept a free trial for things like television channels, weight loss supplements, or anything else, make sure you look over the company's cancellation policy. A lot of companies will allow you to cancel at any time. However, these companies might continue to charge you until you dispute the charges with your bank. In addition, a lot of companies will only give you the free trial if you agree to purchase more of the product or service at the end of the trial. If you accepted a free trial of something, make sure you cancel in a timely manner and check your bank accounts regularly for suspicious charges. [9] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source"
    },
    {
      "title": "Avoid depositing checks from people you don't know.",
      "content": "Avoid depositing checks from people you don't know. A lot of scammers will offer you a large amount of money by check if you send a smaller amount of money in cash or through a wire. However, the check you receive will usually be fake. While a bank may accept the check upfront, it will always be uncovered as fake at some point. When that time comes, it will be your responsibility to repay the bank. Therefore, never accept a check from someone you don't know without first checking it out. [10] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source"
    },
    {
      "title": "Keep suspicious solicitations.",
      "content": "Keep suspicious solicitations. If you gave out your personal information or gave a scammer money, you will want to report the scam to the proper authorities. When you contact various reporting agencies, they will want to look over any evidence you have regarding the scam. Therefore, if you received any suspicious mailings, got any voicemails, or were handed any paperwork in person, keep it. This information will help identify the source of the scam and what they are attempting to do."
    },
    {
      "title": "Take detailed notes.",
      "content": "Take detailed notes. In addition to keeping documents you received, you will also want to take your own notes of what is happening. These notes will help you remember details when it comes time to report, and it will help you describe the scam accurately. For example, if you contacted someone regarding the scam, write down who you contacted, what you talked about, how long the conversation was, and what the outcome of that conversation was. If someone called you asking for money or personal information, write down the number they called from, who they said they were, and what they asked for."
    },
    {
      "title": "Ask for help.",
      "content": "Ask for help. If you have friends or family who witnessed the scam take place, or who have seen the emails or other solicitations, ask them to write a brief statement about what they saw. These statements can help back up your story and provide additional information that you may have missed. Additionally, if you know others who were victims of the same scam you were, ask them to report the scam with you. The more people you can get to join you, the more seriously your complaints will be taken."
    },
    {
      "title": "Call your local police department.",
      "content": "Call your local police department. If you have been scammed and you gave out personal information or money, the first thing you need to do is contact your local police department. [11] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source The police department will be able to do the most for you personally, because they will investigate if a crime occurred and attempt to get your money back. [12] X Expert Source Scott Nelson, JD Police Sergeant, Mountain View Police Department Expert Interview. 2 April 2020. When you contact the police, they will want as many details as possible to help them investigate the scam. Provide them with your notes and any documents you received throughout the scam's life."
    },
    {
      "title": "File a report with the Better Business Bureau (BBB).",
      "content": "File a report with the Better Business Bureau (BBB). The BBB is a resource that consumers use to look up common scams and scams that have happened recently. When you file a report with the BBB Scam Tracker, you will not receive an individual response. The Scam Tracker allows you to tell your story, so others might be able to avoid the trap you fell into. To file a Scam Tracker Report, visit the BBB's Scam Tracker website. They will ask you for the following information: [13] X Trustworthy Source Better Business Bureau Nonprofit organization dedicated to promoting marketplace trustworthiness by educating consumers and reviewing businesses Go to source Information about the scammer (e.g., the business's name, the person's name, their phone number, their website) Information about the scam (e.g., how you were contacted, what was being asked for, what did they say happened, whether you lost money) Your personal information (e.g., your age, where you live, your name) Attachments of things you received from the scammer"
    },
    {
      "title": "Use word of mouth.",
      "content": "Use word of mouth. Email or call your friends and tell them what happened to you. In doing so, you can help others avoid scams and possibly find people who received the same scam information as you did. As word spreads, you might get information about who is responsible, what others did to report the fraud, and what could possibly be done as a group to help catch who is responsible."
    },
    {
      "title": "Track down the proper agency to contact.",
      "content": "Track down the proper agency to contact. While most agencies will not be able to help you individually, any information you provide in a complaint is used to track scammers and take action against them. The agency you contact will depend on the scam you were a victim of. [14] X Expert Source Scott Nelson, JD Police Sergeant, Mountain View Police Department Expert Interview. 2 April 2020. Some examples of common scams and who you would contact to report them include: [15] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source Most types of fraud - contact the FTC. Mail fraud - contact the U.S. Postal Inspection Service. Identity theft - contact the FTC. [16] X Research source Bank fraud - contact the Financial Fraud Enforcement Task Force. [17] X Trustworthy Source United States Department of Justice Official website of the U.S. Department of Justice Go to source"
    },
    {
      "title": "Visit the proper government agency's website.",
      "content": "Visit the proper government agency's website. Using the information you found while tracking down possible government contacts, you need to visit the agency's website and determine how a complaint can be filed and what information you will need to provide. For example, if you want to file a complaint for most general types of fraud (e.g., a lottery scam or a gift scam), you would visit the FTC's Complaint Assistant website. From there you can read about the types of scams they cover, how you can report a scam, and how your complaint will be handled. Use this information to determine how you want to proceed and file your complaint."
    },
    {
      "title": "File an online complaint.",
      "content": "File an online complaint. Most agencies will allow you to file a complaint quickly and easily online. Each agency will proceed differently, and each agency will ask for different information. Follow the directions on each website to successfully submit your complaint. For example, if you use the FTC's Complaint Assistant, you can file a scam complaint by doing the following: Selecting a category of scam, you were the victim of (e.g., identity theft, scams and rip-offs, credit and debt) Clicking a sub-category of scam (e.g., counterfeit checks, imposter scams, prizes and lottery scams, romance scams) Telling the FTC how you were contacted (e.g., over the phone, in person, through the mail) Detailing the scam (e.g., how much were you asked to pay, how much did you pay, how did you pay, how did you respond to contacts, did you try to contact the scammers) Providing information about the company or person that scammed you (e.g., their name, address, phone number) Giving the FTC your information so you can be contacted if the FTC wants more information"
    },
    {
      "title": "Call to report the fraud.",
      "content": "Call to report the fraud. A lot of agencies will allow you to report a scam over the phone if you do not have regular access to the internet. You can find the agency's phone number online or by asking someone with access to the internet. For example, if you need to report mail fraud, you can contact the U.S. Postal Inspection Service at 1-877-876-2455. Once prompted, you can press \"4\" to report the fraud. [18] X Research source When you file a complaint over the phone, you will give the agency information very similar to that you would give them using the internet."
    },
    {
      "title": "Mail in a complaint.",
      "content": "Mail in a complaint. If you prefer sending a hard copy through the mail, most agencies will offer it as an option. This could be useful when you have documents and solicitations that you would like the agency to have. For example, if you want to file a complaint with the U.S. Postal Inspection Service, you can mail a letter that contains information similar to that you would provide online. In addition, if you have other documents, make sure you attach them to your letter. You will then be able to mail the complaint to the address provided, which for the U.S. Postal Inspection Service, is the \"Criminal Investigations Service Center, Attn: Mail Fraud, 222 S. Riverside Plz, Suite 1250, Chicago, IL, 60606-6100.\" [19] X Research source"
    }
  ]
}