{
  "url": "https://www.wikihow.com/Change-Address-on-Colorado-Vehicle-Registration",
  "title": "How to Change Address on Colorado Vehicle Registration",
  "steps": [
    {
      "title": "Identify the county that you live in.",
      "content": "Identify the county that you live in. It’s important that you only visit a DMV office within your county. Since vehicle registration is county-specific, a DMV in another county (even if it’s technically nearer to your residence) will be unable to help you. This information should be accessible by looking at a map. To find your county, you can also use an online map service, such as Google maps. These websites often clearly delineate county lines."
    },
    {
      "title": "Locate the nearest DMV office in your county.",
      "content": "Locate the nearest DMV office in your county. You’ll need to report your new address to the nearest DMV office in your county. To find the nearest DMV office location in your county, visit the official [Colorado State website https://www.colorado.gov/pacific/dmv/county-motor-vehicle-offices ]"
    },
    {
      "title": "Call the DMV office line.",
      "content": "Call the DMV office line. If you prefer not to find the office online, or do not have an internet connection, you can call Colorado State Titles and Registration customer service at 303-205-5607. Once you’re on the line with the DMV, explain where you live (your new Colorado address) and ask which DMV office they suggest you visit to change your address registration. If this number does not pick up, you may need to call the general Division of Motor Vehicles line at: 303-205-5600. You will not be able to change your registration address over the phone. You’ll have to physically go to the DMV office to complete the address change."
    },
    {
      "title": "Visit the DMV office within 30 days of your address change.",
      "content": "Visit the DMV office within 30 days of your address change. Once you’ve located the nearest DMV office online or by phone, visit the DMV within 30 days of the address change becoming effective. [2] X Research source When you visit the DMV, you’ll need to turn in a completed copy of the Duplicate Title Request and Receipt form. Plan to arrive at the DMV early. Especially in urban areas (Denver, Boulder, Fort Collins), DMV office get crowded nearly every day. Arriving early (when the office opens) may help you beat the crowds."
    },
    {
      "title": "Fill out a Duplicate Title Request and Receipt form.",
      "content": "Fill out a Duplicate Title Request and Receipt form. This is different from the Change of Address form required to file your address change with the DMV. The Duplicate Title Request and Receipt form essentially applies for a second version of your title and registration, since the first copy (with your former address) is no longer accurate. [3] X Research source This form should be available for you at the DMV office, and you can fill the form out and hand it in at the DMV."
    },
    {
      "title": "Fill out the Duplicate Title Request and Receipt form online.",
      "content": "Fill out the Duplicate Title Request and Receipt form online. To access this form online, is also available online through the Colorado DMV website. You should be able to print the form online and bring it to the DMV already filled out. Note that you cannot submit the form online. [4] X Research source You’ll need to include on the form: Your Colorado State Driver’s License number. Date of birth. Last 4 digits of your SSN."
    },
    {
      "title": "Plan ahead for your visit.",
      "content": "Plan ahead for your visit. You’ll need to bring several official documents with you when you visit the DMV. It’s best to set these items aside in advance, so that you’re not scrambling to find them shortly before you leave to change your registration address. If you’re likely to forget something, the night before, place all of the necessary items in a folder. Mark the folder “DMV” and set it by your door or on a table you’ll be sure to see before you leave for the DMV."
    },
    {
      "title": "Find the necessary documents.",
      "content": "Find the necessary documents. In addition to the completed Duplicate Title Request and Receipt form, you’ll need to bring identifying information with you to the DMV. [5] X Research source You’ll also need to bring mail that confirms your place of residence. Bring with: Your VIN (vehicle identification number). This can be written on a scrap of paper; you just need to know the number. Proof of identity. The most common form of identity that individuals bring to the DMV is their Colorado Driver’s License, but you can also bring your passport or a document certifying U.S. citizenship or legal residency. Proof of residence. Bring a piece of mail that has been addressed to, and received at, your new Colorado residence. You could bring a personal letter, a utility bill, or a bank statement. [6] X Research source"
    },
    {
      "title": "Bring payment with you.",
      "content": "Bring payment with you. While it is free to change your address with the DMV itself, requesting a new vehicle title and registration with the changed address has a small fee. The required payment to submit your form will be relatively cheap: $8.20. Most Colorado DMV offices only accept cash or checks; they do not take credit or debit cards. It’s smart to call ahead and make sure the address-change registration fee has not been raised. Call your local DMV office before you visit and ask specifically how much it costs to update your Colorado vehicle title and registration."
    }
  ]
}