{
  "url": "https://www.wikihow.com/Change-Google-Voice-Number",
  "title": "2 Simple Ways to Change Your Google Voice Phone Number",
  "steps": [
    {
      "title": "Go to https://voice.google.com in a web browser.",
      "content": "Go to https://voice.google.com in a web browser. To get a new Google Voice phone number, you'll need to delete your current number and register for a new one . If you aren't already logged into your Google account , do so now. Before you delete your number, make sure it's not linked to any important services or accounts."
    },
    {
      "title": "Click the cog icon.",
      "content": "Click the cog icon. This is in the top-right corner of the Google Voice homepage. A new page will open."
    },
    {
      "title": "Click Account.",
      "content": "Click Account . This is the tab on the left."
    },
    {
      "title": "Click Delete.",
      "content": "Click Delete . You can find this underneath your current Google Voice phone number."
    },
    {
      "title": "Click Delete number.",
      "content": "Click Delete number . This will confirm your decision. Once the number is deleted, you can sign up for a new Google Voice number."
    },
    {
      "title": "Click Get a number.",
      "content": "Click Get a number . You can find this button where the previous Delete button was."
    },
    {
      "title": "Enter your city or area code.",
      "content": "Enter your city or area code. This will help Google recommend available numbers in your area."
    },
    {
      "title": "Click Select next to the number you want.",
      "content": "Click Select next to the number you want. If you don't like any of the available numbers, just return to the settings menu and click Get a number again. Then, enter the same city or area code to see a new list of Google Voice numbers."
    },
    {
      "title": "Click Verify.",
      "content": "Click Verify . This is the green button. You must provide your mobile phone number to use Google Voice."
    },
    {
      "title": "Click Send code to send a verification text.",
      "content": "Click Send code to send a verification text. Google Voice will send a text message to the provided phone number. It can take a few seconds or a few minutes to receive the verification text. If you didn't get the code, click Resend code to try again."
    },
    {
      "title": "Enter the code and click Verify.",
      "content": "Enter the code and click Verify . This should be a 6-digit code."
    },
    {
      "title": "Click Claim.",
      "content": "Click Claim . This will confirm your new Google Voice number. You can now use your new Google Voice phone number to make phone calls and send texts with Google Voice."
    },
    {
      "title": "Go to https://voice.google.com in a web browser.",
      "content": "Go to https://voice.google.com in a web browser. Use this method if you want to transfer your existing Google Voice phone number to a different Google account. Keep in mind this will only transfer the number, not the call history or voicemails. [1] X Research source If you aren't already logged into your Google account, do so now. You can only transfer a Google Voice phone number once every 4 months."
    },
    {
      "title": "Click the cog icon.",
      "content": "Click the cog icon. This is in the top-right corner of the Google Voice homepage. A new page will open."
    },
    {
      "title": "Click Account.",
      "content": "Click Account . This is the tab on the left."
    },
    {
      "title": "Click Transfer a number.",
      "content": "Click Transfer a number . This is in the Transfer your number to another Voice account section. Follow the prompts to confirm your decision."
    },
    {
      "title": "Accept the transfer.",
      "content": "Accept the transfer. Log into Google Voice with the new account. Click the cog icon. Click Account . Click Accept in the Transfer your number section."
    }
  ]
}