{
  "url": "https://www.wikihow.com/Build-Rafts",
  "title": "How to Build Rafts",
  "steps": [
    {
      "title": "Lay 10 storage bins on a sheet of 0.75 in (1.9 cm) plywood.",
      "content": "Lay 10 storage bins on a sheet of 0.75 in (1.9 cm) plywood. Remove the lids from the 18 US gal (68 l) plastic storage bins and lay them upside down on the 8 ft × 4 ft (2.4 m × 1.2 m) plywood. Space them evenly in 2 rows of 5—they should fit nicely with little spacing in between them. [1] X Research source You can buy plastic storage bins and plywood sheets at any home improvement store."
    },
    {
      "title": "Drill pilot holes through the bin handles and the plywood.",
      "content": "Drill pilot holes through the bin handles and the plywood. Some brands of bin already have holes in each handle—in this case, simply drill through this hole and through the plywood below. If the handles don’t have holes, just drill through them and keep going through the plywood. [2] X Research source Choose a drill bit that has an equal or slightly larger diameter than the 1.25 in (3.2 cm)-long bolts you'll be inserting, so that the pilot holes are large enough to accept the bolts. Either prop the plywood up on blocks or low sawhorses, or place it on soft ground. That way, you won’t drill into the floor of your garage, workshop, or driveway! Drill a total of 20 pilot holes—2 per bin, 1 per handle."
    },
    {
      "title": "Remove the bins and stand the plywood upright on its long side.",
      "content": "Remove the bins and stand the plywood upright on its long side. You can lean the plywood up against sawhorses, a fence, etc., or just have a friend hold it upright for you. You just need to be able to access all the pilot holes you made. [3] X Research source"
    },
    {
      "title": "Slide washers over galvanized bolts, and place one through each pilot hole.",
      "content": "Slide washers over galvanized bolts, and place one through each pilot hole. Slip galvanized metal or heavy-duty plastic washers onto each 1.25 in (3.2 cm) bolt, then feed them into each of the 20 pilot holes. To keep them in place temporarily, place a piece of duct tape over the head of each bolt. [4] X Research source So, on one side of the plywood, each piece of duct tape will cover one bolt head and one washer that's pinned between the bolt head and the plywood. The other end of each bolt will be sticking out of the other side of the plywood. Galvanized bolts are rust-resistant and will hold up better on the water."
    },
    {
      "title": "Lay the plywood on the ground and feed the bins onto the bolts.",
      "content": "Lay the plywood on the ground and feed the bins onto the bolts. Place the plywood down so that the bolts are sticking up (and the duct tape-covered bolt heads are down). Slide the pilot holes in the handles of each bin over the bolts. [5] X Research source"
    },
    {
      "title": "Secure the bins in place by putting washers and nuts over the bolts.",
      "content": "Secure the bins in place by putting washers and nuts over the bolts. Feed galvanized or heavy-duty plastic washers over the 20 bolts, then follow up by hand-tightening 20 galvanized nuts onto the bolts. [6] X Research source Finish tightening the bolts with a ratchet that has an extension attached to it, or with a power drill that has an extended ratchet bit attached to it."
    },
    {
      "title": "Build and connect additional sections to make a larger raft.",
      "content": "Build and connect additional sections to make a larger raft. If you want a raft that’s bigger than 8 ft × 4 ft (2.4 m × 1.2 m), build one or more additional smaller rafts according to the same process. Then, attach them long side to long side by screwing in pieces of 2 in × 4 in (5.1 cm × 10.2 cm) lumber on top of the plywood decking. [7] X Research source For instance, to create an 8 ft × 8 ft (2.4 m × 2.4 m) raft, place 2 smaller rafts together long side to long side. Then use 2, 8 ft (2.4 m) long pieces of 2 in × 4 in (5.1 cm × 10.2 cm) lumber to connect the decks along their short sides. Drive in at least 1, 2.25 in (5.7 cm) galvanized screw per linear 1 ft (30 cm) of 2 in × 4 in (5.1 cm × 10.2 cm) lumber."
    },
    {
      "title": "Launch and operate the raft safely.",
      "content": "Launch and operate the raft safely. To launch the raft, employ at least 2 adults (per single raft section) to place it bin-side down in the water. Then, climb on the deck and use long poles or paddles to steer and propel the raft. [8] X Research source The plastic bins provide ample buoyancy for this raft. However, overloading the raft makes it more likely someone will fall off, so stick to 2-3 people per 8 ft × 4 ft (2.4 m × 1.2 m) section. Make sure everyone has a life vest on at all times. This raft is OK for slow-moving water (such as a lazy river), but keep it out of fast-moving or rough water."
    },
    {
      "title": "Cut",
      "content": "Cut 4 sections of 3 in (7.6 cm) diameter PVC pipe to 12 ft (3.7 m) lengths. If you find 12 ft (3.7 m) sections of 3 in (7.6 cm) diameter PVC pipe at the home improvement store, just buy 4 of them. Otherwise, use a hacksaw to cut 4 longer sections--e.g., 16 ft (4.9 m)--to length."
    },
    {
      "title": "Sand down any rough edges where you cut the PVC.",
      "content": "Sand down any rough edges where you cut the PVC. Use medium-grit sandpaper to sand away any PVC shards or burrs from the cut ends of pipe. This will ensure better adhesion of the end caps that you’re about to cement in place. [9] X Research source \"Medium grit\" generally refers to sandpaper with a grit number between 60 and 100. [10] X Research source"
    },
    {
      "title": "Cement a PVC end cap onto an end of one of the pipes.",
      "content": "Cement a PVC end cap onto an end of one of the pipes. Apply a thin layer of PVC primer all around the inside rim of the PVC end cap and the last 1 in (2.5 cm) of the end of the pipe, using the brush that’s attached to the underside of the primer can’s lid. Wait 10 seconds, then repeat the process with the PVC cement. Immediately press the end cap on firmly, give it a slight twist, and keep pressing on it for 15 seconds until the cement dries. [11] X Research source Repeat this process with the other 7 end caps and pipe ends. You’ll find small (separate) cans of PVC primer and PVC cement in the plumbing supplies section of any home improvement store. Work in a well-ventilated area to dissipate the fumes created by the PVC cement, and wear work gloves to keep it off of your hands."
    },
    {
      "title": "Add water-resistant caulk around the end cap connections.",
      "content": "Add water-resistant caulk around the end cap connections. Use a caulk gun to apply a thin bead of caulk all the way around the seam between the end cap and the pipe end. Then, wet your finger and smooth it over the caulk bead to press it into the joint. Repeat this with the other end cap connections. This step isn’t absolutely necessary, since the PVC cement should provide a lasting watertight seal. However, the caulk does provide extra insurance. Use a caulk that is labeled as water-resistant."
    },
    {
      "title": "Cut 2, 5 ft (1.5 m) lengths of 2 in × 4 in (5.1 cm × 10.2 cm) lumber.",
      "content": "Cut 2, 5 ft (1.5 m) lengths of 2 in × 4 in (5.1 cm × 10.2 cm) lumber. Buy pressure-treated lumber if possible, as it will resist rot better. Use a hand saw or circular saw to cut the lumber to length."
    },
    {
      "title": "Lay out a rectangle with the PVC pipes and the lumber.",
      "content": "Lay out a rectangle with the PVC pipes and the lumber. Looking from above, you want to create a 10 ft × 5 ft (3.0 m × 1.5 m) rectangle. Each of the 2 long sides will be made of 2 of the PVC pipes laid side-by-side. For the 2 short sides, lay the cut pieces of wood on top of the pipes, 1 ft (30 cm) in from each of the end caps. In reality, then, your rectangle will have 4, 1 ft (30 cm)-long “tails” of PVC pipe sticking out beyond its corners."
    },
    {
      "title": "Drill 4 pilot holes into each board, each over top of a PVC pipe.",
      "content": "Drill 4 pilot holes into each board, each over top of a PVC pipe. Drill the pilot holes only through the wood at this point, but locate them so that you can drive the screws straight down through the wood and into the center of the PVC pipe below. Make the pilot holes with a drill bit that has a slightly smaller diameter than the 2 in (5.1 cm) brass screws you'll be inserting."
    },
    {
      "title": "Dip a 2 in (5.1 cm) brass screw in silicone gel and slide on a waterproof washer.",
      "content": "Dip a 2 in (5.1 cm) brass screw in silicone gel and slide on a waterproof washer. The silicone gel will prevent rust and help adhere the screw to the PVC pipe. Use a rubber or plastic washer to prevent rusting. You’ll be doing this for all the screws, but work one-at-a-time. You can buy tubs of silicone gel at your local home improvement store."
    },
    {
      "title": "Drive the dipped screw into the pilot hole, and repeat.",
      "content": "Drive the dipped screw into the pilot hole, and repeat. Use a power screwdriver to twist the dipped screw through the pilot hole and into the PVC pipe, until the washer is snug against the top of the wood. Then, repeat the entire process (dipping the screws, etc.) 7 more times to secure the PVC pipes to the wood."
    },
    {
      "title": "Attach a sheet of 0.5 in (1.3 cm) thick plywood as the raft deck.",
      "content": "Attach a sheet of 0.5 in (1.3 cm) thick plywood as the raft deck. Cut the sheet of plywood to match the dimensions of the rectangle formed by the PVC pipes and the pieces of lumber—in this case, 10 ft × 5 ft (3.0 m × 1.5 m). Lay the plywood over the rectangle, and drive at least 5 brass screws through the plywood and into the pieces of lumber at each end. Dip the brass screws into the silicone gel as before. If you can’t find a large enough sheet of plywood—some stores carry a maximum size of 8 ft × 4 ft (2.4 m × 1.2 m)—attach 2 more 5 ft (1.5 m) pieces of lumber to the PVC pipes, spaced out evenly between the 2 at the ends of the raft. Then, cut 4 sheets of plywood to 5 ft × 2.5 ft (1.52 m × 0.76 m) lengths and secure them side-by-side over the 4 supports."
    },
    {
      "title": "Let the silicone dry for 4 hours before putting the raft in water.",
      "content": "Let the silicone dry for 4 hours before putting the raft in water. If the silicone isn't allowed to dry for at least 4 hours, it will simply wash off when you launch the raft in the water. Without the silicone coating, the screws will rust more quickly and the connection between the raft lumber and PVC pipe won't be as strong."
    },
    {
      "title": "Use this raft safely and only on calm water.",
      "content": "Use this raft safely and only on calm water. While this raft is buoyant enough to hold 2 adults and some gear, it should only be used on calm ponds or lakes. Don’t take it out on flowing water (like rivers) or rough water (due to wind, rain, etc.). Also, always wear an approved life vest. To add some extra buoyancy, you can glue sheets of rigid foam insulation to the underside of the plywood deck. Pick a glue intended for use with rigid foam. Even with this extra buoyancy, though, keep this raft on calm water."
    }
  ]
}