{
  "url": "https://www.wikihow.com/Be-a-Popular-Preppy-Girl",
  "title": "How to Be a Popular Preppy Girl",
  "steps": [
    {
      "title": "Wear preppy clothes.",
      "content": "Wear preppy clothes. One important thing about looking preppy is the look. Wear the latest styles, but try to add your own twist. Here are some basic suggestions: Shirts: Wear good quality shirts, in preppy colors. You can also wear brightly colored shirts, but try to team these with a pastel. Pants: Own about two pairs of dark wash skinny jeans and jean shorts (depending on the weather). Have at least one pair of khakis and a few patterned pants in stripes, plaid, etc. Shoes: Own a pair of brown riding style boots, Toms, Uggs, loafers, topsiders, canvas shoes, flats, or fuzzy boots - any of these shoes will be great. Have one pair of good quality tennis shoes too."
    },
    {
      "title": "Accessorize.",
      "content": "Accessorize. Accessories are the fun part and they can be very stylish. Try pearl earrings in your ears, which can look quite preppy. Always carry around a purse with you. Wear a watch, colorful or showy––a FitBit wouldn't go astray these days. Have a classy piece of jewelry other than the pearls, such as a charm bracelet or necklace. Some preppy charms for a charm bracelet are a tiara and a tennis racket. Get studs, a silver necklace, and small hoop earrings. Don't forget the hair. Have pretty hair bows in pink, green, and/or navy blue, use these to tie your hair up in a high ponytail or pigtails. It is also cool to get bows in your school/team colors."
    },
    {
      "title": "Have well cared for hair.",
      "content": "Have well cared for hair. Shampoo and conditioner every day, and blow dry after, if that is your thing. Do a high ponytail with an adorable hair bow added to it. You can also put your hair in a bun, put it in pigtails, or in a French braid. The perfect haircut has long layers, side bangs, and is straight. Wear your hair in curls on special occasions."
    },
    {
      "title": "Keep the makeup very light.",
      "content": "Keep the makeup very light. Some sheer gloss is really all you need. If you have bad skin, use facial cleaning products. Don't cake on the foundation but do apply mascara and blush. A thin line of eyeliner looks classy. Use concealer to cover blemishes. Cleanse your face at the end of the day so that the makeup is gone."
    },
    {
      "title": "Have confidence and assume power.",
      "content": "Have confidence and assume power. To be a popular girl, you can't be overwhelmed with all the girls asking you questions. You must be able to answer quickly and snappily, clearly and well. Give off an aura of being in control and always sound like an authority on the relevant subject."
    },
    {
      "title": "Have a preppy personality.",
      "content": "Have a preppy personality. Be classy, pleasant and smile frequently. Have a bubbly, peppy and outgoing persona. Avoid using words that everyone else overuses––have an excellent grasp of the finer words in the English language."
    },
    {
      "title": "Get involved and find a hobby.",
      "content": "Get involved and find a hobby. You have to have at least one preppy activity. Choose from horseback riding, polo, tennis, squash, track and field or lacrosse. You can also do ballet, jazz, lyrical, tap, cheerleading, basketball, softball, soccer, or volleyball. As long as you do one preppy activity, you can do one non preppy activity. Join lots of school clubs. Run for school president or for other officers. Soccer, track, tennis, lacrosse, cheer, or dance is a great choice and a great path of becoming popular, because lots of people will get to know you."
    },
    {
      "title": "Care about your studies.",
      "content": "Care about your studies. Get good grades and make good choices. Try to get A's, or a B+ average at the least. The studies come before any extracurriculars. Speak a language. Consider taking French at school and learning Italian, German, or Spanish in your free time. Learning any other language is good too. Latin helps as well. Take Chinese and ace it."
    },
    {
      "title": "Stay in good condition.",
      "content": "Stay in good condition. Exercise daily. Preppy girls are never unfit. Eat healthily. Drink herbal tea and have plenty of water."
    },
    {
      "title": "Have a fun room to take friends home to.",
      "content": "Have a fun room to take friends home to. Decorate the room as you'd like it to be but ensure that it is up-to-date and hip, as well as a cool place to hang out in."
    }
  ]
}