{
  "url": "https://www.wikihow.com/Calculate-Bond-Value",
  "title": "How to Calculate Bond Value",
  "steps": [
    {
      "title": "Consider how a bond works, and why bonds are issued.",
      "content": "Consider how a bond works, and why bonds are issued. A bond is a debt instrument. Entities issue bonds to raise money for a specific purpose. Governments issue bonds to raise capital for public projects, like a road or a bridge. Corporations issue bonds to raise money to expand their businesses. [1] X Expert Source Marcus Raiyat Foreign Exchange Trader Expert Interview. 8 April 2021. All of the features of a bond are stated in the bond indenture. Bonds are usually issued in multiples of a $1,000. Assume, for example, that IBM issues a $1,000,000 6% bond due in 10 years. The bond pays interest semi-annually. $1,000,000 is the face amount or principal amount of the bond. That is the amount that must be repaid by the issuer at maturity. IBM (the issuer) must repay the $1,000,000 to the investors at the end of 10 years. The bond matures in 10 years. The bond pays interest of ($1,000,000 multiplied by 6%), or $60,000 per year. Since the bond pays interest semiannually, the issuer must make two payments of $30,000 each."
    },
    {
      "title": "Review how an investor can profit from owning a bond.",
      "content": "Review how an investor can profit from owning a bond. Using the same example, keep in mind that dozens of investors may buy a portion of the $1,000,000 bond issue. Each investor will be paid interest twice per year. An investor will also receive their original investment (principal or face amount) when the bond reaches the maturity date. Many retired people buy bonds because of the predictable stream of income from the interest payments. All bonds are rated, based on their ability to pay interest and repay principal on a timely basis. A bond with a higher rating is considered a safer investment due to the collateral securing the bond and/or the financial strength of the issuer. All things being equal, lower rated bonds generally pay a higher rate of interest since they have greater risk of default. Assume that IBM and Acme Corporation both issue a bond due in 10 years. IBM has a high credit rating and offers a 6% interest rate. If Acme has a lower rating, the company will have to offer a rate higher than 6% to attract investors."
    },
    {
      "title": "Go over present value.",
      "content": "Go over present value. To compute the value of a bond at any point in time, you add the present value of the interest payments plus the present value of the principal you receive at maturity. [2] X Research source Present value adjusts the value of a future payment into today’s dollars. Say, for example, that you expect to receive $100 in 5 years. To find out what the $100 payment is worth today, you would compute the present value of $100. The dollar amount is discounted by a rate of return over the period. This rate of return is often called the discount rate. An investor can select the discount rate using several different approaches. The discount rate may be your estimate of the rate of inflation over the remaining life of the bond. Your discount rate may also be a minimum expected rate of return. The minimum expectation is based on the bond’s credit rating, and the interest rate paid by bonds of similar quality. Assume that you decide on a 4% discount rate for the $100 payment due in 5 years. The discount rate is used to discount (reduce) the value of your future payments into today’s dollars. In this case, you’re calculating the present value of a single sum of money. You can find present value tables on the Internet, or simply use an online present value calculator. If you use a table, you will locate the present value factor for a 4% discount rate for 5 years. That factor is .822. The present value of $100 is ($100 X .822 = $82.20). The present value of your bond is (present value of all interest payments) + (present value of principal repayment at maturity)."
    },
    {
      "title": "Use the concept of an annuity to calculate the value of your interest payments.",
      "content": "Use the concept of an annuity to calculate the value of your interest payments. An annuity is a specific dollar amount paid to an investor for a stated period of time. The interest payments on your bond are considered a type of annuity. To calculate the present value of your interest payments, you calculate the value of a series of equal payments each year over time. If your 10-year, $1,000 pays 10% interest each year, for example, you would earn a fixed amount of $100 per year for 10 years. The formula for present value requires you to separate your annual interest payments into the smaller amounts you receive during the year. If, for example, your $1,000 bond pays interest twice a year, you would use two payments of $50 each in your present value calculation. The sooner you are able to receive any payment, the more valuable it is to you. This concept is sometimes called the \"time value of money\", Receiving $1 today is inherently more valuable than receiving $1 tomorrow because over the time you hold the $1 you can invest it (or simply spend it) and to gain a return. Following that logic, if you receive $50 in June and $50 in December those payments are more valuable than receiving the entire $100 in December. This is because you have the opportunity to use the initial $50 without having to wait until the end of the year."
    },
    {
      "title": "Apply the present value of an annuity (PVA) formula to your interest payments.",
      "content": "Apply the present value of an annuity (PVA) formula to your interest payments. The formula is P V A = I [ 1 − ( 1 + k ) − n ] / k {\\displaystyle PVA=I[1-(1+k)^{-}n]/k} . The variables in the formula require you to use the interest payment amount, the discount rate (or required rate of return) and the number of years remaining until maturity. [3] X Research source Assume that a bond has a face value of $1,000 and a coupon rate of 6%. The annual interest is $60. Divide the annual interest amount by the number of times interest is paid per year. This calculation is I, the periodic interest paid. For example, if the bond pays interest semiannually, I = $30 per period. Each period is 6 months. Determine discount rate. Divide the discount rate required by the number of periods per year to arrive at the required rate of return per period, k. For example, if you require a 5% annual rate of return for a bond paying interest semiannually, k = (5% / 2) = 2.5%. Calculate the number of periods interest is paid over the life of the bond, or variable n. Multiply the number of years until maturity by the number of times per year interest is paid. For example, assume that the bond matures in 10 years and pays interest semi-annually. In this case, n = (10 X 2) = 20 interest-paying periods. Plug in I, k and n into the present value annuity formula P V A = I [ 1 − ( 1 + k ) − n ] / k {\\displaystyle PVA=I[1-(1+k)^{-}n]/k} to arrive at the present value of interest payments. In this example, the present value of interest payments is $30[1-(1+0.025)^-20]/0.025 = $467.67."
    },
    {
      "title": "Input the variables and calculate the present value of the principal payments.",
      "content": "Input the variables and calculate the present value of the principal payments. The present value of the interest payments was an annuity, or a string of payments. The principal is a single repayment to the investor at maturity. [4] X Research source If, for example, you own a $100,000 bond due in 10 years (the bond has a likely face value of $1,000, $100,000 represents the entire issue), you will receive a single payment of $100,000 10 years from now. You use a discount rate to discount (reduce) that single payment into a value today. The formula uses some of the same values you used in the annuity formula. Use the annuity formula first then apply those same variables to the principal payment formula. Plug in k and n into the present value (PV) formula. Use the formula P V = F V / ( 1 + k ) n {\\displaystyle PV=FV/(1+k)^{n}} to arrive at the present value of the principal at maturity. For this example, PV = $1000/(1+0.025)^10 = $781.20. Add the present value of interest to the present value of principal to arrive at the present bond value. For our example, the bond value = ($467.67 + $781.20), or $1,248.87. Investors use the present value to decide whether or not they want to invest in a particular bond."
    }
  ]
}