{
  "url": "https://www.wikihow.com/Color-Your-Hair-Brown-Naturally",
  "title": "How to Color Your Hair Brown Naturally",
  "steps": [
    {
      "title": "Pour the henna powder into a bowl.",
      "content": "Pour the henna powder into a bowl. Once you’ve chosen the best color for your hair, empty the henna powder into a glass or stainless steel bowl. You'll likely be pouring the entire packet of henna hair dye into the bowl to have enough to cover all of your hair. [1] X Research source You’ll be using 50% henna powder and 50% indigo powder, so purchase the same amount of each. Choose a henna dye that works on hair, paying special attention to the color to ensure it’s a brown tone and not vibrant red. Look for henna powder at a big box store or online."
    },
    {
      "title": "Heat water to a temperature of 103–104 °F (39–40 °C).",
      "content": "Heat water to a temperature of 103–104 °F (39–40 °C). There’s no precise measurement, but roughly 1 cup (240 ml) of water should work well. Pour the water into a microwave-safe bowl and heat it for about 45 seconds—the temperature needs to be at least 100 °F (38 °C), but 103–104 °F (39–40 °C) is ideal. [2] X Research source Make sure you're using a microwave-safe bowl or cup to heat the water, and use an oven mitt to remove the water if the container is too hot to touch. Use a thermometer to take the temperature of the water. While water is the easiest liquid to use, you can also use apple cider vinegar or green tea, heating it up the same way you would water."
    },
    {
      "title": "Stir the liquid into the henna powder slowly to form a thick paste.",
      "content": "Stir the liquid into the henna powder slowly to form a thick paste. Pour the warm water into the bowl with henna powder in small amounts. Stir it together using a spoon, adding a little more water until the mixture forms a thick paste that drips off of a spoon slowly. [3] X Research source There isn’t a precise measurement because each different henna product will absorb liquid a little differently."
    },
    {
      "title": "Let the henna mixture sit for 3-4 hours.",
      "content": "Let the henna mixture sit for 3-4 hours. Once you’ve created a thick paste with the henna powder and water or other liquid, leave it in the bowl to sit for several hours at room temperature uncovered. Avoid stirring the mixture so that the henna can oxidize. [4] X Research source Don’t let the henna mixture sit overnight, as this long amount of time will make the color lose its potency."
    },
    {
      "title": "Pour a packet of indigo powder into the bowl.",
      "content": "Pour a packet of indigo powder into the bowl. You want to use just as much indigo powder as you did henna powder, so double-check the packaging to ensure you're pouring in the same amount. Use a clean glass or stainless steel bowl to hold the indigo powder. [5] X Research source If you didn’t measure how much henna you poured into the bowl, use your best judgement to try to make the two as equal as possible. Don’t combine the indigo powder with the henna mixture yet."
    },
    {
      "title": "Add water to the indigo powder until you form a thick paste.",
      "content": "Add water to the indigo powder until you form a thick paste. Using the same water that you used for the henna dye, slowly pour the water into the bowl of indigo powder. Stir it using a spoon, adding more water in small amounts until you’ve formed a thick paste. [6] X Research source If desired, you can add 0.5 tsp (2.5 ml) of salt to the mixture to help the indigo powder stick to your hair."
    },
    {
      "title": "Let the indigo mixture sit for 15-20 minutes.",
      "content": "Let the indigo mixture sit for 15-20 minutes. Once you’ve made a thick paste from the indigo powder and water, let it sit in the bowl for 15-20 minutes. Avoid stirring it so that the ingredients can oxidize. [7] X Research source Don’t let the indigo mixture sit for more than 30 minutes."
    },
    {
      "title": "Combine the indigo with the henna, stirring thoroughly.",
      "content": "Combine the indigo with the henna, stirring thoroughly. After the 15-20 minutes are up, pour the indigo mixture into the bowl with the henna mixture. Use a spoon to combine the two mixtures thoroughly so it’s all one color. Now the hair dye is ready to use! [8] X Research source Try to use the hair dye immediately for the best results, as you can’t save it for later."
    },
    {
      "title": "Bring 2 cups (0.47 l) of water to a boil.",
      "content": "Bring 2 cups (0.47 l) of water to a boil. Use a measuring cup to measure out 2 cups (0.47 l) of water. Pour the water into a pot and bring the water to a boil on the stove. [9] X Research source Use caution when working with boiling water to avoid injuring yourself."
    },
    {
      "title": "Add cornstarch to water to create a watery mixture.",
      "content": "Add cornstarch to water to create a watery mixture. Measure out 2 US tbsp (30 ml) of cornstarch into a small bowl. Add the boiling water in small amounts while stirring until you form a slightly watery mixture of cornstarch and water. Make sure to mix the two ingredients together thoroughly so there aren’t any clumps. [10] X Research source"
    },
    {
      "title": "Pour 3 US tbsp (44 ml) of coffee into the boiling water.",
      "content": "Pour 3 US tbsp (44 ml) of coffee into the boiling water. You can use any coffee you’d like, though organic kinds are often preferred. Use a measuring spoon to measure out 3 US tbsp (44 ml), dumping each spoonful into the pot of boiling water. Stir the coffee into the water so that it’s thoroughly mixed. [11] X Research source Organic coffees don't have the preservatives and added chemicals that non-organic types of coffee often have. Try to choose coffee that has a rich brown color."
    },
    {
      "title": "Let the coffee and water boil for 5 minutes while stirring.",
      "content": "Let the coffee and water boil for 5 minutes while stirring. Once the coffee is stirred into the water, let it continue boiling for 5-6 more minutes. Keep stirring the mixture occasionally so that the coffee continues to dissolve into the water. [12] X Research source"
    },
    {
      "title": "Add in the cornstarch mixture to create a thick consistency.",
      "content": "Add in the cornstarch mixture to create a thick consistency. With the water still boiling, take your small bowl of cornstarch and pour it into the coffee mixture. Stir it in using a large spoon for 2-3 minutes. [13] X Research source You should see a thick consistency beginning to form."
    },
    {
      "title": "Turn off the stove and let the mixture cool for a couple minutes.",
      "content": "Turn off the stove and let the mixture cool for a couple minutes. Take the pot off the heated burner and let it cool down for 2-5 minutes. You don’t need to continue stirring the mixture while it’s cooling. Pour the mixture into a separate bowl to make it easier to use the dye later on. [14] X Research source"
    },
    {
      "title": "Pour coconut oil and aloe vera gel into the cooled coffee mixture.",
      "content": "Pour coconut oil and aloe vera gel into the cooled coffee mixture. After the mixture has cooled slightly, add 1 US tbsp (15 ml) of coconut oil and 0.5 US tbsp (7.4 ml) of aloe vera gel into the bowl. [15] X Research source Purchase coconut oil and aloe vera gel from your local grocery store or big box store."
    },
    {
      "title": "Mix the ingredients together until they’re fully combined.",
      "content": "Mix the ingredients together until they’re fully combined. Use a large spoon to combine the coconut oil and aloe vera gel into the coffee mixture. Once it’s thoroughly mixed, the hair dye is ready to be used! [16] X Research source You’ll leave this mixture on your hair for 30 to 45 minutes, rinsing it off with water once you’re finished. Avoid shampooing your hair for at least 24 hours after you dye it."
    },
    {
      "title": "Cover your body and work surface to avoid staining them.",
      "content": "Cover your body and work surface to avoid staining them. Wear plastic or latex gloves on your hands when working with the dye, and consider changing into clothes that you don't mind getting dirty or stained. If you're worried about staining your table or counter, place plastic over it for protection. [17] X Research source The best place to dye your hair is in the bathroom or kitchen, as these often have surfaces that clean easily. Place plastic garbage bags over the counter, or use layers of paper grocery bags."
    },
    {
      "title": "Use coconut oil on your hairline to keep the dye off your skin.",
      "content": "Use coconut oil on your hairline to keep the dye off your skin. The coconut oil will ensure the dye doesn't stain your face. Rub it along the top of your forehead and down the sides of your face close to your hair, applying it in a thin even layer. [18] X Research source Purchase coconut oil from your local grocery store or big box store. Wash the coconut oil off after you rinse out the hair dye."
    },
    {
      "title": "Section out a piece of hair that's 1–2 in (2.5–5.1 cm) wide.",
      "content": "Section out a piece of hair that's 1–2 in (2.5–5.1 cm) wide. Separating your hair into small sections will make sure the dye reaches each piece. If you have thin hair, you might apply the dye to a 2 in (5.1 cm) section of hair, while thicker hair would dye better using 1 in (2.5 cm) sections. [19] X Research source"
    },
    {
      "title": "Apply the dye to your hair starting at the roots and going down.",
      "content": "Apply the dye to your hair starting at the roots and going down. Using your fingers, start at your hair's roots and distribute a palmful of dye down the length of the strand by pressing the hair in between your fingers. Move slowly down the length of the strand, making sure you rub hair dye into it evenly. [20] X Research source How much hair dye you use for each strand will depend on the length of your hair—longer hair will need a larger scoop, while short hair will need less. If you run out of dye as you’re smoothing it along the strand, just scoop out a little more from the bowl."
    },
    {
      "title": "Twist the strand to create a swirl on top of your head.",
      "content": "Twist the strand to create a swirl on top of your head. With the strand completely covered in hair dye, twist the strand to create a coil, and continue twisting it until you form a swirl on top of your head. [21] X Research source The swirl should stay in place naturally due to the stickiness of the hair dye, but you can also use a clip to keep it in place."
    },
    {
      "title": "Continue applying the dye to each strand of hair.",
      "content": "Continue applying the dye to each strand of hair. Go along the rest of your head applying the hair dye to 1–2 in (2.5–5.1 cm) sections. Smooth the dye along each strand before twisting it up in a swirl on top of your head. Keep repeating this process until all of your hair has dye on it. [22] X Research source"
    },
    {
      "title": "Rub any leftover dye onto your hair using a hair color dye brush.",
      "content": "Rub any leftover dye onto your hair using a hair color dye brush. If you have extra dye paste left over once you’ve rubbed it into each strand, use a hair color dye brush or a regular basting brush to apply the extra to your hair. You can rub it on your roots or use it to touch up any spots that may not have enough dye. [23] X Research source Use a paper towel or cotton ball to remove any extra dye from around your face."
    },
    {
      "title": "Wrap your hair in plastic wrap and wait the recommended amount of time.",
      "content": "Wrap your hair in plastic wrap and wait the recommended amount of time. Rip off a piece of plastic wrap that will cover your entire head. Wrap it around your hair carefully so that all of your hair is covered up with the plastic wrap. [24] X Research source If you used henna to dye your hair, you’ll likely need to wait 30 minutes. Wait 30 to 45 minutes if you used the coffee mixture to dye your hair."
    },
    {
      "title": "Rinse the dye out of your hair to enjoy your new hair color.",
      "content": "Rinse the dye out of your hair to enjoy your new hair color. After you’ve waited the right amount of time for your specific type of hair dye, rinse the dye out carefully using cold water. It’s easiest to do this in the shower, being careful to try not to get the dye all over your body as you’re rinsing. [25] X Research source If desired, have a friend or family member help you rinse out the hair dye. Try to wait to shampoo your hair for at least 24 hours."
    }
  ]
}