{
  "url": "https://www.wikihow.com/Change-Online-Excel-Language",
  "title": "How to Change Online Excel Language",
  "steps": [
    {
      "title": "Go to https://account.microsoft.com/profile/.",
      "content": "Go to https://account.microsoft.com/profile/ . You can use any web browser to access your Microsoft account and change the language. Log in if prompted."
    },
    {
      "title": "Click Change display language.",
      "content": "Click Change display language . It's at the bottom of the first grouping of menu options with your email address and birthday."
    },
    {
      "title": "Select the language you want to change to.",
      "content": "Select the language you want to change to. It will highlight to indicate that it has been selected."
    },
    {
      "title": "Click Select and OK.",
      "content": "Click Select and OK . The display language (all the menus in Excel online) will update to reflect this new language. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Go to https://www.office.com/signin.",
      "content": "Go to https://www.office.com/signin . You might not have the allowances to change the display language, so if these following steps don't work for you, you'll need to contact your organization's IT department for help. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click .",
      "content": "Click . You'll see this gear icon in the top right corner of your screen."
    },
    {
      "title": "Click Edit.",
      "content": "Click Edit . It's under the \"Language and time zone\" header."
    },
    {
      "title": "You'll be prompted to select a new language.",
      "content": "You'll be prompted to select a new language. If you don't see the language settings, you might need to contact an administrator to help. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Follow the same steps for SharePoint sites and Dropbox to change your language in your profile settings. However, any changes made in Microsoft 365 for Business will override settings in SharePoint and Dropbox. If you can't change your language in Microsoft 365 for Business, you won't be able to change the settings for the same account in SharePoint and Dropbox, both of which require an admin account to change. [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    }
  ]
}