{
  "url": "https://www.wikihow.com/Beat-Exodia",
  "title": "How to Beat Exodia",
  "steps": [
    {
      "title": "Go first.",
      "content": "Go first. If you already know they will play Exodia, volunteer to go first, or choose first if you win at rock-paper-scissors, coin flipping, etc. Exodia, unlike most OTK decks, is perfectly capable of winning on the first turn, because their win condition does not depend on attacking. If you go first, you will be able to set up the anti-Exodia cards mentioned later in this article."
    },
    {
      "title": "Know they are playing Exodia.",
      "content": "Know they are playing Exodia. Seeing them add an Exodia piece using Pot of Duality or Sangan is a dead giveaway. When they do, be sure to remember that card. You can also tell if they are playing: a lot of draw cards (like One Day of Peace, Upstart Goblin, or Magical Mallet), deck thinning cards (like three Toon Table of Contents), or pieces of popular draw engines (Royal Magical Library and Spell Power Grasp, Heart of the Underdog with a bunch of normal monsters)."
    },
    {
      "title": "Know when they have Exodia.",
      "content": "Know when they have Exodia. Time your discard cards for when you know you can hit one of the pieces. You can tell when your opponent has Exodia by watching the cards they play from their hands. If they are activating spells and setting traps as soon as they get them but always have a few cards left in their hand, they are probably Exodia. Also, if they play Magical Mallet, the cards they don't shuffle in will likely include the pieces. If they haven't won yet but have less than ~5 cards in their deck to go through, start panicking."
    },
    {
      "title": "Use hand-traps.",
      "content": "Use hand-traps. The only way to respond to an Exodia deck that goes first on the first turn is with effects from your hand. Droll and Lock Bird can be activated on their first draw effect, and prevents them from searching or drawing for the rest of the turn. If you're playing against a turbo FTK variant, you've won. Ash Blossom & Joyous Spring is also a good hand-trap. It can negate one draw or search effect, but it also has increased utility against other decks, and is very effective against the current meta."
    },
    {
      "title": "Use Mind Crush.",
      "content": "Use Mind Crush. Mind Crush is a versatile card which has uses even against other decks, something that does not apply to most of these other options. It is a trap card whose effect allows you to declare a card name. The opponent will have to discard all cards with that name from their hand. The best time to use this is when you have seen your opponent add an Exodia piece - usually with Pot of Duality, Sangan, or Heart of the Underdog. If not, simply call an Exodia piece when your opponent seems to have a large enough hand. Mind Crush will force your opponent to reveal their hand for verification, so memorize any Exodia pieces present."
    },
    {
      "title": "Discard the pieces.",
      "content": "Discard the pieces. PSY-Framelord Omega can banish a random card from your opponent's hand as a quick effect, and Trickstar Reincarnation banishes their entire hand and makes them draw a new one. You can also run cards like Full Force Virus, Deck Devastation Virus or Dragged Down into the Grave. If you want a surefire way to remove Exodia, use Exchange. This will allow you and your opponent to swap a card from the hand, and there is no way to get a card back from an opponent's hand."
    },
    {
      "title": "Prevent them from drawing.",
      "content": "Prevent them from drawing. Null and Void is a good card for this, since it forces the opponent to discard all drawn cards when they draw. Most Exodia variants play all spell cards and are completely dependent on them. Something like Anti-Spell Fragrance, Imperial Order, or Eradicator Epidemic Virus will lock them down completely. You can also negate Spells with cards like Magic Jammer, Dark Bribe, and Cursed Seal of the Forbidden Spell. Cursed/Broken Bamboo Sword is also usually an important combo piece for them, so using spell/trap destruction on it can slow them down, but this is an uphill battle. Typhoon is one of the few spell/trap destruction hand traps. If they use Royal Magical Library, negate the Library's summon or effect, flip it face-down, or destroy it. If they're playing Trap Stall Exodia, Royal Decree and Trap Stun will kill them. When they're relying on Battle Fader or Swift Scarecrow to block attacks, negate them with Solemn Strike, etc, or prevent them from activating entirely with a card like Utopia the Lightning, Armades, or Odd-Eyes Meteorburst Dragon."
    },
    {
      "title": "Defeat them quickly.",
      "content": "Defeat them quickly. If they aren't playing stall cards like Swift Scarecrow and Battle Fader, just attack them with powerful monsters. Chances are, if they are getting bad draws, they'll lose soon enough. Battle Fader's summon can be negated, and Swift Scarecrow can be negated with Mind Drain."
    }
  ]
}