{
  "url": "https://www.wikihow.com/Ask-a-Girl-to-a-Dance",
  "title": "How to Ask a Girl to a Dance",
  "steps": [
    {
      "title": "Ask her a few weeks before the dance.",
      "content": "Ask her a few weeks before the dance. Don't wait to ask her on the day of the dance. She might already have a date by then, and there's a chance that she'll think she wasn't your first choice. Ask her around two to three weeks before the dance. This also gives her time to figure out what to wear."
    },
    {
      "title": "Practice what you’ll say.",
      "content": "Practice what you’ll say. Spend a few minutes going over what you want to say so you don’t trip over your words when the time comes. You can even practice in front of the mirror until your question sounds casual and sincere. Make sure you have a go-with-the-flow attitude. [1] X Research source"
    },
    {
      "title": "Dress nicely",
      "content": "Dress nicely . You don't have to go all out and wear something like a suit; save that for the dance. Just make sure you've showered, your hair looks nice, and that you're wearing an outfit that doesn't look sloppy. [2] X Research source Use deodorant and brush your teeth beforehand. Don't overdo it on the cologne, as this might push her away."
    },
    {
      "title": "Remember, no means no.",
      "content": "Remember, no means no. If she says she doesn't like you in that way or just says “no,” then back off. Nothing ticks a girl off more than an annoying guy that doesn't leave her alone. Not only is it rude, but it can make her dislike you more. If she says \"no,\" do not ask why. Say something like, \"Oh, all right. No problem.\" If she says, \"I'll think about it,\" don't call her for a confirmed response. Wait until she calls you back. If she doesn't call back three days before the date of the dance, take it as a no."
    },
    {
      "title": "Bring her a small gift.",
      "content": "Bring her a small gift. Pick up something simple like flowers or candy. Give the gift to her before you ask if she’ll be your date. There won't be as much pressure on her to say yes if you stick with something simple, and she'll appreciate the kind gesture. [3] X Research source"
    },
    {
      "title": "Get romantic.",
      "content": "Get romantic. Asking her in a romantic way will create a memory she won’t forget. One idea is to put a bunch of keys in a bucket and label one with the words “find the key to my heart.” Label it with your address, and hopefully she'll follow cue and come over to your house where you can finally ask her to the dance. [4] X Research source"
    },
    {
      "title": "Spell it out.",
      "content": "Spell it out. Write your message on balloons and deliver them to her. Each balloon could have a different word on it (e.g. one balloon each for “Will” “you” “go” “to” “the” “dance” “with” “me” “?”). You could also spell out your message in candy, like jellybeans or lollipops. Get permission (from the principal or her parent) to put the candy message in her locker or her bedroom. [5] X Research source"
    },
    {
      "title": "Write it in chalk.",
      "content": "Write it in chalk. Get permission from her parents to decorate her driveway. Spell out your message, or simply put “Dance?” Get creative by using a variety or colors or illustrating your message. [6] X Research source"
    },
    {
      "title": "Create a treasure hunt.",
      "content": "Create a treasure hunt. Design a treasure hunt with a map that will lead her straight to you. For example, draw a map of your school and add a dotted line leading to the parking lot. Wait there for her to arrive, and present her with flowers or candy for completing the hunt. Then ask her to the dance. [7] X Research source"
    },
    {
      "title": "Start the conversation.",
      "content": "Start the conversation. Before asking a girl to a dance, you should start the conversation with something as generic as a simple hello. Try this method and you will come across her smoothly. [8] X Research source"
    },
    {
      "title": "Ask her in person.",
      "content": "Ask her in person. Though you may be tempted to ask her over text message, she’ll appreciate it more if you ask her in person. You can text her to see if she can meet up with you, or find her before or after class. [9] X Research source"
    },
    {
      "title": "Make sure that you two are alone.",
      "content": "Make sure that you two are alone. Find a private area at school (but not too private), and ask her there. If you ask her in public, she may feel pressured to say yes and this also puts her in an embarrassing situation. Asking her in public could also be embarrassing for you if she declines your invitation!"
    },
    {
      "title": "Be confident",
      "content": "Be confident . Take a deep breath before you approach her. Look her straight in the eyes and keep your head up during the conversation so you appear present and engaging. No matter how nervous you are, take your time. [10] X Research source"
    },
    {
      "title": "Tell her that she looks nice",
      "content": "Tell her that she looks nice . Start the conversation by saying something like, “You look very nice today.” Hopefully, she'll appreciate the compliment and it will make the “asking her out” part much easier."
    },
    {
      "title": "Make your move.",
      "content": "Make your move. Be straightforward and explain that you want her to be your date. Say something like “Would you like to go to the dance with me?” or “I was hoping we could go to the dance together. What do you think?” If she already has a date, you can say something like, “Oh, that’s a bummer. I was hoping we could go together. Maybe next time?”"
    }
  ]
}