{
  "url": "https://www.wikihow.com/Care-for-a-Marine-Hermit-Crab",
  "title": "How to Care for a Marine Hermit Crab",
  "steps": [
    {
      "title": "Get a tank that’s at least 10 gallons (38 L) for your hermit crab to live in.",
      "content": "Get a tank that’s at least 10 gallons (38 L) for your hermit crab to live in. Hermit crabs are small, but they still need lots of space to roam around and explore. If you plan on getting more than two hermit crabs, you should consider getting a tank that’s around 30–40 gallons (114–151 L) (114-151 L). [1] X Research source A glass or acrylic tank will give you the clearest view of your hermit crab, or you can use a plastic tank for a more cost-effective option. [2] X Research source"
    },
    {
      "title": "Place your hermit crab’s tank in a location away from direct sunlight.",
      "content": "Place your hermit crab’s tank in a location away from direct sunlight. Never leave your hermit crab’s tank on a windowsill or in a spot in a room that gets direct sunlight. The sun could warm up the tank and cause your hermit crab to overheat. [3] X Research source Set your hermit crab's tank in a spot that's easy to access and where it won't get in the way, like on a stand in your living room or bedroom."
    },
    {
      "title": "Fill the bottom of your hermit crab’s tank with a crab-friendly substrate.",
      "content": "Fill the bottom of your hermit crab’s tank with a crab-friendly substrate. Substrate is whatever material is used to cover the bottom of a tank. The best substrate for hermit crabs is sand. You can buy live sand from your local fish store—it contains beneficial bacteria and tiny ocean organisms which help cycle your water, improving your overall tank health. Don't use sand from the beach or anywhere outside. It might contain insects or other organisms that could hurt your hermit crab. [4] X Research source Look at your local hardware store for a bag of play sand to use as a cost-effective substrate. [5] X Research source"
    },
    {
      "title": "Turn your hermit crab’s tank into a saltwater habitat.",
      "content": "Turn your hermit crab’s tank into a saltwater habitat . You’ll want to include “live” rock (rock that contains living bacteria on it) and living macro algae to help keep the tank filtered. Talk to someone at your local pet store about products they have that you can add to your hermit crab’s tank so it’s properly salinated. [6] X Research source You can find aquarium salt packs (to mix your own saltwater) as well as gallon containers of pre-mixed saltwater at your local pet store. [7] X Research source You’ll also need to get a thermometer and other readers so you can check in on the different levels in the tank and make adjustments when needed."
    },
    {
      "title": "Introduce your hermit crab to its new home gradually.",
      "content": "Introduce your hermit crab to its new home gradually. Place your hermit crab in a bag (with the water it’s been living in) and float the bag in its new tank. Every few minutes, add a little bit of water from the new tank into the bag so your hermit crab slowly adjusts to it. Once the amount of water in the bag has doubled, dump out half of the water in the bag. Repeat the process until all of the water in the bag with your hermit crab is from the new tank. You can then release your hermit crab into its new home. [8] X Research source"
    },
    {
      "title": "Feed your hermit crab pellet food once a day.",
      "content": "Feed your hermit crab pellet food once a day. You can find hermit crab pellet food online or in your local pet store. Just drop the pellet food into your hermit’s crab tank so it sinks to the bottom where your hermit crab can find it. [9] X Research source"
    },
    {
      "title": "Give your hermit crab other foods to keep its diet diverse.",
      "content": "Give your hermit crab other foods to keep its diet diverse. Hermit crabs are scavengers in the wild, and they enjoy eating different things every day. Supplement your hermit crab’s diet with foods you find at the grocery store like raw fish and shrimp. You can also order seaweed and freeze-dried krill online to feed your hermit crab. Experiment with different foods to find out what your hermit crab’s favorites are. [10] X Research source Before you give your hermit crab any meat, chop it up into smaller pieces. Only give your hermit crab a little at a time; leftover pieces of meat can rot and cause your hermit crab’s tank to smell. [11] X Research source"
    },
    {
      "title": "Check your hermit crab’s tank for uneaten food when you clean it.",
      "content": "Check your hermit crab’s tank for uneaten food when you clean it. Hermit crabs like to stash food away for a later meal, but sometimes they don’t go back and eat it. Check any empty shells or hidden shelters in your hermit crab’s tank for old food when you’re cleaning the tank. Remove the old food so the tank doesn’t develop a bad odor. [12] X Research source"
    },
    {
      "title": "Give your hermit crab \"land\" if it needs it.",
      "content": "Give your hermit crab \"land\" if it needs it. Find out what species of hermit crab you have and research what part of the world it’s from. Read about its natural habitat to see if its species has access to land in the wild. If it does, make the water line in your tank a little lower and add a live rock that peeks out above the surface so your hermit crab can climb on it. [13] X Research source Ask someone at your local pet store if you’re not sure what species your hermit crab is. If you're still not sure what species your hermit crab is, try entering some of it's main features into an online search. Look through the results for a photo of a hermit crab that looks just like yours. For example, you could search online for \"species of large hermit crab with black and orange horizontal stripes.\""
    },
    {
      "title": "Mimic the temperature of your hermit crab’s natural environment in the tank.",
      "content": "Mimic the temperature of your hermit crab’s natural environment in the tank. Once you know the species of your hermit crab and where it comes from, you can look up the temperature cycle in that region. Using a tank heater and a thermometer, adjust the temperature in your hermit crab’s tank throughout the year to simulate the changes in temperature the hermit crab would experience in the wild. [14] X Research source For example, if your hermit crab comes from a coastal region where the water temperature is between 75-85 degrees Fahrenheit (24-29 C) in the summer, and 50-60 degrees Fahrenheit (10-16 C) in the winter, you should try to replicate those temperature fluctuations throughout the year. Make the adjustments in temperature gradually so you don’t stress out your hermit crab. Never change the temperature more than 4 °F (−16 °C) in a 24-hour period. [15] X Research source"
    },
    {
      "title": "Provide your hermit crab with extra shells for when it molts.",
      "content": "Provide your hermit crab with extra shells for when it molts. Hermit crabs molt, or shed their old skin, several times throughout their lives. When your hermit crab molts, it will grow slightly larger and need a larger shell. Leave several shells (each slightly larger than your hermit crab’s current shell) throughout the tank so your hermit crab has options to choose from. [16] X Research source"
    },
    {
      "title": "Do your research before you introduce your hermit crab to a new friend.",
      "content": "Do your research before you introduce your hermit crab to a new friend. Not all hermit crab species take well to other hermit crabs or marine species, so it’s important you check before you release a new animal into your hermit crab’s tank. Some species of hermit crab will eat other fish, or even other hermit crabs, in their tank. If you’re unsure, ask someone at your local pet store for advice. [17] X Research source You can also search online for information about your hermit crab's temperament. For example, you could search \"can my thin stripe hermit crab be in a tank with other hermit crabs and fish?\""
    }
  ]
}