{
  "url": "https://www.wikihow.com/Apply-for-a-DBA-in-Texas",
  "title": "How to Get a DBA in Texas",
  "steps": [
    {
      "title": "Understand what an assumed name is.",
      "content": "Understand what an assumed name is. [2] X Research source Business Organizations: Cases, Problems, and Case Studies, Smith &amp; Williams (Aspen Publishing, 3rd Edition). An assumed name is a business name that is not the legal name of the business or organization. It's also known a \"trade name\" or \"fictitious business name.\" A business cannot be sued under its assumed name because the assumed name does not create a legal entity. It simply is a named assumed by an existing legal entity. Therefore, while your business can operate using a registered assumed name, it must use its legal name for any legal transactions, including signing contracts or leases and buying inventory."
    },
    {
      "title": "Decide if you should apply for a “Name Registration.”",
      "content": "Decide if you should apply for a “Name Registration.” Businesses in Texas must register their legal name with the Secretary of State, so public can find information on them. No two businesses in Texas may have the same name registered with the Secretary of State. Therefore, filing for a name registration will prevent other businesses from filing under your chosen name, and your business cannot file under a name that is already registered."
    },
    {
      "title": "File for an assumed name if you already have a registered name.",
      "content": "File for an assumed name if you already have a registered name. You should already have a legal name registered with the Secretary of State for your business before doing this. An assumed name lets you present your business to the public using a different name than the one listed on your name registration. More than one business can have the same assumed name registered in Texas. Therefore, you cannot prevent another company for using your “assumed” name just because you have an assumed name certificate."
    },
    {
      "title": "Know the reasons for requesting an assumed name.",
      "content": "Know the reasons for requesting an assumed name. Businesses often file for assumed names when they can't register the legal name the owners want. This is usually because another business has already done so. With an assumed name, you'll still be able to present the name you want to the public. Franchising is another common reason for getting an assumed name. For example, if “Lexus” was opening a branch in Texas, the registered legal name would simply be “Lexus.” However, the particular franchisee may want to use the assumed name “Lexus of Houston” in the community."
    },
    {
      "title": "Make sure your desired name is available.",
      "content": "Make sure your desired name is available. Do this before you fill out any paperwork. Although legally, multiple businesses can use the same assumed name, you probably want an original name that no one else is using. Choose a different name if the one you want is already in use to avoid trademark infringement and consumer confusion issues down the line. Run a trademark search to be sure that the name is not trademarked. You can check the federal database. Registering the DBA name does not allow you to use the name if doing so would infringe on someone else’s legal rights to the name. To search online, visit the state of Texas’s SOS direct website and request an account. Each search you run will cost $1. You can also visit your county clerk's office in person and ask an employee to check the name’s availability. They may charge a small fee."
    },
    {
      "title": "Get an Assumed Name Certificate application.",
      "content": "Get an Assumed Name Certificate application. In Texas, this is called “Form 503: Assumed Name Certificate.\" To obtain this document, visit your county clerk to pick up a form in person, or visit Secretary of State website to download it [3] X Research source . The downloadable version of the form is a PDF (portable document format) file. You may have to download software that will let you open it on your computer. Adobe Acrobat Reader is a free program that will allow you to open and read the document. [4] X Research source Once you’ve opened the application, print it so you can fill it out."
    },
    {
      "title": "Decide how your business will be structured.",
      "content": "Decide how your business will be structured. [5] X Research source The most complicated part of the DBA application will be the declaration of your business’s structure. You should think long and hard about how you want to structure your business, as this will have a lasting effect on how much power, responsibility, and obligation you’ll have. It is best to consult a corporate attorney to help you decide which entity is the best model for your specific situation. The most common options are: Sole proprietorship: you are the only person involved in the business. You and the business are one in the same. This is a very simple model, but it also means that you have all the responsibility, including any debt the business might take on. [6] X Research source Sole practitioner: You are the only owner of the business, but you might hire support staff like assistants or salespeople. General partnership: Two or more co-owners share the duties of management equally. Limited partnership: A limited partnership also has two or more co-owners. However, in this case, they don’t share investment or responsibility equally. One owner may simply be an investor who holds 25% of the business, while the other owner runs the business and owns 75% of it. [7] X Research source"
    },
    {
      "title": "Fill out items 1-4 on the application.",
      "content": "Fill out items 1-4 on the application. Once you have the form, you or your legal representative (such as an attorney or registered agent) need to fill it out correctly and honestly. Items 1-4 require you to provide: The assumed name you want to use. Basic contact information for your business. This should be the address where your business receives mail, not your personal address The structure of your business Any file number that is already assigned to your business. To find out if you have a file number, call the Secretary of State’s office or look on SOS online under your business’s legal name."
    },
    {
      "title": "Complete items 5-8 on the form.",
      "content": "Complete items 5-8 on the form. This section of the form requires you to provide: The jurisdiction and address of your main office, if different from the business location you're filing for. This does not have to be in Texas. The office address for your business’s main location in Texas, if your main office is not in Texas. The duration that you will be using the assumed name for. The maximum duration is 10 years, although the form can be renewed at the end of this time. he county or counties where the assumed name will be used."
    },
    {
      "title": "Check the paperwork with your partners.",
      "content": "Check the paperwork with your partners. If you are the only person managing the business, you can skip this step. But, if you’re filing this paperwork on behalf of co-owners, make sure that they approve all of the information you provided in the application."
    },
    {
      "title": "Take the completed form to a notary public.",
      "content": "Take the completed form to a notary public. A licensed notary is an unbiased outside party who 1) verifies your identity, 2) makes sure you’re not being forced to do anything against your will, and 3) confirms that you understand what the document says. [8] X Trustworthy Source American Society of Notaries Non-profit organization providing education, training, and supplies to notaries in the United States. Go to source You must have your signature on the application notarized before it will be accepted."
    },
    {
      "title": "Submit the DBA form to the Secretary of State.",
      "content": "Submit the DBA form to the Secretary of State. After signing the application and having it notarized, send it to the Secretary of State's office. The Secretary of State's address is: P.O. Box 13697, Austin, TX 78711-3697. Include a $25 fee with this application, either as a check or money order."
    },
    {
      "title": "Submit the form to the county clerk's office.",
      "content": "Submit the form to the county clerk's office. You will file it either in 1) the county where your business has its “principal place of business,” or 2) a registered office in Texas if the business's principal place of business is outside the state. To find a county clerks office, visit the Secretary of State's website. [9] X Research source If you choose to mail the form, scan or photocopy it and retain a copy for yourself. Make sure to include your payment with the application (see next step). Submitting the application in person is useful if you have questions. The employees at the county clerk’s office will check your forms to make sure everything has been done correctly."
    },
    {
      "title": "Order a copy of the approved form.",
      "content": "Order a copy of the approved form. Once your form has been approved at the county clerk's office, you want to keep the proof in your files. If any problems arise in the future, you’ll have an official copy in your records to defend yourself. Counties often charge a fee for this service, but you should always do it. It’s better to have that peace of mind than save a few dollars."
    },
    {
      "title": "Renew the DBA when necessary.",
      "content": "Renew the DBA when necessary. The DBA certificate is valid for 10 years after you file it. You can renew within six months of its expiration date. If you don't want to use the assumed name anymore, you must file a certificate of abandonment, which is Form 504. [10] X Research source You cannot amend a DBA certificate. If you want to change the name of your business, you must fill out a new form."
    }
  ]
}