{
  "url": "https://www.wikihow.com/Cook-Octopus",
  "title": "How to Cook Octopus",
  "steps": [
    {
      "title": "Thaw the octopus.",
      "content": "Thaw the octopus. Frozen octopus can be thawed by sitting it in the refrigerator for roughly 24 hours. Frozen octopus actually has an advantage over fresh octopus because the freezing process helps tenderize the meat. If you are working with fresh octopus, tenderize it first by beating it with a meat tenderizer. Before cooking frozen octopus, however, it must be completely defrosted."
    },
    {
      "title": "Separate the tentacles from the body.",
      "content": "Separate the tentacles from the body. Use a sharp kitchen knife to cleanly slice off each tentacle at its base. Note, however, that some recipes require you to cook the octopus whole before cutting it into pieces. Make sure that you read the instructions carefully for the recipe you plan to use before slicing up the octopus. With the octopus lying flat on your working surface, hold up one tentacle and saw it off at the base. Remove the other tentacles in the same manner. If you have kitchen shears, you can cut of the tentacles more easily with those than you can with a sharp knife."
    },
    {
      "title": "Cut the middle piece and the head.",
      "content": "Cut the middle piece and the head. Separate the head from the middle piece and cut the head in half. The middle piece that connected the octopus tentacles to the head is hard and unpleasant, so you can discard it. The head, however, should be cooked alongside the tentacles."
    },
    {
      "title": "Remove the beak and ink sac, if necessary.",
      "content": "Remove the beak and ink sac, if necessary. When working with frozen octopus, this step is not usually needed, since most frozen octopus is sold with these pieces already removed. Even if you work with fresh octopus, you can usually ask the fishmonger to clean the octopus for you before he wraps it up for you to take home. Once you halve the head or body of the octopus, the ink sac and innards should be visible. You can cut these away and remove them with little difficulty. [1] X Research source The beak might still be attached to the hard middle section you discarded, in which case, no further action is needed. If the beak is attached to the body, however, you can usually push it out by squeezing the octopus gently. Once it is exposed, simply cut it out and throw it away."
    },
    {
      "title": "Fill a stockpot with water and aromatics.",
      "content": "Fill a stockpot with water and aromatics. Add enough water to a large stockpot to fill it at least 2/3 high. Add your herbs and vegetables to the stockpot, as well. If you have ready made vegetable stock, you could use that instead of using the water and aromatic ingredients. The vegetables and herbs in this recipe primarily exist for the sake of flavoring the octopus. This recipe calls for onion, carrot, leek, bay leaves, parsley, thyme, and peppercorn, but you could change the vegetables and herbs to nearly any other set of aromatics you have available."
    },
    {
      "title": "Bring the stock to a boil.",
      "content": "Bring the stock to a boil. Heat the stockpot over high heat until a rolling boil develops. Let boil for 5 minutes or so. By letting the herbs and vegetables boil in the water before you add the octopus, you help draw the flavor of these aromatics into the water, creating the beginnings of a vegetable stock."
    },
    {
      "title": "Add the octopus.",
      "content": "Add the octopus. Add all the tentacles and body pieces to the boiling water. The water will slow after you add the octopus, so let it come to a rapid boil again before pressing forward. This recipe works best when the octopus has already been cut into separate tentacles and head pieces. Do not, however, cut the octopus further into smaller chunks. The octopus can still cook if cut smaller, but it is not recommended for aesthetic reasons."
    },
    {
      "title": "Cover and cook until tender.",
      "content": "Cover and cook until tender. This could take anywhere from 20 to 45 minutes. [2] X Research source Test the meat with a fork after 5 minutes. It will not be ready yet, but doing so will give you an idea of how it feels when it is still too tough. Pierce the meat again after 15 minutes and note the difference in tenderness. When ready, the meat of the octopus should practically be falling off the fork as you lift it out of the broth."
    },
    {
      "title": "Remove the octopus and serve.",
      "content": "Remove the octopus and serve. Boiled octopus is generally cut into slices and served with rice or in salad, but you can also enjoy it on its own. You can strain and reserve the water, if desired, for use as seafood stock."
    },
    {
      "title": "Preheat the oven to 250 degrees Fahrenheit (130 degrees Celsius).",
      "content": "Preheat the oven to 250 degrees Fahrenheit (130 degrees Celsius). Prepare a large rimmed baking sheet by lining it with aluminum foil. The oven rack should also be switched to the lower-middle position so that the octopus has plenty of space inside the oven. The majority of the actual cooking process will be done in the oven. Grilling is a great way to add extra flavor to the octopus, but the cooking method is too fast and will not create a tender enough octopus when used alone."
    },
    {
      "title": "Place the octopus on the baking sheet.",
      "content": "Place the octopus on the baking sheet. Sprinkle it with salt and cover it with foil. Create a loose seal by gently crimping the edge of the top sheet of foil to the rim of the baking sheet."
    },
    {
      "title": "Cook the octopus until tender.",
      "content": "Cook the octopus until tender. This could take up to 2 hours. Let cool when done. The meat should feel very tender when pierced with a small paring knife or fork. As the octopus cools, remove the foil cover so that it cools faster. At this point, you can also cover and refrigerate the octopus for two days or so. Discard any liquid that seeped out as the octopus cooked, however."
    },
    {
      "title": "Preheat a grill.",
      "content": "Preheat a grill. Brush the grill rack lightly with 1 Tbsp (15 ml) of olive oil and preheat the grill for about 10 minutes to a high temperature. For a gas grill, turn all the burners onto high and let preheat fully for 10 minutes. For a charcoal grill, spread out a thick layer of charcoal on the bottom of the grill and let them burn down until white ash forms along the surface of the briquettes."
    },
    {
      "title": "Coat the octopus with oil.",
      "content": "Coat the octopus with oil. After coating the pieces with olive oil, sprinkle them with salt and pepper, to taste. The oil will give the exterior a better glow and a better crunch. It also helps the salt and pepper cling to the meat."
    },
    {
      "title": "Char the octopus on the grill.",
      "content": "Char the octopus on the grill. Place the octopus pieces on the grill and cook for roughly 4 to 5 minutes, or until spotted with brown. [3] X Research source After placing the pieces on your grill rack, close the grill and cook the pieces covered. You should only turn the pieces once, and do so during the middle of the cooking process."
    },
    {
      "title": "Serve with olive oil, lemon juice, and parsley.",
      "content": "Serve with olive oil, lemon juice, and parsley. When grilled, octopus can be enjoyed on its own or sliced and added to other dishes. If you plan to serve it as is, though, the extra oil, fresh lemon juice, and parsley can make it an even more flavorful dish."
    },
    {
      "title": "Heat the water and vinegar.",
      "content": "Heat the water and vinegar. Combine the two ingredients in a large stockpot and bring them to a boil over high heat. You can add the aromatic ingredients before the vinegar water reaches a boil, but boiling the water before you add these other ingredients can help keep the boiling point high, thereby making the water boil faster."
    },
    {
      "title": "Add the other aromatic ingredients.",
      "content": "Add the other aromatic ingredients. Halve the lemon and squeeze the juice into the water before adding both halves to the water, as well. Also add the peppercorns, bay leaves, and salt. Turn the heat down to medium and let the aromatics simmer for 10 minutes. Boiling these ingredients first will create a flavorful liquid for your octopus to cook in."
    },
    {
      "title": "Scar the octopus.",
      "content": "Scar the octopus. Use tongs to dunk a whole, uncut octopus into the simmering water three times, letting it stay beneath the water for 5 seconds each time. You could also wear thick rubber gloves and hold onto the octopus by the head with your hands as you scar it. This method is best suited for a whole octopus. You will not be able to scar a cut-up octopus, since the purpose of this method is to cause the tentacles to curl up as they are rapidly dunked into the hot water."
    },
    {
      "title": "Poach the octopus.",
      "content": "Poach the octopus. Drop it into the water and turn the temperature to medium-high, or until the water reaches a light boil. Let cook for 30 minutes, or until otherwise tender. When tender enough to enjoy, the octopus should be tender enough to pierce with a fork."
    },
    {
      "title": "Cool slightly and serve.",
      "content": "Cool slightly and serve. Let the octopus cool for a few minutes, just until it becomes cool enough to touch, and enjoy. You could also cover the octopus and save it in the refrigerate up to 8 hours."
    }
  ]
}