{
  "url": "https://www.wikihow.com/Contact-Uber-Eats-Australia",
  "title": "How to Contact Uber Eats Australia for Order Issues, Concerns, and More",
  "steps": [
    {
      "title": "Open the Uber Eats app on your phone.",
      "content": "Open the Uber Eats app on your phone. Uber Eats has a help option within the app that allows you to contact customer service conveniently. Start by opening the app and reaching your home screen. [2] X Research source The Uber Eats app is different from the regular Uber app, so you’ll have to download that first. You can sign in to Uber Eats with the same login information as you use for your regular Uber app. Uber Eats will automatically use the payment option on your regular Uber account if you sign in with your Uber credentials. Remember to change this option if you want to use a different payment method."
    },
    {
      "title": "Tap the Account tab.",
      "content": "Tap the Account tab. It's the outline of a person at the bottom-right corner. [3] X Research source"
    },
    {
      "title": "Tap Help on the menu.",
      "content": "Tap Help on the menu. Depending on your screen size, you may have to scroll down a little to see it. [4] X Research source From the account screen, you can also manage other options like your delivery address, payment options, and favorite restaurants."
    },
    {
      "title": "Select an option that describes your issue.",
      "content": "Select an option that describes your issue. While this menu has many options, not all have options for contacting Uber Eats directly. If you're having problems with an existing order, whether it has already been delivered or is still en route, select Help with an order . This is the most common option. If you're having problems with your payment method, authorization holds, promo codes, or need help understanding your order total, select Payments , and then tap Chat with us at the bottom. If you think your Uber Eats account has been hacked, select Account settings , select I think my account has been hacked , and fill out the contact form. If you referred someone to Uber Eats but didn't get your reward, go to Promos and partnerships > I referred someone but didn't get my Uber Cash and fill out the form."
    },
    {
      "title": "Pick the order that you’re having a problem with.",
      "content": "Pick the order that you’re having a problem with. If you’re contacting Uber Eats because of a problem with an order, select the order you have a problem with, This brings you to a menu of all your past orders. Select the one that you want to speak with customer service about. If you have a problem with a particular order and want a refund, you have 48 hours to request one after receiving the order. After that, you’re not eligible for a refund. [5] X Research source"
    },
    {
      "title": "Describe your issue.",
      "content": "Describe your issue. If you selected an order, you'll see a few options pertaining to that order, including Past order (if the order has already been completed) and Safety (if you have a safety concern). Choose the option that best fits the situation, and follow the on-screen instructions to start chatting with a representative. If chat support is not available, you'll be able to fill out a form that allows you to describe the issue further. Be specific about the issue when chatting with Uber Eats or filling out the contact form. For example, don’t just say “My order was missing items.” Instead, say “We ordered 3 boxes of chicken nuggets and only received 2.”"
    },
    {
      "title": "Wait for a response from Uber customer service.",
      "content": "Wait for a response from Uber customer service. If chat is available, wait for an agent to connect. If you submitted a form, Uber customer service will begin working on it. Responses are usually quick since customer service reps can view the details of your order. They’ll respond to your inquiry through the app text messenger. If you aren’t happy with the answer, then you can chat back and forth until the problem is resolved. [6] X Research source"
    },
    {
      "title": "Contact @Uber_Support on Twitter/X.",
      "content": "Contact @Uber_Support on Twitter/X. If you're on Twitter/X, you can send a direct message to Uber Support that explains your issue. The X/Twitter page @Uber_Support handles customer complaints in all countries where Uber Eats is available, including Australia. [7] X Research source Using social media is helpful if you have a complaint. Companies want to maintain a good public image, and responding to public complaints quickly is good for reputation."
    },
    {
      "title": "Look for an answer on Uber’s website if you don't want to contact Uber directly.",
      "content": "Look for an answer on Uber’s website if you don't want to contact Uber directly. Uber Eats operates an FAQ page on their support website, which you'll find at https://help.uber.com/en-AU/ubereats . If you don’t want to contact Uber directly but still have a question, the answer may be here. [8] X Research source"
    }
  ]
}