{
  "url": "https://www.wikihow.com/Change-a-Disposable-Adult-Diaper-While-Lying-Down",
  "title": "How to Change a Disposable Adult Diaper While Lying Down",
  "steps": [
    {
      "title": "Explain to the person that you are going to change their diaper.",
      "content": "Explain to the person that you are going to change their diaper. Communicate with the person from the moment you enter their room. Say, “Hello,” and let them know that you are there to change their diaper. However, be tactful and respectful in the way that you express this. [1] X Research source Try saying something like, “Hi, Mrs. Johnson. I’m here to help you get cleaned up. How are you feeling today?” Announce yourself and your reason for being in the person’s room even if they are not very alert or if they have cognitive issues, such as dementia. For example, you could say something like, “Hi, Mr. Smith. I’m Karen. I’m here to help you get clean and make sure you are comfortable.”"
    },
    {
      "title": "Remove any obstacles or hazards from the environment.",
      "content": "Remove any obstacles or hazards from the environment. Look around the room and make sure that there is nothing that will get in the way of you safely changing the person’s diaper. If you spot any obstacles or hazards, move them before you begin. [2] X Research source For example, if there is a wheelchair right next to the bed where you will need to stand, then move it to the side of the room. If you spot any cords or other tripping hazards on the floor around the bed, get them out of the way. If the person has items on their bed that will interfere with changing their diaper, then ask permission to move them aside until after the diaper change."
    },
    {
      "title": "Close doors, curtains, and blinds to ensure the person’s privacy.",
      "content": "Close doors, curtains, and blinds to ensure the person’s privacy. A lying diaper change will cause the person’s private area to be exposed for at least a few minutes, so it is important to close the door to their room, pull the curtain around their bed if they share a room, and close the blinds or curtains of their window to protect their privacy. [3] X Research source Do this even if you do not expect anyone to be able to see them. This is an important part of ensuring the person’s comfort and dignity during the diaper change."
    },
    {
      "title": "Place all of your supplies within arm’s reach before you start.",
      "content": "Place all of your supplies within arm’s reach before you start. Gather the clean diaper, bed pad, gloves, wipes, barrier cream, and any other items you think you might need before you begin the change. Place them on the bedside table or on another surface where you can easily reach them. [4] X Research source Make sure that there is a waste basket near the bed as well. If it is full, empty it before you begin the diaper change."
    },
    {
      "title": "Wash and dry your hands before you begin the diaper change.",
      "content": "Wash and dry your hands before you begin the diaper change. Hold your hands under warm or cool running water and lather them with hand soap. Rub your hands together for 20 seconds, which is about the amount of time it takes to hum the happy birthday song 2 times. Then, rinse the soap off from your hands and pat them dry with a clean, dry towel. [5] X Research source Washing your hands before each diaper change will help to maintain a clean environment for the person in your care and it helps to protect your health as well."
    },
    {
      "title": "Put on gloves and other required personal protective equipment.",
      "content": "Put on gloves and other required personal protective equipment. Choose gloves that are made from a material that provides a strong, waterproof barrier, such as vinyl or latex. This will keep urine and feces away from your skin. You may also need to put on a gown or apron or mask in some healthcare settings. [6] X Research source If you are working in a healthcare environment, such as a nursing home or hospital, always check to see what personal protective equipment is required before you enter the person’s room. For example, you might need to put on a gown and mask before entering some patients' rooms. Put on the gown first, mask next, and gloves last. [7] X Research source"
    },
    {
      "title": "Reposition the person so that they are lying on their back.",
      "content": "Reposition the person so that they are lying on their back. If the person is in an upright position, then lower the head of the bed so that they are lying on their back. This will make it easier to roll them onto their side during the diaper change. [8] X Research source"
    },
    {
      "title": "Move the person’s clothing out of the way.",
      "content": "Move the person’s clothing out of the way. If the person is wearing pants or shorts, then move them out of the way, such as by gently pulling them down. If the person has on a skirt or dress, then you can pull it up above the level of their waist to get it out of the way. [9] X Research source Make sure that the clothing will not be in the way of the diaper change. In some cases it may be easier to remove the item of clothing completely before doing the diaper change."
    },
    {
      "title": "Remove the old diaper by tucking it between the person’s legs.",
      "content": "Remove the old diaper by tucking it between the person’s legs. Undo the adhesive tape tabs on either side of the front panel of the disposable diaper. Then, roll the diaper towards the person to cover the soiled portion. As you do this, tuck the front panel of the diaper down between the person’s legs in front of them. [10] X Research source You may need to push the person’s legs out to the side to make room for the diaper. Let them know what you are doing by continuing to talk to them during the diaper change. If the person is physically and cognitively able to help you, ask them to spread their legs open further as you roll the diaper down between their legs."
    },
    {
      "title": "Wipe the genital area going from front to back.",
      "content": "Wipe the genital area going from front to back. Use a clean wet wipe to cleanse the person’s genital area on the front side of their body. Ask the person to open their legs if they are able, or use your hands to gently move their legs apart so that you can thoroughly cleanse them. Use your fingers to open up the creases and folds of skin in their groin and wipe them in these areas. [11] X Research source If the person’s diaper was only soiled with urine, then you may only need 1 or 2 wipes. However, if it was soiled with feces then you might need 4 or more wipes to cleanse the person thoroughly. For women, wipe in between the labia going from front to back. For men, wipe the tip of the penis and the area around it. If the man is uncircumcised, then gently roll back the foreskin and wipe the head of the penis. Then, return the foreskin back over the head of the penis."
    },
    {
      "title": "Roll the person onto their side and continue wiping.",
      "content": "Roll the person onto their side and continue wiping. If the person is capable of rolling themselves, then ask them to roll over. If not, then place 1 hand under the person’s hip and the other under the person’s shoulder. Push the person upwards gently and then over towards the side of the bed until the person is on their side. Then, keep 1 hand on their hip and hold them to keep them on their side. [12] X Research source If the person is too heavy for you to roll on your own and they are not capable of rolling on their own, ask someone to help you keep the person on their side while you clean them. Have a helper place a hand on the person’s hip and shoulder to keep the person on their side while you wipe."
    },
    {
      "title": "Fold the soiled diaper and dispose of it immediately.",
      "content": "Fold the soiled diaper and dispose of it immediately. Continue to roll the diaper inwards to cover the soiled area and prevent the urine or feces from getting onto the bed or the person. If there is a disposable bed pad on the bed then you can fold this over the diaper as well. Then, use the tabs to secure the diaper after you roll it up, and then throw the diaper into a trash can immediately. [13] X Research source Never place a soiled diaper onto the person’s bed, bedside table, or the floor."
    },
    {
      "title": "Do a partial bed bath for a heavily-soiled diaper.",
      "content": "Do a partial bed bath for a heavily-soiled diaper. Get as much of the urine and feces off of the person as you can with wet wipes. If this is not enough to cleanse the person well, hold a washcloth under warm (not cold or hot) running water, and then wring out the excess water. Cleanse the person’s groin, perineum, and buttocks with the washcloth going from front to back. [14] X Research source Keep rinsing the cloth and wiping as many times as needed to get the person completely clean. For extra cleansing power, add small amount of soap or body wash to the washcloth and wipe the person. Then, rinse the washcloth and wipe them again to remove the soap."
    },
    {
      "title": "Put on a new pair of gloves.",
      "content": "Put on a new pair of gloves. After you have finished wiping the person and disposed of the soiled diaper, remove the soiled gloves. Pull the gloves inside out and throw them away immediately. Then, put on a new pair of gloves before you continue the diaper change. [15] X Research source Changing your gloves before handling the clean diaper helps to prevent contaminating it or getting urine or feces onto the person’s bed, body, or clothing."
    },
    {
      "title": "Tuck a protective pad and clean diaper under the person’s buttocks.",
      "content": "Tuck a protective pad and clean diaper under the person’s buttocks. Get a new protective bed pad and unfold it. Then, tuck 1 side of the pad under the person’s hip. Then, get a clean diaper and unfold it. Smooth it out on the pad so that it will be under the person when they roll back onto their back. Tuck 1 side under the person’s hip where you tucked the pad. [16] X Research source Make sure the diaper is oriented the right way so that the inside of it is facing towards the person’s body."
    },
    {
      "title": "Dry the person off with a towel or let them air dry.",
      "content": "Dry the person off with a towel or let them air dry. You won’t need to use a towel if you only used wet wipes, but you probably will need to dry the person off if you used a washcloth. Use a clean, dry towel to pat the person’s groin, perineum, and buttocks. Pay special attention to any creases and folds of the person’s skin. [17] X Research source Be careful not to rub the person’s skin with the towel as this will likely irritate their skin."
    },
    {
      "title": "Rub cream or ointment onto the person’s skin to protect it.",
      "content": "Rub cream or ointment onto the person’s skin to protect it. You can use petroleum jelly, a sensitive skin lotion, or a diaper rash cream to provide a barrier between the person’s skin and the diaper. Apply a small amount of the ointment or cream to the external areas of the person’s privates. Make sure to get some cream or ointment in between skin folds and on their buttocks. [18] X Research source For women, apply ointment or cream around the outside of the vagina and in the folds between the woman’s legs. For men, apply ointment around (but not on) the penis and in the area between the testicles and perineum."
    },
    {
      "title": "Roll the person over onto their back again.",
      "content": "Roll the person over onto their back again. Let the person know you are going to roll them back over or ask them to roll themselves if they are able. Guide the person’s body to a back-lying position in the bed. [19] X Research source"
    },
    {
      "title": "Secure the tabs at the front of the diaper.",
      "content": "Secure the tabs at the front of the diaper. After the person is on their back again, pull the clean diaper up between their legs and spread it out so that it covers their genitals and lower abdomen. Pull the tabs on each side of the diaper and secure them at the front of the diaper. [20] X Research source Make sure that the diaper is snug, but not too tight."
    },
    {
      "title": "Redress the person and make them comfortable.",
      "content": "Redress the person and make them comfortable. Once the diaper is secured, pull up or down any clothing that you removed before starting the diaper change. If the person’s clothing was soiled and you had to remove it, put new clothing onto the person. Then, readjust the person’s position to make them comfortable again. [21] X Research source For example, if the person wants to sit up in bed, then use the bed controls to raise the head of their bed, or prop the person up with pillows."
    },
    {
      "title": "Tidy up the environment after you finish the diaper change.",
      "content": "Tidy up the environment after you finish the diaper change. Take the garbage with the soiled diaper, pad, and wipes out of the person’s room and dispose of it properly. Remove any soiled clothing, linens, or other items from the room and put them in with other soiled laundry items. Put the items that you used for the diaper change back in their designated spots, such as on a shelf or in a cupboard. [22] X Research source"
    },
    {
      "title": "Remove the gloves and wash your hands.",
      "content": "Remove the gloves and wash your hands. Pull off your gloves and throw them away. Then, hold your hands under cool or warm running water and apply a couple of squirts of hand soap to your hands. Rub the soap in between your hands for 20 seconds, and then rinse away the soap under the running water. Dry your hands off with a clean, dry towel. If you put on any other person protective equipment before beginning the diaper change, then make sure to remove it and throw it away in the designated receptacles. [23] X Research source"
    }
  ]
}