{
  "url": "https://www.wikihow.com/Analyze-a-Short-Story",
  "title": "How to Analyze a Short Story & Write a Final Report",
  "steps": [
    {
      "title": "Gather basic information about the story.",
      "content": "Gather basic information about the story. Summarizing the story will help you organize your thoughts and ensure that you have a basic understanding of the story. [1] X Research source Start your analysis by writing down: The title of the story. The author’s name. The date of publication. Where the story was originally published (e.g., in an anthology or a literary magazine). For example, “I am analyzing ‘Jeeves Takes Charge’ by P. G. Wodehouse, originally published in the November 18, 1916 edition of The Saturday Evening Post .”"
    },
    {
      "title": "Identify the major characters.",
      "content": "Identify the major characters. Most short stories are character-driven. Take a few moments to determine who the major characters are in your story, and write them down. For example, in “Jeeves Takes Charge,” the major characters are: A young English aristocrat, Bertie Wooster. Bertie’s valet (personal attendant), Jeeves. Bertie’s fiancée, Florence Craye. Bertie’s uncle Willoughby. Florence’s teenaged brother Edwin."
    },
    {
      "title": "Give a brief outline of the plot.",
      "content": "Give a brief outline of the plot. Once you’ve written down the basic details, write a paragraph or a couple sentences summarizing what the story is about. It doesn’t need to cover all the plot points—just try to boil it down to the absolute basics. [2] X Research source For example, “‘Jeeves Takes Charge’ is about an airheaded young aristocrat (Bertie Wooster) who tries to sabotage the publication of his uncle’s scandalous memoirs in order to please his fiancée. Meanwhile, Bertie’s valet, Jeeves, is scheming to break up Bertie’s engagement.”"
    },
    {
      "title": "Research the author’s personal and literary background.",
      "content": "Research the author’s personal and literary background. Understanding the context of a short story can give you a lot of insight into why the story was written the way it was. Learning about who the author was and what conventions they were familiar with is a major part of putting any story in context. Knowing something about the author’s experiences and viewpoints, as well as any literary or philosophical school they were a part of, can shed light on why they chose to use certain themes, plot points, and character types. [3] X Trustworthy Source Reading Rockets Online resource supported by PBS providing research-based strategies for assisting children to become confident readers Go to source For example, P. G. Wodehouse was a Classically educated author who grew up in late Victorian and Edwardian England. During the 1910s, he lived and worked in New York as an author, lyricist, and playwright. His stories combine references to classic Western literature with references to contemporary British and American pop culture."
    },
    {
      "title": "Learn about the time and place when/where the story was written.",
      "content": "Learn about the time and place when/where the story was written. In addition to learning about the author’s background, knowing the general historical and geographical context of the story can help you understand it better. Even if the story is set in a different time and place from when/where it was written, the story’s context will inevitably influence the themes, language, tone, and viewpoints presented in the story. [4] X Research source Take note of any major social and political issues of the time period, and any popular artistic movements. Major cultural and political shifts are often reflected in short stories, whether purposefully or in a more subtle context. For example, “Jeeves Takes Charge” is set in an English country estate in the 1910s, but it was published in America during the early years of WWI (before America’s involvement in the war). It plays on humorous American stereotypes of the English aristocracy while avoiding references to contemporary historical events."
    },
    {
      "title": "Determine the intended audience.",
      "content": "Determine the intended audience. A story’s intended audience will affect the choices the author makes in presenting the story. For example, a story written for children will probably have a different tone, themes, and vocabulary level from a story aimed at adults. As you analyze the story, consider for whom the author was writing. If you’re not sure about the intended audience, the publication venue can give you some clues. For example, “Jeeves Takes Charge” was published in The Saturday Evening Post , a weekly entertainment magazine for American adults. The story was designed to appeal to an adult, middle class American audience."
    },
    {
      "title": "Identify the physical setting.",
      "content": "Identify the physical setting. The setting of a story provides atmosphere and helps the action feel more grounded and real. It can also play a significant role in how the plot of the story plays out. Try to identify where, specifically, the story is set, and think about how the author creates the setting. Ask yourself what the setting might mean for the story’s characters and readers, whether it motivates the characters in any way, or what symbolic meaning it might carry. [5] X Research source For example, most of “Jeeves Takes Charge” is set at Easeby Hall, a fictional country estate in Shropshire, England. Wodehouse does not describe the setting in great detail, but creates an impression by offering minor details in passing (e.g., Bertie hides behind a suit of armor in his uncle’s library while waiting to steal the manuscript)."
    },
    {
      "title": "Look at the historical setting.",
      "content": "Look at the historical setting. The time when a story is set can also be very significant. While the author may not specify exactly when the story is taking place, you can usually get a good idea by looking at clues like the language that the characters use, references to historical events or popular culture, and even descriptions of costume and technology. For example, “Jeeves Takes Charge” is set in the summer, “about half a dozen years ago.” If we assume this means 6 years before the story was published, then it is set in 1910. There are also other clues to the general time setting, like references to telegraphs and Bertie’s use of period-specific slang (like “rummy” meaning “strange,” or “a frost” meaning “a failure”). Some stories may have historical settings that are changed or interrupted in the narrative structure. In these instances, look at what effect the fractured or non-linear setting might create."
    },
    {
      "title": "Assess how the setting affects the story.",
      "content": "Assess how the setting affects the story. One way to approach this is to think about how the story might be different if it were in a different setting. Would the tone of the story feel the same? Would the events and themes of the story fit in another setting? How are the characters and their beliefs and actions influenced by their historical, cultural, and geographical context? [6] X Research source For example, if “Jeeves Takes Charge” took place in 2018, how likely would it be that a young man like Bertie would employ a personal attendant like Jeeves? How would Bertie steal his uncle’s manuscript in an age when most documents are written and sent electronically?"
    },
    {
      "title": "List the most important event(s) in the plot.",
      "content": "List the most important event(s) in the plot. The plot is the sequence of related events that make up a story. Because of their limited length, most short story plots focus on a relatively small number of important events. In order to understand the short story’s plot, start by making a list of the major events covered by the plot. For example, in “Jeeves Takes Charge,” the major plot points are: Bertie’s fiancée, Florence, asks Bertie to steal and destroy the manuscript of his uncle’s memoirs because she is worried it will cause a scandal. Bertie steals the manuscript, but Florence's brother catches him in the act and tells the uncle. Jeeves takes the manuscript before Bertie's uncle can find it. Bertie thinks Jeeves is keeping the manuscript safe, but he has actually sent it on to the publisher. Florence breaks off the engagement when she finds out the memoirs have been published. Bertie is angry at first, but Jeeves convinces him that he would have been unhappy married to Florence."
    },
    {
      "title": "Identify the main conflict.",
      "content": "Identify the main conflict. Most plots revolve around a major conflict. Conflict in a story is a dramatic struggle between 2 opposing forces. This could take the form of a dispute between 2 characters (external conflict), or a struggle between opposing desires within a single character (internal conflict). A short story may have multiple conflicts, but there is usually 1 primary conflict that defines the story. In “Jeeves Takes Charge,” the major conflict is between Bertie and Jeeves. The 2 characters engage in a power struggle that starts out small (e.g., disagreements over what Bertie should wear) and comes to a head when Jeeves breaks up Bertie’s engagement to Florence."
    },
    {
      "title": "Look for exposition.",
      "content": "Look for exposition. Many plots incorporate exposition, or background information that helps set the scene and allows the reader to more easily understand what is happening. While exposition may be scattered throughout the story, the bulk of it is likely to appear at the beginning, before the “rising action” that begins the main part of the story. For example, at the beginning of “Jeeves Takes Charge,” Bertie’s narration starts with a brief explanation of his relationship with Jeeves. This sets the stage for the rest of the story."
    },
    {
      "title": "Divide the plot into its main parts.",
      "content": "Divide the plot into its main parts. Traditional plots can be divided into a clear beginning, middle, and end, also known as “rising action,” “climax,” and “falling action.” Keep in mind, though, that these 3 parts may not be balanced, especially in a short story, where the text might be mostly rising action. Short stories often end on their climaxes, giving readers a sudden insight. A more traditional structure, as seen in “Jeeves Takes Charge,” might be divided up as follows: Rising action: Bertie visits his uncle, hires Jeeves, and steals his uncle’s manuscript. Climax: Jeeves intercepts the manuscript and secretly sends it to the publisher, causing Florence to break the engagement. Falling action: Bertie is ready to fire Jeeves, but Jeeves convinces him that Florence was not a good match for him."
    },
    {
      "title": "Pinpoint the resolution.",
      "content": "Pinpoint the resolution. While not all plots have a clear resolution, this is a common element of many short stories. The resolution may be a brief explanation of what happened after the main events of the story, or it may tie up any loose ends left over after the “falling action.” A resolution may also tie back into the beginning of the story in some way. For example, in “Jeeves Takes Charge,” the conflict is resolved when Bertie decides that he trusts Jeeves’s judgment—not just in the matter the engagement, but in all of his personal affairs. This ties in with the opening paragraph, where Bertie explains that he has come to rely on Jeeves’s wisdom."
    },
    {
      "title": "Analyze the structure of the plot.",
      "content": "Analyze the structure of the plot. Once you’ve identified the major plot points, consider how the plot is structured. Is it presented in chronological order, or does it jump around in time? Does the story begin before the main action starts, or does it open in the middle of the action ( in media res )? Is it left open-ended, or is there a tidy resolution to the story? Then, think about why the author structured their plot that way, and what effect or meaning could be derived from the structure. For example, “Jeeves Takes Charge” has a straightforward, linear plot that moves from 1 event to the next in chronological order."
    },
    {
      "title": "Evaluate the point of view of the story.",
      "content": "Evaluate the point of view of the story. Point of view is an important aspect of a story, since it provides the lens through which you interpret the events, characters, and themes of the story. While examining point of view, always ask yourself why the author made certain choices, and how they’re significant. You could even imagine what the story would be like with a different point of view, and what effect that would have on your reading experience. When reading the story, consider: From whose point of view is the story told? Is it one of the characters in the story, or an unnamed observer? Is the story narrated in the first person (the narrator refers to themselves as “I” and “me”) or third person? Does the narrator present a clear, straightforward account of the events of the story, or do they misunderstand what’s happening or deliberately mislead the reader (an unreliable narrator)? Is the narrator’s perspective limited, or do they understand everything that is happening in the story?"
    },
    {
      "title": "Identify the major characters’ defining traits.",
      "content": "Identify the major characters’ defining traits. The characters are the lifeblood of most short stories. The plot develops from their actions. As you read the story, think about what defines each of the characters for you, and why you think the author gave them these traits. Character traits could include things like: [7] X Research source Physical appearance (e.g., height, hair color, attractiveness, style of dress). Personality traits (such as kindness, creativity, cowardice, sense of humor). Speaking style (slangy, formal, terse, poetic). Other traits, such as age, profession, or social status."
    },
    {
      "title": "Determine what role each character plays in the story.",
      "content": "Determine what role each character plays in the story. Each character should play some part in moving the story along. You might define their role in terms of how they relate to other characters, or how their actions set the events of the plot in motion. [8] X Research source For example: Bertie Wooster is the protagonist and narrator of “Jeeves Takes Charge.” He is a comedic figure rather than a classic literary hero, and he consistently fails to accomplish his goals throughout the story. He is a stereotype designed to appeal to American audiences of the time."
    },
    {
      "title": "Assess the motivations of each character.",
      "content": "Assess the motivations of each character. For the characters’ actions in a story to make sense, they must have clearly defined motivations. Motivations determine the way a character thinks, acts, and speaks. Sometimes, these motivations are explicitly spelled out. In other cases, they may be hidden between the lines. Think about why each character behaves as they do, and what they are trying to accomplish. For example, in “Jeeves Takes Charge,” Jeeves tells Bertie that he sabotaged the engagement because he thinks Bertie would be unhappy married to Florence. He also hints indirectly at a more self-serving motivation—he worked for Florence’s family in the past, and doesn’t want to have to work for her again."
    },
    {
      "title": "Examine how the characters change during the story, if at all.",
      "content": "Examine how the characters change during the story, if at all. In some short stories, the characters experience some type of development as the plot progresses, such as discovering something new about themselves or undergoing a change in their beliefs or attitudes. However, many other short stories show their characters remaining the same, with the author simply providing a picture of the character rather than showing their full development, which is more common in novels. For example, at the beginning of “Jeeves Takes Charge,” Bertie views Jeeves as a competent servant, but resists Jeeves’s efforts to advise and guide him. After realizing on reflection that he agrees with Jeeves about Florence, Bertie decides that he is better off with Jeeves “doing the thinking for me.” When looking at character development, consider not only the nature of the change, but how and why the change occurs. If you don’t think the characters have changed or developed, think about why that might be as well."
    },
    {
      "title": "Determine what the major themes are in the story.",
      "content": "Determine what the major themes are in the story. Themes are the major ideas that the author attempts to convey or reflect on in the story through the events of the plot or the actions of the characters. Themes might include things like moral or ethical issues or ideas relating to society or human nature. Themes in a short story may be obvious or subtle, and a story may deal with multiple themes. [9] X Research source For example, a major theme in “Jeeves Takes Charge” is the nature of power and authority in a master-servant relationship. Bertie is Jeeves’s employer, but Jeeves has the upper hand in the relationship because of his intelligence and relatively forceful personality."
    },
    {
      "title": "Examine the story for references and allusions.",
      "content": "Examine the story for references and allusions. References and allusions help create powerful associations by linking events, characters, or objects in the story to other works or ideas that are familiar to the reader. References may be explicit (e.g., “As Shakespeare said . . .”) or more indirect (e.g., the story might make an allusion to Dickens’s A Christmas Carol by having a character say “Bah, humbug!”). [10] X Research source For example, “Jeeves Takes Charge” contains a reference to Thomas Hood’s ballad, The Dream of Eugene Aram (1831), in the form of a misremembered quote by Bertie. The ballad deals with the theme of murder, to which Bertie compares his crime of stealing and destroying his uncle’s manuscript."
    },
    {
      "title": "Identify symbolism and imagery.",
      "content": "Identify symbolism and imagery. Many authors use symbolism and imagery to convey ideas. Symbolism involves using a physical object or even a person to represent an abstract idea (e.g., a white rose symbolizing purity or innocence). Imagery refers to using words to create a mental picture, which may be literal or metaphorical. For example, at the end of “Jeeves Takes Charge,” Bertie tells Jeeves that he can get rid of a checked suit that Jeeves dislikes. Jeeves remarks that he has already gotten rid of it. The suit is symbolic of Bertie’s agency—when he gives up the suit, he also hands over control of his life to Jeeves (who was really already in charge)."
    },
    {
      "title": "Check for other literary devices.",
      "content": "Check for other literary devices. A story may also use a variety of other literary devices to convey its major themes and ideas. Consider whether the story you are analyzing uses devices such as: [11] X Research source Foreshadowing, in which clues are given early in the story that suggest later plot developments. Irony, in which there is a discrepancy between what a character says and what they actually mean, or between what they intend to achieve and what they actually accomplish. Allegory, in which the events, characters, or setting of the story are meant to reflect some more general truth or idea."
    },
    {
      "title": "Assess the tone of the story.",
      "content": "Assess the tone of the story. Tone refers to the attitude that the author expresses toward the story and its characters. Tone is expressed through a variety of means, including word choices, imagery, point-of-view, and content. As you read, think about the tone that the author is trying to convey. The tone of “Jeeves Takes Charge” is light and humorous. Wodehouse (the author) views the events of the story as trivial and silly. He highlights the humor of the characters and situations by using heightened, dramatic language and imagery. For example, while trying to decide how to dispose of his uncle’s manuscript, Bertie compares himself to a murderer trying to hide a body."
    },
    {
      "title": "Define the mood of the story.",
      "content": "Define the mood of the story. Mood refers to the feelings that the story invokes in you, the reader. The mood of the story is largely determined by the tone of the piece, but it can also be created by the setting, themes, and language of the story. [12] X Research source Think about how the story made you feel as you read it. Did you laugh? Did you feel sad, upset, or disgusted at any point?"
    },
    {
      "title": "Look at the style of the story.",
      "content": "Look at the style of the story. Style refers largely to the way the author uses language. For example, a story might be written in a style that is slangy and informal or flowery and poetic. It might be wordy or concise. Style can affect the tone and mood of the story, and can play a part in how you perceive the characters and plot. [13] X Trustworthy Source Read Write Think Online collection of reading and writing resources for teachers and students. Go to source In “Jeeves Takes Charge,” Wodehouse combines formal, poetic Edwardian language with contemporary slang to create a unique, humorous style. For example: “The sun was sinking over the hills and the gnats were fooling about all over the place, and everything smelled rather topping—what with the falling dew, and so on . . .”"
    },
    {
      "title": "Start with a thesis statement.",
      "content": "Start with a thesis statement . This is a brief summary of the main argument you will be making about the story. Write a sentence or 2 clearly explaining what your essay will be about. Place this statement at the end of a brief introductory paragraph, which might include basic information about the story and/or a summary of the nature of the assignment. [14] X Research source For example, “‘Jeeves Takes Charge,’ by P. G. Wodehouse, is one of the earliest short stories to feature Bertie Wooster and his valet, Jeeves, who would eventually become iconic figures in the canon of comedic English literature. This story utilizes humor and dramatic irony to explore themes of agency, authority, and the nature of interpersonal relationships.” The form and content of the thesis may depend on the assignment. For example, if you are supposed to answer a specific question about the story, make sure your thesis addresses that question."
    },
    {
      "title": "Describe your overall impressions of the story.",
      "content": "Describe your overall impressions of the story. Once you’ve analyzed the component parts of the story, you may have a stronger impression of what it is about and how you feel about it. Briefly reflect on the story, and consider what aspects of it left the greatest impression on you. [15] X Research source For example: Which turns of phrase or word choices stood out to you the most? Which character(s) did you like the best or least, and why? Which moment in the plot made the greatest impression on you? Were you surprised by anything that happened? How do you feel about the story? Do you like it or dislike it? Did you feel like you learned something from it, or did it evoke any particularly strong feelings in you?"
    },
    {
      "title": "Discuss whether you feel the story is successful.",
      "content": "Discuss whether you feel the story is successful. Think about the story critically. There are a lot of different criteria that you might use to decide whether the story is good or effective. For example, you might ask yourself: Did this story evoke the kinds of emotions that the author intended? Why or why not? Is the style distinctive and interesting? Did the story feel original? Were the characters and plot sufficiently developed? Did the characters’ actions make sense?"
    },
    {
      "title": "Support your arguments with evidence.",
      "content": "Support your arguments with evidence. If you make an argument about the story, it’s important to back it up with specific examples. You could draw evidence from within the story itself (e.g., you could quote or paraphrase a passage that supports your point) or from the external context of the story (such as information about the author or parallels from contemporary literature). [16] X Research source If you wished to argue that Wodehouse drew intentional parallels between Jeeves and Florence in “Jeeves Takes Charge,” you could support this by quoting passages that highlight these parallels. For example, \"Bertie says of Jeeves early on that '. . . unless I was jolly careful and nipped this lad in the bud, he would be starting to boss me. He had the aspect of a distinctly resolute blighter.' Later, he agrees with Jeeves’s assessment that Florence 'is of a highly determined and arbitrary temperament, quite opposed to your own.'”"
    },
    {
      "title": "Summarize your interpretation of what the author was trying to say.",
      "content": "Summarize your interpretation of what the author was trying to say. A basic summary of your interpretation of the story is a good way to round out your analysis. Consider what the story was about beyond the basic plot. Think about how the author used setting, plot, language, tone, symbolism, allusions, and other literary devices to convey the major themes or ideas of the story. How did these elements combine to create the meaning in the story? [17] X Research source For example, you might say, “‘Jeeves Takes Charge’ is a story about a young man struggling to maintain his agency and autonomy as he becomes caught up in parallel conflicts with 2 other major players in his life: his fiancée and his valet. In the end, Bertie decides that Florence is too controlling and manipulative. Ironically, he ultimately embraces those same qualities in Jeeves.”"
    }
  ]
}