{
  "url": "https://www.wikihow.com/Chip-a-Golf-Ball",
  "title": "How to Chip a Golf Ball",
  "steps": [
    {
      "title": "Align the ball with your sternum.",
      "content": "Align the ball with your sternum. Much of a good chip in golf revolves around proper stance and positioning. [2] X Expert Source Michael Metz Golf Instructor Expert Interview. 24 February 2022. You should aim your body slightly ahead of the ball, with your sternum drawing a parallel line with the location of the ball. The sternum refers to the middle of one's chest."
    },
    {
      "title": "Keep your chest up.",
      "content": "Keep your chest up. [3] X Research source Keep your arms back and your chest up throughout the course of your swing. Arching your chest will result in a skewed chip because it will change direction of the club. If you're having any difficulty with achieving a proper stance, get someone else to watch you."
    },
    {
      "title": "Place your feet closely together.",
      "content": "Place your feet closely together. [4] X Research source Your feet should be planted firmly on the ground while you execute a chip. There should be a space between your feet roughly equivalent to one of your feet. Your feet should be parallel with one another, both aimed directly forward."
    },
    {
      "title": "Open up your hip.",
      "content": "Open up your hip. [5] X Research source A proper swing will disperse the exertion throughout your upper body, rather than packing the strain into one area. Letting your hip on the other side of the club move around will take some of the stress off your wrists."
    },
    {
      "title": "Swing with your full upper body.",
      "content": "Swing with your full upper body. [6] X Research source Use your entire upper body to facilitate the chip. Avoid swinging with your wrists, as this movement will limit your force and control. Swing so that you're able to feel the movement in your hips. While your upper body should be limber throughout the movement, keep your feet and legs relatively stable."
    },
    {
      "title": "Swing downward.",
      "content": "Swing downward. Your initial contact with the ball should be in a downward strike. [7] X Expert Source Michael Metz Golf Instructor Expert Interview. 24 February 2022. The most common mistake beginners make is to hit up. Rather, the first part of a successful chip swing will aim down, only moving up once the club makes contact with the ball."
    },
    {
      "title": "Raise the club as it makes impact with the golf ball.",
      "content": "Raise the club as it makes impact with the golf ball. [8] X Research source While you'll be able to maximize your force and control by swinging downward, scooping up when your club meets the ball will give the ball the air it needs to escape the grass. Both the downward swing and upward scoop should be accomplished in a single, fluid motion. When you become more experienced with chipping, you may control the chipping force to accommodate the distance you want the ball to sail."
    },
    {
      "title": "Follow through with the motion after the ball has made contact.",
      "content": "Follow through with the motion after the ball has made contact. A proper chip won't end with the ball's impact. In order to maximize your force, you should see the swing through, leaving your club back up in the air. Complete the swing in the same fluid motion you started with."
    },
    {
      "title": "Watch where the ball ends up.",
      "content": "Watch where the ball ends up. After a chip, the ball should fly a short distance and proceed to roll. As with any golf shot, you should keep your eye on where the ball lands. Keeping an eye on the ball is important during practice, as well. It can teach you how much force you need with each club to go a given distance."
    },
    {
      "title": "Decide if the situation warrants chipping the ball.",
      "content": "Decide if the situation warrants chipping the ball. Chipping the ball is a more strategic move than a regular golf shot. It is meant to get your ball out of a tricky situation, such as if you're caught in the grass or trying to navigate past a hill. Chipping the golf ball should not be used in instances where a normal shot can easily be employed. This rule doesn't apply if you're trying to learn the shot. If anything, you should practice the basics of chipping on a smooth surface before you move on to its usual application."
    },
    {
      "title": "Choose a club with the right ratio.",
      "content": "Choose a club with the right ratio. [9] X Research source A ratio refers to the distance you want the ball to fly compared to the distance you want it to roll after. Because chip shots are used to get your ball out of the grass and back on course, you can estimate the distance from the grassed ball to the green, plus the distance you want the ball to go on the green. You can measure the distances by using footsteps. For instance, if your ball is five steps away from the green and the hole is ten steps following that, you will have a 1-to-2 ratio. A sand wedge is good for a 1-to-1 ratio from the grass to the green. A pitching wedge is good for a 1-to-2 ratio. A 9-iron is a 1-to-3 ratio."
    },
    {
      "title": "Hold your club firmly.",
      "content": "Hold your club firmly. With any shot, including chipping, you should hold the golf club firmly. Because chipping the ball successfully requires so much control, make sure your hands are placed properly on the club before you attempt to chip the ball. [10] X Expert Source Michael Metz Golf Instructor Expert Interview. 24 February 2022."
    },
    {
      "title": "Get lessons.",
      "content": "Get lessons. Lessons will accelerate the learning process. Although some golf instructors can be quite pricey (ranging upwards of 100 USD per hour), getting a few lessons in will help you to unlearn bad habits you may have picked up on your own."
    },
    {
      "title": "Train using an elongated club.",
      "content": "Train using an elongated club. [11] X Research source If you're having any issues with footing and stance, an elongated club will act as a helpful indicator of when you go too far. If you swing too far or change your back position, the back of the club will clip you in the back. This slightly painful reprimand will remind you that you're doing it wrong. Holding a pool stick alongside the club also works in lieu of a long club."
    },
    {
      "title": "Make phantom contact with the ball as you work out your stance.",
      "content": "Make phantom contact with the ball as you work out your stance. With a \"phantom swing,\" you will execute the swing, stopping right before the ball itself. This movement will allow you to practice the motion of chipping a ball without having to retrieve the ball each time you go through with it."
    },
    {
      "title": "Practice every week.",
      "content": "Practice every week. As with any skill, you need to commit to regular practice in order to polish your chipping technique. You should try to golf at least once a week, and when you do, include chipping as part of the skills you practice. Once you figure out the foundation, you can treat it as you would any other skill."
    },
    {
      "title": "Experiment with different chipping stances.",
      "content": "Experiment with different chipping stances. Although there are certain rights and wrong when it comes to golf stances, part of the fun of learning involves figuring out your personal style. Experiment with different footings, swings, and warm-ups. Although it's important to have a firm learning foundation in place before getting creative, it should be seen as a natural part of the learning process to find your own style."
    }
  ]
}