{
  "url": "https://www.wikihow.com/Choose-Kiwis",
  "title": "How to Choose Kiwis",
  "steps": [
    {
      "title": "Inspect the outer skin.",
      "content": "Inspect the outer skin. Inspect the outer skin’s color and texture. A ripe kiwi’s skin is brown and fuzzy. Also, check for any bruises, dark spots, mold, or wrinkles. If the kiwi is bruised, shriveled, or has mold, then the kiwi is not good for eating and is probably overripe."
    },
    {
      "title": "Apply light pressure to the kiwi.",
      "content": "Apply light pressure to the kiwi. Hold the kiwi between your thumb and four fingers. Apply light pressure with your thumb. If the kiwi slightly gives, then it is perfectly ripe; it should feel soft, but not too soft. On the other hand, if the kiwi gives too much when you apply pressure, it’s probably mushy and overripe."
    },
    {
      "title": "Smell the kiwi.",
      "content": "Smell the kiwi. Also smell the kiwi for readiness. If the kiwi gives off a fragrant, citrus smell, then it is perfectly ripe and ready to eat. However, if the kiwi gives off a pungent, sweet smell then it is most likely overripe."
    },
    {
      "title": "Inspect the outer skin.",
      "content": "Inspect the outer skin. The skin of an unripe kiwi has a greener hue, and may not be as hairy as ripe kiwis. Check for bruises and dark spots as well. You don’t want damaged fruit that will ripen unevenly. [2] X Research source"
    },
    {
      "title": "Hold and apply pressure to the kiwi.",
      "content": "Hold and apply pressure to the kiwi. Hold the kiwi between your thumb and four fingers. Apply pressure with your thumb. If the kiwi is firm and does not give to pressure, then it is unripe. You can then ripen your kiwis at home. [3] X Research source"
    },
    {
      "title": "Ripen your kiwis",
      "content": "Ripen your kiwis at home. Ripen your kiwis at home by placing them in a paper bag with another fruit, such as a banana. [4] X Research source The kiwis also need to be at room temperature to become ripe. Wait three to five days before checking to see if the kiwis are ripe. [5] X Research source"
    }
  ]
}