{
  "url": "https://www.wikihow.com/Choose-Your-Own-Nickname-to-Fit-Your-Name",
  "title": "How to Choose Your Own Nickname to Fit Your Name",
  "steps": [
    {
      "title": "Look at your name.",
      "content": "Look at your name. Think about shorter names that might be hidden inside it. For example, the name Steven contains the shorter name Steve. The name Alfred contains Al, Alf, Fred, and Red. Those names in turn might also have nicknames, such as Alfie (for Alf). Many people choose a nickname based on their own first name because it is easy for themselves and others to remember. [1] X Research source Last names can also be a good source of nicknames. For example, people whose last names begin with Mc- or Mac-, as in John McClane, sometimes choose to go by the nickname Mac. A last name itself can also be a nickname. Consider letter combinations in your name that might not be regular names, but which are easy to say. Someone named Steven might think about going by Te or Ven. Nicknames based on your name can be spelled however you like. \"Mack\" works just as well as \"Mac.\" The pronunciation is more important than the spelling."
    },
    {
      "title": "Look at your hobbies and talents.",
      "content": "Look at your hobbies and talents. If you have a reputation for doing something well or standing out in some other way, it can lead to a nickname. Someone with a loud, booming yell might go as Boomer. A very smart person is sometimes called a \"brain;\" Brain can also be a great nickname. [2] X Research source To ensure that the nickname you choose references your own name, look for nicknames that share a first letter with your name, or that rhyme with it."
    },
    {
      "title": "Check your family heritage.",
      "content": "Check your family heritage. The places you grew up, as well as the places your ancestors lived, can sometimes provide great nicknames. People with ancestors in the Netherlands could choose the nickname Dutch; a person who grew up in Texas might go as Tex or Texie. A strong sense of connection to an ancestral culture can also provide nicknames that mean the same thing as your name means, but in another language or cultural tradition."
    },
    {
      "title": "Find your favorites.",
      "content": "Find your favorites. Write down all the names you came up with, and then say them aloud. Introduce yourself as each one and think about how they sound to you. If you are having trouble deciding which names sound better than the rest, take some time away from the process and return to it in a day or so. The goal is to find one name you prefer above all the others, plus a couple of alternatives."
    },
    {
      "title": "Test the waters.",
      "content": "Test the waters. With your preferred nicknames in mind, speak to those around you and see what they think. It can be difficult to get a nickname to stick if others do not like it. Ask friends to call you by your preferred nickname. If they seem game, the nickname is likely to stick. If they are not on board with the idea, it may be time to try one of your alternates instead."
    },
    {
      "title": "Rock your new nickname.",
      "content": "Rock your new nickname. Now that you have found a nickname your friends are willing to call you, introduce yourself to others using it. Ask teachers and new employers to call you by it. Consider going by your nickname on social networking sites such as Facebook. Your new nickname will be cemented in no time."
    }
  ]
}