{
  "url": "https://www.wikihow.com/Can-Women-Wear-Men%27s-Shoes",
  "title": "Can Women Wear Men's Shoes? Everything You Need to Know",
  "steps": [
    {
      "title": "Yes, women can wear men's shoes if they go down 1.5 sizes.",
      "content": "Yes, women can wear men's shoes if they go down 1.5 sizes. For example, if a woman wears a size 7.5 in women's shoes, she would probably need to go down to a 6 in men's for it to fit properly. [1] X Research source Men's shoes are generally wider than women's shoes, but if you find your proper shoe size , they'll provide a comparable fit and comfort level. The other main differences (besides length and width) are that they have different levels and areas of cushioning, and they also tend to come in lighter, brighter colors."
    },
    {
      "title": "Follow this chart to convert from men's to women's shoe sizes (or vice versa).",
      "content": "Follow this chart to convert from men's to women's shoe sizes (or vice versa). If the store is out of women's shoes or if you prefer a wider fit or a more masculine design, this chart will help you find the right size in men's. Keep in mind that not all brands size their shoes the same, and some of them might run large or small even if they're your normal size. Don't be afraid to pull several sizes off the shelves and see what fits and supports your feet the best! How to tell if your shoes fit : When you try on a shoe, your heel should feel snug and not slide out or wobble around when you walk. The walls on the sides of your feet shouldn't feel too tight like they're constricting your blood flow. Finally, make sure your toes have enough room to spread apart and wiggle. [2] X Research source It's best to shop for shoes in-store so you can try them on first. If you prefer to shop online, check the website for a returns and exchanges policy in case the shoes don't fit! The time of day you try on shoes also matters! Footwear expert Victor Adrian says trying shoes on at the end of the day (like after you get off work) is a good idea because your foot size might be slightly different."
    },
    {
      "title": "Sizing scale",
      "content": "Sizing scale Men's shoes are made on a larger sizing scale than women's. This is because men tend to have proportionately larger feet than women. So, when you're shopping for a size 8 in men's, you'll find they're bigger than a size 8 in women's. That's why most shoe brands recommend that women should size down in men's shoes and men should size up in women's shoes. [3] X Research source"
    },
    {
      "title": "Width",
      "content": "Width Shoe width is measured on a scale from narrowest to widest using the letters A, B, C, D, and E. As a general rule, men's shoes are wider than women's, even if their feet are the same length. For example, the standard width in every woman's shoe size is B, whereas every man's shoe size has a standard D width. Men's shoes are also proportionally wider in the heel and sole than women's because women's feet tend to be narrower in those areas. [4] X Research source For the above reason, women with wide feet sometimes opt for men's performance shoes because they have more room. Similarly, some men with narrow heels purchase women's shoes and size up."
    },
    {
      "title": "Support & cushioning",
      "content": "Support & cushioning Surprisingly, the support level differs from men's shoes to women's, especially when it comes to performance shoes. Women's athletic shoes tend to have more cushioning on the front part of the foot (called the forefoot) than men's. This is because, generally speaking, women have wider hips than men and therefore a wider Q-angle. This can cause their feet to strike the ground at an angle that puts pressure on that area. [5] X Research source The Q-angle is the angle formed between your quads (i.e., your thigh muscles) and the patella tendon (i.e., the tendon that connects your kneecap to your shin bone). Both men and women have it, but it's more pronounced in women because of their tendency to have wider hips than men. [6] X Research source Meanwhile, men's athletic shoes are often made with denser cushioning in the midsole (the middle of the bottom of the foot) because many men are larger and heavier than women. [7] X Research source"
    },
    {
      "title": "Color",
      "content": "Color In the past, it was easy to tell the difference between men's and women's shoes by the color. Men's shoes used traditionally \"masculine\" hues like black, blue, and red, whereas women's shoes used \"feminine\" colors like white, pink, and purple. Today, there are fewer differences between the two, and designs for both genders now include a wide array of fun and vibrant shades! Some men and women like unisex styles the best. These designs typically come in neutral or monochrome color schemes like black and white."
    },
    {
      "title": "Go down 1.5 sizes from your normal size in men's.",
      "content": "Go down 1.5 sizes from your normal size in men's. Men's shoe sizes are larger than their equivalent sizes in the women's department. The general rule of thumb is that women should choose a men's size that's 1.5 smaller than their normal one. For example, if you wear a size 8, you should go down to men's 6.5. Men's shoe sizes usually only go down as small as 5.5. So if your foot is smaller than women's size 7, you may need to look for extra-wide women's shoes instead of going to the men's department. Keep in mind if you're a woman with wide hips, women's performance shoes may offer you more support overall because of the way they cushion your forefeet."
    },
    {
      "title": "Add insoles and cushions to men's shoes to help them fit better.",
      "content": "Add insoles and cushions to men's shoes to help them fit better. The struggle is real when you find a pair of men's shoes that fit almost everywhere, but are loose in the heel or don't provide enough cushioning. The good news is you may still be able to wear them if you simply add your own insoles or heel cushions to keep your feet nice and snug."
    },
    {
      "title": "Go up 1.5 sizes in women's from your normal shoe size in men's.",
      "content": "Go up 1.5 sizes in women's from your normal shoe size in men's. Men with narrow feet who find their shoes a bit too big should do the opposite as women and size up 1.5 sizes. For example, if you wear a size 9 in men's, try on a size 10.5 in women's. The length will be similar, but the narrower heel and sole might fit your feet more snugly. Keep in mind that if you're a large and/or tall man, you may notice less midsole support in women's shoes than in men's. Men may choose women's shoes because they like their styles and colors better. The same goes for women! There are no real rules around shoes, so just pick out whatever feels the most \"you.\""
    },
    {
      "title": "You may suffer more pain in your toes, arches, or heels.",
      "content": "You may suffer more pain in your toes, arches, or heels. We mentioned above that women's and men's shoes are designed slightly differently. This is because, in general, women and men each need more support in different parts of their feet. If you're a woman with wide hips, for example, you may find there's not enough cushioning in the forefoot of men's shoes. Over time, you may feel pain in your arch and heel and even develop plantar fasciitis (inflammation of the plantar fascia). [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Some women may also find that men's shoes are too loose and not supportive enough in the heel area. With too much stress and not enough support, you might contract Achilles tendinitis, which is inflammation in the Achilles tendon at the back of your heel and ankle. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source As far as men wearing women's shoes go, some may discover that women's shoes are too narrow and squeeze their toes and forefoot too much. In that case, they could end up developing painful blisters, calluses, bunions, or bursitis because their feet are too constricted. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Tip: If your shoes are a little too wide or don't come with enough support, podiatrist Dr. Mark Co, DPM recommends inserting orthotics such as insoles into your shoes to prevent issues like plantar fasciitis."
    },
    {
      "title": "You may have trouble finding the right size.",
      "content": "You may have trouble finding the right size. Women and men sometimes struggle finding shoes designed for the opposite gender that fit them correctly because of their sizing differences. For example, women whose feet are short lengthwise but wide may not be able to find well-fitting shoes in the men's department. This is because the smallest men's shoe size is equivalent to women's size 7."
    },
    {
      "title": "You may not be able to walk or run as fast.",
      "content": "You may not be able to walk or run as fast. Have you ever tried doing any kind of activity – be it running, walking, bicycling, or anything else – in shoes that don't fit right? The main side effect (other than foot pain and discomfort) is you can't move as quickly as you want. [11] X Research source That's a big problem, especially for athletes whose sport depends on their speed and agility (i.e, runners, baseball players, tennis players, etc.). This underscores the importance of finding a shoe that fits well, regardless of whether they're men's, women's, or unisex shoes."
    },
    {
      "title": "You may wear the shoe out faster.",
      "content": "You may wear the shoe out faster. If you're a man who wears women's shoes, your heavier frame and weight may wear down the cushioning quicker than a woman's. [12] X Research source In that case, you could be spending more money over time on shoes than you would if you purchased men's shoes only. On the other hand, don't be put off if you find a pair of women's shoes you really like! As long as they fit and offer good support, it's totally fine to make them part of your daily fit."
    },
    {
      "title": "Unisex shoes have gender-neutral colors and shapes with men's sizing.",
      "content": "Unisex shoes have gender-neutral colors and shapes with men's sizing. They mostly come in black colors, but performance shoes might also feature colors now considered gender-neutral, like gray, orange, green, or white. [13] X Research source When you shop for these shoes as a woman, know that they follow standard men's shoe sizing conventions. For example, an 8 in unisex is the same length as an 8 in men's. [14] X Research source To make unisex shoes more comfortable for women, they may be narrower at the heel or have more cushioning in the forefoot. Most safety and industrial shoes are unisex. You won't see \"Men\" or \"Women\" on the label anywhere."
    },
    {
      "title": "Look for a gender-defining term on the packaging or shoe label.",
      "content": "Look for a gender-defining term on the packaging or shoe label. Performance and other types of shoes usually specify whether they're for men, women, or unisex on the shoe box or the tag attached to the shoe. If you're shopping in-store, you can easily tell which shoes are for which gender by going to the department for the type you're looking for (i.e., Men's Shoe Department or Women's Shoe Department). When shopping online, use the filters to only view the shoes for a specific gender."
    },
    {
      "title": "Look at the shape.",
      "content": "Look at the shape. If you're not sure if a pair of shoes is designed for women or men, study its shape. Is each shoe wide along the heel and sole? If so, they could be men's shoes. If they're more narrow in those areas, chances are they're from the women's or unisex department."
    },
    {
      "title": "Feel the cushioning.",
      "content": "Feel the cushioning. Does the shoe have a lot of cushioning, especially in the forefoot area? If so, they're probably women's shoes. The extra padding helps support women who may have a wide Q-angle. On the other hand, if the padding in the shoe's midsole feels firm and dense, it may be made to accommodate some men's larger and heavier frames."
    }
  ]
}