{
  "url": "https://www.wikihow.com/Build-Your-Body-Fast",
  "title": "How to Build Your Body Fast",
  "steps": [
    {
      "title": "Develop a realistic workout schedule.",
      "content": "Develop a realistic workout schedule. Set achievable goals and decide what you want to accomplish from working out. Set a goal that has a concrete result, like getting your body mass index (BMI) to a certain number, losing a certain number of pounds, or taking an inch off your waistline. If you are new to working out or are returning to the gym after a long period of time, start slowly. You won’t build your body fast by pushing yourself too hard and getting injured. It may take longer for you to see results if you haven’t kept a consistent workout schedule, so stay patient and consistent. Focus on strength, not necessarily on gaining a certain amount of muscle. Increasing your overall strength allows your body to better recruit muscle fibers, allowing your physique to change faster. The reason for developing a realistic workout schedule is that it will keep you on the fastest track to building your body quickly. Realistically, men can expect to build at most 2 pounds of muscle per month. Women can build at most 1 pound of muscle per month. However, this kind of gain is from a frequent workout schedule of about five to six days a week."
    },
    {
      "title": "Determine your situation and goals.",
      "content": "Determine your situation and goals. Be realistic about your overall schedule and how much time you can devote to working out. Maybe you only have 30 minutes a day to work out, or you have a few days a week where you can do more. Knowing how much time you can devote to building your body will help you develop a schedule and routine that will maximize your growth quickly. By having a consistent schedule that you keep to, you train your body to expect to be in an anabolic state more often. This helps faster growth. Aim for between three and five workouts per week, depending on your schedule. If you can only workout a few times a week, try to block out enough time so that you can workout for about 60 to 75 minutes. Evaluate your current fitness level and experience. If you are newer to working out, then you want to populate your schedule with less strenuous workouts at the beginning to prevent injury. People newer to working out will typically see gains faster because the body isn’t used to strenuous activity and having to repair muscles. However, after the initial shock, your body finds a pattern. Don’t stop just because you may see quick results."
    },
    {
      "title": "Target your whole body.",
      "content": "Target your whole body. The fastest way to build your body is to train multiple muscle groups at once, and make sure that during your weekly routine you are training every part of your body. [1] X Expert Source Brendon Rearick Personal Trainer & Strength Coach Expert Interview. 30 July 2020. It’s also important to switch up your training. Lifting the same weights or running the same two miles every couple of days won’t deliver quick gains. By training multiple muscle groups at the same time instead of just focusing on one, you get to exercise these groups more often, leading to more frequent growth stimulation. This doesn’t always mean doing full body workouts. This means that during the course of a week, you hit each muscle group. If you decide that you can realistically workout three days a week, build a schedule that will allow you to workout your whole body by the end of the week. For example: On day one, work your chest shoulders, and triceps. Follow-up this exercise with 15-30 minutes of cardio on a stair climber or elliptical. You can also go hiking or cycling hills outside. On day two, train your back, biceps, and abs. End with 15-30 minutes of cardio, preferably on a rowing machine or an elliptical or AMT with pushing handles. You can also go swimming. On the third day, train your glutes, quads, hamstrings, and calves. Afterwards, try rowing or swimming for cardio. [2] X Research source Make sure that you also get enough rest. The key to success is working the right body parts at the right time, while still getting a good amount of sleep. Muscles actually grow through a cellular process where your muscles repair themselves by fusing fibers back together after a workout. [3] X Research source"
    },
    {
      "title": "Workout correctly.",
      "content": "Workout correctly. You should work out no more than five days a week when it comes to lifting weights. This is because overtraining and injury can occur, resulting in you not seeing results. During the first couple of weeks, focus on building strength safely. This means lifting slightly heavier weights at lower reps, and resting for about two minutes so your muscles don’t fatigue. After you’ve begun to build mass, do more intensive workouts with higher reps and lower weights to tone your muscles while still building. Rest times on lower weights should be around one minute. [4] X Research source Don’t overtrain because you're not getting bigger quickly enough. Trying to speed up the process will make you feel too sore to want to work out. A diligent workout plan can show results of about half a pound of muscle gain a week in men, and about half a pound every two weeks in women. [5] X Research source Cardio can be done every day, if you wish, and is very important when it comes to shedding any unwanted fat. Do cardio after you workout, not before, to ensure that your body can perform at a peak level, as cardio will tire you out."
    },
    {
      "title": "Follow your workout plan to shed unwanted fat and gain muscle quickly and effectively.",
      "content": "Follow your workout plan to shed unwanted fat and gain muscle quickly and effectively. Remember that you want to be working out larger muscle groups, spending different days focusing on different parts of your body. In addition, remember to populate your schedule with different, more advanced routines as you progress. If you want to see fast progress each week, you have to advance your routine each week. Start by adding five pounds to the weights you lift each week. Add an extra set to your routines at the end of the week to prepare for upping the weight the next week. If you workout your chest, triceps and shoulders on Monday and/or Thursday, focus on your back and your biceps on Tuesday and/or Friday. On Wednesday, work out your legs and add some cardio to your routine. Find a good workout that fits your body and goals. If you want to build size and strength, vary your rep ranges depending on the workout. Start with low rep sets (5-8) with heavy weights on one day, and then lower the weight while increasing the reps (12-15) on the next day you work that muscle group. Varying your weight and reps will keep your muscles guessing, forcing them to adapt to varied routines increasing strength. [6] X Research source Remember that you can and should add weight to your workouts each week. So even on the lower weight days, you want to be increasing how much you lift. Increase the weight slowly over time for the best results. For dumbbells, increase the weight by one to two pounds each week. For plates, you can increase it by five pounds."
    },
    {
      "title": "Maintain a good cardio plan by doing some type of cardio on the weekend.",
      "content": "Maintain a good cardio plan by doing some type of cardio on the weekend. Cardio can help you get energized for the start of the week. Run a couple of miles , swim, do some bodyweight workouts, or even yoga during the weekend to help your body stay focused. Though you might think cardio will burn your muscle and your fat from putting your body in a catabolic state, 30-45 minutes of cardio a week can actually help build muscle. Because cardio workouts increase the number of capillaries in your muscles, you can get more oxygen and other nutrients flowing through them to build mass and increase recovery time, ultimately building your body up faster."
    },
    {
      "title": "Do not be afraid to ask for help.",
      "content": "Do not be afraid to ask for help. Most gyms or fitness clubs have staff members that can help you build a diet and exercise plan that’s tailored to your body. A trainer can also lead you through workouts and keep you on track."
    },
    {
      "title": "Hire a trainer.",
      "content": "Hire a trainer. Having a trainer aiding you will help you learn how to work efficiently and get the most from your time and efforts in the gym. Trainers will also monitor your progress, guide you on a well-balanced diet, stay properly hydrated, and help you get proper rest and recovery. Achieving your goals should be rewarding both mentally and physically. With hard work, a sensible and healthy diet, and proper rest, you will get the body you’ve always wanted."
    },
    {
      "title": "To build your body quickly, try following a four week routine that will push you and hit all your major muscle groups.",
      "content": "To build your body quickly, try following a four week routine that will push you and hit all your major muscle groups. For this particular routine, try to keep workouts in the 45 minute range to avoid producing excess cortisol. Excess cortisol can increase health risks and affect sleep, digestion, and mood levels. [7] X Research source For this routine, rest 60-90 seconds between each set. When following this plan, workout with a 2-on-1-off routine for the fastest results. This routine will also allow for enough variety in which days you workout to keep your body guessing. The weight you use will vary depending on your current fitness level, and the exercise you are doing. Pick a weight that will challenge you, but not completely exhaust you. For a variant on this routine, try choosing a certain movement for each workout day. Then, repeat that movement for each different part of your body. For instance, on the first day, you might do pushing exercises, then pulling, then squats, followed by core exercises, and finally cardio. [8] X Expert Source Brendon Rearick Personal Trainer & Strength Coach Expert Interview. 30 July 2020."
    },
    {
      "title": "Exercise abs and arms on day one.",
      "content": "Exercise abs and arms on day one. The first day involves exercises from simple crunches to more advanced exercises like a one arm cable curl. Most of these exercises involve two sets total. Crunches. Perform 20 reps, and complete one set. Rest for 60 seconds. Stability Ball Crunches. Perform 15-20 reps, and complete one set. Rest for 60 seconds. Leg Lifts. Perform 8-12 reps, and complete one set. Rest for 60 seconds. V-Up. Perform at least 10 reps and go until you can’t continue. Complete one set. Rest for 60 seconds. Hammer Curl. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Overhead Dumbbell Presses. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Preacher Curl with Barbell. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Palms-Down Grip Cable Triceps Extension. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Reverse Dumbbell Bicep Curls. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. One Arm Cable Curl. Perform at least 10 reps and go until you can’t continue. Complete one set. Rest for 60 seconds. Palm-Up One Arm Cable Pushdown. Perform at least 10 reps and go until you can’t continue. Complete one set. Rest for 60 seconds."
    },
    {
      "title": "Exercise legs and forearms on day two.",
      "content": "Exercise legs and forearms on day two. This involves squats, leg extensions, and curls. You will complete at least two sets for each of these exercises. Squats. Go for barbell squats over a bench to afford your body more range of motion and less risk of injury. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Leg Press. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Seated Leg Curl for Hamstrings. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Leg Extension. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Laying Leg Curl. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Reverse Wrist Curls. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Regular Wrist Curls. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Thigh Adductor Machine. Do 8-12 reps, and complete two sets in each direction. Rest for 60 seconds."
    },
    {
      "title": "Exercise chest and back on day four.",
      "content": "Exercise chest and back on day four. After a rest on day three, workout your chest and back with bench presses, rows and pulldowns. Some exercises you might try include: Wide-Grip Incline Bench Press. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Wide-Grip Flat Bench Press. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Wide Dips. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Cable Flyes. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Upright Row. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Dumbbell Bent-Over Rows. Perform 8-12 reps, and complete two sets. Rest for 90 seconds. Dumbbell Pullovers. Perform 8-12 reps, and complete two sets. Rest for 90 seconds. Seated Cable Row. Perform 8-12 reps, and complete two sets. Rest for 90 seconds. Wide-grip Lat Pull-Down. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Pull-ups. Do 8-10 reps, and complete two sets. Rest for 60 seconds. Reader Poll: We asked 759 wikiHow readers and 59% of them agreed that the best exercise for building upper-body mass is a pull-up. [Take Poll]"
    },
    {
      "title": "Exercise your shoulders and calves on day five.",
      "content": "Exercise your shoulders and calves on day five. For day five you will be targeting your shoulders with deltoid exercises. To exercise your calves, you’ll complete a series of calf raises. Overhead Shoulder Press. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Front Deltoid Dumbbell Raise. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. One-Arm Incline Lateral Raise. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Front Deltoid Cable Raise. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Side Deltoid Cable Raise. Perform at least 10 reps until you cannot continue. Do one set. Single Leg Calf Raises. Perform 8-12 reps, and complete two sets. Rest for 60 seconds. Standing Calf Raises. Perform 8-12 reps, and complete two sets. Rest for 60 seconds."
    }
  ]
}