{
  "url": "https://www.wikihow.com/Apply-for-a-Driver%27s-License-in-the-UK",
  "title": "How to Apply for a Driver's License in the UK",
  "steps": [
    {
      "title": "Meet the basic age and vision requirements.",
      "content": "Meet the basic age and vision requirements. To apply for a provisional driving licence, you must be at least 15 years and 9 months old and be able to read a number plate from 20 metres (66 ft) away. Try testing your vision at home with the number plate on a friend’s or family member’s vehicle. [1] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source"
    },
    {
      "title": "Gather your Identity documents.",
      "content": "Gather your Identity documents. Identity documents include the following: a current passport, biometric residence permit, European Union or European Economic Area identity card, a recent bank or building society statement with your National Insurance number (if you are a pensioner), a birth, adoption, or naturalization certificate, a photocopy of the front page of your benefits book or an original benefits letter, a marriage certificate or divorce papers, or a college or university union card, education certificate, or PASS proof of age card. [2] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source If your name has changed, you should also include your marriage or civil partnership certificate, a deed poll, or a statutory declaration. [3] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source If your gender has changed, you should also include a deed poll, statutory declaration, or your gender recognition certificate. [4] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source You must include an original identity document (unless you have a valid UK biometric passport) and a colour passport-style photograph with your application. Your identity document and photograph must be signed by a UK resident with a valid photocard driving licence. [5] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source The person signing your document and photograph should be one of the following: a businessperson, librarian, lawyer, teacher, engineer, police officer, bank or building society member, civil servant, religious minister, magistrate, local councillor, or member of Parliament. [6] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source"
    },
    {
      "title": "Apply for your provisional licence online.",
      "content": "Apply for your provisional licence online. You can apply for your provisional licence online. Once on the application website, you’ll need your Government Gateway ID, an identity document (unless you have a valid UK biometric passport), a list of the addresses where you’ve lived for the last 3 years, and your National Insurance number (if you know it). With all of this information, you’ll be able to fill out your application. [7] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source There is a £34 application fee for using the online system. The system accepts MasterCard, Visa, Electron, Maestro or Delta debit or credit card. [8] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source"
    },
    {
      "title": "Apply by post as an alternative to the online application.",
      "content": "Apply by post as an alternative to the online application. You can also apply by post by filling out form D1 (available at the Driver and Vehicle Licensing Agency or certain branches of the post office). [9] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source There is a £47 fee that must be paid with a cheque or postal order made payable to the Driver and Vehicle Licensing Agency. [10] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source Send your application to DVLA, Swansea, SA99 1AD (if all your documents are from the UK) and DVLA, Swansea, SA99 1AF (if any of your documents are from outside the UK). [11] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source"
    },
    {
      "title": "Wait for your provisional licence to arrive before driving.",
      "content": "Wait for your provisional licence to arrive before driving. If you apply online, you should receive a confirmation email after you submit your application and your licence should arrive within 1 week. If you applied via post, your licence could take up to 3 weeks to arrive. Do not drive before you’ve received your licence. [12] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source"
    },
    {
      "title": "Study for the theory exams.",
      "content": "Study for the theory exams. The theory exams are based on 3 books: The Highway Code , Know Your Traffic Signs , and Driving: The Essential Skills . You can purchase these books online or at any high street bookshop. You should also purchase the official guide to hazard perception, which can be found online for PC or Mac, on the Google Play Store or App Store for tablets and phones, or at any high street bookshop. [13] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source The theory exam may ask you questions about what different traffic signals mean, where a child under 11 should sit in your car, how to pass a motorcycle, how to turn from a major onto a minor road, and many other topics. You can also take the online practice theory tests by visiting https://www.gov.uk/take-practice-theory-test ."
    },
    {
      "title": "Book your theory test.",
      "content": "Book your theory test. You can book your theory test online. You’ll need an email address to do so; if you don’t have an email address, you’ll need to book your test by phone. You can find contact information and testing locations by visiting https://www.gov.uk/government/organisations/driver-and-vehicle-standards-agency/about/access-and-opening . [14] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source Once you’ve booked the appointment for your theory test, you’ll need to pay a fee via debit or credit card. [15] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source The fee for cars and motorcycles is £23, the fee for lorries and buses is £26 for the multiple choice test, £11 for the hazard perception test, and £23 for the case studies. [16] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source"
    },
    {
      "title": "Pass a 50-question multiple choice test.",
      "content": "Pass a 50-question multiple choice test. You will have 57 minutes to complete your test and you will need to answer 43 questions correctly to pass. The questions will deal with anything from driving regulations, to road signs, to vehicle safety. Some of the questions may relate to case studies (short stories based on real-life situations). [17] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source Your practice tests and study guides will include all of the information you may face during the test."
    },
    {
      "title": "Pass the hazard perception test.",
      "content": "Pass the hazard perception test. Before you take your hazard perception test, you’ll be shown a video explaining how the test works. Then, you’ll be shown 14 video clips featuring everyday driving situations that have at least 1 hazard situation. To identify the hazard situation, you must click the mouse as soon as you see the hazard developing. [18] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source The hazard perception test may include developing hazards like pedestrians getting into a car in an unexpected place, vehicles unexpectedly reversing from a side road onto a main road, heavy goods vehicles obstructing your view, parked cars obstructing traffic, and many more. [19] X Research source The sooner you click the mouse after you identify the hazard, the higher the score you will receive. You can earn up to 5 points for each correctly identified hazard. [20] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source You will only get one chance to guess during each video. You won’t be penalized for getting an answer wrong, but if you click continuously or in a pattern you won’t earn any points. [21] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source"
    },
    {
      "title": "Practice driving with an eligible friend, family member, or driving instructor.",
      "content": "Practice driving with an eligible friend, family member, or driving instructor. The Driver and Vehicle Licensing Agency recommends that you utilize an approved driving instructor, but you can also practice driving with a friend or family member that is at least 21 years of age and has had their driver’s licence for at least 3 years. You must have an “L” on the vehicle to drive. You can practice driving at any time of the day or night. [22] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source Testing anxiety affects people in various settings. It may be in the workplace, classroom, or a driving exam. If you want to take a driving exam, prepare by previewing the testing area and instrument. Practice with someone to have a mock experience of what it will feel like when the examiner sits next to you in your car. You can purchase an “L” plate online or at a local store like Halford’s or Wilkinson’s. [23] X Research source You can find an approved driving instructor, by visiting https://www.gov.uk/find-driving-schools-and-lessons ."
    },
    {
      "title": "Make an appointment for your practical driving exams.",
      "content": "Make an appointment for your practical driving exams. You must be at least 17 years of age to drive in the United Kingdom, so you’ll need to wait until then to make your appointment for your practical driving exams. To make your appointment, visit https://driverpracticaltest.direct.gov.uk/application?execution=e1s1 . [24] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source You will need to know your UK driving licence number and have a debit or credit card ready (the fee is between £65 and £72 depending on the type of vehicle). [25] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source If you had a driving instructor and would like them to administer your exam, you’ll need to know their personal reference number. [26] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source You need to bring your driver’s licence and theory test pass certificate with you to the exam. [27] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source If you had a driving instructor and they are administering your exam, you can use their car for the test. If you don’t have a driving instructor, you’ll need to bring your own car. [28] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source"
    },
    {
      "title": "Answer the examiner’s vehicle safety questions correctly.",
      "content": "Answer the examiner’s vehicle safety questions correctly. There are 2 types of vehicle safety questions: “show me” questions and “tell me” questions. The “tell me” questions occur prior to the driving exam and involve you answering questions about vehicle safety. The “show me” questions will occur during the driving exam and will require you to demonstrate safe vehicle practices. [29] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source Examples of “tell me” questions would be “Tell me how you would check that the brakes are working before starting a journey,” “Tell me how you would make sure your head restraint is correctly adjusted so it provides the best protection in the event of a crash,” and “Tell me how you would check that the headlights and tail lights are working. You don’t need to exit the vehicle.” [30] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source Examples of “show me” questions would be “When it’s safe to do so, can you show me how you would wash and clean the rear windscreen?”, “When it’s safe to do so, can you show me how you would operate the horn?”, and “When it’s safe to do so, can you show me how you would open and close the side window?” [31] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source"
    },
    {
      "title": "Pass the general driving ability exam.",
      "content": "Pass the general driving ability exam. Your general driving ability exam will last around 40 minutes. First, you will be asked to drive in various road and traffic conditions (but not on motorways). Then, you’ll be required to pull over to the side of the road, pull away from the side of the road, and make a hill start. You’ll also be asked to do one of the following: parallel park, park in a parking bay, or reverse for 2 car lengths before rejoining traffic. [32] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source Your examiner will be grading you based on your committal of minor and major driving faults. You are allowed up to 15 minor faults, but cannot commit any major faults. [33] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source Examples of minor faults would be failing to observe a yield sign, hesitating at a traffic light, not being aware of another car’s turn signal, or driving too close to the car in front of you. Examples of major faults would be crossing a junction, leaving your turn signal on after completing a turn, being in the wrong lane when approaching a roundabout, or driving through a stop light."
    },
    {
      "title": "Pass the independent driving portion of the exam.",
      "content": "Pass the independent driving portion of the exam. After the general driving ability exam, you’ll be tasked with completing 20 minutes of independent driving. During this portion, the examiner will either enter a destination into a satellite navigation system or ask you to follow road and traffic signs under their direction. [34] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source Out of every 5 independent driving tests, 4 will rely on satellite navigation. [35] X Research source If you’re unsure of where the next step of your route is, ask your examiner for help. [36] X Research source Independent driving routes are designed by the examiners at each testing location. You can download these routes online and practice them beforehand. [37] X Research source If you can’t see traffic signs, the examiner will direct you until you can. [38] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source If you take a wrong turn, don’t panic. You won’t be penalized. The examiner will help you get back on track. [39] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source"
    }
  ]
}