{
  "url": "https://www.wikihow.com/Apply-Eyeliner",
  "title": "Eyeliner 101: Expert Tips for Using Pencil, Gel, Liquid & Cream Liner",
  "steps": [
    {
      "title": "Use a pencil liner",
      "content": "Use a pencil liner for beginner-friendly natural or smudged looks. Pencil liners are easy to apply because you use them as you would any other pencil. Lightly apply the pencil for a subtle, natural look, or smudge your pencil to create smokey or dramatic eyes . [1] X Research source Unlike liquid liner, pencil liner won't run into your eyes. You may need to sharpen or dull your pencil depending on your desired consistency: a duller pencil will yield a more intense, smudgy line, while a sharper pencil will create a lighter, thinner line."
    },
    {
      "title": "Liquid liner creates smooth, swooping lines and a precise look.",
      "content": "Liquid liner creates smooth, swooping lines and a precise look. You can find liquid liner in either a marker pen or in a vial with a brush. To use it , you simply draw on your lines and fill in any gaps with a second application of liner. You can create a wide range of lines from liquid liner, from thin, natural lines to dramatic looks. Liquid liners can be a bit tricky to master, so if you're new to the eyeliner game, you may want to start out with pencil liners first. (Unless you love a challenge, in which case go for liquid!) Liquid liner marker pens are very easy to use, although they can get a bit messy compared to pencil liners. If you use a vial and brush, it may take some practice to learn how to use the liquid liner. Hooded eyes are particularly prone to smudging due to the extra layer of skin that sometimes rests on the eyelid, but waterproof liquid liner is a safe bet for hooded eyes."
    },
    {
      "title": "Try gel liner if you want to draw dramatic lines.",
      "content": "Try gel liner if you want to draw dramatic lines. Gel liner comes in a pot along with a small brush and it’s easy to use. Its thicker formula makes it great for dramatic looks, so if you want to give yourself cat eyes or wings, gel liner is a good choice. [2] X Research source You can use other brushes with your gel liner. You may find that an angled brush works best for applying the liner. Be sure to clean the brush often to help prevent eye infections."
    },
    {
      "title": "Use cream eyeliner for a soft, natural look.",
      "content": "Use cream eyeliner for a soft, natural look. Cream eyeliner , like gel, often comes in a little pot that you dip a brush into, but it can also come in pencil form, making it a good choice for beginners who might be more comfortable with a pencil than a brush. Cream liner is great for when you want a soft and smudgy look, and it goes on really smooth to boot! [3] X Research source Many people use cream (or crème) and gel eyeliners interchangeably, but cream liners are softer and give you a more natural-looking appearance. For this reason, if you're after a dark, dramatic smokey eye look, opt for gel over cream, as cream won't result in as intense a line. Cream liner takes longer to set and smudges more easily than other liners, meaning it may not be the best option for people with hooded eyes, as the extra layer of skin on hooded eyes tends to rub against the eyelid, which may encourage smudging. [4] X Research source"
    },
    {
      "title": "Shake the liner to make sure it’s well-mixed.",
      "content": "Shake the liner to make sure it’s well-mixed. Make sure that the lid is secured first and then shake the bottle for a few seconds. Stop shaking and wait a few seconds for the liquid to settle, and then unscrew the cap and pull the brush out of the bottle. [5] X Research source If the brush is dripping with liner (or has a big glob of liner on it just waiting to smear all over your eyelid), then swipe it across the edge of the liner bottle to scrape some liner off."
    },
    {
      "title": "Apply liner from the middle of your upper lash line outward.",
      "content": "Apply liner from the middle of your upper lash line outward. Begin with either your right or left eye. Place the brush against your upper lash line so that it’s as close as possible to your eyelashes, and begin applying eyeliner, moving outward as you go, towards the outer edge of your lash line. Your first line may be somewhat rough, but you’ll fill in the gaps in the next steps. [6] X Research source If you’re worried about getting an even line, try lining your upper lash line with pencil liner first and then go over this line with liquid liner. [7] X Research source"
    },
    {
      "title": "Apply liner from the inner corner of your lash line until it meets the middle.",
      "content": "Apply liner from the inner corner of your lash line until it meets the middle. Once you’ve lined the outer half of your upper lash line, apply liner to the inner corner outward until it meets the first line you’ve drawn. Use small strokes to connect your lines and fill it out as needed so that you have one solid, even line on your upper lash line. [8] X Research source If you make a mistake, dip a cotton swab in some liquid oil and use the tip of the cotton swab to fix it. Wipe away excess liner or even out any crooked edges. [9] X Research source"
    },
    {
      "title": "Create a winged look by extending your lower lash line upward.",
      "content": "Create a winged look by extending your lower lash line upward. Wings are optional with liquid liner, but adding wings can intensify your look. To create a winged look , just follow the curve of your lower lash line upwards from the outer corner of your eyelid, creating a “wing” that tapers to a point. Then, fill in the wing. [10] X Research source Try creating just a small wing if you do not want to look too dramatic, or go for a longer wing for a high drama look. If you’re having trouble creating a straight line for your wing, try using a business card. Just place the business card against the outer edge of your eyelid at an angle and trace along the edge with the liquid liner. [11] X Research source You can also use tape to create wings. Place some tape on your lower lash line so that it is at an angle and extends up towards your eyebrow. Tape both eyes before you apply the liner to ensure an even application."
    },
    {
      "title": "Sharpen or dull your liner pencil if necessary.",
      "content": "Sharpen or dull your liner pencil if necessary. The sharpness of your eyeliner pencil will affect the way that the eyeliner looks. You can create a precise, thin line by sharpening your pencil, or you can create a more rounded, thick line by dulling the pencil. To sharpen the pencil, use an eyeliner pencil sharpener to make the pencil as sharp as you want it to be. To dull the pencil, gently rub the tip of the pencil on a tissue until it is the desired level of dullness."
    },
    {
      "title": "Warm or cool your pencil as needed to change its consistency.",
      "content": "Warm or cool your pencil as needed to change its consistency. To ensure that your pencil liner goes on smoothly, make sure it’s at the right temperature. A cooler pencil will provide a softer, lighter application. A warm pencil, which will be soft, will provide a darker, more pigmented look. If your liner feels too hard, warm it up until it’s a bit more malleable. If it feels too soft, cool it down. To warm up your liner, turn on your hair dryer on its highest setting and aim it at your eyeliner for a few seconds. This will soften up the liner enough to give it a gel-like consistency. Then, test the liner on your wrist before you apply it to your eye. To cool down your liner, try placing it in the freezer for about 10 minutes before you apply it. This will help to prevent the pencil eyeliner from crumbling. [12] X Research source"
    },
    {
      "title": "Hold the outer corner of your eyelid to ensure your line is straight.",
      "content": "Hold the outer corner of your eyelid to ensure your line is straight. Place your fingers on the outer edge of your upper lash line and pull outwards gently so that the eyelid is taut. This will help to ensure that you create a straight, even line along your upper lash line. You may also want to close your eyelid as you pull it taut. [13] X Research source Raise your eyebrows so that your eyelid doesn’t block your lash line at all. For additional stability, rest your elbow on a table or countertop to keep your hand steady."
    },
    {
      "title": "Start drawing at the outer corner of your lash line and work inward.",
      "content": "Start drawing at the outer corner of your lash line and work inward. Begin lining the outer corner of your eyelid and move towards the inner corner of your eyelid, keeping the line thicker toward the outer edge of your eye and thinner as it moves towards the inner corner. Go slowly and use short strokes to create an even line. [14] X Research source If you want to make your eyes look bigger and more open, consider applying a lighter color just to the inner corner of your upper lash line. [15] X Research source For example, you could use a cream-colored liner on the inner corners and a brown liner on the outer corners. Use an angled brush for blending if you are combining more than one color."
    },
    {
      "title": "Fill in the spaces between your lashes for a more natural look.",
      "content": "Fill in the spaces between your lashes for a more natural look. If you want a really natural look, consider tight lining your eyes. To tight line your eyes, only apply the eyeliner to the spaces between your lashes on your upper lid. [16] X Research source This will accentuate your eyes without creating a dramatic line. You can tight line your upper and/or lower lash line. For an even more natural look, try tight lining your eyes with a neutral shade, such as light brown."
    },
    {
      "title": "Line your lower lash line if desired.",
      "content": "Line your lower lash line if desired. If you decide to line your lower lid, place a finger on the outer edge of your lower lid and pull it taut. Then, begin applying liner using short strokes, just as you did with the top lid. Line the entire bottom lash line for a dramatic look. Lining the entire lower lash line along with your upper lash line will make your eyes look even more dramatic, though it will also make them look smaller. Line just the outer half of the lower lash line for a more subtle look. [17] X Research source You can also use a lighter shade of eyeliner for the lower lash to make the effect a bit less dramatic. For example, you could use a light brown shade on your lower lash line."
    },
    {
      "title": "Apply liner to one side of the liner brush.",
      "content": "Apply liner to one side of the liner brush. Gel line usually comes in a small pot, and you’ll need a liner brush to apply it. When you’re ready to apply your liner, unscrew the lid from the pot and dip your liner brush into the gel liner so that just the tip or edge is coated in gel liner. [18] X Research source Gel liner can dry out quickly, so make sure that you replace the lid as soon as you’re done using it. If the gel liner seems a little dry or stiff, warm the pot in your hands to make it easier to use."
    },
    {
      "title": "Begin applying liner to your inner and outer corners.",
      "content": "Begin applying liner to your inner and outer corners. Apply liner starting at the inner lash line and moving towards the center, but do not fill it in yet. Then, apply the liner to the center of the lash line and move towards the outer corner. [19] X Research source If your eyelids tend to cover up your eyeliner, then apply the liner in an arch shape. This will help to ensure that you can see the liner when your eyes are open. [20] X Research source"
    },
    {
      "title": "Run the brush back and forth across your lash line to fill it in.",
      "content": "Run the brush back and forth across your lash line to fill it in. After you have starter lines on the inner and outer edges, then you can fill in any gaps along the center of your lash line. Use soft small strokes to create an even line along your upper lash line. To ensure that the line is even and bold enough, you may need to go over it several times. [21] X Research source Get some more gel liner on your brush if needed. You may be able to complete one eye with the amount of gel liner that you applied to your brush, or you can add more if needed. Try blending some eyeshadow along the edge of the liner to create a smokey or smudged effect."
    },
    {
      "title": "Dip your brush into your cream liner and stir until the brush is saturated.",
      "content": "Dip your brush into your cream liner and stir until the brush is saturated. Use a small, firm, angled brush when applying cream liner for best results. [22] X Research source Swirl the brush around in the liner until it's covered. [23] X Research source Because cream liner smudges more easily, wash your face and apply primer to your eyelids prior to applying your liner, as oily skin is more likely to cause your makeup to smear."
    },
    {
      "title": "Apply your cream liner to your upper lash line, starting at the outer corner.",
      "content": "Apply your cream liner to your upper lash line, starting at the outer corner. Take your brush and apply your eyeliner in small, even strokes to form one solid line on your upper lash line. Begin at the outer corner and work your way inward, applying tiny daubs of liner as you go. [24] X Research source A lot goes a little way when it comes to cream eyeliner: you may need to reload your brush with liner more frequently as you apply it than you would with gel liner. [25] X Research source Pro tip: tilt your head back slightly so that you're watching yourself in the mirror through slitted eyes. This will ensure your eyelids are smooth and that you have a good view of your lash line as you apply the liner. [26] X Research source"
    },
    {
      "title": "Reapply liner as needed to intensify your line.",
      "content": "Reapply liner as needed to intensify your line. Because cream liner is so smooth, it isn't very defined or intense after just 1 coat. If you want your lines to look darker and more saturated, continue to apply coats of liner in small dabs until it reaches your desired intensity. [27] X Research source"
    },
    {
      "title": "Use neutral eyeshadow to create a base.",
      "content": "Use neutral eyeshadow to create a base. Apply a neutral tone of eyeshadow to your eyelids up to your brows to begin and then follow it up with a slightly darker color on just your lids and crease. For example, you can use a nude shade, followed by a light brown shade. [28] X Research source Use a large fluffy brush to apply each layer of the eyeshadow all over your eyelids. Check out this guide to applying eyeshadow to hooded lids. Not up for a neutral look? Take a gander at this makeup guide to dolling up for a fancy party, or this tutorial on how to give yourself an emo makeover."
    },
    {
      "title": "Add darker eyeshadow to the outer edges of your eyelids.",
      "content": "Add darker eyeshadow to the outer edges of your eyelids. Next, apply some medium brown eyeshadow to the outer edges of your eyelids. This will start to enhance your outer eyelids and create a nice backdrop for your cat eye eyeliner. Follow up the medium brown shade with some black eyeshadow over the same area. [29] X Research source Apply some black eyeshadow to the inner edges of your eyelids as well. This will help to create the smokey effect."
    },
    {
      "title": "Add light eyeshadow to the center of your eyelid to highlight it.",
      "content": "Add light eyeshadow to the center of your eyelid to highlight it. To brighten your eyes, add a bit of light, shimmery eyeshadow to the centers of your eyelids. You can use any light color that you want, such as a champagne, cream, or white color. Pat the eyeshadow onto the centers of your eyelids using a small fluffy brush. [30] X Research source"
    },
    {
      "title": "Line your upper lash line with liquid or gel liner.",
      "content": "Line your upper lash line with liquid or gel liner. Now that you have finished applying your eyeshadow, you can start to line your upper lash line with black eyeliner. Liquid liner or gel liner will work best because of their ability to give you a really dramatic, intense line. Take the eyeliner and begin by applying it to the outer and inner edges of your upper eyelids, then fill in the center. [31] X Research source If you’re using gel liner with a liner brush, then make sure that the brush is evenly coated and that there are no clumps of liner stuck on the brush."
    },
    {
      "title": "Create your wings.",
      "content": "Create your wings. Next, extend your eyeliner out past the edge of your eyelid and upwards. Follow the curve of your lower lash line to help you create the bottom of your wings. Go back over the wings to fill in any gaps in the liner. [32] X Research source When you’re done, you will have a dramatic, thick cat eye look."
    },
    {
      "title": "Apply mascara",
      "content": "Apply mascara and false lashes if desired. You can finish your look with some mascara and false lashes if you choose. Adding mascara will help to define your eyes and putting on false lashes will give you an even more dramatic look. [33] X Research source Try curling your lashes before you apply mascara to give them some extra volume and definition. Heat your eyelash curler with your hair dryer for a few seconds for a more dramatic curl."
    }
  ]
}