{
  "url": "https://www.wikihow.com/Contact-Cesar-Millan",
  "title": "How to Contact Cesar Millan",
  "steps": [
    {
      "title": "Post on Millan's official Facebook page for the most visibility.",
      "content": "Post on Millan's official Facebook page for the most visibility. Make sure you are signed into your own account on Facebook for a chance to reach Cesar Millan. Comment on the latest post you see on his page. With any luck, he will see your message and respond to it. The page is located at https://www.facebook.com/cesar.millan/ . [1] X Research source Be aware that the account as almost 9 million followers, so it can get quite busy. Don't get discouraged if your post isn't seen right away. If you have a question, try posting it no more than once a day. Flooding the page with lots of messages can be a nuisance and discourage the page operators from responding to your message."
    },
    {
      "title": "Leave a message on Millan's Instagram page to stand out more.",
      "content": "Leave a message on Millan's Instagram page to stand out more. Along with Facebook, Instagram is the best way to get ahold of the famous dog trainer. A lot of videos and updates are posted to the account from Millan's Dog Psychology Center in California. Make any comments or questions you have on the account's latest post at https://www.instagram.com/cesarsway/ . [2] X Research source Reaching Cesar Millan through social media isn't guaranteed. You may need to be persistent to get a response. While you wait, talk to other fans to increase your chances of being noticed."
    },
    {
      "title": "Visit Millan's Twitter account if you need to leave a more direct message.",
      "content": "Visit Millan's Twitter account if you need to leave a more direct message. Log into your Twitter account, then navigate to Millan's account page. Click on the green button on the left side of the page to start a Tweet. Keep in mind that this message is still public, so anyone on Twitter can see it. Millan's official Twitter account is at https://twitter.com/cesarmillan . [3] X Research source Although this method is more direct than posting through Facebook or Instagram, you still may not get a response right away. The direct messaging option isn't available. If you wish to reach out through Twitter, you will have to send a public Tweet."
    },
    {
      "title": "Use the hashtag #cesarsos if you need to ask about dog behavior.",
      "content": "Use the hashtag #cesarsos if you need to ask about dog behavior. This hashtag is valid on all of Millan's social media accounts. Include the hashtag at the end of your message. If you're posting about dog behavioral issues, this hashtag makes your message stand out. [4] X Research source Millan's official website recommends using this hashtag to post about dog behavioral issues. It doesn't matter if you type it in lowercase or capital letters. Since the hashtag is meant to ask Cesar Millan for help, avoid using it for other means. You can still reach out to him over social media or through his website."
    },
    {
      "title": "Send in a video or attend a casting call if you want to be on TV.",
      "content": "Send in a video or attend a casting call if you want to be on TV. Auditions are available sporadically, so check Millan's website often for updates. To have a chance of getting on TV, you need to show the producers your dog's behavior. The best way to do this is to film your dog's behavior and send the video to Cesar Millan's company. If you live near the casting call area, you can also go there in person. The show producers look for unique or unusual dog behavioral problems. Your video does not have to be professional, but it does need to show off your dog."
    },
    {
      "title": "Attend a show on the live tour if you want to learn about dog behavior.",
      "content": "Attend a show on the live tour if you want to learn about dog behavior. Cesar Millan sometimes tours across the U.S. At his shows, he teaches people how to understand and manage dog behavior. You can find show dates and buy tickets on his website. Continue checking the website as new dates are announced at https://www.cesarsway.com . [5] X Research source Large audiences attend these tours. You may not be able to contact Cesar Millan unless you're close to the stage or are lucky enough to find him after the show."
    },
    {
      "title": "Go to a dog training course if you need to work with Millan in person.",
      "content": "Go to a dog training course if you need to work with Millan in person. Dog owners can bring their dogs to Millan's courses for behavioral training. Many of these courses are held at Millan's Dog Psychology Centers in California and Florida. Read the information carefully before signing up. Some of the courses are taught by Millan himself while others are taught by his staff."
    },
    {
      "title": "Submit the request form at Millan's official website if you want a fast reply.",
      "content": "Submit the request form at Millan's official website if you want a fast reply. The website is called Cesar's Way. By using the “contact us” tab at the bottom of the page, you can access a form to communicate with Millan's staff. Type in your contact information and your request, then hit the submit button. You can access the form directly at https://www.cesarsway.com/contact . [6] X Research source The form is meant for business-related requests, such as advertising, sponsorship, or issues with product purchases. For issues regarding dog behavior, reach out through social media."
    },
    {
      "title": "Write to Cesar Millan if you need an alternative to the website.",
      "content": "Write to Cesar Millan if you need an alternative to the website. The mailing address listed on the website is also for business requests. Avoid using it to ask about dog behavior, since your message likely will be ignored. Mail a letter to the address, then wait or a response. This takes at least several weeks, so it isn't as quick as reaching out through the contact form. Send the letter to: Cesar's Way, Inc. or Cesar Millan PACK Project PO Box 802888 Santa Clarita, CA, 91380-2888"
    },
    {
      "title": "Contact Cesar Millan's PACK Project if you're interested in charity work.",
      "content": "Contact Cesar Millan's PACK Project if you're interested in charity work. The charity is open to donations and may also be open to sponsorship opportunities. Its goal is to encourage dogs and people to live in harmony together. You can give a donation through the charity's website or reach out to them to discuss other ways to contribute. With enough effort, you may even get to speak to Cesar Millan. [7] X Research source Read about the charity at https://www.cesarsway.com/get-involved/cesar-millan-pack-project/about . You can reach out to the charity by emailing donations@millanpackproject.org."
    }
  ]
}