{
  "url": "https://www.wikihow.com/Awaiting-Endpoint-Discord",
  "title": "How to Fix the \"Awaiting Endpoint\" Error on Discord & What It Means",
  "steps": [
    {
      "title": "“Awaiting Endpoint” means Discord can’t establish a stable connection.",
      "content": "“Awaiting Endpoint” means Discord can’t establish a stable connection. Basically, when you see “Awaiting Endpoint,” there’s a problem somewhere in the process of sending data from your device to Discord that’s causing things to stall. This issue has several possible causes; if you can determine the cause, it’s much easier to fix! Common causes include: [1] X Research source An issue with the Discord server. There might be an error on Discord’s end, like an outage or a downed server. A problem with your internet connection. Internet connectivity problems will naturally cause apps that rely on the internet (like Discord) to malfunction. An outdated Discord app. If you don’t update your apps regularly or have auto-updates, the outdated software can cause glitches."
    },
    {
      "title": "Make sure you have a working internet connection.",
      "content": "Make sure you have a working internet connection. First thing first: if your internet is slow or not working correctly, Discord voice channels won’t be able to work, either. Check your internet connection and verify it’s a solid connection with good speed. To run a quick test, open Google and search \"internet speed test.\" Then, click \"Run Speed Test\" at the top of the page. [2] X Research source If the speed test results show that your internet is slow or not working, try restarting your router or modem. If restarting your Wi-Fi doesn’t fix your internet connection (or you aren't getting the internet speeds that you should, according to the test), contact your internet service provider for support. You can also try flushing the DNS cache on your computer, as doing this may clear up any internet issues."
    },
    {
      "title": "Check the status of Discord’s server.",
      "content": "Check the status of Discord’s server. If Discord’s server is down for maintenance (or some other reason), you won’t be able to connect to any voice channels. So, go online to discordstatus.com . Then, scroll down to Voice and click on the plus (+) sign next to it. From there, find your region and see if Voice is operational there. [3] X Research source If Discord’s server is down, you may need to wait until it’s fixed (or, if possible, change the server region—which we’ll cover below)."
    },
    {
      "title": "Restart your Discord app.",
      "content": "Restart your Discord app. Assuming your internet and Discord are both working, try restarting the app entirely . This can fix any issues the app may be having (including the Awaiting Endpoint error). Windows: Press Ctrl + Shift + Esc to open the Task Manager. Right-click on Discord. Select End Task to close Discord. Re-open Discord and see if it’s working. MacOS: Press Option + Command + Esc to open the Force Quit menu. Click on the Discord app, then select Force Quit . Re-open Discord and see if it’s working."
    },
    {
      "title": "Update your Discord app to the latest version.",
      "content": "Update your Discord app to the latest version. If you’re using an outdated version of Discord, you might be encountering the “Awaiting Endpoint” error because of it. Discord usually auto-checks for updates when it’s first opened, but if that hasn’t happened for some reason, you can check for updates yourself. [4] X Research source Windows: On the Microsoft store, click the See more button (with “...”), then Downloads and updates > Get updates . MacOS: Open the App Store and tap the Updates tab in the sidebar to view available updates."
    },
    {
      "title": "Log out of Discord, then log in again.",
      "content": "Log out of Discord, then log in again. You may get the “Awaiting Endpoint” error because Discord is having an issue verifying your account. To fix it, simply log out of your account and then log back in. This should help Discord verify your account properly so you can connect to a voice channel. To log out: Click the gear icon next to your username. Scroll to the bottom of the page and select Log Out . Re-enter your credentials to log back in!"
    },
    {
      "title": "Change the server region on your Discord app.",
      "content": "Change the server region on your Discord app. If the Discord server isn’t working in your region, you can try changing the server region to see if that fixes the problem. Keep in mind that only the server administrator can do this—so if you aren’t the admin, you’ll need to reach out to them and ask them to do it. To change server regions: [5] X Research source Open the Discord app on your computer. Select the server you’re having trouble connecting to. Click the down arrow icon next to the server’s name, then select Server Settings . Select Overview from the lefthand panel. Find Server Region and select Change . Choose another server region (besides the one currently in use). See if the “Awaiting Endpoint” error has been resolved."
    },
    {
      "title": "Reinstall Discord on your device.",
      "content": "Reinstall Discord on your device. It’s possible your installation of Discord got corrupted, in which case reinstalling the app can clear up the issues you’re having. So, depending on whether you’re using Windows or Mac, follow the steps below to uninstall and reinstall Discord. [6] X Research source Windows: Press Windows + I on the keyboard to see Settings. Select Apps from the sidebar, then click on Installed Apps . Find Discord and select the menu with three dots (...) next to it. Select Uninstall and follow the instructions to finish the process. Reinstall Discord from the Microsoft store. MacOS: Open the Finder app and select the Applications folder from the sidebar. Find Discord and right-click on it. Select Move to Bin . Confirm the action when prompted. Reinstall Discord from the App Store."
    },
    {
      "title": "Set up and use a VPN.",
      "content": "Set up and use a VPN. If there’s an issue with your IP address, using a VPN (virtual private network) might help Discord establish a better, secure connection between your device and its server. There are many different VPN options to choose from; if you opt to use a VPN, pick one that works for you , set it up, and see if it fixes your “Awaiting Endpoint” error. [7] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Some popular VPNs include NordVPN , Proton VPN , and ExpressVPN . On the other hand, if you’re already using a VPN or proxy service, try disabling it temporarily to see if it fixes the issue."
    }
  ]
}