{
  "url": "https://www.wikihow.com/Clean-a-Large-Area-Rug",
  "title": "How to Clean a Large Area Rug",
  "steps": [
    {
      "title": "Vacuum the top side of the rug.",
      "content": "Vacuum the top side of the rug. Turn on your vacuum cleaner and push it back and forth across the top surface of your rug to suck up loose dust and debris. Work in long, parallel strokes so that you clean the entire rug. Try to vacuum your rug at least once per week. [1] X Research source Depending on the rug’s thickness, you may need to adjust the knob on the vacuum that controls its suction power. Vacuuming a shag rug is a great way to get dust and dirt out of its long fibers. However, turn off the vacuum’s beater bar so you don’t inadvertently tear fibers off of the rug. [2] X Research source If your vacuum doesn’t have a turn-off for the beater bar, try borrowing a different vacuum from a friend. When you’re vacuuming an Oriental rug or a home-made or hand-knotted rug, set a sheet of nylon screening over the rug for protection. Weigh the edges of the nylon down with 3–4 books. [3] X Research source Sprinkle baking soda onto your rug and let it sit on your rug before vacuuming every 3 months. This will help deodorize your rug."
    },
    {
      "title": "Flip the area rug over and vacuum its underside.",
      "content": "Flip the area rug over and vacuum its underside. While rug owners typically don’t look at (or walk on) the underside of the rug, these surfaces can get quite dirty. Once the top of the rug is dirt-free, flip it over and lay the rug flat on the ground. Use the same technique to vacuum dirt and grime off of the bottom of the rug. [4] X Research source Flip the rug back right-side up once you’ve vacuumed the underside."
    },
    {
      "title": "Shake smaller area rugs outdoors.",
      "content": "Shake smaller area rugs outdoors. If your area rug is less than 4–5 feet (1.2–1.5 m) in diameter, pick the rug up and carry it outside. Hold on to one of the short edges of the rug, and vigorously shake it. This will dislodge any pieces of dirt, food, etc., that are stuck deep in the rug fiber. [5] X Research source Also try beating the rug with a broom handle while you’re holding it in the air. If you see puffs of dust coming from the rug, keep beating it. [6] X Research source However, if you’re cleaning an old or expensive area rug, don’t beat it with a broom handle. In fact, depending on the rug’s condition, it might be best not to shake it outside."
    },
    {
      "title": "Brush out lingering pet hair with a stiff brush.",
      "content": "Brush out lingering pet hair with a stiff brush. Depending on the type of fibers in your rug and the breed of pets in your home, pet hair may be deeply embedded in your rug. If you’ve vacuumed and shaken out your rug and there’s still fur in it, brush the rug with a stiff-bristle brush. Brush hairy spots on the rug with short, repetitive strokes to tease out the animal hair. [7] X Research source You can purchase a brush with stiff plastic bristles at a hardware store. Don’t use a brush with metal bristles, as these will tear up the rug."
    },
    {
      "title": "Purchase a rug shampoo designed to clean the material of your rug.",
      "content": "Purchase a rug shampoo designed to clean the material of your rug. If you’re not sure what type of material your rug is made from, check the manufacturer’s tag. This tag should be attached somewhere on the underside of the rug. When you’re shopping for rug shampoo, find a bottle whose label states that it cleans the type of material that your rug is made of. [8] X Research source Purchase rug shampoo at home-improvement stores and some large supermarkets. It may also be for sale at a local hardware store. Some rug materials cannot be fully saturated with water or they react poorly to chemicals. Always double check the material for your rug before wet-cleaning it."
    },
    {
      "title": "Test the cleaner by applying it to an inconspicuous corner of the rug.",
      "content": "Test the cleaner by applying it to an inconspicuous corner of the rug. Open the container of rug shampoo and apply a small dollop to a 1 ⁄ 2 inch (1.3 cm) sized patch of the rug. Wait for 1–2 hours and inspect the area where you applied the shampoo. If it’s not discolored, you’re ready to apply the shampoo to the entire rug. [9] X Research source If the patch of rug is discolored, you’ll need to return the shampoo and purchase a different type. Continue testing rug shampoos until you find one that works."
    },
    {
      "title": "Take your rug outdoors and spray it with a garden hose.",
      "content": "Take your rug outdoors and spray it with a garden hose. Since the rug shampoo will only work on wet rug fibers, the entire rug needs to be saturated. Spray water from a hose across the rug for at least 20-30 seconds. It’s best to do this on a clear, warm day so that your rug doesn’t freeze or get rained on. [10] X Research source If you don’t have a hose (and don’t plan to purchase one), you can dump 8-10 bucketfuls of water across the surface of the rug."
    },
    {
      "title": "Scrub the shampoo deep into the rug fibers with a soft-bristle brush.",
      "content": "Scrub the shampoo deep into the rug fibers with a soft-bristle brush. Follow the directions printed on the shampoo’s packaging and squeeze out the suggested amount of shampoo onto the wet rug. Then, set to work with a brush. Scrub the top surface of the rug until it’s covered in a thick foam of bubbles. [11] X Research source Scrub especially hard on any areas on the rug that are stained or extra dirty. For example, the rug may have muddy footprints or food stains on it."
    },
    {
      "title": "Spray the rug with the hose to rinse the shampoo out.",
      "content": "Spray the rug with the hose to rinse the shampoo out. Once you’ve lathered and scrubbed the entire surface of the rug and removed all visible stains, turn the hose back on and re-spray the rug. Continue to rinse the rug fibers until you’ve rinsed off all signs of suds and bubbles. [12] X Research source If you don’t have a hose, rinse off the rug by dousing it with half a dozen buckets of water."
    },
    {
      "title": "Squeegee the rug to remove excess water.",
      "content": "Squeegee the rug to remove excess water. At this point, your rug will be soaking wet. To help speed up the drying process, run a squeegee along the top side of the rug. This will press water out of the rug’s fibers. To avoid damaging the rug, always slide the squeegee in the direction that the rug’s nap goes. [13] X Research source Buy a squeegee at any hardware store or a large supermarket."
    },
    {
      "title": "Lay the rug flat to dry for 1-2 days.",
      "content": "Lay the rug flat to dry for 1-2 days. Bring the rug inside and lay it flat in an out-of-the-way area of your home (e.g., a closet or pantry). A large rug will take a couple of days to dry. Every 6-8 hours, pat the surface of the rug to see whether or not it’s dry. Once 1 side of the rug has dried, flip it over and let the underside dry. [14] X Research source Help the rug dry quickly by setting up 1 or 2 floor fans in the room with the rug to circulate air over it. [15] X Research source Once the rug has dried, give it a shake or 2 to fluff it up and return the rug to its spot on the floor."
    }
  ]
}