{
  "url": "https://www.wikihow.com/Apply-Liquid-Lipstick",
  "title": "How to Apply Liquid Lipstick",
  "steps": [
    {
      "title": "Prep your lips with moisturizing lip balm.",
      "content": "Prep your lips with moisturizing lip balm. Liquid lipstick stays on for a long time and this can dry out your lips. To keep your lips moisturized, apply some moisturizing lip balm to your lips before you apply the liquid lipstick. [1] X Research source Look for a lip balm that is wax based for extra protection, such as a beeswax lip balm. [2] X Research source"
    },
    {
      "title": "Apply some highlighter around your lip line.",
      "content": "Apply some highlighter around your lip line. To accentuate your cupid's bow, take a moment to apply a little highlighter to this area and along other areas around your lips if desired. Your cupid's bow is the curved area right above your upper lip. [3] X Research source You only need to apply a small amount of highlighter to your cupid's bow. [4] X Research source Highlighter is meant to reflect the light and look natural. Adding too much may make your lips look a little odd."
    },
    {
      "title": "Use concealer around your lips.",
      "content": "Use concealer around your lips. Liquid lipstick can bleed onto the areas around your lips if you get sweaty or in hot or humid weather. To prevent liquid lipstick from bleeding onto the skin around your lips, apply some concealer to the skin around your lip line using a makeup sponge. [5] X Research source"
    },
    {
      "title": "Line your lips if desired.",
      "content": "Line your lips if desired. Lining your lips is not necessary, but it may help you to ensure better definition to your lips. If you want to use lip liner, then apply it at this time. You may even want to just line your cupid's bow to make sure that it is well-defined. To line your lips, start at your cupid's bow and draw a line going in towards the center of your lip. Then do the same thing for the other side of your cupid's bow. Then use small strokes to line the outer edges of the rest of your lips. [6] X Research source"
    },
    {
      "title": "Fill in your bottom lip first.",
      "content": "Fill in your bottom lip first. To begin applying your liquid lipstick, take your liquid lipstick and use the brush to apply it first to the outer corners of your lower lip. Then, move downwards towards the bottom edge of your lower lip and line your lower lip with the liquid lipstick. You can then fill in your lower lip with a few swipes of liquid lipstick. [7] X Research source"
    },
    {
      "title": "Press your lips together.",
      "content": "Press your lips together. Before you move on to your upper lip, press your lower lip against your upper lip to transfer some of the color. You will not be able to cover your entire upper lip this way, but pressing your lips together will start to even out the color and distribute it to your upper lip. [8] X Research source"
    },
    {
      "title": "Move to your upper lip.",
      "content": "Move to your upper lip. Next, line the outer edge of your cupid's bow and then move to the outer edges of your upper lip. Line and fill in these areas and then press your lips together some more. [9] X Research source Only one coat of liquid lipstick is necessary since it often provides full coverage in one coat. However, you may want to apply more liquid lipstick to some areas or do an extra coat for a more intense look. [10] X Research source"
    },
    {
      "title": "Blot your lips on some tissue paper for a matte look.",
      "content": "Blot your lips on some tissue paper for a matte look. Liquid lipstick may appear glossy when you first apply it, but by blotting your lips on a piece of tissue or a paper towel, you can achieve a matte look instead. Take a tissue or a paper towel and hold it up to your lips. Then wrap your lips around it as if you are biting it with your teeth. [11] X Research source [12] X Research source"
    },
    {
      "title": "Use a cotton swab dipped in cold cream to correct any mistakes.",
      "content": "Use a cotton swab dipped in cold cream to correct any mistakes. Liquid lipstick can be hard to remove and it can stain your skin pretty quickly if you make a mistake. Make sure that you fix any mistakes right away by using a cotton swab dipped in some cold cream to wipe the area clean. [13] X Research source"
    },
    {
      "title": "Remove the lipstick with a textured makeup wipe.",
      "content": "Remove the lipstick with a textured makeup wipe. If you do not like the color or if you are just ready to take it off, then you will need to use some makeup remover. Try using a textured makeup remover wipe to take off the color and then follow up by rinsing off your lips. [14] X Research source Make sure that you apply some more lip balm after you have removed the liquid lipstick to restore any lost moisture."
    }
  ]
}