{
  "url": "https://www.wikihow.com/Become-an-Alchemist",
  "title": "How to Become an Alchemist",
  "steps": [
    {
      "title": "Engage in calcination.",
      "content": "Engage in calcination. Calcination was, traditionally, the process of breaking a substance down by heating it in a crucible. [1] X Research source Psychologically, it can be thought of as breaking down your sense of self in order to change into a stronger, more aware individual. Consider your old self the \"lead\" that is going to be transformed. Instead of literally heating lead over an open flame, you will be breaking down your sense of self to transmute yourself into your \"gold\" potential. Set aside at least 20 minutes every day to reflect on your day and contemplate your life. Any life transformation begins with recognizing that a change is necessary for whatever reason. One of the best ways to reach that conclusion on your own is to practice daily self-reflection. [2] X Research source If you have a hard time focusing at first, that's okay. The important thing is to make a habit of being alone and reflecting on your life each day. The insights will come if you give yourself the time and space to practice. Whatever method of self-reflection you find most appealing, make a habit of doing it every day."
    },
    {
      "title": "Practice dissolution.",
      "content": "Practice dissolution. Dissolution (derived from the word \"dissolve\") involves turning a calcinated (broken down) solid into a liquid, typically by dissolving the ashes in water. From a psychological/transformative standpoint, dissolution means immersing yourself in the unconscious regions of your mind. Part of that process requires you to stop repressing buried thoughts and memories. Some people consider this step to require engaging in \"flow,\" the process of engaging in something so wholeheartedly that we lose track of time, forgetting ourselves and our surroundings. [3] X Research source Flow (and by extension, dissolution) requires the following actions: determine what you want to accomplish concentrate for prolonged periods of time forget or abandon your own consciousness experience the feeling that time is passing quickly look for direct feedback on your self recognize and maintain a balance between your own abilities and the challenge/task at hand maintain personal control over the situation you're faced with find a sense of reward and purpose from the activity at hand forget (temporarily) your bodily needs become completely absorbed in the activity at hand"
    },
    {
      "title": "Enter the separation stage.",
      "content": "Enter the separation stage. In traditional alchemy, separation is the process of filtering the results of dissolution to isolate the individual components and discard the baser, undesirable materials. In terms of personal transformation, separation involves rediscovering who you are at your core - the visionary \"gold\" of your life that was previously muddied by the baser, \"lead\"-like elements of your life. It requires a conscious choice of what is worth getting rid of and what is worth reincorporating into your new, refined personality. [4] X Research source Determining your own values can be a helpful way to choose what is worth keeping versus what is worth getting rid of. Try thinking about what characteristics you respect most in someone you admire, and why those characteristics are important. You could also think about what issues or events are most important/meaningful to you in your life. Writing in a journal is a great way to gain insight and become more self-aware. It allows you to catalog your thoughts and make connections between the way you think and the way you behave. Recognizing your own negative qualities is probably the most profound realization one can have, but sometimes we need help in realizing our shortcomings. If you ask a few trusted friends to give you an honest assessment, though, you'll probably gain some valuable insight into what aspects of your personality or demeanor could stand to change. [5] X Research source"
    },
    {
      "title": "Practice conjunction.",
      "content": "Practice conjunction. Alchemically, conjunction involves assembling the saved elements from the separation stage into something new and different. In terms of personal transformation, conjunction requires you to combine the conscious and subconscious minds, as well as elements of the masculine and feminine components of your personality, into something new. [6] X Research source That something can be a new system of personal beliefs, a new personality, or a new state of consciousness, but it is essential that that new vision of yourself emerges from the existing parts of you. In other words, don't try to become that which you are not - become the best parts of who you already are. Try removing yourself from any distractions to a quiet place. Close your eyes and focus solely on the pattern of your breathing. Breathe slowly through your nostrils and into your abdomen, pause, and exhale slowly through the nostrils. Any time your mind starts to wander while meditating, return your thoughts to your breath. Focus on the sensation of breathing in through your nostrils, the feeling of your abdomen rising and falling, and the sensation of the air escaping back out through your nostrils. Try visualizing the best version of yourself. Imagine everything going well in your life, and imagine yourself as being fully prepared and in control of everything in your life. Think about what is most important to you and what aspects of yourself you value the most."
    },
    {
      "title": "Begin fermentation.",
      "content": "Begin fermentation. Fermentation traditionally involved using microorganisms (such as bacteria or yeast, for example) to chemically alter a substance. Common applications of fermentation include the use of yeast to convert sugar into alcohol or the use of bacteria to turn milk into cheese. In terms of personal transformation, fermentation requires you to accept inspiration of some type that will energize or enlighten you. Fermentation is often achieved through various means of focus and transformation. These include (but are not limited to) deep and intense prayer, deep meditation, a conscious desire for some mystical or spiritual union with a higher power, transformative therapy, or altered states of consciousness."
    },
    {
      "title": "Proceed to distillation.",
      "content": "Proceed to distillation. Distillation is the process of heating a substance until it turns to vapor, then collecting the condensed vapor as it cools into a liquid. Distillation is sometimes called purifying because it further removes impurities and nonessential components (for example, think about how brandy is distilled from wine by boiling off the water). When it comes to personal transformation, distillation is the \"purification\" of your personal psychic forces to ensure that nothing remains of the undesirable elements of your old self. [7] X Research source Objective personal introspection is the best way to practice distillation. Distance yourself from all emotions and sentimentality and evaluate what remains of your identity. Consider your life from the viewpoint of someone else - perhaps a friend or relative who knows you well and has given you valuable advice in the past. What aspects of yourself would that person consider to be the most vital elements of who you are?"
    },
    {
      "title": "Finalize change with coagulation.",
      "content": "Finalize change with coagulation. Coagulation occurs when a liquid or gas is permitted to return to a solid state. In transformative terms, coagulation is the final stage of alchemical change - it is marked by a profound sense of confidence and the ability to continue to exist in any aspect of reality. Upon achieving coagulation, you should experience a sense of rejuvenation and a sense of higher being. This will vary, of course, depending on who has experienced the transformation, but will be accompanied by a new sense of self, regardless of the particulars of your transformation."
    }
  ]
}