{
  "url": "https://www.wikihow.com/Become-a-Quiet-Person",
  "title": "How to Become a Quieter Person",
  "steps": [
    {
      "title": "Speak only when you have something important to say.",
      "content": "Speak only when you have something important to say. Quiet people tend to be less impulsive , and they consider decisions from multiple angles before acting. They think, act, and speak with intention, not just because they can. Before you talk, ask yourself why you’re speaking, and if it’s important. This can help you make better decisions, especially about what to say. [1] X Research source Ask yourself: Is what I’m about to do or say necessary? Or am I just doing or saying something because I’m bored, or feeling awkward?"
    },
    {
      "title": "Move slowly and comfortably to give off calm energy.",
      "content": "Move slowly and comfortably to give off calm energy. Even just the way you stand, sit, and move can tell people about who you are. [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Quiet people are easier to approach than people who are loud and aggressive, often because of their body language. They keep their hands to themselves, move confidently and casually, and avoid any quick movements or dramatic gestures. To stay open and approachable , keep your head up and slowly scan your surroundings. Keep a casual, comfortable stance like you would if you were sitting in an empty waiting room, and nobody was watching you. Appear more quiet and mysterious by paying attention to the world around you. Take time to inspect and study things in your environment."
    },
    {
      "title": "Take deep breaths to stay calm and patient.",
      "content": "Take deep breaths to stay calm and patient. Quiet people keep cool heads and rarely lose their patience . That can be a tall order in a fast-paced world, but it's an important skill to practice. Life coach Rebekka Mars suggests that, whenever you feel anxious or antsy, you “take several deep breaths”—10 seconds in, 10 seconds out—to calm and center yourself. Also, when you’re anxious, it tends to show on your facial expression and in your body language, which can shatter your cool, quiet image. This can actually give you a lot of power and turn you into a quiet, effective leader . When you're the one that's calm, cool, and collected, people will be drawn to follow your lead."
    },
    {
      "title": "Say what you mean in as few words as possible.",
      "content": "Say what you mean in as few words as possible. Quiet people mean what they say, and say what they mean. That way, you’re never saying anything more than necessary. Use your words sparingly, but make each one matter. Over time, people will value this quality in you, and learn to trust you , even when you don’t say much. [3] X Research source Licensed social worker Sabrina Grover says that you can also build trust by taking “a non-judgmental stance in your conversations.” Strive to be open-minded , instead of impulsively judging others for their words."
    },
    {
      "title": "Strive to accomplish more things without help.",
      "content": "Strive to accomplish more things without help. While there's no shame in asking for help, you’re probably capable of more than you think. Before you start hitting up friends, stop, think, and ask yourself if there’s a way to solve the problem on your own. This makes you more self-reliant . [4] X Research source And when you do need to ask for help, you’ll have already analyzed the problem, so you’ll know exactly what to ask for."
    },
    {
      "title": "Have a point or purpose in mind when you speak.",
      "content": "Have a point or purpose in mind when you speak. When you talk to someone, remind yourself of the conversation’s goal, and stick to it. Try not to chatter if you don't really have something to say. Instead, stay on-topic and make each word count. Over time, people will start to listen to you better because they know that what you have to say is important. [5] X Research source If you talk too often, you water down what you have to say, making it less important. Thoughtfully choosing your words makes them have impact."
    },
    {
      "title": "Let the other person dominate the conversation unless it's important.",
      "content": "Let the other person dominate the conversation unless it's important. Unless the situation is important—such as a work meeting—take a back seat in your conversations. Don’t bring up new subjects or tangents, just let them guide things. You may not want to do this with every conversation, but it can be a great way to teach yourself to speak only when you need to. Also, observe their body language to help you become a better listener. Focusing on their words and movements at the same time distracts you from talking too much yourself. You don’t have to do this all the time. Feel free to speak more around good friends or new acquaintances, who might be off-put by silence."
    },
    {
      "title": "Let your face and body language do the talking.",
      "content": "Let your face and body language do the talking. Body language can communicate more than words can, sometimes, so take advantage of it! [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you’re happy or excited, keep your shoulders relaxed and your head high. If you’re sad and glum, stoop your shoulders and keep your facial expression slack or neutral. For example, if somebody is making you angry, signal this by taking a step back and crossing your arms, which is a defensive and agitated position."
    },
    {
      "title": "Ask questions that focus on the other person.",
      "content": "Ask questions that focus on the other person. People love talking about themselves, and if you allow them time to do it, they’ll love you for it, too. [7] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Being quiet doesn't always mean not talking—it means using words succinctly, asking interesting questions, and making solid points worth talking about. So don't tell yourself to shut up; just tell yourself to ask the right questions. Let’s say an acquaintance of yours went skydiving. Instead of saying, “Oh, I went skydiving once; it was awesome!” you say, “That’s great! How was it? Was it your first time?” If they’re truly invested in the conversation, they’ll probably ask you if you’ve ever done it, too."
    },
    {
      "title": "Avoid interrupting people to maintain your quiet vibe.",
      "content": "Avoid interrupting people to maintain your quiet vibe. This is part of being a “backseat talker.” Interrupting isn’t just rude, but it makes it seem like you can’t help yourself and you need to talk. [8] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Let the other person finish before you start on what you think. If you’re not sure if you interrupted or not, just say, “I’m sorry, did I interrupt? Go on.” This will make them feel more appreciated, too. Take a second to consider how much you've spoken in this conversation and how much the other person has. If it's been a while since you've really chimed in with something, go ahead. No conversation is fulfilling if the other person is practically mute. But the door swings both ways—if you've been talking for a while, let the other person grab the reins."
    },
    {
      "title": "Lower the volume of your voice.",
      "content": "Lower the volume of your voice. It seems obvious, but literally being quieter when you talk goes a long way. Soften your delivery and talk more softly, but loud enough to be heard. Quiet people tend to be gentler in socializing, even when they do speak up. And if you talk a low but understandable volume, people will lean in to hear you, and listen more actively. Don’t talk so quietly that the other person has to strain to hear you. Practice and aim for an inside-voice that’s clear and understandable, but still requires attention to listen to."
    },
    {
      "title": "Use fewer words to say what you mean.",
      "content": "Use fewer words to say what you mean. Being articulate means using only as many words as you need to get your point across. It helps you speak less, but also fill every word with meaning, which gives you that dignified and composed personality. [9] X Research source For example, instead of rambling on about how much you liked a movie, going on all sorts of tangents, think about what you liked about it and why, then say that. If you’re not sure what you want to say, it’s okay to say, “Sorry, I’m just collecting my thoughts for a minute.” This makes you seem even more thoughtful and intentional."
    },
    {
      "title": "Meditate for at least a few minutes every day to help quiet your mind.",
      "content": "Meditate for at least a few minutes every day to help quiet your mind. Mars tells us that meditation makes you “less reactive.” As a result, you’ll be less likely to talk out of turn. Plus, not only will meditation get you a clearer, more thoughtful, tuned-in mind, but it can help lower your cholesterol and blood pressure, too. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Just 10-15 minutes each day can leave you feeling zoned and zenned for the next 24 hours. There’s no wrong way to meditate! As long as you’re feeling calm and letting your mind explore and do its thing, you’re doing it right."
    },
    {
      "title": "Keep a journal to get your thoughts onto a page.",
      "content": "Keep a journal to get your thoughts onto a page. Sometimes, we tend to ramble because our thoughts are pent up in our heads all day. Journaling gets those thoughts out of your head, so that they don’t escape in conversation. Commit to a daily writing practice and ask yourself questions like: [11] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source How and what did I feel today? Why? What did I learn today? Who did I learn from? What ideas arrived? Who or what did I think about today? How was today different than yesterday? Than last week? Than last year? What can I be grateful for? Why?"
    },
    {
      "title": "Pick up hobbies that don’t require much talking.",
      "content": "Pick up hobbies that don’t require much talking. When you can spend time alone with yourself doing quiet, thoughtful things, it’ll be easier to do the same in larger groups. You'll cultivate patience and nurture your inner world, as well as provide yourself with more conversation material when it's time to socialize. [12] X Research source Try knitting , zen gardening or some other activity that doesn't require extraneous talking. Even just picking up a good book is a start. That said, quiet people can also do things loud people do—don’t limit yourself! Try singing , dancing , playing an instrument , etc. Remember to transition back to a quiet person when you're done. Quiet hobbies also get you into the habit of being quiet when you’re out in the world. It makes you comfortable with silence and introspection."
    },
    {
      "title": "Look for opportunities to spend time alone.",
      "content": "Look for opportunities to spend time alone. “When you can be alone and be happy, it's like a superpower,” Life coach Jennifer Butler says. Being alone with your thoughts can be some of the most rewarding, productive time spent in your day. This will not only be quality time doing whatever you want, but you'll learn to be with just yourself and like it, too. This includes disconnecting from social media! Posting on social media too much doesn’t scream “quiet person,” but even scrolling social media can make you anxious or agitated, which is counterproductive. [13] X Research source Also don’t be afraid to go to concerts, restaurants, or movies alone. These things don’t always have to be super social!"
    },
    {
      "title": "Spend time with more introverted friends, or 1 friend at a time.",
      "content": "Spend time with more introverted friends, or 1 friend at a time. Surrounding yourself with bustling, gregarious, bubbly people will only make you more bustling, gregarious, and bubbly. To learn to appreciate friends on a lower key and sometimes even in silence, spend time with more introverted, naturally quieter people, or spend time with fewer friends at a time. You’ll find that it’s a completely new and different kind of fun. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Quiet people often tend to hang out with quiet people, though this is not always the case. If you don't know that many quiet people, ask your quietest friend and meet their friends. Alternatively, join more traditionally quiet activity groups—try a book club or a cooking class to meet quieter individuals."
    },
    {
      "title": "Practice being totally silent for short periods of time.",
      "content": "Practice being totally silent for short periods of time. Maybe you can be completely silent for an hour. Then try three hours. If you can make it to a whole day , you might find yourself observing more around you that you never noticed before because you were too busy talking. Doing a big, dramatic exercise like this helps you find smaller ways to be quiet when the exercise is done, like using gestures to talk instead of your voice. Or, do the opposite, and practice talking to yourself in your alone time. Like journaling, this can help get your thoughts out when you’re alone, instead of when you’re around others."
    },
    {
      "title": "See a therapist to talk your heart out.",
      "content": "See a therapist to talk your heart out. Not only will this give you that much-needed time to talk about yourself, but you can also talk about why you feel you need to be quieter, and whether you demand other people's attention. Therapists are for everyone, including people who want to get in touch with themselves. [15] X Research source If someone is making you feel like you’re too loud, you can talk about that, too. You’re probably just fine as you are, unless you feel it’s a problem. Being comfortable in your natural personality is very important."
    },
    {
      "title": "Avoid being quieter just to please other people.",
      "content": "Avoid being quieter just to please other people. At the end of the day, some people are just naturally louder than others. You don’t have to be quieter—you’re probably just fine as you are. However, if you do feel compelled to change, only make changes that feel okay and genuine. If you want to speak up, do it. If you want to dance in the cafeteria, do it. All of us are dynamic individuals with more than one side to us. Maybe you just have a quiet side that comes out once in a while. If you genuinely do feel the need to be quieter, choose times when you feel this is the most important. At dinner with family? During class? Don't aim to be a quiet person; aim to be quieter in the right circumstances. There may be times when being loud is called for."
    }
  ]
}