{
  "url": "https://www.wikihow.com/Build-an-Adjustable-Dog-Agility-Seesaw",
  "title": "DIY Agility Seesaw for Dogs: A Step-by-Step Visual Guide",
  "steps": [
    {
      "title": "Trim a length of 2 by 4 in (5.1 by 10.2 cm) wood to make the base and the upright for your stand.",
      "content": "Trim a length of 2 by 4 in (5.1 by 10.2 cm) wood to make the base and the upright for your stand. Use a handsaw, jigsaw, or circular saw to cut a 2 by 4 in (5.1 by 10.2 cm) piece of lumber to be 40 in (100 cm) in length. Then, cut another piece that is 28 in (71 cm) long for the upright. Use a measuring tape and pencil to make sure your measurements are exact. [1] X Research source Use clamps to hold the wood in place while you are cutting it. This will help ensure that your cuts are perfectly straight. If you are using an electric saw, make sure you follow the recommended safety procedure outlined in the manual for your saw. Wear protective eyewear and keep your hands away from the blade at all times. The “upright” is the piece of wood which will stand upright on your seesaw base. It is the piece of wood which is 28 inches (71 cm) in length, with the 40 in (100 cm) piece being the base."
    },
    {
      "title": "Line up the face of the upright with the middle of the base.",
      "content": "Line up the face of the upright with the middle of the base. Turn the 40 in (100 cm) length of wood to sit on the 2 in (5.1 cm) wide face. Mark a point 20 inches (51 cm) from one end of the wood. Set the other piece of wood perpendicular to the base, centering it in front of the mark you made in the middle of the wood. [2] X Research source The 2 pieces of wood should look like an upside down letter “T”, with the upright sitting behind the base rather than on top of it."
    },
    {
      "title": "Use wood glue to hold the upright to the base.",
      "content": "Use wood glue to hold the upright to the base. Use a base piece as a ruler to mark a line on the outside of the upright. Pull the upright away from the base and coat the area below the line with a thin layer of wood glue. Press the 2 pieces back together, making sure the bottom sides of each are flush with the ground. [3] X Research source It might help to use a clamp to hold the 2 pieces of wood together as the glue dries. For the best results, use waterproof wood glue designed for outdoor use. It should be available online or at your local hardware store."
    },
    {
      "title": "Screw the upright to the base.",
      "content": "Screw the upright to the base. While the glue will help keep the 2 pieces of wood together, they will need to be held more tightly to work as a reliable base for your seesaw. Use an electric drill to screw at least 2 3 in (7.6 cm) wood screws through the upright and into the base of your stand. [4] X Research source To keep the screws spaced perfectly, place them 1 inch (2.5 cm) from the edges of the wood in opposite corners. However, as long as you have more than 1 screw through the wood, the exact spacing shouldn't matter too much. To make sure the screws go in straight, drill a pilot hole first. Use a drill bit a little bit smaller than the thickness of your chosen screw to drill a 1 inch (2.5 cm) hole into the wood. The more screws you use, the more secure the stand of your base will be. In most cases, 2 screws installed diagonally from each other will be enough to hold the stand steady. You could also use nails to hold the upright to the stand, but they are often more difficult to work with."
    },
    {
      "title": "Saw 2 lengths of 2 by 4 in (5.1 by 10.2 cm) wood to make supports.",
      "content": "Saw 2 lengths of 2 by 4 in (5.1 by 10.2 cm) wood to make supports. These pieces will be the diagonal supports opposite the 2 right angles on each side of your upright. Measure and mark out 2 30 in (76 cm) lengths of 2 by 4 in (5.1 by 10.2 cm) wood, and cut them to length with a hand or electric saw. [5] X Research source Once you measure and cut 1 piece of wood, you can use it as a guide to cut the other piece. The pieces of wood don't need to be exactly 30 inches (76 cm) long, but should be between 26 and 32 inches (66 and 81 cm). It is more important that the 2 lengths of wood are the same size so your base remains even."
    },
    {
      "title": "Cut a 45-degree angle at each end of the 2 pieces of wood you've just cut.",
      "content": "Cut a 45-degree angle at each end of the 2 pieces of wood you've just cut. Use a protractor or another similar tool to measure and mark a 45-degree angle at each end of each of your supports. Use a handsaw, jigsaw, or miter saw to cut through the mark, starting at the bottom corner of the wood and ending roughly 4 inches (10 cm) along the top edge. [6] X Research source Your cut lengths of wood should be very long isosceles trapezoids. This means they will have 2 parallel sides, one of them being shorter than the other due to the angled edges. The cuts should go in opposite directions, both moving towards the top center of the wood."
    },
    {
      "title": "Glue and screw the supports between the base and the upright.",
      "content": "Glue and screw the supports between the base and the upright. Glue the 2 wooden supports so they sit flush against the side of the upright and the inside face of the base. Use 2 3 in (7.6 cm) wood screws to hold the bottom of the support to the base. Drill another screw through the side of the support and into the side of the upright. [7] X Research source Make sure that the screw that goes through the support and into the upright remains centered in both pieces of wood. If your screw is misaligned, you may risk cracking the wood. Drill pilot holes into the wood beforehand to make inserting the screws easier."
    },
    {
      "title": "Repeat the same process to make a second stand.",
      "content": "Repeat the same process to make a second stand. In order to create a steady base, you will need 2 identical stands that mirror each other. Cut some more wood to the same length and assemble it in the same fashion as your first stand to create another. [8] X Research source Your stands will need to be almost perfectly identical. If they are too different, your seesaw may not sit evenly on the base, or it may break more easily. When finished, the 2 stands should be a mirror image of the other. Sit them so the uprights are facing inwards toward each other, with the base pieces sitting on the outside."
    },
    {
      "title": "Cut 2 pieces of 2 by 4 in (5.1 by 10.2 cm) wood to connect the stands.",
      "content": "Cut 2 pieces of 2 by 4 in (5.1 by 10.2 cm) wood to connect the stands. Use a measuring tape or ruler to measure out and mark 2 17 in (43 cm) lengths of 2 by 4 in (5.1 by 10.2 cm). Use a hand or electric saw to cut the 2 pieces to length, keeping the cuts as straight as possible. [9] X Research source Use a clamp to hold the wood perfectly still as you cut it. Make sure that the 2 pieces of wood are the same length. To make this easier, cut and measure 1 piece of wood to use as a guide when cutting the second length."
    },
    {
      "title": "Place the 2 pieces of wood you've just cut on either side of one upright.",
      "content": "Place the 2 pieces of wood you've just cut on either side of one upright. Turn one of the stands towards your body, with the sides of the upright exposed. Place 1 piece of wood on either side of the upright, pressing it right into the corner between the upright and the base. [10] X Research source Make sure the 2 pieces of wood sit flush against the side of the base and the bottom of the stand."
    },
    {
      "title": "Glue and screw the wood into the uprights.",
      "content": "Glue and screw the wood into the uprights. Coat the side and end of both pieces of wood with a thin layer of wood glue and press them back into place. Use an electric drill to drill 2 3 in (7.6 cm) wood screws through each piece of wood and into the upright. [11] X Research source Drill the 2 screws into the wood on a diagonal from each other. To make sure you don't hit 1 screw with another from the other side, use the opposite diagonal for the other side."
    },
    {
      "title": "Connect the loose end of the wood to the other upright.",
      "content": "Connect the loose end of the wood to the other upright. Position the other stand so the upright is parallel with the upright on the other stand. Move the second stand into place between the 2 pieces of wood so that it is identical to the first stand. Use the same method as the first stand to glue and screw the base together. [12] X Research source The upright should fit perfectly between the 2 pieces of wood. This should create a single seesaw base. The fulcrum with the seesaw board will sit between the 2 uprights."
    },
    {
      "title": "Cut a piece of 2 by 12 in (5.1 by 30.5 cm) wood to make the seesaw plank.",
      "content": "Cut a piece of 2 by 12 in (5.1 by 30.5 cm) wood to make the seesaw plank. The planks for an official dog agility seesaw are usually 12 feet (3.7 m) in length. Purchase a long 2 by 12 in (5.1 by 30.5 cm) plank of wood online or from your local hardware store. If the plank isn't the right length, measure it and trim it to size with a handsaw or jigsaw. In some longer planks, the wood will begin to crack towards the end. To prevent this from happening with your seesaw plank, purchase a piece of wood that is 14 feet (4.3 m) long and trim 1 foot (0.30 m) off of each end to remove and halt any cracking. Avoid using pressure-treated wood for your plank, as it will be too heavy. If you need to waterproof the plank, paint it with waterproof paint or sealant."
    },
    {
      "title": "Mark a line 2 inches (5.1 cm) from the mid-point of the plank.",
      "content": "Mark a line 2 inches (5.1 cm) from the mid-point of the plank. The seesaw is a one-way obstacle on an agility course, meaning one end should always be lower than the other when not in use. Use a measuring tape to find the mid-point of the plank. Move 2 inches (5.1 cm) towards one end of the plank and draw a line to mark the fulcrum. [13] X Research source Moving the fulcrum of the plank closer to one end will make sure that the longer side always sits on the ground when the seesaw isn't in use. If you move too far away from the mid-point, the plank may fall too slowly as your dog walks over it, or it may begin to lift up while your dog is still on it. Don't make the mark more than 2 inches (5.1 cm) from the center of the plank."
    },
    {
      "title": "Screw 3 3⁄4 in (1.9 cm) pipe straps along the marked line on the plank.",
      "content": "Screw 3 3 ⁄ 4 in (1.9 cm) pipe straps along the marked line on the plank. Measure along the marked line of your plank to find the middle. Place a 3 ⁄ 4 inch (1.9 cm) pipe strap on the mid-point and screw it into place with 2 1 in (2.5 cm) wood screws. Attach 2 more pipe straps along the same line, roughly 4 inches (10 cm) away from the first strap. [14] X Research source The pipe straps will be used to hold the pipe that works as a fulcrum for your seesaw. Pipe straps should be available online or from your local hardware store. If you can't find 3 ⁄ 4 inch (1.9 cm) pipe straps, you could also use 1 ⁄ 2 inch (1.3 cm) straps that aren't screwed into the plank as tightly. To make sure the pipe fits in the pipe straps properly, place it on the line you have marked across the plank and screw in the pipe straps over the top of it. They should be loose enough that the pipe can still turn freely in the straps."
    },
    {
      "title": "Mark 4 points along each upright to change the height of your seesaw.",
      "content": "Mark 4 points along each upright to change the height of your seesaw. By changing the height of the fulcrum in your seesaw, you change how difficult it is to get over. Use a measuring tape to mark 4 points along one of your uprights, noting the measurements as you go. Repeat the same process on the other side, making sure the marks are identical. [15] X Research source The standard heights for a dog agility seesaw are 8 inches (20 cm), 12 inches (30 cm), 18 inches (46 cm), and 24 inches (61 cm) from the ground. The lower heights can be used to train your dog, building its confidence towards the 24 in (61 cm) standard for most dog agility competitions. If you want to use different measurements or mark a different number of points, you can easily do so. Make sure that the space between your marks remains at least 3 inches (7.6 cm) thick, and that the height of the holes is identical between the 2 sides of your base. By moving the pipe on your plank between these points, you can change the height of your seesaw. Making the fulcrum of your seesaw higher will also make the plank steeper to walk on."
    },
    {
      "title": "Drill a 1 inch (2.5 cm) hole through the center of each mark.",
      "content": "Drill a 1 inch (2.5 cm) hole through the center of each mark. Attach a 1 in (2.5 cm) paddle or spade bit to your electric drill. Place the point of the bit against the first point you marked and begin drilling through it to make a 1 in (2.5 cm) hole. Repeat the same process for each of the marks you made on both of the uprights."
    },
    {
      "title": "Thread a 1⁄2 inch (1.3 cm) galvanized pipe through the holes and pipe straps.",
      "content": "Thread a 1 ⁄ 2 inch (1.3 cm) galvanized pipe through the holes and pipe straps. Purchase a piece of 1 ⁄ 2 inch (1.3 cm) galvanized pipe that is roughly 18 inches (46 cm) in length. Use 1 hand to hold the plank so the pipe straps line up with 1 set of holes in your uprights. Thread the pipe into one hole, through the pipe straps, and out the opposing hole. [16] X Research source Once the pipe is in place, you should have a fully assembled and functional dog agility seesaw! At this point, you can leave the seesaw as it is and it will still work. However, it will be better protected and easier to use if you paint it properly and make the plank less slippery. If your plank is too heavy, it may be difficult to adjust the height of the seesaw. Ask a friend or someone nearby to help hold the plank while you thread the pipe through. Make sure you use a galvanized pipe, as other piping may not be strong enough to hold the weight of the plank and your dog."
    },
    {
      "title": "Mark the contact areas on each side of your seesaw plank.",
      "content": "Mark the contact areas on each side of your seesaw plank. The size of the contact area on each end of your plank varies between different dog agility associations. Measure the length of an appropriate contact area from each end of your plank and mark it with a pencil line. Here are a few examples of different contact area specifications. The USDAA requires a contact area of 36 inches (91 cm). The AKC requires a contact area that is 42 inches (110 cm) in length. If you're not using your agility seesaw to practice for an official competition, the contact area can be anywhere between 32 to 46 inches (81 to 117 cm). Make sure it is the same on both ends of the plank to keep it looking even. The contact area is the space at each end of your seesaw with which your dog must make contact to consider the obstacle completed. This ensures that your dog walks from one end of the seesaw to the other, rather than jumping on and off in the middle."
    },
    {
      "title": "Paint each contact area with an even coat of paint.",
      "content": "Paint each contact area with an even coat of paint. Choose a latex or oil-based paint that is designed for outdoor use. Use a paintbrush or paint roller, cover the contact area on both ends of the board with a thin coat of paint. [17] X Research source Use a few bricks or a cinderblock to keep the ends of the seesaw from touching the ground while you paint it. Most standard dog agility seesaws make the contact area bright yellow so that dogs can see it more easily. To keep the lines between the contact area and the rest of the seesaw straight, wrap the edge of your contact area with masking or painter's tape."
    },
    {
      "title": "Cover the unpainted area with a coat of paint in a contrasting color.",
      "content": "Cover the unpainted area with a coat of paint in a contrasting color. To keep your seesaw visually interesting for yourself and your dog, choose a color that contrasts with the paint for your contact areas to cover the rest of the board. Use latex or oil-based paint that is waterproof, applying a thin coat to the plank with a paintbrush or roller. [18] X Research source Standard dog agility seesaws will usually be yellow on each end and blue in the middle."
    },
    {
      "title": "Leave the paint to dry for 3 to 4 hours.",
      "content": "Leave the paint to dry for 3 to 4 hours. Once you've painted your seesaw, leave it to sit in the sun for around 3 hours to allow the paint to dry. Keep the seesaw from moving as it dries, as anything that touches it might ruin your coat of paint. Check the manufacturer's instructions on your specific brand of paint for more information on the expected drying times."
    },
    {
      "title": "Add another coat of paint to both sections of the plank.",
      "content": "Add another coat of paint to both sections of the plank. Use a clean paintbrush or roller to apply another coat of your chosen paint colors to each section of the seesaw plank. Work quickly to stop the paint from drying as you shift between each color. [19] X Research source Make sure the first coat of paint is dry before adding a second coat."
    },
    {
      "title": "Sprinkle the plank evenly with play sand.",
      "content": "Sprinkle the plank evenly with play sand. Adding a layer of sand to the wet paint will stop the plank from being slippery. While the paint is still wet, use your hands to begin sprinkling a thin layer play sand over the board. Continue adding sand until the board is evenly coated in a fine layer. [20] X Research source A 10 lb (4.5 kg) bag of play sand should be plenty to cover your seesaw. The exact amount needed will vary based on how liberally you apply it. Play sand is fine and sterile sand usually used for sandpits or something similar would also work. Large bags of play sand should be available from your local hardware store. Start adding sand to the board from the lower end of the seesaw. Otherwise, the weight of the sand might cause the board to move and damage your paint job."
    },
    {
      "title": "Brush away excess sand once the paint has dried.",
      "content": "Brush away excess sand once the paint has dried. Leave the sanded paint to sit in the sun to dry for another 3 to 4 hours. When the paint is dry to the touch, use your hands to begin gently brushing away any sand that hasn't adhered to the coat of paint beneath it. [21] X Research source Make sure that the sand you brush away is taken off of the seesaw, rather than just pushed to a different section of it."
    },
    {
      "title": "Add a third coat of paint and leave it to dry fully.",
      "content": "Add a third coat of paint and leave it to dry fully. A third and final coat of paint will cover up some of the color of the sand, without taking away the extra grip that it adds to the seesaw. Use a paintbrush or roller to add another coat of paint to each of the areas of your seesaw. Leave it to dry for 3 to 4 hours before touching it again. [22] X Research source Make sure you give the final coat of paint plenty of time to dry before using the seesaw."
    },
    {
      "title": "Remove the seesaw plank if you want to paint the base.",
      "content": "Remove the seesaw plank if you want to paint the base. If you want to improve the look of the base of your seesaw, you can paint it with the same type of paint used for the middle of the board. Take out the pipe and remove the plank from the base. Paint the base with a paintbrush, making sure to get into every area to coat it evenly. Leave the paint to dry fully before reattaching the plank and pipe. [23] X Research source If you want to do more than 1 coat, make sure the paint is dry before applying another layer. Make sure the paint is given plenty of time to dry. Even slightly wet paint may be easily damaged as you try to put the plank back in place."
    }
  ]
}