{
  "url": "https://www.wikihow.com/Build-a-Hip-Roof",
  "title": "How to Build a Hip Roof",
  "steps": [
    {
      "title": "Measure the building to calculate the length of your rafters.",
      "content": "Measure the building to calculate the length of your rafters. For a quick and easy approach, measure the width and height of all 4 walls using a laser distance measuring device. To use the tool, simply point it at 1 end of a wall and click the button. Then point it at the far end of the same wall, and push the button again to see the measured distance. If you don’t have a laser distance measuring device, you can use an ordinary tape measure to find the dimensions of your building’s walls. You can purchase a laser distance measuring device (and a tape measure) at a large hardware store. If you already know the measurements of the building (e.g., if it’s a small shed that you built), you can skip this step."
    },
    {
      "title": "Calculate the length of each of your common rafters.",
      "content": "Calculate the length of each of your common rafters. Once you’ve measured the width of your building, divide that number by 2 (since each rafter only covers half the roof). Subtract the width off the ridge board. Then, calculate the roof pitch by writing down the number of inches that the roof is elevated vertically over the height of the roof. Use these measurements to calculate the length of each rafter using an online roofing calculator. For rafters on the short ends of the building, you’ll need to subtract the length of the ridge board from the total length of the building. This will indicate how long each of the long, lengthwise common rafters should measure. Find a roofing calculator online at: https://www.roofcalc.org/roof-rafter-calculator/ ."
    },
    {
      "title": "Mark the location where you’ll cut each of the common rafters.",
      "content": "Mark the location where you’ll cut each of the common rafters. Using a carpenter’s framing square, mark the angled plumb line with a pencil at the end of a wood plank to find the place where you’ll make the ridge cut (the cut at the top of the rafter). Then, use your pencil to make a mark at the framing square’s 1 ft (0.30 m) notch. Mark this increment on each rafter. [1] X Research source Common rafters are those which run from the top of the wall to the top of the roof and connect to the ridge beam."
    },
    {
      "title": "Mark the birdsmouth location on the rafters.",
      "content": "Mark the birdsmouth location on the rafters. The birdsmouth is the name for a gap you carve out of the rafter so it can fit on top of the building’s wall. To find the location where you’ll cut the birdsmouth, use the triangular part of the carpenter’s square and trace it onto the plank of wood with a pencil. [2] X Research source Mark the birdsmouth cut location on all common rafters, jack rafters, and hip rafters."
    },
    {
      "title": "Cut the common rafters",
      "content": "Cut the common rafters to length using a round saw. Use the first rafter as a pattern for the rest. Use a round saw to cut the same patterns from the rest of the rafters. You should have enough common rafters so that there is one every 20 inches (51 cm) along the walls of the house. To figure how many rafters you’ll need, measure the length of the 4 walls and divide the total length in inches by 20."
    },
    {
      "title": "Make the birdsmouth cuts in your common rafters.",
      "content": "Make the birdsmouth cuts in your common rafters. Use the framing square to find where the jack rafter’s plumb cuts will connect to the hip. The depth of the seat cut should be equal to the thickness of the wall you’re installing the rafter on. When you have the length of the jack rafters, use a round saw to cut the seat and shoulder cuts. [3] X Research source A birdsmouth cut has 2 parts: a horizontal cut (called the seat cut) and a vertical cut (called a shoulder cut). The seat rests on top of the wall that you’re attaching the particular rafter to, while the shoulder cut parallels the wall and allows several inches of each rafter to overhang the roof."
    },
    {
      "title": "Attach 4-6 centering rafters and lift the ridge beam into place.",
      "content": "Attach 4-6 centering rafters and lift the ridge beam into place. The first step in the process of erecting the hip roof is to get the ridge beam into place at the top of the roof. Place the 4-6 common rafters in their designated positions along the 2 longest walls, and nail them firmly to the wall with a nail gun. Then, lift the ridge beam to the correct height. [4] X Research source Centering rafters are common rafters that are used to steady the ridge beam."
    },
    {
      "title": "Nail the ridge beam between the centering rafters.",
      "content": "Nail the ridge beam between the centering rafters. Set 5-6 more common rafters in place and nail them to the walls of the structure. These additional centering rafters will support the ridge beam and prevent it from collapsing. Once the extra common rafters are in place, use your nail gun to drive 1 nail through the top of each common rather and into the ridge beam. [5] X Research source For the sake of safety and practicality, ask 2 or 3 friends or family members to help you when you’re installing the ridge beam. These helpers can hand the rafters to you as you attach them."
    },
    {
      "title": "Attach the 6 king common rafters at the end of the ridge board.",
      "content": "Attach the 6 king common rafters at the end of the ridge board. King common rafters keep the ridge board steady in place. Nail one rafter on each side of the hip roof to brace the ridge board in place. Then, nail the king rafters in place against the ridge board. King common rafters are the common rafters closest to the hip rafters. There are 6 of these rafters on every hip roof. King common rafters are structurally identical to the other common rafters."
    },
    {
      "title": "Nail the hip rafters to the ridge beam and the corners of the walls.",
      "content": "Nail the hip rafters to the ridge beam and the corners of the walls. Lift the hip rafters into place once the ridge board is firmly in position. When you attach the hip rafters, nail them in place at the bottom first before nailing the top against the ridge beam. As you attach the hip rafters, attach a ceiling joist next to each one for extra support. [6] X Research source Hip rafters are the 4 long, diagonal rafters that attach to the ends of the ridge beam and to the corners of the structure."
    },
    {
      "title": "Nail the rest of the common rafters to the ridge beam.",
      "content": "Nail the rest of the common rafters to the ridge beam. Measure carefully so that each common rafter is spaced exactly 20 inches (51 cm) from the adjacent common rafters. The common rafters and ridge beam should now stand solidly on their own. [7] X Research source Most hip roofs only have 1 common rafter on the side of the roof built off of the short walls."
    },
    {
      "title": "Nail the jack rafters to the hip rafters and secure them to the walls.",
      "content": "Nail the jack rafters to the hip rafters and secure them to the walls. Depending on the size of the roof, most hip roofs will have 4-6 short jack rafters that are spaced out every 20 inches (51 cm) between the hip rafters and the king common rafters. Measure the distance between the angled hip rafter and the top of the wall at 20 in (51 cm) increments and cut jack rafters to fit. Then use your nail gun to attach the jack rafters to the hip rafter and wall. [8] X Research source Jack rafters run from the top of the structure’s wall to the angled hip rafter, parallel to the common rafters."
    },
    {
      "title": "Determine the number of plywood sheets you’ll need.",
      "content": "Determine the number of plywood sheets you’ll need. Begin by measuring the width and height of each of the 4 sides of the roof. Once you've made these measurements, multiply the length of each of the 4 sides by its height to find the area. Add the areas of all the sides together to calculate the total area of the roof. To find how many plywood sheets you'll need, measure a sheet of sheathing and multiply its length by its height to find the area. Finally, divide the area of the whole roof by the area of one plywood sheet to figure out the number of sheets you’ll need. For example, say that 2 of the sides of your hip roof measure 6 feet (1.8 m), 2 sides measure 10 feet (3.0 m), and the roof is 3 feet (0.91 m) high. The total length is then 32 feet (9.8 m), and the total area of the roof is 96 square feet (8.9 m 2 ). Then, if the plywood sheets are each 20 square feet (1.9 m 2 ), divide 96 by 20 to calculate that you’ll need 4.8 sheets of plywood. If the final calculation doesn't result in a whole number, round up to the nearest whole number. In our example, you’d need to purchase 5 sheets."
    },
    {
      "title": "Nail the plywood sheathing to the rafters.",
      "content": "Nail the plywood sheathing to the rafters. Sheathing goes onto a roof prior to the final roofing material (e.g., shingles). Pick a corner to start placing the plywood sheathing. Use nails to tack the sheet in place on the rafters to hold it in place while you work. To make sure the first sheet of wood straight, tack up a second sheet next to it. Make sure the sheets are in line with the fascia so that the sheathing boards remain flat and level. The fascia are the straight, long boards that run along the top of a wall beneath the bottom edge of the roof. It’s attached to roof trusses."
    },
    {
      "title": "Attach asphalt shingles or other desired roofing material.",
      "content": "Attach asphalt shingles or other desired roofing material. Many homes have asphalt shingles that are made from fiberglass and asphalt. These are the easiest and cheapest shingles to install. Plan to use at least 3 packages of shingles, and also a roll of underlayment and a roll of flashing. You’ll use asphalt cement to hold the shingles in place and prevent water from leaking into the interior of the building. You can purchase asphalt shingles and other roofing materials at a local hardware store or home-improvement store."
    }
  ]
}