{
  "url": "https://www.wikihow.com/Clean-Wooden-Bowls",
  "title": "How to Clean Wooden Bowls",
  "steps": [
    {
      "title": "Wash the bowl by hand with warm, soapy water.",
      "content": "Wash the bowl by hand with warm, soapy water. Grab a soft washcloth or a soft sponge and put a few drops of mild dish soap on it. Soak the cloth or sponge with hot water and wipe the bowl down thoroughly inside and outside. [1] X Expert Source Melanie Garcia Professional House Cleaner Expert Interview. 10 October 2019. In the process, don’t submerge or soak the bowl in the water. [2] X Expert Source Jon Gholian Cleaning Specialist Expert Interview. 3 December 2020. Wooden bowls absorb water easily, which is why you shouldn’t soak or submerge them. It’s important, for the same reason, that you never put wooden bowls in the dishwasher. [3] X Expert Source Jon Gholian Cleaning Specialist Expert Interview. 3 December 2020. Don’t use a scrubbing pad or steel wool unless your bowl has a tough buildup. Soft cloths and sponges are enough for basic cleaning. Wash the bowl right after you use it to ensure stains don't set in. [4] X Expert Source Jon Gholian Cleaning Specialist Expert Interview. 3 December 2020."
    },
    {
      "title": "Rinse the bowl with warm water.",
      "content": "Rinse the bowl with warm water. After a quick but thorough wash, rinse the entire bowel with hot water. Be sure not to submerge the bowl in the water when you rinse it. It’s important to get all of the soap off of the bowl so it doesn’t get scummy. [5] X Research source Try to rinse the bowl in about five seconds rather than letting it linger in the running water."
    },
    {
      "title": "Dry the wooden bowl with a clean towel.",
      "content": "Dry the wooden bowl with a clean towel. Wipe the entire bowl down with a clean, dry towel to remove as much of the moisture as you can. [6] X Expert Source Melanie Garcia Professional House Cleaner Expert Interview. 10 October 2019. Because wood retains water easily, you will not be able to get it completely dry with a towel. Just make sure that it is only slightly damp when you finish. [7] X Research source It may help to press the towel into the bowls more than you would when drying other materials. The pressure will draw some of the moisture out."
    },
    {
      "title": "Set the bowl in a drying rack to finish drying.",
      "content": "Set the bowl in a drying rack to finish drying. After drying the bowl with a towel, put the bowl in a drying rack and allow it to sit until it is completely dry. [8] X Expert Source Melanie Garcia Professional House Cleaner Expert Interview. 10 October 2019. You may need to let the bowl sit overnight to dry completely. Check the bowl after a few hours if you don’t want to leave it overnight. [9] X Expert Source Jon Gholian Cleaning Specialist Expert Interview. 3 December 2020. Don’t put a wooden bowl that is still wet into the cabinet, as this might keep it from drying completely and can ruin the bowl or cause mildew."
    },
    {
      "title": "Give wooden bowls a deep clean with salt and lemon.",
      "content": "Give wooden bowls a deep clean with salt and lemon. Every so often, your wooden bowls can use a deeper clean than soap and water. Pour some coarse (large grain) salt into the bowl. Cut a lemon in half, and rub the juicy pulp over the surface of the bowl. Briefly wash with hot water and mild dish soap after scrubbing. [10] X Research source Lemon juice is commonly used as a disinfectant and the salt provides a slight abrasion to the bowl’s surface. A lime can be used, also, and regular table salt will have a similar effect. Scrub the outside of the bowl, too."
    },
    {
      "title": "Disinfect wooden bowls with vinegar and water.",
      "content": "Disinfect wooden bowls with vinegar and water. [11] X Expert Source Melanie Garcia Professional House Cleaner Expert Interview. 10 October 2019. Mix three tablespoons (44.4 ml) of white vinegar into one cup (240 ml) of hot water. Dip a washcloth into the mixture and rub the entire surface of the bowls with the solution. Let the vinegar sit for five minutes, then follow the standard washing procedure afterward. [12] X Research source Depending on how often you use the bowls, disinfect them after every five uses or so."
    },
    {
      "title": "Use fine-grit sandpaper to gently buff away buildup.",
      "content": "Use fine-grit sandpaper to gently buff away buildup. If you have been using your bowls for years, they may develop stuck-on residue. Take fine-grit sandpaper and gently rub it with the grain of the wood. This will remove a thin layer of buildup. Sand a little bit out from the bad spot to blend it in with the rest of the bowl. [13] X Research source You only need to sand the area that has a lot of buildup, not the entire bowl, but if the entire bowl has buildup, it’s okay to lightly sand the whole thing. Remember, you only want to buff away the extra, non-wood layer that has developed. Don’t apply so much pressure that you start taking off wood."
    },
    {
      "title": "Buy food grade mineral oil.",
      "content": "Buy food grade mineral oil. Wooden bowls can become dry and may eventually crack, so it is important to treat them with oil sometimes. When you’re looking for oil at the store, make sure it is labeled as food grade. You may also find mineral oil that specifically says it is for cutting boards, butcher blocks, or wooden dishware. [14] X Research source You may find mineral oil that is not specifically labelled as food grade. Some of this is safe for consumption and some of it isn’t. If you’re unsure, look for “white mineral oil,” as this is the kind that has been refined enough for consumption."
    },
    {
      "title": "Wipe the entire surface of the bowl with mineral oil.",
      "content": "Wipe the entire surface of the bowl with mineral oil. Take a clean, dry paper towel and pour a small circle of mineral oil onto it. Wipe the bowl completely, inside and outside, with the mineral oil. Apply the oil in some kind of pattern to make sure you don’t mis any spots. [15] X Research source Don’t be afraid of putting too much oil on the bowl. If it seems like the first application soaked into the bowl, put a second, or even third, coat onto it. Depending on how much you use your bowls. Treat them with mineral oil every couple of months or at least two times a year."
    },
    {
      "title": "Let the bowl sit overnight.",
      "content": "Let the bowl sit overnight. Set the bowl on a clean spot on the counter or table and leave it overnight. The oil will soak partially into the wood, moisturizing it and coating the surface. If you are in a hurry, try to let the oil sit for at least 30 minutes. [16] X Research source Allowing the mineral oil to sit for a short time will still help the bowls last, but not as well as letting the oil soak in for longer."
    },
    {
      "title": "Wipe the excess oil off of the bowl with a clean paper towel.",
      "content": "Wipe the excess oil off of the bowl with a clean paper towel. After the bowl has sat and soaked in most of the oil, take another dry paper towel and wipe the entire surface of the bowl. There will be some oil that doesn’t soak into the wood, and it is best to remove this excess. Discard the paper towel afterward. Put them back in the cabinet for later use, or go ahead and use them now. The purpose of using food grade oil is that it’s safe for consumption."
    }
  ]
}