{
  "url": "https://www.wikihow.com/Become-a-Better-Basketball-Shooter",
  "title": "How to Become a Better Basketball Shooter",
  "steps": [
    {
      "title": "Practice catching in a shot-ready position.",
      "content": "Practice catching in a shot-ready position. Catching the ball in a shot-ready (or athletic) position is a good way to improve your form. By being ready to shoot the ball when you catch it, rather than getting ready to shoot the ball after you catch it, you can improve the speed and accuracy of your shots. [1] X Research source To get into a shot ready position, bend your knees slightly and hinge your body forward at the hips. You should look as if you are getting ready to jump in the air. This will provide you with some extra power when you make your shot. Having good form and being confident are the most important things you can do to improve your shot percentage. [2] X Expert Source Ryan Tremblay Basketball Coach Expert Interview. 13 November 2020."
    },
    {
      "title": "Identify your most comfortable shot pocket.",
      "content": "Identify your most comfortable shot pocket. Your shot pocket is the position where you shoot the ball from and this is different for everyone. Try to identify the most comfortable shot pocket position for you and stick with that position. [3] X Research source For example, you might feel most comfortable shooting from the center of your forehead, to the right of your head, or slightly above your head. Keep in mind that you don’t need to have the same shot pocket that other players do. Focus on what seems to work best for you."
    },
    {
      "title": "Position yourself.",
      "content": "Position yourself. The position of your arm, hand, and head can also influence the accuracy of your shots. Your shooting arm and hand should form a “C” shape when you are getting ready to shoot the ball. You can check yourself in a mirror or have a friend check you from the side. [4] X Research source Make sure that you are looking straight ahead as well. Keep your elbows bent and lift the ball above your nose before you release it. [5] X Expert Source Ryan Tremblay Basketball Coach Expert Interview. 13 November 2020."
    },
    {
      "title": "Follow through and hold.",
      "content": "Follow through and hold. When you shoot the ball, make sure that you follow through with your shot by snapping your elbow. Then, hold the position until the ball makes contact with the hoop and/or net. Following through and holding after you shoot the ball will help to improve your shot accuracy. [6] X Expert Source Ryan Tremblay Basketball Coach Expert Interview. 13 November 2020. Follow through with your body as well. Begin your shot in an athletic position, then spring up off of the floor as you shoot the ball. [7] X Expert Source Ryan Tremblay Basketball Coach Expert Interview. 13 November 2020. Keep your body in this extended position after you make the shot."
    },
    {
      "title": "Stand on one leg.",
      "content": "Stand on one leg. To do an elbow drill, you will need to start by making shots standing on one foot. Standing on one foot will help to improve your balance and it will increase the difficulty of your shots as well. Start by standing near the foul line and making a shot standing on one foot. [8] X Research source You can stand on your left or right leg to start, but make sure that you switch legs halfway through your drill. Don’t just practice making shots on one leg."
    },
    {
      "title": "Hold the ball with both hands.",
      "content": "Hold the ball with both hands. Standing on one foot should add enough of a challenge to start things off, so use both hands to make your shots when you first start doing elbow drills. [9] X Research source Make sure that you keep your elbows in and point your fingers towards the center of the hoop as you make your shots. Also, remember to find your shot pocket, create a “C” shape, and follow through after you shoot."
    },
    {
      "title": "Change spots as you shoot the ball.",
      "content": "Change spots as you shoot the ball. Shooting in one position may help you to master shooting from that spot, but it is a good idea to practice shooting from varied positions. Try to cycle through some different shooting positions to challenge yourself in different ways. [10] X Research source For example, you could start out at the foul line, then move in and to the left of the hoop, then move to the right of the hoop, and then repeat the cycle."
    },
    {
      "title": "Increase the difficulty when you feel ready.",
      "content": "Increase the difficulty when you feel ready. Move onto one-handed shots when you feel ready to increase the difficulty of your drills. Make sure that you use good form like you did with your two-handed shots. You may need to go slower until you perfect your form for one-handed shots. [11] X Research source If your form is really suffering as a result of switching to one-handed shots, then you can always return to two-handed shots."
    }
  ]
}