{
  "url": "https://www.wikihow.com/Choose-Men%27s-Dress-Shoes",
  "title": "How to Choose Men's Dress Shoes",
  "steps": [
    {
      "title": "Look at and feel the leather.",
      "content": "Look at and feel the leather. Dress shoes made of leather are the ideal choice. Leather will be smooth but not too smooth, and may be shiny but not enough to see your reflection. Watch out for shoes that seem too shiny and have a plastic feel to them. These are not likely to be genuine leather, so avoid them. [1] X Research source You don't have to choose leather shoes, but leather lasts longer and works better with dress clothes. You don't have to match the leather with other leather pieces you're wearing. [2] X Expert Source LaTricia Brown Master Tailor & Creative Director Expert Interview. 9 July 2021."
    },
    {
      "title": "Select shoes with a moderately shaped toe.",
      "content": "Select shoes with a moderately shaped toe. Dress shoes range from squared toes to narrowly pointed toes, but neither is your best option. Look for a toe that strikes the balance between squared and pointed. This shape of toe will fit more outfits and look better overall. [3] X Research source There is no exact shape that is always right. It's more about looking for something that seems balanced between the two extremes."
    },
    {
      "title": "Pick shoes with a heel that's less than one inch high.",
      "content": "Pick shoes with a heel that's less than one inch high. Dress shoes have varying heel heights, and there is a fine line between too high and just right. The one inch mark, or a bit lower, is what you should shoot for. Otherwise, you'll appear to be wearing shoes with a lifted heel and it will take away from your overall look. [4] X Research source Most dress shoes have a heel, but some may not. Flat shoes are okay in casual settings, but formal or professional wear should have a heel."
    },
    {
      "title": "Stick to lace up shoes for formal or business professional settings.",
      "content": "Stick to lace up shoes for formal or business professional settings. When choosing dress shoes for work or a formal occasion, laces are a must. Typical lace up shoes include most Oxfords and Derbies. [5] X Expert Source LaTricia Brown Master Tailor & Creative Director Expert Interview. 9 July 2021. Slip on shoes may be easier, but laced shoes look much more professional. If you are wearing a suit, lace up shoes are a must. If you are wearing dress pants and a button up shirt but no suit jacket, you may not need lace up shoes. If you are attending a black-tie affair and are wearing a tuxedo, you'll want to wear laced shoes ."
    },
    {
      "title": "Choose slip-on shoes for business casual attire.",
      "content": "Choose slip-on shoes for business casual attire. Slip-on shoes are ideal for more relaxed settings. Wear a pair of loafers or boat shoes when you need something dressier than running shoes but a little less dressy than lace-up Oxfords. [6] X Research source These are good for summer. Slip-ons will complete a khaki shorts and polo shirt outfit. If you wear slacks and a buttoned shirt for work, you'll be fine wearing loafers. Slip-on shoes are good for a casual dinner party or similar setting, as well. Slip-ons may have tassels or a buckle. They may be smooth or have a bumpy surface like suede."
    },
    {
      "title": "Choose a pair of black shoes for the best versatility.",
      "content": "Choose a pair of black shoes for the best versatility. Black tends to go with almost every color, except brown. If your wardrobe consists of suits that are mostly black, gray, or blue, black shoes will match those best. Black shoes can also work with khaki pants or even jeans. [7] X Research source If you can only buy one pair of shoes, go with black unless your suits are only brown or tan. For the pair of shoes you'll wear most often, look for a smooth, somewhat shiny finish. It's good to have a pair of suede shoes in your collection, but not as your primary pair."
    },
    {
      "title": "Select a pair of brown shoes for backup and variety.",
      "content": "Select a pair of brown shoes for backup and variety. Brown shoes are still dress shoes, but they must be matched more carefully. Brown and tan suits look best with brown shoes, although there is great variety of shades. Pay attention to whether or not the brown shoes you select match the brown clothes you'll wear them with. Look for shoes that are a single shade of brown to make matching your clothes easier."
    },
    {
      "title": "Try on shoes in the afternoon or evening.",
      "content": "Try on shoes in the afternoon or evening. Your feet swell at least a little bit throughout the day, so don't try on shoes first thing in the morning. If you buy shoes that fit perfectly before your feet have swollen, the shoes may feel tight as the day goes on. A tight fit with slightly swollen feet will be looser with your feet at their normal size. [8] X Research source You don't want your feet to be sore and sweaty. Walk just long enough that your feet expand to their slightly larger size."
    },
    {
      "title": "Wear the type of socks you'd wear with dress shoes.",
      "content": "Wear the type of socks you'd wear with dress shoes. You want your dress shoes to have a snug fit. If you wear thick socks when you're buying the shoes and thin socks later, the shoes will feel loose. When you're choosing dress shoes, wear the socks you will most often wear with those shoes. [9] X Research source It's better to wear slightly thicker socks than socks that are too thin. Trying the shoes on with thicker socks will make sure you leave a bit of extra room."
    },
    {
      "title": "Buy a pair of shoes that fit when you first try them on.",
      "content": "Buy a pair of shoes that fit when you first try them on. Leather dress shoes will not stretch much, if at all, so you won't be able to break them in as you wear them. If the shoes feel too tight when you put them on, they will always be too tight. Only select shoes that fit just right when you buy them. [10] X Research source Walking around in the shoes will help your feet get used to the way they fit, but if your feet are uncomfortable when you put them on, they may remain uncomfortable."
    },
    {
      "title": "Walk around in the shoes to see how they feel.",
      "content": "Walk around in the shoes to see how they feel. When you find a pair you like, put on both shoes and walk around a bit. Pace the floor to get a feel for the shoes. Make a ten foot path back and forth a couple of times. Walk as you normally would. Don't change your stride because of the shoes. Don't buy shoes if you can't try them on and walk around in them. There's no way to know how the shoes fit you if you don't walk in them. If the shoes aren't comfortable and you already bought them, look for a cobbler in your area to stretch them. [11] X Expert Source LaTricia Brown Master Tailor & Creative Director Expert Interview. 9 July 2021."
    },
    {
      "title": "Buy two sizes when you order online.",
      "content": "Buy two sizes when you order online. If you can't make it to a store to try shoes on, it's helpful to buy two different sizes to make sure one of them fits. The difficulty is deciding whether to buy a size bigger than usual or a size smaller. Be sure to know your foot size as closely as possible when you order. [12] X Research source This will obviously cost more money, so take this into consideration when ordering. Unless you are in a pinch, buying dress shoes in store makes it easier to get the right shoes."
    }
  ]
}