{
  "url": "https://www.wikihow.com/Avoid-Obsessing-over-a-Guy",
  "title": "How to Avoid Obsessing over a Guy",
  "steps": [
    {
      "title": "Maintain perspective.",
      "content": "Maintain perspective. When you’re feeling uncertain or insecure, it’s easy to get caught up in the details. You might catch yourself overanalyzing every little aspect of your guy’s behavior: What did that shrug mean? Why is he laughing? Take a step back and get some perspective. Look at the bigger picture instead of stressing over every little thing. Put simply, if your crush or new guy keeps coming around, he obviously likes you. There’s no need to interpret every aspect of his behavior. Keep in mind that overanalyzing a situation is similar to making assumptions. In both situations, you are telling yourself that something is true without having any evidence that it is. This is type of behavior is unproductive, unhealthy, and may lead to low self-esteem, so it is important to avoid it. [1] X Research source"
    },
    {
      "title": "Remind yourself about the person's flaws.",
      "content": "Remind yourself about the person's flaws. Your feelings about a crush or new beau are often skewed. You may find yourself idealizing the person, only seeing the positives. Make the effort to recognize and acknowledge the person’s flaws to remind yourself that they’re not perfect. Doing this can help you stop obsessing. [2] X Research source Say aloud some of the flaws you’ve noticed about the person. This might sound like, “He’s terrible at calling me back. Plus, it annoys me that his clothes never match.” Avoid putting your boyfriend on a pedestal because this can lead to a relationship that is inauthentic and unequal."
    },
    {
      "title": "Take care of yourself.",
      "content": "Take care of yourself. If you’re obsessing about a guy, you may need to get some space from him. Shift the focus from him onto you. Pour all that energy back into yourself by engaging in self-care. [3] X Research source Set aside some time daily to do things you enjoy. You might catch up on your favorite TV show, polish your nails, or spend time with friends."
    },
    {
      "title": "Ask your crush how they feel.",
      "content": "Ask your crush how they feel. If you are unable to get perspective and just let the relationship be, then have a talk with your guy. This is basically the equivalent of doing the thing you fear. If you ask him about whatever you’re obsessing over, those thoughts won’t have power over you anymore. [4] X Research source Schedule a time when you both can talk without distractions. Try to be as specific as possible about your concerns. Bring up the subject by saying something like, “I’ve been wondering if you share the same feelings for me that I do for you. I like you and I would like to date you. How do you feel about that?”"
    },
    {
      "title": "Limit contact.",
      "content": "Limit contact. There may be something to the old saying “out of sight, out of mind.” Your ability to move on may be complicated because you are still entangled with this guy. Break off contact for a while and try to avoid seeing this person to stop obsessing. Take a mini detox from social media so you don't stalk their page. Temporarily remove their number from your phone (be sure to write it down in an address book if this is someone you plan on talking to again) so you are not tempted to call or text them. [5] X Research source"
    },
    {
      "title": "Perform a ritual to let go.",
      "content": "Perform a ritual to let go. If you’re still obsessing over a guy, chances are there are still some unresolved issues hanging around. You will need to find closure in order to fully move on and reclaim your life. Get closure by performing a ritual. There are many approaches you can try. You can box up all the memories you have of this person and trash or donate the box. Or, you might write a letter to the person sharing your feelings. Then, burn it or tear it to pieces. [6] X Research source"
    },
    {
      "title": "Date someone new.",
      "content": "Date someone new. Getting to know someone new can help you finally seal the deal of getting over an old flame. Plus, once you meet a better match, you might forget why your crush was so interesting anyway. [7] X Research source Put out feelers to see if your social circle can hook you up with someone. Join a new club or take a class to meet new people. Or, create a profile and try online dating."
    },
    {
      "title": "Set some goals.",
      "content": "Set some goals. Looking to the future can help you stop obsessing over the present or past. Plus, if you’re obsessing over a guy, that means you’re spending a lot of time thinking about them. Think about yourself and what you want for your life. Sit down and map out a few concrete goals. [8] X Research source For example, you might set a goal to save money for six months of travel. Your deadline might be one year later."
    },
    {
      "title": "Go work out.",
      "content": "Go work out. Exercise can be a great mood booster. Plus, if you're busy running, swimming or lifting weights, you'll have less time to obsess over a guy. Develop a new workout regimen of interesting exercises. Also, put together a playlist of upbeat music that helps take your mind off your crush."
    },
    {
      "title": "Get a hobby.",
      "content": "Get a hobby. Distracting yourself from obsessions is easy when you have activities that you find enjoyable. Think about some hobbies or passions that you might like to pursue. Once you come up with a few, immediately make a plan to incorporate them into your routine. [9] X Research source For example, if you want to master French cooking, enroll in a nearby class. If you want to complete a 5k, download a training schedule. To locate people in your area who share the same interests as you do, try checking a website like Meetup.com for local gatherings."
    },
    {
      "title": "Fill your calendar.",
      "content": "Fill your calendar. Having too much free time may be one of the reasons you keep obsessing. Get busy! Fill your days with interesting hobbies, meaningful work, and gathering with friends and you may completely stop obsessing over that guy. [10] X Research source Get in touch with some friends whom you’ve been neglecting. Make arrangements to get together for dinner or drinks. You might also start a volunteer commitment or take on more responsibilities in a club or organization to fill your calendar."
    },
    {
      "title": "Visualize yourself clearing out obsessive thoughts.",
      "content": "Visualize yourself clearing out obsessive thoughts. One technique for overcoming obsessive thoughts is by visualizing something else. Imagine that your thoughts are in a very dusty attic. Then, envision someone taking a broom and sweeping out all the dust and cobwebs that are intruding on your mind. Whenever your thoughts become obsessive, remind the person to “Sweep!” [11] X Research source It is important to take time to relax deeply every day, so try to set aside at least 20 minutes for yourself to do that. During this time, do something that is relaxing to you, such as listening to a guided meditation or going for a walk in nature."
    }
  ]
}