{
  "url": "https://www.wikihow.com/Being-Called-Sexy",
  "title": "What Does It Mean When a Guy Calls You “Sexy”?",
  "steps": [
    {
      "title": "He thinks you’re hot.",
      "content": "He thinks you’re hot. The most common reason a guy will call you “sexy” is because he thinks you’re downright gorgeous or sexually attractive. [1] X Research source Perhaps you’re wearing a dress that highlights your curves or smiled at him in a way that made him swoon. Either way, take “sexy” as a compliment if it’s coming from your significant other or crush—he thinks you’re out of this world!"
    },
    {
      "title": "He’s feeling flirtatious.",
      "content": "He’s feeling flirtatious. More often than not, a guy will throw out the word “sexy” if he’s feeling sexy himself. Maybe this is him trying to make a move on you. He wants to see if you’re feeling frisky, too—he’s turned on. For context, this may happen if you’re kissing, hugging, or having a flirtatious conversation."
    },
    {
      "title": "He admires your confidence.",
      "content": "He admires your confidence. Sexiness isn’t always about how you look—it’s about how you carry yourself. If a guy calls you “sexy,” it may be because he admires your confidence or attitude. He loves your ambition and bold nature—he’s attracted to how you carry yourself. [2] X Research source"
    },
    {
      "title": "He’s giving you a pet name.",
      "content": "He’s giving you a pet name. Why call you “baby,” “sweetheart,” or “honey” when “sexy” is on the table? For many guys, calling you “sexy” is simply a cute, endearing nickname used to express admiration or love. [3] X Research source If he thinks you’re attractive, he might throw “sexy” at the end of a sentence as a way to solidify your relationship and express that he wants more. For instance, he could say, “Hey, sexy. What are you doing tonight?” if he wants to spend the evening cuddling. As another example, he might say, “Hey, sexy. I loved seeing you yesterday.” This becomes an invitation, as he wants to continue flirting and playing around with you."
    },
    {
      "title": "He’s trying to make you uncomfortable.",
      "content": "He’s trying to make you uncomfortable. On rare occasions, a guy might call you “sexy” to gain power or control over you. He might play mind games, calling you “sexy” to boost your confidence, only to objectify or demean you. Think of it this way: if a guy is cat-calling you and says you’re sexy, he’s probably only focused on your body. Pay attention to how his use of “sexy” makes you feel. If you feel uneasy, he may be trying to manipulate rather than compliment you."
    },
    {
      "title": "Kiss him.",
      "content": "Kiss him. As relationship expert Shana Tibi says, if the mood feels right and you both like each other, “go for it!” Lean in for that kiss to physically say, “Yeah, I think you’re sexy too.” It also gives him confirmation that you’re okay with him calling you “sexy” and taking the relationship to the next step."
    },
    {
      "title": "Call him “sexy” back.",
      "content": "Call him “sexy” back. Toss the flirtatious compliment back at him with a sensual smirk and/or wink. Try saying something like, “Sexy? Look who’s talking,” or “I’m going to rock your world, you sexy man.” This invites him to be even more romantic and/or physical. Relationship expert Joshua Pompey suggests touching him on the arm or grabbing his hand to be more seductive when you flirt."
    },
    {
      "title": "Thank him for the compliment.",
      "content": "Thank him for the compliment. If you’re not sure what to do, smile and say thank you —he’s likely trying to compliment you after all! So, express gratitude for the remark with a simple “Thanks” or “Baby, that’s so sweet.” [4] X Research source"
    },
    {
      "title": "Express your dislike for the term.",
      "content": "Express your dislike for the term. If you don’t like being called “sexy,” don’t hesitate to tell him, especially if you like him. He won’t know he’s inadvertently offending you if you don’t speak up. Try giving him alternative pet names or phrases he can use instead, like “beautiful,” “baby,” or “angel.”"
    },
    {
      "title": "Walk away or reach out for help if you feel uncomfortable.",
      "content": "Walk away or reach out for help if you feel uncomfortable. If the person calling you “sexy” makes you feel uneasy, report the matter to someone you trust, like a friend, family member, or authority figure. This is especially important if you tell them to spot calling you “sexy” and they continue to do so. You shouldn’t have to deal with harassing behavior, no matter who the person is. [5] X Research source If you feel like your life is in danger, call the police. Always trust your instincts. It’s better to be safe than sorry."
    },
    {
      "title": "Some people like being called “sexy” while others don’t.",
      "content": "Some people like being called “sexy” while others don’t. As with any compliment or nickname, “sexy” can have a positive or negative connotation—it all depends on the situation and who you’re talking to. [6] X Research source More often than not, “sexy” is received as a compliment; however, if someone’s had a bad experience with being called “sexy,” they may find the word triggering, disrespectful, or objectifying. If you’re worried about offending someone, try using these alternative compliments: “You’re so handsome.” “You’re beautiful, you know that?” “Gosh, there’s no one finer than you.” “You have the prettiest eyes.” When gauging someone’s interest or response to being called “sexy,” relationship expert John Keegan suggests paying attention to their body language. For instance, if they tense up or subtly move away, it may not be the perfect compliment for them."
    }
  ]
}