{
  "url": "https://www.wikihow.com/Camouflage-Paint",
  "title": "How to Camouflage Paint",
  "steps": [
    {
      "title": "Choose 4-5 colors that match the surroundings you want to blend into.",
      "content": "Choose 4-5 colors that match the surroundings you want to blend into. Consider the environment where you plan on using your camouflage. Pick 4-5 paints that match the color scheme for the area you want to blend in with. If you don’t need the camouflage to blend into your surroundings, you can choose any color scheme you want, such as 4-5 shades of pinks or blues."
    },
    {
      "title": "Pick a spray paint meant for the surface you’re painting.",
      "content": "Pick a spray paint meant for the surface you’re painting. Spray paint allows you to use a light coat on your material with a soft edge so it looks more natural. Visit your local paint supply or hardware store for your paints. [1] X Research source If you can’t use spray paint, acrylic paints with a sponge applicator work fine, but it may give you harder edges."
    },
    {
      "title": "Choose a matte paint if you don’t want a glossy finish.",
      "content": "Choose a matte paint if you don’t want a glossy finish. If you plan on painting camouflage for hunting and blending in, avoid using high gloss paints since they’ll be more noticeable in the environment. [2] X Research source Some brands of spray paint offer specific colors made for camouflaging. If you’re only using camouflage as a decoration, you can use a glossy paint if you want."
    },
    {
      "title": "Lay a drop cloth underneath your painting area.",
      "content": "Lay a drop cloth underneath your painting area. Work in a well-ventilated space. Set a painter’s drop cloth on the floor so you don’t accidentally get paint on a different surface. Make sure the cloth is completely flat so it doesn’t create a tripping hazard. [3] X Research source Drop cloths can be purchased from your local hardware store. If you don’t have a drop cloth, an old bed sheet works as well. Move any objects that you can out of the space so paint doesn’t get on them by accident."
    },
    {
      "title": "Cover any areas you don’t want camouflaged with tape.",
      "content": "Cover any areas you don’t want camouflaged with tape. Use masking tape or blue painter’s tape to cover any areas you want to preserve. Cut the tape to match the shape of the area if you need to. Overlap each of the pieces of tape by half so paint can’t get through the gaps. [4] X Research source If you’re covering a large area, such as a car windshield, use plastic sheeting and secure the edges with tape."
    },
    {
      "title": "Sand and clean your painting surface.",
      "content": "Sand and clean your painting surface. Use a 400-grit sandpaper to scuff your painting surface so the spray paint adheres to the material. Work the sandpaper in small, concentric circles until your entire surface is smooth. When you’re finished sanding, use a dry cloth to wipe the surface free of debris. [5] X Research source Use a scuff pad instead of sandpaper if you have a softer or more delicate work surface such as thin metal or plastics. You only need to sand plastic if it was previously painted. If you’re painting metal, make sure to completely remove any rust ."
    },
    {
      "title": "Paint a layer of primer onto your surface and let it dry.",
      "content": "Paint a layer of primer onto your surface and let it dry. Pick an all-purpose primer safe for interior and exterior use. Hold the can of spray bonding primer 12 inches (30 cm) from your painting surface and press the button on top. Move in quick back and forth motions across the surface to coat it in a thin layer. Coat the entire surface you want to camouflage with the primer and let it dry for at least 1 hour. [7] X Research source Use spray paint outdoors or work in a well-ventilated area."
    },
    {
      "title": "Apply a base coat of the lightest color you have.",
      "content": "Apply a base coat of the lightest color you have. Hold the can 12 inches (30 cm) from your paint surface. Work in short back and forth strokes across your work surface. Overlap each stroke by at least half so primer doesn’t show through. Continue working across your work surface until it’s entirely painted. [8] X Research source"
    },
    {
      "title": "Let the first coat dry for 1 hour before applying a second coat.",
      "content": "Let the first coat dry for 1 hour before applying a second coat. Give the base coat of paint at least 1 hour to dry so as not to smear the paint. When adding the second coat, switch the direction in which you apply the paint. For example, if you painted horizontally during your first coat, paint vertically for the second. [9] X Research source Let the second coat dry for at least 30 minutes before painting."
    },
    {
      "title": "Trace irregular blob shapes on cardboard or cardstock.",
      "content": "Trace irregular blob shapes on cardboard or cardstock. Draw a series of amorphous shapes that are about 3–8 in (7.6–20.3 cm) long and 2–5 in (5.1–12.7 cm) wide. Vary the types of shapes and the sizes of each of your stencils. Leave at least 3–4 in (7.6–10.2 cm) between each of your shapes. [10] X Research source You can find traceable camo patterns here: https://www.krylon.com/content/dam/cbg-krylon/projects/plastic/krylon-projects-camouflage-outline-stencils.pdf . Use shapes and sizes that match the natural environment that you’re trying to blend in with. For example, don’t use leaf-shaped patterns if you’re making desert camouflage. The size of your shapes depends on the size of your work surface. For example, if you’re painting a toy car, make shapes that are about 1 ⁄ 4 – 1 ⁄ 2 in (0.64–1.27 cm) long."
    },
    {
      "title": "Cut the shapes out with a craft knife.",
      "content": "Cut the shapes out with a craft knife. Work slowly and carefully around the shapes you drew on the cardboard or cardstock. As you cut out the pieces, save all of the pieces so you can use them later on. [11] X Research source Set a cutting board underneath your stencils or use a workbench, or else you’ll scratch your table. You can throw out the pieces you cut out since you’ll be using the cardboard as a stencil"
    },
    {
      "title": "Hold the stencil against your surface to paint the shape.",
      "content": "Hold the stencil against your surface to paint the shape. Use the piece of cardboard or cardstock that you cut the shapes from. Hold it or use blue painter’s tape to secure it to your work surface. Paint your shapes with the second lightest color so they’re about 6 in (15 cm) apart from one another. [12] X Research source Rotate your stencils each time you apply them to give your work surface a randomized look. Make sure you only mist a thin layer of paint or else it won’t dry as smooth. The distance between shapes will change depending on the size of your work surface."
    },
    {
      "title": "Wait 20 minutes between coats.",
      "content": "Wait 20 minutes between coats. It's important to let the paint dry between colors or it could smear or end up drippy. After each color, wait at least 20 minutes before moving on to the next one. [13] X Research source"
    },
    {
      "title": "Continue layering shapes from lightest to darkest color.",
      "content": "Continue layering shapes from lightest to darkest color. Switch to the next darkest color and hold your stencil against your work surface. Slightly overlap the stencil over your existing pattern and paint a thin layer on top. Let the paint dry for 20 minutes in between each color so it doesn’t smear. Continue painting layers of patterns, working from your lighter to darker colors. [14] X Research source"
    },
    {
      "title": "Use leaves and branches as stencils to add a more natural look.",
      "content": "Use leaves and branches as stencils to add a more natural look. Pick a few small branches and leaves from plants around your home and wrap them in a bundle with string. Hold the foliage against your work surface and hold your spray paint can 12 inches (30 cm) away. Use your spray paint on the tips of your branches and leaves. When you pull the greenery away from your work surface, there will be negative space resembling the shape of the bundle. [15] X Research source Use a variety of plants, such as broad maple leaves or pine needles, to create different textures. It doesn’t matter what kinds of leaves or branches you use since camouflage is mostly used to hide the object’s original shape. You can use leaves and branches for any color camouflage."
    },
    {
      "title": "Let the paint dry for 1 hour when you’re finished.",
      "content": "Let the paint dry for 1 hour when you’re finished. Once you’ve finished painting all of your colors, let the final color dry for at least 1 hour before using or moving the object. Once the paint is dry, slowly remove the tape around the unpainted areas. [16] X Research source"
    }
  ]
}