{
  "url": "https://www.wikihow.com/Be-a-Good-Host-when-Friends-Come-to-Your-House",
  "title": "12 Tips to Be a Wonderful Host towards Your Friends",
  "steps": [
    {
      "title": "Create a comfortable and welcoming environment.",
      "content": "Create a comfortable and welcoming environment. Wipe down all the hard surfaces where your friends will be, such as doorknobs, countertops, or occasional tables. Pick up clutter, take out the trash, and maybe even light a scented candle so your home smells warm and inviting. [1] X Research source If there are going to be small children coming over, take a brief walkthrough of the areas where the kids will likely be and make sure everything's relatively childproof. Stock your bathroom with paper and toiletries. Etiquette coach Tami Claytor emphasizes that you \"want to make sure your restroom is clean.\" Have plenty of toilet paper available so your guests can easily find it if they use up the last of a roll. [2] X Expert Source Tami Claytor Etiquette Coach Expert Interview. 16 February 2022. Bottles of lotion or hand cream around the sink are a nice touch, in addition to plenty of hand soap. Disposable hand towels are also helpful if you're having several guests. That way, everyone doesn't have to dry their hands on the same damp towel."
    },
    {
      "title": "Greet your friends as they arrive and help them feel at home.",
      "content": "Greet your friends as they arrive and help them feel at home. Answer the door with a smile and thank your friends for coming. Invite them in and offer to take their coats, then introduce them around to anyone they might not know. [3] X Research source If they've brought anything over for you, be sure to thank them! You might also compliment them on something you notice."
    },
    {
      "title": "Your friends will feel more at home if they know where everything is.",
      "content": "Your friends will feel more at home if they know where everything is. You don't have to show your friends every inch of your home, but giving them a brief tour of the kitchen and showing them where the restrooms are is helpful. That way, they won't have to ask you for anything and can relax and get more comfortable. [4] X Research source If you're hosting small children, warn their parents about anything that's not kid-friendly so they'll know to keep their kids away. Point out any places that are off-limits, such as a baby's room, so they won't mistakenly go there later."
    },
    {
      "title": "Keep a variety of drinks on hand for different tastes.",
      "content": "Keep a variety of drinks on hand for different tastes. Etiquette coach Tami Claytor recommends that you \"have a good assortment of alcoholic and non-alcoholic beverages because not everyone drinks alcohol.\" She also notes that you \"want to be mindful of how much you serve people.\" [5] X Expert Source Tami Claytor Etiquette Coach Expert Interview. 16 February 2022. For example, you might have a couple of choices of soda, bottled water, tea, and coffee for non-alcoholic choices. If you serve alcohol, keep in mind that the host is responsible for anything that might happen if someone drives. Have a place where people can crash if they're not able to drive or be willing to call them a ride."
    },
    {
      "title": "Set out plenty of options so your friends can graze at will.",
      "content": "Set out plenty of options so your friends can graze at will. If you're not serving a meal, etiquette coach Tami Claytor notes that you \"want to have a wide variety of food.\" Ask about food allergies and dietary restrictions before your friends come over so you know there's something for everybody. [6] X Expert Source Tami Claytor Etiquette Coach Expert Interview. 16 February 2022. Here are some ideas that go over well with most people: A charcuterie board Chips and homemade salsa Pinwheel sandwiches A candy buffet"
    },
    {
      "title": "Turn off the TV and put away your phone while hosting.",
      "content": "Turn off the TV and put away your phone while hosting. Unless a TV show or broadcast event is the point of the gathering, it will just be a distraction. If you're using the TV for music, turn the visuals off. Make your friends the center of your attention at all times so you can ensure that everybody is enjoying themselves. [7] X Research source If you anticipate you might get calls from friends who need directions, set your phone to vibrate and keep it in your pocket. That way, if you do get a call or text, you can excuse yourself to answer it without disturbing anyone."
    },
    {
      "title": "Choose light topics that everyone can converse about.",
      "content": "Choose light topics that everyone can converse about. Pay attention to the flow of conversation and make sure no one is feeling left out. If a conversation takes a dark turn or starts getting heated, step in and steer it back into happier, more neutral territory. If you stay light and upbeat, your friends will as well. [8] X Research source Have a few fun conversation starters on hand in case the conversation falters as well. This also might be a great time to suggest another activity."
    },
    {
      "title": "Provide options to pass the time if something isn't already planned.",
      "content": "Provide options to pass the time if something isn't already planned. As the host, it's your responsibility to lead the group of people you've invited over. Have a few board games or other activities on hand that you think your friends would enjoy. Party games are especially fun if you've invited over several friends who don't know each other very well. [9] X Research source At the same time, don't force anyone to participate who isn't interested. If you have a variety of games, you can try to choose one that everyone wants to play. But if someone says they just want to watch, let them know that they're free to do so. If your friends are bringing kids with them, make sure you have some kid-friendly toys or activities to keep them occupied while the grown-ups chat."
    },
    {
      "title": "Pay attention to your friends so you can take care of them.",
      "content": "Pay attention to your friends so you can take care of them. A good host will have a fresh drink on hand just as you've finished your last one or be right there with a napkin just as you dripped dip on your leg. To be this good of a host, you have to constantly pay attention to your friends and think about what they might need. [10] X Research source Make it a habit to glance at each person every 5 to 10 minutes and assess their situation. Is their drink low? Do they have an empty plate in front of them? Are they looking around like they're looking for something? This can take some practice, so don't stress out too much if you get caught up in a conversation or an activity and let your hosting duties slip. At the same time, you don't want to be too overbearing. Avoid interrupting conversations to ask after your guests and don't insist that they take more food or drink if they decline. [11] X Research source"
    },
    {
      "title": "Make sure your friends don't leave anything behind.",
      "content": "Make sure your friends don't leave anything behind. If you took your friends' coats or jackets as they entered, offer to retrieve them when the party's winding down. This is also a pretty good way to signal that you're ready to start wrapping things up. For example, you might say, \"Can I get your coat for you?\" [12] X Research source If any of your friends brought food, take care to package that up or wash the dishes they brought so they can take those back home. Have a friend who's overstayed their welcome? Etiquette coach Tami Claytor recommends that you start by cleaning up as a nonverbal suggestion that it's time to go. If that doesn't work, she advises saying, \"'Oh, we have an early day tomorrow, so we're going to plan on getting to bed, you know, thank you for coming.'\" [13] X Expert Source Tami Claytor Etiquette Coach Expert Interview. 16 February 2022."
    },
    {
      "title": "Walk your friends to the door and tell them you enjoyed their company.",
      "content": "Walk your friends to the door and tell them you enjoyed their company. Be as gracious to your friends as they're walking out the door as you were when they arrived. Part with them warmly and invite them to come back again sometime soon. Let them know what a great time you had with them and how much you appreciated their presence. [14] X Research source It's not too late to reminisce! If there was a particular moment during the gathering that stood out to you, highlight it as one of your favorite moments. Your friends will enjoy thinking back on your time together."
    },
    {
      "title": "Offer a clean, inviting place for them to sleep.",
      "content": "Offer a clean, inviting place for them to sleep. If you have a guest room, air it out before your guests arrive and put clean sheets and blankets on the bed. Lay out towels so they can take a shower or bath. If you don't have a guest room, do what you can to ensure that your guests will have some privacy, even if they're sleeping on an air mattress or pull-out couch in the living room. [15] X Research source When you're ready to go to bed, let your guests know where everything is that they might need while you're sleeping. Reassure them that they're welcome to anything they need—they don't have to wait for you. It's also a good idea to let them know your general plans for the next day, such as when you normally get up, so they can plan accordingly. Reader Poll: We asked 212 wikiHow readers who've hosted friends, and 54% of them agreed that having a specific end time for the event is helpful for people to know what to expect. [Take Poll]"
    }
  ]
}