{
  "url": "https://www.wikihow.com/Clean-Earrings",
  "title": "How to Clean Earrings to Make Them Shiny & Sanitary",
  "steps": [
    {
      "title": "Clean most earrings with soapy water.",
      "content": "Clean most earrings with soapy water. Mix together 1 US quart (950 mL) warm (not hot!) water and 2 tablespoons (30 mL) of gentle dishwashing liquid, such as Dawn dish soap . Soak your jewelry in the water for 10-20 minutes, then gently scrub them with a soft-bristled brush . [1] X Research source Rinse the earrings with clean water and dry them with a lint-free microfiber cloth until no moisture remains. This method is safe for almost any common type of earring, including those made with stainless steel , nickel , and copper . You can also use soapy water to clean pearls and hard gemstones like quartz , diamonds , sapphires , and aquamarines . Emeralds and amethysts can also be cleaned with soapy water. However, emeralds shouldn’t be left to soak, and amethysts should be “dried with a paper towel followed by an air can,” says expert jeweler Mark Sandler, “although taking [amethysts] to a professional is easier and they usually don’t charge anything.” [2] X Expert Source Mark Sandler Graduate Gemologist, Jeweler, & Appraiser Expert Interview. 5 November 2019."
    },
    {
      "title": "Clean gold or platinum earrings with water, ammonia, and dish soap.",
      "content": "Clean gold or platinum earrings with water, ammonia, and dish soap. Mix a few drops of mild dish detergent in lukewarm (not hot) water. Add a few drops of ammonia into the mixture. Dip a new, soft-bristled, baby-size toothbrush into the solution and gently brush it against the metal. After cleaning, place the earrings in lukewarm water to rinse them, then carefully dry them with a paper towel or soft cloth. Maintain your gold or platinum jewelry by wiping it after every wear with a dry gentle cloth and “taking it to your jeweler yearly to be cleaned and polished,” which most jewelers will do for free, says Sandler. [3] X Expert Source Mark Sandler Graduate Gemologist, Jeweler, & Appraiser Expert Interview. 5 November 2019. To restore shine, use a microfiber cloth to polish the earrings with long, back-and-forth motions. Avoid rubbing the metal in circles, as this may magnify small scratches. Keep in mind that gold is a soft metal, so it’s crucial to be as gentle as possible while drying and brushing your earrings. While this DIY method may work, cleaning gold jewelry “and platinum jewelry is usually best left to a professional, says Lewand, “because they're also going to polish it, restore the texture, and finish it if it needs to be done.” [4] X Expert Source Edward Lewand Graduate Gemologist & Accredited Appraiser Expert Interview. 6 August 2019."
    },
    {
      "title": "Wash silver earrings with warm water and baking soda.",
      "content": "Wash silver earrings with warm water and baking soda. To clean silver earrings , line a glass baking pan with tin foil, with the shiny side facing up. Place the earrings on the tin foil and fill the pan with lukewarm water until the earrings are immersed. Sprinkle in baking soda until you can see the earrings start to bubble, then let them soak for an hour. Rinse them in a bowl of clean water and dry them with a soft cloth. [5] X Research source Gemologist Joseph R. Villarreal recommends looking for Blitz cloths , which “are special cloths sold at jewelry supply stores…that are impregnated with a mild abrasive that polishes the ring and removes light scratches.” [6] X Expert Source Joseph R. Villarreal, G.G. (GIA) Jeweler Expert Interview. 6 June 2023. Maintain your silver earrings by wiping them after every wear with a microfiber cloth. Rub the cloth in long, back-and-forth motions (not circles) to polish and restore shine to the metal. It’s actually beneficial to wear your silver jewelry often, as the oils in your skin can help to clean silver and maintain its shine."
    },
    {
      "title": "Clean costume jewelry with a 1:1 of baby shampoo and water.",
      "content": "Clean costume jewelry with a 1:1 of baby shampoo and water. Combine one drop of baby shampoo with one drop of water. Dip a cotton bud or soft toothbrush into the solution, then wipe it across your costume jewelry earrings. Once you’re finished cleaning, quickly rinse the earring off in cool water and dry it with a clean, soft towel. [7] X Research source Finish drying the piece with a hairdryer set to its coolest setting to prevent it from rusting. Costume jewelry should never be soaked in liquid since the metals are prone to rusting. You want to use as little liquid as possible when cleaning costume jewelry . Avoid using baking soda, vinegar, professional jewelry cleaners on costume pieces, as they’re typically too harsh."
    },
    {
      "title": "Remove dirt from cut gem earrings with a toothpick.",
      "content": "Remove dirt from cut gem earrings with a toothpick. Dirt can accumulate in the corners of cut stone earrings, making them difficult to wipe off. Use a shaved matchstick or a toothpick to pick it out instead, removing the dirt slowly and carefully. [8] X Research source You can also try wrapping the toothpick in a tissue or cloth to create a softer tip, but it may not be as effective in getting into tighter spaces."
    },
    {
      "title": "Take amber earrings to get professionally cleaned.",
      "content": "Take amber earrings to get professionally cleaned. Amber gemstone jewelry “is very soft, so you have to be very careful with it,” warns expert gemologist Edward Lewand. [9] X Expert Source Edward Lewand Graduate Gemologist & Accredited Appraiser Expert Interview. 6 August 2019. “Take [amber] to a real jewelry store and have them polish it up for you and clean it,” Lewand continues, “because they’ll understand what to do.” If it gets dirty again after the professional cleaning, Lewand recommends using a “soft rag—not a toothbrush or anything like that—with a little bit of Ivory or Dawn soap …to clean up pretty much everything.” Lewand does not recommend letting “the amber sit in any solution…because it can technically damage the stone if you let it sit in something too long.” [10] X Expert Source Edward Lewand Graduate Gemologist & Accredited Appraiser Expert Interview. 6 August 2019. Sandler affirms that you should “take [amber] to a professional” to be polished or cleaned. “It can be dangerous and sharp and ruin the value.” [11] X Expert Source Mark Sandler Graduate Gemologist, Jeweler, & Appraiser Expert Interview. 5 November 2019."
    },
    {
      "title": "Wipe down earrings with hydrogen peroxide or rubbing alcohol.",
      "content": "Wipe down earrings with hydrogen peroxide or rubbing alcohol. Saturate a cotton ball in one of the two solutions and dab it all over the earring to disinfect it. Rinse the earrings in a bowl of water. For a deeper clean, let your earrings soak in a small cup of hydrogen peroxide or isopropyl alcohol for 5-10 minutes before rinsing in a bowl of water. [12] X Research source When you’re done sanitizing your earrings, set them on a clean cloth to dry. Touch them a few times to test whether they’re dry, then put them away or wear them when they’re ready. Test the chemicals on the backside of an earring first to make sure they won’t damage your jewelry. Avoid using hydrogen peroxide on fine jewelry like diamonds, and avoid using rubbing alcohol on jewelry that has resin, clay, or plastic materials. In these situations, using dish soap may be a safer option."
    },
    {
      "title": "Use an ultrasonic device to sanitize your earrings.",
      "content": "Use an ultrasonic device to sanitize your earrings. Set up your ultrasonic jewelry cleaning device according to manufacturer instructions. Use an ultrasonic cleaning solution that guarantees a thorough clean while being free of ammonia and bleach. Place your earrings in the included basket so that none of them are touching each other. Run the device according to your user manual for 3-5 minutes. [13] X Research source Turn off the machine and allow the dirt to settle to the bottom before removing your earrings. Rinse the basket and your earrings with cold water and store your device according to manufacturer instructions. Brush off any remaining dirt with a soft brush, then dry your earrings with a soft cloth. Ultrasonic jewelry cleaning devices use ultrasonic waves to lift dirt away from your earrings. This method is ideal for clustered, diamond, and gold earrings. However, it’s not recommended for soft gemstones like pearls, opal stones, and emeralds."
    },
    {
      "title": "Polish tarnished metals with distilled white vinegar and baking soda.",
      "content": "Polish tarnished metals with distilled white vinegar and baking soda. Pour 1 US tbsp (15 mL) distilled white vinegar or lemon juice into a bowl. Mix in 2 tbsp (34 g) of baking soda. The mixture should begin to fizz and create a paste. When the fizzing stops, use a clean cloth or soft-bristled toothbrush to gently apply the paste to the tarnished metal. [14] X Research source Avoid applying the paste to any gemstones or other embellishments. Let the paste sit on the metal for about 30 minutes, then wipe it away with a soft, damp cloth. Rinse the earrings well, then use the soft-bristled brush to remove any paste residue. This solution can be used to polish away tarnish on metals like silver, copper, and brass."
    },
    {
      "title": "Clean your earrings once a month, depending on frequency of wear.",
      "content": "Clean your earrings once a month, depending on frequency of wear. Earrings don’t necessarily need cleaning after every wear, and the amount you clean them depends on how often you wear them. However, a good general rule is to clean all of your earrings about once a month. [15] X Research source If you only wear a certain pair of earrings on special occasions, it’s probably okay to just clean them before or after each wear. Give a new pair of earrings a good cleaning before wearing them for the first time, especially if they’re thrifted or borrowed."
    },
    {
      "title": "Store earrings separately in soft bags or a covered jewelry box.",
      "content": "Store earrings separately in soft bags or a covered jewelry box. Earrings and other types of jewelry will last longer if stored properly. Protect your earrings from dust by storing them in breathable cotton bags or a covered jewelry box . Keep them separated from one another—either by partitions in the box or in individual bags—to prevent scratches on the metals or gemstones."
    },
    {
      "title": "Avoid wearing earrings in chlorinated pools and hot tubs.",
      "content": "Avoid wearing earrings in chlorinated pools and hot tubs. Sandler warns strongly against wearing jewelry in swimming pools, hot tubs, or any other chlorinated environment. [16] X Expert Source Mark Sandler Graduate Gemologist, Jeweler, & Appraiser Expert Interview. 5 November 2019. Chlorine is a harsh chemical that can dull and pit the metal of your earrings, especially if they’re made of silver, stainless steel, or pearls. Remove your earrings before entering a swimming pool, hot tub, or other substance containing chlorine."
    },
    {
      "title": "Remove earrings before exercising.",
      "content": "Remove earrings before exercising. Wearing jewelry while exercising can cause sweat and salt from your body to contaminate your earrings and lead to a build-up of grime. These substances may eventually tarnish or cause other types of damage to your jewelry. To avoid this damage, remove your earrings before any strenuous activities. [17] X Research source"
    },
    {
      "title": "Put earrings on last when getting ready.",
      "content": "Put earrings on last when getting ready. If you wear earrings while applying make-up or hair products, the beauty products can get onto your jewelry and potentially damage it. Perfume can also discolor jewelry, so spritz in on before putting your earrings in. Just make accessorizing your finishing touch before heading out the door!"
    },
    {
      "title": "Can I clean my earrings with toothpaste?",
      "content": "Can I clean my earrings with toothpaste? Toothpaste is unlikely to harm most earrings if used to clean them, but experts advise against it. Villarreal says that toothpaste is likely to “leave a film on the stones if it's not done properly or not cleaned properly. So I would advise not to do it.” [18] X Expert Source Joseph R. Villarreal, G.G. (GIA) Jeweler Expert Interview. 6 June 2023."
    },
    {
      "title": "Can I clean stainless steel earrings with vinegar?",
      "content": "Can I clean stainless steel earrings with vinegar? Yes, vinegar can be used to clean stainless steel earrings by taking a soft rag, dipping it in vinegar, and brushing it against the jewelry, instructs Lewand. [19] X Expert Source Edward Lewand Graduate Gemologist & Accredited Appraiser Expert Interview. 6 August 2019. “Stainless steel is a hard enough substance that nothing should corrode it or do any damage to it, just like your stainless steel sink,” continues Lewand. However, Lewand goes on to say that cleaning stainless steel with vinegar is usually not necessary. “Stainless steel shouldn't get dirty other than something getting on it like chocolate or syrup or something like that, or working in the yard, so anything should clean it. You could even just use soap and water on it, and it shouldn't be a problem.” [20] X Expert Source Edward Lewand Graduate Gemologist & Accredited Appraiser Expert Interview. 6 August 2019. So while you certainly can clean stainless steel earrings with vinegar, it’s not usually the most needed or simplest option."
    },
    {
      "title": "How do you get the gunk out of the back of earrings?",
      "content": "How do you get the gunk out of the back of earrings? To loosen gunk in the back of your earrings, soak the jewelry in a mixture of 2 tablespoons (30 mL) mild dish soap and 1 US quart (950 mL) warm water. Let soak for 10-20 minutes, then use a soft-bristled brush or toothpick to gently scrub away the debris in the earrings."
    },
    {
      "title": "Do you need to use earring cleaner to clean earrings?",
      "content": "Do you need to use earring cleaner to clean earrings? No, you typically don’t need to use store-bought earring cleaners to clean your earrings. DIY methods, like soapy water or hydrogen peroxide, typically work just as well to clean and sanitize jewelry. If you are interested in using a store-bought cleaner, however, Weiman Jewelry Cleaner Liquid is one of the most recommended budget options."
    },
    {
      "title": "Why do you have to clean your earrings?",
      "content": "Why do you have to clean your earrings? Cleaning your earrings is important for a number of reasons. Firstly, earrings accumulate grease and dirt from your skin oils, skin care products, shampoos, soaps, and more. These substances can create grime and build up on your jewelry. Cleaning earrings also helps to restore their shine, making them look more elegant and clean when worn. Perhaps most importantly, cleaning your earrings can prevent bacteria and infection. Since pierced earrings physically go through a part of your body, any dirt or bacteria left on them (or your hands while putting them in) can lead to painful or even dangerous infection. [21] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}