{
  "url": "https://www.wikihow.com/Contact-Lyft",
  "title": "Ways to Get in Touch with Lyft as a Passenger or Driver",
  "steps": [
    {
      "title": "Submit a ride complaint through the Lyft app.",
      "content": "Submit a ride complaint through the Lyft app. Open your Lyft app and tap your profile photo in the top left corner of the screen. Select the “Ride history” option, then locate the ride in question and tap on it. Scroll down to the bottom of the ride information page, tap the button marked either “Get help” or “Request Review,” and follow the on-screen instructions to submit your complaint. [1] X Research source This is the easiest way to deal with things like false charges, discount or promotional issues, and poor driver behavior."
    },
    {
      "title": "Contact your driver about a lost item.",
      "content": "Contact your driver about a lost item. Open your Lyft app, tap your user profile photo, and select the “Ride history” option. Then, tap the ride in question, scroll down to the bottom of the page, and press the “Find Lost Item” button. From here, you can call your driver or send them a text message. [2] X Research source If the lost item is your phone, or if your ride occured over 24 hours ago, submit a lost item form by visiting https://help.lyft.com/hc/en-us/requests/new?ticket_form_id=724707 . To compensate your driver for their time, you’ll need to pay a $15 fee for the safe return of your item."
    },
    {
      "title": "Request a call or email about account and service issues.",
      "content": "Request a call or email about account and service issues. You can also use Lyft's website to contact them for help with issues regarding a ride or your account. Simply go to https://help.lyft.com/hc/en/all/requests/loginprompt and follow the prompts based on your issue. You can choose to log in or complete the prompts as a guest. If you're having account issues, click I can't access my account and follow the prompts to get more help."
    },
    {
      "title": "Visit the Lyft user support website for general questions.",
      "content": "Visit the Lyft user support website for general questions. If you have a general question about the Lyft service or app, visit the company’s official user support website at https://help.lyft.com . On the website, you can find a variety of detailed guides related to subjects like: [3] X Research source Ride requests User profiles and reviews Ride fees Promotions and bonuses"
    },
    {
      "title": "Contact Lyft’s service animal team to report policy violations.",
      "content": "Contact Lyft’s service animal team to report policy violations. Lyft allows passengers to take service animals with them during rides. These animals do not need to be marked with a service vest or tag, nor do they need to be officially registered with the government. If a driver denied you a ride due to your service animal, contact Lyft’s service animal team at 1-844-250-3174 to resolve the issue. [4] X Research source Drivers who deny service to passengers with service animals may be removed from the platform. Lyft also lets drivers bring service animals with them during rides. However, if your driver doesn’t inform you about an animal beforehand, you can refuse to ride with them at no consequence to yourself."
    },
    {
      "title": "Handle driver issues with your city if possible.",
      "content": "Handle driver issues with your city if possible. In addition to contacting Lyft, passengers in select American cities can submit complaints and concerns to their local government. Doing this may lead to quicker results when dealing with accidents, legal issues, or allegations of misconduct. [5] X Research source New Orleans passengers can file complaints by calling the Taxicab and For-Hire Vehicle Bureau’s hotline at 504-658-7176. In addition, Jefferson Parish passengers can register complaints by visiting http://www.jeffparish.net/index.aspx?page=3272 . [6] X Research source Chicago passengers can file complaints by calling 311. In addition, they can remove themselves from Lyft’s passenger rating system by contacting the company’s user support team. Seattle passengers can file complaints by calling 206-684-2489. [7] X Research source"
    },
    {
      "title": "Call Lyft’s critical support team for ride emergencies.",
      "content": "Call Lyft’s critical support team for ride emergencies. If you’re dealing with an emergency situation, such as a vehicle crash, endangered passenger, or traffic citation, call Lyft’s critical response line at 855-865-9553. In order for the critical support team to help, you’ll need to provide them with thorough details about the situation. Lyft’s critical support team is available 24/7. Your initial call will take about 10 to 15 minutes, though you should expect follow up calls from the team as they work to resolve your issue. If you’re dealing with a situation that requires emergency services, make sure to call 911 before contacting Lyft. When talking to the critical support team, make sure to tell them who you are, how many passengers you have, and what happened. If possible, take photos or videos of the incident that you can send to the team."
    },
    {
      "title": "Submit vehicle damage photos to Lyft’s user support team.",
      "content": "Submit vehicle damage photos to Lyft’s user support team. If a passenger damages your car to the point where it needs a thorough cleaning or significant repairs, take at least 2 clear, high-quality photos of the damage and submit them to Lyft’s user support team. If the damage warrants compensation, Lyft will contact you to figure out how to proceed. [8] X Research source Submit your photos by visiting https://help.lyft.com/hc/en-us/requests/new?ticket_form_id=724 . When submitting your photos, make sure to include a brief description of what happened and any information you have about the passenger. Common forms of passenger damage include spills, dirt tracks, and vomit stains."
    },
    {
      "title": "Report inappropriate passengers through Lyft’s user support site.",
      "content": "Report inappropriate passengers through Lyft’s user support site. Lyft does not tolerate passenger behavior that is openly discriminatory, violent, unsafe, or criminal. If you experience these sorts of things while giving a ride, you can report the passenger in question through Lyft’s user support website. [9] X Research source You can send in the report by visiting https://help.lyft.com/hc/en-us/requests/new?ticket_form_id=724707 . If your passenger’s behavior was poor but doesn’t warrant a full report, give them a low rating after the ride ends. If you give them 3 stars or less, Lyft will make sure you’re never matched with them again. [10] X Research source"
    },
    {
      "title": "Start an application through Lyft’s official app.",
      "content": "Start an application through Lyft’s official app. If you’d like to drive for Lyft, you’ll need to start a new driver application. To do so, open your Lyft app, tap the profile icon in the top left corner of the screen, and select the “Sign up to drive” option. [11] X Research source If you’d prefer, you can start an application by visiting https://www.lyft.com/drive-with-lyft ."
    },
    {
      "title": "Fill out the application.",
      "content": "Fill out the application. To complete the application, you’ll need to provide information about your identity, where you live, and what kind of car you drive. In addition, you’ll need to upload a copy of your driver’s license, a copy of your car’s insurance paperwork, and a personal photo. [12] X Research source If you live in certain territories, Lyft may require additional documentation or an in-person vehicle inspection. Potential drivers must be at least 21 years old and own a smartphone."
    },
    {
      "title": "Sign a disclosures form and a background check form.",
      "content": "Sign a disclosures form and a background check form. Lyft runs extensive background and DMV checks on all potential drivers. As such, in order to submit your application, you’ll need to sign a state disclosures form and a background check form giving Lyft the right to investigate you. [13] X Research source Lyft does not accept drivers convicted of violent, sexual, drug-related, or driving-related crimes. Lyft does not accept drivers whose DMV record shows 3 or more minor moving violations, such as accidents, or any major moving violations, such as reckless driving."
    },
    {
      "title": "Submit the application.",
      "content": "Submit the application. Once you’ve submitted the application, expect a response from Lyft via e-mail or text within 3 to 10 business days. If you’re accepted, you can download the Lyft Driver app and begin offering rides. If you’re not accepted, you may reapply after 6 months. [14] X Research source You can check your application status by visiting https://www.lyft.com/drivers/apply/resume ."
    }
  ]
}