{
  "url": "https://www.wikihow.com/Check-out-a-Used-Car-Before-Buying-It",
  "title": "How to Check out a Used Car Before Buying It",
  "steps": [
    {
      "title": "Park the car on level ground before checking it out.",
      "content": "Park the car on level ground before checking it out. Inspecting the car on even ground allows you to see if anything in the undercarriage is out of line or sagging. It also makes it easier for you to see and check the state of the tires. [1] X Research source Engage the parking brake and turn the front wheels to the left so the vehicle is less likely to move."
    },
    {
      "title": "Look for rust spots, dents, or scratches in the paint job.",
      "content": "Look for rust spots, dents, or scratches in the paint job. The car should be clean so the paint condition is visible. Look at the sides of the car from end to end for waviness that indicates a shoddy paint job. Run your finger along the edges of the joints between panels and look for roughness that could be from residue left from masking tape. [2] X Research source Rust, scratches, and dents in the paint and body of the car don’t affect the performance of the engine, but they can affect how much you pay for the car."
    },
    {
      "title": "Pop the trunk of the car to make sure it is still in good condition.",
      "content": "Pop the trunk of the car to make sure it is still in good condition. It should not show any sign of rust or water damage. Look for cracks, holes, and other signs of wear and tear inside of the trunk that would indicate damage. [3] X Research source Check that the trunk opens easily and closes securely. Some damage like rust or scrapes could just be cosmetic. But serious rust, cracks, or holes could affect the way the vehicle performs and the integrity of the trunk itself."
    },
    {
      "title": "Check the tires for wear.",
      "content": "Check the tires for wear. The tires should be worn evenly and they should match. Look at the surface of the tire for feathering or uneven wearing that could indicate a bad alignment. Bad alignment can be caused by worn steering/suspension components or frame damage and will affect the vehicle’s performance. [4] X Research source Bad alignment or tires without much tread can be a driving hazard."
    },
    {
      "title": "Inspect the exhaust system and the undercarriage for rust and damage.",
      "content": "Inspect the exhaust system and the undercarriage for rust and damage. Look for any black spots on the exhaust system because this can indicate leaking. Take some time to inspect the frame or unibody for damage and rust. [5] X Research source If you do see rust, it doesn’t necessarily mean that you shouldn’t purchase the car. But it does indicate wear and tear that could affect the price that you pay. A significant amount of rust that includes small cracks or holes could put the exhaust at greater risk of giving out and needing expensive repairs. Damage such as dents or cracks in the exhaust system are major red flags. Don’t purchase a vehicle with exhaust damage unless you’re prepared to pay for repairs."
    },
    {
      "title": "Avoid cars with frame damage.",
      "content": "Avoid cars with frame damage. Frame damage, even if it was repaired, will greatly reduce the life expectancy of a used car. Check the undercarriage and where it connects the front fenders and holds the top of the radiator. It may be welded or bolted in. Inspect the bolt heads at the top of the fenders inside the hood. A car with a damaged or repaired frame is much more likely to break down sooner than a car without a damaged frame. [6] X Research source Look for scratch marks that could indicate that the fenders have been replaced or realigned, possibly after a collision."
    },
    {
      "title": "Open the hood of the car and look for signs of damage.",
      "content": "Open the hood of the car and look for signs of damage. Check under the hood when the engine is cool and look for dents, cracks, rust, and any obvious signs of damage. These can all be signs that the car was either poorly maintained, is damaged, or unsafe to drive. Check that the hood of the car opened easily and propped to remain open. [7] X Research source Open and close the hood to make sure that it is easy to access and closes securely."
    },
    {
      "title": "Inspect the hoses and belts for damage.",
      "content": "Inspect the hoses and belts for damage. There shouldn’t be any cracks or obvious signs of wear like fraying or discoloration. Pay close attention to the condition of the timing belt, which can be costly to replace. The radiator hoses should not be soft. [8] X Research source Worn or damaged belts can snap, and can be expensive to replace."
    },
    {
      "title": "Check the engine",
      "content": "Check the engine for leaks and corrosion. On the engine block, look for any dark brown oil stains. This will indicate that there is a leak in a gasket, and could possibly lead to an expensive repair in the future. Check the fluid levels to make sure they’re not empty. [9] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source If any of the fluid holding tanks are empty, ask the seller why they’re empty. It could be a sign that there’s a leak. You don’t want to purchase a car that has a fluid leak unless you’re willing to pay for repairs."
    },
    {
      "title": "Remove the oil cap by unscrewing it.",
      "content": "Remove the oil cap by unscrewing it. The oil cap is located on the top of the engine and has a little image of an oil can. A foam residue on the inside indicates a leaking head gasket. A head gasket is a complicated and expensive engine repair. You should steer clear of any car with a damaged gasket. [10] X Research source Make sure you replace the cap by screwing it back on all of the way."
    },
    {
      "title": "Pull the transmission dipstick to check the fluid.",
      "content": "Pull the transmission dipstick to check the fluid. You can check the transmission fluid by pulling the ring at the end of the dipstick to remove it. The fluid should be pink or red. It should also be full of fluid, even while the engine is running. [11] X Research source If the fluid isn’t the right color and smells burnt, it could indicate that there’s a leak or the transmission is damaged. It’s also a red flag if the seller didn’t disclose possible transmission issues. You may want to reconsider purchasing the car or have a qualified mechanic take a look at it before you buy it. An older car may have darker transmission fluid but it should not look or smell burnt."
    },
    {
      "title": "Sit inside the car.",
      "content": "Sit inside the car. Make sure that you like sitting inside of the vehicle. Check the seats and upholstery for any tears, rips, stains, or other damage. [12] X Research source Make sure the seats can be adjusted and are functional."
    },
    {
      "title": "Turn on the air-conditioning to make sure it’s working.",
      "content": "Turn on the air-conditioning to make sure it’s working. Test the temperature control by turning on the heat and the cold. Turn the fan speed on high and low to test that it’s working properly. [13] X Research source"
    },
    {
      "title": "Ask the dealer or seller when the freon was last refilled.",
      "content": "Ask the dealer or seller when the freon was last refilled. Freon is a refrigerant that makes the air-conditioner blow cold air. Cars generally need to have refrigerant added every 2-3 years, and since you’re checking out a used car, it’s possible that the freon levels are low. Asking the seller of the car when it was last refilled can give you an indication of whether or not you’ll need to pay to have it refilled in the near future. [14] X Research source Also ask whether the freon leaks or has any issues. If the seller has a vehicle history report, it should list the last time the car had refrigerant added."
    },
    {
      "title": "Check the odometer of the car for the mileage.",
      "content": "Check the odometer of the car for the mileage. On the dashboard is a number that tracks the miles driven by the car. This is important because the mileage indicates the car’s age. On the average, a normal driver will drive between 10,000 to 15,000 miles (16,000 to 24,000 km) a year. Cars age not only by time but by their mileage, too. [15] X Research source Buying a 10-year-old car with very low mileage does not necessarily mean that the vehicle is in good condition. Ask the seller what the car was primarily used for if it’s older and has low mileage. For example, if the car was used by a grandmother who only used it to get groceries every other week, then the car is likely to have less wear and tear than a car that was previously owned by a teenager who liked to drive really fast."
    },
    {
      "title": "Find out if the car has a computer on board.",
      "content": "Find out if the car has a computer on board. You can use a computer code reader to check for errors. Connect the code reader to the port located either on the dash or beneath the steering wheel. [16] X Research source You can purchase code readers at auto supply stores. For a car that has an onboard computer, pay attention to the warnings right when you start the car or when you turn the key or press the start button."
    },
    {
      "title": "Verify that the indicator and display lights are functional.",
      "content": "Verify that the indicator and display lights are functional. Check that any sensors or error alerts are operational as well as turn signals and hazard warning lights. If the car has a rear-view camera or a stereo with digital display, check that they work. [17] X Research source Ask the seller to turn them on so you can see if they work from the outside of the vehicle."
    },
    {
      "title": "Test drive the car before making any final decisions.",
      "content": "Test drive the car before making any final decisions. This is perhaps one of the best ways to know the condition of the car. Hence, a buyer should make all effort to do a test drive first before coming to any decisions. [18] X Research source Have the seller ride with you so you can ask them questions about the vehicle while you drive it and so they’re not worried about you driving off with the car."
    },
    {
      "title": "Press the brakes down to check that they’re working properly.",
      "content": "Press the brakes down to check that they’re working properly. Press down hard enough on the brakes to decelerate rapidly, but not enough to slide. Try this going around 30 mph (48 km/h) in an area without traffic. You should not feel any vibration from the brake pedal, or hear any squealing or strange noises. [19] X Research source Brakes that pulsate indicate the need for having the rotors resurfaced or replaced and new pads installed. The car should not swerve when you press the brakes. This can be caused by a bad brake caliper or worn steering components."
    },
    {
      "title": "Check for small trepidations at different speeds.",
      "content": "Check for small trepidations at different speeds. Slight trepidation during a small speed interval may mean wear at the direction of mechanical parts which can be costly to repair. This may go together with uneven wear at the front tire(s). [20] X Research source Check for sounds, trepidation, or clunking noise when making a 90 degree turn."
    },
    {
      "title": "Check the car's service history report.",
      "content": "Check the car's service history report. That will give you some information regarding the performance, repairs, and problems of the car. Ideally, the current owner would have kept a record of the times when the car needed servicing and should be willing to show you this information. [21] X Research source There are instances where used cars are sold because of past accidents or negative experiences. Some cars do not have maintenance records because they maintained them at home, but you can ask the seller if they have any receipts from replacement parts so you can verify any repairs they made. Request the vehicle’s history from the salesperson or the person trying to sell you the car."
    },
    {
      "title": "Bring someone who knows cars to inspect the car.",
      "content": "Bring someone who knows cars to inspect the car. It is a good idea to bring along a trusted friend with a good background of automotive know-how to check things that you are not sure of. If you do not have a trusted friend in the auto industry, you can pay a mechanic to complete an inspection on it. Make sure this mechanic has good reviews so you will not get scammed into thinking the car is a lemon. [22] X Research source"
    },
    {
      "title": "Negotiate the price of the car.",
      "content": "Negotiate the price of the car. Depending on the quality of the vehicle, feel free to offer a price. Be sure that it is a reasonable offer. Remember, no matter how good that car is today, it is going to require maintenance in the future and will depreciate in value over time. [23] X Research source For example, if the dealer is asking $15,000, do not offer $10,000, which is an unreasonable counter-offer. If the car is over $10,000, try to negotiate at least $1,500 off of the car. Use industry standard pricing models like Kelley Blue Book to base your price negotiations on."
    },
    {
      "title": "Document everything if you’re buying from a private seller.",
      "content": "Document everything if you’re buying from a private seller. Bring a pen, paper and cell phone with you. As you make your inspection of the car, be sure to record all items which are damaged or will require replacement. [24] X Research source Some sellers may think it's rude and may decide not to sell to you. But you need to be as informed as possible when you’re making your decision."
    }
  ]
}