{
  "url": "https://www.wikihow.com/Confess-to-Your-Crush",
  "title": "How to Confess to Your Crush",
  "steps": [
    {
      "title": "Write a note",
      "content": "Write a note and pass it to your crush or make a creative card. Notes are one of the most common and effective ways to confess a crush. It tends to be less awkward than in-person confessions, giving you some space and comfort if the person doesn't feel the same way. Write a short note confessing your crush, and pass it to the person in person, or put it in their locker. [1] X Research source Make sure your note is hand-written, legible, and relatively short and to the point. It doesn't need to be clever, or overly romantic. Just cut to the chase: \"I've always noticed that you seem really sweet, kind, and cute. I'd love to get to know you better, because I really like you.\" When you want to confess to your crush, in person is always better than just over a text, or online. A note is a good balance, because it can be personal, but also gives you some space if you're nervous. If all else fails, having a conversation on the phone, or via Skype is always preferable to texting it."
    },
    {
      "title": "Introduce the idea without saying anything.",
      "content": "Introduce the idea without saying anything. In some cases, your actions can make your crush more obvious than saying, \"You know, I really like you.\" If your crush gradually becomes aware that you like them, it'll be more natural and clear than having to say so bluntly. Go out of your way to talk to your crush and \"accidentally\" bump into them in the hallway. Change your routes so you see them regularly, and always make a point of saying hi. Always make eye-contact . Don't shy away from it, like you're embarrassed. Make eye contact and smile flirtatiously when you see the person you're crushing on. [2] X Research source Show an interest in what they do and what they are like. Try to get to know your crush as a friend first, before you confess anything. It may grow naturally."
    },
    {
      "title": "Ask for help with something.",
      "content": "Ask for help with something. One great way to start a conversation or to get your crush talking is to ask some help with something simple. [3] X Research source Depending on who your crush is and what they're like, this can get you into some flirtatious conversations. Ask for help with a homework assignment for a class that you're in together. Start with a compliment, like, \"You seem so smart in this class. Do you think we could talk a little sometime about this assignment? I need some help.\" Asking for help will make them think respectfully of you, and they'll think you're honest enough to ask for help on something. Also, them helping you will make their overall feelings for you kinder. Pretend you lost something. \"Hey, have you seen a book around here? I just had it…\" When your crush helps out, say, \"You're so sweet!\""
    },
    {
      "title": "\"Accidentally\" slip it out to someone else.",
      "content": "\"Accidentally\" slip it out to someone else. In some cases, a rumor started could actually work to your advantage. If you tell a friend that you've got a major crush on someone, and that gets around to a friend of your crush, which gets around to your crush, you might have done the job without really doing anything at all. Then they'll know, and talking will be a lot easier. Tell a couple of your friends, and don't be embarrassed about it. If it spreads, you can always deny it later. If you never actually said anything, there'll be no evidence that you did anything embarrassing, or got rejected. Never deny it, if you're really interested in someone. Why would you care if someone knew you liked somebody? That's nothing to be embarrassed about."
    },
    {
      "title": "Find reasons to invite the person out.",
      "content": "Find reasons to invite the person out . The scariest thing is not knowing how your crush feels about you. It's a lot easier to confess a crush bluntly if you're pretty sure that your crush likes you back . One great way of figuring this out is to invite your crush to some kind of event, like a party, or an after-school activity, which isn't necessarily a date. [4] X Research source Keep an eye out for things your crush might enjoy going to: \"I know you really like Marvel movies, so I thought you might want to come see the new Iron Man, because my dad gets extra tickets. I was just curious, thought you might appreciate them.\" If your crush gets really excited, or seems really flattered and really wants to go with you, take it as a good sign and take the next step when you get a chance."
    },
    {
      "title": "Flirt",
      "content": "Flirt . Be friendly and flirty whenever you get the chance. This can do a whole lot more to communicate a crush than saying so out loud. Talk to your crush the same way you might mess around with your friends, or other people you're comfortable around. Just be yourself . [5] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Tease your crush in a friendly way. Find funny reasons to let your sense of humor out when you talk to them. Instead of saying, \"Hey, how are you today?\" say something like, \"I'm thinking of organizing a jailbreak from school. Need an accomplice. What do you say? In or out?\" There's not much romantic about the phrase, \"I have a crush on you.\" Instead of telling someone, make it obvious that you're interested, so it will become unnecessary to say out loud."
    },
    {
      "title": "Don't wait.",
      "content": "Don't wait. The best time to confess a crush? Right now. There's no use in waiting, because you're only giving your crush the opportunity to start dating someone else, or find someone else to crush on and forget about you. If you know someone and like them, the perfect time is now. The only time you should wait is when your crush is currently dating someone. Telling someone that you like them while they're in a relationship can make things kind of complicated. It's best to find someone else to crush on for a while, and return to the person later when they're single."
    },
    {
      "title": "Try to stay calm and cool.",
      "content": "Try to stay calm and cool. Despite what you may think, telling someone that you like them shouldn't be a big deal. Even if they don't feel the same way, it'll be such a nice thing to say! Especially if you approach them in a calm and cool way, being gentle and humorous in your approach. Make it easy and try to take the pressure off yourself. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Build yourself up before you do it. Look in the mirror and say, \"I got this. I'm a cool person my crush should want to be with.\" Then go put yourself out there. Look your best on the day you decide to do it. Wear clean, stylish clothes that fit you well and flatter you, and make sure you're fresh-breathed and clean-haired. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Introduce yourself, if necessary.",
      "content": "Introduce yourself, if necessary. If you don't know your crush very well, it can be kind of difficult to confess a crush. The last thing you want to do is to take the risk of saying so and having them say, \"Wait, who are you?\" If you're not sure whether or not the person knows you, go up to them and introduce yourself. It doesn't have to be complicated: \"Hey, I don't know if you know me real well. We're in the same grade, I think we had Mr. Robinson's class last year? Well, I've wanted to tell you something for a while...\""
    },
    {
      "title": "Talk one-on-one, in person.",
      "content": "Talk one-on-one, in person. The best way to have this conversation is in private. It's important that both of you feel as comfortable and calm as possible, to avoid making this a super-big-deal, but it's also good to have a little privacy so it's less embarrassing. Passing between class periods can be a great time to catch someone really quickly. Right after class or when you're leaving the same class is a good time, too. Or, you could try to sit together on the bus. Just hang back and say, \"Hey, can I talk to you for a minute?\" Never go up to a crush while they're in a big group, or try to confess in the middle of the lunch room while everyone can hear you. It can be really awkward if it doesn't end up going well. It's a private conversation, so do it one-one-one."
    },
    {
      "title": "Have a specific date or event in mind to follow up with.",
      "content": "Have a specific date or event in mind to follow up with. If you say, \"I like you\" and your crush says, \"I like you too,\" then what? Are you just going to say, \"Well....cool.\" No! It's important to have a specific date in mind so you can follow up. If a dance is coming up, say, \"Cool, I hoped maybe we could go to the dance together. Would you like to?\" If there's nothing school related, or you're not in school, say, \"I hoped we could get a bite to eat sometime. Want to go for pizza this Friday? Say around 7?\" In some cases, it might be better to not rush it. Don't expect much of an answer if you tell someone that you like them. They may want to think about it for a while. That's a good thing. Don't worry about waiting."
    },
    {
      "title": "Cut to the chase.",
      "content": "Cut to the chase. The big moment doesn't have to be a big deal. There's no point in making it complicated, or super-creative, when the content is \"I like you.\" Just introduce yourself, smile, and say, \"You know, I've wanted to say this for a long time. I've always noticed you, and you seem really cute and sweet. I find myself thinking about you. I like you a lot.\" Don't follow a \"script\" when you try to talk. Lots of people who feel awkward in this situation think it will be better if they're reading from a script, but that'll just make you sound like a robot. Talk naturally, as if you were talking to one of your oldest friends."
    },
    {
      "title": "Don't worry about rejection.",
      "content": "Don't worry about rejection . You know what? It happens. It's happened to everyone. Being rejected might sting a little at first, but it's a whole lot better than wondering what might have happened if you'd have said something, but didn't. You'll grow up, you'll move on, and so will your crush. Just get out there and go for it. [8] X Research source If you get rejected, just smile and say, \"Well, I'm glad to know at least. Have a good rest of your week.\" Never complain, scoff, or do anything dramatic. Even if you're feeling upset, at least you know now and can move on."
    },
    {
      "title": "Befriend them online first, if you haven't already.",
      "content": "Befriend them online first, if you haven't already. One good way to do a little research and get to know someone before you confess a crush is to be friends on Facebook , or follow them on Twitter . If you're waiting, stop waiting and reach out online first to make contact. Having a couple of online chats can help break the ice when you finally talk in person. To get a conversation started when you're in person, you can bring stuff up that you already talked about online, or reference something that everyone saw on Facebook that day. Good ice-breaker."
    },
    {
      "title": "Make sure your crush isn't seeing anyone.",
      "content": "Make sure your crush isn't seeing anyone. One of the most important things to find out before you confess a crush is whether or not your crush is currently seeing anyone. If they are, it's probably a good idea to hang back, because you don't want to make things over-complicated for someone that you like. Online is an easy way to check, or you can also just watch closely and see whether your crush seems to be committed. Talk to mutual friends or ask around."
    },
    {
      "title": "Talk to mutual friends about your crush.",
      "content": "Talk to mutual friends about your crush. Reach out to friends and acquaintances if you want to learn more about the person you're crushing on. Find a reason to hang out with people that are friends with your crush and just start asking about them. \"What do they like? Do they like anyone? Do you think they'd be interested?\" All good questions to ask. Remember, if it slips out, that's not the worst thing to have happen. Might end up making your job and your stress a lot easier."
    },
    {
      "title": "Hang out in groups.",
      "content": "Hang out in groups. Find reasons to hang out with your crush, but not in the context of a date, or a one-on-one hang out. Get to know them better by inviting them to do things with your group of friends. Organize a simple group hang-out, like a movie night at someone's house, or a group dinner somewhere, and invite your crush. If you're still worried about approaching your crush that way, have someone else ask. If you find out you don't actually like them, good. At least you didn't confess a little crush and make a mistake for someone you don't actually have that much in common with."
    },
    {
      "title": "Pay attention.",
      "content": "Pay attention. If you want to learn more about someone and find out whether or not you might be good together, part of it is to just start opening your eyes a little. Who does your crush seem to enjoy hanging out with? What is their sense of humor like? What do they like to do in their free time? Spend some time paying attention and watching (not in a creepy way) to learn as much as you can. Watch for signs of body language when you're around each other. If your crush starts using \"closed\" body language, arms crossed and not making eye-contact, it could be a sign she's not interested in you. You might save yourself some grief."
    }
  ]
}