{
  "url": "https://www.wikihow.com/Complete-the-Wolf-of-the-North-Challenge-(Genshin-Impact)",
  "title": "How to Complete the Wolf of the North Challenge (Genshin Impact)",
  "steps": [
    {
      "title": "Complete the Razor character quest \"The Meaning of Lupical\" first.",
      "content": "Complete the Razor character quest \"The Meaning of Lupical\" first. Before you can challenge Andrius, you need to unlock his challenge. In this quest, you will get to fight Andrius to 50% health (while trying Razor). After doing so, Andrius will invite you to test your skills in the challenge."
    },
    {
      "title": "Be prepared for immense difficulty.",
      "content": "Be prepared for immense difficulty. The weekly challenges are the hardest challenges in all of Teyvat. You are better off if your party level is significantly higher than the weekly boss level."
    },
    {
      "title": "Teleport to Wolvendom.",
      "content": "Teleport to Wolvendom. This waypoint is located southwest of Mondstadt and east of a large circular arena visible on the map."
    },
    {
      "title": "Head west.",
      "content": "Head west. On this path, you will encounter a few Hilichurls, but it should be mostly clear until you reach Andrius."
    },
    {
      "title": "Drop into the arena.",
      "content": "Drop into the arena. Upon reaching the challenge area, you will drop several meters down into the arena. In front of you will be a sword that can be used to start the battle."
    },
    {
      "title": "Prepare for the battle.",
      "content": "Prepare for the battle. Andrius is mostly immune to all Cryo and Anemo attacks, making this boss extremely difficult to fight. You are best having Pyro and Electro characters of extremely high level and with a ton of HP, as all of Andrius's attacks can significantly drain HP. You will also want a character that can regenerate your other characters' health, such as Noelle. If you do not have a character that can regenerate HP, then you will need a lot of food, and you will need to pay attention very closely."
    },
    {
      "title": "Activate the sword to start.",
      "content": "Activate the sword to start. Move towards the sword, then select \"Commence trial\" to start the fight with Andrius."
    },
    {
      "title": "Stay a moderate distance from Andrius (about 20m).",
      "content": "Stay a moderate distance from Andrius (about 20m). If you are too far, he will charge at you with immense speed. If you are too close, you will not be able to run from his attacks."
    },
    {
      "title": "Stand out of the ice circle.",
      "content": "Stand out of the ice circle. If you see a circle of ice, that means Andrius is about to jump there. This will deal heavy Cryo damage. If you see this circle around Andrius, then he is about to spin to attack you. If you must stand in the ice circle, you should have a shield to guard against attacks."
    },
    {
      "title": "Avoid getting slashed.",
      "content": "Avoid getting slashed. Even if there is no ice circle, you can still be scratched by Andrius. Move to the side to avoid his claws and his tail. If you are directly in front, Andrius will slash you with his claws. If you are directly behind, he will use your tail to attack you and/or throw ice at you."
    },
    {
      "title": "Stay off the standing ice.",
      "content": "Stay off the standing ice. This ice can deal Cryo damage over time to characters standing on it. If you see standing ice, move away from it. Also stay off the walls of the arena; while it can be used to attack Andrius without getting attacked, it will also be covered in ice after reaching the halfway point."
    },
    {
      "title": "Move to the center of the arena.",
      "content": "Move to the center of the arena. After reaching halfway through the battle, Andrius will run in a circle. Keep your eyes on him as he will charge several times at you before making a giant leap towards you."
    },
    {
      "title": "Heal your characters.",
      "content": "Heal your characters. If a character has downed, use food to revive them. If a character is running low on HP, give them food to replenish. Alternatively, use a character that can generate HP."
    },
    {
      "title": "Avoid the falling icicles.",
      "content": "Avoid the falling icicles. After Andrius reaches 50% HP, he will summon icicles from the sky. You will have to stay in the center to avoid Cryo damage over time from the edges."
    },
    {
      "title": "Keep away from the Anemo circle.",
      "content": "Keep away from the Anemo circle. After charging at you, Andrius may roar to deal Anemo damage. Stay out of the green circle to avoid this."
    },
    {
      "title": "Stay off the ice paths.",
      "content": "Stay off the ice paths. Andrius may Andrius may shatter this ice to deal even more area-of-effect damage."
    },
    {
      "title": "Dodge the wind blades.",
      "content": "Dodge the wind blades. These will deal Anemo damage. They will form directly in front of Andrius."
    },
    {
      "title": "Watch for the phantom wolf.",
      "content": "Watch for the phantom wolf. If you take too long to defeat Andrius, then small phantom wolves will spawn to attack you. This is a low damage attack, but it can add up over time."
    },
    {
      "title": "Use a caster when midrange.",
      "content": "Use a caster when midrange. A caster can launch elemental attacks without the need for elemental burst or elemental skill. For example, Lisa can launch Electro attacks without needing to be super far."
    },
    {
      "title": "Use an archer when longrange.",
      "content": "Use an archer when longrange. An archer can launch arrows over an even further distance. They can also launch charged elemental attacks. For example, Amber can launch Pyro arrows into the air. These require aiming, though."
    },
    {
      "title": "Use a claymore when doing melee combat.",
      "content": "Use a claymore when doing melee combat. A claymore can deal strong attacks quickly and effectively. It will also allow you to launch elemental skill attacks that involve your weapon."
    },
    {
      "title": "Combine multiple elements.",
      "content": "Combine multiple elements. Aside from Anemo and Cryo, Andrius can take damage from any two elements in elemental reactions. For example, mix Pyro with Electro to overload Andrius."
    },
    {
      "title": "Repeat to the end.",
      "content": "Repeat to the end. After defeating Andrius, a Trounce blossom will spawn in the center of the arena. Green lines will move towards the Ley Line as Andrius turns into elemental dust. You can only complete this challenge once per week. The challenge resets at midnight every Monday."
    },
    {
      "title": "Locate the Trounce Blossom.",
      "content": "Locate the Trounce Blossom. This looks a bit like a wilted flower and is in the center of the current platform you are on."
    },
    {
      "title": "Use the Resin to revitalize the blossom.",
      "content": "Use the Resin to revitalize the blossom. If you do not have enough Original Resin, you can use Fragile Resin instead."
    },
    {
      "title": "Collect rewards.",
      "content": "Collect rewards. Depending on your level, you may get different rewards, but you will always get 200 EXP."
    }
  ]
}