{
  "url": "https://www.wikihow.com/Cook-Lambs-Heart",
  "title": "How to Cook Lambs Heart",
  "steps": [
    {
      "title": "Preheat your oven to 180 °C (356 °F).",
      "content": "Preheat your oven to 180 °C (356 °F). Turn your oven to the bake setting and set it to 180 °C (356 °F). Place the oven rack in the middle shelf of the oven. This will help the lamb hearts to cook evenly. Most ovens take at least 10 minutes to heat up."
    },
    {
      "title": "Dice the onion.",
      "content": "Dice the onion. Chop the onion in half and peel off the skin. Use a sharp knife to dice the onion into small pieces. If you don’t like onion you can skip this step and leave the onion out. [1] X Research source"
    },
    {
      "title": "Add the onion, garlic and olive oil into a frying pan.",
      "content": "Add the onion, garlic and olive oil into a frying pan. Pour a splash of olive oil into the bottom of a medium-sized frying pan. Add 1 crushed garlic and the finely chopped onions. If you don’t like the taste of olive oil, use rice bran oil instead. [2] X Research source Use cold-pressed olive oil if possible, as this is the richest in nutrients."
    },
    {
      "title": "Fry the garlic and onion for 10 minutes on medium heat.",
      "content": "Fry the garlic and onion for 10 minutes on medium heat. Place the frying pan onto the cooktop at a medium heat. Gently stir the onion and garlic for 10 minutes using a spatula. After 10 minutes, check that the onions are soft. If not, fry them for a few more minutes. [3] X Research source If the oil is spitting up at you, turn down the heat."
    },
    {
      "title": "Remove the pan from the heat and allow it to cool for 20 minutes.",
      "content": "Remove the pan from the heat and allow it to cool for 20 minutes. Transfer the frying pan to a heatproof surface, like a chopping board. Allow the onion and garlic to completely cool. [4] X Research source"
    },
    {
      "title": "Place the onion, garlic, sausage meat, herbs and breadcrumbs into a bowl.",
      "content": "Place the onion, garlic, sausage meat, herbs and breadcrumbs into a bowl. Measure 100 grams (3.5 oz) of sausage meat, 25 grams (0.88 oz) of stale bread crumbs, 4 teaspoons of chopped lemon thyme and 1 cup of chopped parsley into a medium-sized bowl. Add the cold onion and garlic into the bowl. [5] X Research source If you don’t like lemony thyme, substitute this for another herb, such as coriander or basil."
    },
    {
      "title": "Mix the ingredients until they are well combined.",
      "content": "Mix the ingredients until they are well combined. Stir the ingredients together using a large spoon. Use circular motions to mix the ingredients into each other. Continue mixing until all the ingredients are integrated. [6] X Research source If you find that the ingredients aren’t combining well, use clean hands to squeeze the mixture together."
    },
    {
      "title": "Sprinkle salt and pepper evenly over the mixture.",
      "content": "Sprinkle salt and pepper evenly over the mixture. Lightly season the mixture with salt and pepper. Use about 4 pinches of salt and pepper."
    },
    {
      "title": "Use a spoon to push the stuffing into the opening.",
      "content": "Use a spoon to push the stuffing into the opening. Scoop up some stuffing mixture onto a spoon and push it into the opening of the lamb heart. Gently shake the spoon inside the lamb heart to remove the stuffing. Keep pushing stuffing into the heart cavity until it’s full. Repeat this process for the other lamb heart. [7] X Research source"
    },
    {
      "title": "Wrap 3 rashers of bacon around each heart and tie with butcher's string.",
      "content": "Wrap 3 rashers of bacon around each heart and tie with butcher's string. Spread the rashers out so that you cover as much of the lamb heart as possible. Use smoked streaky bacon if possible, as this has the most flavor. [8] X Research source Make sure that you cover the stuffing hole with the bacon as this stops the stuffing from coming out while the hearts cook."
    },
    {
      "title": "Tie a piece of butchers string around the middle of the heart.",
      "content": "Tie a piece of butchers string around the middle of the heart. Secure the bacon onto the heart by wrapping string around the circumference of the heart and fasten it with a knot. Purchase butcher’s string from a butchery or cooking store. [9] X Research source"
    },
    {
      "title": "Melt the butter in a small saucepan.",
      "content": "Melt the butter in a small saucepan. Measure 2 ounces (57 g) of butter into a small saucepan. Place the saucepan onto the cooktop at a medium heat. Once the butter is completely melted, remove the saucepan from the heat."
    },
    {
      "title": "Brush the hearts with half of the melted butter.",
      "content": "Brush the hearts with half of the melted butter. Dip a pastry brush into the melted butter and liberally brush the top of the lamb hearts. Cover the entire top surface of the bacon with butter. This helps the bacon to crisp while the hearts are cooking."
    },
    {
      "title": "Transfer the hearts to a small ovenproof dish.",
      "content": "Transfer the hearts to a small ovenproof dish. Gently pick up the lamb hearts and place them into a small ovenproof dish. Spread the lamb hearts apart so they aren’t touching. Place non-stick paper into the bottom of the pan to stop the lamb hearts from sticking to the dish."
    },
    {
      "title": "Place the lamb hearts into the oven for 25 minutes.",
      "content": "Place the lamb hearts into the oven for 25 minutes. Place the dish into the middle shelf of the oven. Leave the lid off so that the bacon becomes crispy. Make sure that the oven is on the “bake” setting."
    },
    {
      "title": "Remove the dish from the oven and brush the hearts with the remaining butter.",
      "content": "Remove the dish from the oven and brush the hearts with the remaining butter. Use oven mitts to carefully remove the dish from the oven. Place the dish onto a heatproof surface, such as a chopping board. Brush the rest of the melted butter onto the lamb hearts using a pastry brush. Cover the hearts evenly with the butter."
    },
    {
      "title": "Place the hearts back in the oven for 20 minutes.",
      "content": "Place the hearts back in the oven for 20 minutes. Transfer the dish back into the middle shelf of the oven. Remove the hearts after 20 minutes. The bacon on the outside should be crispy and browned. Use an instant-read thermometer to check that the middle of the hearts have risen to a temperature of 160 °F (71 °C). Continue to cook the hearts until they reach this temperature. [10] X Trustworthy Source Food Safety and Inspection Service of the USDA Food safety information provided by the U.S. Department of Agriculture. Go to source"
    },
    {
      "title": "Serve the lamb hearts with your favorite sides.",
      "content": "Serve the lamb hearts with your favorite sides. Transfer the hearts onto dinner plates. Serve the hearts with vegetables such as mashed potatoes, carrots or beans. Consider adding a gravy or plum sauce to compliment the meal. Store leftover lamb hearts in an airtight container in the fridge. The hearts are safe to eat for 3-5 days after cooking. [11] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source"
    }
  ]
}