{
  "url": "https://www.wikihow.com/Check-the-Temperature-and-Humidity-on-Your-Android",
  "title": "How to Check the Temperature and Humidity on Your Android",
  "steps": [
    {
      "title": "Install Barometer & Altimeter from the Google Play Store .",
      "content": "Install Barometer & Altimeter from the Google Play Store . Barometer and Altimeter is a free Android app that reports the temperature and humidity using your Android's built-in sensors. [1] X Research source If your Android does not have built-in sensors, the app uses your GPS to find the temperature and humidity based on a nearby weather station. Most newer Androids do not have built-in ambient temperature and humidity sensors. [2] X Research source Some Androids that do have these sensors are the Samsung Galaxy Note 3, AGM X2, Galaxy S4, Motorola Moto X, and the Moto X 2nd Generation. To download the app , open the Play Store, search for \"Barometer & Altimeter,\" and then tap the search result that lists the developer as \"EXA Tools.\" Tap Install to install."
    },
    {
      "title": "Open Barometer & Altimeter.",
      "content": "Open Barometer & Altimeter. If you're still in the Play Store, tap Open to launch the app once it's installed. If not, tap the blue-and-white icon that says \"inHg\" below a round meter."
    },
    {
      "title": "Turn on location services if you haven't already.",
      "content": "Turn on location services if you haven't already. If your location services are disabled, you'll be prompted to enable them now . Follow the on-screen instructions to do so."
    },
    {
      "title": "Tap the Data tab.",
      "content": "Tap the Data tab. It's at the bottom-right corner. This displays the local humidity level, your current estimated altitude level, and temperature. The temperature is listed next to the icon that resembles a thermometer. The humidity is listed below the small icon that resembles a dial with a drop next to it."
    },
    {
      "title": "Install AccuWeather on your phone or tablet.",
      "content": "Install AccuWeather on your phone or tablet. AccuWeather is a free app that can provide you with extremely-local weather information, including the temperature and humidity level in your area. AccuWeather does not need to use any special sensors built-in to your Android, but you'll need to turn on location services to get accurate info. To download AccuWeather, open the Play Store app, search for \"AccuWeather,\" tap AccuWeather (the app with an orange sun icon) to open the details page, and then tap Install . [3] X Research source There are many other free weather apps available for your Android, but AccuWeather is known for its ability to display up-to-date information based on your precise location."
    },
    {
      "title": "Open AccuWeather.",
      "content": "Open AccuWeather. If you're still in the App Store, tap Open to launch the app. Otherwise, to open it later, tap the orange sun icon in your app list."
    },
    {
      "title": "Review the terms and tap I accept the terms and conditions.",
      "content": "Review the terms and tap I accept the terms and conditions . If you want to read the terms first, you can do so by tapping the Terms of Use link above the button."
    },
    {
      "title": "Tap ALLOW to allow AccuWeather to use your location.",
      "content": "Tap ALLOW to allow AccuWeather to use your location. AccuWeather needs your location to provide you with accurate information. If prompted, you can choose to allow AccuWeather to use your info to improve the app. If you're not interested, tap DON'T ALLOW ."
    },
    {
      "title": "Add your location(s).",
      "content": "Add your location(s). If your Android's location services aren't enabled, tap the Location option to enable them now. If you already have Location services enabled, tap Allow to allow your phone access to your location services. [4] X Research source To add additional locations, tap your current location at the top. Enter a city or zip code in the search bar. Then tap the location you want to add. You can add up to 10 locations. Tap the \"x\" icon in the upper-left corner to close the location page."
    },
    {
      "title": "Find the temperature and humidity levels on the Today tab.",
      "content": "Find the temperature and humidity levels on the Today tab. It's in the lower-left corner. This tab displays the current conditions at your location. Scroll down to the bottom of the page. You can see the current temperature next to \"Temperature\" and the humidity is listed next to \"Humidity.\" You can also check the indoor humidity below \"Humidity.\" You can also view hourly temperature and humidity levels by tapping the Hourly tab and selecting a time. You need a premium subscription to check the hourly humidity. To change your preferences, such as changing Fahrenheit to Celsius, tap the three horizontal lines at the top-left corner and select Settings . Tap whichever unit you want to use under \"Units.\" You'll also find the option to manage notifications here."
    }
  ]
}