{
  "url": "https://www.wikihow.com/Attract-Frogs",
  "title": "How to Attract Frogs",
  "steps": [
    {
      "title": "Provide a shallow, non-moving water source.",
      "content": "Provide a shallow, non-moving water source. Frogs drink and breathe through their skin, which needs to be kept constantly moist in order for them to perform these basic life functions. Thus, the most essential requirement for attracting frogs is an accessible source of fresh water that's out of direct sunlight. If you don't have a pond or other built-in water source in your yard, simply place some large, shallow dishes of water in a shady area of your lawn or garden. Be sure to clean the dish and change the water weekly so that it doesn't stagnate. [2] X Research source You could also try sinking a shallow plastic tub into the ground to provide a makeshift pond. Frogs also spawn in water. Ideally, your water source or sources should be large enough to accommodate adult and young frogs."
    },
    {
      "title": "Give them a shady, damp shelter.",
      "content": "Give them a shady, damp shelter. Frogs are generally more active at night since too much exposure to the sun puts them at risk of dehydration. Create a simple shelter for frogs that will offer them a safe, cave-like space to rest during the day. It should be out of the sun and predators' reach. [3] X Research source You can create a simple shelter using an overturned ceramic pot propped up by some rocks. Place it in a shady location near to a water source, and leave just enough room between the rim of the pot and the earth for frogs to slip in and out."
    },
    {
      "title": "Plant to attract insects.",
      "content": "Plant to attract insects . If you want frogs to show up in your yard or garden, you need to provide them with adequate food. The best way to do that is plant a range of seasonal flowering plants that will attract insects throughout the year. Aim to always have something in bloom during the spring, summer, and fall. That way, nectar-eating bugs will flock to your yard."
    },
    {
      "title": "Keep a compost heap and mulch the beds in your garden.",
      "content": "Keep a compost heap and mulch the beds in your garden. The bugs that are attracted to a compost heap and mulch also make great food for frogs. Compost and mulch can also provide the damp conditions where frogs love to live. [4] X Research source Do not remove leaf litter from some areas in your yard. Leaf litter provides shelter for frogs and some of their prey also prefers areas with leaf litter. [5] X Research source"
    },
    {
      "title": "Choose a good spot.",
      "content": "Choose a good spot. It should be a partially shaded corner of your yard. Ponds need some direct sunlight to be a healthy environment. However, frogs prefer shaded environments for breeding and shelter from the sun. [6] X Research source"
    },
    {
      "title": "Dig a shallow hole.",
      "content": "Dig a shallow hole. Frog ponds can be as wide as you want, but they should be no more than a foot (or about 30 cm) deep. Be sure that your hole has shallow edges in it so that the frogs can enter and leave easily. Remove any roots, sticks, or stones that could damage the liner. [7] X Research source Frogs thrive best in shallow, non-moving water and are surprisingly susceptible to drowning in deeper water. If you don't have tapering edges to your pool, you'll need to provide some sort of incline. Frogs need a gently sloping exit, like a slab of rock, so they can easily get out of the water. If you would like your pond to be a specific shape, mark out the edges with a piece of rope before digging. If you're digging up your lawn, keep the pieces of turf to help you secure the pond's edges."
    },
    {
      "title": "Line the hole.",
      "content": "Line the hole. To keep the water in, you'll need a rubber or plastic pond liner. To protect the liner in the long-term, it's also a good idea to first insert a protective underlay between the plastic and the dirt to cushion the liner. [8] X Research source The easiest way to line your pond is to purchase a flexible or rigid plastic pond liner. However, any thick, durable plastic sheeting will do. Make sure that your liner is big enough to cover the entirety of your pond with a least two feet (about 60 cm) of excess on all sides. Ponds can also be lined with concrete, but you will need to treat it to ensure that lime does not leach into the water."
    },
    {
      "title": "Secure the pond's perimeter.",
      "content": "Secure the pond's perimeter. Weigh down the plastic sheet around the edges of your pond with closely-packed rocks, and/or ring it with the pieces of turf you kept from digging the hole where your pond would go. Either way, make sure your perimeter is heavy and big enough to keep the liner in place. [9] X Research source Once you've secured the pond's perimeter, you can cut away any excess liner."
    },
    {
      "title": "Let the pond fill with water.",
      "content": "Let the pond fill with water. Ideally, you should let your pond fill with rainwater rather than filling it from the hose or tap. You can speed up that process by collecting rain in buckets to add to the pond. [10] X Research source"
    },
    {
      "title": "Add a bucket of natural pond water.",
      "content": "Add a bucket of natural pond water. If you mix in a bucket-full of water taken from a local marsh or pond, it will introduce millions of microscopic organisms that can jump-start your pond's ecosystem. They will infuse the water with oxygen, making it more livable and appealing to native frogs in your area. [11] X Research source You can also try planting a few native water plants in your pond to attract local frogs. Just make sure that the plants don't overtake the whole pond and choke other wildlife out."
    },
    {
      "title": "Give frogs cover.",
      "content": "Give frogs cover. At least one edge of the pond should be thickly vegetated with leafy plants that grow well in your area. Plant grasses and leafy perennials around the edges of the pond to provide frogs with adequate shade, dampness, and protection. If you are looking to attract local species, it's a good idea to stick to native plants when planting around your pond. Pick a selection of native grasses, clumping plants (like ferns and lilies), and ground cover (like shrubs and vines) to grow around your frog pond."
    },
    {
      "title": "Wait for frogs to colonize your yard or garden.",
      "content": "Wait for frogs to colonize your yard or garden. Keep in mind that it may take a couple years for frogs to populate your garden, even after you have created a suitable environment for them. If attracting frogs takes longer than you would like, you can try seeding your pond with tadpoles in the spring. Make sure you use a type of tadpole that is native to your area."
    },
    {
      "title": "Avoid using chemicals",
      "content": "Avoid using chemicals . Frogs are especially susceptible to poisoning from pesticides, herbicides, synthetic fertilizers, and other common garden chemicals because their hydration and respiration takes place through their porous skin. If you want to attract a healthy frog population, start by using organic gardening practices. [12] X Research source Instead of using synthetic fertilizer, encourage growth through picking nutrient-rich soils that are appropriate to each plant, rotating your crops to keep your soil rich, and using organic fertilizer when necessary. Keep in mind that once you've attracted frogs, you shouldn't have any need of chemical pesticides since a single frog will consume more than 10,000 bugs a season."
    },
    {
      "title": "Keep out invasive species.",
      "content": "Keep out invasive species. You want to attract the right kind of frogs. Non-native frogs will compete with local ones for food and shelter. Sometimes they'll even eat local species. Their populations are also generally difficult to control because they have no natural predators. [13] X Research source Identify the species of frogs in your yard or garden to be sure that they're not invasive. Invasive.org has a list of dangerous non-native wildlife that can be searched by animal type and region. [14] X Research source If you do find invasive species of frogs in your yard or garden, contact your local government environmental agency, like your state's DNR, or a nonprofit conservation group, like the National Wildlife Federation, for advice and support about how to remove them responsibly."
    },
    {
      "title": "Keep your grass short.",
      "content": "Keep your grass short. Frogs like to hide in tall grass and are frequent victims of lawn mowers. Be sure that you can see any rogue amphibians in your path by keeping the grass in your yard or garden well-trimmed."
    },
    {
      "title": "Thaw water sources when necessary.",
      "content": "Thaw water sources when necessary. Most male frogs hibernate in water over the winter. A thin layer of ice will not harm them. However, if their water source is completely frozen, they won't survive. Protect any dormant amphibians by putting a pan of hot water over thickening ice."
    },
    {
      "title": "Avoid plants that are toxic to frogs.",
      "content": "Avoid plants that are toxic to frogs. Many flowers and vegetables are poisonous to frogs. Protect the amphibian population in your yard or garden by either not planting species that are toxic to them or by planting them well away from your intended frog habitat. [15] X Research source Vegetables that are dangerous for frogs include eggplant, rhubarb, snow peas, and potatoes. Flowers that are toxic to frogs include honeysuckle, azaleas, hydrangeas, daffodils, and hyacinth."
    },
    {
      "title": "Keep an outdoor light on at night.",
      "content": "Keep an outdoor light on at night. Tree frogs love to eat the moths and insects that are attracted to light sources. Keep a garden light on for part or all of the night in order to create an irresistible feeding spot for them."
    },
    {
      "title": "Don't trim your trees.",
      "content": "Don't trim your trees. You can provide tree frogs with natural habitat by avoiding trimming back bushes and tree branches near water or food sources. Keeping your trees and shrubs leafy and full will give frogs plenty of cover. It will also provide them with good hunting grounds."
    },
    {
      "title": "Make a ground home for tree frogs.",
      "content": "Make a ground home for tree frogs. Tree frogs won't gather in normal frog abodes on the ground; give them an alternative with a bit of height. Get a piece of PVC piping that's about 5 feet long. Drive it into the ground so that roughly half of the pipe is left exposed. Place the PVC pipe about a foot from the base of a tree that's near a water source. Water may gather in the bottom of the pipe, but it should be absorbed by the underlying ground before it reaches a dangerous depth. PVC pipe is available from most home improvement stores."
    },
    {
      "title": "Hang frog refuges in a tree.",
      "content": "Hang frog refuges in a tree. Cut standard schedule-20 PVC piping into pieces that are about 2 feet in length. Cap the bottom-side of the pipe, and drill a hole about 3 or 4 inches above the capped bottom so that water can both gather and escape from the refuge. [16] X Research source Drill two holes on one side of the top of each pipe. String the holes with heavy fishing line, and tie the refuges around a tree. If possible, pick a tree that's near a water source since that's the place where frogs are most likely to congregate naturally. Keep the PVC refuges at a height that is easy for you to reach. Take the caps off at least once a month so that water doesn't stagnate in the bottom of them."
    }
  ]
}