{
  "url": "https://www.wikihow.com/Age-Wood",
  "title": "How to Age Wood",
  "steps": [
    {
      "title": "Know what happens when steel wool and vinegar interact.",
      "content": "Know what happens when steel wool and vinegar interact. Placing steel wool in vinegar will, over time, dissolve the wool. This combines with the vinegar to create an aging stain."
    },
    {
      "title": "Create the steel wool-vinegar solution.",
      "content": "Create the steel wool-vinegar solution. Fill a glass jar with vinegar, and place a fist-sized chunk of steel wool inside it. Let it settle for a minimum of one day, but up to five days for a darker solution. [1] X Research source"
    },
    {
      "title": "Prepare your wood.",
      "content": "Prepare your wood. Sand it to remove any stain or coating which might prevent your aging solution from adhering properly."
    },
    {
      "title": "Make a tea stain.",
      "content": "Make a tea stain. Boil black tea to brush onto the wood prior to using your steel wool solution. Tea contains tannic acid, which reacts with the vinegar stain and darkens it. The tea will not add any color by itself, it will only make the wood appear wet."
    },
    {
      "title": "Apply the steel wool-vinegar solution.",
      "content": "Apply the steel wool-vinegar solution. Use a paintbrush to give a thorough coat to the wood. You should see an immediate change in color, which will dry after a few hours. Only one coat is necessary to give the “aged” look, but multiple coats can be applied to darken the wood."
    },
    {
      "title": "Finish the wood.",
      "content": "Finish the wood. Allow time to dry, and then use a damp rag and cold water to remove any residue from the steel wool. This can be the finished product, but if desired, a wax coating can be applied to preserve the effect. [2] X Research source"
    },
    {
      "title": "Apply a coat of sun bleach stain to your wood.",
      "content": "Apply a coat of sun bleach stain to your wood. Allow time to set and then wipe off the excess. This will remove any previous color or stain from the wood, and enhance the natural grain and texture."
    },
    {
      "title": "Add a layer of early American stain.",
      "content": "Add a layer of early American stain. This particular stain gives the appearance and color of wood that has been left for many years. If desired, this can be the final step."
    },
    {
      "title": "Make a rustic stain.",
      "content": "Make a rustic stain. Combine your own unique combination of a color glaze, antiquing glaze, and mixing glaze. Be sure to use all three glazes from the same brand, so as to insure proper color mixing."
    },
    {
      "title": "Apply the rustic stain.",
      "content": "Apply the rustic stain. Use a paintbrush to thoroughly coat the wood with the stain. There are multiple methods to do this: Apply a single coat for a lighter look. This also can give the appearance of slightly newer wood. Add multiple coats of stain to create a more worn look. This will also darken the wood, giving it a richer color. Create “freckles” on your wood by flicking stain using a paintbrush or toothbrush. This will give irregular small spots of dark color on the wood. [3] X Research source"
    },
    {
      "title": "Paint your wood.",
      "content": "Paint your wood. Use any hue of your choice, but it must be an acrylic paint."
    },
    {
      "title": "Apply white school glue.",
      "content": "Apply white school glue. Use a generous amount to completely coat the wood. You should apply enough glue so that it appears opaque. Allow it to partially dry, until tacky. [4] X Research source"
    },
    {
      "title": "Add a second coat of paint.",
      "content": "Add a second coat of paint. Brush the paint over the still tacky glue, and allow time to dry."
    },
    {
      "title": "Wait for the crackle effect to start taking place.",
      "content": "Wait for the crackle effect to start taking place. It may take several hours for it to appear, after the glue and paint completely dry. [5] X Research source"
    },
    {
      "title": "Distress wood with nails in a sock.",
      "content": "Distress wood with nails in a sock. Pour nails or screws into a sock, and hit the wood until it reaches your desired level of distress. [6] X Research source"
    },
    {
      "title": "Hit the wood with a hammer or mallet.",
      "content": "Hit the wood with a hammer or mallet. Soft strikes with a hammer will create small divots in the wood, while a mallet will make wider impressions. [7] X Research source"
    },
    {
      "title": "Rub the wood with sandpaper.",
      "content": "Rub the wood with sandpaper. This will remove areas of stain and give the wood a rough texture, as is likely to occur in a natural setting over time."
    },
    {
      "title": "Make \"wormholes\" with drywall screws hammered into a 2x4.",
      "content": "Make \"wormholes\" with drywall screws hammered into a 2x4. If you want to give your wood the appearance of having been eaten by worms over many decades, you can try to give it wormholes yourself. Hammer or screw the drywall nails into the 2x4 completely so that their ends stick through the bottom of your makeshift hammer. Next, strike the piece of wood with your wormhole hammer repeatedly, creating small puncture marks. [8] X Research source To create a more interesting wormhole pattern, be sure to hammer your drywall screws into the 2x4 in an irregular pattern. Turn the wormhole hammer around and strike your wood at different angles to create a more natural looking effect."
    }
  ]
}