{
  "url": "https://www.wikihow.com/Calm-Your-Angry-Cat",
  "title": "Here's How to Calm Your Angry & Irritated Cat",
  "steps": [
    {
      "title": "Consider the motivation for your cat’s anger.",
      "content": "Consider the motivation for your cat’s anger. A cat’s primary motivation for displaying angry or aggressive behavior is fear. Cats are not as domesticated as dogs and easily revert to their wild state. This means that cats are one step away from being a wild animal still and many wild animals live in a constant state of alertness for danger, including a fear of people. [1] X Research source Top of the list for inducing fear is strangers, simply because a cat doesn't know what that person is all about until they've had time to observe and trust that the person is cat friendly. Keep in mind that the reason for your cat’s fear may not always be immediately apparent to you. [2] X Research source Why Does My Cat? Sarah Heath. Publisher: Souvenir Press For example, your cat may begin to hiss at a toddler because the child pulled on the cat’s tail at some point when you weren’t in the room. The cat may then associate the toddler with pain in a way that causes the cat to become fearful. [3] X Research source Why Does My Cat? Sarah Heath. Publisher: Souvenir Press A poorly socialized cat can even have a strong fear of strangers and strange surroundings."
    },
    {
      "title": "Recognize behaviors associated with fear or anger in your cat.",
      "content": "Recognize behaviors associated with fear or anger in your cat. Reading your cat's body language can help avoid conflict. It is useful to recognize both fear and aggression. However, there is an overlap between both sets of behavior, so don't get too hooked up on differentiating the two. The important thing is to recognize the cat is stressed, and stressed leads to possible attack. Be aware that a cat can turn from being calm to afraid or angry in a matter of seconds. Signs of fear or aggression include: [4] X Research source Why Does My Cat? Sarah Heath. Publisher: Souvenir Press [5] X Research source Piloerection (hairs standing up) Dilated pupils A direct stare at you (precedes attack) Averting its gaze (fear) Whiskers stiff and drawn back Ears flattened against the head A hunched body posture Growling Drawing backs the lips and hissing."
    },
    {
      "title": "Consider the purpose behind usual “angry” behavior.",
      "content": "Consider the purpose behind usual “angry” behavior. Though most of these behaviors are often thought of as signs that an angry cat is about to attack, the behaviors are more typical of a stressed and fearful cat that wants to escape the situation. [6] X Research source Why Does My Cat? Sarah Heath. Publisher: Souvenir Press"
    },
    {
      "title": "Look for signs of \"redirected aggression\".",
      "content": "Look for signs of \"redirected aggression\". This term applies when one cat takes out its anger on another cat or person even though the source of the anger was someone or some other cat completely different. If this happens to two cats living together, it can be quite difficult to get them to get along with each other again, depending on how serious the attack was. [7] X Research source"
    },
    {
      "title": "Look for biting during play.",
      "content": "Look for biting during play. Be aware that some cats will get overexcited during play and may bite or scratch, which can be misinterpreted as aggressive behavior. If your cat is in a more-aggressive play mood, then you can always use dangling toys to keep your hands and fingers away from the play bites."
    },
    {
      "title": "Differentiate between fearful behavior and petting-induced aggression.",
      "content": "Differentiate between fearful behavior and petting-induced aggression. Petting-induced aggression is common in some cats. The behavior doesn’t necessarily have to be at first pet. The cat may seem to enjoy the petting before suddenly becoming aggressive at the act. However, this should not be confused with anger. Reasons behind the aggression may include: [8] X Research source The cat using the behavior as a way of saying, \"That's enough thanks.” The cat becoming so dozy with pleasure that it suddenly startles awake and bites in self-defense. This form of aggression often occurs in single kittens (only one in the litter) or hand-raised kittens. They lack socialization with other kittens, who would swipe them back if they lashed out too hard or bit too hard. However, do NOT swipe your cat back. Instead, learn to read the body language that the cat is about to flip. The cat may give a single, telltale twitch of the tail, or it may stop purring and the skin on its back may twitch. At this point, immediately stop petting the cat and stand up to tip it off your lap. [9] X Research source Feline behavior: A guide for veterinarians. Bonnie Beaver, Publisher: Saunders"
    },
    {
      "title": "Take care of your own safety before all else.",
      "content": "Take care of your own safety before all else. If your cat is angry with you or has redirected its aggression toward you, then you are a possible target for an attack, which can result in scratches or bites. However, most cats will not actually attack unless you continue provoking it after the initial warning behaviors. If you actually need to handle the cat, wear protective clothing and throw a blanket over the cat to help subdue the animal. However, this is only a short-term solution if it is essential to catch the cat because of potential injury. It will do nothing to endear you to the cat and will make it even less cooperative next time. Have a water pistol readily accessible if you live with a cat. It can be an ideal method for squirting an angry cat without having to get your hands involved. It might be enough to separate brawling cats and it can certainly be a good source of defense if the cat decides to attack you through redirected aggression."
    },
    {
      "title": "Back off.",
      "content": "Back off. The best step you can take once you’ve recognized a behavior associated with your cat being angry or fearful is to simply back off. Step away from the cat in a way that reduces the fearful response. If possible, leave the room the cat is in, or if the cat is reacting to another person or animal, then have them leave the room. If you cannot leave the room, then make sure you back away in a manner that doesn’t block the exit since the cat may want to leave the room. [10] X Research source Feline behavior: A guide for veterinarians. Bonnie Beaver, Publisher: Saunders You’ll likely want to leave the cat alone for ten or twenty minutes to give it enough time to calm down. If the “threat” is another cat you’ve just brought home, then the desensitization process can take time, and you should keep the cats separated with only gradual introduction. You can find more information on the topic at: How to Bring a Second Cat Into the Family and Not Make Your Old Cat Upset"
    },
    {
      "title": "Make yourself small.",
      "content": "Make yourself small. Don’t stand over or stare at the cat while it’s in an agitated state as this amplifies the threat. If you are in no immediate danger and eager to help a fearful cat feel more confident, either lie on the floor so you are less of a threat, or make yourself small by sitting down. [11] X Research source Feline behavior: A guide for veterinarians. Bonnie Beaver, Publisher: Saunders"
    },
    {
      "title": "Ignore the cat.",
      "content": "Ignore the cat. Taking your focus off the cat completely gives the cat the opportunity to assess you at its own pace to realize that you aren’t a threat. This includes relaxing your body language and your voice. Try talking to someone else in the room or even softly singing to yourself. Instead of creating tension, this reinforces the impression that the cat has nothing to be concerned about. [12] X Research source Feline behavior: A guide for veterinarians. Bonnie Beaver, Publisher: Saunders"
    },
    {
      "title": "Provide safe places for your cat.",
      "content": "Provide safe places for your cat. Often, your cat may simply deal with its own fearful reactions by finding a safe place to hide. For instance, if your cat fears strangers, it will likely hide at the first sign of a doorbell or knock at the door. Consider keeping the cat’s kennel in a quiet, undisturbed room, giving the cat a place to hide until it decides it’s ready to come back out. [13] X Research source Why Does My Cat? Sarah Heath. Publisher: Souvenir Press Cats can feel a similar sense of security from high-up places as well. Consider providing a cat tower with a high perch for the cat to hide away, especially if a new dog in the home is the source or your cat’s fearful behavior."
    },
    {
      "title": "Approach your cat slowly and with caution.",
      "content": "Approach your cat slowly and with caution. After you have given your cat time and space to calm down, approach cautiously without actually touching the cat. You need to be sure that all visible signs of anger are gone, including the raised fur, hissing, and arched back. However, even with these visible signs gone, your cat may still be harboring feelings of anger and be flighty and afraid, so taking it slowly is important."
    },
    {
      "title": "Let the cat come to you.",
      "content": "Let the cat come to you. Sit or lie on the floor with treats in your hand. Let the cat sniff and explore around you. Even if the cat keeps its distance and just watches you, this builds confidence in the long term that you are not threat. If your cat wasn’t at all socialized to humans in the first twelve weeks of its life, then this step is crucial. Trying to make first contact will only make the cat more fearful of you. Always let the cat initiate physical contact by sniffing your and then rubbing its head against you. This transfers some of the cat’s scent onto you and makes you a bit safer in its eyes. Even then, do not reach out to the cat. Think of this as a test. You can pass the test by sitting utterly still and letting the cat feel in control. Only after it comes to you regularly should you very slowly reach out and attempt to stroke the animal. [14] X Research source Feline behavior: A guide for veterinarians. Bonnie Beaver, Publisher: Saunders"
    },
    {
      "title": "Use food.",
      "content": "Use food. [15] X Expert Source Brian Bourquin, DVM Veterinarian Expert Interview. 20 December 2019. Shake a bag of treats or open a can of your cat’s favorite food and place it in the food bowl. Be sure that there is plenty of fresh water available since the cat may be very thirsty after such high emotions. However, don't force food or drink on your cat. The animal will know it's there when it's ready. [16] X Research source The Cat Whisperer. Clair Bessant. Publisher: Black Publishers."
    },
    {
      "title": "Do not punish the cat.",
      "content": "Do not punish the cat. [17] X Expert Source Brian Bourquin, DVM Veterinarian Expert Interview. 20 December 2019. Never, under any circumstances punish your cat. Remember, aggression is born of fear, so punishing the cat only ramps up fear and makes another aggressive display more likely. Instead, fight anger with loving patience. [18] X Research source The Cat Whisperer. Clair Bessant. Publisher: Black Publishers."
    },
    {
      "title": "Contact your veterinarian.",
      "content": "Contact your veterinarian. Illness or pain can lead to your cat exhibiting angry or aggressive behavior. If your cat begins suddenly displaying angry or fearful behaviors despite previously being docile (or if you simply haven’t made any progress with the above steps), then see your vet to rule out any medical conditions. [19] X Research source Common causes include high fever , tooth pain, gingivitis, abscesses, wounds, arthritis, fractures, ear problems and sprains or strains. Fur balls can sometimes trigger an angry response in a cat where the fur ball is causing colic or gastric inflammation. [20] X Research source If the vet determines that the problem isn’t an illness, he or she may suggest anti-anxiety medication if nothing else seems to keep your cat calm. If your cat exhibits the behavior in relation to a very specific event—such as car rides or even visits to the vet—then your vet may also prescribe a mild sedative for your cat. This allows you to preemptively calm the cat before subjecting it to the stressful situation. After a few instances of experiencing the situation while sedated, you may even notice that your cat becomes desensitized to the stressor."
    },
    {
      "title": "Desensitize the cat to the environmental stressor.",
      "content": "Desensitize the cat to the environmental stressor. In situations where the person or thing inducing a fearful reaction from your cat cannot actually harm the cat, then you can try desensitizing the cat to the stressor in the same way people usually get over their own phobias. [21] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source For instance, if the stressor is a person, begin by letting the cat hear the person speaking in another room until this no longer has any effect. Then step it up to having the person on the other side of the same room as the cat while completely ignoring the cat until this has no effect. Allow the person to get closer until the cat finally chooses to make contact. To add a counterconditioning element to desensitization training, you can include treats during the process. This not only desensitizes the cat to the stressor but begins making the cat associate the person with positive reinforcement instead. [22] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Have patience.",
      "content": "Have patience. Depending on the level of socialization your cat had as a kitten, the amount of time it takes for the cat to develop trust can range anywhere from days to years. [23] X Research source Feline behavior: A guide for veterinarians. Bonnie Beaver, Publisher: Saunders"
    }
  ]
}