{
  "url": "https://www.wikihow.com/Calibrate-and-Use-a-pH-Meter",
  "title": "How to Calibrate and Use a pH Meter",
  "steps": [
    {
      "title": "Turn on your pH meter.",
      "content": "Turn on your pH meter. Before you begin to calibrate and use your pH meter you will first need to turn it on and allow adequate time for the meter to warm up. This should generally take around 30 minutes, but check your pH meter's operating manual for exact times."
    },
    {
      "title": "Clean your electrode",
      "content": "Clean your electrode . Take the electrode out of its storage solution and rinse it with distilled water under an empty waste beaker. Once rinsed, blot dry with Kimwipes or Shurwipes, which are available at most office supply stores. [1] X Research source Be sure to rinse your electrode in a waste beaker that is different from the beaker you will be calibrating in. [2] X Research source Avoid rubbing the electrode as it has a sensitive membrane around it. If you find the electrode to be particularly dirty consult your operating manual for recommended cleaning solutions."
    },
    {
      "title": "Prepare your buffers.",
      "content": "Prepare your buffers. You will generally need more than one buffer for calibrating a pH meter. The first will be a “neutral” buffer with a pH of 7, and the second should be near the expected sample pH, either a pH of 4 or 9.21. Buffers with a higher pH (9.21) are best for measuring bases, whereas buffers with a low pH (4) are best for measuring acidic samples. Once you have chosen your buffers allow them to reach the same temperature as the pH meter because pH readings are temperature dependent. Pour your buffers into individual beakers for calibration. [3] X Research source Check with your pH meter manufacturer, or current educational or professional institution, about acquiring pH buffer solutions. Buffers should be kept in a beaker for no longer than two hours. Discard the buffer when you are finished. Do not return it to its original container."
    },
    {
      "title": "Place your electrode in the buffer with a pH value of 7 and begin reading.",
      "content": "Place your electrode in the buffer with a pH value of 7 and begin reading. Press the “measure” or calibrate button to begin reading the pH once your electrode is placed in the buffer.<re> https://group.chem.iastate.edu/Holme/augmented-reality-in-educational-laboratories/ph-meter/calibration.php </ref> Allow the pH reading to stabilize before letting it sit for approximately 1-2 minutes."
    },
    {
      "title": "Set the pH.",
      "content": "Set the pH. Once you have a stable reading, set the pH meter to the value of the buffer's pH by pressing the measure button a second time. Setting the pH meter once the reading has stabilized will allow for more accurate and tuned readings. [4] X Research source Although not necessary, if you stir your buffer before measuring be sure to stir all other buffers and samples in the same way."
    },
    {
      "title": "Rinse your electrode with distilled water.",
      "content": "Rinse your electrode with distilled water. Rinse and pat dry with a lint-free tissue, like Kimwipes or Shurwipes, in between buffers. [5] X Research source"
    },
    {
      "title": "Place your electrode in the appropriate buffer for your sample and begin reading.",
      "content": "Place your electrode in the appropriate buffer for your sample and begin reading. Press the measure button to begin reading the pH once your electrode is placed in the buffer. [6] X Research source"
    },
    {
      "title": "Set the pH a second time.",
      "content": "Set the pH a second time. Once your reading has stabilized, set the pH meter to the value of the buffer's pH by pressing the measure button. [7] X Research source"
    },
    {
      "title": "Rinse your electrode.",
      "content": "Rinse your electrode. You can use distilled water to rinse. Use a lint-free tissue, like Kimwipes or Shurwipes, in between buffers to dry the electrode. [8] X Research source"
    },
    {
      "title": "Place your electrode in your sample and begin reading.",
      "content": "Place your electrode in your sample and begin reading. Once your electrode is placed in your sample, press the measure button and leave the electrode in your sample for approximately 1-2 minutes. [9] X Research source"
    },
    {
      "title": "Set your pH level.",
      "content": "Set your pH level. Once the reading has stabilized, press the measure button. This is the pH level of your sample. [10] X Research source"
    },
    {
      "title": "Clean your electrode after use.",
      "content": "Clean your electrode after use. Rinse your electrode with distilled water and blot or dab dry with a lint-free tissue. You may store your pH meter once clean and dry. [11] X Research source Consult your operation manual for optimal storage practices for your specific pH meter."
    }
  ]
}