{
  "url": "https://www.wikihow.com/Be-a-Secret-Admirer-on-Valentine%27s-Day",
  "title": "How to Be a Secret Admirer on Valentine's Day",
  "steps": [
    {
      "title": "Start out with a simple card.",
      "content": "Start out with a simple card. This is the easiest and most personal way to make contact with your crush as their secret admirer. You can either buy stationery or create your own personalized card that will contain your romantic message. The first time you contact your crush as their Secret Admirer, you want to make it clear what your purpose is. Pick out a Valentine's day card or when making your own use reds and pinks to accentuate the romantic theme."
    },
    {
      "title": "Write a thoughtful message to your crush.",
      "content": "Write a thoughtful message to your crush. Write clearly and to the point. Explain in your own words how you think they're fantastic and why you admire them so much. [1] X Research source Don't talk about yourself. This is their time to shine and you're making that happen by telling them why you think they're so special. Don't simply say “I like your hair” or other generic platitudes. You want to be sincere, unique, and specific."
    },
    {
      "title": "Disguise your handwriting.",
      "content": "Disguise your handwriting. Even your handwriting is an detail that might give away your identity. For example, if you sit beside them in class or in meetings, they may know what your penmanship looks like. Since you're writing a love note, go ahead and also take the time to make your script elegant and legible. If you normally write in print, then try writing in cursive. Or vice versa if you usually write everything in cursive. If you're worried that your handwriting is illegible and your message will be lost, then use a computer to type your message and pick a fun font."
    },
    {
      "title": "Sign both their name and yours.",
      "content": "Sign both their name and yours. Make sure that their name is visible on the card. That way, if the card is delivered in error there's a better chance it will make its way back to your crush. You don't want to send a heartfelt note and then find out that they never received it. [2] X Research source Obviously you don't want to use your real name. Instead, pick a fun pseudonym like the classic “Secret Admirer” or “Your Valentine's Day Cupid.” Make sure you are comfortable with revealing yourself to your crush if you want to use your real name.If you use your real name then you're only an admirer and not a secret one."
    },
    {
      "title": "Give them gifts.",
      "content": "Give them gifts. Depending on your research, your crush may prefer daffodils to roses, or maybe they love chocolate chip cookies and that would be a perfect surprise on a tough Monday morning. Determine what you could give them to make their day a little brighter and attach your card. Don't get too personal. Jewelry, lingerie, expensive items, or photos are better for when you're dating this person, not when you're trying to get a relationship started."
    },
    {
      "title": "Deliver your card or gift.",
      "content": "Deliver your card or gift. This is the trickiest part of being a Secret Admirer. You need to get your card or gift to this person without them knowing it was you. Sneak notes in their locker, gym bag, car window, or mailbox. Pick a location that your crush frequents regularly so that they see it. You could also enlist a friend to be the deliverer. The more anonymous you can be the better. Timing is everything. You can either start leaving notes and gifts for your crush leading up to Valentine's Day or you could use the whole holiday to lavish them with gifts and messages throughout the day. If you choose to start wooing your crush before V-Day, keep your displays of affection to one a day so that you don't spook your crush."
    },
    {
      "title": "Do thoughtful acts of kindness for them.",
      "content": "Do thoughtful acts of kindness for them. You don't just have to give physical gifts to your crush. For example, if you know they'll be occupied all day, you could wash their car and leave a small note on the windshield from their “Secret Admirer.” If you know this person well, you can find out what their needs are and help them out."
    },
    {
      "title": "Plan a scavenger hunt for your crush.",
      "content": "Plan a scavenger hunt for your crush. Instead of giving a gift or as a way to deliver a gift or card, you could create a scavenger hunt for them on Valentine's Day. This method is also a great way to lead your crush to you on the big day. Start by slipping your crush a note with the first clue. Write clues that aren't so vague that they can't figure them out and leave them in relatively nearby places. You don't want your crush running town all day so try and keep things within your school or neighborhood. With each clue, leave a small gift like a flowers or chocolates. Leave the biggest gift or most personal gesture for the end. Their excitement will build during the hunt and you want to save the biggest surprise for the grand finale."
    },
    {
      "title": "Drop clues to hint at your identity.",
      "content": "Drop clues to hint at your identity. You want to pique your crush's curiosity just a little bit. For example, in a note you could say that you love seeing them at the same coffee shop you go to every morning, or that you loved their presentation in class the other day. [3] X Research source"
    },
    {
      "title": "Pick a time to reveal yourself.",
      "content": "Pick a time to reveal yourself. Unless you want to string your crush along forever, you need to be brave and tell them who you are. At some point they're going to want to know who is responsible for all of the sweet things you've done for them. Choose a convenient time for both you and your crush. For example, plan on meeting them after their last class of the day for the big reveal. Listen to what they've been saying about their secret admirer. If it sounds like they're excited to find out who it is, then it's time to reveal yourself. If they don't seem interested, you may want to stop. You can't control another person's feelings and you should be respectful if they're feeling creeped out."
    },
    {
      "title": "Choose a public place.",
      "content": "Choose a public place. Coffee shops, parks, and restaurants are all good starts because there will be people around but not so many that you won't have privacy. Remember, you don't want to scare your crush away so pick somewhere relaxing. A bench in a park can be a beautiful setting, but a dark movie theatre will make you seem like a stalker and not an admirer."
    },
    {
      "title": "Tell your crush where and how to find you.",
      "content": "Tell your crush where and how to find you. You could write a note that says something like “I'll be wearing a red shirt and sunglasses.” Even though you're trying to convey an air of mystery, you need to be clear in your directions so that your crush can actually identify you."
    },
    {
      "title": "Introduce yourself as their Secret Admirer.",
      "content": "Introduce yourself as their Secret Admirer. If you're already involved in this person's life, they may recognize you. However, this is your moment to show them that you're their mysterious and sweet admirer. After the big reveal, follow up by asking them on an official date so that you can continue to get to know each other."
    },
    {
      "title": "Learn more about your crush.",
      "content": "Learn more about your crush. Chances are, you know this person a little bit already. You probably have a few reason already as to why you admire them. However, you will need to know a few more details in order to do things for them and not get caught."
    },
    {
      "title": "Talk to their friends and family.",
      "content": "Talk to their friends and family. If you don't know your crush too well, survey the people who are close to them. You can either ask innocent questions in a conversation or ask them outright what your crush likes and dislikes, or what their class schedule looks like. Be careful when talking with friends and family or your crush. If your crush starts to ask around trying to find out your identity, a friend might accidentally slip up. For example, they could comment that you've been asking about your crush a lot and then your cover would be blown. It may be better to tell the people you're surveying that you're going to be your crush's secret admirer if you think they can keep a secret. That way, you have someone on the inside who can help you out."
    },
    {
      "title": "Take note of their schedule.",
      "content": "Take note of their schedule. You shouldn't know when they brush their teeth every day, but it's good to know if they're busy in gym class or in a meeting. That way you can plan when you're going to leave little surprises for them without being seen or getting caught."
    },
    {
      "title": "Avoid getting to know them too well.",
      "content": "Avoid getting to know them too well. In other words, don't be creepy. If you need to do a little research to find out their favorite candy, that's fine. But don't dig so deep that you find out their shoe size and their pet's name. Do some preliminary research so that you can deliver them heartfelt notes, but you should really get to know them personally once you reveal your identity. [4] X Research source"
    },
    {
      "title": "Make a plan.",
      "content": "Make a plan. Decide what your end goal is. If you want to go on a date with this person on Valentine's Day, then you need to start wooing them a few weeks before. Or if you want to just surprise them for one day, you can create a more elaborate, one-time plan. For instance, you could have your crush go on a day-long scavenger hunt on Valentine's Day that leads up to them meeting you that evening for a date. [5] X Research source"
    }
  ]
}