{
  "url": "https://www.wikihow.com/Clean-Nicotine-Stains",
  "title": "How to Clean Nicotine Stains",
  "steps": [
    {
      "title": "Spray the stain with a gentle degreaser.",
      "content": "Spray the stain with a gentle degreaser. In order to fight off the gummy, sticky stains, you'll need something that cuts grease. You can use store-bought products like Goo-Gone, Dr. Bronner's, or Simple Green, or you can make your own. For strong stains, use 1 cup vinegar mixed with 4 cups water. Let the vinegar solution sit on the stain for a few minutes before wiping. You can add 1-2 tablespoons of ammonia for even more powerful cleaning. For smaller, gentler stains, mix 3 tablespoons baking soda with 1 cup water."
    },
    {
      "title": "Test your cleaning supplies in an unseen area before using on wood, enamel, or paint.",
      "content": "Test your cleaning supplies in an unseen area before using on wood, enamel, or paint. These surfaces are much more prone to staining and warping if you're not careful. Some cleaners can strip away sealants, coatings, and paints if you're not careful. Always read the label for suggested surfaces to clean with. When in doubt, dab a bit of cleaning solution on a small area and check back 10 minutes later. If it is not stained or warped, you should be good to go. Some cleaners to consider include: Murphy's Oil Soap Dr. Bronner's Barkeep's Friend Warm water and 1-2 tablespoons trisodium phosphate [1] X Research source"
    },
    {
      "title": "Use an abrasive sponge or brush to remove the stain.",
      "content": "Use an abrasive sponge or brush to remove the stain. Depending on the stain you can use different abrasives to remove the stain, from gentle sponges on walls to blades on glass and hard plastic. Don't dig into the stain. Simply work at the edges, trying to lift it from the surface, to prevent scratching. For walls, use the rough side of a sponge, or another gentle scrubber. For unpainted metal, a toothbrush or other hearty brush will work wonders. For painted metal, you need to use a gentle towel or microfiber cloth. Use the sharp side of a razor blade to scrape away the gummy residue from glass and plastic. With the blade at a roughly 45-degree angle to the surface, scrape away the loosened nicotine residue."
    },
    {
      "title": "Wipe clean with soap and water.",
      "content": "Wipe clean with soap and water. If you're working on glass, use a glass cleaner like Windex to remove the last little bits of residue and wipe the surface clean. Otherwise, a few drops of dish soap and warm water should be fine. For serious stains, repeat the process, letting your degreaser soak into the stain for an extra 5-6 minutes. [2] X Research source"
    },
    {
      "title": "Know that long developing stains may not come off at all.",
      "content": "Know that long developing stains may not come off at all. If the same stain has been building up for years, leading to a yellow, brownish tint to your items, they may never return to their original color. You can make improvements with gentle scrubbing and cleaning, but it may be time to repaint the walls or get newer objects if you can't fight off the yellow tinge."
    },
    {
      "title": "Spray your carpet with a gentle vinegar cleaner before cleaning.",
      "content": "Spray your carpet with a gentle vinegar cleaner before cleaning. Adding 2 tbsp of vinegar per every cup of warm water, put the mix in a spray bottle and spot spray the areas of carpet. The vinegar will break down the resin a bit, allowing the carpet cleaner to do it's job and suck up the rest of the nicotine stain. You can then use a sponge and, moving in a gentle circular motion, use warm water to lift the stain up. The only way to completely clean your carpet is to use a carpet cleaner, which you can rent at most hardware stores."
    },
    {
      "title": "Soak white clothes overnight with a denture cleaning tablet before washing normally.",
      "content": "Soak white clothes overnight with a denture cleaning tablet before washing normally. This will bleach your clothes slightly, so do not do this with colored clothing. Fill a small bucket with hot water and 3-4 denture cleaning tablets and let your shirt soak overnight. Immediately wash it the next morning, then air-dry to see if the stain is removed. Use warm or hot water to wash the stained clothes. [3] X Expert Source Cleanzen Cleaning Services Residential Cleaning Specialists Expert Interview. 4 February 2022."
    },
    {
      "title": "Soak colored clothes overnight with powdered detergent before washing normally.",
      "content": "Soak colored clothes overnight with powdered detergent before washing normally. While bleaching agents are the easiest way to get rid of stains in clothing, they aren't an option with your colored fabrics. Use a bath of warm water and powdered detergent to loosen the stain overnight, then wash in the morning. Air dry to see if the stain is removed, as driers will set the stain in. [4] X Research source You can also soak the garments in a stain remover product. [5] X Expert Source Cleanzen Cleaning Services Residential Cleaning Specialists Expert Interview. 4 February 2022."
    },
    {
      "title": "Use rubbing alcohol to remove small spots and difficult stains on fabric.",
      "content": "Use rubbing alcohol to remove small spots and difficult stains on fabric. Test this first, putting a bit of alcohol on an inconspicuous spot to see if the color fades. If it doesn't this is a great way to get rid of tough stains. Simply use a sponge to blot at the stains with rubbing alcohol, dabbing and wiping up the stain before putting the fabric in the washing machine. [6] X Expert Source Cleanzen Cleaning Services Residential Cleaning Specialists Expert Interview. 4 February 2022. This is best done right after soaking the clothes. Wring them out and search for any extra stains to fight. Use 91% isopropyl over 70% whenever possible, as it is stronger and will clean faster."
    },
    {
      "title": "Try scrubbing your fingers with lemon juice once a day.",
      "content": "Try scrubbing your fingers with lemon juice once a day. The acidity of the lemon juice will help lift the stain over time, usually after a week of persistent cleaning. To do so, cut a lemon and lightly scrub your hands with a slice. Once the stained parts of your nails and fingers are covered, use a pumice stone of loofah to gently scrub your hands. Over a week or so, you should see significant lightening. For significant stains, try a cleaning \"bath:\" Mix the juice of 1/2 a lemon in a bowl with hot water. Crush up and stir in 2-3 tablets of aspirin, which contains an acid that can remove nicotine stains. Soak your hands in the aspirin/lemon solution for 15 minutes, once a day."
    },
    {
      "title": "Use potatoes to remove stains from skin.",
      "content": "Use potatoes to remove stains from skin. There is an enzyme in raw potato that helps slough away stains. To use it, cut the potato in half, then gently massage the cut side into the stain for 10-15 minutes. After a few treatments, you should see your stains lightening."
    },
    {
      "title": "Brush your teeth regularly, especially after smoking.",
      "content": "Brush your teeth regularly, especially after smoking. The best way to fight nicotine stains on your teeth is to be proactive. After smoking or chewing, get to work on your teeth with a toothbrush and some fluoride toothpaste. Toothpaste is also an effective stain remover for your skin as well. You can use it around your lips, scrubbing in lightly with a warm washcloth, for a gentle alternative to lemon juice. If you smoke at work, bring a travel toothbrush and paste. The sooner you get to work cleaning your mouth after smoking, the better your teeth with be."
    },
    {
      "title": "Brush once a day with baking soda.",
      "content": "Brush once a day with baking soda. Baking soda is a mild abrasive that can remove stains over time. Once a day, along with regular brushing, use a little warm water and a sprinkling of baking soda to clean your teeth. Use a soft brush to protect your gums as well. It won't taste good, but it will attack the nicotine stains."
    },
    {
      "title": "Know that these stains take time to remove.",
      "content": "Know that these stains take time to remove. Nicotine stains will not disappear from your teeth or skin overnight. They are deep, persistent stains that need constant attention. The best way to decrease them is to decrease the amount you use nicotine, as this allows your cleanings a chance to make a difference. [7] X Research source"
    }
  ]
}