{
  "url": "https://www.wikihow.com/Attract-Hawks",
  "title": "How to Attract Hawks",
  "steps": [
    {
      "title": "Add a water source to your property if you don’t have one already.",
      "content": "Add a water source to your property if you don’t have one already. Install a bird bath, fountain, pond, or other water source. Hawks will be more likely to come on your property if there is drinking water readily available. [1] X Research source This is especially important if you live in a dry area. If there are natural ponds or other water sources on your property, it’s not as necessary."
    },
    {
      "title": "Put up bird feeders to attract small birds for hawks to feed on.",
      "content": "Put up bird feeders to attract small birds for hawks to feed on. Hang bird feeders from trees and bushes or attach them to things like fence posts and structures on your property. Keep them stocked with bird seed so that small birds will hang around and attract hungry hawks. Even if your main goal in attracting hawks is to get rid of pests like rodents, the more different types of prey there are available, the more likely hawks are to take an interest in the area."
    },
    {
      "title": "Attach hunting perches 10–12 ft (3.0–3.7 m) up various trees and posts.",
      "content": "Attach hunting perches 10–12 ft (3.0–3.7 m) up various trees and posts. Use pieces of lumber or branches that are 1–3 ft (0.30–0.91 m) long. Nail or screw them across dead trees or wooden posts to give hawks something to sit on and scope out their prey. [2] X Research source Do this only on your property and only where there are no natural perches. Don’t nail an artificial perch to a perfectly healthy, growing tree, for example."
    },
    {
      "title": "Avoid clearing dead trees and brush.",
      "content": "Avoid clearing dead trees and brush. Leave dying and dead trees standing whenever it is safe to do so to create natural perches for hawks, rather than cutting them down and removing them. Don’t clear wooded or brushy areas off your property if you don’t have to. [3] X Research source Remember that hawks are woodland birds of prey, so they are much more attracted to more natural environments, as opposed to perfectly manicured yards and gardens, so avoid heavily landscaping your land in general."
    },
    {
      "title": "Acquire 18 ft (5.5 m) of 2 in (5.1 cm) by 4 in (10 cm) lumber.",
      "content": "Acquire 18 ft (5.5 m) of 2 in (5.1 cm) by 4 in (10 cm) lumber. Use spare weathered lumber that you have lying around somewhere on your property if possible. Purchase new lumber at a home improvement center or lumber yard if you don’t have any already. [4] X Research source Hawks are more likely to use something that has already been outside and exposed to the elements as opposed to something freshly cut. For example, you could use some old barn lumber or spare fence wood that’s been lying around outside."
    },
    {
      "title": "Cut the lumber into 9 2 ft (0.61 m) long pieces.",
      "content": "Cut the lumber into 9 2 ft (0.61 m) long pieces. Use a power saw to cut the pieces or get them cut for you at a home improvement center. These will form a platform that is 2 ft (0.61 m) by 2 ft (0.61 m), which is large enough for hawks to use to nest. [5] X Research source"
    },
    {
      "title": "Screw 4 of the pieces together into a square.",
      "content": "Screw 4 of the pieces together into a square. Place 2 of the pieces flat and parallel, about 2 ft (0.61 m) apart. Lay 2 more pieces perpendicular across the tops of the ends of the first 2 pieces to form a square. Screw the pieces in place using a power drill to drive wood screws through them into the pieces below. [6] X Research source Use corrosion-resistant screws, such as galvanized decking screws."
    },
    {
      "title": "Attach 3 evenly-space pieces in between the 2 top pieces.",
      "content": "Attach 3 evenly-space pieces in between the 2 top pieces. Lay 3 more pieces perpendicular and flat across the bottom 2 pieces to fill in the top of the platform, so it looks like the slats of a bed frame. Secure them in place with wood screws and your power drill. [7] X Research source The spaces in the platform allow hawks to stuff nesting material in between them to build a secure nest."
    },
    {
      "title": "Choose a post for the platform that is at least 14 ft (4.3 m) high.",
      "content": "Choose a post for the platform that is at least 14 ft (4.3 m) high. Use a post on your property that is already in the ground or purchase a new wooden post to set in the ground. Find a dead tree that you can use as a natural post as an alternative. [8] X Research source If you have to buy a post, you could get something like a 14 ft (4.3 m) long 4 in (10 cm) by 4 in (10 cm) pressure-treated timber post."
    },
    {
      "title": "Attach the platform to the top of the post with the remaining 2 pieces of lumber.",
      "content": "Attach the platform to the top of the post with the remaining 2 pieces of lumber. Screw 1 of the pieces on either side of the top of the post to form joists. Screw the platform onto the joists to attach it. [9] X Research source Use an extension ladder and a safety harness to install the platform safely on the top of the post if it is already in the ground or if you are mounting it on a dead tree."
    },
    {
      "title": "Place the mounted platform near other trees or a wooded area.",
      "content": "Place the mounted platform near other trees or a wooded area. Hawks are woodland creatures, so they won’t be as attracted to a nesting platform in the middle of a totally open clearing. Try to position the nesting platform in a more natural environment for better chances of attracting hawks. [10] X Research source"
    }
  ]
}