{
  "url": "https://www.wikihow.com/Clean-Your-Headphones",
  "title": "The Best Ways to Clean Your Headphones and Earbuds",
  "steps": [
    {
      "title": "Unplug or turn off your headphones or headset.",
      "content": "Unplug or turn off your headphones or headset. Since you don’t want to damage any of the electronics, disconnect any devices you’re plugged into. If you have a Bluetooth headset or pair of headphones, turn them completely off before you start working. [1] X Research source If you have a battery-powered headset, take the batteries out if you can."
    },
    {
      "title": "Take off the ear pads if they’re removable.",
      "content": "Take off the ear pads if they’re removable. Try lightly pulling on the edge of your ear pads to loosen them from your headphones or headset. [2] X Research source The bottom edge of the ear pads will slip off of the headphones and expose the speaker underneath. That way, it’ll be easier to deep-clean the headphones and the pads. If you’re having trouble removing the ear pads, check the instructions that came with your headphones. It’s okay if you can’t remove the pads from your headphones. You can still clean them while they’re attached."
    },
    {
      "title": "Wipe the headphones and pads with a damp lint-free cloth to remove loose dirt.",
      "content": "Wipe the headphones and pads with a damp lint-free cloth to remove loose dirt. Wet a lint-free cloth in warm water and wring it out as much as possible. Gently wipe the entire surface of your headphones, including the headband and wire, with the cloth. Use the same cloth to clean the ear pads around the outer edges so you can lift up the dirt and grime. Avoid using the cloth when it’s dripping wet since it could damage the electrical components inside your headphones."
    },
    {
      "title": "Tackle stubborn wax or dirt with soapy water and a lint-free cloth.",
      "content": "Tackle stubborn wax or dirt with soapy water and a lint-free cloth. If you notice any of the dirt is really stuck on your headphones, put a drop of liquid dish soap onto your damp cloth and lather it in. Gently rub the soap into any spots that are extra sticky or dirty to break them apart and get your headphones clean. Then, rinse the cloth, wring it out, and wipe off any of the leftover soap residue. Avoid getting soapy water near the electronic components of your headphones so you don’t damage them."
    },
    {
      "title": "Disinfect your earphones with rubbing alcohol.",
      "content": "Disinfect your earphones with rubbing alcohol. Use a 70% rubbing alcohol solution and wet the corner of a small lint-free cloth. Gently wipe the surface of the ear pads, wires, and headband of your headphones or headset to kill any germs or bacteria living on the surface. The alcohol will evaporate off the surface, so you don’t have to dry it off. Be sure to wipe down the microphone on a headset since it can get dirty being so close to your mouth."
    },
    {
      "title": "Clean out small nooks and crannies with a soapy cotton swab.",
      "content": "Clean out small nooks and crannies with a soapy cotton swab. Dip a cotton swab into soapy water and squeeze out the excess liquid. Use the cotton swab to clean off any small holes, vents, and tight corners on the headphones. Then, run a cotton swab around the inside edges of the ear pads. Follow up with a dry cotton swab to remove any soapy residue. [3] X Research source Replace the cotton swab once it looks dirty so you don’t spread around the old dirt and grime. To disinfect, you can dip the swab in rubbing alcohol instead of water."
    },
    {
      "title": "Pat the headphones with a towel and let them air-dry.",
      "content": "Pat the headphones with a towel and let them air-dry. Take a dry towel and wipe up any residual liquid that you still see on the surface. Then, leave your headphones out and let them dry off completely for about 30 minutes before you use them again. [4] X Research source"
    },
    {
      "title": "Turn off or unplug your earbuds.",
      "content": "Turn off or unplug your earbuds. Make sure there’s no power connected to your earbuds so you don’t risk any electrical shock or damage to your electronics."
    },
    {
      "title": "Remove and wash silicone ear tips in soapy water.",
      "content": "Remove and wash silicone ear tips in soapy water. The ear tips are the silicone pieces over the speakers. Pull them gently off of the speakers to remove them. Wet a lint-free cloth with warm water and rub the ear tips with it until you clean off all of the wax and dirt. Then just pat them dry with a towel. If you have foam ear tips, dirt and wax can build up and make them difficult to clean. Replace them with silicone ear tips so they’re easier to clean next time."
    },
    {
      "title": "Wipe your earbuds with soapy water and a damp lint-free cloth.",
      "content": "Wipe your earbuds with soapy water and a damp lint-free cloth. Use a few drops of liquid dish soap in a bowl of water and mix it together. Soak your cloth in the solution and wring it out completely. Then, wipe the surface of the earbuds with the cloth. Any dirt or wax will break down and lift off of the surface so your earbuds are clean. [5] X Research source Avoid using your cloth while it’s soaking wet since the moisture could damage the speakers or electronics. You can clean off the earbud wires using the same cloth and soapy water."
    },
    {
      "title": "Clean stubborn dirt and wax with rubbing alcohol and a lint-free cloth.",
      "content": "Clean stubborn dirt and wax with rubbing alcohol and a lint-free cloth. Wet the corner of a lint-free cloth in your rubbing alcohol and let the excess drip off. Gently wipe your entire earbuds, including the wires, with the damp cloth to break down any grime that’s still left on the surface."
    },
    {
      "title": "Scrape any wax from around the meshes with a toothpick.",
      "content": "Scrape any wax from around the meshes with a toothpick. Run a toothpick around the outer edge of the speaker mesh to remove all of the waxy buildup. Wipe the toothpick off on a clean cloth before using it on your earbuds again. Avoid pushing the toothpick in against the mesh since you could poke through it. You can instead use an earbud cleaning tool with a sharp point to scrape out the wax."
    },
    {
      "title": "Scrub the speaker meshes with a dry toothbrush.",
      "content": "Scrub the speaker meshes with a dry toothbrush. Use a dry toothbrush and make sure you only use it for cleaning. Hold the earbud so the mesh is angled down and gently run the toothbrush bristles over it. Any loose dirt or wax will fall out of the mesh. [6] X Research source Removing the buildup in the speaker meshes can improve your earbuds’ sound quality and volume. If there’s dirt or wax still stuck in the mesh, rip off a fingertip-sized piece of adhesive mounting putty and gently press it onto the speaker mesh."
    },
    {
      "title": "Wipe down a wireless earbud case with rubbing alcohol.",
      "content": "Wipe down a wireless earbud case with rubbing alcohol. If you’re cleaning AirPods or any other wireless earbuds, their charging case can get dirty too. Wet the corner of your cloth with rubbing alcohol and clean off any residue you see on the outside of the case. If you notice any dirt or wax on the inside of the case, dip a cotton swab into your rubbing alcohol and gently wipe the mess up. [7] X Research source Avoid sticking anything in the charging port when you clean the case so you don’t damage it."
    },
    {
      "title": "Let the earbuds dry for 30 minutes.",
      "content": "Let the earbuds dry for 30 minutes. Wait until all the moisture has dried up on your earbuds before you use them again so you don’t accidentally damage any of the electronic components. [8] X Research source"
    }
  ]
}