{
  "url": "https://www.wikihow.com/Calculate-the-Area-of-a-Circle",
  "title": "How to Calculate the Area of a Circle",
  "steps": [
    {
      "title": "Identify the radius of a circle.",
      "content": "Identify the radius of a circle . The radius is the length from the center of a circle to the edge of the circle. You can measure this in any direction and the radius will be the same. The radius is also one half of the diameter of a circle. The diameter is the line segment that passes through the center and connects opposite sides of the circle. [1] X Research source The radius will generally be provided to you. It can be difficult to measure to the exact center of a circle, unless the center is already marked for you on a circle drawn on paper . For this example, assume that you are told that the radius of a given circle is 6 cm."
    },
    {
      "title": "Square the radius.",
      "content": "Square the radius. The formula to find the area of a circle is A = π r 2 {\\displaystyle A=\\pi r^{2}} , where the r {\\displaystyle r} variable represents the radius. This variable is squared. [2] X Research source Do not get confused and square the entire equation. For the sample circle with radius, r = 6 {\\displaystyle r=6} , then r 2 = 36 {\\displaystyle r^{2}=36} ."
    },
    {
      "title": "Multiply",
      "content": "Multiply by pi . Pi, written symbolically with the Greek letter π {\\displaystyle \\pi } , is a mathematical constant that represents the ratio between the circumference and the diameter of the circle. [3] X Research source As a decimal approximation, π {\\displaystyle \\pi } is approximately 3.14. The true decimal value continues on infinitely. For an exact statement of the area of a circle, you will usually report your answer using the symbol π {\\displaystyle \\pi } itself. [4] X Research source For the given example with a radius of 6 cm, the area is calculated as: A = π r 2 {\\displaystyle A=\\pi r^{2}} A = π 6 2 {\\displaystyle A=\\pi 6^{2}} A = 36 π {\\displaystyle A=36\\pi } or A = 36 ( 3.14 ) = 113.04 {\\displaystyle A=36(3.14)=113.04}"
    },
    {
      "title": "Report your result.",
      "content": "Report your result. Remember that a calculation of area is going to be reported in “square” units. If the radius was measured in centimeters, the area will be in square centimeters. If the radius was measured in feet, the area will be in square feet. You should also know whether to report your result using the symbol π {\\displaystyle \\pi } or the numerical approximation. If you do not know, then report both. [5] X Research source For the sample circle with a radius of 6 cm, the area will be either 36 π {\\displaystyle \\pi } cm 2 or 113.04 cm 2 ."
    },
    {
      "title": "Measure or record the diameter.",
      "content": "Measure or record the diameter . Some problems or situations will not provide you with the radius. Instead, you may be given the diameter of a circle. If the diameter is drawn into your diagram, you can measure it with a ruler . Alternatively, you may just be told the value of the diameter. [6] X Research source Assume for this example that the diameter of your circle is 20 inches."
    },
    {
      "title": "Divide",
      "content": "Divide the diameter in half. Remember that the diameter is equal to double the radius. Therefore, whatever value you are given for the diameter, cut it in half and you will have the radius. Therefore, the sample circle with a diameter of 20 inches will have a radius of 20/2, or 10 inches."
    },
    {
      "title": "Use the original formula for area.",
      "content": "Use the original formula for area. After converting the diameter to the radius, you are ready to use the formula A = π r 2 {\\displaystyle A=\\pi r^{2}} to calculate the area of the circle. Insert the value for the radius and perform the remaining calculations as follows: [7] X Research source A = π r 2 {\\displaystyle A=\\pi r^{2}} A = π 10 2 {\\displaystyle A=\\pi 10^{2}} A = 100 π {\\displaystyle A=100\\pi }"
    },
    {
      "title": "Report the value of the area.",
      "content": "Report the value of the area. Recall that your area is to be reported in square units. In this example, the diameter was measured in inches, so the radius is in inches. Therefore, the area will be reported in square inches. For this sample, the area will be 100 π {\\displaystyle 100\\pi } sq. in. You can also provide the numerical approximation by multiplying by 3.14 instead of π {\\displaystyle \\pi } . This will give a result of (100)(3.14) = 314 sq. in."
    },
    {
      "title": "Learn the revised formula.",
      "content": "Learn the revised formula. If you know the circumference of a circle , you can use a revision of the formula for the area of a circle. This revised formula uses circumference directly, without the radius, to find area. This new formula is: A = C 2 4 π {\\displaystyle A={\\frac {C^{2}}{4\\pi }}}"
    },
    {
      "title": "Measure or record the circumference.",
      "content": "Measure or record the circumference. In some real world situations, you may not be able to measure the diameter or radius accurately. If the diameter is not drawn for you or the center is not identified, it can be difficult to approximate the center of a circle. For some physical circles - a pizza pan or a frying pan, for example - you may be able to use a tape measure and measure the circumference more accurately than you can measure the diameter. [8] X Research source For this example, assume that you have been told or have measured that the circumference of a circle (or circular object) is 42 cm."
    },
    {
      "title": "Use the relationship between circumference and radius to revise the formula.",
      "content": "Use the relationship between circumference and radius to revise the formula. The circumference of a circle is equal to pi times the diameter. This can be written as C = π d {\\displaystyle C=\\pi d} . Then, recall that the diameter is equal to twice the radius, or d = 2 r {\\displaystyle d=2r} . You can combine these two equalities to create the following relationship: C = π 2 r {\\displaystyle C=\\pi 2r} . Rearrange this to isolate the variable r {\\displaystyle r} by itself, as follows: [9] X Research source C = π 2 r {\\displaystyle C=\\pi 2r} C 2 π = r {\\displaystyle {\\frac {C}{2\\pi }}=r} ….. (divide both sides by 2 π {\\displaystyle \\pi } )"
    },
    {
      "title": "Substitute into the formula for the area of a circle.",
      "content": "Substitute into the formula for the area of a circle. You can create a modified version of the formula for the area of a circle, using this relationship between circumference and radius. Substitute this latest equality into the original area formula, as follows: [10] X Research source A = π r 2 {\\displaystyle A=\\pi r^{2}} …..(original area formula) A = π ( C 2 π ) 2 {\\displaystyle A=\\pi ({\\frac {C}{2\\pi }})^{2}} ….. (substitute equality for r) A = π ( C 2 4 π 2 ) {\\displaystyle A=\\pi ({\\frac {C^{2}}{4\\pi ^{2}}})} …..(square the fraction) A = C 2 4 π {\\displaystyle A={\\frac {C^{2}}{4\\pi }}} …..(cancel π {\\displaystyle \\pi } in numerator and denominator)"
    },
    {
      "title": "Use the revised formula to solve the area.",
      "content": "Use the revised formula to solve the area. Using this revised formula, written with the circumference instead of radius, you can use your given information and find the area directly. Insert the value of the circumference and perform the calculations as follows: [11] X Research source For this sample, you were given C = 42 {\\displaystyle C=42} inches. A = C 2 4 π {\\displaystyle A={\\frac {C^{2}}{4\\pi }}} A = 42 2 4 π {\\displaystyle A={\\frac {42^{2}}{4\\pi }}} …..(insert value) A = 1764 4 π {\\displaystyle A={\\frac {1764}{4\\pi }}} .….(calculate 42 2 ) A = 441 π {\\displaystyle A={\\frac {441}{\\pi }}} …..(divide by 4)"
    },
    {
      "title": "Report your result.",
      "content": "Report your result. Unless you are told the circumference as a multiple of π {\\displaystyle \\pi } , then your result is likely to be a fraction with π {\\displaystyle \\pi } in the denominator. There is nothing wrong with this. You should report your area calculation in that term, or you may approximate it by dividing by 3.14. [12] X Research source For this sample circle, with a circumference given as 42 cm, the area is 441 π {\\displaystyle {\\frac {441}{\\pi }}} sq. cm. If you approximate, 441 π = 441 3.14 = 140.4 {\\displaystyle {\\frac {441}{\\pi }}={\\frac {441}{3.14}}=140.4} . The area is approximately equal to 140 sq. cm."
    },
    {
      "title": "Identify the known or given information.",
      "content": "Identify the known or given information. In some problems, you may be told information about a sector of the circle and then be asked to find the area of the full circle. Read the problem carefully and look for information that will say something like, “A sector of Circle O has an area of 15 π {\\displaystyle \\pi } cm 2 . Find the area of Circle O.” [13] X Research source"
    },
    {
      "title": "Define the chosen sector.",
      "content": "Define the chosen sector. A sector of a circle is a portion that is sometimes also referred to as a “wedge.” A sector is defined by drawing two radii from the center out to the edge of the circle. The space between these two radii is the sector. [14] X Research source"
    },
    {
      "title": "Measure the central angle of the sector.",
      "content": "Measure the central angle of the sector. Use a protractor to measure the central angle made by the two radii. Set the base of the protractor along one of the radii, with the central point of the protractor aligned with the center of the circle. Then read the angle measurement that corresponds with the position of the second radius forming the sector. [15] X Research source Make sure you know if you are measuring the small angle between the two radii or the greater angle outside them. The problem you are working on should define this for you. The sum of the small angle and the great angle will be 360 degrees. In some problems, instead of having you measure the central angle, the problem may just tell you the measurement. For example, you might be told, “The central angle of the sector is 45 degrees” or you may be expected to measure it."
    },
    {
      "title": "Use a modified formula for area.",
      "content": "Use a modified formula for area. When you know the area of a sector and its central angle measurement, you can use the following modified formula to find the area of the circle: [16] X Research source A c i r = A s e c 360 C {\\displaystyle A_{cir}=A_{sec}{\\frac {360}{C}}} A c i r {\\displaystyle A_{cir}} is the area of the full circle A s e c {\\displaystyle A_{sec}} is the area of the sector C {\\displaystyle C} is the central angle measure"
    },
    {
      "title": "Enter the values that you know and solve the area.",
      "content": "Enter the values that you know and solve the area. In this example, you have been told that the central angle is 45 degrees and that the sector has an area of 15 π {\\displaystyle \\pi } . Insert these into this formula and solve as follows: [17] X Research source A c i r = A s e c 360 C {\\displaystyle A_{cir}=A_{sec}{\\frac {360}{C}}} A c i r = 15 π 360 45 {\\displaystyle A_{cir}=15\\pi {\\frac {360}{45}}} A c i r = 15 π ( 8 ) {\\displaystyle A_{cir}=15\\pi (8)} A c i r = 120 π {\\displaystyle A_{cir}=120\\pi }"
    },
    {
      "title": "Report the result.",
      "content": "Report the result. For this example, the sector was one-eighth of the full circle. Therefore, the area of the full circle is 120 π {\\displaystyle \\pi } cm 2 . Since the sector's area was given in terms of π {\\displaystyle \\pi } , you can assume that your area for the full circle should be reported the same way. [18] X Research source If you want to report a numerical value, you can multiply 120 x 3.14 to get a value of 376.8 cm 2 ."
    }
  ]
}