{
  "url": "https://www.wikihow.com/Change-Your-Age-on-Bumble",
  "title": "How to Change Your Age on Your Bumble Profile",
  "steps": [
    {
      "title": "If you used Facebook to sign up for Bumble, your personal information is linked to your Facebook profile.",
      "content": "If you used Facebook to sign up for Bumble, your personal information is linked to your Facebook profile. Your age is likely incorrect Bumble because your age it's wrong on Facebook. [1] X Research source To fix your age on Bumble, you’ll simply need to change your age on Facebook."
    },
    {
      "title": "Login to your Facebook account.",
      "content": "Login to your Facebook account. Enter your email or phone number and your password then press Log In ."
    },
    {
      "title": "Navigate to your profile page by clicking on your name and profile picture in the top right corner.",
      "content": "Navigate to your profile page by clicking on your name and profile picture in the top right corner. This will take you to your profile page."
    },
    {
      "title": "Under the ‘About’ tab, click on the ‘Contact and Basic Info' section.",
      "content": "Under the ‘About’ tab, click on the ‘Contact and Basic Info' section. You can find your 'About' tab right under your profile picture."
    },
    {
      "title": "Under the 'Basic Info' section, you will see your birthday.",
      "content": "Under the 'Basic Info' section, you will see your birthday. Click on the pencil icon on the right-hand side to edit your age. You can only change the year you were born two times on Facebook. Make sure that you are adding your correct birth year to make sure your profile is accurate."
    },
    {
      "title": "Once you have made your edits click ‘Save.",
      "content": "Once you have made your edits click ‘Save. ’ Your birth year will now be sent to Facebook for review!"
    },
    {
      "title": "Facebook will have to approve your age change request, which could take about a day or so.",
      "content": "Facebook will have to approve your age change request, which could take about a day or so. Once approved, your age will be correct on your Facebook and Bumble accounts. [2] X Research source"
    },
    {
      "title": "If you used your phone number to sign up for Bumble, you might have entered the wrong information when you first set up your Bumble account.",
      "content": "If you used your phone number to sign up for Bumble, you might have entered the wrong information when you first set up your Bumble account. Unfortunately, there is no way to self-correct your age on Bumble. Instead, submit a request to Bumble to change your age. Use this link to change your age on Bumble."
    }
  ]
}