{
  "url": "https://www.wikihow.com/Assemble-a-Flute",
  "title": "How to Assemble a Flute",
  "steps": [
    {
      "title": "Open your flute case.",
      "content": "Open your flute case. A disassembled flute is divided into three pieces of different sizes. You’ll need to learn which is which before you can put your flute together. [1] X Research source The headjoint is the top part of the flute, which has the lip plate. The body of the flute is the central portion, and the largest, with several keys on it. The footjoint is the smallest part, forming the bottom of the flute."
    },
    {
      "title": "Unpack and clean your flute pieces.",
      "content": "Unpack and clean your flute pieces. Take the parts of your flute out of the case, one by one. Lift them by their ends only, to avoid damaging them. As you take the parts out of the case, give them a quick wipe down with a polishing cloth to clean them so they’ll fit together properly. Pay special attention to the ends of the pieces--making sure they are free from dirt will help the flute fit together properly."
    },
    {
      "title": "Bring the headjoint and the body together.",
      "content": "Bring the headjoint and the body together. Gently hold the headjoint in one hand and the body in another. Insert the end opposite the lip plate of the headjoint into the end of the body that is bare metal, not covered by keys. You'll want to bring the pieces together with a slight twisting motion. [2] X Research source If you're having trouble bringing the pieces together, don't force it. Wipe the joints of the pieces with your cloth and try again. Take care to hold the pieces gently, by the ends, not by the keys. If you forcefully grab them as you twist, you might damage your instrument."
    },
    {
      "title": "Line up the lip plate and the keys.",
      "content": "Line up the lip plate and the keys. If you have a beginner’s flute, you might see that it has little arrow markings where the pieces come together. If you see those, just gently twist the body and the headjoint until the arrows line up. Even if your flute doesn't have markings, it's not difficult to line the pieces up: just gently twist until the hole on the lip plate is centered with the keys on the body. [3] X Research source"
    },
    {
      "title": "Attach the foot joint to body.",
      "content": "Attach the foot joint to body. Bring the foot joint and the body together at their joints, again with a slight twisting motion. Gently turn until the first key on the foot joint is slightly to the right of the keys on the body. Keep the pieces straight as they come together. Attaching them at an angle may damage your flute. Some flautists find it helpful to gently press the low C and C# keys with their thumb as the attach the footjoint to the body. [4] X Research source"
    },
    {
      "title": "Test your flute.",
      "content": "Test your flute. Once all the pieces of your flute are assembled, play it a bit to make sure it is in tune and put together properly. If something looks, feels, or sounds off, stop and make adjustments as needed. Use a tuner to help determine if you are hitting notes correctly. There are many convenient electronic tuners you can try."
    },
    {
      "title": "Disassemble your flute carefully.",
      "content": "Disassemble your flute carefully. When you are done playing your flute, you should first give it a quick wipe down with your cloth to help keep it clean. Next, take it apart by using the same gentle twisting motions as you did when assembling. Holding each piece by the ends, place them one by one back into the flute’s case. [5] X Research source"
    },
    {
      "title": "Ask for help if you need it.",
      "content": "Ask for help if you need it. If you are ever unsure if you are assembling your flute correctly, ask your teacher for more guidance. They can give you pointers and watch as you assemble your flute to make sure you are doing it correctly. [6] X Research source"
    },
    {
      "title": "Do not use lubrication.",
      "content": "Do not use lubrication. The joints of a flute are designed to fit snugly for proper tone and intonation. You might think that adding some kind of lubrication will make it easier to assemble the flute, but this can actually cause your flute to play and sound incorrectly. Avoid putting any kind of oil or other lubrication on your flute when assembling it. [7] X Research source"
    },
    {
      "title": "Handle the flute parts with care.",
      "content": "Handle the flute parts with care. Always be gentle when assembling your flute. Don’t put your fingers on the moving parts when putting the joints together (unless you are lightly pressing the C keys when putting the footjoint and body together). Use a light touch and gentle twisting motions to fit the joints together, rather than grasping the flute pieces in your hand. Following these guidelines will prevent you from damaging your flute. [8] X Research source"
    },
    {
      "title": "Swab and clean your flute regularly.",
      "content": "Swab and clean your flute regularly. Keeping your flute clean is important for maintaining the instrument, and it’s convenient to do so when you’re assembling it. Use a polishing cloth (sometimes called a “silver cloth”) available from a music store. Gently wiping the flute and swabbing moisture from the insides when you disassemble it will be sufficient for everyday cleaning. [9] X Research source"
    }
  ]
}