{
  "url": "https://www.wikihow.com/Care-for-Ghost-Crabs",
  "title": "How to Care for Ghost Crabs",
  "steps": [
    {
      "title": "Get a large tank.",
      "content": "Get a large tank. The first step of providing a good environment for your ghost crabs is getting a nice and large tank for them to live in. Aim for a tank around 20 gallons (75.7 L). If you are going to get more than four ghost crabs, you should get a bigger tank. [1] X Research source A glass aquarium is the best option for your container, but you can use a cheaper plastic container if necessary. Make sure that the container you use is strong enough to hold wet sand, which can get heavy. [2] X Research source It should also have a lid that fits tightly to stop the crabs from getting out. It should let in air while keeping in the moisture."
    },
    {
      "title": "Add some sand.",
      "content": "Add some sand. Once you have your container you need to get it ready for your ghost crabs. Ghost crabs live on beaches and you need to try to replicate this environment in your home “crabitat.” Start by pouring in some safe sand to use as substrate. The sand should be at least a few inches deep, and ideally you should half-fill the tank. Ghost crabs like to dig into the sand so you need to give the space to do this. [3] X Research source You can buy “crab sand” at your local pet store, but it will generally be quite expensive. A cheaper option is to buy clean play sand from a hardware store. As long as the sand has not been contaminated it should be fine for your crab. Check for any tears in the bag, discolouration, smells or leaks before you buy. You can also use coconut fibre substrate, or use a combination of this with some clean play sand. [4] X Research source"
    },
    {
      "title": "Provide a varied environment.",
      "content": "Provide a varied environment. After you have added the sand substrate, you need to add some extra elements to create a more stimulating and varied environment for your crabs. Place a few clean seashells around the tank, and add in some plastic plants and bits of driftwood. Make places where they can hide, and clamber around. [5] X Research source Provide a sloped area of sand to help with burrowing. Avoid putting in any resinous (evergreen) wood into the tank. Cedar and pine can irritate crabs. [6] X Research source"
    },
    {
      "title": "Keep it humid.",
      "content": "Keep it humid. Crabs need a humid environment to live in. Buy a humidity gauge for your tank so you always know what the level of humidity is. For crabs like ghost crabs, you should generally aim for around 70% humidity. If you regularly check the gauge you can just spray in some clean untreated water to raise the humidity level. A humid environment will help them keep their gills moist and help them breathe. [7] X Research source Dehydration can have a serious effect on the health and vitality of your crabs."
    },
    {
      "title": "Provide your crabs with water.",
      "content": "Provide your crabs with water. Although ghosts crabs live on land, and cannot actually swim, they do need a constant supply of water. Ghost crabs have to return to water periodically to moisten their gills in order to breathe. In the wild, a ghost crab would walk up to the shoreline and wait till a wave ran over him, before scuttling back up the beach. [8] X Research source You must ensure your crabs have access to water in their container at all times. You should ensure you have a dish of saltwater in the tank that you change at least every two weeks. Create saltwater by mixing two and a half teaspoons of sea or aquarium salt with a gallon of water to reach a gravity reading of around 1.01-1.08. Be sure you leave the water to sit overnight so that the chlorine and chloramines dissipate before you place it in the tank. Make sure the dish is easy for your crabs to get in and out of. You crab can also get moisture from wet sand. [9] X Research source"
    },
    {
      "title": "Feed your crabs.",
      "content": "Feed your crabs. Ghost crabs can be considered both scavengers and predators. They have a broad and varied diet, which includes decomposing plant and animal matter as well as mole crabs, clams and turtle hatchlings they catch on the beach. [10] X Research source Provide a variety of vegetables, fruit, fish and meat to your crabs and see which foods they like. Crabs really enjoy a variety of food, so try different natural foods and have not been treated with any pesticides or chemicals. [11] X Research source Avoid too much repetition in your crab’s diet and pay attention to what food he likes the most. [12] X Research source You can also buy prepared crab food from your pet store as a reliable and easy option."
    },
    {
      "title": "Clean the tank.",
      "content": "Clean the tank. Ghost crabs aren’t especially messy or high-maintenance, but you will have to spend some time helping them maintain their environment. You should regularly spot clean the tank, to remove dirty sand and bits of food detritus. Use a sand sifter, fishnet or kitchen strainer to scoop up some sand and sift out the dirty bits. Add in some new sand every few weeks to keep the tank clean and refreshed. [13] X Research source Sift the sand more often the more crabs you have. With one crab, every three weeks is fine. With four, every week. With six or more, it's good to sift every other day. [14] X Research source"
    },
    {
      "title": "Reshape the environment.",
      "content": "Reshape the environment. It’s a good idea to spend a little bit of time reshaping the environment every few weeks to help keep your crabs stimulated. Move the toys and other objects around, alter the lay of the sand, or add a new slop or sand-hill. [15] X Research source"
    }
  ]
}