{
  "url": "https://www.wikihow.com/Call-Iceland",
  "title": "How to Call Iceland",
  "steps": [
    {
      "title": "Dial the exit code for your country.",
      "content": "Dial the exit code for your country. To transfer the call outside of your country, you will first need to dial your country’s exit code. Depending on where you are calling from the exit code will be between 1 and 5 digits long. 0 and 011 are two of the most common exit codes. [1] X Research source Dial 011 as the exit code if you are calling from the United States or Canada. The exit code for most countries in Europe, South America, Africa, and Asia is 00. If you see a phone number that begins with +, the symbol stands for the country’s exit code. If your phone allows it, you can press + on the phone to automatically input the exit code. If you do this, you will not need to type in the exit code."
    },
    {
      "title": "Enter 354 for Iceland’s country code after entering your country’s exit code.",
      "content": "Enter 354 for Iceland’s country code after entering your country’s exit code. Keep in mind that every country has its own unique country code, unlike exit codes, which can be shared by many countries. If you dial the wrong country code, you will not end up calling Iceland. [2] X Research source"
    },
    {
      "title": "Dial the 7-digit phone number.",
      "content": "Dial the 7-digit phone number. All phone numbers in Iceland contain 7 digits, and are written as xxx xxxx. There are no long-distance calls within Iceland, so you will not need to enter an area code as you might when calling countries like the United States. [3] X Research source While there are no traditional area codes in Iceland, the first digit of the phone number is used to identify geographic areas and phone types. Numbers beginning with 5 are in Reykjavik. The numbers for all remaining geographic areas in Iceland begin with 4. Phone numbers beginning with 3, 6, 7, or 8 are cellular numbers."
    },
    {
      "title": "Learn about time differences prior to making a call.",
      "content": "Learn about time differences prior to making a call. Before you pick up the phone to call Iceland, make sure you’ve researched the relevant time zones. Identify what time zone you are calling from, and compare this to the time zone of Iceland. The time zone of Iceland is UTC/GMT +0. Iceland observes Greenwich Mean Time, or GMT, all year long. There are no daylight savings time clock changes. [4] X Research source Try searching online for a time zone converter, and use it to determine the difference between the time zone you’re calling from and Iceland’s time zone."
    },
    {
      "title": "Use a pre-paid international calling card to save cash.",
      "content": "Use a pre-paid international calling card to save cash. Calling internationally can get expensive, regardless of whether you are calling from a landline or cellular phone. To save some money when you call Iceland, purchase an international calling card from a big box store, grocery store, gas station, or online merchant. [5] X Research source"
    },
    {
      "title": "Save money by using a Voice-Over Internet Protocol.",
      "content": "Save money by using a Voice-Over Internet Protocol. A VoIP, or Voice-Over Internet Protocol is a broadband-based telephone service. Popular services like Skype and Vonage allow you to make calls from your computer while connected to the Internet. In many cases, the person you are calling will also need to be signed up for the service. [6] X Research source These services may have fees, but they will generally be cheaper than a standard international call from a cellular phone or landline. Keep in mind you will still need to dial the entire number, including exit and country codes, when using most VoIP services."
    },
    {
      "title": "Try a video messaging app if you have a laptop or smartphone.",
      "content": "Try a video messaging app if you have a laptop or smartphone. There are several options for video messaging using a smartphone or tablet. WhatsApp, Facebook Messenger, and Skype all have applications you can download and use to make a video call. For these services, the person you are calling will also have to download the app. Once the person you are calling has downloaded the application, send them a friend request within the app. After your contact approves your friend request, you can call them by tapping on their name within the app."
    }
  ]
}