{
  "url": "https://www.wikihow.com/Convince-Your-Parents-to-Let-You-Have-an-Instagram-Account",
  "title": "How to Convince Your Parents to Let You Have an Instagram Account",
  "steps": [
    {
      "title": "Know that you must be 13 or older to have Instagram.",
      "content": "Know that you must be 13 or older to have Instagram. This is, unsurprisingly, going to cause more issues on top of any other issues you might run into while convincing your Parents. In some places in Europe, the requirement is 18. Unfortunately, if you are under the age of 13 (or 18 depending on where you live) it is a violation of the Instagram Terms of Service to be on the app. This means that not only will you struggle to even get an account running legally, but you will also, depending on whether or not your parents know about COPPA and Age Restrictions, find it difficult to convince your parents that an account is a good idea."
    },
    {
      "title": "Find a time to talk to them when they are in a good mood.",
      "content": "Find a time to talk to them when they are in a good mood. Don't talk to them whenever they're busy, or worried, or when dealing with one of your siblings. If you catch them in a good mood, they will be much more likely to let you on Instagram. Some good times to consider are: After dinner During a relaxing weekend. Shortly after an accomplishment, like a good report card."
    },
    {
      "title": "Explain the basics of Instagram to your parents.",
      "content": "Explain the basics of Instagram to your parents. Many parents are uncomfortable with Instagram because they don't understand it. But Instagram is relatively simple when compared to sites like Facebook or Twitter. Users share photos with their friends, who can like or comment on them and post their photos. There is an emphasis on photography instead of \"status updates.\" The basics of Instagram are: Users post and edit pictures on Instagram with built-in photo-editing software. Users can follow their friends to see their pictures on a photo reel. While you can like and comment on photos, there is no \"chat room\" function on Instagram. You do not need to provide any personal information, other than a private email address, to join."
    },
    {
      "title": "Tell your parents why you want to be on Instagram.",
      "content": "Tell your parents why you want to be on Instagram. Think of a reason why you want to get on Instagram. If you can show your parents how Instagram will benefit your life and creativity then they will be much more likely to let you get an account. Luckily, because Instagram is a photography site, it is easy to show your parents the benefits of the site: You want to practice photography. You want to explore famous photographers and locations. You and your friends capture and share special moments online."
    },
    {
      "title": "Emphasize the creative aspects of Instagram.",
      "content": "Emphasize the creative aspects of Instagram. Instagram is an inherently creative app -- you get to take photos and edit the brightness, contrast, saturation, cropping, filter effects, and much more. This makes it different from other, more gossipy social media sites, and you should remind your parents of these differences. Show them professional accounts, like National Geographic or the Food Network, that match up to your interests. There is incredible art and photography on Instagram that your parents may not be aware of."
    },
    {
      "title": "Share and discuss Instagram's Parental Guide.",
      "content": "Share and discuss Instagram's Parental Guide. Knowing that this conversation is taking place in living rooms across the world, Instagram has put together a helpful guide for parents to help them and their children navigate the service. The guide discusses what Instagram is, ways to fight common concerns, and the potential pros and cons of the app. You can find the guide in multiple languages through the Instagram Help Center → Privacy & Safety Center → Tips for Parents. [1] X Research source"
    },
    {
      "title": "Help your parents start their account.",
      "content": "Help your parents start their account. Help them set up an account and let them follow you, which lets them feel like they can be a part of your Instagram and eases their concerns. Many parents won't want to be on Instagram anyway, but this step shows them that you are willing to compromise and have nothing to conceal. This is also a great way to show parents how simple Instagram is to use, which may help them feel more comfortable with the app."
    },
    {
      "title": "Have a discussion, not an argument.",
      "content": "Have a discussion, not an argument. Coming into this talk prepared for a fight will just make your parents less likely to see your side of things. Look them in the eyes and invite them to ask you questions. If they feel like you are reasonable and responsible then Instagram will seem reasonable and responsible as a result. [2] X Research source Make eye contact, if you feel comfortable with doing so. Keep your voice calm and collected. Agree with them on certain points, even if you have a \"counter-point.\" Focus on you and your trustworthiness, not the shadow of \"evil\" online lurkers."
    },
    {
      "title": "Be respectful of their answer.",
      "content": "Be respectful of their answer. If they say yes, thank them and give them a quick hug. Stay true to any promises you made about the account and start enjoying Instagram. If they say no, let them know that you understand their decision, but would love to talk to them a little more about Instagram later. Assure them that the site is safe and ask them if they would be willing to do a little more research -- the Instagram Help Center, for example, has an entire section on \"Tips for Parents.\" Yelling or getting angry now will only hurt your chances of getting an account later."
    },
    {
      "title": "Ask your parents again 1-2 weeks after the first no.",
      "content": "Ask your parents again 1-2 weeks after the first no. Be respectful and courteous when you bring it up again. \"Have you had any time to think about my Instagram account?\" is a great way to broach the subject without coming outright and asking. Allow this to be a conversation, not an argument, but still come ready to explain the site and the measures you'll take to stay safe."
    },
    {
      "title": "Ask your parents why they are concerned about Instagram.",
      "content": "Ask your parents why they are concerned about Instagram. Some parents have viable concerns about Instagram, but you can never convince them to let you on if you don't know what is holding them back. Avoid getting angry or picking a fight with them. Listen to their concerns with an open mind -- starting an argument now will only make them less likely to let you online the next time you ask. Common issues with Instagram include: You aren't mature enough yet. There are bad people on the internet. Public photos will follow you for the rest of your life."
    },
    {
      "title": "Let them know that you understand internet dangers and how to avoid them.",
      "content": "Let them know that you understand internet dangers and how to avoid them. This can be one of the most persuasive arguments you have because it shows you know how to be responsible online. It also addresses their concerns before they have a chance to talk about them. Tell them that you are aware of cyberbullying and internet scamming and assure them that you know that photos can last online for a long time. However, you should focus on what you are doing to prevent problems: Private accounts allow you to manually choose who you let follow you. Anyone can anonymously flag rude, offensive, or explicit content for removal. You do not need to give your real name or contact information on Instagram. Geotagging, which attaches your location to your photos, can be turned off in \"Settings.\" [3] X Research source"
    },
    {
      "title": "Show your responsibility around the house.",
      "content": "Show your responsibility around the house. Let your parents see that you are mature enough to handle the responsibility of an Instagram account. This includes doing your chores and homework on time, listening to their requests, and treating your siblings with respect every day. [4] X Research source Believe it or not, it takes a lot of responsibility to use social media. If you can prove that you’re capable of handling your real-world responsibilities, they may think you’re able to handle Instagram. Remember, however, that if you are only doing this to \"trick\" them into letting you on Instagram you'll likely lose your account the minute you stop being responsible. To get their blessing you need to be respectful every day."
    },
    {
      "title": "Promise that you'll keep your account private.",
      "content": "Promise that you'll keep your account private. Private accounts have a lot of benefits that keep you off of search engines and let you control who sees your photos. This is often enough to convince your parents that Instagram is a safe place for you online. As opposed to public accounts, private accounts: Allow you to accept or deny any new followers. Removes you from search engine results. Hides your information and photos from anyone you have not cleared already. [5] X Research source"
    },
    {
      "title": "Offer to share your password with your parents, as long as they agree not to post anything.",
      "content": "Offer to share your password with your parents, as long as they agree not to post anything. This assures your parents that there is nothing lewd or explicit going on behind their backs. While it may feel weird to \"share\" your account with your parents, this is a great way to compromise if they still won't let you on. Set up your account together, which lets them see the app first-hand."
    },
    {
      "title": "Follow through on your promises.",
      "content": "Follow through on your promises. If there were some conditions to get your account, make sure you do what you say you would. Keep your account private, don't change the password if you share it with them, and don't post explicit or offensive photos. This is especially important if your parents were hesitant to let you on in the first place. Show them that you deserve the responsibility and can handle it maturely."
    },
    {
      "title": "Answer any questions they have.",
      "content": "Answer any questions they have. If they want to know what kinds of accounts you follow, be open and let them know. Even if you've done nothing wrong, being defensive or secretive can lead you to the wrong conclusions, which may end in you losing your Instagram account."
    },
    {
      "title": "Make them feel like a part of your account.",
      "content": "Make them feel like a part of your account. This lets them feel included and validates their decision to let you on the site. There are a lot of simple, easy ways to do this that don't have to involve allowing them onto your account: Show them pictures you've taken. Ask them to help pick a filter now and then. Take a \"family selfie\" with them on vacation or at a cool location."
    },
    {
      "title": "Let your parents know when you are making changes to your account.",
      "content": "Let your parents know when you are making changes to your account. If you've shown that you can be responsible with an account for 3-6 months, politely let your parents know that you are making your account public to gain more followers. If your parents find out about these changes before you tell them, they may feel like their trust has been violated and will overreact, potentially cutting your account."
    },
    {
      "title": "Avoid making Instagram the center of your life.",
      "content": "Avoid making Instagram the center of your life. Instagram is an extension of your social life, not your entire life, so don't give your parents the impression that all you do is look at your phone. This is not only important for them but for you. After all, it is hard to take great photos if you are looking at a screen all day. Effective Instagram accounts post 1-3 pictures a day, not 100. [6] X Research source"
    }
  ]
}