{
  "url": "https://www.wikihow.com/Add-a-Header-in-Microsoft-Word",
  "title": "How to Add a Header in Microsoft Word",
  "steps": [
    {
      "title": "Open Microsoft Word.",
      "content": "Open Microsoft Word. It's a blue app with a white \"W\" on it. You can also open an existing document by double-clicking it."
    },
    {
      "title": "Click Blank Document.",
      "content": "Click Blank Document . This will open a new document in Word."
    },
    {
      "title": "Click the Insert tab.",
      "content": "Click the Insert tab. You'll see it near the top of the Word window, directly to the right of the Home tab."
    },
    {
      "title": "Click Header.",
      "content": "Click Header . It's in the \"Header & Footer\" section that's on the right side of the row of options near the top of the screen. You'll see a list of header options in a drop-down menu. These options will vary depending on your Office subscription type and version of Word."
    },
    {
      "title": "Click a header option.",
      "content": "Click a header option. In most cases, you'll just click the Blank option, since it will apply to the majority of Word documents necessitating a header. Selecting an option will add it to your document."
    },
    {
      "title": "Type in your header's text.",
      "content": "Type in your header's text. This is the text that will appear at the top of every page."
    },
    {
      "title": "Click Close Header and Footer.",
      "content": "Click Close Header and Footer . Doing so will apply it to your document; you'll see your header text at the top of each page."
    },
    {
      "title": "Double-click your header text.",
      "content": "Double-click your header text. Doing so will open the Header options menu in the bar near the top of the Word window."
    },
    {
      "title": "Review the header's basic settings.",
      "content": "Review the header's basic settings. There are a couple of aspects of the header that you can edit in the \"Options\" and \"Position\" sections: Different First Page - Check this box to customize your document's first page's header. It will appear different than the header on the rest of the pages. Header Position - Change the number in the \"Header from Top\" box to raise or lower the header's position on the page."
    },
    {
      "title": "Click and drag your cursor across the header text.",
      "content": "Click and drag your cursor across the header text. This will select it, which will allow you to modify it as needed. If you're using the \"Different First Page\" option, you'll need to do this on a page other than the first for your changes to apply across your document (first page aside)."
    },
    {
      "title": "Click the Home tab.",
      "content": "Click the Home tab. Doing so will allow you to edit the header by using options in the following sections: Font - Edit your text's font, size, color, and general formatting (e.g., bolding or underlining). Paragraph - Change your header's orientation (e.g., centered)."
    },
    {
      "title": "Double-click the \"Header\" tab.",
      "content": "Double-click the \"Header\" tab. It's below your header's text; doing so will save your changes and close the header section."
    }
  ]
}