{
  "url": "https://www.wikihow.com/Contact-Google",
  "title": "How to Get Help with Google Accounts",
  "steps": [
    {
      "title": "Understand how Google's support center works.",
      "content": "Understand how Google's support center works. Since Google can't provide customer service for things like password resets or account recovery, they have a comprehensive list of common help topics and walkthroughs for frequent problems. While the support center doesn't constitute contacting Google, it's the only Google-based alternative for issues for which you might feel the need to contact Google."
    },
    {
      "title": "Open Google Support.",
      "content": "Open Google Support. Go to https://support.google.com/ in your computer's web browser."
    },
    {
      "title": "Select a product.",
      "content": "Select a product. Click the name of the product with which you're having trouble. For example, if you're having issues with Google Chrome, you would click the Google Chrome option."
    },
    {
      "title": "Review the available support resources.",
      "content": "Review the available support resources. You'll see a list of common topics in the middle of the page, so look for your question or issue there."
    },
    {
      "title": "Select a support resource category.",
      "content": "Select a support resource category. Click the category of question or issue that you'd like to use. You should see the category expand to show more specific options. If clicking the category opens a support page, skip the next step. You can also type your question or issue into the search bar at the top of the page."
    },
    {
      "title": "Select a support resource topic.",
      "content": "Select a support resource topic. Click one of the topics below the expanded category. Doing so will open the topic's support article page. If you typed your question or issue into the search bar, you'll click the topic that appears in the drop-down menu below the search bar."
    },
    {
      "title": "Follow the support article's instructions.",
      "content": "Follow the support article's instructions. Read carefully the support article that opens, then follow the instructions in the article to attempt to fix your problem. You may have to follow several articles' instructions in order to fully address your issue. Most support articles have a list of related articles on the right side of the page."
    },
    {
      "title": "View support numbers for your Android phone.",
      "content": "View support numbers for your Android phone. If you want to receive support for a non-Pixel model of Android, you can view the list of support number to call by doing the following: Click Pixel Phone on the Google Support page. Click Contact us in the upper-right side of the page. Click Android Device Support . Review the drop-down list of phone numbers."
    },
    {
      "title": "Request a conversation for your Pixel phone.",
      "content": "Request a conversation for your Pixel phone. If you have a Pixel 1 or Pixel 2 Android phone, you can receive chat- or phone call-based support from Google by doing the following: [3] X Research source Click Pixel Phone on the Google Support page. Click Contact us in the upper-right side of the page. Click Pixel Device Support . Select your Pixel model. Click Request callback for a phone call or Request chat for an instant message conversation. Follow the on-screen instructions."
    },
    {
      "title": "Request a conversation for Google Drive issues.",
      "content": "Request a conversation for Google Drive issues. Google Drive is the only app-based service for which Google offers real-time support. To request a chat with or email from Google, do the following: [4] X Research source Click Google Drive on the Google Support page. Click Contact us in the upper-right corner of the page. Select a topic, then select a category if prompted. The Request a refund option won't work for this step. Click Request chat or Email support . Follow the on-screen instructions to initiate a chat or an email conversation."
    },
    {
      "title": "Understand that there are only a handful of ways to contact Google directly.",
      "content": "Understand that there are only a handful of ways to contact Google directly. Unless you're a member of the press or a G Suite administrator, your ways of contacting Google are limited to sending old-fashioned snail mail and applying for a job. The only exceptions to this rule—Android support, Pixel support, and Google Drive support—are listed in the previous method."
    },
    {
      "title": "Never call a number that isn't explicitly stated by Google.",
      "content": "Never call a number that isn't explicitly stated by Google. Several scam numbers claiming to belong to Google are currently in circulation. To avoid getting scammed (or just wasting your time), only call a number that is specifically listed on a Google document. For example, you can call a number listed on a G Suite form, but not one found on a non-Google site. The same idea goes for email addresses and regular addresses. Google staff will never ask for your password in a phone or chat conversation."
    },
    {
      "title": "Email Google's press team.",
      "content": "Email Google's press team. If you're a member of the press and you want to contact Google for an inquiry, you can email them at press@google.com . Depending on the subject of the email, you may or may not receive a response. [5] X Research source Google will only accept and respond to emails from established members of the press."
    },
    {
      "title": "Send mail to Google's address.",
      "content": "Send mail to Google's address. If you don't mind sending a piece of snail mail and not receive a response, you can address your mail to 1600 Amphitheatre Parkway Mountain View, CA 94043. Google is exceedingly unlikely to respond to snail mail, so don't do this with an urgent or sensitive item. [6] X Research source"
    },
    {
      "title": "Contact G Suite support.",
      "content": "Contact G Suite support. Regular Google account users can't do this, but G Suite administrators have access to 24/7 customer support. To use G Suite to contact Google, make sure you're a G Suite administrator and then do the following: [7] X Research source Go to https://gsuite.google.com/support/ in your web browser. Select a method of contact (e.g., click Phone Support if you want to call Google). Click SIGN IN TO G SUITE . Log in using your G Suite administrator account information. Follow the on-screen instructions. If you're calling Google, you'll have to follow the spoken instructions on the hotline as well."
    },
    {
      "title": "Apply for a job with Google.",
      "content": "Apply for a job with Google. The final way in which you can contact directly Google is by applying for a job with them. You can view and apply for available jobs on Google's Careers page: Go to https://careers.google.com/jobs in your computer's web browser. Change the location in the right-most text box to fit your preferred location. Click the \"Search jobs\" text box, then press ↵ Enter . Scroll through the results. Select a result, then click APPLY in the top-right corner. Fill out the application and follow any on-screen instructions."
    }
  ]
}