{
  "url": "https://www.wikihow.com/Celebrate-Muharram",
  "title": "How to Celebrate Muharram",
  "steps": [
    {
      "title": "Read scriptures related to the holy month.",
      "content": "Read scriptures related to the holy month. In most strains of Sunnism, the 10th day of Muharram, or Ashura, commemorates the day Allah freed the Israelites from the tyrannical Egyptian Pharaoh. During Ashura and the days leading up to it, Sunni Muslims should reflect on Allah’s benevolence to the Prophet Moses by reading scriptures related to: [1] X Research source The Prophet Moses’ 40 day fast. Allah splitting the Red Sea. The Prophet Muhammad’s meeting with the Jews at Medina."
    },
    {
      "title": "Fast on the 9th and 10th days of Muharram.",
      "content": "Fast on the 9th and 10th days of Muharram. In the hadith, the Prophet Muhammad instructs followers of Islam to fast during Ashura and the day preceding it. The fast used to be mandatory for all Muslims, but was made optional following the introduction of the Ramadan fast . [2] X Research source This fast helps Sunni Muslims atone for sins committed during the previous year. [3] X Research source Some religious communities hold the fast on the 10th and 11th instead."
    },
    {
      "title": "Show gratitude to Allah for liberating the Israelites.",
      "content": "Show gratitude to Allah for liberating the Israelites. When Allah led the Israelites out of Egypt, He showed Moses an incredible amount of grace that we can never truly repay Him for. However, you can thank Allah for His kindness and love by doing the following before Ashura ends: Perform the standard Nafl Salat prayers. Recite Surah Al-Ikhlas, or “He is Allah, [who is] One,” 1000 times. Deliver the entire Dua E Ashura."
    },
    {
      "title": "Remember the Battle of Karbala that caused the Islamic schism.",
      "content": "Remember the Battle of Karbala that caused the Islamic schism. Sunnis do not recognize Imam Husayn as the rightful successor to caliph \"Muawiyah\" I. For this reason, they do not mourn the Imam as a forsaken leader. However, they do reflect on the Imam’s death and, more importantly, the conflict that caused it and split the faith. Instead of reliving the tragedy with displays of sorrow and pain, Sunnis treat the battle as a lesson about why reform is better than betrayal."
    },
    {
      "title": "Participate in certain Shia-led events to bring the sects together.",
      "content": "Participate in certain Shia-led events to bring the sects together. Even if you disagree with some Shiite beliefs, celebrating Ashura with them can foster a greater sense of community and faith. You don’t have to stick around for any public flagellations, but try participating in low-stress events like majalis and noha recitals."
    },
    {
      "title": "Refrain from public displays of happiness prior to the 10th day of Muharram.",
      "content": "Refrain from public displays of happiness prior to the 10th day of Muharram. For the first 10 days of Muharram, Shia Muslims observe a period of mourning for the martyred grandson of the Holy Prophet Muhammad (saw), Imam Husayn ibn Ali (as). As such, many Shiite leaders encourage their followers to avoid fun or pleasant activities in public and, if possible, in private. This personal denial should last until the 8th day of \"Rabbiul\" Awwal. Some things to refrain from include: Eating meat, especially during the day. Donning new outfits. Getting engaged or married."
    },
    {
      "title": "Dress in black mourning clothes out of respect for Imam Husayn.",
      "content": "Dress in black mourning clothes out of respect for Imam Husayn. In the days leading up to Ashura, many Shiites wear all-black clothes to represent their internal sorrow. You can transition to these clothing items all at once, typically on the first day of Muharram, or work up to them throughout the mourning period, donning a new item every day until all your clothes are black. Immediately following Imam Husayn’s death, the female members of his tribe were taken hostage by Yazid’s army and wore black out of grief. Modern mourning clothes carry on this tradition. After Ashura, most Shiites change back to their normal apparel."
    },
    {
      "title": "Attend local religious lectures to learn the history of Muharram.",
      "content": "Attend local religious lectures to learn the history of Muharram. During the 9 days preceding Ashura, many Shia imams give religious lectures known as majalis. Similar to sermons, these spiritual speeches cover the history of Muharram and its place in the modern world. [4] X Research source Check with your local Mosque to see if they are hosting any Majalis programs. If there are no Majlis programs in your area, search online for Ulema who broadcast their sermons to the world."
    },
    {
      "title": "Perform \"Nohes (Nohas)\" on Ashura in remembrance of Imam Husayn.",
      "content": "Perform \"Nohes (Nohas)\" on Ashura in remembrance of Imam Husayn. On the 10th day of Muharram, many Shia’s show their devotion by reciting spiritual poems or singing religious hymns known as nohas. In most cases, these nohas talk mainly about the Battle of Karbala and Imam Husayn’s (as) martyrdom. [5] X Research source Ashura is about public displays of spirituality, so recite your nohas wherever you feel is appropriate."
    },
    {
      "title": "Walk in processions of grief to show your sorrow during Ashura.",
      "content": "Walk in processions of grief to show your sorrow during Ashura. Ashura is a particularly public holiday, so many Shiites commemorate it by walking in parade-like public processions. The logistics of these events vary by area, but they often feature flags, banners, ornaments, and symbols related to Imam Husayn, such as the horse Zuljanah and the Alam representing Husayn’s family. [6] X Research source Search online to see if there are any official public processions in your area."
    },
    {
      "title": "Participate in charitable programs that mimic the Imam’s actions (optional).",
      "content": "Participate in charitable programs that mimic the Imam’s actions (optional). In recent years, some Shia communities bucked the somber traditions associated with Muharram and replaced them with a variety of charitable and community outreach programs. These commemorate the sacrifices Imam Husayn made and serve as inspiration for righteous reformation. Some programs you can participate in are: [7] X Research source Blood drives, a direct response to the bloodletting performed by certain Shiites. Clean water fundraisers, in reference to the Husayn quote “Whenever you drink water, remember me.” Food distribution events, done to parallel the Imam’s charity toward beggars."
    }
  ]
}