{
  "url": "https://www.wikihow.com/Apply-Eyelash-Extensions",
  "title": "How to Apply Eyelash Extensions",
  "steps": [
    {
      "title": "Evaluate the condition of your natural lashes.",
      "content": "Evaluate the condition of your natural lashes. [1] X Research source If your eyelashes are naturally short and thin, dramatically long or thick extensions won’t last long and may damage them. Before selecting extensions, examine your own lashes. The longer and healthier they are, the more weight they can withstand. If you’ve never applied extensions before, consider starting with a half set to see how your natural lashes hold up. You can always add more extensions later if you want a fuller or more exaggerated look."
    },
    {
      "title": "Choose the type and design you want.",
      "content": "Choose the type and design you want. [2] X Research source There are three types of extensions – synthetic, silk and mink. Mink is the most expensive and synthetic is the least. The lengths usually range from 6mm to 17mm. [3] X Research source Extensions also come in a variety of thicknesses, curls and colors. Think about what your ultimate goal is before making a choice. For example, if your goal is to create a natural look, you could select medium length extensions in brown black. If you are buying extensions as part of a costume, or if you’re going for a unique look, explore different color options and thicknesses."
    },
    {
      "title": "Select extensions in several different lengths.",
      "content": "Select extensions in several different lengths. Once you’ve settled on a basic length and thickness, choose individual lashes that vary slightly in length. A subtle variation will provide the most natural looking results. Three sizes in a similar length range should be sufficient. The shortest extensions will be used to fill in any gaps in the lash line and keep the overall appearance from looking unnatural and crowded."
    },
    {
      "title": "Buy an eyelash extension kit.",
      "content": "Buy an eyelash extension kit. If you plan to apply the extensions yourself, get a kit from a beauty supply store. A kit will include different sized lashes (usually short, medium and long), along with all the tools you’ll need for application – tweezers, adhesive, adhesive remover and an eyelash brush. If you’ve never applied extensions before, buying a kit will make the process a lot easier. Each kit is different. Read and follow the instructions included with the kit carefully. Check the ingredients on the adhesive. Make sure it doesn’t have formaldehyde listed as an ingredient."
    },
    {
      "title": "Consider having the extensions professionally applied the first time.",
      "content": "Consider having the extensions professionally applied the first time. [4] X Research source Your lash line and the surrounding area are very sensitive places. Applying eyelash extensions on yourself can be risky, since the adhesive can irritate your skin or damage your natural lashes if not applied properly. If you don’t feel comfortable applying extensions yourself, find a certified professional to do it for you the first time. After going through the process once, you’ll probably feel more at ease doing it at home. Start by researching technicians in your area. Make sure they’re licensed and find out how long they’ve been doing this professionally."
    },
    {
      "title": "Invite a friend over to help you.",
      "content": "Invite a friend over to help you. If this is your first time applying extensions, it’s a good idea to have a friend nearby to help you out. The application process requires that you juggle several different tools and, when it comes to actually gluing the extensions on, you need to be completely still. Your eye also needs to be completely shut when you glue it on, and all of this is difficult to do with just two hands. The application process will go much faster and more smoothly with an assistant. It will also be a lot safer for you. There is a higher risk of getting adhesive in your eye and other mishaps when you’re working alone."
    },
    {
      "title": "Prepare your natural lashes.",
      "content": "Prepare your natural lashes. For the adhesive to stick properly, your natural lashes must be clean and free of makeup residue. They also need to be completely dry. Start by applying makeup remover to a cotton pad and gently swiping it across both eyes. Remove every trace of makeup around the eye area. Rinse the area with lukewarm water. Allow your eyelashes to dry before you begin applying the extensions. Comb your upper lashes with an eyelash brush to smooth and separate them. This brush, which looks like a mascara wand, should come with your extension kit."
    },
    {
      "title": "Cover the area under your bottom lashes with a white adhesive pad.",
      "content": "Cover the area under your bottom lashes with a white adhesive pad. Your extension kit should include some sort of gel pad or tape to help pat down the bottom lashes. This will protect your skin from the adhesive. The adhesive pad also makes it easier to see and work on the individual lashes. When your eyelid is closed, the upper lashes will be against the white color, emphasizing the areas where you’re working."
    },
    {
      "title": "Select the length you want to use on the outermost corner of your eye.",
      "content": "Select the length you want to use on the outermost corner of your eye. The extensions come in little bundles of eight or nine individual lashes. Since you’re starting at the outermost corner of your eye, your longest extensions will be used first. Squeeze a dime-sized amount of lash adhesive onto a smooth surface that’s easily accessible for you. Then use the tweezers to grab your first cluster and carefully dip the knotted end in the adhesive. You only need a tiny amount of glue. If you use too much, the end result will look messy."
    },
    {
      "title": "Place the first extension gently onto your natural lash.",
      "content": "Place the first extension gently onto your natural lash. Close your eye and move it as little as possible as you place the extension. Slowly drop the synthetic lash onto your natural lash, as close to the base of your eyelashes as possible. The glue should only touch your lash, not your skin. Once the extension is dropped onto your natural lash, you will have about 60 seconds to situate it before the glue sets. After you do one eye, do the same for the other. You will work back and forth to ensure both eyes look even. The glue can cause eyelid irritation if it touches your skin. Make sure the glue touches your natural lashes only."
    },
    {
      "title": "Apply two to three more long extensions to the outermost edges.",
      "content": "Apply two to three more long extensions to the outermost edges. Work your way inward as you place each piece. For the most natural look, the longest extensions will go on the outer edges. Continue until you’ve applied three to four of the longest extensions to the outer third of both eyes. Make sure the extensions aren’t too close together, since you will be filling in between them with shorter pieces. Use the tweezers to adjust each extension as needed within the first 60 seconds of dropping it."
    },
    {
      "title": "Place the medium length extensions in between the long ones.",
      "content": "Place the medium length extensions in between the long ones. To add volume while getting the most natural-looking results, place one medium extension in between each of the long ones. Work from the outside corners inward, just as you did before. Be sure to do one eye, then the other. Work back and forth so both eyes look even. As you work, use the tweezers to periodically push the applied extensions down onto your natural lashes. This will help you keep everything in place. Take your time. Extension application is not a quick process."
    },
    {
      "title": "Begin placing medium extensions to the middle part of your eyelid.",
      "content": "Begin placing medium extensions to the middle part of your eyelid. Now that the outermost corners of your eyes are completed, repeat the same process for the middle part. Use the medium length extensions and place three to four of them on your lashes. Continue to work from the outside in. Cover the middle third of your eyelid on both sides."
    },
    {
      "title": "Apply the shortest extensions to the inner eyelid area.",
      "content": "Apply the shortest extensions to the inner eyelid area. After completing the middle section, use the short extensions to get as close to your inner eye as possible. The short ones can be a little harder to work with, so just go in as far as you can. Then use the shortest extensions to fill in any empty spaces you see in the middle sections of both eyes."
    },
    {
      "title": "Allow the extensions to set completely.",
      "content": "Allow the extensions to set completely. Do not apply any mascara or eye makeup for several hours after application. If possible, try not to touch the extensions at all. Give freshly applied extensions at least 12 to 24 hours before getting them wet. The life of your extensions will vary based on the type and how well they were applied, but they should last anywhere from two to eight weeks. [5] X Research source Professionally applied extensions should last through one growth cycle. This varies from person to person, but it’s usually about six to eight weeks."
    },
    {
      "title": "Comb them out every day.",
      "content": "Comb them out every day. [6] X Research source Extensions take daily maintenance to keep them looking their best. Use an eyelash brush or a clean mascara wand to gently brush them out every morning. Try to sleep on your back at night. This will cut down on the amount of time you need to spend every morning combing them out."
    },
    {
      "title": "Avoid applying too much mascara to the extensions.",
      "content": "Avoid applying too much mascara to the extensions. [7] X Research source Most people find that mascara isn’t necessary with the extensions, but if you want to give your eyes a little extra pop, apply mascara very carefully to the tips of the extensions only. Mascara applied to the base of the extensions usually ends up getting clumpy. Do not curl your eyelashes before you apply mascara. This can pull the extensions out. Avoid water-proof mascara completely. It’s too hard to remove. Do not wear oil-based mascara with eyelash extensions, as this can loosen the adhesive."
    },
    {
      "title": "Remove your makeup carefully every night.",
      "content": "Remove your makeup carefully every night. Invest in a high quality remover that requires that you rub as little as possible. Use the makeup remover or pre-moistened wipes to completely remove your makeup every day. Avoid oil-based makeup removers, which can loosen the adhesive. Makeup must be removed very gently to avoid pulling off the extensions."
    },
    {
      "title": "Replace the pieces that come off.",
      "content": "Replace the pieces that come off. [8] X Research source The extensions will naturally start to fall off during your normal lash growth cycle. If you lose any pieces very early on, try to use a bit of mascara to conceal the gaps. A touch up every three to four weeks will keep your extensions looking full and at their best. You can also do maintenance as needed, adding new pieces on as you lose the originals."
    }
  ]
}