{
  "url": "https://www.wikihow.com/Clean-Oil-Rubbed-Bronze-Fixtures",
  "title": "How to Clean Oil Rubbed Bronze Fixtures",
  "steps": [
    {
      "title": "Start with water.",
      "content": "Start with water. Wipe your oil rubbed bronze fixture with just water on a soft cloth. [1] X Expert Source David Liu Residential Cleaning Expert Expert Interview. 3 November 2021. Often water is all that is needed to clean this type of finish. Consider carefully before you use another cleaner besides water. Because of its changing color and quality, oil rubbed bronze needs as little cleaning as possible to maintain its shined finish and natural patina with age. Try water first, and always test another cleaner on a small, inconspicuous area of your fixture. [2] X Research source Dry the fixture immediately with a clean, dry cloth."
    },
    {
      "title": "Use a non-abrasive sponge for light scrubbing.",
      "content": "Use a non-abrasive sponge for light scrubbing. Dampen a soft sponge to remove hard water stains. Buff dry with a soft cloth. Don’t use steel wool or very scratchy, abrasive sponges or cloths. Also avoid bleach-based or other harsh cleaners. Observe your fixture after you have rubbed gently with a damp sponge and dried it. If spots reappear, repeat the process or consider a vinegar solution if the stains are very bad."
    },
    {
      "title": "Try a vinegar solution for stubborn stains.",
      "content": "Try a vinegar solution for stubborn stains. Mix one part vinegar with one part water for use on more difficult marks on your bronze finish. Do this for any hard water deposits that just water won’t remove. Test the vinegar mixture on your fixture first by dipping a cotton swab into it and applying it to the metal to determine what effect it will have before you use it on the entire surface. Gently rub the vinegar mixture onto your fixture with a soft cloth, or soak a paper towel in the mixture and leave it on the fixture for about 15 minutes. [3] X Research source"
    },
    {
      "title": "Blot water away when you see it.",
      "content": "Blot water away when you see it. Prevent hard water stains from forming by blotting your fixture dry whenever you see drops of water. Allowing water to evaporate on the surface is what leaves mineral deposits behind. Use just a dry cloth or towel to absorb any moisture, without rubbing or buffing. Do this daily for faucets and other fixtures that are very frequently exposed to water."
    },
    {
      "title": "Use a high quality wax.",
      "content": "Use a high quality wax. [4] X Expert Source David Liu Residential Cleaning Expert Expert Interview. 3 November 2021. Apply a very thin layer of wax intended for metals to your fixture. Do this to help maintain the shine and protect against water stains. Look for a high quality wax like Renaissance Wax, or another brand trusted for use on antique furniture. Apply the wax using a soft cloth, ensuring to the best of your ability that no excess builds up in cracks or other areas of the fixture, leaving a residue. Do this maintenance rarely, only when it appears your finish is wearing unusually thin from damage or overly abrasive cleaning."
    },
    {
      "title": "Wipe down with oil.",
      "content": "Wipe down with oil. Use a very small amount of vegetable oil on your fixture every so often. Don’t use so much that it leaves a residue that will come off on your hands. Note that the oils from human hands on frequently-touched areas will naturally add shine and create a lighter coloring on the bronze over time. [5] X Research source Do this maintenance only when it appears your finish is losing shine, either from excessive wear or overly abrasive cleaning."
    },
    {
      "title": "Sand down your fixture to repaint.",
      "content": "Sand down your fixture to repaint. Sand down the finish on your fixture if it has become severely damaged and you decide to repaint it. Starting with sanding will create an even surface, but isn’t always necessary depending on the fixture and damage. Think carefully before you remove the existing oil rubbed finish on a fixture, as it is has been carefully treated and aged over time, which you cannot easily replicate with simple spray paint or aging materials. Use a high-grit automotive sandpaper or steel wool to sand down the metal without unevenly scratching it. [6] X Research source"
    },
    {
      "title": "Use a spray finish.",
      "content": "Use a spray finish. [7] X Expert Source David Liu Residential Cleaning Expert Expert Interview. 3 November 2021. Try a spray paint that mimics an oil rubbed bronze finish. Use this method for a quick update to a fixture. [8] X Research source Apply a thin coat of spray primer to your fixture after sanding and before painting. You may find that your oil rubbed bronze spray paint has primer already included, in which case you may skip this step. Spray several thin coats of your spray paint on rather than one thicker coat to help it bind and cure better to the metal. Remember to spray screws and any other related hardware with the same paint finish. You can insert a spare key into a doorknob you’re painting so that the paint doesn’t clog up the keyhole. [9] X Research source"
    },
    {
      "title": "Try an aging solution.",
      "content": "Try an aging solution. Use an aging solution on brass to help achieve the same cured look created by oil rubbed bronze. Do this only for very damaged oil rubbed bronze fixtures. First remove existing lacquer using a lacquer thinner and fine-grade steel wool. Use an aging solution intended for bronze and brass. Don rubber gloves and safety glasses, as the chemical nature of these solutions can be damaging or harmful. Soak your fixture in the solution as instructed by the specific product, then rinse in cool water to halt the chemical reaction. You can rub some mineral or vegetable oil on after drying to add shine. [10] X Research source"
    }
  ]
}