{
  "url": "https://www.wikihow.com/Boulder-Shoulders",
  "title": "Your Ultimate Guide to Getting Bigger Shoulders (With Expert Advice)",
  "steps": [
    {
      "title": "Lateral raises",
      "content": "Lateral raises Certified personal trainer Jason Whalen recommends doing lateral raises as one of the key shoulder exercises. Grab a dumbbell in either hand, and either sit or stand with your back straight. Start with your arms hanging at your sides, then exhale and slowly raise them out to the sides, keeping them straight, then lower them back down while inhaling. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Make sure your arms become perpendicular to your body, so that your body forms a “T” shape. Frequency: Perform 3 sets of 8 reps per workout. Primary muscles: Lateral deltoids [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Front raises",
      "content": "Front raises This is another key shoulder workout recommended by Whalen. Stand straight with a dumbbell in either hand, with your arms down and the backs of your hands facing forward. Slowly exhale and lift your arms in front of you until they’re straight out, then inhale and slowly lower them back to the starting position. Frequency: Perform 3 sets of 8 reps per workout. [3] X Research source Primary muscles: Front deltoids"
    },
    {
      "title": "Overhead press",
      "content": "Overhead press For an overhead press (or dumbbell press ), sit or stand with a dumbbell in each hand. Raise the dumbbells on either side of your head so that they’re about eye height, and pull your back tight. Exhale and raise the dumbbells over your head until your arms are almost straight, then inhale and lower your arms back to the starting position. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Frequency: Perform 2 sets of 15 reps per workout. Primary muscles: Front, lateral deltoids"
    },
    {
      "title": "Shoulder press",
      "content": "Shoulder press Stand in front of a barbell that’s racked at about shoulder height. Grip the bar with your hands about as wide as your shoulders and palms facing away. Bend your knees slightly to lift the bar and let it rest at shoulder height, then step back. Exhale and raise the bar over your head, then inhale and lower it back to shoulder height. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Frequency: Perform 2 sets of 8 reps per workout. Primary muscles: Front deltoids [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Bent-over rows",
      "content": "Bent-over rows Hold a barbell with a shoulder-width grip and your palms facing down. Bend your knees and hips so that you’re leaning forward slightly, with your arms extended straight down. Tighten your core and exhale while bringing the bar up to your abs, then inhale while returning to your starting position. [7] X Research source Frequency: Perform 2 sets of 8 reps per workout. Primary muscles: Rear deltoids This exercise may also be done with dumbbells."
    },
    {
      "title": "Arnold Press",
      "content": "Arnold Press Sit with your back straight, holding 2 dumbbells with your elbows bent at your sides and hands level with your shoulders. Start with your palms facing you, then exhale and raise the dumbbells over your head. As you do, rotate your palm and arms outward, so that at the peak of the press, your palms face away from you. Reverse the motion to return to starting position. [8] X Research source Frequency: Perform 2 sets of 10 reps per exercise. Primary muscles: Front deltoids This exercise was popularized by iconic bodybuilder Arnold Schwarzenegger."
    },
    {
      "title": "Inclined reverse fly",
      "content": "Inclined reverse fly Sit on a bench with the backrest raised about 45°, and lean forward onto the backrest while holding dumbbells. Extend your arms straight out, with your elbows slightly bent. While exhaling, raise your arms out to your sides, tightening your back, then inhale and return to the starting position. [9] X Research source Frequency: Perform 2 sets of 8 reps per workout. Primary muscles: Front, lateral deltoids"
    },
    {
      "title": "Cable face pulls",
      "content": "Cable face pulls Stand before a cable pull machine, with the machine set to just above your head. Hold the grip with your palms facing down, and step back to give the cable tension, with your arms extended in front. Exhale and pull the cable toward your eyes, then inhale and return to the starting position. [10] X Research source Frequency: Perform 3 sets of 10 reps per workout. Primary muscles: Rear, lateral deltoids Personal trainer Errol Ismail prefers doing this exercise with a rope attachment, and says it works your deltoids, traps, and rhomboids."
    },
    {
      "title": "External/Internal rotations",
      "content": "External/Internal rotations While sitting or standing, hold a dumbbell immediately over your bent elbow, with the dumbbell about level with your eyes and your arm straight out from your side. Slowly lower the dumbbell forward, until your arm has rotated almost 180°, but not quite. Then, raise your arm back to the starting position more quickly. [11] X Research source Frequency: Perform 2 sets of 10 reps per workout. Primary muscles: Stretches the entire shoulder For a less intense and more controlled workout, sit on a bench or on the floor, with one foot on the bench, and rest your elbow on your knee."
    },
    {
      "title": "Shoulder shrugs",
      "content": "Shoulder shrugs Hold a dumbbell in each hand, and let your arms hang slack at either side of your body. Then, while exhaling, raise your shoulders as high up toward your ears as possible. Hold the position for 5 seconds, then inhale and return to the starting position. [12] X Research source Frequency: Perform 3 sets of 10 reps per workout. Primary muscles: Trapezius (neck muscles), all deltoids"
    },
    {
      "title": "Push-ups",
      "content": "Push-ups Certified strength and conditioning coach Adam Shuty says to do a push-up , get on the floor with your body straight, feet together, and hands shoulder-width apart. Keep your stomach tight and, while inhaling, lower your nose to the floor, then exhale and extend your arms, raising your body back up. Frequency: Perform 3 sets of 10 reps per workout. Primary muscles: Front deltoids If you can’t yet perform a push-up, do one with your hands on a raised surface, like a stable chair or railing, or while kneeling."
    },
    {
      "title": "Plank rotations",
      "content": "Plank rotations Get on your hands and knees as though you’re about to do a pushup, with your arms extended, your hands at shoulder-width, and your feet apart. Engage your core and lift one arm out and directly over your body, turning your torso as you do. Reverse the motion to return to starting position, then repeat with the other arm. [13] X Research source Frequency: Perform 3 sets of 15 reps per workout. Primary muscles: Engages entire shoulder"
    },
    {
      "title": "I-Y-T raises",
      "content": "I-Y-T raises Personal trainer Errol Ismail prefers this exercise for a low-intensity and safe shoulder workout. Stand straight, then lean forward about 30° while keeping your back straight. Straighten your arms and place your hands at your sides, then raise them over your head so your body forms an “I” shape. Widen your arms a bit to form a “Y,” then keep going to form a “T.” Finally, slowly lower your arms to the starting position. Frequency: Once you can do 3 sets of 8 comfortably, you might consider adding weight by holding dumbbells, or a heavy object (like a soup can) in each hand. Primary muscles: Rear, lateral deltoids"
    },
    {
      "title": "Your shoulders have 3 primary muscle groups.",
      "content": "Your shoulders have 3 primary muscle groups. Your shoulders aren’t just one muscle! In fact there are 3 muscle groups per shoulder, and each of the groups controls 1 primary direction of movement. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source To get big boulder shoulders, you’ll need to work out each of the 3: Anterior deltoids: The frontmost muscles that are engaged when you lift your arm forward, and give your shoulders a rounder shape on the front. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Lateral deltoids: The middle or side muscles that are engaged when you raise your arms to the side, and which help you get wider, broader shoulders . Posterior deltoids: The back muscles that are engaged when pulling or reaching backward, and which give your shoulders loads of mass and definition from the sides and back."
    },
    {
      "title": "Start small, and build up your intensity.",
      "content": "Start small, and build up your intensity. Ismail warns that shoulders are some of the most vulnerable and easy to damage muscles, if you’re not careful. That’s why, to lift safely , it’s best to always start with a low weight, and with only a few reps, then build up to more weight and more reps as you feel each workout becomes too easy. Work on your shoulders 2-3 days per week, to give them plenty of time to rest and recuperate between workouts. We’ve indicated standard set and rep counts for each workout here, but you may need to start smaller. If they’re too hard, try just 1 set of 5 reps per workout."
    },
    {
      "title": "Vary your workouts to target every muscle.",
      "content": "Vary your workouts to target every muscle. Your shoulders aren’t just 1 muscle group! They’re 3 different groups, each of which is engaged with a different motion. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source In order to build boulder shoulders that look huge from every angle, mix up your workouts to include exercises that target each of the 3 muscle groups. For a standard exercise, try doing lateral and front raises, overhead presses, reverse flys, and cable face pulls, and swap in other exercises as you see fit."
    },
    {
      "title": "Hit those upper-back exercises as well.",
      "content": "Hit those upper-back exercises as well. Personal trainer Julian Arana tells us that “having a wider upper back will give you that illusion of having more broad shoulders.” Strengthening your upper back also makes shoulder exercises easier. For faster and bigger gains, also work your back muscles!"
    },
    {
      "title": "Stay consistent and persistent.",
      "content": "Stay consistent and persistent. Whalen says to stick to exercises you’re comfortable with, and keep at it. Muscles aren’t built overnight, but rushing the process will only result in injury and, as a result, fewer gains. Strive to get some strength training in each week, and before you know it, your shoulders will indeed be boulders. You may notice results in just a couple months, and with some hard work and dedication, you could have your very own boulder shoulders within a year!"
    }
  ]
}