{
  "url": "https://www.wikihow.com/Cite-a-YouTube-Video",
  "title": "How to Cite a YouTube Video",
  "steps": [
    {
      "title": "Start your Works Cited entry with the name of the creator.",
      "content": "Start your Works Cited entry with the name of the creator. Type the creator's last name first, followed by a comma, then their first name. Place a period after the name. For more popular YouTube creators, you can do an online search of the user name and find out their real name. If you can't figure out the creator's real name, just use their user name. [1] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Example: Fong, Rachel."
    },
    {
      "title": "Provide the title of the video in quotation marks.",
      "content": "Provide the title of the video in quotation marks. Type the full title of the video using title case, capitalizing the first word and every noun, pronoun, adjective, adverb, and verb in the title. Place a period at the end of the title, inside the closing quotation marks. [2] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Example: Fong, Rachel. \"How to Make Pumpkin Spice Latte Cake Pops!\" Note that if the video title includes its own punctuation, as in the example, you should use that instead of a period."
    },
    {
      "title": "Add the name of the website and uploader.",
      "content": "Add the name of the website and uploader. Type \"YouTube\" in italics, followed by a comma. Then, type the words \"uploaded by\" followed by the user name for the account where you accessed the video. Use conventional spacing and capitalization. Place a comma after the user name. [3] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Example: Fong, Rachel. \"How to Make Pumpkin Spice Latte Cake Pops!\" YouTube , uploaded by Kawaii Sweet World,"
    },
    {
      "title": "Include the date the video was uploaded and the URL.",
      "content": "Include the date the video was uploaded and the URL. Type the date the video was uploaded in day-month-year format, using a 3-letter abbreviation for all months that have more than 4 letters. Place a comma after the date, then copy the URL. Don't include the \"https://\" portion of the URL. Put a period at the end. Example: Fong, Rachel. \"How to Make Pumpkin Spice Latte Cake Pops!\" YouTube , uploaded by Kawaii Sweet World, 26 Sep. 2016, www.youtube.com/watch?v=uDI5ti2ZvBs."
    },
    {
      "title": "Close with the date you accessed the video if required.",
      "content": "Close with the date you accessed the video if required. In MLA style, the access date is optional for web content, including YouTube videos. However, your supervisor or instructor may require it. If so, type the word \"Accessed\" followed by the date you accessed the video in day-month-year format, abbreviating the names of all months with more than 4 letters. Place a period at the end of the date. Example: Fong, Rachel. \"How to Make Pumpkin Spice Latte Cake Pops!\" YouTube , uploaded by Kawaii Sweet World, 26 Sep. 2016, www.youtube.com/watch?v=uDI5ti2ZvBs. Accessed 30 July 2020."
    },
    {
      "title": "Include the creator's surname and a timestamp for in-text citations.",
      "content": "Include the creator's surname and a timestamp for in-text citations. For a standard MLA in-text citation, you put a parenthetical at the end of the sentence, inside the closing punctuation. Within the parenthetical, include the last name of the author (or the user name) and the time stamp where the material you referenced can be found. For example, you might write: Pumpkin spice latte cake pops use homemade pumpkin bread as the base (Fong 1:09). If you use the creator's name in the text of your paper, you only need to include the time stamp in your parenthetical citation. For example, you might write: From the outset, Fong admits that pumpkin spice lattes are \"kind of a polarizing thing\" (0:24)."
    },
    {
      "title": "Type the creator's name or user name first in your Reference List entry.",
      "content": "Type the creator's name or user name first in your Reference List entry. If you know or are able to find the creator's first and last name, type their last name first, followed by a comma, then their first initial. Place a period after the initial. If you're unable to find their real name, just put their YouTube user name instead, with a period after the name. [4] X Research source Example: Mishler, A. In the example, although the creator's full name isn't included on her YouTube page, you could find it with an internet search. However, if you were unable to find it, you could also use the user name. Copy the same capitalization and spacing for the user name that you see on YouTube. [5] X Research source In the example, the user name is \"Yoga With Adriene.\""
    },
    {
      "title": "List the date the video was uploaded.",
      "content": "List the date the video was uploaded. Type the date in parentheses. Put the year first, followed by a comma, then the month and day. Don't abbreviate months. Place a period at the end, outside the closing parenthesis. [6] X Research source Example: Mishler, A. (2017, November 5)."
    },
    {
      "title": "Provide the title and format of the video.",
      "content": "Provide the title and format of the video. Type the title of the video in italics. Use sentence case, capitalizing only the first word and any proper nouns in the title. After the title, place the name of the format in square brackets. Since you're citing a YouTube video, the format will always be \"Video.\" Place a period outside the closing bracket. [7] X Research source Example: Mishler, A. (2017, November 5). Yoga morning fresh [Video]."
    },
    {
      "title": "Close with the site name and URL.",
      "content": "Close with the site name and URL. Type \"YouTube,\" using the same capitalization and spacing the site uses. Place a comma after the site name, then copy the URL for the video. Don't place a period at the end of the URL. [8] X Research source Example: Mishler, A. (2017, November 5). Yoga morning fresh [Video]. YouTube, https://www.youtube.com/watch?v=OMu6OKF5Z1k"
    },
    {
      "title": "Include the creator's name and year in your in-text citation.",
      "content": "Include the creator's name and year in your in-text citation. Whenever you mention material from the video in your paper, add a parenthetical to the end of the sentence with the last name of the creator (or their user name), followed by a comma, then the year the video was posted. This parenthetical goes inside the closing punctuation for the sentence. [9] X Research source For example, you might write: Morning yoga enables you to start the day fresh with a clear mind (Mishler, 2017). If you include the creator's name in the text of your paper, place a parenthetical with the year immediately after their name. For example, you might write: Mishler (2017) emphasizes adjusting poses so that they feel right for you. If you're quoting directly from the video, include a timestamp instead of the page number you would use for a quotation from a print source. For example, you might write: Yoga practitioners are encouraged to find the shape naturally and move \"in a way that feels good\" (Mishler, 2017, 3:49). [10] X Research source"
    },
    {
      "title": "Start your Bibliography entry with the creator's name.",
      "content": "Start your Bibliography entry with the creator's name. If the creator's name is available or you're able to find it, type their last name first, followed by a comma, then their first name. Place a period at the end of the name. If the creator's real name isn't available, start your entry with the user name provided on the YouTube page instead. [11] X Research source If there are 2 creators, type \"and\" after the first creator's name, then add the second creator's name in first name-last name format. Example: Chen, Eddie and Brett Yang."
    },
    {
      "title": "Type the title of the video in quotation marks.",
      "content": "Type the title of the video in quotation marks. Type the title of the video in title case, capitalizing the first word plus any nouns, pronouns, adjectives, adverbs, and verbs. Place a period at the end of the title, inside the closing quotation marks. Example: Chen, Eddie and Brett Yang. \"Emotional Sounds on the Violin.\""
    },
    {
      "title": "Add the user name as the publisher if you didn't use it for the creator.",
      "content": "Add the user name as the publisher if you didn't use it for the creator. If you didn't have the real name for the creator and used the user name instead, you don't have to repeat the user name as the name of the publisher. However, if you had the real name for the creator of the video, list the user name as the publisher. Use conventional spacing and capitalization. Place a period at the end of the user name. Example: Chen, Eddie and Brett Yang. \"Emotional Sounds on the Violin.\" TwoSet Violin."
    },
    {
      "title": "Provide the date the video was posted.",
      "content": "Provide the date the video was posted. Type the words \"Posted on\" followed by the date the video was posted in month-day-year format. Don't abbreviate the name of the month. Place a period at the end of the date. Example: Chen, Eddie and Brett Yang. \"Emotional Sounds on the Violin.\" TwoSet Violin. Posted on December 8, 2018."
    },
    {
      "title": "Close with the type of media, runtime, and URL.",
      "content": "Close with the type of media, runtime, and URL. Since you're citing a YouTube video, use \"YouTube video\" as the type of media. Place a comma after that, then add the full runtime of the video. Place a period at the end of the runtime, then add the full URL. Place a period at the end of the URL. [12] X Research source Example: Chen, Eddie and Brett Yang. \"Emotional Sounds on the Violin.\" TwoSet Violin. Posted on December 8, 2018. YouTube video, 10:31. https://www.youtube.com/watch?v=u7fkd7RVLnQ."
    },
    {
      "title": "Use commas instead of periods for full footnotes.",
      "content": "Use commas instead of periods for full footnotes. Include the same information in your first footnote as you did in your Bibliography entry, but put commas instead of periods between the elements. Type all real names in first-name, last name format, just as you would type them in a regular sentence. Place a period at the end of the footnote. [13] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Example: Eddie Chen and Brett Yang, \"Emotional Sounds on the Violin,\" TwoSet Violin, posted on December 8, 2018, YouTube video, 10:31, https://www.youtube.com/watch?v=u7fkd7RVLnQ. After your first footnote, you only need to use the creator's name and the title of the video in subsequent footnotes. For example: Eddie Chen and Brett Yang, \"Emotional Sounds on the Violin.\" If you quote directly from the video, include a timestamp where the quoted material begins at the end of your footnote."
    }
  ]
}