{
  "url": "https://www.wikihow.com/Be-the-Best-Student-in-Your-Class",
  "title": "How to Become the Best Student",
  "steps": [
    {
      "title": "Listen when your instructor speaks.",
      "content": "Listen when your instructor speaks. If you get distracted you might miss important information and you'll have a harder time understanding what to do or when you have to study later. [1] X Research source If you're having trouble staying focused when your teacher is talking, try sitting in the front and participating more in the class."
    },
    {
      "title": "Solid notes can help you learn better and get that A.",
      "content": "Solid notes can help you learn better and get that A. Taking notes effectively can be tricky, but it will make it much easier for you to learn and study , which means your test scores will improve and your grades will get better. [2] X Research source You don't have to write down everything your teacher says. Just write down the most important things and the things you know you'll have a hard time remembering. Educational consultant Alexander Ruiz, M.Ed., advises recording your teacher's lectures (with their permission): \"I can take any and all of my notes that I need to take without necessarily being worried about missing anything. If I did, I would take the recording and listen to that again, and then review with my notes that I was writing.\" [3] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020."
    },
    {
      "title": "Complete all assignments well and on time.",
      "content": "Complete all assignments well and on time. Do as well on your homework as you can. When you don't understand it, ask someone for help ! Your teacher might be able to set you up with a tutor or even help you themselves. Schedule enough time to actually get your homework done. This might mean watching less TV or spending less time with your friends, but it will be worth it in the end. Getting a good environment to do homework will really help you to get it done. Go somewhere quiet where you don't have any distractions. If you can go to a library, that's a good spot. If you can't leave your house and the people you live with are noisy, try your bedroom. [4] X Research source"
    },
    {
      "title": "Asking questions shows you’re engaged.",
      "content": "Asking questions shows you’re engaged. Whether you’re confused and need clarification, or you’re just invested in the subject and want to know more, asking questions is a great way to show your teacher you’re paying attention and help you learn better. For example, if your teacher is talking about chemistry and Avogadro's number, ask them how they memorize the number. Try not to ask a question just so you have a question to ask. Eventually, this may annoy your teacher. Avoid asking personal questions or something that is important only to you. You can ask about homework, pop quiz dates, or something that does not affect you alone or if you don't understand. \"What pages do we have to read for tomorrow?\" and \"Is there a better method to memorize this?\" will be appropriate. \"Why did I get a D?\" and \"Mrs. H., which boy band is the hottest according to you?\" are definite nos."
    },
    {
      "title": "Everyone needs help from time to time.",
      "content": "Everyone needs help from time to time. Some people feel ashamed or silly asking for help, as if it makes them look stupid. But your teacher will be proud of you for taking the initiative to get the help you know you need. For example, if there's a math test coming up, and you don't fully understand how to divide fractions , ask your teacher if they can go over it with you one more time. Say something like, \"Mr. Green, I'm having a hard time with the homework. Can we maybe meet after school or during lunch, so you can try explaining it in a different way?\""
    },
    {
      "title": "Even if you don’t get the best grades, hard work is admirable.",
      "content": "Even if you don’t get the best grades, hard work is admirable. Even if you're not the smartest and even if you don't get the best test scores, your teacher will notice you working hard, which can help you become their favorite student. Reward yourself and take regular breaks whenever you study or do homework to help you stay motivated ! [5] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020. If you need some extra motivation to study for a test , ask a friend to study with you. It will make studying more enjoyable and fun. [6] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020."
    },
    {
      "title": "Everyone learns best in different ways.",
      "content": "Everyone learns best in different ways. Some people are visual learners, for instance, while others are auditory learners. Take this quiz to find your learning style so you can study in the best way that suits you. [7] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020. Visual learners \"might be really great artists,\" Ruiz notes. If you find it easy to remember charts or pictures, you may be a visual learner. [8] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020. [9] X Research source Tip: Try creating charts to illustrate abstract concepts to help you better understand them—for instance, a chart to memorize the parts of speech. Auditory learners learn best through \"music, being able to memorize based off of auditory things.\" [10] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020. For instance, maybe you can't remember what your teacher wrote on the board, but you can \"hear\" what they said in your head. [11] X Research source Tip: Try recording your teacher when they're talking so that you can listen to their lecture while you do your homework or study. Kinesthetic learners \"learn through action and movement,\" Ruiz says. [12] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020. If you’re a kinesthetic learner, you might feel like you really need to stand up or move around while you listen to a lecture or pace while you study. [13] X Research source Tip: Try playing with a piece of clay in your hand while your teacher talks. You'll have more control over this when you study at home, but you can also talk to your teacher about adjusting how the lessons are taught to include more variety for different style learners. [14] X Research source"
    },
    {
      "title": "Learning doesn’t just happen in a classroom!",
      "content": "Learning doesn’t just happen in a classroom! Diving into school subjects in a way that makes you more passionate about the material can help you stay engaged and be a successful student. For example, if you're studying American history, try watching engaging documentaries online to learn even more about the era you're learning about. You can learn by studying books from your local library and you can also learn a lot online. While Wikipedia isn't always accurate, it's usually a pretty good starting place. You can also find documentaries and educational videos on YouTube, like the popular shows Crash Course and TedTalks. Keep learning during the summer, on the weekends, and start preparing for your next year of school as early as you can by finding out what kind of stuff you'll study."
    },
    {
      "title": "Don’t wait until the last minute!",
      "content": "Don’t wait until the last minute! If you start studying as soon as you know an exam is coming, you’ll be more likely to ace the test. Waiting until the night before can leave you anxious and unprepared. Write down the possible questions that can come on the test and start jotting down key points as soon as you can. Ruiz advises using sticky notes \"as reminder pieces for my studying...[A sticky note] will remind me to study if I put it in a place that I know I'm going to look at often.\" [15] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020. Try waking up a little early on the morning of the test and skim through notes you made while you were studying. Reviewing your notes one last time can really help you grasp last-minute details. The harder the test will be, the earlier you should start studying. Two or three weeks is usually a good starting point. Ruiz recommends finding a study place based on your learning style: \"a learning environment should be dependent on the student's awareness of self when it comes to their learning style.\" [16] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020. For a visual learner, for instance, that might mean \"a place with a lot of color, and creativity and brightness...as opposed to...a dimly lit space.\" Reader Poll: We asked 502 wikiHow readers how they like to prepare for a multiple choice exam, and 50% of them said studying in advance and following a study schedule. [Take Poll] This is also a good strategy for studying in general!"
    },
    {
      "title": "Get your brain and body ready to learn.",
      "content": "Get your brain and body ready to learn. You will learn best and have the easiest time in school if your body is ready to learn! There are lots of things that you can do to get your body ready. Get 8 hours of uninterrupted sleep a night to stay energized and help your brain work best. [17] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Eat plenty of vegetables, fruit, and lean proteins (like chicken and fish), and try to avoid processed food. Drink 11.5 cups (2.7 liters) to 15.5 cups (3.7 liters) of water a day to stay hydrated . [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Being the best student is about more than just good grades.",
      "content": "Being the best student is about more than just good grades. It’s about being a positive presence in the classroom! Focus on making other students feel good by giving them compliments and telling them when they do a good job. Engage with your fellow students: say hello, ask how they felt about last night’s homework, maybe even form a study group and meet up outside of class. Be polite: hold the door open for others, and offer your notes to students who miss class to help them catch up. Not only will being friendly with the other students in your class make them feel good, it’ll make you feel good. It can also help you all feel more supported and confident when studying difficult subject matter. Plus, your teacher will surely notice your positive and friendly attitude, which can only help you!"
    },
    {
      "title": "Treat your teacher with kindness and respect their authority.",
      "content": "Treat your teacher with kindness and respect their authority. If you want to make your teacher happy, being respectful is really the best way to start. Especially if other students are disrespectful, you'll stand out and quickly become their favorite. [19] X Research source Don't be disruptive. Don't pass notes, talk to your friends, make jokes, or move around too much while your teacher is talking. It's fine to joke around with your teacher if they like it; just don't do it too much or they might get frustrated. Be punctual (on time or even early) and don't skip their class. When you're talking to them, be polite . Address them by their preferred name and title and use words like please and thank you."
    },
    {
      "title": "Grades are important, but they’re not everything.",
      "content": "Grades are important, but they’re not everything. It’s more important that you’re happy and healthy. So, try not to get stressed when school gets tough. If you don’t get straight A’s on everything, it doesn’t say anything about your worth. [20] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source Help yourself calm down when you’re feeling overwhelmed by breathing slowly . Remind yourself that everything will be okay. You're strong enough to do this! Try to get good grades , but don’t let it consume your life. Just focus on learning the material as well as you can, and don't worry about the numbers or letters that your teacher assigns. Knowing the material is more important than getting a grade."
    },
    {
      "title": "It’s easier to thrive when you’re being who you are.",
      "content": "It’s easier to thrive when you’re being who you are. Do the things that make you happy. Share the things that you love. Be friends with the people that get you and make you feel good about yourself. Don't worry about what other people think. The truth is that years from now, you won't even remember half of their names. If they don't think you're the coolest person now, you're not going to care in five or six years. What you will care about is how unhappy you are that you didn't do things that made you happy."
    }
  ]
}