{
  "url": "https://www.wikihow.com/Be-a-Strict-Mom",
  "title": "How to Be a Strict Mom",
  "steps": [
    {
      "title": "Make it clear what the rules are.",
      "content": "Make it clear what the rules are. When you set rules, explain them to the entire household. You can even post certain rules on the fridge. This will help your children understand how to act in the house and why you are disciplining them when they get in trouble. Children should realize that they are in trouble because of their bad behavior. Some good rules to set include: Rules about safety: Hold an adult’s hand while you cross the street. Don’t go near the stove while someone is cooking. Rules about manners: Always say please and thank you. Wait your turn in line. Rules about interacting with others: Share your toys. Don’t push other kids. Don't call other people names. Rules about house routines: Put away toys when you are done with them. Don’t touch the thermostat. Clean your dishes when you are done with them. Rules about going out: Be home by curfew. Call if you will be late. Get permission if you are going to a friend’s house after school. No drinking alcohol. [1] X Research source"
    },
    {
      "title": "Establish responsibilities in the household.",
      "content": "Establish responsibilities in the household. Everybody in the household should contribute in some way. You can do this by setting up a chore wheel in the kitchen or by giving everybody a certain responsibility in the house. In addition to cleaning their own rooms, children should help with the house chores. Even toddlers can do age-appropriate chores, such as picking up toys and clothes from the floor. It is up to you whether or not you pay your children an allowance for their chores. Chores include: Keeping their bedroom(s) clean and neat Feeding pets Washing the dishes after dinner Washing their own clothes Dusting and vacuuming Mowing the lawn"
    },
    {
      "title": "Enforce rules consistently.",
      "content": "Enforce rules consistently. When your children break a rule, they should be disciplined. Do not let them off the hook once but punish them another time. This will make your rules seem flexible or negotiable. For minor rule breaks, a firm talking may solve the issue, but you should still remind them that the rules are in place for a reason. While consistency is good, you might change the discipline if your child has been honest with you about breaking a rule. Explain to them that you appreciate them coming to you. This is especially important with teenagers, so that they are willing to come to you when they are in trouble."
    },
    {
      "title": "Respect your spouse’s rules.",
      "content": "Respect your spouse’s rules. If you are raising your children with your spouse, be sure that they agree with your rules. They should also enforce these same rules. If children realize that one parent is more lenient than another, they will start to find loopholes in the house rules. If your spouse establishes a certain rule, you should enforce it as well. If you are divorced or if your child’s other parent has a separate household, you should both agree on some common rules. Establish what rules are the most important. This will give your children some consistency. [2] X Research source If you cannot agree on rules, you should ask a counselor to mediate for you."
    },
    {
      "title": "Re-evaluate the rules.",
      "content": "Re-evaluate the rules. As your children grow up, they need different rules and responsibilities. You may even decide to trust them with more liberties than they had when they were younger. Periodically, examine your household rules and whether they are working or not. Adjust them as needed. Make sure to explain rule changes to children. You might say, \"Now that you are older, I expect that you will help take care of the dog more\" or \"Since you can drive now, I want you to know that you have a new curfew of 9 o clock.\""
    },
    {
      "title": "Use a calm, firm voice.",
      "content": "Use a calm, firm voice. You can raise your voice, but avoid yelling at your children. You will find that you are becoming more upset than they are. Instead, use a stern but level tone that indicates you are not pleased. This will demonstrate that you are in control. [3] X Research source If you are upset, angry, or unable to keep calm, do not discipline your child yet. Find a quiet, safe room where you can become level-headed first. With very young children, however, you may need to discipline them immediately."
    },
    {
      "title": "Show them the consequences of their actions.",
      "content": "Show them the consequences of their actions. Effective discipline shows children that their actions have consequences. This will prepare them for the difficult choices they may have to make later in life. There are two types of consequence-based punishment. These are: Logical Consequences: When your children break a rule, you create a consequence by punishing them. [4] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source This is effective on young children under the age of five who might not yet realize the effect of their actions. [5] X Research source For example, if your toddler throws a tantrum, put them in time-out. Natural consequences: In non-dangerous situations, you let your children make a mistake and learn from the consequences that occur as a result. [6] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source You can start doing this when your child is a toddler up through their teens. For example, if an older child does not do their homework, do not help them with it. Instead, let them get in trouble at school. After school, discuss with them the effect of their actions, and let them know that you expect better from them in the future. [7] X Research source"
    },
    {
      "title": "Take away games, toys, and privileges.",
      "content": "Take away games, toys, and privileges. If your children consistently break the rules, you should take away something they enjoy for a brief period of time. Do this immediately after they break the rule. [8] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Only take away the privilege for a certain period of time. When you return it, make it clear that if they misbehave again, it will be taken away again. For younger children, you might threaten to take away a bedtime story or morning cartoons. Older children might respond better if you temporarily take away a video game console or TV time. If you have a teenager, you might want to take away their cell phone and Internet access for non-school related matters. [9] X Research source Never take away something the child needs. For example, do not take away meals, but you can take away desserts. [10] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source While you might sometimes put your child in time-outs during special events, make sure that your child can still socialize, even when they misbehave. Childhood is an important time to learn social skills."
    },
    {
      "title": "Put younger children in time out.",
      "content": "Put younger children in time out. Set a certain area in your house to be the official “time out” spot. Warn your children that they will be put there if they do not follow the rules. When they do get sent there, set a time limit. One minute per year of age is a good measure. Do not let them leave before the time is up. [11] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source"
    },
    {
      "title": "Ground teenagers.",
      "content": "Ground teenagers. For teenagers, being grounded is the social equivalent of time out. You have taken away their ability to go out with friends. This can be effective to discipline your teenager if done correctly. Set a reasonable time period that they will be grounded for. They should not be grounded for more than a few days. [12] X Research source If your teenager has a birthday party or a dance coming up, warn them that their bad behavior may prevent them from going. [13] X Research source If they want to go, they will have to make it up to you, either by taking on more chores or writing an apologetic letter to you. Do not strip away all of their privileges at once. You may find your teenager is acting out more because they have nothing left to lose. [14] X Research source"
    },
    {
      "title": "Explain why your rules are important.",
      "content": "Explain why your rules are important. Children are not born with an innate sense of rules. They may not understand why you have such rules in place. Explain that you are trying to teach them important lessons about the world. Let them know in a kind manner that you love them, which is why you want them to help them learn how to survive in life. [15] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source You can say, “We have rules in this house because we love you and we want you to be successful. You will always find that there are rules in life, and it’s important for you to learn how to live by them.”"
    },
    {
      "title": "Learn to say no.",
      "content": "Learn to say no. Children and teenagers often like to test their boundaries. They may plead or cry, but you should be firm in saying no when you do not want them to do or have something. If they respond with a tantrum, stand firm. Do not give in, or else you reward their behavior. Instead of telling your children that they cannot do or have something, tell them instead what they can do. For example, instead of saying, “No ice cream before dinner,” say, “you can have an apple instead.” You might try to explain why you said no. For example, “You have to wear your coat outside, or you could get sick.” [16] X Research source You can explain the reason why you said no once or twice, but do not repeat yourself constantly if your child keeps asking. Older children might try to reason with you to convince you to change your mind. If they are respectful and rational, you might consider giving in. This does not make you weak. Rather, it rewards them for reacting in a mature manner instead of throwing a fit."
    },
    {
      "title": "Use positive reinforcement.",
      "content": "Use positive reinforcement. When your children do something right, praise them. They will quickly learn what acceptable behavior is. Your children will associate good behavior with positive attention. Furthermore, by not constantly scolding them, you will develop a stronger relationship with your child. For example, when they say please and thank you to a server at a restaurant, you can say, “I’m so proud of your good manners.” You can also give your child rewards when they have done well. For example, you can say, \"I'm so proud of how well you have been doing in school that I am going to take you out to ice cream.\""
    },
    {
      "title": "Avoid name calling.",
      "content": "Avoid name calling. Being a strict mom does not mean you have to insult or swear at your child. Name calling can be harmful to a child’s self-esteem, and it will not encourage them to improve their attitude. [17] X Research source If you feel yourself getting irrationally angry at your children, try to calm yourself down. Take a deep breath. Count to five before speaking to your child. Leave the room for a few minutes if you need to. [18] X Research source"
    }
  ]
}