{
  "url": "https://www.wikihow.com/Be-Naughty",
  "title": "How to Be Naughty",
  "steps": [
    {
      "title": "Take control.",
      "content": "Take control. Take control in the bedroom. Be bossy. Tell your partner what to do. This is very sexy, even if it seems bad at first. Well, that it seems bad is kind of the point, really. This is also healthy for you because it will help you develop a more satisfying, equal sex life. [1] X Research source"
    },
    {
      "title": "Learn to tease.",
      "content": "Learn to tease. Go slow. Draw things out. Don't go straight for the obvious organ. Explore erogenous zones like ears, backs of the knee, and the inner thigh. Try not even touching your partner. Get them to the point where they're begging you to give them release. Then tease just a few seconds longer before giving in. You can tease in everyday situations too, not just in the bedroom. For example, if you're a girl, you could slip your significant other your panties while you're out in public. Make a restroom run and then discreetly slip them into your partner's pocket. [2] X Research source"
    },
    {
      "title": "Talk dirty",
      "content": "Talk dirty . Try talking dirty. Put on your sexiest voice and start getting very good with adjectives and verbs. Telling your partner where and what you'd like them to do, or even telling them that you are super aroused can be an incredible turn-on. [3] X Research source"
    },
    {
      "title": "Move outside the bedroom.",
      "content": "Move outside the bedroom. Sex doesn't just have to happen in the bedroom. Breaking from the norm and taking it outside of the bed can add a real naughtiness factor. You can surprise your partner in the shower or turn a nighttime movie on the couch into something a bit more."
    },
    {
      "title": "Role play a little.",
      "content": "Role play a little. Role playing is a classic way to spice up a relationship and choosing the right role can really add a naughty factor. Feminine people can go for the naughty schoolgirl or secretary thing, while masculine people could try the eager cop or doctor."
    },
    {
      "title": "Set a record for yourselves.",
      "content": "Set a record for yourselves. Another trick to try would be breaking your own record for how many times you've gone at it in a day or how many places you did it in. Keep track (you can even make yourself a scoreboard and prizes) and be vocal about your goal."
    },
    {
      "title": "Introduce toys.",
      "content": "Introduce toys. Adult toys are another good way to get a little naughty in your relationship. There are lots of toys which increase pleasure for any gender. Surprise your partner with some presents! [4] X Research source It wasn't even your birthday..."
    },
    {
      "title": "Keep things fresh.",
      "content": "Keep things fresh. The main goal is to always be keeping things fresh and not getting stuck in a rut. You will find that simply by prioritizing your sex life and keeping it interesting, the gimmicks like \"naughty\" become much less important."
    },
    {
      "title": "Change up your hair or makeup.",
      "content": "Change up your hair or makeup. Get a sexier haircut or try some sexier makeup looks. Any hair stylist should be able to help you on the hair front and Youtube is awash with great makeup tutorials. [5] X Research source"
    },
    {
      "title": "Do some creative shaving.",
      "content": "Do some creative shaving. You can shave or wax off all your downstairs hair, or you can get really creative and trim it into a heart shape. This will give your partner a fun little surprise and show that you have sex on your mind. [6] X Research source"
    },
    {
      "title": "Practice some staging.",
      "content": "Practice some staging. Take advantage of your clothing an environment to show your significant other exactly what you have in mind. You can try cooking in the nude, and time it so that your partner comes home to that pleasant sight, or you can go full rose-petals-and-candles in the bedroom. There are lots of ways to go about it, so get creative."
    },
    {
      "title": "Add to your wardrobe.",
      "content": "Add to your wardrobe. Ditch those granny panties and that old stretched out shirt and start by making your wardrobe sexier, from the ground up. Sexier underwear, sexier everyday clothes, maybe even a sexy date outfit. You've got to get the look if you really want to make it convincing for your partner."
    },
    {
      "title": "Work out.",
      "content": "Work out. No, we don't mean work out to get thinner and more traditionally sexy. Tradition is boring. You should work out because studies have shown that physical exertion increases sexual pleasure and appetite. Try going for a light jog before your partner comes home."
    },
    {
      "title": "Ask first!",
      "content": "Ask first! You don't have to constantly be asking them how they're doing in the moment, but a good way to work up to naughty play is to ask them about their fantasies well in advance of trying anything new. Ask in a sexy voice for bonus points."
    },
    {
      "title": "Look for your partner's reactions.",
      "content": "Look for your partner's reactions. While you're trying new things, look at how your partner reacts. Don't just listen to what they say afterwards: watch how they react in the moment. If they seem to stiffen or shy away, they may not be enjoying it as much as they say."
    },
    {
      "title": "Take things slowly.",
      "content": "Take things slowly. Don't go from Sunday School to full Marquis de Sade in the course of a day. This can make a partner panic if it wasn't a specifically requested fantasy. Work your way up the kink chain in order to maximize the pleasure of the experiences for both of you."
    },
    {
      "title": "Keep regular life and bedroom life separate.",
      "content": "Keep regular life and bedroom life separate. Just because your partner likes being called certain things in the bedroom doesn't mean you should call them that outside. You also should try not to let behaviors that you pick up affect you outside of the bedroom. Remember that real life and your sex life are two separate things."
    },
    {
      "title": "Don't do anything you'll regret.",
      "content": "Don't do anything you'll regret. Don't do anything in the name of naughtiness that you might later regret, especially if you're young. The Internet being what it is these days, it's really easy for pics to get leaked and your life can be ruined before you know it. Avoid taking nude pics (no matter how stable your relationship is), and while sex tapes can be fun, they're best reserved for happily married couples that have been together for a very long time. Even with explicit trust between each other, it's important to remember that there are other ways for your data to get leaked. Like hackers."
    },
    {
      "title": "Stop apologizing.",
      "content": "Stop apologizing. The most important thing to be convincingly naughty with your significant other is to be confident and comfortable with yourself. The first step to being more confident and comfortable is to stop apologizing to everyone. Stop apologizing for not being sexier, stop apologizing for gaining weight, stop apologizing for wanting to have sex. You have desires and needs and feelings, and they are valid. [7] X Research source"
    },
    {
      "title": "Stop trying to look like a movie star.",
      "content": "Stop trying to look like a movie star. You don't need to look like a movie star or a porn star to be worthy of your partner or for them to think you're sexy. They chose you. They're with you. They think you're sexy. Besides, sexy is mostly about how you act, not how you look."
    },
    {
      "title": "Celebrate your positives.",
      "content": "Celebrate your positives. Find the best things about yourself (your attitude, your best feature) and celebrate that thing. Whether it's your pert little butt or your great 'tracks of land', or your muscles, it's all good! You have to know what you can build on, while also giving yourself a sort of grounding point to help you remember that you are, in fact, a total fox. [8] X Research source"
    },
    {
      "title": "Embrace your sexual side.",
      "content": "Embrace your sexual side. You are a sexual creature. That is normal and, really, a great thing. If you're spending a bunch of time being too embarrassed about sex to really enjoy it, then you're not going to be very good at this naughty thing. Be sexual. Be okay with being sexual. This is very important. [9] X Research source"
    },
    {
      "title": "Figure out what gives you pleasure.",
      "content": "Figure out what gives you pleasure. Comfortable with that sexual side now? Good. Now experiment, either solo or with a partner, and explore your body. Figure out what really brings you pleasure. Find your \"on\" button. You'd think that being naughty is all about pleasuring your partner , but it's also about telling your partner (in a very naughty manner) exactly how to pleasure you . [10] X Research source"
    }
  ]
}