{
  "url": "https://www.wikihow.com/Configure-a-Static-Internet-Protocol-(IP)-Address-on-a-Computer",
  "title": "How to Configure a Static Internet Protocol (IP) Address on a Computer",
  "steps": [
    {
      "title": "Open Start .",
      "content": "Open Start . Click the Windows logo in the bottom-left corner of the screen. The Start menu will pop up."
    },
    {
      "title": "Open Settings .",
      "content": "Open Settings . Click the gear-shaped icon in the lower-left side of the Start menu."
    },
    {
      "title": "Click Network & Internet.",
      "content": "Click Network & Internet. It's in the middle of the Settings window. [1] X Expert Source Stan Kats Cybersecurity Expert Expert Interview. 16 July 2021."
    },
    {
      "title": "Click View your network properties.",
      "content": "Click View your network properties . This link is near the bottom of the page. If you don't see this link, scroll down. You may also need to click the About tab in the upper-left corner of the window."
    },
    {
      "title": "Scroll down to the \"Wi-Fi\" heading.",
      "content": "Scroll down to the \"Wi-Fi\" heading. It's near the bottom of the page. You'll see a list of information about your Wi-Fi connection here."
    },
    {
      "title": "Note the \"Default gateway\" address.",
      "content": "Note the \"Default gateway\" address. The address to the right of the \"Default gateway\" heading is the address you'll enter in a web browser to access your router's page."
    },
    {
      "title": "Press ⊞ Win+X.",
      "content": "Press ⊞ Win + X . Doing so will open the advanced Start menu. You can also right-click the Start icon in the lower-left corner of the screen."
    },
    {
      "title": "Click System.",
      "content": "Click System . It's in the advanced Start menu. Doing so opens a window with your Windows computer's specifications."
    },
    {
      "title": "Note your computer's name.",
      "content": "Note your computer's name. This is a name (typically a jumble of letters and numbers) to the right of the \"Device name\" heading in the middle of the page. At this point, you're ready to proceed with setting a static IP address ."
    },
    {
      "title": "Open the Apple menu .",
      "content": "Open the Apple menu . Click the Apple logo in the top-left corner of the screen. A drop-down menu will appear."
    },
    {
      "title": "Click System Preferences….",
      "content": "Click System Preferences… . You'll find this option in the drop-down menu. [2] X Expert Source Stan Kats Cybersecurity Expert Expert Interview. 16 July 2021."
    },
    {
      "title": "Click Network.",
      "content": "Click Network . It's in the System Preferences window. [3] X Expert Source Stan Kats Cybersecurity Expert Expert Interview. 16 July 2021."
    },
    {
      "title": "Click Advanced….",
      "content": "Click Advanced… . This option is in the lower-right side of the window. Doing so opens a new window."
    },
    {
      "title": "Click the TCP/IP tab.",
      "content": "Click the TCP/IP tab. It's at the top of the window."
    },
    {
      "title": "Note the \"Router\" address.",
      "content": "Note the \"Router\" address. The address to the right of the \"Router\" heading (usually some variation of \"192.168.X.X\" or \"10.0.0.X\") is the address you'll use to access your router's page."
    },
    {
      "title": "Find your Mac's name.",
      "content": "Find your Mac's name. You'll need to know the name of your Mac in order to find your Mac on your router's page; once you do this, you'll be ready to set a static IP address : Close the Advanced window. Click ⋮⋮⋮⋮ in the upper-left side of System Preferences. Click Sharing . Note the \"Computer Name\" entry at the top of the window."
    },
    {
      "title": "Open a web browser.",
      "content": "Open a web browser. Click or double-click the app icon for your preferred web browser (e.g., Google Chrome)."
    },
    {
      "title": "Enter your router's address.",
      "content": "Enter your router's address. In the address bar at the top of the browser window, type in the address you retrieved for your router, then press ↵ Enter . This will open your router's page."
    },
    {
      "title": "Log in if necessary.",
      "content": "Log in if necessary. If prompted for a username and/or password, type in the required credentials and press ↵ Enter . If you didn't set a username and/or password, you'll probably need to use the factory credentials found either in the router's manual or on the router itself."
    },
    {
      "title": "Find the list of connected Internet items.",
      "content": "Find the list of connected Internet items. Since each router's page will vary in terms of item placement and titling, you may have to poke around the router page or menu to find this section. For example, some routers place the Connected Devices button on the main page, while other router pages require you to click Settings or Advanced to see the list of connected items."
    },
    {
      "title": "Find your computer's name.",
      "content": "Find your computer's name. Look for the name that you found earlier in the list of connected items."
    },
    {
      "title": "Click the Reserve button.",
      "content": "Click the Reserve button. You'll probably find this next to (or below) the computer's name and address, though you may first have to click your computer's name to do so. Again, your router's page may show a different option here. If prompted to confirm your choice or specify an unused IP address, do so before proceeding."
    },
    {
      "title": "Click Save or Apply.",
      "content": "Click Save or Apply . It's usually at the bottom of the page. This will save your changes and apply your new IP address to the computer. You may need to restart your computer for the changes to take place, and the router may reboot as well."
    }
  ]
}