{
  "url": "https://www.wikihow.com/Clean-Fabric-Vertical-Blinds",
  "title": "How to Clean Fabric Vertical Blinds",
  "steps": [
    {
      "title": "Release the blinds.",
      "content": "Release the blinds. If your blinds are pulled back or off to one side, release, slide, or pull them open so that all of the vertical panels hang where the flat, wide surface is facing you. [1] X Research source This will make it easier for you to see and reach the entire front and back surfaces of the fabric blinds."
    },
    {
      "title": "Attach a soft brush head attachment to a vacuum hose.",
      "content": "Attach a soft brush head attachment to a vacuum hose. Follow the instructions for your vacuum to switch from the ground setting to the hose setting. Then, attach the soft brush head to the end of the hose. You can usually find the soft brush head attachment on the side of your vacuum, and attach it by simply slipping it on top of the end of the hose. If you don’t have a soft brush head attachment, you may be able to purchase one separately. If not, you can just use the hose setting, though using a soft brush head attachment will keep the vacuum from harming the fabric. [2] X Research source"
    },
    {
      "title": "Vacuum each of the fabric blind panels.",
      "content": "Vacuum each of the fabric blind panels. After attaching the soft brush head attachment, turn on the vacuum. Run the vacuum hose down each panel, starting at the top. Pay extra close attention to any creases or seams in the fabric, as these tend to gather more dust and dirt. [3] X Research source Repeat on the back until you have vacuumed both sides of the blind panels. If the brush head appears clogged or if you notice dirt getting left behind after passing over a spot, you may need to periodically stop and clear the brush head opening if your blinds are particularly dusty."
    },
    {
      "title": "Combine mild dish soap and water for a gentle cleaning solution.",
      "content": "Combine mild dish soap and water for a gentle cleaning solution. In a large bowl, mix in about 4 tablespoons (59 mL) of mild dish soap with approximately 4 cups (950 mL) of water. Stir the soap and water well with a spoon until the solution is completely combined. [4] X Research source [5] X Expert Source Daniel Olin Home Cleaning Specialist Expert Interview. 12 October 2021. Mild dish soap is recommended because it is a mild cleaner that generally won’t damage or discolor fabric. [6] X Research source While dish soap is cheaper and generally as effective, you can also use a liquid spot clean stain remover. When using a liquid spot clean stain remover, follow the instructions on the label and make sure to check that the stain remover you choose is safe for the fabric."
    },
    {
      "title": "Apply the soap solution with a microfiber cloth.",
      "content": "Apply the soap solution with a microfiber cloth. Wet the cloth in the solution until it is saturated but not dripping. [7] X Research source [8] X Expert Source Daniel Olin Home Cleaning Specialist Expert Interview. 12 October 2021. Starting at the top of the blinds, spot clean any stains by dabbing the microfiber cloth with the soap solution on the stains. Work your way down the front before flipping it over and spot cleaning the back. Repeat this on each blind until all of them are spot cleaned. If the cloth gets too wet, gently wring it out so that it won’t drip down the blinds or on your floor. If you don’t have a clean microfiber cloth on hand, you can also use a clean acrylic or polyester sock. [9] X Research source You may want to test out the soap solution on an inconspicuous area before applying it to all the stains on the blinds. [10] X Research source If you do this, wait a few minutes after applying the test spot to make sure that it hasn’t had an adverse reaction with your fabric blinds. Be sure to hold and support the blinds as you clean them so they don't come off the track. [11] X Expert Source Daniel Olin Home Cleaning Specialist Expert Interview. 12 October 2021."
    },
    {
      "title": "Wipe off the soap solution.",
      "content": "Wipe off the soap solution. Wet a clean microfiber cloth under the sink with cool water until it is saturated but not dripping. Rub the clean cloth gently on the places you have spot cleaned until there aren’t any soap suds visible. [12] X Research source If any stains are particularly stubborn, you can repeat this by applying the soap solution and wiping it off again until they have faded."
    },
    {
      "title": "Let the blinds air dry.",
      "content": "Let the blinds air dry. Heat can set a stain in fabric, so for best results, let the fabric air dry. [13] X Research source Leave the blinds open and flat for 1 to 2 days to let them completely dry before pulling them off to the side again."
    },
    {
      "title": "Take the blinds down.",
      "content": "Take the blinds down. Unstring or unhook each of the fabric blind panels from the top to take the vertical blinds down . [14] X Research source You may need to check the instructions for directions on how to remove each of the blind panels, as this can vary from one set to another."
    },
    {
      "title": "Attach a soft brush head attachment to a vacuum hose.",
      "content": "Attach a soft brush head attachment to a vacuum hose. On your vacuum, switch from the ground setting to the hose setting and, if you have one, attach the soft brush head attachment to the end of the hose by sliding it on top of the end of the hose. The soft brush head attachment is usually stored on the side of your vacuum. If you don’t have a soft brush head attachment, you can purchase one separately or just use the hose setting. A soft brush head attachment is recommended, though, because it can keep the vacuum from harming the fabric. [15] X Research source"
    },
    {
      "title": "Vacuum all the fabric panels.",
      "content": "Vacuum all the fabric panels. Lay all the blind panels out on a clean, flat surface. Then, using your vacuum hose with the soft brush head attached, vacuum down each of the panels. Make sure that you vacuum inside or alongside any creases or seams in the fabric, as these tend to gather dust and dirt. [16] X Research source After you have vacuumed the front of all the panels, turn them over and vacuum the back of each panel. If the vacuum does not seem to be picking up as much dust at any point, you may need to periodically stop and clear the brush head opening if your blinds are particularly dusty."
    },
    {
      "title": "Fill your bathtub with mild dish soap and water.",
      "content": "Fill your bathtub with mild dish soap and water. Fill your clean bathtub with cool water until it is full enough to submerge all the blinds, about 1/2 to 3/4 full. Then, add about 4 ounces (110 g) of mild dish soap. Swish the soap around in the water to combine. [17] X Research source Mild dish soap is recommended because it is a mild cleaner that generally won’t damage or discolor fabric. [18] X Research source"
    },
    {
      "title": "Submerge the blinds in the bathtub.",
      "content": "Submerge the blinds in the bathtub. Once the soap and water solution is mixed, place each of the vacuumed fabric blind panels into the bathtub. Submerge the panels until all of them are under the water. If the panels float to the top, flip them over every so often while they are soaking. Or, if only one side is stained, keep the stained side facing down so that it stays submerged. You may want to test out the soap solution on an inconspicuous area before applying it to all the stains on the blinds. [19] X Research source To do this, use a clean sponge and dip it in the soap solution. Apply the soap solution with the sponge to a small area. Wait a few minutes after applying the test spot to make sure that it hasn’t had an adverse reaction with your fabric blinds."
    },
    {
      "title": "Let the blinds soak for a few hours.",
      "content": "Let the blinds soak for a few hours. Leave your fabric blind panels to soak in the bathtub filled with the soap solution for 2 to 4 hours. [20] X Research source If your blinds are particularly dirty, you can leave them for longer (about 6 hours)."
    },
    {
      "title": "Scrub the fabric blinds with a clean sponge.",
      "content": "Scrub the fabric blinds with a clean sponge. After the blind panels have soaked for several hours, use a clean sponge to gently scrub the remaining stains and dirty spots. For particularly stubborn stains, you can squirt a bit more dish soap on the sponge and gently scrub again. If your sponge is rough, make sure that you scrub very gently to avoid causing the fabric to pill."
    },
    {
      "title": "Rinse the blinds with clean water.",
      "content": "Rinse the blinds with clean water. First, drain the soap solution out of the tub. Then, turn on the shower head or bath faucet and run with cool water. Hold each panel under the water until all the soap solution is washed out of the fabric."
    },
    {
      "title": "Let your fabric vertical blinds dry completely.",
      "content": "Let your fabric vertical blinds dry completely. Lay each panel on a clean, flat surface. Let the blinds air dry completely for 1 to 2 days before hanging them back up. [21] X Research source"
    }
  ]
}