{
  "url": "https://www.wikihow.com/Activate-Windows-8.1-for-Free",
  "title": "How to Get Windows 8.1 for Free",
  "steps": [
    {
      "title": "Download a key retrieval program.",
      "content": "Download a key retrieval program. Your Windows Product key is buried in the registry, but it can be easily extracted by using a free key retrieval program. Two of the most popular options are ProductKey and Key Finder. Both of these programs are free and can be downloaded from the developers' websites. Both offer paid versions, but your Windows key can be retrieved with the free version."
    },
    {
      "title": "Start the key retrieval program.",
      "content": "Start the key retrieval program. You typically will not need to install the program. Simply run it and a list of available keys will be displayed. Find the \"Windows\" entry to find your key."
    },
    {
      "title": "Write the key down or copy it.",
      "content": "Write the key down or copy it. Your key will be listed as \"Product Key\" or \"CD Key\". The Windows Product Key is 25 characters split into five groups of five characters each."
    },
    {
      "title": "Open the Activation window.",
      "content": "Open the Activation window. Open the Activation window by pressing ⊞ Win + R and typing slui 3 . Press ↵ Enter to open the window."
    },
    {
      "title": "Enter your product key.",
      "content": "Enter your product key. Enter the key that you either recovered, received with your Windows purchase, or is affixed to your computer on a sticker. You do not need to type the dashes, as they will be added automatically. Windows will automatically attempt to activate as soon as the key is entered."
    },
    {
      "title": "Try the Command Prompt.",
      "content": "Try the Command Prompt. If the steps above don't work, you can try to enter the key through an elevated Command Prompt. Press ⊞ Win + X and select \"Command Prompt (Admin)\". Type slmgr.vbs /ipk XXXXX-XXXXX-XXXXX-XXXXX-XXXXX and press ↵ Enter , replacing the XXXXX s with your product key. Be sure to include the dashes. A window should appear saying \"Installed product key XXXXX successfully.\" Type slmgr.vbs /ato and press ↵ Enter . A window should appear saying \"Activating Windows(R) Your Edition \". After a moment, if activation was successful, it will say \"Product activated successfully\"."
    },
    {
      "title": "Call Microsoft if you still can't activate.",
      "content": "Call Microsoft if you still can't activate. If you are still having activation issues, you can call the Microsoft automated activation service. To find the number for your area, press ⊞ Win + R and type slui 4 . This will open the window with the contact information as well as your installation ID. Make sure to copy down the installation ID, as you will need to enter it over the phone. It's long, but necessary to identify your computer. [1] X Research source"
    }
  ]
}