{
  "url": "https://www.wikihow.com/Care-for-Ants",
  "title": "How to Care for Ants",
  "steps": [
    {
      "title": "Feed your ants once every 6 hours during the day.",
      "content": "Feed your ants once every 6 hours during the day. Ants need to eat regularly in order to stay healthy and to reproduce. Ants are omnivorous eaters and can be fed a variety of foods including bread or cake crumbs, bits of bread soaked in sugar water, or tiny pieces of fruit. Begin by giving the ants 1 small handful of food at every meal time. As time passes, adjust the amount of food that you give the ants after observing how much they eat. [1] X Research source For example, if the ants only eat about half of the food you give them with each meal, cut back on the amount you give them."
    },
    {
      "title": "Give your ants soft-bodied insects with their feedings for protein.",
      "content": "Give your ants soft-bodied insects with their feedings for protein. Since the natural diet of all species of ants contains large amounts of insects, purchase crickets, flies, mealworms, or wax worms from a pet store. Give the ant colony 4–6 such insects with each feeding. Make sure that the insects are dead (or wait for them to die) before you give them to the ants. [2] X Research source It’s important that your pet ants receive plenty of protein or they won’t be able to produce healthy young. They may die, also."
    },
    {
      "title": "Provide your ants with a mixture of sugar and water to drink.",
      "content": "Provide your ants with a mixture of sugar and water to drink. Ants need plenty of sweet substances. You can make your own sugar water easily. Mix 7 parts of tap water with 1 part of sugar (or, if you prefer, honey). Pour about 1 tablespoon (15 mL) in the lid of a soda bottle. Set the lid in the ant farm so that the colony can drink from it as they please. Keep an eye on the water in the bottle cap and replenish it as soon as it starts to get low."
    },
    {
      "title": "Mist the inside of the farm to give the ants additional water.",
      "content": "Mist the inside of the farm to give the ants additional water. If you live in a warm climate, the syrupy water and sugar mixture may not be enough to keep your ants hydrated. So, fill a spray bottle with water, and lightly mist the interior walls of the ant farm or glass jar until they’re covered with water droplets. [3] X Research source The droplets will work their way into the soil—or, if ants are thirsty, they can drink the droplets. Do not spray water directly into the sandy soil of the ant farm. You could cause the ants’ tunnels to collapse or drown the insects."
    },
    {
      "title": "Purchase an ant farm from a local pet store for a quick, easy option.",
      "content": "Purchase an ant farm from a local pet store for a quick, easy option. The simplest way to do this is to visit a local pet supply store and purchase a sand-filled ant colony. These thin, vertical glass structures are usually about 12 inches (30 cm) high and allow you to observe your ants as they dig and build tunnels. If the farm isn’t already filled with sand, speak to the pet store staff. They should have some sand or soil on hand to fill up the farm with. [4] X Research source Ant farms are relatively cheap. You should be able to find one for less than $15 USD. If you’re a first-time ant owner—or if you’re helping your child care for an ant colony—a premade ant farm is the way to go."
    },
    {
      "title": "Build your own ant farm for a more hands-on approach.",
      "content": "Build your own ant farm for a more hands-on approach. If you’re a more experienced ant owner and you’d prefer to set up your own ant farm , you don’t have to use a pre-made ant farm. Find 1 large glass jar and 1 smaller glass jar, and place the smaller jar inside the large one. Go outside and gather several handfuls of loose soil and deposit the dirt inside the larger of the 2 jars. [5] X Research source If the soil is moist and forms clumps, mix it with 2-3 handfuls of sand. This allows the ants to tunnel through the soil and sand mixture."
    },
    {
      "title": "Locate the ant farm on a flat, stable surface away from direct light.",
      "content": "Locate the ant farm on a flat, stable surface away from direct light. Once it’s set up and filled with soil and sand, set the ant farm on a sturdy tabletop, desk, or shelf where it won’t be jostled or fall over. Keep the ant farm out of direct light, as well. Don’t set it in front of a window or directly under a desk lamp. Instead, place it where it will receive ambient or indirect light. Direct, bright light can interfere with ants’ reproduction cycles by killing larvae and eggs."
    },
    {
      "title": "Place a heating mat underneath the farm to regulate its temperature.",
      "content": "Place a heating mat underneath the farm to regulate its temperature. Most species of ants thrive when the temperature stays consistently between 20–28 °C (68–82 °F). To keep the temperature stable, place an electric heat mat beneath the ant colony. Then place a thermometer inside of the ant farm or glass bottle so you can keep an eye on the temperature. Your local pet supply shop should have a stock of electronic heat mats."
    },
    {
      "title": "Purchase 25–30 ants from your local pet store.",
      "content": "Purchase 25–30 ants from your local pet store. Once your farm is set up, it’s time to fill it with ants. Pay another visit to a pet store and ask to look at their ant inventory. So that the ants form a single colony (and don’t kill each other), all of the ants you purchase should be of a single species. [6] X Research source If you have a choice between different species of ants, ask for Lasius niger : a species of black garden ant that doesn’t bite."
    },
    {
      "title": "Harvest your own pet ants",
      "content": "Harvest your own pet ants directly from nature if you prefer local ants. If you’d rather not get ants from a pet store but prefer to collect them yourself, head out into your or a nearby forest and look for an ant hill. When you find one, poke a wooden stick or tongue depressor into the center of the nest and wait for ants to climb on. [7] X Research source Once 10–12 ants are on the stick, deposit them inside a glass jar. Repeat this until you’ve collected about 30 ants. If no ants are coming out of the anthill, put a little sugar water, jam, or honey in a jar or shallow dish. Leave it next to the hill for an hour and, when you come back, it should be full of ants."
    },
    {
      "title": "Ensure that your colony of ants contains a queen.",
      "content": "Ensure that your colony of ants contains a queen. Regardless of whether you purchased or harvested your ants, it’s crucial that the colony contains a queen. Queen ants are visually identifiable: they’re 2-3 times the size of most worker ants, and have a long, broad thorax. [8] X Research source If you’re harvesting your own ants and can’t visually identify a queen ant, keep collecting ants until you obtain a queen. If you try to make a colony out of only worker and drone ants, they won’t be able to reproduce and will all die off within a couple of months."
    },
    {
      "title": "Avoid handling the ants directly when you transport them.",
      "content": "Avoid handling the ants directly when you transport them. When you’re transporting ants from one storage location to another (e.g., from the container you purchased them in from a pet store into the ant farm or container), dump the ants out rather than scooping them with your hands. Never try to pick a group of ants up in your hand. Ant bites can be painful and are best avoided. [9] X Research source If, for some reason, you must place your hands into the ant colony, wear a pair of latex"
    }
  ]
}