{
  "url": "https://www.wikihow.com/Apply-Highlighter",
  "title": "Where to Put Highlighter on Your Face: Easy Steps + a Video Tutorial!",
  "steps": [
    {
      "title": "Apply highlighter to the inner corners of your eyes.",
      "content": "Apply highlighter to the inner corners of your eyes. Use a highlighting eyeshadow brush and get a little highlighter onto the tip. Then, take the brush and press it into the corners of your inner eyelids. [1] X Research source You can apply a couple of layers if you want a more dramatic effect or just apply a light dusting for some subtle highlights."
    },
    {
      "title": "Sweep highlighter onto your brow bones.",
      "content": "Sweep highlighter onto your brow bones. The areas just below your eyebrows will catch a lot of light, so this is a nice area to highlight. Try sweeping highlighter over your brow bones, the areas just under your eyebrows. [2] X Research source Try to keep most of the highlighter on the outer edges of your brow bone. You do no need to apply highlighter to your entire brow bone. You can also extend the highlighter down towards the creases of your eyelids for an extra eye brightening effect. [3] X Research source"
    },
    {
      "title": "Add a dab of highlighter just above your upper lip.",
      "content": "Add a dab of highlighter just above your upper lip. The area in the center of your upper lip is called your cupid’s bow and highlighting this area will draw more attention to your lips. [4] X Expert Source Christin Birckhead Makeup Artist Expert Interview. 14 April 2020. Get a small amount of highlighter on your fingertip and press it onto this area. [5] X Research source Don’t apply the highlighter to your actual lip, just to the area right above your lip."
    },
    {
      "title": "Brush highlighter over the center of your chin.",
      "content": "Brush highlighter over the center of your chin. Highlighting the center of your chin can also help to draw attention to your lips. Try sweeping some highlighter onto the center of your chin. [6] X Research source Be careful not to apply too much highlighter to this area. You only need a light dusting. If you highlighted your forehead, then try to keep the highlighter on your chin in line with the highlighter on your forehead. You can also apply highlighter right above your chin. [7] X Expert Source Christin Birckhead Makeup Artist Expert Interview. 14 April 2020."
    },
    {
      "title": "Try applying foundation and concealer first.",
      "content": "Try applying foundation and concealer first. This will create a more even canvas for your highlighter. [8] X Research source Use a sponge or makeup brush to blend your foundation. If you have any dark circles or minor imperfections, concealer will add extra coverage to those areas and draw more attention to the highlighted area."
    },
    {
      "title": "Apply highlighter to the tops of your cheekbones.",
      "content": "Apply highlighter to the tops of your cheekbones. Take a blush brush or a kabuki brush and use it to apply a bit of highlighter from your temples to the tops of your cheekbone in a C-shaped curve. You can apply one layer for a subtle effect or apply multiple layers for more intense highlights. [9] X Research source It may help to apply blush to the apples of your cheeks first, and then start to apply highlighter where the blush has stopped. [10] X Expert Source Christin Birckhead Makeup Artist Expert Interview. 14 April 2020."
    },
    {
      "title": "Dab a little highlighter on the tip of your nose.",
      "content": "Dab a little highlighter on the tip of your nose. Get a bit of highlighter onto your fingertip and then dab it onto the tip of your nose. [11] X Expert Source Christin Birckhead Makeup Artist Expert Interview. 14 April 2020. Move your finger back and forth to blend the highlighter. Remember that you do not need much highlighter, just a small dab. [12] X Research source"
    },
    {
      "title": "Brush some highlighter down the center of your forehead.",
      "content": "Brush some highlighter down the center of your forehead. To accentuate the center of your forehead, you can sweep some highlighter down the center of your forehead towards the bridge of your nose. [13] X Research source Start at the center of your hairline on your forehead and sweep straight downwards. If you want a more dramatic highlighting effect, then you can sweep the highlighter all the way down the bridge of your nose, but this is optional."
    }
  ]
}