{
  "url": "https://www.wikihow.com/Boogie-Board",
  "title": "How to Boogie Board",
  "steps": [
    {
      "title": "Choose a calm spot for boogie boarding.",
      "content": "Choose a calm spot for boogie boarding. Go to a swimming beach that has waves less than 2 ft (61 cm) high. Make sure that the beach is free of large rocks, boats, and fishing equipment. Also, make sure that you have permission to boogie board at the location. [1] X Research source"
    },
    {
      "title": "Select a boogie board suited to your height and weight.",
      "content": "Select a boogie board suited to your height and weight. When standing on its tail, the board should reach to within 1 in (2.54 cm) of your belly button. As for width, you should be able to hold the board under your arm and against your side without much slack between your armpit and the edge of the board. [2] X Research source Choose a bodyboard shorter than 40 in (101.6 cm) if you are shorter than 5 feet (1.5 m) 6 in (167.6 cm) and weigh less than 130 lbs (59 kg). [3] X Research source Choose a bodyboard between 40 and 43 in (101.6 and 109.2 cm) if you are between 5 feet (1.5 m) 7 in and 6 feet (1.8 m) 3 in (170.2 and 190.5 cm), and weigh between 130 and 210 lbs (59 and 95.3 kg). [4] X Research source Choose a bodyboard taller than 44 in (111.8 cm) if you are taller than 6 feet (1.8 m) 3 in (170.2 cm) and weigh more than 210 lbs (95.3 kg). [5] X Research source"
    },
    {
      "title": "Wax your board.",
      "content": "Wax your board. Adding wax to your board improves its grip. Apply a small amount of surf wax to the top third of the board (called the nose), the bottom third of the board (called the tail), and the rails (the side edges of the boogie board). [6] X Research source"
    },
    {
      "title": "Wear a rashguard.",
      "content": "Wear a rashguard. A rashguard will protect your skin from the sun and also reduce chafing and irritation from the boogie board itself. A rashguard is highly recommended, although you don’t need to have one to boogie board. [7] X Research source"
    },
    {
      "title": "Put on swim fins.",
      "content": "Put on swim fins. Choose fins, such as those used for snorkeling, that attach to your ankle. Though not a requirement, wearing swim fins will help you kick your way out into the surf and catch waves, as well as steer and control the boogie board."
    },
    {
      "title": "Secure the boogie board leash to your wrist or arm.",
      "content": "Secure the boogie board leash to your wrist or arm. To avoid losing your board in the current, choose a leash for your bicep or wrist, depending on what you find more comfortable. Most boogie boarders use a bicep leash. Secure the leash to your wrist or to your bicep before entering the water. [8] X Research source"
    },
    {
      "title": "Get into position.",
      "content": "Get into position. Wade into the water until you are knee-deep, then lie down with your belly on the board. Your hips should be in contact with the tail of the board. Your hands should be placed on the top corners of the board. [9] X Research source"
    },
    {
      "title": "Kick",
      "content": "Kick and paddle to where the waves are breaking. Be sure to keep your fins underwater. You can choose to paddle with one hand or with both hands. When a wave is about to break, you will see a bulge form at the highest point, or the crest, of the wave."
    },
    {
      "title": "Choose the wave you want to ride.",
      "content": "Choose the wave you want to ride. Not every wave will be strong enough to carry you. Attempt smaller, less powerful waves at first and work your way up to larger ones. The larger the wave is, the farther you'll be able to ride it."
    },
    {
      "title": "Point the nose of the board toward the beach.",
      "content": "Point the nose of the board toward the beach. Turn your boogie board around so that you are facing the beach before the wave starts to break. Arch your back and keep your head up."
    },
    {
      "title": "Paddle and kick toward the beach.",
      "content": "Paddle and kick toward the beach. You want to be moving in the same direction the wave will break. Getting ahead of the wave will help you catch it. Be sure to keep your legs slightly apart and your fins underwater. Scoop the water with your hands to gain speed. [10] X Research source Position yourself in the belly of the wave you are trying to catch; avoid the crest and the tip-top of the wave."
    },
    {
      "title": "Catch the wave.",
      "content": "Catch the wave. If you have paddled the board at the right speed and in the direction of the wave, you should now feel yourself moving effortlessly toward the beach. You should no longer need to kick or paddle, as the wave will do the work for you. Keep your elbows on the board, rather than in the water, for better control."
    },
    {
      "title": "Lean left to turn left and lean right to turn right.",
      "content": "Lean left to turn left and lean right to turn right. To turn right, apply pressure to the board with your right elbow and grip the left rail with your left hand. To turn left, apply pressure to the board with your left elbow and grip the right rail with your right hand. [11] X Research source"
    },
    {
      "title": "Make a bottom turn.",
      "content": "Make a bottom turn. A good bottom turn is the foundation for all other maneuvers, such as 360s. [12] X Research source As the wave catches you, keep your hands over the nose of the board. Lean onto your left elbow to dig the edge of the body board into the wave. LIft the right rail with your right hand. Extend your legs as you turn to prevent your feet from dragging in the water. After you start to turn, center your body weight on the board and lean forward slightly to gain speed."
    },
    {
      "title": "Do a cut back.",
      "content": "Do a cut back. A cut back is a turn back to the curl of the wave that you can do to regulate your speed or to reposition yourself along the wave. [13] X Research source Shift your weight on the outside rail (away from the wave) while applying pressure with your right hand to the middle of your right rail. Lift up the upper left corner of the board with your left hand and lean to your right. Look at the inside of the wave and visualize the spot where you want to stop your turn. When you reach that spot, lean left to get back in the curl of the wave and shift your weight back to the normal position."
    },
    {
      "title": "Try a 360.",
      "content": "Try a 360. After you've mastered the bottom turn and the cut back, try a full rotation. This can be done on the flat section of a wave, in the white foam, off the lip of the wave, or even in the air. The technique is the exactly the same wherever you attempt a 360. [14] X Research source Make a bottom turn to position yourself in the curl of the wave. Turn slightly to the left to face the wave. Slide forward on your board so that your face is roughly level with the nose of your board. Lift your legs, arch your back, and throw your head to the left. Keep looking in the direction you want to spin and your shoulder will follow. After your 360 is complete, perform a bottom turn to gain speed for the next maneuver and put your feet back in the water."
    }
  ]
}