{
  "url": "https://www.wikihow.com/Clean-a-Vicks-Humidifier",
  "title": "How to Clean a Vicks Humidifier",
  "steps": [
    {
      "title": "Place the humidifier on a flat surface.",
      "content": "Place the humidifier on a flat surface. Make sure the humidifier is turned off and unplug it. Set it on a clean, flat surface like a table or a countertop. Make sure you have enough space to clean the humidifier. [1] X Expert Source Victor Belavus Air Conditioning Specialist Expert Interview. 6 May 2020. Make sure the surface is flat and even to keep water from running off the sides."
    },
    {
      "title": "Remove the water tank and water tray.",
      "content": "Remove the water tank and water tray. Both pieces are attached to the base of the humidifier. Take off the water tank first, which will allow you to slide out the tray. Be careful not to damage the filter when you remove the tank and tray. [2] X Research source If your humidifier doesn’t have a tank, remove the top housing and lay it upside down on a flat surface. Make sure you don’t rest the housing on the water tube or you could damage it."
    },
    {
      "title": "Empty the tank and flush it with warm water.",
      "content": "Empty the tank and flush it with warm water. Unscrew the cap on the water tank and empty the water into a sink. Flush the container with clean, warm water. Shake the container to slosh the water around inside of it. [3] X Research source Use warm, but not hot water to flush the tank. Hot water could melt or warp the plastic. If your humidifier doesn’t have a water tank, empty the base of any remaining water and wipe it down with a clean rag or paper towel to dry it off."
    },
    {
      "title": "Wipe down the water tank with a dry cloth or paper towel.",
      "content": "Wipe down the water tank with a dry cloth or paper towel. Take a clean cloth or a few paper towels to the exterior of the water tank and any other areas that may have gotten water on it. If any other parts of the humidifier are dusty or dirty, use the damp cloth or paper towel to wipe them down. [4] X Research source"
    },
    {
      "title": "Empty the water tank and flush it with warm water.",
      "content": "Empty the water tank and flush it with warm water. Remove the water tank, unscrew the cap, and empty any water inside of it. Then add some warm water to the tank and shake it around to flush it. Set the tank off to the side until you’re finished cleaning the humidifier. [5] X Research source Place the tank upside-down to allow any additional water to run out of it."
    },
    {
      "title": "Turn on the humidifier to allow air to flow through the filter.",
      "content": "Turn on the humidifier to allow air to flow through the filter. With the tank still removed, turn on the humidifier. When the wicking filter is completely dry, turn off the humidifier and unplug it. It should take about 10-15 minutes for the filter to dry out. If your humidifier doesn’t have a removable tank, turn off the humidifier and unplug it. Then remove the top housing, and dump out any water left inside. Wipe it down dry with a cloth or a paper towel."
    },
    {
      "title": "Lift the filter from the water tray.",
      "content": "Lift the filter from the water tray. Gently pull the filter straight up to remove it without tearing it. The filter should be completely dry before you try to remove it. If it isn’t dry, wait another 5 minutes. [6] X Research source"
    },
    {
      "title": "Remove the water tray and pour 1 cup (240 mL) cup of vinegar into it.",
      "content": "Remove the water tray and pour 1 cup (240 mL) cup of vinegar into it. Slide out the water tray and set it aside. Pour the undiluted vinegar into the tray and allow it to sit for 30 minutes. The vinegar will loosen any scale deposits that may have built up over time. [7] X Expert Source Victor Belavus Air Conditioning Specialist Expert Interview. 6 May 2020. For humidifiers that don’t have a removable tray, use a sponge soaked in vinegar and wipe the inside of the base. Then rinse it out with warm water. Use distilled white vinegar."
    },
    {
      "title": "Scrub the water tray to remove any scale deposits.",
      "content": "Scrub the water tray to remove any scale deposits. After 30 minutes, take a sponge and scrub off any scale from the water tray. If the scale isn’t coming off, soak the tray in vinegar for another 30 minutes then scrub it again. [8] X Research source Use a sponge that has an abrasive side to scrub the tray."
    },
    {
      "title": "Rinse the tray and pickup tube with warm water.",
      "content": "Rinse the tray and pickup tube with warm water. Once you’ve scrubbed off the scale deposits, rinse off the water tray and the pickup tube that transfers the water from the tank. Use warm water that isn’t too hot. Dry off the tray, tank, and tube with a clean cloth or paper towels when you’re finished. [9] X Research source Make sure you rinse the inside and outside of the pickup tube."
    },
    {
      "title": "Fill the water tank with water and bleach.",
      "content": "Fill the water tank with water and bleach. Mix together 1 teaspoon (4.9 mL) of bleach and 1 gallon (3.8 L) of warm water. Allow the water tank to soak for 20 minutes. Stir the water occasionally by gently shaking the container every few minutes to make sure the bleach reaches every part of the tank. [10] X Research source If you don’t have a removable water tank, add the bleach and water mixture to the water reservoir in the base."
    },
    {
      "title": "Pour out the bleach water after 20 minutes.",
      "content": "Pour out the bleach water after 20 minutes. Remove the pickup tube and carefully pour out the bleach so it doesn’t get on any other parts of the humidifier. Pour the bleach into a sink or another safe disposal area. [11] X Research source If any of the bleach water splashes onto the humidifier, dry it off immediately with a cloth or paper towel."
    },
    {
      "title": "Rinse the water tank and the pickup tube until the bleach smell is gone.",
      "content": "Rinse the water tank and the pickup tube until the bleach smell is gone. It’s important that you flush away all of the bleach from the humidifier. Use warm water to rinse the water tank repeatedly until you no longer smell any bleach at all. Make sure you flush the pickup tube as well. [12] X Research source Flush out the water reservoir in the base if your model doesn’t have a removable tank."
    },
    {
      "title": "Dry off the entire humidifier.",
      "content": "Dry off the entire humidifier. Use a clean, dry cloth or paper towels to dry any surface that got wet. It’s important that the exterior of the humidifier is completely dry before you plug it in and use it. [13] X Research source Let the humidifier air-dry for about 3-4 hours to make sure it’s fully dry."
    }
  ]
}