{
  "url": "https://www.wikihow.com/Boot-into-Safe-Mode-on-Mac-OS-X-or-Windows",
  "title": "Boot Your Mac or PC in Safe Mode: Easy Step-by-Step Guide",
  "steps": [
    {
      "title": "FInd out what type of processor your Mac uses.",
      "content": "FInd out what type of processor your Mac uses. Most Macs built after 2021 have an Apple Silicon chip. If you have an older Mac, you will need to use the Intel-based steps to boot into Safe Mode . You can find out what type of Mac you have by clicking the Apple icon, followed by About this Mac . If your processor is labeled \"Chip,\" you have an Apple Silicon Mac. If the processor is labeled \"Processor,\" you have an Intel-based Mac. The following Mac models have an Apple Silicon chip: [1] X Research source MacBook Pro 2021 or later MacBook Pro 2020 13-inch M1 MacBook Air 2022 or later MacBook Air M1 2020 iMac 2021 or later Mac Mini 2020 or later Mac Studio 2022 or later Mac Pro 2023"
    },
    {
      "title": "Shut down your Mac.",
      "content": "Shut down your Mac. If you can boot into macOS, click the Apple icon and then click Shut Down . If your Mac is unresponsive, or you cannot boot into macOS, press and hold the Power button until your Mac shuts down."
    },
    {
      "title": "Press and hold the Power button.",
      "content": "Press and hold the Power button. Continue to hold the Power button until you see the \"Loading startup options\" screen appear. Then, you can release the Power button."
    },
    {
      "title": "Select the volume with your macOS installation.",
      "content": "Select the volume with your macOS installation. This will typically be called \"Macintosh HD.\""
    },
    {
      "title": "Press and hold ⇧ Shift and click Continue in Safe Mode.",
      "content": "Press and hold ⇧ Shift and click Continue in Safe Mode . This will restart your Mac. When your Mac reboots, it should boot into Safe Mode [2] X Research source"
    },
    {
      "title": "Login to your Mac.",
      "content": "Login to your Mac. After booting into Safe Mode, you can log in to your Mac as you normally would."
    },
    {
      "title": "Verify that you are in Safe Mode.",
      "content": "Verify that you are in Safe Mode. Use the following steps to verify that you are in Safe Mode: Click the Apple menu. Click System Information . Click Software in the side menu. Check that it says Safe next to \"Boot Mode.\""
    },
    {
      "title": "Reboot your computer normally to exit safe mode.",
      "content": "Reboot your computer normally to exit safe mode. Restarting your computer without holding any keys down will return you to the regular Mac desktop."
    },
    {
      "title": "FInd out what type of processor your Mac uses.",
      "content": "FInd out what type of processor your Mac uses. Most Macs built after 2021 have an Apple Silicon chip. If you have a newer Mac, see #Safe Mode on a Mac (Apple Silicon) . You can find out what type of Mac you have by clicking the Apple icon, followed by About this Mac . If your processor is labeled \"Chip,\" you have an Apple Silicon Mac. If the processor is labeled \"Processor,\" you have an Intel-based Mac."
    },
    {
      "title": "Restart your Mac.",
      "content": "Restart your Mac. You can only enter Safe mode from the boot sequence, so you'll need to either restart or power on your Mac. If your Mac is on and responding, click the Apple menu and select Restart . [3] X Research source If your Mac is not responding, press and hold the Power button to turn it off, then press the Power button again to turn it on."
    },
    {
      "title": "Immediately press and hold ⇧ Shift.",
      "content": "Immediately press and hold ⇧ Shift . Begin holding down Shift as soon as your Mac turns on. Continue to hold it down until you see the Login screen appear."
    },
    {
      "title": "Login to your Mac.",
      "content": "Login to your Mac. After booting into Safe Mode, you can log in to your Mac as you normally would. You may be asked to log in again."
    },
    {
      "title": "Verify that you are in Safe Mode.",
      "content": "Verify that you are in Safe Mode. Use the following steps to verify that you are in Safe Mode: Click the Apple menu. Click System Information . Click Software in the side menu. Check that it says Safe next to \"Boot Mode.\""
    },
    {
      "title": "Reboot your computer normally to exit safe mode.",
      "content": "Reboot your computer normally to exit safe mode. Restarting your computer without holding any keys down will return you to the regular Mac desktop. [4] X Research source"
    },
    {
      "title": "Boot into Windows Recovery Environment.",
      "content": "Boot into Windows Recovery Environment. If you cannot boot into Windows , press and hold the Power button on your PC to force it to shut down, then press the power button again to boot it up. When you see the Windows logo or your PC manufacturer's logo, press and hold the Power button to force-shutdown your PC again, and repeat three times to boot into Windows Recovery mode. If you are able to boot in Windows, use the following steps to boot into Windows Recovery Environment from the Settings menu: Click the Windows Start menu. Click the Gear/Settings icon. Click System (Windows 11) or Update & Security (Windows 10). Click Restart Now next to \"Advanced Startup.\" [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Boot into Safe Mode.",
      "content": "Boot into Safe Mode. You may be prompted to enter your Windows recovery key if you are unable to log in to Windows. You can get your Windows Recovery key at https://aka.ms/myrecoverykey . Use the following steps to boot into Safe Mode: Click See advanced repair options (if you are unable to login to Windows). Enter your Windows recovery key if prompted. Click Troubleshoot . Click Advanced Options . Click Startup Settings . Click Restart ."
    },
    {
      "title": "Press the function key to select the safe mode you want.",
      "content": "Press the function key to select the safe mode you want. Press the key that corresponds with the type of safe mode you want to use. Press F4 for regular Safe Mode. Press F5 for Safe Mode with Networking. This allows you to boot into Safe Mode with an internet connection so you can research issues while in Safe Mode. Press F6 for Safe Mode with Command Prompt . This boots into the Command Prompt so that you can do advanced troubleshooting using commands."
    },
    {
      "title": "Verify that you're in safe mode.",
      "content": "Verify that you're in safe mode. Once you've finished booting, you'll be taken to the login screen or the desktop. You'll see \"Safe Mode\" printed in the corner of the screen."
    },
    {
      "title": "Restart your computer as normal to exit safe mode.",
      "content": "Restart your computer as normal to exit safe mode. When you restart your computer, you'll be taken back to regular Windows."
    },
    {
      "title": "Restart your computer.",
      "content": "Restart your computer. If your computer is frozen, press the Restart button on the computer. If you don't have one, press and hold the Power button until the computer turns off, then press the Power button again to turn it on."
    },
    {
      "title": "Press and hold F8 as your computer boots up.",
      "content": "Press and hold F8 as your computer boots up. If you get a \"Stuck\" message when holding F8, restart and rapidly tap F8 instead of holding it. Keep pressing until you see the Advanced Boot Options menu. [6] X Research source"
    },
    {
      "title": "Select a safe mode and press ↵ Enter.",
      "content": "Select a safe mode and press ↵ Enter . There are three different types of safe modes to choose from: Safe Mode - This will open the standard safe mode on the Windows desktop. Safe Mode with Networking - This will open the regular safe mode with networking hardware enabled so that you can connect to the network and the internet. Safe Mode with Command Prompt - This opens the Command Prompt instead of the Windows desktop."
    },
    {
      "title": "Restart your computer to return to normal mode.",
      "content": "Restart your computer to return to normal mode. When you reboot your computer and allow it to load normally, Windows will start in regular mode."
    }
  ]
}