{
  "url": "https://www.wikihow.com/Address-a-Letter-to-a-Family",
  "title": "How to Properly Address a Letter to a Family",
  "steps": [
    {
      "title": "Start your letter with the salutation “Dear.”",
      "content": "Start your letter with the salutation “Dear.” This is the most common way to begin a letter to someone. Write “Dear” and then the person’s name or family’s names right after it. [1] X Research source Instead of “Dear,” you might choose to begin the letter with “Hello.”"
    },
    {
      "title": "Call the family members by their first names for a casual greeting.",
      "content": "Call the family members by their first names for a casual greeting. This is a good way to begin your letter if you know the family well. After “Dear,” write each person’s name starting with the parents and ending with the children’s names. [2] X Research source For a more personal touch, consider adding the family’s pet names onto the list at the end as well. Tack on the family’s last name after the last person’s first name, if desired. For example: “Dear Sally, David, and Lilly Stevens.”"
    },
    {
      "title": "Address the family as a collective group by writing their last name and “Family.”",
      "content": "Address the family as a collective group by writing their last name and “Family.” For example, “Dear Smith family,” or “To the Turner Family.” This eliminates the need to write each person’s name and is a great condensed salutation. [3] X Research source Whether you choose to capitalize the word “family” is up to you, but the family’s last name should always be capitalized."
    },
    {
      "title": "Add \"Mr\" and \"Mrs\" to make your writing more formal.",
      "content": "Add \"Mr\" and \"Mrs\" to make your writing more formal. These titles can be tacked on before first names or last names. For instance, your letter might start off with, “Dear Mr. and Mrs. Adams,” or “Dear Ms. Kate, Mr. Robert, and Miss Sierra.” This makes your letter a bit more official and proper. [4] X Research source If you’re not sure how a woman prefers to be addressed, use “Ms.” Another example might be, “Dear Ms. Stern and Mr. Lichtman.”"
    },
    {
      "title": "Write each person’s individual name if they don’t share the same last name.",
      "content": "Write each person’s individual name if they don’t share the same last name. This is used if you’re addressing a married couple that uses different last names, as well as an unmarried couple or children that live in the same house but share different last names. Either write their first and last names, or write each person’s last name with a title in front of it. [5] X Research source For example, you might write, “Dear Ross Green and Trudy Smith.” Another example would be, “Dear Mr. Thornhill and Mrs. Morgan.”"
    },
    {
      "title": "Use a distinguishing title if a person in the family has one.",
      "content": "Use a distinguishing title if a person in the family has one. If an adult in the family is a doctor, reverend, or other type of distinguished person, add their title before their name. For example, if you’re addressing a doctor, you would write, “Dear Dr. Parker” along with the rest of the family's names. [6] X Research source Add the titles for military personnel and judges as well. Another example would be, “Dear Lieutenant Allen and family,” or “Dear. Reverend Smith, Mrs. Smith, and family.”"
    },
    {
      "title": "Add a comma after the name and begin writing your letter.",
      "content": "Add a comma after the name and begin writing your letter. Once you’ve written the family’s name as you’d like it to appear in your letter, add a comma as punctuation for the salutation. Skip a line or two after writing the salutation, and begin writing the body of your letter. [7] X Research source Instead of a comma, you could also use a colon or em dash, though a comma is most common."
    },
    {
      "title": "Use neat handwriting to make sure the post office can read the address.",
      "content": "Use neat handwriting to make sure the post office can read the address. It’s best to print the names and address instead of writing them in cursive to ensure that they’re legible. Use neat handwriting and a pen so your letter gets to the right place."
    },
    {
      "title": "Write the return address in the top left corner of the envelope.",
      "content": "Write the return address in the top left corner of the envelope. This is the sender’s address, so if you’re writing the letter, you’ll put your address in the top left corner. Write your full name on the first line, your street address or PO box on the second line, and your city, state, and zip code on the third line. Start your writing in the uppermost corner to ensure you have enough space."
    },
    {
      "title": "Put the family name and address in the center of the envelope.",
      "content": "Put the family name and address in the center of the envelope. Since you don’t have a lot of space in the middle of the envelope, avoid listing each family member’s name and instead just write their collective family last name. Write the family name in the center of the envelope, their street address right below their name, and their city, state, and zip code on the third line. [8] X Expert Source Tami Claytor Etiquette Coach Expert Interview. 29 September 2020. If the family contains people with different last names, you might address the envelope as, “The Smiths and the Walkers.” Use the family’s PO box if they don’t have a street address. A sample envelope might read (first line) The Jones Family (second line) 1234 wikiHow Place (third line) Palo Alto, California 94301."
    },
    {
      "title": "Place a stamp in the top right corner so your letter is ready to be mailed.",
      "content": "Place a stamp in the top right corner so your letter is ready to be mailed. Use enough postage to ensure your letter gets to its destination. Place the stamp (or multiple stamps) in the upper right corner, pressing down on it to make sure it sticks. If you’re not sure how many stamps to use, go online to the post office’s website for more information."
    }
  ]
}