{
  "url": "https://www.wikihow.com/Build-a-Motor",
  "title": "How to Build a Motor",
  "steps": [
    {
      "title": "Gather all of your materials.",
      "content": "Gather all of your materials. This project will require copper wire (anything from 24 to 28 gauge will do), a magnet, electrical tape, a D battery, and two paper clips. Place them all on the table in front of you so you have easy access as you go about assembling the motor. [1] X Research source You will also need wire strippers or a blade if your wire is insulated. You can purchase all of these things at your local hardware store or at most large retail stores."
    },
    {
      "title": "Roll wire around a cylindrical object like a battery to make a coil.",
      "content": "Roll wire around a cylindrical object like a battery to make a coil. Take the D battery or any other cylindrical object and wrap your wire around it at least 7 to 10 times with 2 inches (5.1 cm) of wire sticking out from each end. This will create a coil that will ultimately make up the majority of the motor. [2] X Research source Keep the coil tight as you wrap the wire around the battery. Make sure to leave plenty of slack on either end of the coil as you wrap it."
    },
    {
      "title": "Loosen the coil (if necessary) and remove the battery.",
      "content": "Loosen the coil (if necessary) and remove the battery. Pull the battery (or whatever cylinder you used) out from the top or bottom of the loop you created with the wire and set it aside. You should be left with just a coil. [3] X Research source Be careful not to let the wire unravel as you handle the coil. If the battery or cylinder is stuck, loosen the coil wrapped around it a bit to slide it out."
    },
    {
      "title": "Wrap each end of the wire around the coil several times.",
      "content": "Wrap each end of the wire around the coil several times. Take one end of the wire and pull it through the coil so it wraps around the wire and helps to hold the shape of the coil. Then repeat the process with the other end of the wire on the opposite side of the loop of the coil. [4] X Research source You may want to wrap each end around the wire 2 or 3 times. Make sure to leave at least 2 inches (5.1 cm) of wire extending out of each end of the coil."
    },
    {
      "title": "Tie a knot around the coil with each loose end of wire.",
      "content": "Tie a knot around the coil with each loose end of wire. Press the end of the wire through the coil one more time, then run the wire through the loop that creates to secure it like a knot around the coil. Then repeat the process on the opposite side of the coil using the other end of the wire. [5] X Research source Once finished, the coil should look like a wire circle with the two ends extending out from opposing sides. These knots aren’t required for the function of the motor, but will help ensure the coil doesn’t unravel when you’re not holding it."
    },
    {
      "title": "Add electrical tape to opposite ends of the coil if it seems loose.",
      "content": "Add electrical tape to opposite ends of the coil if it seems loose. If the loop of the coil isn’t holding its shape well, take a small piece of tape and wrap it around the wire on the top or bottom, where the wire ends aren’t extending out from. Use the same size piece of tape on the other side of the coil to keep it balanced. You don’t need much electric tape. A piece only about .5 inches (1.3 cm) long will be fine. If the coil holds the shape of a circle without the tape, you can skip this step."
    },
    {
      "title": "Pull the wire ends out away from the coil.",
      "content": "Pull the wire ends out away from the coil. The extended ends of the wire should be pointed straight out from either side of the loop and extend for around 2 inches (5.1 cm). Work any small bends out of the wire that is extended so they are more or less completely straight. [6] X Research source Make sure that where the wires extend out from the loop on either side is even, so the coil will be even once the motor is assembled."
    },
    {
      "title": "Strip off the insulation on both ends, if present.",
      "content": "Strip off the insulation on both ends, if present. If the wire you are using has insulation on it, you will need to expose the wire beneath. Use a pair of wire strippers or a blade to slice through the insulation layer without damaging the wire, then pull the insulation away from the wire to expose it. [7] X Research source Make sure that at least 1 inch (2.5 cm) of wire is exposed on both sides. If the wire is not insulated, you can skip this step."
    },
    {
      "title": "Coat one side of each wire end with a permanent marker.",
      "content": "Coat one side of each wire end with a permanent marker. Hold the coil in one hand with your index finger and thumb so the loop is standing upright and the wires are extending out to either side. Then use a permanent marker to color in just the top of the exposed wire extending out from either side. [8] X Research source Only color in the top side of the exposed wire on either side. Leave the bottom side uncolored. This variation in the wire will help to engage the motor."
    },
    {
      "title": "Stretch out the ends of two metal paper clips.",
      "content": "Stretch out the ends of two metal paper clips. Take your paper clips and unfold the ends of them so they are straight. Leave the remaining loop of the paper clip intact. It will hold the extended ends of the wire on your coil once the motor is assembled. [9] X Research source The paper clips should now each look like a loop with a long arm extending from it. If you don’t have paper clips, you can create loops with stiff wire for the same purpose."
    },
    {
      "title": "Tape the extended ends of each paperclip to opposing sides of a D battery.",
      "content": "Tape the extended ends of each paperclip to opposing sides of a D battery. Lay the battery on its side. Place the extended end of one paper clip against the positive side of the D battery and secure it in place with a piece of tape. Then touch the extended end of the other paper clip to the negative side of the battery and tape it in place too. [10] X Research source Make sure both paperclips are pointed in the same direction. You can add some more tape to the bottom of the battery to keep it from rolling from side to side, but it’s optional."
    },
    {
      "title": "Slide the ends of the coil into the paperclips like a holder.",
      "content": "Slide the ends of the coil into the paperclips like a holder. Holding the battery to prevent it from rolling (unless you created a tape kickstand) insert the extended wire from one side of the coil into one of the paper clips, and then slide the other extended end through the other paper clip. [11] X Research source Let go of the coil so it is resting on the paper clips via the extended and exposed arms of the coil. If the paper clips are too far apart, bend them inward so they can hold the coil."
    },
    {
      "title": "Use tape to secure a magnet to the battery below the coil.",
      "content": "Use tape to secure a magnet to the battery below the coil. Place a piece of tape over your magnet, then pick it up and stick it onto the battery centered beneath the coil you just put on. The battery will provide a current that flows through the coil, which when coupled with the magnet, will force the coil to rotate. [12] X Research source The magnet is the final piece you need to complete the motor, so you may spot the coil quiver a bit as you put it in place. Secure the magnet with tape so you don’t have to hold it in place. There is no risk of injury or shock when doing this, but always exercise caution when working with electronics."
    },
    {
      "title": "Remove or adjust anything the prevents the coil from spinning.",
      "content": "Remove or adjust anything the prevents the coil from spinning. If the coil will run into the magnet as it spins, remove the tape holding the paper clips to either side of the battery and move them up until the coil can clear the battery. [13] X Research source The coil needs to be able to spin freely in order for the motor to work. If you used the battery to create your coil, it should be small enough to skip this step."
    },
    {
      "title": "Adjust the balance by moving the paperclips to make the motor spin freely.",
      "content": "Adjust the balance by moving the paperclips to make the motor spin freely. You may need to experiment a bit with the placement and positioning of the paper clips to hold the coil in place. Squeeze them in close if the ends of the wire keep popping out or bend them out further if the clips are coming into contact with the loop of the coil itself. [14] X Research source Make sure both paperclips are even with one another. If they’re crooked, it could impede the coil from spinning."
    },
    {
      "title": "Give the coil a little spin if it doesn’t start on its own.",
      "content": "Give the coil a little spin if it doesn’t start on its own. If the coil doesn’t begin to spin on its own, nudge it with your finger to get it started. If it doesn’t spin, press on the tape holding the paper clips to the battery to ensure they’re secure. The coil will likely begin to spin freely. If it does, the motor is complete. The coil will continue to spin until the battery is depleted or you stop it."
    },
    {
      "title": "Try the opposite direction if it still doesn’t spin.",
      "content": "Try the opposite direction if it still doesn’t spin. If the motor doesn’t start spinning when you nudge it in one direction, try nudging it in the opposite direction to see if that works. This motor should only spin one way, so you may just need to try both directions to find the right one. [15] X Research source Once it starts spinning, it won’t stop unless you stop it. If it doesn’t start spinning, check to make sure your connections are all strong and then try again."
    }
  ]
}