{
  "url": "https://www.wikihow.com/Become-Instagram-Famous",
  "title": "How to Become Instagram Famous",
  "steps": [
    {
      "title": "Figure out what you’re passionate about.",
      "content": "Figure out what you’re passionate about. Most Instagram influencers aren’t just making posts to get likes and follows, they’re doing it to share their stories and perspectives. Sit down and think about why you’d like to reach a larger audience and what you could bring to the table as an Instagram influencer. [1] X Research source You might be passionate about photography, in which case you could upload different shots and styles to teach others how you took your photos. Maybe you’re really into fashion and makeup, so you want to connect with other users to find new ideas and inspiration."
    },
    {
      "title": "Check out top Instagram accounts to see what works.",
      "content": "Check out top Instagram accounts to see what works. It’s always worth taking a look at larger accounts on Instagram to see what they’re doing right. Try searching for accounts that you know and love to see how often they post, what kind of posts they make, and which hashtags they use. [2] X Research source You can search by your favorite hashtags to find accounts with your specific interests in mind."
    },
    {
      "title": "Find your niche.",
      "content": "Find your niche. Think about what you can add to the Instagram platform that other people aren’t already doing. Maybe you run a food blog with a funny twist, like using leftovers to make new recipes. Or maybe you run a fashion blog that turns outdated clothing into fresh, new pieces. Whatever it is, try to find something that makes you stand out so you don’t get lost in the crowd. [3] X Research source Make sure you choose something that you’re really passionate about. The more you love what you’re doing, the less it will feel like work."
    },
    {
      "title": "Upload a personal profile picture, not a logo.",
      "content": "Upload a personal profile picture, not a logo. Even if you’re trying to start a brand on Instagram, logos tend to turn followers off. Instead, pick a profile pic that shows off your face and your personality at the same time. It feels more personal and it lets your followers know that you’re a real person, too. [4] X Research source Make sure your profile pic is clear and in focus with good lighting. It can be a selfie or a portrait as long as you look and feel your best! If you don’t have an Instagram account yet, you can set one up quickly by downloading the app from the App Store."
    },
    {
      "title": "Stick to a theme.",
      "content": "Stick to a theme. This is a similar concept to finding your niche and filling it. When people follow you, they’re probably expecting similar posts to what you’ve already got going on, so once you choose a topic, stick with it. [5] X Research source Your photos don’t all have to look the same, but they should feel cohesive. Are you a foodie? Then focus on food-related photos. Are you a fashion junkie? Focus on colors, styles, and trends. Do you like a certain game or book series? Take creative photos of it and post it on Instagram!"
    },
    {
      "title": "Post genuine, authentic content.",
      "content": "Post genuine, authentic content. When someone follows you, they want to connect with who you are and what you’re saying through your posts. Use your Instagram account to create a story that is creative, original, and honest. Add “cliffhangers” to your photos to keep fans coming back for more. [6] X Research source For example, you could document your travels to a new place, the countdown to a significant event, or your journey with a new pet. Telling your story looks different for every Instagram account, so you can personalize it to your needs. Getting personal with your followers will help them see you as a real person, not just an account."
    },
    {
      "title": "Take high quality photos.",
      "content": "Take high quality photos. Instagram is, at its core, a photo-sharing app, so your pictures are super important here. Make sure you’re using a quality camera (a newer model smartphone will do) and your pictures are clear and in focus. [7] X Research source If you’re taking photos of yourself, consider getting a tripod so you can set up your phone on a self-timer."
    },
    {
      "title": "Snap a bunch of pics, but only post the best ones.",
      "content": "Snap a bunch of pics, but only post the best ones. Quality over quantity, right? When you decide to take a photo of something, don’t hesitate to get a ton of pictures, but then delete the ones that don’t look good. Your followers deserve the best, so give them what they deserve! [8] X Research source It’s always better to take too many pictures than not enough. Don’t be afraid to get creative with it! Try out different angles and focuses to find new, interesting shots."
    },
    {
      "title": "Use a separate photo-editing app.",
      "content": "Use a separate photo-editing app. Instagram’s built-in editing tools are nice, but they are somewhat limited. There are additional apps that can add even more depth to your content. Install a well-reviewed photo editor from the app store and breathe new life into your feed. [9] X Research source Try VSCO Cam, Adobe Lightroom, Prisma, Aviary, or Snapseed for high-quality photo editing. These editing apps let your mess with the frame, focus, highlights, shadows, and many more. Play around with each one until you figure out what you like best."
    },
    {
      "title": "Use filters sparingly.",
      "content": "Use filters sparingly. Have you ever scrolled to a photo on your feed that had so many filters you could barely tell what it was? Those posts aren’t very engaging because they’re masking what’s actually in the photo. You can definitely put filters on your pics, but do it subtly, and never use more than one. [10] X Research source Having uniform colors and effects on most of your photos is a great way to develop an aesthetic. Some Instagram users choose never to use filters as a way to highlight the natural beauty of their photos."
    },
    {
      "title": "Add a clever caption.",
      "content": "Add a clever caption. Once you’ve got a top-notch photo, it’s time to engage your audience through writing. Take a few minutes to think about what you want to say, and write out a thoughtful, engaging caption that tells your story. It’s all about being genuine and authentic, so don’t be afraid to get a little personal. [11] X Research source You could tell the story behind the photo, why you took the picture, or what happened right before or after."
    },
    {
      "title": "Use the Instagram Stories feature to share moments.",
      "content": "Use the Instagram Stories feature to share moments. Inspired by Snapchat, Instagram now allows users to post photos and videos that disappear in 24 hours. Stories will not be stored in your Instagram feed, so use this feature to share all of the things that don’t quite fit with the rest of your account. Your stories will appear at the top of your followers’ feeds. [12] X Research source You can still share moments that fit in with your niche that your followers are interested in, but the photos don’t have to be high quality. Share saved Reels you make and add them to your Story."
    },
    {
      "title": "Use relevant hashtags.",
      "content": "Use relevant hashtags. Pay attention to what is trending and use hashtags on all of your photos. Many Instagram users search for hashtags to find new users to follow—using the right hashtags ensures that people who are looking for your sort of content are able to find you. [13] X Research source For example, someone who posts photos from hiking adventures in the Pacific Northwest may use tags like #hiking, #method, #exploregon, #camping, and #mtranier. Someone who shares their illustrations may use the hashtags #illustrators, #artistsofinstagram, #penandink, and #womanartists. You can also create your own hashtag using your name or your Instagram account handle, then ask your followers to use the hashtag in their posts, too. Make sure your hashtags are relevant, and remember you cannot use more than 30. If you use a lot of hashtags that don’t have anything to do with your picture, Instagram might flag your post as spam."
    },
    {
      "title": "Follow similar Instagram accounts.",
      "content": "Follow similar Instagram accounts. Find Instagram users whose photos you enjoy and add them to your Follow list. Try to comment and like photos every time you go onto Instagram so you’re engaging with the people you follow. It is very hard to become popular on Instagram without interacting with and trading likes with others, and it doesn’t take that much time. [14] X Research source Try not to comment something vague or irrelevant on someone else’s post. Think about what kind of comment you’d like to get, then write something similar."
    },
    {
      "title": "Link your Instagram account to Facebook.",
      "content": "Link your Instagram account to Facebook. You most likely have a set number of friends who would be willing to follow you. Follow your Facebook friends on Instagram to hopefully gain some new followers who know you IRL. [15] X Research source If you’re really close friends with someone, you can even ask them to shout you out on their Instagram story."
    },
    {
      "title": "Share photos from Instagram to your other social media accounts.",
      "content": "Share photos from Instagram to your other social media accounts. When posting a new photo, tap your preferred social media option under “Share” and enter your username and password. This will post your Instagram photo, giving your followers on other platforms the chance to follow you on Instagram. [16] X Research source This can also give your friends and family on Facebook a chance to see content from your Instagram."
    },
    {
      "title": "Post content that’s only available on your Instagram.",
      "content": "Post content that’s only available on your Instagram. While sharing some Instagram photos on Facebook or your blog can attract new followers, keep some content exclusive to Instagram. Remind your Facebook or blog followers that they should follow your Instagram for different photos. Let your Instagram account be where people can get to know another side of you. [17] X Research source If you’re posting all of your content elsewhere, people won’t have an incentive to follow your Instagram account."
    },
    {
      "title": "Encourage your followers to tag their friends.",
      "content": "Encourage your followers to tag their friends. If you post something funny, caption it with something like, “Tag three friends who would think this is funny!” When people tag their friends on your photos, their friends will view your photo and usually like it or start following you. [18] X Research source You can also try captions like, “Tag someone who would rock this outfit,” or “Tag someone who needs a laugh today.”"
    },
    {
      "title": "Consider geotagging your location when posting photos.",
      "content": "Consider geotagging your location when posting photos. Geotagging adds a location link to the top of your Instagram photos, allowing people to see where you were and view other photos taken at that location. This is an excellent way to attract new followers, but remember that geotags share your location with the entire world. Avoid geotagging when you are home or anywhere else that you don’t want to be found in person. [19] X Research source This is a great function to use in nature photos to let everyone know where you are and what you’re photographing."
    },
    {
      "title": "Foster engagement with your followers to grow your account.",
      "content": "Foster engagement with your followers to grow your account. Getting followers is great, but getting ones that will like and comment on your photos is even better. When people like and comment on your posts, Instagram automatically shows them to more people, thus growing your brand. [20] X Research source This is why you should never buy fake followers just to up your numbers. Fake followers won’t engage with your content, so they’re not very useful for growing your account."
    },
    {
      "title": "Update consistently.",
      "content": "Update consistently. The more often you post, the more followers you’ll gain. Your followers followed you because they want to see your content, so be consistent with posting, but don’t overdo it. [21] X Research source If it’s easier, you can try to make a posting schedule and stick to it. If you post more than 2-3 photos or videos per day, use Instagram Stories instead so you don’t clutter your followers’ feeds."
    },
    {
      "title": "Start conversations with your followers.",
      "content": "Start conversations with your followers. When posting photos, add a caption that contains a question for your followers. Make the question something thoughtful, or something funny. The more people that answer your question, the more popular your post will be. [22] X Research source If you’re posting your morning coffee, ask your followers what their usual coffee order is. If you’re posting a makeup look, ask your followers what they think of the new product you used. If you’re posting a nature photo, ask your followers where they’d like to travel next."
    },
    {
      "title": "Respond to the people who comment on your photos.",
      "content": "Respond to the people who comment on your photos. To respond to them directly, type the “@” symbol and type their Instagram name. This shows everyone that you’re down to earth and willing to interact with your fans. [23] X Research source It may also be helpful to like comments others have left for you too, especially when you can't think of a written response to give."
    },
    {
      "title": "Mention other Instagram users in your captions.",
      "content": "Mention other Instagram users in your captions. For example, if you take a photo at a restaurant, mention the restaurant’s Instagram name (e.g., @olivegarden) in the caption. If you see something that reminds you of another Instagram user, snap a photo and post it with a caption like, “I thought of you, @[user]!” If you’re lucky, that user might share your post on their story, giving you more engagement. [24] X Research source You can also tag brands in your posts so they see your picture."
    },
    {
      "title": "Organize a contest.",
      "content": "Organize a contest. If you have a creative idea and some fans, grow your community by giving away a prize in exchange for likes and follows. Choose a prize worth winning, share a photo of it on Instagram, and then encourage your followers to like the photo to enter. When the contest ends, choose a random follower to win the prize! [25] X Research source Encourage your followers to tag their friends so they can also enter your contest."
    },
    {
      "title": "Work with brands to grow your following.",
      "content": "Work with brands to grow your following. Working with brands is a great way to get more followers and engagement, and it can even help you make some money off your posts once you get a large following. Usually, the brand will share your post on their story or their feed, so you’ll reach a new, broader audience. [26] X Research source If you’re just starting out, you might have to approach brands for a partnership. As your account grows, you could start receiving offers from different companies and brands."
    },
    {
      "title": "Start by reaching out to smaller brands.",
      "content": "Start by reaching out to smaller brands. Companies who don’t have a ton of followers on Instagram might be grateful for your promotion no matter what, although they probably can’t afford to pay you much (or anything). However, when you’re just starting out, reaching out to these micro-brands can help you get more followers and gain traction. [27] X Research source If the company can’t compensate you with cash, you’ll often get a free product instead."
    },
    {
      "title": "Negotiate your payment with larger brands.",
      "content": "Negotiate your payment with larger brands. As you grow your following, you may be approached by larger, more established companies to promote their products. You can use your follower count, engagement activity, and posting regimen to ask for payment in return for your posts. Make sure you know how many posts you’ll be required to make and whether or not they’d like you to stop posting about their competitors. [28] X Research source Always get a contract in writing!"
    },
    {
      "title": "Keep your posts honest.",
      "content": "Keep your posts honest. Even if you’re making an ad for someone else, it’s important that your followers don’t lose trust in you. Only advertise for brands that you love and trust so you can recommend the best to your followers. If you don’t like something, chances are, your followers won’t either. [29] X Research source You’ll have to hashtag your post with #Ad so your followers know that you’re being paid to promote a product."
    }
  ]
}