{
  "url": "https://www.wikihow.com/Build-Garage-Shelving",
  "title": "How to Build Garage Shelving",
  "steps": [
    {
      "title": "Cut all of your boards and plywood using a circular saw.",
      "content": "Cut all of your boards and plywood using a circular saw . Look for long, straight boards without any deformities. Use a tape measure to find the length of each board. For this shelf, cut 2 in × 4 in (5.1 cm × 10.2 cm) boards into 8 pieces that are 2 ft (0.61 m) long and 8 pieces that are 20 in (51 cm) long. Then cut 2 8 ft × 4 ft (2.4 m × 1.2 m) plywood sheets in half to make 4 pieces that are 8 ft × 2 ft (2.44 m × 0.61 m). [1] X Research source Purchase 16 boards that are 8 ft (2.4 m) long so you only need to make cuts for the short sides of your shelves. Leave 10 of the boards uncut. This shelf is 8 feet (2.4 m) tall, 8 feet (2.4 m) long, and 2 feet (0.61 m) deep. The final measurements for your shelves will vary depending on the size of your garage."
    },
    {
      "title": "Make a frame for each shelf using 2 in × 4 in (5.1 cm × 10.2 cm) boards.",
      "content": "Make a frame for each shelf using 2 in × 4 in (5.1 cm × 10.2 cm) boards. Arrange 2 boards that are 8 ft (2.4 m) long and 2 boards that are 2 ft (0.61 m) long into a rectangle that measures 8 by 2 feet (2.44 m × 0.61 m). Set your 20 in (51 cm) boards parallel to the 2 ft (0.61 m) boards inside the frame about 30 inches (76 cm) in from each side. These boards will help support the weight on your shelf. [2] X Research source In total, you will have enough frames to make 4 shelves."
    },
    {
      "title": "Screw or nail the frame together.",
      "content": "Screw or nail the frame together. Drive 2 nails or screws that are 3 in (7.6 cm) long in each corner with either a hammer or an electric screwdriver. When you're finished with the corners, finish by attaching the support beams in the middle of the frame, using 2 nails or screws on each side. Repeat the process for the 3 remaining shelves. [3] X Research source"
    },
    {
      "title": "Nail the plywood on top of your shelves.",
      "content": "Nail the plywood on top of your shelves. Lay the plywood on top of your shelf frames so the smooth side faces up. Drive 2 in (5.1 cm) nails every 2 feet (0.61 m) along your frame, starting in the corners. Continue securing the plywood for each of your shelves. [4] X Research source Use a nail gun if you want to attach the plywood faster."
    },
    {
      "title": "Attach the bottom shelf to 2 in × 4 in (5.1 cm × 10.2 cm) uprights.",
      "content": "Attach the bottom shelf to 2 in × 4 in (5.1 cm × 10.2 cm) uprights. Clamp 4 boards that are 8 ft (2.4 m) long on the corners of the bottom shelf so they're flush. Start by attaching the bottom shelf at ground level using 2 nails or screws that are 3 in (7.6 cm) long in each corner. [5] X Research source Move the bottom shelf up by 1–2 inches (2.5–5.1 cm) if you don't want it resting directly on the ground."
    },
    {
      "title": "Place the rest of the shelves 2 feet (0.61 m) apart from one another.",
      "content": "Place the rest of the shelves 2 feet (0.61 m) apart from one another. Clamp a spare 2 ft (0.61 m) board between 2 of the uprights and set your next shelf on it. Use a level to make sure your shelf is sitting straight. Raise the other end of the shelf until it's level and clamp it to the other set of uprights. Secure the shelf with nails or screws, and continue adding shelves until the last one is flush with the top. [6] X Research source Have a partner help you lift and maneuver the shelves so you don't damage them or hurt yourself. boards and space your shelves so they're 2 1 ⁄ 2 feet (76 cm) apart.}}"
    },
    {
      "title": "Saw your boards and plywood to size.",
      "content": "Saw your boards and plywood to size. Use a circular saw to cut 1 ⁄ 2 in (1.3 cm) plywood into 2 shelves that are 16 in (41 cm) deep and 6 ft (72 in) long. Cut your 2 in × 4 in (5.1 cm × 10.2 cm) boards into 6 pieces each that are 12 inches (30 cm), 10 inches (25 cm), and 8 1 ⁄ 2 inches (22 cm). These pieces will form your brackets. [7] X Research source Some home improvement stores can cut your plywood to size for you. Ask an employee at the store if they are able to cut your wood."
    },
    {
      "title": "Mark and cut 45-degree angles on the ends of your 12 in (30 cm) pieces.",
      "content": "Mark and cut 45-degree angles on the ends of your 12 in (30 cm) pieces. Use a speed square and a pencil to mark your angles. Make both angles on the same side so your boards look like trapezoids when they're cut. Cut along the angles with your circular saw. [8] X Research source Speed squares help you mark angles quickly, and they can be purchased from your local hardware store."
    },
    {
      "title": "Make 6 triangular brackets from your 2 in × 4 in (5.1 cm × 10.2 cm) boards.",
      "content": "Make 6 triangular brackets from your 2 in × 4 in (5.1 cm × 10.2 cm) boards. Form an L-shape with your 10 in (25 cm) and 8 1 ⁄ 2 in (22 cm) pieces. Attach the boards at their joint with 2 screws that are 2 1 ⁄ 2 in (6.4 cm) long and an electric screwdriver. Set the piece with the angle cuts inside the L-shape so it forms a triangle. Screw the board in place using 2 screws on each end. [9] X Research source"
    },
    {
      "title": "Drive the brackets in your garage wall.",
      "content": "Drive the brackets in your garage wall. Use a stud finder and a pencil to mark the spots along your wall where you can attach your brackets. [10] X Expert Source Christopher Lanier Handyman Expert Interview. 25 August 2020. Plan to put the first set of brackets 16 in (41 cm) apart and the third bracket 32 in (81 cm) away from the second. Hold the side of the bracket with the 8 1 ⁄ 2 in (22 cm) board against your wall, and use 4 screws per bracket to attach them to the wall. Repeat the process for your second shelf. [11] X Research source Finding the studs is especially important if you plan to store anything heavy on your shelves. [12] X Expert Source Christopher Lanier Handyman Expert Interview. 25 August 2020. Adjust the height of your shelves depending on what you want to store on them. Usually, 16 inches (41 cm) between the shelves is enough."
    },
    {
      "title": "Attach the plywood on top of the brackets.",
      "content": "Attach the plywood on top of the brackets. Set your plywood pieces on your brackets and make sure they are flush with the wall. Use 4 screws that are 2 1 ⁄ 2 in (6.4 cm) long per bracket to attach your shelves. Once your shelves are secure, you can start loading your items on them. [13] X Research source"
    },
    {
      "title": "Cut your boards and sheet of plywood.",
      "content": "Cut your boards and sheet of plywood. Leave 2 of your 10 ft (3.0 m) boards uncut. Cut the remaining 3 boards into 7 pieces that are 27 in (69 cm) long and 2 pieces that are 30 in (76 cm) long. Use your saw to cut the plywood into 1 sheet that's 8 ft × 2 1 ⁄ 2 ft (2.44 m × 0.76 m) and 2 pieces that are 1 ft × 2 1 ⁄ 2 ft (0.30 m × 0.76 m). [14] X Research source The final shelf measures 10 feet (3.0 m) long and 2 1 ⁄ 2 feet (0.76 m) deep, and will hang 26 inches (66 cm) from the ceiling. Your shelves may vary in size depending on the size of your garage."
    },
    {
      "title": "Attach 2 boards that are 30 in (76 cm) long to a ceiling beam with a tie connector.",
      "content": "Attach 2 boards that are 30 in (76 cm) long to a ceiling beam with a tie connector. Climb a ladder and find a ceiling beam that extends 30 inches (76 cm) from the wall. Attach a tie connector with 3 in (7.6 cm) screws to the ceiling beam with an electric screwdriver. Place the other tie connector 116 inches (290 cm) apart from the first one and screw it in. Put a 30 in (76 cm) in each tie connector with screws. [15] X Research source Tie connectors can be purchased at your local hardware store."
    },
    {
      "title": "Build your shelf frame using 10 ft (3.0 m) and 27 in (69 cm) boards.",
      "content": "Build your shelf frame using 10 ft (3.0 m) and 27 in (69 cm) boards. Make a rectangle that's 10 ft × 2 1 ⁄ 2 ft (3.05 m × 0.76 m) with your boards. Arrange the rest of the short boards parallel to the side of the frame inside the rectangle at 2 ft (61 cm) intervals to create supports. Use 2 nails at each connection to secure the boards and finish your frame. [16] X Research source"
    },
    {
      "title": "Screw one side of the shelf to your garage wall.",
      "content": "Screw one side of the shelf to your garage wall. Hold the shelf frame so the bottom is level with the ends of the boards hanging from the ceiling. Use 3 1 ⁄ 4 in (8.3 cm) screws in the middle of the board every 18 inches (46 cm) to secure the shelf to wall. [17] X Research source Have a partner help you lift and support the board while you secure it to the wall."
    },
    {
      "title": "Attach the other side of the shelf to the boards hanging from the ceiling.",
      "content": "Attach the other side of the shelf to the boards hanging from the ceiling. Make sure the bottom of the ceiling supports are flush with the bottom of the shelf. Drive 2 nails through the supports with a hammer to secure them in place. [18] X Research source Use a nail gun if you want to drive the nails quickly."
    },
    {
      "title": "Secure the plywood on top of your shelf with nails.",
      "content": "Secure the plywood on top of your shelf with nails. Put the 1 ft × 2 1 ⁄ 2 ft (0.30 m × 0.76 m) sheets flush with either end of the shelf. Nail the sheets down in each corner. Then, set the 8 ft × 2 1 ⁄ 2 ft (2.44 m × 0.76 m) piece of plywood in between the smaller sheets and slide it so the edges are flush with the frame. Put in a nail every 18 inches (46 cm) along the front of the shelf. [19] X Research source You don't need to secure the plywood on the back of the frame."
    }
  ]
}