{
  "url": "https://www.wikihow.com/Add-Promotion-on-LinkedIn",
  "title": "How to Add a Promotion Within the Same Company on LinkedIn",
  "steps": [
    {
      "title": "Sign in to LinkedIn on your computer, phone, or tablet.",
      "content": "Sign in to LinkedIn on your computer, phone, or tablet. If your promotion landed you in a brand-new role, it's best to create a new position in the Experience section. LinkedIn will connect your new position to your previous role so it's clear that you've been promoted to a higher level at the same company. [1] X Research source If your new role isn't much different from your old role, you can edit your current position instead. Editing your position simply changes your job title change without modifying your dates of employment."
    },
    {
      "title": "Go to your LinkedIn profile.",
      "content": "Go to your LinkedIn profile . Here's how: If you're using a computer, click your profile photo at the top-right and select View Profile . In the mobile app, tap your profile photo at the top-left, then tap it again on the resulting menu."
    },
    {
      "title": "Scroll down and click the + in the Experience section.",
      "content": "Scroll down and click the + in the Experience section. A menu will expand."
    },
    {
      "title": "Click Add position.",
      "content": "Click Add position . This opens the \"Add experience\" window. [2] X Research source"
    },
    {
      "title": "Choose whether to notify your network of your new position.",
      "content": "Choose whether to notify your network of your new position. The \"Notify network\" switch will either be green or gray, depending on your privacy settings. To share your promotion with your LinkedIn network , toggle the switch to the On (green) position. If you'd rather add the promotion without making an announcement, toggle the switch to the Off (gray) position."
    },
    {
      "title": "Add the details of your new role.",
      "content": "Add the details of your new role. Type your new job title into the top field, and then fill out as many details of your new role as you'd like. [3] X Research source In the \"Profile headline\" section, you'll see your current profile headline, which appears below your name at the top of your profile. If this contains your old job role, replace it with your new one before you continue."
    },
    {
      "title": "Check the box next to \"End current position as of now.\"",
      "content": "Check the box next to \"End current position as of now.\" This tells LinkedIn to add a new end date to your previous role, making it clear that you are no longer holding your old position."
    },
    {
      "title": "Click Save when you're finished.",
      "content": "Click Save when you're finished. This saves the details of your promotion to your profile. If you chose to notify your network, people in your network will see a notification within two hours of this change. [4] X Research source"
    },
    {
      "title": "Sign in to LinkedIn on your computer, phone, or tablet.",
      "content": "Sign in to LinkedIn on your computer, phone, or tablet. If your job function hasn't changed much but you now have a new job title, you can edit your existing position to simply change and announce (if you'd like) your new job title. If you have a very different position within the organization, consider adding a new role instead. This lets you create a brand-new date of employment and"
    },
    {
      "title": "Go to your LinkedIn profile.",
      "content": "Go to your LinkedIn profile. If you're using a computer, click your profile photo at the top-right and select View Profile . In the mobile app, tap your profile photo at the top-left, then tap it again on the resulting menu."
    },
    {
      "title": "Scroll down and click the pencil icon in the \"Experience\" section.",
      "content": "Scroll down and click the pencil icon in the \"Experience\" section. You'll see it at the section's top-right corner. This opens the Experience section for editing."
    },
    {
      "title": "Click the pencil icon next to your current position.",
      "content": "Click the pencil icon next to your current position. Now you'll see your previous job title and description."
    },
    {
      "title": "Choose whether to notify your network of your new position.",
      "content": "Choose whether to notify your network of your new position. The \"Notify network\" switch will either be green or gray, depending on your privacy settings. To share your promotion with your LinkedIn network, toggle the switch to the On (green) position. If you'd rather add the promotion without making an announcement, toggle the switch to the Off (gray) position."
    },
    {
      "title": "Replace the current job title with your new role.",
      "content": "Replace the current job title with your new role. You can also adjust other details as desired. Leave your employment date intact—it lets people know how long you've been with the company in any role."
    },
    {
      "title": "Scroll down and update your profile headline.",
      "content": "Scroll down and update your profile headline. If you have a custom profile headline, you can change it to more accurately reflect your new position."
    },
    {
      "title": "Click Save when you're finished.",
      "content": "Click Save when you're finished. This saves the details of your promotion to your profile. [5] X Research source If you chose to notify your network, people in your network will see a notification within two hours of this change."
    },
    {
      "title": "Create a post about your promotion on LinkedIn.",
      "content": "Create a post about your promotion on LinkedIn. If you want to get the word out about your success, you can create a post on LinkedIn to formally announce your new position. This gives you an opportunity to reflect on your previous position and colleagues and express excitement about your new role. To create a new post on your computer, click Start a post at the top of your feed. On a phone or tablet, tap the Post icon at the bottom of the screen."
    },
    {
      "title": "Choose your audience.",
      "content": "Choose your audience. You can make your post public to anyone on or off of LinkedIn, visible to your connections only, or share with a particular LinkedIn group. [6] X Research source"
    },
    {
      "title": "Begin by announcing your departure from your previous role.",
      "content": "Begin by announcing your departure from your previous role. Spend time reflecting positively on your time in that position, and thank your previous manager and colleagues for helping you learn and grow. [7] X Research source You can point out one or two individuals in your message or keep your gratitude more general."
    },
    {
      "title": "Announce your new role.",
      "content": "Announce your new role. Include your new job position and when you're scheduled to begin. Express your excitement about the new role, what you're looking forward to, and even what you hope to accomplish. [8] X Research source Be humble—you don't want to evoke any eye rolls from your former or new teammates!"
    },
    {
      "title": "Share your post.",
      "content": "Share your post. If you'd like, you can first attach a photo to bring more attention to your announcement. A photo of you with your old team, your cleaned-out cubicle, or anything else that shows your personality. You can also include your new work contact information if appropriate. [9] X Research source"
    }
  ]
}