{
  "url": "https://www.wikihow.com/Call-eBay",
  "title": "How to Contact eBay by Phone for Order & Account Help",
  "steps": [
    {
      "title": "Call eBay’s customer service department at 1-866-540-3229.",
      "content": "Call eBay’s customer service department at 1-866-540-3229. eBay is available to take calls Monday through Friday between 5 a.m. and 10 p.m. PST, and on weekends between 6 a.m. and 6 p.m."
    },
    {
      "title": "Press # at the prompt, then press “1.",
      "content": "Press # at the prompt, then press “1. ”"
    },
    {
      "title": "Press # once more, then press “0.",
      "content": "Press # once more, then press “0. ” An eBay representative will answer your call within an average of 12 minutes. [1] X Research source Alternately, you can contact eBay at 1-866-643-1587, press “4” at the Main Menu, followed by “6” at the Account Menu. However, this method may take up to 18 minutes as opposed to 12 minutes."
    },
    {
      "title": "Go to eBay at https://www.ebay.com/ and click on “My eBay” in the upper right corner.",
      "content": "Go to eBay at https://www.ebay.com/ and click on “My eBay” in the upper right corner."
    },
    {
      "title": "Sign in to your eBay account using your email address and password.",
      "content": "Sign in to your eBay account using your email address and password."
    },
    {
      "title": "Click on “Customer Support” at the top left corner of your eBay session.",
      "content": "Click on “Customer Support” at the top left corner of your eBay session."
    },
    {
      "title": "Click on “Contact eBay.",
      "content": "Click on “Contact eBay. ” [2] X Research source"
    },
    {
      "title": "Point to the category that best describes your issue.",
      "content": "Point to the category that best describes your issue. You can either choose to discuss “Buying,” “Selling,” or “Account.”"
    },
    {
      "title": "Select the reason for your inquiry from the options provided within the chosen category.",
      "content": "Select the reason for your inquiry from the options provided within the chosen category. For example, if you are a seller and your item listing was removed from eBay, select “My item was removed” from the “Selling” category."
    },
    {
      "title": "Select a calling option from the problem description screen.",
      "content": "Select a calling option from the problem description screen. You will either have the option to call eBay, or have an eBay representative call you. If the problem description screen does not provide you with calling options, proceed to method #2 in this article to call eBay directly."
    },
    {
      "title": "Call eBay at the number provided to you on the screen and enter the one-time passcode displayed.",
      "content": "Call eBay at the number provided to you on the screen and enter the one-time passcode displayed. You will then be connected to a representative from eBay. If you select the “Call me” option, enter your phone number into the field provided and click “Call me.” An eBay representative will call you at the number you provided within the timeframe specified. [3] X Research source"
    }
  ]
}