{
  "url": "https://www.wikihow.com/Coffee-Dates",
  "title": "How to Have a Perfect Coffee Shop Date",
  "steps": [
    {
      "title": "Coffee shops are public and convenient.",
      "content": "Coffee shops are public and convenient. A public venue on a first date makes it easier to dodge shady shenanigans. Coffee shops are ultra-public, meaning your potential partner has to be on their best behavior. Plus, pretty much every city, town, and humble hamlet has at least one cafe, making them an easy destination. [1] X Research source"
    },
    {
      "title": "A coffee date is cheap and low-stakes.",
      "content": "A coffee date is cheap and low-stakes. You’re not gonna break the bank on a filet mignon at your local coffee shop (unless the cafe is weirdly ritzy). A few bucks on coffee or tea is a low price for budding romance, and it also means there’s not much lost if the spark doesn’t ignite. [2] X Research source"
    },
    {
      "title": "Coffee dates prioritize conversation.",
      "content": "Coffee dates prioritize conversation. There’s nowhere to hide on a coffee date, and that’s a good thing. You and your boo-to-be can get to know one another without distractions—putt putt and bowling can come later. [3] X Research source"
    },
    {
      "title": "The stimulants in coffee make you look and feel good.",
      "content": "The stimulants in coffee make you look and feel good. This isn’t romance, it’s science. The caffeine in your cuppa makes you more alert and energized so you can present your best self. And when you’re attentive, you’re attractive. [4] X Research source"
    },
    {
      "title": "You get to know the other person while sober.",
      "content": "You get to know the other person while sober. Alcohol isn’t the greatest wingman, contrary to popular belief. At a bar or restaurant where libations flow freely, you’re more likely to get a little messy. Plus, a relationship built on inebriation isn’t one we’re willing to bet on. [5] X Research source"
    },
    {
      "title": "You have an easy out.",
      "content": "You have an easy out. If your date can’t stop talking about the latest TV show you’ll never see, you’re not locked into the date for the next few hours. A well-executed, “Oh no, I’ve got a meeting in 10,” will get you up and on your way. To a better date, hopefully. [6] X Research source"
    },
    {
      "title": "Cafes can be busy and noisy.",
      "content": "Cafes can be busy and noisy. If you’re unfortunate enough to hit the coffee shop at rush hour (early morning and lunchtime), you might struggle to find a seat. Then if you do find a seat, chances are you’ll be shouting over a dozen other conversations and the grating clinks of mugs on tables. [7] X Research source If you do go the coffee date route, beat the crowds by showing up at mid-morning or in the afternoon."
    },
    {
      "title": "They can feel a bit too much like an interview.",
      "content": "They can feel a bit too much like an interview. You know what else involves you and another person sitting across from each other and volleying question after question? A business meeting. There’s nothing less romantic than a job interview. [8] X Research source To avoid the business-casual rendezvous, sit diagonally apart at a table rather than face-to-face."
    },
    {
      "title": "A coffee date isn’t the most romantic option.",
      "content": "A coffee date isn’t the most romantic option. Sure, it’s sweet and cozy—and we’re big believers in the coffee date, don’t get us wrong—but some people just don’t see the magic. They’d rather be in a swan boat on a lazy river or frolicking through a tulip field. We won’t deny that there are more dazzling possibilities. [9] X Research source"
    },
    {
      "title": "You’ll get coffee breath.",
      "content": "You’ll get coffee breath. This is just an inevitability. The coffee giveth, and the coffee taketh away. In this case, it’s taking your minty-fresh, billboard smile, and giving that stale, earthy mouth-odor. If you’re counting on kissing on the first date, pack some gum or a disposable toothbrush . [10] X Research source Avoid coffee breath by washing it down with water. Or just opt for tea."
    },
    {
      "title": "Coffee isn’t for everyone.",
      "content": "Coffee isn’t for everyone. Yes, these people are real and they’re out there. We have to respect their decision to lead java-free lives, tragic as it is. If you got the coffee date route, make sure the venue also serves tea, soft drinks, or some other beverage of choice, when that choice is not a beautiful dark roast. [11] X Research source"
    },
    {
      "title": "Clarify that it’s a romantic date.",
      "content": "Clarify that it’s a romantic date. Just because 2 people are sitting down for coffee doesn’t necessarily mean it’s romantic. It could also be platonic, for business, or just because there’s no more room at other tables and so now you gotta share yours with a stranger. Before the date, make sure the other person knows you’re looking for love, not just hoping to pass the time. [12] X Research source Message them something like, “Just to be clear, this is a date, right?” You might also say, “For the record, you’re single, right? How would you feel about changing that?”"
    },
    {
      "title": "Pick a cafe close by, and scout it out beforehand.",
      "content": "Pick a cafe close by, and scout it out beforehand. Ideally, the spot will be somewhere between your homes, so neither has to commute much further than the other. Also, visit the cafe the day before if you haven’t already been. Otherwise your idyllic meet-cute may be thwarted by a decidedly dingy hole-in-the-wall."
    },
    {
      "title": "Keep your outfit casual but presentable.",
      "content": "Keep your outfit casual but presentable. Of course, follow your own bliss when dressing for your first date . But a fancy dress or a full suit probably isn’t the vibe here. Jeans and a nice sweater are the go-to, and any other outfits should be about at that level of effort. Something that says, “I look nice, but you’ll have to give me a reason to look nicer next time.” [13] X Research source"
    },
    {
      "title": "Plan to meet for about an hour.",
      "content": "Plan to meet for about an hour. Of course, if you really hit it off, you might be there for hours. But as a rule, set aside about 1 hour to get in and get out. [14] X Research source That gives you enough time to get a read on the person’s vibe and decide if they’re someone you want to go further with. And if the vibe isn’t great? Well, it’s only an hour."
    },
    {
      "title": "Arrive on-time.",
      "content": "Arrive on-time. Better yet, arrive 10-15 minutes early. Nobody likes to be kept waiting for a date. Not to mention that you’ll have to get in line, order, then wait for that order before the conversation can really get rolling. While you wait for your date to arrive, take a moment to settle in and get comfortable. If you’re relaxed, your date will be relaxed."
    },
    {
      "title": "Claim a table where you can sit diagonally from each other.",
      "content": "Claim a table where you can sit diagonally from each other. Sitting at the bar might put you a little too close for comfort, and faces your bodies away from each other. But sitting across from each other can be a bit too formal, and some people don’t like being forced into that much eye contact. Choose a table with some daylight, if possible (to flatter both your looks), and sit catty-corner from each other for comfortable conversation. [15] X Research source"
    },
    {
      "title": "Be courteous to the baristas.",
      "content": "Be courteous to the baristas. How someone treats service workers says a lot about their character. If your order comes out wrong, be polite and patient. Then, watch how your date interacts with the baristas, too. If your date gives the worker attitude, give your date a wave goodbye. Remember to give a generous tip—20% of the bill, at minimum. Reader Poll: We asked 250 wikiHow readers to tell us which personality trait they find most attractive, and 50% of them said kindness . [Take Poll] When it comes to attraction, being genuinely nice can go a long way: so be sure to show your date how kind you are!"
    },
    {
      "title": "Offer to pay for the drinks.",
      "content": "Offer to pay for the drinks. Make a move to foot the bill, regardless of your gender. This is modern dating in a modern world, and pulling out your wallet or purse signals that you’re as generous as you are stunning. That said, don’t insist too hard if your date turns down your dollar. It’s the thought that counts, after all. [16] X Research source To really impress your date , arrive early and ask them via message what they drink, then have it ready on the table when they arrive."
    },
    {
      "title": "Turn off your phone.",
      "content": "Turn off your phone. And we’ll say it again: turn off your phone! You’re here to find your one and only, not check Twitter. If you absolutely must, leave it in your pocket on vibrate, and excuse yourself to the restroom to check on it."
    },
    {
      "title": "Ask plenty of questions.",
      "content": "Ask plenty of questions. There’s not much worse than a date who can only talk about themselves. Make sure you’re pitching your share of questions, and listen intently to your date’s answer. Some thoughtful, non-formulaic, engaging questions are: [17] X Research source What’s something you’re proud of? What’s brought you joy today? What are you passionate about?"
    },
    {
      "title": "Roll out compliments with a warm smile.",
      "content": "Roll out compliments with a warm smile. Flirting on the first date is key to securing that second date, but it’s also important not to come on too strong. Drop a few flattering comments on their hair or outfit. Then, later in the date, compliment their conversation skills, and let them know how much you’re enjoying yourself. [18] X Research source Remember to make eye contact, which tells them you’re both confident and engaged with the conversation."
    },
    {
      "title": "Move the date elsewhere if the vibes are good.",
      "content": "Move the date elsewhere if the vibes are good. Maybe the best part about a coffee date is that it doesn’t have to be the end of the line. If you’ve got a connection, you may well find yourself glued to your seat for hours. Let another customer take that seat, and suggest to your date that you go on a walk. [19] X Research source Afterward, hit up a nearby museum, browse an antique shop, or just sit in a park. If it comes to this, you know to ask for a second date ."
    }
  ]
}