{
  "url": "https://www.wikihow.com/Be-a-Cool-Teenager",
  "title": "How to Be a Cool Teenager",
  "steps": [
    {
      "title": "Create a list of your personal strengths to remind yourself you’re awesome.",
      "content": "Create a list of your personal strengths to remind yourself you’re awesome. Find a comfy and quiet spot, grab a notebook and pen, and write a list of all the great things you’ve already accomplished in your life. You might write down awards you’ve gotten, friendships you’ve made, or grades you got that made you feel smart. Use the list as a reminder that you’ve already done a lot of amazing things in your life and that YOU are already an awesome person. [1] X Research source If you have a hard time making your list all at once, make the commitment to add one item to the list every day (maybe every morning when you wake up or every evening before you go to bed). Continue to update the list after it’s created. Every time you think of something new, add it to the list! These accomplishments could be improving your grades in a specific subject, completing all your homework on time, babysitting your siblings, auditioning for the school play even if you don’t get the part, getting a gig for your band, or eating something healthy for lunch."
    },
    {
      "title": "Make note of the obstacles you’ve already overcome.",
      "content": "Make note of the obstacles you’ve already overcome. These obstacles could be as simple as getting a passing grade on a math test when you thought you might fail it. These obstacles could also be as complex as surviving your parents’ divorce or managing your mental health issues. It’s important to remember what you’ve already managed to do in life and celebrate those overcome obstacles. [2] X Research source You’ve probably overcome a lot of little things that you rarely think about. All of those things are part of who you are today and should be celebrated. Keep your list updated as you encounter new obstacles in your life."
    },
    {
      "title": "Practice selflessness to benefit other people.",
      "content": "Practice selflessness to benefit other people. This can include things as simple as washing the dishes without being asked, keeping your room tidy, or offering to make dinner one night. When you do nice things for others, it will make you feel better, too. [3] X Research source You can also formalize this generosity by volunteering for a nonprofit or charitable organization."
    },
    {
      "title": "Treat yourself with kindness and engage in self-care activities.",
      "content": "Treat yourself with kindness and engage in self-care activities. Self-care or self-compassion is giving priority to yourself instead of others, but it isn’t being selfish. When you’re overworked or too tired, you might need to give yourself a break by doing something relaxing and enjoyable, whatever that means to you. [4] X Research source Being a teenager isn’t easy. You can’t be expected to run at full speed indefinitely without experiencing burnout. Admitting you need a break to recharge helps you to understand your limitations. You could try sitting quietly to read your favourite book, taking your dog for a walk, riding your bike, playing your favourite video games, sleeping in on the weekend, or going to watch sports with your dad."
    },
    {
      "title": "Act confident even if you don’t feel 100% confident.",
      "content": "Act confident even if you don’t feel 100% confident. Self-confidence includes both feelings and actions. Sometimes you may not feel 100% confident, but that doesn’t mean you can’t act 100% confident. The more you practice acting confident, the more confident you start to feel on a regular basis. [5] X Research source People are not born with a specific attitude, it’s developed over time. Like any other kind of attitude, self-confidence can be taught and improved over time."
    },
    {
      "title": "Take pride in your appearance to demonstrate your self-confidence.",
      "content": "Take pride in your appearance to demonstrate your self-confidence. Taking care of yourself and thinking about your personal hygiene and appearance will help you gain confidence. This includes the day-to-day stuff like having a shower, brushing your hair, wearing clean clothes, and putting on deodorant. [6] X Research source Caring about your appearance doesn’t mean you’re thinking about what other people will think of the way you look, it means caring about and respecting yourself."
    },
    {
      "title": "Wear clothes that make you feel good.",
      "content": "Wear clothes that make you feel good. You don’t need a brand new pair of shoes or the trendiest jeans to be cool; all you need to wear is something that makes you feel like yourself. Have fun experimenting with new styles until you find outfits that you like. [7] X Research source If you’re looking to change up your wardrobe for cheap, check out your local thrift stores."
    },
    {
      "title": "Avoid falling into the trap of peer pressure.",
      "content": "Avoid falling into the trap of peer pressure. It can be easy to do something your friends or classmates are doing just because it seems cool; however, going along with the crowd even when you know it’s wrong isn’t very cool at all. If you want to stay true to yourself, keep your own values in mind and stay away from situations that make you feel uncomfortable. [8] X Research source Peer pressure doesn’t have to be anything big—it can be as simple as your friends pressuring you to hang out when you know you need to study. Stick to your values and have the confidence to say no, even when it’s tough. Standing up to peer pressure can be hard, and you might not be able to do it every time. That’s okay! If you do succumb to peer pressure, just treat it as a lesson learned for next time."
    },
    {
      "title": "Create regular challenges for yourself that are realistic.",
      "content": "Create regular challenges for yourself that are realistic. Nothing will make you feel more confident than successfully completing something challenging. The challenge doesn’t have to be huge, but it should be realistic for you and your current situation. For example, you could challenge yourself to increase your mark by one grade level in science, or you could challenge yourself to learn to play a specific piece of music. [9] X Research source It is also important to remember that the journey you take to tackle your challenge is just as important as the outcome. If you aren’t successful with your challenge, focus on the things you did accomplish and/or learn in the process. You could try increasing your grades in a specific subject, finishing a homework assignment early, reaching the next level in your favourite video game, trying out for a sports team, auditioning for a play, or applying for a part-time job."
    },
    {
      "title": "Participate in a sport or exercise regularly to boost your confidence.",
      "content": "Participate in a sport or exercise regularly to boost your confidence. Exercise, in general, produces chemicals in your body that make you feel good. The sport doesn’t have to be through school or even a team sport. For example, you could take swimming lessons or martial arts classes. Select a sport or exercise that you’re excited about and that you find interesting. [10] X Research source Becoming involved in sports outside of school also allows you to meet more people with whom you could become friends."
    },
    {
      "title": "Make friends by doing activities that you love.",
      "content": "Make friends by doing activities that you love. If you want to find friends who have the same interests as you, look for clubs or groups in your school that you’re interested in. When you go to these club meetings, you can meet like-minded people who have at least one similar interest as you. As you get to know them, you can decide if you’d like to become friends or not. [11] X Research source If your school doesn’t have any clubs that you’re interested in, consider starting one yourself by talking to your principal or counselor."
    },
    {
      "title": "Be yourself to let your true personality shine.",
      "content": "Be yourself to let your true personality shine. Making friends with people can be tough, and it might seem easier to change your personality to fit in. However, this can get tiring after a long time, and you probably won’t make any meaningful friendships this way. When you start getting to know someone, stay true to your interests and your hobbies so they get to know the real you. [12] X Research source When you’re true to yourself, you can encourage other people to be true to themselves, too. You might find out that you have similar interests!"
    },
    {
      "title": "Hang out with people because you like them, not because they’re “cool.”",
      "content": "Hang out with people because you like them, not because they’re “cool.” If you’re choosing your friends based on their social status alone, chances are you aren’t friends for the right reasons. Try to stick with friendships that are made based on your mutual interests or hobbies instead of looking for people who are popular. You’ll make more lasting friendships this way, and you’ll probably have more fun! [13] X Research source On the other hand, you shouldn’t look down on people who are “popular” in your school. If they’re popular for the right reasons (being kind, personable, or charming) they’re probably a fun friend to have!"
    },
    {
      "title": "Perceive yourself and the things you like in a positive light.",
      "content": "Perceive yourself and the things you like in a positive light. Being popular or cool isn’t about what others think of you, it’s about how you perceive yourself. If you are comfortable with who you are, what you look like, who you hang out with, and what activities you like to do, you will be happy. [14] X Research source You don’t have to be accepted by everyone around you—you only need to feel accepted by the people you care about."
    },
    {
      "title": "Treat others like you would want to be treated.",
      "content": "Treat others like you would want to be treated. If you don’t want to be yelled at, sworn at, bullied, or pushed around, chances are no one else wants to be treated like that either. Treat everyone you meet with respect. This means to always be polite, listen to what other people are saying (don’t interrupt), don’t make excuses when you make a mistake, and don’t hold a grudge. [15] X Research source Treating others with respect also means to think before you speak. Don’t assume that the sarcastic comment in your head will not be offensive when said out loud."
    },
    {
      "title": "Make posts that are true to your personality.",
      "content": "Make posts that are true to your personality. If you do have a social media presence, don’t feel pressured to post about things you aren’t interested in. Instead, use your social media to document your fun activities, hobbies, and friendships so you can look back on them later. [16] X Research source Think about your social media as an extension of yourself. If you aren’t on social media, that’s fine too! There are no rules saying that you need a Twitter or Instagram page to be cool."
    },
    {
      "title": "Avoid making posts that could paint you in a negative light.",
      "content": "Avoid making posts that could paint you in a negative light. The phrase “the internet is forever” is still true, and even when you delete something, it never really goes away. Before you make a post, try to think about how it will affect your future. If you think you could be seen in a bad light, don’t post it. [17] X Research source Photos of underage drinking, derogatory language, or provocative photos may not be the best content for your social media. Before you post something, ask yourself if it’s something your parents would post online. If your parents wouldn’t post it, don’t post it."
    },
    {
      "title": "Use the internet for positive reasons only.",
      "content": "Use the internet for positive reasons only. The internet can be amazing, depressing, helpful, annoying, useful, and upsetting. Limit yourself to using the internet for positive reasons only and avoid using the internet for activities that will only end up hurting you or other people. [18] X Research source The internet can be used for positive reasons such as: research for school, comparing colleges you’re interested in, connecting with friends, looking up interesting craft project ideas, finding instructions on how to use something, and participating in an online community that helps you work through something. The internet can also be used for very negative reasons, such as: comparing yourself to other people, bullying or intimidating other people, getting revenge on someone, reducing your ability to communicate offline, and connecting with people who want to hurt or harm you."
    },
    {
      "title": "Log off if you’re getting overwhelmed.",
      "content": "Log off if you’re getting overwhelmed. Social media can be a lot to handle sometimes, especially when you and your friends use it 24/7. If you feel yourself getting bummed out or obsessed with your online presence, take a little break and do something else. You can take a hike, do some exercise, or hang out with your friends IRL instead of scrolling through your social media pages. [19] X Research source Most smartphones have a feature to track your screen time total throughout the day. If you find yourself using your phone for more than you’d like, try setting a goal to log off once a day and go outside or read a book."
    }
  ]
}