{
  "url": "https://www.wikihow.com/Clear-Voicemail-on-iPhone",
  "title": "How to Clear All Voicemails on an iPhone Permanently",
  "steps": [
    {
      "title": "Open the Phone app.",
      "content": "Open the Phone app. If your cellular provider supports visual voicemail, you can use the Phone app's Voicemail feature to listen to, manage, and delete your voicemail. [1] X Research source If you don't have visual voicemail, you can still delete voicemail by dialing your voicemail number ."
    },
    {
      "title": "Tap Voicemail.",
      "content": "Tap Voicemail . You'll see this on the reel icon at the bottom-right corner of the screen. If your cellular provider supports visual voicemail, you'll see all of the voicemail messages saved to your inbox. [2] X Research source"
    },
    {
      "title": "Tap Edit.",
      "content": "Tap Edit . It's at the top-right corner."
    },
    {
      "title": "Tap the circle next to each message you want to delete.",
      "content": "Tap the circle next to each message you want to delete. This can take a while if you've amassed a huge number of voicemails and haven't yet deleted any. As you tap each circle, a checkmark will appear inside it. If you've already cleared out your voicemails but want to empty your deleted messages, skip to step 6."
    },
    {
      "title": "Tap Delete.",
      "content": "Tap Delete . You'll see this option at the bottom-right corner. This moves the selected messages into the Deleted Messages folder. [3] X Research source Depending on your carrier, your Deleted Messages folder may be cleared automatically. [4] X Research source On other carriers, including T-Mobile, all of your voicemail messages (including those in the Deleted Messages folder) won't disappear until you delete them. [5] X Research source You can restore deleted voicemails from the Deleted Messages folder as long as you don't permanently delete them."
    },
    {
      "title": "Clear your Deleted Messages.",
      "content": "Clear your Deleted Messages. Clearing out your Deleted folder is a lot easier than deleting individual messages: Scroll to the bottom of your Voicemail folder. Tap Deleted Messages . Tap Clear All at the top-right. Tap Clear All to confirm."
    },
    {
      "title": "Dial your carrier's voicemail code.",
      "content": "Dial your carrier's voicemail code. The number you'll need to dial to connect to check your voicemail will be different depending on your provider. Here's how to access your voicemail with some of the most popular worldwide wireless providers: If you want to clear your voicemail from a different phone , just call your phone number from another phone, and press your provider's \"escape\" key once you hear your greeting . This key is usually the star * or the pound # symbol, but some providers are different. AT&T Wireless: Press and hold 1 on the dialpad. [6] X Research source Bell Mobility: Press and hold 1 on the dialpad. [7] X Research source Cellular One: Press and hold 1 on the dialpad. Choice Wireless: Press and hold 1 on the dialpad. Claro: Call *99 . Cricket Wireless: Press and hold 1 on the dialpad. Dish Wireless: Press and hold 1 on the dialpad. EE: Press and hold 1 on the dialpad or call 222 . Fido: Press and hold 1 on the dialpad. MetroPCS: Press and hold 1 on the dialpad. NTT Docomo: Call 1411 . O2: Call 901 . [8] X Research source Orange: Press and hold 1 on the dialpad or call 123 . Rogers: Call *98 . SFR: Press and hold 1 or call 123 . Telus: Press and hold 1 on the dialpad. Tesco: Call 905 . Three: Call 123 . Telekom Mobilbox (Deutsche Telekom): Call 3311 . T-Mobile: Press and hold 1 on the dialpad or call 123 . [9] X Research source US Cellular: Call *86 . Verizon: Press and hold 1 on the dialpad or call *86 . [10] X Research source Virgin: Press and hold 1 on the dialpad. Vodafone: Call 121 . Xfinity Mobile: Press and hold 1 on the dialpad or call *86 ."
    },
    {
      "title": "Enter your passcode (if prompted).",
      "content": "Enter your passcode (if prompted). Depending on how you set up your voicemail, you might need to enter a passcode."
    },
    {
      "title": "Listen to your messages.",
      "content": "Listen to your messages. Your voicemail provider will tell you how many messages you have before playing the first message. At the end of the first message, you'll hear instructions for deleting that message."
    },
    {
      "title": "Follow the prompts to delete each message.",
      "content": "Follow the prompts to delete each message. The key you'll need to enter varies by provider. Once you press the key to delete a voicemail message, it will be permanently deleted. [11] X Research source For example, if you're using AT&T, Verizon Wireless, or T-Mobile, you'll press 7 to delete each message. Continue deleting each message until you've deleted all messages. After your inbox is clear, you'll usually be able to listen to any messages you've saved. If you want to completely clear out your voicemail, listen to each saved message and press the deletion key until you have no more messages to delete."
    }
  ]
}