{
  "url": "https://www.wikihow.com/Cite-a-Wikipedia-Article-in-MLA-Format",
  "title": "How to Cite a Wikipedia Article in MLA Format",
  "steps": [
    {
      "title": "Understand the format for online articles with multiple authors.",
      "content": "Understand the format for online articles with multiple authors. Since Wikipedia articles often have hundreds of contributors, you don't need to lead with an author name. You'll need the following information: Name of the article Name of the publication (in this case, Wikipedia) Name of the publication's company Date on which the article was last edited in DD Month YYYY format (e.g., \"10 Jul. 2017\") Publication format (in this case, Web) Date on which the article was retrieved in DD Month YYYY format The article's web address (do not include the \"https://\" part of the address)"
    },
    {
      "title": "Find the article which you want to cite.",
      "content": "Find the article which you want to cite. Go to https://www.wikipedia.org/ in your computer's web browser, type a topic into the text box near the bottom of the page, click the \"Search\" icon, and click the title of the article you want to cite. The article will open."
    },
    {
      "title": "Determine the article's full name.",
      "content": "Determine the article's full name. At the top of the article, you should see a large, bold heading referring to the article's topic. This is what you'll need to use for the article's name in your citation."
    },
    {
      "title": "Find the article's last edit date.",
      "content": "Find the article's last edit date. Scroll all the way to the bottom of the Wikipedia article's page, then look for the date next to the \"This page was last edited on\" heading near the bottom-left side of the page. This is the date that you'll need to include in your citation's \"Publication Date\" section. When writing your date as a citation, you'll need to abbreviate the current month's name to three letters and a period (excluding May)."
    },
    {
      "title": "Note the current date.",
      "content": "Note the current date. This is the date you'll provide for the \"Retrieval Date\" section of the citation."
    },
    {
      "title": "Obtain the article's specific URL.",
      "content": "Obtain the article's specific URL. While the article itself has a general address, you'll need to cite the specific version of the article that you used in case the article gets updated later. You can get the specific URL by doing the following: Click View history at the top of the article. Below the Compare selected revisions button, click the most recent date. Click the website's address in the bar at the top of your browser to highlight it. Press Ctrl + C (Windows) or ⌘ Command + C (Mac) to copy the URL."
    },
    {
      "title": "Create the citation.",
      "content": "Create the citation. The citation will be written in the following format, punctuation included; bold text refers to information you'll need to provide: \"Article Title.\" Wikipedia: The Free Encyclopedia. Wikipedia, The Free Encyclopedia, Publish Date. Web. Retrieval Date, web address . For example, to cite Wikipedia's article regarding plagiarism retrieved on the 16th of May 2018, you would enter the following citation: [1] X Research source \"Plagiarism.\" Wikipedia: The Free Encyclopedia. Wikipedia, The Free Encyclopedia, 15 May 2018. Web. 16 May 2018, en.wikipedia.org/w/index.php?title=Plagiarism&oldid=841301291 Make sure you delete the \"https://\" section from the address before including it in your citation."
    },
    {
      "title": "Reference your citation in your paper.",
      "content": "Reference your citation in your paper. Unlike normal MLA-style in-text citations which include the author's last name and the page number (e.g., \"Hemingway 23\"), you won't have a specific page number or author to cite. Instead, you can use your article's title in quotations as an in-text citation at the end of a line. [2] X Research source For example, a line referring to the Wikipedia article on Plagiarism might say \"While plagiarism isn't a crime in and of itself, it does constitute a major ethical violation in most academic fields (\"Plagiarism\").\""
    },
    {
      "title": "Open Wikipedia.",
      "content": "Open Wikipedia. Go to https://www.wikipedia.org in your computer's web browser."
    },
    {
      "title": "Find your article.",
      "content": "Find your article. Type the topic for which you want to cite an article into the text box at the bottom of the page and press ↵ Enter , then select the article you want to cite."
    },
    {
      "title": "Find the \"Tools\" section.",
      "content": "Find the \"Tools\" section. You'll find this heading on the far-left side of the article's page, well-below the Wikipedia logo."
    },
    {
      "title": "Click Cite this page.",
      "content": "Click Cite this page . It's near the bottom of the \"Tools\" section. Doing so brings you to a list of different citation types for the selected article."
    },
    {
      "title": "Scroll down to the \"MLA Style Manual\" section.",
      "content": "Scroll down to the \"MLA Style Manual\" section. This section is near the top of the page. You should see a citation in the following format below the \"MLA Style Manual\" heading: Wikipedia contributors. \"Article Title.\" Wikipedia, The Free Encyclopedia . Wikipedia, The Free Encyclopedia, date last edited. Web. Date retrieved. For example, the citation for \"Plagiarism\" would be as follows: Wikipedia contributors. \"Plagiarism.\" Wikipedia, The Free Encyclopedia . Wikipedia, The Free Encyclopedia, 15 May 2018. Web. 16 May 2018."
    },
    {
      "title": "Copy the citation.",
      "content": "Copy the citation. Click and drag your mouse cursor across the citation, then press either Ctrl + C (Windows) or ⌘ Command + C (Mac) to copy it. You can then paste it into your Works Cited page by pressing Ctrl + V (Windows) or ⌘ Command + V (Mac). The citation begins with \"Wikipedia contributors\" listed as the \"author\". You can keep this section or delete it before adding the citation to your Works Cited page—both options are okay per MLA's rules. You'll notice that the citation here doesn't include the Wikipedia article's address. While including a URL is helpful, MLA style doesn't require the URL, so Wikipedia's official citations don't either."
    }
  ]
}