{
  "url": "https://www.wikihow.com/Build-a-Garage-Work-Bench",
  "title": "How to Build a Garage Work Bench",
  "steps": [
    {
      "title": "Determine the dimensions of the Workbench.",
      "content": "Determine the dimensions of the Workbench. Measure the desired length, width, and height relative to your work space and write these dimensions down."
    },
    {
      "title": "Find a bench top.",
      "content": "Find a bench top. [1] X Research source You can use thick, wooden, butcher-block-style Workbench tops (which are quite pricey), thin, hard, wooden sheets for industrial bench tops (which are more affordable), or a few pieces of plywood stacked on top of each other. For a thick, sturdy, affordable alternative, salvage a solid-core door; check your local listings, find a rebuilding center, or even ask around at a building undergoing renovation. The most important thing to keep in mind is that the Workbench should be flat and sturdy . Cut the bench top to size if necessary."
    },
    {
      "title": "Cut four legs from 4x4s.",
      "content": "Cut four legs from 4x4s. The length of each leg should be the desired height of the bench minus the thickness of the bench top."
    },
    {
      "title": "Cut four leg braces from 2x4s.",
      "content": "Cut four leg braces from 2x4s. If you want the top of the Workbench to be flush with the frame underneath it (which you will be building in Steps 8 and 9), each brace should be equal to the width of the bench top minus the width of two 2x4s; however, if you'd like the frame to jut slightly out from underneath the bench top, which can be useful for storing clamps, for example, cut the braces to same length as the width of the bench top. Since 2x4s aren't actually 2 x 4 inches and can sometimes even vary in thickness, measure the (skinny) width of your 2x4s for a precise cut."
    },
    {
      "title": "Position each top leg brace on a pair of legs.",
      "content": "Position each top leg brace on a pair of legs. Lay down two of the 4x4s perfectly parallel to one other so that the distance from the outside left edge to the outside right edge equals the length of the brace. Lay one leg brace across them so that it is flush with both the sides and (what will eventually be) the tops of the legs. Repeat on the other leg pair."
    },
    {
      "title": "Bolt each top leg brace to a pair of legs.",
      "content": "Bolt each top leg brace to a pair of legs. Using a 3/8-inch (10-mm) drill bit, drill two holes clear through both the 2x4 and the 4x4. [2] X Research source Make sure to drill the holes at a diagonal from each other (i.e. one at the top left, one at the bottom right) so that you will later be able to fit a third bolt into the space between. Moving from the 2x4 to the 4x4, slide bolts through the pre-drilled holes. Close them by sliding washers over the ends and holding them in place with nuts, which you can tighten with a wrench. When you're done, the bolt ends should stick out of the 4x4s. Repeat on the remaining leg pair."
    },
    {
      "title": "Bolt the bottom two leg braces to the legs.",
      "content": "Bolt the bottom two leg braces to the legs. Flip one of the leg pairs over and repeat the process you followed in Steps 7 and 8 with another brace; however, instead of lining the brace up with (what will eventually be) the bottoms of the legs, raise them a few inches so that they won't sit flush with the floor. When you're done, you will have a top brace at the top of one side of each leg pair and a bottom brace near the bottom of the other side of each leg pair. If you would like to build a low shelf across the bottom braces, position them accordingly provided that they do not rise above 1/3 of the height of the legs ; the lower the braces, the more stable the bench will be."
    },
    {
      "title": "Cut two top supports from 2x4s.",
      "content": "Cut two top supports from 2x4s. Each support should equal the length of the bench top."
    },
    {
      "title": "Bolt the top supports into place.",
      "content": "Bolt the top supports into place. Lay the leg pairs down with the top braces facing outwards (i.e. away from one another) so that the distance from the outside left edge to the outside right edge equals the length of the top support. Place one of the top supports across the leg pairs so that it lines up with the top braces. Pre-drill a hole through the top support and into the 4x4 on either side (making sure to drill between the existing bolts) and then bolt the support into place with coach bolts. Flip the structure over and repeat on the other side. When you're done, your four legs should be surrounded by a frame at the top."
    },
    {
      "title": "Attach the Workbench top.",
      "content": "Attach the Workbench top. Lay the piece(s) in place and pre-drill bolt holes downward through the underlying supports where necessary. Screw coach bolts into place to secure. If you have a thick bench top, consider bolting from the bottom up; this will keep the bench top smooth and bolt-free. However, only do this if the bench top is thick enough that it won't risk popping off of the bolt ends."
    },
    {
      "title": "Attach a low shelf if desired.",
      "content": "Attach a low shelf if desired. Simply measure the dimensions between all four legs, cut a shelf to this size from your desired material (ex. plywood), and screw into place."
    },
    {
      "title": "Finish the bench if desired.",
      "content": "Finish the bench if desired. Sand the wood smooth and apply stain, varnish, polyurethane, etc. [3] X Research source"
    },
    {
      "title": "Attach a long 2x4 (38×89 mm) horizontally to the wall studs.",
      "content": "Attach a long 2x4 (38×89 mm) horizontally to the wall studs. (If your wall is solid brick, stone, etc., this method will not help you). The length of the 2x4 will be the length of the workbench and should be sized accordingly. (In this example, we are using a 16-foot / 4.8-meter piece.) Use a spirit level to make sure that this is attached horizontally. Depending on the steel shelf brackets you have (and how far the hole is from the bend in the bracket), you may need a 2x6 (38×140 mm) instead. The top of the 2x4 strip in this example is 3 to 3.5 feet (approximately 1 meter) off the ground. If you need park a vehicle in your garage and it needs to fit underneath the shelf, account for any additional clearance required (i.e. your vehicle's hood). Use 2.5-in / 6.5 cm screws (or 3-in / 7.5-cm screws if going through drywall) to attach the 4-in (89-mm) flat face against the garage wall studs."
    },
    {
      "title": "Attach another piece of timber of the same dimensions below the first one.",
      "content": "Attach another piece of timber of the same dimensions below the first one. The gap between the two parallel strips should be determined by the length of the steel shelf bracket."
    },
    {
      "title": "Attach the shelf brackets to the two strips.",
      "content": "Attach the shelf brackets to the two strips. The heavier duty the shelf bracket, the better. The top of the bracket is flush with the top surface of the upper strip. Use a plywood piece on top (a temporary shelf) and then butt the shelf bracket against it. Use 1.5-in (3.8-cm) screws to then attach the brackets. You will end up with two strips against the wall with a row of shelf brackets attached to them. The shelf brackets should be spaced approximately 2 feet (.6 meters) apart. If desired, shelf brackets can be alternated; heavy duty, lighter duty, heavy duty, etc. in order to accommodate toolbox placement and to be able to comfortably pull up a chair underneath the workbench."
    },
    {
      "title": "Cut 3/4-in (2-cm) thick plywood into 2-ft (.6-m) wide planks",
      "content": "Cut 3/4-in (2-cm) thick plywood into 2-ft (.6-m) wide planks . A 4x8 ft (1.2 x 2.4 m) sheet will work well for this purpose. Place one of the planks on the shelf brackets and screw the plank to the upper strip at the top/rear. Place the second plank next to (left or right of) the first one and join the two end-to-end with a 6 in (15.25cm) x 18 in (45.7 cm) piece of plywood underneath the two plank ends."
    },
    {
      "title": "Place another strip across the top of the shelf and screw into the wall studs.",
      "content": "Place another strip across the top of the shelf and screw into the wall studs."
    },
    {
      "title": "Apply a front strip along the bottom edge of the shelf.",
      "content": "Apply a front strip along the bottom edge of the shelf. Glue and screw a 1.5 in (3.8 cm) by 3/4 in (1.9 cm) maple strip that's as long as your shelf. This strengthens the Workbench top while absorbing wear and tear."
    },
    {
      "title": "Attach drawers to the underside of the shelf.",
      "content": "Attach drawers to the underside of the shelf. These thin drawers will accommodate any small tools you may have. The drawers should be 2 feet (.6 meter) wide, have a depth of 1.5 in (3.8 cm), and stretch 18 in (45.7 cm) to the back. To make and attach the shelves: 1x4 ((19×89 mm) pine strips can be attached to the bottom of the shelf. The short part of the strip can be attached with glue and screws to the plywood sheet. Attach metal drawer slides to the strips. Construct drawers with a hardboard base and pine sides (1x2in or 2.5 by 5 cm). Edges hold the matching drawer slides. These drawer boxes are then slid into the pine strips that are attached to your plywood plank."
    }
  ]
}