{
  "url": "https://www.wikihow.com/Be-the-Prettiest-Girl-in-School",
  "title": "How to Be the Prettiest Girl in School",
  "steps": [
    {
      "title": "Eat healthy.",
      "content": "Eat healthy. This is an important step in making your body and mind better. It can also clear up your skin and give you more energy. Adding fruits and vegetables to your existing diet, swapping out regular pasta for whole-grain options, and changing red or fatty meats for leaner options are great ways to eat healthier. You should limit the amount of salt you include in your diet. Look for low-sodium versions of the foods most likely to have high amounts of salt like sauces, dressings, and prepared soups. For example, if a recipe calls for a few vegetables, you can add a greater variety or increase the amount the recipe calls for this will widen your variety of food and keep you healthy. If a recipe calls for spaghetti, try a whole wheat pasta instead. If a recipe calls for ground beef, use ground turkey or chicken instead. Avoid processed foods as much as possible."
    },
    {
      "title": "Get in shape.",
      "content": "Get in shape. Take the time to work on getting more fit . The endorphins you get from working out can make you feel happier and more confident about your body. You don't need to be super skinny or have a particular body shape to be pretty. Being healthy by exercising can make you pretty no matter what your body looks like. There are so many ways you can get fit. Many people go running every day. Some people do workout videos. Some people go to the gym. Others use fitness games, hand weights, run up and down the stairs, hike, or just dance around the house. [1] X Research source You should really talk to your doctor before you start any kind of new and vigorous workout routine. Your doctor can best assess what your body can handle."
    },
    {
      "title": "Take care of your skin.",
      "content": "Take care of your skin. Following a good skin care routine can also help you look prettier. At a minimum you should use a cleanser and moisturizer every day and a facial scrub a few times a week. [2] X Research source Using a sheer moisturizer with SPF can give you a natural looking dewy glow. [3] X Research source Use a loofah in the shower to get rid of dead skin and keep your skin looking bright and fresh. Reader Poll: We asked 158 wikiHow readers and 93% of them agreed that it’s important to take time for yourself . [Take Poll] Making time to take care of your body (and mind) is part of that!"
    },
    {
      "title": "Take care of your nails.",
      "content": "Take care of your nails. Eating a healthier diet can indirectly help the health of your nails, but there's also plenty you can do to benefit your nails directly. Having nice-looking nails can help make you look more attractive. Clean your nails every day with soap and water, and trim them every one to two weeks, depending on how long you like them to be. You should also shape your nails so that all look uniform and neat. If you notice that having longer nails leads to breakage and peeling in your nails, keep them a bit shorter. Having healthy nails is much more important than having long nails. Try to save any crazy nail art for the weekend and keep your nails neat with only one color or a clear polish on them during the week. [4] X Research source"
    },
    {
      "title": "Wear clothes that flatter your body.",
      "content": "Wear clothes that flatter your body. Your clothes should fit well, look neat, and be a little on the classier side. Dressing to flatter your body shape is a simple way to look prettier. [5] X Expert Source Sheila A. Anderson Certified Image Consultant & International Branding Icon Expert Interview. 9 August 2021. [6] X Expert Source Elle Monus Image Consultant Expert Interview. 7 September 2021. If you have a circle shape (sometimes called an apple shape) avoid clothing that draws attention to your midsection, like high-rise pants or belts. Slim cut pants, shift dresses, and tunic tops are good choices if you have a circle shape. If you have a triangle shape – wider at the hips than at the shoulders or torso – avoid oversize clothing, skinny jeans, and any flimsy, body-hugging fabrics. Wide leg pants, tailored jackets, and boat neck tops will flatter your body. If you have an hourglass shape, with a larger chest, narrow waist and full hips, avoid styles without a lot of shape, like boxy dresses, tunics, or oversize cardigans. You should favor high-waisted pants, wrap dresses, and v-neck tops. If you have a rectangle-shaped body (sometimes called a boy shape), avoid tight dresses which emphasize your shape and any tops that aren’t structured. Boots cut pants and a fitted jacket will favor your body type."
    },
    {
      "title": "Always look put together.",
      "content": "Always look put together. Being pretty is often about looking put together – like you spent some time thinking about your look before you left the house. How you do this depends a lot on your personal style, but doing things like making sure your hair is brushed and styled, or that you’re wearing a few cute accessories, or that you’ve really worked on dressing to flatter your body type can all help. [7] X Expert Source Sheila A. Anderson Certified Image Consultant & International Branding Icon Expert Interview. 9 August 2021."
    },
    {
      "title": "Do your hair.",
      "content": "Do your hair. It’s easy to run some product through your hair or just throw it up in a ponytail before you run out of the door in the morning. But paying attention to your hair is an easy way to look prettier. Experiment with your hair to find easy, go-to styles for your length and texture. [8] X Expert Source Sheila A. Anderson Certified Image Consultant & International Branding Icon Expert Interview. 9 August 2021. If you get in a pinch during the day and you find your hair is starting to frizz, you can add a small amount of your moisturizer to your hair. [9] X Research source"
    },
    {
      "title": "Spend some time on your makeup.",
      "content": "Spend some time on your makeup. Everyone has different preferences for how they like their makeup to look. But applying just some basic foundation, mascara, and concealer can make you look prettier. Use your fingers to apply your foundation for a sheerer look or a brush for more coverage. Brush some loose finishing powder to your T-zone - down your nose and across your forehead - to prevent oil from coming through your foundation. [10] X Research source You can prepare your eyelids for any type of look by using a matte eyeshadow that matches the lightest part of your skin - usually your neck. Brush this shadow on your lid, in your crease, and up to your brow bone. You can also use an actual eye makeup base for this as well. [11] X Research source"
    },
    {
      "title": "Have good posture.",
      "content": "Have good posture. Confidence is really attractive, and one of the easiest ways to exude confidence is by improving your posture. When you're standing, put your shoulders back, and look straight ahead (not at the floor). If you're sitting, try to resist the temptation of hunching over your desk or table. Instead, pretend like there's a string that goes through the top of your head and down your spine, and that that string is always pulled tight. You’ll be surprised how much better you feel and look if you improve your posture. [12] X Expert Source Sheila A. Anderson Certified Image Consultant & International Branding Icon Expert Interview. 9 August 2021."
    },
    {
      "title": "Don’t be cruel.",
      "content": "Don’t be cruel. Lots of popular culture suggests that the prettiest girls are also the cruelest. You don’t have to be mean to be pretty; in fact, it makes you less attractive. Be kind to people instead: ask them how they are and offer help if you see them struggling. [13] X Research source"
    },
    {
      "title": "Be confident.",
      "content": "Be confident. People who are confident always seem more attractive to others. A great way be confident is by preparing yourself for situations you might be in. This means showing up to class having done your homework, do some extra research on the company you're interviewing with, or even just looking up which movies are playing before you make plans with your friends. [14] X Research source"
    },
    {
      "title": "Smile more.",
      "content": "Smile more. People who smile generally look prettier than people who frown all the time. Smiling more can help you look prettier, and it also makes you seem more approachable. [15] X Research source"
    },
    {
      "title": "Be yourself.",
      "content": "Be yourself. Have you ever noticed how people who seem to know who they are and have no problem being themselves seem more attractive? Sticking to your own style, whether it’s with make-up, your clothes, or your accessories, can help you look prettier. One of the easiest ways to be yourself is by following your intuition, sometimes called following your \"gut.\" If something just doesn't feel right to you - whether it's a certain type of clothing, a makeup look, or an activity that your friends or significant other wants you to do - don't do it. [16] X Research source"
    }
  ]
}