{
  "url": "https://www.wikihow.com/Clean-Rubber-on-Shoes",
  "title": "How to Clean Rubber on Shoes",
  "steps": [
    {
      "title": "Remove any caked-on dirt.",
      "content": "Remove any caked-on dirt. If your shoes are particularly dirty, you may want to start by taking them outside and slapping them together to knock loose any large bits of dirt or mud. If you leave too much mud on the shoe, it will take a lot longer to get them clean. Make sure to slap the shoes together outdoors so you don’t make a mess inside your house. You may even want to use a butter knife or key to scrape set mud out of grooves in the shoe."
    },
    {
      "title": "Use a dry brush to remove loose dirt.",
      "content": "Use a dry brush to remove loose dirt. Before you begin scrubbing away at the rubber parts of your shoes, start by brushing or even scraping off any loose dirt that’s stuck to it. The more you remove with a dry brush, the less mess you’ll have to deal with once you create your cleaning solution. [1] X Research source Don’t worry about scrubbing too much, if the dirt doesn’t come free quickly, it will once you begin using the cleaning solution. Use a dry brush like a toothbrush, but avoid steel bristle brushes that may damage the rubber soles of your shoes."
    },
    {
      "title": "Mix one part baking soda and one part laundry detergent.",
      "content": "Mix one part baking soda and one part laundry detergent . Depending on how much you need to clean, you likely won’t need much baking soda or laundry detergent. Begin by mixing a tablespoon of each in a small bowl thoroughly. You can always add more of each ingredient if you find you haven’t made enough. The baking soda will act as an abrasive to help the soap remove dirt and grime. Avoid using laundry detergents with bleaching agents. If your shoes aren't super-dirty, you can also just use a warm water with a few drops of dish soap . [2] X Expert Source Penny Simmons Shoe Care Specialist Expert Interview. 19 November 2020."
    },
    {
      "title": "Scrub the rubber with your cleaning solution.",
      "content": "Scrub the rubber with your cleaning solution. Use your brush to apply the combination of baking soda and laundry detergent to the rubber portion of your shoes, then scrub it in. Using a circular motion with the brush is often the most effective way to remove dirt and grime. [3] X Research source You may want to avoid using this cleaning combination on the fabric of your shoes, as the baking soda may be difficult to thoroughly rinse off. You can make a separate mixture of just detergent and water to clean cloth portions of your shoes."
    },
    {
      "title": "Use a different sponge or cloth to thoroughly rinse the rubber.",
      "content": "Use a different sponge or cloth to thoroughly rinse the rubber. Once you’ve adequately scrubbed the cleaning combination into the rubber soles of your shoes, take another clean cloth or sponge and soak it in clean water. Run it along the rubber, rinsing it with each pass until all of the mixture has been rinsed away.. [4] X Research source Failing to remove all of the cleaning mixture can leave the rubber looking discolored. Leaving the detergent mixture on the shoe can also make them very slippery and dangerous."
    },
    {
      "title": "Dry the shoe completely.",
      "content": "Dry the shoe completely. Once you have rinsed all of the soap off of the shoe, use a clean towel to dry the rubber before you wear the shoes again. Once you have the shoe dry, you’ll have a better sense of how well the cleaning mixture did, and you can repeat the process at this point if you need to. [5] X Research source Leaving the shoes wet could lead to them beginning to smell . Wet shoes can be dangerous to wear, so be sure they’re completely dry and free of soap before putting them on."
    },
    {
      "title": "Fill a pan with less than an inch of water.",
      "content": "Fill a pan with less than an inch of water. Find a pan that is large enough to fit your shoes in it, then fill it with enough water to submerge only the rubber soles. Make sure that the water is lukewarm and clean of any dirt or debris. [6] X Research source Remember when filling it that as you put the shoes in the pan, the water level will rise. If need be, you can soak one shoe at a time."
    },
    {
      "title": "Add dish soap to the water.",
      "content": "Add dish soap to the water. Once the water level is about right, add one squirt of a mild dish detergent to the water and mix it thoroughly. The dish detergent is integral to the soak working, as water alone likely won’t break up stuck on grime. [7] X Research source If you are soaking white rubber on white shoes, you may even choose to use a very small amount of bleach rather than dish soap."
    },
    {
      "title": "Soak the rubber for a few minutes.",
      "content": "Soak the rubber for a few minutes. Leave the rubber portion of your shoe submerged in water and allow it to soak for a few minutes. This should allow it time to break up any stuck on dirt and grime and make it easier to scrub what’s left off of the rubber. Check to ensure that only the rubber is soaking in the water. You may choose to allow the shoes to soak even longer than 15 minutes if they’re really dirty."
    },
    {
      "title": "Use a scrub brush to remove any remaining dirt.",
      "content": "Use a scrub brush to remove any remaining dirt. After the rubber has soaked for a while, remove the shoes and use the soapy water to scrub away any remaining bits of dirt and grime that are still stick to the shoe’s rubber. Avoid using a steel bristle brush as it may cause damage to the shoe. [8] X Research source If need be, you can soak the shoes again after this step. If you are using a bleach solution, you may want to wear gloves to avoid any potential skin irritations."
    },
    {
      "title": "Remove any dirt or mud from the rubber first.",
      "content": "Remove any dirt or mud from the rubber first. Nail polish remover can do an excellent job of removing discoloration and even grime from the rubber parts of your shoes, but it’s not a good choice if your shoes are caked with mud or are any color other than white. You may want to wash the rubber parts of your shoes using one of the other methods before using nail polish remover on scuffs. Do not use the nail polish remover on the cloth portions of the shoe."
    },
    {
      "title": "Soak a cotton ball in nail polish remover.",
      "content": "Soak a cotton ball in nail polish remover. While you can use a number of things to apply nail polish remover to the rubber soles of your shoes, cotton balls tend to be the best size and shape to easily clean the sides of your rubber soles and other small bits of rubber. [9] X Research source You may want to wear gloves when dealing with nail polish remover. You will likely need more than one cotton ball if the shoes are dirty."
    },
    {
      "title": "Scrub away any scuff marks.",
      "content": "Scrub away any scuff marks. Using the nail polish remover soaked cotton balls, start by scrubbing away any scuff marks on the rubber soles. In doing so, you may find that the entire area you scrub shows as a brighter shade of white than the rest of the sole you’ve yet to clean. [10] X Research source Scrub away all of the significant scuff marks before moving on to cleaning the whole sole. You may need to use more than one cotton ball on some really set scuff marks."
    },
    {
      "title": "Clean the rest of the sole with the nail polish remover.",
      "content": "Clean the rest of the sole with the nail polish remover. Once the significant scuffs and stains have been removed from the shoe’s sole, run the nail polish remover soaked cotton balls along the entirety of the sole, scrubbing when necessary to clean the entire area completely. If you do not clean the entire sole, parts will still appear discolored compared to the brighter whites you achieved in the areas you already scrubbed."
    }
  ]
}