{
  "url": "https://www.wikihow.com/Cancel-Medi%E2%80%90Cal",
  "title": "How to Cancel Medi‐Cal",
  "steps": [
    {
      "title": "Review the list of changes you're required to report.",
      "content": "Review the list of changes you're required to report. If you're enrolled in Medi-Cal, you must report any change to the information you provided on your initial application. Some changes, such as an increase in income, will affect your eligibility for Medi-Cal. You must report the following within 10 days: [2] X Research source Any change that affects your household size, such as marriage or divorce, adoption or birth of a child Any change that affects your income, such as gaining or losing a job Changes in citizenship or immigration status Change of address or incarceration Any change in disability status"
    },
    {
      "title": "Contact your local county office.",
      "content": "Contact your local county office. If the information you provided on your application has changed, you must report that change to your local county office. Call the office ahead of time for instructions on how to proceed. [3] X Research source County office contact information is available at http://www.dhcs.ca.gov/services/medi-cal/Pages/CountyOffices.aspx .. When you get a social worker on the phone, tell them that you want to report a change to your Medi-Cal information. Ask specifically what documents you'll need to bring with you when you go to the office, and write down what the social worker says. Take down the social worker's name in case you have any questions or issues later."
    },
    {
      "title": "Gather documentation.",
      "content": "Gather documentation. You'll have to provide documentation of the change when you report it. You'll save time and prevent multiple trips if you get your proof together before you go to your local county office. You can find a list of acceptable documents on the MyBenefitsCalWin website. If you haven't already, register for a free account on the website."
    },
    {
      "title": "Complete forms at your local county office.",
      "content": "Complete forms at your local county office. Typically you are expected to appear in person at the local county office if you want to report a change. Most county offices use standard forms that are the same throughout the state, but some have their own forms. There are some standard forms available on the MyBenefitsCalWin website. If your local county office uses these forms, you can download these and fill them out ahead of time."
    },
    {
      "title": "Apply for new health insurance.",
      "content": "Apply for new health insurance. If you're no longer eligible for Medi-Cal based on the changes you reported, you'll get a Notice of Action in the mail letting you know that your Medi-Cal coverage is being terminated. [4] X Research source The Notice of Action includes the date your Medi-Cal coverage will be terminated. You can apply for new health insurance with Covered California during a special enrollment period, but you only have 60 days from the date of termination. If you don't pick a new health insurance plan within 60 days of the date your Medi-Cal coverage ends, your special enrollment period will lapse and you'll have to wait until the open enrollment period to get coverage."
    },
    {
      "title": "Contact your local county office.",
      "content": "Contact your local county office. If you report a change, you have to wait for your eligibility to be evaluated. If you want to end your Medi-Cal coverage immediately, you may be able to do this by withdrawing your application. Find contact information for your local county office at http://www.dhcs.ca.gov/services/medi-cal/Pages/CountyOffices.aspx . Call ahead and explain that you want to withdraw your application for Medi-Cal. The social worker will tell you what you need to bring with you to the office. You also may need to schedule an appointment. Take notes during the phone call and get the name of the social worker you talk to."
    },
    {
      "title": "Complete a request for withdrawal form.",
      "content": "Complete a request for withdrawal form. There is a standard form you must fill out with your name and contact information. This form states that you want to withdraw your application for Medi-Cal, effective immediately. [5] X Research source You must provide the reason you want to withdraw your application and discontinue Medi-Cal coverage. For example, if you've gotten a new job and will have health insurance coverage through that job, you may want to cancel Medi-Cal immediately. You can download the form from the California Department of Health Care Services at http://www.dhcs.ca.gov/formsandpubs/forms/Forms/mc215.pdf ."
    },
    {
      "title": "Submit your form to your local county office.",
      "content": "Submit your form to your local county office. You must submit your request for withdrawal at your local county office in person. If you downloaded the form from the internet, bring your original signed form with you. [6] X Research source You can also go into your local county office and ask for a form to fill out there. When you submit your completed, signed form to the social worker, the original will be placed in your file. The social worker will give you a copy for your records."
    },
    {
      "title": "Apply for new health insurance.",
      "content": "Apply for new health insurance. Once your Medi-Cal coverage is discontinued, you only have 60 days from the date it ends to start new health insurance. Unless you're getting health insurance through work, start a new plan as quickly as possible. [7] X Research source To avoid being uninsured for any period of time, your new plan must start before your Medi-Cal plan ends. Check the dates carefully on the Notice of Action you receive. Even though you have 60 days to start a new plan, you still might have a gap in coverage if you wait until the end of that period to enroll."
    },
    {
      "title": "Contact Covered California before the end of the month.",
      "content": "Contact Covered California before the end of the month. To avoid a gap in your health insurance coverage, you need to enroll in a new plan as soon as possible. Since health insurance plans start at the beginning of the month, try to contact Covered California before the end of the month your Medi-Cal is ending. [8] X Research source Visit the Covered California website at http://www.coveredca.com if you want to enroll in a new plan online. You can also call Covered California and apply over the phone. The toll-free number is 1-800-300-1506. Operators are available Monday through Friday from 8 a.m. to 6 p.m., and 8 a.m. to 5 p.m. on Saturday. If you want to work with a certified enrollment counselor in person, you can visit your county social services office."
    },
    {
      "title": "Choose a new Covered California plan.",
      "content": "Choose a new Covered California plan. After answering a few questions about yourself and your household, you'll see a list of plans available to you. Read through these plans carefully and compare them to decide which one you want. [9] X Research source If you have any questions about coverage, or don't understand how a plan works, talk to a certified enrollment counselor."
    },
    {
      "title": "Pay your Covered California premium.",
      "content": "Pay your Covered California premium. Once you choose your new Covered California plan, the first premium will typically be due on the first of the next month. You can arrange for automatic payments, and this amount will be withdrawn from your bank account. [10] X Research source If you don't set up automatic payments, you'll get a bill for your premium. That bill will be from the insurance company that administers the plan you selected – not from Covered California. Your new plan will be cancelled if you don't pay your premium by the due date. When your plan is cancelled for failure to pay, you are not eligible for another special enrollment period. You'll have to wait until the next open enrollment period to get health coverage."
    }
  ]
}