{
  "url": "https://www.wikihow.com/Bolt-Into-Concrete",
  "title": "How to Anchor Anything into Concrete",
  "steps": [
    {
      "title": "Choose a fastener and bit that are rated for your project.",
      "content": "Choose a fastener and bit that are rated for your project. First, determine the weight and size of the object you want to attach to the concrete. Then, look at the weight ratings for the type of fastener you want to use. Choose a fastener that will hold at least as much as your project weighs. [1] X Research source Check the packaging on the fastener for the size of the masonry bit you’ll need to use for your pilot hole. If you’re trying to choose between two fasteners, size up and use the one that’s rated to hold more weight. If you’re not sure which type of fastener to use, jump to our section on choosing a concrete fastener ."
    },
    {
      "title": "Mark the location of the hole you’re drilling.",
      "content": "Mark the location of the hole you’re drilling. Place the object you’re attaching against the concrete. Make sure it’s positioned exactly where you want it and that it’s perfectly level. If you’re using more than one fastener, take extra time to be sure the holes are lined up evenly. Then, carefully mark the location for each fastener with a tracer pencil or permanent marker. [2] X Research source Wrap painter’s tape around your drill bit to mark the depth of the hole you’ll be drilling—the pilot hole should be about 0.25 in (0.64 cm) longer than the fastener you’re using. [3] X Research source"
    },
    {
      "title": "Drill a pilot hole using a masonry bit and a hammer drill.",
      "content": "Drill a pilot hole using a masonry bit and a hammer drill. Put your drill into hammer mode, then hold the hammer drill perpendicular to the concrete and press the bit against the concrete. Once it's in the correct position, pull the trigger while applying pressure on the back of the drill. Pulse your finger on the trigger at 5-second intervals until you've drilled up to the tape that you wrapped around the bit. [4] X Research source Use a hammer drill fitted with a masonry bit . Hammer drills use both tapping and spinning motions to drive the bit into the concrete. [5] X Research source Many household cordless drills have a hammer function, but if yours doesn’t, you’ll need to buy, borrow, or rent one that does. If you have access to one, a rotary hammer drill (like the kind used by professionals) will get the job done faster—fit it with an SDS bit . Check your owner’s manual to see how to switch your drill into hammer mode—you may need to flip a switch or rotate the collar on the chuck."
    },
    {
      "title": "Clean the concrete dust out of the hole you just drilled.",
      "content": "Clean the concrete dust out of the hole you just drilled. Use a compressed air can or a shop-vac to clear out any debris and dust that might be in the hole. Fasteners will grip better to clean holes, and there will be a lot of concrete dust after you've drilled the hole. Also, if you leave dust in the hole, the fastener may not be able to go all the way into the hole. [6] X Research source You can also move a wire straw brush in and out of the hole to remove any leftover debris."
    },
    {
      "title": "Place the fixture over the concrete and line up the holes.",
      "content": "Place the fixture over the concrete and line up the holes. Line up your fixture or whatever you want to attach to the concrete. Line up the hole that you drilled into the concrete with the hole in the fixture. [7] X Research source The hole in your fixture must be the same diameter of the anchor that you're bolting into the concrete"
    },
    {
      "title": "Insert your concrete fastener.",
      "content": "Insert your concrete fastener. Depending on the type of fastener you chose, you’ll need to screw it into place, hammer it in, or a combination of both. Be sure to carefully read the instructions for the type of fastener you’re using. Don’t overtighten the fastener, or you could crack the concrete. For extra security, add two-part epoxy resin to the hole before adding the fastener."
    },
    {
      "title": "Concrete Screw",
      "content": "Concrete Screw A concrete screw looks like a standard screw—the only real difference is that it’s rated for use in concrete. To install a concrete screw, screw it into the pilot hole using a Philips head drill bit. [8] X Research source Some brands of concrete screws, like Tapcon , may come with the drill bit included. Concrete screws are versatile—they’re good for projects like attaching a wooden door frame to a concrete wall or anchoring decking to a concrete pad. [9] X Research source An expanding fastener like a strike anchor may be a better option if you’re hanging something really heavy."
    },
    {
      "title": "Plastic Anchor",
      "content": "Plastic Anchor Plastic anchors are good for light projects. Drill a pilot hole, then push the plastic anchor piece into the hole. Place the object you’re hanging against the wall, then attach with the the included screw. These are a good option if you want to hang light pictures on a concrete wall."
    },
    {
      "title": "Drop-in Anchors",
      "content": "Drop-in Anchors These work similarly to a plastic anchor, but drop-in anchors are made of metal instead of plastic. Drill the pilot hole, then slide the anchor into the hole. Use a setting tool to hammer the anchor until it’s flush with the concrete. Then, secure your object to the concrete with the included bolt. [10] X Research source"
    },
    {
      "title": "Wedge Anchor",
      "content": "Wedge Anchor A wedge anchor looks similar to a regular bolt with a nut on one end, but the other end has a smooth wedge. Place the bolt wedge-side first into your pilot hole. Push it by hand as far into the hole as you can, then drive the anchor into the concrete with a hammer. Tighten the nut with a wrench or a socket. [11] X Research source"
    },
    {
      "title": "Strike Anchor/Hammer Anchor",
      "content": "Strike Anchor/Hammer Anchor A strike anchor , sometimes called a hammer anchor, is a smooth cylinder that has a nail-like piece protruding from the top. To use this fastener, slide it down into the pilot hole—you don’t need to screw it into place. Then, use a hammer to tap the nail piece down. Once it’s flush with the top of the fastener, use a wrench to tighten down the nut on the fastener. [12] X Research source As you hammer the nail, the cylinder at the bottom of the fastener will expand, wedging itself into the concrete securely."
    },
    {
      "title": "Sleeve Anchor",
      "content": "Sleeve Anchor A sleeve anchor is a smooth cylinder with a screw inside. To use this fastener, slide it down into the pilot hole and tap it into place with a hammer. Then, use a wrench to tighten the nut at the top of the anchor. This will turn the screw inside the cylinder, causing the bottom of the cylinder to flare out so it bites into the concrete. [13] X Research source Don’t overtighten the nut—check the packaging instructions so you know exactly how many turns it takes to secure it."
    },
    {
      "title": "Drive Anchor/Split Drive Anchor",
      "content": "Drive Anchor/Split Drive Anchor Drive anchors have a smooth, flat top with a wider split wedge at the bottom. To use them, insert the anchor into the pilot hole, then hammer it down into place. Note that a drive anchor is only meant for concrete and shouldn’t be used on brick. [14] X Research source You can’t remove drive anchors once they’re in place—they sit flush against the surface of the concrete, so you can’t pull them out, and there are no indentations for a drill bit to fit into. This makes them a secure option when you want to be sure that no one can remove whatever you’re bolting to the concrete."
    },
    {
      "title": "Threaded Rod Anchor",
      "content": "Threaded Rod Anchor A threaded rod anchor looks a little like a regular screw, but it has a larger bolt on top. These are intended to be used with epoxy resin—fill your pilot hole with the epoxy, then use the threaded rod anchor to attach the object to the concrete. Once the epoxy sets, the anchor will be locked securely in place. [15] X Research source You can also use regular concrete screws with epoxy."
    },
    {
      "title": "Epoxy resin",
      "content": "Epoxy resin Two-part epoxy resin is the strongest option for fastening objects to concrete. Drill your pilot hole, then mix the resin according to the package instructions. Fill the hole with resin, then attach the object to the concrete with your choice of fastener, like a threaded rod anchor or a concrete screw. When the epoxy cures, the anchor will essentially be glued into place. [16] X Research source Some resin kits come with an anchor, or you can buy the resin and anchor separately. To check that the resin is mixed properly before putting it into the concrete, squeeze a little out onto a piece of cardboard until the color is even."
    },
    {
      "title": "How do I know what size drill bit to use?",
      "content": "How do I know what size drill bit to use? The size of the drill bit will be noted on the packaging for the fastener you’re using."
    },
    {
      "title": "Why won’t the fastener go into the pilot hole?",
      "content": "Why won’t the fastener go into the pilot hole? If you’re having trouble seating the fastener all the way into the pilot hole, double-check that you drilled the hole to the right depth. Then, use compressed air or a shop-vac to clean any concrete dust out of the hole."
    },
    {
      "title": "What if the pilot hole gets stripped out?",
      "content": "What if the pilot hole gets stripped out? If the pilot hole gets stripped, choose a new fastener with a slightly wider diameter than the old one and re-drill the pilot hole with a slightly larger bit."
    },
    {
      "title": "Can you bolt directly into concrete?",
      "content": "Can you bolt directly into concrete? Yes—use a masonry bit to drill a pilot hole, then attach the object into the concrete with a concrete fastener."
    },
    {
      "title": "Can you install bolts into crumbling concrete?",
      "content": "Can you install bolts into crumbling concrete? If your concrete is cracked, use an anchor that has been tested and rated to perform in cracked concrete. [17] X Research source However, if the structural integrity of the concrete is compromised, you may not be able to securely fasten objects to the concrete."
    },
    {
      "title": "Is it better to drill into the concrete block or the mortar?",
      "content": "Is it better to drill into the concrete block or the mortar? Mortar is more likely to crumble, so it’s typically better to drill into the concrete block or brick. [18] X Research source"
    }
  ]
}