{
  "url": "https://www.wikihow.com/Chop-Wood",
  "title": "How to Chop Wood",
  "steps": [
    {
      "title": "Get yourself ready.",
      "content": "Get yourself ready. Not only will you need some ready-to-split logs of appropriate length, which is approximately the length of your forearm, and your trusty axe, but you should also ensure your safety by equipping yourself with: Work gloves Workboots (preferably steel-toe) Safety glasses (optional, but recommended)"
    },
    {
      "title": "Find and position your chopping block.",
      "content": "Find and position your chopping block. If you don't have a chopping block already, your most likely choice will be a large, thick piece of un-split wood. A flared stump also makes an excellent chopping block. If you choose a thick piece of wood, look for one that is knotty, as these will be more resistant to the force of your axe and last longest as a chopping block. Elm wood has a grain to it that makes it naturally split resistant. If an elmwood chopping block is available to you, you should take advantage of it. [1] X Research source A recycled tire around the top of your chopping block can stabilize pieces of wood that don't balance well on your chopping block. [2] X Research source A chopping block should always have yield; chopping on a hard surface can do damage to your axe or, in the case of a dangerous deflection, yourself."
    },
    {
      "title": "Position your wood.",
      "content": "Position your wood. Take the piece of wood you want to split and balance it on your chopping block. You may have to adjust your wood to get it to stand correctly due to natural irregularities, like splits or knots, in the wood growth. Your log should be as stable as possible, with the area you are striking pointing toward the position where you will be chopping wood."
    },
    {
      "title": "Face the wood and your chopping block.",
      "content": "Face the wood and your chopping block. Make sure there are no twigs, loose stones, slick mud, or anything else underfoot that might cause you to slip. Stand with your feet shoulder-width apart and address your wood and chopping block head-on. [3] X Research source It is important that you keep your legs spread shoulder-width apart. Poorly balanced wood or irregular grain/knots in the wood can cause your axe to hit a glancing blow. Keeping your legs shoulder-width apart keeps you safest from landing your axe on your foot or toes."
    },
    {
      "title": "Grip your axe correctly.",
      "content": "Grip your axe correctly. Take your axe in both hands with your dominant hand near the head of the axe and your non-dominant hand toward the end of the handle. A proper swing is executed by allowing your dominant hand to slide down the axe handle toward your other hand, which should remain stationary. This will give you greater control and delivers a more powerful blow."
    },
    {
      "title": "Observe the grain of the wood.",
      "content": "Observe the grain of the wood. Note any knots or limbs. These will make your wood much harder to split. To split a knotted piece of wood, your best approach is going to be the most smooth-grained part of the wood between knots/limbs. [4] X Research source Checks, or small cracks already in your wood, are ideal places for you to land an axe blow. The easiest wood to split will be smooth-grained, with the lines of the wood looking consistent and regular"
    },
    {
      "title": "Prepare your swing.",
      "content": "Prepare your swing. Focus on your target. Bring your axe up on your dominant side, arcing it up over your shoulder in a smooth and steady motion. [5] X Research source Grip the axe firmly in preparation for the swing, and make sure your stance is stable and your legs shoulder-width apart. Another acceptable technique is to bring your axe straight overhead and down on your piece of wood."
    },
    {
      "title": "Swing the axe.",
      "content": "Swing the axe. Bring the axe quickly and firmly down, allowing your dominant hand to slide down the axe handle toward your other hand. Keep your focus steady on the spat at which you are aiming until your axe has struck. [6] X Research source Depending on the thickness and knottiness of your wood, you may have to repeat your strike one or more times before the wood is split."
    },
    {
      "title": "Evaluate your need.",
      "content": "Evaluate your need. If you are splitting normal-sized wood, unless it is unnaturally knotty or a kind of wood resistant to chopping (like elm), you likely won't need to use a wedge. If the wood is tough and several axe swings leave cuts, cracks, but no clean split, it's time for you to get some more tools."
    },
    {
      "title": "Collect your supplemental wood-splitting tools.",
      "content": "Collect your supplemental wood-splitting tools. When an axe alone simply can't do the job, it's time for you to get a long metal wedge and a sledgehammer. You can purchase these from your local hardware store or perhaps even borrow these from a neighbor."
    },
    {
      "title": "Identify a central crack or promising cut.",
      "content": "Identify a central crack or promising cut. Even if your axe didn't pass all the way through your piece of wood, chopping it cleanly, if you landed a few hits, there will probably be at least some deep cuts in the wood, or maybe even a crack. Look for the deepest cut or crack in your wood; this is where you will split the wood. Some especially large or difficult pieces of wood may require more than one wedge."
    },
    {
      "title": "Insert your wedge.",
      "content": "Insert your wedge. As the wood will be softer than your wedge, you probably won't have a problem jamming the wedge into the cut or crack that you've chosen for your split. If you're attempting to cut an especially hard kind of wood, you may need to tap your wedge into place with your sledgehammer. [7] X Research source"
    },
    {
      "title": "Prepare your hammer swing.",
      "content": "Prepare your hammer swing. Using the same form as you did with your axe, keep your legs shoulder-width apart, your dominant hand close to the head of the sledgehammer, your eye focused on the wedge, and bring the hammer into position above your shoulder. [8] X Research source"
    },
    {
      "title": "Swing your sledgehammer.",
      "content": "Swing your sledgehammer. Allow your dominant hand to slide down the handle of your hammer toward your stationary non-dominant hand, and bring the hammer quickly and firmly down on the wedge. This should drive the wedge more deeply into the piece of wood, causing the cut to turn into a crack or the crack that was already there to deepen. You may need to swing your hammer multiple times to drive the wedge deeper into the wood."
    },
    {
      "title": "Separate the wood, if necessary.",
      "content": "Separate the wood, if necessary. Sometimes, the wedge will cause the knot to break apart in a clean split, other times you may have to apply some muscle to pull the mostly split piece apart. In some cases, you may need to use your axe to carefully sever any connecting pieces that remain."
    },
    {
      "title": "Read the manual.",
      "content": "Read the manual. Each firewood cutting machine will be a little different, and knowing its features and proper operation procedure will ensure safe use. Always operate these machines with care, as a mistake can result in serious injury."
    },
    {
      "title": "Check safety procedures.",
      "content": "Check safety procedures. Before starting the machine, you should make sure its track is clear of objects, that cover panels are in place, and that you are wearing the right safety equipment to be operating the machine. [9] X Research source These machines often require: Non-loose clothing Safety glasses Work Gloves"
    },
    {
      "title": "Fuel or power the machine.",
      "content": "Fuel or power the machine. Some firewood splitters will be powered as attachments to a tractor, others might be powered by electric or gas power sources. Do not leave fuel or a power line anywhere that you might trip over it, or anywhere it might become tangled in the components of the machine."
    },
    {
      "title": "Gather your wood.",
      "content": "Gather your wood. Once you have read the manual, you'll know the loading procedure of the machine. This will give you a better idea of where to best position the wood for loading it into the hydraulic splitter. Accumulate your wood where most convenient for your machine."
    },
    {
      "title": "Power on your splitter.",
      "content": "Power on your splitter. Start the machine and observe its normal running procedure, without adding any wood. Make sure it appears to be running smoothly and check operations against the manual."
    },
    {
      "title": "Feed wood into the firewood processor.",
      "content": "Feed wood into the firewood processor. Follow the instructions in your manual for loading uncut and removing cut firewood from your machine. No matter what kind of machine you are using, once it is powered on, always exercise caution around the splitter of the machine."
    }
  ]
}