{
  "url": "https://www.wikihow.com/Bake-a-Cake-on-Your-Stovetop",
  "title": "How to Bake a Cake on Your Stovetop",
  "steps": [
    {
      "title": "Choose and prepare your desired cake batter.",
      "content": "Choose and prepare your desired cake batter. You can use your own recipe , or you can use a boxed mix instead. Most cake recipes should work for this technique. [1] X Research source"
    },
    {
      "title": "Coat 1 to 2 baking pans with butter.",
      "content": "Coat 1 to 2 baking pans with butter. Make sure that you coat both the bottom and sides of the pan. If your recipe requires a different amount of pans, then just stick with that. If your recipe uses a springform pan, then use 2 regular cake pans instead. [2] X Research source"
    },
    {
      "title": "Dust each pan with flour.",
      "content": "Dust each pan with flour. Add about 1 tablespoon of flour into each pan that you are using. Gently shake and jiggle the pan using a side to side motion so that the flour spreads across the bottom. Next, turn the pan on its side, and roll it like a wheel to coat the sides. Discard the excess flour. If you run out of flour, add another 1/2 to 1 tablespoon."
    },
    {
      "title": "Line the pans with parchment paper.",
      "content": "Line the pans with parchment paper. Set the pan on top of a sheet of parchment paper, then trace around it with a pen. Cut the circle out of the parchment paper, then set it into the pan. Repeat this step for each pan that you are using. You don't need to cover the sides of the pan with parchment paper."
    },
    {
      "title": "Pour the batter into the pan(s).",
      "content": "Pour the batter into the pan(s). Use a rubber spatula to scrape every last bit of batter into the pan. If you are using multiple pans, then be sure to divide the batter evenly. Gently shake the pan(s) side to side to spread the batter around so that it is even."
    },
    {
      "title": "Get a pot and a steamer basket or glass cooking dish.",
      "content": "Get a pot and a steamer basket or glass cooking dish. The steamer basket needs to have a flat bottom and either a set of legs that holds it away from the bottom of the pot, or a rim so that it can sit on top of the pot."
    },
    {
      "title": "Fill the pot with some water, then set the basket on top.",
      "content": "Fill the pot with some water, then set the basket on top. The water needs to falls about 1 inch (2.5 cm) below the bottom of the steamer basket. Pour the water into the pot first, then set the steamer basket on top. Add or pour out water as needed. [3] X Research source If you are using a glass baking dish, then the water level should be 1 inch (2.5 cm) below the bottom of the dish as well. It does not have to be exactly 1 inch (2.5 cm). You just don't want the water to bubble out of the pot and into the steamer."
    },
    {
      "title": "Cover the bottom of the steamer basket with a thin layer of dried beans.",
      "content": "Cover the bottom of the steamer basket with a thin layer of dried beans. It does not matter what type of beans you use. You can even use small pebbles instead. The beans are there simply to create a buffer between the basket and the base of your cake pan. [4] X Research source You need to do the same thing if you are using a glass baking dish. In this case, dried beans might be safer for the glass."
    },
    {
      "title": "Set up another double-boiler system if you're using multiple pans.",
      "content": "Set up another double-boiler system if you're using multiple pans. You can use the same pot-and-steamer basket combo, or you can use a pot-and-glass dish combo instead. The cakes may look a little different from each other when you finish, but they will still taste the same. The baking times will be the same for both set-ups. If you don't do this, then you'll have to bake the cake in batches."
    },
    {
      "title": "Cover the pot with a lid and heat the water on high for 5 minutes.",
      "content": "Cover the pot with a lid and heat the water on high for 5 minutes. Just like preheating an oven, you need to preheat the pot. Simply cover the pot with a tight fitting lid, turn the heat up to high, and wait 5 minutes. [5] X Research source If you don't do this, it will be like sticking a cake into a cold oven; the cakes won't bake properly and may come out under-baked. [6] X Research source Make sure that the lid fits snugly on the steamer basket or glass dish. You don't want any steam to escape. This will be especially important once you add the cake. [7] X Research source"
    },
    {
      "title": "Set the cake pan into the steamer basket.",
      "content": "Set the cake pan into the steamer basket. If you're using a glass dish, then set the cake into the dish instead. Make sure that the bottom of the cake pan is resting on top of the dried beans. Don't wriggle the pan into the beans. [8] X Research source"
    },
    {
      "title": "Cover the pot with parchment paper and a lid.",
      "content": "Cover the pot with parchment paper and a lid. Don't put the lid onto the pot right away. If you do this, the steam will get trapped and drip down onto the cake, leading to a soggy mess. Instead, tear off a sheet of parchment paper, then set it on top of the pot. Rest the lid gently on top of the parchment paper. [9] X Research source The parchment paper needs to be about 2 inches (5.1 cm) bigger than the pot. This is because the lid will weigh the paper down into the pot when you put it on."
    },
    {
      "title": "Cook the cake over medium heat for 25 to 30 minutes.",
      "content": "Cook the cake over medium heat for 25 to 30 minutes. At about 25 minutes, open the pot and test the cake for doneness with a toothpick. If the toothpick comes out clean, the cake is done. If it has crumbs stuck to it, continue to cook the cake, testing it every 5 minutes. [10] X Research source Some cakes may require longer than 30 minutes to bake. To do the toothpick test, simply poke a toothpick into the center of your cake, then pull it out. Try not to peek at the cakes, otherwise the heat will escape and slow down the baking process."
    },
    {
      "title": "Take the cake out of the pot using a kitchen towel.",
      "content": "Take the cake out of the pot using a kitchen towel. Take the lid and parchment paper off of the pot. Drape a kitchen towel over each hand, then pinch the rim of the cake pan and carefully lift it out. This may be a little tricky, especially if you don't have a lot of space between the pan and the steamer basket/glass dish. Just try your best. If the kitchen towel is too thin, fold it in half or try a pot holder. An oven mitt may be too bulky to fit between the pot and pan."
    },
    {
      "title": "Let the cake cool for 5 minutes before removing the cake from the pan.",
      "content": "Let the cake cool for 5 minutes before removing the cake from the pan. To remove the cake, simply flip the pan over onto a flat surface and let the cake slide out. Peel the parchment paper away, then flip the cake back over. [11] X Research source If the cake is stuck, run a paring or butter knife along the edge of the pan before popping the cake out. The cake is done after this. You may want to level the top for a nicer finish, however. If you plan on frosting the cake, you must let it cool off completely on a wire rack (about 10 to 15 minutes). If you don't the frosting will melt off."
    }
  ]
}