{
  "url": "https://www.wikihow.com/Break-in-Your-Doc-Martens",
  "title": "How to Break in Your Doc Martens",
  "steps": [
    {
      "title": "Buy Doc Martens in the right size.",
      "content": "Buy Doc Martens in the right size. Doc Martens tend to run true to size, but try them on anyway to make sure you buy the right size . Boots in the right size should feel tight, but not uncomfortable. [1] X Research source You can browse a variety of Doc Martens online for purchase here . If the shoe feels immediately uncomfortable when you try it on, especially in the width, it is too small. Doc Martens only come in whole sizes. The official website recommends sizing down if you normally take a half size. [2] X Research source"
    },
    {
      "title": "Put on a thick pair of socks and pull on the laced-up boots.",
      "content": "Put on a thick pair of socks and pull on the laced-up boots. Wearing thick socks with Doc Martens will cause them to widen out and break in a little faster. They also help protect your feet from blisters . Put the laces back in your boots and tie them tightly. [3] X Research source The lining of Doc Martens can cause damage to your feet through friction. Thick socks help reduce friction and minimize pain."
    },
    {
      "title": "Walk around for 5-10 minutes at home then take the boots off.",
      "content": "Walk around for 5-10 minutes at home then take the boots off. Start with wearing your Doc Martens around your home for short periods of time. The soles of the boots will be very stiff, and the leather will feel tight. Once the boots start to hurt, take them off. Don’t try to wear your boots for a long period of time or on a long walk the first time you wear them."
    },
    {
      "title": "Protect the places where you felt pain.",
      "content": "Protect the places where you felt pain. Most often, people experience pain in the heel of the shoe. Note any areas where you see blisters or redness. Cover those areas with bandages or moleskin . Moleskin is a little thicker than a bandage and can stay on better. Find moleskin at a pharmacy or online."
    },
    {
      "title": "Wear your boots for 1-2 hour intervals at home.",
      "content": "Wear your boots for 1-2 hour intervals at home. Once you have protected your blisters, you can start wearing your Doc Martens around the house for slightly longer periods of time. Take them off once they start to hurt."
    },
    {
      "title": "Repeat the process for several weeks.",
      "content": "Repeat the process for several weeks. Keep wearing your Doc Martens around your home for short periods of time every day. If you feel comfortable, you can increase the amount of time you wear them each time or wear your Doc Martens outside on short walks. You can also reapply the balm up to once a week. Doc Martens can take up to 3-6 weeks to fully break in. Vegan Doc Martens don’t need to be broken in at all. [4] X Research source"
    },
    {
      "title": "Take out the laces and rub the leather with balm.",
      "content": "Take out the laces and rub the leather with balm. Doc Martens are made out of stiff, full-grain leather. The official website recommends using Doc Martens Wonder Balsam to clean and protect the leather and to help make it softer. The Wonder Balsam is a mix of lanolin, beeswax, and coconut oil , so you can also look for an off-brand product or create your own blend. [5] X Expert Source Marc Sigal Shoe Care Specialist Expert Interview. 15 January 2020. Beeswax is an important factor in keeping the shoes water-resistant, so look for it as an ingredient if you are buying a different balm or making your own."
    },
    {
      "title": "Remove the insole to make the breaking-in process less painful.",
      "content": "Remove the insole to make the breaking-in process less painful. The inner lining of Doc Martens is made of an abrasive material that rubs against the foot and creates blisters. Removing the insole takes some of the friction away and helps prevent blisters. [6] X Research source It's still best to wear thick socks to prevent blisters around the ankle."
    },
    {
      "title": "Wrap the shoes in a towel and hit the heel with a hammer.",
      "content": "Wrap the shoes in a towel and hit the heel with a hammer. Wrapping the shoes first will help protect them from getting damaged by the hammer. Hammer around the heel and the sole of the shoe for 15-20 minutes. You can use a rubber mallet instead of a hammer if you’re worried about damaging your Doc Martens. [7] X Expert Source Marc Sigal Shoe Care Specialist Expert Interview. 15 January 2020. Hammering your Doc Martens can diminish the smoothness of the new leather."
    },
    {
      "title": "Stuff your Doc Martens tightly with newspaper.",
      "content": "Stuff your Doc Martens tightly with newspaper. Pack as much newspaper as you can tightly into the toes of your boots. Remove the laces to make the shoes easier to stuff. This will stretch out the toe box of your Doc Martens. You can alternate stuffing your shoes with newspaper and wearing them around the house with thick socks to double up on breaking in methods. You can also look for a boot stretcher online or at a shoe store to get a similar effect."
    },
    {
      "title": "Aim a hairdryer at the tightest part of your boots.",
      "content": "Aim a hairdryer at the tightest part of your boots. Wearing your Doc Martens with thick socks. Apply a thin coat of Wonder Balsam on the boot, then heat the boot with the low setting on a hairdryer for 5-10 minutes to melt down the oils and help them absorb into the leather quickly. Wear the boots until they are cool. [8] X Expert Source Marc Sigal Shoe Care Specialist Expert Interview. 15 January 2020. Don't use the high heat setting, as you can scald your leather and promote cracking and splitting."
    }
  ]
}