{
  "url": "https://www.wikihow.com/Backset-a-Volleyball",
  "title": "How to Backset a Volleyball",
  "steps": [
    {
      "title": "Position your hands.",
      "content": "Position your hands. Bring your hands a bit higher than your head. Make sure they are about five inches in front of your forehead. Your wrists and palms should be facing toward the ceiling. Spread your fingers out wide. Both your thumbs should be facing toward your forehead. Keep your hands at an angle so that the thumb and forefinger of each hand is about two to three inches away from the thumb and forefinger of the other hand."
    },
    {
      "title": "Catch the ball.",
      "content": "Catch the ball. When the ball comes to you, catch it with all of your fingers. Your ring and pinky fingers will help to keep the ball stable while your other fingers will help you to direct the ball. Having all your fingers on the ball makes it easier to control. Bend your elbows when you catch the ball to give your arms a wide range of motion. Don't hold the ball too long when you catch it or you will get called for a “lift.” Make sure both hands touch the volleyball at the same time or you may get called for a “double contact.”"
    },
    {
      "title": "Push the ball up.",
      "content": "Push the ball up. Finish your backset by pushing the ball up. Straighten your arms and release the ball into the air. Because you have already started the ball moving backwards, it will naturally travel behind you. End your backset by pushing the ball straight up to give your attacker an easier target to spike. [1] X Research source The entire process from the catch to the release should be one quick motion. If your set looks disjointed, you might get called for holding on to the ball. You should form a “J” with your hands when you pull the ball back and release it. Remember to follow through with your hands after you release the ball to help it travel where you want it to go."
    },
    {
      "title": "Start out in a neutral position.",
      "content": "Start out in a neutral position. Stand with your feet about shoulder width apart or a little wider with your knees slightly bent. Your weight should be distributed evenly throughout the bottoms of your feet so that you can easily move in any direction. Keep your back straight and don't lean one way or the other. If you over-commit to moving your body in one direction, you won't be able to switch the trajectory of the ball in reaction to the other team's blockers."
    },
    {
      "title": "Square up under the ball.",
      "content": "Square up under the ball. When you see the ball coming your way, position yourself directly under it. Run to the ball in a neutral position. When you get close enough, jump under it and place your hips, feet, and shoulders directly facing the spot the ball come down. Make sure your back is facing the direction you want to set the ball. You should lift your hands into position at the same time that you square up. Make sure your back stays straight. You may have to switch the direction of your set at the last second."
    },
    {
      "title": "Generate power.",
      "content": "Generate power. Much of the power in your set will be generated from your legs. [2] X Research source Bend your knees when you square up to the ball and straighten them when you release the ball. Try to use the right amount of power for your set. If you're setting up an attacker that is near you, you don't need to use as much force as if you're setting up someone at the other side of the court. It may take some time and practice before you can accurately judge how much power to use for each set."
    },
    {
      "title": "Jump.",
      "content": "Jump. If you see an opportunity to surprise your opponents, you can jump in the air to set the ball. When you jump, be sure that your back is straight and that you're directly under the ball. By jumping to the ball instead of waiting for it to come to you on the ground, you speed up the offense. Not only do you get the ball faster, but you also make sure the ball doesn't have as far to travel towards the attacker."
    },
    {
      "title": "Practice making a “J” motion with your arms.",
      "content": "Practice making a “J” motion with your arms. Hold the ball in your hands above your forehead as if you just caught it. Pull the ball back and then straighten your arms into the air but keep the ball in your hand. Remember to keep your back straight while you do the drill to train your body to stay in position. You should also synchronize your legs and your arms by straightening them both at the same time. Start off doing the drill slow until the movement becomes second nature. Do the drill in one solid movement."
    },
    {
      "title": "Work on catching the ball.",
      "content": "Work on catching the ball. Get a partner. Start out in a neutral position facing perpendicular to them. Have them toss you the volleyball and square up under it facing them with your hands ready to catch it. [3] X Research source Catch the volleyball and then toss it back to your partner. Get back into a neutral position and repeat the exercise. This drill helps your body get used to squaring up to the ball. Make sure that you're touching the ball with both hands at the same time each time you catch it. You don't want to build any bad habits."
    },
    {
      "title": "Test your release.",
      "content": "Test your release. Get a partner. Hold a volleyball in your hands like you just caught it. Push the ball back and up in a “J” motion and release it into the air. Have your partner watch to make sure your ball is travelling in the right trajectory. The ball should make a half circle in the air behind you. If the ball is traveling diagonally behind you, you're trying to push the ball back and up at the same time and you need to recalibrate your release. Do this drill until the ball consistently moves on the right path."
    },
    {
      "title": "Set while moving side to side.",
      "content": "Set while moving side to side. [4] X Research source Have a partner stand about ten feet away from you. Take turns setting the ball back and forth to each other while shuffling from one end of the court to the other. This drill will teach you to get under the ball quickly and develop proper form when you set. Make sure to have a coach or friend nearby to call you out if you start to lose your form."
    }
  ]
}