{
  "url": "https://www.wikihow.com/Activate-Windows-7",
  "title": "How to Activate Windows 7 Using the Product Key",
  "steps": [
    {
      "title": "Click the Start button.",
      "content": "Click the Start button. Right-click on Computer and select Properties. This will open the System Properties window. You can also press ⊞ Win + Pause ."
    },
    {
      "title": "Click the “Activate Windows now” link at the bottom of the window.",
      "content": "Click the “Activate Windows now” link at the bottom of the window. The software will attempt to detect an active Internet connection. If one is detected, the \"Activate Windows online now\" option will be available for selection. If it is not available, check to make sure you are connected to the Internet."
    },
    {
      "title": "Enter your Windows 7 product key at the prompt.",
      "content": "Enter your Windows 7 product key at the prompt. You must enter a valid 25 character key in order to activate your copy of Windows. Your product key may be located underneath your laptop, on the back of your computer case, on the disc case for your Windows 7 installation DVD, or in the Windows 7 manual. [1] X Expert Source Scott St Gelais IT Consultant Expert Interview. 27 July 2021. If you downloaded the software online, then you will find it in your confirmation email. If you cannot find your product key, you may need to purchase a new one. If you have a Microsoft account, the key may be listed in your account details when you log in. [2] X Expert Source Scott St Gelais IT Consultant Expert Interview. 27 July 2021."
    },
    {
      "title": "Click .",
      "content": "Click . Next to activate your copy of Windows. The activation process may take a few moments. Once it has been completed, the activation window will display a confirmation message. To double-check that you are activated, open System Properties again (Right-click on Computer and select Properties). The bottom of the window should show the message “Windows is activated”."
    },
    {
      "title": "Click the Start button.",
      "content": "Click the Start button. Right-click on Computer and select Properties. This will open the System Properties window. You can also press ⊞ Win + Pause ."
    },
    {
      "title": "Click the “Activate Windows now” link at the bottom of the window.",
      "content": "Click the “Activate Windows now” link at the bottom of the window."
    },
    {
      "title": "Select “Show me other ways to activate” from the Activation menu.",
      "content": "Select “Show me other ways to activate” from the Activation menu."
    },
    {
      "title": "Enter your Windows 7 product key at the prompt.",
      "content": "Enter your Windows 7 product key at the prompt. You must enter a valid 25 character key in order to activate your copy of Windows. Your product key may be located underneath your laptop, on the back of your computer case, on the disc case for your Windows 7 installation DVD, or in the Windows 7 manual. If you downloaded the software online, then you will find it in your confirmation email. If you cannot find your product key, you may need to purchase a new one."
    },
    {
      "title": "Click .",
      "content": "Click . Next . Select the “Use automated phone system” from the list of options. You may be prompted to enter an administrator password. If so, enter the password, and click OK ."
    },
    {
      "title": "Select the location that is closest to you.",
      "content": "Select the location that is closest to you. You will be given a list of numbers that you can call, and an installation ID number will be displayed in the window."
    },
    {
      "title": "Call the number.",
      "content": "Call the number. You will be connected to an automated system that will guide you through the activation process. You will be prompted for the installation ID that is displayed on the screen."
    },
    {
      "title": "Use your phone’s keypad to enter your Installation ID.",
      "content": "Use your phone’s keypad to enter your Installation ID."
    },
    {
      "title": "Write down the confirmation number.",
      "content": "Write down the confirmation number. After you have entered the installation ID, you will be provided with a confirmation number. Write it down or type it into Notepad."
    },
    {
      "title": "Enter the confirmation number into the activation window and click .",
      "content": "Enter the confirmation number into the activation window and click . Next . If the activation doesn’t work, you can stay on the phone to speak with a Microsoft support member. [3] X Research source"
    },
    {
      "title": "Click the Start button.",
      "content": "Click the Start button. Right-click on Computer and select Properties. This will open the System Properties window. You can also press ⊞ Win + Pause ."
    },
    {
      "title": "Click the “Activate Windows now” link at the bottom of the window.",
      "content": "Click the “Activate Windows now” link at the bottom of the window."
    },
    {
      "title": "Select “Show me other ways to activate” from the Activation menu.",
      "content": "Select “Show me other ways to activate” from the Activation menu."
    },
    {
      "title": "Enter your Windows 7 product key at the prompt.",
      "content": "Enter your Windows 7 product key at the prompt. You must enter a valid 25 character key in order to activate your copy of Windows. Your product key may be located underneath your laptop, on the back of your computer case, on the disc case for your Windows 7 installation DVD, or in the Windows 7 manual. If you downloaded the software online, then you will find it in your confirmation email. If you cannot find your product key, you may need to purchase a new one."
    },
    {
      "title": "Click .",
      "content": "Click . Next . Select “Use my modem to connect directly to the activation service.” You may be prompted to enter an administrator password. If so, enter the password, and click OK."
    },
    {
      "title": "Select the location closest to you from the drop-down list.",
      "content": "Select the location closest to you from the drop-down list. Click Next to connect and attempt to activate. You will hear your modem turn on and connect to the activation service. The activation process may take a few moments. Once it has been completed, the activation window will display a confirmation message. To double-check that you are activated, open System Properties again (Right-click on Computer and select Properties). The bottom of the window should show the message “Windows is activated”."
    },
    {
      "title": "Download the InfiniteRearm utility.",
      "content": "Download the InfiniteRearm utility. This can be found at a variety of Windows enthusiast sites. It is illegal to use if you don't own the copy of Windows that you are disabling activation for, and is not made by or endorsed by Microsoft. You may have to download InfiniteRearm as part of the \"Rearm Wizard\" software package."
    },
    {
      "title": "Extract the downloaded program.",
      "content": "Extract the downloaded program. Double-click the downloaded file and drag the Rearm Wizard.cmd file to your desktop or other easy location."
    },
    {
      "title": "Run the.",
      "content": "Run the . Rearm Wizard.cmd file. This will open the Command Prompt and take you through the InfiniteRearm setup process."
    },
    {
      "title": "Select \"A\" from the main menu.",
      "content": "Select \"A\" from the main menu. This will load IR7 (InfiniteRearm 7)."
    },
    {
      "title": "Select \"A\" from the InifinteRearm menu.",
      "content": "Select \"A\" from the InifinteRearm menu. This will install the InfiniteRearm service on your computer. Your computer will reboot."
    },
    {
      "title": "Use Windows as you normally would.",
      "content": "Use Windows as you normally would. InfiniteRearm continuously resets the timer on your trial, which gives you full access to all the features."
    },
    {
      "title": "Reinstall the program again when your timer runs out.",
      "content": "Reinstall the program again when your timer runs out. The timer will always eventually run out, but you can extend it again by installing the program and restarting the process. You will be prompted to reinstall at the end of the 180 day period."
    }
  ]
}