{
  "url": "https://www.wikihow.com/Calculate-Square-Meters",
  "title": "How to Calculate Square Meters",
  "steps": [
    {
      "title": "Choose a meter stick or metric tape measure.",
      "content": "Choose a meter stick or metric tape measure. Select a meter stick ruler or tape measure with meters (m) or centimeters (cm) printed on it. These tools will make it easier to calculate square meters since they were designed in the same system of measurement. If you can only find a ruler with feet (ft) or inches (in), measure with those instead, then go to the section on converting to square meters."
    },
    {
      "title": "Measure the length",
      "content": "Measure the length of the area you're measuring. Square meters are a unit for measuring area, or the size of a two-dimensional object such as a floor or a field. Use your measuring tool to measure one side of the object, from one corner to the other. [2] X Research source Write down the result. If the object is longer than 1 meter, remember to include both the meter and centimeter parts of the measurement. For instance, \"2 meters 35 centimeters.\" If you want to measure an object that isn't rectangular or square , read the Complex Shapes section instead."
    },
    {
      "title": "If you can't measure the entire length at once, do it in stages.",
      "content": "If you can't measure the entire length at once, do it in stages. Lay out the measuring tool, then put down a rock or other small object exactly at an easy-to-remember mark (like 1 meter or 25 centimeters). Pick up the tool and lay it down again, starting at the small object. Repeat until the entire length is covered, and add all your measurements together. If the room isn't rectangular, break it into several small rectangles, then measure those. For example, if the room is L-shaped, break that up into two non-overlapping rectangles. [3] X Expert Source Mario Banuelos, PhD Associate Professor of Mathematics Expert Interview. 11 December 2021."
    },
    {
      "title": "Measure the width.",
      "content": "Measure the width . Use the same tool to measure the width of the same area or object. The side you measure in this step should be angled close to 90º away from the length of the object you measured earlier, like two sides of a square next to each other. [4] X Research source Write this number down as well. Unless the object you're measuring is much smaller than 1 meter, you can round to the nearest centimeter when making your measurements. For instance, if the width is slightly past the 1 meter 8 centimeter mark, just use '\"1m 8cm\" as your measurement, without using decimals or millimeter measurements."
    },
    {
      "title": "Convert",
      "content": "Convert from centimeters to meters. Usually, the measurements won't divide evenly into meters. Instead, you'll have a measurement in both meters and centimeters, for example, \"2 meters 35 centimeters.\" Because 1 centimeter = 0.01 meters, you can convert a centimeter measurement into meters by moving the decimal point two digits to the left. Here are a couple examples: [5] X Research source 35cm = 0.35m, so 2m 35cm = 2m + 0.35m = 2.35m 8cm = 0.08m, so 1m 8cm = 1.08m"
    },
    {
      "title": "Multiply",
      "content": "Multiply the length and width together. Once both measurements are converted into meters, multiply them together to get the measurement of the area in square meters. [6] X Expert Source Mario Banuelos, PhD Associate Professor of Mathematics Expert Interview. 11 December 2021. Use a calculator if necessary. [7] X Research source For example: 2.35m x 1.08m = 2.538 square meters (m 2 )."
    },
    {
      "title": "Round to a more convenient measurement.",
      "content": "Round to a more convenient measurement. If you get a long decimal as an answer, for instance, 2.538 square meters, you'll probably want to round it to a number with fewer digits, for instance 2.54 square meters . Since you probably didn't measure correctly down to the tiniest fraction of a meter, the last digits probably aren't accurate anyway. In most cases, you can round to the nearest centimeter (0.01m). For a more accurate measurement, learn how to round to the significant digits . Whenever you multiply two numbers with the same units (for instance, meters), the answer is always in the form of that unit squared (m 2 , or square meters)."
    },
    {
      "title": "Multiply square feet by 0.093",
      "content": "Multiply square feet by 0.093 . Measure the length and width in feet and multiply them together to get a result in square feet. Since 1 square foot = 0.093 square meters, multiply your result by 0.093 to get the answer in square meters instead. [8] X Research source Square meters are bigger than square feet, so it will take fewer of them to cover the same area. For greater precision, multiply by 0.092903 instead."
    },
    {
      "title": "Multiply square yards by 0.84",
      "content": "Multiply square yards by 0.84 . If you have the measurement in square yards , multiply by 0.84 to get the measurement in square meters. [9] X Research source For greater precision, multiply by 0.83613 instead."
    },
    {
      "title": "Multiply acres by 4050.",
      "content": "Multiply acres by 4050. One acre contains about 4050 square meters. If you want to be more precise, multiply by 4046.9 instead. [10] X Research source"
    },
    {
      "title": "Convert",
      "content": "Convert square miles to square kilometers instead. One square mile is much, much larger than a square meter, so typically it is converted into square kilometers instead. Multiply the square miles by 2.6 to find the area in square kilometers instead. (Or multiply by 2.59 instead to be more precise.) [11] X Research source If you want to convert to square meters, 1 square kilometer = 1,000,000 square meters."
    },
    {
      "title": "Convert square meters to units of area, not length.",
      "content": "Convert square meters to units of area, not length. Square meters are a unit that measures area , or two-dimensional surfaces. It doesn't make any sense to compare them with units that measure length , or distance in one direction. You can convert between \"square meters\" and \"square feet,\" but not between \"square meters\" and \"feet.\" Don't use the calculations in this section to convert between units of length. That requires different numbers."
    },
    {
      "title": "Break the shape up into pieces.",
      "content": "Break the shape up into pieces. If you are solving a math problem , draw or cut lines in the shape to divide it into simpler shapes, such as rectangles and triangles . If you are measuring a room or other physical object, sketch a diagram of the area first, then do the same thing. Take measurements of each section and write them on the diagram. [12] X Research source Follow the instructions below to find the area of each section, then add the results together."
    },
    {
      "title": "Measure rectangle-shaped pieces as you would normally.",
      "content": "Measure rectangle-shaped pieces as you would normally. To find the area in square meters for rectangular sections, see the instructions for calculating an area in square meters. If you are measuring in a different unit, look at the section on other units."
    },
    {
      "title": "Measure right triangles similarly, then divide by two.",
      "content": "Measure right triangles similarly, then divide by two. A right triangle, which has a 90º angle just like the corners of a square, has an area easy to calculate. Measure the two sides next to that 90º corner (the length and width), multiply them together, then divide by two to get the answer in square meters. [13] X Research source This works because a right triangle is exactly the size of a rectangle cut in half. You found the area of a rectangle as usual, then divided by two to get the area of the triangle."
    },
    {
      "title": "Turn other triangles into right triangles, then measure them.",
      "content": "Turn other triangles into right triangles, then measure them. Draw a line from any corner of a triangle to the opposite side, so that the line hits the opposite side at a 90º angle (picture the corner of a square). You've just divided the triangle into two pieces, each one a right triangle! See above for instructions on how to find the area of a right triangle; measure each of the two sub-triangles separately, and add them together."
    },
    {
      "title": "Calculate the area",
      "content": "Calculate the area of a circle. The area of a circle is πr 2 , where r is the radius, or distance from the center of the circle to the rim, or perimeter. [14] X Research source Measure this distance, multiply it by itself, then multiply the result by π on a calculator. If you don't have a calculator with a π function, use 3.14 instead (or 3.1416 if high precision is required). If you're not sure where the center is, have a friend hold a tape measure and walk around the edge of the circle. Hold the other end of the tape measure and adjust your position until the measurement stays the same while your friend walks around the entire edge. More complicated curved boundaries require more advanced math to calculate. If you are measuring a room for practical purposes, it might be easier to estimate the area by pretending the curved surfaces are a series of straight lines."
    }
  ]
}