{
  "url": "https://www.wikihow.com/Change-a-Car-Radiator",
  "title": "How to Change a Car Radiator",
  "steps": [
    {
      "title": "Take off the radiator cap.",
      "content": "Take off the radiator cap. Only do this when the engine is cool. This will release pressure on the cooling system and prevent vacuum lock when draining. [1] X Research source"
    },
    {
      "title": "Squeeze the radiator hoses.",
      "content": "Squeeze the radiator hoses. If you feel a crunching sensation when you squeeze the hoses you probably have rust in the cooling system. The system will need to be flushed before filling with new coolant. There are kits to do this at your local auto part store, but if you would rather, you can do it yourself."
    },
    {
      "title": "Place a drip pan under the petcock.",
      "content": "Place a drip pan under the petcock. It is imperative that you contain and control all coolant that you drain from your vehicle. Aside from being damaging to the environment, the coolant is highly toxic to humans and animals. Its sweet taste and smell make it attractive to children and pets and can result in serious injury or death. [2] X Research source"
    },
    {
      "title": "Open the petcock.",
      "content": "Open the petcock. You can use your hands or a pair of pliers to turn the pet cock. This will open it and allow coolant to drain into your drip pan. [3] X Research source"
    },
    {
      "title": "Flush the radiator.",
      "content": "Flush the radiator. If you felt rust or if your coolant seems dirty, now is the appropriate time to flush your coolant. If you are unfamiliar with the procedure you can refer to Flush a Radiator ."
    },
    {
      "title": "Recycle all liquids captured.",
      "content": "Recycle all liquids captured. Liquids from the flush will also contain coolant. These liquids are considered hazardous waste and must not be poured into the ground. Check with your local recycling and waste management facilities for disposal options. [4] X Research source"
    },
    {
      "title": "Remove the upper and lower radiator hose and the hose to the reservoir.",
      "content": "Remove the upper and lower radiator hose and the hose to the reservoir. This will require you to loosen the hose clamps. You do this by using a hose clamp remover or a pair of channel locks to squeeze the ends of the hose clamp together. Once the ends are together, the clamp should be loose enough to slide up the radiator hose, allowing you to remove the hose from the radiator. [5] X Research source Some older models may have a screw type clamp. For this you will need a socket or screwdriver to twist the screw on the hose clamp. Counterclockwise should loosen and clockwise should tighten the clamp."
    },
    {
      "title": "Disconnect the transmission line.",
      "content": "Disconnect the transmission line. In some cars, there may be a transmission fluid cooler built into the radiator. If there are metal lines running to the radiator from the transmission, they will need to be removed using a wrench. There should be two lines. Also, be careful to catch the transmission fluid that leaks when you disconnect these lines. [6] X Research source These will be a set of two metal lines running into the bottom of the radiator. Do not bend or kink these lines. Be aware that the transmission fluid is also toxic and should be appropriately disposed of."
    },
    {
      "title": "Remove all electrical wiring harness connections.",
      "content": "Remove all electrical wiring harness connections. Locate and disconnect the fan motor electrical connector. This is usually the only electrical connection, but double check to make sure."
    },
    {
      "title": "Disconnect the air conditioner condenser.",
      "content": "Disconnect the air conditioner condenser. The air conditioner condenser is often connected to the radiator. To remove the radiator, you will need to remove the condenser mounting bolts with a wrench. This allows the condenser to stay in the engine bay and keeps the refrigerant system closed. [7] X Research source The condenser mounting bolts are usually near the top corners of the radiator. You will not need to unhook any lines or hoses from the condenser."
    },
    {
      "title": "Remove the bolts from the mounting brackets.",
      "content": "Remove the bolts from the mounting brackets. Look at how your radiator is attached to your car. Usually there are braces bolted to the frame on top, and the bottom rests on rubber feet within an indentation. [8] X Research source"
    },
    {
      "title": "Remove the radiator from the car.",
      "content": "Remove the radiator from the car. There should be no hoses, electrical connectors, and it should have sufficient clearance to be removed. If not, study the layout and think before disassembling anything else. Some other components may need to be removed like a top engine mount or the battery tray, but usually the radiator is held in only by the mounting brackets. [9] X Research source"
    },
    {
      "title": "Disassemble the radiator.",
      "content": "Disassemble the radiator. Once the radiator is out, you will need to look for any parts that need to be transferred over to the new radiator. This might include the fan shroud assembly, brackets, or other parts. Remove any such parts before recycling the radiator. [10] X Research source"
    },
    {
      "title": "Connect all parts to the radiator.",
      "content": "Connect all parts to the radiator. Any parts that were removed from the old radiator, such as brackets, fan shroud, etc., need to be installed on the new radiator before it goes into the car. [11] X Research source"
    },
    {
      "title": "Insert the radiator into the car.",
      "content": "Insert the radiator into the car. It will simply lower (or raise) into the same space that you took the old radiator out of. This part is fairly easy, but be cautious. If you bend the fins of the radiator you will need to straighten them out with a radiator comb to ensure proper airflow and cooling. [12] X Research source"
    },
    {
      "title": "Connect the mounting brackets.",
      "content": "Connect the mounting brackets. Lower or fit the radiator into the support track. Align the radiator with any mounting tabs, including any rubber mouldings between the radiator and the support rack. Tighten the mounting bracket bolts to secure the radiator in the engine bay. [13] X Research source"
    },
    {
      "title": "Secure the air conditioning condensor.",
      "content": "Secure the air conditioning condensor. Use the same condenser mounting bolts that your removed from the old radiator. Align the condenser so that the bolts fit into the radiator and screw them in with a wrench or ratchet."
    },
    {
      "title": "Plug in any wiring harnesses.",
      "content": "Plug in any wiring harnesses. This will restore power to your electric fan (if your car has an electric fan). If there are any other electrical components with your radiator, this will restore power to them as well. [14] X Research source"
    },
    {
      "title": "Connect the transmission coolant lines.",
      "content": "Connect the transmission coolant lines. This will ensure that your transmission keeps cool, and that transmission fluid isn’t leaked. Be sure not to cross thread these fittings, as that might result in a poor seal and leaking transmission fluid. Tighten with a wrench. [15] X Research source It is likely that there will be gaskets that fit between these lines and the radiator. Be sure that the gasket did not get left on your old radiator."
    },
    {
      "title": "Connect the upper and lower radiator hoses and the hose to the reservoir.",
      "content": "Connect the upper and lower radiator hoses and the hose to the reservoir. This will complete your cooling system and allow coolant to flow into and out of your radiator. Slide the hoses onto their respective fittings at the top and bottom of the radiator. Then use a pair of channel locks to move the hose clamps up into place. This holds the hoses to the radiator snuggly. [16] X Research source"
    },
    {
      "title": "Verify that you have the correct coolant.",
      "content": "Verify that you have the correct coolant. You will need to consult your owner’s manual or service manual for proper coolant specifications. [17] X Research source"
    },
    {
      "title": "Dilute the coolant with distilled water.",
      "content": "Dilute the coolant with distilled water. You can purchase pre-diluted coolant, or use distilled water to dilute the coolant. This allows the coolant to function properly, so be sure that you are diluting to the correct concentrations. This is usually a one to one dilution (half water, half coolant). [18] X Research source"
    },
    {
      "title": "Pour to the fill line.",
      "content": "Pour to the fill line. You should pour directly into the radiator until you see the fluid near the top, and then fill the reservoir tank to the cold fill line. You may need to add additional coolant once the engine circulates what you add. [19] X Research source"
    },
    {
      "title": "Bleed air pockets from the cooling system.",
      "content": "Bleed air pockets from the cooling system. Some cars require a specific routine to bleed air pockets out of the cooling system. Check your service manual for details on how to do this properly. [20] X Research source"
    },
    {
      "title": "Reinstall your radiator cap.",
      "content": "Reinstall your radiator cap. This closes off your system and allows it to build pressure. You have now changed your radiator. [21] X Research source"
    }
  ]
}