{
  "url": "https://www.wikihow.com/Clean-a-Sauna-Suit",
  "title": "How to Clean a Sauna Suit",
  "steps": [
    {
      "title": "Read the care label.",
      "content": "Read the care label. Since sauna suits can be made with a variety of synthetic materials, it's important to read the care label that's on your sauna suit. The care label will tell you how to wash the suit and give you drying instructions. For example, the label may instruct you to only hand wash the suit and hang it to dry. If the label isn't written, you may need to look up common care label symbols that tell you how to wash the suit."
    },
    {
      "title": "Spray the sauna suit with water.",
      "content": "Spray the sauna suit with water. To keep your sauna suit as clean as possible, rinse it with water after each use. You don't need to scrub, wring, or wash the suit every day, just be in the habit of washing it with water. [1] X Research source For example, you can wear the suit into the shower after you exercise. This is a simple way to wash off the suit."
    },
    {
      "title": "Wash the sauna suit with detergent.",
      "content": "Wash the sauna suit with detergent. Set out two tubs of water and put a mild laundry detergent into one. Place the sauna suit into the tub with the detergent and let it soak for 10 to 15 minutes. Gently rub the suit to loosen any dirt and grime. Rinse the suit in the tub that only contains water and squeeze out excess water. [2] X Research source If you use the sauna suit almost every day, try to wash the sauna suit with detergent at least once a week."
    },
    {
      "title": "Hang dry the sauna suit.",
      "content": "Hang dry the sauna suit. Regardless of whether you washed the sauna suit with soap or just with water, you should hang it up while it's still wet. Let it dry on the hanger overnight or until it's totally dry. You can also hang the sauna suit on the clothes line in the sun, but check the manufacturer's instructions on your suit."
    },
    {
      "title": "Select the right settings.",
      "content": "Select the right settings. Read the care label on your suit to find out the recommended water temperature for washing your suit. Set the water temperature on your washing machine. You should also select a gentle or delicate cycle for washing the suit. Avoid using spin cycles for the suit, since this may be rough on the fabric."
    },
    {
      "title": "Use gentle laundry detergent.",
      "content": "Use gentle laundry detergent. Add just a little gentle laundry detergent and place the sauna suit in the washing machine. Close the lid or door and start the cycle. Try to wash the sauna suit with detergent at least once a week if you wear the suit frequently. If you can't find gentle laundry detergent, you can use regular laundry detergent."
    },
    {
      "title": "Hang dry the sauna suit.",
      "content": "Hang dry the sauna suit. Regardless of whether you washed the sauna suit with soap or just with water, you should hang it up while it's still wet. Let it dry on the hanger overnight or until it's totally dry. You can also hang the sauna suit on the clothes line in the sun, but check the manufacturer's instructions on your suit."
    }
  ]
}