{
  "url": "https://www.wikihow.com/Approach-a-Pisces-Man-After-a-Breakup",
  "title": "How to Approach a Pisces Man After a Breakup",
  "steps": [
    {
      "title": "A sensitive Pisces needs time for himself and hates being chased.",
      "content": "A sensitive Pisces needs time for himself and hates being chased. Right after the breakup, give him space from you so he can process his emotions. As a water sign, he also wants to feel untethered so he can go with the flow. Don’t contact him for at least a few days after the breakup, or longer if he asks for more time. [1] X Research source While you’re giving him space, spend time with your friends to help you take your mind off of the breakup."
    },
    {
      "title": "Because he’s emotional, a Pisces starts missing you after a few days.",
      "content": "Because he’s emotional, a Pisces starts missing you after a few days. Ask him how he’s been doing and tell him you’re thinking about him. Actively listen to what he has to say so he knows you truly care. Since he likes to talk things out, he’ll appreciate that you’re there for him. You might say, “I’ve been thinking about you. How have you been?” or “I really miss you. Can we talk?” If he asks for more space, say something like, “I totally understand. Just know that I care about you and I’m here if you change your mind.” Give him as long as he needs before reaching out again."
    },
    {
      "title": "Pisces don’t like being ignored.",
      "content": "Pisces don’t like being ignored. He’ll completely move on if you try to use the no contact rule on him. Pisces is the sign most likely to ghost you, so it’s important to keep your lines of communication open. Text him things like: “How’s your day going?” “Just wanted to say ‘Hi’!” “What are you up to?” Inside jokes. Memes. Pics of what you’re doing."
    },
    {
      "title": "A Pisces man wants someone who’s invested in his life.",
      "content": "A Pisces man wants someone who’s invested in his life. Show him you’re not ready to move on from him by staying connected. Mutual friendships are the easiest way to spend time with him, but you can also maintain ties online. Here are some ways you can stay in his life: Maintain mutual friendships. Like or comment on his social media posts. Show up at his favorite haunts. Arrange group hangouts with mutual friends. Ask him to stay friends."
    },
    {
      "title": "Sometimes a Pisces needs help realizing he made a mistake.",
      "content": "Sometimes a Pisces needs help realizing he made a mistake. Since they’re an emotional sign, Pisces tends to retain their feelings after a breakup. If he sees someone else pursuing you, it can make him realize he wants you back. Try hanging out with a mutual guy friend so he sees you with another man. You could also post a photo of you with another guy on social media. At the same time, you don’t want him to think you’re moving on to someone else. If he thinks he’s competing for your affection, he’ll totally ghost you. For this reason, don’t start going on actual dates—just stick to outings with friends."
    },
    {
      "title": "Although they’re romantic, Pisces are also fearful of commitment.",
      "content": "Although they’re romantic, Pisces are also fearful of commitment. They need reassurances from people they trust that they’re making the right decision. Encouragement from friends may be the trick to getting him to realize your breakup was a mistake. If you have mutual friends, talk to them to see if they’ll drop some hints to him. You could also try hanging out with his friends so they realize you’re a good match for him."
    },
    {
      "title": "Pisces are super nostalgic, and he’ll want those good times back.",
      "content": "Pisces are super nostalgic, and he’ll want those good times back. Tap into his sensitive side with memories of your time together. He’ll quickly slide down memory lane and wish he could have you back. Hopefully, he’ll be back in your arms in no time. Try this: Send him a photo of a happy memory with the caption, “Remember this?” Share memories on social media. While hanging out in a group, tell a funny story that happened while you were dating."
    },
    {
      "title": "A Pisces man loves to do things for people he cares about.",
      "content": "A Pisces man loves to do things for people he cares about. At his heart, he’s a helpful person, and he’ll want to be there for you in your time of need. Tell him you’re struggling with something you know he’s good at. He’ll be quick to step in and be there for you. You might ask him to help you assemble a piece of furniture, plan a surprise party for a friend, or choose a wine. Think about what he helped you with when you were together for inspiration."
    },
    {
      "title": "Pisces can’t handle criticism or aggressiveness.",
      "content": "Pisces can’t handle criticism or aggressiveness. They will run fast and far if they get any bad vibes from you. Win him back by reminding him of everything you love about him. Pointing out what went wrong or blaming him for the breakup will only push him farther away. Say things like: “You’re such a great listener.” “You always made me feel so special.” “You’re so creative.” Reader Poll: We asked 818 wikiHow readers who are Pisces, and 54% of them said that the compliment they’d most like to receive would be something sweet about their personality, like: “You have a great heart.” [Take Poll] So if you're looking to make things feel more positive with a compliment, try this proven Pisces favorite!"
    },
    {
      "title": "Pisces are a passive sign, so you’ll need to take the lead.",
      "content": "Pisces are a passive sign, so you’ll need to take the lead. Invite him to do something you both enjoy. Alternatively, suggest you try something new together as part of a fresh start. Just focus on reconnecting with him at first. You might even ask him to hang out as friends the first few times. Go with what feels right for both of you. You might ask him out to a concert, a museum, or a casual restaurant. You could also try going to a sports game or playing mini golf. If he seems open to it, you might suggest a romantic date, like dinner at a nice restaurant or a picnic on the beach."
    },
    {
      "title": "Pisces are looking for someone who feels like their dream match.",
      "content": "Pisces are looking for someone who feels like their dream match. He’s not going to settle for someone who doesn’t truly get who he is. Make him see that you’re the perfect partner for him by showing an interest in what he likes. [2] X Research source You could try: Sporting a t-shirt related to one of his interests. Picking up one of his hobbies. Attending a convention for something he likes. Signing up for a class he’s taking."
    },
    {
      "title": "Pisces love romance, so sweep him off his feet.",
      "content": "Pisces love romance , so sweep him off his feet. He’s the kind of guy who wants candlelight dinners and creative dates. He’ll be totally impressed if you send him a sweet card to let him know you still care about him. You could also try doing something special for him, like bringing him a sweet treat on his birthday or on a holiday. Think about what he likes. If he’s into music, you might send him a new playlist you made for him. Pisces are one of the most romantic signs, so he won’t be able to resist a bit of romance."
    },
    {
      "title": "A Pisces craves mutual independence so you can both be yourself.",
      "content": "A Pisces craves mutual independence so you can both be yourself. Although he’s a romantic, he also doesn’t want to feel trapped or locked down. Make a point of going out with your friends, working on your education or career, and pursuing your own hobbies. He’ll see that you’ve got your own life, which means he can have his. Since Pisces is a mutable sign, he’s very flexible and tends to shift and change. He needs someone who can go with the flow with him."
    },
    {
      "title": "Always a dreamer, Pisces can seem unrealistically optimistic at times.",
      "content": "Always a dreamer, Pisces can seem unrealistically optimistic at times. They’re ruled by Neptune, the planet of dreams, so they have a big imagination. It’s not enough to keep these aspirations to themselves. They want a partner who will dream with them. [3] X Research source Try: Asking him questions about his dreams to show you’re interested. Talking about how you could fit into his future. Telling him about your own dreams."
    },
    {
      "title": "Pisces are very sensitive, compassionate, and helpful.",
      "content": "Pisces are very sensitive, compassionate, and helpful. His heart will melt if you let down your walls and just tell him how you’re feeling. Be honest about missing him and wanting him back. He’s a great listener, and he’ll be quick to provide comfort and understanding. You could say: “Since we broke up, you’re all I can think about. I miss having fun with you and talking about our dreams for the future.” “You’re an amazing guy, and I don’t want to lose you. I really miss our long talks and your creative date ideas.”"
    },
    {
      "title": "A Pisces will want to fix issues that broke you up.",
      "content": "A Pisces will want to fix issues that broke you up. Since he’s a hopeless romantic, he dreams of a fairytale movie love. To win him back, you’ll need solutions to any problems you had in the past. Fortunately, he’s a helpful guy, so he’ll happily put in the work to make things better. Try saying things like: “I know we used to argue a lot, so I thought we could work on our communication skills.” “I’ve realized we spent too much time together in the past. I think it’s good that we’re both becoming more independent so we could have a healthier relationship if tried again.” “I feel really bad about what happened between us, so I’ve been working on myself.”"
    },
    {
      "title": "Pisces have a big imagination and love to get caught up in fantasies.",
      "content": "Pisces have a big imagination and love to get caught up in fantasies. Use this to your advantage by describing the wonderful future he could have with you. Encourage him to picture a happy life with you so he realizes your breakup was a mistake. Say something like: “I keep picturing us sharing a porch swing, watching the sunset like you always wanted.” “One day, we could get a beach house together and spend every evening walking along the shoreline.” “I imagine the two of us traveling the world together, seeing all the famous sites and learning from locals.”"
    }
  ]
}