{
  "url": "https://www.wikihow.com/Catch-All-the-Unowns-in-Pok%C3%A9mon-Diamond/Pearl/Platinum",
  "title": "How to Catch All the Unowns in Pokémon Diamond/Pearl/Platinum",
  "steps": [
    {
      "title": "Devote a PC box to Unowns only.",
      "content": "Devote a PC box to Unowns only. You'll have a lot of them soon."
    },
    {
      "title": "Have a chart of the Unown alphabet close by.",
      "content": "Have a chart of the Unown alphabet close by. Check these off one by one as you capture each letter."
    },
    {
      "title": "Fly to Solaceon Town and head to the Ruins.",
      "content": "Fly to Solaceon Town and head to the Ruins. To get there, go above the house above the Pokémon Center. From there, head right until you can't go any further. Jump over four of the ridges, go right again, and enter the Ruins."
    },
    {
      "title": "Understand the layout of the Ruins.",
      "content": "Understand the layout of the Ruins. There are seven levels to the Ruins. Each level contains a big room, two dead-ends, and a staircase to the next level. The first big room has no Unowns, the second has \"F\", third has \"R\", forth has \"I\", fifth has \"E\", sixth has \"N\", and seventh has \"D\". Needless to say, these particular letters will be the easiest to find. The dead-ends contain the rest of the alphabet. Check each individual dead-end four times each to quickly catch as many letters as possible."
    },
    {
      "title": "Use Repeat Balls instead of your other Poké Balls after catching five or more forms of Unown.",
      "content": "Use Repeat Balls instead of your other Poké Balls after catching five or more forms of Unown."
    },
    {
      "title": "Visit the Ruin Maniac once you've caught all the forms of Unown.",
      "content": "Visit the Ruin Maniac once you've caught all the forms of Unown. The tunnel will be finished, and there will be two more Unown to catch (! and ?). Once the tunnel is finished, it should connect to the ruins."
    },
    {
      "title": "Enjoy.",
      "content": "Enjoy."
    }
  ]
}