{
  "url": "https://www.wikihow.com/Catch-Feebas-in-Pok%C3%A9mon-Ruby,-Sapphire-and-Emerald",
  "title": "A Complete Walkthrough to Catching Feebas",
  "steps": [
    {
      "title": "Feebas can only be found in the river on Route 119.",
      "content": "Feebas can only be found in the river on Route 119. Feebas may look as ordinary and dopey as Magikarp (seriously, where doesn’t that Pokémon appear?), but Feebas doesn’t show up in nearly as many locations. In fact, Feebas only spawns in the river that flows down Route 119 (between Route 118 and Fortree City). Head over to that specific location to get started on your Feebas-hunting journey. [1] X Research source Make sure you have the Acro Bike equipped, which lets you travel along certain parts of Route 119. [2] X Research source You can pick it up from the Bike Shop in Mauville City. [3] X Research source"
    },
    {
      "title": "Old Rods, Good Rods, and Super Rods can all catch a Feebas.",
      "content": "Old Rods, Good Rods, and Super Rods can all catch a Feebas. Approach the edge of the river, or use your “Surf” ability to swim on top of the river directly. As you head toward the water, hit the A button on your device when the game prompts you to and start fishing. [4] X Research source Some people like using the Super Rod, since it only catches Carvanha and Feebas. Other players prefer using the Old Rod, since the Pokémon it hooks are typically easier to defeat. It’s all up to personal preference. Don’t have Surf yet? Make sure that you’ve beaten the Petalburg Gym Leader first. Afterwards, meet with Wally’s dad (who lives directly next to the Petalburg Gym) to get Surf. [5] X Research source"
    },
    {
      "title": "Feebas only spawns in 6 total water tiles on Route 119.",
      "content": "Feebas only spawns in 6 total water tiles on Route 119. Unfortunately, the tile locations are completely random for each individual game file, so there’s no way to instantly know which tiles Feebas will spawn in. Start surfing down the river and fishing each individual tile by pressing A . [6] X Research source Pro tip: Add a Pokémon with the “Suction Cups” or “Sticky Hold” ability to your party before you start fishing—this increases the chance of you getting a bite. [7] X Research source"
    },
    {
      "title": "Feebas has a 50% spawn rate, so it helps to check each tile more than once.",
      "content": "Feebas has a 50% spawn rate, so it helps to check each tile more than once. A Pokémon like Magikarp or Carvanha might pop up first (depending on the Rod you’re using), but that doesn’t mean Feebas isn’t there, too! Fish each tile multiple times so you can be totally certain that Feebas isn’t hanging around. [8] X Research source Some players prefer to only check each tile once before moving on. While this strategy is the definitely the quickest, there’s still a small chance that you might miss the tile(s) that Feebas spawns on."
    },
    {
      "title": "Inspect one section of the river at a time to maximize your search.",
      "content": "Inspect one section of the river at a time to maximize your search. Start at the top of the river, and move back and forth as you make your way south. Make sure to stop at every tile possible. Fishing the water in sections makes it easier to remember where you have and haven’t searched yet."
    },
    {
      "title": "Feebas has a very high catch rate, so you don’t need a special Poké Ball.",
      "content": "Feebas has a very high catch rate, so you don’t need a special Poké Ball. Once Feebas spawns, grab any type of Poké Ball and throw it. As hard as it is to find, Feebas is extremely easy to catch—you shouldn’t have any issues with this Pokémon trying to escape. [9] X Research source Statistically speaking, Pokémon catch rates are measured on a scale of 0 to 255 (with 0 being an extremely difficult catch rate and 255 being an extremely easy catch rate). [10] X Research source Feebas has a 255 rating, which is why it’s so easy to catch. [11] X Research source If you’d like to play it extra safe, you can try weakening the Feebas before you catch it. Keep in mind, though, that Feebas only spawns somewhere between level 20 and 25. If the Pokémon in your party is too strong, it might make the Feebas faint."
    },
    {
      "title": "Save yourself the trouble of having to catch Feebas later on.",
      "content": "Save yourself the trouble of having to catch Feebas later on. Thinking about getting multiple Milotics, or just want to have an extra Feebas on hand? Take some time to farm several Feebas from that specific tile before heading on your merry way. You can always head back later, but catching an extra one now might save you some time. The tile location should stay the same unless you visit the NPC standing outside of the town hall in Dewford and ask to change the trendy phrase. [12] X Research source Switching this phrase also causes the Feebas tiles to randomize again, so keep that in mind before you change anything! [13] X Research source"
    },
    {
      "title": "Cheat codes can save you some time if you’re playing on an emulator.",
      "content": "Cheat codes can save you some time if you’re playing on an emulator. If you feel like taking a little shortcut to getting your Feebas, you can use the cheat code system to generate Feebas for you to easily capture. You will need to enter a series of codes in order to make Feebas become the next Pokémon you encounter in the wild: [14] X Research source D8BAE4D9 4864DCE5 A86CDBA5 19BA49B3 (master code that needs to be activated first) B749822B CE9BFAC1 A86CDBA5 19BA49B3 ED8143BE E336103D"
    },
    {
      "title": "Feebas evolves when it levels up while having a 170 Beauty stat.",
      "content": "Feebas evolves when it levels up while having a 170 Beauty stat. Create some Poffins and/or Pokéblocks with blue Berries that have a dry flavor. Then, feed these to your Feebas to raise its Beauty stat. Once your Feebas has a Beauty stat of at least 170, battle with it and level it up—upon leveling up, it’ll transform into a Milotic. [15] X Research source Check the PokéNav on your device to see how your Feebas’s stats are looking. [16] X Research source"
    }
  ]
}