{
  "url": "https://www.wikihow.com/Avoid-Alcoholism",
  "title": "How to Avoid Alcoholism",
  "steps": [
    {
      "title": "Keep alcohol out of your house.",
      "content": "Keep alcohol out of your house. It's a lot easier for alcohol to become a daily, insidious habit if you always keep it within reach. If your liquor cabinet is always stocked, you can easily be tempted. If there is a half-drunk bottle of wine or a six-pack is chilling in the fridge, it's going to be tough to avoid drinking. The first step to avoiding alcoholism is to keep it out of your house when it's not serving an immediate social purpose. If you don't want to stop drinking but just cut back to a healthy amount, not surrounding yourself with it is a good place to start. Stock your kitchen with other tasty drinks you can substitute for alcohol when you want something comforting to drink. Tea, sparkling water, lemonade, root beer, and soda are better for you than alcohol. If you have a party and there's a lot of leftover alcohol, give it away to friends. If no one wants it, pour it down the drain. Don't get trapped into thinking you have to finish it because you don't want it to go to waste."
    },
    {
      "title": "Don't drink when you're feeling bad.",
      "content": "Don't drink when you're feeling bad. Drinking when you're bored, lonely, stressed, sad, or feeling any other negative emotion can lead to a dependency on alcohol. Since alcohol is a depressant, it can actually make things even worse. Try drinking only on social occasions, when everyone's having a good time and there's a reason to celebrate. Don't fall into the trap of making every day a day to celebrate. Make sure you save drinking for truly special occasions when someone has something worthy of celebration."
    },
    {
      "title": "Slow down your sipping.",
      "content": "Slow down your sipping. If you tend to guzzle your drinks, you'll be more likely to drink too much on any given evening. Slow yourself down by sipping your drinks slowly, taking more time to finish each drink. You can help this by ordering your drinks straight, so the taste of sweet mixers doesn't mask the alcohol and make you think you aren't drinking any. You should also drink a glass of water or a soft drink for every alcoholic drink you consume. Drinking water will help fill you up and keep you hydrated. You will be less likely to guzzle drinks if you are properly hydrated and feel fuller. Do not engage in beer drinking contests or any activity that involves chugging excessive amounts of alcohol in a short period of time."
    },
    {
      "title": "Stop going to bars as often.",
      "content": "Stop going to bars as often. Since the purpose of bars is to sell drinks, you're automatically going to feel pressured to buy one. The low lights, the smell of alcohol mixed with perfume and cologne, and the sexy vibe everyone's exuding present an atmosphere that may be hard to resist. Since the whole environment is geared towards drinking, it's best to avoid bars altogether when you're trying to cut back. If you're invited to a social function that takes place at a bar, like happy hour with your boss and coworkers, try ordering club soda or another nonalcoholic drink. If the place has a food menu, order yourself a treat so you'll still feel like you're indulging. When you do go to bars, choose places that have more going on than just drinking. Go to a place with pool tables or bocce ball, for example, so the focus isn't solely on how much alcohol you can keep down. You may find it easier to drink less when there are distractions."
    },
    {
      "title": "Do activities that don't involve drinking.",
      "content": "Do activities that don't involve drinking. People spend a lot of time in bars when they could be doing something more active. Suggest alternatives to your group of friends next time you have a get-together. You could play a pick-up sport, go for a walk or bike ride, go to a movie or play, or go to a music show or art opening. Choose a venue that doesn't sell alcohol or an activity that isn't conducive to drinking. This will not only make you cut back on your drinking, but it will also make you healthier overall by getting you more active."
    },
    {
      "title": "Hang out with people who don't drink.",
      "content": "Hang out with people who don't drink. Some people are going to insist on drinking, even when you invite them to activities outside the bar. They'll brown bag it at the movie theater or pack a flask to bring on your hike. If you're seriously trying to avoid alcohol, make plans with other people who are in the same boat. That way you won't be faced with the presence of alcohol every time you want to have a little fun. This may mean cutting people out of your life if it becomes a problem. If you really like the person that drinks all the time, learn to say no instead when they are around. Just because he is drinking doesn't mean you have to. Maybe they will pick up on your attempts to cut back and do the same."
    },
    {
      "title": "Take up exercising.",
      "content": "Take up exercising. Exercising is a great way to help yourself kick an alcohol habit. Drinking makes a lot of people feel slow and sluggish, and it can also lead to bloating and weight gain. [1] X Research source If you make it a goal to be physically fit, you'll soon get frustrated with alcohol's effect on your progress. Try signing up for a 5K or joining a community soccer or basketball team. You'll soon find yourself passing on alcohol the night before you need to be at your physical best. Along with exercise, make sure you're eating well, getting sleep, and generally taking care of yourself so you'll be less prone to drinking."
    },
    {
      "title": "Recognize withdrawal symptoms.",
      "content": "Recognize withdrawal symptoms. If you cut back significantly on your alcohol consumption, you may start to experience some withdrawal symptoms. There are both physical and mental withdrawal symptoms that you might experience. Withdrawal causes trembling hands, irritability, shaky and tired feelings, difficulty sleeping, poor concentration, and bad dreams. If you were a heavy drinker, you may experience some additional symptoms, such as sweating, nausea, headache, lack of appetite, vomiting, and palpitations. [2] X Research source"
    },
    {
      "title": "Decide how much is too much.",
      "content": "Decide how much is too much. Avoiding alcoholism is more difficult for some people than it is for others. Some are able to drink on a daily basis without negative repercussions. For many, daily drinking increases tolerance to the point where it's difficult to have just one, which can lead to heavy drinking and eventually alcoholism. You should also try to stay within the moderate daily drinking range. According to the USDA, moderate drinking is defined as up to 1 drink per day for women and up to 2 drinks per day for men. Frequently going over this, especially for a sustained period of time, puts you at greater risk for alcoholism. [3] X Research source Keep in mind that more than 7 drinks per week for women and 14 drinks per week for men is considered heavy drinking. Try to stay well below this limit. Having a family history of alcoholism, mixing alcohol with medication, and having depression can all put you at greater risk for developing a dependency. [4] X Research source"
    },
    {
      "title": "Write down your commitment.",
      "content": "Write down your commitment. If you've decided that 3 drinks a week is your max, write it down: \"I will not drink more than 3 drinks a week.\" Make a commitment to yourself to stick to what you wrote down. Place the piece of paper on your mirror or in your wallet so you have a daily reminder that you've resolved to cut back or quit. You can also write down the reason you want to cut back, such as: \"I want to be healthier.\" or \"I want to stop alienating my family and friends.\" It's not going to be easy, but putting your promise to paper can help."
    },
    {
      "title": "Keep track of how much you drink.",
      "content": "Keep track of how much you drink. One of the best ways to understand how much you drink is to keep track of each one. You can carry a drink tracker card that you use to note each drink you have a week. You can also note it on a calendar or notepad around your house. If you drink a lot while you are out, you can use a notepad or app on your phone to keep track of how much you drink. Review it each week. You may be surprised once you see it written in one place. Being accountable for each drink can help you be more conscious about how much you drink and help you cut back. If you find that you drink a lot more than you expected, you can create a journal and log every time you have a drink. You should also write about why you decided to drink, what feelings you experienced before taking a drink, and how you felt afterward. This will help you look for patterns in your emotions. Write down your triggers and situations that make it extremely difficult for you to avoid drinking. As the weeks progress, you should start learning what to avoid."
    },
    {
      "title": "Take an alcohol break from time to time.",
      "content": "Take an alcohol break from time to time. Determine to stop drinking alcohol for a week or two. This will give your system a break and free you from your regular routine for a while. You can also do it in smaller doses and choose at least two days a week not to drink. For example, if you've been in the habit of drinking a glass of wine every night, taking a break will change things up so you'll no longer feel you need that daily glass. If you are a heavy drinker, this can cause withdrawal symptoms. Pay close attention to how you feel and the way your body reacts to the change. If you have serious reactions to this step, see your doctor as soon as you can."
    },
    {
      "title": "Monitor your progress.",
      "content": "Monitor your progress. Throughout the process of cutting back, take notes on your progress from week to week. Assess if you think you have control of your drinking habits, if you have been successful in cutting back your consumption to the amount to which you committed, and if you are able to cope with your urges and alcohol cravings. If you feel that your drinking is out of hand, even though you've made a serious effort to nip it in the bud on your own, it might be time to seek outside help. If you can't limit your consumption to a low level without feeling withdrawal, you can't say no to a drink, you have blackouts, or you experience other signs of alcoholism, you should seek help right away."
    },
    {
      "title": "Recognize that you need support.",
      "content": "Recognize that you need support. You need to seek help immediately if you determine that your drinking is out of control. If you experience certain problems, you may be abusing alcohol, which puts you at great risk for developing alcoholism. You are at risk if you can't have a drink without eventually drinking more and getting drunk or you use alcohol while driving or operating machinery, even though you know that using alcohol in this way is illegal and extremely dangerous. If you have morning and evening cravings, develop irritability, have mood swings, drink alone or in secret, chug drinks, are depressed, or experience shakiness, you should seek immediate help. You should also seek help if you neglect your responsibilities due to drinking. You could be neglecting them either because you're busy drinking or because you have hangovers that prevent you from going to work or school. [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You are at risk if you've gotten in legal trouble because of your drinking, such as being arrested for public intoxication, getting into a fight while drunk, or getting a DUI. You should be concerned if you keep drinking even though people in your life have expressed concern. When your drinking has gotten problematic enough that other people notice, you should seek help. You should not use drinking as a coping mechanism. It is extremely unhealthy to use alcohol as a way to cope with stress, depression, and other problems. If you tend to do so, you should seek help. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Look into Alcoholics Anonymous (AA) meetings.",
      "content": "Look into Alcoholics Anonymous (AA) meetings. Going through a 12-step program, such as those facilitated by AA, has helped many people who abuse alcohol find a way to cope. [7] X Research source Even if you don't think you're a full-blown alcoholic, going through the program can help you prevent your problem from getting worse. You'll attend meetings and get an AA sponsor who you can call when you're experiencing cravings or losing your way. You may learn that you cannot drink safely anymore, and it will be important for you to have a support system in place to help you deal with that reality and help you eliminate all alcohol and negative influences from your life. You can search online to find a nearby AA support group in your area. AA is a faith-based organization, so only try this method if you are comfortable with this. They use religious passages and messages to help guide recovery and rely on sponsors and group meetings to back up their teachings. [8] X Research source"
    },
    {
      "title": "Try the SMART Recovery.",
      "content": "Try the SMART Recovery. If you are not interested in AA, you can try SMART Recovery. It is a program that uses cognitive-behavioral approaches to pinpoint emotional and environmental factors that have led to your addiction and help you respond to them in new, productive ways. It focuses on recovering from your addiction without thinking it is a disease. This is an abstinence-based program, meaning that they teach the complete removal of all alcohol from your life. Despite this, SMART Recovery welcomes those who are ambivalent about quitting drinking. [9] X Research source This program is for those who do not need too much structure and who can be personally motivated to quit drinking. Cognitive-behavioral approaches rely on self-actualization instead of group or sponsor related help like AA. This program relies heavily on your own motivation and participation. [10] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source"
    },
    {
      "title": "Go to a secular-based recovery program.",
      "content": "Go to a secular-based recovery program. If you are not interested in faith-based 12 step programs like AA, there are some other alternatives you can try. Secular Organizations for Sobriety (SOS) is a non-structured program that has guidelines for sobriety that focus on you taking responsibility for your drinking habit and making sure members do not drink at all. It is an abstinence-based approach like AA and SMART Recovery. You can also use programs like LifeRing Secular Recovery (LSR), which is a secular organization that upholds three tenets, sobriety, secularity, and self-help. They believe that inner motivation is the best way to stay abstinent from alcohol and have group meetings for encouragement and help when your self-motivation is lacking. This is similar to AA in that they have group sessions, but their beliefs are not steeped in Christianity. [11] X Research source For more information about support groups that might be right for you, go to Faces and Voices Recovery's Directory of support groups. They have options for support groups based on gender, religion, type of addiction, and age. They also provide listings of groups that meet in person, provide medical assistance, meet online, are friend and family-focused, and that are 12 steps."
    },
    {
      "title": "Start seeing a therapist.",
      "content": "Start seeing a therapist. Having individual attention from a therapist is also a good idea when you are struggling with a drinking problem. Your drinking might stem from deeper issues that you need to address before you're able to stop. If you're drinking due to trauma, extreme stress, mental illness, or another reason that a therapist could address, then getting this kind of one-on-one help will be essential to recovery. A therapist can also help you if you are worried about social pressures to drink, don't know how to avoid triggers, or have guilt over any relapse. She can help you get over the guilt of these situations and help you get stronger in your recovery."
    },
    {
      "title": "Seek support from loved ones and friends.",
      "content": "Seek support from loved ones and friends. Giving up alcohol is extremely difficult to go through alone. Tell your loved ones and friends that you're getting help to stop drinking. Ask them to support you on your journey by not inviting you to bars or giving you alcohol. This will help you be more accountable for your choices because you will have more people looking out for you. [12] X Research source Ask if you can do activities together that don't involve drinking."
    }
  ]
}