{
  "url": "https://www.wikihow.com/Become-a-Concert-Promoter",
  "title": "How to Become a Concert Promoter",
  "steps": [
    {
      "title": "Get a job with an employer involved in organizing concerts.",
      "content": "Get a job with an employer involved in organizing concerts. This could be a concert promoter, a talent agency, a band manager, or a concert hall."
    },
    {
      "title": "Gain experience with the day-to-day logistics of putting on a concert.",
      "content": "Gain experience with the day-to-day logistics of putting on a concert. You will need to learn how a band is contacted and signed for a show, how concert venues are booked and rented, what goes into marketing a show, and how to hire staff for the night of the event. [2] X Research source Learn everything you can about the financial side of promoting concerts, from artists' fees to ticket receipts to the percentage that a concert promoter or venue takes."
    },
    {
      "title": "Make connections with artists, their management, and with local music business professionals.",
      "content": "Make connections with artists, their management, and with local music business professionals. If you plan on promoting concerts of a certain type of music, meet as many performers and managers in that field as possible. Focus on the city or region in which you want to work: get to know the owners and managers of concert venues, talent agents, record label representatives, and radio station managers."
    },
    {
      "title": "Learn how to market a show.",
      "content": "Learn how to market a show. Depending on the size of the concert and the act performing, you will need to use a variety of marketing strategies, such as posting flyers, buying radio advertisements, hosting ticket giveaways, and using social networks. [3] X Research source"
    },
    {
      "title": "Get to know sound technicians, security professionals, and other people in the area who can work as ushers and concession staff at concerts.",
      "content": "Get to know sound technicians, security professionals, and other people in the area who can work as ushers and concession staff at concerts. [4] X Research source Because you need to hire many one-night employees for putting on a concert, it is a good idea to have an idea of your labor pool. In some cases, you may need to hire these people at the last minute."
    },
    {
      "title": "Seek out a position as a concert promoter for one or more concert venues.",
      "content": "Seek out a position as a concert promoter for one or more concert venues. In addition to working on their own, many promoters hold an official position with a concert hall or stadium. Having such a position means that you do not have to worry about booking your own venues; however, your profit margin will be less."
    },
    {
      "title": "Begin promoting your own shows by starting small.",
      "content": "Begin promoting your own shows by starting small. Put on shows by acts you have already worked with, and keep the logistics to a minimum."
    },
    {
      "title": "Develop a larger base of support as you begin to put on larger and more frequent shows.",
      "content": "Develop a larger base of support as you begin to put on larger and more frequent shows. As your business grows, you can start to draw up standardized contracts and maintain a more stable revenue flow."
    }
  ]
}