{
  "url": "https://www.wikihow.com/Check-Starbucks-Gift-Card-Balance-on-PC-or-Mac",
  "title": "How to Check Your Starbucks Gift Card Balance Online: Simple Steps",
  "steps": [
    {
      "title": "Visit Starbucks’ Gift Card page in a web browser.",
      "content": "Visit Starbucks’ Gift Card page in a web browser. Go to https://www.starbucks.com/gift to access your gift card balance. [1] X Research source You can use any web browser on your PC, Mac, Chromebook, or even your phone or tablet's web browser."
    },
    {
      "title": "Hit the Check balance button at the bottom of the page.",
      "content": "Hit the Check balance button at the bottom of the page. Under the “Gift cards” section, there is a light green banner with the title “Received a gift card?” Choose the Check balance button on the banner to access your gift card balance. The Check balance button is on the right side of the “Add or Reload” button."
    },
    {
      "title": "Enter the card number and the security code.",
      "content": "Enter the card number and the security code. In the text box labeled “Card number,” type the 16-digit card number on the back of your Starbucks gift card, without any spaces or dashes. Then, type the 8-digit security code in the “Security code” text box. [2] X Research source"
    },
    {
      "title": "Click the Check balance button to check your balance.",
      "content": "Click the Check balance button to check your balance. Double-check that the numbers are correct before clicking the button. Once you submit the information, the site will display the remaining balance on your card. [3] X Research source If there’s an error, go back and carefully re-enter the numbers. It's possible that you entered something incorrectly. If you still can't check your balance, call the toll-free number on the back of your card, or talk to a customer service agent by clicking the Chat with us button at the bottom of the Starbucks Customer Service page ."
    },
    {
      "title": "Open the Starbucks mobile app on your Android, iPhone, or iPad.",
      "content": "Open the Starbucks mobile app on your Android, iPhone, or iPad. If you use the Starbucks mobile app on your phone or tablet, you can easily check your gift card balance from the app itself."
    },
    {
      "title": "Tap your profile icon.",
      "content": "Tap your profile icon. You'll see it at the top-right corner of the Starbucks app."
    },
    {
      "title": "Tap Starbucks Cards & payment.",
      "content": "Tap Starbucks Cards & payment . This is near the top of the menu."
    },
    {
      "title": "View and reload your Starbucks gift cards.",
      "content": "View and reload your Starbucks gift cards. If you have an existing Starbucks gift card, you'll see the balance here. If you need to check the balance of a physical Starbucks gift card, tap Got a gift card? Add it here at the top, enter the card number and security code, then tap Add card ."
    },
    {
      "title": "Sign into your Starbucks account to view your Star balance.",
      "content": "Sign into your Starbucks account to view your Star balance. Go to the Starbucks Rewards page and enter your username or email address, followed by your password. Once you’ve successfully logged in, you’ll be redirected to another page where you can see your Star balance and other rewards. Alternatively, open the Starbucks app , and log into your account to view your Star balance and other rewards on a mobile device."
    },
    {
      "title": "You can buy a gift card at any Starbucks store, or buy an eGift card online.",
      "content": "You can buy a gift card at any Starbucks store, or buy an eGift card online. Visit your local Starbucks to purchase a physical gift card, or visit their Gift Card website to buy an eGift card. Alternatively, check out third-party stores and sites, such as Target, Walgreens, CVS, or Amazon , to buy a gift card. You can gift any amount between $5-100. If you purchase an eGift card, you need to provide the recipient’s email address."
    },
    {
      "title": "Sign into your Starbucks account to report your card as lost or stolen.",
      "content": "Sign into your Starbucks account to report your card as lost or stolen. If you registered your Starbucks card, visit the Gift Card website , and perform the following steps: Enter your username or email address and your password to access your account. Click the Account button in the upper right-hand corner of the screen. Click the Card management button. On the following page, hit the Manage button next to your lost or stolen card. Click Report lost or stolen . This will freeze your remaining balance and transfer it to another digital card on your account. [4] X Research source Keep in mind that Starbucks does not replace physical cards, including specialty or limited edition cards. They also cannot replace unregistered gift cards."
    },
    {
      "title": "Reload your card by visiting a participating store, on the web, or using the Starbucks app.",
      "content": "Reload your card by visiting a participating store, on the web, or using the Starbucks app. To reload your card in person, visit your local Starbucks and ask an associate for help at checkout. To reload your card on the web: Log into your Starbucks account on the Card page . Click the Add or Reload button under the “Received a gift card?” banner. Hit the Manage button next to the card you want to reload. Click Add money on the bottom right-hand corner of the screen. Enter the amount and your card information to reload your card. [5] X Research source To reload your card on the Starbucks app: Click the Scan button at the bottom of the home page. Press the Add funds button under the card you want to reload. Fill out the amount, choose your payment method, then click Add $ at the bottom right-hand corner of the screen."
    },
    {
      "title": "Do Starbucks gift cards expire?",
      "content": "Do Starbucks gift cards expire? No, Starbucks gift cards do not expire. According to Starbucks’ Card Terms and Conditions, there is no expiration date on gift cards, and the value never expires. The company does not charge any activation, service, dormancy, or inactivity fees either. [6] X Research source"
    },
    {
      "title": "Where can I use my Starbucks gift card?",
      "content": "Where can I use my Starbucks gift card? If you buy a card in the United States, you can use it in Starbucks stores in Canada, England, Scotland, Wales, the Republic of Ireland, Mexico, and Australia. [7] X Research source You can’t use a Starbucks gift card in some airport, grocery, and bookstore locations. For instance, you can use your card at most Target Starbucks locations, but not at Barnes & Noble. Visit the Store Locator page and click on a specific location to see if it accepts gift cards."
    },
    {
      "title": "How can I get free Starbucks gift cards?",
      "content": "How can I get free Starbucks gift cards? You can sign up for online reward programs, such as Survey Junkie , Ibotta , and Shopkick , to earn free gift cards. All you have to do is complete tasks like taking surveys, watching videos, or shopping online to earn points toward a free card."
    }
  ]
}