{
  "url": "https://www.wikihow.com/Acclimate-Your-Betta",
  "title": "How to Acclimate Your Betta",
  "steps": [
    {
      "title": "Choose a tank for your betta.",
      "content": "Choose a tank for your betta. In their natural habitat, bettas live in murky, stagnant water. Although they can survive in very small, cramped tanks, it’s healthier for the fish to give it a larger environment. Look for a tank that is holds around five gallons of water, as this will give the fish plenty of space. Do not keep your betta in a tank smaller than 2.5 gallons. [1] X Research source Since betta fish breathe air directly from the top of the water, your tank does not need a filtration system. In fact, it’s better if the tank doesn’t have one—the current created by the filtration is stressful to bettas."
    },
    {
      "title": "Prepare the tank",
      "content": "Prepare the tank . Wash the fish tank thoroughly and then rinse the gravel carefully in hot tap water. Do not use soap or detergent on the gravel. Then layer the gravel carefully at the bottom of the tank. Rinse any decorations and put them into the tank. [2] X Research source The tank does not necessarily have to be a traditional fish tank; any large container will do. It’s important that you include gravel in the fish tank. Opt for a neutral color, and for relatively small-grained gravel. The neutral color will calm your betta, and bacteria that build up on the gravel will digest your fish’s waste and keep the water relatively clean."
    },
    {
      "title": "Fill up the tank with tap water.",
      "content": "Fill up the tank with tap water. Do not use mineral water in the tank, since it lacks important minerals that your betta fish will need. It’s important that, when filled with tap water, your fish tank will have plenty of surface area at the top. Betta fish do breathe underwater like most fish, but come up to the surface for an extra gulp of air at times. For this reason, a narrow-topped container like a wine bottle does not make a suitable tank for a betta."
    },
    {
      "title": "Purchase a water conditioner.",
      "content": "Purchase a water conditioner. A conditioner will remove chlorine (which is unhealthy for fish) from your tap water, and also filter out other impurities and heavy metals. Follow the instructions on the conditioner bottle, and remember to add this as you fill the tank with water. You’ll also need to add conditioner every time you change the water in the fish tank (roughly once a week). [3] X Research source If you bought your betta at a pet store, you should have received a water conditioner specifically made for bettas. If you were not given one, you’ll need to purchase a conditioner on your own. Conditioners should be available at any pet store, and can also be easily purchased online. The amount of conditioner that you use will vary based on the size of your fish tank. Follow the directions on the bottle regarding the amount of conditioner to use, and the amount of time to let it mix in the water before it’s safe for your fish. If you live in a rural area where the tap water is not chlorinated, you may not need to use a conditioner. Some conditioners get rid of heavy metals though, so you can use it if you need."
    },
    {
      "title": "Float the bag at the top of the fish tank.",
      "content": "Float the bag at the top of the fish tank. Before you do this, make sure the bag has enough air so the betta can breathe. Letting the bag float at the top of the betta’s new tank will allow the water in the bag (with the betta in it) to match the temperature of the water in the tank. This process is known as “floating” the betta. Let the bag sit in the tank for 15-30 minutes. [4] X Expert Source Craig Morton Fish & Aquarium Specialist Expert Interview. 21 July 2020."
    },
    {
      "title": "Mix the water from the tank with the water in the bag.",
      "content": "Mix the water from the tank with the water in the bag. Once the bag has floated in the fish tank for about 15 minutes, you can start to expose your betta to the water in the fish tank. Use scissors to cut a hole in the bag. Using a baster or a small cup, pour about a cup of the tank water into the bag. You’ll need to stand there and hold the bag upright during this time. If you release the bag or let it tilt too far to one side or the other, the water will spill out into the tank."
    },
    {
      "title": "Let the water sit for 15 minutes.",
      "content": "Let the water sit for 15 minutes. Your betta needs this time to slowly adjust to the temperature, pH level, and mineral hardness of the water in the tank. If you rush these steps and do not give your betta time to acclimate to the water, it will be harmful to the fish’s health. [5] X Research source Repeat the step one more time: mix another cup of tank water into the bag with the betta. Continue to hold the bag in the tank during this time. Make sure to keep the cut in the bag facing upright."
    },
    {
      "title": "Release the betta into the fish tank.",
      "content": "Release the betta into the fish tank. After acclimating the fish for roughly 30 minutes, take the bag, turn it sideways, and allow the betta to swim out. Your betta may take some time to get used its new surroundings, but it should be comfortable living in the water of its new tank at this point. Avoid adding the water from the bag to the tank. [6] X Expert Source Craig Morton Fish & Aquarium Specialist Expert Interview. 21 July 2020. After the fish has been acclimated, you can also take an aquarium net and gently place your betta in the tank. Do not feed your betta right away. The fish will probably not eat for the first day it’s in a new tank. Some bettas will refuse to eat for the first three days, sometimes even a week."
    },
    {
      "title": "Float the cup containing your betta at the top of its new fish tank.",
      "content": "Float the cup containing your betta at the top of its new fish tank. At this stage, you want your betta to get used to the water and its temperature. A sudden exposure to the (probably colder) water of the fish tank would be harmful to your betta. Let the cup float for about 15 minutes."
    },
    {
      "title": "Pour some of the tank water into the cup.",
      "content": "Pour some of the tank water into the cup. Do this slowly, using a baster or a small cup. Do not pour the tank water directly onto the betta; pour the water off to the side of the fish. At this point, the cup should still be floating in the fish-tank water. The betta needs to get used to some of the tank water, as it will have a different mineral hardness and pH level, in addition to a different temperature. Leave this to sit for 15 minutes."
    },
    {
      "title": "Add a little bit more of the tank water.",
      "content": "Add a little bit more of the tank water. You want the tank water and water from the cup to be very well mixed—almost at a 1:1 ratio—before you place the betta fish in the tank. Again, wait for 15 more minutes. [7] X Research source At this point, you can use your fingers to feel the temperature of the fish-tank water and the cup water. They should be roughly the same temperature."
    },
    {
      "title": "Transfer your betta from the cup to the fish tank.",
      "content": "Transfer your betta from the cup to the fish tank. Using an aquarium net, gently take your betta out of its cup and move it into its new tank. Be gentle, as you do not want to poke or harm your new fish. If the water in the betta’s cup is relatively clean of excrement and silt, you can pour the fish and its water directly into the tank."
    }
  ]
}