{
  "url": "https://www.wikihow.com/Convert-MPG-to-Liters-per-100km",
  "title": "How to Convert MPG to Liters per 100km",
  "steps": [
    {
      "title": "Determine which type of gallon you are converting from.",
      "content": "Determine which type of gallon you are converting from. Gallons can be imperial or US. Imperial gallons are used in the UK, and US gallons are used in the US. Since these two types of gallons are not the same, the conversion formula will be different depending on which type of gallon you are converting from. If the problem does not specify which type of gallon, and you are a student in the United States, it is probably safe to assume that you are converting from US gallons. Outside of the United States, it is probably safe to assume that you are converting from the imperial gallon."
    },
    {
      "title": "Set up the formula for converting from miles per imperial gallons.",
      "content": "Set up the formula for converting from miles per imperial gallons. The formula is L / 100 km = 282.48 x mpg {\\displaystyle L/100{\\text{km}}={\\frac {282.48}{x\\;{\\text{mpg}}}}} . [1] X Research source Substitute the number of miles per gallon into the formula, then divide. The quotient will give you the equivalent number of liters per 100 km. For example, if you are converting 24 miles per imperial gallon to liters per 100 km, you would calculate: L / 100 km = 282.48 24 {\\displaystyle L/100{\\text{km}}={\\frac {282.48}{24}}} L / 100 km = 11.77 {\\displaystyle L/100{\\text{km}}=11.77} So, 24 MPG (imperial) is equal to 11.77 L/100km."
    },
    {
      "title": "Set up the formula for converting from miles per US gallon.",
      "content": "Set up the formula for converting from miles per US gallon. The formula is L / 100 km = 235.21 x mpg {\\displaystyle L/100{\\text{km}}={\\frac {235.21}{x\\;{\\text{mpg}}}}} . [2] X Research source Plug the number of miles per gallon into the formula. Divide the MPG into 235.21. The result will be the converted number of liters per 100 km. For example, if you are converting 24 miles per US gallon to liters per 100 km, you would calculate: L / 100 km = 235.21 24 {\\displaystyle L/100{\\text{km}}={\\frac {235.21}{24}}} L / 100 km = 9.8 {\\displaystyle L/100{\\text{km}}=9.8} So, 24 MPG (US) is equal to 9.8 L/100km."
    },
    {
      "title": "Determine whether you are working with imperial or US gallons.",
      "content": "Determine whether you are working with imperial or US gallons. These two types of gallons are not the same size, and thus the numbers you use in your ratios will be different depending on which type you are working with. 1 imperial gallon is equal to 4.55 liters. [3] X Research source 1 U.S. gallon is equal to 3.79 liters. [4] X Research source"
    },
    {
      "title": "Set up a ratio for converting miles per gallon to kilometers per gallon.",
      "content": "Set up a ratio for converting miles per gallon to kilometers per gallon. There are 1.609 kilometers in a mile, so your ratio will look like this: x mi 1 gallon × 1.609 km 1 mi {\\displaystyle {\\frac {x\\;{\\text{mi}}}{1{\\text{gallon}}}}\\times {\\frac {1.609{\\text{km}}}{1{\\text{mi}}}}} . Multiply the number of miles times 1.609 to find out how many kilometers per gallon. [5] X Research source For example, to convert 24 MPG, you would calculate: 24 mi 1 gallon × 1.609 km 1 mi = 38.616 km 1 gallon {\\displaystyle {\\frac {24{\\text{mi}}}{1{\\text{gallon}}}}\\times {\\frac {1.609{\\text{km}}}{1{\\text{mi}}}}={\\frac {38.616{\\text{km}}}{1{\\text{gallon}}}}}"
    },
    {
      "title": "Set up a ratio converting kilometers per gallon to kilometers per liter.",
      "content": "Set up a ratio converting kilometers per gallon to kilometers per liter. Your ratio will look different, depending on whether you are working with imperial or US gallons. Since we want to find liters per 100 km, you need to take the reciprocal of your final ratio so that the liters value is in the numerator. [6] X Research source If you are working with imperial gallons, you will calculate: 38.616 km 1 gallon × 1 gallon 4.55 liters = 38.616 km 4.55 liters {\\displaystyle {\\frac {38.616{\\text{km}}}{1{\\text{gallon}}}}\\times {\\frac {1{\\text{gallon}}}{4.55{\\text{liters}}}}={\\frac {38.616{\\text{km}}}{4.55{\\text{liters}}}}} . Taking the reciprocal, you have 4.55 liters 38.616 km {\\displaystyle {\\frac {4.55{\\text{liters}}}{38.616{\\text{km}}}}} . If you are working with US gallons, you will calculate: 38.616 km 1 gallon × 1 gallon 3.79 liters = 38.616 km 3.79 liters {\\displaystyle {\\frac {38.616{\\text{km}}}{1{\\text{gallon}}}}\\times {\\frac {1{\\text{gallon}}}{3.79{\\text{liters}}}}={\\frac {38.616{\\text{km}}}{3.79{\\text{liters}}}}} .Taking the reciprocal, you have 3.79 liters 38.616 km {\\displaystyle {\\frac {3.79{\\text{liters}}}{38.616{\\text{km}}}}} ."
    },
    {
      "title": "Calculate the rate of liters per 1 kilometer.",
      "content": "Calculate the rate of liters per 1 kilometer. To do this you need to get the number of kilometers in the ratio to 1 by dividing. Divide the numerator and the denominator of the ratio by the number of kilometers. You can also think of it as dividing the numerator by the denominator. For example, for imperial gallons, you would calculate 4.55 liters 38.616 km = .118 liters per km {\\displaystyle {\\frac {4.55{\\text{liters}}}{38.616{\\text{km}}}}=.118\\;{\\text{liters per km}}} . For US gallons, you would calculate 3.79 liters 38.616 km = .098 liters per km {\\displaystyle {\\frac {3.79{\\text{liters}}}{38.616{\\text{km}}}}=.098\\;{\\text{liters per km}}} ."
    },
    {
      "title": "Calculate the rate of liters per 100 kilometers.",
      "content": "Calculate the rate of liters per 100 kilometers. To do this, multiply the rate of liters per km by 100. [7] X Research source You can do this easily in your head by moving the decimal point two places to the right. For example, if the rate in imperial gallons is .118 liters per km {\\displaystyle .118\\;{\\text{liters per km}}} , to calculate liters per 100 km, multiply .118 × 100 = 11.8 liters per 100 km {\\displaystyle .118\\times 100=11.8\\;{\\text{liters per 100 km}}} . If the rate in US gallons is .098 liters per km {\\displaystyle .098\\;{\\text{liters per km}}} , to calculate liters per 100 km, multiply .098 × 100 = 9.8 liters per 100 km {\\displaystyle .098\\times 100=9.8\\;{\\text{liters per 100 km}}} ."
    },
    {
      "title": "Convert to miles per imperial gallon using a conversion formula.",
      "content": "Convert to miles per imperial gallon using a conversion formula. The formula is mpg = 282.48 x L / 100 km {\\displaystyle {\\text{mpg}}={\\frac {282.48}{x\\;L/100{\\text{km}}}}} . [8] X Research source To find the miles per gallon, divide the number of liters per 100 km into 282.48. For example, if calculating 20 L/100 km to mpg, you would calculate: mpg = 282.48 20 {\\displaystyle {\\text{mpg}}={\\frac {282.48}{20}}} mpg = 14.124 {\\displaystyle {\\text{mpg}}=14.124} ."
    },
    {
      "title": "Convert to miles per US gallon using a conversion formula.",
      "content": "Convert to miles per US gallon using a conversion formula. The formula is mpg = 235.21 x L / 100 km {\\displaystyle {\\text{mpg}}={\\frac {235.21}{x\\;L/100{\\text{km}}}}} . [9] X Research source To find the miles per gallon, divide the number of liters per 100 km into 235.21. For example, if calculating 20 L/100 km to mpg, you would calculate: mpg = 235.21 20 {\\displaystyle {\\text{mpg}}={\\frac {235.21}{20}}} mpg = 11.76 {\\displaystyle {\\text{mpg}}=11.76} ."
    },
    {
      "title": "Convert to miles per imperial gallon using a ratio.",
      "content": "Convert to miles per imperial gallon using a ratio. Set up the ratio mpg = x liters 100 km {\\displaystyle {\\text{mpg}}={\\frac {x\\;{\\text{liters}}}{100{\\text{km}}}}} . Then complete the necessary calculations to convert to miles per imperial gallon. First, convert the number of liters per 100 km to the number of liters per 1 km. If you were converting 20 liters per 100 km, you would first calculate 20 liters 100 km = .20 liters 1 km {\\displaystyle {\\frac {20{\\text{liters}}}{100{\\text{km}}}}={\\frac {.20{\\text{liters}}}{1{\\text{km}}}}} . Second, convert liters per kilometer to liters per miles. There are .62 miles in one kilometer. [10] X Research source So, to convert, you would calculate .20 liters 1 km × 1 km .62 mi = .20 liters .62 mi {\\displaystyle {\\frac {.20{\\text{liters}}}{1{\\text{km}}}}\\times {\\frac {1{\\text{km}}}{.62{\\text{mi}}}}={\\frac {.20{\\text{liters}}}{.62{\\text{mi}}}}} . Third, convert the number of liters to the number of imperial gallons. There are .22 imperial gallons in a liter. [11] X Research source To convert, you would calculate .20 liters .62 mi × .22 gallons 1 liters = .044 gallons .62 mi {\\displaystyle {\\frac {.20{\\text{liters}}}{.62{\\text{mi}}}}\\times {\\frac {.22{\\text{gallons}}}{1{\\text{liters}}}}={\\frac {.044{\\text{gallons}}}{.62{\\text{mi}}}}} . Fourth, since you want to find miles per gallon, take the reciprocal of the fraction: .62 mi .044 gallons {\\displaystyle {\\frac {.62{\\text{mi}}}{.044{\\text{gallons}}}}} . Last, find the number of miles per gallon by dividing the numerator and the denominator by the number of gallons: .62 mi .044 gallons = 14.1 mpg {\\displaystyle {\\frac {.62{\\text{mi}}}{.044{\\text{gallons}}}}=14.1\\;{\\text{mpg}}} ."
    },
    {
      "title": "Convert to miles per US gallon using a ratio.",
      "content": "Convert to miles per US gallon using a ratio. Set up the ratio x liters 100 km {\\displaystyle {\\frac {x\\;{\\text{liters}}}{100{\\text{km}}}}} . Then complete the necessary calculations to convert to miles per US gallon. First convert the number of liters per 100 km to the number of liters per 1 km. If you were converting 20 liters per 100 km, you would first calculate 20 liters 100 km = .20 liters 1 km {\\displaystyle {\\frac {20{\\text{liters}}}{100{\\text{km}}}}={\\frac {.20{\\text{liters}}}{1{\\text{km}}}}} . Second, convert liters per kilometer to liters per miles. There are .62 miles in one kilometer. [12] X Research source So, to convert, you would calculate .20 liters 1 km × 1 km .62 mi = .20 liters .62 mi {\\displaystyle {\\frac {.20{\\text{liters}}}{1{\\text{km}}}}\\times {\\frac {1{\\text{km}}}{.62{\\text{mi}}}}={\\frac {.20{\\text{liters}}}{.62{\\text{mi}}}}} . Third, convert the number of liters to the number of US gallons. There are .26 US gallons in a liter. [13] X Research source To convert, you would calculate .20 liters .62 mi × .26 gallons 1 liters = .052 gallons .62 mi {\\displaystyle {\\frac {.20{\\text{liters}}}{.62{\\text{mi}}}}\\times {\\frac {.26{\\text{gallons}}}{1{\\text{liters}}}}={\\frac {.052{\\text{gallons}}}{.62{\\text{mi}}}}} . Fourth, since you want to find miles per gallon, take the reciprocal of the fraction: .62 mi .052 gallons {\\displaystyle {\\frac {.62{\\text{mi}}}{.052{\\text{gallons}}}}} . Last, find the number of miles per gallon by dividing the numerator and the denominator by the number of gallons: .62 mi .052 gallons = 11.92 mpg {\\displaystyle {\\frac {.62{\\text{mi}}}{.052{\\text{gallons}}}}=11.92\\;{\\text{mpg}}} ."
    }
  ]
}