{
  "url": "https://www.wikihow.com/Apply-Dental-Wax-on-Braces",
  "title": "How to Apply Dental Wax on Braces",
  "steps": [
    {
      "title": "Acquire a box of dental wax.",
      "content": "Acquire a box of dental wax. When you first received your braces, it is likely that your orthodontist gave you a pack with some essential supplies. Dental wax should have been included in the pack. Dentist Jeremy Silverman explains that \"orthodontic wax placed over the sharp area will provide relief\" from poking and rubbing. If you lose it or run out, you can easily buy another box from your local drugstore, or ask your orthodontist for some more. You will probably find that your braces irritate the inside of your mouth most when you first have them, so they will require more wax. Over time, the skin on the inside of your mouth may toughen up and you may find you require less wax."
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. Dentist Jeremy Silverman emphasizes that it's important to \"be sure to wash your hands thoroughly and brush your teeth prior to applying orthodontic wax.\" Scrub your hands with soap and water for at least 20 seconds, then dry them thoroughly. Likewise, give your teeth a thorough brushing before applying the wax. You don't want to bring any bacteria into your mouth, especially if you have a cut or sore. While this doesn't have to be your most thorough brush job, at the very least, remove any food stuck in the braces where you plan to apply the wax."
    },
    {
      "title": "Shape a small ball of wax.",
      "content": "Shape a small ball of wax. According to dentist Jeremy Silverman, you should \"pinch a pea sized amount [of wax] between the thumb and forefinger and roll the wax into a ball. It can be flattened slightly to cover more area if needed.\" Roll the wax for at least five seconds. The warmth from your fingers will soften it and make it easier to mold around the brace or wire. Using too much wax may result in the wax falling off."
    },
    {
      "title": "Locate painful areas.",
      "content": "Locate painful areas. Wax can cover up any area where sharp or rough metal is irritating your inner lips and cheeks. The most common places are the brackets on your front teeth, and the sharp wires at the far back of your mouth. Pull your cheek out and look for any bright red or swollen areas, or gently probe your cheek to find tender areas. You should protect all of these before they develop into cuts, or get infected. If you're having trouble seeing, use a metal rod or small spoon to push out your cheek."
    },
    {
      "title": "Dry off your braces.",
      "content": "Dry off your braces. Before you apply the wax, dry off your braces with a tissue or a cotton ball. The drier the area is, the longer the wax will stick."
    },
    {
      "title": "Press the wax over the painful area.",
      "content": "Press the wax over the painful area. Using your thumb and forefinger, press the ball of wax over the bracket or wire causing you pain. If the wire is at the back of your mouth, push as far as you can, then withdraw your thumb and use your forefinger to position the wax. Dentist Jeremy Silverman adds that \"your tongue can be used to make slight adjustments if needed.\" The wax is edible and non-toxic, so it doesn't matter if you swallow it."
    },
    {
      "title": "Rub it in place.",
      "content": "Rub it in place. Rub your forefinger over the wax a couple times to stick it in place. The wax should still stick out a little, forming a small bump."
    },
    {
      "title": "Allow the wax to work.",
      "content": "Allow the wax to work. Once you have applied wax to your braces, your mouth should heal itself quite quickly. The wax barrier stops the irritation and allows the mouth the time to heal any sore spots. As you become accustomed to your braces, you will find they cause less and less irritation and you won't have to use the wax as often."
    },
    {
      "title": "Reapply the wax regularly.",
      "content": "Reapply the wax regularly. Keep some wax on you when you are out and about. Replace the wax twice a day, or whenever it starts to fall off. Do not leave it on for more than two days, as bacteria can build up in the wax. The wax will pick up food as you eat. If the braces are too painful to let you eat without wax, replace the dirty wax after you finish your meal. Take off the wax before brushing your teeth, or you'll get wax caught in your toothbrush."
    },
    {
      "title": "Consider dental silicone.",
      "content": "Consider dental silicone. One common alternative to dental wax is dental silicone. This comes in strips that you apply to braces. The silicone is more resilient as it impervious to the saliva and enzymes in your mouth, which means that you will have to reapply it less frequently. The downside is that your braces must be completely dry before you apply it. If you want to try silicone, ask your dentist for a tester pack, or buy a small amount from the store and test it out for a few days."
    },
    {
      "title": "Contact your orthodontist if the pain persists.",
      "content": "Contact your orthodontist if the pain persists. If you have tried wax and silicone and they haven't helped, get in touch with your orthodontist. Persistent irritation and sores can become infected and lead to more serious problems. If you are having a really tough time with your braces, don't be shy about getting in touch with your orthodontist. They will help make them more comfortable. If the pain is from an irritated area in the mouth, such as the cheek or lip, doing warm salt water rinses several times a day might help heal the tissue and decrease irritation. You should see an orthodontist right away if your pain results from a wire poking or a bracket that has come off. The orthodontist and staff have the proper tools to trim or recenter a poking wire and to repair a broken bracket."
    }
  ]
}