{
  "url": "https://www.wikihow.com/Care-for-Sea-Monkeys",
  "title": "How to Care for Sea Monkeys",
  "steps": [
    {
      "title": "Use a clean, plastic container.",
      "content": "Use a clean, plastic container. Many sea monkey kits will come with small plastic tanks you can use to hatch and house your sea monkeys. If your kit did not come with a small plastic tank, you can use a clean plastic container that can hold at least two liters of water. Look for a container that has a deep base, as sea monkeys often enjoy swimming around at the base area of their tanks."
    },
    {
      "title": "Fill it with two liters of distilled water.",
      "content": "Fill it with two liters of distilled water. You can use bottled water, distilled water, or any form of unchlorinated water. Avoid using carbonated water or tap water, as it often contains fluoride and other minerals that may not be good for your sea monkeys. Once you fill the tank with the water, you should place the tank indoors so it can warm up to room temperature. This will ensure the water will be warm enough for the sea monkey eggs. You should also aerate the tank water at least once to twice a day with an air pump or a turkey baster."
    },
    {
      "title": "Add the water purifier to the water.",
      "content": "Add the water purifier to the water. The water purifier or salt packet should come in your sea monkey kit when you buy it in stores or online. The water purifier will contain salt, which is important for your sea monkeys as it will allow them to hatch in the water and thrive. Once you put the salt packet in the water, give it a stir and let the water sit in room temperature for another day or up to 36 hours before you add the sea monkeys to the tank."
    },
    {
      "title": "Put the sea monkeys in the water and wait for them to hatch.",
      "content": "Put the sea monkeys in the water and wait for them to hatch. Once you pour the sea monkeys into the tank, stir the tank water with a clean plastic spoon. The sea monkeys will appear as small dots in the water. But don’t worry, they will hatch in around five days and begin swimming around in the tank. Aerate the water while you wait for the sea monkeys to hatch, at least once to twice a day. This will ensure there is enough oxygen in the water for your sea monkeys as they develop and hatch."
    },
    {
      "title": "Start feeding the sea monkeys five days after they hatch.",
      "content": "Start feeding the sea monkeys five days after they hatch. Rather than feed your sea monkeys as soon as they start hatching, you should wait five days. On the fifth day from when your sea monkeys hatch, you can give them sea monkey food. The sea monkey food should come with your sea monkeys as part of a kit. Use the small end of the feeding spoon to sprinkle one small spoonful of food in their tank. You should give them a small spoonful of food every 2 days. Do not give your sea monkeys fish food or foods other than sea monkey food."
    },
    {
      "title": "Give them sea monkey food every five days.",
      "content": "Give them sea monkey food every five days. You should feed your sea monkeys every five days to keep them healthy and happy. Do not overfeed your sea monkeys as this will often kill them. Sea monkeys are transparent, which means you will be able to see their digestive tract if you look at them closely. When their digestive tract is full of food, they will have a black stripe down the middle of their body. Once they poop out the food, their digestive tract will be clear again."
    },
    {
      "title": "Feed your sea monkeys less food once algae develops in the tank.",
      "content": "Feed your sea monkeys less food once algae develops in the tank. Over time, green algae will start to appear in the tank. The tank may also smell grassy, like a freshly mowed lawn. These are all good signs, as the green algae actually acts as food for sea monkeys and helps them stay healthy. You can switch to feeding your sea monkeys once a week once green algae begins to form and build up in the tank. [3] X Research source You should also not worry about cleaning the tank once the algae starts to develop. The tank may look green and full of algae, but it is actually very healthy and good for your sea monkeys that way."
    },
    {
      "title": "Aerate the tank water twice a day.",
      "content": "Aerate the tank water twice a day. Your sea monkeys need oxygen to live happily in their tank. If they become oxygen deprived, they may turn a pinkish color and appear slow-moving or tired. To ensure the water has enough oxygen, you should aerate the tank twice a day, once in the morning and once at night. You can use an air pump to aerate the water, such as an air pump used in small aquariums. Stick the air pump in the water and let it aerate the tank for at least one minute, twice a day. Another option is to use a small turkey baster to aerate the tank. You can squeeze the turkey baster in the air and then put it in the water and release the air to put more oxygen in the water. Pull the turkey baster in and out of the water, placing air in the water, for at least one minute, twice a day. To make your own air bubbler: Take a pipette that you aren't planning on using for anything else. Poke a hole in the very top, then poke many tiny holes in the squirting-out end. Either use a pin or staple it several times from different angles with a stapler, then remove the staples. If you do not want to remember to aerate the tank twice a day, you can place a small live plant in the sea monkeys’ tank to provide oxygen in the water. Use an underwater aquarium plant that is known to provide good oxygen underwater."
    },
    {
      "title": "Place the tank in a warm place.",
      "content": "Place the tank in a warm place. Sea monkeys do best in a spot that's a little over room temperature. [4] X Research source Doug Ludemann. Aquarium Specialist. Personal interview. 27 August 2019. You should put their tank in a spot of your house that gets indirect sunlight and is at least 22° Celsius (72° Fahrenheit). This will ensure the tank gets enough heat and is not too cold for your sea monkeys. A tank that is too cold will lead to them becoming immobile sea monkeys and sea monkeys that do not grow. If you notice the sea monkeys are not moving in their tank or growing, it could be because the tank is too cold and needs to be moved to a warmer spot in your home. Place it in a spot with indirect sunlight so it gets enough heat but does not get too hot."
    },
    {
      "title": "Do not change the water unless it smells very foul or appears cloudy.",
      "content": "Do not change the water unless it smells very foul or appears cloudy. Green algae in the tank is a good thing, as the algae acts as food and provides oxygen for your sea monkeys. But if you notice the tank smells really bad and the water appears dark and cloudy, you may need to clean the tank and the water. You will need a coffee filter and a clean glass filled with unchlorinated saltwater. Use a net to take the sea monkeys out of the tank and place them in the clean glass with water. Place the coffee filter over a clean tank and run the tank water through the coffee filter several times. Try to filter out as much of the gunk in the water as possible. You can use a paper towel to clean out the bottom and sides of the tank. You can also use a cotton swab to clean out any gunk in the crevices of the tank. Smell the tank water to check that it no longer smells foul. Then, put the water back in the tank, followed by the sea monkeys. Top up the tank water with purified, room temperature water. Feed your sea monkeys and aerate the tank several times throughout the day. Then, feed them again five days later, per their usual feeding schedule."
    },
    {
      "title": "Watch for any white spots in the tank and remove them.",
      "content": "Watch for any white spots in the tank and remove them. If you notice white spots, almost like cotton balls, in the tank water, you should try to remove them as soon as possible. They are a type of bacteria that can kill your sea monkeys. Use a small spoon to get them out of the tank and dispose of them. You may want to also put Sea Medic into the tank, which will help to kill any remaining bacteria. If they still appear after one to two days, you should give the tank a thorough cleaning and replace the water. You may lose baby sea monkeys and sea monkey eggs when you dispose of the water, but this may be the only way to kill the bacteria."
    },
    {
      "title": "Use a small flashlight to make the sea monkeys dance and swim around.",
      "content": "Use a small flashlight to make the sea monkeys dance and swim around. You can play with your sea monkeys using a small flashlight or a penlight. Move the light against the tank and note how the sea monkeys will chase and follow the light as you move it around. They will also gather by the light if you keep it still against the tank. You can have fun playing with your sea monkeys by drawing shapes and patterns with the light, which they will then swim around and trace in the tank."
    },
    {
      "title": "Note if the sea monkeys are mating.",
      "content": "Note if the sea monkeys are mating. Male sea monkeys have whiskers under their chins and female sea monkeys often appear to be carrying eggs when they swim around. Sea monkeys will mate often so do not be surprised if you see sea monkeys latching onto each other as they swim. This is an indication your sea monkeys are mating and more sea monkeys will soon be on their way. Most sea monkeys live for an average of two years but due to their high mating rates, you will likely have a continuous supply of sea monkeys in the tank as long as you care for the tank and the sea monkeys properly."
    }
  ]
}