{
  "url": "https://www.wikihow.com/Apply-for-a-Homestead-Exemption-in-Florida",
  "title": "How to Apply for a Homestead Exemption in Florida",
  "steps": [
    {
      "title": "Live in the home for the entire year.",
      "content": "Live in the home for the entire year. You can only take a homestead exemption for a year if you live in the home as of January 1st. [1] X Research source Accordingly, you can't move to Florida during the year and claim a homestead exemption for that year. For example, say you move to Florida on January 15, 2017. You can't claim a homestead exemption for 2017. However, you can claim the exemption for 2018."
    },
    {
      "title": "Check if the home is your permanent residence.",
      "content": "Check if the home is your permanent residence. You can only get the exemption if your home is your permanent residence. There are no set number of days you must be in Florida. However, the following factors show permanent residence: [2] X Research source If you file income tax returns, you file them as a Florida resident. If you vote, you vote in Florida. If you drive, you have a Florida driver's license. If you claim another residency-based exemption in another state, then you aren't a Florida resident and you can't claim the homestead exemption in Florida. [3] X Research source"
    },
    {
      "title": "Identify if your home qualifies.",
      "content": "Identify if your home qualifies. You can receive a homestead exemption if you have legal or beneficial title in the property and it is your permanent residence. You have beneficial title if the property is owned by a trust but you can use the property. However, you can't own the property as a corporation. If you rent part of the property, the benefit applies only to the portion that is owner-occupied. [4] X Research source"
    },
    {
      "title": "Check if you qualify as a non-citizen.",
      "content": "Check if you qualify as a non-citizen. Generally, only U.S. citizens and permanent residents can claim Florida's homestead exemption. However, non-citizens can claim the exemption if they have children born in the U.S. who live in the home and are dependent on you. In this case, your children have to qualify as permanent residents of the property. [5] X Research source You will need to collect birth certificates and other proof that the children use the home as their primary residence. Talk with your county's property appraiser for more information."
    },
    {
      "title": "Don't do anything disqualifying.",
      "content": "Don't do anything disqualifying. You might do something that will cause your county to deny you a homestead exemption. For example, don't do the following: [6] X Research source Avoid renting your home for more than 30 days each year, for two consecutive years. Don't get a driver's license in any other state. Don't forget to register your vehicle in Florida if you drive in the state. Avoid registering to vote anywhere else. You should register to vote only in the county where you are a permanent resident."
    },
    {
      "title": "Calculate your exemption.",
      "content": "Calculate your exemption. Every home receives a $25,000 exemption. However, you might also receive up to an additional $25,000 depending on how much your home is worth. This additional exemption won't lower your school taxes, but it will lower other taxes. [7] X Research source Consider the following: [8] X Research source If your home is worth $50,000 or less, than you don't receive the additional $25,000. Instead, your exemption is $25,000. If your home is worth $55,000, you receive an additional $5,000. Your total exemption is $30,000. If your home is worth $70,000, then you receive an additional $20,000. Your total exemption is worth $45,000. If your home is worth $75,000 or more, you receive an additional $25,000. Your total exemption is worth $50,000."
    },
    {
      "title": "Gather required documents.",
      "content": "Gather required documents. You need to show the appraiser quite a bit of documentation in order to claim the homestead exemption. Accordingly, you should gather this material as soon as possible. Collect the following for each of the property's owners: [9] X Research source Florida driver's license or, if you don't drive, a Florida ID card. If you own the property with your spouse, then both of you need to submit ID. Florida vehicle registration if you own or drive in Florida. Leased vehicles are included. Florida voter information card or a declaration of domicile which you have recorded with the Clerk of the Court. A declaration of domicile is a document filed with the Clerk of the Circuit Court that declares your intention to keep a Florida residence as your permanent home. Pick up these documents at any district court or County Recorder's Office. If you aren't a citizen, you should bring your permanent resident card and your declaration of domicile recorded with the Clerk of the Court. Social Security card or a document (such as an income tax return) that has your number on it. You need to submit your spouse's card even if they are not a co-owner of the property. Copy of your deed, tax bill, or Notice of Proposed Property Taxes. A recorded deed is preferable. Copy of your trust document if the property is held in trust. Certificate of registration or title if the property is a mobile home. A Leave and Earnings Statement (LES) for active military personnel showing that Florida is their state of legal residence."
    },
    {
      "title": "Visit the Property Appraiser's Office.",
      "content": "Visit the Property Appraiser's Office. You can apply at this office, or download an application and submit it with documentation to the property appraiser. Look online to find the address and hours of business. If you are homebound, then contact the office and schedule a visit. [10] X Research source"
    },
    {
      "title": "Complete an application.",
      "content": "Complete an application. Download the application from the county website or stop in and pick up a paper copy. You must provide the following information on the application: [11] X Research source name and mailing address previous address whether you received tax exemptions for the property whether you or your spouse received or claimed tax benefits in another county, state, or country proof of residence for all owners other information about the property signatures and date"
    },
    {
      "title": "Submit on time.",
      "content": "Submit on time. You must submit your application by March 1st of the current tax year. For example, if you want to claim the exemption for 2017, you must file by March 1, 2018. However, you might be able to late file. Contact your Property Appraiser's Office. In Martin County, for example, you can late file up to 25 days from the date Notices of Proposed Property Taxes are mailed. [12] X Research source"
    },
    {
      "title": "Appeal if denied.",
      "content": "Appeal if denied. You can appeal a denial of the homestead exemption by filing a petition with your county's Value Adjustment Board. [13] X Research source However, you should probably first ask for an informal conference with the appraiser. You can file your petition after meeting the meeting. [14] X Research source You can get a petition form from the county appraiser or clerk in your county. You may also download the form, which is available at the Florida Department of Revenue's website. File your petition within 30 days of the date you are mailed the denial notice. You can have someone help you at the hearing. For example, you can ask a friend or family member. Alternately, you can hire an attorney or a licensed real estate appraiser. If you lose before the board, you can appeal to a circuit court. [15] X Research source"
    },
    {
      "title": "Submit another application if you move.",
      "content": "Submit another application if you move. The homestead exemption is not transferable. You'll need to complete a new application when you move. List your new home address. [16] X Research source Once you receive your exemption, the assessed value of your homestead cannot increase more than 3% a year or the percentage change of the Consumer Price Index. Although you can't transfer the homestead exemption, you can transfer this tax savings to a new home. [17] X Research source"
    },
    {
      "title": "Identify exemptions for military veterans.",
      "content": "Identify exemptions for military veterans. Veterans in Florida may qualify for additional property exemptions or discounts. You can apply for them with the county appraiser. Consider the following: [18] X Research source Former servicemembers who were honorably discharged and are partially disabled while serving in wartime may obtain a $5,000 deduction in property assessment value. This deduction can be applied to any property, not only your homestead. In some circumstances, a veteran's surviving spouse may qualify. Veterans who were honorably discharged and have a total and permanent disability may qualify for total exemption from taxes on their homestead property. In some situations, a surviving spouse may also qualify. Veterans 65 or older may qualify for a discount on the assessed value of their property if they are partially or permanently disabled. Current or former members may also receive an exemption if they were deployed during the previous calendar year outside the U.S. Your deduction will equal the amount of time you were outside the country. This benefit is available to members of the U.S. military, Coast Guard, and the Florida National Guard."
    },
    {
      "title": "Check if you qualify for a senior citizen exemption.",
      "content": "Check if you qualify for a senior citizen exemption. This exemption is available to those 65 or older who meet certain income requirements. You must apply by March 1st. To qualify, you must meet the following: [19] X Research source The property must qualify for a homestead exemption. One homeowner must be 65 years of age on January 1 for the year you claim the exemption. Your household's gross income must not be too high. As of 2017, the limit is $28,841. You'll need to present proof of income, such as your Social Security Statements and Federal Income Tax Returns."
    },
    {
      "title": "Learn about the second senior citizen exemption.",
      "content": "Learn about the second senior citizen exemption. Amendment 11 provides for a second exemption for seniors who have lived in their homes for a long time. The exemption is equal to the total assessed value of your home. However, it is optional, and not all taxing authorities have adopted it. If your taxing authority has, then you will qualify if you meet the following criteria: You have lived in your home for at least 25 years. Your home has a market value of less than $250,000. You are age 65 or older. Your adjusted gross income is less than $28,841. This amount will change each year."
    }
  ]
}