{
  "url": "https://www.wikihow.com/Clean-a-Deep-Fryer",
  "title": "How to Clean a Deep Fryer",
  "steps": [
    {
      "title": "Clean your deep fryer as needed.",
      "content": "Clean your deep fryer as needed. If you use your deep fryer frequently, changing the oil and cleaning it every few days will help prevent a buildup of grime that can be much harder to remove. If you only use your deep fryer every couple weeks or less frequently, clean it after each use. Do not put your fryer in the sink or dishwasher. Immersion in water may cause an electrical short and damage the fryer."
    },
    {
      "title": "Unplug the deep fryer and let cool completely.",
      "content": "Unplug the deep fryer and let cool completely. [1] X Expert Source Ed Kuoha Chef Expert Interview. 9 November 2021. Never clean your deep fryer while it is still plugged in. Let the oil cool completely to avoid burns. Never add water to a container of hot oil, or the mixture could explode."
    },
    {
      "title": "Drain the oil.",
      "content": "Drain the oil. [2] X Expert Source Ed Kuoha Chef Expert Interview. 9 November 2021. If you plan to use the oil again, drain it into a food safe container with a sealed lid and store it in a cool place. Otherwise, find out how you can use cooking oil for other purposes or simply throw it away in a sealed container. Do not pour oil down your sink. It can clog your drain."
    },
    {
      "title": "Take the frying basket out and put it in the sink.",
      "content": "Take the frying basket out and put it in the sink. Put two or three drops of dish washing detergent on the basket for later cleaning."
    },
    {
      "title": "Wipe off remaining oil from the pot and lid.",
      "content": "Wipe off remaining oil from the pot and lid. Use damp, but not dripping, paper towels or a sponge to wipe away oil residue and bits of food from inside the deep fryer pot.If the oil has caked on, scrape it off with a pan scraper or spatula, taking care not to damage the finish. Some lids are removable for easy cleaning. Dispose of the oil as before. Stiff plastic utensils will scrape off the oil without scratching your fryer."
    },
    {
      "title": "Wipe the deep fryer's heating element clean if necessary.",
      "content": "Wipe the deep fryer's heating element clean if necessary. Most deep fryers have a heating element composed of a pair metal rods. If these are covered in oily residue, wipe them down with paper towels. Be careful not to bend or damage any parts while wiping, especially if there are thin wires. Some models have removable heating elements for easy cleaning, or elements that are attached to a hinge that can be pulled up nearer the fryer's surface. Check your model's manual to see if yours has this feature."
    },
    {
      "title": "Use a soft sponge to scrub with dish soap.",
      "content": "Use a soft sponge to scrub with dish soap. [3] X Expert Source Ed Kuoha Chef Expert Interview. 9 November 2021. Use about four drops on the base of the fryer and four drops spread evenly around the sides. Start at the bottom and scrub in circles to create a lather. Continue to scrub with a circular motion up the sides."
    },
    {
      "title": "Fill the fryer with hot water.",
      "content": "Fill the fryer with hot water. Transfer it from your faucet/tap with a pitcher/jug/kettle or other container, rather than exposing your fryer's electrical components to a wet sink. Use as much water as you normally would oil and no more. Let the hot water sit for 30 minutes. Whilst you wait you can move on to the next step and clean the other pieces. If your tap water isn't that hot, you may heat some in a kettle or bring the water to a boil in the fryer by plugging it back in - be sure not to leave it unattended and do not allow it to boil dry. Unplug your fryer and wait 30 minutes for the water to cool. Boil for several minutes if there is a large amount of caked on residue."
    },
    {
      "title": "Run warm water over the frying basket and clean it by wiping back and forth.",
      "content": "Run warm water over the frying basket and clean it by wiping back and forth. Use a scrubbing-brush (a tooth-brush works well) to remove food particles. [4] X Research source httpAdd more dish soap and clean the basket again if it still feels greasy.://www.livingspace360.com/index.php/a-simple-five-step-route-to-a-clean-deep-fat-fryer-3114/ Once clean, rinse the basket to remove the remaining soap, blot off remaining water with a paper towel and leave it to dry on a dish rack or towel."
    },
    {
      "title": "Clean or replace dirty filters on the fryer lid.",
      "content": "Clean or replace dirty filters on the fryer lid. Check your manufacturer's instructions to see if your filters are removable, and whether you can clean them. Foam grease-filters can be washed in hot soapy water and left to dry. Charcoal odor-filters are not washable and need to be replaced once they become grimy and clogged. If any filters are not removable, you cannot immerse the lid in water. Instead, wipe with a damp cloth with a little detergent, then a plain damp cloth to remove the detergent and oil."
    },
    {
      "title": "Return to the cooking pot and give it a final wash.",
      "content": "Return to the cooking pot and give it a final wash. Once the water has been sitting in the fryer pot for 30 minutes, pour half of it into the sink. Use a sponge or cloth to wipe the sides and bottom with the remaining water, then pour that down the sink as well. If the water contains a large amount of oil, you may need to put it in a container and throw it in the trash instead of pouring it down the sink."
    },
    {
      "title": "Use baking soda if caked-on oil remains.",
      "content": "Use baking soda if caked-on oil remains. If some caked on residue or sticky layer of oil still hasn't been removed, try mixing a little bit of baking soda with warm water to create a thick paste. Put on to a sponge and use this to scrub off stubborn area with a circular motion until it is removed. Only use other abrasive or chemical substances to clean your fryer as an absolute last resort. If you do need to use an oven cleaner or other cleaning product, scrub with soapy water afterward and rinse several times to remove all traces of the chemical before using it to cook."
    },
    {
      "title": "Rinse the cooking pot.",
      "content": "Rinse the cooking pot. [5] X Expert Source Ed Kuoha Chef Expert Interview. 9 November 2021. Add clean water without soap and swirl with your hand to pick up all soap particles from the sides and base. Pour out the water and repeat the process until the fryer is free of soap. If there is a stubborn grease film (run your bare hand over the surfaces to feel for any remaining greasy/sticky patches) rinse again with diluted vinegar. Add 1 part vinegar for every 10 parts water, or 1/2 cup for every quart of water (110 mL vinegar for each liter of water). [6] X Research source"
    },
    {
      "title": "Let dry completely (blotting with paper towel will speed up drying) before using again.",
      "content": "Let dry completely (blotting with paper towel will speed up drying) before using again. [7] X Expert Source Ed Kuoha Chef Expert Interview. 9 November 2021. Use a towel to dry the outside of the deep fryer, but let the inside air dry. Wait long enough for the fryer to dry completely. This gives any water that accidentally entered the electrical system a chance to drain before you plug the fryer back in."
    },
    {
      "title": "Clean regularly.",
      "content": "Clean regularly. Follow the instructions for Cleaning a Deep Fryer to give your commercial fryer a basic cleaning. The frequency of this cleaning will depending on how frequently the fryer is used, and for what purpose, but the more often you do it, the easier it will be to remove the grease residue and caked on food. Since commercial fryers tend to be large and deep, you should use a long-handled brush with soft bristles to scrub the pot, instead of a sponge."
    },
    {
      "title": "Filter and replace the oil frequently, especially if used to fry foods like fish and meat (sausages etc).",
      "content": "Filter and replace the oil frequently, especially if used to fry foods like fish and meat (sausages etc). For heavy restaurant use, oil often needs to be filtered once or twice a day. While you can filter the oil for reuse by putting it through a coffee filter or cheesecloth, a restaurant operation would probably benefit from a specialized machine that filters quickly at higher temperatures. Whenever the oil grows darker in color, smokes at lower temperatures, or gives off a strong smell, it needs to be replaced completely. [8] X Research source Your oil will last longer at temperatures of 375ºF (191ºC) or below, and if you do not add salt directly to the oil. [9] X Research source"
    },
    {
      "title": "Brush the heating coils clean whenever the oil is drained.",
      "content": "Brush the heating coils clean whenever the oil is drained. Before the new or filtered oil is added back to the fryer, use a long-handled fryer scrubbing brush to remove bits of food from the coils. This keeps the heating element effective and limits burned food particles in your oil."
    },
    {
      "title": "Keep the exterior clean.",
      "content": "Keep the exterior clean. While cleaning the rim and outside surface of your fryer will not help the fryer function longer, it will stop it collecting grime and limit spillovers that make floors and work surfaces slippery. Try to wipe it clean at the end of each day, and apply a degreasing product to the exterior whenever a grease film has built up. Let the degreasing product sit for ten minutes, then rinse off with a damp cloth. Dry with a different, clean cloth. [10] X Research source"
    },
    {
      "title": "Perform a thorough \"boil out\" clean every 3–6 months.",
      "content": "Perform a thorough \"boil out\" clean every 3–6 months. To thoroughly clean your commercial fryer, you should fill it with warm water and heat to a simmer or slow boil. Add a specialized \"boil out\" product according to manufacturer's instructions and maintain the simmer for 20 minutes. Wearing rubber gloves and taking care to avoid burns from splashes, use a long-handled soft-bristled brush to dislodge stuck food. [11] X Research source Drain the fryer, then scrub and rinse as you would after a normal clean. During the followup rinse, add 1 part vinegar for every 10 parts water to neutralize and remove the cleaning product. [12] X Research source"
    },
    {
      "title": "Follow the owner's manual to conduct an annual inspection.",
      "content": "Follow the owner's manual to conduct an annual inspection. The manufacturer of your fryer model should provide instructions for performing an annual inspection to make sure all the parts are fitted together tightly and functioning properly. If problems arise and the manual does not provide instructions for a solution, you may need to call an electrician or repairman."
    }
  ]
}