{
  "url": "https://www.wikihow.com/Add-a-Contact-on-WhatsApp",
  "title": "How to Add Contacts to Your Phone via WhatsApp",
  "steps": [
    {
      "title": "Open the WhatsApp app.",
      "content": "Open the WhatsApp app. It's the white phone on a green speech bubble icon. You’ll need to set up WhatsApp if it’s your first time opening it."
    },
    {
      "title": "Tap the speech bubble icon.",
      "content": "Tap the speech bubble icon. You'll find this in the bottom right corner of the screen. If WhatsApp opens to a conversation, tap ← in the top left corner of the screen first."
    },
    {
      "title": "Tap New contact.",
      "content": "Tap New contact . It's at the top of your Contacts menu next to an icon that resembles a person. Doing so will take you to the new contact creation page. [1] X Research source If asked to select an app, tap the Contacts app and tap Always . If you have multiple Google accounts on your phone, select the one you want to add a contact to."
    },
    {
      "title": "Type in the person's name.",
      "content": "Type in the person's name. You'll do this in the \"First Name\" and \"Last Name\" fields near the top of the screen."
    },
    {
      "title": "Tap the \"Phone\" field.",
      "content": "Tap the \"Phone\" field. It's beneath the \"Organization\" field."
    },
    {
      "title": "Type in your contact's phone number.",
      "content": "Type in your contact's phone number. If the number is from a different country, you may need to add a country code (e.g., \"1\" for the U.S. or \"44\" for the U.K.) in addition to the standard 10 digits. [2] X Research source"
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . It's in the top right corner of the screen. Doing so will save your contact's information to your Android's Contacts app; additionally, if the person you added uses WhatsApp, you'll now be able to contact them from within WhatsApp. [3] X Research source"
    },
    {
      "title": "Give WhatsApp access to your contacts list.",
      "content": "Give WhatsApp access to your contacts list. To do this, do the following: Tap on Settings . Scroll to the bottom of your apps list and tap WhatsApp . Toggle the switch to the On position across from Contacts ."
    },
    {
      "title": "Open the WhatsApp app.",
      "content": "Open the WhatsApp app. It's the white phone on a green speech bubble icon. If this is your first time opening WhatsApp on your phone, you'll need to set up WhatsApp first."
    },
    {
      "title": "Tap the Chats tab.",
      "content": "Tap the Chats tab. It's at the bottom of the screen. [4] X Research source If WhatsApp opens to a conversation, just tap the back button in the top left corner of the screen."
    },
    {
      "title": "Tap the box with a pencil.",
      "content": "Tap the box with a pencil. It's in the top right corner of the screen."
    },
    {
      "title": "Tap New Contact.",
      "content": "Tap New Contact . You'll see this option near the top of the page below the Search bar. Doing so will open a new contact page. [5] X Research source"
    },
    {
      "title": "Type in the person's name into the fields labeled \"First\" and \"Last\".",
      "content": "Type in the person's name into the fields labeled \"First\" and \"Last\"."
    },
    {
      "title": "Type in their phone number next to mobile.",
      "content": "Type in their phone number next to mobile . If you want to change the label from \"mobile,\" tap on the blue mobile label and select a new one like \"work,\" \"home,\" or \"iPhone,\" then tap Done to return to the main contact page. [6] X Research source If you want to change the country code, tap on the name of the country."
    },
    {
      "title": "Tap Save in the upper right corner.",
      "content": "Tap Save in the upper right corner."
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . It's in the top left corner of the screen. Doing this saves the person's number to your iPhone's Contacts app; if the contact you added uses WhatsApp, it also saves the contact to your WhatsApp contact list."
    },
    {
      "title": "Open the WhatsApp app.",
      "content": "Open the WhatsApp app. Make sure that WhatsApp has access to your contacts."
    },
    {
      "title": "Tap Chats.",
      "content": "Tap Chats ."
    },
    {
      "title": "Select the chat with the unsaved contact.",
      "content": "Select the chat with the unsaved contact."
    },
    {
      "title": "Tap the More icon ••• or tap the number at the top of the chat.",
      "content": "Tap the More icon ••• or tap the number at the top of the chat. If adding an unsaved number from a group chat, tap any message from that number."
    },
    {
      "title": "Tap Add to contacts.",
      "content": "Tap Add to contacts . This should save that user's information to your address book. On iPhone you may see Create New Contact instead."
    },
    {
      "title": "Open the WhatsApp app.",
      "content": "Open the WhatsApp app. It's the white phone on a green speech bubble icon. If this is your first time opening WhatsApp on your phone, you'll need to set up WhatsApp first."
    },
    {
      "title": "Tap ⋮.",
      "content": "Tap ⋮ . You'll see this option in the top right corner of the screen. If WhatsApp opens to a conversation, tap ← in the top left corner of the screen first."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . It's at the bottom of the drop down menu here."
    },
    {
      "title": "Tap Invite a Friend.",
      "content": "Tap Invite a Friend . It's at the bottom of the Settings menu."
    },
    {
      "title": "Tap your friend's name.",
      "content": "Tap your friend's name. Scroll through your list of contacts to find the person you want to invite to WhatsApp. [7] X Research source Any names that appear here are non-WhatsApp users from your Android's Contacts app. You can use the search bar at the top of the screen to search for a specific contact."
    },
    {
      "title": "Edit and send your invitation.",
      "content": "Edit and send your invitation. Tapping a contact's name will automatically open a text conversation with them. WhatsApp will provide you with a pre-written message and a unique invitation link. Edit this message as you see fit, and send it to your contact to invite them to WhatsApp! [8] X Research source You may only send one invitation at a time."
    },
    {
      "title": "Open the WhatsApp app.",
      "content": "Open the WhatsApp app. It's the white phone on a green speech bubble icon. If this is your first time opening WhatsApp on your phone, you'll need to set up WhatsApp first."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . It's in the bottom right corner of the screen. If WhatsApp opens to a conversation, tap the back button in the top left corner of the screen first."
    },
    {
      "title": "Scroll down and tap Tell a Friend.",
      "content": "Scroll down and tap Tell a Friend . You'll find this option at the bottom of the screen."
    },
    {
      "title": "Tap Message.",
      "content": "Tap Message . It's in the middle of the pop-up window here."
    },
    {
      "title": "Tap your friend's name.",
      "content": "Tap your friend's name. You may have to scroll down to find it. You can use the search bar at the top of the screen to search for a specific contact. The names in this list are non-WhatsApp users from your contacts."
    },
    {
      "title": "Tap Send 1 Invite.",
      "content": "Tap Send 1 Invite . It's in the bottom right corner of the screen. Doing so will open a New Message window with a link to WhatsApp. If you tapped more than one name, you'll see Send [Number] Invites instead."
    },
    {
      "title": "Tap the send arrow.",
      "content": "Tap the send arrow. It's the green or blue icon in the right side of the text window near the bottom of the screen. Doing so will send an invite to your selected person (or people); if they download and join WhatsApp, you'll be able to contact them through the app. [9] X Research source"
    }
  ]
}