{
  "url": "https://www.wikihow.com/Chop-Broccoli",
  "title": "How to Chop Broccoli",
  "steps": [
    {
      "title": "Wash the broccoli thoroughly.",
      "content": "Wash the broccoli thoroughly. Take your head of broccoli and douse it completely under a cool stream of running water from your sink. You may want to run your fingers through the flowery head to knock loose any dirt or insects that are stuck there. Then you can pat it dry with a towel. Broccoli should not be soaked in water to be cleaned."
    },
    {
      "title": "Pick free leaves from the broccoli.",
      "content": "Pick free leaves from the broccoli. Broccoli leaves, while high in nutritional content, are rarely used in traditional recipes. Picking off the leaves also makes the broccoli more uniform in appearance, creating a more aesthetically pleasing finished product once you are done chopping your broccoli. [3] X Research source Leaves can be thrown away or you might use these as part of a salad, which you could serve as a side dish along with your broccoli. [4] X Research source"
    },
    {
      "title": "Cut the florets free beneath the flower canopy.",
      "content": "Cut the florets free beneath the flower canopy. Use your knife or pair of kitchen scissors to cut the florets free of the stalk as close to beneath the florets as you can. The ideal place for this is where the stalk begins to branch into separate florets. The florets are the part of the broccoli that appear like tiny trees branching off from the thick, green stem. Due to the thickness or position of the florets, you may not be able to get an ideal cut on your first try. Don't worry, you will tidy up your cut broccoli once the florets are completely free of the stalk."
    },
    {
      "title": "Cut the florets free.",
      "content": "Cut the florets free. Start from the outside and work your way in to the center of the floret cluster. You might also peel the florets apart, though doing so will usually require you to make an addition cut or snip to even up the ends of the peeled free broccoli. Ideally, you should cut the florets about an inch down from where their flowering part begins. If you are going to cook the florets, try to make them all roughly the same size so that they cook at the same speed. If you intend to eat the florets raw, the size will not matter and you won’t have to trim them down to an even size."
    },
    {
      "title": "Continue to cut the florets moving inward.",
      "content": "Continue to cut the florets moving inward. As you cut the outer florets free, you'll be able to move up the stalk, which will result in less trimming later. Cut the florets free until you have removed them all from the stalk. [5] X Research source"
    },
    {
      "title": "Trim the stems of your florets to an even length.",
      "content": "Trim the stems of your florets to an even length. Regular sized broccoli doesn’t just look more pleasing to the eye, it also helps ensure that your broccoli cooks evenly when being prepared for whatever dish you are making. You should leave about ½ inch (1.27 cm) of the stems attached to your florets. Cutting off too much stalk from the floret can result in your broccoli crumbling apart while cooking or handling."
    },
    {
      "title": "Cut your florets into smaller pieces, if desired.",
      "content": "Cut your florets into smaller pieces, if desired. Large, fluffy pieces of broccoli can be a delicious side dish to a meal, but when served in a mixed dish, like stir fry, pieces that are too large can throw off the balance of the mix. Take larger florets of your broccoli and: Cut the floret in half with your knife or scissors. For smaller pieces of broccoli, halving once may be sufficient for balancing the size of the broccoli. Or... Halve the two resulting pieces again for larger florets of broccoli. Especially large pieces may need to be quartered for the best size ratio. Keeping your quartered florets a consistent size will also help them cook at an equal rate. [6] X Research source"
    },
    {
      "title": "Remove the inedible, bottom part of the stalk.",
      "content": "Remove the inedible, bottom part of the stalk. The very bottom of the stalk will be too woody and tough for you to eat. Use your knife or scissors to cut the bottom inch to 2 inches (2.54 to 5 cm) off of the stalk. This part can be either thrown away or composted . [7] X Research source"
    },
    {
      "title": "Use a vegetable peeler to remove tough skin.",
      "content": "Use a vegetable peeler to remove tough skin. The stalk of your broccoli is very similar in nutritional content to the florets, and is sometimes even served in restaurants. However, you'll first have to run a vegetable peeler over it to take off the tough outer layer of skin. In restaurants, cut broccoli sticks, when cooked, are often served under the name \"coins.\" [8] X Research source"
    },
    {
      "title": "Cut your stalks into thin sticks.",
      "content": "Cut your stalks into thin sticks. Since the stalk of your broccoli is heartier and denser than your florets, it will take longer to cook. This is why you should cut your stalks into thin sticks, about the size of a normal carrot stick. Use your knife to halve the stalk vertically. Hold these halves together and cut once again crosswise vertically to quarter your stalk. For especially thick stalks, you can continue halving in this fashion until each piece is as thin as you desire. The process of cutting vegetables into thin sticks of often called “Julienne style.” This is a common method of preparation, so you might want to learn more about how to julienne vegetables . You can also line up and cut the stalks with your knife or scissors to cube the sticks."
    }
  ]
}