{
  "url": "https://www.wikihow.com/Become-Friends-With-a-Guy",
  "title": "How to Become Friends With a Guy",
  "steps": [
    {
      "title": "Find someone to become friends with.",
      "content": "Find someone to become friends with. Look for a guy you know who is either interested in being mates with you, has the same interests as you, or would make a good friend. It's good if the guy has at least one interest similar to you, so that you have something in common to do together or talk about. This is a great way to get a guy to talk to you ."
    },
    {
      "title": "Talk to the guy you wish to befriend as you would with any other person.",
      "content": "Talk to the guy you wish to befriend as you would with any other person. Talk about the weather, the activities you're doing together, sports, upcoming events, general interests, etc. Make note of things you know he is interested in. Ask questions to find out what he likes, and use that to keep the small talk rolling. Be clear and let the guy know that you want to talk about his favorite topics too. Watch out for any flirting from either of you––you don't want him getting the wrong impression!"
    },
    {
      "title": "Confirm your friendship by offering to keep in touch.",
      "content": "Confirm your friendship by offering to keep in touch. It's important that your new guy friend is able to understand that you are now friends. Give that guy some room, let him go to other people and see new faces other than just yours. If you see that guy during the day, say \"hi\" or wave, let him know you're there without getting in his face. He will hopefully realize that you're being friendly. Again, be watchful for flirting––the last thing you want is that awkward wrong impression."
    },
    {
      "title": "Get that guy together with a couple of your other friends.",
      "content": "Get that guy together with a couple of your other friends. It's always better to be with a group and get to know each other than to keep it wrapped up in a tight area with just you two. Being in a crowd simply lets him know that you want his attention for talking and hanging, not anything more. Once he's comfortable with your friends and you, ask him if he wants to hang out. If he says he can't, don't be worried."
    },
    {
      "title": "Avoid crowding him.",
      "content": "Avoid crowding him. Sometimes, it is tempting to be too much in a guy's face. This is annoying. If he is annoyed by you, you can easily tell as he'll keep his distance and not seem eager to see you. Don't be put down if he says no to your suggestion of hanging out. If you are becoming friends, then there will be plenty of other opportunities!"
    },
    {
      "title": "Build up your confidence.",
      "content": "Build up your confidence. Find things you're great at, and praise yourself. It may seem silly, but repeating, \"I'm great at _______, and I'm proud of it,\" in the mirror for ten times a day will help. It's easier to make and maintain friendships when you feel confident. [1] X Research source"
    },
    {
      "title": "Take care of basic hygiene.",
      "content": "Take care of basic hygiene. Shower regularly and use deodorant. Trim your nails and get your hair cut. Wear clothes you would wear normally. Don’t overdo the makeup and perfume. Makeup used in excess can be off-putting, and some people are allergic to perfume. [2] X Research source"
    },
    {
      "title": "Be yourself.",
      "content": "Be yourself. See if your school has a club that deals with your favorite activity. If you’re home-schooled, there are many businesses like art programs that would love to have you join them."
    },
    {
      "title": "Have some conversation ideas ready to hand for when try to talk to him.",
      "content": "Have some conversation ideas ready to hand for when try to talk to him. If you're doing an activity, use what you're doing to make for instant conversation. If you want to talk about something else, talk about things like: [3] X Research source How gross the lunch was today – “Was there something crawling in the meatloaf surprise?” How the weather is today. An old standby, but still a great conversation starter. How the football game went. Many guys like sports, and if you went to or heard about the big game, he would love to talk to you about it."
    },
    {
      "title": "Show interest.",
      "content": "Show interest. [4] X Expert Source John Keegan Dating Coach Expert Interview. 18 November 2019. If you liked your conversation, tell him you have to go but would love to talk to him again about the same things, to learn more. When you see him again, talk to him by picking up where you both left off. The more you talk, the better bond you’ll grow. Friendships grow and bloom through conversation, it just takes time."
    },
    {
      "title": "Invite your new friend over to do things together and have a great time hanging out.",
      "content": "Invite your new friend over to do things together and have a great time hanging out. Tease him and have fun with him. [5] X Expert Source John Keegan Dating Coach Expert Interview. 18 November 2019. Just don't go to far or do it too much in case you come across as forcing the relationship. Your friendship will become as strong as ever by taking it easy and enjoying being in each other's company."
    }
  ]
}