{
  "url": "https://www.wikihow.com/Adjust-a-Lazy-Susan",
  "title": "How to Fix a Lazy Susan Corner Cabinet: Simple DIY Steps",
  "steps": [
    {
      "title": "Spin the lazy susan to pinpoint where rotation problems are occurring.",
      "content": "Spin the lazy susan to pinpoint where rotation problems are occurring. When a lazy susan is stiff and difficult to rotate, it’s usually a problem with the center shaft or the position of its bottom shelf. Lightly spin the lazy susan and examine the cabinet for any spots where it locks up, has difficulty turning, or has poor clearance. If the movable center shelf begins to bind, it will prevent free rotation. In this situation, loosening this shelf will fix the problem. If the circular shelves slip down the center shaft, the bottom shelf may start to drag, making it difficult to turn. Adjusting the height of this shelf fixes the problem."
    },
    {
      "title": "Locate the locking bolt to adjust the center shaft.",
      "content": "Locate the locking bolt to adjust the center shaft. Look at the top of the center shaft for one large bolt locking the exterior shaft to a metal sleeve positioned inside the shaft. This is the locking bolt for the shaft. [1] X Research source This bolt holds the center shaft in place and maintains the length of the shaft. Sometimes, excess pressure from this bolt can cause the shaft to bind. On some models, the locking bolt might be located at the bottom of the lazy susan. However, in most cases, it’s near the top."
    },
    {
      "title": "Loosen the bolt just enough to move the shaft’s hardware.",
      "content": "Loosen the bolt just enough to move the shaft’s hardware. If there’s anything in your lazy susan, clear it out to give yourself more space to work. Using a wrench or ratchet, loosen the bolt by turning it one-quarter of a full rotation counterclockwise. At first, the bolt may require some elbow grease to break loose. According to Goldenberg, “most lazy susans are made to be easily adjusted in this way.” Only loosen the bolt enough to manipulate the hardware inside the center shaft. On some models, this might require more or less than one-quarter rotation. Generally, it’s better to loosen the bolt in small increments. This will prevent you from loosening it too much, which could result in the alignment of the Susan being thrown off."
    },
    {
      "title": "Move the adjusting sleeve to give the lazy susan more space to rotate.",
      "content": "Move the adjusting sleeve to give the lazy susan more space to rotate. Now that the bolt is loose, adjust the center shaft. To do this, slide the metal adjusting sleeve that the bolt was holding in place no more than 1 inch (2.5 cm) to provide better clearance between the center shaft and top of the cabinet. [2] X Research source Work in small increments when adjusting the center shaft. Large adjustments could cause the lazy susan to topple over."
    },
    {
      "title": "Tighten the bolt to finish adjusting the center shaft.",
      "content": "Tighten the bolt to finish adjusting the center shaft. Use your wrench or ratchet to carefully refasten the locking bolt in place. Do not over-tighten the bolt. It should be looser than it was initially, but still tight enough to hold the adjusting rod in place. [3] X Research source"
    },
    {
      "title": "Loosen the locking screws using a Phillips-head screwdriver.",
      "content": "Loosen the locking screws using a Phillips-head screwdriver. Goldenberg tells us that loosening the screw on the discbone or metal shaft in the center of the lazy susan is the first step to adjusting the shelf height. Most lazy susans have 2 or more locking screws located at the center of each shelf. These screws hold the shelves to the center shaft. [4] X Research source Screws can be left in their holes once they have been unattached from the center shaft. However, you may want to set them to the side to avoid losing them. When all of the shelves are held together by the front panel, adjust the whole unit at the same time instead of lifting individual shelves. If the shelves must be adjusted separately, you'll only need to loosen the locking screws on the bottom shelf."
    },
    {
      "title": "Raise the shelves so they no longer catch on the cabinet frame.",
      "content": "Raise the shelves so they no longer catch on the cabinet frame. Carefully lift the bottom shelf or entire shelf system until there is roughly half an inch (1.25 cm) of space between the bottom shelf and the bottom of the cabinet. The shelves may resist this adjustment and begin binding on the center shaft. Keep maneuvering them gently back and forth until they are level and at a suitable height. Under no circumstances should you lubricate the center shaft. Doing so could prevent the screws from holding their position."
    },
    {
      "title": "Tighten the screws to secure the shelf in its new position.",
      "content": "Tighten the screws to secure the shelf in its new position. It’s important to tighten the screw again after you adjust the shelf to the correct balance and height, cautions Goldenberg. Hold the shelf in place with one hand and use your free hand to tighten the locking screws back in place with a screwdriver. [5] X Research source Take care not to let the shelf slip as you reattach fasteners, as this could cause it to become uneven or binding. Make the screws as tight as possible without stripping any of the hardware. The shelves must be stationary and secure to prevent this kind of misalignment."
    },
    {
      "title": "Find the spot where the doors don’t have enough clearance to turn.",
      "content": "Find the spot where the doors don’t have enough clearance to turn. Door problems are usually easier to identify than rotation problems. The door of the unit may close unevenly, or it may not have sufficient clearance at the top, bottom, or sides of the cabinet. If the door does not close completely or closes unevenly, adjust it until it’s centered within the frame. When there’s not enough top or bottom clearance, you'll notice that the gaps on both sides of the door are unequal. When the side clearance is insufficient, the door appears crooked. Additionally, the gaps around it will but unequal. [6] X Research source"
    },
    {
      "title": "Loosen the collar screw to fix doors that close unevenly.",
      "content": "Loosen the collar screw to fix doors that close unevenly. Open the door and locate the collar at the top of the unit. [7] X Research source For many models, this part will be made of white plastic. Use a Phillips-head screwdriver to loosen the screw on this collar. Loosen the screw by one full counterclockwise rotation. Even loosened, the screw should remain in its position in the collar."
    },
    {
      "title": "Rotate the shelf unit and door counterclockwise.",
      "content": "Rotate the shelf unit and door counterclockwise. Using both hands, carefully rotate the entire shelf unit and door in a counterclockwise direction. Continue until the collar hits the catch latch located at the back of the ceiling bracket. [8] X Research source Turn the Lazy Susan slowly. Listen for a slight click. This is a signal that you've reached the catch latch. Once you hit the catch latch, the collar should be properly aligned with the spring. You should feel a slight resistance to additional counterclockwise turning."
    },
    {
      "title": "Rotate just the door in a clockwise direction until it reaches the center-front.",
      "content": "Rotate just the door in a clockwise direction until it reaches the center-front. If possible, take a step back and check the alignment from a distance. Make sure the door is precisely in place before moving on. [9] X Research source Make sure the plastic collar stays in place as you rotate the door. This can make it difficult to gauge the door position. Ask a friend or family member for help. If you accidentally rotate past the center-front position, continue rotating the door in a clockwise direction. Do not rotate it counterclockwise until after you finish setting it."
    },
    {
      "title": "Slowly rotate the entire assembly in a counterclockwise direction.",
      "content": "Slowly rotate the entire assembly in a counterclockwise direction. Continue turning the assembly until the collar screw faces you. Make sure the door and collar maintain their alignment as you turn the assembly. [10] X Research source It may help you to maintain the position of the collar and door by marking their correct positions with a piece of painter’s tape or masking tape."
    },
    {
      "title": "Tighten the screw in its original position to finish adjusting uneven doors.",
      "content": "Tighten the screw in its original position to finish adjusting uneven doors. Give the lazy susan a few spins to check that everything works correctly, and your door adjustment is finished. [11] X Research source To prevent the collar from twisting out of place while it’s fastened, you may need to hold it in place as the screw is tightened."
    },
    {
      "title": "Remove the retainer clip to improve top and bottom clearance.",
      "content": "Remove the retainer clip to improve top and bottom clearance. Locate the plastic retainer clip at the bottom of the center shaft. Firmly grasp the clip between your fingers, open it, and pull it out. A cut-out portion of the shaft with a thumbscrew adjustment wheel is under the clip. [12] X Research source Do not attempt to complete the process when the shelves are loaded, especially if they are heavily loaded. Make sure it’s completely empty when you make this adjustment."
    },
    {
      "title": "Turn the thumbscrew adjustment wheel to raise or lower the door.",
      "content": "Turn the thumbscrew adjustment wheel to raise or lower the door. Use your fingers to turn the thumbscrew adjustment wheel in the cut-out portion of the center shaft. Rotate the wheel clockwise to raise the door and counterclockwise to lower the door. [13] X Research source Each full rotation of the screw adjusts the height by about 1/32 in (0.8 mm). Apply gentle pressure to the underside of the bottom shelf to aid the adjustment if you are attempting to raise the door. [14] X Research source"
    },
    {
      "title": "Replace the retainer clip to complete the top and bottom adjustment.",
      "content": "Replace the retainer clip to complete the top and bottom adjustment. After adjusting the door to the proper height, return the retainer clip to its original position at the bottom of the pole. Fasten the clip firmly into place. [15] X Research source It's a good idea to tighten all of the adjustment screws attached to the center shaft, shelves, and door after setting the height. Doing this helps prevent the door from falling out of alignment again."
    },
    {
      "title": "Outline the top and bottom brackets when side clearance is insufficient.",
      "content": "Outline the top and bottom brackets when side clearance is insufficient. Using an erasable pencil, lightly outline the current position of the top and bottom brackets. If the lighting is too poor inside the cabinet to make these marks easily, use a flashlight or electric lantern. The marks give you a reference point to work from as you make the adjustment. Erase the pencil marks once you complete the process."
    },
    {
      "title": "Realign the pivot pole from the top.",
      "content": "Realign the pivot pole from the top. Use a screwdriver to remove the setscrews and loosen the star washers holding the pivot housing in place on both sides of the pivot pole. Adjust the pivot housing and pivot pole until both are centered and aligned. [16] X Research source When the star washers are in place but before fastening the setscrews, take a step back and look over your lazy susan. If the side clearance is still uneven, remove the washers and readjust the pivot. Use your pencil marks to guide your adjustments. For example, if the left side is low, you’ll likely need to move the pivot pole and housing to the right."
    },
    {
      "title": "Refasten the pivot housing by putting the setscrews in their original position.",
      "content": "Refasten the pivot housing by putting the setscrews in their original position. Once you tighten the star washers, you’ll be ready to return the setscrews to their original position. When the screws are in place, check the side clearance of the lazy susan to make sure that you didn’t knock it out of alignment as you refastened its hardware. [17] X Research source"
    },
    {
      "title": "Realign the pivot base when necessary.",
      "content": "Realign the pivot base when necessary. If the lower half of your lazy susan appears misaligned after refastening the setscrews, it may be necessary to adjust the pivot base in addition to its top. To do this, open the door wide enough to expose the bottom bracket on either side of the lazy susan. Loosen the bracket by removing the fastening setscrew and star washer with a screwdriver. Then, realign the pivot cam (metal arm) base so that it’s centered. [18] X Research source Repeat the process on the opposite side of the lazy susan where you’ll find an identical bracket/pivot cam base. Work on one bracket at a time. After you’ve taken apart, realigned, and refastened the first bracket, move on to the next one. When properly centered, the pivot cam bases of both sides are aligned to the center pole."
    },
    {
      "title": "Replace the star washers and reattach the setscrews to fasten the bracket.",
      "content": "Replace the star washers and reattach the setscrews to fasten the bracket. Be careful when refastening. If you jostle the pivot cam, you may knock it out of alignment. When you’ve fastened the first side, adjust the opposite side's bottom bracket/pivot cam base."
    },
    {
      "title": "Check the door to make sure it’s aligned and has adequate clearance.",
      "content": "Check the door to make sure it’s aligned and has adequate clearance. Sometimes these alignments (especially those made to pivots) can require several attempts before they are resolved. Double check door alignment after completing the top and bottom adjustments, especially. [19] X Research source If the side clearance is still unequal, you will need to readjust the top pivot pole and/or bottom pivot cams."
    }
  ]
}