{
  "url": "https://www.wikihow.com/Control-Your-Mind",
  "title": "How to Control Your Mind",
  "steps": [
    {
      "title": "Avoid rumination.",
      "content": "Avoid rumination. You may find yourself thinking about something negative, even when you really don't want to. There are a number of tricks you can use to control your mind and stop ruminating: Think about the worst-case scenario. Although this seems counter-intuitive and like it would just lead to even more ruminating, when you think about the worst-case scenario, and then think about whether you would be able to handle it; you'll likely find that you can imagine yourself handling the situation and this can help decrease your worry. Schedule time for yourself to worry. By setting aside time to think about your problem, you can rest assured that it will get the attention it (maybe) needs; this can help you stop thinking excessively about your problem when you don't want to. Go for a walk. Getting out and about can get your mind off of your worries, either simply because of the exercise itself or because you will be taking in new information (sights, sounds, smells) which can help your mind wander to other, less distressing things."
    },
    {
      "title": "Believe in yourself and that you can change.",
      "content": "Believe in yourself and that you can change. If you don't believe that you can change you're not going to try nearly as hard as if you believe success is possible. So, make sure that you're using positive thinking to face your problem. Try to keep in mind that you can change the way you think, that you can improve. Renounce old habits in favor of a more effective lifestyle. Your subconscious mind where all your habits are recorded is a comfort zone that provides the feeling of familiarity, safety, and confidence. You can do the same things every day, tread the same routs, undertaking no risks. But what about your bold dreams and ambitious plans? To make some great things happen, as well as grow and develop as a person, you have to leave this comfort zone and undertake some risks in the pursuit of a better tomorrow. Studies show that individuals adopting this \"growth\" mindset are more likely to make desired improvements than those who view their traits and skills as fixed and unchangeable."
    },
    {
      "title": "Be optimistic about your abilities.",
      "content": "Be optimistic about your abilities. You might think that being accurate about your ability to control yourself is key. However, studies show that being overly optimistic about your ability to control your behavior can help give you even more self-control. [1] X Research source To be optimistic, try telling yourself that you will succeed and control your mind over and over again, even if in the moment you don't believe so. Try also to remind yourself of times where you successfully controlled your mind as intended. Reflect only on these successes and not on any self-control failures you might have had."
    },
    {
      "title": "Re-appraise what you are struggling to control.",
      "content": "Re-appraise what you are struggling to control. Try changing how you look at the thing you are struggling to control. For example, if a part of your mind really wants to have wine but you are trying to stop drinking, try imagining the wine as poison. Imagine it going all through your body, infecting your cells and organs. Studies show that having individuals mentally transform (re-appraise) desirable things into less desirable things facilitates their self-control efforts to avoid the desirable thing. [2] X Trustworthy Source Mind U.K.-based mental health charity focused on providing advice and resources to anyone facing mental health problems. Go to source To do this, really try vividly imagining and playing along with the idea that the object you wish to avoid has changed its properties."
    },
    {
      "title": "Stop overgeneralizing.",
      "content": "Stop overgeneralizing. Overgeneralizing means taking a single occurrence of a negative experience and projecting it onto other experiences or to your predictions about how the future will be. For example, someone who overgeneralizes might say, \"I had a difficult childhood, so my life is going to be difficult forever.\" To stop overgeneralizing, you might: [3] X Research source Take it upon yourself to change your own future through hard work and persistence. For example, if you had a difficult childhood and think your life is going to be difficult forever, you might identify ways in which you want your life to improve, and work to improve them. Continuing the example, perhaps you want more meaningful relationships and a better job. You might research ways to obtain those things and then set goals for yourself in those domains to accomplish."
    },
    {
      "title": "Avoid personalization.",
      "content": "Avoid personalization. This is a thought trap where you take personal responsibility for things that are out of your control. For example, if your daughter fell down at school you might say \"It is my fault that she fell\" when in reality the situation was entirely out of your control. [4] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source To avoid personalization, try to think carefully and logically about events that you are personalizing. It can help to ask yourself some questions. For example, you might ask yourself \"What could I actually have done to stop my daughter from falling down, given that I wasn't at school with her?\""
    },
    {
      "title": "Stop jumping to conclusions.",
      "content": "Stop jumping to conclusions. This is a thought trap that involves thinking certain things without any evidence to back those thoughts up. [5] X Research source For example, someone who jumps to conclusions might think that a person doesn't like him without any evidence supporting that assertion. To stop jumping to conclusions, you can pause and think more before reaching judgments. It can help to ask yourself questions about the thought. For example, you can ask yourself if you really know that the thought you are having is true. You can also ask yourself to identify specific pieces of evidence that would suggest that the thought is true. Using the prior example, someone who thinks a person doesn't like him might ask himself to identify particular conversations with that person that provide evidence for the claim."
    },
    {
      "title": "Avoid catastrophizing.",
      "content": "Avoid catastrophizing. This is a negative thought trap wherein the person blows things out of proportion. For example, someone who is catastrophizing after failing a test might say \"My life is ruined, I'll never get a good job now.\" [6] X Research source </ref> To stop catastrophizing, work on thinking more positively. You can also ask yourself questions that employ logic and reason. For example, someone who failed a test and thinks his life is ruined because he will never get a good job might ask himself: \"Do I know anyone who has failed a test yet still gotten a good job and/or seems happy?\" \"If I was hiring someone would I make my entire decision based on that person's grade in a single class?\""
    },
    {
      "title": "Create a plan for your life.",
      "content": "Create a plan for your life. If you have a clear path for what you want in life, you may be less likely to be swayed by temptations that will hurt you in the long run. Write down the major things you want out of life: Is it a good career? Having a family of your own one day? Becoming financially wealthy? [7] X Research source You don't have to lay out very detailed steps for achieving these goals as part of this exercise; instead, remember to keep your overarching goals in mind so you stay on track in your life. To form personal goals, it is important not to set the bar too high or else you will fail and this can kill your motivation. Instead, set some big goals (e.g., learn how to code software), but break those bigger more distal goals into smaller more achievable goals (e.g., read 1 chapter of a software coding book every week). In this way you can see tangible amounts of progress as you work toward accomplishing your more distal goals."
    },
    {
      "title": "Smile, even if you don't feel like it.",
      "content": "Smile, even if you don't feel like it. Negative feelings can reduce self-control and make it more difficult for you to control your mind. [8] X Research source One way to counteract negative feelings is, simply, to smile. Although the idea that feeling happy causes you to smile is more intuitive, the facial feedback hypothesis suggests that smiling can actually cause you to feel happiness. [9] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source"
    },
    {
      "title": "Spend time or money on others.",
      "content": "Spend time or money on others. Research shows that spending on others can increase happiness and well-being. Happiness and well-being can increase your self-image and reduce negative feelings that make self-control more difficult. [10] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source [11] X Research source Exactly how you spend your time or money on others isn't that important. What matters is that you and those you are helping find it valuable."
    },
    {
      "title": "Create obstacles for yourself.",
      "content": "Create obstacles for yourself. One way to control your mind is to make it more difficult for it to get what it wants. This extra effort will make it so that part of your mind is less likely to win out and influence your behavior. For example, if you want to control the part of your mind that wants to watch TV when a part of you wants to cut down on your TV watching time, you could put your remote control in a difficult to reach spot. [12] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Another example is that if you keep hitting the snooze button in the morning, you could place your alarm clock far from your bed, so that you are forced to get out of bed to turn it off. A further example is if you are having trouble refraining from sex, and you want to change this behavior, you could avoid putting yourself in situations that lead to sex: you could stay away from bars, nightclubs, and you could delete the phone numbers of people you sometimes hook-up with."
    },
    {
      "title": "Reward your successful self-control efforts.",
      "content": "Reward your successful self-control efforts. When you successfully control your mind, reward yourself so that you are more likely to continue to do so in the future. [13] X Research source For example, say you really didn't feel like exercising but you forced yourself to do it anyways, reward yourself with a piece of chocolate or with an episode of your favorite TV show. Be careful not to make the reward too excessive or you may find yourself out of control and back to square one where you started. For example, if your goal is to lose weight and you controlled your mind and exercised when you didn't feel like it, don't eat several chocolates or you will just lose the progress that you made."
    },
    {
      "title": "Punish unsuccessful self-control efforts.",
      "content": "Punish unsuccessful self-control efforts. Just like rewarding successes can aid in future self-control, punishing yourself for self-control failures can aid in future self-control as well. In fact, studies show that the threat of punishments can lead people to exert more self-control. To ensure the punishment's effectiveness, place it in the hands of a family member, friend, or partner and tell them to dish it out if you fail to exert the self-control you desired. For example, they could hide your dessert and, at the end of the day if you failed to achieve your self-control goals, they could withhold that dessert from you."
    },
    {
      "title": "Reduce stress.",
      "content": "Reduce stress. The mind and body are deeply connected; the mind can make the body stressed, and physiological stress in the body can lead the mind to feel stressed. [14] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source When people are stressed they exert self-control to deal with those stressors and often have reduced self-control afterwards. [15] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source As such, it is important to reduce stress to conserve self-control energy. There are a number of ways to reduce stress with evidence showing they work to some degree [16] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source : Try relaxation techniques such as deep abdominal breathing, which involves breathing in deeply and holding your breath for a few seconds then slowly exhaling over the course of several seconds. You may also try focusing your mind on a single soothing word (such as calm or peace). Get some exercise, which will help you to breathe deeply and relax your tense muscles. Talk to friends and family, since social support can act as a buffer against stress. [17] X Research source"
    }
  ]
}