{
  "url": "https://www.wikihow.com/Apply-Highlight-and-Lowlight-Foils-to-Hair",
  "title": "How to Apply Highlight and Lowlight Foils to Hair",
  "steps": [
    {
      "title": "Pick your lowlight colors.",
      "content": "Pick your lowlight colors. Choose hair colors one to two shades darker than natural color for natural results. For more dramatic results, go for shades two to four shades darker. If this is your first time dyeing your hair, you may want to try using temporary or semi-permanent dye rather than permanent dye. Temporary dyes tend to wash out after one shampoo. [1] X Research source Semi-permanent dyes will wash out after 20 to 26 shampoos. Permanent dyes may fade, but they usually stay in your hair until it grows out."
    },
    {
      "title": "Pick your highlight colors.",
      "content": "Pick your highlight colors. Highlights are essentially the opposite of lowlights. Highlight colors should be one to two shades lighter than your natural hair color. For more dramatic results, go for shades three to four shades darker. You may need to bleach your hair to highlight it, which is best done in a salon."
    },
    {
      "title": "Divide your hair into five sections.",
      "content": "Divide your hair into five sections. Make sure your five sections are roughly even. There should be one section on the top of your head. Then, on either side of your head, separate the hair into two sections. When you're done, you should be left with one section of hair on top and four sections on the sides. Use rubber bands or hair clips to secure your hair. [2] X Research source In other words, you should have three sections in the front of your head, and two in the back."
    },
    {
      "title": "Use the slicing method to separate hair for a more dramatic look.",
      "content": "Use the slicing method to separate hair for a more dramatic look. Let down one of the sections. Starting at the top of the section, insert the end of your comb through your hair. Only a very thin section of hair should be on top of the end of the comb. Remember that for both highlight and lowlights, you should apply dye to very thin chunks of hair. This method creates more defined highlights and lowlights."
    },
    {
      "title": "Use the weaving method to separate hair for a more natural look.",
      "content": "Use the weaving method to separate hair for a more natural look. Weaving and slicing are very similar, except when weaving you move the end of the comb through the surface of the hair in a subtle in-and-out pattern (rather than “slicing” in a straight line) to separate pieces of hair. [3] X Research source The weaving method produces less defined, more natural-looking highlights and lowlights."
    },
    {
      "title": "Protect yourself and your surroundings from stains.",
      "content": "Protect yourself and your surroundings from stains. Wrap a towel you are comfortable getting dye on around your shoulders. The towel will catch any dye drips and you can use it to dry your hair after the rinsing phase of the dyeing process. Secure the towel in place in front of your neck with a clip or safety pin."
    },
    {
      "title": "Put on your dyeing gloves.",
      "content": "Put on your dyeing gloves. Dyeing kits generally come with gloves, but if yours doesn’t come with gloves, you can just wear normal latex or rubber gloves. Wearing gloves ensures that you don’t dye your fingers and nails along with your hair."
    },
    {
      "title": "Apply your foil underneath the hair.",
      "content": "Apply your foil underneath the hair. Take a piece of foil that is large enough to easily cover a given section of hair. Slide it underneath the section you just secured. Let the hair rest on top of the foil. The foil should create a barrier between the strand you pulled out using the comb and the rest of the hair in the section you're working with. It's a good idea to start in the back and work your way forward, because the hair at the back of your head is typically harder to lighten. [4] X Expert Source Martin Nepton Professional Hair Stylist Expert Interview. 17 November 2020."
    },
    {
      "title": "Decide on the pattern you're following.",
      "content": "Decide on the pattern you're following. You will apply your highlights and lowlights in a consistent pattern throughout your head. You can start with one highlight, and then move to two lowlights, and repeat this pattern throughout the section, for example. Choose whatever pattern you prefer depending on the ratio of highlights to lowlights you want. [5] X Research source Highlighting means coloring strands lighter than your natural hair color while low lighting means coloring strands darker than your natural color."
    },
    {
      "title": "Coat the hair above the foil in the highlight dye.",
      "content": "Coat the hair above the foil in the highlight dye. Use the brush that came with your dye kit. Dip your brush in a small amount of the highlight dye. Then, brush the dye into the section of hair above the foil so it's evenly saturated from root to tip. As you brush, the hair should become plastered to your foil. [6] X Research source You can leave the hair for now as you continue to apply foils/dye. You will fold up the foils when you're done with the section."
    },
    {
      "title": "Section off another layer of hair.",
      "content": "Section off another layer of hair. Repeat the same process you did with the tail comb before, moving downward through the section of hair. Just below the hair you just died, slip the end of the comb under a small strand of hair. Place a piece of foil under that strand to create a barrier between this new strand and the remaining hair in the section. [7] X Research source"
    },
    {
      "title": "Apply your lowlight dye.",
      "content": "Apply your lowlight dye. You should add your lowlight dye to this section to create variation. This is the exact same process as before. Gently paint the dye on the hair using the brush that came with your kit, moving from root to tip. Again, the hair will become plastered to the foil. [8] X Research source"
    },
    {
      "title": "Repeat this pattern until all the hair is dyed.",
      "content": "Repeat this pattern until all the hair is dyed. Keep moving from your highlight and lowlight shades, using the ratio you want. Continue the pattern until the entire section is dyed and separated by foils. [9] X Research source"
    },
    {
      "title": "Fold your foil.",
      "content": "Fold your foil. Gently fold the pieces of foil around each section of hair. Do not press too hard to avoid getting a folded crease in your dye. The ends of the foil should be near the roots of your hair when you're done. Folding the foil helps it stay in place while you dye the remaining sections. The foil will conduct the heat from your scalp, which will help the dye work faster. [10] X Expert Source Martin Nepton Professional Hair Stylist Expert Interview. 17 November 2020."
    },
    {
      "title": "Repeat this pattern to dye the remaining sections.",
      "content": "Repeat this pattern to dye the remaining sections. For every section, repeat the exact same pattern to highlight or lowlight your hair. Separate your hair into small strands, using the foil as a barrier, and then paint dye on each strand. Vary between your highlight and lowlight shade. Once every strand is dyed, wrap the foil around the strands. Remember, you may have to bleach your hair first in the sections you're highlighting. This is usually best done at a salon and should be done before you start the highlight/lowlight process."
    },
    {
      "title": "Let the dye sit in for the recommended timeframe.",
      "content": "Let the dye sit in for the recommended timeframe. Refer to the instructions on your dye to figure how long to let it sit in. Times will vary depending on the type of dye you're using. Do not leave the dye in longer than recommended, as this can damage your hair."
    },
    {
      "title": "Rinse your hair in cold water.",
      "content": "Rinse your hair in cold water. Remove the foils from the bottom to the top. Use cool water to rinse out the excess dye. Continue to rinse your hair until the water coming off your head runs clear. It is totally natural to have a whole lot of color run in the shower. Do not panic if this happens. It does not mean your hair did not dye properly. It's a normal part of the process."
    },
    {
      "title": "Wash your hair with the post-dye conditioner found in your dyeing kit.",
      "content": "Wash your hair with the post-dye conditioner found in your dyeing kit. Your kit should come with this conditioner, but if it did not, you can purchase conditioner made for dyed hair at a drugstore. Do not wash your hair with shampoo or normal conditioner. You should avoid washing your hair with these things for 24 to 48 hours so that the dye has time to really into your hair shaft. [11] X Research source"
    }
  ]
}