{
  "url": "https://www.wikihow.com/Avoid-Copyright-Infringement",
  "title": "How to Avoid Copyright Infringement",
  "steps": [
    {
      "title": "Know what copyrights protect.",
      "content": "Know what copyrights protect. Copyright law protects any original creation, and grants the holder of the copyright exclusive control over when, how, and by whom their work may be copied, distributed, or exhibited. This includes literary works, paintings, photographs, drawings, films, music (and its lyrics), choreography, sculptures and many other creative works."
    },
    {
      "title": "Know what isn't protected.",
      "content": "Know what isn't protected. Copyright law generally does not protect the underlying ideas of a creative work, and it does not protect facts. For example, copyright doesn't prevent you from expressing in your own words ideas and facts found in a book or journal you read. If you express ideas and facts in your own words, you should always give appropriate credit to the sources in which you found them. It is common courtesy to do so, and not doing so could constitute a violation of the Copyright Act. What you have created may constitute a derivative work pursuant to the Copyright Act, unless you have obtained license or permission from the copyright holder to create the work. It may also constitute plagiarism under state common law. Paraphrasing other people's work may also constitute plagiarism under state common law, and may run afoul of misappropriation statutes."
    },
    {
      "title": "Don't confuse copyrights, trademarks, and other forms of \"intellectual property.\"",
      "content": "Don't confuse copyrights, trademarks, and other forms of \"intellectual property.\" The term \"intellectual property\" itself has led to these very different things being confused with each other. As Richard Stallman says, \"Non-lawyers who hear one term applied to these various laws tend to assume they are based on a common principle, and function similarly. Nothing could be further from the case. These laws originated separately, evolved differently, cover different activities, have different rules, and raise different public policy issues.\" [1] X Research source Trademarks, for example, forbid using certain words, marks, symbols, and so on within certain contexts to protect consumers from misrepresentation. Copyright would not prevent you from, for example, writing some new text editor software and calling it \"Microsoft Text Editor\", but trademark law would."
    },
    {
      "title": "Learn about the public domain laws for your jurisdiction.",
      "content": "Learn about the public domain laws for your jurisdiction. \"Public domain\" is short-hand for \"uncopyrighted\", not \"publicly distributed\". A work can be out of copyright due to age, by the nature of authorship, or other reasons. In the United States, all works authored by a federal government (not state government!) employee during the course of their official duties are public domain, as are all works published before 1923. Works first created in the European Union will usually be copyrighted until 70 years after the death of the author."
    },
    {
      "title": "Don't take anything from the Internet, or anywhere else, because it is almost always copyrighted, by default.",
      "content": "Don't take anything from the Internet, or anywhere else, because it is almost always copyrighted, by default. \"I found it on the Internet\" is not a defense against copyright infringement; works on the Internet are as copyrightable as any other kind of work. Nor is \"it didn't say it was copyrighted.\" In nearly all jurisdictions, including the United States, and all other Berne Convention signatories, it is not necessary for a work to have an explicit copyright notice for it to be copyrighted. [2] X Research source Stim 2005, p. 257. <i>\"[T]he Berne Convention [...] specifies that no formalities—such as copyright notice—are necessary for gaining [copyright] protection.\"</i> It is also not necessary for copyright in a work to be registered; this simply makes it easier to be compensated in court. Without an explicit dedication to the public domain, assume that it is still under copyright. There is a quirk in the United States' implementation of the Berne Convention: works first published before 1978 without a copyright notice may be public domain in the United States. [3] X Research source Scott §2.42[E]. <i>\"A work published prior to January 1, 1978 [...] without the prescribed copyright notice or with a defective notice was injected into the public domain, and the author lost all copyright protection.\"</i> Works published under copyright notice are no longer covered by copyright after 75 years. They become public domain material. Works published by the US Government are public domain no matter when they were published."
    },
    {
      "title": "Be creative.",
      "content": "Be creative. If ever you wonder whether a certain action would infringe on the copyright of someone else, the question to ask is: is this a creative work on my count, or am I simply drawing from the creativity of someone else? Lunches, as any economist would tell you, are not free. Some examples: Scanning something yourself does not, by itself, give you a new copyright over anything. You cannot scan a photograph from, say, a magazine and then put it on the Internet; the copyright would still reside with the author of the work. The flip-side of this is that scanning a work which is in the public domain would not, in many jurisdictions, give you the copyright over the resulting scan. Taking a screenshot of a video or a computer program does not generate a new copyright. The copyright in the resulting screenshot would still be held by the copyright holder of the original video or computer program. Some non-creative things are not copyrightable, for example, a plain text logo in a generic font. Neither are simple geometric shapes. But don't rely on this unless you are certain."
    },
    {
      "title": "Don't rely on \"fair use\".",
      "content": "Don't rely on \"fair use\". Called \"fair dealing\" in many jurisdictions, fair use is simply a guarantee that copyright laws do not infringe freedom of speech and make critical commentary impossible. Fair use is an extremely complex body of case law; it is often very difficult for non-lawyers to tell in advance whether or not a certain use will be considered fair use in court. If in doubt, seek permission first. [4] X Research source Hoffman, <i>Fair Use: Further issues.</i> <i>\"Fair use is at best an \"iffy\" defense and there is virtually no way that anyone can say, in advance, whether the defense will be successful. Thus, in any instance, the best and most advisable course of action is to license materials.\"</i> It is not a blank cheque granting you a right to do anything at all and call it \"fair use\". Some uses of text under \"fair use\" are teaching, critiques, comments, reporting, and research. It permits, for example, limited quoting of copyrighted material. In some jurisdictions, it would allow creating a copy for personal use (such as a backup) [5] X Research source UKCS (2009), <i>Fair Dealing: Permitted Acts</i> <i>\"Copying parts of a literary, dramatic, musical or artistic work or of a typographical arrangement of a published edition for the purpose of research or private study is allowed ...\"</i> ."
    },
    {
      "title": "Be wary about writing fiction based on other works.",
      "content": "Be wary about writing fiction based on other works. It was said above that \"ideas cannot be copyrighted\". However, fictional characters, [6] X Research source Stim 2007, p. 205. story-lines, and settings [7] X Research source To quote Chilling Effects, <i>\"What if these worlds were elaborately filled with details? [...] [N]ormal plots like boy-meets-girl cannot be copyrighted [...] but the more detailed the plot is, the more it becomes protectible expression.\"</i> can be copyrighted (insofar as they are original). This means that fan-fiction, drawings of characters from copyrighted works, and so on are all technically copyright infringements. Sometimes copyright holders turn a blind eye to this sort of thing, but unless it has been explicitly authorised, don't count on this being the case. Stock Characters, on the other hand, can not be copyrighted or trademarked."
    }
  ]
}