{
  "url": "https://www.wikihow.com/Animate-in-FireAlpaca",
  "title": "A Quick and Easy Guide to Animate in FireAlpaca",
  "steps": [
    {
      "title": "Create a new file by clicking \"File\" on the top of the screen or window and clicking \"New...\".",
      "content": "Create a new file by clicking \"File\" on the top of the screen or window and clicking \"New...\". Alternatively, use the keyboard shortcut Ctrl/Command + N."
    },
    {
      "title": "Review the dialog box \"Create New Image\".",
      "content": "Review the dialog box \"Create New Image\". Adjust the width, height, paper size, background color, and resolution to your liking. Once done, click \"OK\"."
    },
    {
      "title": "Click \"View\" at the top of screen or window and click \"Onion Skin Mode\".",
      "content": "Click \"View\" at the top of screen or window and click \"Onion Skin Mode\". This makes it possible to export the layers as frames and put them together in an animation, and also enables you to see multiple frames at once while animating."
    },
    {
      "title": "Create a new folder for the frames.",
      "content": "Create a new folder for the frames. When it comes time to export the layers, each layer will be its own PNG file. It is useful to have all these images in one folder to avoid cluttering your files."
    },
    {
      "title": "Select a brush and color, and draw your first frame.",
      "content": "Select a brush and color, and draw your first frame."
    },
    {
      "title": "Create a new frame by adding a new layer.",
      "content": "Create a new frame by adding a new layer. Click \"Layers\" at the top of the screen or window and click \"Add\"."
    },
    {
      "title": "Draw your next frame, using the last frame as a reference.",
      "content": "Draw your next frame, using the last frame as a reference. This is why onion skin comes in handy—it is far easier to draw a frame when you can see the last frame right under it."
    },
    {
      "title": "Continue adding and drawing frames, and going back to frames to edit them as necessary, until you are satisfied with your progress.",
      "content": "Continue adding and drawing frames, and going back to frames to edit them as necessary, until you are satisfied with your progress. You can easily duplicate frames by clicking \"Layers\" and clicking \"Duplicate\" while in the frame you want to duplicate. Add more frames in between frames by adding a layer, and dragging it in between the two layers you want it in. If you sketched your frames, go back to draw the lines and color the frames (unless you want a simplistic animation)."
    },
    {
      "title": "Click \"View\" and click \"AutoPlay\" to see your animation.",
      "content": "Click \"View\" and click \"AutoPlay\" to see your animation. You will see a dialog box and be able to adjust the FPS (frames per second, which determines the speed). You can go back to edit your frames if the animation does not turn out as expected, or you are not finished with it. Continue editing your animation and AutoPlaying it until you are satisfied."
    },
    {
      "title": "Click \"File\" and click \"Export Layers (Onion Skin Mode)...\".",
      "content": "Click \"File\" and click \"Export Layers (Onion Skin Mode)...\". Select the folder you made while setting up, and each layer will save itself as a PNG in that folder."
    },
    {
      "title": "Review the dialog box asking whether to open AlpacaDouga.",
      "content": "Review the dialog box asking whether to open AlpacaDouga. Click \"Yes\" (unless you choose to put the frames together in a separate program). This part of the article shows how to put together the animation in AlpacaDouga."
    },
    {
      "title": "Wait for AlpacaDouga to open in your web browser.",
      "content": "Wait for AlpacaDouga to open in your web browser. Then click the button that says \"Select all files (.gif/.jpg/.png)\". If the website opens in Japanese, the button will look similar. Select all the frames in the folder you exported the frames to, and scroll down the page to see your animation. You can change the website language to English or Japanese at the top right corner of the screen."
    },
    {
      "title": "Choose your desired FPS and completion size using the dropdowns, and click the large button that says \"Create a GIF Animation\".",
      "content": "Choose your desired FPS and completion size using the dropdowns, and click the large button that says \"Create a GIF Animation\". Make sure that \"Insert FireAlpaca Logo\" is unchecked, unless you want the FireAlpaca logo in your animation. You may not want to leave \"Loop Replay\" checked if you have a long animation."
    },
    {
      "title": "Wait for the large button to turn yellow and say \"OK!!",
      "content": "Wait for the large button to turn yellow and say \"OK!! Download.\" Click it to download your animation. It will take you to a download page for the GIF."
    },
    {
      "title": "See your result.",
      "content": "See your result."
    },
    {
      "title": "Enjoy your animation!",
      "content": "Enjoy your animation!"
    }
  ]
}