{
  "url": "https://www.wikihow.com/Clean-a-Granite-Sink",
  "title": "How to Clean a Granite Sink",
  "steps": [
    {
      "title": "Select a non-abrasive scrubbing pad and the proper cleaning product.",
      "content": "Select a non-abrasive scrubbing pad and the proper cleaning product. Granite, like all natural stones, must be cleaned with pH-neutral cleaners and non-abrasive pads or rags. Avoid using CLR, lemon, vinegar, glass cleaner, steel wool, or harsh scrubbers. [1] X Expert Source Marcus Shields House Cleaning Professional Expert Interview. 22 September 2019. Since hard water stains and mineral deposits are resistant to pH-neutral cleaners, it's recommended to use a scum and mineral deposit remover for granite . Be careful, as many products for removing hard water are NOT safe for granite."
    },
    {
      "title": "Apply cleaner and dampen scrubber.",
      "content": "Apply cleaner and dampen scrubber. Follow the product instructions, applying it to the target area. Meanwhile, dampen the scrubbing pad with hot water. If you are using a neutral product such as dish soap for removal, this task will require more elbow-grease, since you will be relying on friction. For this reason, we recommend using a scum and mineral deposit remover for granite."
    },
    {
      "title": "Scrub the sink.",
      "content": "Scrub the sink. Rub the scrubber over the hard water stains/mineral deposits, and any spots that look grimy or filmy, completely removing the build-up. You can wipe the whole sink down with this scrubber for a more thorough cleaning."
    },
    {
      "title": "Rinse the sink.",
      "content": "Rinse the sink. Use a spray hose, a cup, or just your cupped hands to pour water over the targeted areas, rinsing the residue away. You can also wipe it with a clean, dampened sponge. Be sure to rinse completely, removing any leftover product residue."
    },
    {
      "title": "Completely dry the sink using a dry, soft microfiber towel.",
      "content": "Completely dry the sink using a dry, soft microfiber towel. Microfiber is gentle enough to be used on granite without damaging it, but any soft towel or cloth will do. Be sure that you’ve gotten the sink completely dry, since leaving water may cause minerals to accumulate, re-creating the issue."
    },
    {
      "title": "Investigate results.",
      "content": "Investigate results. If these steps did not work, apply the methods once more. If the issue persists, the underlying cause of the staining may be from \"etching.\" Etching most often occurs after using abrasive products such as lemon juice, vinegar, CLR, or sandpaper/harsh scrubbers. [2] X Expert Source Marcus Shields House Cleaning Professional Expert Interview. 22 September 2019. For etching assistance, it's best to obtain professional advice. Free support lines such as Supreme Surface tend to offer personalized advice for such issues."
    },
    {
      "title": "Apply olive or mineral oil to a cloth.",
      "content": "Apply olive or mineral oil to a cloth. Appearance-based effects of etching can be temporarily hidden by mineral oil. This provides a short-term solution until a complete solution is found. Begin by finding a clean, dry cloth or rag and pour a few teaspoons of olive oil or mineral oil onto a small section of it. [3] X Research source Try not to ball up the cloth so much that it begins to absorb the oil and spread it through the cloth. The oil should sit in a relatively concentrated spot so that it can be transferred to the granite."
    },
    {
      "title": "Rub the oil all over the sink.",
      "content": "Rub the oil all over the sink. Wipe the sink thoroughly with the cloth until you’ve distributed a thin, even layer of oil over the granite. Allow it to sit for about a minute before you attempt to wipe it away."
    },
    {
      "title": "Wipe excess oil away.",
      "content": "Wipe excess oil away. Use the clean part of the cloth, or just get a new one, and buff any excess oil off the sink. The granite will be shiny but should not feel slick when you run a finger over it. Continue to wipe it with a clean cloth if your finger comes away with oil on it."
    },
    {
      "title": "Mix a paste solution of whiting powder and hydrogen peroxide.",
      "content": "Mix a paste solution of whiting powder and hydrogen peroxide. Both of these products can be purchased at home improvement or hardware stores, and can be combined to create a \"poultice.\" Follow the directions on the whiting powder packaging to mix it with the proper amount of hydrogen peroxide. The resulting mixture should be a thick paste, almost the consistency of peanut butter. Some examples of whiting powder include powdered chalk, white molding plaster, and talc. [4] X Research source"
    },
    {
      "title": "Apply the paste directly to the stained area of your granite sink.",
      "content": "Apply the paste directly to the stained area of your granite sink. Use a putty knife or an old wood or plastic spatula that you no longer need to do the application. The layer of paste you apply to the stain should be approximately half an inch (about 1.25 cm) thick. [5] X Expert Source Bridgett Price House Cleaning Professional Expert Interview. 23 May 2019."
    },
    {
      "title": "Cover the pasted area with plastic wrap.",
      "content": "Cover the pasted area with plastic wrap. Secure the plastic wrap down on each edge with a piece of tape. This will allow the paste to fully absorb and lift the stain."
    },
    {
      "title": "Allow the paste to dry completely.",
      "content": "Allow the paste to dry completely. Let it sit for at least 24 hours. Occasionally, this may take up to 2 days. This period can fluctuate depending on the directions outlined on the whiting powder product."
    },
    {
      "title": "Remove the plastic and wipe away the dried paste.",
      "content": "Remove the plastic and wipe away the dried paste. Use a very blunt scraping tool to remove the dried paste so that you don't scratch the stone. Or just use a soft sponge or paper towel to remove as much of it as you can, and then throw it away. Do not attempt to wash the all of the paste down the drain, as it may clog the pipes."
    },
    {
      "title": "Rinse the area completely with water.",
      "content": "Rinse the area completely with water. Remove any remaining paste residue using a damp sponge or by pouring or spraying water over the area where the paste was. [6] X Expert Source Bridgett Price House Cleaning Professional Expert Interview. 23 May 2019."
    },
    {
      "title": "Repeat the process as necessary.",
      "content": "Repeat the process as necessary. If the stain has not been removed from your granite sink after the first try, you can go through the process again. It may take up to five times for this process to fully lift stubborn stains. [7] X Research source"
    },
    {
      "title": "Rinse and dry your granite sink completely after each use.",
      "content": "Rinse and dry your granite sink completely after each use. Rinsing your sink can prevent food and other debris from drying and hardening onto the granite surface, and wiping it dry can protect your sink from any minerals that exist in your tap water. Keep a microfiber towel or other soft cloth near your sink so that you can easily wipe it down after using it. The use of ioSeal-containing treatments can also be used for additional protection and enhancement."
    },
    {
      "title": "Remove stains promptly.",
      "content": "Remove stains promptly. Granite is a porous stone, so the sooner you clean up a stain the better. [8] X Expert Source Marcus Shields House Cleaning Professional Expert Interview. 22 September 2019. Try to blot at a fresh stain rather than rubbing it so that you don’t spread it to a larger area. [9] X Research source Clean alcohol and citrus spills immediately, since these can dull or etch the granite’s surface."
    },
    {
      "title": "Apply ioSeal, or re-seal your granite sink when needed.",
      "content": "Apply ioSeal, or re-seal your granite sink when needed. After ensuring that your countertop has been initially sealed, be sure to follow up by using ioSeal-containing products for simple maintenance, or by re-sealing when necessary. How often you need to re-seal varies depending on factors such as color, porosity, and whether the sealant has been damaged by acidic products. Optionally, with consistent use of ioSeal-based treatments, you can reduce the need to re-apply sealers. Recommendations will vary."
    }
  ]
}