{
  "url": "https://www.wikihow.com/Contact-Tim-Cook",
  "title": "How to Contact Tim Cook",
  "steps": [
    {
      "title": "Send an email to Tim Cook’s Apple email address.",
      "content": "Send an email to Tim Cook’s Apple email address. Unlike many prominent figures, Tim Cook makes his corporate email address public. He reportedly spends an hour every morning reading customer emails and has a full-time assistant read his emails when he doesn’t have time. Important ones are passed to him, while the others are sent to the appropriate divisions at Apple. If you want to contact him, an email is the best method. [2] X Research source Cook’s corporate email address is tcook@apple.com. Remember that although the email address is public, this isn’t Cook’s personal email account. Your email will probably still be reviewed and vetted by assistants before Cook sees it."
    },
    {
      "title": "Put a compelling subject line in the email.",
      "content": "Put a compelling subject line in the email. Getting Cook’s or his assistant’s attention is key for having your message heard. A strong subject line increases your chances of the email being read and passed along. [3] X Research source Since Cook takes customer satisfaction seriously, a subject line suggesting that you’re having a problem or issue with an Apple product is a good start. This will catch Cook’s attention. Don’t make a subject line that looks spammy. For example, “EMERGENCY! URGENT ATTENTION NEEDED!” looks like a spam email. A better option would be “Big problem with iOS update.” Don’t make a subject line that’s completely different from the email. If you say you’re having a problem with your iPhone but then write an email with a business pitch, the assistant will probably delete the email. Some people put “Dear Tim” in the subject and think that this makes a response more likely, but there isn’t much evidence of that."
    },
    {
      "title": "Open with a friendly salutation.",
      "content": "Open with a friendly salutation. Like with all business emails , keep your tone respectful for this email. Greet Tim with a respectful \"Dear Tim\" or \"Dear Mr. Cook.\" This respectful and personalized opening might make Tim more likely to read and respond to your message. People who have received responses have opened with a less formal \"Dear Tim\" or \"Hi Tim,\" or the more formal \"Dear Mr. Cook.\" There doesn't appear to be a strong correlation on which type of opening is more likely to get a response. [4] X Research source"
    },
    {
      "title": "Write an email that requires Cook’s personal attention.",
      "content": "Write an email that requires Cook’s personal attention. Cook’s assistant only passes along emails that require his direct attention. Otherwise, they pass emails to the most relevant person within Apple who can address the issue. Increase your chances of getting Cook to look at your email by writing a message that requires his personal attention. [5] X Research source Some topics that might get Cook’s attention are product suggestions, complaints, and business inquiries or ideas. Personal responses still aren’t guaranteed, but as the CEO, these are topics he’d be interested in. If you just want an issue resolved without getting a personal answer from Cook, then there’s a strong chance that will happen if you email him. He takes customer service seriously and if you have an issue, the email will be forwarded to the correct people to fix it."
    },
    {
      "title": "Make a strong case if you’re contacting Cook with a business proposal.",
      "content": "Make a strong case if you’re contacting Cook with a business proposal. If your plan is pitching Cook a business proposal for Apple, then you have to make a good case. Explain your pitch clearly and concisely. Outline your proposal and how you think it will benefit Apple. Conclude by asking for a meeting or phone call to follow-up on your proposal. [6] X Research source Be thorough, but brief. Don’t include your entire business plan or write pages about your business. Make your case in a few paragraphs at most. If you do get a meeting with Cook, however, he’ll want more information. Prepare your business plan and financial records for review. State what you’re asking for directly. If you’re asking for an investment, say so."
    },
    {
      "title": "End the letter with a complimentary close and your contact information.",
      "content": "End the letter with a complimentary close and your contact information. When you've made your point, wrap of the email with a polite closing. Popular options are \"Thanks for your time in reading my email\" or \"Thanks in advance for any help you can offer.\" This shows that you respect Tim's time. Then close with your full name and contact information. [7] X Research source Re-paste your email address under your name, just to confirm that a respondent knows where to answer. You can also include your phone number if you want to look professional. Your address isn't necessary, unless you work for a notable company. For instance, if you work in the Microsoft HQ, then including that address might get more attention."
    },
    {
      "title": "Send a letter to Apple’s corporate address to get more attention.",
      "content": "Send a letter to Apple’s corporate address to get more attention. In some cases, a letter is more likely to get attention than an email because emails are much more common. Write a letter to Cook and address it to him. Send it to his office at Apple HQ and it might end up on his desk. [8] X Research source Apple’s corporate mailing address is: One Apple Park Way Cupertino, CA 95014 Follow the same rules for a letter that you would for an email. Keep it concise and be direct about what you’re asking for. Remember that an assistant probably reads Cook’s mail as well, so make the letter important enough for someone to pass it along to Cook."
    },
    {
      "title": "Call Apple HQ and ask to speak with Cook if you get no response.",
      "content": "Call Apple HQ and ask to speak with Cook if you get no response. Since Cook works at the Apple HQ in California, it’s possible that you can connect with him over the phone. Try calling Apple’s HQ and asking to speak with Cook. Be ready to plead your case and explain why you have to speak with him. If you have a good explanation, then the secretary may transfer your call to him. [9] X Research source Apple’s HQ number is (408) 996–1010. Remember that CEOs rarely take unsolicited phone calls, so don’t get your hopes up that you’ll get Cook on the phone."
    },
    {
      "title": "Tweet him on Twitter for another chance of getting his attention.",
      "content": "Tweet him on Twitter for another chance of getting his attention. Cook has a presence on Twitter, so tweeting at him may get his attention. Try posting on his page, commenting or replying on his posts, and making other posts about Apple in general. Over time, this may get you’re his attention and he may respond to your posts. Cook’s Twitter account is https://twitter.com/tim_cook . Messages are disabled on Cook’s Twitter, so you can’t contact him this way. Remember that Tim Cook is not a big social media user and has made some public statements against it. He only uses Twitter, and this is probably administered by assistants. Of all the options, social media is probably the least likely to get his attention."
    }
  ]
}