{
  "url": "https://www.wikihow.com/Clean-a-Leather-Steering-Wheel",
  "title": "How to Clean a Leather Steering Wheel",
  "steps": [
    {
      "title": "Brush the dirt off daily with a dry cloth.",
      "content": "Brush the dirt off daily with a dry cloth. Keep a clean cloth in your glove compartment. The simplest way to prevent grimy build-up on your steering wheel is through regular maintenance. Every time you use your car, take a moment to wipe the steering wheel with the dry cloth. This removes dirt and prevents it from accumulating on the wheel."
    },
    {
      "title": "Spray leather cleaner onto a microfiber towel.",
      "content": "Spray leather cleaner onto a microfiber towel. If your cleaner didn't come in a spray bottle already, transfer it into one. Spray the towel until it is saturated but not soaking. [1] X Research source You can try using the same cleaner that you would use on a pair of leather shoes. [2] X Research source If you don't have any leather cleaner at all, improvise by making a solution that is three parts water, one part multi-purpose cleaner. [3] X Research source"
    },
    {
      "title": "Wipe the cloth gently over the leather steering wheel.",
      "content": "Wipe the cloth gently over the leather steering wheel. Start by wiping the entire wheel in a 360-degree turn. Then place the cloth over the wheel, grip the wheel through the cloth, and gently twist back and forth. [4] X Research source Continue going over the steering wheel with the cloth to remove any residue. [5] X Expert Source Angel Ricardo Auto Technician Expert Interview. 1 October 2019."
    },
    {
      "title": "Remove the leather cleaner with a wet cloth.",
      "content": "Remove the leather cleaner with a wet cloth. Rinse a cloth in a little warm water until it is damp but not drenched, and then wipe the steering wheel to wash away any excess leather cleaner. Dry the wheel with a soft towel. [6] X Research source Be very thorough in washing the steering wheel if you have used a homemade water and multi-purpose cleaner solution, since multi-purpose cleaner can be a skin irritant. [7] X Research source"
    },
    {
      "title": "Apply a drop of leather conditioner to the wheel with your hands.",
      "content": "Apply a drop of leather conditioner to the wheel with your hands. To maintain the suppleness of your steering wheel's leather, squeeze a dime-sized amount of conditioner into your palm and gently rub it into the wheel with your bare hands in a massaging motion. Let the conditioner dry for 30 minutes and then use a clean towel to remove the excess. [8] X Research source You can do this once a week or so rather than every day. If you don't have time to wait half an hour for the conditioner to dry, simply wipe off all the excess with a towel right away. Don't drive with the conditioner on the wheel, since it can be slippery and dangerous. [9] X Research source The conditioner creates a protective barrier on your steering wheel that cushions it from everyday wear and grime and repels stains. [10] X Research source"
    },
    {
      "title": "Scrub the wheel with leather cleaner and a soft brush for a deeper clean.",
      "content": "Scrub the wheel with leather cleaner and a soft brush for a deeper clean. If you haven't been doing regular upkeep on your steering wheel, opt for a brush instead of a microfiber towel. Spray the leather cleaner directly onto the brush, taking care not to spray the dashboard, and gently scour the steering wheel to create a lather. [11] X Research source Immediately wipe the lather away with a clean, dry microfiber towel. Then rub your steering wheel down with a damp cloth and dry again with a towel. If there is stitching on the wheel, use the brush to give a series of light taps to the fibers in between the threads. This tamping releases the dirt from the stitches. You can improvise with a toothbrush if necessary. [12] X Research source"
    },
    {
      "title": "Use leather cleaner with a scrubbing pad to remove serious grime.",
      "content": "Use leather cleaner with a scrubbing pad to remove serious grime. For heavy dirt build-ups on steering wheels that have previously been cleaned very infrequently, spray leather cleaner onto an interior scrubbing pad and wipe the wheel with short strokes. Before the cleaner dries, wipe it off with a microfiber towel. [13] X Research source Wipe the wheel down with a damp cloth to remove any excess leather cleaner and then dry with a soft towel."
    },
    {
      "title": "Use a steam machine when you want to disinfect your steering wheel.",
      "content": "Use a steam machine when you want to disinfect your steering wheel. If you have access to one, a steam machine is a great way to remove bacteria from the leather. Choose a steam machine with single-hole nozzle. Fill it with distilled water and put it on the medium setting, then spray the steering wheel. Work your way around the entire wheel, wiping the moisture off immediately as you go with a microfiber towel. Remember to rotate the towel as you clean, to prevent the dirt and germs accumulated in the steam cleaning from being wiped right back onto the wheel. [14] X Research source You can purchase a steam machine at your local home improvement store or online."
    },
    {
      "title": "Rub the wheel with leather degreaser to remove oil and grease stains.",
      "content": "Rub the wheel with leather degreaser to remove oil and grease stains. Degreaser, which comes as an aerosol spray, draws out the oil and grease and transforms them into a dry powder. Spray the degreaser onto a microfiber towel until it is saturated but not dripping and rub it all over the wheel. Wait while it dries into a powder. Once the powder is fully dry, you can wipe it off with a clean towel or brush. The powder should be white. If it dries into a yellow color, there is still a lot of oil and grease left in your leather and you should repeat the degreasing process until the powder comes out white. After degreasing the wheel, clean it again with leather cleaner and a microfiber towel, remembering to wipe it off afterwards with a clean wet cloth and then dry it with a soft towel."
    }
  ]
}