{
  "url": "https://www.wikihow.com/Build-a-Koi-Fish-Pond",
  "title": "How to Make a DIY Koi Pond on a Budget",
  "steps": [
    {
      "title": "Find a spacious area at least 12 feet (3.7 m) by 10 feet (3.0 m).",
      "content": "Find a spacious area at least 12 feet (3.7 m) by 10 feet (3.0 m). This is an ideal and popular size for a backyard hobby koi pond. A pond of this size generally holds 10 mature fish, giving them enough space to thrive without overcrowding the pond. [1] X Research source Also, plan to dig your pond at least 3–4 feet (0.91–1.22 m) deep, which allows your koi to have cool water during hot seasons, and keeps it from freezing all the way through in the winter. [2] X Research source This also makes it more difficult for predators to swipe your koi. Contact 811 , which is a nationwide survey service, to make sure there aren’t any pipes or electrical lines at the site of your pond. Keep the width of the pond under 13 feet (4.0 m). Otherwise, it will be difficult to catch the fish with a net if you need to for any reason."
    },
    {
      "title": "Choose a site that’s flat, accessible, and away from shedding trees.",
      "content": "Choose a site that’s flat, accessible, and away from shedding trees. Selecting the proper location for your pond is crucial. First, it needs to be flat in order to hold water, but also shouldn’t be at the bottom of a slope, where contaminated runoff might spill into it. Also, make sure it’s not near too many trees, which can shed a large amount of leaves and suffocate pond plants that need light. Also, a fenced-in area is ideal, to keep out predators or wild animals. [3] X Research source Plan to dig your pond within sight of your house, so you can monitor and admire it through a window, easily perform maintenance, and also to make it easier to pump water to."
    },
    {
      "title": "Clear the site of plants or other debris.",
      "content": "Clear the site of plants or other debris. Once you’ve decided on the size, depth, and location of the pond, clear out the area of any vegetation or other barriers. Dig up any plants, move any lawn furniture or ornaments, and clear out any mulch, bricks or paving stones, or other large rocks. [4] X Research source Also, make sure that there’s enough room around the site so that you can work there easily—it’s not very easy to work right up against a fence or a hedge."
    },
    {
      "title": "Map out the shape of the pond on the ground.",
      "content": "Map out the shape of the pond on the ground. Use a length of rope, some sand, or spray paint to mark the shape of your pond on the site. [5] X Research source A square or rectangular pond is the simplest and easiest, but you might also choose a pond with rounded corners or an unusual profile. Just be sure that whichever shape you choose, it adheres to the dimensions you initially plotted so that it can comfortably hold your koi. Optionally, sketch out a small “shelf” or slightly shallower area that’ll be 1–2 feet (0.30–0.61 m) deep, which can help you introduce a wider variety of plants or fish that prefer shallower water."
    },
    {
      "title": "Dig out the pond using a shovel.",
      "content": "Dig out the pond using a shovel. Start at the center of your outlined design and dig your way out to the edges. Make sure the bottom of the pond reaches your desired depth, and stays as level as possible across the entire span. Use a sturdy shovel and get a friend to help you if possible, which makes the process much faster and easier. [6] X Research source Dig so that the edges of the pond slope slightly toward the center, which helps improve natural water circulation. Also, dig about 2–3 inches (5.1–7.6 cm) wider and deeper than your planned dimensions to accommodate space for your pond liner and other fillers. Optionally, line the bottom of the hole with 1–2 inches (2.5–5.1 cm) of sand after you dig, which makes for a sturdier and more even base to your pond."
    },
    {
      "title": "Line the pond with an underlayment and a liner.",
      "content": "Line the pond with an underlayment and a liner. Underlayment and liner come in large sheets, so use scissors to cut them down according to your pond’s size. Drape the underlayment, which lets gas escape between the ground and the liner, into the pond in 1 single sheet, then do the same for the plastic or rubber liner. [7] X Research source Tuck both into the nooks and crannies of the pond to make them adhere to the pond’s shape. Also, make sure that they overlap the edges of the pond by at least 3 feet (0.91 m) so that they can be adequately secured in place. To find how much liner and underlayment you need, add the length of the pond to double the pond’s depth, plus 6 feet (1.8 m) for overlap. This gives you the length. The same equation with the width of the pond swapped for the length gives you the width of the liner and underlayment. Remove any sharp rocks or stones that you see in the hole before you lay the liner to prevent the liner from being damaged. Alternatively, place a prefabricated pond mold into the hole. A pond mold is a sturdy plastic pool shape that provides a predetermined shape and structure for your pond."
    },
    {
      "title": "Place rocks around the edges of the liner to secure it in place.",
      "content": "Place rocks around the edges of the liner to secure it in place. Use large stones and rocks to completely cover the liner around the edges of the pond to hold down the liner. [8] X Research source Stack and overlap the rocks using whatever design that you prefer. Make sure that at least 1 foot (0.30 m) of the liner is exposed beyond the edge of the rocks, which prevents runoff from getting into the pond. Also, form a 3 in (7.6 cm) high ridge of dirt around the edge of the rocks, so that there’s a small border of dirt on the outside of the pond. This prevents rainwater, soil, lawn chemicals, and grass clippings from reaching the pond water. Optionally, line the bottom of the pond with 1 inch (2.5 cm) of coarse gravel or pebbles to add a more natural touch."
    },
    {
      "title": "Fill the pond with a garden hose and dechlorinate the water.",
      "content": "Fill the pond with a garden hose and dechlorinate the water. Place the end of the hose in the bottom of the pond, then turn on the tap and let the pond fill to about 1–2 in (2.5–5.1 cm) below the rim. If you live in an area with non-potable water, use a hose filter to purify the water as it comes out. Then, let the water sit for 48 hours, or use a water dechlorinator or water conditioner (according to the instructions on the packaging) to dechlorinate it. [9] X Research source Chlorinated water is toxic to fish, plants, and any other flora or fauna in your pond, so it’s important to purify your water before adding these. Use a chlorine strip to test the water, and adjust it until the chlorine level is as close to 0.00 PPM (parts per million) as possible. Contact your county or water supplier if you are unsure about the local water quality."
    },
    {
      "title": "Test and alter the pH of the pond to between 7 and 8.6.",
      "content": "Test and alter the pH of the pond to between 7 and 8.6. Dip a pH test strip into the pond to see if the water is suitable. [10] X Research source If it’s above 8.6, add a pH decreaser . If it’s below, add a pH buffer . These products vary in potency, so consult the instructions on the packaging for application methods and amounts. [11] X Research source Alternatively, add a few handfuls of cornmeal to the pond and wait for a week or two for the carbon dioxide in the cornmeal to release carbon dioxide, lowering the pH. Or, add 1 tsp (6 g) of baking soda to the pond for every 5–10 US gal (19–38 L) of water to raise the pH."
    },
    {
      "title": "Check the water temperature and keep it around 65 °F (18 °C).",
      "content": "Check the water temperature and keep it around 65 °F (18 °C). Measure the temperature of the pond regularly with a thermometer. Koi can survive in water that is 34–90 °F (1–32 °C), but they do best at 65 °F (18 °C). If it’s below that range, place a pond heater or a de-icer into the pond and run it until the temperature rises. [12] X Research source If you find that the pond is too warm, very gradually add cold water to slowly reduce the temperature in the pond. Never change the water temperature of the pond all at once, as this can cause the koi to go into shock which can be deadly. If in doubt, replace a bucket of water at a time, with about 20 minutes between each bucket."
    },
    {
      "title": "Install a filtration system into the koi fish pond.",
      "content": "Install a filtration system into the koi fish pond. Every pond filtration system looks a bit different, so follow the instructions on the packaging to install your pond filter . [13] X Research source That said, all complete pond filtration systems involve a bottom drain, a settling chamber, mechanical filtration, and biological processing. This keeps the pond clean and the water quality high so that the koi stay healthy. Submersible pond filters are some of the most common and price-effective. [14] X Research source Set up the filtration system box right next to the koi pond. Dig it into the ground slightly. Install the individual parts in the pond as per the installation directions. The settling chamber makes it easy for you to remove debris from the pond to keep it clean. An ideal settling chamber size for koi fish ponds is 40 in (1.0 m) deep and 40 in (1.0 m) in diameter. Place the chamber on the surface of the pond. The mechanical filtration part of the system will catch debris as it floats through the water. Often, these float on the surface of the water. Biological filtration is the addition of beneficial bacteria into the pond. This reduces the levels of ammonia and nitrite in the water which are toxic for koi. Biological filters may be installed devices, or might be plants like lily pads or waterweed, or even animals like snails or frogs."
    },
    {
      "title": "Place an aerator in the pond.",
      "content": "Place an aerator in the pond. A pond aerator keeps the pond water moving at all times. This keeps the water stirring, oxygenates the pond, and promotes gas exchange. It also prevents the pond water from freezing during colder months. [15] X Research source Like filters, every aerator is different, and has different installation instructions, so consult the owner’s manual to get yours set up. If you can’t afford a pond heater, a pond aerator is an ideal and economical substitute. Make sure you purchase an aerator suitable for the size of your pond. An aerator’s capacity is usually advertised on its packaging."
    },
    {
      "title": "Run the filter and aerator for 2-3 weeks.",
      "content": "Run the filter and aerator for 2-3 weeks. Once your pond is full of water, start preparing the water for the koi by getting the filtration system and aerator up and running. Always do this before adding the koi to the pond. [16] X Research source Let the systems run for a few weeks to get the environment stable ready for your koi."
    },
    {
      "title": "Float the koi in water-filled bags for 30 minutes, then free them.",
      "content": "Float the koi in water-filled bags for 30 minutes, then free them. Keep the koi in the water and plastic bag that they were purchased in. Gently set the plastic bag on the surface of your koi pond for 30 minutes so that the koi can adjust to the temperature change. [17] X Research source Then add a bit of pond water into the plastic bag, tie it up, and let it float for an additional 30 minutes to help the koi adjust to the pond water. After the koi have been given time to adjust, open the plastic bag again and release them into their new pond. Don't let the plastic bag float continuously in direct sunlight, as this could cause the koi to overheat. Place a towel over the bag if there isn't a shady spot."
    },
    {
      "title": "Introduce plants in and around the pond.",
      "content": "Introduce plants in and around the pond. If you want natural, beneficial wildlife like snails, frogs, or bats to frequent your pond, it helps to have aquatic plants in the water to give them shelter and make the place more inviting. [18] X Research source Plant short shrubs or tall grasses around the edge of the pond. If you like, add water lilies or other aquatic plants to the water. Be sure not to overcrowd your pond, though! Make sure at least half of the pond’s surface is free of plants, and that you can easily access the edge of the pond for maintenance."
    },
    {
      "title": "Check the temperature and pH levels each week.",
      "content": "Check the temperature and pH levels each week. Ideally, your pond will stabilize, and the filtration and aeration systems will keep things running smoothly. But keep the pond clean and make sure your koi are comfortable by testing the water’s temperature and pH levels every so often, and making adjustments as needed, just like you did when first installing the pond. Also, remember to clean or replace your filters and aerators as indicated on their packaging, and check them every week to make sure they’re up and running. If you need to change the water in the pond, to alter its temperature or pH, do it in amounts of 10% to 20% of the total volume. Otherwise, the fish may go into shock."
    },
    {
      "title": "Feed your koi 4-5 times a week.",
      "content": "Feed your koi 4-5 times a week. Generally, give your koi specialty food pellets several times a week to keep them fed and healthy. The frequency at which you feed them depends on the water temperature, though. At a balanced 65 °F (18 °C), 4-5 times a week is standard. In colder months, feed them 2-3 times per week. In hot months, when their activity is high, feed them 1-2 times a day. [19] X Research source Start by giving your koi a handful of pellets, and only feed them as much as they can eat in 3-5 minutes. If it takes longer, cut down on the amount. Overfeeding your koi can lead to health problems or an imbalanced pond environment, so be careful not to litter the pond with excess food."
    },
    {
      "title": "Protect your pond from cool temperatures with a pond de-icer.",
      "content": "Protect your pond from cool temperatures with a pond de-icer. A de-icer floats on the surface of your pond and melts any thick layers of ice, letting your koi surface and feed in the winter months. Simply place it on top, plug it in, and let it do its thing. [20] X Research source Also keep your aerator running to let the water move, preventing it from freezing. Koi don’t typically need to be removed from your pond in the winter, but if you like, you might move them to an indoor tank (with much the same filtration and aeration systems) to keep them warm and happy in harsher climates."
    }
  ]
}