{
  "url": "https://www.wikihow.com/Bulk",
  "title": "How to Bulk: Diet & Exercise Guidelines (With Sample Meal Plans)",
  "steps": [
    {
      "title": "Increase your calorie intake by about 300–500 a day.",
      "content": "Increase your calorie intake by about 300–500 a day. Use a calorie calculator to determine how many calories you need to eat each day to maintain your weight. Then, aim to eat about 10–20% more calories than that maintenance number each day while you’re bulking. For most people, that works out to about 300–500 calories a day. [1] X Research source Arana says, “If you’re progressively getting stronger while eating at a caloric surplus, you should build muscle.” Some of the excess calories will also be converted to body fat, which you can lose during a cutting cycle after your bulk is over. If you want to minimize your fat gain, do a clean bulk , where you get most of your calories from healthy sources like lean protein, healthy fats, and complex carbs."
    },
    {
      "title": "Aim for 40% of your calories to come from protein.",
      "content": "Aim for 40% of your calories to come from protein. Your body needs plenty of protein to build muscle. If you want to get the best gains, try to get about 40% of your daily calories from protein. One guideline is to try to eat about 0.5 grams of protein for every 1 lb (0.45 kg) of body weight. [2] X Research source So if you weigh around 240 lb (110 kg), you’d try to eat 120 grams of protein every day. Good sources of protein for bulking include chicken, turkey, lean beef, eggs, tofu, nuts and nut butters, and cottage cheese. Protein powder can help you hit your targets if you’re not getting enough protein from your food."
    },
    {
      "title": "Include healthy fats as about 30% of your calories.",
      "content": "Include healthy fats as about 30% of your calories. Having fat in your diet is important—fats can help you get energy and build muscle. Eating plenty of fat will also make it easier to hit your calorie targets each day. But keep your overall health in mind—even if you’re not clean bulking, it’s better to opt for healthy fats. Avoid highly-refined or fatty foods that don’t offer much in the way of nutrition. [3] X Research source The healthiest fats for bulking include avocados, nuts and nut butters, coconut milk, olives, and fatty fish."
    },
    {
      "title": "Fill in the remaining 30% of your calories with carbs.",
      "content": "Fill in the remaining 30% of your calories with carbs. Your body needs carbs for fuel, and they’re also an easy way to boost your calorie intake. Whole carbs will give you longer-lasting energy and are more nutritious than highly-refined junk foods, so try to include as many of those as possible—even if you’re not doing a strictly clean bulk. [4] X Trustworthy Source EatRight.org Organization associated with the Academy of Nutrition and Dietetics providing advice about food, health, and fitness Go to source When you’re bulking, healthy carbs include sweet potatoes, potatoes, quinoa, brown rice, lentils, oats, and whole-grain bread."
    },
    {
      "title": "Use a journal or app to track the calories and macros you eat each day.",
      "content": "Use a journal or app to track the calories and macros you eat each day. Counting your calories will make it easier to maintain a caloric surplus each day. And while some people don’t count macros during a bulk, it’s helpful if you want to be sure you’re getting the right breakdown of foods to help your body build muscle. [5] X Research source Popular food tracking apps include My Fitness Pal, MyNetDiary, and Cronometer."
    },
    {
      "title": "Eat frequently throughout the day.",
      "content": "Eat frequently throughout the day. It can be a challenge for some people to hit their caloric targets during a bulking cycle. To make it easier—and to give your body steady fuel for your workouts—eat 5 or 6 meals throughout the day, or about every 3–4 hours. [6] X Research source Give your body fuel for working out by having a carb- and protein-rich snack before and after working out, like a protein shake or granola bar."
    },
    {
      "title": "Limit foods that are full of empty calories.",
      "content": "Limit foods that are full of empty calories. Even though you need a caloric surplus when you’re bulking, you’ll feel your best if you fuel your body with healthy, nutritious options. A treat once in a while is fine—just include it in your daily calorie count—but overall, try to avoid fried foods, added sugars, and processed carbs. [7] X Research source Plan ahead if you know you’re going to treat yourself. For instance, if you’re going out for pizza with friends, check your food tracking app to see how many calories to account for, then balance that with a leaner meal earlier in the day."
    },
    {
      "title": "Consider supplements to boost your workouts or nutrition.",
      "content": "Consider supplements to boost your workouts or nutrition. Some strength trainers find that supplements including caffeine and creatine help them have more energy during their workouts. This may be beneficial while you’re bulking because you can push yourself harder, which may help you gain muscle more quickly. You can also use a protein powder supplement to help you reach your protein goals for the day. Try adding a scoop to your oatmeal for your breakfast, or add some to milk for a post-workout boost."
    },
    {
      "title": "Aim for a daily meal plan that breaks down like this.",
      "content": "Aim for a daily meal plan that breaks down like this. If your goal during bulking is to eat 2,400 calories, your meals should include approximately 40% (200 g) protein, 30% (80g) fat, and 30% (180g) carbs. If you split that into 6 meals, it might look something like this: Breakfast: 500 calories, 35g protein, 22g fat, 35g carbs 3 large eggs cooked with 1 tsp (4.9 ml) olive oil or butter 2 slices of whole grain toast with 1 tbsp (16 g) natural peanut butter 1/2 cup (75 g) of blueberries Black coffee or tea Morning Snack: 400 calories, 30g protein, 12g fat, 40g carbs 1 cup (240 g) plain Greek yogurt mixed with 1/2 scoop protein powder and topped with 1 sliced banana and 1/2 cup (40 g) granola or cereal Lunch: 600 calories, 45g protein, 18g fat, 40g carbs 6 oz (170 g) of grilled chicken breast 1/2 cup (90 g) of cooked quinoa 1 cup (160 g) of steamed broccoli topped with 1 oz (28 g) shredded cheddar cheese 1/4 avocado 1 fun-size candy bar Afternoon snack: 400 calories, 30g protein, 14g fat, 35g carbs Protein shake: 1 cup (240 ml) of unsweetened almond milk + 1 scoop protein powder 2 rice cakes topped with 1 tbsp (6 g) Nutella 1 apple Dinner: 500 calories, 40g protein, 17g fat, 35g carbs 6 oz (170 g) of grilled salmon topped with 1 tsp (5 g) of butter 3/4 cup (110 g) of roasted sweet potato 1 cup (180 g) of spinach, sauteed with 1 tsp (4.9 ml) of olive oil Evening snack: 200 calories, 20g protein, 5g fat, 20g carbs 1 cup (225 g) low-fat cottage cheese topped with 1/2 cup (83 g) of pineapple chunks 2 Oreos"
    },
    {
      "title": "Train 3–4 times a week.",
      "content": "Train 3–4 times a week. Just eating a surplus of calories isn’t enough to build muscle—you also have to consistently hit the gym. Resistance and strength training are the best ways to gain muscle, so make sure you’re weight training or doing bodyweight exercises at every workout. [8] X Research source If you don’t have a gym membership, buy a set of weights so you can work out at home. Rearick recommends using kettlebells, dumbbells, and a barbell."
    },
    {
      "title": "Focus on compound strength training exercises.",
      "content": "Focus on compound strength training exercises. Rearick says, “You’ll get the most out of your workout by doing compound movements like squats , deadlifts , push-ups , single leg squats, single leg deadlifts, wheel rollouts, and planks . These use all of your muscles at once, helping you put on the most muscle you can in a short amount of time.” You can also mix in isolation exercises like curls and leg lifts to target a specific area, but these shouldn’t make up the majority of your workout."
    },
    {
      "title": "Opt for high-intensity sets of between 8 and 12 reps each.",
      "content": "Opt for high-intensity sets of between 8 and 12 reps each. Rearick says, “You’re going to get the most hypertrophy—or muscle building—if you lift heavy and do between 8 and 12 reps. If it’s too heavy where you can’t quite get 8 reps, lighten your weight a little bit. If it’s too easy where you can do more than 12 reps, increase your weight.” Cerqua recommends doing 30–32 sets per muscle group each week, spread out over multiple days. Change up your exercises rather than repeating the same ones at every workout session—this will help keep your muscles challenged, leading to improved gains."
    },
    {
      "title": "Include light cardio 1–2 days a week.",
      "content": "Include light cardio 1–2 days a week. Since you’re trying to maintain a caloric surplus, avoid doing strenuous cardio—it will burn calories without helping you add much muscle. But you do need some cardio to keep your heart in good shape, so try to get moving a few times a week. [9] X Research source Cycling, swimming, dancing, jogging, and playing ball with friends are all good cardio options."
    },
    {
      "title": "Give yourself 1–2 recovery days a week.",
      "content": "Give yourself 1–2 recovery days a week. Believe it or not, you actually need days off to get bigger muscles. You gain muscle mass when your body repairs the damage to the muscle fibers that happens when you work out. You’ll maximize your gains if you give yourself 1–2 days a week to recover. [10] X Research source Skipping rest days means you’ll be more sore and tired when you work out again. This can increase your risk of injury, but it also means you won’t be able to push yourself as hard during your workout. Additionally, aim to get 7-8 hours of sleep per night. Your body builds muscle while you’re sleeping, and a recent study even found that sleeping well at night may help you gain less fat while still building muscle."
    },
    {
      "title": "Aim to gain about 1–2 lb (0.45–0.91 kg) a week if you’re a beginner.",
      "content": "Aim to gain about 1–2 lb (0.45–0.91 kg) a week if you’re a beginner. When you’re just starting out on a bulking plan, you’ll likely gain muscle and fat more quickly. Over time, this will probably slow to about 1 ⁄ 2 –1 lb (0.23–0.45 kg) a week as you build muscle. Weigh yourself regularly to keep track of how quickly you’re gaining weight. [11] X Research source"
    },
    {
      "title": "Cut your calories if you gain too fast.",
      "content": "Cut your calories if you gain too fast. If you’re consistently working out and eating at a caloric surplus, you should notice steady weight gain each week. If you gaining more than 2 lb (0.91 kg) a week, you’re probably putting on too much fat—gradually decrease your calories as needed. [12] X Research source If you’re maintaining your weight or losing weight, increase your daily calorie intake."
    },
    {
      "title": "The two main types of bulking are clean bulking and dirty bulking.",
      "content": "The two main types of bulking are clean bulking and dirty bulking. Clean bulking—also called lean bulking—involves eating a caloric surplus of healthy, nutritious foods, like lean proteins, healthy fats, and complex carbs. It’s widely considered the healthiest way to bulk. [13] X Research source Dirty bulking doesn’t involve counting calories or tracking macros. The goal is just to eat as many calories as possible from any source. It’s considered an unhealthy way to bulk and usually results in the person gaining more fat than muscle."
    },
    {
      "title": "Switch to a caloric deficit and increase your cardio.",
      "content": "Switch to a caloric deficit and increase your cardio. Because you generally put on some body fat during a bulking phase, many lifters use a cutting cycle afterward to shed the extra weight and look more toned. Eat about 500 fewer calories than you need each day to maintain your weight, and drop your fat intake to about 20% of your total calories (it’s usually easiest to make that up by increasing your healthy carbs to about 40%). [14] X Research source Do high-intensity cardio 3–4 times a week while you’re cutting. You should still strength train to keep the gains you’ve made, but just be mindful that you may not see muscle growth or build much strength during this time. The duration of this cutting period will depend on how long it takes you to reach your physique goals—a safe weight loss rate is about 1 lb (0.45 kg) a week."
    },
    {
      "title": "Is bulking safe?",
      "content": "Is bulking safe? You should always talk to your doctor before starting a diet and exercise program, but in general, clean bulking is considered a safe way to build muscle. The excess calories in your diet are largely converted to muscle, with only a little of your gains going to fat. Dirty bulking is not considered healthy."
    },
    {
      "title": "Can I gain muscle without gaining fat?",
      "content": "Can I gain muscle without gaining fat? While you will typically gain some fat when you’re bulking to gain muscle, you can minimize this by doing a clean bulk. After you’ve reached your bulking targets, you can shed any excess fat in a cutting phase. [15] X Research source"
    },
    {
      "title": "How long should a bulking phase last?",
      "content": "How long should a bulking phase last? It usually takes months or even a year or more to reach your bodybuilding goals through bulking. To be healthy and maximize your muscle growth, focus on slow and steady weight gain. [16] X Research source If it’s your first time bulking, aim for about 3 months to give yourself time to adapt, then adjust your goals as needed."
    },
    {
      "title": "Is it possible to speed up bulking?",
      "content": "Is it possible to speed up bulking? Gaining muscle takes time and consistency. If you’re new to bulking, you may be able to gain as much as 1–2 lb (0.45–0.91 kg) of muscle a week, but once you’re more experienced, you may only put on 0.5–1 lb (0.23–0.45 kg) of muscle a week. If you try to gain weight much faster than that, you’ll probably be putting on more fat than muscle. By eating healthy, working out consistently, and continually pushing yourself, you’ll be more likely to max out your body’s ability to put on muscle."
    }
  ]
}