{
  "url": "https://www.wikihow.com/Clean-Your-Lightning-Port",
  "title": "How to Clean the Charging Port on an iPhone: Complete Guide",
  "steps": [
    {
      "title": "Power down your iPhone",
      "content": "Power down your iPhone or iPad. To do this, press and hold the side button and either the volume up or volume down button until the screen changes, and then drag the on-screen slider to the Off position. [1] X Research source You can also take this opportunity to clean your phone case or phone speaker . If you have an older iPhone or iPad model, you only need to hold down the top or side button to power the device down."
    },
    {
      "title": "Shine a flashlight into the charging port.",
      "content": "Shine a flashlight into the charging port. You'll usually be able to spot a blockage with the right lighting. Closely inspect the walls inside of the port. If there's a layer of gunky buildup around the edges, it could prevent the charging cable from making proper contact with the inside pins."
    },
    {
      "title": "Spray the port with quick bursts of compressed air.",
      "content": "Spray the port with quick bursts of compressed air. A can of compressed air is often enough to free looser particles (such as dust, pet fur, or lint) from the port. Use short, light bursts rather than one lengthy spray. Make sure to always hold the can of compressed air upright to avoid spraying the coolant inside the can inside your device. This coolant is very cold and could damage the charging port or cause injury. Use your flashlight to re-inspect the port. If you no longer see debris, give the port 2 to 3 minutes to dry before attempting to charge your iPhone or iPad."
    },
    {
      "title": "Scrape the walls of the port with a toothpick.",
      "content": "Scrape the walls of the port with a toothpick. If the port is clogged with dust or lint clumps, a quick, gentle swipe or two should free the trapped particles. If there's a layer of gunk or grime caked along the walls, gently scrape around the edges to dislodge it. Avoid using metal tools inside your charging port. If you don't have a toothpick or need something stronger, try a plastic dental flosser. The port is filled with many small electronic pins—too rough of a scrape could cause irreparable damage. Try wrapping the end of the toothpick with a small amount of cotton for extra padding."
    },
    {
      "title": "Use a cotton swab dipped in alcohol for tougher jobs.",
      "content": "Use a cotton swab dipped in alcohol for tougher jobs. If the substance in the port feels sticky and/or is hard to remove with a dry tool, dip a cotton swab in a small amount of rubbing alcohol, and then gently swab around the inner edges. [2] X Research source Circle the swab around the edges as many times as it takes to remove all residue. If the gunk is really deep inside the port, pull some of the cotton off of the end of a cotton swab, then wrap it around the end of a toothpick. Dip the cotton in some rubbing alcohol and use it to get further into the port. The cotton swab should not be dripping wet with alcohol. While rubbing alcohol is safe to use to clean electronic components, you should still avoid dripping too much liquid inside your charging port. The cotton swab should just be damp to the touch. Allow the port to dry for 2 to 3 minutes before turning your iPhone or iPad back on."
    },
    {
      "title": "Attempt to charge the iPhone or iPad.",
      "content": "Attempt to charge the iPhone or iPad. If you were experiencing a charging issue related to a dirty port, you should be in good shape now. To prevent build-up from accumulating in your charging port in the future, avoid carrying your phone or tablet loose in a pocket or purse. If the phone or tablet isn't charging (or the charging process stops and starts randomly), try a different charging cable and/or power source. If you find yourself cleaning dirt and dust out of your iPhone or iPad charging port often, you can purchase something called a dust plug . A dust plug is a small piece of rubber that fits snugly inside your charging port to block out dust from getting inside of it. Some dust plugs even have a loop so you can attach a phone charm. If cleaning the port and swapping cables doesn't solve the issue, contact Apple for repair. Visit https://support.apple.com/en-us/106932 to find an Apple support phone number for your region."
    }
  ]
}