{
  "url": "https://www.wikihow.com/Be-a-Good-Listener-in-Class",
  "title": "How to Be a Good Listener in Class",
  "steps": [
    {
      "title": "Look at the teacher.",
      "content": "Look at the teacher. Good listening starts with good watching. When your teacher is talking, your eyes should be up front. Don't look out the window, or at the kids next to you, or at the phone you're trying to hide under your desk. Look at your teacher and what is being presented. [1] X Research source Look at the board at least, or find something at the front of the room to focus your eye on if you're bored and struggling to pay attention. Look forward, toward the front of the room."
    },
    {
      "title": "Sit up",
      "content": "Sit up . If you want to look like you're paying attention, sit up as straight as possible. Push your butt back in the chair and keep your back straight. Put your feet flat on the floor and your hips underneath you. If you're a creative person, do something creative like color or doodle. It will help you concentrate better on what is being presented. Don't fiddle with things. You don't need to mess around with your hands. Just cross them in front of you or take notes."
    },
    {
      "title": "Follow instructions.",
      "content": "Follow instructions. When your teacher asks you to do something, do it. If you're supposed to take your book out and turn to a specific page, get out your book and turn to that page. If you're supposed to get into a group, get into a group with people around you as quickly as possible. Do it when you're asked, without messing around or hesitating. At the same time, don't do things your'e not asked to do. Unless you're told to talk to your neighbors, no goofing around."
    },
    {
      "title": "Ask questions when you're unsure.",
      "content": "Ask questions when you're unsure. Anytime you're unsure about what's going on, or if you have a follow-up question, ask it. Contribute to the conversation that's happening in class. Raise your hand and wait to be called on to ask questions properly. If you have a question, chances are someone else does too. [2] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source Respond when questions are asked, as well. If your teacher puts a question to the class, raise your hand if you have a good answer. You don't have to answer every question. Responding a few times a day is enough. Let other people talk and give them a chance to contribute too."
    },
    {
      "title": "Don't sit with your best friends.",
      "content": "Don't sit with your best friends. It's difficult to stay focused and pay attention in class when you're friends are distracting you. It might seem like more fun to get through class while sitting next to a buddy, but that's exactly how you'll get into trouble and struggle. Instead, sit elsewhere and decide to hang out later. If you still want to sit with your friends, sit in the front of the classroom so your friends will have to, too. It's hard to mess around when you're right next to the teacher."
    },
    {
      "title": "Be prepared for class",
      "content": "Be prepared for class . When it's time to go to class, make sure you've got everything that you need ready to go, so you won't have to miss anything because you're struggling to catch up. You'll miss part of a lecture if you're trying to finish your homework before class starts. In general, you want to make sure you have, for each class: Paper for notes, or notebooks Pencils already sharpened or pens that work well Books needed for class Homework or assignments that are due Glue, crayons, rulers, calculators, or other specialty stuff for a particular class"
    },
    {
      "title": "Be organized",
      "content": "Be organized . Keeping your stuff organized for class will help you pay better attention. You can be calm and confident that you have everything you need to succeed. Have a specific spot for your new notes, your old notes, your homework, and other stuff that's necessary for class. Some people like to keep a separate binder, while other like individual folders for each class. It's recommended that you have one notebook that you keep a to-do list in for all of your classes, so you can easily check off everything that you need to do each night."
    },
    {
      "title": "Eat right and get plenty of sleep",
      "content": "Eat right and get plenty of sleep . Keeping your blood-sugar up will help you pay attention and listen in class. If you're hungry and feeling dragged down, your mind will wander and you'll really struggle to be a good listener in class. Always eat breakfast. Focus on eating whole grains and fruits for breakfast, instead of something sugary that will result in a crash later in the day. Eat something that'll keep you full until lunch. At lunch, eat a good meal. Too many students think a bag of chips and candy bar will get you through the day. If you're struggling to listen in class, make an effort to eat a full meal at lunch, or bring your own. Get plenty of sleep . Students often stay up too late and have to wake up early for school. Make sure your bedtime is early enough that you can get at least eight hours of sleep."
    },
    {
      "title": "Speak up if you're struggling.",
      "content": "Speak up if you're struggling. Talk to your teacher, your counselor, or your parents if you're really having trouble following what's happening in class and paying attention. Learning disabilities can be corrected in a variety of ways, if you're having a problem. Chances are, your teacher already knows you are struggling and wants you to stop by after class.They want you to succeed, but you have to take the initiative. Talk to your teacher about the possibility of recording your classes so you can review them later on. This will help you study for exams if you struggle to pay attention and take notes during class. [3] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020. If you get in trouble regularly, talk to your teacher. It's important to let your teacher know that you want to do better and you're trying. Listen to what they say."
    },
    {
      "title": "Listen to the ideas, don't try to catch every word.",
      "content": "Listen to the ideas, don't try to catch every word. Concentrate on understanding the broad concepts, but worry too much about listening to every single word. Listen for keywords and concepts that your teacher mentions, and pay attention to what's written on the board. Anything that the teacher took the time to write down on the board is extremely important. Also, anything that is repeated multiple times is very important. [4] X Research source It's ok if your mind wanders some while you're listening, if your mind is wandering around the particular issue that you're talking about in class. If you start wondering what it was like in the era that you're talking about in history class, that's a good thing. Don't get discouraged if you feel like you miss things. Just focus on the big idea, and trying to understand it."
    },
    {
      "title": "Pay attention to visual cues and body language.",
      "content": "Pay attention to visual cues and body language. Lots of communication is non-verbal. That means that it's helpful to watch your teacher's body language to get some idea about what's important and what's not important, so you can pay attention to the most critical parts of the information. If your teacher is standing up and talking really dynamically, it's probably important. If your teacher is droning on while seated, and doesn't seem super-interested, it might not be important. [5] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source"
    },
    {
      "title": "Keep an open mind while you listen.",
      "content": "Keep an open mind while you listen. It's important to avoid judging the things that you're learning in class before you've had a chance to understand them. Sometimes, we hear something and automatically think, \"Oh that's silly\" or \"I don't need to know that\" or \"That's confusing.\" After we've already decided, it becomes very difficult to actually learn anything about the subject. [6] X Research source Instead, try to be receptive to what your teacher is saying, and assume that you'll find it interesting. Try to come up with creative ways to learn. If you're in math class, don't imagine that you're learning boring math problems, imagine that you're studying to become an astronaut, or you're learning a new robotic language."
    },
    {
      "title": "Visualize what the teacher is talking about.",
      "content": "Visualize what the teacher is talking about. In your mind, create a visual \"movie\" of what you're learning. Try to put the concepts and the images into a landscape and actually picture them happening. If you're talking about the plot of a play you're reading, picture the characters actually doing what you're talking about. If you're talking about biology, actually picture the microbes dividing and changing according to the processes you're discussing. Shrink yourself to their size and watch. Even if you're talking about math, try to actually picture the concepts happening. Picture groups of objects like apples or potatoes getting bigger or smaller as you multiply and divide them in a set number. It makes it a lot easier to learn. [7] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source"
    },
    {
      "title": "Have good note-taking materials ready to go.",
      "content": "Have good note-taking materials ready to go. Have a different notebook for each class, and have some pencils or pens ready to go when you want to take notes. There are lots of different ways to note-take, but there's no wrong way. As long as you try to keep up and write down important ideas, being ready and taking notes is a good way of paying attention in class. [8] X Research source Keep your notes organized by subject. Write the date of the class and period at the top of each new page and then draw a line when you're done, or when you're finished with a particular topic and moving on to something else. [9] X Research source"
    },
    {
      "title": "Write down notes even if you're not told to.",
      "content": "Write down notes even if you're not told to. Some studies show that note-taking, even if you don't use the notes later, helps you to engage with what you're listening to and pay attention more. Just the act of writing things down helps you to pay attention and listen better. Always write down notes when you're told to, or when your teacher writes something on the board. This is a good sign that you need to remember something for a test or for homework later."
    },
    {
      "title": "Only write down key words.",
      "content": "Only write down key words. Lots of school involves vocabulary. Understanding the concepts and the issues that you're studying will involve learning lots of new words. When you learn one, write it down in your notes, along with the definition, or other important information to remember about the topic. Don't try to write down too much in your notes. It's not necessary to have a total record of everything your teacher says. Any words that your teacher says a lot might be important to keep in mind. If there's not a clear definition, that makes a good chance for a question."
    },
    {
      "title": "Try to write things in your own words.",
      "content": "Try to write things in your own words. When you write something in your own words, it'll help you to remember what you've learned. [10] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020. Translating your notes, or even just re-writing them is a good way of studying and helping you learn what you're talking about in class. Sometimes, your notes can get kind of sloppy and re-copying your notes quickly afterward will ensure that you remember the lecture more clearly. Re-copying notes is like learning each thing three times. You hear it, you write it, then you read it and copy it. Good way to study."
    },
    {
      "title": "If you don't take notes, doodle.",
      "content": "If you don't take notes, doodle. Research shows that doodling, even if you're just doodling shapes, or pictures, or nothing in particular, helps you pay attention. Doodling helps you grasp new concepts, retain information, and stay focused while you're listening."
    }
  ]
}