{
  "url": "https://www.wikihow.com/Celebrate-Christmas-in-India",
  "title": "How to Celebrate Christmas in India",
  "steps": [
    {
      "title": "Decorate a banana or mango tree for the occasion.",
      "content": "Decorate a banana or mango tree for the occasion. You don't have to go and purchase a special tree to celebrate Christmas in India. People in India will decorate any tree or bush readily available to them. This is often includes a banana or mango tree. Some families will also set up an imitation pine tree and decorate it with festive ornaments, and cotton wool to imitate snow. [2] X Research source"
    },
    {
      "title": "Hang banana and mango leaves around the house.",
      "content": "Hang banana and mango leaves around the house. You can also decorate the inside of the home with banana and mango leaves called the 'Toran'. The leaves are visually festive and give off a pleasant fragrance. [3] X Research source Torans are long banners that are traditionally made of marigolds and mango leaves, and are then hung on doorways. If you are feeling crafty, get some mango tree leaves and string them together with marigolds to make a festive display like it is done in most other festivals."
    },
    {
      "title": "Display paper lanterns, small electric lamps, or oil-burning lamps.",
      "content": "Display paper lanterns, small electric lamps, or oil-burning lamps. The paper lanterns and lamps are often used for decoration inside and outside of the home. Even churches will put lamps on tables and windowsills to get into the holiday spirit. Many local stores will have the lamps and lanterns available in a variety of shape and design to choose from if you are looking to add some festive lighting to your holiday. Star shaped or sphere shaped lantern with a festive print can also do the trick. [4] X Research source In Southern India, people will put small oil-burning clay lamps on the flat roofs of their homes to celebrate the holiday. By the end of December, the lanterns and lamps are a beautiful night time spectacle. In Goa along the western coastline of India, people hang paper lanterns in the shape of stars, and string the lanterns between the houses to create a starry night walkway."
    },
    {
      "title": "Set up a Christmas crib or nativity scene.",
      "content": "Set up a Christmas crib or nativity scene. In India, nativity scenes are often called, “Christmas cribs.” It is tradition to set one up in the home, and sometimes, it is even a friendly competition within the community to see who has the most elaborate display. If you want to fully embrace Christmas in India, begin planning your nativity scene early. [5] X Research source You are encouraged to use materials beyond the standard statues, and include sand, rocks, bricks, and plants. Just make sure to remember to wait and not place the baby Jesus statue in the scene until Christmas Eve."
    },
    {
      "title": "Shop for a new holiday outfit.",
      "content": "Shop for a new holiday outfit. Since Christmas is often a time for people in India to reunite with family and friends they do not often see, a lot of the people will go shopping for a new holiday outfit to commemorate the special day. So instead of wearing your traditional holiday outfit, go out into the community and see what holiday clothing is available. [6] X Research source While out shopping, also consider picking up small gifts or sweets to exchange with loved ones on Christmas Day. Instead of giving large presents, people in India will visit neighbors and friends, and give home-made sweets or small trinkets. [7] X Research source You can choose whatever wear you are most comfortable with. Western wear comprising of pant, shirt, skirt, is also perfectly fine just like traditional kurtas, sari for women look festive. Wear jewellery and makeup you like. You can buy a santa cap or reindeer shaped headband that are locally available in shops during Christmas."
    },
    {
      "title": "Buy or bake a traditional Kerala plum cake or Christmas fruit cake.",
      "content": "Buy or bake a traditional Kerala plum cake or Christmas fruit cake. The Kerala plum cake is a go-to holiday treat in Indian households. If you want to get into the holiday spirit, go to the local market and pick one up! If you are feeling extra adventurous, pick up the ingredients to bake one. [8] X Research source The recipe for the fruit cake usually includes chopped cashews, black raisins, and mixed dried fruits of dates, cherries, oranges peels, and more. [9] X Research source Try making Payasam (kheer) with boiled rice or dal, coconut milk which is sweetened by jaggery. It is a healthy dish. You can use sugar instead of jaggery too. Adding resin, cashew nut, and cardamom will further enhance the taste and aroma."
    },
    {
      "title": "Search a local bakery for traditional holiday baked goods.",
      "content": "Search a local bakery for traditional holiday baked goods. The recipes for holiday sweets can greatly differ across the country of India. Some of which, like the rose cookie, are even adopted recipes from different countries. If you are traveling across India at Christmas time, try and stop at a bakery at every location you pass through to taste the different sweets. [10] X Research source Some popular Christmas sweets to look out for include banana chips; neureos, which are small, fried pastries that are stuffed with dried fruit and coconut; dodol, which is similar to toffee, but is mixed with coconut and cashews; and kidiyo, which are deep-fried curly dough balls, dusted in sugar icing. These sweets are often given as gifts to friends and neighbors."
    },
    {
      "title": "Eat a traditional Christmas dinner.",
      "content": "Eat a traditional Christmas dinner. While the foods can range between regions, you’ll want to experience a traditional Christmas dinner while in India. Spicy pork and chicken curries, steamed rice cakes, and sweet breads are just some of the food you can look forward to. [11] X Research source The morning breakfast or lunch can be appam and chicken curry. Appam is one of the variety of the Indian breads made with rice and coconut. Some other Christmas dinner foods you might want to try are coconut rice; fried carrots, cabbage, and beans; chicken stir-fry; mutton curry; and aloo kurma, which is a potato curry served to people who are vegetarians."
    },
    {
      "title": "Wait for Father Christmas to deliver presents on a horse and cart.",
      "content": "Wait for Father Christmas to deliver presents on a horse and cart. Santa Claus goes by many different names throughout India. The most common being Father Christmas. Regardless of what name he is called, the tradition is the same. Father Christmas will deliver presents to the children on Christmas Eve sitting upon a horse-pulled cart. You can make a donation too when Santa comes to your home. [12] X Research source"
    },
    {
      "title": "Visit a state in India that largely celebrates Christmas.",
      "content": "Visit a state in India that largely celebrates Christmas. While there are many people in India who celebrate Christmas, it is not the predominant religion or holiday. If you want to fully experience Christmas in India, go to a state where it is widely celebrated. [13] X Research source Popular locations include: Goa on the west coast of India; Arunachal Pradesh, Assam, Manipur, Meghalaya, Mizoram, Nagaland in north-west India; and Kerala and Tamil Nadu in south India. [14] X Research source"
    },
    {
      "title": "Attend a special Christmas Eve midnight mass.",
      "content": "Attend a special Christmas Eve midnight mass. Participating churches in India offer a place of unity for both locals and tourists during Christmas time. The churches will often hold special services to commemorate the holiday and what it stands for religiously, as well as offer beautiful candle lighting ceremonies and prayers. [15] X Research source A special midnight mass is held at the Mount Mary church in Bandra, a western suburb of Mumbai, on Christmas Eve. This is one of the most popular Christmas Eve services in the country. Hundreds of people congregate for this festive mass each year. All of the churches in Bandra are beautifully lit, and the famous Hill Road is decorated with flowers, festive lightning, and trees that are decorated by the locals. [16] X Research source Making arrangements for your travel back home should help as the mass will be at night. Booking a cab is always an available option."
    },
    {
      "title": "Go to a Christmas festival on the beaches in Goa.",
      "content": "Go to a Christmas festival on the beaches in Goa. Goa, located in western India, is one of the most popular tourist spots during Christmas time. People flock to the Goa beaches to experience the annual Christmas festivals that are filled with music, dancing, and local food. If you are looking to spend Christmas on the beach, make sure to visit one of the beaches in Goa. [17] X Research source The popular beaches to visit in Goa during the holiday season are Anjuna, Mapusa, and Candolim. [18] X Research source The nightlife in Goa is also something great to experience. The churches and homes are decorated with lights and poinsettia flowers, and children gather in groups to sing carols late into the night. [19] X Research source Other popular Christmas festivals are held in Delhi, Mumbai, Bangalore, and Chennai. [20] X Research source"
    },
    {
      "title": "Take a ride on the toy train between Kalka and Shimla.",
      "content": "Take a ride on the toy train between Kalka and Shimla. If you are celebrating Christmas with young children, then taking this train into Shimla is a must. Shimla is a bustling tourist spot during the holidays. It is known for its toy train that travels past snow-capped mountains, cabins, and British-era buildings and castles. [21] X Research source If you want to ride the toy train, make sure to book tickets in advance. Unlike other trains in India, you can only reserve tickets for the toy train on3 month in advance instead of the traditional two months. The ticket fare varies greatly between the different toy train rides offered. The lowest fare is the Shimla-Kalka Express at 70 rupees ($1.00 USD, or 0.86 euros), and the most expensive fare is the Shivalik Deluxe at 500 rupees ($7.13 USD, or 6.16 euros). [22] X Research source The average toy train ride can take five to six hours. If you have other plans, you might want to reschedule them to a different day. [23] X Research source"
    },
    {
      "title": "Take part in an end of the year festival in the port city of Kochi.",
      "content": "Take part in an end of the year festival in the port city of Kochi. The last week of December is packed with festivals and carnivals that take place all over the city. Going to Kochi is great if you are looking to experience local art, games, and sports. [24] X Research source Artists and performers display their talent at the Kochi-Muziris Biennale festival. Fireworks, decorated elephants, traditional dancing, and sporting competitions can be seen at the Cochin Carnival. The Indira Gandhi Boat Race utilizes the historic ports of the city to for an exciting boating display."
    },
    {
      "title": "Go listen to local caroling.",
      "content": "Go listen to local caroling. Many states that celebrate Christmas will begin caroling around town a week or two before Christmas Day. Even if you do not understand the language the carols are sung in, the upbeat melody will still get you in to the Christmas spirit. As a member of the church, you can participate in the choir and also opt for singing at various church units and homes on Christmas. [25] X Research source Goa in western India and Bandra, a suburb of Mumbai, are known for their festive caroling that goes long into the night. [26] X Research source"
    }
  ]
}