{
  "url": "https://www.wikihow.com/Become-a-Welcome-Wagon-User-on-wikiHow",
  "title": "How to Become a Welcome Wagon User on wikiHow",
  "steps": [
    {
      "title": "Gain experience before applying.",
      "content": "Gain experience before applying. Becoming eligible to apply will require that your account is at least a month old and shows significant, meaningful editing activity. In doing so, you are demonstrating that you are able to help users with any problems they come across. Unlike Admins and Boosters , you don't need to know all of the policies, you just have to know how to be friendly and encouraging while pointing people in the right direction. A great way to gain experience is by greeting newcomers from the new contributors page, following these guidelines. Ask other Welcomers for advice. The Welcome Wagon has its own list on the forums for those who've sent messages with the Welcome Wagon tool though it doesn't show complete messages and may be difficult to read. However, wikiHow also has a list of Welcomers, but it doesn't list their exact messages. It's used to find links to reach out to these Welcomers to ask them questions. Visit this list for active Welcomers. Those who've contributed messages with the Welcome Wagon tool in the last 30 days are listed on the Active Welcomers List ."
    },
    {
      "title": "Learn more about the Welcome Wagon tool.",
      "content": "Learn more about the Welcome Wagon tool. Read up on How to Use the Welcome Wagon Tool on wikiHow. It will give you a brief explanation on how the tool looks and some of the features it contains."
    },
    {
      "title": "Take the Welcome Wagon test",
      "content": "Take the Welcome Wagon test . Begin your test by reading the ten provided new user scenarios, then write positive and personalized responses to at least five of them. Do not copy other's responses, if you cannot think of your own answer then you may need to gain more experience . You can write your answers in an email (that you'll send when finished) or Google Doc (no need to include the questions with your responses). Number each answer (e.g. \"User2\" right above that answer), and make sure the numbering matches the numbers on the test. Remember to use steps in the \"Writing a Welcome Message\" section of How to Welcome New wikiHow Users. Use wikiText the same way you would when posting a talk page message. Examples are weaving links and formatting text with bold , italic , and/or underline if you wish."
    },
    {
      "title": "Email",
      "content": "Email your completed test. Send it to jayne@wikihow.com . You should receive a reply in a week or so, letting you know if you passed the test. Be sure to include your wikiHow username in the email so that Jayne (a wikiHow staff member) knows who to add the Welcome after learning and practicing more. If you pass, you can add yourself to this list of active Welcomers."
    }
  ]
}