{
  "url": "https://www.wikihow.com/Call-Austria",
  "title": "How to Call Austria",
  "steps": [
    {
      "title": "Enter the international exit code to dial out of the country.",
      "content": "Enter the international exit code to dial out of the country. All countries require you to enter an exit code to dial out, however, this number can vary depending on the country you are calling from. [1] X Research source For instance, to call from the US or Canada, dial “011”. Other countries may use “0” or “11”. A quick internet search for “calling abroad” or “international exit codes” will give you the exit code for your country. If you are calling from a cell phone, you can enter a + sign in place of the exit code. This will automatically enter your country's exit code so you don't have to. [2] X Research source"
    },
    {
      "title": "Enter the country code \"43\" to dial in to Austria.",
      "content": "Enter the country code \"43\" to dial in to Austria. Since this is the code used to access Austrian lines, it will be the same no matter which country you are calling from."
    },
    {
      "title": "Enter the area code and phone number to call a landline.",
      "content": "Enter the area code and phone number to call a landline. Austrian phone numbers range from 4 to 13 digits, so don’t be alarmed if some numbers seem longer or shorter than you’d expect. [3] X Research source It may look like this: 011-43-XXX-XX-XX or this: 011-43-1-XXX-XX-XXXX Calling a cell phone does not require you to dial the area code. Instead, just enter the mobile phone number (which will begin with a “6”) after you’ve entered the exit and country code."
    },
    {
      "title": "Use an online search engine to find the current time in Austria.",
      "content": "Use an online search engine to find the current time in Austria. Austria is in the Central European time zone and observes Daylight Savings Time during certain times of the year. Austria is 9 hours ahead of the US Pacific time zone, so that can make a big difference in the time you choose to call."
    },
    {
      "title": "Research rates charged per-call.",
      "content": "Research rates charged per-call. Rates vary and often depend on whether you are calling to a landline or mobile phone. Most carrier’s rates range from $1.15 - $2.00 per minute, and can also vary for nights or weekends. [4] X Research source Check with your carrier for specific pricing. This will be your best choice if you only need to make one or two calls. Expect to pay taxes and fees in addition to the basic per-minute rate."
    },
    {
      "title": "Purchase a prepaid calling card to save money on lengthy calls.",
      "content": "Purchase a prepaid calling card to save money on lengthy calls. Most calling cards will allow you to spend less than 10 cents per minute for international calls. These prepaid cards are typically super easy to purchase and use . Consider this option if your calls will only be made during a short period of time."
    },
    {
      "title": "Contact your phone carrier about an international plan for frequent calls.",
      "content": "Contact your phone carrier about an international plan for frequent calls. A monthly phone plan will automatically charge you a recurring fee (between $10.00 and $30.00) for a set amount of minutes, and then may charge you a discounted per-minute rate if you exceed that amount. [5] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source This option ensures you are always able to make a call without having to worry about how many minutes you have available or paying excessive rates. Keep in mind that phone plans will often charge additional taxes and fees as well."
    },
    {
      "title": "Use VoIP through your internet service for another cost-effective option.",
      "content": "Use VoIP through your internet service for another cost-effective option. Voice over Internet Protocol (VoIP) allows you to make phone calls using your internet connection rather than a standard telephone line. [6] X Research source This requires a more extensive initial setup, but the cost savings may be worth it. [7] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source Initial start-up costs range from $2.00 to $30.00, and service fees can be as little as $4.99 per month. [8] X Research source Some VoIP options, like Skype, add the additional benefit of video calling, which could be a fun way to stay in touch!"
    }
  ]
}