{
  "url": "https://www.wikihow.com/Cheapest-Way-to-Move-Out-of-State",
  "title": "How to Move Out of State on a Budget: Truck Rentals, Packing Tips & More",
  "steps": [
    {
      "title": "Rent a moving truck to save money and do everything yourself.",
      "content": "Rent a moving truck to save money and do everything yourself. One of the easiest ways to save money when moving is to do most of the labor yourself. When choosing how to ship your belongings to your new home, renting a moving truck, like a U-Haul, is typically going to be one of your cheapest options. You’ll load the truck , drive it yourself, and unload it when you reach your destination. [1] X Research source Cost estimate: Prices for rental trucks vary depending on the company, the size of the truck you need, and how far you’re traveling. On average, it costs between $700 and $2000 to rent for a long distance move, plus mileage, gas, and fees. Plus, factor in expenses for hotels and meals as you travel. For one-way trips, like moving long distance, many companies offer unlimited mileage, so research different options before booking. Keep in mind, you’ll have to do all the heavy lifting and driving yourself, so if that’s something you’re not willing or able to do, it’s probably better to choose a different option."
    },
    {
      "title": "Hire a full-service moving company for convenience.",
      "content": "Hire a full-service moving company for convenience. While full-service companies are typically more expensive than renting a truck and doing everything yourself, they’re much more convenient. Long distance moving companies will do all the loading, driving, and unloading for you. Some companies will even pack your boxes. If doing these things yourself would be too difficult, it may be better to shell out some extra money and hire professionals. [2] X Research source Cost estimate: Full-service quotes can vary by thousands of dollars and can cost upward of $12,000 depending on how much work they need to do and how far you’re moving. Many companies price match, though, so get quotes from several to find the best price. Make sure that interstate movers have proper licensure for out-of-state moves. Most full-service movers require a 50% deposit upfront."
    },
    {
      "title": "Hire local workers to load and unload your truck for a cheaper option.",
      "content": "Hire local workers to load and unload your truck for a cheaper option. If you’re fine with driving but need help loading and unloading your boxes, save some money you would’ve spent on full-service companies by hiring moving labor. Online marketplaces like HireAHelper allow you to hire workers on an hourly basis and receive a $1000 money-back service guarantee. This way, you can rest assured that your belongings will be handled with care. [3] X Research source Cost estimate: $40-$80 per hour. The cost will vary depending on average rates in your area, how many workers you need, and how many belongings need to be moved. It’s also possible to find workers on sites like Craigslist and Facebook, but be sure to vet all workers before agreeing to their services. Make arrangements for your current and future home so you have workers to help with both the loading and unloading process. Keep in mind that in addition to paying the laborers, you’ll also likely have to pay for a moving truck, depending on how many boxes you have."
    },
    {
      "title": "Rent a cargo van or use a tow-behind trailer for smaller moves.",
      "content": "Rent a cargo van or use a tow-behind trailer for smaller moves. If you have a smaller home, like a studio apartment, cut expenses by renting a cargo van rather than a moving truck. Cargo vans are smaller, easier to drive, and get better gas mileage, which goes a long way when it comes to long distance trips. Or, drive your own vehicle and rent a tow-behind trailer to store your belongings. Cost estimate for cargo vans: $20-$100 per day, plus mileage. The price depends on average costs in your location, as well as how far you’re traveling. Cost estimate for trailers: $150-$300 per day. Some companies also offer hourly rates at $25 to $50 an hour. The exact price will depend on the size of the trailer needed, as well as how far you’re traveling. Many moving companies don’t allow you to rent cargo vans for interstate moves, so double-check before booking one. Penske typically allows long distance moves, while U-Haul limits usage to cross-town moves. If you choose to use a trailer , make sure your vehicle meets towing requirements. Trailers can be dangerous, too, so make sure you have experience using them if you choose one. If you have anything larger than a studio apartment, these options likely won’t be large enough, so you’ll need to opt for something like a moving truck."
    },
    {
      "title": "Drive a car and ship your boxes if you don’t have that many.",
      "content": "Drive a car and ship your boxes if you don’t have that many. If you’re driving your own car to your new home, try to load in as many boxes as you can to save money. Then, if you don’t have many left, ship them via a typical shipping service (like USPS, UPS, or FedEx) or with an LTL freight carrier. LTL means “less-than-truckload,” meaning your belongings only take up a small amount of space in the freight carrier. You’ll only be charged for the space that you use, rather than having to pay for an entire freight carrier. [4] X Research source Cost estimate: For a shipping service, freight, or moving company, the average shipping cost is between $1.50 and $2.50 per mile. If you’re using via UPS, USPS, or FedEx, expect to spend anywhere from $10 to $100 per box, depending on the size and contents. Pack efficiently to reduce the amount of boxes you need to ship so you can save money. LTL delivery typically takes longer than renting a freight trailer because they’re shipping other people’s belongings, as well. Be aware that your items could be damaged during shipping, so be sure to pack them well. If you don’t have a car, another option is to use public transportation. Greyhound allows you to store up to 150 pounds of luggage under the bus, and Amtrak allows you to ship up to 500 pounds. Bus or train tickets usually only cost a few hundred dollars."
    },
    {
      "title": "Rent a moving container if you need extra storage.",
      "content": "Rent a moving container if you need extra storage. Moving containers act as a middle ground between DIY moves and using a full-service company. The moving container company will send a storage container (usually 8-16 ft or 2.4-4.8 m) to your house. You’ll pack it yourself, then the company will come pick it up and place it in temporary storage or ship it to your new house. This is a good option if you don’t want to do all the driving and/or need some extra storage. [5] X Research source Cost estimate: On average, moving containers cost about $5000 for a cross-country move, but the exact price will be determined by the size you need and how far you’re moving. If you’re choosing a moving container mainly for storage purposes, keep in mind they can be more expensive than getting a storage unit if you plan on storing your belongings for an extended period of time."
    },
    {
      "title": "Set a budget and use cash whenever possible.",
      "content": "Set a budget and use cash whenever possible. Examine your household expenses to see how much you can spend on your move. When creating your budget , consider things like housing deposits, packing materials, and personal travel expenses (hotel rooms, food, gas, etc.) in addition to the amount you’re spending on a moving company. While it won’t always be possible, try to pay for most of your expenses in cash or with your debit card. This will help prevent you from going into credit card debt. [6] X Research source"
    },
    {
      "title": "Declutter and downsize your belongings.",
      "content": "Declutter and downsize your belongings. Odds are, you have a lot of stuff lying around that you don’t really need or want anymore. In the early stages of planning your move, go through all of your belongings and see what you’re willing to get rid of . Have a garage sale , give items to friends or family, or sell your belongings on sites like Facebook Marketplace. Consider donating to local thrift shops or donation centers, as well. [7] X Research source Professional movers often charge based on how many boxes they have to load and unload, and even if you’re doing most of the labor yourself, getting rid of unnecessary belongings will free up more space. You may even be able to rent a smaller truck or trailer, which will save money. For example, if you have any broken furniture stored in the garage, now’s the time to finally toss it. Or, if you have workout equipment you haven’t touched in years, sell it for some extra cash. Even decluttering your closet can help!"
    },
    {
      "title": "Look for free moving boxes and packing supplies.",
      "content": "Look for free moving boxes and packing supplies. Buying packing supplies like boxes and bubble wrap can add up, but there are a ton of ways to pack for little to no money. See if your friends or family have any extra boxes and ask local grocery and retail stores if you can take the ones they’re recycling. Instead of buying bubble wrap or packing peanuts, you can probably get away with wrapping fragile items in blankets, clothes, and towels. [8] X Research source"
    },
    {
      "title": "Ask your friends to help you pack.",
      "content": "Ask your friends to help you pack. When moving, a lot of your money will go towards physical labor. Avoid having to pay professionals to pack, load, and unload your belongings by getting help from friends and family. If you work together, it shouldn’t take more than an afternoon, and you can thank them by buying them pizza. In most cases, your friends will be happy to help, as this will be one last memory together before you hit the road. [9] X Research source"
    },
    {
      "title": "Compare rates between at least 3 moving companies.",
      "content": "Compare rates between at least 3 moving companies. Even though they’re all going to the same place, different moving companies charge different amounts for their services. Don’t book the first company you find; look around for better prices. Often, these companies will price match each other, so you may be able to book with your preferred company for a cheaper price. [10] X Research source"
    },
    {
      "title": "Look for moving discounts.",
      "content": "Look for moving discounts. Many moving companies offer discounts to seniors, members of the military, and others. [11] X Research source Most also offer different seasonal discounts throughout the year. Even if you don’t see any listed on the moving company’s website, give them a call. It never hurts to ask, and there might be something you overlooked!"
    },
    {
      "title": "Negotiate a relocation package with your employer.",
      "content": "Negotiate a relocation package with your employer. If you’re moving for work, ask if a relocation package is available. A relocation package is when your employer covers most or all of your moving expenses. Keep in mind that not all companies offer these packages, and those that do typically offer them in the form of reimbursement, so you’d still have to pay the costs upfront. [12] X Research source For example, a relocation package might cover house hunting trips to your new city, some costs associated with buying and selling a home, shipping costs for your belongings, travel expenses for your final move, and temporary housing."
    },
    {
      "title": "See if your home and auto insurance covers moving.",
      "content": "See if your home and auto insurance covers moving. As you’re exploring moving companies and shipping options, you’ll likely be offered moving insurance many times. This insurance typically protects you from theft or damage to the rental equipment or your belongings, but it could be a waste of money if your home and auto insurance already cover moving. Be sure to check your insurance plans before buying the extra insurance. [13] X Research source"
    },
    {
      "title": "How much does it cost to move out of state?",
      "content": "How much does it cost to move out of state? The exact cost depends on a number of factors, like how far away you’re moving, how many belongings you have, and whether or not you use professional movers. On average, moving out of state costs between $2700 and $7000. [14] X Research source"
    },
    {
      "title": "What is the cheapest option for moving out of state?",
      "content": "What is the cheapest option for moving out of state? Your cheapest option will depend on the size of your move and where you’re moving to, but the more labor you do yourself, the cheaper it will be. If your move is small enough, try fitting all your belongings in your car and driving to your destination, or if you need more room, rent a moving truck like a U-Haul and load, drive, and unload it yourself. [15] X Research source"
    },
    {
      "title": "When is the best time of year to move?",
      "content": "When is the best time of year to move? Plan your move during the off-season. In general, January is the cheapest month for moving, but you’ll also save money anywhere between September and April, as most people move in the summer. Try to avoid weekends and holidays, as well. [16] X Research source"
    },
    {
      "title": "How do I start relocating?",
      "content": "How do I start relocating? Determine your budget and timeline, as well as how many belongings you’ll have to transport. This will help you figure out which type of move will work best for you and what, if any, transportation you’ll need to rent. Then, begin getting quotes from moving companies to get an approximate price. [17] X Research source"
    }
  ]
}