{
  "url": "https://www.wikihow.com/Braid-a-Horse%27s-Mane",
  "title": "How to Braid a Horse's Mane",
  "steps": [
    {
      "title": "Wash the mane.",
      "content": "Wash the mane. If the horse's mane is dirty, wash it with horse shampoo. Do not use conditioner, which makes the mane slick and difficult to braid."
    },
    {
      "title": "Pull and trim the mane if needed.",
      "content": "Pull and trim the mane if needed. If your horse's mane is thick, \"pulling\" it with a mane comb will make it much tidier and easier to handle. If the mane is already thin, you can instead trim it to an even length with a blade. Manes are typically cut to no longer than a hand (about 4 inches, or 10 cm), although this is less important for button braids. Ideally, washing and pulling should be done at least a day before braiding."
    },
    {
      "title": "Tie the horse",
      "content": "Tie the horse . Tie your horse in a quiet area free from distractions. Encourage the horse to stand still with a hay net, unless your horse tends to move while eating. Leave standing room to braid the mane on the right side of the horse, which is traditional for hunter and dressage competitions. For jumper competitions, you may braid the mane on whichever side it falls naturally. [1] X Research source"
    },
    {
      "title": "Set up the area.",
      "content": "Set up the area. Before you begin, there are a few steps that can make the process easier: Sweep hay and other ground cover away from the horse so you can find dropped objects, especially if you are using a needle. Place a stool next to the horse if you cannot reach the horse's neck easily. Working with the mane at waist level might be easiest. Put down a container for your tools, or wear an apron or overalls with a large pocket."
    },
    {
      "title": "Brush the mane with a wet body brush.",
      "content": "Brush the mane with a wet body brush. Take a soft body brush, and dip it in water, egg white , or hair gel for horses, to keep the mane flat and easy to work with. Brush gently to remove all tangles."
    },
    {
      "title": "Choose a braiding method.",
      "content": "Choose a braiding method. Continue on to any one of the sections below, or use these tips to decide which you want to try: The band method makes easy, dangling braids, best for short manes. The yarn method is harder, but makes sturdy, attractive looped braids. Sewing creates small \"button braids\" often used in dressage. You'll need to use bands or yarn first before you can sew these on. A running braid is quick and easy, but not suitable for competitions."
    },
    {
      "title": "Divide the mane into equal sections.",
      "content": "Divide the mane into equal sections. Using a mane comb, comb the mane into narrow sections. Start at the top and work your way down. As you get further down the mane, the hair gets thinner, so your sections will become gradually wider in order to ensure evenly sized braids. Secure each equal section with a loosely wound elastic band. For practice braids, choose a band color that stands out. For competitions, choose a band color that matches your horse's mane. Traditionally, an odd number of sections are used. Use more sections for horse's with short, wide necks, and fewer sections for horses with long, thin necks."
    },
    {
      "title": "Braid the first section tightly",
      "content": "Braid the first section tightly . Remove the band before braiding, and begin at the top. This can be a basic braid or a French braid . For a basic braid, divide the section into three pieces and alternately weave the left and right section over the middle. Pull the hair down as you work, not toward you, so the braid lies in the right direction. Dampen the section again with the body brush if it is difficult to work with."
    },
    {
      "title": "Fold the braid tip and secure tightly with an elastic band.",
      "content": "Fold the braid tip and secure tightly with an elastic band. Fold the tip of the braid back under itself a short distance. Secure the tip of the braid with a tightly wound elastic band. If the mane is long, fold the braid tip a second time before securing."
    },
    {
      "title": "Repeat down the length of the neck.",
      "content": "Repeat down the length of the neck. Repeat with each section, trying to make it as neat as possible. Optionally, place a small dab of egg white or hair gel for horses over each braid to help keep it in place. Never leave the braids in overnight without protection (see Tips). After removing them, brush the mane out with water. Optionally, if you want a tidier and showier braid, move on to the section on sewing button braids."
    },
    {
      "title": "Gather supplies.",
      "content": "Gather supplies. This method requires a latch hook and yarn. You can buy both at a craft store. If you prefer button braids to dangling braids, you'll need yarn, strong cotton thread, and a needle instead."
    },
    {
      "title": "Separate a section of mane at the top.",
      "content": "Separate a section of mane at the top. Separate a section at the top of the mane, 1 inch (2.5 centimeters) wide. Clip the rest of the mane with an alligator clip until you're ready to work on the next section. If the mane is too thick to braid easily, the sections can be as narrow as ½ inch (1.25 cm). [2] X Research source"
    },
    {
      "title": "Dampen the section of mane.",
      "content": "Dampen the section of mane. Braiding in the yarn will be much easier if you keep the horsehair wet. Work in water, egg white, or hair gel for horses with a comb or your fingers."
    },
    {
      "title": "Braid halfway down",
      "content": "Braid halfway down . Braid the mane as you would human hair, dividing it into three plaits and weaving the left and right around the center. Stop when you are about halfway down the length of the mane. Pull down along the horse's side as you braid, not out toward you, or the braid won't lie flat. If you want your braids to look as professional as possible, count the number of crossovers in the braid before you stop, so you can use the same number for each section."
    },
    {
      "title": "Cut off a section of yarn.",
      "content": "Cut off a section of yarn. Start with a piece of yarn about one foot (30 cm) long. [3] X Research source You'll quickly find out whether you need a shorter or long piece for your horse. Once you know how long a piece to use, you can save time by laying the yarn back and forth to the correct length, and cutting it into strands all at once."
    },
    {
      "title": "Insert the yarn in the braid.",
      "content": "Insert the yarn in the braid. Fold the yarn over so the tips meet. Place the middle of the yarn over the braid, at the last crossover you did before stopping."
    },
    {
      "title": "Braid once over the yarn.",
      "content": "Braid once over the yarn. Perform the next crossover as you would normally, but lay it over the yarn loop, trapping it beneath the hair."
    },
    {
      "title": "Finish the braid with the yarn strands.",
      "content": "Finish the braid with the yarn strands. Divide the yarn so one strand is with the left section of mane, and the other is with the right. Continue to cross the braid over as usual, pulling downward to keep the yarn and mane taut. Stop when there are 4 inches (10 cm) of hair left hanging."
    },
    {
      "title": "Tie off the end.",
      "content": "Tie off the end. Grasp both strands of yarn dangling below the braid, and loop them around the braid tip. Pinch the braid tip together, then thread one yarn end through the loop and pull into a tight knot. Leave the remaining yarn dangling below the braid."
    },
    {
      "title": "Trim the hair tips (optional).",
      "content": "Trim the hair tips (optional). Optionally, you can trim the hair strands beneath the yarn knot. Take care not to cut the yarn, and trim at an angle with a sharp pair of scissors to create a clean point of hair."
    },
    {
      "title": "Repeat along the length of the mane.",
      "content": "Repeat along the length of the mane. Repeat the steps above for the rest of the mane. Each braided section should use the same amount of hair. If the hair thins out toward the bottom of the mane, compensate by making wider sections."
    },
    {
      "title": "Decide on a braid style.",
      "content": "Decide on a braid style. You have three options at this point: Leave the braids as-is. (Not recommended for competitions.) Continue to the next step to complete the yarn loop. Tie off the yarn, cut off the extra, and skip down to the button braid section."
    },
    {
      "title": "Use the latch hook to pull each braid up to the top.",
      "content": "Use the latch hook to pull each braid up to the top. Push the end of the latch hook through the top of the braid, at the neck. Hook the dangling yarn tails, and pull them up until the braid tip touches the top of the braid, and the yarn tails extend past it. Repeat with each braid, so you have a series of looped braids along the mane. Do not pull any further. The braid tip should not push through the top of the braid, just rest against it."
    },
    {
      "title": "Loop the yarn tails around the braid.",
      "content": "Loop the yarn tails around the braid. Remove the latch hook and set it aside. Pick up the two yarn tails on a single braid. Loop one yarn tail under from the left and the other from the right, crossing each other under the braid next to the neck."
    },
    {
      "title": "Tie the yarn tails halfway down the braid.",
      "content": "Tie the yarn tails halfway down the braid. After crossing the yarn under the braid, switch the hands you're holding them with. Bring them together again halfway along the braid loop, and tie them together at the top side of the braid. Tie one knot over your thumb, then slip the yarn tails through where your thumb are. Tighten the first knot, then tie a second above it to make a strong double knot. Repeat with each braid. Each knot should be in the exact middle of the braid, or the braid will slant."
    },
    {
      "title": "Snip off the ends of the yarn.",
      "content": "Snip off the ends of the yarn. Cut the dangling ends of the yarn with a pair of scissors, leaving about ¼ inch (6 millimeters). Repeat for each braid, and you're ready for a show. See the Tips section if you need to leave the braids in overnight. To remove these braids, just snip the yarn knot and gently pull the yarn through the braid. When all braids are removed, brush the mane with a wet body brush."
    },
    {
      "title": "Braid the mane using bands or yarn.",
      "content": "Braid the mane using bands or yarn. Follow the steps in the band or yarn section to create braids in your horse's mane. At the end of it, you should have a line of braids running down your horse's neck. While there are no rules determining how many button braids to use, different competitions follow different fashion fads: Dressage competitions, where button braids are most popular, use 11, 13, 15, or 17 braids. In show hunter competitions, 40 or more tiny button braids are a more favored style. In jumper competitions and other situations where style does not earn points, braid however you like, or not at all."
    },
    {
      "title": "Thread a needle with cotton thread",
      "content": "Thread a needle with cotton thread . Find a sturdy cotton thread that matches your horse's mane color, or use a brightly colored thread for an easier practice session. Thread the needle, then tie a knot in the thread to keep it from slipping out. You can buy \"plaiting thread\" for this purpose, but any strong cotton thread will work."
    },
    {
      "title": "Sew up through the tip of the braid.",
      "content": "Sew up through the tip of the braid. Push the needle through the tip of the braid and pull it through. Do this two or three times in the same direction, until the thread is securely lodged in the braid. [4] X Research source"
    },
    {
      "title": "Fold the braid tip up and sew it to the base.",
      "content": "Fold the braid tip up and sew it to the base. Fold the tip of the braid under the rest of the braid, to rest against the horse's neck. Secure the tip of the braid to the base of the braid by pushing the needle and thread through."
    },
    {
      "title": "Fold the braid again.",
      "content": "Fold the braid again. If the braid still dangles down in a line, roll the middle under the braid to form a ball. This is the \"button braid\" look we're going for, also called a \"rosette braid\" or \"dressage braid.\""
    },
    {
      "title": "Sew back and forth through the base.",
      "content": "Sew back and forth through the base. Push the needle through the left side of the button braid, as close to the neck as you can work without risk of poking the horse. Pull the needle back through the right side of the braid base, then push it through the center."
    },
    {
      "title": "Repeat until sturdy.",
      "content": "Repeat until sturdy. Bring the needle back over to the side of the braid you're next to. Repeat the last step at least two more times, pushing it through the left, pulling back through the right side, then pushing out again through the center. [5] X Research source You are done when the braid is tight and secure, and there is no loose thread. These balled-up braids can rest on top of the neck (better for long, thin necks) or fall slightly onto the right side (better for short, wide necks). You can control their position by how tightly you sew them, but don't stress too much about this while you're learning."
    },
    {
      "title": "Loop the thread around any stitch.",
      "content": "Loop the thread around any stitch. Loop the thread around one of your previous stitches, but don't pull it all the way tight. Leave a small loop."
    },
    {
      "title": "Knot the braid.",
      "content": "Knot the braid. Thread the needle through the loop and tighten to create a knot close to the base of the braid. Cut the thread with a pair of scissors, as close to the knot as possible."
    },
    {
      "title": "Repeat for the remaining sections.",
      "content": "Repeat for the remaining sections. Repeat for each section of the mane. checking to make sure each section has roughly the same amount of hair. See the Tips section for how to protect the braids overnight. When it comes time to remove them, snip off a stitch on the left side and a stitch on the right with a pair of scissors, carefully avoiding the braid itself. Brush the mane down with a wet brush after all braids are removed."
    },
    {
      "title": "Divide the top of the mane into three pieces.",
      "content": "Divide the top of the mane into three pieces. This is a quick and easy method to keep your horse's mane tidy for everyday training or riding, but should not be used for competitions where style is judged. Pick up three swathes of mane of any size, at the top of the mane."
    },
    {
      "title": "Begin braiding.",
      "content": "Begin braiding. Start to braid or French braid as you would normally, weaving the strands over each other. Stop after the first weave or two, and use the steps below to braid the entire mane with a quick and easy method."
    },
    {
      "title": "Bring in more mane as you braid.",
      "content": "Bring in more mane as you braid. Each time you pick up the section on the side nearest the rest of the mane (left, if your horse's mane falls on the right), add another chunk from the rest of the mane."
    },
    {
      "title": "Wrap elastic around the end of the braid.",
      "content": "Wrap elastic around the end of the braid. Just keep braiding until you're at the end of the mane. You should have a diagonal braid running from the top to the bottom of the mane; it's fine if there is loose hair above the lower end of the braid. Finish by wrapping an elastic band tightly around the tip of the braid."
    }
  ]
}