{
  "url": "https://www.wikihow.com/Build-a-Bocce-Ball-Court",
  "title": "How to Make an Easy DIY Bocce Ball Court",
  "steps": [
    {
      "title": "Decide how large you would like your court to be.",
      "content": "Decide how large you would like your court to be. A regulation-sized bocce ball court measures 13 ft by 91 ft (4 m by 28 m). [1] X Research source However, unless you are planning to build a regulation-size bocce ball court, you can build the court any size you would like. As a broad rule of thumb, the court’s ratio of width to length should be between 1:5 and 1:7. Build a court that will suit the dimensions of your backyard (or wherever you decide to build the court). If you are working with limited space, you could build a bocce court in as little space as 5 ft by 20 ft (1.5 m by 6 m). [2] X Research source"
    },
    {
      "title": "Measure the length and width of your court.",
      "content": "Measure the length and width of your court. Using a measuring tape, measure out the full length and width of your bocce court on the ground where you plan to build it. Keep in mind that you’ll need to add the dimensions for the backing material (e.g. the court frame) into your total width and length measurements. [3] X Research source So, if you’re using 4x4 boards as your frame, you’ll need to add 8 inches (20 cm) to the length and width measurements. For example, if you’re building a regulation-sized bocce court, you’ll need to measure the outer dimensions of the court to be 13 ft 8 inches by 91 ft 8 inches (4.2 m by 28 m)."
    },
    {
      "title": "Drive in stakes at the corners of the court.",
      "content": "Drive in stakes at the corners of the court. Once you’ve measured out the length and width of the court, use a hammer to drive a stake into the ground at each corner. [4] X Research source These will serve as markers to indicate the size of the court, and indicate the area you’ll excavate. You can purchase a handful of wooden or plastic stakes at your local hardware store. They should be relatively inexpensive, and do not need to be made of a high-quality material."
    },
    {
      "title": "Dig out the court area.",
      "content": "Dig out the court area. The best way to flatten and level the area for your bocce court is by digging down about 2–4 inches (5–10 cm) into your soil. This will allow you to shovel out any rocks or clumps of soil that would disrupt the surface of the court, and will give you a pit to lay subsequent layers of the court. [5] X Research source The bocce court will need to be built on a level area, otherwise the playing surface will be distorted. If you’re concerned that your bocce court may collect rainfall during wet months, dig down less than 4 inches (10 cm)."
    },
    {
      "title": "Install and link the wooden border.",
      "content": "Install and link the wooden border. Although you can use any wooden material you like for the borders, pressure-treated 4x4 boards work well. Lay the 4x4s along the edges of your excavated bocce pit, setting them end to end. Using a carpenter’s level, make sure that all boards are even with the ground. Then fasten each 4x4 board to the adjacent boards using 10-inch (25 cm) spikes. [6] X Research source You can purchase all of the lumber you’ll need at a local hardware store. Plan ahead before you make your visit: if you’re building a regulation-size bocce court, and are buying 10-foot 3-meter) boards, you’ll need about 14 sections of wood."
    },
    {
      "title": "Lay a base of washed crushed stone.",
      "content": "Lay a base of washed crushed stone. The base layer of your bocce court should be made of relatively large and stable stone. Use a shovel to lay a layer of 1-inch stone throughout the entire bocce court. [7] X Research source If you’ve dug the court area 4 inches (10 cm) deep, plan to lay about a 2-inch (5 cm) layer of this large-stone material. You can buy 1-inch washed crushed stone at a nearby hardware store or gardening center. If you’re having trouble finding the correct material, also try contacting a nearby rock quarry or gravel site."
    },
    {
      "title": "Lay a second layer of crushed stone or gravel.",
      "content": "Lay a second layer of crushed stone or gravel. Once you have the 1-inch stone layer covering the entire excavated bocce pit, you can add the second layer. This layer should comprise smaller stones. There are no precise size requirements; gravel would work well, as would ½-inch crushed stone. [8] X Research source Use your shovel blade to cover the entire bocce court with the gravel. The layer should be at least 1 inch (2 cm) thick. As with the 1-inch washed crushed stone, you can purchase gravel or smaller crushed stones from a gravel site or landscaping company."
    },
    {
      "title": "Place a layer of ground oyster shells if you’re building a regulation court.",
      "content": "Place a layer of ground oyster shells if you’re building a regulation court. If you’re planning to build a regulation bocce court (or have dreams of becoming a professional bocce ball player), you’ll need to top your court with processed oyster shell. The layer only needs to be about ¼-inch (0.6 cm) thick. [9] X Research source This material is incredibly fine grained, and will not be damaged or disturbed by rain storms. [10] X Research source Unless you live on the West coast of the United States (or in an international costal region), you’ll need to have your processed oyster shell shipped to your address. You may be able to purchase ground oyster shells from a local landscaping company or from a feed and grain supplier. A small number of online retailers also sell and deliver ground oyster shell."
    },
    {
      "title": "Lay sand as your top bocce court layer.",
      "content": "Lay sand as your top bocce court layer. If you’re not looking for a professional playing surface—and want to save some money—you can skip the processed oyster shells. A layer of ordinary sand will provide a suitable playing surface. Pour the sand at least ½-inch (1.2 cm) thick over the underlying layer of stones or gravel, and use a shovel to smooth the sand and press it into all corners of your bocce court. [11] X Research source The primary disadvantage of sand is that it will become soggy and compacted following a rainstorm. You’ll need to rake the sand in order to help it dry and reduce its compactness."
    },
    {
      "title": "Finish the court with artificial turf.",
      "content": "Finish the court with artificial turf. If you’d prefer not to play on processed oyster shells or on sand, you can lay artificial turf as the playing surface. This material is inexpensive and simple to maintain: it can be easily swept clean of twigs or debris. [12] X Research source You can obtain artificial turf at a gardening center or plant nursery. Also contact your local hardware store or even a sporting-goods store to see if they can provide the artificial turf. Depending on the size of your bocce court and the size of turf sections that you can purchase, you may need to buy several sections of turf."
    }
  ]
}