{
  "url": "https://www.wikihow.com/Buy-Unclaimed-Baggage-from-Airlines",
  "title": "3 Places to Buy Abandoned Airport Luggage",
  "steps": [
    {
      "title": "Most luggage is returned to the owner.",
      "content": "Most luggage is returned to the owner. If the baggage has a label, the airline delivers it to the traveler. Unlabeled bags and suitcases hang out in the airport’s lost property department for 5 days. [1] X Research source Then these orphaned items are carted off to a warehouse, and the 90-day countdown to selling starts. [2] X Research source Airlines have a system in place so you can track your lost luggage . A whopping 97% of unclaimed luggage is reunited with its owner. [3] X Research source"
    },
    {
      "title": "After 3 months, airlines sell or donate unclaimed luggage.",
      "content": "After 3 months, airlines sell or donate unclaimed luggage. Once the mandatory 90-day period is up, airlines have the green light to pass the items along to a charity or reselling business. That's where the fun for bargain hunters begins! [4] X Research source Since airlines invest significant manpower and resources in searching for the rightful owner and storing abandoned baggage, they don't end up making a profit from luggage sales. [5] X Research source"
    },
    {
      "title": "Score amazing deals on the Unclaimed Baggage website.",
      "content": "Score amazing deals on the Unclaimed Baggage website . If a trip to Alabama isn't in your future, you can still get in on the treasure hunt! Need a laptop? Skis? A designer handbag? You’ll find all that and more on the Unclaimed Baggage site! Goodies are organized by category and have slick product pics, so you can easily find whatever your heart desires. [6] X Research source Shop with confidence: keep the original packing slip, and you can return most items within 14 days of delivery (you pay the outbound and return shipping fees). If the item was less than $50 USD, there's a $1.99 USD restocking fee. [7] X Research source"
    },
    {
      "title": "Or, buy luggage at the Unclaimed Baggage store in Alabama.",
      "content": "Or, buy luggage at the Unclaimed Baggage store in Alabama. Unclaimed Baggage is the nation’s only retailer of lost luggage. [8] X Research source They open the suitcases, sort the items, then sell, donate, or recycle the loot. [9] X Research source This massive 50,000-square-foot (4,645-square-meter) retail store has become a popular Alabama tourist attraction. The store is organized into 10 departments, with an extra 3-story \"Men's & More\" building next door. Plan for plenty of time to explore! Feeling posh? Stop by guest services or call ahead to book a free 90-minute session with a professional style advisor. They'll create a personalized fashion profile, then they'll match you up with fabulous clothing and accessories! [10] X Research source If you go a little overboard with your shopping spree, guest services has your back. They'll happily mail your haul directly to your doorstep as long as you cover the shipping costs. [11] X Research source"
    },
    {
      "title": "Items that were surrendered at the airport are up for sale too.",
      "content": "Items that were surrendered at the airport are up for sale too. If a passenger has an item that isn't allowed on the plane, they can leave it behind in their vehicle, mail it to their destination, or say goodbye to it. [12] X Research source Agents inventory the surrendered items, then either toss them in a haz-mat can, hand them over to law enforcement, or send them to a surplus center."
    },
    {
      "title": "Surplus centers auction the items online.",
      "content": "Surplus centers auction the items online. It's illegal for the TSA (Transportation Security Administration) to profit from confiscated property, but they can pass the loot on to other agencies that are free to sell it. [13] X Research source These items are often sold on state surplus websites. [14] X Trustworthy Source State of Pennsylvania Official website for the State of Pennsylvania Go to source"
    },
    {
      "title": "Buy in bulk from GovDeals.",
      "content": "Buy in bulk from GovDeals . This website sells huge lots of recovered items. If you’re looking to buy 80 pounds of keys or a pallet of random paperback books, this is the place to look! [15] X Research source"
    },
    {
      "title": "There isn't a way to buy unopened baggage from airlines.",
      "content": "There isn't a way to buy unopened baggage from airlines. Buying and opening a sealed suitcase would be exciting, but businesses make a bigger profit by selling the items individually. [16] X Research source On the bright side, at least you know exactly what you're buying!"
    }
  ]
}