{
  "url": "https://www.wikihow.com/Add-Custom-Music-to-Your-Sims-Game",
  "title": "How to Add Custom Music to Your Sims Game",
  "steps": [
    {
      "title": "Pick out the songs you want.",
      "content": "Pick out the songs you want. Make sure the file is in .mp3 format and is 320kbit/s or smaller. (Anything else can't be read by the game.)"
    },
    {
      "title": "Open the Custom Music folder.",
      "content": "Open the Custom Music folder. This is located at Documents > Electronic Arts > The Sims 4 > Custom Music ."
    },
    {
      "title": "Select one of the station folders in the Custom Music folder.",
      "content": "Select one of the station folders in the Custom Music folder. (It doesn't need to be the \"right\" folder.)"
    },
    {
      "title": "Place the music files into the folder.",
      "content": "Place the music files into the folder."
    },
    {
      "title": "Launch the game.",
      "content": "Launch the game."
    },
    {
      "title": "Access your Music options.",
      "content": "Access your Music options. Click on the ... in the upper right-hand corner, then click on Game Settings . Select Music ."
    },
    {
      "title": "Test the music file.",
      "content": "Test the music file. Pick the station that you placed your custom music in, and play-test the music to see if it works. (Alternatively, you can try playing the station on the in-game radio and seeing if the song comes up.)"
    },
    {
      "title": "Choose the music you want to include.",
      "content": "Choose the music you want to include. Make sure the song is in .mp3 format and 320kbit/s or smaller."
    },
    {
      "title": "Open the Custom Music folder.",
      "content": "Open the Custom Music folder. This is located at Documents > Electronic Arts > The Sims 3 > Custom Music . By default, the Custom Music folder already has music in it. If you don't want these songs in the game, you can safely delete them."
    },
    {
      "title": "Drop the audio files into the Custom Music folder.",
      "content": "Drop the audio files into the Custom Music folder."
    },
    {
      "title": "Launch the game.",
      "content": "Launch the game."
    },
    {
      "title": "Navigate to Music Options.",
      "content": "Navigate to Music Options. Open the main Options menu by clicking ... in the lower left corner, and select Options . From there, find the tab with the musical note and click it."
    },
    {
      "title": "Check that the file appears in the Custom Music list.",
      "content": "Check that the file appears in the Custom Music list. If it does, then you can play it on the Custom Music station in the game."
    },
    {
      "title": "Find the music you want in-game.",
      "content": "Find the music you want in-game. Make sure the file is either in .mp3 format and is 320kbit/s or smaller, or is in .wav format and 1411kbit/s or smaller. It's recommended to use .mp3 files, as not all .wav files will play."
    },
    {
      "title": "Access the main Music folder.",
      "content": "Access the main Music folder. This is located at Documents > EA Games > The Sims 2 > Music . (There will be several subfolders inside to represent the music genres in-game.) If you're playing the Ultimate Collection, the filepath is Documents > EA Games > The Sims 2 Ultimate Collection > Music . If you're playing the Super Collection on a Mac, the filepath is [your username] > Library > Containers > com.aspyr.sims2.appstore > Data > Library > Application Support > Aspyr > The Sims 2 > Music . (You may want to create a shortcut to your game folder in Finder for easy accessibility.)"
    },
    {
      "title": "Place the MP3 file into a station folder.",
      "content": "Place the MP3 file into a station folder. (It doesn't need to be the \"correct\" one.) Do not create, edit, or delete folders, and don't delete preexisting files, as this can cause problems in the game."
    },
    {
      "title": "Launch the game.",
      "content": "Launch the game."
    },
    {
      "title": "Access the Audio Options.",
      "content": "Access the Audio Options. Click on the ... in the lower left-hand corner of the screen, and click on the speaker button."
    },
    {
      "title": "Check the station where you placed the music.",
      "content": "Check the station where you placed the music. The song(s) you added should appear in the station list. If you have FreeTime, you can create custom radio stations for your music; in the Audio Settings tab, click on the stereo icon with the asterisk next to it, and add songs to the new station."
    },
    {
      "title": "Select the songs you want in-game.",
      "content": "Select the songs you want in-game. Make sure the file is in .mp3 format."
    },
    {
      "title": "Open the game's music directory.",
      "content": "Open the game's music directory. This is Program Files > Maxis > The Sims > Music . If you're on a Mac, the directory may start in Applications instead."
    },
    {
      "title": "Choose the appropriate folder.",
      "content": "Choose the appropriate folder. There are two subfolders in the Music folder - \"Stations\" and \"Modes\" - and these folders have their own subfolders for the respective genres. Choose a subfolder of \"Stations\" if you want the music played on the in-game radio. Place your music into a subfolder of \"Modes\" if you want it played while in the Neighborhood, Build, or Buy mode."
    },
    {
      "title": "Start your game.",
      "content": "Start your game. The music should play on the in-game radio or in the background of the Neighborhood, Build, or Buy modes from now on."
    }
  ]
}