{
  "url": "https://www.wikihow.com/Build-Shelves",
  "title": "How to Build Shelves",
  "steps": [
    {
      "title": "Choose your shelving board.",
      "content": "Choose your shelving board. Select a shelving board according to personal preference, your budget and the way in which the shelving complements your décor. There are a wide variety of potential boards to use. Softwood boards: These are easy to have cut to the desired length and can hold many items, including heavy books. Plywood boards: This is made up of layered flat boards. The surface is often made to imitate a wood finish or it can be laminated. Particleboard or chipboard shelves: Made from wood chips glued together under pressure, these are common shelving boards that are lightweight, affordable and easy to find. It is best to get these cut professionally, as the makeup of the boards can blunt cutting tools. [1] X Research source Blockboard shelves: These are stronger than chipboard and are suitable for heavy duty items, like tools and appliances kept in the garage. Pre-made and pre-sized shelving boards: These are traditionally part of a kit and will often be made for adjustable shelves. The instructions for putting these together should always be included; if not, call the retailer or manufacturer."
    },
    {
      "title": "Select the shelf support according to the style of shelf.",
      "content": "Select the shelf support according to the style of shelf. In some cases supports are hidden but a shelf will always require a support of some type. Wood strips: Simple but effective, wood strips or blocks can be used to keep shelves in place. A strip of wood used at both ends of shelving is known as a cleat support. It can be neatened by nailing a piece of wood across the front shelf to hide the side cleats. Metal strips: Available from hardware stores, these can be used as shelf supports. They aren't that pretty, so they may be best for hardware storage in the garage or cupboards. Brackets: Typically L-shaped, these can be fancy or plain. They are simple to use and are usually good for a variety of shelves. Some brackets are so fancy that they can enhance your décor but they will usually cost a lot more than plainer versions."
    },
    {
      "title": "Find some bricks and shelf boards.",
      "content": "Find some bricks and shelf boards. The shelf boards should all be the same length; if not, cut them to the same length. [2] X Research source You can also use cinder blocks, in which case you'll only need one on each side rather than the two bricks."
    },
    {
      "title": "Choose a suitable place for the shelf.",
      "content": "Choose a suitable place for the shelf. Since the shelf has little support, it needs to be flush against a wall, or have some sort of similar flat backing."
    },
    {
      "title": "Place two bricks together on the floor space selected.",
      "content": "Place two bricks together on the floor space selected. Place another two bricks together on the opposite side to form the base of the shelving. The distance between the bricks should be determined by the plank length, with a small amount of plank overhanging at each side (about a 2 inches). There should be two bricks on each side of the shelf to support it."
    },
    {
      "title": "Create the shelving.",
      "content": "Create the shelving. You'll place the first shelf board onto the base bricks. Then place two bricks side by side on the shelf in the same position as the base bricks. This time, add two sets more bricks on top to make a pillar. Do the same for the other side."
    },
    {
      "title": "Add the next shelf board.",
      "content": "Add the next shelf board. The shelf has been made. It's simple but it's adequate for keeping things like books, DVDs and CDs in order. If you want to strengthen this structure, add a cross-brace to the back of the shelf unit, screwing it into the shelf boards."
    },
    {
      "title": "Select a pair of brackets.",
      "content": "Select a pair of brackets. Choose plain or fancy, as required."
    },
    {
      "title": "Choose a shelf board.",
      "content": "Choose a shelf board. Cut it to the length required if it's not already done."
    },
    {
      "title": "Hold a bracket against the wall where you want the shelf to sit.",
      "content": "Hold a bracket against the wall where you want the shelf to sit. Mark the position with a pencil. Use a tape measure to mark the position of the other bracket at the opposite side."
    },
    {
      "title": "Drill the first bracket's hole (or holes) into the wall over the marks you've made.",
      "content": "Drill the first bracket's hole (or holes) into the wall over the marks you've made. Always check for electrical wiring or plumbing before drilling. It's also wise to place a drop sheet on the floor to make it easier to collect the drill dust. Use a masonry drill bit. Drill to the depth that the screw requires to penetrate the wall sufficiently. Insert a wall plug."
    },
    {
      "title": "Hold the bracket in place.",
      "content": "Hold the bracket in place. Attach the screw (or screws) by screwing them in as far as they will go."
    },
    {
      "title": "Place the shelf board onto the brackets.",
      "content": "Place the shelf board onto the brackets. Hold the board in place with one hand. Then, using a spirit level, hold the board across to the other mark you made earlier to check that the board will be sitting evenly. If the mark appears accurate, it's ready, if not, make adjustments as required."
    },
    {
      "title": "Drill the second bracket hole (or holes).",
      "content": "Drill the second bracket hole (or holes). Follow the directions given for the first bracket."
    },
    {
      "title": "Attach the shelf board to the brackets.",
      "content": "Attach the shelf board to the brackets. Lay the board across the brackets and screw it to them from the underside. Be sure to use screws that will not penetrate through to the other side of the board; they must remain wholly inside the shelf board."
    },
    {
      "title": "Pick up the drop sheet and discard the drilling dust.",
      "content": "Pick up the drop sheet and discard the drilling dust. Gently press on the shelf to check that it is firmly attached to the wall."
    },
    {
      "title": "Add your ornaments, books or other display objects to the new shelf.",
      "content": "Add your ornaments, books or other display objects to the new shelf. Make sure that your shelf can bear the weight of heavier objects and don't put something valuable on your home-made shelf until you know that it's secure."
    },
    {
      "title": "Select the required shelf items.",
      "content": "Select the required shelf items. You'll need: Shelf boards. The shelf boards should be at least 2cm 3/4\" thick. Supports for the shelf boards. Cleats (strips of wood) are easy and ideal for this unit. Two vertical support panels. These form the sides of the shelf unit. A top piece. This needs to be slightly wider than the shelf boards, so that it can be hammered or glued on top of the unit. A piece of hardboard for the back of the shelf unit. (Ask the timber merchant to cut to size if you can't do this yourself.)"
    },
    {
      "title": "Measure the desired height and width of the shelving unit.",
      "content": "Measure the desired height and width of the shelving unit. When you're decided on this, cut the shelf boards to this width, if they're not already at the right width. Cut the vertical support panels to the right height, if they're not already done."
    },
    {
      "title": "Nail or glue a cleat to the first vertical support at the base.",
      "content": "Nail or glue a cleat to the first vertical support at the base. The cleat should be placed on the side of the support that you want to face inwards. Repeat for the second vertical piece. This forms the first shelf support."
    },
    {
      "title": "Lay the vertical support panels on the ground, aligned evenly but a shelf board's width apart.",
      "content": "Lay the vertical support panels on the ground, aligned evenly but a shelf board's width apart. Decide where you want the rest of the shelf boards to be place all the way up the first support. For each level, use a shelf board to help you measure the exact positioning of the cleat across to the opposite vertical support panel (this helps to ensure it is level), and mark it. Repeat the measuring and marking for each shelf level being added."
    },
    {
      "title": "Nail or glue the next cleat into place on the first vertical support panel.",
      "content": "Nail or glue the next cleat into place on the first vertical support panel. Check that the opposite side will be level by placing the shelf board on the now attached cleat and bringing over to the mark on the opposite vertical support panel. Use a spirit level to check for evenness, then nail or glue the opposite side's cleat in place. If nailing or screwing into position, be sure to use nails or glues that don't penetrate through the vertical support panels––they must remain wholly within the panels."
    },
    {
      "title": "Repeat for each level.",
      "content": "Repeat for each level."
    },
    {
      "title": "Add the top shelf.",
      "content": "Add the top shelf. This level doesn't require a cleat. Instead, it needs to be slightly wider than the shelf boards, so that it can be nailed, screwed in or glued to the top of the two vertical support panels. If you need to be able to dismantle the shelf, do not glue the top piece in place. Instead, use screws that can be easily undone and re-fixed after each dismantling and reassembly."
    },
    {
      "title": "Add the hardboard back.",
      "content": "Add the hardboard back. The shelf risks falling over or leaning sideways if this is not added. Nail or glue to the back of the shelf unit. Another solution is to use a cross-brace instead of one piece of board. Use whatever fits your needs best."
    },
    {
      "title": "Add books and other bits and pieces to the shelf unit.",
      "content": "Add books and other bits and pieces to the shelf unit. The unit can be placed anywhere against a flat surface and can be dismantled for ease of carrying and storage (the cleats stay intact with the vertical side panels)."
    },
    {
      "title": "Choose a corner shelf solution for corner spaces.",
      "content": "Choose a corner shelf solution for corner spaces. [3] X Research source In some cases, the only space left might be a corner. It is still possible to use it! See, for example, How to create corner shelves for a garden shed. See also How to install a shower corner shelf if you're looking for a bathroom shelf solution."
    },
    {
      "title": "Build floating shelves",
      "content": "Build floating shelves . This type of shelf has the appearance of coming straight out of the wall without supports. Of course, it is supported but there are a few simple tricks to it."
    },
    {
      "title": "Build invisible shelves",
      "content": "Build invisible shelves . This shelf looks as if the books are simply hanging in the air. It's a bit of fun rather than a really useful shelf."
    },
    {
      "title": "Turn a skateboard into a shelf",
      "content": "Turn a skateboard into a shelf . This is a great way to salvage a beloved skateboard that is past its prime but that still carries many memories."
    },
    {
      "title": "Build a hidden door bookshelf",
      "content": "Build a hidden door bookshelf . Use shelves to hide your valuables! Or, if you're more into books than clothes, you could always turn your walk-in closet into library shelves."
    },
    {
      "title": "Make a CD rack",
      "content": "Make a CD rack from wood. The principles of this grid-like shelf arrangement can be used to make other grid shelving in varying sizes too, such as spice cabinets, ornament display shelves and storage units."
    },
    {
      "title": "Build a shelf for your cat!",
      "content": "Build a shelf for your cat! This windowsill cat shelf will keep your cat entertained all day long and out from under your feet!"
    }
  ]
}