{
  "url": "https://www.wikihow.com/Catch-a-Lunch-Thief",
  "title": "How to Catch a Lunch Thief",
  "steps": [
    {
      "title": "Eye people's trash.",
      "content": "Eye people's trash. You can catch some thieves by checking people's trash. Of course, you can't go digging around in people's trash cans. That's much too obvious. However, you can go and chat with co-workers right after a lunch when food was stolen. Some people just throw the remains in their own trash, even if they took it. [1] X Research source You may think that someone is too dumb to throw the trash away in their office. However, some people steal out of a sense of entitlement and have no problem throwing it away there, particularly if they're the boss."
    },
    {
      "title": "Use a \"contamination\" tactic.",
      "content": "Use a \"contamination\" tactic. No, you shouldn't contaminate the food with something that could cause sickness. Rather, when someone eats your food, send out an office email saying, \"To whoever ate my food: I just found out the peanut butter in it has been recalled, and it can make you sick. You should seek medical attention.\" Once in a blue moon, the thief may confess just to find out what the \"contamination\" does. [2] X Research source You can also leave a note instead."
    },
    {
      "title": "Make your food hot.",
      "content": "Make your food hot. One way to catch a thief is to spice your food with something particularly hot, such as a ghost pepper. You should be able to tell who ate it, as that person will end up sweating and probably need lots of water. If you spike your food this way, make sure to keep an eye out around the office. Keep in mind, you could face some legal ramifications with this tactic, particularly if it harms the person in some way (such as they are allergic to peppers)."
    },
    {
      "title": "Use a cheap camera.",
      "content": "Use a cheap camera. One option is a nanny camera, as you can find those relatively cheap. Hide it in the kitchen, and leave it on video. The next time someone steals food, check the camera to see who did the stealing. Of course, you'll need to find a camera that can be plugged in, or you'll need to charge it. [3] X Research source You'll need your boss's permission for this option. Keep in mind that it could be your boss who is stealing your food, so that could cause a problem."
    },
    {
      "title": "Gather some like-minded colleagues or peers.",
      "content": "Gather some like-minded colleagues or peers. You're going to need more than one person to stage a stakeout, as you can't hang out in the lunchroom all the time. Therefore, talk to some of your friends at work, and make an agreement to \"cover\" the lunchroom, meaning that you stagger lunches so that one of you is in there at all during lunch. [4] X Research source"
    },
    {
      "title": "Pay attention to who is eating what.",
      "content": "Pay attention to who is eating what. Once you've staked out the lunchroom, keep an eye on what's being eating by whom. If you notice someone is taking something that doesn't belong to them, you've caught the person who's stealing the food, or at least one of them. This step works best if food is labelled, so you can see who it belongs to. [5] X Research source"
    },
    {
      "title": "Listen attentively.",
      "content": "Listen attentively. If only a few of you are in the office late at night, listen to hear who's going in the kitchen. Food is more likely to be stolen when fewer people are around. If you hear someone in the kitchen, go investigate. You don't have to confront the person, just see what they are eating. You may know who it belongs to. If it's not them, you have your thief. [6] X Research source"
    },
    {
      "title": "Appeal to the person's better nature.",
      "content": "Appeal to the person's better nature. You could send out an office memo talking about why that food is important due to dietary restrictions. In other words, if you can't eat that food, you won't be able to eat because you have a strict diet or food allergies and can't pick up food just anywhere. [7] X Research source You could also leave a note on the fridge instead of sending an email."
    },
    {
      "title": "Post rules on the fridge.",
      "content": "Post rules on the fridge. Ask your boss if you can post rules about office food on the fridge. For instance, one rule could be, \"Don't eat food that's not yours unless clearly marked.\" Another rule could be \"Label all food with a name and a date.\" Rules may deter a few people. [8] X Research source"
    },
    {
      "title": "Make sure to label your food.",
      "content": "Make sure to label your food. While it won't stop someone from taking your food, it may cause some people to think twice if your food is labelled with your name. That way, it puts a face on the problem, and they have to think about stealing your food rather than just \"someone's\" food. [9] X Research source However, labeling your food can backfire, depending on the reason the person is stealing. For example, if the person steals as a way to get retribution on someone they don't like, and you happen to be someone they don't like, labeling the food just tells them whose is whose."
    },
    {
      "title": "Bring ingredients rather than a meal.",
      "content": "Bring ingredients rather than a meal. That is, if you want a sandwich, bring components rather than the assembled sandwich. Similarly, if you have a salad, bring it in parts rather than assembled. Most people will go for something already assembled over something that needs to be put together. [10] X Research source"
    },
    {
      "title": "Pick a dark lunch bag or container.",
      "content": "Pick a dark lunch bag or container. Another option that will deter some people is picking a lunch bag that's opaque. That way, the person can't see what's inside. Most people will avoid digging through a bag they can't see in, but they will take an option they can see. [11] X Research source"
    },
    {
      "title": "Skip individual pre-packaged items.",
      "content": "Skip individual pre-packaged items. Bags of chips or carrots, sodas, yogurts, and even frozen meals are more likely to be stolen than things you buy in bulk and package yourself. The reason is the pre-packaged items seem more convenient, so they're easier to grab. [12] X Research source"
    },
    {
      "title": "Try to hide the food.",
      "content": "Try to hide the food. One way to keep your lunch is to hide it away. If it's out-of-sight, it's less likely to be stolen. You can try hiding it at the back of the fridge, for instance, behind other food. You can also simply keep it at your desk in a small cooler or insulated lunch bag, along with ice packs. [13] X Research source"
    },
    {
      "title": "Confront the thief.",
      "content": "Confront the thief. One way you can deal with a lunch thief is to simply confront the thief. Confronting the thief can be as simple as entering the room and watching as they take your food. If they turn around and realize they're caught, that can stop a few thieves. [14] X Research source However, you can also approach them about it, talking about ways you can resolve the problem. Try approaching it from a sympathetic perspective, which will make the person less defensive. For example, you could say something such as, \"You may not realize it, but I think you've been taking my food from the refrigerator. I'm not trying to attack you about it. I just want to figure out a solution. If we can't figure out a solution, I'll need to bring this topic up with the boss.\""
    },
    {
      "title": "Talk to your boss.",
      "content": "Talk to your boss. Another option for dealing with a food thief is to take the information to your boss. Of course, you only want to do so if you are absolutely sure that the person is thief. You should also have evidence to back up your claim, not just hearsay."
    },
    {
      "title": "Take it to human resources.",
      "content": "Take it to human resources. If it is your boss who's stealing or your boss won't deal with the situation, you can take it to human resources if you're in a big company, as they are more equipped to deal with the problem. Otherwise, you may need to just confront them. [15] X Research source"
    }
  ]
}