{
  "url": "https://www.wikihow.com/Block-a-Call",
  "title": "How to Block a Call",
  "steps": [
    {
      "title": "Open your Android's Phone app.",
      "content": "Open your Android's Phone app. This is the phone receiver icon on your home screen."
    },
    {
      "title": "Tap the three vertical dots ⋮.",
      "content": "Tap the three vertical dots ⋮ . It's at the top-right corner."
    },
    {
      "title": "Tap Settings on the menu.",
      "content": "Tap Settings on the menu. More options will expand."
    },
    {
      "title": "Tap Block numbers on the menu.",
      "content": "Tap Block numbers on the menu."
    },
    {
      "title": "Tap Add phone number.",
      "content": "Tap Add phone number . This allows you to enter the phone number of the person you want to block. [1] X Research source If you don't want to enter the phone number, you can select Recents and choose a recent caller to block, or select Contacts to select a contact to block. [2] X Research source"
    },
    {
      "title": "Enter the phone number you want to block and tap +.",
      "content": "Enter the phone number you want to block and tap + . This adds the phone number to your Android's block list. If you want to unblock a number, return to the Phone app, tap the three dots and select Settings , choose Block numbers , and then tap the minus sign next to the number you want to remove."
    },
    {
      "title": "Open your Android's Phone app.",
      "content": "Open your Android's Phone app. [3] X Expert Source Mitch Harris Consumer Technology Expert Expert Interview. 31 August 31 2021. This is the phone receiver icon on your Android's home screen."
    },
    {
      "title": "Tap the three vertical dots.",
      "content": "Tap the three vertical dots. [4] X Expert Source Mitch Harris Consumer Technology Expert Expert Interview. 31 August 31 2021. You'll see this menu icon at the top-right corner."
    },
    {
      "title": "Tap Call history.",
      "content": "Tap Call history . [5] X Expert Source Mitch Harris Consumer Technology Expert Expert Interview. 31 August 31 2021. It's the option with a clock icon. [6] X Research source"
    },
    {
      "title": "Tap a call from the phone number you want to block.",
      "content": "Tap a call from the phone number you want to block. [7] X Expert Source Mitch Harris Consumer Technology Expert Expert Interview. 31 August 31 2021. Some options will appear."
    },
    {
      "title": "Tap Block / report spam.",
      "content": "Tap Block / report spam . [8] X Expert Source Mitch Harris Consumer Technology Expert Expert Interview. 31 August 31 2021. A pop-up will appear, asking if you want to report the caller as a spam caller. If you don't see this option, tap the three vertical dots at the top-right corner and select Block Numbers . If you don't want to report the caller, just tap the check box to remove the checkmark before you continue."
    },
    {
      "title": "Tap Block to confirm.",
      "content": "Tap Block to confirm. The phone number is now added to your block list. To remove someone from your block list in the future, just open the Phone app, tap the three dots, select Settings , and tap Blocked numbers . You can then tap the X next to the number you want to remove."
    },
    {
      "title": "Open your iPhone's Phone app.",
      "content": "Open your iPhone's Phone app. It's the green-and-white phone receiver icon on your Home screen."
    },
    {
      "title": "Tap the Recents tab.",
      "content": "Tap the Recents tab. [9] X Expert Source Mitch Harris Consumer Technology Expert Expert Interview. 31 August 31 2021. It's the clock icon at the bottom of the screen. [10] X Research source According to consumer technology expert Mitch Harris, \"You can also tap Favorites or Voicemail to access your old calls.\""
    },
    {
      "title": "Tap the \"i\" in a circle next to the number you want to block.",
      "content": "Tap the \"i\" in a circle next to the number you want to block. [11] X Expert Source Mitch Harris Consumer Technology Expert Expert Interview. 31 August 31 2021. You may have to scroll down to find an inbound or outbound phone call from the number in question."
    },
    {
      "title": "Tap the red Block this Caller link.",
      "content": "Tap the red Block this Caller link. [12] X Expert Source Mitch Harris Consumer Technology Expert Expert Interview. 31 August 31 2021. It's at the bottom of the info page. A confirmation message will appear. According to consumer technology expert Mitch Harris, \"You can also block a number by opening the Contacts app, tapping the contact you want to remove, scrolling down, and tapping Block this Caller . Blocking calls from a phone number also prevents that phone number from sending you text messages or calling you on FaceTime."
    },
    {
      "title": "Tap Block Contact to confirm.",
      "content": "Tap Block Contact to confirm. This adds the selected phone number to your block list. To remove someone from your block list, open your iPhone's Settings app (the gear icon) and go to Phone > Blocked Contacts . Tap Edit at the top-right, and then tap the minus sign next to the number you want to unblock."
    },
    {
      "title": "Open your Android's Phone app.",
      "content": "Open your Android's Phone app. This is the phone receiver icon on your home screen."
    },
    {
      "title": "Tap the three vertical dots ⋮.",
      "content": "Tap the three vertical dots ⋮ . It's at the top-right corner."
    },
    {
      "title": "Tap Settings on the menu.",
      "content": "Tap Settings on the menu. More options will expand."
    },
    {
      "title": "Toggle on \"Block unknown/private numbers\" .",
      "content": "Toggle on \"Block unknown/private numbers\" . As long as this switch is enabled, you will not receive incoming phone calls from people who've hidden their phone numbers. You will still receive phone calls from people who aren't in your contacts—the only people who will be blocked are calls with hidden phone numbers. Toggle this switch off at any time to allow unknown callers to call you."
    },
    {
      "title": "Open your Android's Phone app.",
      "content": "Open your Android's Phone app. This is the phone receiver icon on your home screen."
    },
    {
      "title": "Tap the three vertical dots ⋮.",
      "content": "Tap the three vertical dots ⋮ . This icon is at the top-right corner of the screen."
    },
    {
      "title": "Tap Settings on the menu.",
      "content": "Tap Settings on the menu. More menu options will appear."
    },
    {
      "title": "Tap Blocked numbers.",
      "content": "Tap Blocked numbers . If you have any blocked numbers, you'll see them here. You'll also see the option to block unknown callers, which should take care of a lot of spam phone calls."
    },
    {
      "title": "Toggle on the Unknown switch .",
      "content": "Toggle on the Unknown switch . When this switch is activated, calls from private or unidentified numbers will not ring through to your phone. You will still receive phone calls from people who aren't in your contacts—the only people who will be blocked are calls with hidden phone numbers. Toggle this switch off at any time to allow unknown callers to call you."
    },
    {
      "title": "Open your iPhone's Settings .",
      "content": "Open your iPhone's Settings . This is the gray gear icon on your Home screen (or in your App Library)."
    },
    {
      "title": "Scroll down and tap Phone.",
      "content": "Scroll down and tap Phone . It's in the 5th group of settings."
    },
    {
      "title": "Tap Silence Unknown Callers.",
      "content": "Tap Silence Unknown Callers . This option is toward the bottom of the screen."
    },
    {
      "title": "Toggle the \"Silence Unknown Callers\" switch to On .",
      "content": "Toggle the \"Silence Unknown Callers\" switch to On . As long as this setting is enabled, your iPhone will not ring when you receive phone calls from private/unknown numbers, as well as people who aren't in your contacts list. If you get a call from a phone number that isn't saved to your contacts but does appear in your recent outgoing calls list, that call will still ring through to your phone. If you call 911 or another region-specific emergency phone number, Silence Unknown Callers will be disabled for 24 hours following your call. [13] X Research source Calls blocked with this method can still leave you voicemail, but you won't be notified when they do."
    },
    {
      "title": "Call your telephone service provider.",
      "content": "Call your telephone service provider. Before attempting to block a number, ask a customer service representative whether call blocking is available for your phone service. The steps to block calls may vary by service. Sometimes you'll even need to activate the feature by paying a fee. Most major US-based phone service providers offer a variety of call blocking services, including AT&T, CenturyLink, Comcast, Frontier, Spectrum, and Verizon. [14] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source"
    },
    {
      "title": "Dial *60 on your phone.",
      "content": "Dial *60 on your phone. If supported by your phone provider, dialing this number will allow you to block calls from a particular number. [15] X Research source After dialing *60 , listen for a recorded voice telling you whether your call blocking service is turned on or off and how many phone numbers are blocked on your line. If call blocking isn't enabled, listen for instructions for turning the service on."
    },
    {
      "title": "Add a phone number to be blocked.",
      "content": "Add a phone number to be blocked. This number will remain in this directory until you manually remove it or disable the call blocking feature altogether. Follow the instructions of the automated message for adding phone numbers to the blocked call list for your phone. Often you'll need to dial # , enter the 10-digit number you want to block, and then press # again to confirm. If someone you've blocked tries to call you, they'll hear a message that says the phone provider is unable to complete the call. Your phone will not ring from such calls."
    },
    {
      "title": "Remove a phone number from your block list.",
      "content": "Remove a phone number from your block list. If you decide that you want to unblock a number, dial *60 again and follow the automated prompts. Review the numbers listed on your blocked call list by pressing the corresponding number on your telephone keypad as dictated by the automated instructions. Listen as the voice reads the phone numbers on the list."
    },
    {
      "title": "Disable call-blocking (optional).",
      "content": "Disable call-blocking (optional). If you want to disable call blocking completely, dial *80 from your phone. This automatically unblocks all of your blocked callers."
    },
    {
      "title": "Dial *77 on your phone at the dial tone.",
      "content": "Dial *77 on your phone at the dial tone. This will activate anonymous call blocking for most landline phone customers in the US. [16] X Research source Listen for a confirmation tone or announcement indicating that the feature has been activated. Callers who block the display of their name and numbers will now hear an automated recording that you're not accepting blocked calls. They will be prompted to unblock their Caller ID and call you again. Note that only people who are listed as \"Anonymous,\" \"Private Name,\" or \"Unknown\" will be blocked from calling you. This feature does not extend to anonymous people who do not block their Caller ID."
    },
    {
      "title": "Press *87 at the dial tone to deactivate (optional).",
      "content": "Press *87 at the dial tone to deactivate (optional). If you wish to allow unknown names and numbers to call you again, dial this code to disable anonymous call blocking. You will hear confirmation tone or announcement that the feature has been disabled,you’re your phone will once again ring when you receive calls from private numbers."
    },
    {
      "title": "Go to https://www.donotcall.gov in your web browser.",
      "content": "Go to https://www.donotcall.gov in your web browser. This is the website for the US National Do Not Call Registry. If you're receiving too many telemarketing calls, getting on this list will opt you out of future calls. If you don't want to sign up online, you can also call them directly at 1-888-382-1222. [17] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source The National Do Not Call Registry is managed by the Federal Trade Commission and is designed to stop most telemarketer calls. This will not block calls from charities, political groups, debt collectors, surveyors, and fundraisers—just legitimate sales and telemarketing calls. [18] X Research source If you wish to block calls from these types of organizations, simply request that you be put on that specific company's do not call list, which they must honor. Scammers, as you can imagine, don't comply with the Do Not Call Registry. This means that scammers and robot callers can still call you even if you're on the registry."
    },
    {
      "title": "Click Register Your Phone.",
      "content": "Click Register Your Phone . It's the orange button on the right side of the page. Instead of entering numbers you wish to be blocked, you'll instead type your phone number so that telemarketers will be prohibited from contacting you."
    },
    {
      "title": "Click REGISTER HERE.",
      "content": "Click REGISTER HERE . It's the orange button at the bottom of the page. Do this only if you're sure you haven't ever signed up for the list before. If you think you've signed up before or aren't sure, click VERIFY HERE to find out before registering again."
    },
    {
      "title": "Enter the phone number(s) you want to register.",
      "content": "Enter the phone number(s) you want to register. You can register up to three phone numbers at once. You'll also need to enter a valid email address to confirm your addition to the registry. You'll need to enter your email address twice to verify it."
    },
    {
      "title": "Click SUBMIT.",
      "content": "Click SUBMIT . It's at the bottom of the form."
    },
    {
      "title": "Verify your information and click REGISTER.",
      "content": "Verify your information and click REGISTER . Only continue if the information you see on the screen is correct. Once you click this button, you'll receive an email from the Do Not Call Registry confirming your addition to the list. Be sure that you have access to the e-mail address you've entered. You will receive a confirmation e-mail that you must click in order to finalize the registration."
    },
    {
      "title": "Click the link in the email message from the Do Not Call Registry.",
      "content": "Click the link in the email message from the Do Not Call Registry. The email will come from register@donotcall.gov . Once you click the link, you'll be added to the list. Be sure that you click the confirmation link in the e-mail within 72 hours of registration. The link will expire after 72 hours, after which you will have to resubmit the form in order to register. Don't be discouraged if you still receive calls a few days after registering. Your number must be on the list for 31 days before this registration takes effect. If you still receive telemarketer calls after the 31 day period, you have the option of reporting the caller on the Do Not Call Registry website. Just click the green Report Unwanted Calls button at https://donotcall.gov to do so."
    }
  ]
}