{
  "url": "https://www.wikihow.com/Build-an-Outdoor-Shower",
  "title": "How to Build an Outdoor Shower",
  "steps": [
    {
      "title": "Choose a location with easy access to a hose or water source for your shower.",
      "content": "Choose a location with easy access to a hose or water source for your shower. The most important part of an outdoor shower, of course, is the shower itself. While almost everyone wants an enclosure and/or floor to shower on. those looking for a simple rinse-off can simply install their outdoor shower head, run water to it, and call it a day. There are two ways to run water to your shower: Using a garden hose and an outdoor water source, such as a lake or garden hose spigot. Attaching your shower to the side of the house and tapping into the internal plumbing. Because this method is extremely difficult without experience and serious tools, this article will focus on the prior method."
    },
    {
      "title": "Sketch out the rough design of your finished shower before getting to work.",
      "content": "Sketch out the rough design of your finished shower before getting to work. You need to know how all of your pieces -- showerhead, floor, and walls -- fit together before you get building. You do not, for example, want to build the shower head and then realize that you cannot fit a floor around it. Go online and check out some examples, or draft up your own. You can even buy kits of pre-cut wood and flooring that are made for outdoor showers online if you want a simpler project. [1] X Research source"
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. Again, there are a lot of different ways that you could build your outdoor shower, but this common list of supplies will be needed for the vast majority of projects and designs. You should have: A garden hose that can reach your shower from the water source. Three pieces of 1/2\" thick galvanized piping. Two pieces 36\" long. One piece 8\" long Appropriate garden hose to pipe adapter joints. 2 each 1/2\" elbow joints A ball valve or gate faucet and adapter to fit into your piping. A rain-shower head. C-shaped hangers or plumbing ties hold your pipe upright. Plumbing tape. [2] X Research source [3] X Research source"
    },
    {
      "title": "Attach your garden hose to your water source.",
      "content": "Attach your garden hose to your water source. Again, there are a few ways to pull this off. The most common way is to screw the hose into an outdoor spigot, allowing you to turn the water on and off with ease. You will then attach your hose to the end of the piping. If you want to use a lake or pond to power your shower, you'll need an inline utility pump and a car or marine battery to pull water from the lake to your shower. A 12V self-priming pump is your best bet. [4] X Research source"
    },
    {
      "title": "Attach and build your piping into the shower plumbing.",
      "content": "Attach and build your piping into the shower plumbing. Use the joints to screw the piping together into one length, placing your ball valve/gate faucet in the center -- this will be your on/off switch. If you've never done plumbing before, don't worry too much about this project -- it is about as simple as it can get. Some tips include: Place two elbow joints at the ends, each facing different directions. One is for your shower head, the other for the garden hose. Be sure to seal each joint with nylon plumber's tape to prevent leakage, wrapping each joint 4-6 times. [5] X Research source Don't attach the hose or shower head just yet -- wait until you've finished the plumbing and attached the rods. [6] X Research source"
    },
    {
      "title": "Construct and place your shower post.",
      "content": "Construct and place your shower post. If you're building a free-standing shower that isn't attached to your house, you'll need a way to hold the shower up. The most common way to do this is with a post. Use pressure-treated wood, purchasing a post that is roughly 8 feet tall. It can be either square or rounded -- just make sure your get the appropriate brackets for your post. If in any doubt, talk to a specialist at your home improvement store about your specific project. Once you have your post: Dig a post hole at least 1-1/2 feet deep and three times as wide as your post. Firmly implant the post in the ground. Mix a 50lb bag of fast-setting concrete and pour it into the hole to set the post. Some types of fast-setting concrete can be poured into the hole dry, then add water per the instructions. This is much easier and doesn't require a wheelbarrow or mixing tools. Wait 24-hours for the concrete to set. [7] X Research source"
    },
    {
      "title": "Attach your piping to the post once the concrete has dried.",
      "content": "Attach your piping to the post once the concrete has dried. The most common way to do this is with c-shaped pipe hangers, and you should only need two of them. Adhere one near the top and one near the bottom to securely fasten the piping to your shower post. You could also use 4-6 pipe straps to hold the piping on. Make sure that your elbow joints point the right way before continuing -- you need the top one to face into the shower and the bottom one needs to turn enough that you can fit the garden hose onto it."
    },
    {
      "title": "Attach your garden hose to the bottom of the pipe.",
      "content": "Attach your garden hose to the bottom of the pipe. For a more attractive design, you can drill a 1/2 hole into the bottom of the post, even with the bottom elbow joint. You can then feed the 8\" galvanized pipe through the post, allowing you to attach the garden hose behind the shower post instead of to the side. You'll likely need an adapter to fit the hose to your piping. This is called a \"hose coupler.\" [8] X Research source"
    },
    {
      "title": "Attach the showerhead and shower arm to the top of your pipe.",
      "content": "Attach the showerhead and shower arm to the top of your pipe. Once the entire array is hooked up, it's time to attach the shower head. Attach the shower arm to the top of the pipe, angle it to your desired location, then screw in the shower head. Turn on the water at the faucet and give the entire thing a test."
    },
    {
      "title": "Consider alternative methods of holding up your shower.",
      "content": "Consider alternative methods of holding up your shower. There are tons of great DIY shower ideas on the internet, and you should do some exploring to see if you can get away with a less conventional set-up for your outdoor shower. Some ideas include: Attaching the shower head to a wooden fence, tree, or other already created post. Attaching the head to an overhang or wall with a simple bracket or wooden board. Attach the head to something decorative, like an old surfboard, for a unique look. [9] X Research source"
    },
    {
      "title": "Consider how much drainage you'll need when constructing the floor and walls.",
      "content": "Consider how much drainage you'll need when constructing the floor and walls. If you're only running cold water to your shower, chances are good you won't be spending hours getting wet. As such, drainage should not be a major concern. Still, you need some layer between your feet and the ground, otherwise you'll end up with dirty, muddy feet after every shower."
    },
    {
      "title": "Tramp down a thick layer of gravel for easy, cost-effective flooring.",
      "content": "Tramp down a thick layer of gravel for easy, cost-effective flooring. Gravel is by far the most common bottom for outdoor showers. It is easy to install, looks good, and naturally drains away water if you take shorter showers. You can buy gravel, river pebbles, or small stone mixes depending on your aesthetic desires. To effectively install a gravel floor: Smooth out the flooring the best you can. Lay down your stones around the shower. For a more professional look, use half-buried 2x4s to create a simple enclosure around your shower that will hold the gravel in. Use a tamper to press the gravel tightly together, leaving you with a smooth, regular floor. [10] X Research source"
    },
    {
      "title": "Build a simple wood floor for a professional looking shower.",
      "content": "Build a simple wood floor for a professional looking shower. You'll need one 8-foot 4x4\" piece of wood and one 8-foot 1x4\" piece, both pressure treated. You'll use the first piece to build a square base for your floor, and the second piece to put together the drainable flooring. For a cheap, pre-made alternative, consider using a wooden pallet. [11] X Research source Cut one of the 4x4's into 4 even pieces, then screw them together into a simple square frame. Cut a 1x4\" into 7 individual pieces, each 26-1/2\" long. Place your 7 pieces onto your board starting on the edge, each piece parallel to the next. Leave a 1/4\" space between each board for water to drain through. Screw the floorboards into the wooden frame. [12] X Research source"
    },
    {
      "title": "Use plywood or corrugated metal sheets with wooden posts for a simple, customizable wall.",
      "content": "Use plywood or corrugated metal sheets with wooden posts for a simple, customizable wall. The easiest way to make a shower wall is to set up four more posts (identical to the one holding up your piping) in the ground, then nail plywood sheets to the posts as walls. You can then attach decorative shingles, paint or stain the plywood, or add a door/curtain instead of wood for one of the sides. [13] X Research source"
    },
    {
      "title": "Purchase pre-built outdoor shower walls for a professional, easy finish.",
      "content": "Purchase pre-built outdoor shower walls for a professional, easy finish. You can get a set of outdoor shower walls from a variety of places, and there are a lot of different sets out there that can make your life much easier. However, these sets can run up to $1,000, so it may be more cost-effective to build your own walls instead. [14] X Research source"
    },
    {
      "title": "Use a curved shower curtain to build an easy wall around your shower.",
      "content": "Use a curved shower curtain to build an easy wall around your shower. This strategy, of course, only works if your shower is attached to a wall or fence. That said, a simple curved shower rod can cover up the other 3 sides and leave you an easy, breezy outdoor shower experience."
    },
    {
      "title": "Stain and finish any wood so that it is waterproof.",
      "content": "Stain and finish any wood so that it is waterproof. An outdoor shower will be up against the elements, and regular water will warp and ruin wood if you don't take precautions. Use an outdoor sealant and finisher to protect your shower for years to come. [15] X Research source"
    }
  ]
}