{
  "url": "https://www.wikihow.com/Calculate-Distances-With-a-Mil-Dot-Rifle-Scope",
  "title": "How to Calculate Distances With a Mil Dot Rifle Scope",
  "steps": [
    {
      "title": "Binocular and periscope Mil Dots are not the same as rifle scope Mil Dots.",
      "content": "Binocular and periscope Mil Dots are not the same as rifle scope Mil Dots. They measure the same type of angular distance, but is actually 10 Mils instead of only one, which is more suited for marksmen use."
    },
    {
      "title": "A Mil is 1-6,175 of a circle.",
      "content": "A Mil is 1-6,175 of a circle. But to simplify calculations, the U.S. military calculates them as 1-6283 of a circle [1] X Research source (previously 1-6400 on older scopes). Russian-based scopes are set to 1-6,000 of a circle. This means there is up to a 3% error in distance calculations."
    },
    {
      "title": "When looking at Mil Dots through a scope, one Mil is the distance from the center of one dot, to the center of the next dot (not the space between the dots).",
      "content": "When looking at Mil Dots through a scope, one Mil is the distance from the center of one dot, to the center of the next dot (not the space between the dots). [2] X Research source Each dot is .2mil and the space between the dots is .8mil for the round army type mil dot reticle."
    },
    {
      "title": "Mil distances on rear-plane cross hairs on a variable-power scope usually are only accurate at the highest power.",
      "content": "Mil distances on rear-plane cross hairs on a variable-power scope usually are only accurate at the highest power."
    },
    {
      "title": "Calculate the distance to the object by multiplying the height (or width) of the object by 1000 then dividing by the number of Mils that the object spans.",
      "content": "Calculate the distance to the object by multiplying the height (or width) of the object by 1000 then dividing by the number of Mils that the object spans. </ref> For example: a six foot tall object (2-yards) which is eight Mils in size is 250-yards away. 2 x 1000 / 8 = 250."
    },
    {
      "title": "Calculate as accurately as possible, and any \"added error\" (by yourself) is error in distance that may not be acceptable.",
      "content": "Calculate as accurately as possible, and any \"added error\" (by yourself) is error in distance that may not be acceptable. [3] X Research source Sub-divide the Mil Dots as much as possible, and be as accurate in estimating the size of the object as possible. The object is five feet (1.67-yards) wide and spans 2.8 Mils is 596-yards away. A guess that the object is 2-yards instead of 1.67 would mean the estimation of over 100 yards difference which could mean a hit, or a miss of over five inches with a standard .308. To be in the right mindset, calculate sizes of objects to the tenth of a yard (is that 3.4-yards or 3.5?). Calculate the span in Mils also to the tenth of a Mil. Both of these will take practice, but perfect estimations is the only way to get perfect range calculation."
    },
    {
      "title": "Use a calculator if needed.",
      "content": "Use a calculator if needed. Some equations might get pretty complex, and accuracy is key, but the speed of a calculator may also help in some situations."
    }
  ]
}