{
  "url": "https://www.wikihow.com/Apply-Vampire-Fangs-Without-Glue",
  "title": "How to Make Vampire Fangs Stick with Household Items",
  "steps": [
    {
      "title": "Buy a tube of denture adhesive cream that says “super” or “superior hold.”",
      "content": "Buy a tube of denture adhesive cream that says “super” or “superior hold.” Look for denture adhesive creams , like Fixodent, Polident, or Poligrip, with those labels. They mean the adhesive is long-lasting. If you only plan on using the cream for your fangs, choose the smallest tube, like a 2.5 oz (75 mL) one, as you won’t need very much. [1] X Research source You can buy denture cream from a pharmacy, drug store, or online retailer. Most tubes cost less than $5."
    },
    {
      "title": "Dry off your upper teeth and gums with a tissue.",
      "content": "Dry off your upper teeth and gums with a tissue. Blot the tissue all over your top teeth and gums to remove any excess moisture. This helps the denture adhesive cream stick to your teeth better. Do this right before you’re ready to apply the fang. [2] X Research source You can also use a paper towel or cotton swab instead of a tissue."
    },
    {
      "title": "Squeeze a small dot of cream onto the top of the backside of the fang.",
      "content": "Squeeze a small dot of cream onto the top of the backside of the fang. Hold the tip of the tube at the wide top of the fang and squeeze a tiny amount of cream onto the fang. Keep the cream on the top half of the fang since that’s the part that will be against your tooth. [3] X Research source If you get too much on the fang or some on the pointy tip, wipe off the extra with a cotton swab. Use individual fangs instead of the ones that come in whole sets of teeth. You can buy fangs at a Halloween store or party goods store."
    },
    {
      "title": "Place the fang over your canine tooth and hold it for 10 to 15 seconds.",
      "content": "Place the fang over your canine tooth and hold it for 10 to 15 seconds. Press the fang against your canine tooth so that the pointy tip is facing down and the concave side with the adhesive is covering your tooth. Hold it with your fingers until you can move your hand away and the fang stays in place. [4] X Research source To find your canine tooth, start at the middle of your upper teeth and count over 3 teeth. It’s the 3rd tooth from the center and is usually slightly pointier than the others. Use a timer or the clock app on your phone to keep track of the time if necessary."
    },
    {
      "title": "Apply cream to the 2nd fang and press it into place over your tooth.",
      "content": "Apply cream to the 2nd fang and press it into place over your tooth. Repeat the same process on your other canine tooth. Squeeze a dot of denture adhesive cream onto the back of the fang, then hold it in place for 10 to 15 seconds on your tooth. [5] X Research source Try to align the 2nd fang so that the pointy tip is as far down as the 1st fang and they’re even."
    },
    {
      "title": "Remove your fangs before eating or sleeping, then reapply with more cream.",
      "content": "Remove your fangs before eating or sleeping, then reapply with more cream. Don't eat with your fangs in. If you do, you could crack the fangs or they could fall off. Instead, peel them off by pulling them forward or gently wiggling them from side to side, and set them aside before you eat. Take them off before you sleep, too. [6] X Research source After eating, dab a little more denture cream on the back of each fang and stick them back onto your teeth. If you want the fangs to hold better, brush your teeth and dry them with a tissue before putting the fangs on again. If you feel strong resistance or enamel pressure, stop trying to remove the fangs immediately and allow the adhesive more time to release."
    },
    {
      "title": "Place 1 tablespoon (14 g) of thermoplastic beads in a glass dish.",
      "content": "Place 1 tablespoon (14 g) of thermoplastic beads in a glass dish. Use a small glass dish for your beads so that they don't stick when you melt them. Pour the beads into the bottom. [7] X Research source You can buy thermoplastic beads from a craft store or online retailer."
    },
    {
      "title": "Heat the beads with a hairdryer until they turn clear.",
      "content": "Heat the beads with a hairdryer until they turn clear. Turn a hairdryer on to the highest heat setting and hold it about 4 to 6 inches (10 to 15 cm) over the dish with the beads inside. Keep the hot air on the beads until they turn from white to clear and start sticking together. [8] X Research source"
    },
    {
      "title": "Divide the melted plastic in half and form 2 individual fang shapes.",
      "content": "Divide the melted plastic in half and form 2 individual fang shapes. Once the beads have melted into 1 piece of plastic, pull it apart to create 2 even pieces. Use your fingers to roll and pull each piece of plastic into a basic fang shape, with a wider base and pointy tip. [9] X Research source If the plastic is too hot to touch at first, let it cool for 1 to 2 minutes before you start shaping it. Try to make the fang shapes as identical as possible."
    },
    {
      "title": "Press each fang onto one of your canine teeth to mold them.",
      "content": "Press each fang onto one of your canine teeth to mold them. Push 1 fang onto your left canine tooth so the pointy tip faces down. Then press the other fang onto your right canine tooth. Push firmly so that the fang molds around your tooth. [10] X Research source Work quickly while the plastic is still bendy. To find your canine teeth, count 3 teeth over from the center. They're usually slightly pointy."
    },
    {
      "title": "Leave the fangs in for at least 15 minutes or until they turn white.",
      "content": "Leave the fangs in for at least 15 minutes or until they turn white. Once you've molded the fangs around your teeth, leave them in your mouth until they've cooled completely, or for about 15 minutes. You'll know they're cool when the plastic turns from clear to white. [11] X Research source Pop your fangs out before eating or sleeping by pulling the bottom up and off. Since they're shaped to your teeth, they'll suction right over your natural teeth. You don't need any glue or adhesive."
    }
  ]
}