{
  "url": "https://www.wikihow.com/Care-for-a-New-Tattoo",
  "title": "Tattoo Aftercare Guide: Healing, Products, & Long-Term Care",
  "steps": [
    {
      "title": "Leave the covering on for 2-3 hours or as directed by your tattoo artist.",
      "content": "Leave the covering on for 2-3 hours or as directed by your tattoo artist. Once your tattoo is complete, your tattoo artist will clean the area, apply an antibacterial ointment, and cover the tattoo with a bandage or plastic. Resist the temptation to uncover your tattoo right away, as it is there to protect your tattoo from dirt and bacteria. [1] X Research source Since different tattoo artists have different methods of wrapping new tattoos, ask your tattoo artist when they recommend removing the bandage. Some artists may not wrap the tattoo at all, depending on the products and technique they use. If you leave the bandage on longer than the artist suggests, you are more prone to infection and the ink may bleed."
    },
    {
      "title": "Wash your hands before carefully removing the bandage.",
      "content": "Wash your hands before carefully removing the bandage. Having clean hands will help prevent infection. [2] X Research source To remove the bandage more easily, you can apply warm water to it to prevent the bandage from sticking to your skin. Pull the bandage off slowly and carefully so you don't damage your new tattoo."
    },
    {
      "title": "Wash the tattoo with lukewarm water and antibacterial soap.",
      "content": "Wash the tattoo with lukewarm water and antibacterial soap. Instead of submerging your tattoo, cup your hands together and scoop lukewarm water over it. Use a mild, hypoallergenic liquid antibacterial or antimicrobial soap to rub the tattoo gently with your fingers, removing all traces of blood, plasma, or leaked ink. This will help to prevent the tattoo from scabbing too soon. [3] X Research source Do not use a washcloth, loofah or any sponge to clean the tattoo, as these may harbor bacteria. Do not resume use of the items until the tattoo has healed completely. Avoid holding the tattoo directly under the water—the stream of water from the faucet may be too harsh on your new tattoo."
    },
    {
      "title": "Let the tattoo air dry or pat it dry.",
      "content": "Let the tattoo air dry or pat it dry. While it's best to let your skin air dry after the tattoo has been cleaned, you can also use a clean, dry paper towel to gently blot the tattoo until it's dry. Avoid rubbing the tattoo with the paper towel to avoid irritating your skin. [4] X Research source Regular towels can irritate your tattoo or cause little bits of fluff to get stuck in them, so it's best to only use a paper towel for drying."
    },
    {
      "title": "Apply a non-scented moisturizing cream or balm.",
      "content": "Apply a non-scented moisturizing cream or balm. Once your tattoo is fully dry, apply a little moisturizing cream, preferably a gentle tattoo aftercare product or fragrance-free lotion to the tattoo. Make sure to apply only a very thin layer and pat it in gently until it's absorbed by the skin. If you're not sure what kind of moisturizer to use, ask your tattoo artist what they recommend for your skin. [5] X Research source Don't use petroleum-based products, such as petroleum jelly or Neosporin, as these are too heavy and may clog the pores. Once your tattoo is clean and moisturized, avoid rewrapping it."
    },
    {
      "title": "Listen to your tattoo artist's advice.",
      "content": "Listen to your tattoo artist's advice. Your tattoo artist will explain how you should care for your tattoo immediately after getting it, so try to follow their instructions. The way they bandage your tattoo may be different from other tattoo artists, so take the advice they give you seriously to ensure your tattoo heals correctly. [6] X Research source Write down the instructions they give you on a piece of paper or type them up on your phone so you don't forget."
    },
    {
      "title": "Wash and moisturize your tattoo daily until the scabs are gone.",
      "content": "Wash and moisturize your tattoo daily until the scabs are gone . You should continue to wash your tattoo 2-3 times a day with antibacterial soap and lukewarm water until it's fully healed. This can take anywhere from 2 to 6 weeks, depending on the size and location of the tattoo. [7] X Research source While moisturizing is important, be careful not to smother the tattoo in lotion or ointment—a thin layer is all you need. Continue using an unscented mild soap when washing."
    },
    {
      "title": "Avoid scratching or picking at your tattoo.",
      "content": "Avoid scratching or picking at your tattoo. As it heals, your tattoo will start to scab over, which is normal. Let the scabs dry out and fall off by themselves, and don't speed up the process by picking or scratching at the scabs. This can cause the scabs to fall off too soon, which can leave holes or light spots on the tattoo. [8] X Research source Dry, scabbing or peeling skin can become very itchy, but scratching at your tattoo may also cause scabs to fall off. Keep using moisturizing ointment to combat itchiness if it is a problem."
    },
    {
      "title": "Keep your tattoo out of direct sunlight.",
      "content": "Keep your tattoo out of direct sunlight. The harsh rays of the sun may cause your skin to blister and bleach some of the colors from your tattoo. For this reason, it is best to keep your tattoo covered and away from the sun for at least 3 to 4 weeks until the initial healing is complete . [9] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Once your tattoo is healed, you'll want to wear sunscreen to prevent the tattoo from fading."
    },
    {
      "title": "Avoid soaking the tattoo in water.",
      "content": "Avoid soaking the tattoo in water. Until your tattoo is fully healed, don't swim in a pool or the ocean. Avoid soaking in the bathtub or hot tub as well. Exposing your tattoo to lots of water can pull the ink out of your skin and do damage to the tattoo's appearance. The water may also be carrying dirt, bacteria, or other chemicals that can infect your tattoo. [10] X Research source"
    },
    {
      "title": "Wear clean, loose-fitting clothing to avoid irritating your tattoo.",
      "content": "Wear clean, loose-fitting clothing to avoid irritating your tattoo. Try not to wear tight or restrictive clothing on the area with your new tattoo, especially at first. As your tattoo heals, it will seep plasma and excess ink, which may cause the clothing to stick to the tattoo. The clothing will then be painful to remove and may rip off any freshly formed scabs. [11] X Research source If your clothing does stick to your tattoo, do not pull! First wet the area with water, which should loosen the clothing to where it can be removed without damaging your tattoo. Tight clothing will prevent enough oxygen from getting to your tattoo, and oxygen is essential for the healing process."
    },
    {
      "title": "Wait for your tattoo to heal before doing strenuous workouts.",
      "content": "Wait for your tattoo to heal before doing strenuous workouts. If the tattoo covers a large surface area or is near your joints (such as elbows and knees), it may take longer to heal if the skin is forced to move too much during physical activity. The movement will cause the skin to crack and become irritated, prolonging the healing process. [12] X Research source If you work in a job that involves physical activity, such as construction or dance, you may want to consider having your new tattoo done right before you have a day or 2 off so it has time to heal before you return to work."
    },
    {
      "title": "Unscented water-based moisturizers.",
      "content": "Unscented water-based moisturizers. No matter which type of cream, balm, or lotion your tattoo artists recommends, one fact always remains true—the moisturizer should be free of scents, which can irritate broken skin. And you'll want something water-based as opposed to petroleum-based, as products that contain petroleum (e.g., Aquaphor and petroleum jelly) can cause your tattoo to fade over time. [13] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If you don't already have the right moisturizer at home, it's easy to find great fragrance-free options at any major retailer. Some popular tattoo-safe products are Lubriderm Daily Moisture , Cerave Moisturizing Cream , Eucerin Advanced Repair Lotion , La Roche Posay Cicaplast Baume B5 , and Vanicream Moisturizing Cream . If you're having trouble finding the right moisturizer, look for products targeted toward sensitive skin or labelled \"Sensitive,\" \"Hypoallergenic,\" or \"Fragrance Free.\""
    },
    {
      "title": "Gentle hypoallergenic soap or cleanser.",
      "content": "Gentle hypoallergenic soap or cleanser. As your tattoo heals, it's important to keep it clean. Because your tattoo is essentially an open wound, you'll want to make sure you're using a gentle cleanser that doesn't contain irritants like fragrance, dyes, and alcohols. [14] X Research source Some popular options you can find just about anywhere are Dr. Bronner's Baby Unscented Castille Soap , Cetaphil Daily Facial Cleanser Fragrance Free , or Cerave Hydrating Facial Cleanser ."
    },
    {
      "title": "Coconut oil.",
      "content": "Coconut oil. More and more tattoo artists are recommending coconut oil as a natural way to care for your new tattoo. Coconut oil is a great choice for new tattoos because it's full of fatty acids, antioxidants, and vitamins. It's also antimicrobial, which can help you avoid infections. When choosing a coconut oil for your tattoo, opt for virgin coconut oil over refined coconut oil. One drawback of coconut oil is that it's comedogenic, meaning that it could clog pores and cause breakouts. Avoid using coconut oil on areas of your body that are prone to acne and pimples."
    },
    {
      "title": "Tattoo-specific products.",
      "content": "Tattoo-specific products. Many brands make products specifically for tattoo aftercare, including Tattoo Goo , Sanibalm , and EiR NYC Tattoo Balm . Many skincare-focused companies also make tattoo-specific products, such as Skinfix's Inked Tattoo Balm and Benpanthen's Tattoo Aftercare Ointment. You may even be able to purchase a tattoo-aftercare product directly from your tattoo artist."
    },
    {
      "title": "Protect your tattoo from the sun.",
      "content": "Protect your tattoo from the sun. To prevent your tattoos from fading, avoid direct sunlight whenever possible. Always apply sunscreen to your tattoos any time you aren't able to protect them with clothing. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Use moisturizer regularly.",
      "content": "Use moisturizer regularly. While you don't have to continue using the same products you did when you first got your tattoo, you'll want to make sure you're regularly moisturizing your skin to keep your tattoo looking bright and fresh. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This is especially important when your tattoo is in an area that rubs against clothing or is regularly exposed to sunlight. Some moisturizers also include sun protection (SPF), which can be a convenient option for protecting your tattoo over time."
    },
    {
      "title": "Stay hydrated.",
      "content": "Stay hydrated. Studies show that not drinking enough water can lead to dry and dehydrated skin. [17] X Research source To keep your tattoo looking vibrant, drink plenty of water every day."
    },
    {
      "title": "If possible, avoid rapid weight loss or gain.",
      "content": "If possible, avoid rapid weight loss or gain. Changes in your body size can stretch or warp your tattoo. Gradual changes in body size won't make your tattoos look much different, but rapid changes can lead to noticeable distortions in your ink. Weight loss can make your tattoos look wrinkled due to excess skin. You can decrease these effects by increasing muscle tone as you lose weight. Rapid weight gain, including through pregnancy, will likely lead to tattoo distortion. You can decrease these effects by staying hydrated, using oils like Bio-Oil to hydrate the skin, and toning the body with exercise."
    }
  ]
}