{
  "url": "https://www.wikihow.com/Be-Rational",
  "title": "How to Be Rational",
  "steps": [
    {
      "title": "Accept the challenge to develop your rational thinking.",
      "content": "Accept the challenge to develop your rational thinking. Becoming more rational begins with changing the way you process through events and the way that you think. Instead of looking at this change as work, try viewing it as a challenge or an opportunity to grow. [1] X Research source Begin to be more rational by trying the following. Make a commitment out loud to yourself to grow. Try saying, “I will accept this challenge to change, to learn, and to grow by developing my ability to think rationally.” Determine if you are operating from your “rational mind” or your “emotional mind.” In rational mind your thinking is focused and more logical, utilizing past experience, facts, and research to help you plan and make decisions. In emotional mind your thinking is reactive, sometimes illogical, and uses emotions to plan and make decisions."
    },
    {
      "title": "Confront your cognitive biases.",
      "content": "Confront your cognitive biases. A key to thinking rationally is to be honest about cognitive biases you may have. As a rational thinker, you will be called upon to make your own opinions and have the rationale to back them up. Make an effort now to confront any tendencies you may have to think in ways that detract from your good judgment or rational thinking ability. If you find yourself jumping to conclusions or making assumptions, you may have stumbled upon a bias you can work on. Consider the cognitive biases that are possible for you to have such as availability heuristic, bandwagon effect, or confirmation bias. Think objectively about what biases you may exhibit or experience. Confront that bias and change it by consciously taking a step back and re-evaluating those assumptions."
    },
    {
      "title": "Develop a system or approach to improve your rational thinking.",
      "content": "Develop a system or approach to improve your rational thinking. [2] X Research source After accepting the challenge to develop your thinking and researching and confronting your biases, you have already taken the first few steps in a plan to become a more rational thinker. Continue to develop and begin to enact a plan to achieve what you want. The key to working on this plan is to be consistent in your practice, whatever that may be. Try the following methods. [3] X Research source Keep an “intellectual” journal. Keep a journal separate from others you may have, and in it, describe situations that have occurred. Record your analysis by evaluating the situation, what happened in detail including what you thought and how you reacted. Write about what you learned about yourself, what could have gone differently, and how rational you reacted. If you encounter a complex problem and are feeling overwhelmed, pause and break the elements of the problem down. [4] X Trustworthy Source Association for Supervision and Curriculum Development Nonprofit organization providing innovative, effective educational resources for educators designed to support student achievement Go to source Think through each element, figuring out and writing down your purpose in addressing that element, the question you are trying to answer, and what information you need to approach the problem rationally. When you notice you are feeling a strong or negative emotion, again pause and analyze. [5] X Expert Source Christina Stathopoulos, PCC, ACCC Certified Leadership & Life Coach Expert Interview. 15 October 2021. Ask yourself what the thought is that is leading to the emotional reaction and how that might be flawed. Ask yourself what you are basing your thought on that is leading to the emotional reaction. Evaluate that information for reliability. If you struggle with responding to situations rationally, it's extremely important to identify the reason behind that. Usually, it means that you're tired and need a break before making a decision. Or, it could mean that a value of yours is being stepped on or a need of yours isn't being met. [6] X Expert Source Christina Stathopoulos, PCC, ACCC Certified Leadership & Life Coach Expert Interview. 15 October 2021."
    },
    {
      "title": "Practice your rational thinking habits.",
      "content": "Practice your rational thinking habits. Developing a more rational way of thinking takes time, energy, and effort. In order to establish good rational thinking habits make sure that you are taking the time to consistently practice. [7] X Research source While it may take significant time in the beginning, as you continue to make the practice more dominant in your life, it should take less and less time. [8] X Trustworthy Source Association for Supervision and Curriculum Development Nonprofit organization providing innovative, effective educational resources for educators designed to support student achievement Go to source At the start, you should be practicing your rational thinking skills multiple times a day. As you progress further, your rational thinking will become easier and more natural, taking less conscious effort and time."
    },
    {
      "title": "Speak about your opinions rationally.",
      "content": "Speak about your opinions rationally. Another way to be rational is to project a more rational self to the people around you. This can begin by speaking about your opinions and your thoughts rationally to others. Everyone has their own opinions, beliefs, likes and dislikes. The difference in a rational individual is their ability to explain, support, or be flexible in the way they think about theirs. Try the following. Have an explanation or evidence behind your opinions. It is important that you base your opinions on something. Know where your opinions come from and how to discuss them with others. [9] X Expert Source Christina Stathopoulos, PCC, ACCC Certified Leadership & Life Coach Expert Interview. 15 October 2021. Be critical about evidence or information that sparks beliefs or opinions. Be open to changing your opinion if new evidence or arguments are presented."
    },
    {
      "title": "Engage in debate.",
      "content": "Engage in debate. Along with being about to speak about your opinions, rational individuals are able to engage in discussions and debates about various issues. Engaging in debate shows others that you are a thinker, open to being challenged and can respond rationally and intellectually instead of emotionally. During a debate you can appear more rational if you do the following. Be prepared to articulate, explain, and defend your thoughts on an issue. “I disagree. Here's why.” Admit that someone else has made a good point, even if it is counter to yours. “That's a great point. I had not considered it that way before.” Be willing to listen to and accept counter-arguments if they are well reasoned. “I'm interested in your viewpoint. How did you come to that conclusion?”"
    },
    {
      "title": "Complain less.",
      "content": "Complain less. Often people complain about many different occurrences in their lives. [10] X Research source Expressing frustration does not necessarily show a lack of rational thought. Excessively complaining about the same topics, however, does illustrate a lack of ability to rationally think through the situation and develop a plan or solution. When a situation or a person irritates you, talk about it with a trusted person, but also begin to develop a plan to change it. [11] X Research source Start by taking two deep breaths and refocusing your thinking. Be strategic about what you complain about. Only complain if it is in order to help you find a resolution. Try to make time goals for yourself, such as going 24 hours without complaining"
    },
    {
      "title": "Listen actively and intently.",
      "content": "Listen actively and intently. The key to being a more rational friend is to listen actively and intently. If a friend is upset about something that happened, it is important to wait to process and consider all the information given before responding. In this way, you will have the most information possible and will be able to analyze the situation fully to come to a rational conclusion or opinion. Listen actively and intently by utilizing the following. Make eye contact with your friend and observe their emotional expressions. Avoid any distractions such as your phone in order to fully focus on them. Clarify and restate things to make sure you are understanding your friend correctly. Identify the difference between rational information and emotional information that your friend is giving you."
    },
    {
      "title": "Consider the other person's perspective.",
      "content": "Consider the other person's perspective. Even though you have been working on becoming more rational, you may need to accept that others are not. It is possible that you will have to adjust your expectations and consider the other person's perspective before anticipating a level of rationality in your relationship. Be flexible and understanding with where others are in terms of their rational minds and emotional minds. Consider their perspective by attempting the following. Step away from your current view of the world and imagine what it might be like for them. [12] X Research source Recognize that your best bet to reasoning with them, or providing them with a rational perspective is to understand their experience and their assumptions. [13] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Acknowledge that an emotion is an emotion. If something affects someone, it is no less important. Empathy is crucial in relationships."
    },
    {
      "title": "Be an honest and rational friend.",
      "content": "Be an honest and rational friend. When a friend confides in you, never be afraid to be the voice of reason. As you have continued to work on developing your own rationality, your friends may have noticed. Most people tend to seek advice from the person that will give an honest opinion rather than sugarcoat the truth. Be careful, though. Friends might not always come to you for advice or for a rational perspective. [14] X Research source Sometimes friends just need to vent and share their experience or their emotion with you. Be cautious against providing constant, unsolicited advice."
    }
  ]
}