{
  "url": "https://www.wikihow.com/Change-Yourself",
  "title": "How to Change Yourself",
  "steps": [
    {
      "title": "Identify the problem.",
      "content": "Identify the problem. You've made your mind up to change, but how and why? Clearly identifying the problem, or the aspect of yourself that is leading you to seek change, is the only way it can be solved. What will changing result in? It's best to start positive. Write down a list of what you like about yourself. If that's difficult, what do others say they like about you? Knowing your good qualities makes it easier to draw on them later to get rid of the habits you're trying to kick. In one sentence, state exactly what you want. Make sure it's what you want and not what others think you should want. If you don't actually desire change, it won't come. Next, make a list of reasons why you want this change. Seeing all the motivations written down in front of you--and referring to it later--will keep you on the right path."
    },
    {
      "title": "Do self-affirmations.",
      "content": "Do self-affirmations. Making self-affirmations, or telling yourself positive things about yourself, may help you establish your core values and stay focused on the person you want to be. While unrealistic self-affirmations (like “I accept everything about myself completely”) may not work because they could trigger potential argument with yourself, realistic positive statements like “I am a valuable person and a hard worker” may help you stay positive and even become a better problem-solver. [1] X Research source To make effective self-affirmations, try the following: Use “I am” statements For example, “I am a good person;” “I am a hard worker;” “I am creative.” Use “I can” statements For example, “I can reach my full potential;” “I can become who I want to be;” “I can achieve my goals.” Use “I will” statements For example, “I will become the person I want to be;” “I will overcome obstacles;” “I will prove to myself that I can improve my life.”"
    },
    {
      "title": "Visualize your changed future.",
      "content": "Visualize your changed future. Visualization is a kind of mental rehearsal that can help you imagine a different situation. You can have an abstract visualization (all in your head) or a more concrete expression of your visualization, like a collection of images that represent what you're working towards. [2] X Research source Effective visualization can help you determine specifics about what you're working toward and can help you hone your goals. Further, visualization can help you develop a sense of control over a situation or over your life. [3] X Research source To visualize your changed future: Close your eyes. Picture your ideal future self. Where are you? What are you doing? How is your situation different? What do you look like? What specific things about your changed life are making you feel happy? Allow yourself to picture and explore very specific details of your ideal life. What does it look like? Try to conjure specific sights/sounds/smells/tastes. Concrete details will make your visualization more real. Use this positive visualization to help you set goals for how to achieve that vision of your life."
    },
    {
      "title": "Expect disruption.",
      "content": "Expect disruption. Things happen in life that we could never expect. Your path to change is going to be littered with obstacles and people trying to bog you down. Knowing that the pitfalls in the road are minor setbacks and can be overcome is necessary for success. [4] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Staying realistic is the best way to tackle any daunting topic. Don't blame yourself or others for keeping you from your goal. Setbacks are normal and will happen."
    },
    {
      "title": "Learn from apparent failure.",
      "content": "Learn from apparent failure. [5] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source You may experience moments that feel like failure. You don't reach a goal or a milestone, your straight line to your goal ends up being a very curvy road, or you end up changing your goals to something completely different along the way. Remember, however, that failures aren't failures; they're opportunities. You can learn valuable lessons from missteps, and you may learn that being a little flexible about your long term goals can lead you to a happier life. [6] X Research source"
    },
    {
      "title": "Be patient.",
      "content": "Be patient. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If change could come overnight, it wouldn't be worth it. You may not see results as soon as you had planned. It's also sometimes difficult to see change or results in yourself as quickly or easily as someone may be able to from the outside. You change a little every day, and it might be difficult for you to notice or monitor your own change, but it is happening. Setting smaller goals or milestones within a larger goal can help you evaluate whether you're heading in the right direction. Rewarding yourself for reaching those milestones can help you stay motivated to keep going!"
    },
    {
      "title": "Remember to set SMART goals.",
      "content": "Remember to set SMART goals. Goal-setting is a bit of an art, and setting goals well can go a long way to helping ensure that you do, in fact, achieve your goals. There is a helpful acronym that you can use to assess the efficacy of your goals. You should check to see that your goals are SMART: [8] X Research source Specific (or significant) Measurable (or meaningful) Achievable (or action-oriented) Relevant (or results-oriented) Time-bound (or trackable) Reader Poll: We asked 435 wikiHow readers who've set goals for themselves, and 55% of them agreed that the best area to focus on is mental and physical health. [Take Poll]"
    },
    {
      "title": "Set goals that are specific.",
      "content": "Set goals that are specific. [9] X Trustworthy Source Substance Abuse and Mental Health Services Administration U.S. government agency whose mission is to reduce the impact of substance abuse and mental illness on America's communities. Go to source This means that your goals are narrow and detailed. Having goals that are overly broad can make it difficult to establish a plan of action to achieve the goal. Specificity in the plan is more likely to lead to success. For example, “be successful” is too vague. Success is not a specific attribute, and may be defined differently by different people. A more specific goal could be, “graduate with a Master's degree in Social Work from my State University.” This goal is far more specific."
    },
    {
      "title": "Make sure your goals are measurable.",
      "content": "Make sure your goals are measurable. [10] X Research source You should be able to tell when a goal has been achieved. If you can't tell whether you're “there” or not, then your goal was not measurable. For example, “be successful” is not measurable. You won't know when you're officially “successful,” and your idea of what that means may change on a daily (or even hourly) basis. On the other hand, “graduate with a Master's degree in Social Work from my State University” is measurable; you'll know you have reached that goal at your graduation ceremony or when you receive your diploma in the mail."
    },
    {
      "title": "Ensure that your goals are achievable.",
      "content": "Ensure that your goals are achievable. [11] X Research source A goal that is achievable may vary from person to person. Whether a goal is achievable is based on a wide variety of factors, some of which you may not have control over. One way to determine whether a goal is achievable is by asking yourself whether you have the knowledge, skills, and abilities to reach the goal. You may also need to evaluate whether the goal is possible. For example, a goal that may not be achievable would be to become the smartest/richest/most powerful person in the world. A more achievable goal would be to receive a college degree. For some, a more achievable goal may be to receive a GED, or high school equivalency degree."
    },
    {
      "title": "Evaluate the relevance of your goals.",
      "content": "Evaluate the relevance of your goals. [12] X Research source This is particularly important for the shorter-term goals that are leading towards a long-term goal. Your goals should be relevant, in that they fit into a bigger picture of your life. You're less likely to be successful with a goal that is tangential to the rest of your life. For example, setting a goal of “graduating with a Master's degree in Social Work from my State University” is only relevant to your life if you want to become a social worker (or find a career in a related field). If your life goal is to become a pilot, a degree in social work is less likely to help you work towards that larger goal."
    },
    {
      "title": "Set a time limit for your goals.",
      "content": "Set a time limit for your goals. [13] X Research source Effective goals should be time-bound; otherwise, you could always be working towards a goal and never really get there. For example, “graduate with a Master's degree in Social Work from my State University in the next 5 years” is time-bound. While it's okay to reevaluate the time your goal will take as necessary, it should have a time limit that pushes you to work to achieve your goal rather than seeing it as a vague hazy picture of what may happen “someday.”"
    },
    {
      "title": "Start now.",
      "content": "Start now. Saying you'll get going \"tomorrow\" is the same as never starting at all. Tomorrow is a day that never comes. In order to change, you must not procrastinate, you will achieve nothing by putting it off."
    },
    {
      "title": "Break your goal into smaller goals.",
      "content": "Break your goal into smaller goals. [14] X Research source Once you have a main goal in mind, break it into smaller, “milestone” goals. (Some people call these “macro” and “micro” goals). These will make the larger goal a bit more digestible and will give you opportunities to celebrate as you reach small goals along the way. If you find yourself hesitating to start working towards your goal because your end goal is overwhelming, try forgetting about it and focusing instead on your first milestone goal. For example, if you want to lose 45 pounds over the course of 2 years, don't worry about that final number of 45. Just start with your first goal, which might be losing 5 pounds. Try making a reverse calendar. If you start with the (time-bound) end goal, you should be able to work your way backwards in time, setting “milestones” or shorter goals to achieve until you get to the present day. You may have to revise your calendar a few times to fit everything in your given time frame (or you may need to reevaluate the end-time of your final goal). A reverse calendar will help give you a specific starting point and can help you make the first step, which is often the hardest."
    },
    {
      "title": "Reward yourself.",
      "content": "Reward yourself. Recognizing your progress with positive emotion and outside treats will keep you going for the long-term. Throw your fists into the air, watch that extra 30 minutes of TV, or treat yourself to an expensive dinner. [15] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Try not to use rewards that are counter to your progress. If your aim is to lose weight, for example, reward yourself with a new outfit or a mini-vacation, not a third helping of ice cream."
    },
    {
      "title": "Use your emotions.",
      "content": "Use your emotions. [16] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source While working towards goals, you're likely to feel a wide range of emotions that are a normal part of life. If you find yourself having emotions that relate to the achievement of your goals or of changing yourself, try using them to your advantage: [17] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source When you have experienced a milestone or “micro” goal, allow yourself to feel joy and use that to motivate you towards the next goal. If you experience a hiccup or bump in the road, let that frustration re-focus your attention on your goals. If you got near your goal, but something diverted it at the last minute, use feelings of anger to re-energize your commitment to reach the goal despite obstacles."
    },
    {
      "title": "Make yourself uncomfortable.",
      "content": "Make yourself uncomfortable. Most people are comfortable doing what they are doing in life. If you want to make a big change, however, you are going to have to make yourself uncomfortable. Don't worry, though; these feelings of discomfort can lead you to grow and experience things outside of your current experiences. This is another place where “micro” or smaller goals can benefit you. If you think of going from your current state to your end goal, it's likely to be a big, intimidating change. However, if you think of going from where you are now to your first “milestone” goal, it's likely to be a less frightening prospect. For example, imagine that you have an office job that makes you unhappy and you set the following goal: “Become a registered nurse working in an emergency room in the next 3 years.” Jumping straight into that environment may seem terrifying. But working towards your first goal or applying for nursing school is just slightly outside of your comfort zone. Allow yourself to feel a little uncomfortable as you work towards each new step or level of your goal, and to grow from that feeling. You are likely to surprise yourself and experience positive emotions as you gain new life experiences and work closer to your goal."
    },
    {
      "title": "Sustain your motivation.",
      "content": "Sustain your motivation. Over the course of this self-altering project, you'll hit slumps where it's difficult to stay on the right track. Be conscious of these times and tackle them accordingly. [18] X Research source Make yourself accountable. Show your progress to family members or friends or join an online forum. Don't wear yourself out. You may feel like running 10 miles (16 km) the first day, but the following day, you'll be too tired to move. Ease into your goals. Monitor your self-talk. If it's negative, stop it! Take any negative thought and replace it with a positive one. End the thoughts mid-sentence. Find like-minded people. A strong support group makes any endeavor exponentially easier."
    },
    {
      "title": "Keep track of how you feel.",
      "content": "Keep track of how you feel. Logging your behaviors and looking for patterns will help you address the most efficient ways of reaching your goal. If you see yourself succumbing to your old habits, write down when, how, and why. Analyze the possible causes. Maybe you were hungry, tired, or frustrated from a day at work. Note your progress! If you had a good day, write it down! Being able to go back over the progress you made will push you to continue on."
    },
    {
      "title": "Stay healthy.",
      "content": "Stay healthy. Anything and everything is easier to tackle when you're healthy. Apart from the innumerable benefits to your health and overall quality of life, staying healthy will make it easier to maintain a positive attitude. [19] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source Eating well, getting a good night's rest, and staying active are starters to an overall good day. Setting goals that are frustrating and difficult to achieve is hard enough--you want to give yourself the best chance possible. Take care of your mind and body before you attack any bigger issue. If you don't feel good most days, a larger problem must be addressed first. Playing mind tricks, thinking positively, and setting goals must take the back burner to your health and happiness."
    },
    {
      "title": "Adjust your goal.",
      "content": "Adjust your goal. As you progress, you may want to make changes to your ideals. Note your progress and ease up or crack down to fit what you're capable of. If you're making stellar progress, fantastic! Challenge yourself and set new, more difficult goals. Don't feel guilty if you're not hitting the marks you were originally aiming for. Reassess and aim for what's doable. The last thing you want is to get discouraged and quit."
    },
    {
      "title": "Keep it up.",
      "content": "Keep it up. Once you've reached your desired outcome, don't let up. Habits take time to form--allow yourself time to get used to your new routine. This should be a lifelong change. While initially it'll take conscious effort to stay away from carbohydrates, to initiate conversations, to save money, soon enough it'll be hard-wired into your brain and automatic."
    }
  ]
}