{
  "url": "https://www.wikihow.com/Act-on-a-First-Date",
  "title": "16 First Date Tips to Help You Make a Good Impression",
  "steps": [
    {
      "title": "Choose something where you two can connect with each other.",
      "content": "Choose something where you two can connect with each other. On a first date, dating coach Lisa Shield recommends “to go out and do an activity” like “grabbing a cup of coffee, and then going for a walk down to a really interesting neighborhood.” [1] X Expert Source Lisa Shield Dating Coach Expert Interview. 13 December 2018. This can allow you to get to know your date. You could also go for a walk in the park, visit a museum, or play mini golf. [2] X Research source If it’s around Halloween time, try going to a pumpkin patch or visiting a corn maze. If the holidays are coming up, plan to walk around your neighborhood and look at the Christmas lights. If you’re feeling adventurous, go rock climbing , head to the roller rink, book a hot-air balloon ride, or explore your way through an escape room together. [3] X Research source You can make a general plan, but be open to doing something spontaneous! If you’re walking around with your date and see a fun-looking club or theater, why not pop in? Need more first date ideas? Discover new and exciting things to do over at our \"What are some good first date ideas?\" forum ! Reader Poll: We asked 906 wikiHow readers who've asked someone on a date, and 53% of them agreed that the best way to approach it is by taking things slow and getting to know them. [Take Poll] Try to choose an activity where you can talk to your date so you can learn more about them!"
    },
    {
      "title": "Shower, brush your hair, and put on some makeup (if you wear it).",
      "content": "Shower, brush your hair, and put on some makeup (if you wear it). Dress in clean, wrinkle-free clothes that are good for whatever you’re doing, and make sure you feel comfortable and confident. When you look your best, you’ll feel your best, even if you’re a bit nervous! [4] X Trustworthy Source Association for Psychological Science Nonprofit organization devoted promoting trustworthy research and education in the psychological sciences Go to source Dating coach Lisa Shield says that “unless you're going to a fancy place or you’ve been invited to some kind of event where you're somebody’s plus one, I wouldn't get dressed up too much.” [5] X Expert Source Lisa Shield Dating Coach Expert Interview. 13 December 2018. For example, if you’re going mini-golfing or roller skating, a pair of jeans, sneakers, and a T-shirt would be perfect. If you’re taking your date to a nice restaurant, try dressing up with some slacks or a skirt, a button-down, and a nice jacket."
    },
    {
      "title": "When you set a time for your date, stick to it!",
      "content": "When you set a time for your date, stick to it ! Leave with plenty of time to get there to make a good first impression. If you’re going to be late, send your date a text to explain the situation and let them know. Before you meet, take a deep breath, smile, and greet your date with a heartfelt apology. [6] X Research source Being late to a first date typically doesn’t make a good first impression. It can be really awkward for your date to stand in front of wherever you’re meeting waiting for you."
    },
    {
      "title": "Shake their hand and give a brief introduction when you arrive.",
      "content": "Shake their hand and give a brief introduction when you arrive. If you’re meeting up with someone from a dating app or you’ve been set up on a blind date , this can break the ice without being too awkward. After introductions are over, let the conversation go from there! [7] X Research source Try saying something like, “Brittany? Hi, I’m Suzanne! It’s so nice to finally meet you.” If you feel comfortable enough, you could even give them a quick hug."
    },
    {
      "title": "Your date can’t get to know you if you’re scrolling through Instagram!",
      "content": "Your date can’t get to know you if you’re scrolling through Instagram! Slide your phone into your pocket or purse and keep it there as long as possible. If you do need to check your phone, pull it out while your date is in the bathroom or explain quickly why you’re looking at it. [8] X Research source"
    },
    {
      "title": "Choose a couple of questions ahead of time to avoid awkward silence.",
      "content": "Choose a couple of questions ahead of time to avoid awkward silence. If you aren't sure what to talk about, ask your date questions they can give long answers to instead of just “yes” or “no.” Relationship expert Joshua Pompey says to try to “put a unique spin on questions that are very common and routine to make them more interesting.” Ask questions like: [9] X Research source \"What was the highlight of your day?\" \"What’s your favorite thing to do for fun?” “If you could teleport to any place in the world, where would you go?” \"What’s your favorite place on earth?” “What’s your dream job?” \"Do you have any pets / want any pets?” \"What’s your family like? Do you have siblings?” “If you didn’t live here currently, where could you see yourself living?” \"What’s something you’d like to learn or wish you were better at?” \"What’s one thing you’re really proud of?” Find more fun and meaningful first date questions in our \"What do I actually ask someone about on a first date?\" forum !"
    },
    {
      "title": "Listen",
      "content": "Listen to your date’s interests and repeat their answers back to them. First dates are a great opportunity to get to know your date better and see if you’d like to continue the relationship. Show your date that you’re engaged with what they’re saying by making direct eye contact, nodding your head, and summarizing the details of their answers. [10] X Research source You might say something like, “So, what happened after Hannah called you back?” or “You said earlier that you’d love to visit somewhere like Hawaii, have you ever been there?” It can be tough to really listen when you’re nervous, especially if you’re thinking of what to say next. It’s okay if you can’t memorize everything your date says right now!"
    },
    {
      "title": "If you ask too many questions, the date may start to feel like an interview.",
      "content": "If you ask too many questions, the date may start to feel like an interview. Make sure to talk about your life, your hobbies, and your passions, too. [11] X Research source That way your date gets to know who you are. Your date might have questions of their own or you can relate their answers with your own experiences. For example, if your date just told you they have a dog, you could say, “Oh, that’s awesome! I don’t have a dog right now, but I’d love to adopt one someday.” There’s a fine balance between talking about yourself too much and not enough. If you feel like you’re dominating the conversation, switch to asking your date questions again."
    },
    {
      "title": "Everyone likes to laugh, and it can make your first date jitters go away.",
      "content": "Everyone likes to laugh, and it can make your first date jitters go away. Try throwing in a little light humor every now and then to show your date that you have a funny sense of humor . This can even help your date feel more comfortable, too. Plus, laughing together can make the two of you feel closer. [12] X Research source To break the ice, say something like: “My five-year plan includes avoiding a career at all costs. How about you?” “Stop making me so interested in you, I’m trying to seem cool and aloof.”"
    },
    {
      "title": "Tell your date that you love their outfit, their hair, or their laugh.",
      "content": "Tell your date that you love their outfit, their hair, or their laugh. Everyone loves to be flattered, especially by a potential romantic partner! Try to keep it to one or two compliments throughout the date. It doesn’t matter what you compliment them on, as long as you’re genuine. [13] X Research source You could say something like, “I really like your smile, it opens up your whole face.” Or, “Your hair looks really good tonight, I like it slicked back like that.”"
    },
    {
      "title": "Try to avoid talking about past trauma or your exes.",
      "content": "Try to avoid talking about past trauma or your exes. Unless you two get really deep, discussing deep personal traumas on a first date can feel too heavy and put a lot of pressure on your date to comfort you. Similarly, try to avoid talking about your ex too much (or at all). It might make you seem like you’re not over them, which can make your date nervous. [14] X Research source Although tradition says you should never talk about politics or religion on a first date, now most people believe it’s important to find out if your political and social views are aligned. [15] X Research source To move forward from a past relationship, dating coach Lisa Shield says to “cut them off,” “delete any texts and emails and messages” from them, and “get rid of anything that that person has given you.” [16] X Expert Source Lisa Shield Dating Coach Expert Interview. 13 December 2018. She also recommends doing “some sort of ceremony to cut those ties” and “cleanse your energy field from that person.” [17] X Expert Source Lisa Shield Dating Coach Expert Interview. 13 December 2018. You might burn all photos you have of your ex, for example."
    },
    {
      "title": "Whether you’re sitting or standing, angle your body toward your date.",
      "content": "Whether you’re sitting or standing, angle your body toward your date. This lets your date know that you’re paying attention and listening to them. This also helps you make eye contact with your date, which can help maintain the flow of the conversation and make you feel more connected. [18] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you’re walking around, don’t worry about facing your date (since that might be tough). If you’re sitting at a table, scoot in close so you can hear every word your date is saying. If you’re on a park bench, angle slightly inwards so your body faces theirs."
    },
    {
      "title": "Use confident body langauge and ground yourself during the date.",
      "content": "Use confident body langauge and ground yourself during the date. Push your shoulders back, line your neck up with your chest, and engage your abs slightly to keep your posture (and your body) looking good. Try not to overthink it, though! If you feel stiff or awkward, try to ground yourself by feeling your feet on the ground and taking deep breaths. [19] X Research source Try to remember that a first date isn’t like an interview or a test—instead, think about it like a new experience. Try to stay in the present moment and just have fun with it!"
    },
    {
      "title": "Crossing your body can make your date feel distant from you.",
      "content": "Crossing your body can make your date feel distant from you. Body language experts say that crossing your arms and legs is a self-comfort move. However, strangers may feel more distant from you when you cross your body—if you’re on a first date with someone you don’t know, you may want to keep the crossing to a minimum. [20] X Research source If you’re going on a date with a friend or someone you know, crossing your arms might not be a big deal—they might think you’re just interested in what they have to say."
    },
    {
      "title": "Breaking the touch barrier shows someone that you’re interested in them.",
      "content": "Breaking the touch barrier shows someone that you’re interested in them. If you find the opportunity, try gently touching your date’s forearm, elbow, or shoulder. [21] X Research source Keep it light and quick so you don’t make your date uncomfortable, and back off if they don’t seem into it. You could say “I love your watch!” and grab their hand to get a closer look. Try lightly touching your date’s arm when you laugh at a joke. If your date touches you on the arm or the shoulder, it’s a good sign that they’re into you."
    },
    {
      "title": "Saying goodbye is the last impression you leave your date with.",
      "content": "Saying goodbye is the last impression you leave your date with. Try not to rush it! Take a minute to give your date a hug or a handshake. If you’d like to, talk about plans for getting in touch in the future. If it really went well, you can shoot them a text the next day and tell them how much you enjoyed your time together. [22] X Research source You could say something like, “I really had a good time tonight. Would you like to do this again sometime?” You might text something like, “Thank you so much for such a great date! I had so much fun spending time with you.” Not every date will be a winner. If you’re wrapping up the date and you don’t want to go on another one, give your date a handshake and just thank them for the nice time without committing to anything else. If you’re both feeling it, you could go in for a quick kiss. However, not everyone likes to kiss on the first date, so don’t feel pressured to."
    }
  ]
}