{
  "url": "https://www.wikihow.com/Be-a-Mysterious-Girl",
  "title": "How to Be a Woman of Mystery",
  "steps": [
    {
      "title": "Be your genuine and authentic self when dating.",
      "content": "Be your genuine and authentic self when dating. Have you ever met someone that's just so different from you? So different that the way they see the world is just...fascinating? These people aren't mysterious by nature, they're just mysterious because of the difference between the two of you. You know the only way to be different from everyone? By being yourself. [1] X Research source Seriously. Think about it. When a man and woman are dating, the element of mystery mainly comes from the way each person views and interacts in the world. The man sees the woman flitting about in her feminine world, knowing he'll never be a part of it and vice versa. The same goes for your unique world, regardless of gender, regardless of relationship."
    },
    {
      "title": "Be confident",
      "content": "Be confident . In order to really be yourself in today's world (the one that's plastered with images from the media about the necessity to blend in and succumb to fleeting trends), you have to be confident. When the world says, \"sink or swim?\", it's the only way you'll swim. And, oh yeah, people love confident people; they're super magnetic. They're persuasive, attractive, and admirable and we often don't realize why. [2] X Research source There is nothing mysterious about having low self-worth. When that's plaguing you, all your actions are dictated by the thought, \"Will people accept me?\" A) That's not at all attractive and B) it's super easy to see through and figure out. The confident person, the one who's comfortable in their skin, asserting themselves, standing up for what they believe in, is the one people naturally flock to, the one people will look at and say, \"What is it about them?\""
    },
    {
      "title": "Be calm",
      "content": "Be calm . [3] X Research source People who wear their emotions on their sleeves don't leave much to the imagination. After a few days, you know what eats at them, what makes them happy, and what makes them want to ball up in a corner. But if you're the person that's calm all the time, no one will know what really gets you going. This can backfire though -- they'll try even harder to find it! Be the one who's lighthearted in dire situations. And if you must show emotion, show ones that wouldn't necessarily correlate with the circumstance. It's cold outside but it's not snowing? What the heck, mother nature?! What kind of game is she trying to play?! Man, this winter just isn't worth it. You're moving to Belize."
    },
    {
      "title": "Be polite",
      "content": "Be polite . Since being mysterious is often equated with \"dark\" and \"aloof,\" it's important to circumvent those negatives by being polite. Being mysterious does not mean being rude or unresponsive. Don't confuse the two! Everyone deserves being treated well, regardless of how you're trying to come off. [4] X Research source Having a slight smile on your face at all times is a good way to start. Not only will you look more friendly and approachable, but people will be left wondering, \"What's really going on in her head?\" If you've ever walked by someone on the street that's smiling or laughing to themselves, you know this feeling."
    },
    {
      "title": "Don't be afraid to be absurd.",
      "content": "Don't be afraid to be absurd. As we age, we slowly gauge what society expects from us and how we should act in public. You could insert a chicken wing into your mouth, chew it up, and then spit out the bone on the floor, but you don't (probably). While you shouldn't necessarily take that example to heart, think about the impulses you do have that wouldn't be terrible. When a waiter comes up to your table and asks you what you'd like, sometimes you just want to say, \"I could tell you -- but then I'd have to kill you.\" Completely deadpan. And that's okay. While it's not the most sophisticated of tactics, it will get people wondering what the heck is going on in that brain of yours. And it can be fun! So next time you order a shrimp salad, preface it with, \"I have a shellfish allergy.\" When they ask why you ordered what you did, tell them you'll work through it."
    },
    {
      "title": "Don't go into detail.",
      "content": "Don't go into detail. When people ask us questions, we generally know what they're expecting. When someone says, \"Are you in a relationship?\" we know that it really means, \"Are you in a relationship? And if so, what kind and with who?\" Instead of saying, \"Yeah, I have a boyfriend -- his name is George. George Glass.\" Just say, \"Yes.\" They won't know if they can pry any further -- but they'll want to! Try to summarize stories as factually and accurately as possible without truly getting into it. Don't insert commentary -- just stick to what actually happened. Just keep things simple and do a lot of listening. Let's say your boyfriend asks you about your ex. Instead of going on and on about why it didn't work out, tell them, \"We didn't mesh. When the relationship ended, I stopped thinking about it.\" Simple. Terse, maybe, but to the point and honest."
    },
    {
      "title": "Be unreadable.",
      "content": "Be unreadable. Most of our interactions with other people are non-verbal. We have dozens of \"tells\" going on at any one time indicating to others how we feel at that exact moment. Be aware of this and consciously take advantage of the patterns people are relying on. You know how James Bond gets all serious when he's telling a joke? Kind of like that. When he's hitting on a woman he's stoic, too. And that's one mysterious guy. Think about your body positioning when you're interacting with a person. Experiment with changing it around and seeing how the other person reacts. Play with your tone of voice. Your eye contact. Leave them wondering how the heck you were feeling."
    },
    {
      "title": "Turn the focus on the other person.",
      "content": "Turn the focus on the other person. This one is surprisingly really easy. Get into a conversation with a person and all you have to do is ask them questions to get them running. After it's over, they'll be left thinking how great of a conversationalist you were and not even realizing they didn't learn anything about you. In short, people love talking about themselves, so take advantage of it! [5] X Research source Ask open ended questions. When you see a spark in them, jump on it. Get them talking about it. Act genuinely interested to keep them going. You'll seem nice, like a good listener, and you'll be fun to be around even though you're barely doing anything. See? Easy."
    },
    {
      "title": "Talk in facts.",
      "content": "Talk in facts. When the conversation does roll around to you, talk in facts about other things. Don't talk in your opinions, beliefs, or experiences. That way you can add value to any conversation without truly giving away something about yourself. Instead of saying, \"Oh my gosh, I read this thing on the Internet the other day while I was killing time before drinks with Sally about how drinking one more liter of water a day can lead to noticeable weight loss long-term and I'm definitely gonna try it. Working out just isn't enough!\" stick to, \"Some research is saying that upping your water intake can lead to noticeable weight loss. Definitely a viable tactic.\" You're getting the same point across without exposing too much about yourself."
    },
    {
      "title": "Be mysteriously absent.",
      "content": "Be mysteriously absent. So in order to get invited to parties, you have to actually go when you are invited. But once you've gotten your foot in the door and these people like you, feel free to be mysteriously absent. Don't show up to something. Make people wonder where you are. Come late. Leave early with no explanation. Get them wondering. Do this sparingly. If you get up and leave from a party all the time, it'll become a quirk of yours that's a little annoying. If you never show up in the first place, you'll stop being invited. So as with anything, pick your battles."
    },
    {
      "title": "Keep your past a secret.",
      "content": "Keep your past a secret. If you're the new kid in town and you want to keep the intrigue up, don't talk about your past. You'd be surprised what you can get away with! When someone asks you where you moved from, say something like, \"It matters not where you've been -- only where you're going.\" Or, you know. Keep it simple and say \"Utah\" but don't give any details. That might cause fewer weird looks. If keeping your past a secret sounds like an issue, make a game out of it. Tell everyone a story about how you lived in Viet Nam a while back and worked on a ferret farm. Then talk about how you were a chef at a fine restaurant back in your old 'hood. And then magically insert into a random conversation down the line the story of the year you spent hanging out with Charlie Sheen. Might as well get a kick out of the image you're cultivating, right?"
    },
    {
      "title": "Have perfect posture.",
      "content": "Have perfect posture. Having a slouch shows low self esteem, and instead of seeming mysterious, you'll seem shy, or like a loner, which you don't want. The perfect posture is to stick out your sternum, shoulders back, but keep your stomach in a straight line. If your posture is bad, do exercises to Improve Your Posture . Having a perfect posture makes you seem attractive and confident, which will get you positive attention from both men and women, giving you more people to talk to."
    },
    {
      "title": "Develop your own unique sense of style.",
      "content": "Develop your own unique sense of style. Unfortunately, clothing trends make us pretty easy to peg -- or at least give people the impression that we're peg-able. Wearing a scarf and thick, black glasses? You're a hipster. Wearing a top that shows off your chest and a mini skirt? Doesn't even need to be said. Are your pants down around your knees and your shoes untied? Sheesh. So instead of prescribing to a label, make your own. If you like it, go for it. You can mix up styles in one look, or you can rock different looks at different times. One day you rock the black rimmed glasses, the next day it's North Face. The next day it's a top you made yourself. Or it's all three at the same time. Whatever floats your boat."
    },
    {
      "title": "Pick hobbies that don't mesh.",
      "content": "Pick hobbies that don't mesh. If you were shown a typical high school football player, you'd probably think, \"Okay, he's probably athletic, takes classes like woodshop, likes partying on the weekends and has a preppy girlfriend.\" If you were shown a typical high school band member, you'd probably think \"A little introverted. Smart. Probably has a few close friends. Close to family. In general, nice. Maybe plays a few too many video games.\" While these are just stereotypes and not at all correct, mix the two anyway. Be the girl wearing the lipstick and short skirt who's carrying around The Divine Comedy. Be the saxophone player who lights up the soccer field on weekends. Do it all. The more dynamic you are, the harder you'll be able to be put into a box. And once people have you boxed in, you're no longer mysterious. So go out there and do something that \"you\" wouldn't normally do. Not only will you be mysterious, but you may find something you seriously enjoy that you didn't think you would."
    },
    {
      "title": "Keep the emotions to a minimum.",
      "content": "Keep the emotions to a minimum. [6] X Research source When people can easily get a rise out of you, they'll do it. When they know what ticks you off, what really gets you excited, they feel like they get you. Avoid wearing your emotions on your sleeve so you don't get pegged. When people can't get a feel for how you feel, they'll never know what the truth is. When you come up, they won't even know what you like, what you dislike, and what you stand for. Most people can't keep their mouths shut! it's a good idea to keep the volume to a minimum, too. Ever noticed how loud people are never mysterious? No one ever says, \"Americans, now that's one mysterious bunch!\" So feel free to whisper to the person next to you with that blank, unreadable face of yours. Everyone will probably think you're talking about them. Win. Oh, the games we play."
    },
    {
      "title": "Stay offline.",
      "content": "Stay offline. ..mostly. You know those people that update their Facebook profiles every six seconds with thoughts like, \"OMG, I just forgot to eat dinner\" and the like? Don't be that person. That person is ruining Facebook for the rest of us. Don't post pictures of everything that's about to go into your mouth, don't post selfies you took in your bathroom when you were bored, don't Vaguebook trying to express your delicate, flowery emotions. When you have something to say online, make it worth it. The fact of the matter is we don't need to know what all of us are doing at any moment. The less we know, the better, really. If you want to be mysterious, leave people wondering where you are, who you're with and what you're doing. So avoid checking into Starbucks every morning. Avoid \"Dear so-and-so\" statuses. Resist the temptation of putting a hashtag after everything you say. While social networking is useful, don't use it to let the world in on everything you think and do."
    },
    {
      "title": "Take it to the limit.",
      "content": "Take it to the limit. There are a jillion ideas out there that you could take advantage of if you really want to be mysterious. You could do silly things like wearing dark sunglasses. You could purposefully make your room Gothic and yet princess-themed. You could use air quotes and say things like, \"I went to the \"post office\" today.\" You could wear a cape. How far are you willing to go? Wanna have a little fun with it? Pretend you're someone you're not. When you enter a party, you give people a fake name and ask them if the mob has been here recently. It's not quite the same as being yourself, but it can be quite entertaining!"
    }
  ]
}