{
  "url": "https://www.wikihow.com/Catch-a-Spider",
  "title": "How to Catch a Spider",
  "steps": [
    {
      "title": "Place a jar or cup over the spider.",
      "content": "Place a jar or cup over the spider. When you see an eight-legged intruder scuttling across the floor and you need to act fast to avoid losing it, reach for a transparent glass jar or drinking cup. Lower the jar over the spider to halt its movement. Make sure the rim of the glass is flat against the ground so the spider can’t crawl out. [1] X Research source Just about any jar or cup will get the job done, but clear containers work best since you’ll be able to see the spider at all times."
    },
    {
      "title": "Slide a folded piece of paper under the jar.",
      "content": "Slide a folded piece of paper under the jar. Without lifting the jar, slip the paper beneath the rim and push it through to the other side. Center the jar over the piece of paper. The spider will be trapped between the 2 surfaces. [2] X Research source An envelope or index card will also do the trick. These materials tend to be sturdier than regular copy paper, as well, making your makeshift prison more secure. Whatever type of paper you use needs to be large enough to cover the mouth of the jar completely."
    },
    {
      "title": "Lift the paper and jar together.",
      "content": "Lift the paper and jar together. Place one hand on the underside of the paper and the other on the top of the jar. Keep a little bit of pressure on both items as you make your way to the door to keep the spider from escaping. Try not to tilt or jostle the jar on top of the paper, or the movement could create an opening."
    },
    {
      "title": "Take the spider outside.",
      "content": "Take the spider outside. If your goal is to simply get the spider out of your home, carry it a few yards away and release it into the grass. Give the area where you found the first spider a quick scan before you put up your jar, as there could be others around. Be careful when transporting the jar. Dropping it will just leave you with broken glass to clean up and a spider on the loose."
    },
    {
      "title": "Capture the spider in the jar instead.",
      "content": "Capture the spider in the jar instead. If you’d rather keep the captive critter as a pet, turn the jar upside down and slowly slide the paper away from the mouth. This should dislodge the spider, causing it to drop right in. [3] X Research source Before you stop to admire your new pet spider, secure the lid of the jar or find another object to fit over the top. It won’t take long for it to climb out if there’s nothing in its way. Create a more natural habitat for your pet spider by introducing some small leaves, twigs, rocks, and a small amount of water to the jar. Don’t forget to poke holes in the lid so it will have plenty of air!"
    },
    {
      "title": "Sweep the spider into a dustpan.",
      "content": "Sweep the spider into a dustpan. Whisk the bristles over the spider gently, being careful not to be too forceful. Once it’s inside, pick up the dustpan and set the broom down—you’ll need your other hand to ensure that your little friend doesn’t go anywhere. [4] X Research source If the spider tries to get away, use the broom to block its path and direct it into the awaiting dustpan."
    },
    {
      "title": "Tap the bottom of the dustpan continuously.",
      "content": "Tap the bottom of the dustpan continuously. As you head outside, drum your fingers against the dustpan. The vibrations will confuse the spider, causing it to freeze in its tracks. Keep tapping steadily until you get to the spot where you want to release it. [5] X Research source Hold the dustpan away from your body, just in case. You don’t want it crawling all over you if it gets out!"
    },
    {
      "title": "Empty the dustpan outside.",
      "content": "Empty the dustpan outside. Turn the spider loose. Alternatively, you can try to funnel it into a jar or other container for collection. It may be necessary to scrape it out with another object if it’s clinging to the dustpan. Don’t bang the dustpan against the ground. Just give it a light shake, or upend it and let the spider make its way out on its own."
    },
    {
      "title": "Purchase a special bug catcher device.",
      "content": "Purchase a special bug catcher device. Handheld bug catchers are comprised of a long shaft and a bristle tip or trap door which makes it possible to collect and relocate insects without actually touching them. They can be found at gardening centers and home improvement stores, or in the housewares aisle of most supermarkets. These devices are inexpensive and can be very convenient to have on hand. You can usually pick one up for less than $20."
    },
    {
      "title": "Position the end of the bug catcher over the spider.",
      "content": "Position the end of the bug catcher over the spider. Once you’ve got the spider in your sights, press the tip of the device into the surface around it to keep it from crawling any further. Be careful not to crush it while you swoop in. Make sure the end of the device is open all the way to increase your chances of a successful catch."
    },
    {
      "title": "Squeeze the trigger or slide the tab to snag the spider.",
      "content": "Squeeze the trigger or slide the tab to snag the spider. The soft bristles on the tip of the device will gently enclose the spider without harming it. Trapdoor devices work similarly to the jar and paper method—the hollow chamber holds the spider in place while the retractable door slides closed beneath it. [6] X Research source Using a bug catcher is one of the easiest and most humane ways to deal with invasive critters."
    },
    {
      "title": "Let the spider go outside.",
      "content": "Let the spider go outside. When you’re a distance away from your home, release the catch and let your captive go free. Repeat this process every time you come across a spider to keep your home free of creepy crawlies or add to your specimen collection."
    },
    {
      "title": "Search your home for spider webs.",
      "content": "Search your home for spider webs. While you’ve got your long-handled bug catcher out, you can use it to tear down webs you find in hard-to-reach nooks like ceiling corners and closet shelves. Clear away as much of the web as you can. That way, another spider won’t pop back up in its place. Check back over the next couple of days to make sure no newcomers have moved in. Inspect your entire living space for spider webs periodically. It’s recommended that you take care of them as soon as you discover them to prevent infestations."
    },
    {
      "title": "Locate the spider’s web.",
      "content": "Locate the spider’s web. Spiders have been known to construct their homes in cupboards and corners indoors, as well as inside bushes and mailboxes and around light fixtures outside. Look around your property for tell-tale clues or spider activity, like wisps of webbing, small, round egg sacs, and clusters of dead insects. [7] X Expert Source Joshua Bloom Pest Control Specialist Expert Interview. 22 April 2020. [8] X Research source Spiders prefer to make their nests in cool, dark places, like attics, basements, closets, tool sheds, and outdoor areas with lots of shelter from the sun. [9] X Research source Get rid of webs containing egg sacs right away—if they’re allowed to hatch, you may find your house or prized begonias swarming with baby spiders. [10] X Expert Source Joshua Bloom Pest Control Specialist Expert Interview. 22 April 2020."
    },
    {
      "title": "Break off part of the structure supporting the web.",
      "content": "Break off part of the structure supporting the web. Assuming that you find the web in a bush or houseplant, an easy way to deal with it is to clip the leaves or twigs anchoring it. You just want to snap off enough to loosen the web. [11] X Research source Avoid doing too much damage to your plants. Leave buds and blossoms where they are and don’t interfere with healthy growth unless you have no other options. Disrupting the spider’s web, even if it’s nowhere in sight, will make it less likely to return to the same spot."
    },
    {
      "title": "Use a separate tool to detach the web.",
      "content": "Use a separate tool to detach the web. If the web is somewhere inside your home, grab a pencil or similar object and run it around the edges of the web where the tiny threads connect. This should break it free from the surface while leaving it mostly intact. [12] X Research source The sticky web will cling to the object you’re holding, letting you manipulate it without difficulty."
    },
    {
      "title": "Remove the spider and web.",
      "content": "Remove the spider and web. Take the web, spider and all, outside, using the remnants of the plant or other tool to hold it. To capture the spider, insert the entire web into a lidded container with a large opening, like a terrarium or shoebox. Place a lid over the container, punching holes for ventilation if necessary. If you’re feeling charitable, transfer the web to another structure where the spider can begin rebuilding it."
    }
  ]
}