{
  "url": "https://www.wikihow.com/Change-Your-Identity",
  "title": "How to Change Your Identity",
  "steps": [
    {
      "title": "Choose a new name.",
      "content": "Choose a new name . Pick something that will be easy for you to use and that you like being called. Practice signing your new name to get used to the feel of it. Try introducing yourself with your new name to some strangers to see whether or not it feels natural. You won't be able to change your name if you're avoiding bankruptcy by pretending to be someone else, [1] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source your new name violates a trademark, the name uses numbers or symbols, or the name includes obscene words. Consider adopting a generic name. If you want to make it difficult to find you, changing your name to something common, like \"Jim Smith\" or \"Ashley Johnson\" would be good. When you choose a new name, you can consider the meaning behind the name. Think whether you want the new name to have some connection with your name or want a completely different name. Or choose a name that suits your personality."
    },
    {
      "title": "Fill out a petition for your state.",
      "content": "Fill out a petition for your state. Most states require you to fill out a petition listing your reasons for wanting to change your name. Go to the courthouse or your state's courts website to obtain the proper forms, then have the form notarized and filed by a clerk at the courthouse. The petition will be submitted to a judge, so make sure it explains your reasoning completely and correctly. [2] X Research source If you're an immigrant, ex-convict or attorney, you'll need an affidavit of service of notification to authorities in addition to your petition."
    },
    {
      "title": "Attend your name-change hearing.",
      "content": "Attend your name-change hearing. Most hearings are fairly straightforward, but the judge might have a few questions for you. Try to answer clearly and honestly. Lay out your reasons for wanting to change your identity. If the judge denies your request, get a copy of the denial and try again. If the judge approves your request, you'll be granted a name change court order, probably given to you by your local civil court clerk. Make a copy for your records."
    },
    {
      "title": "Change your name on all legal documents.",
      "content": "Change your name on all legal documents. Using the documentation from your hearing, obtain a new driver's license or passport so that you'll have identification. [3] X Research source Change the name on any car titles or loan documents on record. Doing this ahead of time will make getting a new Social Security Card much easier."
    },
    {
      "title": "Fill out a social security card application.",
      "content": "Fill out a social security card application. Using your new name, fill out an application for a new social security card, found here: [4] X Research source You'll need to provide evidence of age with your form. This can include a copy of your birth certificate, adoption papers, or other religious documentation. You'll need to provide evidence of your identity. Use your new driver's license, passport, or non-driver identity card. If you haven't gotten these documents changed yet, you can provide evidence of your recent name change as proof of your identity, including the court-order from your hearing. [5] X Trustworthy Source US Social Security Administration Independent U.S. government agency that administers Social Security and related information Go to source"
    },
    {
      "title": "Visit your local social security office.",
      "content": "Visit your local social security office. Bring the completed form and the necessary proof of your identity and age and prepare to make your case to an officer. [6] X Research source The social security office will offer you a new number if you satisfy one or more of the following criteria: You've been the victim of domestic abuse, harassment, or your life has been endangered in some other way. Sequential digits in the SSN of different members of the same family is causing confusion. More than one person has been assigned the same number. You have a religious or cultural objection to the sequence or digits. You've been the victim of identity theft and the use of the number continues to endanger you."
    },
    {
      "title": "Consider getting in touch with law enforcement.",
      "content": "Consider getting in touch with law enforcement. If you're the victim of abuse and want to change your name to evade your abuser, tell your local law enforcement agency that your life will be in danger unless you are given a new identity. Law enforcement agencies can provide you with the documented evidence you need to take to the Social Security Administration to change your SSN. [7] X Research source"
    },
    {
      "title": "Be prepared to start over from scratch.",
      "content": "Be prepared to start over from scratch. You will have no credit history or employment history. You will not have a job or personal references, and no record of any education or special training. Anyone who checks your employment or credit history is likely to be suspicious when they find nothing. [8] X Research source"
    },
    {
      "title": "Practice introducing yourself with your new name.",
      "content": "Practice introducing yourself with your new name. Practicing writing it and speaking it. You don't want to accidentally slip and use your old name, even once. Similarly, practice the lies you must tell about your family, personal history and places you've lived or visited. [9] X Research source"
    },
    {
      "title": "Adopt new mannerisms, dress, and behaviors.",
      "content": "Adopt new mannerisms, dress, and behaviors. You might develop a taste for different foods, or even take up new hobbies . You may want to change your hair color , wear colored contact lenses or give up wearing contacts for glasses to keep from being recognized. You may need to choose a new line of work. [10] X Research source"
    },
    {
      "title": "Move far away from friends, family and employers.",
      "content": "Move far away from friends, family and employers. Don't tell anyone what your new name is or where you are. Cut off all contact to lessen the chance that someone who knows your previous identity will accidentally expose your new identity."
    },
    {
      "title": "Keep a low profile.",
      "content": "Keep a low profile. A number of government and private agencies have a record of your identity change, and your old identity could be made public if you're arrested, sued or attract the attention of the media."
    }
  ]
}