{
  "url": "https://www.wikihow.com/Beat-Raam-in-Gears-of-War",
  "title": "How to Beat Raam in Gears of War",
  "steps": [
    {
      "title": "If you are playing alone, get the torque bow, some grenades, and the longshot sniper rifle or just the Lancer.",
      "content": "If you are playing alone, get the torque bow, some grenades, and the longshot sniper rifle or just the Lancer. Torque bow and sniper is the best combination. These will be key weapons in the fight. Make sure your ammo is at the highest capacity, along with 4 grenades. However, there is a good way to kill Raam if you forgot to get the bow and sniper rifle: Get behind a concrete block shoot at Raam until he gets to you, then throw a grenade behind him a knock off the kryll. Don't try to impale him with the lancer. It doesn't work. The troika is very effective, however it is unprotected and nigh impossible to reach."
    },
    {
      "title": "If you are playing with a friend, one of you get the torque bow and one of you get the sniper.",
      "content": "If you are playing with a friend, one of you get the torque bow and one of you get the sniper."
    },
    {
      "title": "Leave the room.",
      "content": "Leave the room. As you do, there will be a cutscene. Watch it and be ready for an epic battle."
    },
    {
      "title": "Expect RAAM to appear, accompanied by the Kryll and wielding a troika turret in one hand.",
      "content": "Expect RAAM to appear, accompanied by the Kryll and wielding a troika turret in one hand. The Kryll will protect RAAM for a while, until you shoot him with the torque bow. Use the Torque Bow to get all that Kyrill off him."
    },
    {
      "title": "Try to hit him in the face or head with the sniper to deal extra damage.",
      "content": "Try to hit him in the face or head with the sniper to deal extra damage. When the arrow explodes, the Kryll will scatter, leaving RAAM vulnerable. Now is the time to pop in a few headshots with the longshot rifle. RAAM will repeatedly get close to you, so when he does, jump over your cover and hightail it to the other side. He may send his Kryll after you but don't worry, if you stay in the light, they can't hurt you."
    },
    {
      "title": "Once he gets right in front of you, jump over the barrier and run all the way to the other end of the train.",
      "content": "Once he gets right in front of you, jump over the barrier and run all the way to the other end of the train. Repeat as necessary. RAAM will try to shoot you but he is likely to miss. If he doesn't, find cover fast."
    },
    {
      "title": "Repeat step until he dies.",
      "content": "Repeat step until he dies."
    }
  ]
}