{
  "url": "https://www.wikihow.com/Bowl-a-Yorker",
  "title": "How to Bowl a Yorker",
  "steps": [
    {
      "title": "Hold the ball as you would a fast ball.",
      "content": "Hold the ball as you would a fast ball . Take your normal stance and prepare for your run-up. Position your index and middle fingers to either side of the middle seam. Your thumb should be to the inside of the same side of the seam as your pointer finger. When gripping the ball to throw a fast ball, the joints of your fingers should wrap around the contour of the ball to hold it away from the palm of your hand. [1] X Research source Don’t let the yorker’s reputation as a difficult throw put you on edge. Relax. Take a few breaths. A smooth, consistent throw will improve accuracy."
    },
    {
      "title": "Take aim.",
      "content": "Take aim. Narrow your focus on a feature somewhere around the batsman. Fix your gaze on the crease line or the base of one of the stumps. You might even find it useful to focus on a feature of the batsman, like their toes. Lock your eyes here for the duration of your delivery. By training yourself to focus on a particular point, you’ll limit variables that could affect your delivery. This will allow you to devote more attention to other areas, like form. An ideal yorker will land as close to the batsman as possible while still bouncing before crossing the crease. [2] X Research source Envision yourself completing this throw to improve accuracy. [3] X Research source"
    },
    {
      "title": "Adjust the pace of your run-up.",
      "content": "Adjust the pace of your run-up . Slowing things down a bit might be just what you need to nail your target. But the opposite can also be true. Try a slower and quicker than normal pace for your run up when bowling a yorker. Test each to see which works best for you. [4] X Research source In some cases, your normal bowling speed might be your most accurate pace. Accuracy is everything when bowling a yorker. [5] X Research source"
    },
    {
      "title": "Drive with your shoulder as you throw the ball.",
      "content": "Drive with your shoulder as you throw the ball. The motion for throwing a yorker is much the same as a normal fast throw , but the shoulder of your bowling arm is especially crucial when delivering a yorker. While delivering, drive your shoulder in the direction of the bottom of the stumps. Driving with your shoulder will improve the fullness and speed of your yorker. Take time to practice this motion intentionally."
    },
    {
      "title": "Throw the ball so it lands close to the batsman.",
      "content": "Throw the ball so it lands close to the batsman. Try to get as close to the batsman as possible. Ideally, the ball will land right before the batsman’s feet. This provides little time for him to dig out the ball and hit it into play. Place your feet so you are well-balanced at the moment of release. Doing so will have a positive effect on your accuracy. [6] X Research source"
    },
    {
      "title": "Practice frequently and adjust your form as necessary.",
      "content": "Practice frequently and adjust your form as necessary. Small adjustments can make a world of difference. Try to only adjust one aspect of your throw at a time so you can isolate and improve problem areas. Have a coach or a teammate watch and comment on your form. Always remember, practice always pays. [Image:Bowl a Yorker Step 6.jpg|center]] Record a video of yourself throwing yorkers on your phone. Compare this to YouTube videos of yorkers thrown by cricket professionals. Imitating the pros might improve things."
    },
    {
      "title": "Bowl a yorker towards the end of close games.",
      "content": "Bowl a yorker towards the end of close games. The yorker can give you an advantage in a pivotal moment. Delivering a yorker properly lands it on the batsman’s feet. Batsmen have practically no time to react to this kind of throw and dig out the ball."
    },
    {
      "title": "Use a variety of throws so opponents are unprepared for a yorker.",
      "content": "Use a variety of throws so opponents are unprepared for a yorker. Remember, the yorker is your ace-in-the-hole. If your opponents are on guard for your yorker from the start, it could cost you later on when you need it the most. [7] X Research source Using a variety of throws has the added bonus of improving your odds of a successful throw. To improve variety, you might try bowling inswingers , outswingers , and throwing balls with offspin ."
    },
    {
      "title": "Save yorkers for when you feel confident.",
      "content": "Save yorkers for when you feel confident. Especially during a big game, you might want to hold off on attempting a yorker until you’re well-practiced and confident in your ability. Nerves could turn your yorker delivery into an easy hit if you’re not careful. [8] X Research source"
    },
    {
      "title": "Set aside a block of time to drill yorkers during practice.",
      "content": "Set aside a block of time to drill yorkers during practice. It’s easy to over practice bowling and strain your arm, so break frequently and allow your arm time to recover in between practice sessions. To keep yourself from overdoing it, try practicing with the following maximum limits: Players age 10 to 13: 12 yorkers/practice Players age 14 to 15: 14 yorkers/practice Players over 16: 20 yorkers/practice [9] X Research source"
    },
    {
      "title": "Drill yorkers toward the end of practice.",
      "content": "Drill yorkers toward the end of practice. Yorkers are most commonly bowled at the end of games, so you may be tired in the moment you need to bowl a yorker the most. To give yourself the best chances of delivering a perfect yorker in tired-out condition, save yorker drills for the end of practice. Encourage yourself when practicing yorkers by rewarding yourself with one fewer lap run at the end of practice for every good yorker thrown. [10] X Research source"
    },
    {
      "title": "Perfect your speed and delivery.",
      "content": "Perfect your speed and delivery . Try to start and end your run-up in the same position every time. When you take your final bound, keep it consistent and controlled. Have you tried snapping your wrist when you release the ball? This can add some heat to your yorker. [11] X Research source"
    }
  ]
}