{
  "url": "https://www.wikihow.com/Connect-a-PS4-Controller-to-Steam",
  "title": "How to Connect a PS4 Controller to Steam",
  "steps": [
    {
      "title": "Plug in your PS4 controller to your computer with a USB cable.",
      "content": "Plug in your PS4 controller to your computer with a USB cable. You'll find a USB port on the front of your computer's tower, on the back of an all-in-one, or along the sides of a laptop; you'll find the mini-USB port on the back of the controller."
    },
    {
      "title": "Press the PS button on the controller to turn it on.",
      "content": "Press the PS button on the controller to turn it on. The light on the back of your controller should illuminate when it's on."
    },
    {
      "title": "Open the Steam client.",
      "content": "Open the Steam client. You'll find the gear icon to launch the client in your Start Menu or Applications folder in Finder."
    },
    {
      "title": "Click the Steam tab.",
      "content": "Click the Steam tab. You'll see this in the menu along the top of your screen."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . You'll find this near the bottom of the menu."
    },
    {
      "title": "Click Controller.",
      "content": "Click Controller . You'll see this on the left side of the pop-up window."
    },
    {
      "title": "Click General Controller Settings.",
      "content": "Click General Controller Settings . You'll see this button on the right side of the window and it will bring up another window where your connected controller should be detected."
    },
    {
      "title": "Click to check the box next to \"PS4 Configuration Support.",
      "content": "Click to check the box next to \"PS4 Configuration Support. \" If you're connecting any other controller, you'll see the options to enable them here."
    },
    {
      "title": "Click your controller under \"Detected Controllers.",
      "content": "Click your controller under \"Detected Controllers. \" If you don't see your controller here, check the USB connections between your controller and computer as well as the power status of your controller. Your controller's details will pop up on the right side of the window. [1] X Research source"
    },
    {
      "title": "Click Preferences.",
      "content": "Click Preferences . You can change your controller's name, the light's brightness and color, and the rumble preference."
    },
    {
      "title": "Click Submit.",
      "content": "Click Submit . You'll see this in the bottom left corner of the window. Your PS4 controller will now work for Steam. If you want to configure the controller's buttons more, press the PS button on your controller to pull up a keybinding menu."
    },
    {
      "title": "Enable Bluetooth on your computer.",
      "content": "Enable Bluetooth on your computer. You can do this in Windows by going to the Start Menu, clicking the gear icon > Devices , and then clicking to turn on the switch next to Bluetooth . On a Mac, click the Bluetooth icon that's in the menu bar and click to turn it on."
    },
    {
      "title": "Press and hold the PS and Share buttons on your controller.",
      "content": "Press and hold the PS and Share buttons on your controller. This will put your controller in pairing mode and make it discoverable by non-PlayStations. You can release the buttons when the light on the back of your controller should pulse rapidly."
    },
    {
      "title": "Click Add Bluetooth or other device on your computer.",
      "content": "Click Add Bluetooth or other device on your computer. You'll see this above the Bluetooth toggle."
    },
    {
      "title": "Click Bluetooth.",
      "content": "Click Bluetooth . Since your PS4 remote is using Bluetooth to connect, you'll want to prompt your computer to find Bluetooth."
    },
    {
      "title": "Click to select your controller from the device list.",
      "content": "Click to select your controller from the device list. When it's done connecting, you'll see the button at the bottom of the window change."
    },
    {
      "title": "Click Done.",
      "content": "Click Done . You'll see this at the bottom of your window."
    },
    {
      "title": "Launch Steam.",
      "content": "Launch Steam. You'll find the gear icon to launch the client in your Start Menu or Applications folder in Finder."
    },
    {
      "title": "Click the Steam tab.",
      "content": "Click the Steam tab. You'll see this in the menu along the top of your screen."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . You'll find this near the bottom of the menu."
    },
    {
      "title": "Click Controller.",
      "content": "Click Controller . You'll see this on the left side of the pop-up window."
    },
    {
      "title": "Click General Controller Settings.",
      "content": "Click General Controller Settings . You'll see this button on the right side of the window and it will bring up another window where your connected controller should be detected."
    },
    {
      "title": "Click to check the box next to \"PS4 Configuration Support.",
      "content": "Click to check the box next to \"PS4 Configuration Support. \" If you're connecting any other controller, you'll see the options to enable them here."
    },
    {
      "title": "Click your controller under \"Detected Controllers.",
      "content": "Click your controller under \"Detected Controllers. \" If you don't see your controller here, check the USB connections between your controller and computer as well as the power status of your controller. Your controller's details will pop up on the right side of the window. [2] X Research source"
    },
    {
      "title": "Click Preferences.",
      "content": "Click Preferences . You can change your controller's name, the light's brightness and color, and the rumble preference."
    },
    {
      "title": "Click Submit.",
      "content": "Click Submit . You'll see this in the bottom left corner of the window. Your PS4 controller will now work for Steam. If you want to configure the controller's buttons more, press the PS button on your controller to pull up a keybinding menu. [3] X Research source"
    }
  ]
}