{
  "url": "https://www.wikihow.com/Change-the-Screen-Resolution-on-a-PC",
  "title": "6 Quick Ways to Change the Screen Resolution on a PC",
  "steps": [
    {
      "title": "Right-click the desktop and select Display settings.",
      "content": "Right-click the desktop and select Display settings . This will be in the middle of the menu."
    },
    {
      "title": "Click the drop-down menu next to \"Display resolution\".",
      "content": "Click the drop-down menu next to \"Display resolution\". This will be under the Scale & layout header. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you have dual monitors , select a monitor underneath Display first."
    },
    {
      "title": "Select a new resolution.",
      "content": "Select a new resolution. Picking the proper resolution can fit your screen to your monitor and even make images more crisp. [2] X Research source This could also improve gaming performance . When a new resolution is selected, a prompt will appear."
    },
    {
      "title": "Click Keep changes.",
      "content": "Click Keep changes . This will set your new resolution. If you don't like the new resolution, click Revert or wait the specified time for Windows to automatically revert to the last setting. [3] X Research source"
    },
    {
      "title": "Right-click the desktop and select Display settings.",
      "content": "Right-click the desktop and select Display settings . It's toward the bottom of the menu. You can change your screen resolution to maximize your monitor's potential. [4] X Research source"
    },
    {
      "title": "Click the drop-down menu next to \"Display resolution\".",
      "content": "Click the drop-down menu next to \"Display resolution\". This will be underneath the Scale and layout header."
    },
    {
      "title": "Select a new resolution.",
      "content": "Select a new resolution. Once selected, a prompt will appear."
    },
    {
      "title": "Click Keep changes.",
      "content": "Click Keep changes . This will set your new resolution. If you don't like the new resolution, click Revert or wait the specified time for Windows to automatically revert to the last setting. [5] X Research source"
    },
    {
      "title": "Right-click the desktop and select Screen resolution.",
      "content": "Right-click the desktop and select Screen resolution . It's toward the bottom of the right-click menu."
    },
    {
      "title": "Click the \"Resolution\" drop-down menu.",
      "content": "Click the \"Resolution\" drop-down menu. This opens a slider with different resolution values. On Windows 7, you may have a vertical slider here that allows you to click and drag a MacButton up or down to increase or decrease the resolution."
    },
    {
      "title": "Click a resolution value.",
      "content": "Click a resolution value. The resolution best-suited to your computer's screen will say (Recommended) next to it. The higher the resolution number is, the smaller your computer's text and icons will appear."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . It's at the bottom of the window. Doing so will prompt you to confirm your choice."
    },
    {
      "title": "Click Keep changes when prompted.",
      "content": "Click Keep changes when prompted. Doing so will save your resolution settings. If you don't like the new resolution settings, you can click Revert or simply wait a few seconds for your computer's resolution to revert to your computer's default."
    },
    {
      "title": "Right-click the desktop and select Personalize.",
      "content": "Right-click the desktop and select Personalize . It's toward the bottom of the right-click menu."
    },
    {
      "title": "Click Display Settings.",
      "content": "Click Display Settings . This link is at the bottom of the \"Personalize\" window."
    },
    {
      "title": "Click and drag the \"Resolution\" slider left or right.",
      "content": "Click and drag the \"Resolution\" slider left or right. It's near the bottom of the \"Display Settings\" window. Dragging the slider to the left will decrease your screen resolution, while dragging it to the right will increase the resolution. Raising your resolution will make things smaller, while lowering the resolution will make things larger. If you are having difficulty seeing things on your computer, try lowering your resolution. If you want the clearest picture possible, raise the resolution to the size recommended for your display."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . It's at the bottom of the window. Doing so will prompt you to confirm your choice."
    },
    {
      "title": "Click Yes when prompted.",
      "content": "Click Yes when prompted. Doing so will save your resolution settings."
    },
    {
      "title": "Right-click anywhere on the desktop and select Properties.",
      "content": "Right-click anywhere on the desktop and select Properties . It's at the bottom of the menu. This will open the \"Display Properties\" window. If \"Display Properties\" doesn't open to the Settings tab, click it at the top of the window."
    },
    {
      "title": "Click and drag the \"Resolution\" slider left or right.",
      "content": "Click and drag the \"Resolution\" slider left or right. It's near the bottom of the \"Display Settings\" window. Dragging the slider to the left will decrease your screen resolution, while dragging it to the right will increase the resolution. Raising your resolution will make things smaller, while lowering the resolution will make things larger. If you are having difficulty seeing things on your computer, try lowering your resolution. If you want the clearest picture possible, raise the resolution to the size recommended for your display."
    },
    {
      "title": "Click Apply and then Yes.",
      "content": "Click Apply and then Yes . Doing this will save your resolution settings. If you don't like the new resolution settings, wait for a few seconds; the screen will revert to the old settings. Click OK to close the \"Display Properties\" window. Your new resolution will be saved."
    },
    {
      "title": "Right-click on an empty part of the desktop.",
      "content": "Right-click on an empty part of the desktop. There should be a pop-up menu that appears."
    },
    {
      "title": "Scroll over to View.",
      "content": "Scroll over to View. A list of sizes will expand."
    },
    {
      "title": "Select how big you want your icons to be.",
      "content": "Select how big you want your icons to be."
    }
  ]
}