{
  "url": "https://www.wikihow.com/Configure-a-Computer-to-Multi-Boot-Operating-Systems",
  "title": "How to Configure a Computer to Multi Boot Operating Systems",
  "steps": [
    {
      "title": "Install an operating system first to partition your drive.",
      "content": "Install an operating system first to partition your drive. Alternatively, you can put your hard drive into another Windows computer and partition it using that. Open the Start menu and type diskmgmt.msc . Then press ↵ Enter ."
    },
    {
      "title": "Wait for a window to appear like this.",
      "content": "Wait for a window to appear like this. Assuming your primary hard drive is mapped C:\\, right click it and click \"Shrink Volume\". Wait for another dialogue to open."
    },
    {
      "title": "Enter the amount to shrink the hard drive by, in megabytes.",
      "content": "Enter the amount to shrink the hard drive by, in megabytes. (For example, if you had a terabyte hard drive and you wanted to make a 500GB partition later you would shrink your hard drive by 514400 MB). Once you have entered the amount to shrink buy press ↵ Enter ."
    },
    {
      "title": "Make sure you see a new \"block\" that says \"unallocated space\" with the size of the space.",
      "content": "Make sure you see a new \"block\" that says \"unallocated space\" with the size of the space. Right click on this space and click \"New Simple Volume\". A window should then pop up that looks like this."
    },
    {
      "title": "Click Next.",
      "content": "Click Next ."
    },
    {
      "title": "If you want to set a custom drive mapping then you can select it from the drop down list; otherwise click Next.",
      "content": "If you want to set a custom drive mapping then you can select it from the drop down list; otherwise click Next ."
    },
    {
      "title": "Assign your partition a name if you want.",
      "content": "Assign your partition a name if you want. For example, you could use Windows 10 Technical Preview. If you don't want to then make sure the checkbox Perform a quick format has a tick in it then click Next ."
    },
    {
      "title": "Click Finish.",
      "content": "Click Finish . Repeat the partitioning process once for each operating system you want to multi-boot. (If your hard drive has less that 500GB capacity, it's best to install 4 OSs maximum and if your hard drive is less than 100GB, it's best to avoid this process altogether.)"
    },
    {
      "title": "Close the autoplay, if you see it.",
      "content": "Close the autoplay, if you see it. Now that that's done you might get an autoplay window that looks like this. If you do just close it; we don't need to do anything else to the partition now."
    },
    {
      "title": "Wrap up the partitioning process.",
      "content": "Wrap up the partitioning process. We have now finished with all we need to do within Windows. Insert the boot media and power down your PC or if you partitioned the hard drive with another computer, turn it off, remove the hard drive, turn off the target computer and insert the partitioned hard drive into the target computer."
    },
    {
      "title": "Prepare to install your OSs.",
      "content": "Prepare to install your OSs. If you are installing via USB then insert it into the target machine and move onto the next step. If you are installing via a CD/DVD then power on your computer, insert the CD/DVD into the drive, then hold the power button for 6–8 seconds until the computer turns off."
    },
    {
      "title": "Install your first operating system.",
      "content": "Install your first operating system. Take the normal approach to this, but when you are presented with the screen that asks you where you want to install it only select one. (You may see something called \"Disk 0 Partition 1: System Reserved. Ignore this and install to one of the other partitions.)"
    },
    {
      "title": "Install the second operating system.",
      "content": "Install the second operating system. When your first operating system has installed, remove the first install source, insert the second one, power down your computer and boot from your boot media. When you install your second operating system make sure to install to a different partition to the one you installed the first OS on or the multi boot will not work."
    },
    {
      "title": "Remove the boot media and shut your computer down.",
      "content": "Remove the boot media and shut your computer down. If you don't remove your install source then the computer may try to boot from it again."
    },
    {
      "title": "Power your computer up.",
      "content": "Power your computer up."
    },
    {
      "title": "Choose the operating system you want to boot from.",
      "content": "Choose the operating system you want to boot from. Both should be listed there. Then you have configured multi boot correctly!"
    }
  ]
}