{
  "url": "https://www.wikihow.com/Boil-Artichokes",
  "title": "How to Boil Artichokes",
  "steps": [
    {
      "title": "Rinse the artichokes in cold water.",
      "content": "Rinse the artichokes in cold water. Washing an artichoke should be done right before cooking, not before storing. Washing an artichoke before storing can make it spoil faster. Store fresh, unwashed artichokes in a plastic bag in the refrigerator for up to a week. Keep an eye on them, and if leaves start to spread, cook them immediately."
    },
    {
      "title": "Slice the stems off of the artichokes.",
      "content": "Slice the stems off of the artichokes. Use a very sharp knife to either slice the whole stem off at the base, or keep most of the stem but just cut the end off. If you don’t have a really sharp knife, use a serrated knife. The artichoke’s stem is edible, so you can simply cut the very end off of it and then cook and eat it with the rest of artichoke."
    },
    {
      "title": "Cut the tops off of the artichokes.",
      "content": "Cut the tops off of the artichokes. Only remove the top inch of each artichoke, slicing evenly across. Be careful not to cut too far down, or you’ll risk losing some of the best edible parts of the artichoke. Rub the cut parts of each artichoke with a lemon. Be sure to use lemon on all the cut tops and bottoms to prevent browning."
    },
    {
      "title": "Snip the tops off of the outer leaves.",
      "content": "Snip the tops off of the outer leaves. Use sharp kitchen scissors to remove the top 1/2 inch of each leaf. Only remove the spiny, pointed tops from the leaves. Once you've snipped the leaves, rub each one with more lemon. [1] X Research source"
    },
    {
      "title": "Fill a pot half full with water and bring it to a boil.",
      "content": "Fill a pot half full with water and bring it to a boil. Set the stove on high heat and salt the water liberally. Setting the stove on high heat encourages the water to boil faster. Salting the cooking water helps to flavor the artichokes while they boil."
    },
    {
      "title": "Add the artichokes to the boiling water.",
      "content": "Add the artichokes to the boiling water. Place them in the pot and then let the water come back up to a boil. Adding the artichokes will cool the water temporarily and slow the boiling, so let water come back up to a boil for just a moment."
    },
    {
      "title": "Lower the heat to a simmer.",
      "content": "Lower the heat to a simmer. Cover the artichokes and leave them to cook for 20-30 minutes. If you cut the whole stem off of each artichoke, you'll need to weigh the artichokes down in the pot. To weight the artichokes down, use a small lid or an inverted plate that fits inside of the pot. This will keep the artichokes from bobbing up out of the water and cooking improperly. [2] X Research source"
    },
    {
      "title": "Test the tenderness of the artichokes.",
      "content": "Test the tenderness of the artichokes. They are ready when you can easily remove a leaf from the middle.Use a fork or the point of your knife to remove the center leaf. [3] X Research source Be careful when testing the artichokes, as they have been sitting in hot water and can burn you. You can also check for tenderness by poking the base of an artichoke with your knife. [4] X Research source"
    },
    {
      "title": "Remove the artichokes from the water.",
      "content": "Remove the artichokes from the water. Once they’ve been removed, drain them in a colander and plate them for serving. Season the artichokes however you wish. Peel the leaves off to eat one by one, or cut the artichoke heart out. Serve the artichoke leaves and hearts with a delicious drawn butter or a flavorful sauce."
    },
    {
      "title": "Select an artichoke at right time of year.",
      "content": "Select an artichoke at right time of year. Artichokes are at their best in Spring. The peak season for artichokes is from March to May, so you’ll find the freshest ones in those three months. [5] X Research source Look for the right coloring. A fresh artichoke will be a nice, deep green shade. [6] X Research source A few brown spots are okay, but the artichoke should generally look very fresh and green."
    },
    {
      "title": "Check the leaves.",
      "content": "Check the leaves. A good artichoke should have tight, vibrant green leaves. Loose or dry leaves mean that the artichoke isn’t in the best shape. Squeeze the leaves against each other, and they should make a squeaking sound if the artichoke is good."
    },
    {
      "title": "Feel the weight and shape of the artichoke.",
      "content": "Feel the weight and shape of the artichoke. It should feel plump and a bit heavier than it looks. A smaller artichoke will be more tender than a larger one, while a rounder artichoke will have a bigger heart than a more narrow one. [7] X Research source"
    }
  ]
}