{
  "url": "https://www.wikihow.com/Complete-a-Canadian-GST-Return",
  "title": "How to Complete a Canadian GST Return",
  "steps": [
    {
      "title": "Learn your province's tax rates.",
      "content": "Learn your province's tax rates. Each province sets its own tax rate for the GST/HST. Knowing which provincial tax applies to your goods or services will help you determine your GST/HST return. As of April 1, 2013, the following tax rates apply to each of the following provinces: Alberta charges a five percent tax rate. [4] X Research source British Columbia charges a five percent tax rate. [5] X Research source Manitoba charges a five percent tax rate. [6] X Research source New Brunswick charges a 15 percent tax rate. [7] X Research source Newfoundland and Labrador charge a 15 percent tax rate. [8] X Research source The Northwest Territories charge a five percent tax rate. [9] X Research source Nova Scotia charges a 15 percent tax rate. [10] X Research source Nunavut charges a five percent tax rate. [11] X Research source Ontario charges a 13 percent tax rate. [12] X Research source Quebec charges a five percent tax rate. [13] X Research source Prince Edward Island charges a 15 percent tax rate. [14] X Research source Saskatchewan charges a five percent tax rate. [15] X Research source Yukon charges a five percent tax rate. [16] X Research source"
    },
    {
      "title": "Determine whether your goods or services are taxable.",
      "content": "Determine whether your goods or services are taxable. Some goods sold in Canada are taxed at a rate of zero percent; these are called zero-rated supplies. Other goods and properties are exempt from the GST/HST. Knowing whether the goods and/or properties related to your business are taxable will help you determine your tax return for the fiscal year. Basic groceries (including milk, bread, and vegetables) are zero-rated goods. [17] X Research source Agricultural products, including grains and raw wool material, are zero-rated goods. [18] X Research source Most types of farm livestock and fishery products meant for human consumption are zero-rated goods. [19] X Research source Prescription medications and the drug-dispensing fees associated with medications are zero-rated goods and services. [20] X Research source Medical devices, including some prosthetics, are zero-rated goods. [21] X Research source Previously-inhabited residential housing is exempt from the GST/HST. [22] X Research source Residential accommodations lasting one month or longer, as well as residential condo fees, are exempt from the GST/HST. [23] X Research source The majority of health-related medical or dental services are exempt from the GST/HST. [24] X Research source Day-care services for children 14 years old or younger are exempt. [25] X Research source Tolls charged for use of bridges, toll roads, and ferries are exempt. However, ferry tolls that travel to or from a place outside of Canada are taxed at zero percent, making them zero-rated services. [26] X Research source Legal aid is exempt. [27] X Research source Certain educational services, including vocational or trade courses, music lessons, and tutoring services, are exempt. [28] X Research source Many services rendered by a financial institution, including loan or mortgage arrangements, are exempt. [29] X Research source The arrangement and issuance of insurance policies are exempt services. [30] X Research source Public services, including municipal transit services and residential water distribution, are exempt. [31] X Research source"
    },
    {
      "title": "Determine the tax rate for your goods and services.",
      "content": "Determine the tax rate for your goods and services. The following goods and services are taxable at a rate of 5%, 12%, 13%, 14%, or 15%, depending on the province in which business is being conducted: new housing sales [32] X Research source commercial property rentals and sales [33] X Research source automobile sales and leases [34] X Research source auto repair services [35] X Research source soft drinks and snacks, including candy and chips [36] X Research source clothing and footwear [37] X Research source advertising services, with the exception of services provided to non-residents of Canada who have not registered for the GST/HST [38] X Research source private transportation services, including taxi and limousine transportation [39] X Research source legal and accounting services [40] X Research source franchises [41] X Research source hotel accommodations [42] X Research source hairstylist and barbershop services [43] X Research source"
    },
    {
      "title": "Determine whether you must register for the GST/HST.",
      "content": "Determine whether you must register for the GST/HST. Generally speaking, anyone who provides taxable supplies in Canada must register for the GST/HST. There are, however, a few exceptions. Small suppliers (other than taxi services) are not required to register for the GST/HST. Small suppliers are considered any sole proprietor or partnership making $30,000 or less on taxable supplies (before expenses) per calendar quarter over the last four consecutive calendar quarters, or any public service body making $50,000 or less on taxable supplies from all activities of the organization per calendar quarter over the last four consecutive calendar quarters. [44] X Research source Suppliers whose only commercial activity involves the sale of real estate property are not required to register for the GST/HST. (Note that these suppliers may still be required to charge and collect any applicable taxes on the sale of property.) [45] X Research source Non-residents who do not conduct business in Canada are not required to register for the GST/HST. [46] X Research source Note that even small suppliers and public service bodies must register for the GST/HST in any calendar quarter that they surpass the threshold amount of $30,000 or $50,000 and must collect the applicable taxes on any supplies that exceed that threshold amount. These suppliers must register for the GST/HST within 29 days of the date supplies exceeded the threshold amount. [47] X Research source"
    },
    {
      "title": "Acquire a Business Number.",
      "content": "Acquire a Business Number. Before a supplier can register for a GST/HST account, that supplier must be assigned a Business Number (BN). That number will be used in all future interactions with the Canada Revenue Agency (CRA). [48] X Research source Suppliers and business owners can set up a BN by completing the CRA's Form RC1 (Request for a Business Number), or by going online to www.businessregistration.gc.ca. Suppliers without internet access may complete the process by calling 1-800-959-5525. [49] X Research source Note that in the case of partnerships, only the collective partnership is required to register for the GST/HST, not the individual partners. [50] X Research source"
    },
    {
      "title": "Register for a GST/HST account.",
      "content": "Register for a GST/HST account. Once you have a business number, you can register for the GST/HST. This can be done online at www.businessregistration.gc.ca, or by calling 1-800-959-5525. [51] X Research source"
    },
    {
      "title": "Receive an annual reporting period.",
      "content": "Receive an annual reporting period. Once a supplier or business has registered for the GST/HST, that supplier will be assigned an annual reporting period by the CRA. However, suppliers do have the option of filing returns more frequently than the assigned reporting period. [52] X Research source Suppliers earning on annual taxable supplies of $1,500,000 or less MUST report annually, but have the option of reporting monthly or quarterly. [53] X Research source Suppliers earning on annual taxable supplies between $1,500,000 and $6,000,000 MUST report quarterly, but have the option of reporting monthly. [54] X Research source Suppliers earning on annual taxable supplies in excess of $6,000,000 MUST report monthly. There is no option for more frequent filing returns for suppliers in this earnings bracket. [55] X Research source Suppliers wishing to change their assigned reporting period may do so by logging into the CRA website at www.cra.gc.ca/mybusinessaccount, or by visiting www.cra.gc.ca/representatives. A supplier may also change his assigned reporting period by completing and returning Form GST20 (Election for GST/HST Reporting Period). [56] X Research source"
    },
    {
      "title": "Choose an accounting method.",
      "content": "Choose an accounting method. Under most circumstances, you’ll calculate the GST/HST tax owed using the standard method, as set out in the GST/HST return form. However, the CRA also provides two easier accounting methods for certain businesses: The Quick Method is available to suppliers when worldwide taxable annual supplies (including zero-rated supplies and supplies of all associates) total $200,000 or less (including GST/HST) in any four consecutive fiscal quarters over the past five fiscal quarters. Suppliers using this method multiply all total supplies (with GST/HST included) for a given reporting period by the Quick Method remittance rate that is assigned to those supplies. The Simplified Method is used to claim an income tax credit (ITC). It is available to suppliers who have registered for the GST/HST, and whose annual worldwide taxable revenues from supplies of goods and services (for the supplier plus his or her associates) total $500,000 or less in the last fiscal year, as well as the previous fiscal quarters of the current fiscal year. Suppliers using the simplified method are not required to show the GST/HST separately from that reporting period's total purchases, but suppliers must still calculate the taxable purchases that are claimed in an ITC."
    },
    {
      "title": "Obtain the appropriate forms.",
      "content": "Obtain the appropriate forms. If you electronically filed your last GST/HST return, the CRA will mail you an electronic filing information sheet (Form GST34-3: Goods and Services Tax/Harmonized Sales Tax Return for Registrants). If you didn’t file electronically, the CRA will mail you a personalized four-page return (Form GST34-2). The first page of both forms will contain a four-digit access code, printed for electronic filing. [57] X Research source If you don’t receive either form, or if you’ve lost yours, you can get one by calling 1-800-959-5525 and requesting a new Form GST34-2. [58] X Research source"
    },
    {
      "title": "Consider filing electronically.",
      "content": "Consider filing electronically. Registrants can file online to save time and have access to instant documents. Some registrants are actually required to file electronically, specifically certain types of builders, suppliers with more than $1.5 million in annual taxable supplies, and anyone required to report recaptured input tax credits (RITCs). There are four ways of electronically filing a GST/HST return: GST/HST NETFILE is a free filing service, available online to all registrants across Canada, with the exception of accounts administered by Revenu Quebec. Registrants using NETFILE will use the four-digit access code printed on the registrant's personalized return to file online at www.cra.gc.ca/gsthst-netfile. [59] X Research source GST/HST TELEFILE is a filing service that allows eligible registrants to file their returns on a touch-tone telephone. Registrants using TELEFILE call the toll-free number at 1-800-959-2038, and use the touch-tone telephone to input the necessary GST/HST information. [60] X Research source Electronic data interchange (EDI) is the filing of GST/HST returns through a participating financial institution. Registrants using EDI to file for returns will not need an access code. Interested registrants can find out more about EDI through the CRA's website at www.cra.gc.ca/gsthst-edi, or by speaking with a representative at a participating financial institution. [61] X Research source GST/HST Internet file transfer (GIFT) allows eligible registrants to file returns using third-party, CRA-certified accounting software. Interested registrants can find out more information about GIFT filings at www.cra.gc.ca/gsthst-internetfiletrans. [62] X Research source"
    },
    {
      "title": "Complete the first portion of the working copy section of the return.",
      "content": "Complete the first portion of the working copy section of the return. Be sure to have your BN available. You’ll also need to provide your company name, the reporting period for the return you’re filing, and the return’s due date. [63] X Research source"
    },
    {
      "title": "Enter your total sales and other revenue on Line 101.",
      "content": "Enter your total sales and other revenue on Line 101. Don’t include provincial sales tax, GST or HST. (However, if you’re using the Quick Method of accounting, then you should include the GST or HST.) To determine the amount to include on Line 1, run a profit and loss (P&L) report for the tax period you’re filing for. The figure on the “total income” line of the P&L report is your “sales and other revenue”. Line 101 will be transferred to Part 2."
    },
    {
      "title": "Begin the calculation of your net tax.",
      "content": "Begin the calculation of your net tax. The first part of this section of the return deals with GST/HST you’ve collected. Enter on Line 103 the total of all GST and HST amounts that you collected—or that were collectible by you—in the tax reporting period. On Line 104, enter the total amount of adjustments that need to be added to the net tax for the period. For example, you may not have paid GST/HST on a sales invoice because you couldn’t collect the debt. But now you’ve successfully collected that invoice, so GST/HST is owed. Add Lines 103 and 104, and put that figure on Line 105, which will be transferred to Part 2. [64] X Research source"
    },
    {
      "title": "Enter the GST/HST you paid—or that is payable by you—on qualifying expenses.",
      "content": "Enter the GST/HST you paid—or that is payable by you—on qualifying expenses. This relates to any ITC’s for which you are eligible. On Line 106, enter any ITCs for the current period, and any eligible unclaimed ITCs from a previous period. On Line 107, enter the total amount of adjustments that should be deducted in determining the net tax for the reporting period. For example, you may have paid GST/HST for a sale you made, but you weren’t able to collect the money owed to you from that sale. The tax amount you paid should revert back to you. Add Lines 106 and 107, and insert the total on Line 108. This will be transferred to Part 2. [65] X Research source"
    },
    {
      "title": "Determine your net tax.",
      "content": "Determine your net tax. In order to reach this figure, you simply subtract Line 108 from Line 105. The resulting figure should be entered on Line 109. This amount will also be transferred by you to Part 2 of the GST/HST return. [66] X Research source"
    },
    {
      "title": "Calculate other credits.",
      "content": "Calculate other credits. This section relates to additional credits to which you might be entitled. This won’t necessarily apply to every registrant. Enter any installment and other annual filer payments you made for the particular reporting period. Put this figure on Line 110. This amount will be transferred to Part 2. Enter on Line 111 the total amount of any applicable GST/HST rebates. Rebates relate to various items, such as amounts paid in error, or certain exports by a non-resident. (The rebate form will indicate if the amount is eligible to be included on Line 111.) You’ll also have to attach the rebate form to the return. For information on possible rebate programs, check here . Line 111 will also be transferred to Part 2. Add Lines 110 and 111, and place the total on Line 112. Subtract Line 112 from Line 109, and put that figure on Line 113A. [67] X Research source"
    },
    {
      "title": "Calculate other debits.",
      "content": "Calculate other debits. There may be other amounts for which you’re liable for GST/HST. Again, this may not apply to all filers. On Line 205, enter the total amount of the GST/HST due on the purchase of taxable real property. Complete this line only if you bought taxable real property for use or supply primarily (meaning more than 50%) in your commercial activities, and you’re a GST/HST registrant (other than an individual who purchases a residential complex) or you purchased the property from a non-resident. You’ll be transferring this amount to Part 2. Enter on Line 405 the total amount of other GST/HST to be self-assessed by you. Self-assessment is required on all imported taxable supplies that weren’t detected by Canada’s Customs agency (and thus not taxed at the border), and which won’t be fully offset by any ITC’s you may be entitled to. Line 405 will be transferred to Part 2. Add Lines 205 and 405, and put the total on Line 113B. [68] X Research source"
    },
    {
      "title": "Compute whether you’re due a refund—or if you owe money.",
      "content": "Compute whether you’re due a refund—or if you owe money. You calculate this by adding Lines 113A and 113B, and placing the resulting figure on Line 113C. If number is negative, you get a return. If it’s positive, you owe money. If you’re due a refund, put the figure on Line 114 - refund claimed. This will be transferred to Part 2. If you owe money to the CRA, put the figure on Line 115 - payment due. You’ll transfer this amount to Part 2. [69] X Research source"
    },
    {
      "title": "Transfer all the applicable figures from Part 1 to Part 2 of the actual return—then file.",
      "content": "Transfer all the applicable figures from Part 1 to Part 2 of the actual return—then file. GST/HST paper returns can be filed by mail (at the address listed on the return) or—if you’re making a payment—at your financial institution. Note, however, that it’s mandatory for many registrants to file electronically. Check the page to see the requirements for electronic filing. Most GST/HST registrants are now eligible to electronically file their GST34 returns—and remit amounts owed—even if it’s not required."
    }
  ]
}