{
  "url": "https://www.wikihow.com/Build-a-Bicycle-Cargo-Trailer",
  "title": "How to Build a Bicycle Cargo Trailer",
  "steps": [
    {
      "title": "Sketch a plan of the trailer with measurements.",
      "content": "Sketch a plan of the trailer with measurements. Think about what you plan to carry and how big the trailer needs to be to carry it. Draw a sketch of the outline of the trailer and write down the length and width. [1] X Research source You will need to have a pair of matching bicycle wheels for the trailer already so you can use them to space the side pieces of the frame after you cut all the pieces to size. For example, if you have a bin of some kind that you want to be able to tow, you can measure the bin and make the trailer at least large enough to hold it. If you want to haul a plastic tub that is 24 in (61 cm) by 18 in (46 cm) big, you could make the trailer about 26 in (66 cm) long by 20 in (51 cm) wide. An example of dimensions you can use if you don’t have a specific size in mind is 32 in (81 cm) long by 22 in (56 cm) wide. This will give you a manageable trailer with plenty of room to haul stuff like groceries or tools."
    },
    {
      "title": "Cut 6 1 in (2.5 cm) by 2 in (5.1 cm) pieces of lumber for the frame.",
      "content": "Cut 6 1 in (2.5 cm) by 2 in (5.1 cm) pieces of lumber for the frame. Use a power saw or hand saw to cut 2 1 in (2.5 cm) by 2 in (5.1 cm) pieces of lumber to the width you want the trailer to be for the front and back of the frame. Cut 4 more 1 in (2.5 cm) by 2 in (5.1 cm) pieces of lumber to the length you want the trailer to be for the sides of the frame, minus 2 in (5.1 cm) to account for the front and back pieces that will cap the side pieces. [2] X Research source If you don’t have the tools to cut the lumber yourself, get it pre-cut for you at a home improvement center or lumber yard. Note that you need 4 long pieces for the sides of the frame because the wheels will fit between them."
    },
    {
      "title": "Lay out the frame on the ground or a large flat work surface.",
      "content": "Lay out the frame on the ground or a large flat work surface. Position 2 of the side pieces along with the front and back pieces in a square or rectangle. Place the other 2 side pieces inside the outer frame, parallel to the first 2 side pieces. Space the side pieces so that the bicycle wheels you have fit between them with the axles of the wheels above the wood. [3] X Research source Use any 2 bicycle wheels of the same size for the trailer. Try to find used wheels rather than buying new ones. You can check local thrift shops or used bicycle stores if you don’t already have a pair of wheels."
    },
    {
      "title": "Attach the frame pieces together using 90-degree metal brackets and screws.",
      "content": "Attach the frame pieces together using 90-degree metal brackets and screws. Place a 90-degree metal bracket in each corner where 2 pieces of lumber meet, on the inside of the frame. Use an electric drill to drive 0.5–0.75 in (1.3–1.9 cm) wood screws through the holes in the brackets into the wood of the frame. [4] X Research source Use metal brackets that have at least 4 screw holes in them for more stability. This also applies to where the inner side pieces of the frame meet the front and back of the frame. You will need 12 brackets in total; 4 for the outer corners and 8 to hold the inner side pieces of the frame in place."
    },
    {
      "title": "Cover the frame with plywood.",
      "content": "Cover the frame with plywood. Cut a piece of 0.25 in (0.64 cm) thick plywood to the size of the frame. Use a jigsaw or reciprocating saw to make cutouts on each side that are big enough for the wheels to fit through. Attach the plywood to the frame by driving 1.5–2 in (3.8–5.1 cm) wood screws through the plywood into the pieces of lumber below it every 6 in (15 cm) or so. [5] X Research source It’s best not to use plywood any thicker than 0.25 in (0.64 cm) or you will end up adding a lot of weight to the trailer. The plywood creates a bed on the frame of the trailer that you can set things on to haul them. You can use ropes or bungee cords to secure items or put some kind of bin on the trailer bed to hold things. Again, if you don’t have the tools to cut the plywood yourself, just provide the measurements to the staff at a home improvement center or lumber yard and have them cut the trailer bed for you."
    },
    {
      "title": "Bend 4 electrical box plate covers to fit on top of the frame’s side pieces.",
      "content": "Bend 4 electrical box plate covers to fit on top of the frame’s side pieces. Place 1 in (2.5 cm) of the short side of an electrical box plate cover into a vice. Hit the exposed metal with a rubber mallet until it is flat against the top of the vise so it’s bent at a 90-degree angle. Repeat this for 3 more electrical box plate covers. [6] X Research source Electrical box plate covers are thin, flat pieces of metal that are normally used to cover electrical boxes. They work well for this because they are easy to bend and work with. You can purchase them at a home improvement center or online. Once the wheels are bolted to the plates, the plates will be attached by screwing them to the plywood deck and into the innermost side pieces of the frame, so the wheels are held in place and sticking up through the gaps in the plywood deck of the trailer."
    },
    {
      "title": "Drill axle holes 0.5 in (1.3 cm) up from the bottom edge of each plate.",
      "content": "Drill axle holes 0.5 in (1.3 cm) up from the bottom edge of each plate. Measure 0.5 in (1.3 cm) up from the bottom edge, then measure an even distance towards the center from each side and make a mark. Use an electric drill with a metal drill bit that is the same size as the wheels’ axles to drill a hole in each plate. [7] X Research source Standard electrical box plate covers are at least 4.5 in (11 cm) long, so drilling the holes 0.5 in (1.3 cm) up from the bottom will ensure that the axles have plenty of clearance between them and the wood of the frame."
    },
    {
      "title": "Drill screw holes in the metal plates to attach them to the frame.",
      "content": "Drill screw holes in the metal plates to attach them to the frame. Use a metal drill bit the size of your wood screws to drill 2 holes in the bent part of each metal plate. Drill 2 holes, offset from the 2 holes at the top, in the side of each metal plate. [8] X Research source The exact positioning of the holes doesn’t matter, so don’t worry about measuring them. Just make sure to offset the side holes enough from the top holes so the screws don’t intersect in the wood."
    },
    {
      "title": "Bolt the metal plates onto the wheels.",
      "content": "Bolt the metal plates onto the wheels. Slide a metal plate onto each side of the wheels’ axles using the holes you drilled for the axles. Secure the wheels in place on the metal plates by twisting the wheel nuts onto the ends of the axles. [9] X Research source If your wheels don’t have nuts, you can order some bicycle wheel nuts online or buy some at a bike shop."
    },
    {
      "title": "Screw the metal plate brackets into place on the side pieces of the frame.",
      "content": "Screw the metal plate brackets into place on the side pieces of the frame. Position the brackets on top of the frame with the wheels sticking through the gaps in the plywood trailer bed. Drive 0.5–0.75 in (1.3–1.9 cm) wood screws through the screw holes you drilled in the plates to attach them to the frame. [10] X Research source It’s easiest to do this if you set the trailer on top of something to raise it up so the wheels clear the ground when you position them. You can use something like cinder blocks or bricks to do this."
    },
    {
      "title": "Purchase a bicycle trailer arm and hitch.",
      "content": "Purchase a bicycle trailer arm and hitch. Browse bike shops or search online for kits that come with the two parts or look for a separate arm and hitch that are compatible. Buy the parts and take them home or order them online ad wait for them to arrive. [11] X Research source This can cost anywhere from about $30-$100 USD if you purchase the parts online."
    },
    {
      "title": "Attach the trailer hitch to the rear left wheel hub of your bike.",
      "content": "Attach the trailer hitch to the rear left wheel hub of your bike. Remove the nut from the left side of the rear wheel hub on your bicycle. Slide the hitch onto the end of the wheel’s axle, where you just removed the wheel nut from, then reattach the nut to hold everything in place. [12] X Research source This applies to side-mounted trailer hitches that go on the rear wheel hub on the left side of the bike. There are also some trailer hitch and arm kits that attach higher up to the rear seat post that you can try if you prefer."
    },
    {
      "title": "Screw the trailer arm onto the left side of the trailer.",
      "content": "Screw the trailer arm onto the left side of the trailer. Position the arm on the left side of the trailer, against the outer piece of the frame, as far forward as the screw holes will let you put it. Attach it to the frame by driving the provided screws through the holes into the wood of the frame using an electric drill. [13] X Research source Always refer to the manufacturer’s instructions for any special mounting guidelines."
    },
    {
      "title": "Couple the arm and the hitch.",
      "content": "Couple the arm and the hitch. Insert the end of trailer’s arm into the hitch to connect them. Secure the arm in place in the hitch by sliding the pin through the hole in the hitch. Snap any straps in place or tighten any other connecting hardware. [14] X Research source The exact method for coupling the arm and hitch varies depending on the model and brand. Always refer to the manufacturer’s instructions for specific directions about safely securing the trailer to the hitch."
    }
  ]
}