{
  "url": "https://www.wikihow.com/Attach-a-USB-Drive-to-Your-Computer",
  "title": "Attach a USB Drive to Your Computer: How to Use a Thumb Drive",
  "steps": [
    {
      "title": "Power on your drive and your computer.",
      "content": "Power on your drive and your computer. If your USB drive has a power switch or power cord, turn the drive on before connecting it to your PC or Mac. Turn on your computer as well."
    },
    {
      "title": "Attach the USB cord to the drive, if applicable.",
      "content": "Attach the USB cord to the drive, if applicable. Small storage drives will typically have an integrated USB connector, but portable hard drives, solid state drives, and other devices may need a cord. Plug the cord into the device to ready it for connecting to your computer. If you have a small flash drive or pen drive, you typically won't need to attach a cord."
    },
    {
      "title": "Locate the USB ports on your computer.",
      "content": "Locate the USB ports on your computer. Most USB drives have a USB-A connector, which is rectangular. Others have USB-C connectors, which are oval. If you have a laptop, you'll usually find the ports on the sides of the case. On a desktop tower, you'll often find some USB ports on the front panel, and possibly others on the rear side of the case. [1] X Research source If you plan on using the device on a permanent basis, use a USB port located on the back of your computer. Front ports are a better option for quickly attaching and removing devices. The ports will have the USB logo next to them, which shows a circle and a 3-pronged arrow. USB-A ports are directional, which means you'll only be able to connect the drive to the port in one direction. They have 4 metal contacts inside. USB-C ports aren’t directional, so they're extra easy to connect."
    },
    {
      "title": "Plug the USB connector or cord into your computer's USB port.",
      "content": "Plug the USB connector or cord into your computer's USB port. The connector should fit easily and snugly into the port. USB-A will only fit in 1 direction, so flip the connector around if the fit seems wrong. For additional info on USB storage on Windows and Mac, check out our guide on ways to use a USB flash drive ."
    },
    {
      "title": "Wait for any drivers to install.",
      "content": "Wait for any drivers to install. If attaching the drive for the first time, your operating system may search for and install the necessary drivers. You will see a prompt after a few seconds that the drivers have been installed and that the device is ready for use. If you already installed drivers manually, you don't need to wait to use the drive. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Disconnect the USB drive when done.",
      "content": "Disconnect the USB drive when done. When you want to disconnect the USB drive, you need to eject or \"unmount\" it first. In Windows, right-click on the drive's icon in File Explorer and select Eject . [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source In macOS, open finder. Then, click the Eject button next to the USB drive’s name. [4] X Research source After ejecting, physically remove the drive by pulling it straight out of the port."
    },
    {
      "title": "Note what to do if you don’t have the correct port.",
      "content": "Note what to do if you don’t have the correct port. Some computers (especially laptops) don’t have a USB port that matches the USB drive. For example, a laptop might have only USB-C ports but most USB drives are USB-A. Here are a couple things to try: Use an adapter. Search for an adapter that can connect the port type on your computer to the plug type on your USB drive. Use a USB docking station. These connect to your computer’s USB port to add additional USB ports in an external dock. Make sure the USB plug matches your computer, and that the dock features the port you need for your USB drive."
    },
    {
      "title": "Install any necessary drivers.",
      "content": "Install any necessary drivers. Typically, the required drivers will automatically download when you insert a USB device for the first time. But sometimes they don’t! If you have the packaging for the USB drive, check the instructions to see if a driver is included for installation. A driver is a piece of software that allows your computer to communicate with the drive. All operating systems are designed to automatically download the required drivers, but if you have no Internet connection, or if the instructions specify to install the driver manually, you should do so. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source The driver will usually be included on a CD if manual installation is necessary. Insert the CD and follow the prompts that appear to install the driver. If this doesn’t solve the issue, you can try repairing the USB flash drive itself."
    }
  ]
}