{
  "url": "https://www.wikihow.com/Contact-PayPal",
  "title": "How to Contact PayPal: 4 Quick Ways to Get Help With Your Account",
  "steps": [
    {
      "title": "Go to https://www.paypal.com/us/cshelp/contact-us in a web browser.",
      "content": "Go to https://www.paypal.com/us/cshelp/contact-us in a web browser. You can also reach this page by clicking Contact at the bottom of any PayPal page."
    },
    {
      "title": "Scroll down to the bottom of the page.",
      "content": "Scroll down to the bottom of the page. The contact options appear under \"Other ways to contact us.\""
    },
    {
      "title": "Click Call us.",
      "content": "Click Call us . It's the phone receiver icon on the right side of the icon row. [2] X Research source"
    },
    {
      "title": "Log in, or continue as a guest.",
      "content": "Log in, or continue as a guest. You can sign in with your PayPal account by clicking Log in . Otherwise, click call us as guest ."
    },
    {
      "title": "Dial the displayed phone number.",
      "content": "Dial the displayed phone number. If you're logged in, you'll see a 6-digit passcode, followed by PayPal's support number in your region. Dial the support phone number and have the passcode ready. If you're calling as a guest, you can simply call the number displayed on your screen (without the passcode). In the US, PayPal's number is 1-888-221-1161. The number will vary depending on which region you live in. The passcode expires after 10 minutes, so place the call right away. [3] X Research source If you wait too long, refresh the page and click Call us again for a new code."
    },
    {
      "title": "Enter the passcode when prompted.",
      "content": "Enter the passcode when prompted. Once the passcode is verified, you'll be transferred to a representative."
    },
    {
      "title": "Go to https://www.paypal.com/us/cshelp/contact-us in a web browser.",
      "content": "Go to https://www.paypal.com/us/cshelp/contact-us in a web browser. You can also reach this page by clicking Contact at the bottom of any PayPal page. It's not possible to send an email to PayPal anymore, but you can send an email-like message to a chat representative. It can take anywhere from a few minutes to a few hours to receive a response. When a representative is ready to chat, you'll be notified via email."
    },
    {
      "title": "Scroll down to the bottom of the page.",
      "content": "Scroll down to the bottom of the page. The online chat option appears under \"Recommended.\""
    },
    {
      "title": "Click Message us to send PayPal a message.",
      "content": "Click Message us to send PayPal a message. This opens the PayPal assistant, which looks like a typical chat window. [4] X Research source If you're not already signed in, click Log-in to do so now."
    },
    {
      "title": "Type How can I talk to someone at PayPal?",
      "content": "Type How can I talk to someone at PayPal? and click the Send button. You may have to send the message multiple times, as the automated chat assistant may try to give you support articles instead."
    },
    {
      "title": "Click Yes.",
      "content": "Click Yes . Now you'll have the chance to type the contents of your message."
    },
    {
      "title": "Describe your issue and click the Send button.",
      "content": "Describe your issue and click the Send button. Your message will be sent to the next available representative. You can safely close the window without interrupting your chat. Just check your email periodically to see if you've received a chat response. When you receive the email notification from PayPal, click the link in the message to chat with the representative who received your message."
    },
    {
      "title": "Send a direct message to @AskPayPal.",
      "content": "Send a direct message to @AskPayPal. If you have a Twitter/X account , it's easy to send a direct message to PayPal. Just go to https://twitter.com/AskPayPal (or search for AskPayPal in the mobile app) and click Send us a private message in their pinned tweet. Messaging on Twitter is a terrific way to send a longer message to PayPal. Your message can be up to 10,000 characters long. Include your PayPal username or email address in the content of your message for quick help."
    },
    {
      "title": "PayPal has a corporate address, though they may not respond to mail.",
      "content": "PayPal has a corporate address, though they may not respond to mail. PayPal's corporate headquarters address is 2211 North First Street, San Jose, California 95131. [5] X Research source"
    }
  ]
}