{
  "url": "https://www.wikihow.com/Activate-Adobe-Products",
  "title": "How to Activate Adobe Products",
  "steps": [
    {
      "title": "Make sure your computer is connected to the internet.",
      "content": "Make sure your computer is connected to the internet. Adobe products are activated online. In order to activate an Adobe product, you need an internet connection and an Adobe ID."
    },
    {
      "title": "Click to launch a Creative Cloud App.",
      "content": "Click to launch a Creative Cloud App. Adobe apps have color coded icons for each app with two letters inside a square. Click the app to launch the app. On Windows, apps can be found in the Windows Start menu. On Mac, open the Finder, click Applications in the sidebar to the left, and click the app. Click here to download an Adobe Product. Click Download Trial below a product. There is a 7-day free trial before you are required to purchase a product."
    },
    {
      "title": "Check your Adobe ID and click Sign in.",
      "content": "Check your Adobe ID and click Sign in . The Sign In button is the blue button in the lower-right corner. Check to make sure that the Adobe ID displayed in bold is the correct. Click the \"Sign In\" button. If there is a valid subscription for the application attached to your Adobe account, the product will be automatically activated. If you do not have a subscription to the Adobe product, click new subscription within the message text. This opens a website in your default web browser that allows you to purchase a subscription plan. If the Adobe ID is not correct, click (Not your Adobe ID?) , below the text in the box and sign in with a different Adobe ID."
    },
    {
      "title": "Click License this product.",
      "content": "Click License this product . It's in the lower-right corner of the Adobe launch window. You need an Adobe ID with a valid subscription to the product in order to activate it. If you do not have an Adobe ID, click the yellow button that says \"Join Now\" to sign up for an Adobe account. If you still have access to a free trial, click Continue Trial to continue to use the product with your trial."
    },
    {
      "title": "Make sure your computer is connected to the internet.",
      "content": "Make sure your computer is connected to the internet. Adobe products are activated online. In order to activate an Adobe product, you need an internet connection and an Adobe ID."
    },
    {
      "title": "Open the Adobe Creative Cloud app.",
      "content": "Open the Adobe Creative Cloud app. The Creative Cloud has a red icon that resembles a C, and a backwards C inside of a cloud. On Windows, apps can be found in the Windows Start menu. On Mac, open the Finder, click Applications in the sidebar to the left, and click the app. Click here to download the Creative Cloud desktop app, or any other Adobe product. The Creative Cloud is the first option at the top of the page. Click Download below the Creative Cloud icon to start the download."
    },
    {
      "title": "Click Sign In, if asked to do so.",
      "content": "Click Sign In , if asked to do so. When you sign in using the Adobe desktop app. Adobe products you have a subscription to are automatically activated. If you are signed in with the incorrect Adobe ID, click your profile picture in the upper-right corner. Then click Sign Out and confirm. Type the email and password associated with your Adobe ID and click Sign In and agree to the license agreement."
    },
    {
      "title": "Click Install next to a product.",
      "content": "Click Install next to a product. Apps that are not installed on your computer have a blue button that says \"Install\" next to them. Allow a few minutes for the app to download and install."
    },
    {
      "title": "Click Launch.",
      "content": "Click Launch . Apps that are already installed on your computer have a white button that says \"Launch\" next to them. This launches the app. [1] X Research source Click Update next to the app if the blue \"Update\" is displayed. Click Launch after the update is finished downloading and installing. Click Try next to a product to begin a free 7-day trial of that product. Click Buy Now if you do not have a subscription to the product you wish to launch."
    },
    {
      "title": "Make sure your computer is connected to the internet.",
      "content": "Make sure your computer is connected to the internet. Adobe products are activated online. In order to activate an Adobe product, you need an internet connection and an Adobe ID."
    },
    {
      "title": "Click to launch an Adobe CS 6 app.",
      "content": "Click to launch an Adobe CS 6 app. Adobe apps have color coded icons for each app with two letters inside a square. Click the app to launch the app. On Windows, apps can be found in the Windows Start menu. On Mac, open the Finder, click Applications in the sidebar to the left, and click the app."
    },
    {
      "title": "Click Sign In Now.",
      "content": "Click Sign In Now . It's the blue button in the lower-right corner of the Adobe launch window."
    },
    {
      "title": "Sign in with your Adobe ID.",
      "content": "Sign in with your Adobe ID. Use the email address and password associated with your Adobe ID to sign in. The product is activated automatically when you sign in with your Adobe ID. If you do not have an Adobe ID, click Create an Adobe ID to sign up for an Adobe account. [2] X Research source"
    },
    {
      "title": "Make sure your computer is connected to the internet.",
      "content": "Make sure your computer is connected to the internet. Adobe products are activated online. In order to activate an Adobe product, you need an internet connection and an Adobe ID."
    },
    {
      "title": "Click to launch an Adobe CS 5 app.",
      "content": "Click to launch an Adobe CS 5 app. Adobe apps have color coded icons for each app with two letters inside a square. Click the app to launch the app. On Windows, apps can be found in the Windows Start menu. On Mac, open the Finder, click Applications in the sidebar to the left, and click the app."
    },
    {
      "title": "Select \"Provide a serial number\".",
      "content": "Select \"Provide a serial number\". It's the radial button next to the first option in the Activation window. If you have a free trial available, select \"Continue to use as a free trial\"."
    },
    {
      "title": "Type your product serial number.",
      "content": "Type your product serial number. The serial number is a 24 digit code with both letters and numbers. Type it in 6 boxes in segments of 4 under \"Provide a serial number\". If the serial number is valid, a green check mark appears at the end of the serial number. If you do not have a serial number, click Buy Now to get a serial number."
    },
    {
      "title": "Click Continue.",
      "content": "Click Continue . It's the button in the lower-right corner of the activation screen. This activates the product and launches it."
    }
  ]
}