{
  "url": "https://www.wikihow.com/Clean-a-Water-Filter",
  "title": "How to Clean a Water Filter",
  "steps": [
    {
      "title": "Shut off the water.",
      "content": "Shut off the water. You'll have a valve on the way to your water filter. That valve needs to be turned, usually so it's running perpendicular to the pipe rather than parallel, but yours may be different. Also, you may need to isolate the water filter globe by turning another valve. [1] X Research source Some filters will need to be depressurized. You press a button on top. Use a rag to catch the spillover."
    },
    {
      "title": "Take the filter out.",
      "content": "Take the filter out. You can have several different types of filters. Most paper filters cannot be cleaned, but you can clean synthetic fiber pleated filters and carbon-based filters. [2] X Research source With a synthetic pleated filter, you'll likely be turning the clear housing with a wrench (designed for the housing) to remove it and the filter from the system. [3] X Research source You might also have an opaque housing system that also unscrews from the top. Have a bucket underneath to catch any spills. Dump the water from the housing down the sink or outside."
    },
    {
      "title": "Remove the plastic netting on some filters.",
      "content": "Remove the plastic netting on some filters. Some filters (particularly carbon-based ones) have a plastic netting to help keep the paper part of the filter in place. To clean the filter, you need to remove that netting. Use a box cutter to slice around the edge of the netting at the top, just under the first ring. Do the same at the bottom. Also, cut through the paper underneath, going down to the carbon. However, while you want to cut the netting completely off, leave a small strip of the paper attached to make it easier to keep track of. [4] X Research source"
    },
    {
      "title": "Hose the filter down.",
      "content": "Hose the filter down. The best way to begin cleaning any filter is to hose off the excess gunk first. With a pleated filter, you can set it in a sink or outside and use a strong spray of water to get as much of the junk off as you can. [5] X Research source With the carbon filter, unroll the paper. Spray down both sides of the paper and the carbon underneath, making sure you don't lose any parts. [6] X Research source"
    },
    {
      "title": "Soak the filter.",
      "content": "Soak the filter. For the pleated filter, shake out as much water as you can, and place it back in the housing. Pour in oxalic acid, and let it sit until clean, about 20 minutes or so. [7] X Research source For the carbon-based filter, mix up a tablespoon of bleach in a gallon of water. Use a soft-bristled brush to scrub down the paper, then let the whole filter soak in the bleach solution for 5 to 10 minutes. [8] X Research source To make the oxalic acid, mix 62.5 grams of powdered oxalic acid per gallon of water, which you can find online. [9] X Research source"
    },
    {
      "title": "Rinse the pleated filter thoroughly.",
      "content": "Rinse the pleated filter thoroughly. Once the pleated filter is clean, take it out to rinse. You can either save the acid or neutralize it with a couple of tablespoons of baking soda before dumping it. Once you remove the acid from the housing, also rinse it with clean water. Use the housing to vigorously dunk the filter in clean water for a few minutes before dumping it again and rinsing it one more time. [10] X Research source"
    },
    {
      "title": "Prepare the filter.",
      "content": "Prepare the filter. Before placing the pleated filter in the housing, you can add 1/2 an ounce of bleach to a small cup, and fill the rest with water. Pour it in the housing. This step helps clean some of the bacteria in the system. [11] X Research source For the carbon filter, roll the paper back around the carbon as tightly as you can. Use zip ties to hold it in place. Place one each on the top and bottom (just under the plastic rings) and a couple in the middle. [12] X Research source"
    },
    {
      "title": "Insert the filter back in the housing.",
      "content": "Insert the filter back in the housing. As you place the filter back, make sure it's centered. Screw the housing back into the main part of the filtering system. If you have clear housing, burp the air bubble by turning on the water to the filter before turning the valve to the house. Let it fill up with water, then use the pressure button to release the air at the top. Then you can turn the other valve to release the water to the household. [13] X Research source If you do use bleach, use the valve bypass to push the water directly into your pipes. Then you can run the bleach out by turning on a hot water faucet in your house, followed by a few minutes on the cold water side. [14] X Research source"
    },
    {
      "title": "Back flush your filter.",
      "content": "Back flush your filter. Start by reversing the flow of the filter to flush away any gunk that has collected. How you do it depends on the type of filter, but generally, you use a syringe or hose that comes with your water filter to reverse the flow by pressing water through it backwards. [15] X Research source If you're using your filter often, all you need to do is reverse the flow. If your filter has been dry for a while, you need to moisten it by letting water go through it in the normal direction before reversing it."
    },
    {
      "title": "Brush the filter.",
      "content": "Brush the filter. Some filters can be brushed to remove the gunk instead of reversing the flow. However, your filter must be designed for brushing, so always check the manual first. To brush it, simply use a soft-bristled brush to gently remove any gunk and build up on the filter."
    },
    {
      "title": "Use chlorinated tap water.",
      "content": "Use chlorinated tap water. Tap water that has chlorine (as many cities add chlorine to the water) can help clear out bacteria in the filter. Run a gallon or so of water through the filter the normal way to help clear off the bacteria. [16] X Research source If your tap water isn't chlorinated, add 8 drops of clear liquid bleach (unscented) to a gallon (about 2 liters) of water. Stir it up, and then let it sit for half an hour before using. If you want to be sure your filter is disinfected, you can make the bleach solution a little stronger, with about a capful of bleach in a quart (about a liter) of water."
    },
    {
      "title": "Dry it for storage.",
      "content": "Dry it for storage. If you're planning on storing your water filter, you need to dry it thoroughly. You can let it air dry in a warm, ventilated area. Just don't put it directly in sunlight. [17] X Research source"
    },
    {
      "title": "Turn off the water.",
      "content": "Turn off the water. Find the control panel that runs to the filter, and turn the valve until you hear the water going off. [18] X Research source Generally, it's under a green panel in your yard."
    },
    {
      "title": "Let the pressure off with the bleeder valve.",
      "content": "Let the pressure off with the bleeder valve. On the filter itself, you'll find a valve that you can turn to release the pressure. As you turn it, be aware that it will blow air and water out of the filter, so be careful. If it doesn't have a valve, just unscrew it slowly."
    },
    {
      "title": "Remove the filter.",
      "content": "Remove the filter. Unscrew the filter housing from the pipes. It may be tight, but you just need to apply a little pressure. A large wrench can help you get it unscrewed because it will help you grip the filter better. Pull the filter out of the housing. [19] X Research source"
    },
    {
      "title": "Wash the filter.",
      "content": "Wash the filter. Most filters are either a disc type or a mesh type. If it's a disc type, you'll need to unscrew the ends so you have enough space to get in between the discs a bit. Using a hose or a bucket of water, get the filter wet. Use a stiff nylon brush to scrub down the filter, adding water as needed to clean off the gunk. You can scrub inside and out."
    },
    {
      "title": "Turn the water on a bit and then reinstall the filter.",
      "content": "Turn the water on a bit and then reinstall the filter. Before putting the filter back in, turn the water back on so you push out anything that might be in the pipe. After a few seconds, turn it back off. Screw the filter back into its housing."
    },
    {
      "title": "Turn the water back on.",
      "content": "Turn the water back on. Shut off the pressure valve. Turn the water back on slowly, letting it run into the valve and the whole system. If you turn it on too fast, the water will push the air in the system ahead of itself, which can cause problems."
    }
  ]
}