{
  "url": "https://www.wikihow.com/Address-a-Letter-to-a-Priest",
  "title": "How to Address a Letter to a Priest",
  "steps": [
    {
      "title": "Address a letter to a secular priest.",
      "content": "Address a letter to a secular priest . On the envelope write: The Reverend Father first name, middle initial, last name or The Reverend first name, middle initial, last name. Don't forget the word The. Example: \"The Reverend Father John W. Butler.\" The salutation should be Dear Father. To be even more polite, refer to a priest as His Reverence. If it's a very formal letter, say, \"The Reverend Father last name as the salutation or Dear Reverend Father.\" If you know the priest well, it's either \"Dear Father or Dear Father last name.\" [1] X Research source Conclude the letter: \"Respectfully yours in Christ, your name.\" [2] X Research source You could also end the letter: \"Respectfully yours in Christ, your name.\""
    },
    {
      "title": "Address a letter to a religious order priest.",
      "content": "Address a letter to a religious order priest. On the envelope, write, \"Rev. first name, middle initial, and last name,\" adding letters designating his Order. The key difference here is to add the initials of the religious order community, as in,\"The Reverend first name last name, O.F.M. or The Reverend Father first name last name, O.F.M.\" Example: \"The Reverend Father Leo F. McKenzie, S.J.\" In the example, SJ refers to (The Society of Jesus). The salutation should say: \"Dear Father.\" Conclude the letter: \"Respectfully yours in Christ, your name.\""
    },
    {
      "title": "Write to the Pope.",
      "content": "Write to the Pope. Address the envelope appropriately; the Pope is the highest leader in the Catholic hierarchy. Address the envelope to \"His Holiness Pope Francis.\" [3] X Research source It's also acceptable to address the letter to \"The Sovereign Pontiff, His Holiness Pope Francis.\" The letter's salutation should say \"Most Holy Father\" or \"Your Holiness.\" In personal speech instead of writing, you would address the Pope as Your Holiness. The Pope's address is: Apostolic Palace, 00120 Vatican City. Conclude the letter appropriately. Catholics would write: \"I have the honor to profess myself with the most profound respect, your Holiness' most obedient and humble servant.\" If you are not Catholic, it is appropriate to instead conclude the letter: \"With every good wish to Your Excellency, I am, Sincerely yours, your name.\" Or: \"With every best wish. Sincerely yours, your name.\" Another acceptable way to end the letter is \"I am, Your Holiness, most respectfully yours in Christ.\""
    },
    {
      "title": "Write to a Cardinal.",
      "content": "Write to a Cardinal. Address the envelope of your letter to \"His Eminence (Christian name) Cardinal (Surname).\" Use the salutation of Your Eminence. Cardinals are second in the Catholic hierarchy after the Pope. In personal speech, also refer to a cardinal as Your Eminence. If you are Catholic, conclude the letter: \"Asking the blessing of Your Eminence, I am, Yours respectfully in Christ, your name.\" [4] X Research source"
    },
    {
      "title": "Address an Archbishop.",
      "content": "Address an Archbishop. Address the envelope: \"His Grace, The Most Reverend Archbishop first name, middle initial,\" and last name, of the city where the archbishop is assigned. The salutation should be Your Excellency. In personal speech, refer to an Archbishop as Your Excellency. Conclude the letter: \"Asking Your Excellency's blessing, I am, Yours respectfully in Christ, your name.\" You could also end the letter: \"Respectfully yours in Christ, your name.\""
    },
    {
      "title": "Address a bishop.",
      "content": "Address a bishop. Write on the envelope, by way of example: \"His Excellency, The Right Reverend William A. Scully, D.D. Bishop of Baltimore.\" Or: \"His Excellency, The Right Reverend Bishop William Scully of Baltimore.\" [5] X Research source The salutation should say Your Excellency. Conclude the letter: \"Asking Your Excellency's blessing, I am, Yours respectfully, your name.\" An alternative ending is: \"Respectfully yours in Christ, your name.\""
    },
    {
      "title": "Address a brother or sister.",
      "content": "Address a brother or sister. To write a brother, say \"Brother first name, middle initial, last name,\" adding initials designating his order. The salutation should say \"Dear Brother last name.\" Conclude the letter by saying, \"Respectfully yours in Christ, your first and last name.\" To write a Sister, say, \"Sister first name, middle initial, and last name\" on the envelope. The salutation should say \"Dear Sister last name.\" Conclude the letter: \"Respectfully yours in Christ, your first and last name.\""
    },
    {
      "title": "Address an abbot.",
      "content": "Address an abbot. You should write an abbot this way: \"Right Reverend first name, last name,\" adding letters designating his Order as in Abbot of the place. The salutation is Right Reverend Abbot. Conclude the letter: \"Yours respectfully in Christ, your name.\""
    },
    {
      "title": "Follow general letter writing etiquette.",
      "content": "Follow general letter writing etiquette. If it's a formal letter, write it on letterhead. You could make your own, by putting your name and contact information in the center of the page [6] X Research source . Don't indent your paragraphs. Leave an extra line between each paragraphs. You could also align your name and contact information on the top left of the letter. Use nice stock paper and matching envelope. Make sure to include your name and return address on the envelope."
    },
    {
      "title": "Stay formal when addressing a priest.",
      "content": "Stay formal when addressing a priest. It's not acceptable to call a priest by his first name, say Father Bob. Instead, you should address a priest as Father Smith or simply Father. [7] X Research source In the old days, a priest would be called Your Reverence. You can still do this if you want to be very respectful and traditional. Of course, if a priest requests that you call him Father Bob, that's his right. However, it's considered disrespectful in some circles. When in doubt, it is considered polite to address authority figures using their title and their last name In this case, address the priest as Father (Last Name)."
    },
    {
      "title": "Use other proper protocol around priests.",
      "content": "Use other proper protocol around priests. Stand when a priest enters the room. You should stay standing until the priest suggests that you sit. If you're a man, remove your hat in the priest's presence. Kiss the priest's hand. This is designed to honor the fact priests consecrate the Holy Eucharist. Show similar respect when you are leaving the presence of a priest."
    }
  ]
}