{
  "url": "https://www.wikihow.com/Calculate-Predetermined-Overhead-Rate",
  "title": "How to Calculate Predetermined Overhead Rate (With Examples)",
  "steps": [
    {
      "title": "A predetermined overhead rate is an estimated ratio of overhead costs.",
      "content": "A predetermined overhead rate is an estimated ratio of overhead costs. This calculation is made at the beginning of an accounting period, before the actual project or job begins. The goal is to estimate the future manufacturing costs of the project or job so companies can plan, budget, and monitor costs. A predetermined overhead rate is based on estimates and is used for planning purposes only. It doesn’t reflect the actual overhead cost after the project or job is completed."
    },
    {
      "title": "Predetermined overhead rate = Estimated manufacturing cost / Estimated total units in allocation base",
      "content": "Predetermined overhead rate = Estimated manufacturing cost / Estimated total units in allocation base An allocation base is a cost accounting descriptor based on a common activity or factor, like labor hours. The \"unit\" is the number in the allocation base. For example, if the allocation base is labor hours, then the total number of labor hours is the unit in the allocation base. The most common allocation bases include: Machine hours Hours worked (direct labor hours) Number of employees (direct labor costs) Cost of materials (direct materials) [1] X Research source"
    },
    {
      "title": "To estimate manufacturing cost, total up manufacturing expenses.",
      "content": "To estimate manufacturing cost, total up manufacturing expenses. This includes utilities, supplies, employee salaries, rent, and depreciation—any expenses required to manufacture your product within a given time frame. Get these numbers by looking at actual manufacturing costs from the past. Estimated manufacturing cost is an informed guess based on your company's historical data. [2] X Research source For example, to calculate POR for next year, you need to estimate next year's manufacturing cost so you can plug it into the POR formula. To estimate manufacturing costs, look at the last year's. The cost of rent and utilities is fairly static from year to year. Then, pull salary info for your current employees, machine maintenance costs from last year, and so on, to create your estimate."
    },
    {
      "title": "Example #1: POR based on direct labor hours",
      "content": "Example #1: POR based on direct labor hours Company A assigns manufacturing overhead costs based on direct labor and applies this rate to job orders. The company’s estimated manufacturing overhead cost for the upcoming year is $20,000. The company estimates 4,000 direct labor hours for the upcoming year. [3] X Research source POR formula: Estimated manufacturing cost / Estimated direct labor hours $20,000 (manufacturing cost) / 4,000 (direct labor hours) = 5 The POR is $5.00 per direct labor hour. This means that for every job order, the company can expect to incur $5 in overhead costs."
    },
    {
      "title": "Example #2: POR based on annual machine hours",
      "content": "Example #2: POR based on annual machine hours At the start of 2022, Company B estimated their total manufacturing overhead cost for the year to be $420,000. They estimated their total number of machine hours for the year to be 75,000 hours. [4] X Research source POR formula: Estimated manufacturing cost / Estimated machine hours $420,000 (manufacturing cost) / 75,000 (machine hours) = 5.6 The POR is $5.60 per machine hour. This means that for every hour of machine work, the company can expect to incur $5.60 in overhead costs."
    },
    {
      "title": "Example #3: POR based on direct materials cost",
      "content": "Example #3: POR based on direct materials cost Company C estimates $860,000 in manufacturing overhead costs for the upcoming year. The company also expects to spend $600,000 for the materials required to manufacture their products. POR formula: Estimated manufacturing cost / Estimated direct materials cost $860,000 / $600,000 = 1.43 The POR for the upcoming year is $1.43. This means that for every manufactured unit, the company can expect to incur $1.43 in overhead costs."
    },
    {
      "title": "Example #4: POR based on direct labor costs",
      "content": "Example #4: POR based on direct labor costs Company D wants a POR for a new product they're launching. The estimated manufacturing overhead cost is $500,000. The company expects the total wages paid to workers to be $200,000. POR formula: Estimated manufacturing cost / Estimated direct labor cost 500,000 (manufacturing cost) / 200,000 = 2.5 The POR is $2.50. This means that for every product unit the company produces, they can expect to incur $2.50 in overhead costs."
    },
    {
      "title": "Setting pricing",
      "content": "Setting pricing The price a company charges its customers is often decided or negotiated based on cost of manufacturing. A predetermined overhead rate can help estimate those costs so the company can determine an accurate price that still allows them to earn a profit. [5] X Research source"
    },
    {
      "title": "Monitoring relative expenses",
      "content": "Monitoring relative expenses Predetermined overhead rate can help companies monitor costs on a quarterly, monthly, or weekly basis while the project or job is still ongoing. That way, they’ll know when costs are escalating and when to cut back on spending to stay on budget."
    },
    {
      "title": "Monitoring overhead rate",
      "content": "Monitoring overhead rate Once a project (or fiscal year) is complete, companies can compare the actual cost to the predetermined overhead rate to see how on-target their original estimate was. Then, they can use that comparison as a way to monitor or predict expenses for the next project (or fiscal year)."
    }
  ]
}