{
  "url": "https://www.wikihow.com/Control-Your-Bladder-on-a-Bus",
  "title": "How to Control Your Bladder on a Bus",
  "steps": [
    {
      "title": "Don't drink too much before you board the bus.",
      "content": "Don't drink too much before you board the bus. Staying hydrated is important for your health, but if you're about to board a bus for a long ride, it's wise not to chug water or any other liquid just before boarding. If you can't stand being thirsty, bring a water bottle and wet your mouth with tiny sips throughout your trip, rather than drinking it all at once. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Say no to that large latte or giant soda before you get on the bus! Caffeine is a diuretic and will cause you to pee more often than usual. If you need your morning coffee, try to drink it well before it's time to get on the bus, so it has time to get through your system. Even worse than caffeine is alcohol, which prompts your body to produce more urine than the same amount of water would do. [2] X Research source Avoid drinking it in any form before or during your bus ride."
    },
    {
      "title": "Check to see that the bus has a bathroom.",
      "content": "Check to see that the bus has a bathroom. Most buses that will be traveling for more than a few hours have bathrooms these days. You can call ahead and ask the bus line you're traveling with just to make sure. The problem is that bus bathrooms are often less than clean, being very dirty at worst, as they aren't always cleaned for each new trip, and on a full bus, there's frequently a line to use them. If the bus bathroom is very dirty, or if there is likely to be a line, then the best approach is to board armed with tips and tricks you can use to hold your bladder for as long as possible, and think of the bus bathroom as a backup you can use if you have to go."
    },
    {
      "title": "See if and when the bus will pull over for rest stops.",
      "content": "See if and when the bus will pull over for rest stops. On very long bus rides, there's usually a rest stop or two. Even if the bus doesn't have a usable bathroom, you'll eventually have somewhere to relieve yourself. Again, calling ahead to check on the situation will help you get mentally prepared. If you know when the next stop is going to be, it'll be easier to distract yourself for the allotted amount of time. If you have no idea when you'll get the opportunity to go, holding your pee will feel like endless torture."
    },
    {
      "title": "Go while you still have the chance.",
      "content": "Go while you still have the chance. Remember when your parents made you pee before road trips, even if you didn't have to go? This is especially important when you're about to go on a long bus trip with few or no stops before the destination, especially if there's no bathroom on the bus. Take advantage of your last chance to use the bathroom at home so your bus ride will be as trouble-free as possible."
    },
    {
      "title": "Strengthen your pelvic floor muscles.",
      "content": "Strengthen your pelvic floor muscles. For both men and women, the amount of urine that's released from your bladder is controlled by your pelvic floor muscles. The Knack maneuver is an exercise designed to strengthen the pelvic floor muscles so you'll have more control when it comes to urinating. [3] X Expert Source Allison Romero, PT, DPT Pelvic Health Specialist Expert Interview. 2 December 2020. If you're on a bus and you need to go, doing the Knack maneuver can send a message to your brain telling it that now's not a good time to pee, and the urge will become less strong. Try this before your trip: [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Find your pelvic floor muscles. They're the muscles that tense up when you're holding your pee, or when you stop peeing mid-stream. Tense the muscles, then cough at the same time. Keep the muscles tensed until you're done coughing, then release. Repeat 10 to 15 times every day leading up to your bus trip."
    },
    {
      "title": "Consider wearing pads or adult diapers, just in case.",
      "content": "Consider wearing pads or adult diapers, just in case. If you have a long trip coming up and you predict you're going to have trouble holding your bladder, there's no shame in protecting yourself in case of emergency! Head to the drugstore and pick out some protective supplies so you don't have an accident. Just make sure you put on the diaper before boarding the bus. [5] X Research source Adult diaper products were designed to help people deal with urinary incontinence, but they're commonly used by people with all sorts of needs, like brides with wedding dresses too puffy to remove for a bathroom break. You can buy small protective pads similar to sanitary napkins or larger, full-coverage diapers depending on what you think you'll need. If you don't want to wear protection, consider bringing an extra pair of clothes in case you have an accident. Also bring hand wipes and antibacterial cleansing products for cleaning up yourself, and a bag for soiled clothes. [6] X Research source"
    },
    {
      "title": "Loosen tight clothing.",
      "content": "Loosen tight clothing. If you're wearing pants or a skirt with a tight waistband, your clothes could be making matters worse by putting pressure on your bladder. Make yourself as comfortable as possible by loosening your tight clothing. [7] X Research source If you're wearing a belt, unbuckle it. Unbutton or unzip your pants or skirt. To hide the fact that you're unbuttoned, pull your shirt down or place a sweater or another item over your lap. For similar reasons, you may also find it helpful to uncross your legs, particularly when sitting."
    },
    {
      "title": "Try not to move around too much.",
      "content": "Try not to move around too much. Squirming around jostles your bladder and creates an urge that feels more extreme. You might want to feel like tapping your feet or shifting from side to side, but that's just going to make matters worse. Try to get in a comfortable position and stay that way."
    },
    {
      "title": "Read or watch something to distract yourself.",
      "content": "Read or watch something to distract yourself. This is one of the best ways to deal with having to pee on a bus. If there's nowhere to go to the bathroom for the next hour or two, make the best of the situation by trying to forget about your uncomfortable physical state. Pick up your reading material or turn on a video absorbing enough to keep your mind off of your urge to relieve your bladder."
    },
    {
      "title": "Avoid coughing or laughing.",
      "content": "Avoid coughing or laughing. Both of these actions can cause the pelvic floor muscles to give a little, making the urge to pee worse. [8] X Expert Source Allison Romero, PT, DPT Pelvic Health Specialist Expert Interview. 2 December 2020. You probably can't do much about it if you have a coughing fit, but you can make sure the book or video you choose isn't funny enough to make you laugh so hard that you pee in your pants. [9] X Research source"
    },
    {
      "title": "Don't think about running water.",
      "content": "Don't think about running water. Having an unbearable urge to pee is partly psychological, so thinking about whitewater rafting and spouting geysers really will make you feel worse! Let your mind dwell on deserts (without mirages) and other dry things. If you have a mean friend who thinks it's funny to sing \"Don't Go Chasing Waterfalls\" while you're trying to hold it in, tell him it won't be so funny if you pee in your seat right next to them. [10] X Research source"
    },
    {
      "title": "Know that holding it for a long time won't hurt your bladder.",
      "content": "Know that holding it for a long time won't hurt your bladder. There's no chance that you're going to burst your bladder just by holding your pee for a long time, so let your mind be eased. [11] X Trustworthy Source Go Ask Alice Medical advice site with content written by health promotion specialists affiliated with Columbia University Go to source If it gets to the point where your body can't hold it anymore, it will simply stop doing so. Hopefully, by then you'll have gotten to a rest stop! If you fear the time has come and you're still sitting there wedged between a stranger and a window, read on."
    },
    {
      "title": "Talk to the bus driver.",
      "content": "Talk to the bus driver. See if there's a chance the driver can stop the bus at a nearby rest stop so you can use the bathroom (other passengers will probably take advantage, too). Be careful not to distract the bus driver, though. It's important not to raise your voice or do anything that could create a dangerous situation. It is possible that the bus driver will say no, and you'll just have to keep waiting. If it's a charter bus on a schedule the driver isn't going to be likely to want to pull over. Still, it's worth a try. If the driver says no, ask when you'll be stopping next, so you can resume your seat at least knowing when you'll get to relieve yourself."
    },
    {
      "title": "See if you can discreetly pee into a container.",
      "content": "See if you can discreetly pee into a container. When it comes, it comes, so have somewhere to put it. Cover your lap with a jacket or something and pee into a container of some kind. Choose one with a lid so you can keep things as sanitary as possible and close it up when you're done. If your seatmate is a friend, have him or her stay positioned in front of you while you use the window seat to pee discreetly into the container. Wait for a time when the bus is running over the smooth highway and not driving through city streets and running over potholes."
    },
    {
      "title": "Avoid peeing in your pants.",
      "content": "Avoid peeing in your pants. You wouldn't be reading this article if you saw peeing in your pants as a viable option, but it's worth pointing out that peeing on a bus seat is unsanitary and rude to your fellow passengers. If there's just no way you can avoid it, and you can't find a container fit to use, do your best to hold in as much as possible until the bus finally comes to a stop."
    },
    {
      "title": "Remain calm, if you do end up peeing in your pants.",
      "content": "Remain calm, if you do end up peeing in your pants. If you panic, you'll attract attention to your wet pants, adding to your embarrassment. Simply stay where you are until the bus stops and wait for others to leave, then inform the driver you've had an accident. If there are still others on board who notice you peed in your pants, don't sweat it! You may never have to see them again. Change into dry clothes as soon as possible and clean the parts of your body that were in contact with pee. Staying in peed clothing can cause skin problems or a yeast infection. [12] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source They will also start to smell after a bit. [13] X Research source"
    }
  ]
}