{
  "url": "https://www.wikihow.com/Assemble-a-Bicycle",
  "title": "How to Assemble a Bicycle",
  "steps": [
    {
      "title": "Find the owner’s manual.",
      "content": "Find the owner’s manual. Take the bike out of its box. Set its protective wrapping aside. Locate the owner’s manual. Refer to this for exact instructions regarding your specific bike. If you don’t have an owner’s manual, check the manufacturer’s website. Many post instructions for assembly there. You can also consult someone at your local bike shop if you have questions or need additional help assembling your bike."
    },
    {
      "title": "Check if all parts are included.",
      "content": "Check if all parts are included. Before you begin, make sure you have everything you need. Double-check the box’s contents with the parts listed in your owner’s manual. If anything is missing, contact the seller and notify them. Don't throw anything away until you’re finished. Smaller parts could possibly be hidden in the box or protective wrapping."
    },
    {
      "title": "Get your tools.",
      "content": "Get your tools. Again, refer to the owner’s manual to double-check which tools are required for assembly. Expect types and sizes may vary according to the make and model. However, generally speaking, you will most likely need: Allen keys Cable cutters Phillips head screwdriver Wrench"
    },
    {
      "title": "Lubricate your parts.",
      "content": "Lubricate your parts. Check your manual to find out which parts should be lubricated (and with which type of lubricant). Inspect your bike to locate any metal parts that will come into direct contact with other metal parts. Apply lubrication here to reduce damage from friction and corrosion. Such areas will probably include parts like the: Axles Quill stem Seat post Seat tube Threads"
    },
    {
      "title": "Locate the minimum insertion mark.",
      "content": "Locate the minimum insertion mark. Inspect the post attached to your seat's saddle. Locate the mark that indicates how far this should be inserted into the seat tube to achieve the maximum safe height for your seat. If desired, you can place it deeper than this for a lower seat, but always insert it at least this much to make sure your seat is securely in place. A seatpost that is not inserted deeply enough into the seat tube can easily damage or destroy your frame if you attempt to ride the bike. If you want a higher seat than the insertion mark allows, you will need to purchase this separately."
    },
    {
      "title": "Slip the post into the tube.",
      "content": "Slip the post into the tube. First, grease the seat post if you haven’t already. Slip it into the corresponding tube on the bike’s body. Push it in until the minimum insertion mark is inside the tube. If grease isn’t included with your new bike, any waterproof, hi-temp grease will work. You can purchase this grease at any hardware store."
    },
    {
      "title": "Tighten and adjust.",
      "content": "Tighten and adjust. Depending on the make and model, there should be either a bolt or a quick release mechanism on the outside of the seat tube. Whichever one it is, tighten this once you’ve inserted the post to your desired depth. Secure the seat post in place so it isn’t jarred out of place as you ride."
    },
    {
      "title": "Center the saddle.",
      "content": "Center the saddle. Once the post is secure, move up to the seat’s saddle. If needed, adjust its position so it’s centered over the post. Then tighten its bolts to fix it."
    },
    {
      "title": "Face the fork forward.",
      "content": "Face the fork forward. Locate the wheel mounting slots and axle on the bike’s fork for the forward wheel. Make sure they’re facing away from the bike itself. If they aren’t, simply twist the fork around until they are."
    },
    {
      "title": "Immobilize the handlebar.",
      "content": "Immobilize the handlebar. Before you attach it to the bike’s body, make sure the handlebar isn’t able to move on its stem. Adjust it so it’s positioned as though you were riding forward in a straight line. Then tighten the stem bolts to fix it in this position."
    },
    {
      "title": "Inspect the cables.",
      "content": "Inspect the cables. If your bike has any brake or shift cables attached to the handlebar, give them a quick inspection. Double-check to be sure that they haven't become tangled up or knotted. If needed, undo any knots or twists."
    },
    {
      "title": "Attach the handlebar to the bike.",
      "content": "Attach the handlebar to the bike. First, refer to your owner’s manual to determine if your handlebar has a quill stem or an A-head. Each requires different steps to attach it to the bike’s body. Depending on which you have: Quill stem: Lubricate the stem with grease. Locate the minimum insertion mark on the wedge-shaped part at its bottom. Insert this into the bike’s corresponding tube. Make sure the handlebar is aligned with the fork, then tighten the stem center bolt. A-head: Locate the stem cap, undo its bolts, and remove the cap. Fix the handlebar on top of the stem. Replace the cap and bolts and retighten them. Consult your owner’s manual find out how much torque you need to correctly attach your handlebar. If you don’t have a manual, get advice from someone at your local bike shop."
    },
    {
      "title": "Make sure each tire is mounted correctly on its rim.",
      "content": "Make sure each tire is mounted correctly on its rim. Go over each side of the wheel. Look along the rims. Confirm that the tires are evenly placed over the rims. Adjust if necessary."
    },
    {
      "title": "Inflate the tires.",
      "content": "Inflate the tires. First, find their recommended air pressure, which should appear on the tire itself. Then remove their caps and fasten your bike bump to the valve. Inflate them slowly so you don’t go over the recommended air pressure and burst your tire by accident."
    },
    {
      "title": "Recheck how the tires are seated on the rims.",
      "content": "Recheck how the tires are seated on the rims. Once the tires are inflated, give them a spin. Make sure they’re still seated evenly over the rims once they come to a stop. If not, release the air, readjust the tires, and repeat until they’re in the proper position once inflated. Replace the valve cap when you’re all done."
    },
    {
      "title": "Attach the front wheel.",
      "content": "Attach the front wheel. Center the wheel evenly between its fork and place it into the front fork’s drop outs. Open the brake to do so if necessary. Tighten all bolts. As you do, tighten each just a little bit at a time, move on to the others and tighten them just as much, and repeat until you’re all done. Then double-check that the wheel is still centered between the fork. Many bikes have a quick release on the front wheel, which allows for easy installation and removal without tools. With the quick release lever open, slip the wheel onto the dropouts. Tighten the nut by hand until you need to use a bit of force to close the lever (enough to leave an imprint of the lever on your hand). [1] X Research source Instructions for this step possibly vary the most between designs. Refer to your owner’s manual for precise steps for your specific wheel."
    },
    {
      "title": "Attach the pedals.",
      "content": "Attach the pedals. First, identify which is which by checking the spindles. Find the L and R markers respectively. Use the L pedal on the bike’s left side and the R pedal on its right (which would be your left and right when seated on the bike). To attach them: Screw each pedal onto its corresponding thread with your hands at first (turning clockwise for the right pedal and counterclockwise for the left). Then switch to a wrench to tighten them firmly into place as you near the end."
    },
    {
      "title": "Give the gears a trial run.",
      "content": "Give the gears a trial run. If your bike has gears, raise the back tire off the ground. Turn the pedals and shift through all the gears as you do. Make sure each one shifts to the next smoothly. If they don’t, set the bike to its highest gear before making your adjustments ."
    },
    {
      "title": "Check the brakes.",
      "content": "Check the brakes. Locate the brake pads. Keep your eyes on these as you turn your pedals. Squeeze the brake lever and make sure that: The brake pads make contact on the rim without interference. The brakes should rest squarely on the rim and should not rub on the tire itself when they are engaged. They do so when the brake lever is only a third of the way to making contact with the handlebar. Each pad retreats the same distance from the rim when you let go of the lever."
    },
    {
      "title": "Adjust the levers and reflectors.",
      "content": "Adjust the levers and reflectors. First, make sure any gear or brake levers are in front of your handlebar, at a 45° angle between the bar and the ground. Squeeze them to make sure they’re working properly. Then set both wheels on level ground. Check the angles of both the front and back reflectors. If necessary, adjust them so they’re at least within 5 degrees of being perfectly vertical with the ground. At this point, you should be done assembling. However, inspect your handiwork step-by-step before using your bike. Make sure that you haven’t overlooked anything or made any mistakes."
    }
  ]
}