{
  "url": "https://www.wikihow.com/Administer-an-Email-Interview",
  "title": "How to Administer an Email Interview",
  "steps": [
    {
      "title": "Connect with your subject before administering the email interview.",
      "content": "Connect with your subject before administering the email interview. This will allow you to introduce yourself or your organization, and provide you with the opportunity to explain your reason for the interview. For example, if you want to interview an author for your book blog, contact the author and explain that you would like to feature their interview on your book blog. Explain to your subject how you came across their name and contact information, especially if you are making the initial connection by telephone. This can help your subject feel more at ease with you and with the idea of an interview."
    },
    {
      "title": "Provide your subject with information regarding the nature of the interview.",
      "content": "Provide your subject with information regarding the nature of the interview. For example, if your subject has recently released an ebook about Internet marketing, explain that the interview questions will focus strictly on their new ebook. If the subject seems hesitant about doing an email interview, provide the subject with positive information that will encourage their participation. For example, explain that you want to publish the interview on your website to help bring the subject additional publicity."
    },
    {
      "title": "Provide your subject with information about the length of the email interview.",
      "content": "Provide your subject with information about the length of the email interview. For example, when interviewing a subject about their new product, inform them that you plan on asking 10 questions related to that particular product."
    },
    {
      "title": "Provide your subject with a deadline, if applicable.",
      "content": "Provide your subject with a deadline, if applicable. This can often ensure that your subject completes the email interview on time, especially if you under a strict deadline yourself."
    },
    {
      "title": "Research your subject's background prior to developing the interview questions.",
      "content": "Research your subject's background prior to developing the interview questions. This will provide you with the insight you need to develop strong interview questions. For example, when interviewing a professional athlete, research their sports background to learn the names of other teams they have played for, and about their career highlights. Use the Internet as a resource when researching a person's background and accomplishments, or consult with your subject's publicist, if applicable."
    },
    {
      "title": "Write your list of email interview questions.",
      "content": "Write your list of email interview questions. Your questions should contain only one inquiry or concept per question to keep the task clear and to the point. For example, for your first question, ask the subject if they enjoy drinking wine, then for the second question, inquire about the subject's favorite type of wine. Write 1 or 2 general questions to begin the interview, then segue into more specific questions or topics as the interview progresses. For example, begin by asking a pastry chef why they chose baking as a career, then ask them additional questions specifically about the new bakery they are opening in your city."
    },
    {
      "title": "Send your email interview questions to the subject.",
      "content": "Send your email interview questions to the subject. Your subject should then answer your interview questions and send them back to you via email prior to the deadline you gave them."
    },
    {
      "title": "Edit the email interview answers if needed.",
      "content": "Edit the email interview answers if needed. In most cases, especially if you are submitting the interview questions and answers to your boss or publishing the content to a website, you may need to make certain grammar and punctuation edits. Sometimes, you may need to re-word their answers in a manner that matches the style of your readership or publication. Review any major editing changes with your subject prior to publishing the interview. For example, if you feel the need to edit a specific quote provided to you by the subject, contact the subject before publication to clarify that you have their permission to edit their quote."
    },
    {
      "title": "Thank your subject after the email interview has been completed.",
      "content": "Thank your subject after the email interview has been completed. Your thank you can be in the form of an email or telephone call, along with a final copy of the interview questions and answers."
    }
  ]
}