{
  "url": "https://www.wikihow.com/Catch-a-Cheater-Through-Text-Messages",
  "title": "How to Catch a Cheater Through Text Messages",
  "steps": [
    {
      "title": "Your partner may be deleting suspicious texts if they’re cheating.",
      "content": "Your partner may be deleting suspicious texts if they’re cheating. Getting your hands on those deleted texts can give you the proof you need. Recovering deleted text messages on Android and Apple devices usually involves connecting the phone to a computer to access a backup. [1] X Research source In order to recover deleted texts yourself, the messages will need to have been included in a backup to cloud storage before they were deleted. There are also free and paid apps that can help you recover deleted text messages. These apps only require you to download a software onto your computer and plug the phone in using a USB."
    },
    {
      "title": "Keeping tabs on your partner’s texting can help you know if they’re cheating.",
      "content": "Keeping tabs on your partner’s texting can help you know if they’re cheating. Text spying apps will secretly monitor your partner’s device, sending you all their ingoing and outgoing text messages. Simply download the app on your partner’s phone, enter your account information, and then monitor your partner’s texts by logging into the app’s website on your computer. mSpy , SpyBubble , and Spyzie are highly rated spy apps that can help you track your partner’s text messages, phone calls, social media, and even their location. These apps are free to download, but some of them offer additional features if you sign up for a monthly subscription. Keep in mind that using spying apps is only legal if you have permission from your partner. By Federal law, you are not allowed to view, read, or listen to anything on someone else’s devices unless you have consent to do so. Notifying your partner about what you’re doing may seem counter intuitive, but it’ll help you avoid legal action and be upfront with them."
    },
    {
      "title": "Scrolling through your partner’s messages may give you the proof you need.",
      "content": "Scrolling through your partner’s messages may give you the proof you need. When they’re busy, take a peek at their phone to see if they’re texting anyone new. If your partner has a lock on their phone, come up with an excuse to use their phone. Then, when you have the phone, take a quick second to scroll through their messages without them noticing. [2] X Research source Here are some excuses you can try: “The map on my phone isn’t working. Can I check yours?” “My phone died. Can I use yours to look at the menu?”"
    },
    {
      "title": "Your partner may have adopted a text language to hide their tracks.",
      "content": "Your partner may have adopted a text language to hide their tracks. When you see a text with an unknown abbreviation, ask yourself what the context of the text is. Is the text flirty? Could the text be a sexual innuendo? Dig for details and look for context clues, and remember that you won’t know the full story unless you talk with your partner. Here are some cheating codes to look out for: [3] X Research source ASL/ASLP: Age/Sex/Location or Age/Sex/Location/Picture. This is usually used as an introduction or for a hook-up. NSFS: Not Suitable for Spouse. This is typically used to warn the texter that what they’ve sent could get the recipient in trouble with their partner. IRL: In Real Life. This is often used when people in a virtual relationship want to meet up in-person."
    },
    {
      "title": "Be aware of red flags and listen to your gut.",
      "content": "Be aware of red flags and listen to your gut . Analyze what’s going on around you. Is your partner acting differently? Is there a tension between you two that you just can’t pinpoint? You’re smart. If something doesn’t feel right, do a little digging before jumping to any conclusions. [4] X Research source Are they tucking their phone away when you walk in? This could be a sign that they are hiding more than an embarrassing picture. Your partner might be getting in the habit of putting their phone down when you’re around because they’re scared you’ll catch them talking to someone else. Do they lock their phone when you’re around? This could be a sign that they don’t want you seeing anything on their phone. Maybe they’ve changed their password and refuse to tell you, or they immediately screen lock their phone when you ask what they’re doing."
    },
    {
      "title": "Catfishing (messaging your partner as someone else) can help you catch them in a lie.",
      "content": "Catfishing (messaging your partner as someone else) can help you catch them in a lie. Create a new email, WhatsApp account, or social media profile. With a fake name and profile picture, reach out to your partner to see if they’ll flirt with your fake persona. By pretending to be someone else, you may be able to catch them cheating. [5] X Research source This tactic can be risky and could possibly make things between you and your partner worse if they find out, so be careful. Think of this as your last resort to get answers."
    },
    {
      "title": "You deserve to know if your partner is cheating or not.",
      "content": "You deserve to know if your partner is cheating or not. Communication is essential for any relationship, and it’s better to be honest upfront with your partner. When you’re ready, ask them to set aside time so you can talk. Explain how you feel and what makes you believe they are cheating. [6] X Trustworthy Source Go Ask Alice Medical advice site with content written by health promotion specialists affiliated with Columbia University Go to source “Is it okay if we talk tonight? I have some things I want to ask you.” “Have you been seeing or talking to someone else? That really hurts me.” “I saw the text messages on your phone. I know you’re seeing someone else.”"
    },
    {
      "title": "Having suspicions that your partner is cheating can really sting.",
      "content": "Having suspicions that your partner is cheating can really sting. It’s okay if you’re not sure how to move forward in the relationship. Take some time to reflect on what’s happened and know that it’s okay to ask for help. Talk to friends, family members, and/or a counselor after confronting your partner. Healing takes time, but you don’t have to go through the recovery process alone. [7] X Research source You can’t control your partner’s actions, but you can control your own. Do what you feel is right for you. love is respect is a national resource you can call if you ever need relationship advice or support: 1-886-331-9474. Reader Poll: We asked 833 wikiHow readers who've caught their partner cheating over text, and 53% of them agreed that the best way to handle the situation is by breaking up immediately. [Take Poll]"
    }
  ]
}