{
  "url": "https://www.wikihow.com/Balance-Breast-Size-During-Breastfeeding",
  "title": "How to Even Out Lopsided Breasts When Breast Feeding: Top Tips & Tricks",
  "steps": [
    {
      "title": "Nurse on the smaller breast first.",
      "content": "Nurse on the smaller breast first. Your baby's suckling is what triggers your body to produce milk. Also, babies tend to suckle harder when they first start feeding; therefore, if your baby suckles on the smaller breast first when you feed them, it can help trigger milk flow in that breast, helping to balance out the size of your breasts. This solution only works if one breast is producing normally while the other is under producing. If one is overproducing, you may need to drain the milk off to prevent engorgement. Hand-express the overproducing breast for no more than 20 to 30 seconds. Another option is to nurse more often on the smaller side than the larger side."
    },
    {
      "title": "Pump more on the smaller side.",
      "content": "Pump more on the smaller side. Once your baby eats, try pumping for 10 minutes or so afterwards. In addition, you can try pumping just this side between the times you feed your baby. [2] X Research source"
    },
    {
      "title": "Take your baby to the doctor.",
      "content": "Take your baby to the doctor. Sometimes, a preference for one side or the other means your baby doesn't feel right in a certain position. That discomfort could indicate an illness for your baby, such as an ear infection, or a treatable condition called torticollis. If you notice your baby always fusses unless they are on one side, take them to the doctor to have them checked out."
    },
    {
      "title": "Understand that it's medically fine.",
      "content": "Understand that it's medically fine. That is, your breasts being different sizes doesn't indicate anything is wrong health-wise, unless other symptoms are present. In fact, many women produce different amounts of milk in each breast, leading to different sizes. You can even only feed on one breast if you need to do so, and your other breast will slowly regain the size it was before you got pregnant. [3] X Research source"
    },
    {
      "title": "Watch for symptoms.",
      "content": "Watch for symptoms. Your breasts will become larger after you give birth; however, sometimes you may develop engorgement, where your breasts become hard and swollen because milk is getting blocked up inside. Symptoms can include your breast being tender and warm or a throbbing sensation. You might also notice your nipple flattening out or that you are running a light fever (under 100.4°F or 38°C). [4] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source If not treated, you can develop a plugged duct, which will cause your breasts to be uneven, as well as being a problem medically. [5] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source"
    },
    {
      "title": "Feed often.",
      "content": "Feed often. One way to help treat engorgement is to feed often. That means letting your baby eat when they want and as long as they want, often eight to 12 times a day. [6] X Research source That also means feeding at least every four hours; even if your baby is asleep, you should wake them up to feed. [7] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source"
    },
    {
      "title": "Prepare before breastfeeding.",
      "content": "Prepare before breastfeeding. To make breastfeeding easier, try using a warm compress before you feed. Apply light heat for three minutes. [8] X Research source Another option is gently massaging your breast so that it releases milk. [9] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source You can also gently massage your breast while your baby is suckling. [10] X Research source"
    },
    {
      "title": "Breastfeed on the larger breast if it is engorged.",
      "content": "Breastfeed on the larger breast if it is engorged. Once your breast becomes engorged, you should try to use that breast more often. When one breast is underperforming and the other one is normal, it's fine to use the smaller one more often to stimulate milk; however, when one is engorged, you need to focus more on it to help release some of the build of up milk, which is causing the problem. [11] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source It's common for just one breast to become engorged, rather than both at the same time."
    },
    {
      "title": "Focus on latching.",
      "content": "Focus on latching. If your baby isn't latching on well, you may need to work with a specialist (such as a lactation consultant or your doctor) to help with latching. If the baby is not latching, they may not be getting enough milk. [12] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source One way to help your baby latch properly is to bring their head up underneath your breast, letting their chin be closest to your breast. Try to get them to touch your breast with their bottom lip on the far bottom side of your areola. That way, they can pull in enough of your breast, situating your nipple towards the back of their mouth. [13] X Research source"
    },
    {
      "title": "Pump only when needed.",
      "content": "Pump only when needed. That is, if you're feeding your baby regularly (every couple of hours), you don't need to pump unless your breast becomes hard, and your baby is not ready to eat. If you pump too much, you'll encourage your body to produce more milk, which can lead to engorgement for long periods of time. Also, keep your pumping sessions to about two to three minutes on low. [14] X Research source If you've returned to work and need to pump, try to do it when you would normally feed your baby to keep on the same schedule; make sure you are pumping at least in four-hour increments. [15] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source"
    },
    {
      "title": "Use cold to help with the tenderness.",
      "content": "Use cold to help with the tenderness. When you're not feeding, you can apply cold to your breasts to help ease the pain. Use an ice pack covered in a cloth. You can use it directly before or after feeding. [16] X Research source"
    },
    {
      "title": "Pick a good bra.",
      "content": "Pick a good bra. If your bra fits well, it can help with engorgement. Make sure it is not too tight. In addition, make sure it supports your breasts, but skip ones with underwire. [17] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source If a bra is too tight, it can contribute to engorgement by cutting off the flow. [18] X Research source"
    },
    {
      "title": "Know when to call the doctor.",
      "content": "Know when to call the doctor. If you notice that your breasts have become hard, especially if they are painful, it's time to talk to your doctor. You should also give them a call if your child seems to be having trouble with breastfeeding. Finally, if you are running a fever over 100.4°F (38 °C) or notice the skin of your breast has become red, you may want to call. [19] X Research source You will notice some hardness in the first few days of breastfeeding, which is normal, but if you suddenly develop hardness with pain in your breasts, it's time to call the doctor."
    },
    {
      "title": "Watch for symptoms.",
      "content": "Watch for symptoms. When an engorged breast becomes completely blocked, it's called a plugged or clogged duct. Essentially, the milk duct becomes clogged, not allowing as much milk to come through. [20] X Research source You will notice a lump in your breast that is painful; usually, this condition isn't accompanied by a fever. [21] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source Most of the time, your breast will be partially blocked, not fully blocked; however, sometimes, you may have skin cells grow over the end of your nipple, which you'll be able to see as a small white dot. [22] X Research source"
    },
    {
      "title": "Feed on the plugged side.",
      "content": "Feed on the plugged side. Just as with engorged breasts, it is important to focus more on this side while the breast is plugged. Doing so can help release the clog. [23] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source Even if your breast is truly blocked, your baby feeding can help. If they don't pull off the small bit of skin cells, you can use a washcloth or even your fingernail to gently remove it. [24] X Research source"
    },
    {
      "title": "Apply a warm compress.",
      "content": "Apply a warm compress. Use a warm compress to help relieve the pain. It can also help release the clog. [25] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source Doing so right before you feed can make your milk come faster. [26] X Research source"
    },
    {
      "title": "Massage your breasts.",
      "content": "Massage your breasts. Massaging can also help plugged ducts. Begin with where you find a sore spot, rubbing in the direction of your nipple. This motion can help ease pain as well as help your milk to flow. [27] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source"
    },
    {
      "title": "Help your baby latch.",
      "content": "Help your baby latch. Latching is important in getting milk to flow well; therefore, if your baby isn't latching properly, your milk may not be flowing fast enough. In addition, your baby may not be eating enough. [28] X Research source"
    },
    {
      "title": "Watch for mastitis.",
      "content": "Watch for mastitis. If you develop a fever (101°F 38.3°C or higher) or chills, you likely have mastitis instead of just a plugged duct. You may also just feel bad all over, in addition to the symptoms you feel because of the plugged duct. You might also notice your skin turn red on your breast (sometimes in a wedge shape) or a burning sensation, especially while feeding. If you notice these symptoms, definitely call your doctor. [29] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Mastitis is essentially an infection in your breast that sometimes develops after a plugged duct. [30] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Try a padded breastfeeding bra.",
      "content": "Try a padded breastfeeding bra. Most nursing bras have some extra padding to absorb any extra flow. Nonetheless, make sure you pick one that is molded or that has padding. If it has both, even better. Padding and molding will help hide the unevenness of your breasts. [31] X Research source"
    },
    {
      "title": "Use a pad on the smaller side.",
      "content": "Use a pad on the smaller side. You can either buy bra pads or pick a bra that has removable pads. Don't use one on the larger side, but insert it on the smaller side. The pad will make your breasts look more even. [32] X Research source"
    },
    {
      "title": "Fit your bra to the larger breast.",
      "content": "Fit your bra to the larger breast. If you need to buy a new bra due to unevenness, pick one that fits the larger breast. You don't want to restrain the larger breast by purchasing a bra that is too small. [33] X Research source"
    }
  ]
}