{
  "url": "https://www.wikihow.com/Control-Feline-Heat-Cycles-with-Megestrol-Acetate",
  "title": "How to Control Feline Heat Cycles with Megestrol Acetate",
  "steps": [
    {
      "title": "Make an appointment with your vet.",
      "content": "Make an appointment with your vet. Call the vet and explain that you would like to discuss possible options for discussing your cat’s heat cycles. MA requires a prescription, so you will need to meet with vet before moving forward with care. Be prepared to talk about your cat’s medical history as well as their current health situation. [2] X Research source"
    },
    {
      "title": "Investigate other treatment options.",
      "content": "Investigate other treatment options. Before you give your cat a medication, your vet will likely want you to consider other avenues of care, including spaying surgery. Or, they might suggest a less invasive procedures, such as an ovariectomy, which is the surgical removal of just the ovaries. A birth control shot could be another approach."
    },
    {
      "title": "Know the health risks.",
      "content": "Know the health risks. There are serious potential side effects and risks associated with your cat taking MA. Some cats develop liver damage, diabetes mellitus, or mammary hypertrophy from taking MA. Talk with your vet about all of these possibilities before starting the course of treatment. Make sure that you carefully read any documentation that comes with the medication itself, as potential health risks may be listed in this literature as well."
    },
    {
      "title": "Go with the lowest dosage possible.",
      "content": "Go with the lowest dosage possible. MA is a very strong medication with potentially severe side effects. As such, talk with your vet about starting your cat off on the smallest possible dosage and increasing it, if needed, over time. A lower level dosage is usually 0.625 mg/kg a week. The dosage may also depend on your cat’s weight, age, and health condition. [3] X Research source"
    },
    {
      "title": "Use it only as a short-term contraceptive.",
      "content": "Use it only as a short-term contraceptive. Because of the health risks, MA should only be considered a temporary solution to any heat-cycle concerns regarding your cat. Extending the medication beyond just a few weeks use can tax your cat’s system and lead to uterine infections and other issues. Talk with your vet about using MA in conjunction with other treatments. For example, some pet owners combine an MA prescription with a policy of keeping their cat confined during heat periods. If you get an indication that MA is having an negative effect on your cat’s health, get ahold of your vet and discuss the possibility of halting treatment immediately."
    },
    {
      "title": "Do not use for younger or pregnant cats.",
      "content": "Do not use for younger or pregnant cats. If you suspect that your cat is pregnant at any point during MA treatment, call your vet immediately. They will likely advise that you cease giving your cat their medication until a test can be performed. It is also a good idea to delay using MA if your cat hasn’t had her first heat cycle."
    },
    {
      "title": "Schedule regular check-ups with your vet.",
      "content": "Schedule regular check-ups with your vet. At the time of your initial appointment, go ahead and make a series of future ones. These additional meetings will be opportunities for your vet to check your cat’s physical condition and to discuss any behavioral changes with you. If your cat’s weight changes, the dosage may need to be adjusted, too. The careful monitoring that MA requires means that it is not a good treatment option for feral colonies or other free-ranging cats."
    },
    {
      "title": "Watch for any potential physical side effects.",
      "content": "Watch for any potential physical side effects. Keep a close eye on your cat’s eating, drinking, and litterbox habits. Make sure that they are continuing to groom themselves. Some of the possible long-term side effects from MA include pyometra (a uterine infection), mammary cancer, and diabetes. Short-term side effects include weight loss, lethargy, and vomiting. Be aware that some of these side effects can occur immediately after you cat begins treatment."
    },
    {
      "title": "Watch for any potential behavioral side effects.",
      "content": "Watch for any potential behavioral side effects. Make note if your cat begins to exhibit any destructive or problematic behaviors. The combination of stress and MA can make some cats start urine marking or furniture scratching. Other cats exhibit overt aggressiveness by biting or scratching."
    },
    {
      "title": "Be aware of any drug interactions.",
      "content": "Be aware of any drug interactions. When you talk with your vet, make sure to disclose any and all medications or supplements that your cat is currently taking. If your vet is concerned about a possible drug interaction, then they may request that you monitor your cat even more closely or more frequently. MA does have some known interactions with drugs such as rifampin. [4] X Research source"
    },
    {
      "title": "Monitor your cat’s future reproductive health.",
      "content": "Monitor your cat’s future reproductive health. When you’ve finished giving your cat MA, continue to take your cat in for yearly appointments. Also, watch for any warning signs of possible uterine infections, such as loss of appetite. It is important to catch these issues early on, so that proactive treatment can take place. [5] X Research source"
    },
    {
      "title": "Give the medicine as directed.",
      "content": "Give the medicine as directed. Read through the vet’s directions carefully and look over the prescription label as well. MA usually comes in tablet form in a variety of dosages. Make sure to give your cat the entire run of the medicine or it could cause additional side effects. [6] X Research source It can be easier if you give the medication at the same time every day. If you skip a dose, do not double up the next one. [7] X Research source"
    },
    {
      "title": "Crush the pills with a spoon.",
      "content": "Crush the pills with a spoon. Check with your cat's vet or a pharmacist before proceeding with this step. Then, get out two spoons. Place the pill in one and place the other on top, applying pressure until the pill is reduced into a fine powder. Carefully handle the spoons until you know where you want to put the pill powder. Try to use the medication as soon as possible after crushing. [8] X Research source Another option is to use a pill cutter, often sold at pharmacies, to break it down into smaller pieces. It is also a good idea to read the MA’s medication label to make sure that it is okay to crush or cut the pill before moving forward. [9] X Research source"
    },
    {
      "title": "Mix it in with food.",
      "content": "Mix it in with food. Place your cat’s normal food portion in their bowl and mix the pill dust or pieces into it. Or, get some soft cat treats and place pill pieces into the center of each one. Watch your cat eat in order to make sure that they get most of the medication. [10] X Research source To trick your cat into eating, try giving them a first treat without any medicine and then following this with the mixed ones."
    },
    {
      "title": "Place the pill inside your cat’s mouth.",
      "content": "Place the pill inside your cat’s mouth. If your cat is docile enough, gently grab their jaws and open them. Hold them in this position while you drop the pill toward the back of their throat. Push their jaw closed and watch to make sure they’ve swallowed it successfully. [11] X Research source Only try this method if you think that you can do so without hurting or scaring your cat."
    },
    {
      "title": "Practice giving the pills.",
      "content": "Practice giving the pills. It may be tempting to delay giving your cat their medication, but stick closely to the dosage schedule agreed upon with your vet. Talk with your vet about what to do if your cat decides to eat only part of the pill. [12] X Research source"
    }
  ]
}