{
  "url": "https://www.wikihow.com/Convert-Inches-to-Feet",
  "title": "How to Convert Inches to Feet",
  "steps": [
    {
      "title": "Start with your number of inches.",
      "content": "Start with your number of inches. Write this number down or type it into your calculator. If you wrote it down, be sure to label it \"inches.\" Let's follow along with an example problem. If we want to figure out how tall a 70 inch-tall girl is in feet, we'll start by writing down 70 inches ."
    },
    {
      "title": "Divide this number by twelve.",
      "content": "Divide this number by twelve. [2] X Research source You're looking for the number of times that 12 fits inside your number of inches. If it fits exactly into your inches a certain number of times, you'll get a whole number as your answer. If it doesn't fit perfectly into your number of inches, you'll get a decimal, a fraction, or a mixed number. In our example, dividing 70 inches by 12 gets us 70 / 12 = 5.83 . We can also write this as 5 & 10/12 (5 & 5/6) or 5 remainder 10 . See below for more information on remainders."
    },
    {
      "title": "Write your answer in feet.",
      "content": "Write your answer in feet. The answer you just got is the number of feet you were looking for. Label it \"feet.\" If you're doing this for school, you may lose points if you forget the label. The answer we got was 5.83, so we would write it as 5.83 feet . The girl is 5.83 feet tall."
    },
    {
      "title": "Get back to inches by multiplying by 12.",
      "content": "Get back to inches by multiplying by 12. [3] X Research source Once you have a feet measurement, just multiply by 12 to get back to inches. [4] X Research source Since multiplying is basically dividing backwards , you'll end up with your original number of inches. In our example problem, 5.83 × 12 = 70 inches . This was our original number of inches."
    },
    {
      "title": "Use the same steps for decimals and fractions.",
      "content": "Use the same steps for decimals and fractions. Inches aren't always written as whole numbers. [5] X Research source If you have an inch measurement that's written as a fraction or decimal, use the same process as above. See WikiHow's guides on dividing decimals and dividing fractions if you need help. Let's use an example problem to show how to do this. We'll figure out how many feet 15.4 inches and 15 & 2/5 inches are. These are the same numbers, just written differently. Decimal: 15.4 / 12 = 1.28 feet Fraction: 15 & 2/5 = (75 + 2)/5 = 77/5 inches. 77/5 inches / 12 = 77/5 × 1/12 = 77/60 feet , or 1 & 17/60 feet"
    },
    {
      "title": "Divide the number of inches by 12.",
      "content": "Divide the number of inches by 12. Instead of using fractions or decimals, feet measurements are often written as a mix of feet and inches. For instance, you might say that someone is \"five feet, nine inches tall\". [6] X Research source Getting these \"feet and inches\" measurements is easy. Start by dividing by 12 — just like normal. For this section, let's figure out how many feet 28 inches is. To start, we'll divide 28 by 12. 28 / 12 = 2.33 ."
    },
    {
      "title": "Find the remainder.",
      "content": "Find the remainder. When you divide a number and it doesn't \"fit\" perfectly, you'll have a little bit left over. This is called the \"remainder.\" For example, when you divide the number 16 by 5, 5 fits in three times, but not perfectly. There is still 1 \"left over.\" This means the answer to 16 / 5 can be written 3 remainder (or \"R\") 1 . Now, look for the remainder in your division problem. [7] X Research source In our example, 12 goes into 28 twice, plus some left over. 12 × 2 = 24. Since 28 is 4 more than 24, the remainder is 4 . We could write our answer, 2.33, as 2 R 4 ."
    },
    {
      "title": "Use the whole number as the feet and the remainder as the inches.",
      "content": "Use the whole number as the feet and the remainder as the inches. Once you know your whole number answer and its remainder, getting a \"feet and inches\" measurement is easy. Your whole number is the number of feet. Your remainder is the number of inches. Write your answer like this: \" x feet, y inches.\" In our example problem, we got an answer of 2 R 4. Since 2 is the whole number, we know we have two feet in our answer. Since 4 is the remainder, we know we have four inches. So, our answer is 2 feet, 4 inches ."
    },
    {
      "title": "To get back to inches, multiply the feet by 12 and add the inches.",
      "content": "To get back to inches, multiply the feet by 12 and add the inches. Getting back to inches for these kinds of measurements is just a little bit harder than normal. Start by multiplying the number of feet by 12. [8] X Research source This will give you a number of inches. Now, just add the other number of inches to get an answer that's only in inches. In our example, we would start by multiplying 2 feet by 12. 2 × 12 = 24 inches. Add the 4 inches to this to get 28 inches . This is our original inches measurement."
    }
  ]
}