{
  "url": "https://www.wikihow.com/Celebrate-Good-Friday",
  "title": "How to Celebrate Good Friday",
  "steps": [
    {
      "title": "Visit your local church.",
      "content": "Visit your local church. For Roman Catholics: There is no mass on Good Friday; however, there is usually a service with Holy Communion. Pray before the Lord in the Blessed Sacrament. The Holy Rosary is especially good prayer for Good Friday. In addition to Holy Mass, many Churches may also have the Stations of the Cross, which may like to attend."
    },
    {
      "title": "Some Christian communities (Catholic and others) hold Passion Plays, which you might like to attend, or perhaps, even participate, or organize.",
      "content": "Some Christian communities (Catholic and others) hold Passion Plays, which you might like to attend, or perhaps, even participate, or organize. If in the event you are hosting guests, you may offer them afternoon tea, with some 'hot cross buns.' These are sticky fruit buns, with some dough at the top, in the shape of a cross. You may have it toasted, or plain."
    },
    {
      "title": "Alternatively, some people fast on Good Friday.",
      "content": "Alternatively, some people fast on Good Friday. Some people refrain from eating at all, and some people eat very lightly. If you are still growing, it might be a good idea to eat lightly. See the section for Byzantine Christians below."
    },
    {
      "title": "At 3:00 PM, if you don't go to Mass, stop what you are doing and pray, if possible.",
      "content": "At 3:00 PM, if you don't go to Mass, stop what you are doing and pray, if possible. Traditionally, Jesus died on the cross at this time."
    },
    {
      "title": "Throughout the day, reflect on the death of Jesus.",
      "content": "Throughout the day, reflect on the death of Jesus. It is the whole idea of Good Friday."
    },
    {
      "title": "Byzantine Catholics are required to fast from all meat and dairy products (eggs included).",
      "content": "Byzantine Catholics are required to fast from all meat and dairy products (eggs included). Orthodox should check the rules of their eparchy."
    },
    {
      "title": "Attend Matins with the reading of the Twelve Passion Gospels and the Entombment Vespers.",
      "content": "Attend Matins with the reading of the Twelve Passion Gospels and the Entombment Vespers."
    },
    {
      "title": "There are many different traditions held by each of the other Christian denominations.",
      "content": "There are many different traditions held by each of the other Christian denominations. The best way to learn what those are is to ask your pastor, minister, priest, or church leader."
    }
  ]
}