{
  "url": "https://www.wikihow.com/Bolt-a-Safe-to-the-Floor",
  "title": "How to Bolt a Safe to the Floor",
  "steps": [
    {
      "title": "Pick a secure and accessible spot for your safe.",
      "content": "Pick a secure and accessible spot for your safe. When deciding where your safe should go, pick a location where a thief would be unlikely to find it, but make sure that spot is also readily accessible. For example, thieves often rummage through bedrooms in a house, so your bedroom might not be the right spot. However, you might not want to put it in a cramped crawlspace, either– your safe should be hidden from view, but easy for you to access when you need to. Take climate into consideration when choosing a spot for your safe. For example, if you live in an area that floods, it's probably not a good idea to bolt your safe to the floor in a basement. On the other hand, if you live in an area with tornadoes, the basement might be a great place to put it."
    },
    {
      "title": "Determine if your chosen location is sturdy and large enough for your safe.",
      "content": "Determine if your chosen location is sturdy and large enough for your safe. Measure the dimensions of your safe in order to figure out exactly how much space you need. If you have a very heavy safe, also consider how much weight your floor can hold and how you will move it into position. For example, an upstairs floor that is made of wood will not hold as much weight as a ground floor or basement concrete floor. [1] X Research source"
    },
    {
      "title": "Select a spot with concrete flooring, if possible.",
      "content": "Select a spot with concrete flooring, if possible. When picking your safe location, consider what kind of flooring you'd be drilling into. In general, it's more secure if you bolt your safe into a concrete floor rather than a wood floor. If you have a choice between these two types of flooring, pick the location with a concrete floor. [2] X Research source"
    },
    {
      "title": "Open the door of the safe and locate the mounting holes.",
      "content": "Open the door of the safe and locate the mounting holes. Most fireproof safes have their mounting holes in the middle of the safe's floor. Other safes will have mounting holes in the bottom corners. Eventually, you'll drill through these openings and insert bolts to secure the safe to the floor. [3] X Research source The holes may be open or may be covered with plastic that is easily broken or popped off when bolting the safe down."
    },
    {
      "title": "Move the safe into its final position.",
      "content": "Move the safe into its final position. Lift the safe with your arms if it's light, or with a hand truck or other tool if it is heavy. Adjust the position until you are happy with how it looks where it is and you are sure that the safe door has clearance to open and close freely. [4] X Research source Even if your safe is heavy and you are hesitant to move it around multiple times, take the time to do this. It's better to make sure that safe will work perfectly in the spot you have chosen than to drill holes and find out that the spacing is wrong or the spot won't work."
    },
    {
      "title": "Mark the hole locations on the floor.",
      "content": "Mark the hole locations on the floor. If you can’t drill the holes through the safe itself because the drill won't fit inside the safe, you should poke a pencil through the safe’s bolt holes while it’s sitting in its planned final position. Then you can move the safe out of the way to drill the marked holes. Move the pen or pencil in a circle around the sides of the entire hole. Then make sure that the mark has been made on the floor by looking through the hole. It's important to make precise marks to ensure that the holes you drill are all in the right spots."
    },
    {
      "title": "Move the safe if there isn't room inside to drill through the holes.",
      "content": "Move the safe if there isn't room inside to drill through the holes. If your safe is too small to get the drill into comfortably, move it out of the way. It can be awkward to get a drill in a safe and the process would make quite a mess in your safe. Instead, just set the safe aside while you drill into the holes you've marked. [5] X Research source By setting the safe aside you will have more room to make sure that your holes are drilled completely perpendicular to the ground. This will help ensure that the bolts you use are secure in the holes."
    },
    {
      "title": "Remove any flooring elements that are in your way.",
      "content": "Remove any flooring elements that are in your way. If you have carpet on the floor where you will be placing the safe, use a knife to cut a circle out of the carpet that is large enough to accommodate the bolt and the mounting hole. You may even consider cutting away all carpet under the safe, as this can prevent you from getting the safe bolted really, really tightly to the floor. [6] X Research source Hard floorings, such as tile or laminate, are usually fine to drill through with a masonry or wood drill bit and they will allow for the safe to be bolted down very securely. If you try to drill right through your carpet, the bit can begin to snag the carpet and unravel it instead of cutting cleanly through it."
    },
    {
      "title": "Drill your mounting holes into the floor.",
      "content": "Drill your mounting holes into the floor. Use the largest diameter drill bit that will fit through the mounting holes on the safe if you are bolting to concrete, but remember that you also need to purchase bolts that same diameter. If you are using toggle bolts, which are best for attaching the safe to a wood floor, you will need to drill a bigger hole than the diameter of the bolt to get the toggles through the flooring. In many cases, the toggle bolt packaging will tell you how big the hole needs to be. [7] X Research source Use a type of drill bit that is appropriate for your specific type of flooring. For concrete floors and floors covered in tile, you will need a masonry drill bit. For wood or laminate floors you will need a wood drill bit. Ensure that your drill bit is the proper length. Most wood floors are about 1 inch (2.5 cm) thick, so your drill bit needs to be at least that long. For concrete floors, the bolts you use will determine how deep the hole needs to be, and thus hold long the drill bit needs to be. Look at the packaging on your bolts to figure out how deep the holes need to be. If you are unsure of what type and size of drill bit to use, go to your hardware store and ask a sales associate for the right one."
    },
    {
      "title": "Vacuum up any dust that was created by the drill.",
      "content": "Vacuum up any dust that was created by the drill. In addition to cleaning up any dust and debris that is on your floor or on the inside of your safe, run the vacuum over the hole to catch any dust that is inside of it. It's important to remove this dust, especially if the hole is in concrete, because if it remains in the hole it will make the bolt attachment less secure. [8] X Research source You can also use a can of compressed air to blow any concrete dust out of the hole and then vacuum up what comes out."
    },
    {
      "title": "Reposition your safe over the mounting holes you've drilled.",
      "content": "Reposition your safe over the mounting holes you've drilled. Line the safe up so that the holes inside of it sit directly over the holes in the floor. Take your time while doing this. The more exact you are about the position of the safe, the easier it will be to insert all of the bolts quickly and securely. It's important that all of the holes you drilled are lined up with the holes in the safe. If a few of them appear lined up and a few don't, keep adjusting. This will prevent you from having to undo bolts you've already inserted because the safe needs to be readjusted."
    },
    {
      "title": "Insert the bolts through the base of the safe.",
      "content": "Insert the bolts through the base of the safe. Slide each bolt in one at a time. Once you put the bolt in the hole, you may need to hammer it 2 or 3 times in order to get it to sit properly all the way in the hole. [9] X Research source When inserting a masonry bolt, it's a good idea to screw the nut onto the top of the threads before hammering the bolt into place. This will preserve the threads on the top of the bolt, making sure the nut can be screwed on and off easily. If you are using a toggle bolt, which has a nut with wings on it, the toggle may not fit through the hole. You may need to insert the bolt through the hole and then tilt the safe so that you can attach the toggle to the bolt on the underside of the safe. If the toggle fits through the hole in the safe, you will fold the wings in so that they fit through the hole. Once through the hole, they will expand automatically and hold the bolt in place."
    },
    {
      "title": "Tighten the nut or the screw head on top of the bolt.",
      "content": "Tighten the nut or the screw head on top of the bolt. Place a washer and a nut on the top of each masonry bolt, if you are using them. Then use a pair of pliers or a wrench to tighten down the bolt. If you are using a toggle bolt, use a screwdriver to turn the bolt until it gets tight, which means that the toggle it gripping into the underside of your wood floor. With both types of bolts, keep turning the nut until it is tight and unable to turn any further. On a masonry bolt, tightening the nut down will expand the sleeve on the bottom of the bolt. This will wedge the bolt to the walls of the concrete around it."
    },
    {
      "title": "Try to move the safe to ensure that it has been bolted successfully.",
      "content": "Try to move the safe to ensure that it has been bolted successfully. Once the bolts are tightened, test the safe by pushing on it in a variety of directions. If it is securely bolted, it should not move at all. If the safe does move, one or several of your bolts may not be secure. Wiggle the bolt heads in the safe and see if any of them move freely. If one does, you need to try to secure it once again."
    }
  ]
}