{
  "url": "https://www.wikihow.com/Clean-the-Filter-on-Your-Air-Conditioner",
  "title": "How to Clean the Filter on Your Air Conditioner",
  "steps": [
    {
      "title": "Determine if you can clean your filter.",
      "content": "Determine if you can clean your filter. Some air conditioners have filters that can be cleaned. But other types of air conditioners have filters that are meant to be disposed of after a given amount of time. Consult your air conditioner’s instruction manual to determine whether cleaning your air conditioner’s filter is an option. [1] X Research source If you have a replaceable filter on your air conditioner, replace it at least every 3 months. [2] X Expert Source Victor Belavus Air Conditioning Specialist Expert Interview. 6 May 2020."
    },
    {
      "title": "Turn the air conditioner off.",
      "content": "Turn the air conditioner off. You should never clean your air conditioner’s filter with the air conditioner on. This will cause a rush of unfiltered air into your residence and cause your air conditioner’s evaporator coils and other internal parts to collect dirt and particulate matter. [3] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source Do not use your air conditioner until you’ve replaced the filter."
    },
    {
      "title": "Access your filter.",
      "content": "Access your filter. On large central air conditioning units, you should be able to locate your filter by looking along the return duct’s length. You might need to unscrew a few screws to access it. In small window-mounted air conditioning units, you’ll have to pop the front face of air conditioner off with a putty knife. [4] X Research source In wall-mounted air conditioners, you might have to slide the front panel off in order to access the filter. [5] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source Consult manufacturer directions for more information on how to access your air conditioner’s filter."
    },
    {
      "title": "Use a vacuum cleaner for routine cleaning.",
      "content": "Use a vacuum cleaner for routine cleaning. Just pop the filter out or unclip it (depending on the make and model of your air conditioner) and use the tube extension on your vacuum cleaner to suck all the grit and dust out of the filter. Replace the filter when you’ve finished cleaning it. [6] X Research source If you’ve taken good care of your air conditioner’s filter, you might not see a visible change in the filter when cleaning it. Rest assured, it is getting clean. On the other hand, you might not be able to get all the dust and grit out of the filter. Just use the vacuum to suck up as much as you can. [7] X Research source This method is best for giving your filter its regular cleaning. However, if you're planning to wash your filter, you should still vacuum it first to remove any large particles. [8] X Expert Source Victor Belavus Air Conditioning Specialist Expert Interview. 6 May 2020."
    },
    {
      "title": "Rinse the filter for a deeper clean.",
      "content": "Rinse the filter for a deeper clean. If, after you’ve vacuumed your filter, it still has a good deal of particulate attached, try washing it. To get started, remove your air conditioner filter. Mix one part vinegar and one part water. For instance, you might mix five cups of water and five cups of vinegar. Pour the mixture in a tub or a wide sink that can accommodate your filter. Submerge your filter in the mixture for at least one hour. If it is exceptionally grimy, leave it in for two hours or more. Drain the water and vinegar solution and dry the filter on a rack. Replace it when dry. Instead of water and vinegar, you could mix a small amount of detergent or liquid dish soap into a volume of water that will cover your filter when it is submerged. You could also soak the filter for about 15 minutes in 1 l (34 fl oz) of water mixed with 30g of citric acid. [9] X Expert Source Victor Belavus Air Conditioning Specialist Expert Interview. 6 May 2020."
    },
    {
      "title": "Hose your filter down.",
      "content": "Hose your filter down. If the weather is nice and your filter is too large to fit in your sink, take your filter outside and lean it against a wall. Spray your hose on the filter. Do not use a pressurized hose nozzle or you might risk tearing or damaging the flimsy filter. [10] X Research source You could also hose your filter down in your shower. Just prop the filter up in your shower and, using your shower’s detachable showerhead, spray the filter’s entire surface, front and back, in a zig-zag motion. After hosing your filter down, allow it to dry, then replace it. For added effect, you could sprinkle a few spoonfuls of baking soda over your filter before spraying it down."
    },
    {
      "title": "Use the automatic cleaning function.",
      "content": "Use the automatic cleaning function. Some modern air conditioners might be equipped with a function that cleans the air filter for you. These air conditioners use an internal cassette and brush device to remove particles from the filter, then deposits the dust and particles in a small chamber from which they are blown outside. If your air conditioner has such a feature, set it to clean your filter regularly. [11] X Research source"
    },
    {
      "title": "Clean your filter regularly.",
      "content": "Clean your filter regularly. Different air conditioners have different filter cleaning requirements. Some filters need to be cleaned once every two weeks. [12] X Research source Some manufacturers recommend cleaning just once every 30 days. [13] X Research source Still others require cleaning only one to four times per year. Consult your manufacturer’s directions for information about how often you should clean your filter. You should clean your filter more frequently if you have pets or allergies, or if you’re using your air conditioner regularly."
    },
    {
      "title": "Discard your filter if necessary.",
      "content": "Discard your filter if necessary. Despite your careful and regular cleaning, your filter will eventually wear out. If you notice any tears, holes, or damage to your filter, replace it with a new one. You can buy an air conditioner filter at your local home appliances store or online."
    },
    {
      "title": "Clean the condenser coils.",
      "content": "Clean the condenser coils. Cleaning the condenser coils can make your air conditioner more efficient and improve its lifetime. If you have a window-mounted air conditioner, you’ll need to blow compressed air in short bursts at the back end of the unit (the part of the air conditioner that sticks out the window). Alternately, use a soft-bristled brush to scrub between the grating of the air conditioner’s intake. Be careful not to bend any of the coil fins. If you want to clean the condenser coils of your large central air conditioner unit outside, remove its outer case, then blow compressed air across its surface in short bursts. You could also choose to use an industrial-strength vacuum fitted with a soft-bristle brush attachment to suck the grime and dirt from where it has collected between the coils."
    }
  ]
}