{
  "url": "https://www.wikihow.com/Clean-Colored-Grout",
  "title": "How to Clean Colored Grout",
  "steps": [
    {
      "title": "Use a steam cleaner.",
      "content": "Use a steam cleaner. Steam cleaners use heat and high pressure to get rid of debris. However, if your grout is very old or damaged, you should avoid using a steam cleaner because it may cause further damage. Heat the steam cleaner and then move the cleaning wand along the surface of the grout lines to get rid of any dirt and debris. [2] X Research source"
    },
    {
      "title": "Start with a mild cleaning solution.",
      "content": "Start with a mild cleaning solution. It is best to try mild solutions first, since they are least likely to damage your colored grout. Start by trying vinegar or baking soda. If that doesn’t do the job, you can move on to hydrogen peroxide, which will work with moderate levels of grime. If your grout lines are really grimy, you may need to use oxygen bleach. However, chlorine bleach should generally be avoided. [3] X Research source Chlorine bleach will discolor your colored grout, so you should leave it in the cupboard. Instead, choose either hydrogen peroxide or oxygen bleach. If your colored grout is dirty around dishwashers or sinks from hard-water deposits, you can use a vinegar solution. In a spray bottle, pour an equal amount of vinegar and water. Spray a bit of the solution on the grout lines. Then, scrub the grout lines with your grout brush. If you don't have a grout brush, a toothbrush will also work. If vinegar alone isn't working, a good alternative is a baking soda and vinegar mix. Wet baking soda with just enough water to make a thick paste. Apply the paste to your grout, then spray it with vinegar. Let the solution sit until it stops bubbling, then scrub the area with a brush. Rinse with clean water and dry with a rag. [4] X Research source"
    },
    {
      "title": "Use oxygen bleach sparingly.",
      "content": "Use oxygen bleach sparingly. Although oxygen bleach does a great job on colored grout, it will eventually wear the color down because of the chlorine. [5] X Research source The main advantage of oxygen bleach is that it requires very minimal scrubbing and does not produce fumes. You can find it at most home, hardware and cleaning supply stores. [6] X Research source"
    },
    {
      "title": "Get rid of surface debris.",
      "content": "Get rid of surface debris. Start by sweeping the floor, wiping off the countertop, walls or other tiled surface. Then, rinse off the surface of the grout to remove surface dirt and debris. [7] X Research source"
    },
    {
      "title": "Mix the cleaning solution with warm water.",
      "content": "Mix the cleaning solution with warm water. Following the directions on the cleaning product, mix your cleaning solution. If you are cleaning a counter, you can use a small plastic bowl. If you are cleaning your floor, you should mix it in your mop bucket. [8] X Research source"
    },
    {
      "title": "Flood the grout lines with the cleaning solution.",
      "content": "Flood the grout lines with the cleaning solution. You will notice that grout lines are slightly depressed from the surface of your counter or floor. Fill these depressions with the cleaning solution and then let it sit for at least fifteen minutes. [9] X Research source"
    },
    {
      "title": "Scrub the grout.",
      "content": "Scrub the grout. After letting the cleaning solution sit for fifteen minutes, use your grout brush to scrub away the grime. Since the cleaning solution will break down dirt molecules, it should be easy to remove them with a gentle scrub. [10] X Research source"
    },
    {
      "title": "Mop the floor with a cleaning solution.",
      "content": "Mop the floor with a cleaning solution. If you are cleaning a floor, you can add a cleaning solution, such as vinegar or oxygen bleach powder, to your mop water. Mop the floor with a liberal amount of the cleaning solution. Then, let it sit for thirty minutes. Finally, put fresh water in your mop bucket and rinse the floor. [11] X Research source If you use vinegar, mix equal parts warm water and vinegar."
    },
    {
      "title": "Apply a penetrating sealer to your colored grout.",
      "content": "Apply a penetrating sealer to your colored grout. A sealer will make your colored grout stain-resistant, since it makes the grout more resistant to oil- and water-based products. If your grout is very soiled, you could also re-apply the color sealant originally used to color the grout. Depending on the amount of wear and tear and the type of sealant you choose, you will need to re-apply it every year or two. If you are not sure whether your grout is sufficiently sealed, drip some water on it. If the water stays on the surface of the grout, it is sufficiently sealed. However, if the grout absorbs the water, you need to reseal the grout. When you purchase the sealer, ask if it is both hydrophobic and oleophobic. Some sealers are only water-repelling or hydrophobic, whereas others will repel both water and oil-based substances."
    },
    {
      "title": "Wipe up spills right away.",
      "content": "Wipe up spills right away. When coffee or soda spills on your colored grout, you should wipe it up right away. This will reduce the amount of work involved in cleaning the grout."
    },
    {
      "title": "Wipe down your shower tiles after showering.",
      "content": "Wipe down your shower tiles after showering. When you finish your shower, use a squeegee to quickly wipe down your shower tiles. This will prevent the accumulation of lime, soap deposits and rust stains on your colored grout."
    }
  ]
}