{
  "url": "https://www.wikihow.com/Cook-Kidney",
  "title": "How to Cook Kidney",
  "steps": [
    {
      "title": "Trim the fat off of the kidney and discard it.",
      "content": "Trim the fat off of the kidney and discard it. Once you have the kidneys and are ready to cook them, you must first rid them of the thick, white sections of fat. Put the kidney on a cutting board and use a sharp kitchen knife to trim off these sections. Instead of discarding the fat, you could set it aside to render it down to use with other recipes. Rendering fat takes several hours—you can do it in a slow cooker or on the stovetop. Put the fat into your slow cooked or into a pan on the stovetop, turn the heat to low, and stir and check it every 20 minutes. It’s ready once the fat has liquidized. Strain the fat to remove any bits of cracklings or gristle, and store it on the counter in a covered container, like a mason jar. [1] X Research source"
    },
    {
      "title": "Remove the grisly membrane from the center of the kidney.",
      "content": "Remove the grisly membrane from the center of the kidney. Slice through the kidney vertically (retaining the kidney shape) to access the tough, white membrane. Use your knife to trim the organ meat from around the membrane to remove it. Put the membrane to the side to discard it later. The membrane is especially tough and hard to cut through, which is why it’s recommended to remove it before cooking the kidneys."
    },
    {
      "title": "Cut the kidney into strips or small pieces, depending on your recipe.",
      "content": "Cut the kidney into strips or small pieces, depending on your recipe. Try your best to cut similar sized pieces to help them cook at the same rate. Strips of kidney are generally used for a quick sauté and diced kidney is usually used in different stews. Kidney can be tough to cut through, so using a sharp kitchen knife is important. If you don’t have a sharp knife, consider buying one from a home goods store or even purchasing a whetstone or honing rod to sharpen your knives at home."
    },
    {
      "title": "Store raw kidney in the fridge for 2 days or in the freezer for 4 months.",
      "content": "Store raw kidney in the fridge for 2 days or in the freezer for 4 months. If storing it in the fridge, keep the kidneys in the original packaging or in a clean, air-tight container until you’re ready to prep it for your recipe. If freezing the kidneys, keep them in their original casing and wrap that in foil or plastic wrap. [2] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Write the purchase and use-by dates on the package when freezing kidneys to help you remember how long they will be good for."
    },
    {
      "title": "Trim the fat and membrane from the kidneys and slice them in half.",
      "content": "Trim the fat and membrane from the kidneys and slice them in half. Use a sharp knife and a clean cutting board, and set aside the fat and membrane to discard of later. Be careful when cutting away the tough membrane to not cut your fingers. [3] X Research source You can reserve the fat from the kidneys to render down later, but the membrane needs to be discarded. Rendering fat takes several hours. Put the fat into your slow cooker or into a pan on the stove, turn the heat to low, and stir and check it every 20 minutes. Let it cook until the fat has turned to liquid. Strain the fat to get rid of any gristle, and store it on the counter in a covered container. [4] X Research source"
    },
    {
      "title": "Marinate the kidneys in an olive oil and herb mixture.",
      "content": "Marinate the kidneys in an olive oil and herb mixture. In a small bowl, mix 1 ⁄ 2 cup (120 mL) of olive oil for each pair of kidneys you have, and add whatever herbs you prefer (sage, garlic, rosemary, and thyme all go well with kidneys). Use 1 ⁄ 2 teaspoon (2.5 mL) to 1 tablespoon (15 mL) of herbs. Place the halved kidneys into the marinade and let them sit for at least 2 hours and no more than 6 hours, as kidneys are best prepared and served the same day they are trimmed. You can leave them on the counter or put them back into the fridge. [5] X Research source If you will be marinating the kidneys for more than 2 hours, put them into the fridge. Try tossing the kidneys in the marinade with a spoon a few times to make sure each side is coated."
    },
    {
      "title": "Remove the kidneys from the marinade and place them on a hot grill.",
      "content": "Remove the kidneys from the marinade and place them on a hot grill . You can also use a griddle, a cast iron pan, or a grill pan if you don’t have a charcoal or gas grill at home. For these alternate grill methods, heat them to 350 °F (177 °C). Avoid putting the kidneys onto a grill that hasn’t fully heated yet, as they won’t cook properly and will probably burn by the time the grill is fully heated. [6] X Research source Test the temperature of your grill by using the hand test: put your hand 6 inches (15 cm) about the grill, and count how many seconds it takes for your hand to get hot. A fully heated gas or charcoal grill will make you pull your hand away in about 3 seconds. You don’t need to spray the grill or pan with any cooking oil—the marinade will provide some oil so the kidneys don’t stick to the grill."
    },
    {
      "title": "Cook each side of the kidneys for no longer than 2 minutes.",
      "content": "Cook each side of the kidneys for no longer than 2 minutes. Kidneys are easy to dry out and overcook, so you just want to get a good char on the outside while leaving the inside pink. You can check the internal temperature with a meat thermometer to ensure it is reaching the 150 to 160 °F (66 to 71 °C) range. [7] X Research source Depending on the size of your kidneys, you may need to add or take away a minute of cooking. The best rule to remember for kidneys is that the pinker the meat, the tastier it will be."
    },
    {
      "title": "Take the kidneys off of the grill and transfer them to a serving plate.",
      "content": "Take the kidneys off of the grill and transfer them to a serving plate. You can top the kidneys with salt and pepper and serve them with many different side dishes, like rice , salad, potatoes, or pasta. Kidneys taste the best when they are fresh and just cooked, so don’t wait too long to serve them! [8] X Research source If you’re trying kidneys for the first time, you could serve them as the side dish rather than the main component of the meal. Try serving them along with a shepherd’s pie or a potato soup."
    },
    {
      "title": "Store the leftovers in the fridge in an airtight container for 3-4 days.",
      "content": "Store the leftovers in the fridge in an airtight container for 3-4 days. You can reheat them in the microwave for 2-3 minutes, or toss them in a hot pan with some oil until they are warm all the way through. They are best when fresh, so make sure to use them quickly or discard of them after the 3-4 days have passed. [9] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Set a reminder in your phone or label the container with the “use by” date so you don’t forget how long the kidneys will be good for."
    },
    {
      "title": "Cut off the fat and membrane from the kidneys.",
      "content": "Cut off the fat and membrane from the kidneys. Use a sharp knife or kitchen shears and a clean cutting board, and set aside the fat and membrane to throw away later. You can leave the kidneys whole, slice in half lengthwise, or cut them into small bite-size pieces. Save the kidney fat if you want to render it down to use later on, which can take several hours. Use a slow cooker or a saucepan on the stove. Put the fat into the slow cooker or saucepan, turn the heat to low, and stir and check it every 20 minutes. Once it has become a liquid, it is finished. Strain the fat to remove any gristle or cracklings, and store it on the counter in a covered container. [10] X Research source"
    },
    {
      "title": "Melt some butter in a skillet over medium heat for 1-2 minutes.",
      "content": "Melt some butter in a skillet over medium heat for 1-2 minutes. Use 2 tablespoons (30 mL) of butter for 2 kidneys. Watch the butter closely until you see it start to bubble. Continue turning the skillet to coat the bottom of the pan with the butter until the bubbles start to go down. Be careful to not burn the butter. If you notice the butter is disappearing or turning brown, lower the heat."
    },
    {
      "title": "Add the kidneys to the pan and cook them for 3-4 minutes per side.",
      "content": "Add the kidneys to the pan and cook them for 3-4 minutes per side. If you notice the butter on the bottom of the pan starting to burn, reduce the heat from medium to medium-low. Keep an eye on the exterior of the kidneys—they should be a light brown color but should not burn. Check the internal temperature with a meat thermometer to ensure it is reaching the acceptable 150 to 160 °F (66 to 71 °C) range. Try tossing the kidneys in the butter when you first add them to the pan to coat them evenly in the butter. You can sprinkle the kidneys with salt and pepper when you add them to the skillet, too, if you like."
    },
    {
      "title": "Remove the kidneys from the skillet and put them on a serving plate.",
      "content": "Remove the kidneys from the skillet and put them on a serving plate. Sautéed onions and mushrooms complement the flavor of the kidneys well, and serving them with rice or on top of toasted bread are popular options, too. You can pour the leftover butter on top of the kidneys, too. Kidneys are best when eaten soon after preparing them, so don’t wait too long to serve them."
    },
    {
      "title": "Store the leftovers in an airtight container in the fridge for 3-4 days.",
      "content": "Store the leftovers in an airtight container in the fridge for 3-4 days. You can reheat kidneys on the stovetop until they are warmed all the way through, or in the microwave for 2-3 minutes. Just be aware that it is easy for them to get dried out and tough when reheated, so you may want to eat leftovers with some kind of sauce, like a simple gravy. [11] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Label the container with the date the kidneys were prepared so you don’t forget how long they’ve been in the fridge."
    },
    {
      "title": "Remove the fat and membrane from the kidneys and slice them in half.",
      "content": "Remove the fat and membrane from the kidneys and slice them in half. Use a sharp kitchen knife to trim off the white, fatty sections and to remove the thick membrane. You can set these aside to discard later, or you can reserve the kidney fat to render. [12] X Research source Rendering fat can take several hours. Use a slow cooker or a pan on the stovetop. Put the fat into your chosen vessel, turn the heat to low, and stir and check it every 20 minutes. It’s ready once the fat has become a liquid. Strain the fat to remove any bits of gristle, and store it on the counter in a covered container. [13] X Research source You could also use kitchen shears to trim away the fat and the membrane."
    },
    {
      "title": "Dust the kidneys with the seasoned flour.",
      "content": "Dust the kidneys with the seasoned flour. Use 2 US tbsp (30 mL) of flour mixed with a pinch each of salt and pepper. You can either place the kidneys in a bowl with the flour and toss them around, or simply sprinkle the flour overtop of the kidneys while they’re still on your cutting board. Make sure to coat both sides of the kidneys. [14] X Research source A “pinch” of salt and pepper is generally how much seasoning you can pick up between your thumb and first finger. If using a shaker, just use 1 or 2 shakes."
    },
    {
      "title": "Mix the butter with the dry and wet ingredients.",
      "content": "Mix the butter with the dry and wet ingredients. You will need 2 US tbsp (30 mL) of soft butter, 1 ⁄ 2 tsp (2.5 mL) each of cayenne pepper and mustard powder, and 1 tsp (4.9 mL) each of Worcestershire and anchovy sauce. Combine all these ingredients together in a small mixing bowl. [15] X Research source You can also use 2 mashed or pureed anchovies in lieu of the anchovy sauce."
    },
    {
      "title": "Heat a small frying pan over medium heat and add the butter mixture.",
      "content": "Heat a small frying pan over medium heat and add the butter mixture. Let the butter melt in the pan for 1-2 minutes, rotating the pan periodically to coat the bottom. Taste-test the butter and adjust the seasonings to match your taste preferences. [16] X Research source If the butter starts to brown, reduce the heat."
    },
    {
      "title": "Add the kidneys to the pan and cook for 2 1/2 minutes per side.",
      "content": "Add the kidneys to the pan and cook for 2 1/2 minutes per side. As you pick up the kidneys to put them into the pan, give them a quick shake to disperse any excess flour. When your kidneys are finished, they should be seared on the outside and warm all the way through. If you want, use a meat thermometer to check that the internal temperature is in the 150 to 160 °F (66 to 71 °C) range. [17] X Research source Avoid overcooking the kidneys as they will become tough to chew."
    },
    {
      "title": "Toast",
      "content": "Toast the bread while the kidneys are cooking. Use a toaster or another skillet on the stovetop. You can use regular sandwich bread, but something a little heartier would work best since you’ll be loading the bread up with the kidneys and the sauce from the pan. A multi-grain bread or french loaf will toast well. [18] X Research source Instead of toast, you could serve the deviled kidneys with white rice."
    },
    {
      "title": "Top the toast with the cooked kidneys and the butter sauce.",
      "content": "Top the toast with the cooked kidneys and the butter sauce. You can eat the toast by hand, or place it on a plate and cut it with a fork and knife for a tidier eating experience. Kidneys are quick to cook and make a nice lunch or dinnertime meal. [19] X Research source Garnish the toast with fresh parsley for a burst of green."
    },
    {
      "title": "Store leftovers in an airtight container in the fridge for 3-4 days.",
      "content": "Store leftovers in an airtight container in the fridge for 3-4 days. To reheat them, simply put them into a skillet over medium heat for 5-6 minutes, or until they are heated through. Kidneys are best served fresh and right after they’ve been cooked, so try to use leftovers quickly. [20] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Use a piece of masking tape on the airtight container to write the date you cooked the kidneys—that way, you will remember how long they’ll be good for."
    }
  ]
}