{
  "url": "https://www.wikihow.com/Come-to-Terms-with-Feeling-Ugly",
  "title": "How to Come to Terms with Feeling Ugly",
  "steps": [
    {
      "title": "Confront beauty standards.",
      "content": "Confront beauty standards. The way you see yourself is shaped by forces that have very little to do with reality. Beauty standards are contradictory and ever-changing. They tend to reflect imbalances of power—racism, ageism, ableism, sexism. When you have a negative thought about your own looks, ask: what is making me feel this way? Am I holding myself up to a standard that is destructive? Understand that: Watching a lot of television makes most people wish they looked different. Why some features might be used in advertisements has very little to do with what is attractive in real life. Advertisements are not always real. People's bodies in advertisements are often made \"perfect.\" If someone had no wrinkles or fat or asymmetry at all in real life, they would look frightening. Different kinds of beauty are prized for different reasons. For instance, runway models have skinny bodies so that they don't distract from the clothing they present."
    },
    {
      "title": "Collect role models.",
      "content": "Collect role models. Nobody's looks are unique. Find beautiful people who have your looks. It is hard to really see yourself when you are surrounded by people who don't look like you. Remember the parable of the ugly duckling: it's not that he became beautiful when he grew up—it's that he was judged out of context when he was young. If you want, find a role model that has the same features as you so you don't have to change a thing! Gather images of people you find beautiful who have features in common with you. Find pictures and paintings of people with your hair, your body type, skin like yours, and similar eyes, noses, and mouths. Look in magazines, museum catalogs, and on the internet. Find images of people from the countries your ancestors came from. Look for pictures of beautiful people from all different eras. You'll notice that the standards of beauty change constantly, and are never singular, even within a country or a year. Hang the pictures in your room. Dress up as one of your famous beauty icons for a costume party."
    },
    {
      "title": "Accept compliments.",
      "content": "Accept compliments. When someone says that you look good, believe that they are sincere in their belief. You don't have to think that you look good to believe that others think you look good. Say \"thank you,\" and give your admirer a compliment in return. When someone is into you, believe it. People with low self-esteem turn down dates because they have trouble accepting the offer. Take the date! Ask the people you date what they like about you. You'll be surprised by the things that attract them. Make sure to tell them what you like about them! Thoughtful, sincere compliments are attractive, too."
    },
    {
      "title": "Name your feelings.",
      "content": "Name your feelings. When unpleasant thoughts and feelings come to you, name them. When you notice that you are distressed, ask \"why am I feeling bad all of a sudden?\" Then look for triggers, such as being bombarded by ads, being blown off by friends, or being hungry or tired. Finally, name the feeling. Recognize visits from the \"I'm ugly!\" feeling, or the \"I should lose weight\" feeling, or the \"only beautiful people can ever be happy\" feeling. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You don't have to fight these feelings. Just name them and let them go. If they won't leave, tell them to go. \"Only-beautiful-people-can-ever-be-happy feeling, leave. I'm tired, and you always show up when I'm tired. However, I'm about to rest and I need you to not bother me with your nonsense.\" Love yourself before you try to change anything. Accept your looks and accept your feelings. If you try to change or \"fix\" yourself without first thinking about your human value, you may not make good progress. [3] X Research source Ask yourself \"do I deserve happiness? Do I matter, just as I am?\" If you can say yes to these things, you are on the right track."
    },
    {
      "title": "Dismiss the haters.",
      "content": "Dismiss the haters. When other people insult you or try to fix you, shut them down or ignore them. When someone insults you, that means something is going on with them. Nobody who is happy, healthy, or secure bothers to insult other people. Instead of insulting back or getting upset, shut the interaction down succinctly. Say something like \"grow up,\" or \"deal with yourself.\" Don't insult yourself by taking the insult seriously, but do let yourself feel as upset as you want. Just remind yourself that you are upset because someone was unkind, and was trying to trigger your insecurities. Name how you feel. Get rid of \"friends\" who try to make you feel bad about yourself. Keep friends who are supportive and kind. Try not to be offended if someone offers you beauty advice. Instead, you might consider making friends with someone who seems to know a lot about hair styling, makeup, and other beauty topics. You might enjoy learning about these things and possibly even gain more confidence as a result of your new beauty knowledge."
    },
    {
      "title": "Use loving language to describe yourself.",
      "content": "Use loving language to describe yourself. When you hear yourself getting down on yourself, stop. Treat yourself the way you would treat a beloved friend. Would you call your friend \"ugly\" or criticize them? Would you think about their looks all the time? Write a letter to yourself describing yourself like a good friend would. Pause when you notice yourself writing something that feels insincere or forced. Try to put down exactly how you would be viewed by someone who loves you. Remember that the word \"ugly\" is rarely used, except by unhappy teenagers and unusually insecure adults. If you refer to yourself as ugly, you will probably surprise and upset those around you. Ask yourself, would I describe any of my friends as ugly? Unless you are feeling terrible about yourself, you are unlikely to think anyone else is ugly. Reader Poll: We asked 121 wikiHow readers if they think mantras and affirmations help boost their mood, and 74% of them said yes. [Take Poll] Repeating a mantra or affirmation can help you feel more confident!"
    },
    {
      "title": "Get help from others.",
      "content": "Get help from others. If you are seriously down on yourself, if you cannot come to terms with the feelings you are having, get professional help. See a doctor or a mental health professional if you are having thoughts of self-harm. If you are depressed, if you are avoiding activities you love, if you are too anxious to socialize or do your work, get help. See a doctor if your body image does not conform to what others tell you, or if you think about your looks for more than a few minutes a day. [4] X Research source"
    },
    {
      "title": "Identify your passion.",
      "content": "Identify your passion. You may feel better about your life and yourself if you are doing something that you really love to do. Take some time to think about what you are passionate about. Write down your thoughts so that you can read over them and use them to help you develop your talents. Some good writing activities to help you identify what you are passionate about include: Thinking about what you wanted to do as a child . What did you love to do when you were a kid? Did you enjoy playing softball? Drawing? Dancing? Or something else? Write about what you remember loving to do as a child. Making a list of people you look up to . Try making a list of all of the people who you admire most. Write about what you admire about them and how that might translate into your passion. Imagining what you would do if you knew you would succeed . Take a minute to imagine that you could have guaranteed success at anything you choose. What would you do if you knew you could not fail? Write about your answer."
    },
    {
      "title": "Cultivate your talents.",
      "content": "Cultivate your talents. Once you know what makes you happy, find ways to do these things more often. This can be as simple as turning one of your passions into a hobby or it might be more complex, such as changing careers. If your passion is something that is hard to break into, such as acting, then try joining a local club or take a class to give yourself an outlet for your passion. Pay attention to how you feel when you are using your talents. You should notice that you have a light, happy feeling. This can help you to confirm that you are truly passionate about this activity. If you notice a heavy, unpleasant feeling, then you may need to reevaluate."
    },
    {
      "title": "Embrace your powers of attraction.",
      "content": "Embrace your powers of attraction. Beauty and attractiveness are not the same thing. Attraction is the force that draws others to you. Being typically beautiful can contribute to make someone attractive. However, many other qualities create attraction. Intelligence, kindness, confidence, health, and humor are all attractors. People who have a realistic self-image, who are emotionally grounded, and who take good care of themselves are considered attractive. [5] X Research source"
    },
    {
      "title": "Wield external powers of attraction.",
      "content": "Wield external powers of attraction. Aside from your personal powers, there are other powers of attraction available to you. The way you walk, hold yourself, smile, and laugh can all be powerful attractors. Walk with grace, and rest in relaxed postures. Stand up straight when you can. Smiling is one of the most attractive things you can do. When you enter a room, smile at the people in it. Make eye contact when you smile. [6] X Research source Wearing red is attractive. For some reason, having bits of red in your outfit can attract positive attention. Even having a red bag or red sneakers can make a difference. [7] X Research source Go light on makeup. Wearing a little makeup can make you look more beautiful, but wearing too much can lower your powers of attraction. People respond to your natural looks, so wear makeup to touch up, not cover. [8] X Research source"
    },
    {
      "title": "Look your best.",
      "content": "Look your best. You will feel your best when you put yourself together. Shower frequently, and wear clothes that fit the body you have. Talk to sales clerks and get fitted to make sure your clothing is not too tight or too loose. Wear clean clothes in colors that look good on you. Wear styles that say something about who you are: for instance, if you like a type of music, wear clothes associated with that style. Even if you wake up and feel like a lost cause, dress up as if you feel like a million bucks. It will help. You don't have to spend a lot of money on clothing. Wear clothing that highlights parts of yourself you consider beautiful, but don't try to hide any part of your body. Your body is here to stay. Find a hair-care, skin-care, and style routine that you enjoy. Getting ready for the day should be a pleasure, not a chore."
    },
    {
      "title": "Take care of your health.",
      "content": "Take care of your health. Sleep, eat, and exercise at a normal pace. Adults need 7-8 hours of sleep a night, and teenagers need 9-11. Being tired can cause weight gain and health problems. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Eat regular meals, but eat a variety of foods. Eating many kinds of food will get you the nutrients you need. [10] X Research source Eat fruits and vegetables every day, as well as lean protein, like eggs, skinless chicken, and beans, and complex carbohydrates, such as whole wheat pasta, brown rice, and whole wheat bread. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Get regular exercise. Adults should get 150 minutes of moderate aerobic activity or 75 minutes of vigorous aerobic activity a week. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Watch out for eating disorders.",
      "content": "Watch out for eating disorders . Eating disorders are extremely dangerous medical conditions. If you have signs of an eating disorder, seek medical help immediately. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Anorexia is a common eating disorder. Some signs of anorexia are that you restrict what you eat, think about the food you eat constantly, feel guilty about eating, or feel fat even though others do not think you are. Excessive exercise is another possible symptom. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Bulimia is an eating disorder in which you binge-eat food and then vomit, exercise, or use laxatives to purge yourself of the calories. If you feel obsessed by your body weight, feel guilty about eating, feel like you can't control what you eat, or eat large amounts of food, get checked for bulimia. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Binge-eating is a related eating disorder. If you overeat, but do not purge, get checked by a doctor. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}