{
  "url": "https://www.wikihow.com/Clean-Ps5",
  "title": "How to Clean Your PlayStation 5 Safely: Intakes, Fan, & More",
  "steps": [
    {
      "title": "Unplug your PS5 from power.",
      "content": "Unplug your PS5 from power. Before you begin cleaning your PlayStation 5, make sure it isn't plugged in so you don't get an electrical shock . [1] X Research source"
    },
    {
      "title": "Take off the case covers.",
      "content": "Take off the case covers. Gently tug on the edge with the PS logo and slide the rest of the cover downwards. Repeat those steps to remove the other cover. Since there isn't a logo on this side, use the same edge you pulled off on the other side. This is easier if you rotate a vertical console to lay horizontally."
    },
    {
      "title": "Brush the intake vents.",
      "content": "Brush the intake vents. Using a brush with soft bristles, like an old toothbrush or small clean paintbrush, run it along the vents to remove any dust buildup. Repeat this on the other side of the PS5."
    },
    {
      "title": "Blow the remaining dust with canned air.",
      "content": "Blow the remaining dust with canned air. If the brush leaves behind dust, you can use a can of compressed air to blow it away. Use short, quick bursts of air instead of long steady streams. Repeat this on the other side. If you don't have compressed air, you can also use a very low-powered vacuum."
    },
    {
      "title": "Loosen caked-on dust and grime on the inside of the covers.",
      "content": "Loosen caked-on dust and grime on the inside of the covers. If you had a quality amount of dust or hair on the intake vents, you might have some dust built up on the insides of the casing that you removed earlier. Using a soft brush, scrub loose the dust that you can see. Once the dust is loose, use canned air to clear it away. Dampen a microfiber cloth, or other lint-free cloth, with a tiny bit of isopropyl alcohol. You can also use alcohol wipes if you have them. Then, wipe the insides of both cases down."
    },
    {
      "title": "Put the covers back on (if you're done).",
      "content": "Put the covers back on (if you're done). If that's all the cleaning you're planning on doing, replace the covers so you can use the PS5 again. [2] X Research source If you feel comfortable opening your console to clean the fan and heat sink, you can continue to Part 2 . If you need to, clean any game discs that are skipping or visibly dirty."
    },
    {
      "title": "Pull off the intake fins.",
      "content": "Pull off the intake fins. This is the curved intake vent area that you previously cleaned. Simply pull up on it, and it'll come off, allowing you to access the fan case. [3] X Research source If you aren't comfortable taking apart your PS5, you don't have to do this part! Instead, you can simply use a vacuum with a small nozzle to suck the dust out of the air holes next to the fans. There's one hole on both sides of your console."
    },
    {
      "title": "Remove the 4 screws around the fan plate.",
      "content": "Remove the 4 screws around the fan plate. Using a T8 or T9 screwdriver, remove the screws that keep the plate on the fan."
    },
    {
      "title": "Remove the black adhesive piece.",
      "content": "Remove the black adhesive piece. It's the large black plastic lightweight area next to the fan where you can find the fan connection. [4] X Research source"
    },
    {
      "title": "Disconnect the fan.",
      "content": "Disconnect the fan. You need pliers to pinch the white piece (not the yellowish piece, which connects to the motherboard) and pull it out. Wiggle the connection back and forth to get it out."
    },
    {
      "title": "Pull the fan out.",
      "content": "Pull the fan out. Now that it's disconnected, you'll be able to simply pull the fan out of your console."
    },
    {
      "title": "Clean the fan.",
      "content": "Clean the fan. Using your soft-bristled brush, scrub away the dust you can see. [5] X Research source Once the dust is loose, you can use a vacuum to finish cleaning. Check the fan plate to see if you need to use your brush to clean off any dust there before you reassemble the fan."
    },
    {
      "title": "Brush out the heat sinks.",
      "content": "Brush out the heat sinks. If you stand your console up while the fan is out, you'll be able to see the brassy-looking heat sinks that surround the fan. With your soft-bristled brush, clean out the heat sinks, then, use a vacuum to get the last bits of dust out of your console. Make sure that you're wearing an anti-shock bracelet or another grounding tool to prevent yourself from shocking your console and damaging it. If you notice that there's a lot of dust and debris in the heat sinks, you may want to reconsider where your PS5 normally sits. If your console continues to gather dust and debris over a period of time, it may become slower or unresponsive."
    },
    {
      "title": "Reassemble your PS5.",
      "content": "Reassemble your PS5. Put the fan back in the fan hole, reconnect it, replace the black adhesive pad, screw the fan plate back on, replace the intake vent piece, and put the case covers back on. You now have a clean, dust-free PS5!"
    }
  ]
}