{
  "url": "https://www.wikihow.com/Begin-Selling-Avon",
  "title": "How to Begin Selling Avon",
  "steps": [
    {
      "title": "Apply to become an Avon sales representative.",
      "content": "Apply to become an Avon sales representative. You can do this online via Avon's website and a person from Avon's corporate office will get back to you. Go to the \"Your Avon\" website and click on \"Apply Now.\" You will need to supply your name, address, contact information, and preferred language (currently, you can choose English or Spanish). [1] X Research source Click \"Submit\" and wait to be contacted by an Avon representative to complete the sign-up process. Alternately, you can contact an Avon representative and sign up with them. If you know someone selling Avon, ask them to help you sign up. They receive incentives for recruiting other members. [2] X Research source"
    },
    {
      "title": "Complete your discussion with the corporate representative.",
      "content": "Complete your discussion with the corporate representative. This is not an interview per se, just an informative phone meeting so you can learn more about how the business functions and what it takes to become an Avon rep. If there is an Avon representative in your area, they will ask to meet with you at this time and discuss the process over coffee or lunch so that they can give you more information about Avon. This person will become your mentor if you have any questions as you build your business. [3] X Research source"
    },
    {
      "title": "Pay the fee to get started.",
      "content": "Pay the fee to get started. Avon is available all around the world, so check with your local office to find out what fee you will pay. In the United States, the fee is $25 and pays for a starter kit, including sales information, your first order forms, brochures, and a website where your customers can purchase things and have it credit your account. In most cases, the starter kit will be mailed to you. [4] X Research source"
    },
    {
      "title": "Start your online training.",
      "content": "Start your online training. Avon offers full training online for both new reps and those who already have some experience. Check out the product lines while you're at it; you will need to know these thoroughly if you want to be a successful Avon representative."
    },
    {
      "title": "Set up your website.",
      "content": "Set up your website. This will probably be one of your main sources of income. Avon provides each representative with a personalized website they can use to take orders, give information about the products and disseminate contact information. Name your website URL something that's easy to remember; it could be your name or something that grabs prospective customers' attention. Even though Avon is called a \"direct selling\" company, you don't have to go door-to-door to sell it anymore. You can use your website to sell Avon to customers who are not even near you geographically, for example, by sending the link to your online store to family in another state. In fact, some Avon reps sell exclusively online. [5] X Research source"
    },
    {
      "title": "Order extra materials to get started.",
      "content": "Order extra materials to get started. New Avon sales representatives get a discount on samples, so stock up while you can. You will also receive free brochures to assist you in selling Avon. Order some business cards with your name, phone number, email address and website printed on them. You have to pay for all of the sales materials you order, but according to Avon, these start up costs are usually recovered in the first month of your business. [6] X Research source"
    },
    {
      "title": "Spread the word.",
      "content": "Spread the word. It's important that you let everyone know that you're now selling Avon; customers won't just come to you! Distribute brochures to friends, family members, co-workers and people at your church, gym, grocery store or anywhere else you frequent on a regular basis. Consider asking local businesses if you can leave the brochures in the break room or front lobby. Be sure to attach your business card to the brochures so people will know who to contact when they want to purchase Avon products. Utilize social media, especially if you have a lot of friends or follows on websites like Facebook or Twitter. Let everyone know you are now selling Avon and post about products you love. Try not to overdo it, since most people don't appreciate having their feeds overwhelmed with sales pitches. The best posts are those that give your personal experience with products that you love. Consider setting up a party to help you get started selling Avon products. While parties are not required, it can be a useful selling tool."
    },
    {
      "title": "Form relationships.",
      "content": "Form relationships. Avon and other direct-selling businesses succeed or fail based on your ability to reach out to people and create loyal clients. This means you have to be willing to put yourself out there and start conversations! Consider everyone you meet a potential customer. This includes people at church, other parents in the PTA, people at work or at your spouse's work, and the people you chat up at the playground. Avon gives its new representatives the suggestion that they should try to talk to three people about Avon every day. That might seem like a lot, but when you realize that most of those conversations will not result in a sale, it isn't that many after all."
    },
    {
      "title": "Use your products.",
      "content": "Use your products. Avon makes all types of products, from make-up, shampoo, and conditioner, to clothing, shoes, and jewelry. They even make décor, gift items, and toys for children. When you use your own products, you are better equipped to talk up the benefits. Plus, if you receive a compliment on your eye shadow or shoes, you can launch into a pre-planned sales pitch about Avon and the affordable price of the item."
    },
    {
      "title": "Recruit new reps.",
      "content": "Recruit new reps. Avon leadership involves recruiting and mentoring new sales reps, and results in bonuses and residual income whenever your new recruits make sales goals. In order to recruit new representatives, you have to meet certain sales goals and become qualified to be an official leader."
    }
  ]
}