{
  "url": "https://www.wikihow.com/Be-a-Better-Stage-Actor",
  "title": "How to Be a Better Stage Actor",
  "steps": [
    {
      "title": "Meet a wide array of people and observe them.",
      "content": "Meet a wide array of people and observe them. People watching is a great way to learn how to mimic expressions, gestures, and tones of voice. Observe strangers while you’re out and about, and try to interact with a diverse range of people. Paying attention can inspire you to come up with the details that make a performance great. [1] X Research source Coffee shops, restaurant patios, malls, and grocery stores are all great people watching places. If you're in line somewhere, say hello to the people next to you and try to strike up a conversation."
    },
    {
      "title": "Watch as many performances as possible.",
      "content": "Watch as many performances as possible. You can find plenty of live performances on YouTube, Netflix, and other services. In addition to performances of your play, watch anything else you can as time allows. Watch with a critical eye and note how you might have made an expression or delivered a line differently. [2] X Research source"
    },
    {
      "title": "Learn from the other actors in your play.",
      "content": "Learn from the other actors in your play. It is not cheating or copying to learn from others. Watch other actors in your productions and see what they do with the parts they're given. Try to notice things they do that you might incorporate into your own acting style. [3] X Research source Don't be shy about asking more experienced actors in your play for help. Ask them for notes, advice, and tricks of the trade."
    },
    {
      "title": "Get as much practice as possible.",
      "content": "Get as much practice as possible. Do your best to actually act, instead of just going to one audition after another. If you’re trying to break into professional theater, that might mean taking a role in a community production without getting a paycheck. Look at it as a chance to hone your craft instead of a step in the wrong direction. You’ll have a chance to play more challenging roles, learn from different directors and choreographers, and gain more knowledge of how a production works."
    },
    {
      "title": "Memorize your lines",
      "content": "Memorize your lines . The first step to delivering a masterful performance is memorizing your lines. If you don’t have to worry about your lines, you’ll be able to concentrate on your mechanics and character development. [4] X Research source Read your lines at every opportunity, recite them over and over, and copy them by hand to help commit them to memory. If you have a long passage, say the first line over and over until you remember it, then add the next line. Add one line at a time until you’re comfortable with the entire passage."
    },
    {
      "title": "Enunciate your words.",
      "content": "Enunciate your words. Enunciation, or speaking clearly, is a vital part of stage acting. Exaggerate your pronunciation so that audience members in the last row will be able to understand every syllable. [5] X Research source Try practicing tongue-twisting vocal exercises, such as, “A proper copper coffee pot,” or “Knit kilts for nasty cold nights.” Even if you’ll be using a microphone system, your audience won’t understand you if you mumble your lines."
    },
    {
      "title": "Work on projecting your voice.",
      "content": "Work on projecting your voice. Fill your belly up with air and use your diaphragm to support your speech. Try to speak clearly and loudly without changing the tone of your voice. Proper projection sounds like talking, but can be heard at a distance. Shouting, on the other hand, is when the tone of your voice becomes harsh and grating. [6] X Research source If you have access to your performance space, have someone sit in the last row while you practice projecting your lines. They can let you know how audible you are and whether the quality of your voice changes. Try to find a large hall or similar space if you don't have access to your performance location."
    },
    {
      "title": "Exaggerate your expressions, but keep them natural.",
      "content": "Exaggerate your expressions, but keep them natural. Facial expressions and gestures should be more intense. That way, the emotions they convey will be clear from a distance. However, you don’t want to over-act and seem unnatural. [7] X Research source Try setting up a mirror or video camera and stand as far away from it as possible. Practice exaggerating your expressions and try to find your balance between clarity and staying natural. Getting notes from your director or theater-loving friend is also useful. It helps to know the size of your performance space. In a small intimate setting, you won’t need to exaggerate your expressions the way you would in a large theater."
    },
    {
      "title": "Sync your expressions with the play’s text.",
      "content": "Sync your expressions with the play’s text. Work on your timing so your expressions don’t anticipate or spoil the next line. Instead of just waiting for another actor to finish speaking, look at them and actively listen as if you’ve never before heard those words. Try not to know more than your character knows at that moment - be genuinely surprised, elated, angry, or sad. [8] X Research source For example, if your character learns something upsetting, you have to emote at exactly the right moment. Poor timing would ruin the illusion by reminding the audience that you've memorized a script. Think carefully about how to naturally time your expressions. If your character has just learned that their romantic interest is dead, would it take a moment or two to comprehend the news? Should you first convey shock and disbelief, then build into grief or rage?"
    },
    {
      "title": "Enroll in acting classes.",
      "content": "Enroll in acting classes. Get referrals from other actors or search online for classes in your area. Think about your needs and choose a class that focuses on an area that would most benefit you. Look for a teacher who's tough, honest, and has plenty of teaching experience. [9] X Research source You'll find a range of available classes. If you want to work on reactions and concentration, improv might be best for you. A technique-focused class, like one on a specific acting method, might be best if you want to work on immersing yourself in a character. Go a teacher with years of proven teaching experience over flashy acting credentials. Just because someone has an impressive acting resume doesn't mean they're a great acting teacher. Depending on the prestige of the school or instructor, you might find courses that cost anywhere between $150 and $2000 (US). [10] X Research source Choose one that's in your budget with the smallest class size. One on one time with a good teacher is better than being in packed class with a prestigious name."
    },
    {
      "title": "Research your character.",
      "content": "Research your character. Whether you’ve been cast in a role or are auditioning, spend as much time as you can learning about your character. Figure out who they are and what their world is like. The script is a great start, but you should dig deeper by searching online, reading history books, and looking at works of art. [11] X Research source For example, if your character is a noble living in sixteenth-century Italy, learn about the politics, religion, economics, and popular fashions of their world. Find portraits of wealthy people who lived at that time, and look closely at how they present themselves. Look up your character’s name. Find out if the playwright used its meaning as a clue about who that person is."
    },
    {
      "title": "Give your character details.",
      "content": "Give your character details. Take cues from the script and construct an intellectual and emotional portrait of the person you're playing. Fill in the script’s blanks and create backstories for your character. Speculate about their motivations, dreams, and ambitions. [12] X Research source Make a list of their strengths, flaws, values, and temptations. What life events shaped them into who they are?"
    },
    {
      "title": "Figure out how your character is connected to others.",
      "content": "Figure out how your character is connected to others. Use the script, research, and your imagination to define how your character relates to the play’s other characters. Decide how your character forms relationships and interacts with others. [13] X Research source For instance, is there another character whom they trust more than others? Maybe you could hold your posture more rigidly and speak with a more formal tone around other characters. Then, drop your shoulders and speak with a more relaxed tone in scenes with the person your character trusts."
    },
    {
      "title": "Immerse yourself in the role completely.",
      "content": "Immerse yourself in the role completely. Use the images and details you’ve assembled to transform yourself into your character. Envision how they react to life, move, think, and relate to others. Forget that you are pretending, and try to become the character you are playing. [14] X Research source"
    },
    {
      "title": "Come up with subtle details that add authenticity.",
      "content": "Come up with subtle details that add authenticity. Little actions are noticeable and can help bring your character to life. If your character is fastidious, maybe you could straighten your clothes frequently. If they’re generally anxious, figure out gestures, like wringing your hands, that convey anxiety. [15] X Research source"
    },
    {
      "title": "Try to keep calm and relax.",
      "content": "Try to keep calm and relax . Do breathing exercises or meditate before going on stage. Don’t worry about embarrassing yourself or messing up. If you know your lines, have worked on your mechanics, and have committed to your character, you have nothing to worry about. [16] X Research source"
    },
    {
      "title": "Use the stage lights to kill stage fright.",
      "content": "Use the stage lights to kill stage fright. The stage lights are your friend! With the lights shining on you, you won’t be able to see most of the theater. Try to use them to help you focus on the action on the stage."
    },
    {
      "title": "Try to block out the audience.",
      "content": "Try to block out the audience. Pretend there's a wall between you and the audience. Tell yourself that you're no longer on a stage, but in your private world. Try to stay within your character and within the play, and forget the audience exists."
    },
    {
      "title": "Remember that acting is your passion.",
      "content": "Remember that acting is your passion. If you ever get nervous on stage, remind yourself how important acting is to you. Try to focus on everything you love about theater. Embrace being onstage and have fun!"
    }
  ]
}