{
  "url": "https://www.wikihow.com/Clean-Laptop-Fan",
  "title": "How to Clean a Laptop Fan",
  "steps": [
    {
      "title": "Shutdown and unplug the laptop.",
      "content": "Shutdown and unplug the laptop. Before doing anything, it’s important to make sure your laptop is not on or attached to an active electrical socket. This ensures that you won’t get electrocuted while cleaning the laptop. [1] X Research source If you can, consider removing the battery. This will also help your laptop cool down internally. Simply open the latch on the underside back edge of your laptop and slip the battery out (how you remove the battery may vary depending on the laptop’s make and model)."
    },
    {
      "title": "Aim the compressed air nozzle into the laptop’s open vent ports.",
      "content": "Aim the compressed air nozzle into the laptop’s open vent ports. Vents are usually located on the underside of the laptop, but may be in a different location depending on what type of laptop you have—just take the laptop and look around to see where the vents are located on your specific model. Hold the can upright at a 90-degree angle. If you turn it sideways, the compressed air will spit out hydrogen and essentially, it will turn into ice and you'll be spraying liquid instead of air. If you can see the fan blades through the vents, point the nozzle directly at them."
    },
    {
      "title": "Spray compressed air into the vents in quick bursts.",
      "content": "Spray compressed air into the vents in quick bursts. Putting continuous air into the intake vents could create condensation inside the laptop. [2] X Research source To avoid this, press down on the nozzle in 1 second increments to loosen any dirt and dust. [3] X Research source"
    },
    {
      "title": "Blow compressed air through the exhaust vents if the intake vents are clogged.",
      "content": "Blow compressed air through the exhaust vents if the intake vents are clogged. If your laptop is extra dirty, try spraying air through the vents on the side(s) of the laptop. This can help release trapped dust and push air through the intake vents. [4] X Research source"
    },
    {
      "title": "Unplug, shut down, and remove the laptop’s battery.",
      "content": "Unplug, shut down, and remove the laptop’s battery. It’s always better to be safe rather than sorry, so ensure there's no electricity going in or out of the laptop. This way, there’s no chance you’ll be electrocuted. This should only be a last resource if you're still having thermal interference after cleaning the vents. Only then you should try opening up the machine to clean it."
    },
    {
      "title": "Remove the bottom panel of the laptop.",
      "content": "Remove the bottom panel of the laptop. Locate the screws on the underside of the laptop. Use a screwdriver (preferably one designed for laptops) to remove each screw and lift off the back. [5] X Research source Keep all the screws in a safe place as you’ll need them to reattach the backing later. Some laptops have push tabs instead of screws, allowing you to remove the underside by pressing a switch(s). [6] X Research source Consider referencing a “teardown guide” for your laptop’s make and model. Sites like iFixit and YouTube offer advice on taking apart all types of laptops."
    },
    {
      "title": "Wipe the laptop fan with a lint-free cloth.",
      "content": "Wipe the laptop fan with a lint-free cloth . The fan is usually located in one of the back corners, but could vary depending on the make and model of your laptop. Use a lint-free cloth to remove any visible dust on the fan. [7] X Research source If you’re comfortable, consider removing the fan from the laptop with your screwdriver to wipe it down entirely. Compressed air can also be used at this stage if you have it on hand. Simply spray small bursts into the fan and its attaching parts. [8] X Research source"
    },
    {
      "title": "Use a laptop cleaning brush to clean the nooks and crannies of the fan.",
      "content": "Use a laptop cleaning brush to clean the nooks and crannies of the fan. Carefully slide the brush along the blades of the fan and underneath the protective plate. If you’re comfortable, disassemble the fan itself by unscrewing the protective plates to release the blade. [9] X Research source If there's something’s gummed up on the blades, brushing is probably the only option to remove it. Blowing air usually doesn't work in these cases."
    },
    {
      "title": "Reattach the laptop’s backing.",
      "content": "Reattach the laptop’s backing. Reassemble the fan if you disassembled it, and put it back in place. Set the backing back on the laptop, lining up the screw holes. Use your screwdriver to put the screws back in—make sure they're tightly in place, so your laptop doesn’t open while you’re using it. [10] X Research source"
    }
  ]
}