{
  "url": "https://www.wikihow.com/Become-a-Good-Liar",
  "title": "How to Become a Good Liar",
  "steps": [
    {
      "title": "Have a reason.",
      "content": "Have a reason. Only lie when you have something gain to give your self motivation. If you limit your lies then people will not realize when you have finally broken. People who lie a lot, like pathological liars, cannot help themselves and tell a lot of little lies that can easily get them caught. It’s difficult to keep track of a lot of lies and people know that they can’t trust you once you have been caught lying several times. [1] X Research source"
    },
    {
      "title": "Lay your groundwork.",
      "content": "Lay your groundwork. Work out all the details prior to telling your lie. Like anything, practice makes perfect. The more you tell the same lie, the easier it will become. It is easy to find out if a person is coming up with a lie on the spot as details become vague and nervousness begin to set in. [2] X Research source"
    },
    {
      "title": "Tell a misleading truth.",
      "content": "Tell a misleading truth. The more truth you can add to a lie the easier it will be to tell. It is more like you are leaving a false impression rather than blatantly lying. Attempt to avoid follow-up questions by coloring in as much truth as you can. [3] X Research source"
    },
    {
      "title": "Identify your target.",
      "content": "Identify your target. Get inside the head of someone listening to your head. A good liar uses the same tools as a good communicator. Empathize with your listener and anticipate what he wants to hear. Learn what your listener knows and identify his interests and schedule to avoid any missteps in your story that may trigger any suspicion. [4] X Research source"
    },
    {
      "title": "Watch your body language.",
      "content": "Watch your body language. Lying can make you nervous and scared. You may not notice yourself fidgeting, stuttering, or breaking eye contact. People can pick up on your non-verbal cues, so try to limit gestures that are not already natural to your personality. [5] X Research source Some people talk faster than normal or give too much eye contact to overcompensate for a lie. Rehearse in front of a mirror or a friend to get the most natural delivery you can."
    },
    {
      "title": "Prepare for emotional context.",
      "content": "Prepare for emotional context. Liars will memorize the details about the lie but may get caught off guard when asked about the emotions associated with their actions. They may sound mechanical when delivering their answers. Be prepared to add emotion to the details of your lie. [6] X Research source"
    },
    {
      "title": "Relax your lips.",
      "content": "Relax your lips. Lip compression may be a negative reaction when telling a lie. People testifying often compress their lips just before relaying something negative. Get through a tough line of questioning with relaxed lips. [7] X Research source"
    },
    {
      "title": "Breathe easy.",
      "content": "Breathe easy. Whether your breathing increases or even hyperventilates, it’s usually a sign that you are nervous or psychologically uncomfortable. Even taking a long deep breath can be a sign that you are collecting yourself before a lie. [8] X Research source"
    },
    {
      "title": "Do not touch your neck.",
      "content": "Do not touch your neck. Many people unconsciously touch their neck when they are nervous or anxious. Usually, people reach for the dimple of their neck. Many may adjust their tie or fidget with it instead of touching their neck. [9] X Research source"
    },
    {
      "title": "Square your body to the person you are talking to.",
      "content": "Square your body to the person you are talking to. A contentious topic or difficult conversation may cause you to turn your body away. You may subtly shift in your seat and turn your stomach away from an accuser or from someone you are lying to. You may even create a barrier by crossing your legs while still keeping eye contact. Keep your torso facing your listener especially if they have just asked you a question that you need to lie to answer. [10] X Research source"
    },
    {
      "title": "Keep your hands away from your eyes.",
      "content": "Keep your hands away from your eyes. People may reach for their glasses or rub their eyes when in a difficult conversation. Keep your hands in a neutral and natural position when telling a lie to avoid suspicion. [11] X Research source"
    },
    {
      "title": "Keep your thumbs visible.",
      "content": "Keep your thumbs visible. Hiding or lowering your thumbs may reveal that you are insecure or aren’t committed to your statement. When people are more emphatic they tend to have their thumbs straight and apart. [12] X Research source"
    },
    {
      "title": "Keep your speech natural.",
      "content": "Keep your speech natural. Any changes in your regular speech patterns and behaviors may raise suspicions. Some people may talk faster, high-pitched, or give more errors in speech when nervous. Liars also want to convince you of a lie, so they may repeat details to hammer it home. Avoid overly repetitive information as you speak naturally. [13] X Research source Liars may probe with repetitive information and their spoken words may be weaker at the start and end of a statement as they try to read their listener to see if their lie is being believed. Repetition may be difficult to read especially if using a cellphone as coverage may become spotty and cause repetition."
    },
    {
      "title": "Factor in the length of a pause.",
      "content": "Factor in the length of a pause. Cultural context may dictate how you utilize pauses in your delivery. However, if you use a pause, it may come off as regrouping to deliver a lie. Saying something like, \"That is a good question\" may come off as you delaying to gather your thoughts as you commit a lie. [14] X Research source Both honest and deceitful people use pauses in speech, so this will be a difficult factor to detect without proper context."
    },
    {
      "title": "Keep your facts straight.",
      "content": "Keep your facts straight. Keep consistent. Depending on how big of a lie you tell, it may be hard work keeping everything in order. Remember every detail you lay out even if it is not asked of you. Make sure not to give different information to different people. [15] X Research source"
    },
    {
      "title": "Remain focused.",
      "content": "Remain focused. You must commit to your lie. Any wavering makes it obvious that you are lying. Lying may feel unpleasant as fear and guilt set in. Your body language and facial expressions may give away your emotions as you want to get the lie over with. You must commit to your lie as if your were telling the truth. [16] X Research source Some people enjoy the thrill of lying and do not show shame or remorse. Lying is not a socially acceptable activity, so it is all right if you do not get any joy from what you are doing and find it difficult to commit."
    },
    {
      "title": "Increase the pressure.",
      "content": "Increase the pressure. If you are being accused of a lie, turn the table and trick your accuser. You may ask questions like “Why were you there, do you not trust me?” or “I am sure you do not want your friends hearing what you have been up to either.” [17] X Research source"
    },
    {
      "title": "Distract from the issue.",
      "content": "Distract from the issue. Politicians use this technique to drive people away from other issues. People are uncomfortable accusing others so any chance they have to change topics may be seen as welcomed relief. For example, if a politician is asked about his views on the economy, he may drive the conversation to immigration. Similarly, if you are being accused of missing curfew, you may move the conversation to your brother driving without a license. [18] X Research source"
    },
    {
      "title": "Bargain with your accuser.",
      "content": "Bargain with your accuser. Avoid responsibility from your lie by softening or even erasing anything you are being accused of by admitting to things that your accuser will find satisfactory. If you can deflect blame you will also deflate the anger associated with it. [19] X Research source"
    },
    {
      "title": "Know the nuances.",
      "content": "Know the nuances. People may ask you questions several different ways to try to catch you in a lie. Make sure that you not only know the details, but also the specifics when more precise questions are asked. [20] X Research source But it is best to be honest and it is never too late for it. For example, you can tell your partner directly that you have not been honest about some things. [21] X Research source You can rectify a situation by being honest. [22] X Research source"
    }
  ]
}