{
  "url": "https://www.wikihow.com/Body-Shapes-Men",
  "title": "5 Body Shapes for Men Explained Plus Style Advice for Each",
  "steps": [
    {
      "title": "Rectangle, oval, triangle, inverted triangle, and trapezoid are the 5 male body shapes.",
      "content": "Rectangle, oval, triangle, inverted triangle, and trapezoid are the 5 male body shapes. Each one is based on the general shape of your torso and focuses on the proportions of your shoulders, waist, and hips. [1] X Research source Knowing your body shape can make shopping for clothes easier, but don't let your body shape define who you are! You're amazing and worthy just as you are, regardless of your shape. If you want to look and feel your best, wear clothes that make you feel comfortable. [2] X Research source Choose clothes that complement your body shape and your lifestyle. Opt for colors that complement your skin tone, hair, and eye color. [3] X Research source Consider working with a stylist to know what colors, cuts, prints, and fabrics best complement you."
    },
    {
      "title": "You're a rectangle if your shoulders, waist, and hips are of similar width.",
      "content": "You're a rectangle if your shoulders, waist, and hips are of similar width. If your proportions are pretty much the same from your shoulder to your hips, you fit into the most common body shape category of a rectangle. [4] X Research source Celebrities with rectangle body shapes include David Beckham and Matt Bomer."
    },
    {
      "title": "You're an oval if you have a wide torso with slimmer shoulders and hips.",
      "content": "You're an oval if you have a wide torso with slimmer shoulders and hips. If you're widest at the waist and have narrow shoulders and slim hips, you have an oval body shape. This is a common body shape, especially as you get older. There are lots of things you can wear to slim your stomach (if that's what you're going for). [5] X Research source James Corden, Elton John, and Kevin James are celebrities with oval body shapes."
    },
    {
      "title": "You're a triangle if you have a wide waist and hips with narrow shoulders.",
      "content": "You're a triangle if you have a wide waist and hips with narrow shoulders. If your lower half tends to be a bit larger than your upper half, you fit into the triangle category. [6] X Research source Celebrities with triangle body shapes include Seth Rogen and Kanye West."
    },
    {
      "title": "You're an inverted triangle if you have wide shoulders with a slim waist and hips.",
      "content": "You're an inverted triangle if you have wide shoulders with a slim waist and hips. If you spend a lot of time working out your upper body and see gains in your shoulders and arms, you're more likely to have an inverted triangle body shape. [7] X Research source Celebrities with this body shape include Gerard Butler and Dwayne ‘The Rock’ Johnson."
    },
    {
      "title": "You're a trapezoid if you have wide shoulders with a slightly narrower waist and hips.",
      "content": "You're a trapezoid if you have wide shoulders with a slightly narrower waist and hips. If you're pretty fit and healthy, you're likely to be a trapezoid. You probably don't have trouble finding clothes that fit you well since you have balanced proportions. [8] X Research source Jon Hamm and Daniel Craig are celebs with trapezoid shapes."
    },
    {
      "title": "Select structured suit jackets and tapered pants.",
      "content": "Select structured suit jackets and tapered pants. For the rectangle body shape, it's all about adding bulk to your upper body to create dimension. Choose tops and blazers that broaden your shoulders. Go for pants that are a bit slimmer around your calf and ankle to give your bottom half a bit more shape. [9] X Research source On workdays, try a tailored suit with tapered trousers. Add a printed tie and a pocket square in a complementary color. For a weekend look, pair skinny jeans with a graphic tee under a zippered hoodie. Throw on a bold pair of sneakers to finish off your ’fit."
    },
    {
      "title": "Layer your tops and experiment with patterns.",
      "content": "Layer your tops and experiment with patterns. To add interest to your look, try wearing prints instead of just solid colors. Add outerwear or accessories to your upper half to give it more width, as well. [10] X Research source A printed sweater over a tee and solid-colored scarf with tailored pants would make a great outfit for fall or winter."
    },
    {
      "title": "Avoid styles that make you look boxy.",
      "content": "Avoid styles that make you look boxy. Steer clear of sleeveless shirts, double-breasted jackets, and relaxed-fit pants. [11] X Research source Skip shirts with vertical lines or geometric prints, too. [12] X Research source"
    },
    {
      "title": "Choose clothes that fit you perfectly.",
      "content": "Choose clothes that fit you perfectly. Garments that are the right size, from sleeve length to pant length, will help you look your best. Long-sleeved shirts and well-fitting pants will elongate your limbs and balance out your body. [13] X Research source For a formal option, go with a black pinstripe suit. Stick with black dress shoes for a slimming, monochromatic look. Want something more casual? Try dark-wash denim with a V-neck tee."
    },
    {
      "title": "Wear dark colors and vertical stripes.",
      "content": "Wear dark colors and vertical stripes. Both of these will slim and lengthen your torso to help you look and feel your best. [14] X Research source Don't feel limited to black, though—try navy, plum, espresso, and emerald, too! A black tee and plum-colored pants with black shoes is fashion-forward yet still not too flashy."
    },
    {
      "title": "Steer clear of clothes that draw attention to your torso.",
      "content": "Steer clear of clothes that draw attention to your torso. Forego bold belts and tops with horizontal stripes or busy patterns. Avoid cuffed or cropped pants, too, which can make you look shorter. [15] X Research source"
    },
    {
      "title": "Choose jackets with padded shoulders and straight-leg pants.",
      "content": "Choose jackets with padded shoulders and straight-leg pants. Select items that draw the eye up to your shoulders to create balance. Clothes with details around the neck or shoulders are great options. Classic or slightly flared trousers are your best bet for bottoms. [16] X Research source At the office, go for a single-breasted jacket, a button-down shirt with a vertical pattern, and dark trousers. Dark wash straight-leg jeans and a white tee create a classic outfit that’s perfect for your body type."
    },
    {
      "title": "Go for bold tops and dark bottoms.",
      "content": "Go for bold tops and dark bottoms. Shirts with stripes or bright colors that bring the focus to your chest are ideal for your body type. Go with darker colors on the bottom to slim your waist. [17] X Research source Try a flannel top layered over a graphic tee and some black flared jeans and Converse."
    },
    {
      "title": "Stay away from items that highlight your waist.",
      "content": "Stay away from items that highlight your waist. Bright belts and skinny or tapered pants create poor dimensions for you. Polo shirts can narrow your neck and short coats can make you look wider, so avoid both of those, as well. [18] X Research source"
    },
    {
      "title": "Wear tapered jeans and V-neck shirts.",
      "content": "Wear tapered jeans and V-neck shirts. Both items can balance out your body shape by drawing the eye down. Go for garments with details around your hips, like belts and pants with pockets. For formal occasions, choose unstructured blazers or jackets that don’t add bulk to your upper half. [19] X Research source A linen shirt and slim-fit chinos make a great outfit for business-casual events. Add a bright belt to give your outfit some personality and a slim-fit jacket if you need to dress it up a bit more. Patterned pants or shorts and a close-fitting V-neck tee make a great outfit for weekends."
    },
    {
      "title": "Try horizontal stripes on top and dark bottoms.",
      "content": "Try horizontal stripes on top and dark bottoms. The stripes will widen your chest a bit and balance out your shape. Stick with dark-wash jeans or black or navy trousers to slim your waist. [20] X Research source Got a date? Wear black dress pants and a button-down with horizontal stripes to look your best."
    },
    {
      "title": "Avoid garments that make your shoulders look wider.",
      "content": "Avoid garments that make your shoulders look wider. Stay away from clothes with details around the chest or neck. Opt-out of the skinny jean trend, too. [21] X Research source"
    },
    {
      "title": "Choose tapered suit jackets and trousers.",
      "content": "Choose tapered suit jackets and trousers. Tailored clothes that show your shape are perfect for you. Slim-fit jeans and short coats are also good choices. [22] X Research source Opt for a tailored suit that fits you like a glove for business functions. Wear a bold shoe or patterned sock to give your outfit some pizazz. For casual events, rock light-wash denim jeans and a dark tee. Add your favorite kicks and you’re good to go."
    },
    {
      "title": "Opt for a light-colored top and dark bottom, or vice versa.",
      "content": "Opt for a light-colored top and dark bottom, or vice versa. Create some contrast in your look by mixing dark and light pieces. [23] X Research source A neon sweater and black jeans make a striking outfit for fall or winter."
    },
    {
      "title": "Stay away from clothes that don’t show off your shape.",
      "content": "Stay away from clothes that don’t show off your shape. While you can wear pretty much anything and look great, it’s best to avoid baggy clothes and super-relaxed fits. Low-rise jeans aren’t the best option for you either. [24] X Research source"
    }
  ]
}