{
  "url": "https://www.wikihow.com/Cancel-Stitch-Fix",
  "title": "How to Cancel Your Stitch Fix Using the Website, App & More",
  "steps": [
    {
      "title": "Open the Stitch Fix website and log into your account.",
      "content": "Open the Stitch Fix website and log into your account. Type in stitchfix.com in your browser and press Enter. After the website homepage loads, click \"Sign In\" in the upper right corner of the screen. Type in your email address and password or sign in with your Google, Facebook, or Apple account."
    },
    {
      "title": "Go to Account Settings and switch to on-demand scheduling.",
      "content": "Go to Account Settings and switch to on-demand scheduling. Click \"Manage Fix frequency\" and uncheck \"Save me time by sending Fixes on a schedule\" to switch to on-demand scheduling . By unchecking this box, you'll no longer receive Fixes on an automatic schedule (i.e., monthly or every 2-3 months) and can opt to order them whenever you want (or not at all). Keep in mind that if you already have a Fix in progress (i.e., being curated or shipped to you), changing your Fix frequency won't cancel it. It will only cancel the deliveries after your current one."
    },
    {
      "title": "Delete your Stitch Fix account by emailing customer support.",
      "content": "Delete your Stitch Fix account by emailing customer support. This step is optional, but if you want to completely cancel your Stitch Fix account, email Stitch Fix at hello@stitchfix.com. Include your name and specify in the body of the message that you want them to deactivate your account. Wait for a confirmation email from them that they removed your information from their records."
    },
    {
      "title": "Open the Stitch Fix app and change your Fix Frequency.",
      "content": "Open the Stitch Fix app and change your Fix Frequency. Tap the profile icon in the upper right corner of the app and select Account Settings from the dropdown menu. Scroll down the Account Settings menu and tap \"Manage Fix Frequency.\" Select \"Turn Off Automatic Fixes\" to no longer receive automatic Fix deliveries and eliminate surprise $20 charges."
    },
    {
      "title": "Log into your Stitch Fix account online and open a live chat.",
      "content": "Log into your Stitch Fix account online and open a live chat. Click the Help button in the upper right corner of the homepage to the left of the Gift Cards button. On the Help page, click the black button with a white message bubble inside it on the bottom right corner of the screen."
    },
    {
      "title": "Tell the chat agent that you want to stop receiving Fix deliveries.",
      "content": "Tell the chat agent that you want to stop receiving Fix deliveries. They may provide you with step-by-step instructions to do it yourself or they may switch your delivery schedule to on-demand for you. If the agent says they changed your delivery schedule for you, double check your Fix Frequency under Account Settings to ensure it now says, \"You are currently receiving Fixes on demand.\""
    },
    {
      "title": "Send Stitch Fix an email with your request to cancel your Fix deliveries.",
      "content": "Send Stitch Fix an email with your request to cancel your Fix deliveries. Submit a ticket request on their website with your email address, subject line, and request details. Alternatively, compose a message to hello@stitchfix.com from your personal email account. Include your name and your request to stop all future automatic Fix deliveries and switch to on-demand scheduling only. [1] X Research source If you don't receive a response within 24-48 hours, check your inbox's Spam folder. If you use Gmail, Stitch Fix's reply may have been delivered to your Promotions tab, so check there, too."
    },
    {
      "title": "Call Stitch Fix at (844) 386-3850 or (415) 882-7765 for direct help.",
      "content": "Call Stitch Fix at (844) 386-3850 or (415) 882-7765 for direct help. Stitch Fix doesn't have an official customer service phone number. However, some customers have had success calling their corporate offices in San Francisco, CA at (844) 386-3850 or Phoenix, AZ at (415) 882-7765 to solve issues (such as changing their Fix delivery schedule) with their account. Calling Stitch Fix is a last-resort option if none of the above methods of changing your Fix delivery frequency work."
    },
    {
      "title": "How do I delete my Stitch Fix account?",
      "content": "How do I delete my Stitch Fix account? Send Stitch Fix an email at hello@stitchfix.com and request them to deactivate your account and delete all your information. Wait for a confirmation that they completed it and save the email to your files."
    },
    {
      "title": "Why did Stitch Fix charge my account $20?",
      "content": "Why did Stitch Fix charge my account $20? Stitch Fix charges $20 to your bank account every time they send you a Fix package. The $20 doubles as a styling fee and as credit toward any items in the Fix you decide to keep. [2] X Research source"
    },
    {
      "title": "Can I get my money back from Stitch Fix?",
      "content": "Can I get my money back from Stitch Fix? The $20 fee Stitch Fix charges for your Fix box is nonrefundable. [3] X Research source You can, however, get refunds for items you've purchased through Fix or Freestyle, their online storefront. You must return the purchased items within 30 days in their original condition with the tags still attached. [4] X Research source"
    }
  ]
}