{
  "url": "https://www.wikihow.com/Buy-Penny-Stocks-Without-a-Broker",
  "title": "How to Buy Penny Stocks Without a Broker",
  "steps": [
    {
      "title": "Be aware of the benefits of purchasing penny stocks.",
      "content": "Be aware of the benefits of purchasing penny stocks. Because penny shares can be purchased so cheaply, they represent an opportunity for enormous gains through high-volume purchases."
    },
    {
      "title": "Be aware of the downside, too.",
      "content": "Be aware of the downside, too. Penny stocks are not very liquid, meaning there may not be much demand for them, and as a stockholder, you could have trouble finding a buyer, should you want to sell your shares. In addition, the issuers of cheap stock may suffer from a weak market position and a fragile financial profile, making them risky investments. Investors in penny stocks should be prepared for the possibility of losing their entire investment. Because penny stocks trade infrequently, it may be difficult to sell shares once you've bought them. They are not traded on major exchanges (such as NASDAQ or the NYSE), so it is best to buy them without a traditional broker. The speculative nature of penny stocks lends itself to a \"do it yourself\" approach through an online brokerage service."
    },
    {
      "title": "Determine if penny stocks fit your investing strategy.",
      "content": "Determine if penny stocks fit your investing strategy. Stock issued by small, young companies represents the chance for very high gains but carries the strong possibility of significant losses, too. Investing in penny stocks should be considered part of a short-term, speculative tactic rather than a longer-term strategy. As in any investment, never contribute more than you are willing to lose. Understand how \"over the counter\" stock trading works. Penny stocks are not traded on major exchanges, and are instead traded \"over the counter.\" This means buyer and seller deal directly with each other rather than through a broker. Instead of trading at a pre-determined price, you will wind up buying penny stock at the lowest \"ask\" price you can find or selling shares at the highest \"bid\" price you can find. Ask prices will vary among sellers, so shop around."
    },
    {
      "title": "Investigate a company before purchasing their stock.",
      "content": "Investigate a company before purchasing their stock. Buying penny stocks often means investing in small, emerging companies. While it may be hard to find a lot of information on such companies, it is important to examine their financial health before investing. You can find financial information on many small companies on sites like Google Finance or Yahoo Finance. For information catered specifically to the over-the-counter penny stock market, use services like the OTC Bulletin Board and the National Quotation Bureau. A good opportunity to buy penny stock occurs when a company makes an initial public offering (IPO). This is a company's first move into public ownership. Be prepared by reading the company's prospectus before making an offer."
    },
    {
      "title": "Be aware of the possibility of fraud in penny stock investing.",
      "content": "Be aware of the possibility of fraud in penny stock investing. A common tactic used by sales people is to buy large amounts of a stagnant company's low-priced stock and then aggressively promote that stock as a good buy. If that effort results in a rising price (although the inherent value of the company may not have changed at all), the seller may realize big gains in his holdings. This tactic is sometimes called \"pump and dump,\" and a buyer should be alert for such activity. An inflated stock price can result in large losses for unsuspecting investors. Rising prices can also fall and leave a buyer with nothing. [1] X Research source Don't rely on unsolicited suggestions. Research a company thoroughly before investing. Be wary of telemarketers, e-mailers, newsletters, and other advertisements touting \"hot\" stocks or \"secret\" tips."
    },
    {
      "title": "Open an account with an online brokerage service.",
      "content": "Open an account with an online brokerage service. Buying penny stocks without a live broker means using an online, no-frills service. Sites like E-Trade and TD Ameritrade will let you set up an account with a small deposit for making purchases and paying fees. These sites work well for penny stock investing, because they permit constant monitoring of what may prove to be volatile price movements."
    },
    {
      "title": "Purchase and trade.",
      "content": "Purchase and trade. Learn the mechanics and risks of buying penny stocks, and then begin trading. Place purchase orders. \"Limit\" orders are better suited for penny stock trading than \"market\" orders. Using limit orders will allow you to control the price of your transactions. Using market orders may lead to purchasing stock at inflated prices or selling it too low, because many buyers and sellers will post unrealistic bid or ask prices."
    },
    {
      "title": "Look for solid stocks at good prices.",
      "content": "Look for solid stocks at good prices. If a company is touted as a big winner, but its stock is offered at a very low price, it may be a \"pump and dump\" stock. A \"pump and dump\" stock is a fraudulent stock that will not yield any real money for you, as the investor. [2] X Research source The best way to determine if a stock is solid and worth the investment is to do your research. \"Turnaround\" companies, which were bankrupt and are going through restructuring, are good potential investments: their shares will be cheap as they restructure, and as they become more successful their stock could be expected to rise."
    },
    {
      "title": "Keep consistent tabs on your stock's price.",
      "content": "Keep consistent tabs on your stock's price. Successful penny-stock traders will often spend all day in front of their computer, making frequent trades at a moment's notice. [3] X Research source This type of stock trading will look a lot like gambling: some luck will help. Unlike in a casino, however, the trader won't know the odds of winning before putting in his money, and of course there is no way to predict luck. If you spend enough time reviewing, researching, and watching your stock, you will start to see patterns and may be able to predict when it's time to buy or sell. [4] X Research source"
    },
    {
      "title": "Remember that penny stocks are not reliable, long-term investments.",
      "content": "Remember that penny stocks are not reliable, long-term investments. Don't use them in your retirement portfolio. It's very difficult consistently to accumulate wealth from penny stocks. They're better suited for short-term speculative plays. [5] X Research source"
    }
  ]
}