{
  "url": "https://www.wikihow.com/Change-the-Default-Font-on-Windows-7",
  "title": "How to Change the Default Font on Windows 7",
  "steps": [
    {
      "title": "Right-click the desktop.",
      "content": "Right-click the desktop. Doing so will invoke a drop-down menu. You can minimize all programs to get to the desktop by clicking the rectangular box in the bottom-right corner of the screen."
    },
    {
      "title": "Click Personalize.",
      "content": "Click Personalize . This option is at the bottom of the drop-down menu."
    },
    {
      "title": "Click a theme.",
      "content": "Click a theme. You should see a few square, colored icons in the middle of this page. Clicking one will open its theme page. You can also click the theme under \"My Themes\" near the top of this window to edit a theme you already created."
    },
    {
      "title": "Click Advanced appearance settings.",
      "content": "Click Advanced appearance settings . It's near the bottom of the page, just below the \"Color intensity\" slider."
    },
    {
      "title": "Click the \"Items:\" box.",
      "content": "Click the \"Items:\" box. You'll see this box directly below the \"Items:\" heading that's underneath the preview window. Clicking this box will invoke a drop-down menu. This box will usually say \"Desktop\" by default."
    },
    {
      "title": "Select an item to customize.",
      "content": "Select an item to customize. You can't change the Desktop font, but you can change the following items: [1] X Research source Active Titlebar Icon Inactive Titlebar Menu Message Box Palette Title Selected Items ToolTip"
    },
    {
      "title": "Click the \"Font:\" box.",
      "content": "Click the \"Font:\" box. It's just below the \"Items:\" box. You'll see a drop-down menu with different font names appear. The way the fonts are displayed shows you how their text will appear."
    },
    {
      "title": "Select a font.",
      "content": "Select a font. Doing so will apply it to your selected item (e.g., Title Bar ) in the preview window near the top of the page. If you don't like your selected font, try a different one. You can also change the font's formatting (e.g., color or size) by clicking the box beneath the respective heading and then clicking an option in the drop-down menu. To bold or italicize your font, click B or I respectively. They're right of the font name and size."
    },
    {
      "title": "Change the fonts of different items.",
      "content": "Change the fonts of different items. While changing the font of every possible item won't make all of your Windows 7 computer's text match, it will apply to most of the menus and items with which you most often interact."
    },
    {
      "title": "Click Apply, then click OK.",
      "content": "Click Apply , then click OK . These buttons are both at the bottom of the window. Doing so will apply and save your changes. You may need to restart your computer in order for these changes to take place."
    },
    {
      "title": "Right-click the desktop.",
      "content": "Right-click the desktop. Doing so will invoke a drop-down menu. You can minimize all programs to get to the desktop by clicking the rectangular box in the bottom-right corner of the screen."
    },
    {
      "title": "Click Personalize.",
      "content": "Click Personalize . This option is at the bottom of the drop-down menu."
    },
    {
      "title": "Click Display.",
      "content": "Click Display . You'll see this link under the \"See also\" heading in the bottom-left area of the Personalize window. You should see on this page the following options: Smaller - The default text size. Medium - 125 percent of the default text size. Larger - 150 percent of the default text size."
    },
    {
      "title": "Click the circle to the left of a text size.",
      "content": "Click the circle to the left of a text size. This will select it as your new text size. To set a custom text size, you can click the Set custom text size (DPI) link on the left side of the window, then click the 100% box, select a new scaling percentage, and click OK ."
    },
    {
      "title": "Click Apply.",
      "content": "Click Apply . It's at the bottom of the window. Doing so will prompt a pop-up window telling you to log off."
    },
    {
      "title": "Click Log off now.",
      "content": "Click Log off now . This will log you out of your computer; in some cases, it may also restart your computer. Once you log back in, your text will be the specified size. If you have work open, click Log off later and save your work. You can then restart your computer by opening the Start menu, clicking the arrow right of Shut down , and clicking Restart ."
    }
  ]
}