{
  "url": "https://www.wikihow.com/Block-Porn-from-an-iPhone",
  "title": "How to Block Porn Sites & Adult Content on an iPhone",
  "steps": [
    {
      "title": "Open your iPhone’s settings .",
      "content": "Open your iPhone’s settings . To prevent people who use this iPhone from viewing porn and other adult-related content, you can make some quick changes to your Screen Time settings."
    },
    {
      "title": "Tap Screen Time.",
      "content": "Tap Screen Time . It's in the second or third group of settings, depending on your version of iOS."
    },
    {
      "title": "Enable Screen Time.",
      "content": "Enable Screen Time. If you haven't set up Screen Time yet, tap App & Website Activity , then select Turn On App & Website Activity . [1] X Research source If you’re setting up Screen Time for your child’s device, tap Family , then select your child’s name. [2] X Research source If you don’t see this option, scroll down and tap Set Up Screen Time for Family . Follow the prompts to set up an account for your child. If Screen Time is already turned on, you can skip this step."
    },
    {
      "title": "Set a Screen Time passcode (optional).",
      "content": "Set a Screen Time passcode (optional). If you want to prevent your child or other people who use your device from bypassing your Screen Time settings, it’s a good idea to set a passcode. This way, only you will be able to override your restrictions. Tap Lock Screen Time Settings in the main Screen Time menu. Follow the prompts to set your passcode. It should be different from the passcode you use to unlock your phone. Be sure to write down or memorize your passcode. If you forget the passcode, you will need to reset it ."
    },
    {
      "title": "Tap Content & Privacy Restrictions.",
      "content": "Tap Content & Privacy Restrictions . This option is under the Restrictions header."
    },
    {
      "title": "Toggle on Content & Privacy Restrictions.",
      "content": "Toggle on Content & Privacy Restrictions . On the next page, toggle on the switch next to Content & Privacy Restrictions . If you set a passcode for Screen Time, you may be prompted to enter it now."
    },
    {
      "title": "Tap Store, Web, Siri & Game Center Content.",
      "content": "Tap Store, Web, Siri & Game Center Content . This will take you to a new screen."
    },
    {
      "title": "Tap Web Content.",
      "content": "Tap Web Content . By default, web content is unrestricted."
    },
    {
      "title": "Select Limit Adult Websites.",
      "content": "Select Limit Adult Websites . This blocks porn and other adult-specific content from this iPhone. To block or allow specific websites, tap Add Website under Always Allow: or Never Allow: . Alternatively, you can select Only Approved Websites to only allow this phone's owner to access a specific set of websites. You can disable Content Restrictions at any time by returning to Settings > Screen Time > Content & Privacy Restrictions , and toggling off the switch. You may be prompted to enter your Screen Time passcode to confirm."
    },
    {
      "title": "Install the “1.1.1.1:",
      "content": "Install the “1.1.1.1: Faster Internet” app on your iPhone. A DNS (Domain Name System) helps your phone or computer access different web addresses when you browse the internet. While your iPhone already uses a DNS provided by your Internet service provider, you can change your settings to use a DNS that’s designed to filter out adult websites. We’ll show you how to do this using Cloudflare’s “1.1.1.1 for Families” DNS. [3] X Research source To get started, install the app from the App Store . Other popular options include the Family Filter from CleanBrowsing and the Family Shield from OpenDNS ."
    },
    {
      "title": "Follow the prompts onscreen to set up the app.",
      "content": "Follow the prompts onscreen to set up the app. When you first launch the 1.1.1.1 app, you’ll be prompted to accept the terms of service and install a VPN profile that will allow you to connect to the DNS server. You can also choose whether to allow the app to send you notifications. [4] X Research source"
    },
    {
      "title": "Tap the toggle switch to connect.",
      "content": "Tap the toggle switch to connect. Once you finish setting up the app, you’ll see a screen that says WARP with a large toggle switch beneath it. Tap the switch. After a moment, the text beneath it will change from “Disconnected” to “Connected.”"
    },
    {
      "title": "Tap the ☰ Menu button.",
      "content": "Tap the ☰ Menu button. It’s at the top right corner of the screen."
    },
    {
      "title": "Select Advanced.",
      "content": "Select Advanced . You’ll see this near the bottom of the menu."
    },
    {
      "title": "Tap Connection options.",
      "content": "Tap Connection options . Another menu will open."
    },
    {
      "title": "Open DNS Settings.",
      "content": "Open DNS Settings ."
    },
    {
      "title": "Tap 1.1.1.1 for Families.",
      "content": "Tap 1.1.1.1 for Families . By default, this will be set to “None.”"
    },
    {
      "title": "Select Block Malware and Adult Content.",
      "content": "Select Block Malware and Adult Content . Your iPhone will now be protected from both porn and malicious software . You can also set up the DNS server manually, but this will only block adult websites when you’re connected to Wi-Fi (not cellular data). You’ll have to set it up separately for every Wi-Fi network you use on your phone. You can find detailed instructions here ."
    },
    {
      "title": "Install a parental control or screen time app.",
      "content": "Install a parental control or screen time app. Whether you’re trying to protect your child from adult content or trying to resist the temptation to look at porn yourself, there are a wide variety of apps out there to suit your needs. Here are a few options you can try: BlockerX is an app geared toward adults who want to change their internet browsing habits and avoid porn and other potentially harmful or addictive content. Similar to BlockerX, one sec is designed for adults who want to develop healthier browsing habits. This app includes an “Adult Content Detox” feature. OurPact is a parental control app with both free and paid tiers. It includes an adult content blocker. Bark is another parental control app that has web filtering features and also allows you to monitor your child’s activities online. Although it is a paid service, you can try it free for 7 days."
    }
  ]
}