{
  "url": "https://www.wikihow.com/Beat-a-Taller-and-Bigger-Opponent-in-a-Street-Fight",
  "title": "How to Beat a Taller and Bigger Opponent in a Street Fight",
  "steps": [
    {
      "title": "Don't fight unless you have to.",
      "content": "Don't fight unless you have to. When faced with a bigger opponent, you're going to be at a disadvantage from the start. Unless there's truly no other option, try to defuse or avoid physical violence at all costs. Do your best to make peace or simply walk away, if you can. There is no shame in running from a fight, especially if you don't know how it will turn out. Your opponent may be carrying a concealed weapon, or have friends lying in wait to gang up on you. Your primary goal should be getting yourself out of harm's way. [1] X Research source Getting away from a violent situation before it erupts should be considered a victory. If a fight becomes unavoidable, stay relaxed. When you panic, your ability to gauge your surroundings and employ effective strategies shuts down."
    },
    {
      "title": "Keep your guard up.",
      "content": "Keep your guard up. Keep your hands up to defend your head at all times. Your forearms should be held vertical and parallel, with palms turned inward toward your cheeks. Squeeze your fists together lightly until you’re ready to throw a counterpunch. Hunch slightly to bring your elbows down closer to your midsection to protect your ribs and abdomen from body blows. Don’t allow your guard to fall or get lax, even when you’re tired. Dropping your guard leaves you wide open for that one good shot which could mean the end of the fight. Make sure you assume a guard from which you can quickly and comfortably deliver punches or elbow strikes."
    },
    {
      "title": "Dodge strikes rather than blocking them.",
      "content": "Dodge strikes rather than blocking them. An aggressor who is bigger than you is also likely to be stronger, so it’s not recommended that you try to stop their attacks directly. Instead, stay mobile to swiftly escape from their punching range. Making them chase you will exhaust them, and with every missed attack they'll lose a little more steam. If there’s no chance of getting a safe distance away, slide your head to the outside of the punch so that it passes by harmlessly, then immediately rush in and hit back. [2] X Research source Evading is always preferable to blocking because it doesn’t require you to absorb force with any part of the body. Dodging a punch using only head movement is known in boxing as a “slip.” Slipping punches is an excellent way to avoid being hit while expending minimal energy. [3] X Research source"
    },
    {
      "title": "Don’t wrestle with your opponent.",
      "content": "Don’t wrestle with your opponent. The bigger, stronger person always has the edge in a grappling match. Don’t put yourself in unnecessary danger by allowing your opponent to take hold of you. Keep just outside their reach until the time comes to counter, then capitalize and pull away again. If the fight goes to the ground, you’re looking at a scenario where you have even less control, as your speed, evasiveness and precision will go right out the window. If one of you takes the other down, or you happen to trip, get back to your feet as quickly as you can. You have a much better chance of outclassing a large opponent in a stand-up encounter. [4] X Research source"
    },
    {
      "title": "Be prepared to take a punch.",
      "content": "Be prepared to take a punch . It’s unlikely that you’ll walk away from a fight with a larger opponent unscathed. You may have to eat a few punches if you get caught off guard or while you’re trying to find a way to slip inside. Keep this in mind and ready yourself mentally. Getting hit is no fun, but it could end up being much worse if you let it take you by surprise. [5] X Research source If you do have to take a hit, try to do it on the shoulder or forehead, which is a harder, less vulnerable surface than the jaw or the rest of the face. Let your body sway in the direction of the punch to lessen its impact. [6] X Research source During a physical altercation, your body will be flushed with adrenaline, which can keep you from feeling as much pain."
    },
    {
      "title": "Use evasive tactics.",
      "content": "Use evasive tactics. Move constantly to keep the larger opponent from grabbing you or landing strikes. Stay light and poised on the balls of your feet so that you can change directions quickly and keep them guessing. Since their reach is longer than yours, stay safely outside of it until you’re ready to move in and counter with a strike or takedown of your own. [7] X Research source One method you could employ is to “dance,” or move in a circular motion around your opponent while staying outside of their striking range. When you sense a punch coming, duck, dodge make sure you’re too far away for it to connect. [8] X Research source Since the legs are longer than the arms, becoming proficient at kicking can help overcome your opponent's reach advantage. Whatever you do, don’t let a larger opponent get their hands on you. One wrong move could end the fight in their favor."
    },
    {
      "title": "Get in close.",
      "content": "Get in close. When your opponent is least prepared, close the distance between you and move in close. This will neutralize their superior size and reach and put them in the right range to land some hard shots of your own. Finding the right timing and approach for getting in close is paramount for emerging victorious—you cannot win a fight with a bigger attacker by playing into their strengths. [9] X Research source When negotiating range with a bigger opponent, the most important thing to remember is to stay out of the “danger zone.” This is the range at which they can hit you but you can’t hit them back due to their added reach. Move in suddenly after dodging a blow or feinting one of your own, or follow your opponent’s punching arm back as they retract it."
    },
    {
      "title": "Tire them out.",
      "content": "Tire them out. One of the downsides of being taller and heavier is that it takes more effort to move, and as a result you run out of energy faster. Use this to your advantage. Keep slipping, dodging and moving constantly until your opponent begins to slow down. At that point, you can use your speed to slip into close range and unleash some punishing offense of your own. Working out to improve your cardiovascular conditioning can prepare you in the event that you need to be able to outlast an opponent’s onslaught during a fight. The strategy of allowing an adversary to tire themselves out before finishing them off has become known as the “rope-a-dope” principle. Muhammad Ali used this gameplan to win a championship bout with the larger George Foreman at the Rumble in the Jungle in 1974. [10] X Research source"
    },
    {
      "title": "Use the element of surprise.",
      "content": "Use the element of surprise. If you suspect things are about to take a nasty turn, be the one to make the first move. End a tense standoff with a sudden, well-placed blow to the jaw or solar plexus (the soft, fleshy outer edge of the diaphragm beneath the sternum). Put everything you’ve got into the strike—try to put a stop to the fight in a single maneuver. If you’re successful, your opponent will be incapacitated and the altercation will be over. If not, you’ll at least already be ready for the ensuing brawl. [11] X Research source Assess the situation as best you can before resorting to a surprise attack. In many cases, the aggressor might simply be worked up and won’t have any intention of actually getting into a physical dispute. Be certain that you’ve exhausted all other options first. Be careful when going for a sucker punch. If it misses or doesn’t do the trick, there will be no way to avoid a full-on fight."
    },
    {
      "title": "Stick and move.",
      "content": "Stick and move. It’s worth repeating that you shouldn’t try to stand and duke it out with a bigger person. Their reach and power will just be too much to handle. Take your time staying away from their strikes, waiting for an opening and then closing the gap and landing a hard shot. By alternating between defensive posturing and quick offensive bursts, you’ll eventually be able to wear them down. [12] X Research source Don’t get impatient. You’ll start making mistakes, which could end up costing you dearly. Attack the body when you don't have a clear shot at your opponent's head. The solar plexus is a sensitive target that when hit just right can drive all the air out of an opponent's lungs and leave them gasping for breath. The ribs are also quite fragile, and can be broken with only a few pounds of force per square inch."
    },
    {
      "title": "Aim for sensitive targets.",
      "content": "Aim for sensitive targets. Unlike a boxing match, which has regulations about where you’re allowed to hit an opponent, all bets are off in a real fight. Target the most delicate areas of your attacker’s body to make every strike count. One well-placed blow is all you'll need to put your towering opponent out of commission. Most people won’t be expecting these types of attacks, so they’ll be left without a ready defense. Everybody has the same anatomical weakness, despite size differences. Strikes that target an opponent’s sensory organs will leave them temporarily stunned, enabling you to get away or follow up with a hard hit. An open hand slap to the ear is just as good as a left hook for shattering an opponent’s equilibrium, if not better. Hitting the nose can blind them momentarily by causing their eyes to well up with tears, which gives you an opportunity to throw a fight-ending punch. A kick to the groin will compromise their mobility and instantly take the will to fight out of them."
    },
    {
      "title": "Go for submissions on the ground.",
      "content": "Go for submissions on the ground. Let’s say you get taken down with your opponent on top of you, and you’re unable to climb to your feet. In this situation, scramble for a submission technique, a hold or lock that incapacitates an attacker by neutralizing a single part of the body. By applying a joint lock, armbar or choke, you may be able to do enough damage to put an end to the scuffle. No matter how big or tough someone is, they won’t be able to hurt you if they’re unconscious. [13] X Research source Apply a rear naked choke or triangle choke, depending on your positioning. Chokes disrupt an opponent's circulation or ability to breathe, causing unconsciousness. It only takes a firm hold and a few moments to put an opponent to sleep. [14] X Research source [15] X Research source Armbars are holds that apply pressure to the elbow joint or shoulder. They are effective against attackers who leave their arms extended momentarily after throwing a punch. As a bonus, disabling an arm means they can’t hit you anymore. [16] X Research source"
    },
    {
      "title": "Don’t be afraid to fight dirty.",
      "content": "Don’t be afraid to fight dirty . Forget about honor or fairness: there are no rules on the street. You don’t know how badly you might be injured if you come out on the losing end of a fight, so you shouldn’t be discouraged from being vicious. Bite, gouge eyes, pull hair, chop the throat, bend fingers back, knee the groin and do anything else you have to do to survive. Turn objects around you, such as bottles, chairs, rocks, pens or even your cell phone into improvised weapons. In the best case scenario, the sight of you holding a weapon may be enough to make your attacker back down. To avoid escalating the violence further, make a run for it as soon as you have your opponent reeling."
    }
  ]
}