{
  "url": "https://www.wikihow.com/Clean-Oven-Without-Scrubbing",
  "title": "3 Oven Cleaning Hacks that Don’t Require Any Scrubbing",
  "steps": [
    {
      "title": "Mix 1 cup (340 g) of baking soda and 6 US tbsp (89 mL) of water to form a paste.",
      "content": "Mix 1 cup (340 g) of baking soda and 6 US tbsp (89 mL) of water to form a paste. Pour the baking soda into a bowl, add the water, then stir the mixture together with a spoon. Make a paste that's wet enough to cling to the inside walls of the oven, but still dry enough to spread around. [1] X Research source If you think your paste is too thin and watery, add more baking soda. Likewise, if it's too dry and powdery, pour in more water."
    },
    {
      "title": "Remove the oven racks and spread the paste inside the oven.",
      "content": "Remove the oven racks and spread the paste inside the oven. Apply the paste on the bottom, sides, and roof inside the oven in a single, even layer. You can even put it on the inside of the oven door. Spread the paste with a pastry brush to make it easier or use your hands to get the job done ( just remember to wear rubber cleaning gloves! ). As you move the paste around, avoid putting it on the heating element (if it's exposed), the gas vents (if you're cleaning a gas oven ), or the lightbulb. [2] X Research source"
    },
    {
      "title": "Close the oven door and let the paste sit for 1 hour.",
      "content": "Close the oven door and let the paste sit for 1 hour. This will give the baking soda time to \"bind with the grease,\" says house cleaning professional Chris Willatt. During this time, warn other members of your household not to turn on the oven or the stovetop."
    },
    {
      "title": "Coat the racks with vinegar and baking soda and soak in hot water.",
      "content": "Coat the racks with vinegar and baking soda and soak in hot water. While the paste marinates in the oven, set your oven racks in a bathtub or a large kitchen sink. Pour distilled white vinegar into a spray bottle and spray it all over the racks. Sprinkle baking soda on top to start a sizzling cleaning reaction with the vinegar. Finally, fill the bathtub or sink with hot water and soak the racks until you've finished cleaning the inside of the oven. [3] X Research source"
    },
    {
      "title": "After 1 hour, wipe the inside of the oven with a damp microfiber cloth.",
      "content": "After 1 hour, wipe the inside of the oven with a damp microfiber cloth. Fill a bucket with warm water. Submerge the microfiber cloth in the water, wring it out, then use it to wipe the now-dry baking soda paste from the inside surfaces of the oven. Rinse the cloth out in the bucket of water whenever it gets too full of paste and grime. [4] X Research source Dump and refill the bucket with clean water if you notice it turning brown with grease and food buildup from the rag. If the oven isn't as clean as you want it to be, consider letting the baking soda paste sit for longer— up to 8-10 hours (or overnight)—so it has more time to work. [5] X Research source"
    },
    {
      "title": "Let the inside of the oven dry completely before turning it on.",
      "content": "Let the inside of the oven dry completely before turning it on. Dry the surfaces inside the oven with a clean, dry microfiber cloth. You can also leave the door open and point a portable fan at it to help it air dry faster. Ensure there's no more moisture inside it before the next time you turn it on."
    },
    {
      "title": "Drain the tub or sink and wipe the racks off with a clean microfiber cloth.",
      "content": "Drain the tub or sink and wipe the racks off with a clean microfiber cloth. This step should get rid of any lingering baked-on food or grease. Once they're cleaned to your liking, dry them off with a towel and put them back in the oven. [6] X Research source Don't forget to clean the tub or sink before using it again! It's probably dirty with bits of charred food that fell off the racks while they were soaking."
    },
    {
      "title": "Check if your oven is designed to hold liquid in the bottom for steam cleaning.",
      "content": "Check if your oven is designed to hold liquid in the bottom for steam cleaning. Some ovens can hold vinegar or water in the bottom cavity , and those models also tend to come with a steam clean cycle. Not every oven is like this, though, so check your owner's manual to find the manufacturer's cleaning instructions for your particular model. [7] X Research source If the oven can hold liquid in the bottom, you can simply pour the vinegar straight into the cavity. If it can't hold liquid, pour the vinegar into a bowl and place it inside the oven for this steaming method. Even if your oven has a steam cleaning cycle, that doesn't mean it's safe to pour vinegar or water inside it! Instead of assuming, always check the cleaning instructions in the owner's manual first ."
    },
    {
      "title": "Remove the racks and set the temperature to 450 °F (232 °C).",
      "content": "Remove the racks and set the temperature to 450 °F (232 °C). If your oven has a steam cleaning cycle, you may only need to press a button to get it started. Depending on your make and model, the manufacturer's instructions may tell you to add the vinegar to the inside of the oven before or after the steam clean cycle has already started. [8] X Research source"
    },
    {
      "title": "Fill an oven-safe bowl with no more than 2 cups (475 mL) of vinegar.",
      "content": "Fill an oven-safe bowl with no more than 2 cups (475 mL) of vinegar. If your oven isn't that dirty or you don't like the smell of vinegar, dilute it with water. Just be sure that the total amount of liquid is no more than 2 cups (475 mL) (or whatever amount your manual says is the limit). Use only filtered or distilled water, so it doesn't leave water spots or mineral deposits inside the oven. [9] X Research source"
    },
    {
      "title": "Put the bowl of vinegar in the bottom of the oven and set a timer for 20 minutes.",
      "content": "Put the bowl of vinegar in the bottom of the oven and set a timer for 20 minutes. After 20 minutes, shut the oven off and wait for it to cool completely. Don't try to pull the bowl out while it's still steam cleaning , or you might accidentally burn yourself! [10] X Research source"
    },
    {
      "title": "Wipe down the inside of the oven after it's completely cooled.",
      "content": "Wipe down the inside of the oven after it's completely cooled. Use a damp microfiber cloth, paper towels, or a soft sponge to clean up the food and grime loosened up by the steam. As always, make sure the oven is dry before you replace the racks and start using it again. [11] X Research source"
    },
    {
      "title": "Ventilate your kitchen area by opening windows and vents.",
      "content": "Ventilate your kitchen area by opening windows and vents. Open the windows in your kitchen (if you have any) and the air vents in the floor or ceiling, and turn on fans to promote air circulation. This will help ventilate the Easy Off fumes out of the house. [12] X Research source Easy Off is a foaming oven cleaner that breaks down grease, food buildup, and stains and makes them easier to remove. It's also made with chemicals that can be toxic if you inhale or ingest them. That's why ventilating your house before using Easy Off and wearing gloves, goggles, and a mask are must-dos!"
    },
    {
      "title": "Take out the racks and spray Easy Off all over the inside of the oven.",
      "content": "Take out the racks and spray Easy Off all over the inside of the oven. Spray an even coat on the sides, top, and bottom of the oven. Avoid getting the cleaner on or in the vents, the heating elements, or the light bulb."
    },
    {
      "title": "Turn the oven on to the lowest heat setting and let the Easy Off soak.",
      "content": "Turn the oven on to the lowest heat setting and let the Easy Off soak. According to Willatt, \"a little bit of heat will activate [the Easy Off],\" so it can lift the grease and grime inside your oven. Keep the oven door closed during this step, and set the temperature to the lowest heat setting your oven allows."
    },
    {
      "title": "After 1 hour, turn off the oven and let it cool, then wipe it out.",
      "content": "After 1 hour, turn off the oven and let it cool, then wipe it out. Willatt says you can just wipe the Easy Off right out. Use paper towels, since you'll be picking up a lot of grime, and a microfiber towel will get dirty fast. [13] X Research source"
    },
    {
      "title": "Wipe the Easy Off and food residue off with hot, soapy water and soft cloths.",
      "content": "Wipe the Easy Off and food residue off with hot, soapy water and soft cloths. Fill a bowl with hot water and make it sudsy with a few drops of dish soap. Wearing rubber kitchen gloves, dip a microfiber cloth in the soapy water, wring it out, and use it to wash out the inside of the oven. Clean up any remaining Easy Off and food residue that you see. [14] X Research source Then let it dry completely before you put the racks back inside and close the oven door."
    },
    {
      "title": "Experts don't recommend cleaning your oven with dishwasher pods.",
      "content": "Experts don't recommend cleaning your oven with dishwasher pods. Even though this oven cleaning method has gone viral on social media, experts say putting a gel dishwasher pod in a bowl of water in your oven on low heat isn't effective. Worse, it can actually damage the surfaces and seals in your oven. Not to mention the fact that the fumes from the heated-up dishwasher pod can be hazardous to your health! [15] X Research source"
    },
    {
      "title": "Sweep or vacuum out loose food debris before cleaning the oven.",
      "content": "Sweep or vacuum out loose food debris before cleaning the oven. You'll have to wipe out these bits after you finish cleaning the oven anyway. To make it easier on yourself, just whisk them out beforehand with a handheld broom or suck them away with a vacuum attachment. Then, when you wipe the oven out at the end, it will be much more satisfying. [16] X Research source"
    },
    {
      "title": "Wear protective gear, such as kitchen gloves, safety goggles, and a mask.",
      "content": "Wear protective gear, such as kitchen gloves, safety goggles, and a mask. Regardless of what type of cleaning method you use, it's a good idea to wear protective gear. Kitchen gloves protect your hands from getting burned or irritated by the cleaner. Meanwhile, the safety goggles and mask protect your eyes, nose, and throat from the cleaner's fumes . [17] X Research source"
    },
    {
      "title": "Scrape off stubborn food or grease with a pumice stone.",
      "content": "Scrape off stubborn food or grease with a pumice stone. House cleaning professional Susan Stocker recommends using a pumice stone to scrape any food still stuck to your oven after you clean it. \"Just be careful,\" she says, \"if you have a color oven inside (like blue, red, etc.), as it will scratch the color right off.\""
    },
    {
      "title": "The self-cleaning feature on ovens creates smoke and is a fire hazard.",
      "content": "The self-cleaning feature on ovens creates smoke and is a fire hazard. \"[T]he way the self-cleaning cycle actually works,\" says house cleaning professional Marcus Shields, \" is…it heats your oven\" far higher than the manufacturer's normal recommendations. A typical consumer oven should only be heated up as high as 500–600 °F (260–316 °C). The self-clean feature \"goes beyond that\" to burn \"all of that grease and oil to a crisp, so it falls off of the surface.\" Not only does this process produce a lot of smoke, which is harmful to kids and pets, but it also poses a fire risk. For that reason, Shields recommends never using self-clean on your oven."
    },
    {
      "title": "Use baking soda, vinegar, or Easy Off to clean an oven without scrubbing.",
      "content": "Use baking soda, vinegar, or Easy Off to clean an oven without scrubbing. Once your cleaner is done soaking, wipe it clean with microfiber cloths or paper towels. Another popular \"no scrub\" method is the dishwasher pod method, but experts recommend avoiding that because of health and safety risks. No matter how you clean your oven, though, always wear gloves, safety goggles, and a mask to protect yourself from cleaning chemicals and fumes."
    }
  ]
}