{
  "url": "https://www.wikihow.com/Convert-Podcasts-to-MP3",
  "title": "How to Convert Podcasts to MP3",
  "steps": [
    {
      "title": "Open iTunes.",
      "content": "Open iTunes. If you do not already have it, you can download it from https://www.apple.com/itunes/ ."
    },
    {
      "title": "Add the podcast to your library.",
      "content": "Add the podcast to your library. Open the “File” menu from the menu bar and select “Add File to Library”. This will open a window to browse and select files on your computer. [1] X Research source Hit Ctrl + B on Windows to force the menu bar to appear."
    },
    {
      "title": "Open the “iTunes” menu and select “Preferences”.",
      "content": "Open the “iTunes” menu and select “Preferences”. This will open a small window with various iTunes options. [2] X Research source On Windows, the “Preferences” option is located in the “Edit” menu."
    },
    {
      "title": "Click “Import Settings”.",
      "content": "Click “Import Settings”. This option appears next to “When you insert a CD” on the “General” tab."
    },
    {
      "title": "Select the “Import Using” dropdown menu and choose “MP3 Encoder”.",
      "content": "Select the “Import Using” dropdown menu and choose “MP3 Encoder”. This is located at the top of the Import Settings window and is set to “AAC Encoder” by default. [3] X Research source"
    },
    {
      "title": "Select a quality setting.",
      "content": "Select a quality setting. This menu is located just below the “Import Using” menu. Here you can select a bitrate for your encoded mp3’s. A higher bitrate denotes a higher quality (but larger) file. If you encoding from a lossy source (for example: mp4, m4a, ogg) then the quality will drop even if you select a higher quality bitrate. Try to encode from lossless sources instead (FLAC, ALAC, wav)."
    },
    {
      "title": "Click “OK”.",
      "content": "Click “OK”. This is located in the lower right and will save your changes."
    },
    {
      "title": "Navigate to your Library.",
      "content": "Navigate to your Library. Click the dropdown menu in the upper left, below the menu bar and select Music or Podcasts (wherever you added it). [4] X Research source"
    },
    {
      "title": "Select the file(s) you want to convert.",
      "content": "Select the file(s) you want to convert. You can hold Ctrl (Windows) or ⌘ Cmd (Mac) while clicking to select multiple files at once."
    },
    {
      "title": "Open the \"File\" menu and select “Convert”.",
      "content": "Open the \"File\" menu and select “Convert”. This will bring up another submenu with conversion options."
    },
    {
      "title": "Select “Create mp3 Version”.",
      "content": "Select “Create mp3 Version”. A progress bar will appear at the top showing the conversion process. When complete, a copy of the selected file(s) will appear in your library in the new format. [5] X Research source"
    },
    {
      "title": "Open dbPowerAmp Music Converter.",
      "content": "Open dbPowerAmp Music Converter. dbPowerAmp is a popular, ad-free program for both Windows and Mac OS used for CD ripping and audio conversion. If you do not have it, you can purchase and download it from https://www.dbpoweramp.com/ . There is also a 21-day free trial period if you want to try it out first."
    },
    {
      "title": "Select a podcast file.",
      "content": "Select a podcast file. dbPowerAmp Music Converter will immediately open to a browsing window to locate the file you wish to convert. Once a file is selected, a menu with various encoding options will appear. [6] X Research source You can select multiple files by holding Ctrl (Windows) or ⌘ Cmd (Mac) while selecting files."
    },
    {
      "title": "Select “mp3 (Lame)” from the “Converting To” dropdown menu.",
      "content": "Select “mp3 (Lame)” from the “Converting To” dropdown menu. This is located in the upper left corner of the window. LAME is the name of the encoder being used."
    },
    {
      "title": "Choose an encoding quality.",
      "content": "Choose an encoding quality. Move the slider to the right to increase quality, and to the left to decrease. Lower quality files will sound worse but encode more quickly and take up less space. You can also choose between bitrate settings like VBR (variable bitrate) and CBR (constant bitrate). Variable bitrates are more efficient and take up less space, while Constant bitrates maintain a higher quality throughout the track."
    },
    {
      "title": "Choose a save location.",
      "content": "Choose a save location. Click the folder icon and select a location on your computer you would like the converted file to be saved to. This will create a copy of your podcast with the new format in the location you choose. The source file will remain in its original location on the computer."
    },
    {
      "title": "Click “Convert”.",
      "content": "Click “Convert”. A progress bar(s) will appear showing the conversion process. Once the bars are all filled a “Done” button will appear to close the window."
    },
    {
      "title": "Navigate to https://online-audio-converter.com/ in your web browser.",
      "content": "Navigate to https://online-audio-converter.com/ in your web browser."
    },
    {
      "title": "Click “Open Files”.",
      "content": "Click “Open Files”. This will open a browsing window to select a podcast files on your computer. When the file is successfully uploaded the file name will appear next to this button. You can also opt to upload a file stored on Google Drive or Dropbox by clicking the corresponding icon to the right."
    },
    {
      "title": "Select “mp3” from the list of filetypes.",
      "content": "Select “mp3” from the list of filetypes. You can also opt to use other common audio filetypes, like m4a, wav, or FLAC."
    },
    {
      "title": "Move the slider to choose your quality.",
      "content": "Move the slider to choose your quality. You can select variable bitrates, sound channels, or add fade ins/outs by clicking “Advanced Settings” to the right of the quality slider."
    },
    {
      "title": "Click “Convert”.",
      "content": "Click “Convert”. A progress bar will appear showing the conversion process. When it’s complete a download link will appear."
    },
    {
      "title": "Click “Download”.",
      "content": "Click “Download”. A window will appear to select a save location for your converted podcast. You can also opt to save the file directly to Google Drive or Dropbox by clicking the corresponding icon below “Download”. The filename will contain the site name when downloading. This can be deleted when saving the file without consequence. You can also rename the file later."
    }
  ]
}