{
  "url": "https://www.wikihow.com/Catch-and-Look-After-Wild-Mice",
  "title": "How to Catch and Look After Wild Mice",
  "steps": [
    {
      "title": "Place store-bought catch and release mouse traps to catch mice in your house.",
      "content": "Place store-bought catch and release mouse traps to catch mice in your house. Bait the traps with peanut butter or strong-smelling cheese. If you’ve noticed mice in your home, place catch and release traps along the walls of your home. Make sure the traps are parallel with the wall so the mice are more likely to run inside of them. [1] X Research source Catch and release mouse traps can be purchased from your local hardware store. If you want to place a store-bought trap outside, keep them along the walls of your home or near areas where you’ve seen mice before. Mice you catch indoors are most likely house mice, which can live for about 9-12 months."
    },
    {
      "title": "Set up a bucket trap outside if you want to catch multiple mice at a time.",
      "content": "Set up a bucket trap outside if you want to catch multiple mice at a time. Place a 5 US gal (19 L) bucket outside your home, in a barn, or in a garage. Use glue to secure a thick, straight wire to the lip on top of the bucket. Glue a paper plate so ¼ of it hangs over a side of the wire and the other ¾ rests slightly on the lip of the bucket. Scoop a spoonful of peanut butter on the side of the plate closest to the wire. Make a ramp leading up to the plate using a plank of wood. The mice will try to climb on the plate to get to the peanut butter, but will fall in instead. [2] X Research source Leave the bucket out for a few days at a time to catch multiple mice. Mice caught outdoors are usually field mice, or voles. Field mice can live up to 4 years. [3] X Research source"
    },
    {
      "title": "Transfer the mice into the tank after you’ve caught them.",
      "content": "Transfer the mice into the tank after you’ve caught them. After you catch your mice, bring your trap to the tank you have set up and carefully move the mice into their new habitat. Either set the trap down and open it on the floor or gently dump the mice from the bucket into the cage. [4] X Research source Don’t try to handle the wild mice right when you’ve caught them since they will try to bite you out of fear."
    },
    {
      "title": "Wear gloves if you absolutely need to handle the mice.",
      "content": "Wear gloves if you absolutely need to handle the mice. Since wild mice could carry and spread diseases to humans, wear thick, bite-resistant gloves whenever you need to handle your mice. Pick mice up by scooping your hand underneath their body and squeezing slightly just behind their head so they don’t try to escape. [5] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Handle wild mice as little as possible to reduce the risk of being bitten. Never grab a mouse by their tail since it could rip out."
    },
    {
      "title": "Use a glass or plastic tank that has 1 cu ft (0.028 m3) for each mouse.",
      "content": "Use a glass or plastic tank that has 1 cu ft (0.028 m 3 ) for each mouse. Use an aquarium-style tank with a wire mesh top for your mice. Set the tank in a quiet area of your home away from other people or pets. Make sure the tank is out of direct sunlight so it doesn’t overheat during warm weather. [6] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source If the wire mesh doesn’t stay on top of your tank tightly, place a stone or a small stack of books on top. Make sure the tank still has ventilation."
    },
    {
      "title": "Line the bottom of the tank with shredded paper or wood shavings.",
      "content": "Line the bottom of the tank with shredded paper or wood shavings. Fill the bottom of your tank with 2–3 in (5.1–7.6 cm) of bedding so your mice are comfortable. Use pieces of shredded paper or aspen shavings so your mice can burrow and dig around the space. [7] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Avoid using pine or cedar wood shavings since they may contain fumes and oils harmful to mice."
    },
    {
      "title": "Provide a dish for food and water.",
      "content": "Provide a dish for food and water. Place a shallow dish somewhere in your tank in an easily accessible spot for your mice. You can either place water in a small saucer for the mice or provide an inverted bottle on the wall of your tank. [8] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source"
    },
    {
      "title": "Put a small box and cardboard tubes for your mice to hide in.",
      "content": "Put a small box and cardboard tubes for your mice to hide in. Place a small cardboard box in the corner of your tank to make a hiding place for your mice so they can sleep without being disturbed. If you plan on keeping multiple mice, provide another small box or various dark enclosures, such as toilet paper tubes or PVC pipes. [9] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Bury a toilet paper tube under the bedding so only the open ends are exposed. This way, it will feel like a natural burrow for your mice."
    },
    {
      "title": "Include branches so the mice have something to chew on.",
      "content": "Include branches so the mice have something to chew on. Mice need to chew on things since their teeth continuously grow. Find a thick, solid branch from their natural habitat and set it in their cage so they gnaw on it. [10] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Don’t use a branch that’s been treated with any pesticides since it could harm your mice. Make sure the branch doesn’t reach the top of your tank since mice may climb on it to try and escape. You may also purchase rodent chew toys from your local pet store."
    },
    {
      "title": "Give your mouse rodent pellets or fresh fruits and vegetables.",
      "content": "Give your mouse rodent pellets or fresh fruits and vegetables. Purchase a bag of rodent pellets from your local pet store to give your mice a complete diet. If you want to feed them fresh food, chop fruits and vegetables into 1 ⁄ 2 – 3 ⁄ 4 in (1.3–1.9 cm) cubes and place them in a dish. Make sure there’s always food available for your mice. [11] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Some vegetables and fruits to try include peas, carrots, broccoli, apples, and bananas. Avoid giving your mice foods like cabbage, corn, onions, chocolate, or junk food. Try giving a field mouse sunflower seeds, nuts, or strawberries. [12] X Research source"
    },
    {
      "title": "Sanitize your mouse tank once per week.",
      "content": "Sanitize your mouse tank once per week. Take your mice out of the cage and put them into a different plastic container while you clean out their tank. Clear out all of the bedding and wipe the tank down with clean, soapy water. Fill the tank with fresh bedding and place the food dishes and habitats back where they were before. Once the tank is clean, put your mice back in the tank. [13] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Mice can jump, so make sure the plastic container you keep them in while you’re cleaning is about 6 inches (15 cm) deep. Make sure that you spot clean the tank daily. Remove any bedding that has been soaked with urine to help prevent the tank from smelling."
    },
    {
      "title": "Refill water and food when they start to run low.",
      "content": "Refill water and food when they start to run low. Check the food and water levels in your tank and make sure they aren’t soiled or rotting. Whenever you notice the food or water is empty, clean out the dish and immediately refill it. [14] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Check food and water each day so you’re mice don’t get stressed if they’re out."
    },
    {
      "title": "Feed the mice occasional treats to try taming them.",
      "content": "Feed the mice occasional treats to try taming them. Put on your gloves and hold the treat between your fingers. Let the mouse approach the treat and take it from your hands. Talk to the mice in a low and quiet voice as you give them treats so they know you aren’t going to hurt them. Give them treats once or twice per week to calm them down. [15] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Wild mice can never be fully tamed like domestic mice. Rodent treats can be purchased from your local pet store."
    },
    {
      "title": "Separate mice if they get aggressive with one another.",
      "content": "Separate mice if they get aggressive with one another. Male mice usually live fine together if they are kept from a young age, but they may be territorial if you’ve taken them from the wild. If you notice your mice fighting or that one is injured, keep them in different tanks. [16] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source"
    }
  ]
}