{
  "url": "https://www.wikihow.com/Become-a-Contortionist",
  "title": "How to Become a Contortionist",
  "steps": [
    {
      "title": "Be aware of the two different types of contortionists.",
      "content": "Be aware of the two different types of contortionists. There are two different types of contortionists: front benders and back benders. These two types are based on the contortionist’s ability to hyperextend their spine. A front bender is often better at forward bending and a back bender is often better at back bending. Women are known to be good back benders, but men can also develop flexibility in back bending positions with enough practice, so don't be discouraged just because of your gender. The younger you are, the easier! Many contortionists incorporate their type of contortion into a performance, moving from contortion posture to contortion posture as part of a routine or a dance. With enough practice and dedication, you can start to create your own contortion routine, showcasing your best postures."
    },
    {
      "title": "Warm up before you do any stretching.",
      "content": "Warm up before you do any stretching. Make it a habit to always warm up before you get into any contortion stretching. This will prevent you from getting injured and allow your muscles to warm up and become more flexible. [1] X Research source Start by twisting and stretching your joints. Do this by doing a full range of motion for every joint in your body, from rotating your neck and head to twisting your wrists and ankles. Be gentle when doing this, as you only want to stretch your joints, not stress them out. Do at least thirty minutes of cardio exercise. This could be jogging, running, jumping jacks, or rowing. Your muscles are more flexible when your body temperature is one to two degrees higher than normal. Get your heart rate going and break a little sweat with cardio so you can then ease into your stretches."
    },
    {
      "title": "Practice leg stretches.",
      "content": "Practice leg stretches. Leg stretches will help your muscles prepare for contortion movements that require a wide range of motion in your legs and hips. [2] X Research source Start by putting weight into your right leg, with your toes firmly on the exercise mat. Slowly raise your left leg, gripping your big toe with your left thumb and forefinger. Raise your left leg as high as you can, stretching your leg to the ceiling. If possible, try to straighten your left leg until it is vertical and wrap your left hand and right hand over your leg. This will help you build flexibility in your leg muscles. Repeat these steps for your right leg, stretching your right leg to the ceiling."
    },
    {
      "title": "Try hip stretches.",
      "content": "Try hip stretches. Open up your hips so they feel ready for contortion movements. These hip stretches are similar to yoga hip openers, where you focus on breathing deeply in a hip-opening pose for several breaths. [3] X Research source Start in a lunge position, with your left leg extended behind you. Make sure your right knee does not extend past your ankle and that your left leg is balanced on the ball of your left foot. Slowly rock back and forth, feeling the stretch in your right and left hip. Place your hands on the inside of your right foot and lower your left leg until your knee, shin, and foot are flat on the mat. Inhale and slowly lower on your hands as far as you can go, whether this is upright on the palms of your hands, bent at the elbows, or on your forearms. Inhale and exhale as you feel the stretch in your hips, holding this pose for six to eight breaths. Come out of the pose the same way you went in, by coming back onto your hands and tucking your back leg. Then, bring your back left leg to meet your right leg and end in a forward fold position. Repeat this stretch on your left side, with your right leg extended behind you."
    },
    {
      "title": "Practice full splits",
      "content": "Practice full splits . The splits will help you stretch your leg and hip muscles. Depending on your level of flexibility, you may be able to only go halfway down in the splits or you may be able to touch the ground in the splits. If you are still working on getting all the way to the ground, you should continue to work on your splits as part of your daily stretching routine. [4] X Research source To go into the full splits, you should start with your right leg facing forward, with your left leg three to four feet behind your right leg. Slowly inch your legs in opposite directions until you can place your hands on either side of your right leg with your palms flat on the mat. Use your hands for support as you continue to inch your legs in opposite directions until your pelvis reaches the mat and you are in the full splits. Extend your hands and face forward. Breathe in this position for six to eight breaths. Then, come out of the splits by placing your hands on either side of your pelvis. Use your arms to help you pull your legs together and bend them behind you. Come back into the center of the mat and slowly rise to standing. Repeat these movements on the other side, with your left leg facing forward and your right leg behind you."
    },
    {
      "title": "Do backbends",
      "content": "Do backbends . Backbends are a great way to strengthen your back muscles and improve your flexibility. Many contortion poses require flexible back muscles and back bends are a good way to do this in a safe way. [5] X Research source Begin on your back, with your legs bent and an arm's length away from you. You can measure this by stretching out your hands to ensure you can touch the backs of your feet. Place your hands on either side of your head, with your palms flat on the mat. Inhale as you put weight into your legs and arms, raising your head off the ground. Rest for a breath on the top of your head, with no weight in your head, and then use your arms and legs to push yourself up into a backbend. Hold the backbend for six to eight breaths, making sure your head is relaxed and you are putting equal weight into your arms and legs. You should feel a stretch in your back muscles. When you are ready to come out of the pose, tuck your chin to your chest and slowly lower your back down to the mat. Sway your legs from side to side for a breath and try another backbend. However, try not to overextend your back muscles and only do another backbend if your body appears open to the idea."
    },
    {
      "title": "Practice contortion stretches at least one hour a day.",
      "content": "Practice contortion stretches at least one hour a day. Many contortionists do contortion stretching at least one to three hours a day to ensure their bodies stay flexible. You can start by committing to one hour a day of stretching and then slowly increase this amount to three hours a day, breaking it up so you stretch one hour in the morning, one hour in the afternoon, and one hour in the evening. Skipping or missing one day of stretching can actually reduce your flexibility and increase the amount of time it takes you to do certain contortion poses."
    },
    {
      "title": "Try the scorpion pose.",
      "content": "Try the scorpion pose. This is a basic contortion pose that requires the stretching of your legs and your back. Always do leg and back stretches before trying this pose. [6] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Begin with your left foot firmly planted on the exercise mat and raise your left arm to shoulder level. You will use your left arm to help you stay balanced and focused in this pose. Raise your right foot and bend it at the knee. Grip your right toes with your right hand and slowly extend your right foot out and upward. Maintain your balance by looking at the tips of your left hand as you extend your right foot. Continue to extend your right foot until it is at its highest point. Raise your left hand and bring it over your head to meet your right hand and your right foot. You are now in a basic scorpion pose. To extend the scorpion pose further, slowly walk your right hand and your left hand down your right foot until they grip your right shin. Extend your right leg until it is completely straight. You are now in a full scorpion pose, a common contortionist pose. Repeat the same steps on your left side with your left leg raised and extended behind you."
    },
    {
      "title": "Do rising and falling back bends.",
      "content": "Do rising and falling back bends. This is a variation on a standard backbend that will help you to build flexibility in your back muscles and strengthen your abdominal muscles. [7] X Research source Begin with your legs hip width apart on the mat and your arms extended over your head. Make sure your arms are stiff and strong as this will prevent you from falling on your head when you fall into the backbend. Look at your fingertips and keep your arms straight and strong as you let your arms and your gaze move behind you. Continue to look at your fingertips as your hands reach the mat behind you. Once you are in a backbend, put even weight in your heels and slowly raise your arms off the mat. Try to find a center of balance so both arms can hang at your sides as you are upside down. Wrap your right hand around your right knee and wrap your left hand around your left knee for a nice back stretch. To do a rising back bend, place your hands back on the mat and use your abdominal muscles to slowly pull your upper body back up into a standing position."
    },
    {
      "title": "Try bent leg splits.",
      "content": "Try bent leg splits. This is a variation on full splits that allows you to show off your flexibility and add a cool looking contortion move to your repertoire. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Start by going into the full splits on your right side, with your right leg extended forward and your left leg extended backward. Raise your right arm and reach it back behind you. Inhale as you slowly bend your left leg and wrap your right arm around your left foot. Place your left foot on your forehead, extending your neck back as well. Hold this pose for one to two breaths and then move out of the splits. Repeat these movements on the left side, with your left leg extended forward and your right leg extended backward. You will then raise your left arm and wrap it around your bent right foot."
    },
    {
      "title": "Practice the chin stand pose.",
      "content": "Practice the chin stand pose. This pose is one of the more advanced backbend contortion poses and a real show stopper. You should work very slowly through this pose and always warm up your back muscles before attempting it. [9] X Research source Begin by doing a falling backbend. Then, walk your arms forward between your legs until you can place your chin on the mat. Keep your arms bent by your head and make sure there is very little weight on your chin. Let your chest and back muscle support you as you raise your hands off the ground. If you are comfortable in this position, you can place your arms back on the ground and work on raising your legs off the ground. Over time, you want to work on bending your legs and placing your toes on the top of your head. To get out of this position, you will tuck your arms into your sides and raise your legs off the ground until they are back behind you. Rise up on your elbows and slowly come back to seated or stay on your stomach and rest for a moment. It is better to do a chin stand with an instructor or someone who can support you when you fall. Prepare your body by doing sun salutations or downward and upward dog poses. Place two yoga blocks near the wall and place your shoulders on them to relieve pressure for the chin on the floor. Bring the tailbone up to the ceiling in a downward dog position and walk forward until the back is straight. Kick one leg up until you hit the wall, then do the other leg the same way. After you gain enough balance, try keeping your legs off the wall."
    },
    {
      "title": "Work on contortion poses at least one to three hours a day.",
      "content": "Work on contortion poses at least one to three hours a day. Similar to stretching, contortion poses require a lot of practice on a consistent basis. Doing one to three hours a day of contortion poses can help you to build your flexibility and strength. [10] X Research source You can also start to link each movement together to create a contortion routine. Try to move from a back bend to a full split or a falling back bend to a chin stand, for example, and time these poses to music. Over time, you can try to link together four to five poses and set them to music, allowing you to create your own contortion routine."
    },
    {
      "title": "Watch example videos online.",
      "content": "Watch example videos online. There are many contortionist videos online that you can watch to get a better sense of contortionist movements and stretching. Look for videos that showcase contortion routines by trained professionals, as this will allow you to have a visual reference for your own contortion routine. [11] X Research source"
    },
    {
      "title": "Join a contortion class.",
      "content": "Join a contortion class. Contortion classes can be found at performing arts schools, gyms, and yoga studios. Make sure the classes are taught by an experienced contortionist who uses safe and accessible exercises to deepen your stretches and movements."
    },
    {
      "title": "Get one on one training with a contortion coach.",
      "content": "Get one on one training with a contortion coach. If you feel you have reached a certain point in your contortion training and are looking to try more advanced contortion movements, you may seek out a contortion coach, who is usually a contortionist themselves. A contortion coach can often be found by word of mouth in the performing arts community, online, or through an in-person contortion class. Ask the instructor of your contortion class if she has any suggestions on contortion coaches who can work one on one with you. [12] X Research source"
    }
  ]
}