{
  "url": "https://www.wikihow.com/Boil-Noodles",
  "title": "How to Boil Noodles",
  "steps": [
    {
      "title": "Fill a large pot with 4–5 US quarts (3.8–4.7 L) of water.",
      "content": "Fill a large pot with 4–5 US quarts (3.8–4.7 L) of water. Add the water to your pot with the aid of a measuring cup to ensure that you end up with just the right amount. A good rule of thumb is to use about 1 US quart (0.95 L) for every 1 ⁄ 2 pound (230 g) of noodles. [1] X Research source If you don’t have a measuring cup, run enough water into your pot to cover your noodles completely. It’s important that they submerged in order for them to cook properly."
    },
    {
      "title": "Bring your water to a low boil on the stove.",
      "content": "Bring your water to a low boil on the stove. Set the pot on a preheated eye set to medium-high heat and allow the water inside to begin warming up. Once it reaches a constant yet gentle bubble, you’ll be ready to add your noodles. [2] X Research source Medium-high is preferable to a higher heat setting when preparing noodles, as intense temperatures are more likely to quickly overcook the starches and cause them to become gluey."
    },
    {
      "title": "Stir ½ a teaspoon of oil and 1-2 tablespoons of salt into the water.",
      "content": "Stir ½ a teaspoon of oil and 1-2 tablespoons of salt into the water. Together, the oil and salt will prevent your noodles from fusing together as they move around in the pot. This will be especially useful if you’re working with fresh, doughy handmade noodles. As an added bonus, oil and salt will both impart a little extra flavor to your boiling water. [3] X Research source Any type of oil will do the trick, but a mild variety like olive, vegetable, or canola will provide the best results. Avoid adding more than ½ a teaspoon of oil to 6 ounces (170 g) of noodles. Doing so could leave your noodles overly greasy and make it harder for sauce to stick later on."
    },
    {
      "title": "Add 6–16 ounces (170–450 g) of raw or dried noodles to the water.",
      "content": "Add 6–16 ounces (170–450 g) of raw or dried noodles to the water. Lower the noodles into the pot carefully to prevent splashing. After you’ve put in all the noodles you plan on cooking, give them a quick stir. This will help separate and distribute them throughout the boiling water. [4] X Research source Break long noodles like vermicelli, hakka , and angel hair into smaller segments to make sure they heat evenly and reduce their overall cook time."
    },
    {
      "title": "Allow dried noodles to boil for 8-12 minutes.",
      "content": "Allow dried noodles to boil for 8-12 minutes. For most types of dried noodles, this will be just long enough to soften them up and heat them all the way through. If you’re making a large batch of noodles, be ready to increase your cook time by an additional 2-3 minutes. [6] X Research source For best results, be sure to follow the recommended cooking time specified on the package. If necessary, set a timer so you don’t accidentally forget about your noodles while they’re on the stove."
    },
    {
      "title": "Boil fresh noodles for 1-4 minutes, or just long enough to cook them.",
      "content": "Boil fresh noodles for 1-4 minutes, or just long enough to cook them. Freshly-made noodles don’t take anywhere near as long to cook as dried ones, since they’re already quite soft. In most cases, they’ll only need somewhere from 90 seconds to 4 minutes to take on a perfectly tender texture. [7] X Research source To determine whether you fresh noodles are done to your liking, fish one out after about a minute and give it a quick taste test. You can then decide how much more time it needs, if any."
    },
    {
      "title": "Stir your noodles frequently during their first minute or two on the stove.",
      "content": "Stir your noodles frequently during their first minute or two on the stove. This is when they’ll begin releasing most of their glue-like starch. As you’re stirring, lift the lowest noodles up from the bottom so you’re not just swirling them around. After the first couple minutes, you can cut back your stirring to once every few minutes. Do your stirring with a wooden spoon. Boiling water can melt plastic utensils and make metal ones too hot to hold comfortably."
    },
    {
      "title": "Stop cooking your noodles after 2-3 minutes if you like them al dente.",
      "content": "Stop cooking your noodles after 2-3 minutes if you like them al dente . In this case, you’ll be taste-testing your cooked noodles to determine whether they have the right texture. As soon as they take on a uniform, opaque color, take them off of the stove and give one a nibble. It should be firm yet slightly chewy, without a hint of crunchiness. [8] X Research source Give your sample noodle plenty of time to cool before eating it to avoid burning your mouth. If your noodles are still a little undercooked, continue boiling them for 30 seconds to a minute at a time until they achieve the desired consistency."
    },
    {
      "title": "Drain your noodles thoroughly using a colander.",
      "content": "Drain your noodles thoroughly using a colander. Shut off your cooktop and take the pot off of the hot burner. Using a pair of potholders or oven mitts, pick up the pot and gently pour its contents out into your waiting colander. Shake the colander a few times to coax out any excess liquid. [9] X Research source If you don’t have a colander, you can also remove your noodles using a pair of tongs or a slotted spoon, or by cracking the lid of the pot (if you used one) and draining the water a little at a time. [10] X Research source Most chefs recommend leaving a little water in with your noodles to improve the texture of traditional Italian pasta dishes. If you plan on stir-frying or otherwise cooking your noodles afterwards, however, you’ll want to make sure they’re as well-drained as possible."
    },
    {
      "title": "Rinse your cooked noodles with cold water to keep them from clumping.",
      "content": "Rinse your cooked noodles with cold water to keep them from clumping. Run your colander under a stream of water or plunge it into a separate bowl just long enough to immerse your noodles. A final rinse will do away with any leftover traces of starch that might otherwise become a problem as you noodles begin to cool. [11] X Research source You can even rub especially thick types of noodles like soba by hand in a bowl of cold water to make sure they don’t turn out sticky or slimy."
    }
  ]
}