{
  "url": "https://www.wikihow.com/Clean-a-Bore-Snake",
  "title": "How to Clean a Bore Snake",
  "steps": [
    {
      "title": "Soak your snake in soapy water.",
      "content": "Soak your snake in soapy water. Start filling your sink, bucket, or other container with warm water and add a few drops of mild laundry detergent. Place your snake in the water. Let it soak for at least 15 to 20 minutes. For especially dirty or oily snakes, give it 30 to 40 minutes. [1] X Research source"
    },
    {
      "title": "Scrub, brush, and rinse the snake.",
      "content": "Scrub, brush, and rinse the snake. First, spin the snake around in the water to dislodge any loose dirt or oil. Then use a microfiber cloth to rub the braided floss part of the snake. Finally, use a toothbrush to gently scrub the bronze bore brush. Repeat as needed to remove all dirt and oil. Then rinse it under running water to remove all traces of soap. [2] X Research source"
    },
    {
      "title": "Force out the excess water.",
      "content": "Force out the excess water. Use your non-dominant hand to hold the snake by one end so that it dangles over your sink, bucket, or other container. Use your dominant hand to gently squeeze the water out from top to bottom until you reach the bore brush. Skip that part and then continue in the same fashion for the rest of the snake's length. [3] X Research source"
    },
    {
      "title": "Pat dry, then air-dry.",
      "content": "Pat dry, then air-dry. Use a clean, dry cloth to pat the snake down. Sponge out as much water as you can. Then hang it over a drying rack or clothes hanger, or pin it to a clothesline to air-dry. [4] X Research source"
    },
    {
      "title": "Bag or bundle your snake.",
      "content": "Bag or bundle your snake. Put your snake inside a wash bag, pillowcase or something similar. Tie it shut. Alternatively, roll the snake up and then tie it up with white shoelaces or a similarly light-colored machine-safe cord. Do not use the snake's pull cord to do this, since the knots may tighten during washing, which means you might have to cut the cord to undo your bundle. [5] X Research source"
    },
    {
      "title": "Prepare your washer.",
      "content": "Prepare your washer. First, set your washer to a small load on the delicate cycle. Start filling it with water and add a few drops of mild laundry detergent. Once the machine fills, switch it off. [6] X Research source"
    },
    {
      "title": "Let your snake soak.",
      "content": "Let your snake soak. Once the machine has filled, place the snake in the soapy water. If it isn't too dirty, give it 15 to 20 minutes to soak. Give it 30 to 40 minutes if it's very soiled. [7] X Research source"
    },
    {
      "title": "Restart the washing cycle.",
      "content": "Restart the washing cycle. Switch the machine back on once the snake has had a chance to soak. Let the cycle run to its end. [8] X Research source"
    },
    {
      "title": "Air-dry the snake.",
      "content": "Air-dry the snake. Once the cycle completes, take the snake out of its bag or remove its ties. Pin the snake to a clothesline or hang it over a clothes hanger or drying rack so it can air-dry."
    },
    {
      "title": "Dry thoroughly before using.",
      "content": "Dry thoroughly before using. Wait until your snake is totally dry to the touch before running it through your gun's barrel. Keep in mind that water can rust or otherwise damage your gun. Protect your gun by giving the snake the chance to totally air-dry before bringing the two into contact. [9] X Research source Drying times will depend on the materials and size of your snake."
    },
    {
      "title": "Use only a toothbrush to clean the bore brush.",
      "content": "Use only a toothbrush to clean the bore brush. If you're in a rush, it may be tempting to wipe the bore brush with the same cloth that you used for the rest of the snake. However, be aware that this will most likely result in fibers being left behind on the brush's bristles. These in turn will end up in your gun's barrel when you use the snake next, so definitely use a toothbrush in order to keep your barrel clean. [10] X Research source"
    },
    {
      "title": "Use only white or light-colored laces or cords to tie your rolled snake.",
      "content": "Use only white or light-colored laces or cords to tie your rolled snake. If you're machine-washing and choosing to roll your snake up and tie it into a bundle, never use dark-colored shoelaces or cords to do so. Expect these to possibly stain your snake during its wash. These stains will make it harder to judge what's dirt, what's oil, and what's just a stain. [11] X Research source"
    }
  ]
}