{
  "url": "https://www.wikihow.com/Clean-Canvas",
  "title": "How to Clean Canvas",
  "steps": [
    {
      "title": "Remove the shoelaces.",
      "content": "Remove the shoelaces. Untie and unthread the laces from the lace holes in the shoe. Removing the laces will allow you to thoroughly scrub the tongue area of the shoe while cleaning. You could also clean the shoelaces later on, or just replace them."
    },
    {
      "title": "Remove surface dirt.",
      "content": "Remove surface dirt. Smack the shoes together over a garbage can to knock off dirt and dust from the bottoms of the shoes. Then use a soft bristled brush to brush off any loose dirt particles and impurities on the canvas areas of the shoes. An old toothbrush works great for removing dirt, especially for reaching into tiny crevices."
    },
    {
      "title": "Mix your cleaning solution.",
      "content": "Mix your cleaning solution. Any mild detergent mixed with water will work as a cleaning solution. Gentle body soap, dishwashing soap, or a small amount of laundry detergent, are all viable options. For about a cup of water, consider using about ½ a teaspoon of mild detergent. Use your old toothbrush to mix up the water and soap until some bubbles start to form. You could also use a small amount of bleach if your shoes are white, but be aware that bleach can potentially yellow the canvas fabric. A mild detergent is the safer bet. If you can, use a detergent that's formulated specifically for shoes. [1] X Expert Source Carroll Kelly Shoe Care Specialist Expert Interview. 17 December 2020. You can find specialty shoe cleaners at a shoe repair shop. [2] X Expert Source Carroll Kelly Shoe Care Specialist Expert Interview. 17 December 2020. This cleaning solution also works on canvas bags."
    },
    {
      "title": "Soak the laces.",
      "content": "Soak the laces. If you’re planning on cleaning the laces rather than replacing them, drop the laces into the cleaning solution. Allow them to soak in the solution for about 15 minutes. While you wait for the laces to soak, you can clean the actual shoe."
    },
    {
      "title": "Scrub the shoe.",
      "content": "Scrub the shoe. Dip your old toothbrush into the soapy water mixture, and start scrubbing at the dirty areas of the shoe. Move the toothbrush in circles to thoroughly loosen the dirt and remove the stains. Continue dipping the toothbrush into the soapy water mixtures as you focus on other areas of the shoe. It's okay to saturate the canvas with the soapy water solution, but try your best to keep from getting the foot bedding of the shoe wet. If you get the foot bedding wet, it won’t ruin your shoe, but it could cause damage after repeated saturation. You can also use a horsehair brush for this—just make sure it isn't too bristly, or else it'll scratch up the shoe. [3] X Expert Source Carroll Kelly Shoe Care Specialist Expert Interview. 17 December 2020."
    },
    {
      "title": "Rinse the shoe.",
      "content": "Rinse the shoe. You can rinse the canvas of the shoe by running it under a small stream of cool water from a faucet. A small stream will ensure you gently rinse off the soapy solution from the shoe without getting water into the inside of the shoe."
    },
    {
      "title": "Scrub the laces.",
      "content": "Scrub the laces. After the laces have had time to soak, remove them from the soapy water solution. Use your old toothbrush to scrub away at the stains. Once you have scrubbed all the stained areas of the laces, rinse them in cool water. It may help to hold down the laces with your fingers on one hand, and focus on scrubbing a stained area with your other hand."
    },
    {
      "title": "Dry the shoes and laces.",
      "content": "Dry the shoes and laces. Once the shoes and laces are cleaned, dab them dry with a paper towel to soak up any remaining water. Then allow the shoes and laces to dry naturally, outside in the sun. Drying shoes in the dryer can damage the adhesive on the shoe and shrink the canvas material."
    },
    {
      "title": "Brush off any surface dirt.",
      "content": "Brush off any surface dirt. Tiny leaves and little bits of dirt can get caught in canvas furniture. Wipe off the canvas furniture with a bristled brush to remove any surface dirt. You could even hit canvas pillows with your hands to loosen dust from the fabric."
    },
    {
      "title": "Look at the canvas covering labels.",
      "content": "Look at the canvas covering labels. If the labels on your canvas furniture covers say they are machine washable, go ahead and wash them in a washing machine. Use a mild detergent on a mild washing setting to wash the canvas coverings; Canvas fabric can be delicate. If your canvas coverings are not machine washable, you will have to clean them by hand like the rest of your furniture pieces."
    },
    {
      "title": "Create your cleaning mixture.",
      "content": "Create your cleaning mixture. Fill a bucket with 2 gallons of clean water. Add approximately ½ a capful of a mild detergent like dishwashing soap, or detergent specifically made for washing items by hand. You can swirl your bristled brush around in the bucket to make the water sudsy."
    },
    {
      "title": "Clean the canvas surface.",
      "content": "Clean the canvas surface. Use a rag or sponge dipped in the cleaning solution to initially wipe down the canvas surfaces. Then use a bristled brush dipped in the cleaning solution to go over the canvas again, and scrub the soiled areas. You don’t have to apply too much pressure while scrubbing the canvas surfaces. Rough scrubbing can end up damaging the fabric."
    },
    {
      "title": "Rinse the canvas.",
      "content": "Rinse the canvas. Lightly spray the canvas furniture with clean water to rinse off any soap residue. Water from a hose will work just fine. Once all furniture pieces are rinsed, allow the furniture to dry naturally in the sun. If the canvas is colored, be aware that allowing the furniture to dry in the sun may weaken its coloring."
    },
    {
      "title": "Consider applying a fabric protectant.",
      "content": "Consider applying a fabric protectant. To protect the canvas from further damage, apply a protective spray that will help the canvas repel dirt and water. Apply this spray only when the canvas is completely dried. Spray the canvas surfaces from approximately 3 feet away, being sure to spray in a thorough, even, widespread fashion. Be sure to follow the instructions on the protective spray bottle. If you don’t know which kind of protective spray to use on your canvas, consult an employee at your local home department store."
    },
    {
      "title": "Remove surface debris.",
      "content": "Remove surface debris. Use a stiff bristled brush, and wipe off any loose dirt from the surface of the canvas covering. Some items that may be stuck to the canvas surface include leaves, dust, dirt, bird droppings, and algae growths."
    },
    {
      "title": "Spray the canvas with water.",
      "content": "Spray the canvas with water. Gently hose the canvas covering to dampen the surface. Then, use a spray bottle or a cloth dipped in water to moisten the seams of the canvas, since the seams can accumulate and house a lot of dirt. Saturating the canvas surface with water will help the cleaning agent adhere, and soak into the grimy nooks and crannies of the canvas. [4] X Research source"
    },
    {
      "title": "Make your cleaning solution.",
      "content": "Make your cleaning solution. The cleaning solution should be mild and diluted with water. A mild detergent such as dishwashing soap or a detergent specific for washing fabrics by hand is a good option, but you could also use bleach. A good cleaning mixture ratio is about 1 cup of bleach to 5 gallons of warm water. If you are going to use a mild detergent, consider using about ¼ cup of detergent to per gallon of warm water. [5] X Research source"
    },
    {
      "title": "Clean the fabric.",
      "content": "Clean the fabric. Use a stiff bristled brush to work the cleaning solution into the canvas fabric. You can move the brush in circles or scrub back and forth. However, don’t apply a great amount of pressure while scrubbing; you could damage the canvas fabric. Again, remember to focus on scrubbing the seams of the canvas, because that’s where a lot of filth collects."
    },
    {
      "title": "Let the cleaning solution soak.",
      "content": "Let the cleaning solution soak. Leave the soapy cleaning solution on the canvas fabric for about 30-60 minutes. This will allow the cleaning solution to soak into the fabric and release the dirt and impurities."
    },
    {
      "title": "Rinse the fabric.",
      "content": "Rinse the fabric. Rinse the fabric with clean water to remove the soapy solution. Hosing down the fabric will work just fine. You may have to repeat this process a few times if your boat canvas is particularly dirty."
    },
    {
      "title": "Air dry the canvas.",
      "content": "Air dry the canvas. Allow the canvas covering to dry naturally by the sun and wind outside. Your canvas covering should be completely dry with one full day sitting in the sun."
    },
    {
      "title": "Consider retreating the fabric.",
      "content": "Consider retreating the fabric. You may want to consider applying a water proofing spray to the surface of the fabric. Some fabric treatments made especially for boats can even contain solutions to prevent wear and tear from sun rays. Simply follow the instructions on the fabric protectant spray bottle. Normally, 2 thin coats of protectant spray are recommended for the best results. Allow the first coat to completely dry before adding on the second coat. [6] X Research source If you are unsure about what kind of fabric treatment to use, consult a worker at your local boat shop."
    }
  ]
}