{
  "url": "https://www.wikihow.com/Care-for-a-Baby-Wild-Mouse",
  "title": "How to Care for a Baby Wild Mouse",
  "steps": [
    {
      "title": "Ensure that the nest has been abandoned.",
      "content": "Ensure that the nest has been abandoned . If you come across a nest with no mother, you cannot immediately determine that she is gone for good. You may have simply frightened her or she may be out looking for food. Leave the nest (and mice) alone and check again later. If the mother is still absent, you may need to take action. [1] X Research source Try not to disturb the nest. But don't worry, mother mice will not reject babies who have been touched. Return again after 1-2 hours, and then again after another 1-2 hours. Check the babies' bellies for white bands known as \"milk bellies.\" If you don't see these over the course of 4-6 hours, the babies have not been fed and are likely orphans."
    },
    {
      "title": "Seek help from a vet, when necessary.",
      "content": "Seek help from a vet, when necessary. If the baby mouse has been attacked by a cat, you must seek the help of a veterinarian right away. Bacteria from the cat's mouth can cause a serious (often fatal) infection called \"septicemia.\" A vet may be able to provide emergency treatment for the baby mouse. [2] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source Perform an internet search for veterinarians in your area. Call ahead to see if they can treat mice."
    },
    {
      "title": "Handle mice carefully.",
      "content": "Handle mice carefully. Baby mice are small and docile, and must be handled with care. They should not squirm much, but you must still grasp them firmly when feeding to prevent falls. Additionally, it is important to note that wild mice have been shown to carry diseases. You may choose to wear latex gloves when handling the mice. Whether or not you wear gloves, you must thoroughly wash your hands after handling."
    },
    {
      "title": "Provide liquid nourishment.",
      "content": "Provide liquid nourishment. Baby mice would ordinarily drink milk from their mother. Instead, you are going to need to provide that “milk” to you baby mouse. Avoid cow's milk. Instead, you might choose: Baby formula made with soy (diluted slightly). Kitten formula (diluted slightly). Goat’s milk. Puppy milk replacer."
    },
    {
      "title": "Feed it every two hours.",
      "content": "Feed it every two hours. Your baby mouse is going to need to eat around the clock until it opens its eyes. For very young mice (0-2 weeks old), you must do this every two hours. After this, they only need to eat every 3-4 hours. Once their eyes are open, they should no longer need to eat during the night. Warm up the milk. Test a drop on your wrist to make sure it is not too cold or too hot. Fill an eyedropper, syringe, or pipette with milk. Hold the mouse firmly with your non-dominant hand. Holding the pipette in your other hand, try to shimmy the tip into the mouse's mouth. Put drop of warm milk in then wait for him to swallow (this looks like stretching out and squirming). Offer the mouse as much milk as it wants."
    },
    {
      "title": "Include solid foods once eyes are open.",
      "content": "Include solid foods once eyes are open. When your mouse’s eyes are open, it can begin to eat some solid food. Continue giving it formula until the 4-6 weeks old, by which time it should be weaned. [3] X Research source You may give your mouse: Hamster food moistened with formula or goat’s milk. Kitten food (moistened). Human baby food (homemade or store-bought). Soft cooked vegetables like squash, peas, or carrots."
    },
    {
      "title": "Stimulate the mouse to help it go to the bathroom.",
      "content": "Stimulate the mouse to help it go to the bathroom. Baby mice cannot urinate or defecate on their own. Normally, the mother would lick them to encourage them to eliminate. After a meal, dip a cotton ball or your finger in warm water. Gently, move it over the mouse's genitals until it has gone. [4] X Research source"
    },
    {
      "title": "Set up a cage.",
      "content": "Set up a cage. You will need some kind of enclosure to house your baby mouse. That first night, you might begin with just a shoebox containing a kitchen towel. However, if you plan to make this mouse your pet, you will need something more permanent. As a general rule, you should provide one cubic foot (30.4 cubic cm) of space for your first mouse, and an additional 0.5 cubic feet (15.24 cubic cm) of space for each additional mouse in the same cage. [5] X Research source You must also clean the cage once a week. You may purchase one of the following at your local pet store: Glass aquarium. Metal cage. Plastic cage."
    },
    {
      "title": "Keep your mouse warm.",
      "content": "Keep your mouse warm. If your mouse were in the wild, it would cuddle with its mother and siblings. In your home, you need to make sure that your baby mouse stays warm. [6] X Research source Spread wood shavings on the bottom of its cage. Keep the cage off the ground in your home. Keep the temperature in your home around 70 degrees F (21 degrees C). Place a heat source in one part of the cage. Use a hot water bottle wrapped in towels or put a heating pad under one half of the cage. Make sure that the mouse can move away if it is too warm."
    },
    {
      "title": "Include some toys.",
      "content": "Include some toys. Mice need to exercise quite a bit, they need things to chew on, and they crave mental stimulation. As your mouse begins exploring the cage, consider providing some of the following items: [7] X Research source Exercise toys, like a mouse wheel or little balls with bells inside (normally sold as cat toys). Chew toys, like paper towel rolls or egg cartons. Foraging toys or food-hiding toys (created for birds and/or rodents)."
    },
    {
      "title": "Understand the risks.",
      "content": "Understand the risks. Although transmission rates are rather low, wild mice can carry diseases which could make you sick. Perform an internet search to determine the level of risk in your area. Take precautions to protect yourself. For example a wild mouse can transmit: Hantavirus. Salmonellosis (bacterial infection). Lyme disease (from ticks)."
    },
    {
      "title": "Wash your hands",
      "content": "Wash your hands . The very best way to prevent the spread of germs from your mouse is to wash your hands after you touch it. Before washing your hands, avoid touching your mouth, eyes, or any part of your face. Washing with soap and water is best, but if you are not able to, using alcohol-based hand sanitizer is another option. [8] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Wet your hands with water. Lather with soap (any soap is fine). Rub all surfaces of your hands. Rinse and dry your hands."
    },
    {
      "title": "Keep the mouse away from your food.",
      "content": "Keep the mouse away from your food. Salmonella bacteria—which results in the condition Salmonellosis--can be spread by mice. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source As such, it is important to keep your mouse away from the food that you eat. Never allow mice on countertops or in pantries. Keep all of your food in secure, sealed containers."
    },
    {
      "title": "Remove ticks.",
      "content": "Remove ticks. If you live in a region that is prone to ticks, be sure you check your mouse for ticks regularly (at least once a week). If you find a tick attached to your mouse, you will need to remove it . [10] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Wear rubber gloves. Clean the area with rubbing alcohol (try to smother the tick). Use tweezers to carefully pull the tick off of your mouse. Flush the tick down your toilet."
    }
  ]
}