{
  "url": "https://www.wikihow.com/Cook-Fresh-Cauliflower",
  "title": "How to Cook Fresh Cauliflower",
  "steps": [
    {
      "title": "Cut 1 head of cauliflower into bite-sized pieces.",
      "content": "Cut 1 head of cauliflower into bite-sized pieces. Set a rinsed cauliflower on your cutting board and slice it in 1/2 lengthwise. Lay the halves flat and cut them in 1/2 again. Then, turn a piece on its side and cut the core out at an angle. Hold the cauliflower over a bowl and break it up so the florets fall into the bowl. [1] X Research source"
    },
    {
      "title": "Bring a pot of water to boil over high heat.",
      "content": "Bring a pot of water to boil over high heat. Set a medium pot on the stove and fill it 3/4 full with water. Then, place a lid on the pot and turn the burner on so the water begins to boil vigorously. [2] X Research source To flavor the cauliflower as it cooks, use chicken or vegetable stock instead of water."
    },
    {
      "title": "Add the cauliflower to the pot and boil it for 5 to 7 minutes.",
      "content": "Add the cauliflower to the pot and boil it for 5 to 7 minutes. Wear oven mitts to take the hot lid off of the pot and slowly add the florets to the boiling water. Keep the lid off of the pot and cook the florets until they're as tender as you like. [3] X Research source If you're planning on mashing the cauliflower, cook them until they're completely soft when you poke them with a fork."
    },
    {
      "title": "Drain the cauliflower in a colander.",
      "content": "Drain the cauliflower in a colander. Set a colander or fine-mesh strainer in the sink and slowly pour the cauliflower into the colander so the water drains into the sink. Be careful as you're pouring because the steam from the water is hot. [4] X Research source"
    },
    {
      "title": "Season the florets with salt and pepper.",
      "content": "Season the florets with salt and pepper. Transfer the cauliflower to a serving dish and season it with salt, pepper, or a little butter. Refrigerate leftover cauliflower in an airtight container for up to 5 days. [5] X Research source"
    },
    {
      "title": "Preheat the oven to 400 °F (204 °C) and grease a baking sheet.",
      "content": "Preheat the oven to 400 °F (204 °C) and grease a baking sheet. Spray the rimmed sheet with nonstick cooking spray or line it with a piece of aluminum foil. If you don't have a baking sheet, use a large roasting pan. [6] X Research source"
    },
    {
      "title": "Cut 1 head of cauliflower into florets.",
      "content": "Cut 1 head of cauliflower into florets. Slice the rinsed cauliflower in 1/2 from the top through the stem. Lay both pieces flat on your cutting board and cut them in 1/2 lengthwise. Turn 1 of the quarters on its side and cut at an angle to remove the core. Then, hold the cauliflower piece over a bowl and break it up so the florets fall into the bowl. [7] X Research source Repeat this with each cauliflower quarter."
    },
    {
      "title": "Toss the florets with lemon juice, olive oil, salt, pepper, and garlic powder.",
      "content": "Toss the florets with lemon juice, olive oil, salt, pepper, and garlic powder. Pour 1 tablespoon (15 ml) of lemon juice and 3 tablespoons (44 ml) of extra-virgin olive oil over the cauliflower in the bowl. Then, stir in 1/4 teaspoon (0.5 g) of garlic powder along with salt and pepper according to your taste. [8] X Research source Although you could use fresh garlic, it might burn as the cauliflower roasts. Here's a trick—grab an extra produce bag from the grocery store and stick your florets in there. Then, drizzle them with oil and sprinkle them salt, pepper, and a little paprika. Shake everything up to evenly coat your florets (without using a bowl!)."
    },
    {
      "title": "Spread the cauliflower on the sheet and bake it for 20 to 25 minutes.",
      "content": "Spread the cauliflower on the sheet and bake it for 20 to 25 minutes. Arrange the florets so they're in a single layer and put the sheet in the oven. Roast the cauliflower until it's tender when you poke a piece with a fork. [9] X Research source As the cauliflower cooks, the tops brown slightly."
    },
    {
      "title": "Sprinkle 1/2 cup (50 g) of parmesan over the florets.",
      "content": "Sprinkle 1/2 cup (50 g) of parmesan over the florets. Wear oven mitts to take the baking sheet out of the oven. Carefully sprinkle the grated cheese over the cauliflower. If you don't want to add parmesan to your cauliflower, skip this step. [10] X Research source"
    },
    {
      "title": "Cook the florets for 3 to 5 minutes.",
      "content": "Cook the florets for 3 to 5 minutes. Return the sheet of cauliflower to the oven and roast the cauliflower until the parmesan melts. Remove the florets and serve them while they're hot. [11] X Research source Store leftover cauliflower in an airtight container for up to 5 days."
    },
    {
      "title": "Cut 1 head of cauliflower into bite-sized florets.",
      "content": "Cut 1 head of cauliflower into bite-sized florets. Take a chef's knife and cut the rinsed cauliflower in 1/2 lengthwise. Lay each half flat and cut them in 1/2 lengthwise again. Then, turn your knife at an angle and cut the core away from each quarter. Hold the cauliflower over a bowl and crumble it into florets. [12] X Research source Since you cut away the core, the cauliflower easily breaks into florets on its own. Use a microwave-safe bowl."
    },
    {
      "title": "Pour 2 to 3 tablespoons (30 to 44 ml) of water into the bowl and cover it loosely.",
      "content": "Pour 2 to 3 tablespoons (30 to 44 ml) of water into the bowl and cover it loosely. Add enough water to the bowl of cauliflower to cover the bottom. Lay a piece of plastic wrap, waxed paper, or a wet towel over the bowl, which will trap steam as the cauliflower cooks. [13] X Research source You could also cover the bowl with a small microwave-safe plate."
    },
    {
      "title": "Microwave the cauliflower for 3 to 4 minutes.",
      "content": "Microwave the cauliflower for 3 to 4 minutes. If you like your cauliflower to have a little bite, cook it for 3 minutes. If you know you like cauliflower to be completely soft, microwave it for 4 minutes. [14] X Research source Microwave the cauliflower on full power."
    },
    {
      "title": "Leave the cauliflower in the microwave for 1 minute before you take it out.",
      "content": "Leave the cauliflower in the microwave for 1 minute before you take it out. The cauliflower will continue to cook as it rests. After 1 minute, wear oven mitts to remove the hot bowl and carefully lift the lid or covering off. Insert a fork into a floret to see if it's as tender as you want. [15] X Research source The steam in the bowl is very hot, so lift the lid away from your face. If the cauliflower isn't as soft as you want, cover the bowl and return it to the microwave. Heat the cauliflower for 1 minute and check it again."
    },
    {
      "title": "Drain water from the bowl.",
      "content": "Drain water from the bowl. There might be a little water left in the bottom of the bowl. If there is, carefully pour the cauliflower into a fine-mesh strainer over a sink so the water drains. [16] X Research source"
    },
    {
      "title": "Season the cauliflower.",
      "content": "Season the cauliflower. Return the cauliflower to the bowl and sprinkle it with salt and pepper. To add extra flavor, stir in a little butter or olive oil. For a more filling topping, pour warm cheese sauce over the cauliflower florets. [17] X Research source Refrigerate leftover cauliflower in an airtight container for up to 5 days."
    },
    {
      "title": "Heat a gas or charcoal grill to medium-low.",
      "content": "Heat a gas or charcoal grill to medium-low. If you're using a gas grill, leave 1/2 of the burners turned off and turn the others to medium-low. If you're using a charcoal grill, fill a chimney with briquettes and light them. When the coals are hot and lightly covered with ash, dump the coals on 1 side of the grill. [18] X Research source Dumping the coals on 1/2 of the grill grate creates a 2-zone fire. This allows you to control the temperature as you grill the cauliflower steaks."
    },
    {
      "title": "Cut each cauliflower into 2 or 3 thick steaks.",
      "content": "Cut each cauliflower into 2 or 3 thick steaks. Rinse 2 heads of cauliflower and put them on a cutting board. Pull off all of the outer leaves and use a chef's knife to trim the stem so you can stand the cauliflower on a flat base. Hold the cauliflower in place with 1 hand and carefully cut the cauliflower into 4 slabs that are about 1 1 ⁄ 2 inches (3.8 cm) thick. Then, lay the steaks on a sheet. [19] X Research source Keep in mind that florets will crumble away as you cut the steaks. Set these aside to use in other recipes."
    },
    {
      "title": "Brush both sides of the steaks with 1⁄4 cup (59 ml) of olive oil.",
      "content": "Brush both sides of the steaks with 1 ⁄ 4 cup (59 ml) of olive oil. Pour the oil into a small bowl and dip a barbecue or pastry brush into it. Then, brush the oil completely over the surface of each steak. Flip the steaks over and brush the other side as well. [20] X Research source The olive oil flavors the steaks and prevents them from sticking to the grill."
    },
    {
      "title": "Mix the salt, pepper, garlic, powder, and paprika and season the steaks.",
      "content": "Mix the salt, pepper, garlic, powder, and paprika and season the steaks. Put 1 teaspoon (5.5 g) of sea salt into a small bowl and add 1/4 teaspoon (0.5 g) of ground black pepper. Stir in 1/2 teaspoon (1 g) of garlic powder and 1/2 teaspoon (1 g) of smoked paprika. Sprinkle this seasoning mix over each cauliflower steak. [21] X Research source"
    },
    {
      "title": "Place the steaks over direct heat and grill them for 14 to 16 minutes.",
      "content": "Place the steaks over direct heat and grill them for 14 to 16 minutes. Lay the steaks on the grill so there's at least 1 inch (2.5 cm) of space between each steak. Cover the grill and cook the steaks until they're charred on both sides. Use tongs to flip the steaks over halfway through the cooking time. [22] X Research source If you're using a charcoal grill, put the steaks on the side of the grill that has the hot coals underneath it."
    },
    {
      "title": "Move the steaks to indirect heat.",
      "content": "Move the steaks to indirect heat. Wear oven mitts to lift up the lid of the grill. Then, use the tongs to move the steaks to the cool side of the grill. Put the lid back down to trap the heat in the grill. [23] X Research source"
    },
    {
      "title": "Grill the cauliflower for another 15 to 20 minutes.",
      "content": "Grill the cauliflower for another 15 to 20 minutes. Cook the steaks until they're as tender as you like. Then, transfer the steaks to a serving platter and enjoy them with other grilled vegetables. [24] X Research source To test how tender the steaks are, stick a paring knife into the center of a steak. If you like the steaks soft, the knife should come out easily. To refrigerate leftover cauliflower steaks, put them in an airtight container and store them for up to 5 days."
    }
  ]
}