{
  "url": "https://www.wikihow.com/Care-for-Triops",
  "title": "How to Care for Triops",
  "steps": [
    {
      "title": "Fill a tank with .5 to 1 gallon (1.9 to 3.8 L) of natural spring water per Triops.",
      "content": "Fill a tank with .5 to 1 gallon (1.9 to 3.8 L) of natural spring water per Triops. Pour the water into an empty, clean aquarium or fish tank. Measure out the right amount based on the number of Triops you currently have or expect to have after hatching. Use natural spring water, which has calcium to help the animals grow. [2] X Research source Do not use mineral or distilled water. The mineral level in mineral water is too high, whereas distilled water doesn’t have enough calcium for the Triops."
    },
    {
      "title": "Use an aquarium heater or place a heat lamp near the tank to keep the water between 72 and 84 °F (22 and 29 °C).",
      "content": "Use an aquarium heater or place a heat lamp near the tank to keep the water between 72 and 84 °F (22 and 29 °C). Because Triops need warm water to hatch and thrive, you need to maintain a mild water temperature. Put an aquarium thermometer in the tank to monitor the water temperature."
    },
    {
      "title": "Add substrate to the tank if you'd like to recreate their natural habitat.",
      "content": "Add substrate to the tank if you'd like to recreate their natural habitat. Line the tank with soil, gravel, or sand so the Triops can dig around. Fill the bottom with about 1 to 2 inches (2.5 to 5.1 cm) of your chosen substrate to protect any larvae and prevent the Triops from mistaking the eggs for a snack. [3] X Research source You can buy the substrate at a pet store or from an online retailer. Wash the substrate with plain tap water before putting it in the tank to remove any potential chemicals or dirt."
    },
    {
      "title": "Choose plants carefully if you want to add decoration.",
      "content": "Choose plants carefully if you want to add decoration. While Triops don’t require any plants or extra items, like large stones or fake castles, in their tank, you can put some in if you’d like it to look more appealing. Only use plants or decorations that are safe for aquarium use, however, so you don’t accidentally poison the Triops. [4] X Research source Never put things you find in nature, like a rock or a log, in the tank as they can contain harmful bacteria."
    },
    {
      "title": "Change out about 25% of the water in the tank once a week.",
      "content": "Change out about 25% of the water in the tank once a week. To keep the water fresh, replace about 1/4 of it on a weekly basis. Scoop it out with a cup or bucket, then pour clean, natural spring water in. Be careful not to scoop up the Triops with it! [5] X Research source Do not use soap when cleaning your tank. It’s poisonous to Triops. If you notice any algae growing, which will look like green fuzz on the inside of tank, transfer the Triops to another container and wipe down the tank. Then, fill it with fresh water and put the Triops back."
    },
    {
      "title": "Buy a Triops kit from a pet store or online retailer.",
      "content": "Buy a Triops kit from a pet store or online retailer. Select a kit that contains at least the Triops eggs, food, and care instructions. You can also find kits that come with a tank, thermometer, or dish for hatching the eggs. Most kits cost between $10 and $20."
    },
    {
      "title": "Sprinkle about 20 eggs into the tank.",
      "content": "Sprinkle about 20 eggs into the tank. Out of these 20 eggs, you’ll likely only get 1 to 3 Triops. Make sure that the eggs, which are as small as a grain of sand, go into the water and don’t accidentally blow away or get stuck on the edge of the aquarium. Most kits come with around 40 to 60 eggs, so you can have 2 to 3 hatching cycles. You can also hatch your Triops in the small dish provided with the kit. To do this, simply place the eggs in the dish, then transfer the Triops to the larger tank after they hatch."
    },
    {
      "title": "Wait 1 to 4 days for the eggs to hatch.",
      "content": "Wait 1 to 4 days for the eggs to hatch. After you sprinkle the eggs into the water, expect them to hatch between 24 and 96 hours later. Look closely, as newborn Triops are so small, they’re almost invisible to the human eye for the first few days. If you’re hatching the eggs in the fall or winter when it’s colder, it can take an additional 3 to 5 days for the Triops to hatch."
    },
    {
      "title": "Feed the Triops once a day starting on the 2nd day after they hatch.",
      "content": "Feed the Triops once a day starting on the 2nd day after they hatch. Wait 2 days after the Triops hatch to start feeding them. Crush 3-5 pieces of Triops food using a spoon and sprinkle it into the tank. If your kit didn’t come with Triops food, you can use green algae powder instead. Always crush the food for the first 7 days, which is how long it takes the Triops to become full adults. Until they’re adults, they can’t eat regular-sized food."
    },
    {
      "title": "Increase the amount of food to 8 to 10 pieces on the 3rd day.",
      "content": "Increase the amount of food to 8 to 10 pieces on the 3rd day. For the 2nd feeding, crush 8 to 10 pellets and sprinkle them into the tank. Do this only once throughout the day. Be careful not to overfeed the Triops. Wait until all of the food from the 1st feeding is gone before you add more."
    },
    {
      "title": "Continue gradually increasing the amount of crushed food.",
      "content": "Continue gradually increasing the amount of crushed food. Measure the amount of food using the spoon provided in the kit or with a teaspoon. On day 4, for example, crush enough food to fill 1 spoon if you have 5 or less Triops or 2 spoons if you have more than 5 Triops. For days 5 and 6, feed 1 spoonful twice a day for 5 Triops or less and 2 spoonfuls once a day for more than 5. On day 7, feed 2 spoonfuls twice a day for 5 or less and 4 spoonfuls once a day for more than 5."
    },
    {
      "title": "Feed each Triops about 1 pellet twice a day starting on the 8th day.",
      "content": "Feed each Triops about 1 pellet twice a day starting on the 8th day. Once the Triops are fully grown after day 7, give them uncrushed food 2 times a day. Space out the feedings so that all of the food from the 1st feeding is consumed before you give them more. [6] X Research source If your Triops only eats 1 pellet a day instead of 2, that's okay. Just avoid giving them more than they can eat or the uneaten food will mold in the tank. If you run out of Triops food for your adult pets, use high-quality pellet fish food."
    },
    {
      "title": "Supplement your Triops' diet with protein if you want them to get bigger.",
      "content": "Supplement your Triops' diet with protein if you want them to get bigger. To grow larger Triops, give them 1 teaspoon (6 g) of protein in the form of insect larvae, brine shrimp, or fish. Feed this to the Triops no more than 2 times a week. [7] X Research source Make sure you cut up the food into the smallest pieces possible so it's easy for the Triops to digest them."
    }
  ]
}