{
  "url": "https://www.wikihow.com/Become-a-Bounty-Hunter",
  "title": "How to Become a Bounty Hunter",
  "steps": [
    {
      "title": "Consult your state laws.",
      "content": "Consult your state laws. Regulations on bounty hunting vary by state, and many require special licensing and testing to work in the field. Call or visit the local police station, courthouse, or a bondsman to inquire about the proper licensure for your state. Most states require bond enforcement agents to be at least 18 years old. In some states, the legal age requirement is raised 21 due to weapons permits. For more information on licensure, visit the National Association of Fugitive Recovery Agents at https://www.fugitive-recovery.org . Since bounty hunters sometimes have to work across state lines, check the licensing requirements in neighboring states to ensure you meet them as well. Bounty hunting is illegal in some states, so make sure that you are following the law! Be aware that most other countries consider bounty hunting illegal, so you will not be able to follow fugitives internationally. [1] X Research source"
    },
    {
      "title": "Pass a background check.",
      "content": "Pass a background check. You need to pass a background check in order to become a bounty hunter. Depending on your employer and the state laws, there may be specific requirements for the background check. Consult your local law enforcement office for more information on background checks. [2] X Trustworthy Source US Equal Employment Opportunity Commission U.S. government agency that enforces civil rights in the workplace Go to source Background checks look for information like previous criminal record, education, work history, and even social media use. Employers who perform a background check might also be able to see information about your financial and medical history, depending on the type of background check that they run."
    },
    {
      "title": "Secure a permit to carry firearms legally in your state.",
      "content": "Secure a permit to carry firearms legally in your state. Many states require a license to carry a concealed weapon, which proves that you have the training and knowledge to use a gun. In most cases, this involves filling out an application, fingerprinting, and registering your gun and license with local law enforcement. [3] X Trustworthy Source State of Indiana Official site for state-approved sources related to life in Indiana, including laws, services, and culture Go to source Most licenses only cover one state and won’t allow for transportation of a handgun across state lines. If you’re planning to work in different states, be sure you have the proper license to carry in each state, and keep the license on you at all times. Once you have a license to carry a concealed weapon, you will likely have to renew it every 3-5 years, depending on the laws in your state. Make sure you’re aware of the requirements and don’t allow your license to expire. For specific directions on how to do this in a few select states, check out how to get a gun license in Minnesota, in Massachusetts , or in Georgia ."
    },
    {
      "title": "Get certified as a bounty hunter if your state requires it.",
      "content": "Get certified as a bounty hunter if your state requires it. Many states require certification or registration as a bounty hunter. Sometimes, this means attending training classes in law enforcement, and other times it just means passing a simple exam. Your state laws will clarify the process for certification, if there is one. If you have questions about the certification process, consult local law enforcement for more information and referrals to various training classes or exam preparation courses. There is no certification process in Hawaii, Alaska, Montana, Idaho, Wyoming, Kansas, Minnesota, Michigan, Alabama, Pennsylvania, Maryland, Vermont, Maine, Delaware, or Rhode Island. Bounty hunting is currently illegal in Oregon, Wisconsin, Kentucky, and Illinois, but the law is subject to change every few years."
    },
    {
      "title": "Network with bond enforcement agents",
      "content": "Network with bond enforcement agents . Finding a mentor in your field is the best way to learn the ropes and get your foot in the door. Look up local bounty hunters in your area, and ask them about riding along with them on a few jobs once you’ve secured all of your certifications. This is especially true if your state doesn't require certification or licensure. An experienced agent will tell you what you need to know about the field and be honest about their experience. If you’ve never networked with professionals before, always be polite and patient. Start by calling or sending an email to let them know who you are, what you’d like to do, and how they can contact you. For example, send an email to a local enforcement agent saying “My name is Jason, and I’m a recent graduate in the criminal justice field. I’m interested in working as a bond enforcement agent, and I’ve started the process for certification. Would you be available in the upcoming weeks to meet to discuss your job and the field in general? You can contact me at _____.”"
    },
    {
      "title": "Study criminal justice, psychology, or sociology (optional).",
      "content": "Study criminal justice, psychology, or sociology (optional). While a college degree isn’t required for bond enforcement, classes in these fields will give you the abilities and skills necessary for the job. You’ll learn about law enforcement theory, investigation practices, and criminal behavior in general. [4] X Research source It’s also a good idea to take self defense, karate, or jiujitsu classes to learn hand-to-hand combat and defense techniques. If you have hands-on experience through your degree, you’re more likely to get work, even as a newcomer to the field. Make sure to keep track of your experience and education on your resume!"
    },
    {
      "title": "Purchase safety and law enforcement gear.",
      "content": "Purchase safety and law enforcement gear. Outfit yourself with items like handcuffs, taser, pepper spray, and protective gear, like vests. You can purchase these from catalogues, online retailers, or at some local police gear stores. [5] X Research source Some states require you to wear clothing identifying you as a bounty hunter, like a uniform, especially when making arrests. This is to keep you safe and to communicate your legitimacy to onlookers. You will likely want to purchase a firearm to protect yourself in case of emergency situations. Be sure to check the laws in your state for purchasing and registering a firearm."
    },
    {
      "title": "Purchase a reliable car with good gas mileage.",
      "content": "Purchase a reliable car with good gas mileage. When you’re starting out, you’ll might need to drive long distances across the state to find fugitives. Choose an inconspicuous, roomy, and reliable car, like a Toyota Prius, Subaru Forester, or Volkswagen Jetta. For larger SUVs, vans, and trucks, look at the Toyota Highlander, Kia Sedona or Chevrolet Silverado. [6] X Research source Make sure the car is properly registered, insured, and inspected in your state. You don’t want to be pulled over and ticketed when you’re working as law enforcement!"
    },
    {
      "title": "Make connections with bail bondsmen who can act as “agents” for you.",
      "content": "Make connections with bail bondsmen who can act as “agents” for you. Bail bondsmen receive the notifications for court dates and upcoming bails, and will likely know the names of any local fugitives. Make connections with them by introducing yourself and just generally being friendly. Let them know that you’d like to be notified of available work. In some states, it’s required that bounty hunters only work with bondsmen, who act as their employers, to secure work. The bondsman is responsible of keeping track of the enforcement agents that they use and reporting agent names to the state. Offer to do your first gig for free to gain experience, show that you're capable and true to your word, and prove that you can get the job done."
    },
    {
      "title": "Secure and keep track of your clients.",
      "content": "Secure and keep track of your clients. Contact bail bond agencies that you’ve made connections with and offer your services. As a bounty hunter, you are self-employed and like any self-employed professional, you’re in charge of marketing, keeping track of your earnings, and creating a professional network. If you get an assignment, get a copy of the \"bail piece,” which indicates that the person is a fugitive, and a certified copy of the bond so that you can arrest the fugitive if you find them. Work for a bounty hunter is sporadic, so be prepared to be notified of new cases at a moment’s notice, and act as if you’re always on call!"
    },
    {
      "title": "Utilize your investigative skills to research the individual.",
      "content": "Utilize your investigative skills to research the individual. When you’re given a case, the first thing you need to do is find information about the fugitive. Search through databases of addresses, access and analyze phone records , look at registered license plate and Social Security numbers to figure out where the fugitive might be. [7] X Research source You can also utilize social media to identify friends and family for interviewing, and learn information about the fugitive’s past. Some fugitives might even have information about their location made public on their social media posts. Keep an eye out for people who have been betrayed by the fugitive and might be willing to give up information on them, like an ex-partner, drug dealer, or ex-friend."
    },
    {
      "title": "Remain calm while speaking to and apprehending the fugitive.",
      "content": "Remain calm while speaking to and apprehending the fugitive. Some skips might be easier to negotiate with than others. Always try using reason and logic first before getting forceful or physical. Avoid physical confrontation and do your best to make them feel like they’re making the right decision by coming with you. If the skip isn’t cooperative, you can then use force to arrest them."
    },
    {
      "title": "Make a move to arrest the fugitive when the time is right.",
      "content": "Make a move to arrest the fugitive when the time is right. Many bounty hunters show up in the middle of the night, or pose as a delivery person to trick the fugitive into coming in contact with them. When you find them, put handcuffs on the suspect and drive him or her to a jail in the county where he or she was originally arrested. Some states allow the enforcement agent to enter a home only if the people inside have consented, while others allow the bounty hunter to enter if they have reasonable cause to believe that the defendant is there. Check with your state laws before entering a dwelling. Before making an arrest, be sure to have followed to proper channels for notifying law enforcement of the upcoming arrest. These rules vary by state, but most states require some form of advance notice when an enforcement agent plans to make an arrest."
    },
    {
      "title": "Collect for your services promptly and professionally.",
      "content": "Collect for your services promptly and professionally. Once the fugitive has been successfully apprehended, contact the bondsman to start the payment process. Make sure you have records of the arrest and any other required documents for proving that the job has been completed. For tax purposes, keep track of your travel expenses while on the job. Since you will be self-employed, keep your receipts for gas, hotel stays, and food expenses while tracking a skip. You can sometimes use these as write-offs during tax season."
    }
  ]
}