{
  "url": "https://www.wikihow.com/Care-for-a-Tarantula",
  "title": "How to Care for a Tarantula",
  "steps": [
    {
      "title": "Get a 10-gallon (37 litres) locking terrarium.",
      "content": "Get a 10-gallon (37 litres) locking terrarium. Tarantulas are escape artists, so make sure the top of the terrarium locks tight! I would put a brick or two on the lid just in case. Although 10 gallons (37 liters) is the ideal size for keeping a single tarantula, you can get away with a 5-gallon (18 liter) tank. [1] X Research source Never keep two tarantulas in the same cage, because they are territorial cannibals. One of them will eat the other. [2] X Research source"
    },
    {
      "title": "Adapt a small fish tank.",
      "content": "Adapt a small fish tank. Since fish tanks have feeding holes, you’ll have to seal the holes in the top to prevent the tarantula from escaping. You can use aquarium silicone sealer to seal the feeding holes. Make sure you leave two small holes in the top for ventilation, which should be a maximum of 5/32’’ (4 millimeters). [3] X Research source If you are worried about the tarantula escaping through the top of the tank, you can place a rock on the lid. If you are housing tree-dwelling tarantulas, you’ll want to place the tank vertically. You would start it horizontally and if they like living up high make it vertical. Any extra vertical room poses a threat to burrowing species because they are more susceptible to injuries from falling, unlike arboreal species."
    },
    {
      "title": "Spread a thin layer of substrate on the bottom of your tank.",
      "content": "Spread a thin layer of substrate on the bottom of your tank. You’ll need 1-3 inches (2.54-7.62 cm) of sterilized bedding on the bottom of the terrarium. Although there are many suitable substrates, you could put down a 2 centimeter layer of vermiculite, and then add a thin layer of cocoa fiber. [4] X Research source There are many substrates to choose from, such as coconut fiber, reptile bark, sphagnum moss, peat moss, sterilized potting soil, and vermiculite. If you choose peat moss, you need to sterilize it. Put it in the microwave for ten minutes in order to kill parasitic mites. If you don't have a microwave use the oven on a mid heat. [5] X Research source Since some species will dig into the substrate, you might need up to 5 inches (12.7 centimeters) of substrate."
    },
    {
      "title": "Make a broken pot shelter for a daytime hiding spot.",
      "content": "Make a broken pot shelter for a daytime hiding spot. Since tarantulas are nocturnal, you’ll need to make a shelter for them to hide from the daylight and get some sleep! You can make a shelter by cutting a ceramic or plastic pot in half. Bury the broken pot in the sand to create a little hiding place. The entranceway should be just large enough for your tarantula to get inside and the interior should be nice and dark. [6] X Research source A great hiding place is a hollowed log. Pick a hollowed log that is already dried out, since a wet log could lead to mold issues in the terrarium. [7] X Research source You should avoid inserting any sharp objects into the terrarium, since your tarantula could injure itself."
    },
    {
      "title": "Add bamboo and silk plants for tree-dwelling tarantulas.",
      "content": "Add bamboo and silk plants for tree-dwelling tarantulas. In contrast to burrowing tarantulas, which like to hide out in the substrate, tree-dwelling tarantulas live in grasses and trees. You can recreate this habitat by adding bamboo, branches, and silk plants to the tank. The tarantulas will make their webs in the branches. [8] X Research source Tree-dwelling tarantulas have slightly longer legs, which include more surface area for climbing. Ground dwelling species should be discouraged from climbing, since they could easily fall and injure themselves. Remember, the more you put in, the more you will have to clean. A piece of store bought driftwood might be appreciated."
    },
    {
      "title": "Monitor the temperature range.",
      "content": "Monitor the temperature range. You can put a thermostat on the side of the tank to check the temperature. Since tarantulas normally live in a tropical or subtropical environment, you’ll need to maintain a tank temperature of between 22 and 30 Celsius (71 and 86 Fahrenheit). [9] X Research source Avoid placing your tank near a sunny window, since the tank could easily overheat. If the tank is located in a centrally heated room that is within the ideal temperature range, you won’t need to heat it. [10] X Research source"
    },
    {
      "title": "Heat one half of the tank.",
      "content": "Heat one half of the tank. If the tank falls below the ideal temperature range, you can use a hot rock or an electric heat-mat to heat it. In either case, you should only heat one half of the tank, so that your spider can self regulate its temperature by moving to the warm or cool side of the tank. You should avoid letting the tank temperature exceed 30 Celsius (86 Fahrenheit). If you turn the heat off in the spring or autumn, you will need to use the heat mat during those months. If you maintain a cooler temperature during the winter months, you should use a heat-mat."
    },
    {
      "title": "Use a plant mister to maintain a 50% humidity level in the tank.",
      "content": "Use a plant mister to maintain a 50% humidity level in the tank. Use a plant mister to spray the tank and keep the humidity levels up. You can put a humidity gauge on the side of the tank. Check it regularly to make sure the humidity doesn’t drop too far, which can be dangerous for tarantulas when they moult. [11] X Research source Check the contents of the tank to make sure there is no mold."
    },
    {
      "title": "Serve live prey less than half the size of the tarantula.",
      "content": "Serve live prey less than half the size of the tarantula. The mainstay of the tarantula diet is crickets, which you can purchase from a good pet store or online. You can also feed them mealworms, beetles, locusts, cockroaches, and earthworms. Whatever live prey you choose, it should be less than half the size of the tarantula you are feeding. Although live food is preferable, you can also serve dead food such as thawed baby mice or 1 centimeter (1/2’’) pieces of raw beef. [12] X Research source Don’t serve them prey items that are larger than the size of their abdomens. [13] X Research source Tarantulas are opportunists, so they may be able to subdue small lizards, snakes, and mice. Roaches have to be ordered online and a colony started to ensure a constant supply."
    },
    {
      "title": "Serve an appropriate number of prey per meal.",
      "content": "Serve an appropriate number of prey per meal. The number of live prey you serve your tarantula will depend on the size of the prey. For instance, you could offer your tarantula a meal of two small insects or one larger insect, depending on your preference and the availability of feed. For younger tarantulas, you should just give them one prey at a time. [14] X Research source However, adult tarantulas can handle multiple prey at once, which they will attack one at a time and then ball up into a meal of food and silk called a bolus. Since they are nocturnal animals, you’ll want to feed them at night. [15] X Research source"
    },
    {
      "title": "Feed young tarantulas more frequently.",
      "content": "Feed young tarantulas more frequently. You should feed your tarantula a diet that is suited to their age. Very young tarantulas or “slings” require food every two or three days. Once the tarantula becomes a juvenile or reaches between 1.5 and 2 inches (25.4 and 76.2 millimeters), you can feed them one live insect, once or twice per week."
    },
    {
      "title": "Feed adult tarantulas a diet that is suited to their species.",
      "content": "Feed adult tarantulas a diet that is suited to their species. Once they reach adulthood, tarantulas don’t need the same number of meals as juveniles. However, since the size and number of meals varies a lot depending on the species, you should ask the pet store for species-specific feeding information. [16] X Research source Feed an adult Grammostola porteri or rosea tarantula four to five crickets per month. Feed an adult Theraphosa or Pamphobeteus tarantula four or five crickets twice per week. Feed tropical tarantulas larger and more frequent meals, including Therophosa, Phormictopus, Pamphobeteus, Acanthoscurria, and Nhandu tarantulas. Feed an adult Pamphobeteus five crickets and one cockroach per week."
    },
    {
      "title": "Don’t feed a tarantula when it is molting.",
      "content": "Don’t feed a tarantula when it is molting. If your tarantula is lying on its back and looks comatose, it is probably molting. During the molting process, your tarantula regenerates internal organs and sheds its skin. At this time, you shouldn’t give it any live prey, which could easily injure your tarantula. [17] X Research source Five days after molting, it is safe to feed them again. [18] X Research source Don’t confuse molting with death. A dead tarantula will not lie on its back. If your tarantula is very sick or dying, it will do a death curl. It will curl its legs underneath itself in an awkward position. [19] X Research source"
    },
    {
      "title": "Remove food waste after your tarantula has eaten.",
      "content": "Remove food waste after your tarantula has eaten. Take out any remaining live prey after your tarantula has finished eating, since these prey could bother your tarantula when it is resting. You’ll also want to remove any food waste, such as discarded bits of crickets in their water bowl. [20] X Research source"
    },
    {
      "title": "Provide fresh, chlorine-free water in a water dish.",
      "content": "Provide fresh, chlorine-free water in a water dish. You can use a recycled plastic container, a plastic plant container or a water dish from a pet store. Put the container on the bottom of the terrarium, and add a rock so that live prey can escape. Otherwise, the crickets you feed your tarantula could drown and foul the water. [21] X Research source If you are adding a water dish for a tree-dwelling tarantula, you should place it about two thirds of the way up the side of the tank so that it is convenient for your tarantula. Put it close to the door of the terrarium, so you can fill it up. You can glue it to the side of the tank with an aquarium silicone sealant. You can give your tarantula bottled water or water that has been filtered to remove chlorine. [22] X Research source"
    },
    {
      "title": "Watch your tarantula.",
      "content": "Watch your tarantula. Since you aren’t advised to touch your tarantula, the best way to play with it is to watch it hang out in the terrarium. You’ll get to see it dig into the substrate and, if it is a tree-dwelling species, climb up into the foliage. It can also be interesting to watch your spider kill and eat its prey. [23] X Research source"
    },
    {
      "title": "Avoid handling your tarantula, especially while it’s molting.",
      "content": "Avoid handling your tarantula, especially while it’s molting. Tarantulas become very vulnerable during their molting period, as they shed their exoskeletons in order to grow. A short fall can easily burst the tarantula’s abdomen and lead to death, so you should avoid taking them out of their terrariums in general, and avoid disturbing them at all while they’re molting. In addition, a tarantula bite can cause swelling and allergic reactions, which should be additional incentive not to handle them. [24] X Research source Young tarantulas molt once per month, while adult tarantulas will molt every year or two. During this time, don’t alter the tank or feed it live prey. It’s normal for your tarantula to lie on its back during molting. If you decide to handle your tarantula, you need to exercise extreme caution. Hold it on the palm of your hand and keep your hand at a very low height. [25] X Research source"
    },
    {
      "title": "Recognize raised front legs and fangs as signs of aggression.",
      "content": "Recognize raised front legs and fangs as signs of aggression. Since a tarantula bite can cause swelling and allergic reactions, you should learn to recognize when they are about to bite. If you see them raise their front legs and show their fangs, you know they are getting ready to bite! A tarantula bite will cause swelling, redness, and mild pain. If bitten by a tarantula, you may experience nausea and fever. If you are bitten by your tarantula, call a medical doctor as soon as you can."
    }
  ]
}