{
  "url": "https://www.wikihow.com/Contact-YouTube",
  "title": "8 Easy Ways to Contact YouTube for Support & More",
  "steps": [
    {
      "title": "Tweet at @TeamYouTube on X.",
      "content": "Tweet at @TeamYouTube on X. One of the most promising ways to contact YouTube is by using X, as their @TeamYouTube account is quick to reply. You can also send @TeamYouTube a direct message if you want to keep your concerns more private. To tag the Twitter support team: Open X by going to X.com (desktop) or tapping the X app icon (mobile) and signing in. You will first need to make an X account if you don't already have one. Click Post or tap the \"Post\" icon in the top-right corner of the screen. Type @TeamYouTube and then type in your message. Keep in mind that tweets are public, so don't include any personal information. Click or tap Post . Keep in mind that while YouTube maintains an active social media presence, they won't respond to all posts, comments, or messages."
    },
    {
      "title": "Comment on a YouTube Facebook post.",
      "content": "Comment on a YouTube Facebook post. Like most large companies, YouTube has a Facebook page on which they post updates; however, due to the high volume of comments on their posts, you're less likely to get through on Facebook. To leave a comment, do the following: Go to Facebook.com/youtube in your computer's web browser. Sign into your Facebook account if prompted or set up a new account . Find post on which to comment, then click Comment below the post. Type in your comment, then press Enter ."
    },
    {
      "title": "Leave a comment on a YouTube Instagram post.",
      "content": "Leave a comment on a YouTube Instagram post. Unlike their Facebook page, YouTube's Instagram page posts diverse content which gets surprisingly few comments by comparison: Go to instagram.com/youtube in your computer's web browser. Sign into Instagram if prompted. Find a post on which to comment. Click the speech bubble icon below the post. Type in your comment, then press Enter ."
    },
    {
      "title": "Understand that you'll need to be eligible for this method.",
      "content": "Understand that you'll need to be eligible for this method. YouTube is somewhat vague regarding what all you have to do to be \"eligible\" to email the Creator Support Team, but you'll have to be a YouTube partner and have a minimum of 10,000 lifetime channel views at the very least. [1] X Research source This method will open a live chat window. Some creators who fit this criterion still aren't able to email YouTube due to only recently passing the 10,000 lifetime views benchmark. [2] X Research source"
    },
    {
      "title": "Open YouTube in a web browser.",
      "content": "Open YouTube in a web browser. Go to YouTube.com and click SIGN IN in the top-right corner and enter your login details if you're not already logged into a YouTube account . Make sure you're using a computer or laptop. You can't access the YouTube Creator Support Team from a smartphone or tablet."
    },
    {
      "title": "Click your profile picture.",
      "content": "Click your profile picture. This will be in the top-right corner. A drop-down menu will open."
    },
    {
      "title": "Click YouTube Studio.",
      "content": "Click YouTube Studio . This will be above Purchases and memberships . [3] X Research source"
    },
    {
      "title": "Click the \"Chat\" button.",
      "content": "Click the \"Chat\" button. This will look like a chat bubble at the top-right corner. When hovering the cursor over the button, you'll see Chat with Creator Support . [4] X Research source A pop-up live chat will appear."
    },
    {
      "title": "Speak to the live chat representative.",
      "content": "Speak to the live chat representative. Be as descriptive as possible. Include screenshots if needed."
    },
    {
      "title": "Visit the YouTube Help Center in a web browser.",
      "content": "Visit the YouTube Help Center in a web browser. You can use a mobile or web browser. [5] X Research source"
    },
    {
      "title": "Select a topic category.",
      "content": "Select a topic category. Click one of the categories below the search box on the Help page. This will expand the category to display related topics below it. You can also search for a topic by clicking the text box near the top of the page, typing in a word or phrase that describes your problem, and selecting the closest topic in the resulting drop-down menu."
    },
    {
      "title": "Select a topic.",
      "content": "Select a topic. Click one of the topic titles below the category you selected."
    },
    {
      "title": "Select a help article.",
      "content": "Select a help article. Click one of the links below the topic heading. This will open the article's page."
    },
    {
      "title": "Fill out a form if necessary.",
      "content": "Fill out a form if necessary. Some help articles will require you to enter information or select a type of problem you're encountering. If so, follow any on-screen prompts before continuing."
    },
    {
      "title": "Read through the entire help article before proceeding.",
      "content": "Read through the entire help article before proceeding. Once you reach the help article, make sure you read through the entire thing before you attempt to act on the article's instructions."
    },
    {
      "title": "Follow the help article's steps.",
      "content": "Follow the help article's steps. This should help you resolve your YouTube issue; if not, you can return to the YouTube Help Center and select another topic category, topic, and article to attempt to fix the issue through a different process."
    },
    {
      "title": "Locate the abusive or inappropriate content.",
      "content": "Locate the abusive or inappropriate content. You could report a video , Short, playlist, thumbnail, link, or comment."
    },
    {
      "title": "Click ••• .",
      "content": "Click ••• . This will be next to the content from the previous step. [6] X Research source A drop-down menu will appear."
    },
    {
      "title": "Click Report.",
      "content": "Click Report . This will be next to a flag icon. [7] X Research source"
    },
    {
      "title": "Select a reason for reporting.",
      "content": "Select a reason for reporting. You can select from a list of options, such as sexual content, hateful or abusive content, harassment or bullying, and more. Check the box for This applies to links within the video description if true."
    },
    {
      "title": "Click Report.",
      "content": "Click Report . If you're reporting a video, you may be asked to select a timestamp and provide additional details. [8] X Research source Reported content will be reviewed by YouTube staff to determine whether they violate Community Guidelines. If proven guilty, the account involved will be penalized and/or terminated."
    },
    {
      "title": "Open the Report a Security Vulnerability page.",
      "content": "Open the Report a Security Vulnerability page. You can report issues related to Google privacy from here."
    },
    {
      "title": "Select an issue.",
      "content": "Select an issue. Check the box to the left of one of the following problems that you're experiencing: I'm experiencing a security problem with my Google account I want to remove content on Google Search, YouTube, Blogger, or another service I have a privacy doubt or a privacy-related question about Google products and services I found a security bug in Google \"forgot password\" feature I found a problem in the Google Certificate Authority I want to report a Google Cloud customer running insecure software that could potentially lead to compromise I want to report a technical security bug in a Google product (SQLi, XSS, etc.) I want to report a scam, malware, or other problems not listed above"
    },
    {
      "title": "Select additional details.",
      "content": "Select additional details. In the section below the selected issue, click the box to the left of a more specific problem. This section will vary depending on the issue that you selected above. You may have the option of selecting more than one answer at once."
    },
    {
      "title": "Click Continue.",
      "content": "Click Continue . It's a blue button near the bottom of the section. This will take you to the results page."
    },
    {
      "title": "Read the resulting page.",
      "content": "Read the resulting page. In many cases, the page at which you arrive will have some information about how YouTube handles instances of your reported issue, as well as some tips on how to avoid the problem in the future. If you reported an actionable problem, there may also be a report link in the information section."
    },
    {
      "title": "Click the report or fill out link.",
      "content": "Click the report or fill out link. If available, click the report link in the information section to open the report page."
    },
    {
      "title": "Fill out and submit any subsequent forms.",
      "content": "Fill out and submit any subsequent forms. Enter any information required, then click the Send or Submit button. This will send the report to YouTube's security team. You probably won't receive any response, but the issue may be resolved within a week or two."
    },
    {
      "title": "Open the copyright removal request page.",
      "content": "Open the copyright removal request page. You can use a web or mobile browser. If you aren't logged into your YouTube account, you'll be prompted to enter your email address and password before you can continue. You can also access this form by signing into YouTube Studio , clicking Copyright in the left menu, then New Removal Request . Keep in mind that filing a false claim will result in your account being suspended."
    },
    {
      "title": "Add the video you're reporting.",
      "content": "Add the video you're reporting. Click the + Add a video button at the top of the page and add the video (or multiple videos) that you're reporting for copyright infringement."
    },
    {
      "title": "Fill out the copyright owner information.",
      "content": "Fill out the copyright owner information. You must supply the following information: Affected party: You can only submit a copyright claim if you, your company, or your client was affected. Copyright owner name: You can input our YouTube channel name or your actual name here. Phone number: You must include the country code and your phone number. Primary email address: Your YouTube account email will be automatically filled in here. Relationship to the copyrighted content: Describe how you relate to the copyrighted content you're claiming. Address: You must supply your address in the rest of the fields in this section."
    },
    {
      "title": "Choose a removal option.",
      "content": "Choose a removal option. You can request immediate removal or give the uploader 7 days to remove the video. You can also check the box to prevent copies of the video from being re-uploaded."
    },
    {
      "title": "Agree to the legal agreements.",
      "content": "Agree to the legal agreements. Read through this section and place a checkmark next to each of the three statements. You must then sign the form with your full legal name."
    },
    {
      "title": "Submit the request.",
      "content": "Submit the request. Click the Submit button at the top of the form to send it to YouTube. [9] X Research source"
    },
    {
      "title": "Open the Privacy Complaint page.",
      "content": "Open the Privacy Complaint page. You can use a mobile or web browser. [10] X Research source Use this form to report people who post private or personal information about you on YouTube. Only fill out a privacy complaint form if you've contacted the person you suspect has compromised your privacy and understand YouTube's Community Guidelines. Abusing the privacy process and creating false reports may result in account suspension."
    },
    {
      "title": "Select a privacy infraction.",
      "content": "Select a privacy infraction. Click either Your Image or Full Name or Other personal info depending on the type of privacy violation you experienced. Your Image or Full Name refers to images, audio, video, or text that uniquely identifies you. Other personal info refers to personal identification information such as your home address, email address, social security number, financial information, and more."
    },
    {
      "title": "Fill in your personal information.",
      "content": "Fill in your personal information. You must include your legal first name, legal last name, country, and email address. This is how YouTube will contact you concerning your privacy complaint."
    },
    {
      "title": "Enter the infraction evidence.",
      "content": "Enter the infraction evidence. You must include the URL of the channel revealing your personal information and the URL(s) of the video(s) containing the information. Find the YouTube URL of the channel. Copy and paste it into the correct field. If you have more than one video URL to submit, separate them by spaces."
    },
    {
      "title": "Indicate the information you want to report.",
      "content": "Indicate the information you want to report. The options given will vary depending on which privacy infraction form you selected. Select all that apply by checking the box next to each option. Your Image or Full Name : my image is shown, my full legal name is shown, my voice is being broadcast, my child is shown, or other. Other personal info : email address, home address, social security number, national identification number, telephone number, credit card number, my child's personal information is shown, or other."
    },
    {
      "title": "Identify where the content appears in the video evidence.",
      "content": "Identify where the content appears in the video evidence. Select from the list of options. If the evidence appears in a specific part of the video, you can list the timestamp. If you have more than one video to reference, click Add additional field to enter another timestamp. If the content was copied from your own channel or video, select Yes . If you're reporting on behalf of a child, select the box next to I am the legal guardian of a child or dependent in the video ."
    },
    {
      "title": "Provide additional information.",
      "content": "Provide additional information. Use the box to provide information about your unique appearance or actions that differentiate you from others. YouTube will review this information privately. If you do not identify yourself clearly in the listed video evidence, YouTube will not take action to remove the reported content."
    },
    {
      "title": "Agree to the statements.",
      "content": "Agree to the statements. You must agree to the statements: I have a good faith belief that this content violates my privacy and I represent that the information in this notification is true and correct ."
    },
    {
      "title": "Click Submit.",
      "content": "Click Submit . This is the blue button at the bottom of the form. Your privacy claim will be submitted for review. If YouTube finds the claim to be actionable, the account hosting the content will be forced to take it down and may be suspended."
    },
    {
      "title": "Open the \"Contact Us\" page.",
      "content": "Open the \"Contact Us\" page. Go to https://www.youtube.com/t/contact_us in your preferred browser."
    },
    {
      "title": "Scroll down to the \"Our Address\" section.",
      "content": "Scroll down to the \"Our Address\" section. It's near the bottom of the \"Contact Us\" page."
    },
    {
      "title": "Review the address.",
      "content": "Review the address. You'll find YouTube's headquarters address listed in this section. This is the address to which you'll need to send your letter. As of December 2022, the YouTube address is Google LLC, D/B/A YouTube, 901 Cherry Ave, San Bruno, CA 94066, USA. [11] X Research source You can also send a fax of your message to +1 (650) 253-0001 if you like. [12] X Research source"
    },
    {
      "title": "Write your letter.",
      "content": "Write your letter. Whether you're sending a compliment or attempting to make YouTube aware of an account issue, be sure to keep the letter concise, polite, and relatively short. Keep in mind that YouTube has well over one billion monthly users, so the chances of YouTube reviewing and replying to your letter are slim. Having a short letter will improve the odds of YouTube reviewing it."
    },
    {
      "title": "Send the letter to YouTube's address or fax machine.",
      "content": "Send the letter to YouTube's address or fax machine. If your issue or note is deemed a priority by YouTube, you may hear back from them, or your problem may be addressed without a response."
    }
  ]
}