{
  "url": "https://www.wikihow.com/Be-Fearless-as-a-Soccer-Goalie",
  "title": "How to Be Fearless as a Soccer Goalie",
  "steps": [
    {
      "title": "Have a strong and resilient mindset about your position.",
      "content": "Have a strong and resilient mindset about your position. [1] X Expert Source Bernat Franquesa Licensed Soccer Coach & Head of Methodology at APFC Expert Interview. 3 March 2020. Being the goalie is a tough job, stand confidently with your head up and shoulders back. Stay calm at all times and remember it is okay to get hit with the ball, so go for every shot! It’s easy to get discouraged by missing shots, so don't sweat it. Keep in mind how important your job is, and that all you can do is give it your best effort [2] X Research source Understand that the goalie position is a very tough position. Accept the fact that you are going to get hit, kicked, and maybe even stepped on, but that it is all part of the game. Mentally preparing for the likelihood of physical injury will help you feel prepared for anything the game might throw at you, so you won't waste time thinking about the possibility of getting hurt and can focus on the game."
    },
    {
      "title": "Approach opponents aggressively.",
      "content": "Approach opponents aggressively. Do not get scared and stand there waiting for your opponent to make a shot. If possible, attack and take control of the ball, this can help to startle them instead! You can scare the opponent by making your body looking bigger by moving up to the opponent. Or you can make a roar while the opponent is coming at you. The opponent will have a less chance of making a shot. But do not get discourage if you do. You will show your weakness and your lack of confidence will affect your game-play even worse, so keep your mind straight"
    },
    {
      "title": "Use your whole body.",
      "content": "Use your whole body. Being the goalie means you have the advantage of using your hands and arms. Don't be afraid to give it your all. Dive, lunge, and jump to block the ball if you have to. If your opponent successfully gets the ball around you, run and slide diagonally toward their right-hand side. If they try to kick it to the right, your feet will block it. If they kick it to the left, stretch your hands out to catch it. Try to keep your legs closer to your opponent than your face to avoid injury. Being fearless doesn't mean you purposefully jeopardize your own safety for the sake of the game."
    },
    {
      "title": "Kick the ball away from your opponent.",
      "content": "Kick the ball away from your opponent. Never try to kick the ball past an approaching opponent, this leaves your goal more vulnerable. Always kick it away from them if possible. Make sure you have a teammate who is able to receive the ball before kicking or throwing it back into play."
    },
    {
      "title": "Become a master of penalty shots.",
      "content": "Become a master of penalty shots. Penalty shots can be one of the most intimidating aspects of goalkeeping, mastering them will make you less fearful of them. Never wait for the penalty shot on your heels; stay in the middle of the goal on your toes at all times so you can react faster. Remember, the player will have a chance to run up to the ball so there's a good chance the ball is not going to stay on the ground."
    },
    {
      "title": "Dive for penalty shots.",
      "content": "Dive for penalty shots. When diving to block the ball, try to keep your arms stretched out as far as you can and remain ready to receive the ball. Never close your eyes as you lunge or dive for the ball. If you can't catch the ball, grab it. Be aggressive and quickly scoop the ball up before the opposing team approaches and tries another shot at the goal. If you can't grab the ball either, then you can deflect the ball out by making a fist and punching the ball out of the goal, or you can use your palms to palm it out. But it you do not think you have the reach to palm the ball, the use your fingertips. Although the fingertips have small deflections and if your fingers are not locked, you can jam your fingers, so use hand clinches to strengthen your hands and fingers. It will make your deflections more effective during play time."
    },
    {
      "title": "Make your diving safer.",
      "content": "Make your diving safer. It’s important to be cautious while your diving. Diving takes time to get used of it but there is no need to fear. Never land on your knees. Your knees will start to ache and sore and it will affect you during play time When you’re coming down from a dive, roll to your side to break your dive on high dives, and low dives To dive further, lift from your leg your diving off of and launch yourself off of the ground."
    },
    {
      "title": "Hone your basic soccer skills.",
      "content": "Hone your basic soccer skills. Becoming a fearless goalie starts with practicing and perfecting basic soccer playing skills so you are more comfortable on the field. [3] X Expert Source Bernat Franquesa Licensed Soccer Coach & Head of Methodology at APFC Expert Interview. 3 March 2020. As the goalkeeper you are the last line of defense for your team. During your training focus on your reflexes, reaction time, as well as your overall agility. For reflex training, have your teammates line up in front of the goal each with their own ball. Have each of them kick the ball from different distances and at different speeds so that you have a variety of situations to deal with. This will get you used to high intensity game play, as well as work on the reflexes needed to be a fearless goalie. To practice your reaction time, have your coach line up two rows of balls in front of the goal, one row closer to the goal than the other. Your coach will kick the balls into the goal (the closer ones will come off the ground a bit while the farther ones will stay lower, creating an erratic pattern). Your job is to keep all the balls from getting into the goal. [4] X Research source"
    },
    {
      "title": "Focus on hand-eye coordination.",
      "content": "Focus on hand-eye coordination. As with most sports, keeping your eye on the ball is key. [5] X Expert Source Bernat Franquesa Licensed Soccer Coach & Head of Methodology at APFC Expert Interview. 3 March 2020. When training, use a smaller ball than your standard soccer ball. This will help you focus better and make it easier for you to catch, block, and maneuver the larger soccer ball once you're in the game. [6] X Research source"
    },
    {
      "title": "Practice your footwork.",
      "content": "Practice your footwork. Having quick feet is very important for the goalkeeper. You have to be able to move back and forth, jump, and move out of the way very quickly. [7] X Expert Source Bernat Franquesa Licensed Soccer Coach & Head of Methodology at APFC Expert Interview. 3 March 2020. Make sure you master the two most common forms of footwork used by goalies, side-to-side and crossover. [8] X Research source Side-to-side. Train for this kind of footwork by keeping the ball between your feet and quickly kicking it back and forth between the insides of your feet. Once comfortable with that movement start to practice keeping the ball moving from side to side between your feet while moving your whole body forward and backward. [9] X Research source Crossover. This involves swiftly crossing one foot in front of the other to get the ball. [10] X Research source To practice this, bounce the ball off the top of your cleats about knee height back and forth, and then to waist height. Cross your right leg over the ball as it’s descending from waist height and try to catch the ball again with your other foot. [11] X Research source Mastering these soccer drills during your training will help you gain confidence in your soccer playing abilities, and confidence leads to fearlessness! [12] X Research source"
    },
    {
      "title": "Look at players’ stances.",
      "content": "Look at players’ stances. Looking at your opponent's head specifically is key to helping you predict where the ball might be heading. If the player is looking down, there's a 99% chance that the ball will not leave the ground. If the player is looking straight ahead, the ball might come off the ground a bit, but will come at you straight and hard. If the player is leaning back as they kick the ball, the ball is going to leave the ground. Pay attention to the position of your opponent's body and feet if you approach them. Most people are right-footed, and will likely kick it to your right hand side. Try to swing your right foot around, with the inside of your foot facing the ball to block it. This will help you anticipate what your opponent is likely to do, with less fear of unknown outcomes. No one likes getting hit by an unexpected ball, having a good idea of where the ball is likely to come at you helps you brace for it and be less fearful of getting hit by it."
    }
  ]
}