{
  "url": "https://www.wikihow.com/Appear-to-Have-Snow-Power",
  "title": "How to Appear to Have Snow Power",
  "steps": [
    {
      "title": "Wear gloves that have faux snow on them.",
      "content": "Wear gloves that have faux snow on them. The artificial snow could be made from white/silver glitter, small cotton ball puffs, white rolls of yarn, sparkling white sequins, etc.; choose the one that works for you and either sew or glue the items in place. Make sure it doesn't just look like you glued stuff to your gloves, make it look real. You may be able to get black gloves for a dollar with snow on them already (from dollar stores)."
    },
    {
      "title": "Wear all blue and white.",
      "content": "Wear all blue and white. These are the colors a snow character would be likely to prefer, representing the ice and snow of the area she or he comes from. Maybe a light blue dress with white stockings would look good. Or light blue jeans and a white sweater. And, if you can, add a light blue sweatshirt with a white hoodie. Also, when you \"make it snow\", wearing a long sash on your sleeves will give it a great effect. If the sashes have glitter, even better."
    },
    {
      "title": "Wear a simple necklace with a sophisticated charm.",
      "content": "Wear a simple necklace with a sophisticated charm. Maybe a jeweled snowflake with simple white beads would be nice."
    },
    {
      "title": "Act the part.",
      "content": "Act the part. Try to make someone curious enough to watch you. When you have their attention, make the snow appear to \"come out of your hands\". Use white glitter or similar items to make it seem like snow. It might seem odd, but you could always play christmas music to set the tone if you wish. If using real snow, this is best done during wintertime, to make it more believable (the snow would melt in summer). When you're at your secret place, start to play around in the snow with your bare hands (if you can bear it) and throw it in the air. Do this for a few times then look at your hands. Smile and get ready to do your trick."
    },
    {
      "title": "Make the snow appear to \"come out of your hands\".",
      "content": "Make the snow appear to \"come out of your hands\". If you have very large sleeves, you can try this neat trick. Get two small fans and secretly put them down your sleeves. Get some of the faux snow and put it on top of the fans. Turn on the fans secretly and open your hands wide, so that it goes through your fingers and appears to come out of your hands. If you can't get the fans, don't worry, just stuff some of the fake snow in your sleeves and twirl around with your sleeves down, causing the snow to slip out of your sleeves, but this is not recommended because you'll look like you'll be dripping wet afterward, slip snow out of your sleeves in moderation! Practice this a few times before the real deal, in a private place."
    },
    {
      "title": "Keep up the act.",
      "content": "Keep up the act. While you're \"making snow\" always look as if you're truly enjoying yourself. Laugh a lot, and twirl around. When you twirl, if you tied sashes to your costume, they will spin and enhance the \"magical\" effect. If you're pretending to hide your snow powers, do the following: After you run out of snow, toss the snow on the ground in the air, then seem to notice the person. Start to look worried, run up to the person and beg, \"Please don't tell anyone...\" and you're done."
    },
    {
      "title": "Try this out on your friends before doing it at a fancy dress or cosplay event.",
      "content": "Try this out on your friends before doing it at a fancy dress or cosplay event. Listen to their suggestions for improving your performance. Then enjoy your time as a snow princess or prince!"
    }
  ]
}