{
  "url": "https://www.wikihow.com/Buy-from-Alibaba",
  "title": "How to Buy from Alibaba",
  "steps": [
    {
      "title": "Create an Alibaba account.",
      "content": "Create an Alibaba account. Go to the Alibaba homepage and sign in if you already have an account. If you don’t have an account, go to the signup page and follow the onscreen instructions to create one. [1] X Research source You don’t need a wholesaler’s license to create an account. However, if you’re selling any items sourced from Alibaba, you’ll be subject to your local jurisdiction’s business and tax regulations. In the United States, you can get help obtaining a business license and tax ID on the U.S. Small Business Administration website. [2] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source For locations outside the U.S., look on your nation’s government website and search “set up a business” to find out about required licensing. [3] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source"
    },
    {
      "title": "Search for a product.",
      "content": "Search for a product. There are multiple methods of searching for products on Alibaba. The most basic way is by entering keywords or phrases into the products search bar on the main page. Select the “Products” tab, enter your search term in the search bar, select your country using the drop-down menu, and click the “Search” button. [4] X Research source You can also search products using the categories along the left-hand side of the homepage. Hover over a category then click a subcategory to browse products."
    },
    {
      "title": "Filter your search results.",
      "content": "Filter your search results. Searching by product and category can return thousands of items, so it could take lots of time to sort through products. You can use the options on the left side of the search results page to narrow your search and return fewer, more specific results. [5] X Research source For example, a search for \"jeans\" will return over 500,000 hits, but you can check boxes on the left to make your search more specific. Checking boxes like \"men's jeans\" or \"denim\" and adding keywords like a particular color will return far less hits, making it easier to sort through your search results. You can also filter your product search results by the suppliers' country of origin. This will help you track down suppliers in your country, which will help cut shipping costs and time. [6] X Research source"
    },
    {
      "title": "Search by supplier.",
      "content": "Search by supplier. Instead of searching by product, you can select the “Suppliers” tab next to the search bar. This will return suppliers who specialize in the product you’re trying to purchase. [7] X Research source If you've worked with a supplier before or know of a supplier who specializes in your desired product, you can use this search tool to find them more easily than with a product search. The search results page will also allow you to filter results based on suppliers’ countries of origin."
    },
    {
      "title": "Post a request for quotation (RFQ).",
      "content": "Post a request for quotation (RFQ). You can also request a quote that specifies your sourcing needs and compare direct quotes from multiple suppliers. Click on the “Submit RFQ” option and create your post in the space provided. [8] X Research source Enter a product keyword and desired quantity in the designated spaces. In the message body, you can any other relevant product specifications. Below the message body, you can add details about your shipping destination and preferred payment method."
    },
    {
      "title": "Check supplier profiles for verification badges.",
      "content": "Check supplier profiles for verification badges. Once you’ve found suppliers through the search engine tools or by RFQ, go to their profile pages to verify their legitimacy. [9] X Research source Look for profile badges to make sure you’re dealing with a verified supplier: [10] X Research source The A&V Check indicates that the supplier has passed authentication and verification inspection by Alibaba and a third-party verification service. The Onsite Check verifies that the premises of suppliers based in China have been checked by Alibaba staff to ensure onsite operations actually exist. The Assessed Supplier Check notes that the supplier has been verified by a third-party service."
    },
    {
      "title": "Look online for complaints about a supplier.",
      "content": "Look online for complaints about a supplier. In addition to checking for profile badges, you can find information about prospective suppliers online to avoid scams. Search online for comments or complaints about the supplier. You can also cross reference the contact information provided on their Alibaba profile with a Google search. [11] X Research source Avoid suppliers who list non-business email addresses, such as Gmail or Yahoo accounts."
    },
    {
      "title": "Look for a supplier with a warehouse in your country.",
      "content": "Look for a supplier with a warehouse in your country. Searching Alibaba will yield suppliers in a number of countries. Finding a supplier based in or with a warehouse in your country will cut down on shipping time and eliminate the need for you to deal with clearing customs. [12] X Research source Many suppliers, for example, have warehouses in the U.S. If you go with a supplier that doesn’t have a warehouse in your country, you’ll have to work with that supplier to manage customs clearance by using Alibaba’s Freight Logistics resource. In addition, it’s best to hire a customs broker to help you handle customs when sourcing products internationally."
    },
    {
      "title": "Contact the supplier and fill out the message form.",
      "content": "Contact the supplier and fill out the message form. Click the “Contact Supplier” button, then enter a subject line and the message body. This message should include any questions you might have about the products as well as your purchase request. [13] X Research source Alibaba purchasing is typically conducted in English, but be sure to keep your message concise and free of spelling or grammatical errors. Suppliers might run your message through Google Translate, so keep your language direct to avoid potential misunderstandings."
    },
    {
      "title": "Negotiate minimum order quantity.",
      "content": "Negotiate minimum order quantity. The product listing will likely list a price per unit and minimum order quantity (MOQ). Note well that both of these are negotiable. [14] X Research source When you contact the supplier, ask if they can accommodate quantity needs. Ask, “Is the listed MOQ of 500 units negotiable? Would you consider an order of 400 units?” You can also ask, “At what quantity do you offer discounts?” If purchasing more units will lower your cost, and you’re confident you can move the extra inventory, you should consider going with a higher quantity to get the discount."
    },
    {
      "title": "Verify the posted price.",
      "content": "Verify the posted price. You should also verify if the listed price is FOB, or Free On Board. This means that the seller pays the costs associated with transporting goods to the port of loading, and the buyer pays for costs associated with transport across the ocean to the final destination. [15] X Research source Ask, “Is the listed price range of $2-3 (U.S.) per unit FOB? Can you provide a more accurate FOB quote at 400 units shipped to San Francisco, CA, USA?” Note that all prices and shipping costs quoted on Alibaba are in US dollars. [16] X Research source You contact your nearest bank or exchange agent for the most accurate exchange rate, or you can use an online conversion tool: http://www.xe.com/currencyconverter/"
    },
    {
      "title": "Negotiate the payment price and method.",
      "content": "Negotiate the payment price and method. You and the supplier can negotiate your payment currency and preferred payment method. If necessary, you can exchange currencies with your banking institution. Keep in mind the posted price is also negotiable. [17] X Research source Ask the supplier something like, “What’s the best price you can do for this product? Can you do $2 (U.S.) per unit? This would help convince me to source from you regularly in the future.”"
    },
    {
      "title": "Ask for samples.",
      "content": "Ask for samples. When you contact a seller, you should also consider asking for samples before agreeing to purchase a large quantity of a specific product. That way, you can inspect for quality before spending money on hundreds or even thousands of units. [18] X Research source Ask the supplier, “Do you offer product samples? What is the difference in pricing for samples?”"
    },
    {
      "title": "Click the “Send” button then check your sent box.",
      "content": "Click the “Send” button then check your sent box. When you are finished composing your message, proofread it for clarity and check for any errors, then click “Send.” Go to your sent box to make sure the message was actually sent to the supplier. [19] X Research source If you don’t see your inquiry in the sent box, you should resend the message. To avoid having to compose your message again, copy and paste it into a separate document (like Google Docs) before sending."
    },
    {
      "title": "Use a low-risk payment method such as Paypal.",
      "content": "Use a low-risk payment method such as Paypal. When you negotiate a payment method with the supplier, be sure to settle on a low-risk option. The best payment methods include Paypal or, for purchases over $20,000 (U.S.), obtaining a letter of credit (for example, through a banking institution). [20] X Research source You can also go through a third-party escrow service, such as Alibaba’s secure payment service, which will hold the funds until both parties confirm delivery. [21] X Research source Note that only suppliers located in mainland China, Hong Kong, and Taiwan are eligible to use their secure payment service. Avoid Western Union transfers, which you should only use when transferring money to someone you know very well."
    },
    {
      "title": "Calculate and pay your freight costs.",
      "content": "Calculate and pay your freight costs. Alibaba’s Freight Logistics resource helps the supplier determine and pay the costs of transporting goods internationally. You then pay the supplier the cost of transport. If they haven’t already, ask your supplier to log into Alibaba and visit its Logistics page to give you an accurate estimate of customs duties and taxes. [22] X Research source Duties and taxes will vary based on you and your supplier’s locations. [23] X Research source Remember that you can try to find a supplier with a warehouse in your country to avoid the cost of international transport. You can also get an idea of your goods’ customs cost by using a duty calculator. Simply input your products’ information and countries of departure and arrival into the appropriate fields to determine a cost estimate: https://www.dutycalculator.com/"
    },
    {
      "title": "Hire a customs broker.",
      "content": "Hire a customs broker. Even though the supplier uses Alibaba Logistics to cover transport costs, you should still hire a customs broker just to be certain you’ve paid the proper duties and taxes, that your products will clear customs, and that you hold the proper licensing. [24] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source It might cost a few hundred U.S. dollars, but a customs violation could cost thousands in fines, and you might face legal consequences. In the U.S., you can find a customs broker using the search tool on the website of the National Customs Brokers and Forwarders Association of America. [25] X Research source If you live outside the U.S., check with your nation’s customs and border control government website or search online for a customs broker."
    },
    {
      "title": "Have your goods shipped from the destination port.",
      "content": "Have your goods shipped from the destination port. If your goods have been shipped across the ocean in freight container, you’ll need to arrange transport from the port to your location. Alibaba’s Logistics page can help you ship your products over land using a carrier like FedEx or by rail, depending on your location. If you live relatively close to the destination port, the cheapest option is to hire a trucking service or rent a truck to pick up your goods."
    },
    {
      "title": "Dispute your purchase if your transaction goes wrong.",
      "content": "Dispute your purchase if your transaction goes wrong. Upon receiving your goods, be sure to inspect them thoroughly for quality and to be sure you’ve received the proper quantity. If you’ve received the wrong quantity or can prove that you’ve received products of a lower quality than advertised, you can file a complaint with Alibaba’s help center. You’ll need to send photographs of the goods that show why you’re unsatisfied, along with the initial agreement, payment documents, and all correspondence between you and the supplier. [26] X Research source Doing some research about your supplier before agreeing to the transaction will help ensure that you purchase goods that meet your standards. Be sure that they’re a verified supplier and remember to search online for complaints and comments from past clients."
    },
    {
      "title": "Avoid purchasing branded goods through Alibaba.",
      "content": "Avoid purchasing branded goods through Alibaba. Branded goods sourced through Alibaba are likely to be counterfeit, and you could face legal consequences for reselling them. It's always best to purchase branded goods directly from the brand if you're buying wholesale to sell retail. [27] X Research source If do purchase branded goods through Alibaba and receive counterfeits, you can file a dispute and send photographs of the products you received to Alibaba’s customer service. If you’ve paid through their secure payment system or through an escrow service, your chances of being refunded are almost certain."
    }
  ]
}