{
  "url": "https://www.wikihow.com/Change-from-Lowercase-to-Uppercase-in-Excel",
  "title": "How to Change from Lowercase to Uppercase in Microsoft Excel",
  "steps": [
    {
      "title": "Open a workbook in Microsoft Excel.",
      "content": "Open a workbook in Microsoft Excel . You can use an existing project or create a new spreadsheet . Make sure you're on the correct worksheet. Microsoft Excel is available on Windows and Mac . You can also use the online web version at https://www.office.com/ ."
    },
    {
      "title": "Right-click the column and select Insert.",
      "content": "Right-click the column and select Insert . This will insert a temporary column. The column can be on the left or right side of the column you want to change from lowercase to uppercase. Keep note of the original cell name. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Type \"=UPPER(cell)\" into the first cell of the new column.",
      "content": "Type \"=UPPER(cell)\" into the first cell of the new column. Replace cell with the location of the first cell in the column you want to change from lowercase to uppercase. This formula will convert all lowercase letters into uppercase (all caps). To only capitalize the first letter of each name or word, use PROPER instead. For example, the formula could be: =UPPER(A2) or =PROPER(A2)"
    },
    {
      "title": "Press ↵ Enter or ⏎ Return.",
      "content": "Press ↵ Enter or ⏎ Return . This will enter the formula."
    },
    {
      "title": "Select the first cell of the temporary column.",
      "content": "Select the first cell of the temporary column. This will have the changed name."
    },
    {
      "title": "Double-click the square in the bottom-right corner of the cell.",
      "content": "Double-click the square in the bottom-right corner of the cell. This shortcut will fill down the formula in the rest of the column. You should see the rest of the column change into the Upper or Proper version."
    },
    {
      "title": "Copy the entire column.",
      "content": "Copy the entire column. It should already be selected after filling down the formula. On Windows, press CTRL + C . On Mac, press CMD + C ."
    },
    {
      "title": "Right-click the first cell of the original column.",
      "content": "Right-click the first cell of the original column. A drop-down menu will open."
    },
    {
      "title": "Select Paste Values.",
      "content": "Select Paste Values . If you don't see this, you can click the clipboard with 123 in front of it. Alternatively, press V with the drop-down menu open to paste values. The new names will be pasted without the underlying formulas."
    },
    {
      "title": "Delete the temporary column.",
      "content": "Delete the temporary column. Right-click the column header (ex: B), and select Delete ."
    }
  ]
}