{
  "url": "https://www.wikihow.com/Address-a-Deceased-Parent-in-a-Wedding-Program",
  "title": "How to Address a Deceased Parent in a Wedding Program",
  "steps": [
    {
      "title": "Create a “Dedication” page at the end of the program.",
      "content": "Create a “Dedication” page at the end of the program. If you’d like to write a short passage about your deceased parent or you have more than 1 deceased relative you’d like to honor, a page addressing them in your program may be your best option. Place this page at the end of the program with the heading “Dedication,” “Thank You,” or “In Memoriam.” [1] X Research source You can list the names of the deceased and then write a heartfelt message like, “On this joyous day, we remember those who could not be with us.”"
    },
    {
      "title": "List your deceased parent as part of the wedding party.",
      "content": "List your deceased parent as part of the wedding party. When you list the parents of the bride or groom, include your living parent first. Underneath their name, write something like, “The Late Mr. Arthur Den” as a way to recognize your parent who is no longer here. [2] X Research source This honors the deceased without adding an entire page to your program. It’s the most simple way to address your deceased parent."
    },
    {
      "title": "Include a recipe from your deceased parent if it was special to them.",
      "content": "Include a recipe from your deceased parent if it was special to them. If your parent had something that they were an expert at cooking or baking, you can share their expertise with your guests by including a special recipe of theirs in your program. Put this page near the end and make sure to specify that it was your parent’s recipe. [3] X Research source Add something like, “Although she cannot be here today, we honor the late Isabella Perez by including her recipe in this program. Please use it to spread love and joy to your own families.”"
    },
    {
      "title": "Hold a candle lighting for the deceased to send a beautiful message.",
      "content": "Hold a candle lighting for the deceased to send a beautiful message. If you’d like to include your guests in honoring your deceased parent, you can hold a short candle lighting in their honor. Have your wedding officiator include a short statement about your loved one and pause to allow you to light a candle during your ceremony. [4] X Research source This is a great moment to have toward the beginning of the ceremony to make it feel like your deceased parent is included."
    },
    {
      "title": "Honor those who have passed with a reserved seat for a simple message.",
      "content": "Honor those who have passed with a reserved seat for a simple message. Since your parent would have been in your wedding party, you can save a seat for them up front with a small sign or a framed photograph of them. This is a heartfelt way to preserve their presence during your ceremony and reception. [5] X Expert Source Ivy Summer Certified Wedding & Event Planner Expert Interview. 17 August 2021. A sign could say, “Reserved for the late Mr. Thompson” or “Reserved in honor of Mrs. Whittier.” You can also lay a single flower from your bouquet on a chair to reserve it."
    },
    {
      "title": "Involve your guests with a moment of reflection during the ceremony.",
      "content": "Involve your guests with a moment of reflection during the ceremony. Have your wedding officiator give a brief introduction of your loved one and ask them to pause for 10 seconds. You can call this a moment of reflection or a moment of silence to honor and remember your parent. [6] X Research source [7] X Expert Source Ivy Summer Certified Wedding & Event Planner Expert Interview. 17 August 2021. Your officiator could say something like, “On this day of celebration, we want to stop and reflect on those who have passed. Let’s take a brief moment of reflection to think about those who could not be with us today.”"
    },
    {
      "title": "Arrange some flowers in their honor for a beautiful centerpiece.",
      "content": "Arrange some flowers in their honor for a beautiful centerpiece. If your parent had a favorite array of flowers, you can include those in your decorations by placing them at the altar where your wedding ceremony will happen. If they didn’t have any favorite flowers, choose some that mean remembrance, like rosemary or pansies. [8] X Research source"
    },
    {
      "title": "Set up pictures of the deceased to remember them fondly.",
      "content": "Set up pictures of the deceased to remember them fondly. Bring some framed photographs and memorabilia from your parent’s lifetime on your wedding day. Display this on a small table at the front of the reception hall so that your guests can pause and look at it as they enter. [9] X Research source [10] X Expert Source Ivy Summer Certified Wedding & Event Planner Expert Interview. 17 August 2021. This is a great choice if people who were close to your parent will be attending your wedding."
    },
    {
      "title": "Toast your parent at the reception to include them after the ceremony.",
      "content": "Toast your parent at the reception to include them after the ceremony. Wedding toasts are usually a long ordeal, and as the bride or groom you are welcome to toast whoever you’d like to. Ask your guests to raise a glass for your deceased parent to honor them even though they couldn’t attend your wedding. [11] X Research source [12] X Expert Source Ivy Summer Certified Wedding & Event Planner Expert Interview. 17 August 2021. Your toast can sound something like, “Thank you all so much for being here. I wanted to quickly raise a glass for my dad who couldn’t be here today. I know he would have loved to walk me down the aisle and be a part of today’s celebration. Let’s all toast to my father, Mr. Wicks.”"
    }
  ]
}