{
  "url": "https://www.wikihow.com/Blinking-Power-Light-on-Ninja-Blender",
  "title": "6 Easy Ways to Fix a Blinking Red Light on a Ninja Blender",
  "steps": [
    {
      "title": "Adjust the lid on your blender if it's misaligned or unlocked.",
      "content": "Adjust the lid on your blender if it's misaligned or unlocked. The most common cause of a blinking power light on any Ninja appliance (and the easiest one to fix) is a lid that isn't seated properly. Ensure that the dots on the corner of the lid and the blender handle align and that the button to lock it is pushed down. The light should become steady if the lid was the problem. [1] X Research source You can also check if the sensors that monitor whether your lid is properly attached to the pitcher are clean. If they're dirty, wipe them with a clean rag before putting the lid back on and firing the blender up again. [2] X Research source"
    },
    {
      "title": "Reseat the pitcher if it isn't locked in place on the base.",
      "content": "Reseat the pitcher if it isn't locked in place on the base. If your pitcher isn't seated level on top of the base and locked into position, it may cause the power light to blink. Unplug the blender and screw the pitcher on correctly by setting it on top of the base and turning it clockwise until you hear it click and you can't move it anymore. [3] X Research source"
    },
    {
      "title": "Clear out the pitcher if it's too full and unblock the blades.",
      "content": "Clear out the pitcher if it's too full and unblock the blades. When you blend a lot of food or thick, sticky ingredients, the food can block the blades from turning and make the light on your blender blink every 2-3 seconds. [4] X Research source Unplug the appliance, remove some of the food from the pitcher, and clear the debris that's blocking the blades. Ensure the blades are tightly screwed in place before using your Ninja blender again."
    },
    {
      "title": "Replace the blades if they're worn or damaged.",
      "content": "Replace the blades if they're worn or damaged. Bent or broken blades may not spin as well, which could lead your blender to blink red as a sign for you to fix them. Alternatively, the damaged blades could lead to blockages that will prompt the light to flash. [5] X Research source Contact Ninja to find replacement blades for your specific blender model."
    },
    {
      "title": "Check the motor to determine if it's overheated or worn down.",
      "content": "Check the motor to determine if it's overheated or worn down. If you've been using your blender for a long stretch of time, the light may start blinking to signal it's too hot. The blender will also be hot to the touch. Alternatively, the light may blink to tell you the motor is old and worn out, in which case you may also hear a grinding sound. [6] X Research source To fix an overheated Ninja blender, turn the power off, unplug it from the wall, and let it sit on your counter until all its components are thoroughly cooled. In the future, avoid blending with it for longer than If all the above solutions fail to fix the blinking power light or the blender constantly overheats, then the light may be flashing to tell you that the motor is worn out. Contact Ninja customer support to discuss getting a replacement blender. [7] X Research source"
    },
    {
      "title": "Check the blender power cord and the outlet for electrical issues.",
      "content": "Check the blender power cord and the outlet for electrical issues. Your blender blinking a red light may indicate that the blender power cord is faulty or the outlet where you plugged it in isn't working at full capacity. [8] X Research source Test the blender to ensure the power cord and outlet are working by plugging it into another outlet. If you notice the same blinking light, the power cord may be malfunctioning and you should contact Ninja to request a new blender."
    },
    {
      "title": "A flashing white light on your Ninja Creami points to an assembly issue.",
      "content": "A flashing white light on your Ninja Creami points to an assembly issue. Check that the paddle is installed in the lid and that the lid is secured on top of the pint. Turn the pint and lid to lock them into place on the motor base, and continue using your Ninja Creami to make delicious desserts. [9] X Research source"
    },
    {
      "title": "Ask Ninja for parts or a new blender by calling 1-800-365-0135.",
      "content": "Ask Ninja for parts or a new blender by calling 1-800-365-0135. Their live agents are available from Monday-Friday, 9AM-9PM EST, and on Saturday from 9AM-6PM EST. The agent may ask you if you want to communicate via video chat so they can see the problem with the blender and better understand how to fix it (or tell you if it needs to be replaced). [10] X Research source"
    },
    {
      "title": "Troubleshoot the problem yourself from Ninja's Product Support page.",
      "content": "Troubleshoot the problem yourself from Ninja's Product Support page. If you want to try to fix the problem without calling in, the Product Support page features FAQs, manuals, guides, and videos. to help you with your particular Ninja blender model. Ninja will even help you find replacement parts if they're available."
    }
  ]
}