{
  "url": "https://www.wikihow.com/Add-a-Spouse-to-a-Car-Title",
  "title": "How to Add a Spouse to a Car Title",
  "steps": [
    {
      "title": "Make sure you have a copy of the title.",
      "content": "Make sure you have a copy of the title. You will need to have the title to your vehicle to add your spouse's name. You may not have possession of your title if there is a lien against your vehicle. A lien is a creditor's legal right to sell certain property of a debtor who defaults on his or her obligations. If you have not paid off your car completely, the lender has probably placed a lien on the car, and may hold the title. [1] X Research source If you do have a lien on your vehicle, contact the lienholder and ask them about adding your spouse’s name. [2] X Research source Typically, the lienholder will have no problem with this. Adding a name to the title makes the added party liable for the amount due to the lienholder. Once the lienholder has given consent to add your spouse, most states require that the lienholder fill out a form stating that they granted permission. These forms will vary depending on your state. To find the form for your state call the local Department of Motor Vehicles or visit the website. If you have lost the original title to your car, you can apply for a replacement. To get a replacement, look at your state’s requirements and visit your local DMV office. Your state's requirements should be available online. [3] X Trustworthy Source State of Massachusetts Official website for the State of Massachusetts Go to source Some states require you to submit latest smog test (California) when you change ownership (this includes adding a spouse to a title), but you can submit a statement of facts which will exempt this requirement because your spouse is a family member. Some states, such as California, allow you to have paperless title. Therefore, you need either the California Certificate of Title or an Application for Duplicate or Paperless Title."
    },
    {
      "title": "Sign the back of the title as if selling the vehicle.",
      "content": "Sign the back of the title as if selling the vehicle. Although you are not actually selling your vehicle, the process of changing the names on the title is the same as if you were selling your car to yourself and your spouse. Sign the title on the seller line. [4] X Research source . Some states require that you sign the title in front of a notary. Look online to find out if this is required in your state. [5] X Trustworthy Source State of Massachusetts Official website for the State of Massachusetts Go to source If you must sign in front of a notary, visit any local bank during regular business hours. Most banks do not charge a fee for notarization services if you have an account. If you do not have a bank account, a bank may charge a small fee (less than $10). You may also be required to list the vehicle's mileage on the title. Requirements about this vary from one state to the next. Likewise, some states require you provide this information on the title itself, while in others you must include an additional. Forms and state-specific information are available online. [6] X Research source"
    },
    {
      "title": "Choose the right conjunction.",
      "content": "Choose the right conjunction. Some states make a distinction between using \"and\" or \"or\" between the names of new owners. For example, in Kansas, Tennessee, and Connecticut \"and\" means that both parties must sign to conduct any business with the title. \"Or\" allows either party to take responsibility. If your state makes this distinction, use “and” if you want both partners to approve anything done with the car title."
    },
    {
      "title": "Print your names as \"buyers\" of the vehicle.",
      "content": "Print your names as \"buyers\" of the vehicle. Print your name and your spouse's name as buyers on the title. Write the names as you want them to appear on the new title. [7] X Research source After printing your names as the “buyers,” you and your spouse should both sign the title in the appropriate places. Again, your state may require you and your spouse to sign in front of a notary. Find your state's requirements online. [8] X Trustworthy Source State of Massachusetts Official website for the State of Massachusetts Go to source You should sign both as the seller and the buyer, while your spouse only needs to sign as the buyer."
    },
    {
      "title": "Obtain a Transfer of Title form.",
      "content": "Obtain a Transfer of Title form. In most cases, this can be downloaded from the DMV website. Go online to find the correct form for your state. [9] X Research source"
    },
    {
      "title": "Complete the form",
      "content": "Complete the form . States can have slightly different transfer of title forms, but most will simply ask for basic information about you and the person you are transferring the title to. You will usually need to include your name and address. When filling out this form, you will put both your information as well as your spouse’s information in as the “transferee.”"
    },
    {
      "title": "Submit the form and pay the fee.",
      "content": "Submit the form and pay the fee. After filling out the form, take or mail the form and your old title to the DMV. You do not need an appointment, although it may cut down your wait time to make one. Be prepared to pay the transfer fee. Most states charge a small transfer fee, which you can pay when you transfer your title. The amount of the fee will vary depending on your state, but in most cases it's under $50. [10] X Research source [11] X Research source"
    },
    {
      "title": "Update your vehicle registration.",
      "content": "Update your vehicle registration. In some states, you can simply add your spouse’s name to your existing registration information. However, some states, such as New York, require you to register the car separately for each person appearing on the title. Sometimes this may require additional paperwork. Check with your local DMV to find out what the requirements are in your state. [12] X Research source In California, for example, you must do this within five days of adding your spouse. [13] X Research source Some states will allow you submit a notice of transfer and release of liability online. This makes it so that any parking violations, traffic violations, and civil litigation resulting for the vehicle before the title is recorded will be ascribed to new owner of the vehicle. In this case, it would add liability for the vehicle to the spouse."
    },
    {
      "title": "Inform your insurance company.",
      "content": "Inform your insurance company. Make sure that you notify your insurance company that a new name has been added to the title. Your insurance company may also need a current and accurate copy of the title. However, if your spouse is already covered under your insurance policy, adding his or her name to the car title should not affect your rates or policy. If your spouse is not covered under your policy, you will need to add him or her, or make sure that your spouse is covered under their own policy."
    }
  ]
}