{
  "url": "https://www.wikihow.com/Catch-Victini-in-Pok%C3%A9mon-Black-and-White",
  "title": "How to Find & Catch Victini in in Pokémon Black and White",
  "steps": [
    {
      "title": "Make sure that you have the right Pokémon for the fight.",
      "content": "Make sure that you have the right Pokémon for the fight. Your Pokémon should be at least level 30, and they should have attacks powerful enough to whittle down Victini's plentiful health pool. Victini's attacks include Incinerate, so bringing a fire-resistant Pokémon isn't a bad idea."
    },
    {
      "title": "Stock up for the Victini fight.",
      "content": "Stock up for the Victini fight. You'll want expensive Poké Balls such as Ultra Balls and Great Balls—Victini can be difficult to capture."
    },
    {
      "title": "Go to Castelia City.",
      "content": "Go to Castelia City. It is the large city located in the bottom-center of the Unova map. You can get to the city on foot by Route 4."
    },
    {
      "title": "Go to Liberty Island.",
      "content": "Go to Liberty Island. Go to the furthest pier on the left and speak to the captain waiting by the boat, then wait for him to take you to Liberty Island. Since you entered the Victini code, you should have the Liberty Pass which makes this possible."
    },
    {
      "title": "Make your way to the lighthouse entrance.",
      "content": "Make your way to the lighthouse entrance. Head up toward the top of the island, then turn right to circle around the lighthouse. You'll run into several Team Plasma members between your landing point and the lighthouse, so be prepared for several fights. The Team Plasma’s Pokémon range from level 15 to level 20. There is an Ultra Ball in the trash cans on the far-left side of the island, directly below where you entered. You will need to go all the way around to reach it, because the crowd is blocking the path where you arrive."
    },
    {
      "title": "Proceed through the lighthouse.",
      "content": "Proceed through the lighthouse. You will need to fight a Team Plasma member on the way in, and then the man on your left will offer to heal all of your Pokémon; if you can afford it, allow him to do so. After this point, you'll head down the stairs and fight the other Team Plasma members on your way to Victini."
    },
    {
      "title": "Save before entering the last room.",
      "content": "Save before entering the last room. Since Victini is in the last room, it's best to save immediately before entering it. Although you can exit and re-enter the room if you accidentally knock out Victini, you'll have lost some supplies in the fight. It's best to reload the save instead."
    },
    {
      "title": "Initiate the battle.",
      "content": "Initiate the battle. Talk to Victini on the far side of the room to do so. In most cases, you'll notice that Victini is level 15. This can change, but should be fairly consistent for the most part."
    },
    {
      "title": "Lower Victini’s health.",
      "content": "Lower Victini’s health. Use small attacks to whittle Victini’s health down without accidentally knocking it out. You want to get Victini into the red portion of its HP bar. If you accidentally knock out Victini, exit the room and reenter it to try again."
    },
    {
      "title": "Start throwing Poké Balls.",
      "content": "Start throwing Poké Balls. Once Victini’s health is in the red, start trying to capture it by using strong Poké Balls such as Ultra Balls and Great Balls. You may have to try several times in order to catch it. Once you’ve captured Victini, he'll be added to your list of Pokémon."
    },
    {
      "title": "Buy an Action Replay card.",
      "content": "Buy an Action Replay card. Action Replay cards are available in some retro video game stores as well as online in places like Amazon and eBay. Action Replay cards allow you to use cheats while playing most Nintendo DS games."
    },
    {
      "title": "Plug the Action Replay card into your Nintendo DS.",
      "content": "Plug the Action Replay card into your Nintendo DS. It should plug into the back of your Nintendo DS, with a card reader facing out from the back of the DS."
    },
    {
      "title": "Turn on your Nintendo DS.",
      "content": "Turn on your Nintendo DS. Press the DS' power button to do so."
    },
    {
      "title": "Attach your Nintendo DS to your computer.",
      "content": "Attach your Nintendo DS to your computer. Plug one end of your Nintendo DS charging cable into the DS, then plug the USB end into your computer. If your Nintendo DS doesn't have a USB-to-DS charger, you'll need to buy one. If you're using a Mac with USB-C ports instead of USB 3.0 ports, you'll need a USB 3.0 to USB-C adapter in order to plug your DS into your Mac."
    },
    {
      "title": "Create the Victini force-appear code.",
      "content": "Create the Victini force-appear code. In order to force Victini to appear in-game, you'll need to create a cheat code file on your computer and then move it over to the Action Replay card. The code itself is almost 200 lines long, so adding it by hand is impractical. To create the code file, do the following: [1] X Research source Go to https://pastebin.com/waAnjk65 Select the whole column of numbers (excluding the space before the very first number and the \"victini\" heading). Copy the code by pressing Ctrl + C (Windows) or ⌘ Command + C (Mac). Open Notepad (Windows) or TextEdit (Mac). Paste in the code by pressing Ctrl + V (Windows) or ⌘ Command + V (Mac)."
    },
    {
      "title": "Save the file as an XML document.",
      "content": "Save the file as an XML document. To do so: Windows - Click File , click Save As... , enter your code's name in the \"File name\" text box, click the \"Save as type\" drop-down box, click All Files , type .xml at the end of the file's name, and click Save . Mac - Click Format , click Make Plain Text , click File , click Save As , enter a name, type .xml to replace the \".txt\" extension at the end of the file's name, and click Save ."
    },
    {
      "title": "Copy your XML file.",
      "content": "Copy your XML file. Click the file that you just created, then press Ctrl + C (Windows) or ⌘ Command + C (Mac)."
    },
    {
      "title": "Open your Nintendo DS.",
      "content": "Open your Nintendo DS. To do so: Windows - Open Start , open File Explorer , click This PC , and double-click your Nintendo DS' name under the \"Devices and drives\" heading. Mac - Open Finder , then click your DS' name in the lower-left side of the window."
    },
    {
      "title": "Open the Action Replay's folder.",
      "content": "Open the Action Replay's folder. Double-click through your Nintendo DS' folders until you find the Action Replay folder. You should see a long list of existing XML documents in this folder."
    },
    {
      "title": "Paste in your XML file.",
      "content": "Paste in your XML file. Click a blank space anywhere in the Action Replay's folder, then press Ctrl + V (Windows) or ⌘ Command + V (Mac)."
    },
    {
      "title": "Eject your Nintendo DS.",
      "content": "Eject your Nintendo DS. To do so: Windows - Click in the lower-right corner of the screen, right-click the USB flash drive-shaped icon, and click the Eject option. Mac - Click the \"Eject\" icon to the right of your Nintendo DS' name."
    },
    {
      "title": "Insert your Pokémon White or Black cartridge.",
      "content": "Insert your Pokémon White or Black cartridge. It should plug into the back of the Action Replay card."
    },
    {
      "title": "Load the Victini code.",
      "content": "Load the Victini code. This will ensure that Victini is in your Pokémon game: Tap the Star icon in the lower-left corner of the bottom screen. Select the Victini code (which will be named whatever you entered for the XML file's name) on the top screen. You may have to scroll down. Tap START on the bottom screen."
    },
    {
      "title": "Wait for Pokémon Black or White to start.",
      "content": "Wait for Pokémon Black or White to start. Once your game is ready, you can proceed with actually catching Victini ."
    },
    {
      "title": "Download the DeSmuME emulator.",
      "content": "Download the DeSmuME emulator. Go to https://desmume.org/download/ and click the download link for your preferred system (Windows or Mac) near the bottom of the page. You'll be taken to a SourceForge page, at which point your emulator will begin to download automatically after a few seconds. If you're using a Windows computer, you'll most likely want to use the 64-bit download link."
    },
    {
      "title": "Download the Pokémon Black or White ROM.",
      "content": "Download the Pokémon Black or White ROM. Search for and download a ROM for your preferred game, though keep in mind that doing so may constitute piracy in your region (especially if you don't already have the Nintendo DS game cartridge for your selected download)."
    },
    {
      "title": "Install the emulator.",
      "content": "Install the emulator. This process will vary depending on whether you use a Windows computer or a Mac computer: Windows - Double-click the downloaded ZIP folder, click the Extract tab, click Extract all in the toolbar, click Extract , and double-click the DeSmuME application icon. Mac - Double-click the downloaded DMG file, verify the software if needed, and double-click the DeSmuME icon. You may need to follow some on-screen instructions after doing so."
    },
    {
      "title": "Click File.",
      "content": "Click File . It's in the top-left corner of the DeSmuME window. A drop-down menu will appear."
    },
    {
      "title": "Click Open ROM….",
      "content": "Click Open ROM… . This option is near the top of the File drop-down menu."
    },
    {
      "title": "Select your Pokémon White or Black ROM.",
      "content": "Select your Pokémon White or Black ROM. Click the ZIP folder that you downloaded from Emuparadise to select it."
    },
    {
      "title": "Click Open.",
      "content": "Click Open . It's in the bottom-right corner of the window. Doing so will prompt DeSmuME to begin loading your ROM."
    },
    {
      "title": "Copy the Victini code.",
      "content": "Copy the Victini code. You'll need to use an Action Replay code to force Victini to appear in-game: Go to https://pastebin.com/waAnjk65 Select the whole column of numbers (excluding the space before the very first number and the \"victini\" heading). Copy the code by pressing Ctrl + C (Windows) or ⌘ Command + C (Mac)."
    },
    {
      "title": "Click Tools.",
      "content": "Click Tools . It's a tab at the top of the window. Clicking it prompts a drop-down menu."
    },
    {
      "title": "Select Cheats.",
      "content": "Select Cheats . This option is in the Tools drop-down menu. Selecting it will cause a pop-out menu to appear."
    },
    {
      "title": "Click List.",
      "content": "Click List . You'll find it in the pop-out menu."
    },
    {
      "title": "Click Action Replay.",
      "content": "Click Action Replay . It's near the bottom of the window. Doing so opens a new window in which you can enter your copied code."
    },
    {
      "title": "Paste in the copied Victini code.",
      "content": "Paste in the copied Victini code. Click the \"Code\" text box, then paste in your copied code by pressing Ctrl + V (Windows) or ⌘ Command + V (Mac). You should see all 196 lines of the copied code appear in the \"Code\" text box."
    },
    {
      "title": "Click Add.",
      "content": "Click Add . This option is at the bottom of the window. If the \"turn on code\" box isn't checked, click it to check it before clicking Add ."
    },
    {
      "title": "Click Save.",
      "content": "Click Save . It's at the bottom of the window. Doing so will save the code and add it to your game, meaning that Victini should now be present. At this point, you can proceed to actually catching Victini ."
    }
  ]
}