{
  "url": "https://www.wikihow.com/Become-Best-Friends-on-Snapchat",
  "title": "Simple Ways to Become Best Friends on Snapchat",
  "steps": [
    {
      "title": "Understand how the Best Friend status works.",
      "content": "Understand how the Best Friend status works. In order to become Best Friends on Snapchat, you must communicate with them more than you communicate with other added friends. [1] X Research source Your Best Friends will have a special Friend Emoji beside their name. Different emojis will indicate different levels of status. Your friend also must communicate with you in the same manner if they want you on their Best Friends list. You can have up to eight Best Friends at once."
    },
    {
      "title": "Open the Snapchat app.",
      "content": "Open the Snapchat app. This resembles a white ghost on a yellow background. The Snapchat camera will open if you're logged in. Snapchat is available for iOS in the App Store and for Android in the Google Play Store . If you aren't logged in, tap LOG IN to do so now. You can also create a Snapchat account ."
    },
    {
      "title": "Tap your profile icon.",
      "content": "Tap your profile icon. It's in the top-left corner of the screen. This will open your profile page. [2] X Research source"
    },
    {
      "title": "Tap Add Friends.",
      "content": "Tap Add Friends . This option is in the middle of the page, underneath the Friends header. You may need to scroll down to find it. [3] X Research source If you're physically near your friend and they have Snapchat open, they can scan your Snapcode to quickly add you. The Snapcode appears at the top of your profile page."
    },
    {
      "title": "Tap the search bar.",
      "content": "Tap the search bar. It's at the very top of the screen. Your phone's keyboard will pop up."
    },
    {
      "title": "Type in your friend's username.",
      "content": "Type in your friend's username. This will search the Snapchat database for them. You should see your friend's username appear in the middle of the page."
    },
    {
      "title": "Tap ＋ Add.",
      "content": "Tap ＋ Add . It's next to your friend's username. This will add them to your Snapchat Friends list. [4] X Research source Your friend must accept the friend request to be added. You can send them a Snap to remind them to accept. Once your friend adds you to their friends list, you can proceed with snapping them to your heart's content."
    },
    {
      "title": "Return to the Camera page.",
      "content": "Return to the Camera page. If you haven't already done so, tap the \"Back\" button in the top-left corner of the screen to go back to your profile page, then tap X to close your profile page."
    },
    {
      "title": "Take a snap.",
      "content": "Take a snap. Point the camera at something that you want to send, then tap the circular \"Capture\" button. [5] X Research source If you want to take a video snap, tap and hold the \"Capture\" button until you're done recording, then release the button. You can get effects or add filters to your Snap before sending it."
    },
    {
      "title": "Tap the \"Send\" icon.",
      "content": "Tap the \"Send\" icon. It's a yellow arrow in the bottom-right corner of the screen. Doing so takes you to the friends list. [6] X Research source"
    },
    {
      "title": "Select your friend.",
      "content": "Select your friend. Tap your friend's name to select them as the recipient of your snap. [7] X Research source Avoid sending snaps to other people for now, since your primary goal is to get your friend onto your Best Friends list. Focusing your activity with one user will ensure Best Friend status is achieved more quickly."
    },
    {
      "title": "Tap the \"Send\" icon.",
      "content": "Tap the \"Send\" icon. It's the blue-and-white arrow in the bottom-right corner of the screen. This will send your snap to your friend. [8] X Research source In order for the snap to be counted toward the Best Friends list score, your friend must open your snap."
    },
    {
      "title": "Send the user several more photo or video Snaps.",
      "content": "Send the user several more photo or video Snaps. Sending photo and video Snaps to a friend more frequently than to any of your other friends will quickly put the friend on your Best Friends list. The more snaps you send that friend, the sooner the person will end up on your Best Friends list. Make sure the other person sends you just as many Snaps. While they may end up on your Best Friends list, they must also reciprocate the activity for the status to be mutual."
    },
    {
      "title": "Open the \"Chat\" tab.",
      "content": "Open the \"Chat\" tab. Swipe right from the Camera page to do so. You should see a list of recently Snapped friends. [9] X Research source You can also tap the chat bubble icon in the bottom-left corner, next to the pin icon."
    },
    {
      "title": "Tap your friend's name.",
      "content": "Tap your friend's name. This will open their chat page. [10] X Research source"
    },
    {
      "title": "Enter a message.",
      "content": "Enter a message. Type in the message that you want to send to your friend. You can also add images from your device's Camera Roll or Gallery by tapping the card-shaped \"Photos icon beside the text box. Select the photos you want to send, then tap the arrow in the bottom-right corner."
    },
    {
      "title": "Tap Send.",
      "content": "Tap Send . This can be found at the bottom-right corner. Your message will be sent to your friend. They'll be able to open it from their Snapchat app. On some Android phones, you'll need to tap ✓ instead."
    },
    {
      "title": "Have frequent conversations with your friend.",
      "content": "Have frequent conversations with your friend. The more chats that are sent between the two of you, the quicker you'll end up on each other's Best Friends list. Starting a Snapchat Streak is a great way to reach Best Friend status quickly. When the status changes, you'll be able to see a Friend Emoji by their name in your Friends list and Chat tab. [11] X Research source"
    }
  ]
}