{
  "url": "https://www.wikihow.com/Bring-Out-Green-Eyes",
  "title": "How to Bring Out Green Eyes",
  "steps": [
    {
      "title": "Purple makes green pop since they’re opposite on the color wheel.",
      "content": "Purple makes green pop since they’re opposite on the color wheel. You can also experiment by doubling up and wearing multiple shades of purple simultaneously. Try going for warm purples with red or pink undertones to make your eyes stand out more. [1] X Research source Check out the effect when you put on a lavender t-shirt and a dark purple zip-front hoodie on top."
    },
    {
      "title": "Coral is a light, summery color that makes green eyes pop.",
      "content": "Coral is a light, summery color that makes green eyes pop. When it’s warm out, throw on a coral-colored sundress or T-shirt to really make your eyes stand out. Try a coral-colored statement necklace or earrings to really pull the look together. [2] X Research source If you aren’t a huge fan of coral, try pale yellow instead. It’s also a light, summery color that will make your eyes pop."
    },
    {
      "title": "Deep emeralds and dark hunter greens will make your eyes pop.",
      "content": "Deep emeralds and dark hunter greens will make your eyes pop. Whatever clothing item you wear closest to your irises—the green-colored part of your eyes—will emphasize their color. Since many shades of green will make green eyes pop, try wearing shirts and jackets in your favorite shade. A deep emerald green dress would look great for an evening event. Slip on a neutral green jacket or hoodie for a casual look."
    },
    {
      "title": "Draw attention to your eye color with pieces that match it exactly.",
      "content": "Draw attention to your eye color with pieces that match it exactly. Try a statement necklace with green stones or long, dangly green earrings. When it comes to choosing metal, go with the one that matches your skin tone . Warm skin tones look best in gold, whereas cool skin tones look best in silver. [3] X Research source For example, wear a silver drop pendant with a green stone as the focal point if you have a cool skin tone. If you have a warm skin tone, try emerald or peridot earrings with gold metal accents."
    },
    {
      "title": "Add pops of color to your look while emphasizing your green eyes.",
      "content": "Add pops of color to your look while emphasizing your green eyes. Go for green scarves, shawls, beanies, headbands, or bowties when you head out the door. The close the shade of green is to your eyes, the more your outfit will pop! A pastel green scarf would look great with light green eyes. Get a dressier look by wearing an emerald-colored shawl or wrap. Mix things up with a green on green striped tie. If you’re heading to a formal event and really want to make a splash, put on an olive-colored bow tie."
    },
    {
      "title": "Red is opposite green on the color wheel, so it really sets off green eyes.",
      "content": "Red is opposite green on the color wheel, so it really sets off green eyes. Choose a shade of red dye that harmonizes with your skin tone for best results. Stay within 3 shades of your current hair color if you’re aiming for a natural look. [4] X Research source If you don’t want to use chemical or box dyes, try henna instead. If you're warm-toned, go for vibrant or coppery red shades, or anything with a golden tone. Feeling adventurous? Try brighter red highlights! If you're cool-toned, try muted reds like strawberry blonde or rose gold."
    },
    {
      "title": "Brown liner and shadow makes green eyes pop without looking harsh.",
      "content": "Brown liner and shadow makes green eyes pop without looking harsh. Black liner can be a little too much for green eyes. Try a deep chocolatey kohl, pencil, or liquid liner to bring out green eyes. Blend your liner or shadow in with a fluffy brush for a defined yet natural makeup look. [5] X Research source Brush deep brown shades of eyeshadow with rich golden undertones on your lids to accentuate them. [6] X Research source Devorah Kuperland. Makeup Artist. Personal interview. 7 May 2020. If you have a warm skin tone, use copper, tan, and other warm brown shades. Cool skin tones work best with ash brown, taupe, and silver-brown shades."
    },
    {
      "title": "Purple and green are opposite on the color wheel.",
      "content": "Purple and green are opposite on the color wheel. Try lining your top lids with a deep purple eyeliner, then brushing on a rich purple eyeshadow, stopping at the crease. Smudge the liner so that it blends into the eyeshadow for a flattering and dramatic look. [7] X Research source Try sweeping on a deep plum eyeshadow or eyeliner to make your green eyes pop. [8] X Research source Devorah Kuperland. Makeup Artist. Personal interview. 7 May 2020. Try a deep purple cream eyeshadow with a slightly metallic tinge to it for a bright-eyed and subtler finish."
    },
    {
      "title": "Play up the green in your eyes with a stony gray color.",
      "content": "Play up the green in your eyes with a stony gray color. Since black eyeliner can overwhelm green eyes, use charcoal liner or eyeshadow to get the same definition without the harsh color. If you want more definition and the freedom to create cat eyes and other shapes, go with a waterproof liquid liner in charcoal. [9] X Research source A deep charcoal eyeshadow on your top lids will also look great!"
    },
    {
      "title": "Using green eye makeup is the best way to make your eyes pop.",
      "content": "Using green eye makeup is the best way to make your eyes pop. Try using green eyeliner, green eyeshadow, or green mascara—just don’t wear all 3 at the same time! All it takes is just a hint of green to make your eyes stand out. Pick a shade that doesn’t match your eyes exactly so your look meshes well. [10] X Research source Devorah Kuperland. Makeup Artist. Personal interview. 7 May 2020. For example, if you apply green eyeliner, use black or brown mascara. If you wear green eyeshadow, use black mascara. Green eyeliner and mascara work together, but skip the eyeshadow."
    }
  ]
}