{
  "url": "https://www.wikihow.com/Be-Posh",
  "title": "How to Be Posh",
  "steps": [
    {
      "title": "Display good manners.",
      "content": "Display good manners. Posh people have good manners and know the boundaries in human relations. Always say \"please\" and \"thank you\" when the situation calls for it. Say \"excuse me,\" greet people politely, and display good table manners—such as chewing with your mouth closed. [1] X Research source Also do not use your phone at the table or when talking to someone."
    },
    {
      "title": "Avoid an arrogant attitude.",
      "content": "Avoid an arrogant attitude. Although posh people are often wealthy or \"high class,\" this does not mean they are arrogant. It’s important to be confident in yourself and your abilities, but do not think that you are better than anyone else. Treating everyone you meet as your equal is very posh. [2] X Research source"
    },
    {
      "title": "Take responsibility for your actions and obligations.",
      "content": "Take responsibility for your actions and obligations. Always show up and do your best at anything you commit to. For example, if you say you will throw a party for someone, do it and do it to your best ability. Or, if you make a mess while you’re a guest at someone’s home, make sure to clean up after yourself. [3] X Research source"
    },
    {
      "title": "Be articulate.",
      "content": "Be articulate. Posh people have a large vocabulary and know when to employ it. However, posh people never force words into sentences that don't belong. Read and study to expand your vocabulary, but don’t use your knowledge to show off. Speak clearly and confidently. [4] X Research source"
    },
    {
      "title": "Look for posh people you admire.",
      "content": "Look for posh people you admire. This person could be a friend, historical figure, or even a celebrity. Don't copy them precisely but do allow their way of being, their style, and attitudes have some influence on yours. That way, you can build a strong foundation on which to become a posh person in your own right. Some examples of posh people are Emma Watson, Kate Middleton, Benedict Cumberbatch, and Eddie Redmayne. [5] X Research source"
    },
    {
      "title": "Practice a posh accent.",
      "content": "Practice a posh accent. A posh accent is often associated with the English aristocracy, as well with educational institutions, like Oxford. This accent is referred to as posh, but is actually called Upper Received Pronunciation English (Upper RP). Essentially, to sound this way, practice an English accent. Then, pronounce your consonants more fully. Also, pronounce vowels æ sound leaning more towards the “e” sound. [6] X Research source For example, when saying “man,” it will sound more like “men” in a posh accent. Also, a weak “I” sound will sound more like an “e.” For example, “quickly” should be pronounced more like “queckly.”"
    },
    {
      "title": "Make an effort to converse with others.",
      "content": "Make an effort to converse with others. Take some time out of every day to have a conversation with someone. This could be a friend, coworker, or even your mail carrier. Display genuine interest in what they have to say, and most importantly, only say things that come from a place of kindness. [7] X Research source"
    },
    {
      "title": "Attend parties you’ve been invited to.",
      "content": "Attend parties you’ve been invited to. It’s okay if you aren’t naturally outgoing, but make an effort to attend every gathering you’ve been invited to. Make sure to thank the host at the party and bring a small gift, such as a bottle of wine, for the host. While at the party, speak to as many people as possible and try to genuinely enjoy yourself. [8] X Research source As a gift, you could also bring flowers or an appetizer—such as a cheese plate."
    },
    {
      "title": "Find a sociable hobby.",
      "content": "Find a sociable hobby. Look for a hobby that involves spending time with other people. Make sure it is something you’d enjoy. It could be soccer, a book club, or a painting class. Preferably, invest yourself in a hobby that involves improving yourself, whether it be mind or body. [9] X Research source"
    },
    {
      "title": "Learn as much as you can.",
      "content": "Learn as much as you can. Stay up-to-date on current events and read books whenever you have spare time. If you are in school, do your best to get good grades and benefit from your education. Even if you are well-educated, never miss an opportunity to learn from an elder or another intelligent person. [10] X Research source Read the newspaper, online or in print—such as The New York Times. Watch the news—whichever news channel you prefer. Read classics of literature—like Jane Eyre."
    },
    {
      "title": "Send out thank-you letters.",
      "content": "Send out thank-you letters. Thank-you letters aren’t very common nowadays, but they are always polite and appreciated. Send a handwritten thank-you note whenever someone does anything kind for you, hosts a party, or gives you a gift. If you can’t send a handwritten note, at least send an e-mail. [11] X Research source"
    },
    {
      "title": "Practice good hygiene.",
      "content": "Practice good hygiene. Brush your teeth at least twice a day, and take a shower on a daily basis. Washing your hair every day isn’t ideal for everyone, so wash and condition your hair as often as is best for your hair type. You should clean your nails and keep them trimmed. Essentially, keep yourself clean and healthy. [12] X Research source"
    },
    {
      "title": "Exercise regularly.",
      "content": "Exercise regularly. Stay healthy by doing some kind of exercise at least 3 times a week. If possible, exercise 5 times a week for at least 30 minutes a day. Find a type of exercise that you enjoy. It could be running, swimming, or even dancing. Regular exercise will boost your energy and overall confidence. [13] X Research source"
    },
    {
      "title": "Invest in your personal style.",
      "content": "Invest in your personal style. You don’t have to adhere to one specific style to be posh. Find a style that makes you feel the most confident and invest in it. Find clothes and accessories in this style. This could be a preppy, retro, or even a hipster style. [14] X Research source Carry a statement handbag to instantly give your outfit an elegant, elevated look. [15] X Expert Source Jordan Stolch Image Consultant & Style Advisor Expert Interview. 3 November 2020."
    },
    {
      "title": "Choose fitted clothing made from classic fabrics.",
      "content": "Choose fitted clothing made from classic fabrics. Wear clothing that is not too tight or too baggy. Ideally, your clothing should be form-fitting. The fit and overall look of your outfit will look even better if you choose classic fabrics—such as cotton, wool, linen, and silk. These fabrics may be a bit more expensive, but it’s better to buy a few high quality items rather than a larger quantity. [16] X Research source"
    },
    {
      "title": "Wear solid neutral colors.",
      "content": "Wear solid neutral colors. If you have trouble finding a style that works for you, it is always a safe option to go for simple clothing in a neutral color. Some great neutral colors to choose from are white, navy blue, black, and gray. For example, you could wear a pair of navy blue slacks with a white sweater. [17] X Research source"
    },
    {
      "title": "Wear simple accessories.",
      "content": "Wear simple accessories. You can, of course, wear whatever accessories that appeal to you, but it is quite posh to choose just a few basic accessories. For example, choose a simple silver necklace with silver stud earrings. Or, wear a brown leather belt with brown loafers. Let your confidence shine through rather than letting your clothes speak for you. [18] X Research source Tie a scarf around your neck for a timeless look. [19] X Expert Source Jordan Stolch Image Consultant & Style Advisor Expert Interview. 3 November 2020. A leather belt is always great for tying your look together. [20] X Expert Source Jordan Stolch Image Consultant & Style Advisor Expert Interview. 3 November 2020. Opt for classic, elegant jewelry like a simple gold cuff bracelet and gold earrings. [21] X Expert Source Jordan Stolch Image Consultant & Style Advisor Expert Interview. 3 November 2020."
    }
  ]
}