{
  "url": "https://www.wikihow.com/Attract-a-Tomboy",
  "title": "How to Attract a Tomboy",
  "steps": [
    {
      "title": "Be friendly to your crush.",
      "content": "Be friendly to your crush. If you already go to school, work, or a similar place with your crush, just be kind to her. If you don't know each other, be confident and introduce yourself, that way she knows who you are. Nobody likes a jerk, and that's especially true for tomboys, so avoid insulting her, giving her backhanded compliments, and other common flirting tactics."
    },
    {
      "title": "Join a team or club she's in.",
      "content": "Join a team or club she's in. Many tomboys are members of clubs, teams, or groups focused on a specific activity or pastime. These can range from video game or D&D clubs to football or basketball teams. If you're actually interested in the activity, try becoming a member of the group or participating in a public event the organization hosts. The more engaged you are, the more likely your crush will notice you and be open to friendship. [1] X Research source"
    },
    {
      "title": "Connect with her friend group.",
      "content": "Connect with her friend group. To get closer to your crush, try becoming friends with another person in her social group. If you've already been vetted by someone she knows and trusts, your crush is more likely to accept you and your advances. [2] X Research source"
    },
    {
      "title": "Message her on social media.",
      "content": "Message her on social media. If your crush is naturally shy, try sending her a message on Facebook, Twitter, or another platform. Start by sending her a casual message, then keep it low-key and relaxed until you see how she responds. If she writes back and seems receptive, keep the conversation going. [3] X Research source If you haven't met in person yet, introduce yourself and tell her how you know her. Look through her profile for information on her family and friends, her interests, and things she likes and dislikes."
    },
    {
      "title": "Ask her questions about herself.",
      "content": "Ask her questions about herself. A key part of making a connection is showing that you're interested in the other person. Keep things light at first, asking questions about her everyday life such as: What music does she listen to? Who is her favorite athlete? What does she like to do for fun? Remember that it should be a conversation, not an interrogation, so answer any questions she asks you or build on the things she says."
    },
    {
      "title": "Seek out common interests.",
      "content": "Seek out common interests. Ask your crush about her hobbies or pastimes and take an interest in them. Many tomboys love showing off their skills, so ask to participate in things where she can take the lead. If she's interested in skateboarding, ask her to teach you some tricks. If she plays sports, see if you can shoot some hoops or throw a ball around together. If you haven't tried one of her hobbies, give it a shot. If she loves golf, grab some clubs and hit a few balls. If she loves old movies, ask her for some recommendations. If your crush is an athlete or gamer, try making a bet about whether or not she can do something, like score 3 goals in a row or kill 10 enemies without taking damage."
    },
    {
      "title": "Show off your sense of humor.",
      "content": "Show off your sense of humor. Making someone laugh is a great way to connect with them, and tomboys are typically more open to weird, crude, or off-color jokes than other girls. Try to discover what she finds funny and adjust your humor to match. If she laughs at a pun or loves a rude joke, try using more in the future. [4] X Research source Many tomboys hate drama, so try to avoid making fun of specific people such as classmates or coworkers. Focus more on entertaining than insulting. [5] X Research source"
    },
    {
      "title": "Maintain eye contact during your conversations.",
      "content": "Maintain eye contact during your conversations. Eye contact is one of the most powerful ways to make a connection. Don't check your phone or constantly look around toward other people. Instead, keep your attention focused on her. This is the best way to convey that you're interested in what she's saying, and will help you build a stronger connection. [6] X Research source Eye contact is important, but prolonged staring is intense and off-putting, so glance away every once in awhile."
    },
    {
      "title": "Smile at her.",
      "content": "Smile at her. A genuine smile is one of the easiest ways to show interest in someone and make them feel comfortable. Try to keep the smile as genuine as possible. A forced smile is not attractive and can make her feel uncomfortable. [7] X Research source"
    },
    {
      "title": "Make fun of yourself.",
      "content": "Make fun of yourself. Tell a story about a time you hilariously messed something up, or make a joke about the clothes you're wearing. Most tomboys are not interested in people with giant egos, so laughing at yourself is a great way to bond with your crush and let her know that you can take a joke. [8] X Research source Self-deprecating humor is a great way to break the ice, but don't overdo it. Constantly putting yourself down isn't attractive and she may begin to think you aren't joking."
    },
    {
      "title": "Tease her gently.",
      "content": "Tease her gently. Many tomboys are competitive, so a little good-hearted teasing can bring out your crush's playful side and make her more open to your advances. Try giving her a silly nickname, jokingly disagree with something she said, or goad her about a favorite band, show, or sports team. [9] X Research source Make sure it's clear that you're joking around and not actually insulting or criticizing her."
    },
    {
      "title": "Laugh at her jokes.",
      "content": "Laugh at her jokes. An easy way to show you like someone is by laughing at their jokes, and tomboys are no different. Pay attention when your crush tells a joke and, even if she isn't very funny, give at least a chuckle when the punchline hits. Laughing easily, or for longer than you normally would, can clue her in that you have a crush. [10] X Research source"
    },
    {
      "title": "Notice small changes in her appearance.",
      "content": "Notice small changes in her appearance. While they may not wear frilly dresses or tons or makeup, many tomboys still care about how they look and put a lot of work into it. Look for small changes in her appearance, like a new outfit, hairstyle, or hat, and compliment it. This will show that you're paying attention and will make her feel really good."
    },
    {
      "title": "Lean toward her as you talk.",
      "content": "Lean toward her as you talk. When you're having a conversation, lean in toward her ever so slightly. This draws her attention toward you and helps to show your interest in her. Sharing personal space is a key way to increase romantic and sexual tension, and if she seems receptive, try to break the touch barrier by placing your hand on her arm, shoulder, or leg. [11] X Research source If she is comfortable, she will also start moving into your space."
    },
    {
      "title": "Ask her on a date if you feel a connection.",
      "content": "Ask her on a date if you feel a connection. If you're spending more time together and enjoy each other's company, ask if your crush would be interested in going on a date. Even though she's a tomboy, don't wait for her to pop the question. If she says yes, got to a casual place that fits your personalities, like a movie theater or diner. If she says no, ease up and assess the situation. She may want to just be friends, or she may not be ready for a relationship. [12] X Research source"
    }
  ]
}