{
  "url": "https://www.wikihow.com/Contact-Hermes-(Parcel-Delivery)",
  "title": "How to Contact Evri (UK) and Hermes (DE & AT)",
  "steps": [
    {
      "title": "Call 0330 808 5456 to reach Evri’s customer service center.",
      "content": "Call 0330 808 5456 to reach Evri’s customer service center. Evri doesn’t obviously advertise their customer service number on their website—however, around the holiday season in 2021, they did list 0330 808 5456 as their official number. According to this same press release, customer service agents are available at these times: [1] X Research source Weekdays: 8:30 AM to 4 PM UTC Saturday: 8:30 AM to 2 PM UTC"
    },
    {
      "title": "Senders: Provide a tracking number for a package that was already delivered.",
      "content": "Senders: Provide a tracking number for a package that was already delivered. According to some customers, the Hermes customer service line won’t redirect you to a live agent if you give a current tracking number. With this in mind, dig through some of your past orders that were delivered via Hermes and provide that tracking number instead. With any luck, you’ll get connected with a live agent. [2] X Research source Once you’re on the line with the agent, say something like “I have an additional question about a current order…” or “While I’m on the line with you, would you mind looking into a different package for me?” Ask a friend or loved one for one of their old tracking numbers if you don’t have one on hand."
    },
    {
      "title": "Recipients: Ask the sender/seller to contact Evri.",
      "content": "Recipients: Ask the sender/seller to contact Evri. The delivered tracking number hack only works for the individual who sent the package. [3] X Research source So, if you’re waiting on a parcel, get in touch with the original seller/sender and see if they can call Evri on your behalf (using the tracking number hack to speak with a live agent)."
    },
    {
      "title": "Fill out the digital form on Evri’s international website.",
      "content": "Fill out the digital form on Evri’s international website. Write out your email address on the top line of the form, and select a specific subject category from a drop-down menu. Then, provide your order number, along with specific details on your order issue. Note: The Evri website doesn’t provide an estimate for when the company will process and/or reply to your inquiry."
    },
    {
      "title": "Use Evri’s live chat option for more generic queries.",
      "content": "Use Evri’s live chat option for more generic queries. Open up the chat by clicking on the circular question bubble icon in the bottom right corner of the screen. Type in your question, or use the provided prompts. Depending on your question, the bot might be able to give you some helpful guidance."
    },
    {
      "title": "Evri recommends submitting a complaint through their official channels.",
      "content": "Evri recommends submitting a complaint through their official channels. According to the Evri website, parcel recipients can use the website’s chatbot to get the complaint process going. Senders, on the other hand, can contact Evri via the chatbot or their customer service number. [4] X Research source No phone number or web form is directly provided on the website, though it’s safe to assume that the phone number in question is 0330 808 5456. Answer the chatbot’s questions and see if you’re given a form to fill out."
    },
    {
      "title": "Call an official advice helpline for guidance on what to do next.",
      "content": "Call an official advice helpline for guidance on what to do next. As a UK citizen and product consumer, you have the right to good customer service. If you feel like you’re hitting a dead end, call a helpline to see what your options are: [5] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source England & Wales: Citizens Advice via 0808 223 1133 (or 0808 223 1144 in Welsh) Scotland: Advice Direct Scotland via 0808 164 6000 Northern Ireland: Consumerline via 0300 123 6262"
    },
    {
      "title": "Post in the unofficial Evri Complaints & Advice Facebook group.",
      "content": "Post in the unofficial Evri Complaints & Advice Facebook group . Evri definitely has its fair share of unsatisfied customers—but luckily for you, thousands upon thousands of them have congregated in a Facebook group to let off some steam and provide some advice. Join the public group and post about your situation; even if there’s no real solution, it’ll feel good to air out your frustrations and receive some validation in return."
    },
    {
      "title": "Call Hermes’s German customer service team at 040 593 551 111.",
      "content": "Call Hermes’s German customer service team at 040 593 551 111. The German Hermes site warns that it might take a bit of time to be connected with a live agent, and that you might prefer reaching out using the provided contact form. [6] X Research source"
    },
    {
      "title": "Fill out a contact form so the customer service team can get in touch.",
      "content": "Fill out a contact form so the customer service team can get in touch. Use drop-down menus to describe the specific issue you’re having with a parcel. From there, provide your personal info (including your email and physical address) so the customer service team can reach out. Hermes advises using this form if your package is at least 5 days late. If at least 3 weeks pass and they can’t find your missing package, they’ll provide you with the online paperwork so you can submit a loss report. [7] X Research source"
    },
    {
      "title": "Send the customer service team a message using WhatsApp.",
      "content": "Send the customer service team a message using WhatsApp. Click here to start a WhatsApp conversation regarding your parcel issue."
    },
    {
      "title": "Call the Austrian customer service team at +43 (0) 50 4376-37.",
      "content": "Call the Austrian customer service team at +43 (0) 50 4376-37. [8] X Research source The official website doesn’t provide any business hours, but it’s likely safe to assume that their phone lines are available between traditional office hours (like 9 AM and 4 PM CET). [9] X Research source"
    },
    {
      "title": "Email Hermes’s Austrian customer service team at info@hlg.at.",
      "content": "Email Hermes’s Austrian customer service team at info@hlg.at. Make sure to include your full name, along with your full physical address, email address, and phone number. [10] X Research source"
    }
  ]
}