{
  "url": "https://www.wikihow.com/Cite-an-Article",
  "title": "How to Cite an Article",
  "steps": [
    {
      "title": "Start your Works Cited entry with the author's name.",
      "content": "Start your Works Cited entry with the author's name. List the author's last name first, followed by a comma and a space. Type the author's first name and middle name or initial, if provided. Place a period at the end of the author's name. [1] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Example: Buchman, Dana. If there are 2 authors, separate their names with a comma, typing the word \"and\" before the last author's name. Only invert the first author's name. For example: Martin, Johnathan A., and Christopher Jackson. For 3 or more authors, list the first author's name, followed by a comma and the abbreviation \"et. al.\" For example: Fontela, Pablo, et. al."
    },
    {
      "title": "Provide the title of the article in double quotation marks.",
      "content": "Provide the title of the article in double quotation marks. Type the title of the article in title case, capitalizing the first word along with all nouns, pronouns, verbs, adverbs, and words with more than 4 letters. Place a period at the end of the title, inside the closing quotation marks. [2] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Example: Buchman, Dana. \"A Special Education.\" If the article has a subtitle, type a colon and a space after the title, then type the subtitle in title case. Place a period at the end of the subtitle, inside the closing quotation marks."
    },
    {
      "title": "Include the title of the periodical and date of publication.",
      "content": "Include the title of the periodical and date of publication. Type the title of the periodical in italics, followed by a comma and a space. Type the date of publication in day-month-year format, using a 3-letter abbreviation for all months with names more than 4 letters long. Place a comma after the date. [3] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Example: Buchman, Dana. \"A Special Education.\" Good Housekeeping , Mar. 2006, For scholarly journals, include the volume and issue numbers after the name of the publication. Separate these elements with commas. For example: Bagchi, Alaknanda. \"Conflicting Nationalisms\": The Voice of the Subaltern in Mahasweta Devi's Bashai Tudu .\" Tulsa Studies in Women's Literature , vol. 15, no. 1, 1996, If the article appears in a smaller regional or local publication, type the location in brackets after the title of the publication. For example: Trembacki, Paul. \"Brees Hopes to Win Heisman for Team.\" Purdue Exponent [West Lafayette, IN], 5 Dec. 2000,"
    },
    {
      "title": "List where the article can be found.",
      "content": "List where the article can be found. For print articles, list the page number or page range where the article appears. For online articles, include a URL or DOI. If you use a URL, do not include the \"http://\" portion of the address. Place a period at the end of your citation. [4] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Print example: Buchman, Dana. \"A Special Education.\" Good Housekeeping , Mar. 2006, pp. 143-148. Online example: Trembacki, Paul. \"Brees Hopes to Win Heisman for Team.\" Purdue Exponent [West Lafayette, IN], 5 Dec. 2000, www.purdueexponent.org/sports/article_b6f722b8-9595-58b8-849b-5a8447bbf793.html."
    },
    {
      "title": "Use the author's last name and page number for in-text citations.",
      "content": "Use the author's last name and page number for in-text citations. When you paraphrase or quote from the article, place a parenthetical citation at the end of the sentence, inside the closing punctuation. Include the author's last name only if it wasn't incorporated in your text. [5] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source For example, you might write: \"For a woman who had encountered few obstacles on the road to success, having a daughter with learning disabilities presented challenges and an opportunity to grow as a person (Buchman 147).\" If the source was not paginated, only the author's name is needed. If you incorporated the author's name in the body of your paper and the source is not paginated, you don't need a parenthetical citation."
    },
    {
      "title": "List the author's name and date of publication.",
      "content": "List the author's name and date of publication. Type the author's last name first, followed by a comma. Then type the author's first initial. Add their middle initial, if given. Type a space after the period, then type the date of publication in parentheses. Include the year first, followed by a comma, then the month and day (if provided). Place a period after the closing parentheses. [6] X Research source Example: Will, G. F. (2004, July 5). If there are multiple authors, separate their names with commas. Use an ampersand (&) before the last author's name."
    },
    {
      "title": "Provide the title of the article.",
      "content": "Provide the title of the article. Type the title of the article in sentence case, capitalizing only the first word and any proper nouns in the title. If the article has a subtitle, place a colon after the title and type the subtitle in sentence case. Place a period at the end. [7] X Research source Example: Will, G. F. (2004, July 5). Waging war on Wal-Mart."
    },
    {
      "title": "Include the title of the publication.",
      "content": "Include the title of the publication. Type the title of the publication in italics. If the publication has a volume number, place a comma after the publication's title and add the volume number, also in italics. Place a comma after the volume number and include the issue number. Add a comma for print publications or a period for online publications. [8] X Research source Print example: Will, G. F. (2004, July 5). Waging war on Wal-Mart. Newsweek, 144 , For online-only sources, include the domain extension (such as \".com\" or \".org) in the publication title. If the source also exists in print, leave the domain extension out of the publication title. For example: Romm, J. (2008, February 27). The cold truth about climate change. Salon.com ."
    },
    {
      "title": "Close with page numbers or a URL or DOI.",
      "content": "Close with page numbers or a URL or DOI. For print publications, include the page number or page range where the article appears. If you found the article online, type the words \"Retrieved from,\" then copy the URL or DOI for the article. Place a period after page numbers. Do not place a period at the end of the URL or DOI. [9] X Research source Print example: Will, G. F. (2004, July 5). Waging war on Wal-Mart. Newsweek, 144 , 64. Online example: Romm, J. (2008, February 27). The cold truth about climate change. Salon.com . http://www.salon.com/2008/02/27/global_warming_deniers/"
    },
    {
      "title": "Place author-year parenthetical citations in text.",
      "content": "Place author-year parenthetical citations in text. Generally, place a parenthetical citation at the end of each sentence in which you paraphrase or quote the article. If you included the author's name in your text, place a parenthetical with the year of publication immediately after the author's name. [10] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source For example, you might write: \"Romm (2008) concluded that international reports actually underestimated the threat of climate change.\" If you don't include the author's name in the body of your paper, use a standard parenthetical citation at the end of the sentence, inside the closing punctuation. For example, you might write: \"Many climate change deniers misinterpret scientific consensus as groupthink (Romm, 2008).\""
    },
    {
      "title": "Start your bibliography entry with the author's name.",
      "content": "Start your bibliography entry with the author's name. List the author's last name first, followed by a comma and a space. Then type the author's first name and middle name or initial, if provided. Place a period at the end of the author's name. [11] X Research source Example: Goldman, Jason G."
    },
    {
      "title": "Include the title of the article in double quotation marks.",
      "content": "Include the title of the article in double quotation marks. Type the title in title case, capitalizing the first word and all nouns, pronouns, verbs, and adverbs. Place a period at the end of the title, inside the closing quotation marks. [12] X Research source Example: Goldman, Jason G. \"Lizards Learn a Silly Walk after Losing Their Tail.\" If the article has a subtitle, type a colon and a space after the title, then type the subtitle in title case. Place a period at the end of the subtitle."
    },
    {
      "title": "List the title of the periodical and date of publication.",
      "content": "List the title of the periodical and date of publication. Type the title of the periodical in italics, followed by a comma and a space. Then type the date in month-day-year format. Place a period at the end of the date. Example: Goldman, Jason G. \"Lizards Learn a Silly Walk after Losing Their Tail.\" Scientific American , December 1, 2017. For articles in scholarly journals include the volume and issue numbers, then place the date of publication in parentheses. Place a colon after the date of publication. For example: Bunce, Valerie. \"Rethinking Recent Democratization: Lessons from the Postcommunist Experience.\" World Politics 55, no. 2 (2003):"
    },
    {
      "title": "Close with the page range or URL for the article.",
      "content": "Close with the page range or URL for the article. For print articles, type the page number or page range where the article can be found, followed by a period. If you found the article online, include a full direct URL or DOI for the article, followed by a period. Print example: Bunce, Valerie. \"Rethinking Recent Democratization: Lessons from the Postcommunist Experience.\" World Politics 55, no. 2 (2003): 167-192. Online example: Goldman, Jason G. \"Lizards Learn a Silly Walk after Losing Their Tail.\" Scientific American , December 1, 2017. https://www.scientificamerican.com/article/lizards-learn-a-silly-walk-after-losing-their-tail/."
    },
    {
      "title": "Adjust the format for in-text footnotes.",
      "content": "Adjust the format for in-text footnotes. Place a superscripted number at the end of any sentence in which you paraphrase or quote from the article. The corresponding footnote includes the same information as your bibliography entry. However, the author's name is not inverted and commas are used instead of periods to separate the parts of the citation. [13] X Research source Print example: Valerie Bunce, \"Rethinking Recent Democratization: Lessons from the Postcommunist Experience,\" World Politics 55, no. 2 (2003): 167-192. Online example: Jason G. Goldman, \"Lizards Learn a Silly Walk after Losing Their Tail,\" Scientific American , December 1, 2017, https://www.scientificamerican.com/article/lizards-learn-a-silly-walk-after-losing-their-tail/."
    }
  ]
}