{
  "url": "https://www.wikihow.com/Convince-Your-Parents-to-Let-You-Stay-Home-from-School",
  "title": "How to Convince Your Parents to Let You Stay Home from School",
  "steps": [
    {
      "title": "Ask for permission.",
      "content": "Ask for permission . Don't assume you will always get your way. If you want to stay home from school, whatever the reason may be, ask your parents if it's okay. Find a time when your parents are in a good mood. If you ask them at a bad time, they may not be as open to the idea. If they are ready to leave and you're still asking to stay home, they're likely to say no. Be prepared for them to say no. Unless you have a good reason to stay home, your parents may not want you to skip."
    },
    {
      "title": "Stay calm",
      "content": "Stay calm . If your parents won't let you stay in, don't throw a fit. It won't help your case. It will only prove to them that you are not mature enough to stay home by yourself. If you feel yourself getting angry , take a deep breath. If you have time, you could try asking them again later in the day. Don't call your parents names, or be mean to them. They may have great reasons for wanting you to go to school. If you start yelling at them, you'll just get yourself in trouble."
    },
    {
      "title": "Offer to do some chores.",
      "content": "Offer to do some chores. Try working out a compromise with your parents. They might be a little more open to the idea of letting you stay home if you offer to clean the house. If you're able to do laundry, try offering to wash some clothes. If they let you stay home on the condition that you do some chores, make sure you do them. Don't give your parents any reason not to trust you. It'll be harder to work with them in the future. Making good on your compromise may earn you some stock with your parents. If they see that you're responsible , you might have an easier time working things out with them later on."
    },
    {
      "title": "Be honest.",
      "content": "Be honest . Maybe you aren't sick, but you have some other reason for not wanting to go to school. If you're being bullied, or you're uncomfortable at your school, talk to your parents. Your parents might make you go to school anyway, but they may be able to help you with your problem."
    },
    {
      "title": "Start early.",
      "content": "Start early. If staying home from school isn't a last minute decision, start preparing for your performance. Scream a lot to make your voice raspy, or practice your fake cough . Make sure your parents aren't around while you practice. If they catch on, you'll be going to school. Most people can feel a cold coming on a day or two before it happens. If you can, mention to your parents that you think you're getting sick."
    },
    {
      "title": "Act out the symptoms.",
      "content": "Act out the symptoms. Sneeze and cough, but don't overdo it. Act like you're having a hard time standing up. Keep talking to your family and friends to a minimum. Don't change your mind about what part of your body hurts. If you say you have a headache, stick with it. Try to fall asleep often, especially if you're watching TV. Sick kids tend to fall asleep easily. If you say you're sick one minute, but then get excited about your favorite show, your parents might not believe you. Avoid complaining too much. The trick to acting sick is to not give the impression that you are acting sick. Keep the whining down, and don't make a scene."
    },
    {
      "title": "Pretend you are getting a fever.",
      "content": "Pretend you are getting a fever . A common way to make it seem like you have a fever is to hold a hot water bottle to your head. Another way is to run a thermometer under hot water to raise its temperature. This method requires a little work, as well as trusting parents. Be careful when you fake a fever. If your temperature is too high, you may end up in the emergency room where you will soon be found out. Try to keep the fever right around 100-degrees Fahrenheit. Don't stick the thermometer in the microwave to warm it up. This will only ruin the thermometer."
    },
    {
      "title": "Apply some makeup if you can.",
      "content": "Apply some makeup if you can. This takes quite a bit of skill, but if you can pull it off using makeup will add to your performance. Lighten your skin with some foundation, and make your nose red with a little bit of lipstick. If you don't have your own makeup to use, be careful. If you get caught using mom's makeup, you might be in more trouble than it's worth. When choosing a lipstick to make your nose red, don't use anything metallic or shiny. Just find a basic red lipstick. Don't go too light when making yourself pale . Find something similar to your natural skin tone. Try putting some of the lipstick you used to make your nose red around the corners of your eyes. Be careful not to get lipstick in your eyes, and only use enough to make it look like you've been rubbing them."
    },
    {
      "title": "Spend a lot of time in the bathroom.",
      "content": "Spend a lot of time in the bathroom. When it comes to faking a stomach ache the best thing to do is go to the bathroom. You're not likely to get a lot of questions if you spend a significant amount of time in the restroom. Aside from some general questions, people probably don't want to know what you're doing. Don't groan or make any gross noises. Remember, keep it simple."
    },
    {
      "title": "Make your skin clammy.",
      "content": "Make your skin clammy. Splash cold water on your face to make your skin feel cold. Wet your hair a little, but try to avoid soaking yourself. You just want to give the impression that your skin is cold. When asked, say you feel hot. This will make your parents think you have the cold sweats. You could also try doing some physical activity, such as push-ups or sit-ups . Do just enough to get a small band of sweat going on your forehead."
    },
    {
      "title": "Pretend to be dizzy.",
      "content": "Pretend to be dizzy. A lot of times nausea is accompanied by a general feeling of dizziness. Don't make any sudden movements. Try to stay seated as much as possible. If you have to walk, take your time."
    },
    {
      "title": "Refrain from vomiting.",
      "content": "Refrain from vomiting. When faking nausea, don't make yourself vomit. Say you aren't hungry and that your stomach hurts. Try to eat as little as possible, but whatever you do, do not make yourself throw up. It isn't healthy."
    },
    {
      "title": "Rub your head.",
      "content": "Rub your head. To fake a headache, just rub your head and close your eyes a lot. Lie down on the couch or the floor and keep your hand pressed to your head. When your parents ask what is wrong, mention that your head hurts right behind your eyes. The better you are at describing the pain, the more likely it is they will take you seriously."
    },
    {
      "title": "React to bright lights.",
      "content": "React to bright lights. A lot of the time people with intense headaches can't stand bright lights. If someone opens a window, or you're in a room with a lot of sun, avert your eyes. Complain about the brightness. Don't take this step too far. Light sensitivity is common with migraines, but a general headache may not call for it. Use this tactic at your discretion."
    },
    {
      "title": "Be as lazy as possible.",
      "content": "Be as lazy as possible. If you have a headache, the last thing you want to do is engage in any physical activity. Stay in bed. Go to sleep as early as you possibly can. For an added bonus, keep your room quiet. Turn your television off, and don't listen to music. Few parents will believe their children are choosing to stay in a dark room all day with no entertainment."
    }
  ]
}