{
  "url": "https://www.wikihow.com/Activate-an-AT%26T-SIM-Card",
  "title": "9 Simple Steps to Activate an AT&T SIM Card",
  "steps": [
    {
      "title": "Locate and/or write down your IMEI number.",
      "content": "Locate and/or write down your IMEI number. This is a special code connected to your phone, typically printed and clearly labeled on the packaging. [1] X Research source If you don't have access to this number, you can get it by dialing *#06# on the phone's keypad. If you have a phone that doesn't have a SIM slot, you have to get an eSIM. Go to https://m.att.com/myatt/native/deepLink.html?action=Overview&appInstall=N , sign in, scroll down to \"My devices\" and click Manage device next to the phone you're getting the eSIM for. Click Get new eSIM under \"Options & settings.\" If you don't see the button to get a new eSIM, you already have one that's activated."
    },
    {
      "title": "Locate and/or write down your SIM card number.",
      "content": "Locate and/or write down your SIM card number. This is also known as an ICCID number and is printed on the SIM card next to \"ICCID.\" If you don't see \"ICCID,\" it may be printed next to \"CSN\" or \"EID.\" You can avoid having to try and find this information by going to a local AT&T store and they will take care of the process."
    },
    {
      "title": "Turn off your phone or tablet.",
      "content": "Turn off your phone or tablet. If you've already inserted the new SIM into your device, you can skip this and the next step. [2] X Research source"
    },
    {
      "title": "Transfer a phone number from another provider (optional).",
      "content": "Transfer a phone number from another provider (optional). If you're not transferring a phone number from another mobile provider (e.g., Verizon or T-Mobile), skip this step. If you are transferring a phone number, follow these steps to complete the transfer before you continue: Go to https://www.att.com/checkmyorder/activations/activateDevice.rt in a browser. Enter the phone number you want to transfer and the billing ZIP code. Click Continue . Provide the requested information and follow the on-screen instructions to activate your card."
    },
    {
      "title": "Insert the SIM card.",
      "content": "Insert the SIM card. If you're not sure how to do this on your phone or tablet, visit AT&T's Device Support site in a web browser. Once you're there, select your model, click All Solutions , and then click Insert SIM Card for instructions."
    },
    {
      "title": "Turn on your phone and make a test call.",
      "content": "Turn on your phone and make a test call. You should also try using the mobile internet service without Wi-Fi enabled. If you are able to do these things, your SIM card is active, and you can start setting up your voicemail. If not, continue with this method. [3] X Research source"
    },
    {
      "title": "Go to https://www.att.com/shop/easyactivate/coamoffdevice/deviceinfo.html.",
      "content": "Go to https://www.att.com/shop/easyactivate/coamoffdevice/deviceinfo.html . This opens the SIM card activation site."
    },
    {
      "title": "Enter the SIM and IMEI numbers and click Continue.",
      "content": "Enter the SIM and IMEI numbers and click Continue . The site will check your information and display instructions for your service and device."
    },
    {
      "title": "Follow the on-screen instructions to activate the card.",
      "content": "Follow the on-screen instructions to activate the card. Once the SIM is active, you'll be able to place phone calls and use the internet. If you're unable to activate the card online, you can give AT&T a call from a working phone or visit an authorized AT&T store during regular business hours. AT&T support is available 24/7. If you're in the US, dial 1-800-331-0500. If you're outside of the US, dial 1-314-925-6925. [4] X Research source When you try to activate your device with a carrier, you plug in your SIM card. It automatically syncs with your carrier. But sometimes there are apps, so the carrier might ask you for what SIM card you have. And instead of you using a tool to eject it, they'll show up as ICC ID settings. You can find the ICC ID number within Settings by tapping on General > About . If you scroll down, you can see it."
    }
  ]
}