{
  "url": "https://www.wikihow.com/Car-Shakes-at-Idle-but-Smooths-Out-While-Driving",
  "title": "Car Rattling and Shaking while Idling: Causes & Fixes",
  "steps": [
    {
      "title": "A little bit of slight vibration is no big deal.",
      "content": "A little bit of slight vibration is no big deal. It’s pretty normal for most gas-powered vehicles to have a little light vibration when you’re at idle or stopped. It could be that the ground isn’t perfectly flat or the passive vibration from your engine is causing the sensation you’re feeling. If you have zero other symptoms and the vibration isn’t particularly extreme, it’s probably nothing. The older a car is, the more likely it is to have a little wear and tear that make the rattling noticeable."
    },
    {
      "title": "It’s worth investigating if it’s serious or you have other symptoms.",
      "content": "It’s worth investigating if it’s serious or you have other symptoms. If the shaking is so extreme that you can feel it moving the steering wheel, you hear strange sounds, or you’ve got other issues with your vehicle, it’s probably a sign that something needs to be fixed. It could be something small, like a loose cable, or something more problematic. Other issues to look out for include a check engine light , bad fuel mileage, strange odors, a stalled engine, misfires, smoke coming out of the exhaust, overheating, or a battery that dies. The fact that your vehicle smooths out when you’re accelerating is good news—it means that the engine itself is functioning okay, which is always the big worry with any car issue."
    },
    {
      "title": "Loose or missing gas cap",
      "content": "Loose or missing gas cap If your check engine light is on and it turns off when you replace or tighten your gas cap, this was likely the source of your woes. A loose or missing gas cap will allow air to get into your fuel lines. This air can cause your engine to shake a bit when you’re idling. [1] X Research source You may also notice an ambient gas odor coming from your vehicle if the gas cap is loose or missing. This issue isn’t immediately dangerous per se, but it isn’t environmentally friendly and can lead to wear and tear on your engine. Fix this one by tightening your gas cap or purchasing a replacement for your make and model."
    },
    {
      "title": "Loose battery cables",
      "content": "Loose battery cables If one of your battery cables is slightly disconnected from the terminal, your vehicle may not be getting the charge it needs to operate efficiently. You may also notice your vehicle cranks longer when it’s starting, or your headlights flicker at seemingly random times. Excessive rust and buildup on one of the terminals could also lead to these symptoms. This is usually no big deal so long as you fix the cable relatively soon. With the engine cold, jiggle the cables to see if either are loose. Reattach the cables to see if the vibration goes away."
    },
    {
      "title": "Loose or broken engine mount",
      "content": "Loose or broken engine mount The engine mount is the frame that holds your engine in position. It’s designed to absorb the natural vibrations when your engine runs, so if it’s damaged or starting to fail, it can cause your vehicle to shake violently. [2] X Research source A bad mount will put a lot of strain on the other parts of your vehicle. This can lead to serious damage in your engine bay over time. To check your engine mount for damage, slide under the vehicle. If the components are uneven and it looks like something is “pushing down” your mount is likely damaged. This is not a DIY repair. The mount needs to be reassembled and reinforced by a professional."
    },
    {
      "title": "Bad spark plugs",
      "content": "Bad spark plugs If you hear rattling noises and notice the RPM needle going crazy when you’re idling then the engine shaking is likely a sign your spark plugs are failing. The spark plugs are responsible for providing the ignition your engine needs to combust the gas, so if one of them fails, your engine is going to react violently. [3] X Research source You’re probably also going to notice slow acceleration, engine misfires , and weird knocking sounds coming from your engine if the spark plugs are no good. Bad spark plugs can put a lot of strain on your engine and cause it to become flooded with gas, so this isn’t a repair you want to wait on. You can clean or change your spark plugs if you’re an amateur mechanic, but this is a tough DIY job if you aren’t used to working on cars. You typically must bleed the fuel line, remove the fuel rail, and open the intake manifold to even access the plugs."
    },
    {
      "title": "Worn throttle body or sensor",
      "content": "Worn throttle body or sensor The throttle body is a small housing that connects to your fuel line and engine. It’s responsible for controlling how much air enters your engine to regulate combustion in your engine. If the sensors on the throttle body are faulty or it’s simply damaged, your engine’s idle speed won’t feel correct and you’re likely going to have some shaking. [4] X Research source You’ll likely see a check engine light on if your throttle sensor is bad. You will likely also notice your vehicle isn’t going as fast as it’s supposed to when you accelerate. Inside the throttle sensor there’s an idle air control (IAC) valve. This part specifically is often the culprit, especially if your car backfires or dies after driving a while. [5] X Research source This can cause permanent damage to your engine over time, so this isn’t a repair you want to hold off on. Take your car to a shop for a mechanic to replace your throttle body."
    },
    {
      "title": "Damaged or slipped belt",
      "content": "Damaged or slipped belt The serpentine belt in your engine bay is responsible for powering all kinds of pumps, steering lines, fans, etc. It’s powered by your engine, so if the belt is misaligned and slightly off track, it can cause a vibrating feeling in the steering wheel. You may also notice other electrical problems or difficulty accelerating in addition to rattling at idle. [6] X Research source Your timing chain, which synchronizes the rotation of the crankshaft and camshaft via your timing belt may also be the culprit here. [7] X Research source If the belt is completely off track, you won’t be able to steer without using a ton of effort and you’ll have no acceleration. Replace your serpentine belt with a matching belt. Run it through the loops, hooks, and gears it’s supposed to be attached to per your manual. Loosen the tensioner with a breaker bar then tighten it once it’s aligned and on track."
    },
    {
      "title": "Catalytic converter problems",
      "content": "Catalytic converter problems Your catalytic converter basically filters out dangerous chemicals and toxins that come out of your exhaust. If it’s not filtering the exhaust properly, it can cause buildups that make your vehicle rattle at idle. You may also notice that your vehicle makes a tinny clattering noise when you’re at idle as well. Your vehicle won’t pass an admissions test if your catalytic converter doesn’t work. You can drive just fine, but you’ll experience poor fuel mileage. This is not a DIY job; you’ll need to purchase a replacement catalytic converter and have a professional install it for you."
    },
    {
      "title": "It’s probably not dangerous, but it’s worth checking out soon.",
      "content": "It’s probably not dangerous, but it’s worth checking out soon. With the exception of a serpentine belt snapping due to misalignment, you should be able to drive it to the mechanic or take a few short trips. Most of the potential issues here are going to cause damage to your engine over an extended period of time, but you’re probably not in any danger in the short term. Just don’t put this repair off for too long. If you do end up doing serious damage to your engine, the repairs can be extremely costly. It is highly advised that you don’t continue driving if your check engine light is also on and/or you’re experiencing trouble accelerating or steering."
    }
  ]
}