{
  "url": "https://www.wikihow.com/Add-Fade-in-iMovie",
  "title": "How to Add Fade in iMovie",
  "steps": [
    {
      "title": "Open iMovie.",
      "content": "Open iMovie. Tap the purple icon with a white star and a video camera on it."
    },
    {
      "title": "Select a project.",
      "content": "Select a project. Tap the Projects tab at the top of the screen, then tap a project that you want to open."
    },
    {
      "title": "Select a transition icon.",
      "content": "Select a transition icon. Tap one of the |►◄| icons in between two clips. A pop-up menu will appear."
    },
    {
      "title": "Tap Fade.",
      "content": "Tap Fade . Doing so will place a fade-out transition on the end of the left clip, and a fade-in transition on the right clip. Repeat this step for any other transition icons that you want to change."
    },
    {
      "title": "Tap Settings .",
      "content": "Tap Settings . It's in the bottom-right corner of the screen. Doing so prompts a pop-up menu to appear. If you don't see this option, tap a clip, then swipe right or left."
    },
    {
      "title": "Tap the \"Fade in from Black\" switch .",
      "content": "Tap the \"Fade in from Black\" switch . The switch will turn on . Doing so adds the black fade-in effect to the beginning of your project."
    },
    {
      "title": "Tap the \"Fade out to black\" switch .",
      "content": "Tap the \"Fade out to black\" switch . The switch will turn on . This will add the black fade-out effect to the end of your project."
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . It's in the top-right corner of the screen. Doing so saves your settings and applies the black fade-in and/or fade-out effects."
    },
    {
      "title": "Open your Mac's iMovie.",
      "content": "Open your Mac's iMovie. Click the purple star and movie camera icon in your Mac's Dock, or open Spotlight , type in imovie , and click iMovie ."
    },
    {
      "title": "Select a project.",
      "content": "Select a project. Click the Projects tab at the top of the window, then click a project to which you want to add the fade in/out effect. If you don't have any existing projects, click Create New in the upper-left corner and then add the video clip(s) that you need before continuing."
    },
    {
      "title": "Move a clip into the editing area.",
      "content": "Move a clip into the editing area. Click and drag the part of your project to which you want to add fade in/out into the lower half of the iMovie window, then drop it there. You should see a preview of the clip appear on the right side of the iMovie window. If you want to add multiple clips at once, first hold down ⌘ Command and click each clip that you want to move to select them. You can then click and drag one selected clip to drag all of them to the editing area."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . It's on the right side of the window, just below the preview of your clip. A drop-down menu will appear."
    },
    {
      "title": "Check the \"Fade in from Black\" box.",
      "content": "Check the \"Fade in from Black\" box. You'll see this box in the drop-down menu. Checking it adds a black fade-in effect at the beginning of your clip."
    },
    {
      "title": "Check the \"Fade out to Black\" box.",
      "content": "Check the \"Fade out to Black\" box. It's below the \"Fade in from Black\" box. Checking this adds a black fade-out effect at the end of your clip."
    },
    {
      "title": "Add the fade in or out to other clips in your project.",
      "content": "Add the fade in or out to other clips in your project. Depending on how many clips you have in your project, you may have to add fade-in and/or fade-out to several different sections."
    }
  ]
}