{
  "url": "https://www.wikihow.com/Behave-Yourself",
  "title": "How to Behave Yourself",
  "steps": [
    {
      "title": "Be mindful of your noise level at all times.",
      "content": "Be mindful of your noise level at all times. Controlling your noise level is the biggest part of behaving. If you are having trouble maintaining an appropriate volume, stop and take a deep breath when you feel yourself getting louder. Collect your thoughts and convey what you want to say in a respectful and reserved manner. Pay attention to your noise level and you can better control it. [1] X Research source Try to limit what you're saying to who you're saying it to. You rarely have to say something to an entire group. Know who you're talking to, and speak with a voice loud enough that they can hear you. Ask yourself if you really have to say something before you say it. If it's not necessary to the conversation, don't say it. Practice this technique regularly. Listen to how loud the people around you are. Match their sound level. If people are staring at you or reacting negatively, adjust your behavior. You should aim to fit in with whatever room you're in. Don't draw unnecessary attention to yourself. If you try to dominate a room, you'll usually end up rubbing people the wrong way. Reader Poll: We asked 431 wikiHow readers which rude behavior they think they need to work on most, and 57% of them said speaking in an inappropriate tone or volume. [Take Poll]"
    },
    {
      "title": "Practice self-control in all aspects of your life by setting goals and sticking to them.",
      "content": "Practice self-control in all aspects of your life by setting goals and sticking to them. Make your goals specific and long-term. Psychology studies have shown that abstract, big-picture thinking leads to self-control. Instead of focusing on the moment, look toward bigger goals like success in school or sports. Focusing on the future will help you behave in the present. [2] X Research source Being goal-oriented will teach you the art of self-denial. If you get the desire for a soda or to slack off and play video games, deny yourself. Start with small goals like denying yourself ice cream on weekdays. Move up to harder goals like making the starting basketball team. Stick with your goals and soon enough you'll be in total control of your thoughts and actions. Write down you goals and hang them up where you can see them regularly. Remind yourself of your goals regularly. Make behavioral goals too. Commit to behaving yourself in public and not having any unintended outbursts. Keep your goals positive. Get straight A's, keep practicing guitar until you're comfortable enough to play a gig, or exercise four times a week. Stick to your goals religiously. Make sure your goals are specific. Vague goals are much easier to forget about. When you are tempted to break a promise or a goal, take a deep breath and think about why you set the goal in the first place. That long term commitment is more important than your momentary impulse. Try setting up a punishment and reward system for yourself. If you go a week sticking to a strict diet, give yourself a \"cheat day.\" Likewise, if you decide to skip a workout, make up for it by working out twice as long the next day. Practices like these will lead to control over your desires and actions. Make specific long-term goals with specific short-term ways to achieve them."
    },
    {
      "title": "Pay careful attention to rules and social norms, and restrain yourself when you get the urge to break them.",
      "content": "Pay careful attention to rules and social norms, and restrain yourself when you get the urge to break them. Part 2 has more specific information on this, but generally speaking, be conscious of the rules in any social situation. Keep them in the back of your head. Whenever you start to break one, practice self control. Take a deep breath and remember that you have the strength and self-control to stop yourself. [3] X Research source Make a mental list of the rules of any social situation. Take note of all the rules before you even say anything. If the rules are unclear, be passive and see how other people are acting. Aim to mimic their behavior. If the atmosphere is appropriate for lewd humor and loud talking, you would not be misbehaving by joining in. If the atmosphere is more professional, conduct yourself formally. If the atmosphere is relaxed, let go more but still watch your noise level. Calming techniques like deep breathing usually work best for self-control, but find what works best for you. Maybe if you're about to break a rule, you can snap your fingers or pinch yourself. Whatever it is, have a method to stop yourself when you get the urge to break a rule."
    },
    {
      "title": "Be careful with your language.",
      "content": "Be careful with your language. Suit your words to the situation, and choose those words carefully. In most situations, cursing and loud bickering is inappropriate. Avoid pointless arguments and critical statements. Generally speaking, if you don't have something nice to say, don't say it. If you find yourself starting to say something mean or inappropriate, stop yourself before it's too late. If you can't stop yourself, be sure to apologize after. [4] X Research source More relaxed or even crude language is sometimes appropriate if you're with close friends. Be sure you know the situation before you start talking though. Around coworkers, teachers, or bosses, be very careful with your language. Be humble and understanding, and never curse or start fights. Compliments and kind words are always appreciated. If you find yourself wanting to say something mean, write it down instead. Just don't let anybody see what you write! Don't interrupt people. Let them finish what they're saying before you speak. Think before you speak. Thoughtless words can get you into trouble. Get in the habit of asking yourself if you're sure you want to say something before you say it."
    },
    {
      "title": "Behave yourself at school by following the teacher's instructions and focusing on your schoolwork.",
      "content": "Behave yourself at school by following the teacher's instructions and focusing on your schoolwork. Take the self-control tactics you've learned and apply them to school. Set school-related goals for yourself and remember that those goals are the most important thing about school. Your school goals should probably revolve around getting good grades and following your teacher's rules. Remember to follow smaller class rules like no gum, no hats, being quiet when the teacher is talking etc... All the rules are important. If you get the urge to break one, practice self-control. Pay attention to the teacher. Listen carefully and take notes. Don't talk over the teacher or any other students. Wait your turn, and always raise your hand unless you're in a small group or outside the classroom. Come prepared for class. Have your homework done, all the handouts with you, and a notebook and binder. Join in class discussions. Keep yourself from getting bored by engaging in the class material. Ask questions and respond to other students. Make friends with good students. Your friends should be a positive influence on you, they shouldn't get you into trouble. Don't sit near any friends that do get you in trouble. Always be on time. If behavioral issues persist, talk to your parents, your teacher, and your school counselor. It's possible you have some form of Attention Deficit Disorder, or you just need extra help adjusting."
    },
    {
      "title": "Behave yourself at dinner by practicing proper table manners.",
      "content": "Behave yourself at dinner by practicing proper table manners. Be polite and engage in pleasant conversation. Don't make a mess when you eat, and always use a napkin. [5] X Research source Always say thank you. If you're going out to dinner, thank your servers and if someone else pays, be sure to say thank you. Don't reach over people for food. Ask them to pass the food instead. Don't use your hands unless it's finger food. Use your fork and knife properly. Don't cut too hard, and use the utensils to bring the food to you rather than the other way around. Have your napkin on your lap at all times. Use it frequently to clean food from your mouth. Offer to pour drinks and serve food to other people. At the end of the meal, offer to help clean up. If you're dining out, remember to tip 15 percent of the total bill."
    },
    {
      "title": "Behave yourself at work by having the right attitude.",
      "content": "Behave yourself at work by having the right attitude. Commit to your work goals, and act professionally at all times. The workplace is usually not the time to make jokes and goof off. You need to be focused and productive. Get to work with the right mindset and your behavior will follow. [6] X Research source Get to work early. Aim to arrive 15-20 minutes before you're supposed to get there. Have a clean workspace, and keep communal areas clean and organized. Respect your boss and coworkers. Don't talk about people behind their backs. Be attentive and take notes during meetings. Avoid having too much idle small talk throughout the day. Take initiative and do extra work. Focus on your work. The only time you wouldn't be behaving is when you're distracted and doing something to fill the time. Fill your day with work, punctuated by several breaks. Use breaks to let off steam. Chat with coworkers, go on Facebook, go for a walk and stretch your legs. When it's time to get back to work, regain your focus."
    },
    {
      "title": "Dress appropriately for the occasion.",
      "content": "Dress appropriately for the occasion. Your behavior isn't just your actions, it's your overall presence. Make sure you dress for the part. [7] X Research source For school, dress casual. For work or a formal event like a wedding, wear a suit or fancy dress. For a job interview or dinner, wear a collared shirt or nice blouse. Excessively revealing clothing is better suited for the beach or home. Err on the side of modesty when dressing for public. Avoid clothes with offensive sayings or images. Make sure to maintain personal hygiene. Shower and brush your teeth every day and wear deodorant or perfume."
    },
    {
      "title": "Practice relaxation techniques.",
      "content": "Practice relaxation techniques. A stress-free lifestyle makes you feel more in control of your life and your actions. When you're stressed or depressed, you're much more likely to feel like you're acting on autopilot. Most misbehavior comes from that loss of self-control. You should use relaxation techniques regularly and whenever you feel like you're losing control of a situation. [8] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Learn yoga. Yoga is a great way to reduce stress and promote a healthier mindset. Start your day with yoga, and do yoga when you start to feel yourself losing control. Meditate. Meditation has long been an effective and easy way to relax. Practice breathing through your nose. Focus on your breath and feel the world slip away. You can do this any time. Take plenty of breaks throughout the day. Relaxation is key to maintaining self-control. If you're working all day, your mind won't have time to settle. Give yourself alone time or do an activity you enjoy."
    },
    {
      "title": "Get to know yourself better.",
      "content": "Get to know yourself better. Learn your strengths and weaknesses. Specifically, learn when you are most likely to misbehave. Use that information to stop your misbehavior before it happens. Don't let yourself into situations where you misbehave, or find ways to stop your misbehavior. [9] X Expert Source Sandra Possing Life Coach Expert Interview. 15 July 2020. The more you know about yourself, the better equipped you are to control yourself. A great way to learn about yourself is through writing. Make lists of your strengths and weaknesses. Be honest with yourself. When are you most in control and when are you least in control? When do you misbehave the most? What are the circumstances when you misbehave? Are you sad, stressed, hungry, or sleep-deprived? Once you find a pattern to your behavior, use that information and change your lifestyle to improve your behavior. Another great way to learn about yourself is through meditation. Find a quiet place and just sit and focus on your breathing. After a while, you'll feel everything slip away. What's left is your self. Ask yourself questions and answer honestly. Ask your friends and family what they see about you. Ask them how they think you could improve your behavior, and where they think any outbursts come from. Remember that they're there to help you. Just letting them know you want to improve can go a long way. Take an online personality test. Though these aren't always accurate, they can help you realize things you already know about yourself. Go to a therapist, behavioral specialist, or school counselor. Even if you're doing better, this can be immensely helpful in learning about yourself and how to behave yourself. Use what you learn about yourself to improve your behavior. If you tend to misbehave when you're bored in class, practice engaging more with the material. Take notes and commit to learning the material, and you'll enjoy yourself more in class. If you tend to misbehave when you're in a stressful situation, work on stress management."
    },
    {
      "title": "Exercise regularly to boost your self-control.",
      "content": "Exercise regularly to boost your self-control. Science has shown even a short workout can dramatically improve your self-control. A short, intense workout results in increased blood flow and oxygen to the pre-frontal cortex which is responsible for self-control. Moreover, making and committing to a long-term exercise program is a great way to practice self-control. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Aim to exercise at least four times a week. You don't have to go to the gym to workout. Playing frisbee with friends or going for a bike ride can be both therapeutic and rewarding. Try to get some physical activity every day. Walking or riding your bike instead of driving is a great way to work in physical activity to your daily routine."
    },
    {
      "title": "Get a full night's sleep.",
      "content": "Get a full night's sleep. Doctors recommend seven to nine hours of sleep every night. Get on a healthy sleep schedule and stick to it. Studies show that sleep deprivation draining your pre-frontal cortex of glucose which fuel self-control. When you're sleeping your body replenishes glucose levels. Without enough sleep, your body may not physically be equipped for self-control. [11] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Sleep improves all areas of health, not just self-control. Correcting your sleeping habits leads to improved mood, mental health, and physical fitness. Be careful about oversleeping. When you sleep more than ten hours, you lose the benefits of sleep."
    },
    {
      "title": "Avoid drugs and alcohol.",
      "content": "Avoid drugs and alcohol. Foreign substances can lead to abuse and dependency. This loss of self-control is the epitome of misbehavior. Moreover, drugs and alcohol impair your decision-making faculties, making you lose control further. [12] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source If you already use drugs and alcohol, work on quitting. Seek help from family, friends, and specialists. Alcohol can be acceptable in small amounts if you're over the legal drinking age and capable of drinking lightly without running the risk of intoxication or dependence. For example, if you know you can safely drink a glass of wine during a holiday meal or a couple of beers during your monthly friends' night out, that's typically okay. However, if you're a recovering alcoholic or under the legal drinking age, you should abstain from even this amount."
    },
    {
      "title": "Eat a diet rich in glucose.",
      "content": "Eat a diet rich in glucose. Studies show that glucose is the key to self-control. Acts of self-control use up glucose stores, and when you're low on glucose, you won't be able to control your behavior as effectively. Periodically replenish your body's store of glucose throughout the day. [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Lemonade or lemon water is a great source of glucose and hydration. Fresh and dried fruits are packed with glucose. Strawberries and kiwi are particularly loaded with glucose. Honey and fruit juice also have a ton of glucose. Grains, beans, nuts, and almost all vegetables have glucose too."
    }
  ]
}