{
  "url": "https://www.wikihow.com/Care-for-a-Baby-Wild-Rabbit",
  "title": "Caring for an Orphaned or Wounded Bunny: A Complete Guide",
  "steps": [
    {
      "title": "Make a nest out of a wooden or plastic box for baby bunnies.",
      "content": "Make a nest out of a wooden or plastic box for baby bunnies. If you’ve encountered a wounded or orphaned bunny, give them a warm and safe place to stay. Line a box with pesticide-free soil and a layer of dried hay. Create a ring or nest-like shape in the center of the box for the bunny to curl up in. [1] X Research source If you don’t have soil or hay on hand, some soft towels, tissues, or thread-free blankets will do."
    },
    {
      "title": "Put the box on top of a heating pad or near a heat lamp.",
      "content": "Put the box on top of a heating pad or near a heat lamp. Newborn baby rabbits need to stay in a 100 °F (38 °C) environment for the first 2 weeks of their life. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source So, to keep them nice and toasty, put their nest on top of a temperature-controlled heating pad or under a heat lamp . Attach a thermometer to the box to ensure it stays near the preferred temperature. Keep an area of the nest away from the heating pad or lamp. This way, the bunnies can crawl toward a cooler space if they get too hot. [3] X Research source As the bunny grows, lower the environment’s temperature by 3 to 5 degrees each day until it reaches room temperature."
    },
    {
      "title": "Place the newborn bunnies gently inside the nest.",
      "content": "Place the newborn bunnies gently inside the nest. Handle the small rabbits with care while wearing gloves (this is to protect you and them from germs). Lay the bunnies one by one into the nest you’ve made them. If you’ve only rescued one bunny, make sure they’re surrounded by plenty of tissues, hay, or blankets to keep warm. Handle the bunnies as little as possible, so they can acclimate to their new space and stay calm."
    },
    {
      "title": "Cover the box with a screen to keep the bunnies safe.",
      "content": "Cover the box with a screen to keep the bunnies safe. If the bunnies can walk, a screen protects them from jumping out of the box. If you have other pets, the screen acts as a barrier to curious dogs or cats. Use a window screen, chicken wire, or a plastic lid with small breathing holes."
    },
    {
      "title": "Add stimulating toys and items to the box if the rabbit is fully grown.",
      "content": "Add stimulating toys and items to the box if the rabbit is fully grown. Unlike newborn bunnies, rabbits are curious and energetic. Dropping in a few things they can chew can help occupy their time. Toss in an empty toilet paper roll, extra hay, or a few chunks of carrots. If you have rabbits as pets already, consider offering the wild rabbit a new toy or treat your rabbits haven’t yet touched."
    },
    {
      "title": "Feed baby rabbits goat milk formula for up to 6 weeks.",
      "content": "Feed baby rabbits goat milk formula for up to 6 weeks. Mother rabbits feed their babies at dusk and dawn for about 5 minutes. Depending on the bunny’s age and size, you may have to feed them more or less. Fill a 2.5 cc syringe with lukewarm formula and proceed to feed the bunny . [4] X Research source Mix the formula to be 3 parts formula and 4 parts distilled water to replicate the thickness of the mother’s milk. Formula isn’t as nutrient-rich as a mother rabbit’s milk, but it’s a good alternative for orphaned rabbits. Contact a veterinarian if you’re concerned about a bunny not getting enough nutrients. Kitten Milk Replacer is a great alternative to goat milk formula. Never use cow’s milk or human milk replacers to feed a baby rabbit, as this could upset or damage their digestion. [5] X Research source"
    },
    {
      "title": "Wrap the bunny in a cloth and hold them upright.",
      "content": "Wrap the bunny in a cloth and hold them upright. Gently fold the bunny in a washcloth or blanket and place them in your palm. Make sure their tiny head is peeking out of the cloth. [6] X Research source Feed the bunny in the same place each time, as they’ll begin associating the location with food."
    },
    {
      "title": "Put the filled syringe up to their mouth.",
      "content": "Put the filled syringe up to their mouth. Learning to feed from a dropper or syringe takes practice, so be patient with your little friend—they’ll get the hang of it! Just keep the syringe at their lips until they open their mouth. [7] X Research source Try squeezing out a tiny amount of formula to place on their mouth so they know food is near."
    },
    {
      "title": "Squeeze the formula into their mouth slowly.",
      "content": "Squeeze the formula into their mouth slowly. Gently wiggle the syringe under their upper lip and into their mouth. Give the newborn bunny the formula one drop at a time. If they spit out the formula, you may be feeding them too fast. [8] X Research source Watch to make sure the bunny swallows in between each drop."
    },
    {
      "title": "Rub the bunny’s bottom to stimulate its bowels.",
      "content": "Rub the bunny’s bottom to stimulate its bowels. In the wild, a mother rabbit licks a bunny to help them go to the bathroom. You can replicate this behavior by gently stroking the bunny’s bottom with a cotton swab or damp paper towel after each feeding. [9] X Research source"
    },
    {
      "title": "Stick to a feeding schedule to avoid overfeeding a baby rabbit.",
      "content": "Stick to a feeding schedule to avoid overfeeding a baby rabbit. Bloat and diarrhea are common symptoms of overfeeding and can result in rabbit death. How much and often you feed a wild rabbit depends on their age. Here’s a guide to help: Newborn to 1 week (closed eyes and 2 to 3 inches (5.1 to 7.6 cm) long) : 2 to 2.5 cc/mL 1 to 2 weeks (eyes open and starting to stand) : 5 to 7 cc/mL 2 to 3 weeks (starting to look fluffy and 4 to 5 inches (10 to 13 cm) long) : 7 to 13 cc/mL 3 to 6 weeks (eyes and ears alert and can walk) : 13 to 15 cc/mL At 3 weeks old, baby bunnies can be introduced to grasses, fruits, and vegetables. A baby bunny’s belly should be small and round after feeding, and it’s usually time for another feeding when the belly is no longer round."
    },
    {
      "title": "Offer grown rabbits a mixture of vegetables and fruit.",
      "content": "Offer grown rabbits a mixture of vegetables and fruit. Once the wild rabbit is weaned off formula, they can start eating whole foods . Diversifying their diet gives them more nutrients and helps them get ready for their life back in the wild. Offer the rabbit some of these rabbit-friendly foods and see what they enjoy: [10] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Spinach Mustard greens Parsley Carrots Squash Potatoes Bananas Berries Apples"
    },
    {
      "title": "Provide plenty of grass and hay for the rabbit to nibble on.",
      "content": "Provide plenty of grass and hay for the rabbit to nibble on. Green foods are a wild rabbit’s best friend! Finding leafy lettuce in the wild can be hard, so most wild rabbits spend their time chewing on grasses. Head into your backyard and look for plants such as: [11] X Research source Timothy grass Orchard grass Meadow fescue Marigold flowers Clover Fireweed"
    },
    {
      "title": "Give a rabbit a dish full of clean water.",
      "content": "Give a rabbit a dish full of clean water. Always make sure the wild rabbit has enough fresh water. Simply fill a shallow dish with clean water and keep an eye on it throughout the day, refilling it whenever it gets dirty or empty. [12] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source On average, rabbits drink about 2 to 3 times more water than the food they eat per day. [13] X Research source"
    },
    {
      "title": "Wean the rabbit off of formula.",
      "content": "Wean the rabbit off of formula. A rabbit must be able to eat and find food on their own before you release them back into the wild. Typically, rabbits can be introduced to their natural habitat as early as 3 weeks old, as long as they are eating full meals of whole foods (grass, vegetables, fruit, etc.). [14] X Research source If the rabbit is still drinking formula, try introducing more whole foods, as long as they’re 3 weeks old or older. Bring in more grass from outside for the rabbit to eat—just make sure the area you pulled it from is free of pesticides."
    },
    {
      "title": "Stop handling the rabbit.",
      "content": "Stop handling the rabbit. Help the rabbit prepare for their return to the wild by touching them as little as possible. This way, they can get used to grooming and feeding themselves again and become less dependent on you."
    },
    {
      "title": "Move the rabbit outside full-time.",
      "content": "Move the rabbit outside full-time. If you’ve raised an orphaned bunny indoors, bring their enclosure outside once they’re 6 weeks old. They’re now fully grown, able to eat whole foods, and hop around. Give them a wired hutch with a place to graze so they can acclimate to their future environment. Build your own rabbit hutch or purchase one premade at a local pet or farm supply store. Continue to give the rabbit plenty of food, water, and other toys. Consider moving the rabbit to a larger hutch as they grow or expand the outdoor grazing area."
    },
    {
      "title": "Release the rabbit into the wild when they’re 6 to 8 weeks old.",
      "content": "Release the rabbit into the wild when they’re 6 to 8 weeks old. A rabbit is fully grown and ready to take on its natural habitat at this stage. Search for a location with plenty of grass, hiding places, and a water source. Opt to release the rabbit in the late afternoon near some undergrowth. This way, they’ll have plenty of time to find a new home before dusk. [15] X Research source"
    }
  ]
}