{
  "url": "https://www.wikihow.com/Build-Strength-Gradually",
  "title": "How to Build Strength Gradually",
  "steps": [
    {
      "title": "Choose the appropriate weight.",
      "content": "Choose the appropriate weight. When you're just starting out with exercise or you want to build your strength slowly, it's important to choose the appropriate weight. Too much or too little won't help you in the long-term. The ideal weight is one that allows you to do one set of eight to 12 repetitions. Your muscle or muscle group should feel very fatigued at the end of the session. You're not using enough weight if you can easily do more than 12 repetitions at a time. [2] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. [14 May 2020]. You're using too much weight if you find yourself needing to swing your body to use momentum to complete the repetition. If it's time to advance your weight level, do not advance by more than 5% at a time. For example, if you're currently using 20 pound dumbbells for bicep curls, advance to 22 pounds."
    },
    {
      "title": "Include upper body exercises.",
      "content": "Include upper body exercises. Upper body exercises will strengthen multiple muscle groups and joints. This generally includes: arm muscles (like biceps and triceps), shoulder and chest muscles(like deltoids and pectoralis muscles) and back muscles (like erector spinae, rhomboids, or trapezius). To build strength slowly start with one to two sets (eight to 12 reps each) of the following exercises: Bicep curl machine. Chest press. Pec flye. Lat pull down machine. Tricep extension machine. Shoulder press machine. Reader Poll: We asked 590 wikiHow readers what type of exercise they enjoy the most during arm workouts, and 72% said weightlifting. [Take Poll]"
    },
    {
      "title": "Do lower body exercises.",
      "content": "Do lower body exercises. Strengthening your lower back is key to supporting both your legs and your upper body. [3] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. [14 May 2020]. There are a variety of exercises you can do to strengthen your lower back. Include movements that will exercise your major lower body muscle groups like your glutes, hamstrings, quadriceps and calf muscles. Do one to two sets (eight to 12 reps each) of the following exercises: Leg press machine. Leg extension machine. Seated leg curl machine."
    },
    {
      "title": "Work out your core.",
      "content": "Work out your core. The core is another group of muscles that's very important to strengthen. They will help stabilize your body as you progress in your exercise routine. This muscle group includes your abdominal muscles and obliques. Do one to two sets (eight to 12 reps each) of the following exercises: Crunches. Supermans. Bicycle crunches."
    },
    {
      "title": "Include whole body exercises.",
      "content": "Include whole body exercises. Many of these exercises work multiple muscle groups and can be done anywhere with little to no equipment. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Do one to two sets (eight to 12 reps each) of the following exercises: Push-ups Sit-ups or crunches Squats Lunges Planks"
    },
    {
      "title": "Warm up before your workout.",
      "content": "Warm up before your workout. Like many other aspects of safe workouts, it's also important to prep your body for your exercise routine. Warm-ups can help get your body ready to exercise and decrease your risk of injury. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Move your joints through their full range of motion (as long as this isn't painful), getting the blood to flow to the connective tissues and get the synovial joint fluids lubricating the joint. A warm up is generally a slower intensity exercise of what you're planning on doing. A fast walk in preparation for a jog is a great warm-up. These lower intensity exercises help increase your heart rate, bring more blood to your muscles and raise your body temperature. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For strength training warm-ups, you might want to do some low intensity cardio and do some pushups or lifting with very light weights. [7] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. [14 May 2020]."
    },
    {
      "title": "Cool down after your workout.",
      "content": "Cool down after your workout. As with warming up, cooling your body down appropriately is also very important. It won't take long, but definitely include a few minutes of a post workout cool down. Cool downs may help your body regulate blood flow and allow your heart rate and cardiovascular system to slowly return to normal. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source To cool down, continue your exercise at a lower intensity. Walk briskly on a treadmill for five to 10 minutes. Make sure to stretch. Another part of your cool down routine can be light stretching. This may help improve range of motion and flexibility. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Take care of any sore muscles or joints.",
      "content": "Take care of any sore muscles or joints. With any new exercise routine or when you're starting strength training for the first time, you might experience some soreness or pain. It's important to know what's a normal level of soreness and what warrants medical attention. General achiness and soreness is normal; however if you feel sharp pain or the pain increases or doesn't subside for a few days, seek medical attention. If you feel sore, you can ice the joint or muscle three to four times a day. Use an ice pack of a bag of frozen peas to ice the area. [10] X Research source Use a compression sock, clothing or wrap to help control swelling and to provide support. Also keep the joint or muscle elevated if possible as this also helps reduce swelling. [11] X Research source"
    },
    {
      "title": "Clarify your goals.",
      "content": "Clarify your goals. Wanting to build strength will require you to start or change a workout routine. Clarifying exactly what you want to strengthen and why can help you design a more concrete and specific exercise plan. If you're a beginner and haven't exercised before or are looking to do strength training for the first time, setting up goals will be helpful for you. Consider why you want to build strength. Do you just want to get in better shape overall? Do you want to have significant strength gains? Are you looking to build more lean muscle mass? Or are you just looking to tone and tighten up a bit? Once you've decided what you want, write out your goals. Try to be specific and realistic with your goals so you're more likely to see them through. Make sure you are setting a time frame in which to accomplish your goal, as well as a way to measure your progress and know when you've successfully completed it. [12] X Research source An example of a well-thought-out goal would be: \"I want to build upper body strength over the next three months in order to tone my arms and gain some muscle mass. I want the circumference of my biceps to go down by 1/2 inch.\""
    },
    {
      "title": "Set up an exercise plan.",
      "content": "Set up an exercise plan. Once you have your goals written out, you'll be able to write up a detailed exercise plan. This will help you stay on track with your goals. [13] X Research source An exercise plan can be as detailed or as vague as you'd like it. You may want to include what types of exercises you'll be doing, how often you'll exercise, what days of the week and where you plan on exercising. Free weights are a great way to begin. Start with a weight you can manage. This will help build all the stabilizing structures your body will need to progress eventually to heavier weight. There is some disagreement as to whether or not machines or free weights are best for beginners. Machines may make it easier for you to perform the movements, but on the other hand, the inflexibility of the machines means they are good for some body types, but not others. Try out both and figure out what is best for you. You may also want to consider writing in your workouts in a calendar or date book as you would other appointments. [14] X Research source Include at least one to two recovery days each week in your exercise plan. Rest and recovery days are equally as important as the exercises that you do. Always rest between days of strength training and do not work the same muscle group two days in a row. Your muscles require 24–72 hours to recover from a muscle building workout."
    },
    {
      "title": "Review proper form.",
      "content": "Review proper form. If you haven't really done strength training before or it's been awhile, make sure to review proper form for the exercises you plan to do. Here are some basics to keep in mind: Do each repetition or movement slowly. Rapidly going through movements doesn't provide you any benefits - only increases your chance for injury. Do not swing your body and use momentum to get you through a repetition. This may be a sign the weight level is too heavy which can increase your chance of injury. Rest between sets and muscle groups for about 60–90 seconds. Do not cut that short or extend it much longer."
    },
    {
      "title": "Drink enough fluids and eat right for strength training.",
      "content": "Drink enough fluids and eat right for strength training. Eating right and drinking the amount of fluids is important for any type of exercise. This will help fuel you up and help you recover from exercise. Drink at least 64 oz of clear fluids daily; however, with exercise you may need to drink up to 13 glasses. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Try water, flavored water and decaf coffee and tea. If you are also doing a lot of cardio you may want to consider an electrolyte sports drink or water for better hydration. Have a small meal or snack prior to your workout. Simple carbohydrates are easily digested and can provide your body with the immediate fuel to power through your workout. Try a small piece of fruit, an individual yogurt or a small bowl of oatmeal. Refuel and recover from your workout with some protein and carbohydrate. The protein helps your body repair the muscles used during your exercises. Try: Greek yogurt with fruit, a protein shake, a glass of chocolate milk or 2 oz of trail mix."
    }
  ]
}