{
  "url": "https://www.wikihow.com/Call-New-Zealand",
  "title": "How to Call New Zealand",
  "steps": [
    {
      "title": "Consider the time zone.",
      "content": "Consider the time zone. New Zealand's time zone is GMT+12. [1] X Research source This means it runs 12 hours ahead of United Kingdom time, 17 hours ahead of New York, and 2 hours ahead of Sydney. Try to avoid calling in the middle of the night. New Zealand is on GMT+13 instead from the end of September to the beginning of April, due to Daylight Saving Time in the southern hemisphere. [2] X Research source If you're not certain how to calculate the time in New Zealand, look online ."
    },
    {
      "title": "Dial your country's exit code.",
      "content": "Dial your country's exit code. Also called an international access code, this signals the phone line that you're about to dial an international number. Use the exit code for the country where you are currently located, not for your country of origin. Within India, the United Kingdom, and many other countries, the code is 00 . [3] X Research source Try this if you don't want to look up the code or cannot find one for your current location. In the United States and Canada, the code is 011 . In Australia, the code is 0011 . Look up another country's exit codes on this website . If multiple exit codes are listed, you will have to dial the one for your international call carrier, or company who provides your phone's calling plan."
    },
    {
      "title": "Dial 64.",
      "content": "Dial 64. Enter 64, the country code for New Zealand. This is the same no matter where you are calling from."
    },
    {
      "title": "Dial the area code or mobile code for the person you intend to dial, skipping the initial zero.",
      "content": "Dial the area code or mobile code for the person you intend to dial, skipping the initial zero. The area code directs your call to a specific region of New Zealand, or to a specific mobile phone carrier. If the area code you are given begins with a zero, do not enter it; this is the \"trunk code\" used only for calls made within New Zealand. If the phone number you have for your contact is 8 to 10 digits long (not including an initial zero), the area code is already included. Otherwise, look for your contact's location on this list of area codes, or search for their town name and area code online: [4] X Research source For mobile phones, you'll need to know your contact's mobile provider. You may then look up the company's mobile code by clicking this link . 3: Christchurch, Dunedin, Invercargill, Nelson, Timaru, Westport 4: Wellington 6: Napier, Hastings, New Plymouth, Palmerston North 7: Hamilton, Rotorua and Tauranga 9: Auckland and Whangarei"
    },
    {
      "title": "Dial the 7-digit phone number.",
      "content": "Dial the 7-digit phone number. Dial the 7 digit phone number of the contact you're trying to call. If the phone call begins to go through before you've finished dialing, you may have made a mistake. Hang up and try again, or see the troubleshooting section. If the phone number is 8 or more digits long, it may have the area code included. Make sure not to enter the area code twice."
    },
    {
      "title": "If you are using a \"voice over internet\" service, try skipping the exit code.",
      "content": "If you are using a \"voice over internet\" service, try skipping the exit code. Some VoIP services, or voice over internet protocol, allow you to make international calls without including your country's exit code. Try entering the number as described above but without dialing the exit code."
    },
    {
      "title": "Make sure international calls are enabled on your phone plan.",
      "content": "Make sure international calls are enabled on your phone plan. Your phone plan may block international calls. If no international phone calls are going through, you may need to call your company and alter your plan details. Keep in mind that international calls are usually more expensive than local or in-country calls. If you plan to make international calls frequently, you may wish to choose a plan that has a reduced international price rate."
    },
    {
      "title": "Find other methods of contact if a toll free number won't go through.",
      "content": "Find other methods of contact if a toll free number won't go through. Toll free numbers in New Zealand begin with 508 or 800 (0508 or 0800 if dialing within New Zealand). Because these calls are not actually free for international customers, many companies block international calls on their toll free numbers. [5] X Research source Try contacting the company by email, or see if you can find a regular number for them that does not begin with a toll-free code."
    }
  ]
}