{
  "url": "https://www.wikihow.com/Apply-Moisturizer",
  "title": "How to Apply Moisturizer Correctly & Choose the Right Product for Your Skin",
  "steps": [
    {
      "title": "Wash your face with lukewarm water to prepare the skin.",
      "content": "Wash your face with lukewarm water to prepare the skin. Tareen says, “the best time to apply moisturizer is after showering or bathing.” [1] X Expert Source Mohiba Tareen, MD Board Certified Dermatologist Expert Interview. 26 March 2020. Use your fingers to apply a gentle, non-abrasive cleanser onto your skin, then work it into a lather. Rinse thoroughly with lukewarm water and pat your skin dry with a soft towel. [2] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Avoid cleansers that contain alcohol or fragrance. [3] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Applying moisturizer while your skin is still damp helps it absorb better. [4] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Do not wash your face with hot water because it strips the skin of moisture and its natural oils. [5] X Research source"
    },
    {
      "title": "Use a dime- to nickel-sized amount of moisturizer for each application.",
      "content": "Use a dime- to nickel-sized amount of moisturizer for each application. The amount of moisturizer you need depends on your skin and product type. In general, you can apply a nickel-sized amount of a thinner, water-based moisturizer since the skin absorbs it quickly. If you’re using a thicker cream or ointment , a dime-sized dollop should do the trick. Talk to your dermatologist if you’re not sure how much product to apply. [6] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Apply a thicker cream or ointment if you have dry skin. [7] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Day creams are typically thinner, while night creams are thicker. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Use a moisturizer with SPF 30 to protect your face and body during the day. [9] X Research source You can find a rich moisturizer that works for both morning and night here . You can also try using face cream with CBD for a calming effect. Popular brands include CBD American Shaman and Charlotte's Web ."
    },
    {
      "title": "Dot a small amount of the moisturizer on different areas of your face.",
      "content": "Dot a small amount of the moisturizer on different areas of your face. Use clean fingertips to apply small dabs of the moisturizer on dry areas like your forehead, cheeks, nose, and chin. [10] X Research source This helps distribute the product evenly all over your face. Don't forget about your neck! This is especially important when you're applying a daytime moisturizer with SPF, which will help protect these areas from sun damage. [11] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Apply your moisturizer in an upward and outward direction.",
      "content": "Apply your moisturizer in an upward and outward direction. With your fingertips, smooth each dot of moisturizer upwards and outwards using circular motions for a subtle lifting effect. Gently massage your skin to help the moisturizer sink in, and be extra careful around your eye area since the skin is thinner. [12] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Allow the moisturizer to absorb completely before applying makeup or other products."
    },
    {
      "title": "Tap eye cream around your eyes using your ring finger (optional).",
      "content": "Tap eye cream around your eyes using your ring finger (optional). The skin around your eyes is thinner and more sensitive than the skin anywhere else on your body, so many people like to apply a special cream to this area. [13] X Research source If you want to use eye cream , take your ring finger and dab a small amount of cream around the eye area. Continue tapping until it's completely absorbed into your skin. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Avoid pulling or tugging the delicate skin around your eyes. Give the cream about a minute to fully absorb before moving on to your regular moisturizer. During the daytime, apply the same SPF moisturizer for your face around your eyes. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Look for eye creams with ingredients like retinol, peptides, hyaluronic acid, ceramides, antioxidants, niacinamide, and kojic acid. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Apply lip balm to moisturize and protect your lips (optional).",
      "content": "Apply lip balm to moisturize and protect your lips (optional). Use a non-irritating lip balm to keep your lips plump and hydrated. If you have chapped lips, look for products with castor seed oil, ceramides, dimethicone, hemp seed oil, mineral oil, petroleum, shea butter, or white petroleum jelly. [17] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Carry your lip balm with you so you can reapply it throughout the day—you can even wear it under lipstick! Before going outside, apply a lip balm with SPF 30 or higher that has titanium oxide and/or zinc oxide. [18] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If your lips tingle, burn, or sting after applying lip balm, stop using it and switch to a different product. [19] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Go with a water-based moisturizer if you have normal skin.",
      "content": "Go with a water-based moisturizer if you have normal skin. Normal skin is clear and not sensitive. [20] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Stick with a light, water-based moisturizer to keep your skin looking fresh. If you’re 50 or older, your skin needs more moisture so opt for a cream-based moisturizer . [21] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Water-based moisturizers often contain lightweight oils or silicone-derived ingredients."
    },
    {
      "title": "Select a heavier, oil-based moisturizer if you have dry skin.",
      "content": "Select a heavier, oil-based moisturizer if you have dry skin. Dry skin is flaky, itchy, or rough to the touch. [22] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Very dry skin may even crack and be painful. To restore hydration in your skin, go for a thicker cream or ointment. [23] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Tareen recommends using “ ceramide-based moisturizer ” to “help the skin hold onto moisture.” [24] X Expert Source Mohiba Tareen, MD FAAD Board Certified Dermatologist Expert Interview. 26 March 2020. Look for hydrating ingredients like jojoba oil, dimethicone, glycerin, hyaluronic acid, lactic acid, lanolin, and shea butter. [25] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source For very dry and irritated skin, opt for moisturizers that are high in oil, with ingredients like petroleum jelly or mineral oil. Apply these to your skin as often as necessary. [26] X Trustworthy Source National Eczema Association Nonprofit organization dedicated to improving the lives of those with eczema through research and education Go to source"
    },
    {
      "title": "Stick with a gel moisturizer if you have oily skin.",
      "content": "Stick with a gel moisturizer if you have oily skin. Oily skin is shiny, greasy, and usually more susceptible to acne. [27] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Too much moisturizer can clog your pores, so use a gel moisturizer that is labeled “oil-free” and “non-comedogenic.” [28] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If you're acne-prone, do not use heavy lotions and creams. [29] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Avoid pore-clogging ingredients like beeswax, coconut oil, and cocoa butter. [30] X Research source Even if you have oily skin, you need to apply moisturizer to hydrate your skin, especially if you’re using acne treatments that have benzoyl peroxide, salicylic acid, adapalene, tazarotene, tretinoin, or isotretinoin. [31] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Try two different moisturizers if you have combination skin.",
      "content": "Try two different moisturizers if you have combination skin. If you have combination skin, your skin is dry in some spots and oily in others. [32] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Apply a thicker cream or lotion on dry areas, like your cheeks and neck, and a gel-based moisturizer in the oily areas, like your T-zone (forehead, nose, and chin). [33] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Use a moisturizer with soothing ingredients if you have sensitive skin.",
      "content": "Use a moisturizer with soothing ingredients if you have sensitive skin. Sensitive skin may sting or burn after applying products. [34] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Opt for a barrier-boosting moisturizer with ingredients like ceramides, petroleum, glycerin, and hyaluronic acid. [35] X Research source Look for products that say \"hypoallergenic\" and \"fragrance-free\" on the label."
    },
    {
      "title": "Choose an anti-aging moisturizer if you have mature skin.",
      "content": "Choose an anti-aging moisturizer if you have mature skin. As you age, your skin produces less oil, making it thinner and drier. [36] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source To keep your skin hydrated, pick an anti-aging moisturizer with ingredients like vitamin C, retinol, ceramides, and exfoliating acids (like glycolic and ascorbic acid). [37] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Sunscreen is one of the most effective anti-aging products you can buy. Use a sunscreen with SPF 30 or higher in the daytime and reapply every 2 hours. [38] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Wash your body with gentle, moisturizing soap and warm water.",
      "content": "Wash your body with gentle, moisturizing soap and warm water. Use a fragrance-free cleanser with moisturizing ingredients like shea butter and glycerin. Lather the cleanser in your hands before washing your body, then rinse thoroughly with warm water. Use a soft, clean towel to pat your skin dry. [39] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source To prevent stripping your skin of moisture, limit your shower to 5 minutes and avoid using hot water. [40] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Avoid scrubbing your skin with a loofah or washcloth if you have dry or sensitive skin. [41] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Apply a cream-based moisturizer within 5 minutes of showering.",
      "content": "Apply a cream-based moisturizer within 5 minutes of showering. According to Tareen, “you should moisturize with a cream-based moisturizer right after you bathe.” Apply moisturizer as soon as you step out of the shower, while your skin is still damp. [42] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Start with a quarter-sized amount of product and use more as needed. Pay extra attention to the driest parts of your body, like your elbows, knees, and feet. Use short, firm strokes to apply the moisturizer all over your body. Rub along the direction of the hair follicle to avoid irritation. [43] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you have dry skin, use a heavier cream during the winter months and a lighter lotion in the summer. [44] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Reapply moisturizer to your hands each time after washing them.",
      "content": "Reapply moisturizer to your hands each time after washing them. Every time you wash your hands, you remove the moisturizer you previously applied along with the natural oils and moisture in your skin. Get into the habit of applying hand cream every time after you wash your hands to keep them moisturized. [45] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source During the winter, wear gloves to protect your hands from the wind and cold. [46] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Moisturize every time you bathe, shave, or exfoliate.",
      "content": "Moisturize every time you bathe, shave, or exfoliate. For most people, this means moisturizing twice a day, usually after washing their face in the morning and evening. Applying moisturizer to damp skin is especially important to retain moisture and prevent water loss. [47] X Research source"
    },
    {
      "title": "Moisturizer improves skin hydration and protects your skin barrier.",
      "content": "Moisturizer improves skin hydration and protects your skin barrier. The skin barrier is the outer layer of skin that protects your body from the environment. [48] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Moisturizing regularly allows your skin barrier to repair itself, retain moisture, and stay young and healthy. It can also improve the texture of your skin and conceal the appearance of blemishes. Other benefits of moisturizer include: [49] X Research source New cell generation Increased skin elasticity A more even complexion A reduction in acne, fine lines, and age spots Protection from developing extreme dryness or oiliness Relief from dryness, flakiness, rough patches, and skin sensitivity"
    },
    {
      "title": "Facial moisturizer is formulated for the facial skin, unlike body lotion.",
      "content": "Facial moisturizer is formulated for the facial skin, unlike body lotion. Because of this, it’s generally not recommended to use body lotion on your face. Body lotion does hydrate the skin, but your face has thinner skin and more oil glands, making it more sensitive and prone to breakouts. Applying a body product to your face can exacerbate skin issues, so be sure to read the product label and instructions before using a new moisturizer. [50] X Research source Some body moisturizers are suitable for use on both the face and body. Before applying a multipurpose product on your face, check that it’s labeled “non-comedogenic.”"
    }
  ]
}