{
  "url": "https://www.wikihow.com/Clean-Hairspray-off-of-a-Curling-Iron",
  "title": "How to Clean Hairspray off of a Curling Iron",
  "steps": [
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. You will need a cleaner, a cloth or paper towel, and, possibly, a small scrub brush. Instead of using an all-purpose cleaner, you can use rubbing alcohol to clean the iron. This has the benefit of evaporating and not leaving a strong smell. [1] X Research source Any general purpose cleaner will also work, although a cleaner with a strong smell could linger and eventually the smell could be transferred to your hair when you use the curling iron again. You can also make your own cleaning solution. Simply add one part baking soda to two parts water. This mixture can be used just like a commercial cleaner. The baking soda serves as a gentle abrasive that is good at cleaning off hairspray. A small brush that is easy to find is an old toothbrush. However, make sure that the toothbrush is very clean, and that no toothpaste residue is still on it."
    },
    {
      "title": "Turn off the curling iron.",
      "content": "Turn off the curling iron. It can be very painful to get an accidental burn from a curling iron. Because of this, you should always make sure a curling iron is turned off before attempting to clean it. Even if the curling iron isn't on or hot, make sure it's unplugged. This will reduce the risk of electrical shock."
    },
    {
      "title": "Make sure that your curling iron is not hot.",
      "content": "Make sure that your curling iron is not hot. A turned off and unplugged curling iron can still be too hot to touch. If you have just used your curling iron, you will need to wait a while before attempting to clean it. While some suggest cleaning a curling iron while it's still a little warm, it's best to clean a completely cold curling iron for safety. You may even want to clean it when you have not used the iron on that day. This will help to avoid the risk of getting burned."
    },
    {
      "title": "Begin by wetting your cloth with either water or rubbing alcohol.",
      "content": "Begin by wetting your cloth with either water or rubbing alcohol. You do not want to submerge the curling iron in a lot of liquid. That is why applying the liquid to your cleaning cloth is a good idea. This will limit the amount of liquid coming into contact with the iron. Rubbing alcohol or all-purpose cleaner will work better at breaking down the hairspray than just plain water. However, if you can get the hair spray off simply with water, try that first. This will eliminate the need to wipe the iron down with water at the end to wash off the residual cleaner."
    },
    {
      "title": "Wipe down the iron.",
      "content": "Wipe down the iron. If that didn't take off all the hairspray, or if you have a lot of hairspray stuck on, begin scrubbing the iron with the paper towel. Start off with the spots that have the most hairspray on them and make sure to scrub in all directions. This may take a while depending on how much hairspray is on the iron. Hairspray that has been on the iron for weeks or months will be harder to get off than hairspray that is fresh. Make sure to lift the clasp that closes on your hair when in use and clean under there as well! This is a spot that can get particularly gummed up with hairspray. Clean the handle and the cord too. Hairspray can sometimes get stuck on the handle area of the curling iron. This should be cleaned off so you don't have to touch sticky hairspray every time you pick up your iron. If the handle of the curling iron has vents, be careful not to get water or cleaner in them. These vents allow air to circulate into the electronics inside the curling iron. These electronics may be damaged if exposed to too much moisture."
    },
    {
      "title": "Scrub the barrel with a toothbrush.",
      "content": "Scrub the barrel with a toothbrush. If the hairspray doesn't come off with a light wiping, you may need to do a bit of scrubbing. Cover your small brush in a bit of cleaner and rub it onto the iron. Look for areas where the hairspray is being particularly resistant to cleaning, and focus your scrubbing there. The cleaner made of a combination of baking soda and water can be adjusted to make it thicker for this process. Put some baking soda in a bowl and add just enough water to make it into a paste. This paste will stick to the brush, and the iron, better than a thinner cleaner."
    },
    {
      "title": "Wipe the cleaner off of the curling iron.",
      "content": "Wipe the cleaner off of the curling iron. Once you get all of the hair spray off of the curling iron, wash your hands and grab a clean paper towel or napkin. If you used the rubbing alcohol or all-purpose cleaner, wet the paper towel with water and wipe it down the iron to remove any residue it may have left. [2] X Research source If you simply used water to clean your curling iron, you do not need to wipe it down again. However, wiping it down with a towel with clean water could get even more of the hair spray residue off the iron."
    },
    {
      "title": "Dry the iron off.",
      "content": "Dry the iron off. Get a dry towel and begin drying off the iron, making sure that there is no water left. Then leave your clean iron alone for a few hours to make sure all the water is completely gone and the iron is dry. You do not want to use a curling iron with any water left on it. This is a serious electrocution hazard and should be avoided."
    }
  ]
}