{
  "url": "https://www.wikihow.com/Cook-Pearl-Onions",
  "title": "How to Cook Pearl Onions",
  "steps": [
    {
      "title": "Melt 1 tbsp (14 g) of butter in a nonstick pan.",
      "content": "Melt 1 tbsp (14 g) of butter in a nonstick pan. Scoop 1 tbsp (14 g) of butter into a nonstick saucepan. Place the saucepan on a burner and heat the butter over MEDIUM until it melts. [1] X Research source Use olive oil instead of butter for a healthier option. However, the onions won’t brown and caramelize as well without butter."
    },
    {
      "title": "Saute the onions in the butter for 20 minutes.",
      "content": "Saute the onions in the butter for 20 minutes. Add 14-15 oz. (397-425 g) of onions to the pan. Stir the onions every few minutes so they brown evenly and don't stick to the pan. They should turn a nice golden-brown color after 20 minutes or so. [2] X Research source You can use frozen or fresh onions for this recipe. If you use fresh ones, remember to peel them first."
    },
    {
      "title": "Add 2 tbsp (25 g) of sugar to the onions and saute for 2 minutes.",
      "content": "Add 2 tbsp (25 g) of sugar to the onions and saute for 2 minutes. Measure out 2 tbsp (25 g) of sugar and stir it into the onions. Cook the onions for another 2 minutes to caramelize them. The sugar helps them caramelize and gives them a nice flavor and coating. [3] X Research source For a slightly different flavor, try brown sugar instead. [4] X Research source Stir in 1/3 cup (79 ml) of balsamic vinegar to enhance the flavor. [5] X Research source Try experimenting with other flavors like rosemary, thyme, or white wine. [6] X Research source"
    },
    {
      "title": "Cover the pan and simmer the onions for 25 minutes.",
      "content": "Cover the pan and simmer the onions for 25 minutes. Secure the lid and reduce the heat to low so the onions can simmer and soak up the delicious flavors. [7] X Research source Check on the onions every few minutes to make sure they aren't burning. Don’t let the onions dry out. If there's no moisture left, add 1 tbsp (15 ml) of water at a time, as needed."
    },
    {
      "title": "Add butter, salt, and pepper before serving the onions.",
      "content": "Add butter, salt, and pepper before serving the onions. To enhance the caramelized flavor, try stirring in 1/2 tbsp (7 g) of butter, 3/4 tsp (4.5 g) of black pepper, and 1/4 tsp (1.4 g) of salt. Then, serve them and enjoy! [8] X Research source Top the onions with parsley to give the dish some color and extra taste. Caramelized onions pair well with chicken or fish dishes. They're also great to snack on all by themselves! If you have leftovers, refrigerate them in an airtight container for 3-5 days."
    },
    {
      "title": "Saute the onions first if you want them to have a brown exterior.",
      "content": "Saute the onions first if you want them to have a brown exterior. Melt butter in a pan over medium heat. Then, pour in 1 lb (0.45 kg) of onions. Stir the onions occasionally as they cook so they brown evenly on all sides. [9] X Research source Add 1 tsp (5.9 g) of sugar when the onions turn brown for extra flavor."
    },
    {
      "title": "Cover the onions with chicken stock and add seasonings.",
      "content": "Cover the onions with chicken stock and add seasonings. Pour in enough chicken stock to cover the onions completely. Then, sprinkle in salt and pepper to taste. [10] X Research source Experiment with seasonings like red pepper flakes, oregano, basil, or garlic powder. Use water or vegetable stock for a vegetarian option. If you didn’t brown the onions first, start with this step."
    },
    {
      "title": "Cover the pan and simmer the onions for 25 minutes.",
      "content": "Cover the pan and simmer the onions for 25 minutes. Secure the lid on the pan and lower the heat. Leave the onions to simmer and soak up those delicious flavors. You don't have to stir the onions as they simmer. [11] X Research source Check the pan every few minutes and lower the heat if the stock is boiling. The onions will absorb most of the stock as they simmer."
    },
    {
      "title": "Turn the heat up to boil off any excess liquid before serving the onions.",
      "content": "Turn the heat up to boil off any excess liquid before serving the onions. If any liquid remains after 25 minutes, turn the heat up to HIGH and bring it to a boil. Keep boiling the liquid until it evaporates. Then, you’re ready to serve! [12] X Research source Braised onions pair well with beef dishes like steak or roast beef. Put leftover onions in an airtight container and keep them in the fridge. Enjoy them within 3-5 days."
    },
    {
      "title": "Preheat the oven to 450 °F (232 °C).",
      "content": "Preheat the oven to 450 °F (232 °C). Ovens takes a few minute to heat up completely, so go ahead and preheat it. You can do the prep work while it’s heating up. [13] X Research source"
    },
    {
      "title": "Mix the onions, oil, and seasonings together in a bowl.",
      "content": "Mix the onions, oil, and seasonings together in a bowl. First, add 1-2 tbsp (15 ml) of olive oil. For seasonings, you have lots of choices. Try adding thyme, dried basil, salt, black pepper, paprika, rosemary, or 1/4 cup (237 ml) of balsamic vinegar. Toss everything together with your hands or stir it well. [14] X Research source You can use fresh or frozen onions for this recipe. If you use frozen ones, defrost and drain them first. For a heartier dish, cut up a few potatoes into quarters and toss them in with the onions."
    },
    {
      "title": "Transfer the onions to a greased cookie sheet.",
      "content": "Transfer the onions to a greased cookie sheet. Spray a cookie sheet with cooking spray to lubricate it. Then, pour the onions onto the pan and spread them out in a single layer so they cook evenly. [15] X Research source"
    },
    {
      "title": "Bake the onions for 25-30 minutes.",
      "content": "Bake the onions for 25-30 minutes. After 25 minutes, check the onions with a fork to see if they're tender. If they still feel firm, bake them for another 5 minutes and check again. When the onions are tender, take them out of the oven and let them cool off a bit before you serve them. [16] X Research source Top the onions with more salt and pepper if you'd like. This is a great side dish and pairs well with meat, fish, and vegetarian dishes. Pack up any leftovers in an airtight container and refrigerate them for 3-5 days."
    }
  ]
}