{
  "url": "https://www.wikihow.com/Connect-PC-to-LG-Smart-TV",
  "title": "How to Connect Your PC to an LG Smart TV: 3 Easy Methods",
  "steps": [
    {
      "title": "Turn on your LG TV.",
      "content": "Turn on your LG TV. Your TV needs to be powered on to connect your computer to it . [1] X Research source Note that your computer needs to be on the same wireless network as your TV for this method. For Mac information, check out our expert guide to connecting a Mac computer to a TV ."
    },
    {
      "title": "Press Windows + I to open Windows Settings.",
      "content": "Press Windows + I to open Windows Settings. This will open a new window showing you the Windows Settings app."
    },
    {
      "title": "Click Display.",
      "content": "Click Display . This is in the left menu."
    },
    {
      "title": "Click Connect to a Wireless Display.",
      "content": "Click Connect to a Wireless Display . It’s under the “Multiple displays” section. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select your LG TV.",
      "content": "Select your LG TV. This will appear in the “CONNECT” menu on your computer. [3] X Research source"
    },
    {
      "title": "Use your remote to click Accept on your LG TV.",
      "content": "Use your remote to click Accept on your LG TV. This will be an option on the pop up menu asking if you want to accept the screen share request from your computer. You’re done! Your computer’s screen should appear mirrored on your TV. [4] X Research source If you’re throwing out an old TV and replacing it with your LG TV, see our expert guide to disposing of TV sets ."
    },
    {
      "title": "Turn on your LG TV.",
      "content": "Turn on your LG TV. Your TV needs to be powered on during this process. Note that your computer needs to be on the same wireless network as your TV for this method."
    },
    {
      "title": "Press Windows + I to open Windows Settings.",
      "content": "Press Windows + I to open Windows Settings. This will open a new window showing you the Windows Settings app."
    },
    {
      "title": "Click System.",
      "content": "Click System . This is in the left menu."
    },
    {
      "title": "Click Display.",
      "content": "Click Display . It’s an option on the System settings page."
    },
    {
      "title": "Click Multiple displays.",
      "content": "Click Multiple displays . A drop down menu with additional options will appear. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Connect next to “Connect to a wireless display.”",
      "content": "Click Connect next to “Connect to a wireless display.” A small menu will appear with a list of nearby wireless displays. [6] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select your LG TV.",
      "content": "Select your LG TV. This will appear in the “Available displays” menu on your computer."
    },
    {
      "title": "Use your remote to click Accept on your LG TV.",
      "content": "Use your remote to click Accept on your LG TV. This will be an option on the pop up menu asking if you want to accept the screen share request from your computer. You’re done! Your computer’s screen should appear mirrored on your TV. If you’re looking for new things to watch, check out how to watch TV on your computer ."
    },
    {
      "title": "Make sure that your PC has an HDMI port.",
      "content": "Make sure that your PC has an HDMI port. HDMI ports resemble thin, wide slots which taper down to a bottom which is narrower than the top. Most modern PCs have at least one free HDMI port. [7] X Research source If your computer doesn't have an HDMI port, you'll need to buy an output to HDMI adapter where output is your computer's video output. Common non-HDMI output options include DisplayPort, USB-C, and DVI or VGA (older computers only)."
    },
    {
      "title": "Get a cable that has room to move.",
      "content": "Get a cable that has room to move. Measure the space between your TV and your PC (if not using a laptop), then get an HDMI cable a few feet longer than that. This ensures that you have enough slack to work with if things need to be moved around. [8] X Research source There is little difference between an HDMI cable that costs $5 and a cable that costs $70. Since HDMI is a digital signal, it's either \"on\" or \"off\", and the cable doesn't affect signal quality. The difference in quality is only noticeable with longer cables. HDMI cables are compliant with standards up to 40 feet (12.2 m) in length. There are longer cables available that will technically still work, but they are likely not complying with standards. If you need to run HDMI over extremely long distances, you'll likely need an amp to boost the power."
    },
    {
      "title": "Attach one end of the HDMI cable to your TV.",
      "content": "Attach one end of the HDMI cable to your TV. The HDMI cable should plug into one of the \"HDMI\" inputs at the back (or on the side) of the TV. If your LG TV has more than one HDMI port, the port will have a number on it. This number pertains to the HDMI channel to which you'll need to switch later."
    },
    {
      "title": "Attach the other end of the HDMI cable to your PC.",
      "content": "Attach the other end of the HDMI cable to your PC. Plug the HDMI cable into the port on your computer. If you're using an adapter for your PC's video output, plug the adapter into the PC, then plug the HDMI cable into the HDMI port on the outside of the adapter."
    },
    {
      "title": "Turn on your LG TV.",
      "content": "Turn on your LG TV. Press the Power button on your LG TV remote to turn it on, if you haven't already done so."
    },
    {
      "title": "Switch to the HDMI input.",
      "content": "Switch to the HDMI input. Use the TV's \"Input\" button to switch to the HDMI number that matches the input into which you plugged in the HDMI cable. You should now see your PC's screen appear on the TV. [9] X Research source"
    },
    {
      "title": "Select your LG TV as the sound output.",
      "content": "Select your LG TV as the sound output. If your PC's sound is still coming from your computer and not your TV, do the following: Open Start Type in sound Click the speaker-shaped Sound option. Select your LG TV in the Playback tab. Click Set Default Click Apply , then click OK"
    },
    {
      "title": "Use your LG TV's screen as an extension of your PC.",
      "content": "Use your LG TV's screen as an extension of your PC. Now that you can see your PC's screen on the LG TV, you can watch online content, play movies from your personal library, display photos, show your web browser, and virtually anything else on your PC—everything you do will appear on the TV."
    }
  ]
}