{
  "url": "https://www.wikihow.com/Boost-Microphone-Volume-on-iPhone-or-iPad",
  "title": "How to Boost Microphone Volume on iPhone or iPad",
  "steps": [
    {
      "title": "Restart your iPhone.",
      "content": "Restart your iPhone. Sometimes restarting a smartphone can clear out any software issues the device may be experiencing. Use the Voice Memos app to test your microphones after restarting your iPhone to see if the problem has been fixed."
    },
    {
      "title": "See if the problem is occurring on a specific app.",
      "content": "See if the problem is occurring on a specific app. If the problem is happening on a specific app, the problem could be with the app instead of the microphone. Test your microphone using apps you frequently use, and then test it using the Voice Memos app to see if you hear a difference. To test if the problem is happening during calls or on FaceTime, place a call to someone in the same room as you. Trade phones and have the other person talk on your phone while you listen on the other end. If the problem is happening on a specific app, use the following steps to try to correct the problem. Restart the app. Make sure you have the latest app updates installed. If you have the latest version of an app installed, uninstall and reinstall the app from the App Store. If the problem persists, contact the app's developer to report the problem."
    },
    {
      "title": "Try removing your iPhone case.",
      "content": "Try removing your iPhone case. Some third-party iPhone cases can obscure a microphone on an iPhone. Remove the iPhone from its case and then test the microphones using the Voice Memos app to see if you hear an improvement in the audio quality from the microphones. If you hear an improvement, replace your iPhone case."
    },
    {
      "title": "Clean the microphones.",
      "content": "Clean the microphones. Sometimes dust and debris can interfere with a microphone's functionality. Use the following steps to clean your microphones. Use the Voice Memos app to test the microphones when you are finished. Gently brush away any debris from the microphone openings using a small brush or Q-tip. Brush away from the opening to prevent more debris from getting in the opening. If your iPhone model has a hands-free or headphone jack, use a small brush or Q-tip to gently clean the inside of the 3.5mm headphone jack. Use short bursts of compressed air to remove any remaining debris. Hold the can about an inch away from the microphone openings. [1] X Research source"
    },
    {
      "title": "Update your iPhone.",
      "content": "Update your iPhone. If you continue to have problems with your iPhone, make sure you have the latest version of iOS installed. This can fix any known software issues with an iPhone or iPad."
    },
    {
      "title": "Contact Apple Support.",
      "content": "Contact Apple Support. If all troubleshooting steps have failed and you are still having problems with your iPhone, there may be a hardware issue with your device. Contact Apple Support at 1-800-MY-IPHONE (1-800-694-7466) for further assistance. You can also contact the retail sales store you bought the phone from for warranty information. Have your serial number read before you call. If you live outside the US, Click here to see which number you need to contact for support."
    },
    {
      "title": "Restart your iPad.",
      "content": "Restart your iPad. Sometimes restarting a smartphone or tablet can clear out any software issues the device may be experiencing. If you're not sure how to restart your iPad read \" How to Restart an iPhone, iPod Touch, or iPad for more information. Use the Voice Memos app to test your microphones after restarting your iPad to see if the problem has been fixed."
    },
    {
      "title": "See if the problem is occurring on a specific app.",
      "content": "See if the problem is occurring on a specific app. If the problem is happening on a specific app, the problem could be with the app instead of the microphone. Test your microphones using apps you frequently use, and then test your microphones using the Voice Memos app to see if you hear a difference. To test if the problem is on FaceTime, place a FaceTime call to someone in the same room as you. Trade phones and have the other person talk on your phone while you listen on the other end. If the problem is happening on a specific app, use the following steps to try to correct the problem. Restart the app. Make sure you have the latest app updates installed. If you have the latest version of an app installed, uninstall and reinstall the app. Then reinstall them from the App Store. If the problem persists, contact the app's developer to report the problem."
    },
    {
      "title": "Remove iPad case.",
      "content": "Remove iPad case. Some third-party iPad cases can obscure a microphone on an iPad. Remove the iPad from its case and then test the microphones using the Voice Memos app to see if you hear an improvement in the audio quality from the microphones. If you hear an improvement, replace your iPad case."
    },
    {
      "title": "Clean the microphones.",
      "content": "Clean the microphones. Sometimes dust and debris can interfere with a microphone's functionality. Use the following steps to clean your microphones. Use the Voice Memos app to test the microphones when you are finished. Gently brush away any debris from the microphone openings using a small brush or Q-tip. Brush away from the opening to prevent more debris from getting in the opening. If your iPad model has a hands-free or headphone jack, use a small brush or Q-tip to gently clean the inside of the 3.5mm headphone jack. Use short bursts of compressed air to remove any remaining debris. Hold the can about an inch away from the microphone openings. [2] X Research source"
    },
    {
      "title": "Update your iPad.",
      "content": "Update your iPad. If you continue to have problems with your iPad, make sure you have the latest version of iOS installed. This can fix any known software issues with an iPhone or iPad."
    },
    {
      "title": "Contact Apple Support.",
      "content": "Contact Apple Support. If all troubleshooting steps have failed and you are still having problems with your iPad, there may be a hardware issue with your device. Contact Apple Support at 1-800-275-2273 for further assistance. You can also contact the retail sales store you bought your iPad from for warranty information. If you live outside the US, Click here to see which number you need to contact for support."
    },
    {
      "title": "Locate the microphones.",
      "content": "Locate the microphones. New iPhone models have 4 microphones, older iPhone models only have 3. iPad microphones are located in different places, depending on your iPad model. The microphones are located in the following locations: [3] X Research source iPhone: The front microphone/receiver is the bar located above the screen on the front of the iPhone. The rear microphone is the pin-hole located between the camera and LED flashlight on the back of the camera. The bottom microphone(s) are located at the base of the iPhone to the left and right of the charging port. iPad iPad Air & iPad Pro: The dual microphones are located on the edge in the upper-right corner, and on the back right next to the camera in the upper-left corner. iPad Mini 2, 3, & 4: The dual microphone is located on the top center edge, and top-center on the back. iPad 1-6 & iPad Mini: The microphone is located on the upper-center edge."
    },
    {
      "title": "Test the microphones.",
      "content": "Test the microphones. You can test your microphones using the Voice Memo app that comes pre-installed on your iPhone. Test the microphones after each step to see if the problem has been fixed. For now, it will help you identify which microphone you are having issues with. Use the following steps to test the microphones. Open the Voice Memos app. It has a black icon with an image that resembles a sound wave. Tap the red circle icon at the bottom of the screen. loudly say \"Test, test\" into one of the microphones Drag the on-screen wave back to the beginning. Tap the Play triangle icon. Listen for audio irregularities. Repeat for each microphone."
    },
    {
      "title": "Test any hands-free headsets you use.",
      "content": "Test any hands-free headsets you use. If you normally use a wired or wireless hands-free headset with your iPhone, connect it to your iPhone using the 3.5 mm headphone jack on the bottom left, or using your iPhone Bluetooth capabilities. Use the Voice Memos app to test the microphone on your hands-free headset. If the problem is occurring while your hands-free headset is in use, you likely have a faulty hands-free headset. Check to see if your hands-free headset has a mute button or microphone volume. Make sure the volume is not turned down, and the mute button is not activated."
    }
  ]
}