{
  "url": "https://www.wikihow.com/Be-a-Jain",
  "title": "How to Be a Jain",
  "steps": [
    {
      "title": "Learn Jainism:",
      "content": "Learn Jainism: Jainism is an ancient philosophy from India. Jainism /ˈdʒeɪnɪzᵊm/, traditionally known as Jaina dharma, is an Indian religion that prescribes a path of non-violence towards all living beings and emphasises spiritual independence and equality between all forms of life. The essence of Jainism is concern for the welfare of every being in the universe. Practitioners believe that non-violence and self-control are the means by which they can obtain liberation. Currently, Jainism is divided into two major sects - Digambara and Śvetambara. The word Jainism is derived from a Sanskrit verb Jin which means to conquer. It refers to a battle with the passions and bodily pleasures that the Jaina ascetics undertake. Those who win this battle are termed as Jina (conqueror). The term Jaina is thus used to refer to laymen and ascetics of this tradition alike. [1] X Research source"
    },
    {
      "title": "Learn the five core beliefs:",
      "content": "Learn the five core beliefs: An essential aspect of Jainism is the ascetic lifestyle. Monks and nuns undertake the ascetic life full-time and take the \"Five Great Vows\": [2] X Research source Non-violence (Ahimsa) . You can do this by practicing non-violence for every being, including an animal, person or even an ant. They all have soul, and karma to go along with it. To kill that being takes away its chances to rid itself of its karma. Therefore, Jains practice vegetarianism . They do not eat Meat/Seafood/Eggs e.g. chicken, cows, sheep, steak, fish or any food that comes from killing a living being. They don't even eat honey or wear clothes made out of animal skin. It may be hard to follow this if you have eaten meat all your life, but you can take baby steps and start with first, discontinuing seafood. A week later meat then chicken and so on. Jains also do not eat root vegetables (garlic, onions, potatoes, carrots etc) as they kill the entire plant and lots of other lives in the form of micro-organisms on these vegetables. The belief of non-violence should not be only for animals, but it should be extended towards humans as well. Please watch your words. It is said that a wound can heal itself but harsh words are rarely forgotten and can hurt far worse. Truth (Satya) . No matter what, always say the truth also keep in mind that if that truth is going to hurt someone, then remain silent. Non-stealing (Asteya) . If it's not yours, don't take it. Simple as that. Resist temptation . Celibacy (Brahmacharya) . Abstinence from sex. You can contribute to this by at least avoiding masturbation and having non-marital sex. Also avoid drinking alcohol or smoking. Non-possessiveness (Aparigraha) . Try to restrict the objects you need to live. By doing so you will reduce the dependency on those objects and gradually reduce the need to use them for your survival."
    },
    {
      "title": "Perform the six essential duties prescribed for a śrāvaka (householder).",
      "content": "Perform the six essential duties prescribed for a śrāvaka (householder). These help one in achieving the principle of ahimsa which is necessary for his/her spiritual upliftment. The six duties are: [3] X Research source Worship of Pañca-Parameṣṭhi (five supreme beings) Following the preachings of Jain saints. Study of Jain scriptures Samayik (Meditation)-Meditation in Jainism aims at realizing the self, attain salvation, take the soul to complete freedom. It aims to reach and to remain in the pure state of soul which is believed to be pure conscious, beyond any attachment or aversion. The practitioner strives to be just a knower-seer. Following discipline in their daily engagement Charity ( dāna ) of four kinds: Ahara-dāna - donation of food Ausadha-dāna - donation of medicine Jnana-dāna - donation of knowledge Abhaya-dāna - saving the life of a living being or giving of protection to someone under threat"
    },
    {
      "title": "Know about Jain holy books and monks:",
      "content": "Know about Jain holy books and monks: The Jain holy books are called 'Jinvani' and has everything about Jainism in it. Remember that this is the oldest religion on Earth, therefore none of it is just wrong. Even what the scientists are finding now was written in these books years ago. Talking about the Jain monks, they are called 'Sadhus' and are really great religion followers. While Svetambara Sadhus wear a single white cotton cloth, Digambara sadhus don't wear anything. They remain barefoot and have no relations with their past families.They don't live in a house and can't take any means of transport.They eat only once in a day, and even this is only if a Jain person invites them at home. [4] X Research source"
    },
    {
      "title": "Chant the mantras and do pujas:",
      "content": "Chant the mantras and do pujas: In Jainism, the most important mantra is 'Navkar' or 'Namokar' mantra. Jain people follow an exact way of offering different things known as puja. They also offer pure water along with many other pure liquids simultaneously when chanting mantras. These are known as 'Abhishek.' [5] X Research source"
    },
    {
      "title": "Visit temples and holy places.",
      "content": "Visit temples and holy places. You can look for all these places on the wikipedia. But the most important holy place is the 'Shikharji'. This is a very sacred place and any jain will go over there, irrespective of being digambara or svetambara. Moreover, visiting there relaxes minds. Shikharji is a huge mountain and you have to climb up barefoot ."
    },
    {
      "title": "Follow some rules of remaining pure.",
      "content": "Follow some rules of remaining pure. This is for the girls and women who have their menstrual cycle. During this period, the girls should not touch anyone nor touch any place that is related to god or anything made out of cloth or fabric. Even not going into the kitchen. If someone touches you, that person has to immediately go and have bathe. This should be at least for 3 days, but going in front of god is only once you become clean."
    }
  ]
}