{
  "url": "https://www.wikihow.com/Be-a-Hard-Man",
  "title": "How to Be a Hard Man",
  "steps": [
    {
      "title": "Challenge negative thinking.",
      "content": "Challenge negative thinking. Everyone has negative thoughts from time to time, but having too many negative thoughts can begin to affect your behavior and how you see yourself. If you do not challenge these negative thoughts, you may not live up to your potential and be the person that you would like to be. To challenge these thoughts, write them down, evaluate them, and then respond with a more positive thought. [1] X Research source For example, if your initial thought is “I am weak”, you would start by writing down that thought on a piece of paper. You would then ask yourself, “Is there evidence that I am not weak?” Lastly, you would replace your initial thought with a more positive one like, “I am a strong person. There are areas that need improvement, but I am working to be better.” You have to practice positive thinking until it becomes natural."
    },
    {
      "title": "Focus on things you can control.",
      "content": "Focus on things you can control. You will not always be able to control your circumstances, but you can control how you respond to them. Time spent worrying about a problem is a waste of your mental energy. If you find yourself worrying about something, identify exactly what you are worried about and then develop a plan to solve the problem . [2] X Research source For example, if you are worrying about a big presentation coming up, you would start by writing down the reasons you are worried about the presentation. You would then come up with a plan to prepare for the presentation and address any of your specific concerns. Putting your energy into developing a great presentation is a much better use of your time than sitting and thinking about all the ways your presentation could go wrong. Developing good habits and increasing your willpower are also ways to help you manage any stress and focus on your behavior instead of the problem. [3] X Research source"
    },
    {
      "title": "Set goals",
      "content": "Set goals . Set short-term, specific goals for yourself. This will help you focus your mind on one task at a time and instead of thinking about what you have to do next. You will also become more confident every time you achieve a goal. If you were setting a goal around working out, your goal would be to \"finish the next 60 minutes of your workout\" instead of \"working out for 60 minutes, 5 times a week.\""
    },
    {
      "title": "Deal with setbacks.",
      "content": "Deal with setbacks. There will be bumps in the road. How you handle them will determine if you are a hard man. Accept that setbacks are part of the growing process and stay focused on your goal. Take time to write and/or think about your experience and what you learned. You may ask yourself: [4] X Research source What did I do? What could I have done better? What would I do if I could go through this situation again? What did I do well? What did I learn that I could apply to my future goals?"
    },
    {
      "title": "Exercise regularly.",
      "content": "Exercise regularly. Have a regular fitness program that you follow. Try to train as hard as you possibly can. Decrease the amount of rest between workouts and exercise. For example, instead of running every other day, you may run 5 or 6 days a week and have one rest day. If you are lifting weights, you may rest 30 seconds in between exercises instead of resting for 1 or 2 minutes. Because you are pushing your body hard, it is important to eat a healthy diet and get plenty of sleep. If you have not been exercising, speak to your doctor before you get started."
    },
    {
      "title": "Train outdoors.",
      "content": "Train outdoors. If you only train indoors, you are limiting yourself to a controlled environment. When you go outside, you are challenging your body more. Train in cold and hot environments. Walk and run up hills and trails instead of being on paved, flat surfaces all of the time. [5] X Research source You can also adjust your clothing to make the environment more challenging. If it is hot outside, wear long pants and long sleeves instead of shorts and a tank top. If it is cold outside, wear the least amount of clothes you can stand when you train. Slowly increase the intensity. You do not want to hurt yourself. For example, you may train in hot weather with shorts and a long sleeve shirt. Once your body gets used to the long sleeve shirt, you can add the long paints."
    },
    {
      "title": "Push your limits.",
      "content": "Push your limits. Your body will adapt to your training conditions. You must mix it up and do a variety of activities. Constantly push yourself to get to the next level. If running in cold weather is easy, try running when it is cold and raining outside. If you did 20 repetitions last time, try to get 25 this time. [6] X Research source Do anything that gets you muddy and dirty. Spartan races, obstacle courses, and adventure races are good options. If you train with other people, always strive to be the best and outwork the other person."
    },
    {
      "title": "Deal with pain.",
      "content": "Deal with pain. Pain is inevitable when you are pushing your body. Try to manage your pain yourself. Do not complain to other people about how you feel. Positive thinking will also help you deal with pain. Your pain is bringing you one step closer to being the man you want to be. Tell yourself, \"I can deal with the pain. This is helping me get stronger.\" If the pain becomes so severe that you cannot do your daily activities, visit a health care professional to make sure that you do not have a serious injury."
    },
    {
      "title": "Do something uncomfortable daily.",
      "content": "Do something uncomfortable daily. As a hard man, you cannot be controlled by your emotions or circumstances. It takes time to reach this stage and you must train yourself by dealing with small discomforts every day. The more you practice, the better you will become. [7] X Research source Small discomforts such as taking cold showers, fasting one day a week , or eating a strict diet are a good place to start. If you are having trouble finding a small discomfort, make a list of the things that irritate you or you don’t like doing. Then choose one of those things work on. For example, if you hate waking up early, start waking up 15 minutes earlier in the morning."
    },
    {
      "title": "Choose your battles.",
      "content": "Choose your battles. Just because you can fight, does not mean you should. You do not need to prove anything to anyone. Only fight when it is necessary and for a good cause. You should never start a fight, but you can definitely finish one. Defend the victims of bullying and scapegoating. Sympathize with the victim and tell the bullies to leave the victim alone. Someone bumping into you or saying something rude is not worth a fight. However, bumping into or disrespecting your girlfriend, partner, sister, or mother would be worth the fight."
    },
    {
      "title": "Do not complain",
      "content": "Do not complain . No matter how you are feeling or what you are going through, do not complain about it to other people. If you complain about things, other people will think that you are weak. Instead of complaining, face your problems head on and be brave . This is especially important when you are in front of other people. For example, if you worked out really hard one day and you are very sore, there is no need to tell other people how hard you worked out and how sore you are. You do not want sympathy; you want to be respected. If you were up all night working or studying, don’t go and tell people how tired you are the next day. Instead put extra effort into how you look the next day. People will see that you worked very hard, but it did not affect you."
    },
    {
      "title": "Stand by your beliefs.",
      "content": "Stand by your beliefs. Do not be influenced by what other people do or say. Have your own mind and stick to your beliefs. Always act based on those beliefs, and take action if those beliefs are violated. Your reputation is very important. Be a leader, not a follower. For example, if you have strong beliefs about being friendly to animals and children, you may correct someone that hit their dog for being disobedient. If you believe in being loyal and honest with your friends, do not tolerate friends who lie and are shady."
    },
    {
      "title": "Speak with confidence",
      "content": "Speak with confidence . Look people in the eye and speak with conviction. You do not need to raise your voice or curse, but speak as if you truly believe what you are saying. If you do not believe your words, other people will not believe you. For example, instead of saying, “I think that was a really good movie,” you would say, “That was a great movie. You need to go see it.”"
    },
    {
      "title": "Know when to be soft.",
      "content": "Know when to be soft. Even hard men have limits. There are times that your toughness may not be helpful to you or other people around you. You should never be a danger to yourself or other people. Ask for help if you need it. Remember that you do not have to prove anything to other people. You are a hard man because you have spent time working on yourself. You may need to soften up a bit to comfort a friend, help someone in need, or show humility . You can be a hard man and still have emotions."
    }
  ]
}