{
  "url": "https://www.wikihow.com/Calculate-the-Concentration-of-a-Solution",
  "title": "How to Calculate the Concentration of a Solution",
  "steps": [
    {
      "title": "Find the mass",
      "content": "Find the mass of the solute mixed in with the solvent. The solute is the substance that you’re mixing in to form your solution. If you’re given the mass of the solute in your problem, write it down and be sure to label it with the correct units. If you need to find the mass of the solute, then weigh it on a lab scale and record the measurement. [1] X Research source If the solute you’re using is a liquid, then you can also calculate the mass using the density formula, where density D = m/V, where m is the mass of the liquid and V is the volume. To find the mass, multiply the density of the liquid by the volume."
    },
    {
      "title": "Record the total volume of the solution.",
      "content": "Record the total volume of the solution. The total volume of the solution is the amount of solvent plus the amount of solute added to it. If you’re finding the volume in a lab, mix the solution in a graduated cylinder or beaker and look at the measurement. Measure the volume from the curve at the top of the solution, or the meniscus, to get the most accurate reading. Record the volume of the solution. [2] X Research source If you aren’t measuring the volume yourself, you may need to convert the mass of the solute into volume using the density formula. For example, if you’re finding the concentration of 3.45 grams of salt in 2 liters of water, you would find the volume of salt using the density formula. Look up the density of salt either in a textbook or online and solve the formula for m. In this case, the density of salt is 2.16 g/mL. The formula would read 2.16 g/mL = (3.45 g)/V. Multiply each side by V to get V(2.16 g/mL) = 3.45 g. Then divide the each side by 2.16 to find the volume, or V = (3.45 g)/(2.16 g/mL) = 1.60 mL. Add the volume of the solute to the volume of your solvent, ma. So in this example, 2 L + 1.6 mL = 2,000 mL + 1.6 mL = 2,001.6 mL. You can either leave the measurement in milliliters or convert it back to liters to get 2.002 L."
    },
    {
      "title": "Divide the mass of the solute by the total volume of the solution.",
      "content": "Divide the mass of the solute by the total volume of the solution. Write out the equation C = m/V, where m is the mass of the solute and V is the total volume of the solution. Plug in the values you found for the mass and volume, and divide them to find the concentration of your solution. Don’t forget to label to label your answer with the correct units. [3] X Research source In our example for the concentration of 3.45 grams of salt in 2 liters of water, your equation would be C = (3.45 g)/(2.002 L) = 1.723 g/L. Certain problems may ask for your concentration in specific units. Be sure to convert the units before putting them in your final formula."
    },
    {
      "title": "Find the mass of the solute in grams.",
      "content": "Find the mass of the solute in grams . Measure out the mass of the solute that you plan on mixing with your solution. [4] X Research source Be sure to subtract the weight of the container you’re using to measure the solute or else your concentration will be inaccurate. If your solute is a liquid, you may need to calculate the mass using the formula D = m/V, where D is the liquid’s density, m is the mass, and V is the volume. Look up the density of the liquid in a textbook or online and then solve the equation for the mass."
    },
    {
      "title": "Determine the total mass of the solution in grams.",
      "content": "Determine the total mass of the solution in grams. The total mass of the solution is the mass of the solvent plus the mass of the solute. Weight the masses using a lab scale or convert the volume of the solvent to mass by using the density formula D = m/V. Add the mass of the solute to the mass of the solvent to find your final volume. [5] X Research source For example, if you want to find the concentration of 10 g of cocoa powder mixed with 1.2 L of water, you would find the mass of the water using the density formula. The density of water is 1,000 g/L, so your equation would read 1,000 g/L = m/(1.2 L). Multiply each side by 1.2 L to solve the mass in grams, so m = (1.2 L)(1,000 g/L) = 1,200 g. Add the mass of the cocoa powder to get 1,210 g."
    },
    {
      "title": "Divide the mass of the solute by the total mass of the solution.",
      "content": "Divide the mass of the solute by the total mass of the solution. Set up your equation so the concentration C = mass of the solute/total mass of the solution. Plug in your values and solve the equation to find the concentration of your solution. [6] X Research source In our example, C = (10 g)/(1,210 g) = 0.00826."
    },
    {
      "title": "Multiply",
      "content": "Multiply your answer by 100 if you want to find the percent concentration. If you’re asked to list the concentration in a percentage , take the answer you just found and multiply it by 100. Label your final answer with a percentage sign. [7] X Research source In this example, the percent concentration is (0.00826)(100) = 0.826%."
    },
    {
      "title": "Multiply the concentration by 1,000,000 to find the parts per million.",
      "content": "Multiply the concentration by 1,000,000 to find the parts per million. Use the number you found for your concentration and multiply it by 1,000,000 or 10 6 . The number will be how many parts per million the solute is. Label your final answer in ppm. [8] X Research source In our example, the ppm = (0.00826)(1,000,000) = 8,260 ppm."
    },
    {
      "title": "Add the atomic masses of the solute together to find the molar mass.",
      "content": "Add the atomic masses of the solute together to find the molar mass . Look at the elements in the chemical formula for the solute you’re using. List the atomic mass for each element in the solute since atomic and molar mass are the same. Add together the atomic masses from your solute to find the total molar mass. Label the final measurement in g/mol. [9] X Research source For example, if your solute is potassium hydroxide (KOH), find the atomic masses for potassium, oxygen, and hydrogen and add them together. In this case molar mass = 39 +16 + 1 = 56 g/mol. Molarity is used mainly in chemistry when you know the chemical makeup of the solute you’re using."
    },
    {
      "title": "Divide the mass of the solute by the molar mass to find the number of moles.",
      "content": "Divide the mass of the solute by the molar mass to find the number of moles. Find the mass of the solute you’re adding into your solution using a lab scale if you need to. [10] X Expert Source Chris Hasegawa, PhD Retired Science Professor & Dean Expert Interview. 29 July 2021. Be sure to subtract the mass of the container so you have an accurate reading. Divide the mass you found by the molar mass so you can find how many moles of the solute you’re using. Label your answer with “mol.” [11] X Research source For example, if you want to find the number of moles in 25 g of potassium hydroxide (KOH), then the equation is mol = (25 g)/(56 g/mol) = 0.45 mol Convert the mass of your solute to grams if it isn’t already listed in grams. Moles are used to represent the number of atoms in the solution."
    },
    {
      "title": "Convert the volume of the solution to liters.",
      "content": "Convert the volume of the solution to liters. Find the volume of the solvent before you mix in the solute. [12] X Expert Source Chris Hasegawa, PhD Retired Science Professor & Dean Expert Interview. 29 July 2021. Use a flask or a graduated cylinder to find the measurement if you aren’t given it. If your measurement is in milliliters, then divide it by 1,000 to convert it to liters. [13] X Research source In this example, if you’re using 400 mL of water, then divide it by 1,000 to convert it to liters, which is 0.4 L. If your solvent is already listed in liters, then you can skip this step."
    },
    {
      "title": "Divide the moles of solute by the volume of the solution in liters.",
      "content": "Divide the moles of solute by the volume of the solution in liters. Set up your equation so the molarity M = mol/V, where mol is the number of moles of the solute and V is the volume of the solvent. [14] X Research source Solve the equation and label the answer M. [15] X Expert Source Chris Hasegawa, PhD Retired Science Professor & Dean Expert Interview. 29 July 2021. In this example, M = (0.45 mol)/(0.4 L) = 1.125 M."
    }
  ]
}