{
  "url": "https://www.wikihow.com/Apply-Vinyl-Wrap",
  "title": "How to Apply Vinyl Wrap",
  "steps": [
    {
      "title": "Purchase cast vinyl for more flexibility in your wrap.",
      "content": "Purchase cast vinyl for more flexibility in your wrap. The two main types of vinyl are calendared and cast. Calendared vinyl is thicker but stickier, while cast vinyl is more flexible and easier to manipulate around curves and edges. Choose vinyl with built-in air release channels for a smooth installation. [1] X Research source Use vinyl wrap on smooth substrates like glass, corrugated plastic, and painted aluminum. Avoid using vinyl on wooden surfaces. Purchase roughly 15–20 feet (4.6–6.1 m) more vinyl than you think you’ll need in case you mess up any of the panels. Avoid using chrome is this is your first time applying vinyl wrap. Chrome is the most expensive and most difficult to apply, especially for beginners. Printed and gloss covers have a longer lifespan and offer better protection than matte vinyl."
    },
    {
      "title": "Sweep and mop the area where you intend to install the wrap.",
      "content": "Sweep and mop the area where you intend to install the wrap. Vinyl wraps attract dust, so clean the area thoroughly before you introduce the vinyl wrap. Sweep, mop, and dust the area to keep dirt particles from sticking to it. [2] X Research source Make sure you have enough room to comfortably unroll the vinyl wrap to the appropriate length."
    },
    {
      "title": "Use cleaning solution and a lint-free cloth to clean the surface you’re wrapping.",
      "content": "Use cleaning solution and a lint-free cloth to clean the surface you’re wrapping. Spray a cleaning solution directly onto the surface you’re wrapping, and use a lint-free cloth to buff the surface. Move the cloth in counter-clockwise circles until the surface is completely dry. Dirt and moisture will keep the adhesive from sticking properly. [3] X Research source Rapid Tac is an excellent solution for cleaning surfaces before wrapping them. [4] X Research source Try not to place the vinyl film on the floor, because it will attract dirt particles. These dirt particles will leave scratches once you start to apply it. If you are wrapping a truck or car, take it through a car wash 24 hours ahead of time so it can dry overnight. Do not use waxes or protectants, as they could interfere with the adhesive. [5] X Research source"
    },
    {
      "title": "Measure the length of the surface you’re wrapping.",
      "content": "Measure the length of the surface you’re wrapping. Stick a piece of painter’s tape on the edge of the surface you are wrapping, with at least 3 inches (7.6 cm) hanging off the edge. Leave the tape on the roll and unroll it to the other side of the surface. Rip the tape off of the roll with at least 3 centimetres (1.2 in) hanging off both sides. [6] X Research source Keep the tape flat against the surface so that it accounts for edges, contours, and dips. If your surface is not flat (such as in a car or truck), the tape will allow you to measure the appropriate amount of vinyl needed to cover the contours. If you are wrapping a car, truck, or anything that has multiple divided panels, you will need to measure and wrap each panel separately."
    },
    {
      "title": "Use painter’s tape to measure the width of the surface.",
      "content": "Use painter’s tape to measure the width of the surface. Repeat the same process as before, but this time, measure the width. Use a roll of painter’s tape and place it roughly in the center on the long edge of the surface. Leaving at least 2–3 inches (5.1–7.6 cm) hanging off of each side, roll the tape directly across the length-wise tape and stick it down. [7] X Research source The two lines of tape will cross roughly in the middle."
    },
    {
      "title": "Unroll the vinyl while keeping it off the ground.",
      "content": "Unroll the vinyl while keeping it off the ground. Remove the top piece of tape you stuck on the surface, and line up 1 end of the tape with the end of the unrolled vinyl. Stretch the tape across the back of the vinyl and mark the edge of where it reaches. Use an X-Acto knife to cut at that spot in a straight line, all the way down the length of the vinyl. [8] X Research source Keep the cut as straight as you can. Most vinyl wraps have lines built in for reference. Have a friend help you if possible. Have them pull out the end of the vinyl while you hold the roll, then place the end of the tape on the end of the vinyl they’re holding. This will allow you to unroll the vinyl without laying it on the ground, which could damage the vinyl."
    },
    {
      "title": "Drape the cut piece of vinyl over the surface you’re wrapping.",
      "content": "Drape the cut piece of vinyl over the surface you’re wrapping. Remove the liner and place the piece of vinyl you just cut roughly in the center of the area you’re wrapping. Make sure the surface is completely covered with no edges showing. [9] X Research source You’ll be removing and repositioning the vinyl, so it doesn’t have to be placed perfectly. Just make sure you have enough vinyl to cover the surface you’re wrapping. The vinyl will stick to the surface, but it won’t be permanent until you apply heat to seal it. You can place, replace, and stretch the vinyl as necessary until you seal it down."
    },
    {
      "title": "Pull both sides of the vinyl away from each other to create tension.",
      "content": "Pull both sides of the vinyl away from each other to create tension. Hold both ends of the vinyl and lift directly up, pulling it off of the surface. Stretch the sides of the vinyl away from each other to create enough tension to remove most of the wrinkles from the middle, then gently lay it down on the surface you’re wrapping. [10] X Research source This process works best with another person. Both people hold 2 corners on each end of the vinyl and pull all 4 corners away from each other at the same time. At least 2 people are necessary for large surfaces."
    },
    {
      "title": "Run a squeegee over the applied film to remove wrinkles and bubbles.",
      "content": "Run a squeegee over the applied film to remove wrinkles and bubbles. Hold the squeegee at a roughly 45-degree angle. Start in the middle and move the squeegee outward toward the edges to push out any air bubbles or fingers in the vinyl. If the surface you’re wrapping is curved, move the squeegee downward over the curves an arc shape for a smoother application. [11] X Research source Make sure your squeegee has a hard side and a felt side. The hard side can damage the vinyl and should be used only for stuffing it down into crevices or hard-to-reach areas. Use the hard side of your squeegee to lay the vinyl into crevices. Use a heat gun to apply heat before doing so to get into the tougher-to-reach areas. Stretch the vinyl to fit over curves or reposition it as necessary. Lift the vinyl and apply heat from a heat gun to make the vinyl more malleable. This makes it easier to mold around curves and edges."
    },
    {
      "title": "Lift the vinyl and apply heat to remove imperfections.",
      "content": "Lift the vinyl and apply heat to remove imperfections. If you come across imperfections in the vinyl such as wrinkles, start at the outside edge and lift the vinyl up to un-stick the area. Holding the vinyl up and away from the surface, apply heat with a heat gun until the imperfections disappear. Keep the vinyl taut by pulling it on both ends, then replace the smoothed-out vinyl on the surface. [12] X Research source Be careful not to lift up on the places where the vinyl is already smoothed out. Simply lift the vinyl without pulling it. If you pull on the vinyl while heating it, it will stretch."
    },
    {
      "title": "Push air bubbles in from the outside edge with a squeegee.",
      "content": "Push air bubbles in from the outside edge with a squeegee. Use your squeegee to push the air from the edges of the bubble in toward the center. Then, use your finger to push down on the center of the bubble. [13] X Research source The air will be pushed out through the air-release channels and will smooth out without having to lift and replace the entire vinyl sheet. If you run into a bubble that is too big, use the squeegee to divide it into several smaller bubbles first. This will allow the air to escape more easily."
    },
    {
      "title": "Heat the vinyl with a heat gun before wrapping the edges.",
      "content": "Heat the vinyl with a heat gun before wrapping the edges. Soften the film with a heat gun while pulling down on it to remove wrinkles. Pull the vinyl taut against the edge with a good amount of force to keep it as smooth as possible. Then, stretch it under the edge while holding it taut. Use a squeegee to stick it down about 1 inch (2.5 cm) from the inside edge, then use a blade to trim the excess vinyl. [14] X Research source Using a squeegee to firmly stick the edge down activates the adhesive. Be sure it’s placed properly before solidifying it with the squeegee. Clean the inside surface with isopropyl alcohol, and make sure it’s completely dry before sticking it down. You only get one shot to stick it down once the adhesive is activated, and water and dirt will keep it from sticking. [15] X Research source"
    },
    {
      "title": "Trim the edges with a sharp blade to remove excess vinyl wrap.",
      "content": "Trim the edges with a sharp blade to remove excess vinyl wrap. After laying and securing your vinyl, use an X-Acto knife to trim down extra vinyl. Go slowly and cut as evenly as you can. This process takes time, patience, and a steady hand, and may take as long as it takes to wrap your surface. [16] X Research source Use a new blade to ensure the blade is sharp enough to cut the vinyl without ripping it. The vinyl wrap will shrink once you heat at the end, so don’t cut too much. Leave roughly 1–2 centimetres (10–20 mm). Heat the vinyl before you trim it to minimize the shrinkage."
    },
    {
      "title": "Cut the vinyl around handles and knobs.",
      "content": "Cut the vinyl around handles and knobs. For handles, knobs, or other parts of the surface that jut out, heat the area with a heat gun to expand the vinyl. Use an X-Acto knife to cut along the outside of the extruding part, leaving roughly 1–2 millimetres (0.10–0.20 cm) of vinyl hanging over the edge. Use the plastic edge of the squeegee to push the edges down around the area. [17] X Research source Take your time, and use a new blade to make straight, even cuts. Rough or torn edges look messy."
    },
    {
      "title": "Post-heat the vinyl with a heat gun to secure it.",
      "content": "Post-heat the vinyl with a heat gun to secure it. Once everything is set how you want it, use your heat gun to get the vinyl pretty hot. Move your heat gun in a sweeping motion in 6–8 inches (15–20 cm) sections, making sure the vinyl is secured firmly in any recesses or channels. Allow your wrap to set for 24 hours after post-heating it. [18] X Research source Only do this once everything is set exactly how you want it because you cannot go back and change it once it’s set. This fully activates the adhesive on the vinyl to set it firmly in place. A good rule of thumb is to heat the vinyl to roughly 200–250 °F (93–121 °C), but every vinyl is different. Check the recommendations of the vinyl manufacturer to be safe."
    }
  ]
}