{
  "url": "https://www.wikihow.com/Block-Sun-from-Windows",
  "title": "How to Block Sun from Windows",
  "steps": [
    {
      "title": "Hang curtains",
      "content": "Hang curtains for a decorative window covering option. Curtains are a great way to block the sun from coming in through the window while providing an attractive, decorative addition to your space. [1] X Research source Walter Brant. Handyman. [2] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source To choose the right curtains, first measure the width and height of your windows. Then, order the right size, fabric, and style to suit your space. You can then install a curtain rod and hang the curtains across the rod to block out the sun. Curtain panels made of thicker, darker colored materials, such as black or navy thick cotton or polyester, will block out more of the sun than curtains made of thinner, lighter colored fabrics, such as a white or oatmeal linen. [3] X Research source If you want to block out the sun completely, paneled blackout curtains are a great option. [4] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source Spread your curtains out the length of the window to block more sun from shining through, or push them back a bit to let a little light in. Adhere hook-and-loop fastener strips to the inside edges of your curtains to keep the curtains closed in the middle. [5] X Research source"
    },
    {
      "title": "Install blinds",
      "content": "Install blinds for an easy-to-use option. Installing vinyl, PV, aluminum, or wood blinds is an effective and relatively inexpensive way to block the sun from coming in through your windows. While blinds can be a bit more difficult to mount than curtains, you can install blinds yourself by measuring to determine where to hang the mount, attaching the brackets, and installing the head rail. [6] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source Cordless fabric blinds tend to be more effective at blocking out the sun than vinyl blinds. Like blackout curtains, you can also purchase blackout blinds if you want to completely block the sun. [7] X Research source If you only want to partially block the sun, you can twist the blind wand to open the blinds a bit to let some light shine through."
    },
    {
      "title": "Mount shutters to cover the windows when you want.",
      "content": "Mount shutters to cover the windows when you want. Mounting either interior plantation shutters or exterior shutters is a great way to both block sunlight and reduce your home heating and cooling costs. [8] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source Once you measure your windows and choose the right shutters to suit your taste, you can install your interior or exterior shutters yourself or hire a professional to mount them for you. Both interior and exterior shutters come in a variety of materials, such as wood, steel, aluminum, and vinyl, and are available at a wide variety of price points. Therefore, if you like the look of either interior or exterior shutters, you’ll likely be able to find an option at your desired price point."
    },
    {
      "title": "Cover the exterior of the windows with awnings to limit sunlight.",
      "content": "Cover the exterior of the windows with awnings to limit sunlight. While they require a bit more maintenance than other options, window awnings are also a great way to shield your windows from sunlight. Awnings are also a great option if you want to decrease the sunlight coming through but still be able to see out the window. [9] X Research source Both metal, wood, and canvas awnings generally require weather-resistant coating and maintenance every 4 to 6 years. [10] X Research source Acrylic and PV awnings tend to be more resistant to mildew and fading and are generally easier to maintain. [11] X Research source"
    },
    {
      "title": "Get window screens to partially block the sun.",
      "content": "Get window screens to partially block the sun. Because they have holes in them, window screens won’t be able to completely block out the sun. However, they can significantly reduce the amount of light that shines through your windows. While replacing or reinstalling preexisting window screens is relatively easy, you’ll likely need to hire a professional to install new window screens. [12] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source You can also make your own window screens for a more cost-effective option. Window screens also allow you to keep your windows open without letting any bugs or debris come in through the windows."
    },
    {
      "title": "Apply a tinted window film to reduce sunlight.",
      "content": "Apply a tinted window film to reduce sunlight. If you want to block some sunlight from coming in but still be able to see out the window, applying a tinted window film is a great option. To install a tinted window film, first measure the height and width of the glass portion of the windows. Then, use scissors to cut the film to size (if it’s not sold in the right size already) and peel the protective layer off the back. Line the film up with the edges of the window and press it down to get the film to stick. [13] X Research source Walter Brant. Handyman. [14] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source Try using a hairdryer to blow hot air onto the film to get it to adhere to the glass more securely. You can purchase tinted window film online or at most home improvement stores."
    },
    {
      "title": "Frost the window with spray paint to block just a bit of sun.",
      "content": "Frost the window with spray paint to block just a bit of sun. Like a tinted window film, spraying the window glass with frost spray paint is an easy, cost-effective way to block some sun while still letting a bit of light shine through. To frost your windows, first tape off the window frame to protect it from the paint. Then, apply a thin coat of frost spray paint and let it dry completely. [15] X Research source Frosting the window glass is also a great way to get a bit more privacy and keep people outside from being able to look in. 1 coat of spray paint will partially block the sun. If you want to block the sun even more, apply 2 or 3 coats. [16] X Research source Frosted spray paint is sold widely online and at several home improvement stores."
    },
    {
      "title": "Cover your windows with cardboard to completely block the sun.",
      "content": "Cover your windows with cardboard to completely block the sun. If you want to block the sun completely and are looking for a quick, cheap option, covering your windows with cardboard is a good temporary fix. To do this, simply hold the cardboard over the window and use painter’s tape to tape the cardboard to the wall or window frame. [17] X Research source Painter’s tape won’t peel the paint off the window frame or wall when you decide to take the cardboard down."
    },
    {
      "title": "Use aluminum foil for an energy efficient option.",
      "content": "Use aluminum foil for an energy efficient option. Like cardboard, using aluminum foil is an easy way to block the sun from coming in through the windows at little to no cost. To cover your windows with foil, hold the end of the foil just above the window glass and use painter’s tape to adhere it to the window frame or wall. Then, roll the foil down until that part of the window is covered. Repeat this process until the entire window is covered. [18] X Research source Covering your windows with aluminum foil will also insulate the windows, which can help reduce heating and cooling costs."
    }
  ]
}