{
  "url": "https://www.wikihow.com/Chipmunk-Cheeks",
  "title": "Why You Have \"Chipmunk Cheeks\" (& What You Can Do About It)",
  "steps": [
    {
      "title": "\"Chipmunk cheeks\" are puffy cheeks that sit low on the face.",
      "content": "\"Chipmunk cheeks\" are puffy cheeks that sit low on the face. When someone's lower cheeks look swollen or droopy from the front, the person may resemble a chipmunk when its cheeks are stuffed with food. For humans, this look can be temporary or permanent depending on their genetics, lifestyle, and any underlying health problems. Surgery is sometimes an option for people who want to slim their chipmunk cheeks for cosmetic or medical reasons."
    },
    {
      "title": "Genetics",
      "content": "Genetics Some people are born with puffy cheeks and never grow out of them. In this case, their parents, grandparents, and other close family members usually look the same. It's simply in their genetics, meaning no health issue or disorder caused it, and there's no medical reason to change it unless you would prefer a slimmer look in your jaw."
    },
    {
      "title": "Weight gain",
      "content": "Weight gain When a person gains weight in their body, they tend to gain it in their face, as well. If this is the reason for your chipmunk cheeks, then you may also carry extra fat around your jawline and chin. The most effective way to slim down your cheeks is to exercise and eat healthier."
    },
    {
      "title": "Overfilling",
      "content": "Overfilling As people age, their cheeks naturally become thinner and saggier. To bring volume back into their faces, some people decide to get fillers injected into their cheeks. Unfortunately, in many cases, the plastic surgeon adds too much filler or injects it into the wrong areas. This can cause not just chipmunk cheeks but also a pillow face aesthetic, which is when other parts of your face look lumpy and full like a pillow. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Water retention",
      "content": "Water retention Water retention (edema) is a condition where different parts of your body, such as your face, hold onto fluid and become swollen. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This can happen naturally when you get up after lying down for several hours. In this case, your face only looks puffy for a little while. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If your cheeks are always full, though, you might be retaining water for one of these reasons: [4] X Research source A medical condition like heart, kidney, lung, or thyroid disease Medications that produce water retention as a side effect like oral contraceptives, blood pressure medicine, and cancer-treating drugs A poor diet with a lack of vitamin B1 and an overabundance of salt Pregnancy"
    },
    {
      "title": "Bulimia",
      "content": "Bulimia Bulimia is a serious, dangerous eating disorder. Someone with bulimia binge eats (meaning they eat a lot of food at once) and then, to avoid gaining weight, forces themselves to purge it (throw it up). [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source One of the side effects of this disorder is sialadenosis, which is when the salivary glands that produce saliva in the cheeks become overworked and swollen. This happens because your mouth is producing a lot of saliva in response to all the vomiting. [6] X Research source Sialadenosis often goes away on its own. Of course, the best way to stop it from coming back is to overcome the bulimia that's ultimately causing it."
    },
    {
      "title": "Exercise and lead a healthier lifestyle to lose weight in your cheeks.",
      "content": "Exercise and lead a healthier lifestyle to lose weight in your cheeks. If your cheeks are chubby because you're carrying extra fat and you don't like how they look, exercising and eating healthy can help you lose weight in a healthy way . Stopping or limiting smoking and drinking will also help."
    },
    {
      "title": "Address the underlying cause of your water retention.",
      "content": "Address the underlying cause of your water retention. Water retention has many potential causes, so it's important to see a doctor so they can run tests and determine why you're retaining more fluid in your face. In some cases, it may be an easy fix, like switching medications. In others, you may need to be treated for a disease or health condition to find relief and lose that chipmunk cheek appearance."
    },
    {
      "title": "Seek professional help if you have an eating disorder.",
      "content": "Seek professional help if you have an eating disorder. Living with bulimia (or any other eating disorder) can seem like a nightmare come true. The good news is you can stop the unhealthy cycle that's also causing your chipmunk cheeks. The first step is reaching out for help. The National Eating Disorders Association (NEDA) is a helpful online resource where you can get screened, find doctors, and learn about treatments that have helped other bulimia patients recover. You're not alone!"
    },
    {
      "title": "Talk to a plastic surgeon about removing facial filler.",
      "content": "Talk to a plastic surgeon about removing facial filler. If you have chipmunk cheeks or pillow face because of fillers, speak to a plastic surgeon about dissolving some or all of them. The only downside of removing fillers is it can cause your cheeks to sag. Your doctor can discuss the best options available and find a solution that will give you the youthful appearance you want without the puffiness."
    },
    {
      "title": "Get buccal fat removal surgery.",
      "content": "Get buccal fat removal surgery. Buccal fat removal is a cosmetic surgery where the surgeon sucks the fat pads out of the lower part of the cheeks. This procedure is called liposuction. Some people get it because they like how it makes their cheekbones look more defined and their face more sculpted. The downside of buccal fat removal is that as the person gets older and their cheeks thin, their face may start to look unnaturally sunken and hollow. [7] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source If you're considering getting buccal fat removal surgery, know that the fat in your cheeks can decrease naturally with age or weight loss. Consider waiting until you're older or lose weight before getting this cosmetic procedure."
    },
    {
      "title": "Love your chipmunk cheeks as part of who you are.",
      "content": "Love your chipmunk cheeks as part of who you are. If you inherited your chipmunk cheeks from your family or gained weight in recent years, you can always choose to embrace your full face! Chipmunk cheeks may not be trending in the beauty industry right now, but they're a part of you and you shouldn't feel pressured to change them . If your chipmunk cheeks are caused by a health problem like water retention or bulimia, or if you had a poor filler job, consider seeking professional help. A skilled doctor or plastic surgeon can help you get your cheeks back to normal so they don't feel inflamed or swollen anymore."
    }
  ]
}