{
  "url": "https://www.wikihow.com/Be-a-Bubbly-Person",
  "title": "The Best Ways to Have a Bubbly & Likable Personality",
  "steps": [
    {
      "title": "Shake hands with everyone you meet.",
      "content": "Shake hands with everyone you meet. Anytime you meet someone new (or even when you greet someone you have met before), it is a positive and bubbly gesture to shake hands. Make you sure are giving a nice firm and confident handshake. Be sure to make eye contact while you do so! Practice your handshake at home with friends to be sure you use the right amount of pressure and maintain steady eye contact. Repeating the person's name as you shake his or her hand is also a good strategy to seem bubbly. For example, when you meet someone new, say their name back to them once or twice before you introduce yourself, such as by saying, \"Hi Brian. I'm Shirley. It's nice to meet you Brian!\""
    },
    {
      "title": "Make small talk with people you don't know.",
      "content": "Make small talk with people you don't know. Chat up your waiter or barista. Say hello to people on the street! Compliment people on the train. Converse with people in the coffee shop or in your class. Remember that you are an important player in the world. Interact with others as much as possible, and let your bright personality shine. [1] X Research source When you feel at a loss for things to say, think of a compliment. Tell someone you like their sweater, then as a follow up, ask them where they bought it. Tell someone they have a nice voice."
    },
    {
      "title": "Have interesting things prepared to talk about.",
      "content": "Have interesting things prepared to talk about. Being bubbly means you can talk to anyone and always have something to talk about. Find ways to talk to the people around you. Whether this means people at school, at work, or just people you run into out in the world, try to have a few interesting pieces of small talk ready to go. [2] X Research source Practice a few funny stories from your life. Listen to podcasts (such as This American Life) to hear interesting conversation points. Ask questions! Let the other people do the talking for you. If you find yourself at a party, try to talk to every person there for at least a little bit."
    },
    {
      "title": "Try new things.",
      "content": "Try new things. To cultivate a bubbly and charismatic personality, you must come off as passionate and interesting. One way to accomplish both of these things is to regularly try something new! When you seek out new experiences you stoke your passion for life, and at the same time, you generate lots of interesting things to talk about. [3] X Research source Learn a new language. Take a trip. Try a new restaurant. Study a martial art."
    },
    {
      "title": "Make new friends",
      "content": "Make new friends . Your bubbly personality is sure to attract the attention of others. Work on developing a lot of diverse friendships! Whenever you feel a connection with someone, invite them to get lunch or coffee. You may also consider joining some activities in order to meet some new people. Try signing up for a class, a sports team, or a craft circle."
    },
    {
      "title": "Smile!",
      "content": "Smile! A bright smile is one of the most important aspects of a bubbly personality. Studies have shown that even if you are feeling down, forcing yourself to smile can improve your mood! Practice wearing a smile throughout the day. You will exude bubbliness, attract friends, and improve your mood in the process. [4] X Research source"
    },
    {
      "title": "Stick to silly humor rather than deadpan or sarcastic humor.",
      "content": "Stick to silly humor rather than deadpan or sarcastic humor. The type of humor that you use can also make you seem more bubbly. Try to stick to silly humor, such as knock-knock jokes and puns , rather than using sarcastic, dark, or deadpan humor. Try looking up a few silly jokes to tell to people you encounter throughout the day."
    },
    {
      "title": "Practice being optimistic.",
      "content": "Practice being optimistic. It is a misconception that some people are just naturally positive. In reality, optimism takes practice. You can develop a bubbly personality by working to bolster your optimism. [5] X Research source Become aware of your “self-talk,” or the thoughts that you have about yourself. Don’t say anything about yourself that you wouldn’t say about a friend. When you have a negative thought, try to alter it. Instead of thinking, “I’ve never done this before,” try to tell yourself, “This is an opportunity to learn something new.” Try to be optimistic when you talk with your friends too, such as by pointing out the positive in a situation. For example, if a friend is worried about an upcoming exam, don't join in on worrying about the test with your friend. Instead, you might say something like, \"You are a great student! I am confident that you are going to do a great job! But for now, let's enjoy this beautiful day!\""
    },
    {
      "title": "Avoid complaining.",
      "content": "Avoid complaining. Negativity leads to more negativity. So even if something is bothering you, try to let it go rather than complaining about it. Complaining only spreads your misery around to others (which is decidedly un-bubbly). Embody a bubbly disposition by breaking the habit of complaint. If you really need to air your complaints, try writing them down. Another option is to speak to a therapist."
    },
    {
      "title": "Develop some form of stress-relief.",
      "content": "Develop some form of stress-relief. If you want to exude a bubbly disposition, you can’t be hampered down by stress. Find some methods of stress-relief that work for you and practice them regularly. [6] X Research source Get a massage. Go for a walk. Diffuse essential oils (like lemon or lavender) in your home or office. Try to relieve your stress before it even becomes a problem."
    },
    {
      "title": "Express your gratitude.",
      "content": "Express your gratitude. When you feel genuine gratitude in your daily life, it becomes much easier to exude bubbliness. Develop and grow your experience of gratitude by keeping a gratitude journal. Get a notebook, and write down five things you are grateful for each day. In time, your gratitude will grow and grow!"
    },
    {
      "title": "Replace the word “have” with the word “get.”",
      "content": "Replace the word “have” with the word “get.” The chores and monotony of daily life can easily bring you down. You may find yourself grumbling, “I have to go to work,” or, “I have to go to school,” or even, “I have to pay my rent.” But try swapping out just one little word, “have,” for the more positive verb, “get.” When you say that you “get to go to work,” it reminds you to be grateful that you have a job. When you say that you “get to pay rent,” it reminds you to be grateful both that you have a place to live, and that you can afford to pay for it."
    },
    {
      "title": "Avoid unnecessary drama.",
      "content": "Avoid unnecessary drama. There is a Polish proverb that goes, “Not my monkeys, not my circus.” This saying reminds us that we do not need to engage in the drama of others. When you encounter conflicts that do not directly involve you, try not to intervene. Refrain from gossiping! Avoid talking about people behind their backs. If you are constantly surrounded by the drama of others, consider surrounding yourself with new people."
    },
    {
      "title": "Look your best.",
      "content": "Look your best. In order to be bubbly, you need to feel good about yourself. Take some time each day to look your best: groom yourself, wear clothes that make you feel good, and spend a little time on your hair, make-up, or other beauty rituals. When you take a little time to look your best, you will feel better and attract more positive attention from others."
    },
    {
      "title": "Focus on the positive.",
      "content": "Focus on the positive. Write down a list of things that you like about yourself. This can be anything from your eyes, to the way that you are kind to everyone you meet. Aim to include at least ten attributes on your list. Read this list over daily. It is certain to make you feel good about yourself. Once you have identified some of your best qualities, aim to let these qualities shine. For example, if you have beautiful eyes, wear eye makeup that accentuated this. If you are smart and well-versed in philosophy, practice ways to lead with this in conversation."
    },
    {
      "title": "Carry yourself proudly.",
      "content": "Carry yourself proudly. Make sure that when you walk, you hold your back straight and pull your shoulders back, maintaining good posture. When you talk to people, look them in the eye and smile when appropriate. These are all good ways to improve your self-confidence and give off a bubbly attitude. The shape you make with your body also affects your hormonal response. Simply standing up straight can make you (on a hormonal level) more confident and better at dealing with stress."
    },
    {
      "title": "Use daily affirmations.",
      "content": "Use daily affirmations. You can use daily affirmations to and cultivate a bubbly personality. Affirmations are short, positive statements about yourself. You can post these any place that you’ll see each day. You will want to state these affirmations out loud. Examples include: I am beautiful, I am worthy, I am confident, or I deserve to be happy. Consider placing these near your bathroom mirror, above your kitchen sink, or any place you will look at them often."
    },
    {
      "title": "Take good care of yourself.",
      "content": "Take good care of yourself. Taking good care of yourself includes eating well, drinking water, staying active, and getting enough rest. Taking good care of yourself works to boost your self-esteem (and make you more bubbly) in two ways: first, when you feel cared for, you are more likely to cultivate self-love, and second, when you are in good health, your emotions are more stable. [7] X Research source Focus on eating vegetables, fruit, lean meats, and whole grains. Avoid sugar, alcohol, and fast food. Try to sleep 8 hours per night. Drink at least 8 glasses of water per day. Aim for at least 30 minutes of physical activity each day, such as kayaking, walking around the block, playing tennis, or dancing to music."
    }
  ]
}