{
  "url": "https://www.wikihow.com/Approach-a-Bisexual-Guy-in-the-Closet",
  "title": "How to Approach a Bisexual Guy in the Closet",
  "steps": [
    {
      "title": "Pay attention to body language.",
      "content": "Pay attention to body language. The way that a guy holds himself and behaves around you may give you your first sign that he is interested in you. When people are attracted to each other, they tend to face each other, lean in close or stand close, and do subtle things like: [1] X Research source Smiling and making eye contact . This is the classic sign of interest. If a guy is attracted to you, then he will probably make eye contact with you even if you are across the room and he may also flash you a smile. Raising an eyebrow . This is called an eyebrow flash and it is a quick involuntary movement that people make when they are attracted to someone. Watch for a quick raised eyebrow when you first see him. Parting lips . People also tend to part their lips slightly when they are attracted to someone. This is a quick gesture that will happen right as you make eye contact if he’s interested in you."
    },
    {
      "title": "Watch for preening gestures.",
      "content": "Watch for preening gestures. Self-grooming or preening gestures are another indicator that he might be interested in you. If you notice that he is adjusting his tie, smoothing his hair, or otherwise trying to improve his appearance, then this is also a good sign that he is attracted to you. [2] X Research source For example, you might notice that he is absent-mindedly smoothing out his shirt while he is talking to you, or stroking his facial hair to ensure that it looks neat."
    },
    {
      "title": "Note any intimate touches.",
      "content": "Note any intimate touches. If he is really interested in you, then he might touch you in a gentle way, such as by placing a hand on your arm or shoulder, even if it is only for a moment. If he seems to be touching you now and then, then he might be doing so to show his interest. [3] X Research source For example, if you tell a joke and he laughs while grasping your forearm with his hand, then this could be his way of showing that he finds you attractive."
    },
    {
      "title": "Consider how the person acts with other people.",
      "content": "Consider how the person acts with other people. You might also try comparing his behavior towards you with his behavior towards other to determine if he is interested in you. If he is warmer and more affectionate towards you than anyone else (male or female), then this might be a sign that he thinks you are attractive. For example, if he laughs at all of your jokes, but barely cracks a smile at anyone else’s jokes, then he may be interested in you. [4] X Research source"
    },
    {
      "title": "Smile and make eye contact.",
      "content": "Smile and make eye contact. Classic flirtation tactics like smiling and making eye contact are good places to start. [5] X Research source Whether you see him from across a room or you are sitting across a table from each other, smiling and making eye contact is a good way to show your interest. However, smiling and making eye contact is a friendly gesture, so it is a lower stakes version of flirtation that some other bolder options. Try making eye contact for a few seconds and then look away for a moment. Then, look at him again and see if he is still looking at you. If he is, then this might indicate that he finds you attractive. Flash him a smile to send the message that you also find him attractive."
    },
    {
      "title": "Strike up a conversation.",
      "content": "Strike up a conversation. Before you ask a guy out, you will probably want to get to know him and find out if you two have anything in common. Otherwise, it might turn into a boring date. Ask him about his interests, likes, and dislikes, and background to start getting to know him. Some questions you can ask him include: What do you do for a living? What do you like to do for fun? What kind of music do you like? Did you grow up around here? Do you have any pets? Are you having a good time?"
    },
    {
      "title": "Give compliments.",
      "content": "Give compliments. Compliments are always appreciated, whether you are flirting with someone or not. By giving the guy a compliment, you can increase his confidence and send a message that you are attracted to him. [6] X Research source If he’s interested, then might reciprocate with a compliment of his own. If he’s not interested, then he can politely say thanks and then change the subject. Try saying something like, “You have a great sense of style! I love your suit.” Or, you can be a bit bold and say something like, “I am sorry if I am staring, but you have gorgeous eyes.”"
    },
    {
      "title": "Try some playful touching.",
      "content": "Try some playful touching. [7] X Research source Giving him a few playful touches is a fun way to flirt and gauge his interest at the same time. Try some brief, gentle touches to let him know that you are attracted to him. These gestures may also give him the confidence to touch you back. For example, you can try touching him on the arm or shoulder when he says something that you find interesting or funny. Or, if you want to be a little bolder, then you can try placing a hand on his back to guide him as you are walking through a crowded place together. Reader Poll: We asked 882 wikiHow readers, and 63% of them agreed that playful banter is the type of teasing that’s the strongest indicator you have chemistry with a guy. [Take Poll]"
    },
    {
      "title": "Hint at your interest.",
      "content": "Hint at your interest. A subtle approach might be best if you think that there is a chance he might not be into guys. If you are still unsure about whether or not this guy is interested in dating you, then you might say something to hint at your interest in a date. This is a lower stakes way of indicating your interest that will give him the opportunity to politely decline. For example, you could try saying something like, “I need a date for this movie I want to check out on Saturday. You wouldn’t happen to know a guy who would accompany me, would you?” Or, you could try saying, “I really want to ask this cute guy out, but I am not sure if he dates guys or not. What would you do in my situation?”"
    },
    {
      "title": "Be direct.",
      "content": "Be direct. If hints don’t seem to work or if you just want to find out for certain if this guy is interested in dating you, then take a direct approach. Ask him in a straightforward way if he dates guys. If he says yes, then you can ask him if he’d like to go on a date with you. For example, you might try simply saying something like, “Do you also date guys, or just women?” If he confirms that he dates both men and women, then you could try saying something like, “That’s awesome! We should hang out sometime.” If he says no, then there might be a little awkwardness after. However, this will pass. Try to say something reassuring to return the conversation to a friendly space. For example, you might say something like, “Okay, cool. I just ask every guy I meet because I can never tell, you know?”"
    },
    {
      "title": "Try suggesting a place to go.",
      "content": "Try suggesting a place to go. If you are getting lots of positive sign from him, then you can go ahead and ask him on a date. Pick something that you will both enjoy based on your conversation and suggest a specific day and place to meet up. For example, you could say something like, “Since we both love horror movies, we should check out that new one on Saturday. What time works for you?” Or, try saying something like, “I really want to check out that new Indian restaurant, too. Let’s go together this Thursday!” [8] X Research source"
    }
  ]
}