{
  "url": "https://www.wikihow.com/Be-Subtle-About-Getting-a-Guy-to-Call-You",
  "title": "How to Be Subtle About Getting a Guy to Call You",
  "steps": [
    {
      "title": "Put together a study group and invite him.",
      "content": "Put together a study group and invite him. If you’re in school and have any classes with the guy you like, put together a study group with people in your class and tell everyone you need their numbers to plan the group. This is a subtle way to exchange numbers with the guy you like, and also have a reason for him to call or text you. [1] X Research source You could even offer to study with him one on one for an upcoming exam, or ask if he ever wants to do homework together. Then, ask to exchange numbers so you can plan a time to meet up to study."
    },
    {
      "title": "Use social media.",
      "content": "Use social media. If you are friends with the guy you like on social media, post that you have a new phone and need everyone’s numbers. If you’re close enough with him, he might send you his number, and you can send him a text so he has yours. [2] X Research source #* If you aren’t friends with him on social media, add him! This is another easy way to get him to communicate with you that often takes off a little bit of the pressure."
    },
    {
      "title": "Ask to borrow his phone.",
      "content": "Ask to borrow his phone. Pretend you need to use his phone, then once he gives it to you, program your number into it. You could also ask to see his phone so you can show him something online, or tell him you’ve misplaced your phone and need him to call it. Then, you will have his number stored in your call log, and you can text him with yours! Never take his phone without asking. This is risky, and also could be seen as pushy, or invasive. Casually ask to borrow his phone, instead."
    },
    {
      "title": "Create an excuse to have him call.",
      "content": "Create an excuse to have him call. If he isn’t picking up on your hints about wanting him to call you, you can find a reason to call him instead. Maybe you missed class one day last week and need notes or the homework assignment, or maybe he lives in your apartment complex and you need someone to pick up your mail the day you’ll be out of town. Find a casual reason to ask for his number, and call him yourself. [3] X Research source If you don’t know him very well, or at all, this option might be more difficult."
    },
    {
      "title": "Use your surroundings.",
      "content": "Use your surroundings. If you met him at a coffee shop, strike up a conversation about the best coffee places in the area, and ask for his suggestions. Ask him if he would like to give you a call later on and plan a time to hit up a different shop. If you know him from school, ask him if he knows anyone who might be able to tutor you in something, and ask to exchange numbers in case he knows of someone. Think of a reason you might need to exchange numbers that doesn’t involve explicitly asking him on a date. That way, the ball will be in his court, so to speak."
    },
    {
      "title": "Mention casually that you’ve got no plans.",
      "content": "Mention casually that you’ve got no plans. Once he has your number and knows you want him to call, give him a reason to make the call. Let him know you’re free, and then he might get the hint that you want him to call and make plans with you. Alternatively, you could mention you do have plans, like an outing or event you’re attending, and ask him to give you a call if he would like to come along."
    },
    {
      "title": "Remind him that he has your number.",
      "content": "Remind him that he has your number. Once he has your number, if he doesn’t call right away, you can always find subtle ways to remind him he has it. For example, you might be talking about a big test coming up, and say, “You can always give me a call if you need help studying.” If you’re talking about potentially hanging out or spending time together, you could also say, “You have my number, right?”"
    },
    {
      "title": "Make loose plans to encourage him to call.",
      "content": "Make loose plans to encourage him to call. More often than not, guys aren’t going to be very savvy to subtlety, so you may have to give him some hints. You don’t have to demand it, or be too forward. Just let him know you want him to give you a call. You can even ask him to call you about something specific, so it seems less romantic. Try something like, “Give me a call if you ever want to check out that new movie” or “Call me if you need help with the homework.” Say something like, “I’d really like it if you gave me a call sometime.” This way, you’re letting him know you’re interested and want him to call, but not demanding it or giving him any kind of deadline to do so."
    },
    {
      "title": "Make friends with his friends.",
      "content": "Make friends with his friends. If you already have a mutual friend or two, use that friend as a way to talk to him, or as a conversation starter. Or, you could ask your mutual friend to introduce you if you don’t know the guy you like very well yet. Hang out as a group and get on his radar so he’s more likely to call. Make sure you don’t say anything negative about your mutual friends to the guy you like. You don’t want to come off as a person who talks behind other people’s backs, or as a negative person in general."
    },
    {
      "title": "Join a club he’s in.",
      "content": "Join a club he’s in. If the guy you like is part of a club or organization at school, join up! Not only will you see each other at meetings, you will also have something new in common, and a new reason to need to talk to each other, which will give him a reason to call. Use the club as a conversation starter, then you can veer off into other topics. Show him you’re actually interested in the club you joined, and not just because of him."
    },
    {
      "title": "Go to places you know he frequents.",
      "content": "Go to places you know he frequents. Even if he’s a football player and you hate football, hit up practice one afternoon, or go to a game. If you know he does his laundry or drops his dry cleaning at a certain location, make that your new laundry spot, too. If he always eats lunch at a certain place, you should eat there, too. The more you pop up in his day to day life, the more you’ll be on his mind, and the more likely he will be to call. [4] X Research source Try not to be too overbearing with this. You don’t want to make him feel like you’re stalking him, or following him around."
    },
    {
      "title": "Stay busy and don’t worry.",
      "content": "Stay busy and don’t worry. If you sit around waiting for him to call, you might drive yourself crazy. Go about your everyday life, and try to forget about it. That way, when he does call, it won’t feel like you were waiting for too long. [5] X Research source Don’t overthink it if he doesn’t call you right away, or even if he doesn’t call at all. More than likely, he got busy and forgot, or maybe he’s just as nervous as you are and isn’t sure when to make that move."
    },
    {
      "title": "Avoid calling him first.",
      "content": "Avoid calling him first. Give him a chance to call you. Guys like a challenge, so don’t throw yourself at him by calling him too soon after asking him to call you. Make sure he feels like you’re still out of his reach, so he has something to go after. [6] X Research source Since you were the one to ask for the call, let him be the one to make the next move. Let him feel like the ball is in his court, so to speak. Plus, calling someone out of the blue can put too much pressure on them to answer the phone."
    },
    {
      "title": "Keep the first call brief.",
      "content": "Keep the first call brief. Keeping it under 10 minutes is a good idea. Most guys don’t like to spend a lot of time on the phone, so if you keep talking too long, he might get bored and not want to call you again. [7] X Research source Try to have a purpose for the call. For example, have a few things you want to talk about already in your mind before he calls. That way, you won’t end up with any awkward dead air, and neither of you will get bored."
    }
  ]
}