{
  "url": "https://www.wikihow.com/Clean-an-Airbrush-Gun",
  "title": "The Best Way to Clean an Airbrush Gun",
  "steps": [
    {
      "title": "Create a clean workspace.",
      "content": "Create a clean workspace. You will have to take the airbrush gun apart to clean it thoroughly. Clear a space where you can set the parts as you take the airbrush apart. Place all the cleaning supplies near you. [1] X Research source"
    },
    {
      "title": "Dump out any paint that is inside the airbrush gun.",
      "content": "Dump out any paint that is inside the airbrush gun. Turn it over and shake out the gun over a waste container. You want to get rid of all the excess paint from the gun. [2] X Research source"
    },
    {
      "title": "Unscrew the needle cap, then remove the nozzle cap.",
      "content": "Unscrew the needle cap, then remove the nozzle cap. They are both on the front of the gun covering the needle point. The needle cap is a small, round piece of metal at the end of the gun. The nozzle cap is slightly bigger and flares out from top to bottom. Turn to remove them. If you have trouble turning the caps with your fingers, use pliers but clamp down as lightly as possible. After removing the nozzle cap, the point of the needle will be exposed. Pick up the airbrush gun from the middle to avoid getting stuck by the needle."
    },
    {
      "title": "Detach the nozzle.",
      "content": "Detach the nozzle. It will be exposed after you remove the nozzle cap. Use the small wrench that came with the airbrush. If you don’t have the wrench, you may be able to remove it with your fingers or with needle-nosed pliers. The nozzle is very small and easy to lose; carefully place it with the other parts. [3] X Research source"
    },
    {
      "title": "Take off the handle.",
      "content": "Take off the handle. Grasp the back part of the gun and turn to remove the handle. Taking it off exposes the needle assembly. Set the handle aside with the other parts."
    },
    {
      "title": "Remove the needle chucking nut.",
      "content": "Remove the needle chucking nut. After you remove the cover, you'll find the chucking nut threaded part of the way on the needle. It has threads on the front end to make it easy to grip, then it narrows toward the back of the gun. After the nut is unscrewed, the needle will feel loose."
    },
    {
      "title": "Pull out the needle.",
      "content": "Pull out the needle. You can pull the needle out in either direction, but you may want to pull it out of the front end of the gun. Pulling the needle out the back can spread paint into the middle of the airbrush gun and clog it. [4] X Research source"
    },
    {
      "title": "Place the parts into a glass bowl.",
      "content": "Place the parts into a glass bowl. Select a bowl that is large enough to hold all the parts. Don’t use a metal bowl, as the cleaning liquids could react with the metal and damage the airbrush parts."
    },
    {
      "title": "Fill the bowl with 2 cups of warm distilled water mixed with 2 tablespoons of white distilled vinegar.",
      "content": "Fill the bowl with 2 cups of warm distilled water mixed with 2 tablespoons of white distilled vinegar. Let the parts soak for 5 minutes; they don’t need to sit in the cleaning liquid very long. It’s best not to soak them overnight, prolonged exposure to the cleaning fluid can wear away lubrication inside the airbrush that helps it perform well. [5] X Research source You can use a commercial airbrush cleaner or even rubbing alcohol, but the vinegar and distilled water mix usually works well. [6] X Research source"
    },
    {
      "title": "Wipe the airbrush parts with a damp paper towel.",
      "content": "Wipe the airbrush parts with a damp paper towel. Carefully clean all the visible surfaces on each piece. Use a cotton swab to get into corners or tighter spots. The needle is very sharp, so clean it carefully. Wipe from the back of the needle toward the front to prevent getting stuck. [7] X Research source"
    },
    {
      "title": "Clean the channels inside the gun with a small pipe cleaner.",
      "content": "Clean the channels inside the gun with a small pipe cleaner. Pick a size that just fits inside. Move it back and forth inside the airbrush and turn it a few times to clean thoroughly."
    },
    {
      "title": "Use a cotton swab to clean the paint cup.",
      "content": "Use a cotton swab to clean the paint cup. Wipe it around to clean all the inside surfaces. Don’t forget to clean inside the narrow funnel where the paint flows out. If you are cleaning a siphon-feed airbrush, you may need a slightly wider pipe cleaner for the inside of the channel where the paint feeds into the airbrush. [8] X Research source"
    },
    {
      "title": "Rinse all of the parts with warm distilled water.",
      "content": "Rinse all of the parts with warm distilled water. Once all the parts have been cleaned, rinse them thoroughly to remove traces of the cleaning liquid. Warm distilled water works best."
    },
    {
      "title": "Set the parts on a towel to dry.",
      "content": "Set the parts on a towel to dry. Gently shaking off excess moisture can help the parts dry more quickly. Allow the parts to dry completely before putting the airbrush gun back together."
    },
    {
      "title": "Slide the needle into the chucking guide.",
      "content": "Slide the needle into the chucking guide. Start from the back of the airbrush and push it forward with the pointy side going in first. Slowly and gently push it toward the front of the gun. It will get harder to push as it gets near the front. Stop pushing when the tip just barely sticks out of the front. [9] X Research source If you feel resistance as you first push the needle in, pull the needle back out a little bit, press and hold the trigger down, then push the needle through again. The needle might be bumping into the trigger."
    },
    {
      "title": "Insert the nozzle and tighten.",
      "content": "Insert the nozzle and tighten. Because the nozzle is so small, it may be easier to insert it by using needle-nosed pliers. Tighten the nozzle using the small wrench that came with the airbrush. The nozzle is tight enough when it's no longer easy to turn it."
    },
    {
      "title": "Screw on the needle chucking nut.",
      "content": "Screw on the needle chucking nut. Slide it over the needle until it reaches the threads. The narrow end should face toward the back of the gun. Turn to tighten it."
    },
    {
      "title": "Replace the nozzle cap and the needle cap.",
      "content": "Replace the nozzle cap and the needle cap. Slowly place the nozzle cap over the needle point with the narrow end pointing away from the gun. Turn to screw it tightly in place. Carefully place the needle cap over the nozzle cap and turn to tighten it. If you can’t tighten the caps with your fingers, use pliers. Grip the cap gently and turn to screw into place."
    },
    {
      "title": "Attach the back cover.",
      "content": "Attach the back cover. Slide the cover over the needle assembly. Turn to screw it tightly into place."
    },
    {
      "title": "Test the airbrush gun to make sure it works correctly.",
      "content": "Test the airbrush gun to make sure it works correctly. Add some water to the color cup and spray it to make sure the gun is working properly. [10] X Research source"
    }
  ]
}