{
  "url": "https://www.wikihow.com/Clean-a-Faucet",
  "title": "How to Clean a Faucet",
  "steps": [
    {
      "title": "Use a dish soap mixture.",
      "content": "Use a dish soap mixture. Opt for a mild detergent to prevent damage to the faucet surface. Pour 1 to 2 tablespoons (15 to 30 mL) of dishwashing liquid in a small bowl. Add 2 cups (0.47 L) of warm water. Mix the ingredients with a dining utensil to create some suds. [1] X Research source"
    },
    {
      "title": "Scrub the faucet.",
      "content": "Scrub the faucet. Soak a regular washrag in the soap mixture. Move in a gentle circular motion across the surface. Wash the base, handle, and neck of the faucet thoroughly. [2] X Research source"
    },
    {
      "title": "Scrub grimy areas with a toothbrush.",
      "content": "Scrub grimy areas with a toothbrush. Cover the bristles of an old toothbrush with baking soda. Add a few drops of water to create a baking soda paste , if you choose. Move in a gentle back-and-forth motion until the surface is free of grime. [3] X Research source"
    },
    {
      "title": "Clean small cracks with dental floss.",
      "content": "Clean small cracks with dental floss. Cut off a 12 inch (30.48 cm) piece of floss. Place the string between the cracks or spaces in the surface of the faucet. Move in an up-and-down motion, as you would when you floss your teeth. [4] X Research source"
    },
    {
      "title": "Rinse the surface with cold water.",
      "content": "Rinse the surface with cold water. Dampen a clean cloth. Move it over the surface to clear away the soap mixture, grime, and gunk from the floss cleaning. Continue to rinse until the surface is free of dirt."
    },
    {
      "title": "Dry the surface with a microfiber cloth.",
      "content": "Dry the surface with a microfiber cloth. Use gentle back-and-forth strokes along the entire surface. Continue until the surface is completely dry. This step will also leave a nice shine."
    },
    {
      "title": "Wear rubber gloves.",
      "content": "Wear rubber gloves. They'll protect your skin from the chemicals and irritants in many calcium removers. Make sure they're free of dirt before you start to clean. Use gloves that cover all or most of your forearm, in case the cleaner splashes. You can skip this step if you're using vinegar."
    },
    {
      "title": "Dilute calcium remover in water.",
      "content": "Dilute calcium remover in water. Mix one part calcium remover, such as CLR, and one part water in a bowl or old plastic container. Choose a container bound for the recycling bin. For most taps, 1 to 2 tablespoons (15 to 30 mL) of each ingredient is enough. [5] X Research source If you don't have much calcium buildup, you can use undiluted white vinegar instead of CLR and water. This method will take much longer, about 24 hours, but it's harmless to bare skin and safe for most faucet finishes. [6] X Research source Avoid using calcium remover or vinegar on iron or nickel faucets. These cleaners will remove the finish along with the gunk you're cleaning. Read your owner's manual or contact a local plumber for advice. [7] X Research source"
    },
    {
      "title": "Pour the mixture into a plastic baggie.",
      "content": "Pour the mixture into a plastic baggie. Use a regular-sized sandwich bag. It doesn't matter if the baggie has a zip seal. Pour carefully. If you're concerned about spilling the mixture, pour it into the baggie through a funnel. [8] X Research source"
    },
    {
      "title": "Attach the baggie to the faucet.",
      "content": "Attach the baggie to the faucet. Hold the baggie at a slight angle so that the mixture builds up in one of the corners. Carefully slide the open end of the baggie over the faucet. Then submerge the tap in the mixture. Securely fasten the baggie to the faucet with a rubber band. Let the tap soak for one to two hours. [9] X Research source"
    },
    {
      "title": "Remove the baggie.",
      "content": "Remove the baggie. Undo the rubber band. Carefully slide the baggie off of the faucet. Do this slowly. Read the label on the cleaner to check for disposal instructions. Cleaners like CLR are biodegradable and can be poured down the drain or toilet."
    },
    {
      "title": "Scrub off the loosened buildup.",
      "content": "Scrub off the loosened buildup. Use an old toothbrush or magic eraser. Scrub in a gentle back-and-forth motion. Periodically rinse the toothbrush or magic eraser if it gets too gunky. Continue to do this until the buildup is completely removed. [10] X Research source"
    },
    {
      "title": "Dry the faucet with a microfiber cloth.",
      "content": "Dry the faucet with a microfiber cloth. Move in a gentle circular or back-and-forth direction. Pay special attention to the tap to slow future calcium buildup. Continue until the faucet is completely dry."
    },
    {
      "title": "Dry the faucet with a clean dish towel.",
      "content": "Dry the faucet with a clean dish towel. A wet surface will dilute the vinegar and result in an incomplete cleaning job. Move the towel over the entire base of the faucet. Make sure every last drop of water is absorbed. [11] X Research source"
    },
    {
      "title": "Use white vinegar.",
      "content": "Use white vinegar. Fill a small bowl with undiluted white vinegar. Soak a washrag or old piece of clothing in the vinegar until it's saturated. Don't wring out any excess. [12] X Research source"
    },
    {
      "title": "Drape the cloth over the affected areas.",
      "content": "Drape the cloth over the affected areas. Cover them completely. Press down on the cloth to make sure it has complete contact with the surface. Leave the cloth in place for at least an hour. If any vinegar is left in the bowl, pour it over the cloth to further saturate the calcium-coated area. [13] X Research source"
    },
    {
      "title": "Scrub the faucet with a scrub sponge.",
      "content": "Scrub the faucet with a scrub sponge. Use the textured side of the sponge. Use a back-and-forth motion. Don't scrub too hard, since this can scratch the finish. You should see the calcium deposits start to come off. [14] X Research source"
    },
    {
      "title": "Repeat the process for stubborn buildup.",
      "content": "Repeat the process for stubborn buildup. Resaturate the rag in vinegar and let it sit on the deposits. Cover only the areas where you still see calcium buildup. Let the cloth sit for another hour and scrub the affected areas to remove the calcium. [15] X Research source"
    },
    {
      "title": "Dry the faucet with a microfiber cloth.",
      "content": "Dry the faucet with a microfiber cloth. Use gentle circular or back-and-forth strokes. This will polish the surface in addition to drying it. Continue until no water remains. [16] X Research source"
    }
  ]
}