{
  "url": "https://www.wikihow.com/Celebrate-Boxing-Day",
  "title": "How to Celebrate Boxing Day",
  "steps": [
    {
      "title": "Volunteer for church functions.",
      "content": "Volunteer for church functions. Find out if your church follows the tradition of collecting donations from the congregation and distributing them to the less fortunate on Boxing Day. [1] X Research source Ask if they need any assistance. If they do, donate your time."
    },
    {
      "title": "Donate your time elsewhere.",
      "content": "Donate your time elsewhere. Embody the spirit of charitability by giving and finding organizations who need volunteers for programs that day. Collect food and/or donations for a food drive. Assist in a soup kitchen. Donate blood. Contribute to improving the lives of others."
    },
    {
      "title": "Plan ahead.",
      "content": "Plan ahead. Since charity is needed all year round, use Boxing Day to plan your calendar for the upcoming year. Search online for future events in which you could be of assistance. Plan a budget so you can donate to your favorite charities on a regular basis."
    },
    {
      "title": "Tip people who provide you service.",
      "content": "Tip people who provide you service. If you haven’t already, give a holiday bonus to your doorman, postal worker, delivery person, and anyone else who provides you with regular service. [2] X Research source Although this used to be a strong tradition that originated back when house servants lived onsite with their employers, offering holiday bonuses on Boxing Day itself has waned since carrying over to the modern era. Since many of the people you wish to tip may have the day off, be sure to tip them ahead of time. [3] X Research source"
    },
    {
      "title": "Be a Wren boy.",
      "content": "Be a Wren boy. Buy a stuffed bird and a birdcage light enough to carry. Dress up in fancy women’s fashion. Parade around town and ask for donations from passersby on the street, customers at pubs and restaurants, or by knocking on houses from door to door. [4] X Research source Originally actual wrens were hunted down and killed to use as props, but stick to using a stuffed bird toy instead to avoid upsetting people today. In earlier days, donations were usually collected to fund a dance on the same night. Although some localities might still have this tradition, many collections are now donated to charity. “Good King Wenceslas” is a popular carol that’s specific to Boxing Day. The album “Bells of Dublin” by the Irish band The Chieftains also features three Boxing Day carols: “The St. Stephen’s Day Murders,” “The Arrival of the Wren Boys” and “A Wren in the Furze.”"
    },
    {
      "title": "Join the fox hunt.",
      "content": "Join the fox hunt. Although killing the fox has been largely criminalized, the fox hunt still endures as a popular Boxing Day tradition. Don the red jacket, mount your horse, and participate in the legal substitute of flushing out foxes with your hounds (without killing the fox) or chasing a human substitute instead."
    },
    {
      "title": "Play football.",
      "content": "Play football. Since football (or soccer, for you Americans) is such an important part of Boxing Day traditions as well as the overall culture of the countries that celebrate it, get out of the house and burn off some of those holiday calories. Organize a neighborhood pickup game. Challenge your family to a match. If you’re on a league team, set up a match with a local rival."
    },
    {
      "title": "Attend games and races.",
      "content": "Attend games and races. Go to any one of the many horse races, soccer matches, and cricket matches scheduled on Boxing Day. Don’t worry about traveling; most teams make sure to play another that’s nearby so neither the players nor their fans have to go too far from home."
    },
    {
      "title": "Take a dip.",
      "content": "Take a dip. Participate in one of many icy swims organized on Boxing Day. Wear something absurdly fancy, take a plunge into the winter sea, and win a medal for bravery while warming back up in front of a beach bonfire with all the other daring souls. Many of these events raise money for charity, so consider it a good deed done!"
    },
    {
      "title": "Visit family.",
      "content": "Visit family. If your extended family is too large for you to see everyone on either Christmas Eve or Christmas Day, use Boxing Day to include them in your holidays. Have a formal holiday feast or keep true to the more relaxed spirit of Boxing Day and have a simpler get-together. [5] X Research source Popular food served as a Boxing Day meal includes leftover Christmas turkey served as sandwiches or another full meal, or alternately a cold ham or roast beef served as a buffet to minimize prep and cooking. In the UK and Canada, many restaurants welcome large parties for Boxing Day carveries, or buffets serving roast meats carved to order."
    },
    {
      "title": "Spend time with friends.",
      "content": "Spend time with friends. If you’ve already checked family off your list of holiday duties, feel free to make Boxing Day a time to spend with friends instead. Go to a sporting event or watch one at the local pub. Or just hang out together at someone’s home. [6] X Research source"
    },
    {
      "title": "Keep it casual.",
      "content": "Keep it casual. Put the formality of the holidays behind you. Host a potluck where everyone’s free to get rid of their leftovers. Make it a pajama party if you want to make it even less formal and more inviting. Tune into the football marathon on TV, zone out, and be merry. [7] X Research source"
    },
    {
      "title": "Go on an outing.",
      "content": "Go on an outing. Since sports and exercise are such a large part of Boxing Day, stay in the spirit and have the whole family get some exercise. Use this extra time together to go for a long hike through the woods or walk through the streets. [8] X Research source"
    },
    {
      "title": "Attend a pantomime.",
      "content": "Attend a pantomime. Take the young kids to see this family-friendly piece of lively theater based on fairy tales, which is traditionally performed on Boxing Day. Sing along with the musical numbers and interact with the performers onstage. [9] X Research source"
    },
    {
      "title": "Chase the sales.",
      "content": "Chase the sales. Take advantage of the more modern tradition of stores opening the day after Christmas, offering deep discounts. Go to larger chain stores and shopping malls, since smaller shops are more likely to remain closed for the holiday. Check the store’s hours for Boxing Day ahead of time, since they may stick to a Sunday schedule regardless of what day of the week it is, or open even earlier than normal. Arrive early since lines may form outside before stores open."
    },
    {
      "title": "Stay true to Boxing Day’s roots.",
      "content": "Stay true to Boxing Day’s roots. Since charity is considered to be an important aspect of the holiday, use the discounts to shop for others who may lack the means to afford even these sales. For example, buy coats, blankets, and other winter gear for the homeless."
    },
    {
      "title": "Make it a family trip.",
      "content": "Make it a family trip. Retain some of the holiday spirit and make it an outing for the whole family. Include gift cards among your other Christmas presents to family so they can spend them the day after. Build a tradition of your own around the annual sales."
    }
  ]
}