{
  "url": "https://www.wikihow.com/Build-a-Ballista",
  "title": "How to Build a Ballista",
  "steps": [
    {
      "title": "Drill holes through a pair of 6 in (15 cm)-long popsicle sticks.",
      "content": "Drill holes through a pair of 6 in (15 cm)-long popsicle sticks. Measure 1 in (2.5 cm) from the ends and mark the spots with a pencil. Before working on the sticks, lay down a piece of cardboard to protect your work surface from damage. Then, use a drill bit 1 ⁄ 4 in (0.64 cm) in diameter to create the holes. [1] X Research source The simplest way to create a ballista is with inexpensive popsicle sticks, available online, at craft supply store, and other areas. If you wish to make a larger ballista, trying using larger pieces of wood or foam in place of the popsicle sticks."
    },
    {
      "title": "Poke a second, smaller hole next to each of the bigger ones.",
      "content": "Poke a second, smaller hole next to each of the bigger ones. Measure about 1 ⁄ 4 in (0.64 cm) along the stick’s length from one of the existing holes. Use a steel probe 1 ⁄ 16 in (0.16 cm) in diameter or a similar sharp tool to poke all the way through the wood. Position the hole so it’s slightly lower, closer to the edge of the stick, than the larger hole. Create a matching hole on the opposite end of the first stick and create corresponding holes on the second stick. [2] X Research source Each popsicle stick has 4 holes when you’re finished, a pair of holes on either end. The bigger holes are used to secure the ballista frame together, while the smaller holes are for the launcher. To test the smaller holes, try squeezing a wood cocktail skewer through them. Get skewers about 7 ⁄ 64 in (0.28 cm) in diameter. Widen the holes as needed to fit the skewers."
    },
    {
      "title": "Cut a pair of wood blocks to 1 1⁄2 in × 1 in (3.8 cm × 2.5 cm).",
      "content": "Cut a pair of wood blocks to 1 1 ⁄ 2 in × 1 in (3.8 cm × 2.5 cm). The easiest way to do this is to purchase wood crafting blocks. If you can’t find the exact size you need, cut the blocks to size with a crafting knife or another tool. Get blocks that are about 1 in (2.5 cm) tall. Scrape away the excess wood until both blocks are the same size. [3] X Research source Shop online or visit a craft store to see what kind of wood blocks are available. You can use scrap wood if you wish, but crafting blocks are much smoother and easier to work with. Be careful when using a crafting knife. The blocks are small, so it’s easy to slip while handling the blade. Work slowly to avoid potential accidents."
    },
    {
      "title": "Glue the blocks to the ends of the popsicle sticks.",
      "content": "Glue the blocks to the ends of the popsicle sticks. Heat up a hot glue gun loaded with a fresh stick of white glue. Spread a layer of glue over the ends of the 1 of the sticks, then lay the blocks on top of that. Align the longer ends of each block with the edges of the popsicle stick. Spread another layer of glue on top of the wood blocks to secure the second popsicle stick. [4] X Research source Make sure you align the holes in the popsicle sticks before gluing them in place. The holes need to be positioned evenly over one another in order for the ballista launch its arrows later."
    },
    {
      "title": "Cut about 1⁄2 in (1.3 cm) off the end of another popsicle stick.",
      "content": "Cut about 1 ⁄ 2 in (1.3 cm) off the end of another popsicle stick. Trim this new stick to size by measuring and slicing it apart with your craft knife. Another safe way to do this is by snapping the end off with scissors or wire cutters. Trim any stray wood fibers off the cut end so it looks smooth and even. [5] X Research source Cutting popsicle sticks can be tricky since they are pretty fragile. Work slowly, gradually deepening the cut you make. Bend the popsicle stick back and forth along the groove you cut to prevent it from splintering. If you have experience with wood cutting, try using a fine saw blade like a band saw. Always wear earmuffs, eye goggles, and a dust mask while operating a saw."
    },
    {
      "title": "Trim a pair of cocktail skewers to 5 1⁄2 in (14 cm) in length.",
      "content": "Trim a pair of cocktail skewers to 5 1 ⁄ 2 in (14 cm) in length. Get some wood skewers about 7 ⁄ 64 in (0.28 cm) in diameter. Measure and mark the skewers as needed with a ruler and pencil. Then, cut the skewers evenly on both ends to trim off the sharp points. The skewers need to be the same length as the popsicle stick you cut, so use it for comparison. [6] X Research source Wood skewers are available online in addition to some craft stores, general stores, and restaurant supply stores. Cut the skewers by using a craft knife or by snapping the ends off with wire cutters."
    },
    {
      "title": "Glue the skewers to the top of the popsicle stick.",
      "content": "Glue the skewers to the top of the popsicle stick. Place the skewers on the long edges of the popsicle stick you cut. Lay down a bead of glue from a hot glue gun to secure the skewers in place. Trim the ends of the skewers as needed to smooth them out and make them even with the ends of the stick. [7] X Research source Now you have a basic launch ramp. The skewers form a groove for you to load the ballista’s ammunition."
    },
    {
      "title": "Secure the ramp to the center of the frame you built.",
      "content": "Secure the ramp to the center of the frame you built. Get your popsicle stick frame with the holes drilled in it. Turn the ramp over and spread some hot glue on the end of it. Then, secure it over the bottom popsicle stick in the frame. Put it as close to the center of the frame as possible, aligning the end of the ramp with the back edge of the frame. [8] X Research source Hot glue dries relatively quickly, so you don’t need to worry too much about the frame and ramp components coming apart. Set the pieces aside as needed for 10 to 20 minutes to give the glue a chance to solidify. It takes about 24 hours to fully cure."
    },
    {
      "title": "Break a 4 1⁄2 in (11 cm) popsicle stick into halves.",
      "content": "Break a 4 1 ⁄ 2 in (11 cm) popsicle stick into halves. Divide the stick evenly into halves about 2 1 ⁄ 4 in (5.7 cm) long. These sticks are smaller than the frame pieces and are part of the ballista’s launching system. Use a craft knife or wire cutters to split the stick across its width and then smooth out the cut end. [9] X Research source Purchase a separate bag of smaller popsicle sticks online or at a craft store. Alternatively, cut smaller pieces of wood boards or foam if you’re making the ballista with those materials."
    },
    {
      "title": "Poke a hole 1⁄2 in (1.3 cm) from the end of each stick.",
      "content": "Poke a hole 1 ⁄ 2 in (1.3 cm) from the end of each stick. Use a 1 ⁄ 16 in (0.16 cm)-thick steel probe or a similar tool sold at craft stores. Make a single hole near the rounded end, leaving the cut end alone. Pierce all the way through the wood. [10] X Research source"
    },
    {
      "title": "Pull pieces of string through the larger holes in the frame.",
      "content": "Pull pieces of string through the larger holes in the frame. Getting the string through the holes is tricky, so have a cocktail skewer nearby to push it through. Slide both ends of a string 7 ⁄ 64 in (0.28 cm) in diameter through the top hole, then through the respective hole in the bottom frame piece. Leave the string long enough to form small loops above and below the ballista frame. [11] X Research source Try using twine from a craft store for a strong material that isn’t likely to break when you’re having fun launching makeshift arrows."
    },
    {
      "title": "Tie small skewers to the frame using the string loops.",
      "content": "Tie small skewers to the frame using the string loops. Cut a couple of wood skewers down to 1 1 ⁄ 2 in (3.8 cm) in length. Start with the top loop by placing a skewer inside of it and pulling the string tight. Then, tie the loose ends of the string into a knot with another skewer underneath it. [12] X Research source Lay the skewers flat against the frame pieces. Orient them so they’re perpendicular to the frame pieces. Then, tie the knots as tight as you can to hold the skewers in place."
    },
    {
      "title": "Place the small popsicle sticks between the strings and tighten them.",
      "content": "Place the small popsicle sticks between the strings and tighten them. The popsicle sticks you cut earlier fit between the frame pieces. Slide about 1 ⁄ 2 in (1.3 cm) of the cut ends of the sticks between the ropes. Then, twist the bottom skewers clockwise to tighten the string as much as possible. [13] X Research source When the small sticks are positioned correctly, you can move them back and forth without them sliding out of place. This is necessary for moving the ballista’s launcher to let arrows fly a long way."
    },
    {
      "title": "Slide another skewer into each of the inner holes on the frame.",
      "content": "Slide another skewer into each of the inner holes on the frame. Cut 2 more skewers to 1 1 ⁄ 2 in (3.8 cm) in length to fit those holes. Make them look nice and even like the other skewers before fitting them through the frame. Make sure the skewers go all the way through the respective holes on the top and bottom frame pieces. Protect the strings by tying the ends to the bottoms of these skewers, if possible. If you do this, the skewers maintain the string’s tension, leading to much more impressive launches!"
    },
    {
      "title": "Tie a length of string between the launcher’s stick arms.",
      "content": "Tie a length of string between the launcher’s stick arms. Set the ballista so the back end is in front of you. Thread the 7 ⁄ 64 in (0.28 cm)-thick string into the holes in the small popsicle sticks hanging from the ballista frame. Knot both ends of the string to secure it, then trim off the excess length. [14] X Research source The exact length of string you need to form the launcher depends on the material you used. Try threading the string through both holes before cutting it from the spool. Always cut it longer than you need so you can knot it tightly."
    },
    {
      "title": "Glue a block underneath the back end of the launch ramp.",
      "content": "Glue a block underneath the back end of the launch ramp. Get another 1.5 in × 1 in (3.8 cm × 2.5 cm) wood block. The block needs to be approximately the same width as the ramp in order to keep the ballista stable while you’re firing it. Set the ramp in the glue, aligning its back edge with the back end of the block. [15] X Research source Installing the block makes the ballista ramp slanted so it launches arrows higher into the air."
    },
    {
      "title": "Cut grooves in a small block to create the ballista’s slider.",
      "content": "Cut grooves in a small block to create the ballista’s slider. Cut the grooves into a small piece of wood about 1.5 × 1 × 1 ⁄ 2 in (3.8 × 2.5 × 1.3 cm) in size. The launcher needs separate grooves in the front and back, both as thick as the string you used when tying the launcher arms together. Make the 2 grooves about 1 ⁄ 4 in (0.64 cm) from either end. Use a crafting knife to scrape away the wood, making the grooves circular and about half as deep as the block. [16] X Research source Try making the slider out of a wood peg bought online or a craft store. If you use scrap wood, make sure it is solid and smooth so you can slide it along the ramp."
    },
    {
      "title": "Create a 1 1⁄2 in (3.8 cm) wood cap to fit on top of the slider.",
      "content": "Create a 1 1 ⁄ 2 in (3.8 cm) wood cap to fit on top of the slider. Simply cut a smaller popsicle stick to the exact length and width as the slider. Cut the cap into a rectangle with no rounded edges. When you’re ready to install it, put the launcher string into the slider’s front groove. Spread some hot glue, then press the cap onto the top of the slider. [17] X Research source Test the cap out by putting it on the slider before you add the glue. Check that it’s big enough to cover the slider and pin the string in place."
    },
    {
      "title": "Drill 45-degree angle holes in a block of wood.",
      "content": "Drill 45-degree angle holes in a block of wood. This block needs to be about 2 × 1 1 ⁄ 2 × 1 ⁄ 2 in (5.1 × 3.8 × 1.3 cm) longer than the one on the back end of the ballista. Position the holes about 1 in (2.5 cm) from the smaller sides of the block. Use a drill bit approximately 1 ⁄ 4 in (0.64 cm) wide to drill diagonally towards the center of the block. [18] X Research source Drill all the way through the other side of the block. Keep the holes as even as possible to build a stable base for the ballista frame."
    },
    {
      "title": "Fit wood dowels into the holes on the block.",
      "content": "Fit wood dowels into the holes on the block. Use a pair of 1 ⁄ 4 in (0.64 cm)-thick dowels cut to about 4 in (10 cm) long. Slice them using a craft knife, wire cutters, or a saw if you have one. Then, put some hot glue on the ends of the dowels and push them as far into the holes as possible. [19] X Research source Look online or at a local craft supply store for the perfect dowels for your project."
    },
    {
      "title": "Glue the block to the front side of the frame to stand the ballista up.",
      "content": "Glue the block to the front side of the frame to stand the ballista up. Flip the block over and spread a thick bead of glue across its length. Lift up the front end of the ballista to stick the block to the bottom of the frame. After pressing the pieces firmly together, consider letting the glue dry for about 10 minutes. If the block is wider than the frame, you could try whittling it down with a carving knife or craft knife. As long as your base is stable, doing this isn’t necessary, but it can make the ballista look a little neater."
    },
    {
      "title": "Glue long spacer pieces to the sides of the back block.",
      "content": "Glue long spacer pieces to the sides of the back block. Cut the spacer pieces so they are about 4 in × 1.5 in (10.2 cm × 3.8 cm) in size. Spread more hot glue, then press them against the block supporting the back end of the ramp. These parts are there to support the rest of the parts you need to add, so they don’t need to be pretty and can be longer than the block itself. [20] X Research source Make sure the spacer pieces stick out from underneath the ramp a little bit. The pieces that attach to them need to extend over the ramp or else you won’t be able to fire the ballista."
    },
    {
      "title": "Cut 1 1⁄2 in (3.8 cm) off the ends of a large popsicle stick.",
      "content": "Cut 1 1 ⁄ 2 in (3.8 cm) off the ends of a large popsicle stick. Measure and mark the length you need to cut on one of the 6 in (15 cm)-long popsicle sticks. You need 2 of these pieces, so cut off both ends of the stick. Leave the rounded ends of the stick intact. [21] X Research source Cut the stick carefully with a craft knife, wire cutters, or saw. Work slowly to avoid splintering the wood and smooth out the edges as needed."
    },
    {
      "title": "Make a hole about 1⁄2 in (1.3 cm) from the end of each piece.",
      "content": "Make a hole about 1 ⁄ 2 in (1.3 cm) from the end of each piece. Create the holes by poking a 1 ⁄ 16 in (0.16 cm) steel probe or a similar sharp tool through the wood. Keep the holes along the center part of the wood. Make them as even as possible to ensure the ballista parts line up appropriately when you install them. [22] X Research source"
    },
    {
      "title": "Glue the popsicle ends to the side pieces on the block.",
      "content": "Glue the popsicle ends to the side pieces on the block. The sticks need to be near the tail end of the block. Also, position the sticks about 1 ⁄ 4 in (0.64 cm) up from the bottom edge of the block. Spread glue over the wood and press them onto the block to hold them in place. [23] X Research source Make sure the ends of the sticks extend over the ramp. The holes need to be about level with the top edge of the slider in order to string the launch rope through it."
    },
    {
      "title": "Bend a metal rod to fit through the holes in the wood.",
      "content": "Bend a metal rod to fit through the holes in the wood. Get a metal rod about 4 in (10 cm) long and about 1 ⁄ 16 in (0.16 cm) in width to fit through the holes. Pull the launcher piece back and thread the rod through its second groove and the holes in the sticks. Then, use pliers to bend one end of the rod back over itself. The rod forms a launch pin that stays in place until you're ready to use it. [24] X Research source Test the pin by attempting to move it. If it feels loose, bend the end back on itself more to keep the pin in place. Leave the other end of the pin alone so it can slide out of the hole."
    },
    {
      "title": "Tie a string to the end of the launch pin.",
      "content": "Tie a string to the end of the launch pin. Cut some 7 ⁄ 64 in (0.28 cm)-thick string to complete the launching mechanism. Try trimming it to about 3 to 4 in (7.6 to 10.2 cm) in length. Knot the string a few times to the bent end of the launch pin to quickly pull it out when you wish to fire the ballista. [25] X Research source Keep the string at a comfortable length. If it is too long or short, you may have a hard time pulling out the pin in a quick, fluid motion."
    },
    {
      "title": "Cut cocktail skewers to about 5 in (13 cm) for ammunition.",
      "content": "Cut cocktail skewers to about 5 in (13 cm) for ammunition. Trim the pointed ends off of as many skewers as you wish to use. When you’re ready to use the ballista, put a single arrow on the chute after pulling the slide back. Yank the string to pull the metal pin out, causing the slide to spring forward, sending the arrow through the air. [26] X Research source Always cut the points off of the skewers to avoid accidents. Also, never shoot the arrows at others. They can hurt, especially from bigger launchers."
    }
  ]
}