{
  "url": "https://www.wikihow.com/Clean-a-Micro%E2%80%90USB-Port",
  "title": "How to Clean a Micro‐USB Port",
  "steps": [
    {
      "title": "Get a can of compressed air.",
      "content": "Get a can of compressed air."
    },
    {
      "title": "Raise the tube so that it's at a 90-degree angle with the can.",
      "content": "Raise the tube so that it's at a 90-degree angle with the can."
    },
    {
      "title": "Give the compressed air can a quick test spray to make sure that no liquid comes out.",
      "content": "Give the compressed air can a quick test spray to make sure that no liquid comes out. Do not shake the can. This will put the contents under more pressure, which can liquefy the compressed air."
    },
    {
      "title": "Aim the can of compressed air at the port.",
      "content": "Aim the can of compressed air at the port. Direct the small tube at the micro/mini USB port on your smartphone/tablet. Do not put the tube in the port. This gives any dust in the USB port a place to escape. Don't tip the can, this can cause liquid to come out of the tube."
    },
    {
      "title": "Take a new or clean firm-bristled toothbrush.",
      "content": "Take a new or clean firm-bristled toothbrush."
    },
    {
      "title": "Dip the toothbrush into a bottle of Isopropyl Alcohol.",
      "content": "Dip the toothbrush into a bottle of Isopropyl Alcohol."
    },
    {
      "title": "Shake off any the excess alcohol off the brush as you do not want to put any excess liquid onto the usb port.",
      "content": "Shake off any the excess alcohol off the brush as you do not want to put any excess liquid onto the usb port. [1] X Expert Source Matt Ham Computer Repair Specialist Expert Interview. 14 May 2021."
    },
    {
      "title": "Scrub the micro/mini USB port with the toothbrush.",
      "content": "Scrub the micro/mini USB port with the toothbrush. [2] X Expert Source Matt Ham Computer Repair Specialist Expert Interview. 14 May 2021. It helps loosen any stubborn dirt or debris that did not come out by just spraying with compressed air."
    },
    {
      "title": "Spray a can of compressed air on the USB port to expel any of the loosened debris or dirt from the USB port.",
      "content": "Spray a can of compressed air on the USB port to expel any of the loosened debris or dirt from the USB port. This will also help dry the port before you attempt to check if this method works."
    },
    {
      "title": "Take a clean firm-bristled toothbrush and spray some of the electrical contact cleaner onto it.",
      "content": "Take a clean firm-bristled toothbrush and spray some of the electrical contact cleaner onto it. Don't spray so much that the toothbrush is dripping with the cleaner."
    },
    {
      "title": "Scrub the micro/mini USB port with the toothbrush.",
      "content": "Scrub the micro/mini USB port with the toothbrush. [3] X Expert Source Matt Ham Computer Repair Specialist Expert Interview. 14 May 2021."
    },
    {
      "title": "Dry the port thoroughly.",
      "content": "Dry the port thoroughly. As the electrical contact cleaner is not quick evaporating as the alcohol, it is a good idea to spray with the compressed air as indicated but allow a little extra time for the port to dry before you connect it to your smartphone/tablet."
    }
  ]
}