{
  "url": "https://www.wikihow.com/Block-and-Unblock-Users-on-Instagram",
  "title": "How to Unblock or Block Someone on Instagram (Desktop & Mobile)",
  "steps": [
    {
      "title": "Go to a user's profile.",
      "content": "Go to a user's profile. Scroll through the home page until you find a user you want to block and tap their profile picture. You can also tap Search at the bottom of the screen and type in their name or username to find their profile."
    },
    {
      "title": "Tap the three-dot menu in the upper-right corner of the screen.",
      "content": "Tap the three-dot menu in the upper-right corner of the screen. A menu with a number of actions will pop up on your screen."
    },
    {
      "title": "Tap Block.",
      "content": "Tap Block . The button has red text, and it's the second one from the top."
    },
    {
      "title": "Tap Block a second time to confirm.",
      "content": "Tap Block a second time to confirm. Doing so will add the user to your profile's \"Blocked Users\" list, meaning that they won't be able to see your profile or comments. [1] X Research source On Android, tap Yes, I'm sure when prompted."
    },
    {
      "title": "Tap the chat icon in the upper-right corner of the Home screen.",
      "content": "Tap the chat icon in the upper-right corner of the Home screen. This button has a chat bubble with a squiggle/zig zag."
    },
    {
      "title": "Tap a chat with the person you want to block.",
      "content": "Tap a chat with the person you want to block. If you haven't chatted with this user, there should still be an empty chat with them at the bottom of the chats page under Suggestions ."
    },
    {
      "title": "Tap the user's name at the top of the chat.",
      "content": "Tap the user's name at the top of the chat. Alternatively, you can click View profile and block them using the steps to block from a profile ."
    },
    {
      "title": "Tap the button that says Options.",
      "content": "Tap the button that says Options . This is the fourth option in the horizontal list of buttons under the user's name, and it has a three-dot icon."
    },
    {
      "title": "Tap Block.",
      "content": "Tap Block . It's the second option on the list."
    },
    {
      "title": "Tap Block a second time to confirm.",
      "content": "Tap Block a second time to confirm. This user will now be on your blocked users list."
    },
    {
      "title": "Tap your profile tab .",
      "content": "Tap your profile tab . It's in the bottom-right corner of the screen. This will open your profile page. If you have more than one Instagram profile signed in, this profile tab will resemble your profile picture instead."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . It's on the upper-right side of the window. A pop-out menu will appear."
    },
    {
      "title": "Scroll down and tap Blocked.",
      "content": "Scroll down and tap Blocked . It's under the \"Who can see your content\" heading."
    },
    {
      "title": "Tap Unblock next to the person you want to unblock.",
      "content": "Tap Unblock next to the person you want to unblock. Doing so immediately unblocks the person. On Android, you'll tap Yes, I'm sure after tapping Unblock to confirm your choice."
    },
    {
      "title": "Select a user to block.",
      "content": "Select a user to block. Scroll through your homepage until you find someone you want to block, then click their profile name to go to their account page. You can also type their username or profile name into the search bar at the top of the Instagram page and then click their profile in the resulting drop-down menu."
    },
    {
      "title": "Click ⋯.",
      "content": "Click ⋯ . You'll see this icon at the top of the person's profile, to the right of their name. A menu will appear."
    },
    {
      "title": "Click Block.",
      "content": "Click Block . It's at the top of the menu, with red text."
    },
    {
      "title": "Click Block when prompted.",
      "content": "Click Block when prompted. Doing so will add the account to your list of blocked users."
    },
    {
      "title": "Click the Messages button in the left-hand sidebar.",
      "content": "Click the Messages button in the left-hand sidebar. It has an icon of a paper airplane."
    },
    {
      "title": "Click on a chat with the person you want to block.",
      "content": "Click on a chat with the person you want to block. All of your chats will be in the left-hand sidebar."
    },
    {
      "title": "Click the i button in the top-right corner.",
      "content": "Click the i button in the top-right corner. The i is surrounded by a circle."
    },
    {
      "title": "Click Block.",
      "content": "Click Block . It's the second option on the list."
    },
    {
      "title": "Click Block a second time to confirm.",
      "content": "Click Block a second time to confirm. This user will now be on your blocked users list."
    },
    {
      "title": "Click on your profile.",
      "content": "Click on your profile. It's the small version of your profile photo in the left-hand sidebar."
    },
    {
      "title": "Click the settings cog.",
      "content": "Click the settings cog. It's at the top of the screen, next to your username."
    },
    {
      "title": "Click Settings & privacy.",
      "content": "Click Settings & privacy . It's the fourth option on the list."
    },
    {
      "title": "Scroll down and click Blocked.",
      "content": "Scroll down and click Blocked . It's under the \"Who can see your content\" heading in the middle panel."
    },
    {
      "title": "Click Unblock next to the person you want to unblock.",
      "content": "Click Unblock next to the person you want to unblock. Doing so immediately unblocks the person."
    }
  ]
}