{
  "url": "https://www.wikihow.com/Belly-Dance",
  "title": "How to Belly Dance",
  "steps": [
    {
      "title": "Stretch.",
      "content": "Stretch. Getting warmed up before you start to dance will keep you from straining a muscle or getting injured. Just bend down to touch your toes, roll your neck and shoulders, and stretch your wrists to feel nice and loose. If you can do a backbend, do one to help stretch out your stomach muscles. [2] X Research source As you get ready to belly dance, you should put your hair up and wear a shirt that exposes your belly. Practice dancing in front of a mirror so you can monitor your movements."
    },
    {
      "title": "Turn on the right music.",
      "content": "Turn on the right music. Any music with a strong repetitive base will help get you in the right frame of mind. Try to use some music of Middle Eastern origin and gain an understanding of the rhythms. There are many pieces of Arabic music that are composed specifically for belly dance and contain musical cues which will help you to understand when to make earthy movements and when to make flowing, graceful movements. Being able to dance to middle eastern music will help you to gain appreciation for belly dance."
    },
    {
      "title": "Get in a starting position.",
      "content": "Get in a starting position. Begin in a position so that your upper body is straight. Don't arch your back or hunch. Tuck in your butt so that it also aligns with your back. Bend your knees slightly and never, ever, lock them. Your feet should be parallel and about a foot apart. [3] X Research source Your chin should be raised slightly, and your shoulders should be bent gently back. [4] X Research source"
    },
    {
      "title": "Lift your arms and flex your stomach slightly.",
      "content": "Lift your arms and flex your stomach slightly. Use your stomach muscles to 'pull' or lead your hip movement; the lower back should not have a large arch. Some schools insist on the stomach pulling from the start, in order to train your stomach. Lift your arms in the air so that they're slightly above parallel to the ground and lift your wrists slightly. [5] X Research source"
    },
    {
      "title": "Master the side to side move and the back and forth move.",
      "content": "Master the side to side move and the back and forth move. For the side to side move, just drop your left hip to raise your right hip, and then drop your right hip to raise your left. Start slowly until you perfect this motion, and then speed up until you're shimmying your hips. [6] X Research source For the back and forth move, just move your hips back and forth, using the center of your pelvis to make the movement look graceful. Keep your arm lifted at a ninety degree angle and move your fingers to add balance and grace to your movements. To move side to side, first lift your right foot and lift your heel until only your toes are touching the ground. Use this movement to pop up your right hip for two counts, and then let it fall lower than normal for two counts. Repeat this movement with your left leg and hip and then alternate until you can shimmy rapidly. Use your knees to help generate momentum and movement, not your hips. To master the hip movement, try to mentally divide your torso vertically down the center. This will help you learn to move one side of your hip up and down without affecting the movement of the other hip."
    },
    {
      "title": "Make small circular movements with one side of your hips at a time.",
      "content": "Make small circular movements with one side of your hips at a time. Try 'drawing' little circles in the air with your one side. As you get the hang of it, try 8's, arcs, and swirls. Don't forget your other side. One side will always be easier, or stronger, depending on whether you are left or right handed. Keep your arms lifted, a slight smile on your face, and your fingers moving as you master these techniques. [7] X Research source"
    },
    {
      "title": "Combine your moves.",
      "content": "Combine your moves. You don't have to belly dance using the same motion all the time. Once you master a few techniques, you can switch things up. Do the left hip circle, the right hip circle, two right hip circles followed by two left, or move your hips back and forth and then transition into moving them from side to side. Remember to continue using your stomach to pull your hips in different directions."
    },
    {
      "title": "Practice making the stomach ripples that cause the back and forth movements.",
      "content": "Practice making the stomach ripples that cause the back and forth movements. [8] X Research source There are three main muscles that you will use: (1) a crescent shaped muscle just above the pubic area; (2) The area between the 1st muscle and below the navel; (3) just above the navel to your ribs (the one that hurts when you laugh too hard)."
    },
    {
      "title": "Try isolating or clenching each muscle individually.",
      "content": "Try isolating or clenching each muscle individually. Isolate the first muscle group, then the second, and then the third. Once you can isolate and clench these muscles, you'll be on your way to doing the stomach ripple. Work on clenching and releasing them individually and then combine the movements."
    }
  ]
}