{
  "url": "https://www.wikihow.com/Change-Your-Phone-Number-on-Steam",
  "title": "How to Change Your Phone Number on Steam",
  "steps": [
    {
      "title": "Open Steam.",
      "content": "Open Steam. The icon has a robotic arm on it. If you do not have the steam desktop application you can download it by following these steps: Open your web browser and navigate to https://store.steampowered.com/about/ Click install Steam, located in blue at the middle of the screen."
    },
    {
      "title": "Click your name on the top right of the screen.",
      "content": "Click your name on the top right of the screen. This will reveal a menu."
    },
    {
      "title": "Click on Account Details.",
      "content": "Click on Account Details . This is the second option in the menu."
    },
    {
      "title": "Click Manage your phone number.",
      "content": "Click Manage your phone number . This is underneath contact details."
    },
    {
      "title": "Click change phone number.",
      "content": "Click change phone number . This is located next to \"New phone number?\"."
    },
    {
      "title": "Select one of the authentication options.",
      "content": "Select one of the authentication options. If you have access to your old phone number, you can select the first option via SMS. This will send a confirmation code to your old number. If you use Steam Guard Mobile Authenticator, you can use that as your authenticator. If none of these options work, you can select remove my old phone number at the bottom."
    },
    {
      "title": "Open the Steam app.",
      "content": "Open the Steam app. The icon has a robotic arm on it."
    },
    {
      "title": "Enter your login information.",
      "content": "Enter your login information. Tap Sign in. The mobile application does not support account creation."
    },
    {
      "title": "Tap the ☰ left corner.",
      "content": "Tap the ☰ left corner. This will reveal the side menu."
    },
    {
      "title": "Tap Account Details at the bottom of the menu.",
      "content": "Tap Account Details at the bottom of the menu. This option is under Support."
    },
    {
      "title": "Scroll down and tap Manage your phone number.",
      "content": "Scroll down and tap Manage your phone number . If you do not have a phone number, add one by clicking Add a phone number ."
    },
    {
      "title": "Tap change phone number.",
      "content": "Tap change phone number. This is located next to \"New phone number?\"."
    },
    {
      "title": "Change your phone number by selecting one of the verification methods.",
      "content": "Change your phone number by selecting one of the verification methods. If you have access to your old phone number, select Yes, I have the old phone number. If you do not have access to your old phone number, select Remove my old phone number."
    }
  ]
}