{
  "url": "https://www.wikihow.com/Clean-a-Dull-Stainless-Steel-Sink",
  "title": "How to Clean a Dull Stainless Steel Sink",
  "steps": [
    {
      "title": "Choose a moderate abrasive.",
      "content": "Choose a moderate abrasive. Abrasives can scratch your sink's finish, so use them only for an occasional restoration project, or to remove stubborn stains. Try stainless steel polish, whiting, talc, or baking soda. Apply one of these to a slightly damp cloth. [1] X Research source"
    },
    {
      "title": "Rub in the direction of the finish lines.",
      "content": "Rub in the direction of the finish lines. Most stainless steel sinks have a brushed finish. [2] X Research source Wipe parallel to the brush lines to reduce the chance of a visible scratch. Use a toothbrush with a bit of the cleanser to clean the tight areas around the faucet, and the area around the drain."
    },
    {
      "title": "Rinse the stainless steel cleanser off.",
      "content": "Rinse the stainless steel cleanser off. Wash the cleanser off of everywhere you used it. If your sink's shine is restored, dry the sink completely with a clean towel, dabbing instead of rubbing to avoid streak marks. If your sink still looks dull, browse through the steps below for additional solutions to specific problems."
    },
    {
      "title": "Wipe away hard water spots and rust with vinegar.",
      "content": "Wipe away hard water spots and rust with vinegar. If your sink is clean but covered in dull white spots, dip a soft cloth in white vinegar and wipe them away. [3] X Research source This also works on rust spots. [4] X Research source"
    },
    {
      "title": "Buff with flour if the sink is still grimy.",
      "content": "Buff with flour if the sink is still grimy. Flour is a cheap, very mild abrasive, which makes it a good choice for cleaning a large area. If your sink still looks dirty and you have some spare time, follow these steps: [5] X Research source Dry the sink thoroughly. Any water left on the surface will turn the flour into glue. Sprinkle a light dusting of flour over the sink. Use about ¼ cup (60mL) flour for an average kitchen sink. [6] X Research source Buff the sink in a circular motion with a soft cloth, focusing on the rim and drain where food might get stuck. Once grime is removed, brush the flour into a container and throw it in the kitchen trash. Too much flour can block the drain. [7] X Research source"
    },
    {
      "title": "Consider buffing with oil.",
      "content": "Consider buffing with oil. Olive oil can boost the shine and remove streaks from your sink, but overdoing it can leave the stainless steel sticky or eventually make the appearance duller than before. If you try it, put just two or three drops of olive oil onto a soft cloth. Wipe the dry sink evenly until the entire surface is coated very lightly. Buff in small circles with the same oiled cloth for a couple minutes until you've achieved an even shine. [8] X Research source"
    },
    {
      "title": "Keep the sink dry for 24 hours if feasible.",
      "content": "Keep the sink dry for 24 hours if feasible. A major clean can leave the surface of your sink temporarily damaged, especially if there was rust on the surface. Give the steel a day to restore its protective anti-rust layer, or at least dry it thoroughly after each use during this time. [9] X Research source"
    },
    {
      "title": "Clear out the sink.",
      "content": "Clear out the sink. Wash and remove any dishes. Dispose of solid food debris. Wash steel and cast iron cookware promptly. These materials may cause rust if left in the sink too long."
    },
    {
      "title": "Choose a non-abrasive cleaning tool.",
      "content": "Choose a non-abrasive cleaning tool. Sponges, soft cleaning pads, cloths, or bristle brushes are the best tools for scrubbing stainless steel. Abrasive pads and wire brushes may scratch the finish, especially if your sink has a shiny, reflective finish. [10] X Research source Never use steel wool or carbon steel brushes. These materials can leave behind small metal particles that cause rust."
    },
    {
      "title": "Scrub with warm water and gentle soap.",
      "content": "Scrub with warm water and gentle soap. For everyday cleaning, mild soap or dish detergent is enough to prevent discoloration or dulling. [11] X Research source Scrub until you've removed all debris and stains from the sink surface."
    },
    {
      "title": "Disinfect the surface occasionally.",
      "content": "Disinfect the surface occasionally. Kitchen sanitizer products with quaternary ammonia are among the most effective disinfectants for stainless steel, and should not damage your sink's finish. [12] X Research source However, they may irritate skin or cause asthma, and in some cases can damage aquatic life when washed down the drain. [13] X Research source White vinegar is a fairly effective alternative if you are concerned with these issues. [14] X Research source In either case, use a spray bottle to coat the surface of the sink. Most kitchen sanitizers that are not bleach-based contain quaternary ammonia. To confirm this, check the ingredients list for a chemical name ending in \"ammonium chloride,\" or for an abbreviation such as BAC, BZK, BKC, or ADBAC. Bleach-based cleaners are not recommended, as they can corrode your sink if not rinsed off thoroughly. [15] X Research source Never let bleach come into contact with residue from other cleaners, as the reaction can produce dangerous gas."
    },
    {
      "title": "Rinse with hot water.",
      "content": "Rinse with hot water. For best results, let the disinfectant sit for a least ten minutes before rinsing it off with hot water."
    },
    {
      "title": "Wipe the sink dry.",
      "content": "Wipe the sink dry. Water that evaporates on the sink surface can leave behind white spots, especially if you live in a hard water area. Wipe away moisture with a soft, dry cloth to preserve the sink's shine. [16] X Research source"
    },
    {
      "title": "Dry scrubbing tools on a different surface.",
      "content": "Dry scrubbing tools on a different surface. Wet sponges, clothes, or dish mats can trap water on the sink surface. This can cause stains or dull spots. Squeeze out excess water, then place them on a windowsill or waterproof counter to dry instead."
    }
  ]
}