{
  "url": "https://www.wikihow.com/Change-a-Colostomy-Bag",
  "title": "How to Change a Colostomy Bag",
  "steps": [
    {
      "title": "Start by emptying your colostomy bag.",
      "content": "Start by emptying your colostomy bag. [1] X Research source If there is urine or feces in your colostomy bag, it is important to empty these prior to changing the bag. The best place to do this is in the bathroom. Open the bottom of the bag over the toilet. For feces, you can gently squeeze it out of the bag; urine will automatically flow from the bag when it is opened. Alternatively, some colostomy bags have liners and flanges that are designed to be flushed down the toilet. If the bag you are using has a biodegradable flange and inner liner, place them in the bowl and flush. The outer layer remains clean. It can be placed in a purse or pocket until you can dispose of it."
    },
    {
      "title": "Wash your hands thoroughly using soap and water.",
      "content": "Wash your hands thoroughly using soap and water. If this is not possible, use antibacterial hand sanitizer instead. [2] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Place a clean bath towel on your lap and stuff the top of it into your pants to protect your clothing. Proper hygiene is important when changing your colostomy bag."
    },
    {
      "title": "Gently take the pouch off.",
      "content": "Gently take the pouch off. Holding your skin with one hand, slowly ease the pouch off using the built in tab for easier removal. If necessary, carefully use an adhesive remover to remove the flange. [3] X Research source"
    },
    {
      "title": "Check your skin.",
      "content": "Check your skin. [4] X Research source The skin may be a little pink or red. However, if it is black, purple, or blue, or looks concerning to you, see a medical professional for advice. Also check your stoma in general — stoma should always be beefy red in color, never dusky. If it is changing in size, going further into or out of your skin, leaking pus or blood, or looks pale or bluish, contact your doctor immediately."
    },
    {
      "title": "Clean your stoma.",
      "content": "Clean your stoma. Using warm water and a dry wipe with mild soap on it, gently wipe around the stoma. Do not rub. [5] X Research source Only use soaps that do not contain any oils or fragrances. Use a dry wipe to pat the skin dry. If necessary, use a measuring card device (given to your by your doctor or nurse) to measure the size of your stoma. You will need to know its size, if you don't already, before attaching a new colostomy bag. Also be sure to wash your hands one more time before putting on the new pouch. This will ensure optimum sanitization of the new pouch, as you will not want any contamination with old fecal matter."
    },
    {
      "title": "Try using a skin barrier, such as stoma powder.",
      "content": "Try using a skin barrier, such as stoma powder. This is optional; however, many people use it as a means to not only protect the skin but also to provide the perfect base for the new colostomy bag to adhere to. Sprinkle stoma powder around the stoma. Be careful not to put the powder on the stoma itself. Carefully dust it around using a dry wipe, and let the area dry for about 60 seconds. [6] X Research source"
    },
    {
      "title": "Prepare the new pouch.",
      "content": "Prepare the new pouch. The stoma pouch flange may need to be modified to fit your stoma properly. If this is the case, use special scissors to cut out the circle on the flange. [7] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source The circle should be approximately ⅛ of an inch larger than the stoma itself. Some flanges have pre-printed guides to help you with this task. Cut the flange to fit your stoma. This is a process that takes time to master. Often times, on-call nurses can answer questions or help solve problems and/or decide if you need to be seen or if the problem can be solved with phone consultation."
    },
    {
      "title": "Put baby oil in the bag.",
      "content": "Put baby oil in the bag. Carefully, without getting the baby oil on anything else, place a few drops of baby oil in the bag. This is helpful when the time comes to empty stool from your bag. The baby oil keeps the stool from sticking to the bag. Purchasing (or reusing) a bottle with an eyedropper may be very helpful for this task."
    },
    {
      "title": "Place the flange over the stoma.",
      "content": "Place the flange over the stoma. Begin pressing on the part of the flange located underneath the stoma, gently moving to the sides and then to the top. Once adhered, begin smoothing the flange to remove the creases. Doing this helps to form a tighter seal around the stoma. [8] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Start in the center (near the stoma) and then move toward the outer edges. All creases must be smoothed; otherwise, the colostomy bag could leak. When you change the baseplate for a two-piece closed colostomy pouch, you will need to use the stoma paste or a ring seal as the adhesive. Hold the flange for about 45 seconds. The warmth of your hands helps the adhesive stick to the skin."
    },
    {
      "title": "Know when to change your colostomy bag.",
      "content": "Know when to change your colostomy bag. The frequency with which you need to change it is patient-specific and may depend on which type of bag you are using. [9] X Research source For people with one-piece pouches, the entire colostomy bag will need to be changed each time; on the other hand, for people with two-piece pouches, the pouch itself can be changed as frequently as one desires, while the flange will only need to be changed every two to three days. You should never go longer than seven days between changing of the colostomy bag and appliance. Note that this is just a guideline. Always follow the specific instructions from your doctor or nurse as to how frequently to change your colostomy bag."
    },
    {
      "title": "Obtain the proper equipment.",
      "content": "Obtain the proper equipment. When being sent home, the ostomy nurse will ensure that you have supplies to bring home as well as information to receive specific supplies once you run out as well as information as to where to obtain new supplies. Many medical supply stores will deliver the colostomy supplies straight to your doorstep, making it very convenient to obtain all that you need. After discharge you will be responsible for ordering your own supplies. Be sure that you have plenty of supplies stored, so that you will not find yourself short-handed equipment-wise when you go to change your colostomy bag."
    },
    {
      "title": "Remove your shirt and gather your supplies.",
      "content": "Remove your shirt and gather your supplies. Remove your shirt to keep it from getting in your way while you are changing your colostomy bag. Before you begin, make sure all of your supplies are within easy reach. [10] X Research source Supplies generally include: A new pouch A clean towel Skin wipes or cleaning supplies Scissors A measuring card and pen A skin barrier such as stoma powder (optional) Adhesive material (normally stoma paste or a ring seal)."
    }
  ]
}