{
  "url": "https://www.wikihow.com/Change-a-Bike-Tire-on-a-Mountain-Bike",
  "title": "How to Change a Mountain Bike Tire",
  "steps": [
    {
      "title": "Turn the bike upside down.",
      "content": "Turn the bike upside down. In other words, place the seat and handlebars on the ground with the wheels facing up. This lets the tires spin freely and supports the bike as you work. If you have a bike stand , use that to hold the bike in place."
    },
    {
      "title": "Disengage the brakes to remove the front tire.",
      "content": "Disengage the brakes to remove the front tire. First, identify what type of brakes your mountain bike has: rim brakes or disc brakes. Bikes with rim brakes have brake pads at the top of the wheel that rub against the rim; bikes with disc brakes have hydraulic brakes near the wheel’s axle. [1] X Research source If you have rim brakes, squeeze the noodle (the curved aluminum cable or pipe attached to the brake lines) and the caliper (the square piece holding the brake pads) together until they separate. [2] X Research source If you have disc brakes, flip the skewer or lever on the bike’s frame near the wheel’s axle in the opposite direction. [3] X Research source The words “open” and “close” may be on the skewer. [4] X Research source All mountain bikes are different, so for the best results, consult the user manual for your specific bike to determine how to disengage the brakes."
    },
    {
      "title": "Disengage the clutch to remove the back tire.",
      "content": "Disengage the clutch to remove the back tire. The clutch is the gear wheel behind the bike’s pedals that holds the chain in place. To disengage it, first flip the switch located near the cage (the plastic piece encasing the gears). Then, unscrew the nut on the other side of the wheel with a wrench to loosen the thru-axle and tire from the frame. [5] X Research source The thru-axle is the long rod or bolt connecting the wheel to the bike’s frame. Be mindful of the bike’s chain during this step, as it will sag and loosen when the clutch is disengaged. Put the bike in the lowest gear before removing the back tire. [6] X Research source"
    },
    {
      "title": "Remove the tire",
      "content": "Remove the tire from the bike frame. All bike tires, regardless of type or style, are partially attached to the bike frame by a nut and bolt. Once you’ve disengaged the brakes, unscrew the nut on the other side of the axle with a wrench. [7] X Research source Set the nut aside and lift the tire away from the bike frame. Put the nut in a safe place for later. If you’re working with the back tire, pull out the thru-axle when you remove the nut. [8] X Research source"
    },
    {
      "title": "Pry the tire away from the rim with two tire levers.",
      "content": "Pry the tire away from the rim with two tire levers . Hook the rounded end of one lever under the outer edge of the tire. Then, hook the second lever next to the first, sliding it clockwise around the rim. Pull out the tube once the tire is loose enough. [9] X Research source Start at the valve stem and work your way around until the tire separates from the wheel rim. [10] X Research source The valve stem is the small stick-like piece used to inflate the tire tube located on the rim between the spokes. The tire will snap back to the rim once the levers are removed."
    },
    {
      "title": "Pull the tube out of the tire.",
      "content": "Pull the tube out of the tire. The valve stem connects to the tube, not the tire, so removing it first will let you pull the entire tube out. Locate the valve stem, and unscrew the valve cap. Slide the stem out of the rim’s valve hole, and wiggle the rest of the tube out. [11] X Research source If you have a tubeless tire, there won’t be a tube to remove, so take the tire off the rim completely to inspect the inside chamber of the tire."
    },
    {
      "title": "Replace the tube if there’s damage or the tire is flat.",
      "content": "Replace the tube if there’s damage or the tire is flat. Inspect the tube’s exterior for any cracks, tears, pinches, and foreign objects. If you can’t see any damage, check for leaks by pushing it down into a shallow bucket of water, noticing any bubbles that appear. [12] X Research source A puncture in a tube is most likely from rolling over a sharp object. A pinch occurs when the tube and rim collide. Debris may have found its way inside the tire chamber and punctured the tube. If this is the case, remove the tire from the rim completely using tire levers. [13] X Research source Ignore this step if you’re changing the tire tube as part of your normal bike maintenance. Change your mountain bike tires every 2,000 to 3,000 miles."
    },
    {
      "title": "Patch the tire tube",
      "content": "Patch the tire tube or replace it with a new one. Some tire tubes can be repaired from a flat by patching the hole with glue or tape. Simply paint or place a thin layer of adhesive over the tear or leak and wait for it to dry. [14] X Research source Patch kits are also a great item to keep on you while you ride in case of emergencies. Buy a new tube at a local bike shop or online. Simply search your mountain bike’s name and model with “tire tube.”"
    },
    {
      "title": "Place the tube",
      "content": "Place the tube back in the tire. Line up the tube’s valve stem with the rim’s valve hole and slide the stem through the hole. [15] X Research source Push the tube up and into the tire using your fingers, following the rim. Hold the tire back from the rim with one hand and use your other hand to squeeze the tube into place. [16] X Research source Try not to use tire levers during this step, as they could puncture your tube while inserting."
    },
    {
      "title": "Pump the tire tube back up.",
      "content": "Pump the tire tube back up. Fill the tube with air using a bike pump so you’re ready to hop back on the trails. [17] X Research source How much air pressure you put in the tire depends on the types of trails you ride and the type of tire you have; however, tubed mountain bike tires roll well with around 30 psi. [18] X Research source Play around with air pressure to find what’s best for you! Some riders like having less pressure in the front when using tubeless tires. Don’t forget to screw back on the valve stem cap to lock the air in. [19] X Research source"
    },
    {
      "title": "Secure the tire back to the bike frame.",
      "content": "Secure the tire back to the bike frame. Line the axle up to the bike’s frame and lower the wheel into position between the bike frame—you might hear it click into place. [20] X Research source Hold the lever in place, and screw the nut back on the frame with a wrench. If you’re changing a back bike tire, do the same steps you did while removing but in reverse: align the axle and frame by sliding the thru-axle back in place, tighten the nut, and flip the switch. [21] X Research source"
    },
    {
      "title": "Reengage the bike’s brakes.",
      "content": "Reengage the bike’s brakes. For rim brakes, click the noodle and caliper back together and position the brake pads on the rim. [22] X Research source For disc brakes, flip the skewer or lever back down. [23] X Research source"
    }
  ]
}