{
  "url": "https://www.wikihow.com/Cook-Oysters",
  "title": "How to Cook Oysters",
  "steps": [
    {
      "title": "Prepare the fryer.",
      "content": "Prepare the fryer. Heat a deep fryer to 375° F (190° C)."
    },
    {
      "title": "Shuck your oysters",
      "content": "Shuck your oysters . Cover the front of the oyster with a cloth and carefully slide an oyster knife into the hinge at the back of the oyster. Twist the knife with your wrist to break the hinge. Then slide the knife around the top of the shell, prying the top shell off when loose enough. Slide the knife under the bottom of the oyster flesh to remove the oyster foot from the bottom shell."
    },
    {
      "title": "Coat the oysters for frying.",
      "content": "Coat the oysters for frying. Combine flour, salt and black pepper. Lightly beat together 2 eggs in a separate bowl. Drain 12 ounces of shucked oysters and dredge them in the egg mixture. Coat them in the dry mixture. Coat evenly and thickly but remove excess flour."
    },
    {
      "title": "Fry the oysters",
      "content": "Fry the oysters . Place the oysters, 5 or 6 at a time, in the deep fryer. Allow them to cook for 2 minutes until they are golden brown."
    },
    {
      "title": "Serve hot and enjoy!",
      "content": "Serve hot and enjoy!"
    },
    {
      "title": "Prepare the oysters for steaming.",
      "content": "Prepare the oysters for steaming. Scrub the outside of the shells with a scrub brush under cold, running water to remove all dirt. Discard any open or cracked shells, since this is a sign of a dead or compromised oyster. Do not wash your oysters far in advance of eating them. Washing your oysters hours before you plan on steaming them may kill them: Chemicals such as chlorine and poisons such as lead may leave your oysters tasting less fresh than they might otherwise be."
    },
    {
      "title": "Prepare the steaming liquid.",
      "content": "Prepare the steaming liquid. Pour 2 inches (5.06 cm) of water into a pot. Add a half glass of the beer or a glass of wine to the water for a bit of flavor and aroma. Place a metal steamer tray or colander into the pot to hold the oysters. Arrange the oysters on the tray or colander. Bring steaming liquid to a boil and then cover the pot with a lid."
    },
    {
      "title": "Steam the oysters for approximately 5 minutes.",
      "content": "Steam the oysters for approximately 5 minutes. Turn the burner to medium-high and allow the oysters to steam for 5 to 10 minutes — 5 minutes for a medium-cooked oyster, 10 for a well-done oyster. At this point, most of the oysters should have opened. Discard any oysters that did not open."
    },
    {
      "title": "Alternately, steam oysters on a roasting dish in a grill.",
      "content": "Alternately, steam oysters on a roasting dish in a grill. Lay your oysters out evenly on an old roasting dish that's filled with a little bit of water. Set your burner to medium-high heat, cover your grill, and let cook for 5-10 minutes. Oysters are done when their shells open. Discard any oysters that didn't open during the cooking process."
    },
    {
      "title": "Prepare the oysters for grilling.",
      "content": "Prepare the oysters for grilling. Scrub the outside of the shells with a scrub brush under cold, running water to remove all dirt. Discard any open or cracked shells. Let the oysters sit under water briefly, and then remove from the water while letting them drain."
    },
    {
      "title": "Prepare the grill.",
      "content": "Prepare the grill. Use a charcoal grill or gas grill. Bring the grill to a medium high heat. Lay the oysters on the grill, flat side on the grill itself."
    },
    {
      "title": "Decide whether to cook the oysters whole or on the half-shell.",
      "content": "Decide whether to cook the oysters whole or on the half-shell. Although there's little difference in method, how you cook your oysters will depend on whether you want to season your oysters beforehand or leave them unseasoned until right before you plop them down your gullet. If you want to season your oysters beforehand, shucking them is your best bet. If you'd prefer to season them after cooking, or perhaps not at all, you're better off leaving them in their shells while they cook. How do you shuck oysters? Wrap the top of the oyster in a towel or put on heavy-duty gloves for protection. Slide an oyster knife into the hinge (backside) of the oyster. Twist the oyster knife by turning your wrist, like you're turning on the ignition in your car with a key. [1] X Research source Scrape the blade across the top part of the oyster shell, twisting to open the muscle. Remove the top portion of the shell and loosen the oyster foot from the bottom shell with your knife."
    },
    {
      "title": "Prepare a seasoning for oysters on the half shell (optional).",
      "content": "Prepare a seasoning for oysters on the half shell (optional). Oysters are great raw or cooked in their own brine, but sometimes a little seasoning makes the oyster shine even more. Look for ideas that suit your own tastes. For inspiration try out some of the following: Butter and garlic Butter and soy sauce Butter, shallot, fresh parsley, cheese (Pecorino), cayenne, paprika BBQ sauce"
    },
    {
      "title": "Cook the oysters.",
      "content": "Cook the oysters. Shut the lid to the grill and allow it to remain closed for 5 or 6 minutes. Open the lid and check on the oysters. What you're looking for will differ depending on how you prepared them: Whole oysters should be checked for opening of the shell. You'll initially notice a line beginning to separate in the shell. Look for bubbling of the oyster brine inside that small separation. Throw out any oysters that haven't opened after 5-10 minutes. Oysters on the half shell need to be vetted before and during the shucking process to ensure they're safe to eat. If the oyster is already open prior to shucking, or it doesn't put up any resistance during shucking and pops right open, throw it out. Oysters on the half shell will tighten slightly when cooked; their liquid will bubble and help cook them over the course of 5-10 minutes."
    },
    {
      "title": "Remove whole oysters or oysters on the half-shell carefully so that they retain their juices.",
      "content": "Remove whole oysters or oysters on the half-shell carefully so that they retain their juices. Serve with drawn butter, lemon, or as-is."
    },
    {
      "title": "Wash your oysters thoroughly.",
      "content": "Wash your oysters thoroughly. [2] X Expert Source Ed Kuoha Chef Expert Interview. 9 November 2021. Put on gloves so that the rough exterior of the shells don't scrape your hands while you wash any grit and grime from the oysters. Wash the oysters in a place where the runoff won't damage any of your yard and/or equipment. Again, wash your oysters immediately before you plan on roasting them. Washing oysters too early before cooking can kill them, making them inedible. Oysters from a purveyor are often washed when they are harvested, but it won't hurt to give them a once-over. You're better safe than sorry."
    },
    {
      "title": "Build a fire that's the size of your sheet metal.",
      "content": "Build a fire that's the size of your sheet metal. In order to have a traditional oyster roast, you'll need a good sized fire and a big piece of sheet metal. If you don't have a piece of sheet metal, you can use a piece of metal grating, so long as the grating is small enough to contain the oysters. Place four cinder blocks at the edge of your fire, positioned rectangularly so that they'll easily support the sheet metal when fitted over the fire. Once the fire begins to die down, place your sheet metal on top of the cinder blocks and wait for it to get hot. (Of course, make sure your sheet metal is properly washed beforehand.) If splashing a couple drops of water onto the sheet metal causes the water to sizzle and disintegrate, the surface is ready to go."
    },
    {
      "title": "Place your oysters on top of the sheet metal in a single layer.",
      "content": "Place your oysters on top of the sheet metal in a single layer. Make sure you have enough oysters. Budget anywhere from 6 - 16 oysters per person."
    },
    {
      "title": "Cover oysters with a wet burlap sack or wet beach towel and wait for oysters to fully cook.",
      "content": "Cover oysters with a wet burlap sack or wet beach towel and wait for oysters to fully cook. Although burlap sacks work a little better than towels (and won't look unbecoming when they get steamed), towels are perfectly acceptable. Give the batch of oysters anywhere from 8 to 10 minutes to finish cooking. If you prefer oysters to be less cooked, aim for about 8 minutes. If you prefer your oysters to be more cooked, aim to keep them under the burlap sack for a couple more minutes. Throw away any oysters that haven't opened 1/4\" to 1/2\" after 10 minutes."
    },
    {
      "title": "While you wait for the sheet metal to heat up again, enjoy your first batch of oysters with friends.",
      "content": "While you wait for the sheet metal to heat up again, enjoy your first batch of oysters with friends. The sheet should take a handful of minutes to properly heat up. Repeat process over again when sheet metal is hot enough to receive a new batch of oysters."
    }
  ]
}