{
  "url": "https://www.wikihow.com/Apply-Eyeshadow",
  "title": "How to Apply Eyeshadow",
  "steps": [
    {
      "title": "Choose your eyeshadow.",
      "content": "Choose your eyeshadow. With entire stores designated just to eyeshadow options, choosing the right texture, hue, and brand can seem incredibly intimidating. Don’t allow the vast variety to scare you though - embrace it! The hundreds of options give you much flexibility in choosing the best eyeshadow for you. Shadows come in every color imaginable and can be found in loose powder, compact powder, and cream forms. The most highly pigmented eyeshadow is typically sold as a loose powder, but these are also the most difficult to control because of their loose form. Cream shadows are easy to apply but crease more quickly than powder eyeshadows. The best texture to start with as a novice eyeshadow-applier is a compact powder. You can always make eyeshadow more pigmented. Although you don’t need to have dozens of colors to be an eyeshadow artist, it is recommended that you have at least three shades of eyeshadow in the same color palette. Several different looks require a light, medium, and dark eyeshadow. If you don’t want to look overdone with your eyeshadow, choose three shades that are in neutral tones, such as browns or grays. Otherwise, choose any colors that might appeal to you and your style."
    },
    {
      "title": "Select the right brushes.",
      "content": "Select the right brushes. Although you can indeed apply your eyeshadow using your fingertips, they will likely be too big and are coated in natural oils which make application difficult. Invest in a few good makeup brushes for the easiest and most attractive eyeshadow application. [1] X Research source Avoid using sponge brushes for your eyeshadow, as these do not apply the pigment well at all. Use a stiff flat brush to apply eyeshadow to your entire lid. This brush is best for picking up lots of pigment and distributing it over your entire eyelid. A soft or stiff dome brush is used for applying eyeshadow to your crease and blending it outwards. These are a must-have for getting a smooth, even gradation of color from your lash line up to your browbone. Get a soft pencil brush to apply eyeshadow close to your lash line. These are small and thin enough to work on both your upper and lower lash line, as well as in difficult to reach areas like the inner corner of your eyes."
    },
    {
      "title": "Know how to apply your eyeshadow.",
      "content": "Know how to apply your eyeshadow. One of the most important aspects of applying your eyeshadow is using the correct brush strokes and speed. Rushing through your makeup or using the wrong brush strokes will create a messy, unattractive eyeshadow application. When you first apply the pigment to your eyelid, pat the eyeshadow on rather than brushing it across your lid. This will help it to stick to your lid better and give a solid rather than patchy appearance. Instead of sweeping your eyeshadow back and forth across your eye in a fast motion, use short, slow brush strokes going in the same direction to blend colors. You should never be moving your hand quickly as you apply your eyeshadow. Unless you are using a highlighter color, you should never apply your eyeshadow all the way up to your eyebrows. This is a surefire way to over-dramatize your eyes and make them look much too overdone."
    },
    {
      "title": "Apply your normal face makeup.",
      "content": "Apply your normal face makeup. Doing your eye makeup should be the last step in your makeup application process, so put on your regular makeup first. Apply your concealer, foundation, blush or bronzer, and brow liner before making your way to your eyeshadow. Apply a shadow primer to help your eyeshadow last all day. If you don’t, the natural oils your skin creates will seep through the shadow and cause it to gather along your crease several hours into wearing it. Never apply your mascara before putting on your eyeshadow, and unless you are doing a specialized smokey eye, your eyeliner should come after your eyeshadow as well."
    },
    {
      "title": "Apply your lightest color.",
      "content": "Apply your lightest color. Normally called a highlighter shade, this is typically a creamy nude eyeshadow. Use your stiff flat brush to put this on the inner corners of your eyes, sweeping it up and down to gather just slightly on the upper and lower lash line. [2] X Research source Apply a light sweep of it as well just below your eyebrows."
    },
    {
      "title": "Add your middle hue.",
      "content": "Add your middle hue. Take your color that is one step darker than your lightest - your medium shade. Use your flat brush to pat this color over the entirety of your lid, from your lash line to your crease. Don’t go too much further above your crease or outwards from the corner of your eye."
    },
    {
      "title": "Contour your lid with your darkest shade.",
      "content": "Contour your lid with your darkest shade. Use your dome brush with your darkest eyeshadow color to contour your eyelid. Start at the outside corner of your eye, and sweep the brush in a half-moon motion up and around to the center of your crease. Keep the shadow the darkest along your lash line, and fade it out as you move up. Feel free to draw the shadow up towards the end of your eyebrow a bit for an angled fan."
    },
    {
      "title": "Blend your eyeshadows.",
      "content": "Blend your eyeshadows. Clean your dome brush with antibacterial brush cleaner or soap and water, and dry it on a clean towel. Use your clean brush to blend along the edges of your shadow so that they fade nicely into your skin tone, as well as along your eyelid so that your three colors blend together. Use soft, sweeping brush strokes to blend the shadows. [3] X Research source"
    },
    {
      "title": "Put your middle tone over your eyelid.",
      "content": "Put your middle tone over your eyelid. Use your stiff flat brush to add a coat of your middle color eyeshadow to your eyelid, focusing on the center. This look requires only your middle and dark shades, although you can choose to add a highlighter if you would like."
    },
    {
      "title": "Accentuate your lid with your darkest eyeshadow.",
      "content": "Accentuate your lid with your darkest eyeshadow. Use your dome brush to apply your dark shade of eyeshadow to the inner and outer ⅓ of your eyelid. This means that your eyelid will have an application of ‘dark-middle-dark’ across the eyelid. Avoid getting the dark shadow too far inside the corners, as this will create the illusion of sleepy purple circles under your eyes. You can also choose to drag the outer edge of the dark shadow slightly upwards towards the end of your brow for a more dramatic look."
    },
    {
      "title": "Blend the shadows.",
      "content": "Blend the shadows. Clean your dome brush with brush cleaner or soap and water, and dry it completely on a clean cloth. Use it in a soft, brushing motion to blend the two colors together on your eyelid. Avoid bringing the darkest color too close to the center of your lid, as this will muddy the highlighted section you have created. Blend the outer edges of your eyeshadow as well, so there are no harsh colorblocking lines or sections on your lid. [4] X Research source"
    },
    {
      "title": "Cover your lid with your middle hue.",
      "content": "Cover your lid with your middle hue. Create your base color by using a stiff flat brush to pat on your medium color over the entirety of your eyelid. If you want, you can also add a tiny smudge of your highlighter shade to the inner corner of your eyes or just below your brow to brighten up your face a bit. [5] X Research source"
    },
    {
      "title": "Add your crease color.",
      "content": "Add your crease color. Use your pencil brush and your darkest color to darken your crease. Sweep the dark color back and forth across your entire crease to darken it and make your eyes appear more deep set. You can choose to create a regular banana - with the shadow only on the crease - or a closed-crease banana with the shadow running down to meet your lash line. Keep the shadow in a relatively thin line across your lid."
    },
    {
      "title": "Blend your colors.",
      "content": "Blend your colors. Clean your pencil brush well with an antibacterial brush cleaner or soap and water, and dry it with a clean cloth. Because you want your crease to stay pretty dark, use this brush to slightly blur the outer edges. Don’t blend the color too much, so your lid is completely highlighted."
    },
    {
      "title": "Add your highlighter.",
      "content": "Add your highlighter. Use your firm, flat brush to brush your lightest color onto the inside corner of your eyes and directly under your eyebrows. This will highlight the areas of your face responsible for making your eyes look larger and brighter. [6] X Research source"
    },
    {
      "title": "Apply your medium color.",
      "content": "Apply your medium color. Use your stiff flat brush to apply your middle color along your entire eyelid. Start from the base of your lash line and your work way to slightly above the crease. Try to avoid brushing it up to meet your highlighter, though."
    },
    {
      "title": "Create the smoky effect.",
      "content": "Create the smoky effect. Use your domed brush first to apply your darkest color along your upper lash line. Sweep the color across your entire lid, but only on the bottom ⅓. Then, use your pencil brush to apply a darker, more precise line of color along your lash line."
    },
    {
      "title": "Carry it to your bottom lash line.",
      "content": "Carry it to your bottom lash line. Use your pencil brush to add a bit of your darkest eye shadow color along your bottom lash line. Start at the outside corner and work your way to the inside corner, making it gradually lighter as you get closer to your inner tear duct."
    },
    {
      "title": "Blend your shadow.",
      "content": "Blend your shadow. Use your dome brush after it has been cleaned well to blend your shadows together. You want to create a smooth graduation of color, so take a few minutes to softly fade your darkest shadow up into the middle hue. Avoid contacting the line of dark shadow near your lash line too much, as you don’t want to make that part look too faded from blending."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}