{
  "url": "https://www.wikihow.com/Chronically-Online-Meaning",
  "title": "What Does It Mean to Be Chronically Online and How Can You Avoid It?",
  "steps": [
    {
      "title": "Someone who is \"chronically online\" is consumed by internet culture.",
      "content": "Someone who is \"chronically online\" is consumed by internet culture. When people describe someone else as “chronically online,” it generally means that they spend a significant amount of time online, to the point that it skews their perspective on life and makes it hard for them to talk rationally about political or social justice issues. They also tend to call out \"problematic\" behavior that others might not see as an issue. When people refer to themselves as chronically online, it’s used more in an ironic way to say that they spend a little more time online than they should. People also use “chronically online” to describe people whose personality revolves around internet culture, memes, and slang. You might also hear someone say “terminally online” or “extremely online.”"
    },
    {
      "title": "Spending too much time online can negatively affect your mental health.",
      "content": "Spending too much time online can negatively affect your mental health. When you spend too much time in front of a screen, you may feel isolated from people in the real world and expose yourself to unrealistic expectations that can negatively affect your confidence and self-esteem. You might also constantly feel stressed, anxious, and burned out because of the constant flow of information and notifications. [1] X Research source It can be difficult to confront your online habits, but setting some basic boundaries between you and your phone or computer can help you take back control of your time and your mental health. [2] X Research source"
    },
    {
      "title": "A chronically online person might share an opinion that isn’t based on reality.",
      "content": "A chronically online person might share an opinion that isn’t based on reality. They might share “chronically online takes,” where their political or moral opinions are overly extreme or where they judge a situation that a typical person would see as completely fine. If someone online shares a video of their brand-new house, someone who is chronically online might reply saying that they’re being classist because not everyone can afford to buy a house. “Did you see that person who said that Tom Holland is problematic because he’s a year older than Zendaya? Talk about a chronically online take.”"
    },
    {
      "title": "Someone who’s chronically online might only talk in internet slang.",
      "content": "Someone who’s chronically online might only talk in internet slang. If a person constantly uses meme language or slang in everyday conversation, they might be called “chronically online” by others around them. “Side eye, not you gatekeeping being vegan.” “Normalize not vibing with someone’s energy and mentality, it’s a huge ick.” “Making IRL mutuals in high school is low-key insane.”"
    },
    {
      "title": "A chronically online person may constantly call people out for being problematic.",
      "content": "A chronically online person may constantly call people out for being problematic. If a friend or someone online comments or makes posts calling someone “problematic” for something that’s not a serious issue in real life, you might say that that person is “chronically online.” “You’re not woke, you’re just chronically online.” “Don’t you think Becky is so chronically online? I can never talk to her about anything without her calling me problematic.” “I’m so chronically online! I can never get off my phone.”"
    },
    {
      "title": "Take breaks to help you control your internet use.",
      "content": "Take breaks to help you control your internet use. Try to take at least a 15-minute break for every 45 minutes you spend scrolling online. [3] X Research source You can also try taking a “screen fast.” Avoid using all screens for 24 hours, and increase the time for longer if necessary. [4] X Research source Although it might not be practical if you use screens for work, avoiding screens when possible can help you reflect on how you want your relationship with the internet to look going forward. [5] X Research source"
    },
    {
      "title": "Make your phone less appealing by removing colors and sounds that draw you in.",
      "content": "Make your phone less appealing by removing colors and sounds that draw you in. If you regularly surf the web on your phone or tablet, it might be tempting to check your apps out of habit over the course of the day. You can make your phone less visually engaging by turning off your notifications, turning your screen to greyscale , or removing social media and other time-consuming apps from your home screen. [6] X Research source You can also delete apps that you have a hard time avoiding and replace them with apps that add value to your life. For example, if you spend hours on Instagram every day, you could delete the app from your phone altogether and replace it with a meditation app."
    },
    {
      "title": "Fill your free time with activities you enjoy.",
      "content": "Fill your free time with activities you enjoy. Pick activities that are physically or mentally intense that distract you from going online, such as solving crossword puzzles , going to the gym, running , reading, walking your dog, or playing a musical instrument. [7] X Research source Make a list of things you enjoy doing or need to get done that don’t involve using the internet. If you feel tempted to go online, look at your list and choose something else to do instead. If you go to the grocery store or take a walk, consider leaving your phone or tablet at home."
    },
    {
      "title": "Practice mindfulness by focusing on your senses.",
      "content": "Practice mindfulness by focusing on your senses. One of the most effective ways to break a digital addiction and become more present is to focus on your senses. Start with hearing—close your eyes and allow yourself to listen to the sounds of the world around you without judgment. See any thoughts that arise as just another part of the soundscape around you. This hearing exercise can help you realize that all the noise going on inside of you and outside is all just happening, without any effort. You can also try to meditate . Find a quiet, calm area where you won’t be disturbed. Sit comfortably, close your eyes, and focus on breathing deeply . If you’re just starting out, try listening to a guided meditation or to meditation music to get started. [8] X Research source"
    },
    {
      "title": "Seek out a counselor or join a support group.",
      "content": "Seek out a counselor or join a support group. If you feel like your internet use is out of control and negatively affects your relationships, career, or hobbies, then consider seeking out a trusted therapist for help. [9] X Research source Keep an eye on how you’re interacting with the internet outside of work or school. Are you going online because you’re bored? Do you think you might be lonely or depressed? If so, you may want to consider seeking out a mental health professional. [10] X Research source"
    }
  ]
}