{
  "url": "https://www.wikihow.com/Activate-Almonds",
  "title": "How to Activate Almonds",
  "steps": [
    {
      "title": "Purchase raw almonds from your local grocery store.",
      "content": "Purchase raw almonds from your local grocery store. If your local grocery store doesn’t carry raw almonds, check your local health food store. You can either purchase non-organic or organic raw almonds. [1] X Research source Make sure they are unsalted and not roasted."
    },
    {
      "title": "Pour 2 to 4 cups (280 to 560 grams) of raw almonds in a large bowl.",
      "content": "Pour 2 to 4 cups (280 to 560 grams) of raw almonds in a large bowl. Use a bowl that is large enough to hold the almonds and the water to cover them. Whether you use 2 or 4 cups depends on how many almonds you want to activate. [2] X Research source"
    },
    {
      "title": "Cover the raw almonds with water.",
      "content": "Cover the raw almonds with water. Pour enough water into the bowl until all of the almonds are submerged by 1.5 inches (3.8 cm) of water. Add a half of a tablespoon to a tablespoon (9 to 18 grams) of sea salt to the bowl. Use a spoon to stir the almonds, salt, and water together. [3] X Research source The salt makes the almonds taste better and helps to deactivate the enzyme inhibitors."
    },
    {
      "title": "Soak the almonds for 7 to 12 hours.",
      "content": "Soak the almonds for 7 to 12 hours. Cover the bowl with a clean cloth. Set the bowl aside on a counter. Let the almonds soak overnight, or for 7 to 12 hours. [4] X Research source"
    },
    {
      "title": "Drain and rinse the almonds.",
      "content": "Drain and rinse the almonds. Once the almonds have finished soaking, pour them into a sieve to drain them. Hold the sieve under running water to rinse the almonds of salt and other debris. [5] X Research source"
    },
    {
      "title": "Eat the almonds",
      "content": "Eat the almonds raw. You can eat the almonds raw without roasting them. You can soak them or add them to other foods, such as putting them in a trail mix. However, if you like the taste and crunch of dry almonds, then try roasting them in an oven or drying them in a dehydrator. [6] X Research source"
    },
    {
      "title": "Season the almonds with salt or a dry mix if you want to.",
      "content": "Season the almonds with salt or a dry mix if you want to. Fill the bottom of a small bowl with salt, cinnamon sugar, Cajun seasoning, or one of your favorite dry mixes. Toss the almonds in the dry mix until they are evenly coated. [7] X Research source"
    },
    {
      "title": "Lay them on a baking sheet.",
      "content": "Lay them on a baking sheet. Line a baking sheet with parchment paper. Pour the almonds onto the parchment paper. Spread them out evenly on the baking sheet. [8] X Research source The almonds should be lying flat, and not overlapping each other, on the parchment paper."
    },
    {
      "title": "Cook the almonds in a 150 °F (66 °C) oven for 12 to 24 hours.",
      "content": "Cook the almonds in a 150 °F (66 °C) oven for 12 to 24 hours. If your oven’s lowest temperature setting is above 150 °F (66 °C), then bake them on the lowest setting for 8 to 10 hours. The almonds are done when they taste dry, or when their centers are dry and not wet and soft. [9] X Research source Make sure your almonds are completely dry before storing them. If they are not completely dry, mold will grow on them, even if they are stored in an airtight container."
    },
    {
      "title": "Use a dehydrator to dry them if you have one.",
      "content": "Use a dehydrator to dry them if you have one. Set your dehydrator to 150 °F (66 °C). Lay the almonds in a single layer on the dehydrator trays. Place the almonds in the dehydrator for 12 to 24 hours, or until crispy. [10] X Research source You do not need to line the dehydrator trays with parchment paper."
    },
    {
      "title": "Store the almonds in an airtight container.",
      "content": "Store the almonds in an airtight container. Let the almonds cool to room temperature, about an hour. Place the almonds in a mason jar, or a plastic or glass container that is airtight. Store them in your pantry for 1 month. [11] X Research source You can also store them in the fridge for up to 6 months."
    }
  ]
}