{
  "url": "https://www.wikihow.com/Activate-Google-Translate-on-a-Page",
  "title": "How to Use Google Translate to Translate Any Webpage",
  "steps": [
    {
      "title": "Launch Google Chrome .",
      "content": "Launch Google Chrome . It has an icon that resembles a red, yellow, and green wheel with a blue dot in the middle. Click the icon from your computer’s desktop or program list to launch and open a Google Chrome browser."
    },
    {
      "title": "Visit a website in another language.",
      "content": "Visit a website in another language. Visit a page that’s written in a language you cannot understand. Try searching Google for foreign websites, or if you already have one in mind, enter the URL in the search bar."
    },
    {
      "title": "Click the Translate icon.",
      "content": "Click the Translate icon. It's to the right of the address bar at the top. It's the icon that resembles a folded sheet of paper. This icon should pop up automatically when you visit a website that is not in your default language. If the Translate icon does not appear, right-click the page (or ctrl-click on a Mac) and click Translate to English or whatever your default language is."
    },
    {
      "title": "Click the English tab.",
      "content": "Click the English tab. It's the second tab that appears at the top of the box that appears when you click the Translate icon. This translates the entire web page into English. [1] X Research source If you wish to translate the web page into a different language, click the icon with three dots ( ⋮ ) at the top of the Translate box. Then click Choose another language . Use the drop-down menu to select and language and click Done . If Google Chrome detects that the web page is written in a different language than what the page is written in, click the icon with three dots ( ⋮ ) at the top of the Translate box. Click Page is not in [language] . Use the drop-down menu to select the proper language and click Done ."
    },
    {
      "title": "Launch Google Chrome .",
      "content": "Launch Google Chrome . It has an icon that resembles a red, yellow, and green wheel with a blue dot in the middle. Tap the icon on your home screen or apps menu."
    },
    {
      "title": "Visit a website in another language.",
      "content": "Visit a website in another language. Visit a page that’s written in a language you cannot understand. Try searching Google for foreign websites, or if you already have one in mind, enter the URL in the search bar."
    },
    {
      "title": "Tap ⋮ or ⋯.",
      "content": "Tap ⋮ or ⋯ . It's the icon with three dots in the upper-right corner of Google Chrome. This displays a menu. Alternatively, you may see a pop-up at the top of the page that says \"Translate page?\" You can tap Translate in the pop-up to instantly translate the page into your default language."
    },
    {
      "title": "Tap Translate.",
      "content": "Tap Translate . It's in the menu that appears when you tap the icon with the three dots. It's next to an icon that resembles a page folded in half. This will instantly translate the page into your default language. If you wish to translate the web page into a different language, click the gear icon in the Translate pop-up. Then tap More Languages . Then tap the language you want to translate to in the menu. If Google Translate detects the web page is in a different language than it is written in, tap the gear icon in the Translate pop-up menu. Then tap Page is not in [language] . Select the correct language from the list. On iPhone and iPad, if you want to select a different language, or the web page language is different than what is detected, tap the gear icon in the Translate box. Use the drop-down menus to select what language the website is written in, and what language you want to translate to and tap Translate ."
    },
    {
      "title": "Find a Google Translate extension for your web browser.",
      "content": "Find a Google Translate extension for your web browser. If you want to use Google Translate in a different web browser besides Chrome, you will need to install an extension . The following are some Google Translate extensions you can use: Firefox: To Google Translate by Juan Escobar . Microsoft Edge: Context Menu for Google Translate . Safari: Safari does not have a Google Translation extension. However, Safari does have its own built-in translation feature on both Mac as well as iPhone and iPad."
    },
    {
      "title": "Install the extension.",
      "content": "Install the extension. To do so, click Add to Firefox or Get at the top of the page. Then click Add or Add extension in the pop-up menu. This will add the extension to your web browser."
    },
    {
      "title": "Visit a website in another language.",
      "content": "Visit a website in another language. Visit a page that’s written in a language you cannot understand. Try searching Google for foreign websites, or if you already have one in mind, enter the URL in the search bar."
    },
    {
      "title": "Click the extension icon.",
      "content": "Click the extension icon. It should be to the right of the address bar at the top of the page. Both extensions mentioned above have an icon that resembles an \"a\" next to a character from another language."
    },
    {
      "title": "Select the language the page is written in.",
      "content": "Select the language the page is written in. If you are asked to select which language the web page is written in, select it from the first drop-down menu."
    },
    {
      "title": "Select the language you want to translate to.",
      "content": "Select the language you want to translate to. Use the drop-down menu in the Translate box to select what language you want to translate the web page to."
    },
    {
      "title": "Click Translate.",
      "content": "Click Translate . It's the blue button in the pop-up box. This will translate the entire web page using Google Translate."
    }
  ]
}