{
  "url": "https://www.wikihow.com/Be-a-Beautiful-Black-Teenage-Girl",
  "title": "How to Be a Beautiful Black Teenage Girl",
  "steps": [
    {
      "title": "Try embracing your natural hair.",
      "content": "Try embracing your natural hair. This can connect you to your heritage and show off your natural unique beauty. It takes a lot of work to keep natural hair happy at first, but it gets easier with practice."
    },
    {
      "title": "Protect your hair at night.",
      "content": "Protect your hair at night. Try a silk or satin scarf, bonnet, or pillowcase. [1] X Research source [2] X Research source This protects your hair from breakage and can also be a cue to relax after a long day. If you want to wrap your hair but have no one to teach you, you can learn online. [3] X Research source Wash your scarf, bonnet, or pillowcase at least once a week to keep it clean. You can rotate between a few options. Don't wrap your hair too tight."
    },
    {
      "title": "Oil your hair using natural sprays, creams, and moisturiser.",
      "content": "Oil your hair using natural sprays, creams, and moisturiser. When washing, it's best to use two layers of conditioner that is designed for black hair, as it is manufactured to lock in moisture more than products aimed at other hair types. Don't use hair grease, though, as the chemicals in it aren't good for hair shine and can thin the hair. Oiling your hair is especially important as the kinks in black people hair make the natural moisture stay at your roots, which is why black people's hair is always dry. Shampoos for straighter hair are designed to get rid of the natural greases, which black hair needs to grow. Using the wrong shampoos and not enough moisturizers is the main reason why black hair cuts/breaks off. Castor oil, black castor oil, argan oil or coconut oil is a good product to keep on hand. Coconut oil is good for your skin as well."
    },
    {
      "title": "Air dry and use a thick wide comb when damp, rather than using a hot hair dryer comb.",
      "content": "Air dry and use a thick wide comb when damp, rather than using a hot hair dryer comb. Using the hair dryer extension is okay if your hair has been moisturised properly for a while, though using hair oils afterwards is essential."
    },
    {
      "title": "Know how to care for a weave.",
      "content": "Know how to care for a weave. Leave space between each weave, about as much space between each weave as you last kept it in. This will help prevent hair loss and a chipping hairline. It also stops thinning hair and some bold patches. However, remember; full hair loss is very rare with weaves. It only tends to happen to people with dryer and shorter hair or people with much shorter hairline hair than their central hair. Weaves should be taken out from 1–2 months, depending on how messy it gets, how tight it is and what type of weave you have. Don't let people tug on your hair. This can cause breakage."
    },
    {
      "title": "Think long and hard before using chemicals.",
      "content": "Think long and hard before using chemicals. Perms/relaxers are quite extreme. If you don't have one and are thinking of getting one, watch a documentary such as Good Hair, which explains the chemicals and side-effects of perms. On the positive side, perms don't require as much combing attention as natural hair and can be styled into styles that white people tend to have. As having a perm/relaxer can cut about half of your hair length off at a time, some people use black hair extensions to attach to the hair, though the glue can cut it further. If you want to maintain the look of the perm, avoid water wherever possible."
    },
    {
      "title": "Be careful with perms to avoid hair loss or permanent injury.",
      "content": "Be careful with perms to avoid hair loss or permanent injury. Never do a perm by yourself unless you've had lots of practice. Have a specialist do your hair as they have done it many times before. If you're lucky, a bad perm will only hurt your hair. If you're unlucky, you can do permanent damage to your body. Perms can cause psoriasis (skin flaking off) or worsen eczema. They can also cause painful burns, including ones that cause permanent scars. If the chemicals go in your eyes or ears, you could become blind or deaf."
    },
    {
      "title": "Avoid damaging your hair.",
      "content": "Avoid damaging your hair. Strategies like hot combs can straighten your hair, but they also can damage it, especially if it's already dry."
    },
    {
      "title": "Choose the right type of skincare products.",
      "content": "Choose the right type of skincare products. Many black people love cocoa butter. So long as you're not allergic to them, coconuts are not only great for black hair, but also black skin. They are full of nutrients and cocoa butter even lightens/darkens your scars to make them less visible. Cocoa butter is very good for moisturizing skin and it helps keep dry patches looking less dry. Also, the moisture can last even after a bath (though it's best to apply at least once a day, preferably in the morning). Other great moisturizers are shea butter and aloe butter. When choosing products, look for ones with few chemicals and not a lot of fragrance. Remember: the further down the ingredient list, the less it contains."
    },
    {
      "title": "Look for quality makeup if you decide to wear it.",
      "content": "Look for quality makeup if you decide to wear it. Look around a market or in areas where the majority of the area is black. Makeup designed for darker skin can often be found in areas where hair products for dark-skinned people can be found, so it shouldn't be too hard to find if you know where to look."
    },
    {
      "title": "Try darker \"nude\" colored lip liner and lipstick.",
      "content": "Try darker \"nude\" colored lip liner and lipstick. For blush, if you are daring, try a dark purple. This doesn't look good on everyone, but if your skin is dark enough you can pull it off."
    },
    {
      "title": "Go with dark mascara.",
      "content": "Go with dark mascara. Choose black mascara instead of brown-black or blue. Since your skin is already dark, pure black will best highlight your eyes. Wearing lighter mascara can go wrong (and it's hard to remove). Try using purple highlighter for a fun holographic effect. Apply it as eyeshadow in the center of your eyelid."
    },
    {
      "title": "Do not ever buy foundation too light for your skin color.",
      "content": "Do not ever buy foundation too light for your skin color. It's like when white people put on too much fake tan. You look orange, and your eyes will just look dark so you'd look like a panda. Buying darker foundation can be okay when they match your darker areas. Focus on finding a foundation that matches the undertone of your complexion. It’s okay if you need to mix 2 foundations together to get the perfect match."
    },
    {
      "title": "Find black role models.",
      "content": "Find black role models. They can offer inspiration, from cute looks to things you want to do with your life. Famous black people who are good and stay true to themselves are good people to look up to. Black writers have many interesting things to say. Go to your local library to read books by black authors. Don't overlook the strong, kind Black women in your world. Look into your family, school, church, and community. How do they live their lives? What can you learn from them? Don't be afraid to turn to them for advice."
    },
    {
      "title": "Don't hurt your hair or skin in the name of fashion.",
      "content": "Don't hurt your hair or skin in the name of fashion. Your body's health is more important than its looks. Don't try experimental or cheap treatments. Hair dye can damage black hair, and most of the time won't make a difference or only dye thinner parts of the hair."
    },
    {
      "title": "Don't drastically change your looks based on what others want.",
      "content": "Don't drastically change your looks based on what others want. Giving in to try to look 'white' is one of the last things a black girl should even be thinking. Black is beautiful and you are beautiful. Embrace this. There are many kinds of beauty. Just because someone who looks different from you is pretty doesn't mean you aren't either. Would you tell a carnation to look more like a daisy in order to be beautiful? Or would you try to help it be the best carnation it can be?"
    },
    {
      "title": "Be yourself instead of worrying about avoiding or fitting racial stereotypes.",
      "content": "Be yourself instead of worrying about avoiding or fitting racial stereotypes. Black girls are diverse. You shouldn't have to worry about whether you're \"ghetto\" or \"acting white.\" Act like yourself. While it's okay to explore your identity and try new things, do them because they interest you, not because of social pressure. You are black enough. You don't have to say \"yo,\" listen to rap or reggae, or dress certain ways in order to love yourself as a black girl. Embrace your black identity while doing what feels authentic to you. You don't have to hide your blackness. You shouldn't have to make yourself smaller or force yourself to \"blend in\" with non-black people. Don't apologize for your blackness."
    },
    {
      "title": "Decide how you want to respond to weird or backhanded comments.",
      "content": "Decide how you want to respond to weird or backhanded comments. Sometimes, people will say thinks that make you feel awkward or upset, like \"your hair is weird\" or \"you're pretty for a black girl.\" (Nobody says that to white girls!) You can say things like: \"Thank you for noticing that I'm beautiful. Lots of black girls are.\" \"And you're pretty for a white person.\" \"I like my hair.\" \"Only hairdressers, close friends, and family can touch my hair. You aren't any of those.\" \"That's a hurtful thing to say.\" \"I asked you not to say things like that, and yet you keep doing so. I don't understand why.\""
    },
    {
      "title": "Show beauty through kindness and positivity.",
      "content": "Show beauty through kindness and positivity. Choose to be caring, helpful, and thoughtful to help your inner beauty shine. Try to do or say at least one good thing for someone else every day."
    },
    {
      "title": "Try to lift other people up.",
      "content": "Try to lift other people up. Think about how you can make life better for other people. It can be as simple as a compliment or as involved as helping your dad with a big project at home. Try to be a good influence on the people around you. People may forget the things you said and did, but they'll remember how you made them feel."
    },
    {
      "title": "Embrace your curiosity.",
      "content": "Embrace your curiosity. Teenage years are a great time to learn, ask questions, and experiment (safely, of course). What do you want to learn about? What do you want to try? Find what makes you feel excited and energetic. That's beauty."
    },
    {
      "title": "Find healthy ways to deal with your feelings.",
      "content": "Find healthy ways to deal with your feelings. You may find that your emotions have gotten stronger and more complicated as you're growing up, which is normal. Look for ways to acknowledge and process your feelings so they don't overwhelm you. Here are some things you can do to help: Write in a journal Exercise or do yoga Meditate Make art Label your feelings out loud or on paper Talk about how you feel with someone you trust"
    },
    {
      "title": "Surround yourself with people who lift you up.",
      "content": "Surround yourself with people who lift you up. Spend more time with people who help you feel good about yourself and your life. Limit your time with people who drag you down. Look for good influences in life. Here are some hints to help you identify the right people: How do I usually feel after I spend time with this person? Do I ever feel pressured to do things I'm uncomfortable with when I'm with this person? Does this person tend to see the best or worst parts of me? When I see that this person has sent me a text or message, what's my first reaction? Do I look forward to spending time with them?"
    },
    {
      "title": "Enjoy your teenage years.",
      "content": "Enjoy your teenage years. Don't forget to focus on the activities, people, and ideas that make you happy. Being a teenager comes with lots of challenges. Make time to rest, recharge, and just have fun."
    }
  ]
}