{
  "url": "https://www.wikihow.com/Be-Happy-at-Work",
  "title": "How to Be Happy at Work",
  "steps": [
    {
      "title": "Wake up at least an hour before you need to leave for work.",
      "content": "Wake up at least an hour before you need to leave for work. Enjoy some \"me\" time before the rush begins. Though your sleep is precious, so is your need for some time to be by yourself without feeling overwhelmed. Give yourself time to eat breakfast, read a little bit, go for a short jog, or to do whatever you need to do to get the day started off on the right foot. Nothing will make you feel better than knowing you already did something for yourself before walking through the front door of your workplace. You may need to go to bed half an hour earlier or so to get used to doing this. Try to make the most of your time home after work so you don't end up staying up too late for no reason. Though you may be tired when you come home from work, if you just collapse and watch television for hours, you may be liable to stay up late without truly doing anything for yourself."
    },
    {
      "title": "Dress for success.",
      "content": "Dress for success. When you leave the house looking good and ready for work, then you are well on your way to having a good day. If you work in a casual environment or in a place with a uniform, then you don't need to add too many personal touches to your look, but you should shower, wash your face and hair, and look generally well-groomed. Not only will looking nice make other people treat you with more respect, but it may leave you feeling more excited about being at work. Even if you show up to work feeling tired, seeing yourself looking put together in the mirror can give you the energy you need to start your day off on the right foot."
    },
    {
      "title": "Leave your personal problems at home.",
      "content": "Leave your personal problems at home. Though it can be hard to feel happy at work when you're too busy worrying about the fight with your boyfriend, your mother's health, or scrambling to do some last-minute planning for your wedding, learning to push your personal problems aside is the only way you can feel happy in the workplace. Tell yourself that whatever problems you're having will have to wait until work is over, unless they are really important, and go about your work day. In fact, pushing your personal problems aside can lead you to look forward to work more, because you'll see it as a haven from your problems, instead of a place that's keeping you from addressing them. [1] X Research source Don't try to squeeze your personal problems into your work day. Make the phone calls and send the emails you need to send after work hours, or during your lunch break, if necessary. If you try to get your job done while trying to solve your personal problems, you'll be twice as stressed about them because you'll be anxious about finding a time to do both."
    },
    {
      "title": "Get to work at least ten minutes early.",
      "content": "Get to work at least ten minutes early. A rushed and bad start will minimise your chances of having a good day and feeling happy at work. If you get to work late, you'll feel like you're behind all day, and like you never have time to catch up. Instead, leave the house at least 15 minutes earlier than you have been, or even earlier, depending on when you normally get to work. You may think that you're winning by rolling in a few minutes late every day, when in reality, you'll be lowering your chances of being happy at work. [2] X Research source Having positive relationships with your bosses and coworkers can have a big impact on how happy you are at work. If you're known for showing up late, then people will look down on you for being a slacker, and your relationships will suffer."
    },
    {
      "title": "Greet your colleagues when you get to work.",
      "content": "Greet your colleagues when you get to work. When you first walk in the door, make sure to greet as many of your colleagues as you can before you get to work. You'll instantly feel more connected to people and will feel your positive energy growing. You may feel stressed out, rushed, or just plain cranky, but isolating yourself is not the way to make yourself more excited about work. Instead, be friendly when you get to work, even if you don't feel very friendly. Remember that part about getting to work early? One reason you should do so is to have time to connect with your coworkers a bit. If you get in late, you'll feel like you don't have time to say hi to people. But if you take your time, you'll have a few minutes to establish a connection with people without feeling frazzled. If you don't greet people or rush off to your own office, you'll develop a reputation for being antisocial, whether it's true or not."
    },
    {
      "title": "Have a welcoming workspace.",
      "content": "Have a welcoming workspace. Make sure to keep your desk or work area organized and tidy so that you know where everything is and don't waste time looking for lost items. You can have a filing system, or trays on your desk, that help you organize your tasks in terms of what has to be done today, next week, or by the end of the month. Taking just 10 minutes a day to keep your workspace organized can make a big impact on how happy you are at work. You want to feel comforted, not stressed out, when you enter your workspace. Personalize your cubicle, work space or office. Adding plants, pictures of friends and family, and other personal items leads to increased job satisfaction, if permitted. This will also make your work space feel more like home. [3] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "Complete simple tasks as quickly as possible.",
      "content": "Complete simple tasks as quickly as possible. Answer correspondence which simply requires an immediate reply (without any research), fax simple returns immediately. Then categorise the rest of your post into \"urgent: respond by the end of the week\" and so on. Remember that every job completed and not deferred brings a sense of accomplishment which leads to a sense of happiness at work. Instead of dreading completing a task like making a quick phone call or sending an email, just get right to it when you have the time. You'll feel better about it because you'll be able to move on about your day without it nagging at you."
    },
    {
      "title": "Take pride in your work.",
      "content": "Take pride in your work. This refers to tasks big or small from a fax to a report. Professionally presented documents will bring praise and recognition from colleagues and even management; so will a delicious meal made perfectly or an incisive lecture on Shakespeare. Whatever work you do, take pride in the work you've put in as well as in how it impacts people. Everybody loves praise and the happiness and sense of pride in a job well done that it brings. Even if you feel like a lot of your work is monotonous, you should find something to take pride in, whether it's a small aspect of the job (like a report you completed this month) or a finished product (a house you've built)."
    },
    {
      "title": "Treat your clients or customers with respect.",
      "content": "Treat your clients or customers with respect. Help them as much as you can. You may find that they will express gratitude in various forms. We all love to feel useful and we all feel happy when people thank us for simply \"doing our job\" or going the extra mile. Whether you work in an office or in a restaurant, it never helps you to be rude or condescending to other people. You may feel frustrated or impatient, but having a negative interaction with people will only make you feel worse. If you want to feel happier in the workplace, then you should work to foster a positive relationship with the people you work with. Of course, if someone is really treating you poorly, then you may not be able to put a big smile on your face. If you work on being patient and staying in control of your emotions, you'll be improving your attitude at work for sure."
    },
    {
      "title": "Be as physically active as you can at work.",
      "content": "Be as physically active as you can at work. Though you may feel like you're strapped to your desk all day, or stuck in one position, there are a number of things you can do to improve the amount of physical activity you can do during your work day; being more physically active will make you feel more energized and happier. This can start with your commute: you can try to walk or bike to work, or just to find a way of getting there that requires some physical exercise, even if it means walking a little longer to catch a bus. Once you're in the workplace, here are some things you can do to get more exercise at work: Take the stairs instead of the elevator Walk to a co-worker's office instead of sending an email to ask a question Leave the office to walk across the street to get coffee Go outside to eat your lunch Get a standing desk to burn more calories while you work"
    },
    {
      "title": "Take breaks.",
      "content": "Take breaks. If you want to be happier in your workplace, then you have to take breaks from your work from time to time. You don't want to feel repressed or like you can't leave your desk or go outside until you're done with your work day. Studies show that it's important to take a break at least every 90 minutes; step away from your computer or whatever task your doing and take 10 minutes to rest your eyes, stretch, take a short walk, make a brief phone call, or even read a little bit. If you have the luxury of taking a break from your work, then you should make a habit of it if you want to feel happier. [4] X Research source If you work inside an office building, you should make sure you leave the building at least once or twice a day, if you're allowed. If you start feeling cooped up in all that stale air conditioning and fluorescent lighting, it can have a serious negative effect on your mood. Stepping outside to get some sunlight and fresh air from time to time will make you happier as you go about your day."
    },
    {
      "title": "Avoid multitasking.",
      "content": "Avoid multitasking. Though you may think that multitasking can help you get your work done faster, it has been shown to actually slow you down, not allowing you to fully immerse yourself in one task. You should check your email, respond to any emails you need to read, and then move on to project A, and then move on to report B, etc, if you want to systematically check items off your work to-do list. If you end up doing five tasks halfway, then you'll feel less of a sense of accomplishment than if you fully completed one or two tasks. It can help to write a to-do list at the beginning of your work day and to go about checking items off of it. You'll feel more accomplished, and therefore, happier in the process. Do not waste time reading junk mail. Sift through your e-mails and delete all jokes and sappy messages from friends. Ask your friends to only send e-mails to your home. Wasting valuable working hours at work will lead to increased stress and rob you of happiness. It'll also keep you from being focused on the task at hand."
    },
    {
      "title": "Steer clear of cliques.",
      "content": "Steer clear of cliques. It is especially important to avoid groups which target co-workers and management: negativity drains you of energy and blocks happiness and positive thoughts. Work on being friendly with everyone instead of joining a group of just three or four people and alienating everyone else. You don't want to join a clique and then find that the people in it turn on you. Instead, try to be on good terms with everyone without becoming stuck in one social circle; your happiness will grow as a result. Though you may feel temporary satisfaction when you're \"in\" with a group of people, in the long run, it will lead to drama you don't want."
    },
    {
      "title": "Offer praise as well as criticism.",
      "content": "Offer praise as well as criticism. It's important to speak up when you think that something in your workplace can be improved. However, it's equally important to point out when your coworkers or company is doing something right. If you thought everything at your workplace was done incorrectly, then you wouldn't be working there, would you? Make sure to speak up to give praise when it's needed so that you stay upbeat and make yourself aware of all the good things your job has to offer. If you're only complaining and being a negative Nancy all the time, then you'll get a bad reputation. One main way to be happy in your workplace is to make friends with your colleagues, so you want to maintain a good reputation."
    },
    {
      "title": "Be friends with your coworkers.",
      "content": "Be friends with your coworkers. Studies show that one of the best ways to be almost as happy at work as you are away from work is to be friends with your coworkers. [5] X Research source Though you may feel like you have enough friends, you should get to know your coworkers so that you're excited to see them every day and that you feel more connected in the workplace. You should give your coworkers your time, make small talk with them, and work on building closer relationships. Though you can't be best friends with everyone, you should seek friendships with the people who really matter to you. Find opportunities to socialize at your workplace. Go grab coffee or hang out in the break room with your coworkers, or even step out for lunch with them. Try to isolate yourself as little as possible. If you have people to connect with in your workplace, then you won't look at it as this place that's just a punishment until you can return to your real life. Who knows, you may even look forward to getting up to go to work in the morning because you can't wait to catch up with your coworkers over lunch!"
    },
    {
      "title": "Watch your body language.",
      "content": "Watch your body language. When you are talking to colleagues or clients and you have your arms folded across your chest, not only will you be sending the wrong signals but you will unconsciously be blocking your ability to communicate openly. Open communication reminds us of our common humanity and brings happiness as a result. Having open body language can make you happier at work because your coworkers will be more likely to have positive interactions with you. Standing tall and looking ahead instead of at the ground will also help you project confidence, which is what you'll need to gain respect in the workplace and to feel happier."
    },
    {
      "title": "Avoid negative people at all costs.",
      "content": "Avoid negative people at all costs. Colleagues who moan and whine about personal or work issues, will drag you down and prevent the workplace from being a happy one. Instead, focus on people who are positive, upbeat, and who have an optimistic attitude about their work. If one of your coworkers is complaining about work too much, then you will start to find a million things wrong with your job. Of course, it's important to be observant, but you shouldn't let other coworkers lower your happiness. Avoid gossip. If you want to be happy at work, then don't get involved in office drama or idle gossip. Stick to talking about the things you care about and the things that make you happy. If you are known as a gossip, you'll soon be the target, and this won't help your happiness at all. [6] X Research source"
    },
    {
      "title": "Don't overextend yourself.",
      "content": "Don't overextend yourself. One way you can make yourself happier at work is to stop saying yes when you really mean no. Though you may want to do everyone a favor, you should stick to your guns when you know you have too much on your plate. Be honest with your boss or your coworkers when you feel like you already have too much to do instead of getting overwhelmed and feeling like the work will never end. This will lead you to be happier, and to immerse yourself in the tasks you are capable of doing, instead of trying to please everybody. If you feel like you want to help a colleague out but are too crunched for time, say that you can't do the task he or she wants you to do right now, but that you'd like to help out with something else in the future."
    },
    {
      "title": "Make the most of every work day.",
      "content": "Make the most of every work day. Even if you are looking for another position and just biding your time, remember that your boss will have to write a testimonial or reference letter for you. If you are a happy, committed and quality-driven employee, chances are, the reference will be a positive one and may just land you that job you seek. Even if you're feeling bummed out or frustrated at work, try putting on happy face — it's been proven to actually make people feel happier. There's absolutely nothing you can lose from trying to be as happy as you can in the workplace. If you're feeling negative, complaining, or ranting to other coworkers, you're guaranteed to feel worse."
    },
    {
      "title": "Find meaning in your work.",
      "content": "Find meaning in your work. One important way to feel happy at work is to find some meaning in the work you do. You don't have to be the CEO of a non-profit to feel like you're making a difference in people's lives. Whether you're a teacher, a waitress, or a corporate executive, you have to find a reason to do the work you do. You could be helping people, whether they are students, customers, or clients. If you struggle to find any meaning in the work you do, then it may get pretty difficult to be happy at work. [7] X Research source You may feel like a lot of your job is filled with drudgery, which can lead you to forget the bigger picture. If you're a teacher, for example, you may spend so much time grading papers that you forget that you're teaching children to love literature or to develop their powers of reasoning. Take a moment to remind yourself why the work you do means something and you'll see your happiness soar."
    },
    {
      "title": "Don't obsess over your salary.",
      "content": "Don't obsess over your salary. Though not being fairly compensated or feeling like you're more than overdue for a raise is unpleasant, you can't let this thought control your every move. If you step out for lunch, don't tell yourself that enjoying a burger and fries with your coworkers is the equivalent of working for half an hour; if you start to follow this line of thinking, you'll soon be filled with despair. Instead, draw up a larger budget and stick to it, but don't think of every little dollar you spend as being some fraction of your salary. Of course, if you feel that you are more than overqualified for your job, then you may be happier at a higher-paying position that is better suited to your needs. You can also ask your boss for a raise, if you feel that you deserve it. However, remember that increasing your salary by a marginal percentage won't make you happier for long."
    },
    {
      "title": "Think about all of the people who need you.",
      "content": "Think about all of the people who need you. If you're feeling down in the dumps about your time at work, take a minute to think about all of the people who depend on you. Think of your students, your fellow waitstaff, the other people in your office, or whoever depends on you in your work environment. Think about what would happen if you didn't show up to a day of work — or didn't show up ever again. Many people would suffer and wouldn't know what to do with themselves. Remind yourself how valuable you are the next time you have doubts about whether your current employment situation is right for you. You can also take some time to think about all of the people at work you need to go about your day. This will make you realize that you're in a supportive, collaborative environment and that you and your colleagues really need each other."
    },
    {
      "title": "Reward yourself for a job well done.",
      "content": "Reward yourself for a job well done. Though productivity is important, so is mental health. If you want to be happy at work, then you should periodically reward yourself for getting through a certain task or getting done with your work day. You can schedule a happy hour at work after a series of what you know will be stressful meetings. You can enjoy a sugar cookie after teaching two of your hardest classes. You can spend ten minutes reading up on your celebrity gossip after turning in a complicated report. Find whatever motivates you to get your work done and use it as a reward after a hard day. [8] X Research source Having rewards for yourself will also give you something to look forward to throughout your work day. You may be more energetic and efficient if you know that you'll have a romantic dinner date with your partner after a day of work."
    },
    {
      "title": "Make time for your friends and family.",
      "content": "Make time for your friends and family. No matter how busy you may be, it's always important to make time for the people closest to you. If you spend all of your energy on your job or complaining about your job, then you won't be able to stop and enjoy life. If you want to create a healthy balance between work and play, then you should make sure to see one of your friends at least once a week and to check in with your family, whether it's over the phone or in person, at least once a week so you feel connected to the outside world. You'll be happier at work if you have more love, family, and friendship in your life. When you feel like you're too busy to return a friend's call, ask yourself if there's something you can cut back on to give yourself time to do the things you love. Chances are, you can spend half an hour less watching TV, browsing Facebook, or repeatedly hitting the snooze button and devote that time to catching up with someone you care about."
    },
    {
      "title": "Know when your work just isn't working.",
      "content": "Know when your work just isn't working. Though there are many things you can do to be happier at work, there may come a time when you realize that nothing you do can truly make you happy at work. Maybe it's because you're treated unfairly in your workplace. Maybe you're doing something you don't really believe in instead of pursuing your passion. Maybe you just feel completely worn down and uninspired. If you've come to the conclusion that nothing you do can really make you happy at work, then it's time to start looking for more meaningful, fulfilling work. Of course, finding an amazing job is easier said than done in today's job market. But even beginning the act of looking can give you more hope and meaning in your life."
    }
  ]
}