{
  "url": "https://www.wikihow.com/Ask-if-a-Business-Is-Hiring",
  "title": "How to Ask if a Business Is Hiring",
  "steps": [
    {
      "title": "Search for HR employees on the website.",
      "content": "Search for HR employees on the website. Most companies have websites which list their HR employees. It might take some searching to find exactly who you need to talk to, but don’t give up. Most HR departments have at least a general email address listed, and often list the email addresses of individual employees. If, despite your best efforts, you can't find the appropriate email addresses, call the company. Ask if they can give you contact information—preferably an email address—for the hiring manager or recruiter."
    },
    {
      "title": "Craft a polite email.",
      "content": "Craft a polite email. Once you’ve found the email address of a recruiter or hiring manager, take some time to write a clear, polite email. You should use their title, explain who you are, and what type of position you’re looking for. For example, you could write: “Dear Ms. Johnson, I have loved shopping at Forever 18 for many years, and I have recently become interested in taking my love for the store to the next level by working there. I have 5 years of retail experience, including 2 years as a manager. Are there any current openings in your company? Thank you for your time.” If it feels appropriate, you could also add a line asking when you should follow up. That way, you’ll have a reason to touch base with the recruiter again about the position. You could say, “If there’s a good time I should check back in about this position, kindly let me know.”"
    },
    {
      "title": "Attach your CV or resume.",
      "content": "Attach your CV or resume . Telling the hiring manager or recruiter you have certain qualifications is one thing. Attach your resume or CV to show your contact that you actually have those qualifications. If applicable, you can include a link to a website, article, or social media profile, like LinkedIn, that displays your work. Providing a link makes a good first impression in addition to making it convenient for the person to view your work. They may wish to view your profile after your initial interaction. Proofread your resume for any errors or typos before submitting it. Nothing allows a recruiter to rule you out as a candidate more quickly than sloppy resume errors."
    },
    {
      "title": "Create a professional social media account.",
      "content": "Create a professional social media account. Do an online search to find out what social media sites the company uses. Aim to create an account on the same site(s). Creating a professional social media account, like one on LinkedIn, can be a great way to network with people. When the time comes, you can use that network to get info about other businesses. Be sure to maintain your professional network even when you’re not searching for a job. Send a message to old coworkers once in a while to ask about them and stay in touch. This will make networking when you are searching for a job much easier."
    },
    {
      "title": "Search for HR employees' contact information.",
      "content": "Search for HR employees' contact information. Once you’re interested in finding out whether a specific company is hiring, you can use this type of account to search for recruiters or hiring managers at the company, because they'll have the information you need. If you can't find the hiring manager or a recruiter specifically, look for employees at the company in the HR department. You can contact them and ask if they can point you in the right direction. It’s best to use this strategy only if you are using a professional social media site that’s designed for recruitment, such as LinkedIn. Employees may find it off-putting to get a message from a stranger looking for a job on sites like Facebook or Twitter."
    },
    {
      "title": "Contact the recruiter or hiring manager.",
      "content": "Contact the recruiter or hiring manager. Once you’ve found a recruiter or hiring manager, send them a short message. Briefly outline your educational and work background and then ask if there are any open positions in your field. For example, you can write something like: “Dear Mr. Smith, I am interested in working for XYZ Plumbing, and I noticed that you are the hiring manager there. I am a certified plumber and have 6 years’ experience working as plumber for ABC plumbing, where I was promoted twice. I’d be very interested in knowing if your company has any current openings and how I might apply. Thank you very much for your time.”"
    },
    {
      "title": "Prepare what you’ll say.",
      "content": "Prepare what you’ll say. Asking about open positions in person is a little different than asking in writing. You won’t have time to revise what you say, so you should prepare ahead of time. Practice what you’ll say, including your education level, experience, and why you’re interested in that company. [1] X Research source You might not get an interview right away, but if you have this information prepared, it can go a long way toward impressing a hiring manager."
    },
    {
      "title": "Dress appropriately.",
      "content": "Dress appropriately. You should dress for these types of encounters the same way you would if you were going in for an interview. [2] X Expert Source Devin Jones Career Coach Expert Interview. 5 April 2019. The first impression is the most important, and you want the hiring manager to take you seriously. It also shows that you’d reflect well on their company, since you dressed appropriately just to ask if there are any openings. [3] X Research source"
    },
    {
      "title": "Ask for the hiring manager.",
      "content": "Ask for the hiring manager. Hiring managers are usually not out on the floor of businesses or stores. Ask the nearest employee—or the receptionist if there is one—if you could speak to the hiring manager. If they ask why, explain that you’re interested in any open positions at the company. [4] X Research source If the hiring manager isn’t available, politely inquire when would be a better time to return to speak to them. In some cases, you may be able to procure an application from the employee you speak to."
    },
    {
      "title": "Shake hands.",
      "content": "Shake hands. When the hiring manager comes out, act professionally. This means shaking hands, making eye contact, and being polite. Explain who you are, and why you’re there. [5] X Research source"
    },
    {
      "title": "Bring your resume.",
      "content": "Bring your resume . The hiring manager may ask for your resume after they meet you. You should have at least one copy with you. [6] X Expert Source Devin Jones Career Coach Expert Interview. 5 April 2019. If the hiring manager says there are no current openings, you can ask if you can leave your resume for future consideration. [7] X Research source Carry your resume in a wrinkle-proof, waterproof case. Avoid handing over a resume that is folded, creased, wrinkled, or damp, as this makes a poor impression."
    }
  ]
}