{
  "url": "https://www.wikihow.com/Be-the-Person-You-Always-Wanted-to-Be",
  "title": "How to Be the Person You Always Wanted to Be",
  "steps": [
    {
      "title": "Recognize that you are already the person you want to be.",
      "content": "Recognize that you are already the person you want to be. The secret to becoming all you want to be lies in remembering that you already are! You already are the very best version of yourself. You just need to know how to be this person. Everything you desire is already inside of you, and all of the resources you need to create it are inside of you, too. [1] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source What you are looking for is not out there in the world. If your level of self-love, confidence or abundance is dependent on circumstances that are external to you, then you will live in constant fear of them being taken away. True inner power comes from believing that the source of all that you desire to become is within you."
    },
    {
      "title": "Look for roadblocks in your path.",
      "content": "Look for roadblocks in your path. [2] X Expert Source Leah Morris Life Coach Expert Interview. 19 June 2020. There's a quote that says \"the only thing holding you back is you.\" This is true. However, you must take stock of any attributes or habits you have that do not reflect the person you want to be. This may even require speaking to a few loved ones and asking them if they notice any unhelpful attributes that may be holding you back. Two common attributes that may be holding you back are: Self-doubt. This is one attribute that can leave you immobile, never changing and never reaching your true potential. If you are afflicted by a fear of failure or insecurities, you need to combat them now. A great way to combat self-doubt is to look for evidence of your successes. Identify all the wonderful achievements you have already obtained. Then, reach out to a few close friends and have them tell you a few things they admire about you. Procrastination. This undesirable trait generally comes down to your self-talk. You tell yourself you work well under pressure, or that the task won't take that long so you don't have to do it right now. Putting it off for an hour becomes days, and the next thing you know you're pulling an all-nighter to finish. Overcome procrastination by attempting to figure out why you put off tasks in the first place. Then, change the way you look at large tasks. Instead of trying to cram a lot of work into one sitting, tell yourself if you complete a small chunk, you can have a break. Also, go to an environment that is conducive to working - and not filled with possible distractions. If you are struggling with deeply buried and painful memories, fears, depression, or substance abuse, you may not be able to tackle these issues on your own. Reach out to a trained mental health professional who can guide you through the process of healing old wounds so that you can claim the healthy, vibrant future you desire."
    },
    {
      "title": "Find your truth and your values.",
      "content": "Find your truth and your values. [3] X Expert Source Leah Morris Life Coach Expert Interview. 19 June 2020. Every person has something they were born to do. You have a unique purpose for being here, and you have to find it. As Pablo Picasso declare, \"The meaning of life is to find your gift. The purpose of life is to give it away.\" Do a self-assessment to get closer to your truth, and closer to becoming the person you were meant to be. Ask yourself these questions: What do you wake up for every morning? What makes you feel truly alive? What classes did you enjoy while in school? What do you like to learn more about? What jobs have you held that made you feel purposeful? What activities do you participate in that make you lose track of time because you love doing them so much? What do people frequently tell you you're good at? What ideas are you most passionate about? What can you simply not go without in this life?"
    },
    {
      "title": "Release any thoughts that contradict your truth.",
      "content": "Release any thoughts that contradict your truth. Any time you think a negative, critical, fearful or harmful thought about yourself, you are disconnecting from your truth. Any time you tell yourself you cannot do something or have something, it becomes a self-fulfilling prophecy - you cannot reach your goals this way. Your truth is that you have the ability to become anything you wish to become. All you have to do is believe it, and you can achieve it. To stop unhelpful thoughts, strive to first identify them, then challenge them. [4] X Research source If you find yourself saying \"I can't do that\" when trying a new thing, demand evidence that shows you can't. Many people have negative self-talk that does not serve them. Aim to become aware of these thoughts and replace them with positive statements, such as \"I am afraid of trying this. But, I won't know if I'm good at it unless I try.\" Sometimes, believing in yourself can be difficult, especially when you have negative self-talk. As you learn to challenge negative self-talk, also began to envision yourself achieving your goals. Visualization can be a powerful motivator and help you to feel more confident in your abilities. To practice visualization, go into a quiet room and sit comfortably. Close your eyes. Take a deep breath. See yourself accomplishing a goal. Try this with smaller goals, such as losing 10 lbs or finishing the semester with a 4.0 GPA. Imagine yourself at the finish line, but also go back and envision every small step you will have to take to get there (i.e. eating right and working out, or studying daily and getting tutoring)."
    },
    {
      "title": "Listen for the answers within you.",
      "content": "Listen for the answers within you. Too many of us ignore the soft inner calling of our intuition which loves and adores us. It reminds us to just relax and trust. You see, there is often a much louder voice which booms through our minds and tell us to get to action. It prevents us from trusting ourselves, and instead lures us in to looking to the material and superficial world for all that we seek. Practice making the distinction between the harsh, critical voice that pushes you, and the soft, nurturing voice which loves and supports you. Then, make a conscious choice about which one you are going to listen to."
    },
    {
      "title": "Identify what you don't want.",
      "content": "Identify what you don't want. You cannot fully reach your potential unless you know what that is. Oftentimes in life, our goals change, and, occasionally, we may feel lost and have no idea what we're working towards. Knowing what you don't want, however, pushes you into the direction you should be moving and allows you to set clear boundaries. [5] X Research source"
    },
    {
      "title": "Practice optimistic thinking.",
      "content": "Practice optimistic thinking. Science reveals that optimistic people tend to live longer and enjoy greater physical and mental health than those who think pessimistically. Seeing the glass as half-full means smiling often, refraining from comparing yourself to others in a competitive way, and finding the silver lining in most situations. [6] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source One research-backed way to become more optimistic is to do the best possible future self exercise. [7] X Research source In this exercise, you will write expressively about your future self for 20 minutes.“Think about your life in the future. Imagine that everything has gone as well as it possibly could. You have worked hard and succeeded at accomplishing all of your life goals. Think of this as the realization of all of your life dreams. Now, write about what you imagined.” Complete the exercise three days in a row."
    },
    {
      "title": "Take risks.",
      "content": "Take risks. Have you been nervous up until now to put yourself out there for fear of failure? Learn to be courageous and take advantage of more opportunities that come your way. Successful people don't get that way by playing it safe all the time. Read situations and people to determine which opportunities are worth your time, then, bunker down to develop a winning strategy. [8] X Research source Risk-takers are constantly experimenting with their methods to refine them and develop the most efficient way of getting results. Never stop experimenting. Expect success, but readily embrace failure. You should always envision yourself accomplishing your goals. However, failure is inevitable. Take mistakes in stride and acknowledge them as teachable moments to refine your skills and come back stronger than before Constantly living within your comfort zone can lead to boredom and disengagement. [9] X Research source Step outside your comfort zone by taking initiative and taking on a project beyond your regular duties. Volunteer, and when you do, work with a population that you have previously been biased towards (i.e. substance abusers, homeless people, etc.). Another way to shake up your routine is to stop taking a backseat in your work. Step into a leadership position where you have more responsibilities and more people counting on you."
    },
    {
      "title": "Learn to say \"no\" sometimes.",
      "content": "Learn to say \"no\" sometimes. Risk-takers may be classically known to say \"yes\" more than \"no\". This inclination is built on not letting fear or doubts cause them to miss incredible opportunities for growth. However, when you are striving to reach you full potential, you must learn to use your voice and say \"no\" on occasion. Respect yourself and uplift your core values by refusing to participate in activities that do not serve your goals. [10] X Research source Of course, there will be times when you are urged to say \"yes\" to preserve a relationship. In these situations, agreeing to do something might serve your goals, if having that person in your life provides a positive impact. If you are confident that saying \"no\" is the best option for you, do so without providing an excuse or an apology."
    },
    {
      "title": "Surround yourself with positive people.",
      "content": "Surround yourself with positive people. The people you spend the most time with are a reflection of you. As the old saying goes, \"birds of a feather flock together\". Examine your social circle to see if the individuals you are around on a daily or weekly basis represent you well. These people should have characteristics and traits that you admire, traits that someday may rub off on you. Resist the urge to surround yourself with people who may be fun or exciting in the moment, but pull you away from reaching your potential. [11] X Research source Hans F. Hansen said, \"People inspire you or they drain you. Choose them wisely.\" Exercise this in your life by assessing those closest to you. Think about how you feel with these people. Do they lift you up and motivate you? Do they encourage you to have healthy, positive habits?"
    },
    {
      "title": "Magnify your strengths.",
      "content": "Magnify your strengths. Discover your unique abilities and talents, and be sure to make use of them every day. By doing this, you hone your abilities and make them even better. When you work to your strengths, you give the world the very best of you. Plus, you boost your self-confidence and feel more accomplished. [12] X Research source This is not to say it is unimportant to analyze your weaknesses - it is very important to know what areas you could use work. However, knowing and playing to your strengths enables you to realize your dreams and self-actualize. Think about it: you were given these gifts for a reason. Use them!"
    },
    {
      "title": "Treat yourself.",
      "content": "Treat yourself. While you are on the journey of self-actualization, remember to take time off to be good to yourself. [13] X Expert Source Leah Morris Life Coach Expert Interview. 19 June 2020. Pushing yourself further and further can be a good thing, but everyone requires breaks and self-care to jump back in the saddle at 100%. When you are feeling stressed or overwhelmed, turn to a few self-care practices that let you clear your mind and relieve negative energy so that it does not affect the work you are doing on yourself. [14] X Research source Test out a few activities to see what works best for you and call on them when you're feeling stressed. A daily or weekly ritual might be a great idea to implement to fend off stress before it becomes too much."
    },
    {
      "title": "Build self-trust and relax.",
      "content": "Build self-trust and relax. Maintain a good relationship with yourself. Sometimes, we can get so caught up in life that we neglect ourselves. Regularly get in touch with your inner self and run a diagnostic. Is there something that you need? Do you need a break? Spend time with yourself and frequently reassess where you're headed and if you like where you're going. We are all works in progress, so don't fret when you have to change your plans or regroup. Be a champion for yourself!"
    }
  ]
}