{
  "url": "https://www.wikihow.com/Choose-a-German-Shepherd-Puppy",
  "title": "How to Choose a German Shepherd Puppy",
  "steps": [
    {
      "title": "Make sure you can afford a German Shepherd.",
      "content": "Make sure you can afford a German Shepherd. German Shepherds can live 10-12 years with good care and health, so you're making a long-term commitment to your new pet. [1] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Be sure that you can provide a dog with everything it needs to have a long, happy life. The ASPCA estimates that in the first year of owning a large dog like a German Shepherd, you will spend about $1,843 on it. [2] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source After the first year, you will spend about $875 every year. These numbers include medical costs, food, grooming, equipment (crates, toys, leashes), training, etc. If you cannot afford to properly care for a dog, you should wait until you can before adding one to your family. Expect to pay between $500-$1200 and up for a quality German Shepherd puppy from a breeder. You will spend some money up front, but more money invested will save you in vet and other bills in the end. Buying a quality puppy ensures the support of a reputable breeder. For more information on the pricing range in the USA, visit the German Shepherd Dog Club of America website. [3] X Research source"
    },
    {
      "title": "Research the breed.",
      "content": "Research the breed. [4] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Though German Shepherds are beautiful dogs, you want to make sure the breed is a good fit for your household. German Shepherds are a herding breed that were bred to move livestock around farms. Because they want to work, they need a lot of mental and physical stimulation to stay healthy and balanced. Without a way to expel energy, German Shepherds often grow unruly and destructive. The breed is a great fit for owners who are looking for a lot of engagement and interaction with their pet. If this is too much responsibility for you, you may want to look into other breeds."
    },
    {
      "title": "Be willing to devote time to early training.",
      "content": "Be willing to devote time to early training. German Shepherds are large dogs. The American Kennel Club's (AKC) breed standard is 24-26\" to the highest point of the shoulder blade in males and 22-24\" in females. [5] X Research source They can also be very high-energy pets, even beyond puppyhood. As such, training a German Shepherd is incredibly important if you don't want to get physically overwhelmed by your pet. Luckily, these are intelligent dogs who love to learn and work. They respond very well to training."
    },
    {
      "title": "Decide whether you want a male or female dog.",
      "content": "Decide whether you want a male or female dog. [6] X Research source As puppies, the differences between males and females aren't very noticeable, but there are a few differences to consider as they grow older. The most obvious difference is that females will go into heat twice a year if left un-spayed. Females are also smaller and lighter than adult males, and have more delicate facial features. Males can sometimes be more territorial than females. Scent marking can be controlled with proper training. Females may be more protective of their \"pack\" or family, though this may result in jealousy of other pets."
    },
    {
      "title": "Attend breed events to meet some German Shepherds.",
      "content": "Attend breed events to meet some German Shepherds. The best way to learn about German Shepherds is to meet some in person. By attending a breed show, or \"conformation show,\" you will get to meet show-bred Shepherds and their breeders. These dogs are bred to make sure their physical traits adhere to the American Kennel Club's (AKC) breed standards. [7] X Research source But if you're more interested in a dog bred for its herding or working ability, visit a show or trial that tests these skills. Examples include agility, obedience, Schutzhund (guard dog), and tracking competitions, among others. [8] X Research source The working dogs are selected for traits like intelligence, ease of training, athletic ability and natural herding and working skills. You can find wonderful German Shepherds of all types at agility, obedience, Schutzhund and tracking tests (and many other different types of competitions). Contact The German Shepherd Club or AKC for a list of events where you can see and meet German Shepherds. [9] X Research source [10] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source"
    },
    {
      "title": "Choose where you want to get your new puppy.",
      "content": "Choose where you want to get your new puppy. Pure-bred dogs are rare in shelters, but with some patience you may be able to find a German Shepherd or German Shepherd mix. If you have trouble finding one through your local shelters, consider contacting a breed rescue in your area. Both of these options will allow you to rescue a dog in need of help, but in both cases, you cannot be sure of the dog's lineage. If you are set on a pure-bred German Shepherd that has a known lineage, then you will want to buy from a breeder. Never buy a dog from a classified ad or website without first visiting the location and getting a sense for the owner. Don’t agree to meet the puppy off-site — you want to see the breeder’s premises. Never buy a dog from a pet store. Pet stores often get puppies from puppy mills who breed without regard for the health or quality of the dogs. Dogs often live in poor conditions and are unhealthy. Do not support these practices with your money. You might see puppies being sold on the side of the street. If they're not affiliated with an adoption agency, you should never buy puppies off the street. These are usually irresponsible breeders, and buying these puppies only encourages more irresponsible practices."
    },
    {
      "title": "Research and contact breed clubs.",
      "content": "Research and contact breed clubs. Start on the internet by checking out national German Shepherd breed clubs like the German Shepherd Dog Club of America or the American Kennel Club. [11] X Research source [14] X Research source akc.org Both of these sites provide detailed information on what to look for in an ethical breeder, and can point you toward more local resources. Do further research into these local German Shepherd breed clubs in your area. Whether you get information from their websites or contact them directly for help, local breed clubs are a great way to get the names of reputable breeders in your area."
    },
    {
      "title": "Talk to local veterinarians.",
      "content": "Talk to local veterinarians. Veterinarians come into contact with a lot of different types of animal care-givers, from breeders to shelters to individual owners. Because they know so much about animal issues in the community, it's a good idea to talk to a few vets in your area for ethical breeder recommendations. Also consider speaking to other German Shepherd owners, dog groomers, or dog trainers. If you visit a breed show, talk to owners and trainers about who they've had good or bad experiences with."
    },
    {
      "title": "Look for a specialized breeder.",
      "content": "Look for a specialized breeder. A good breeder won't have a variety of breeds available for adoption. Look for a breeder who specializes only in German Shepherds. Your best option is to find a breeder who has years of experience with the German Shepherd breed. They should be able to answer your questions about development, temperament, and training easily and without hesitation."
    },
    {
      "title": "Ask how much time the dogs spend with humans.",
      "content": "Ask how much time the dogs spend with humans. A key marker of a good breeder is the amount of effort they put into early socialization. Puppies need to be taught from an early age to live harmoniously with humans. If a breeder keeps litters isolated away from the home, the puppies will not be used to the sights and sounds of a normal household, and won't be used to human interaction. This can become a problem by the time they are old enough to be adopted. Make sure the puppies spend at least some time in the breeders' home with them. The more time they spend with humans, the more you can trust the breeder."
    },
    {
      "title": "Make sure the females are bred ethically.",
      "content": "Make sure the females are bred ethically. An ethical breeder will never try to breed a female who hasn't reached sexual maturity — about 2 years of age. Mothers should also be given enough time to recover from pregnancies and being separated from their litters as they get adopted. Females should be healthy and alert. Never adopt a puppy from a breeder who breeds a young or unhealthy female, or who doesn't give mothers time to recover before breeding them again. Puppies should never be sold or separated from their mothers before 8 weeks of age. Before that, it’s unsafe to wean them from their mothers."
    },
    {
      "title": "Ask about the puppies' health.",
      "content": "Ask about the puppies' health. The breeder should have begun the puppies' vaccination and deworming processes before adopting them out. Make sure that's happened, and ask about any health problems the vet may have reported in these early checkups."
    },
    {
      "title": "Determine the litter's bloodline.",
      "content": "Determine the litter's bloodline. Ask if the breeders have their dogs tested for the Degenerative Myelopathy (DM) gene. This can determine whether a common inherited disease in German Shepherds is present in the litter's bloodline. Dogs with DM suffer from progressive paralysis, particularly in the hind legs.[5] Also ask the breeder whether the parents are \"OFA certified\" or \"AKC Registered.\" You can ask to see certification for both parents from one of these organizations, but reputable breeders usually offer this without asking. Note that being AKC-registered does not mean that you are getting a healthy animal. It means that the owner paid money to the AKC to register the dog. The Orthopedic Foundation for Animals (OFA), on the other hand, is interested in orthopedic and genetic health. [13] X Research source German Shepherds commonly have hip and elbow dysplasia. While experts recommend against breeding animals with known genetic problems, an OFA certification will give you proof. Be aware, though, that there's no guarantee of health in any animal. There's always a chance that two dogs free of known genetic diseases can still produce a puppy with genetic problems."
    },
    {
      "title": "Inquire into the breeder's decision-making process.",
      "content": "Inquire into the breeder's decision-making process. The breeder should be evaluating you as a potential owner, just as you're evaluating him or her as a breeder. No good breeder will just hand over a puppy without being sure that the new owners will be able to provide it with a good, healthy life. Ask the breeder what they look for in a good owner, and whether they've ever turned potential owners away. The breeder should be able to answer these questions without even having to think about it. You might also ask the breeder for references so you can contact other families who have dogs from previous litters."
    },
    {
      "title": "Answer any questions the breeder asks honestly.",
      "content": "Answer any questions the breeder asks honestly. A reputable breeder should ask questions about your dog background and experience, your lifestyle, and your family to guide you in making the best decision. As difficult as it may be, a good breeder will be willing to turn you away if they think you're a bad fit for their particular puppies. For example, if the litter has particularly inactive parents, the puppies may not be a good fit for your highly active lifestyle. If you get turned away, ask if the breeder can point you to other options and litters so you can expand your search. Also ask if they have any unborn litters coming up that may be a better fit for you. Be patient and don't get discouraged. With enough patience and legwork, you'll find the right puppy. Don't lie to a breeder just to get a puppy, though. Trust the breeder's decision-making process. You don't want to end up with a dog who doesn't fit your needs."
    },
    {
      "title": "Learn the signs of an unethical breeder.",
      "content": "Learn the signs of an unethical breeder. Avoid any breeder who offers to cut you a \"deal,\" who has unclean or smelly kennels, or who acts suspiciously in any way. Trust your instincts. A breeder who's in it just for the money has the wrong motivation, and likely isn't interested in the welfare of their dogs. Make sure the dogs are not crowded into cages. They should have plenty of room to stumble around and explore their surroundings. Part of the time, puppies should be kept in the home to expose them to household environments. There should be adequate food and water for all animals on the premises. Kennels should be cleaned daily. Although it may be that a dog had an accident just before you arrived, be suspicious of a kennel that looks like it hasn't been cleaned recently."
    },
    {
      "title": "Find out about the breeder's return policy.",
      "content": "Find out about the breeder's return policy. [14] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source All reputable breeders should be willing to take the dog back should things not work out with your family. If a breeder doesn't have a return policy, it suggests they don't really care what happens to their dogs once they leave their property. That's not a good sign! Also find out what kind of documentation you would get with your puppy. Would you get registration papers and pedigree papers?"
    },
    {
      "title": "Read and negotiate the puppy health guarantee.",
      "content": "Read and negotiate the puppy health guarantee. Negotiate for what you want if it's not included in the contract. Be very wary of a breeder who will not discuss the chance that a puppy may need to be returned. Does the contract require you to take the puppy for a vet visit within a set time? Does it cover hereditary issues for life? For only a certain period of time? What kind of documentation will you need to provide to “prove” your case? What does the breeder agree to offer? 100% money back? Trade for another puppy when one is available? Are there restrictions on the activities you can do with your dog that will invalidate the contract or guarantee? Are you purchasing a show prospect puppy or a pet quality animal? Does the breeder have strong feelings (or even bans) about the vaccinations, foods or supplements for your puppy? Are these opinions based on solid science?"
    },
    {
      "title": "Contact breed rescues in your area.",
      "content": "Contact breed rescues in your area. You can find breed rescues by searching for them online, or by contacting your local humane society, dog officer, or vet's office. Many pet-related businesses will be able to provide information about local rescue organizations. Don't forget about talking to German Shepherd owners or visiting breed shows to meet more owners."
    },
    {
      "title": "Make sure you're dealing with a legitimate rescue group.",
      "content": "Make sure you're dealing with a legitimate rescue group. Any puppy coming from a rescue should be fully checked by a veterinarian for basic health, parasites and vaccinations before they are adopted. Generally, they will be spayed or neutered before they go to their new homes, or you will sign a contract to do so in the near future. Beware of any rescue group who skips these steps."
    },
    {
      "title": "Go through the application process.",
      "content": "Go through the application process. Many rescue groups have an extensive placement process. They will require an application, an interview, and a home visit to ensure a successful adoption. Some may even ask to consult your current veterinarian for information about you and previous pets. If you don’t own your home, be prepared to provide a letter from your landlord stating that you are allowed to have a dog. If you already have another dog, that dog will need to be evaluated to make sure that the dogs will get along. While this may seem excessive, the rescue group just wants to place the dog with a family in a home that's prepared to handle the responsibility."
    },
    {
      "title": "Research the history of diseases in the puppy's lineage.",
      "content": "Research the history of diseases in the puppy's lineage. Like all breeds, the German Shepherd suffers from many inheritable diseases that you can't see just by looking at the dog. Common genetic diseases for the breed include degenerative myelopathy, megaesophagus, and exocrine pancreatic insufficiency. [17] X Research source Jacquelyn M. Wahl, Stephanie M. Herbst, Leigh Anne Clark, Kate L. Tsai, Keith E. Murphy, A review of hereditary diseases of the German shepherd dog, Journal of Veterinary Behavior: Clinical Applications and Research, Volume 3, Issue 6, November–December 2008, Pages 255-265. If you're getting your puppy from a breeder, they should know about the history of disease in the puppy's lineage. Discuss the likelihood of these diseases developing in your own puppy."
    },
    {
      "title": "Visit the puppy more than once.",
      "content": "Visit the puppy more than once. You want to see the puppy on multiple occasions, if possible, so you can get a better sense of its overall temperament and health. Just like people, puppies can have their good days and their bad days, so you don't want to make a decision based on a single interactions."
    },
    {
      "title": "Examine the puppy's health.",
      "content": "Examine the puppy's health. Take your time and look closely at each puppy you're thinking of adopting. Puppies should be the appropriate weight — not too chubby, but not too thin — and odor free. They should have clear eyes (not runny or red) and clean ears. The coat should be full and glossy (no balding spots), and free of mats or fecal matter. Look for signs of excessive scratching, which may point to skin or coat problems. It should have a healthy appetite, and no signs of vomiting or diarrhea. Also assess the puppy's social health. Puppies should be curious and well-socialized, playful and friendly."
    },
    {
      "title": "Test the puppy’s temperament.",
      "content": "Test the puppy’s temperament . Temperament testing a dog or puppy helps you choose a dog that fits your family and lifestyle. [16] X Research source For example, a high-energy puppy may be the right fit for an active outdoor family, but wrong for a family who likes to relax indoors. For temperament testing, separate the puppy from the litter to make sure it's focusing its attention on you. Walk around to see if the puppy follows you. A puppy that follows humans is well-socialized to them and enjoys their company. Kneel and call the puppy to you. It should show interest in you and come when called. Lift the puppy in the air to see how well it deals with being carried. Gently restrain the puppy with its belly up. Though a little bit of struggle is okay, you don't want a puppy who fights you when you try to handle it. Look for a puppy that isn't afraid —note if his tail is between his legs. In all interactions, look for signs of fear or mistrust. These puppies may not adjust well to your home."
    },
    {
      "title": "Look for bad behaviors.",
      "content": "Look for bad behaviors. If you see a puppy who guards its food or toys, think twice about adopting it. While these behaviors can be improved through training, it's an extra obstacle you don't have to face if you choose a dog with a better temperament. Look for behaviors like growling or snapping when people or other dogs approach their food or toys. A dog who runs away may also have problems interacting safely and comfortably in a home. If you decide to take on a “project” with behavioral concerns, make sure you have a behaviorist or trainer you trust lined up first. Beware that having a \"reactive\" dog will add to the potential liability of ownership."
    },
    {
      "title": "Play with the puppy.",
      "content": "Play with the puppy. You want a puppy that's playful and not fearful because many dogs bite out of fear. German Shepherds are large, powerful animals as adults, so you absolutely cannot start out with a puppy who's fearful by nature. Puppies born with a fearful personality may be harder to train, and may display fear aggression as adults. [17] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Think carefully about adopting a faraway puppy.",
      "content": "Think carefully about adopting a faraway puppy. You may visit a litter and fall in love with a puppy a few states away. If you cannot take the dog home immediately (for example, if it's too young to be weaned), you need to arrange for its transportation at a later date. For the puppy's health, you should make the trip to pick it up yourself. Shipping puppies is very stressful on them, and often results in a sick puppy when you pick them up from the airport. If you want a puppy that lives far away, be willing to travel for it."
    }
  ]
}