{
  "url": "https://www.wikihow.com/Beat-Five-Nights-at-Freddy%27s",
  "title": "How to Beat Five Nights at Freddy's",
  "steps": [
    {
      "title": "Notice your power.",
      "content": "Notice your power. If you run out of power, Freddy Fazbear, one of the main antagonists, will come and end your night unless it becomes 6:00 before his jingle ends. Each hour, excluding the first hour, is 89 seconds. Try to have at least 5% power when at least 44 seconds are left at 5 AM. This way, you have enough power to spare to ward off any lingering animatronics."
    },
    {
      "title": "Know there are four main animatronics.",
      "content": "Know there are four main animatronics. The four animatronics are Bonnie the Bunny, Chica the Chicken, Foxy the Fox Pirate, and Freddy Fazbear. These animatronics are listed in order of activeness. Bonnie is the most active, while Freddy is the least. Bonnie and Foxy come to the left door, and Chica and Freddy always come to the right door. It is rare, but sometimes Foxy will become active on Night 1 instead of Night 2. [1] X Research source Sometimes, another animatronic, Golden Freddy, will appear. You can get rid of him by pulling up the monitor for a few seconds and then putting it back down. You can also summon him by flipping camera 2B up and down repeatedly until you see the poster change from Freddy Fazbear to a close-up of Golden Freddy."
    },
    {
      "title": "Check the door lights and cameras only sparingly on Night 1.",
      "content": "Check the door lights and cameras only sparingly on Night 1. However, this is all you'll need. The animatronics rarely attack, making this the best night to find Golden Freddy. Freddy is inactive at all (unless you run out of power). Bonnie and Chica are not very active, and Foxy only has a small chance of appearing. [2] X Research source"
    },
    {
      "title": "Check the doors rapidly, but still very sparingly, on Night 2.",
      "content": "Check the doors rapidly, but still very sparingly, on Night 2. Bonnie and Chica are much more active this night than Night 1. Foxy also appears, making the player constantly check the cameras. Check his camera often, though not extremely frequently; this only makes his stages when he peeks through the curtain shorter, meaning you have a shorter window of time than you think to react once he's out. Try to check his camera every other time you open it. This is the final night Freddy only attacks you if you run out of power. [3] X Research source"
    },
    {
      "title": "Check the door lights more often than on the previous two nights on Night 3.",
      "content": "Check the door lights more often than on the previous two nights on Night 3. Chica and Bonnie become significantly more aggressive. Foxy also peeks out of the cove much faster than on Night Two, so keep an eye on that. Freddy also becomes active tonight, but only a little. He will attack if not kept a close eye on. His glowing eyes are the only way to identify Freddy on camera eyes. Sometimes, he will have a faint silhouette. Use the same method for Night 2, but still try to conserve power, at least 3%, by the last few seconds of 5 AM. If you run out of power, you better hope and pray Freddy performs the long version of \"Toreador March.\" If Freddy is getting closer (i.e., East Hall or East Hall Corner), you may want to shut your Right Door whenever you check the cameras. This is especially key on the 4/20 Mode in the Custom Night. Freddy is most likely to move when the monitor is raised."
    },
    {
      "title": "Check door lights more, but be aware of Freddy's laugh on Night 4.",
      "content": "Check door lights more, but be aware of Freddy's laugh on Night 4. Freddy is much more active and is aware of the player's gameplay tactics. From now on, he is tough to understand, predict, and deal with. [4] X Research source Chica and Bonnie can make the doors and door lights fail, indicating they have infiltrated The Office. You will know this when you try to press the \"Door\" or \"Light\" button, and all you hear is a clicking sound. They will jump at you the next time you flip down the monitor. Foxy is also very active, sometimes peeking out before 1 AM."
    },
    {
      "title": "Check Foxy and Freddy and check the doors while keeping the right door shut when viewing the monitor on Night 5.",
      "content": "Check Foxy and Freddy and check the doors while keeping the right door shut when viewing the monitor on Night 5. Night 5 is where the game gets incredibly brutal. The animatronics are more active than ever. You will also start to notice Bonnie and Chica twitching, a sign of their impatience and aggression. [5] X Research source Just repeat this, and you will (hopefully) survive the night, get a paycheck, and unlock the secret sixth night."
    },
    {
      "title": "Use the same method for Nights 3 to 5 on Night 6, but be much quicker and more efficient.",
      "content": "Use the same method for Nights 3 to 5 on Night 6, but be much quicker and more efficient. To complete the night, it is advised to have certain amounts of power at certain times. Each animatronic is extremely active, and if you're not careful, you could die before the end of midnight. 1 AM needs at least 80%, 2 AM needs at least 60%, 3 AM needs at least 40%, 4 AM needs at least 25%, and 5 AM needs at least 9%. Completing Night 6 will unlock Night 7 (the Custom Night)."
    },
    {
      "title": "Beat Night 7 (the Custom Night).",
      "content": "Beat Night 7 (the Custom Night). After you unlock Night 7, you can set any animatronics' AI (excluding Golden Freddy) from 0 to 20. If you put Freddy to 1, Bonnie to 9, Chica to 8, and Foxy to 7, you'll get an instant Golden Freddy Game Over screen. This is a well-known Easter Egg, indicating something important happened in 1987. [6] X Research source On the first night, Phone Guy mentions \"The Bite of '87.\" Beating 20/20/20/20 mode will unlock a third star. To beat 20/20/20/20, you need to be extremely fast and efficient. Perform and then repeat this process: Go to the east hall corner. Pull down the camera. Look at the right door light (close if needed). Look back at the camera. Pull down the camera. Look at the left hall light (close if needed). At the end of 20/20/20/20, you will get fired and get the third star. Foxy and Freddy won't kill you unless you stop looking at the east hall corner because Freddy will sneak into the room. Foxy will not kill you because having the camera up stops him, and if you do it fast enough, he won't get a chance to move. You shouldn't run out of power with the above-mentioned strategy; if you do, you won't die because you're so close to 6 AM."
    }
  ]
}