{
  "url": "https://www.wikihow.com/Choose-a-Gift",
  "title": "How to Choose a Gift",
  "steps": [
    {
      "title": "Identify your message to the recipient.",
      "content": "Identify your message to the recipient. Before you start wracking your brain for what to give the person, think about your relationship with the person, how you feel about them, and what you would like to tell them. This will help you to narrow down the possibilities for gifts much faster than browsing through racks in a department store or searching countless websites. For example, if the person is your best friend, perhaps you’d like them to know that you think of them as the smartest, funniest person in all the galaxy. If the person is a coworker, you might want them to know that you appreciate their hard work and companionship in your shared office space. If the person is your significant other, you might want to let them know how much you love and appreciate all that they do."
    },
    {
      "title": "Make a list of items that might help you convey that message.",
      "content": "Make a list of items that might help you convey that message. Once you have identified the message you want to send, start making a list of gifts that could help you to send that message. Be sure to consider the person’s tastes and interests as you devise this list. For example, you might choose a coffee mug for your coffee-loving best friend with a witty message about how intelligent and awesome they are. For a coworker, you might give them a gift card to their favorite sub shop so they can go out to lunch. You can send an indoor plant as gift, if your friend loves gardening. Your significant other might enjoy being pampered with a spa package, and this would let them know you think they deserve some rest and relaxation for all their hard work."
    },
    {
      "title": "Talk with people who know the person well to help you choose.",
      "content": "Talk with people who know the person well to help you choose. If you have trouble coming up with ideas for the person, enlist the help of other people who know them well. The person may even have let slip that there is something they want or need. [1] X Research source For example, you could ask your best friend’s mom if she has any suggestions. Talk with other coworkers to see if they’ve noticed anything the person likes or could use. Question your significant other’s best friend or sibling to see if they’ve dropped any hints."
    },
    {
      "title": "Look at the person’s social media accounts for clues.",
      "content": "Look at the person’s social media accounts for clues. The person you need to buy for might like something really specific that you could find out about with a little detective work. Pinterest is a good first place to look since people often “pin” items that they want or need onto “boards” on the site. You can also check the person’s Facebook, Twitter, Tumblr and other social media histories for clues. [2] X Research source For example, if the person posted about a favorite coffee shop on their social media account, get them a gift card for that coffee shop. If they pinned an image of a sweater onto a Pinterest board, see if there is a link you can follow and buy them that sweater."
    },
    {
      "title": "Check online websites that the person frequents for wish lists.",
      "content": "Check online websites that the person frequents for wish lists. Wish lists are not just for baby and wedding registries! Some commercial websites allow any of their members to make wish lists that may be public if the person allows it. If you know that the person does a lot of online shopping with a specific website, visit the website and search their name. You might get lucky and find a whole list of items to choose from. [3] X Research source For example, the person might have added a specific type of blender to their wish list. If so, you can purchase it from the website. Be sure to indicate that you bought the item if you are selecting something from a registry. This will help to ensure that no one else gets the person the same gift."
    },
    {
      "title": "Ask the person for suggestions if you are stumped.",
      "content": "Ask the person for suggestions if you are stumped. There’s nothing wrong with asking the person if there’s anything they really want or need as a gift. Most people appreciate this since it will help to ensure that they get something they can use. [4] X Research source Try saying something like, “Have you given any thought to what you’d like for your birthday?” Or say, “I’m working on my Christmas list. What’s at the top of your list this year?”"
    },
    {
      "title": "Opt for an experience rather than a physical item.",
      "content": "Opt for an experience rather than a physical item. Many people value experiences over material items, so consider how you might give the person something that will create a fun experience for them. Look into local events, concerts, restaurants, and other activities that the person might enjoy to get ideas. [5] X Research source"
    },
    {
      "title": "Give the person tickets to something they would enjoy.",
      "content": "Give the person tickets to something they would enjoy. Think about what the person likes and browse the events in your area for gift possibilities. Buy a ticket to the event and put it into a card in an envelope. If you can afford it, you might even give them 2 tickets so that they can bring a friend. [6] X Research source If the person’s favorite band is coming to town, buy them a ticket to go see the show. Look into theater productions that the person might enjoy and get them a ticket to see a performance. Check for other ticketed events the person might enjoy as well, such as a special exhibition at a museum, a comic convention, or escape room."
    },
    {
      "title": "Purchase a gift card so that the person can enjoy their favorite activity.",
      "content": "Purchase a gift card so that the person can enjoy their favorite activity. Consider what the person likes to do in their spare time, then identify the gift card version of that. This might be for a physical store, a venue, or a website. Wrap the gift card in a card and envelope. [7] X Research source If the person loves bowling, get them a gift certificate for the local bowling alley. If they enjoy reading, get them a gift card for a local book store or to buy ebooks. If they love to cook, get them a gift card for a kitchen supply store or grocery store. If there is a restaurant the person has been wanting to try, get them a gift card for the restaurant."
    },
    {
      "title": "Include a note with the gift that describes the experiences it will provide.",
      "content": "Include a note with the gift that describes the experiences it will provide. If you end up purchasing the person a physical item, then make sure to tell them how it will create fun experiences for them. This will enrich the value of the gift and make it seem more special. [8] X Research source For example, if you get the person a blanket, you might include in the note that you hope they enjoy lots of cozy evenings reading or watching movies under the blanket. If you give the person a new backpack, then include a note that describes all the items the person can keep in their new backpack and how you hope it will enhance their commute to school or work."
    },
    {
      "title": "Provide the person with a time-saving service as their gift.",
      "content": "Provide the person with a time-saving service as their gift. Some people shy away from giving time-saving gifts, but many people appreciate them. You can purchase a time-saving gift, or offer the time-saving service yourself, which is a great option if you don’t have a lot of money to spend. [9] X Research source Purchase the person 2 hours of cleaning services from a local cleaning company. Make the person a week’s worth of freezer meals that they can heat and eat when they are short on time. Offer to run errands for the person, babysit, or walk the person’s dog."
    },
    {
      "title": "Get them what they asked for if they made a request.",
      "content": "Get them what they asked for if they made a request. Some people are very straightforward and will tell you without hesitation what they want. If the person has told you already that they want a specific gift, don’t overthink things and try to get them something else. Get them what they asked for since it is something they will use and that they obviously want. [11] X Research source For example, if the person told you they really want a new toaster because their toaster is broken, then get them a new toaster. If they said they only want gift cards to buy video games, give them a gift card to a video game store or to download games on a device."
    },
    {
      "title": "Donate to charity on your own behalf, not as a gift.",
      "content": "Donate to charity on your own behalf, not as a gift. Do not make a charitable donation in the person’s name. It may seem like this is something they would appreciate, and some people might. However, most people are less satisfied with this type of gift than with something they could actually use. [12] X Research source If the person requests donations on their behalf, then that is what you should get them. However, be careful about assuming this is something they would like."
    },
    {
      "title": "Don’t be afraid to give more than 1 person the same gift.",
      "content": "Don’t be afraid to give more than 1 person the same gift. Many people feel the need to get a different gift for each person on their list. This can be challenging and it’s not necessary. If you have multiple people to buy for and you find something that you think more than 1 of them would like, buy the same gift for all of them. [13] X Research source For example, if you have 3 friends on your list and you find a really cool looking lamp that you think they’d all enjoy, buy 3 of those lamps and give 1 to each of your friends."
    },
    {
      "title": "Pool your money with friends or family if the gift is beyond your means.",
      "content": "Pool your money with friends or family if the gift is beyond your means. There’s nothing wrong with going in on a large gift with a group of friends or family if you cannot afford to get someone something they really want or need. Try talking to your friends a few weeks in advance to see if they might want to do a group gift. [14] X Research source For example, if you have a friend who recently lost their cell phone and cannot afford a new one, then you and a few friends could pool your money and buy them a new phone. If your parent is in need of a new TV, then you and your siblings could share the cost of a new one for them."
    }
  ]
}