{
  "url": "https://www.wikihow.com/Convince-Your-Parents-to-Let-You-Shave-Your-Legs-As-a-Preteen",
  "title": "How to Convince Your Parents to Let You Shave Your Legs As a Preteen",
  "steps": [
    {
      "title": "Ask a friend or older sibling first.",
      "content": "Ask a friend or older sibling first. Talk to a friend who has already started shaving about how they convinced their parents to let them start. Ask an older sibling, if you have one, what they said to your parents that worked. You can ask questions like: What did your parents respond well to? How did they react? What age were you? Did you have to make a deal with them? You can even have a sibling, friend, or friend’s parents talk to your parents if you need help later to convince them."
    },
    {
      "title": "Ask calmly and politely.",
      "content": "Ask calmly and politely. Sit your parents down for a talk in the living room or dining room, or wherever you’re comfortable having a conversation. If you don’t want to make it a big deal, you can slip the question into a casual conversation about something else. If you sit your parents down for a serious discussion, you can start with something like: “Mom, Dad, I want to talk to you about something. I’m starting to grow hair on my legs, and I’d really like to shave it. Will you give me permission to buy a razor and start shaving?” If you want to slip a question about shaving into another conversation like an upcoming trip to a pool or waterpark, for example, you can say: “Yeah, I want to wear my new blue bathing suit to the pool, but I just feel really uncomfortable about showing my legs. All the other girls are shaving them and mine are hairy. Do you think it would be okay if I shaved mine?” If you’re too embarrassed by talking to them in person at all, you can even send them an email or text with your request to shave."
    },
    {
      "title": "Understand their reasoning.",
      "content": "Understand their reasoning. Listen carefully to what your parents have to say about why they don’t want you shaving yet if they say no. Don’t use their reasons to start an argument or complain that they’re not fair. Instead, consider what they say and see if you can use it to do your own research and come up with a new, mature argument that you can use after some time has passed. For example, if your parents say they don’t like the risk of you cutting yourself with a razor, you can do some research into alternative methods like waxing or hair removal cream, and show them what you find. If they are concerned about the expense of razors, start saving up money so you can offer to pay for all the supplies yourself."
    },
    {
      "title": "Show how you're willing to commit to hair removal.",
      "content": "Show how you're willing to commit to hair removal. Tell them you're aware that once you start shaving a zone of your body for a few times, you're gonna have to maintain and that you will have no problem shaving regularly from then on to keep your legs hairless and to prevent the chance of an increasingly hairier regrowth, albeit to a small extent."
    },
    {
      "title": "Give them time.",
      "content": "Give them time. Let your parents have time to consider your question, ask their own questions, and give you an answer. You can even tell them not to answer right away by saying, “I don’t even want you to say yes or no right now. Please consider my request carefully and I’ll come back to you tomorrow for your answer.”"
    },
    {
      "title": "Put them in your situation.",
      "content": "Put them in your situation. Ask your parents to imagine what it’s like to be in your position, where you have hair in new and weird places, friends your age who are already shaving their legs, and you feel like you have to hide your hairy legs all the time. Ask what they would do in your situation. Chances are they’ll remember what it was like when they were preteens and have more sympathy for your situation. Don’t push it. Even if your parents had similar feelings and experiences as a preteen, they may still have important reasons as parents to say no."
    },
    {
      "title": "Remind them that age doesn’t matter.",
      "content": "Remind them that age doesn’t matter. If your mom uses an argument that she or an older sister didn’t start shaving until a certain age, point out that people start growing body hair at very different times, can have darker or thicker hair that shows up more, or just don’t have the same circumstances with friends at school or other pressure to shave. Just because things are happening to you at an early age doesn’t mean they’re less valid. You can tell your parents that puberty, when body hair starts growing, is happening at a younger and younger age on average, which explains why your mom or older sister might not have had to deal with it until later than you. Reference friends that started shaving at even younger ages than yours, pointing out that it just depends on each body and hair."
    },
    {
      "title": "Bring up peer pressure or bullying.",
      "content": "Bring up peer pressure or bullying. Let your parents know if others are pressuring you to shave your legs or bullying you about the fact that you don’t. They may let you start for this reason, and they may also give you valuable advice about dealing with bullies or peer pressure. Tell your parents exactly what others are saying or what they’re doing to make you feel bad about not shaving. Be honest because your parents can help."
    },
    {
      "title": "Let them know it’s uncomfortable.",
      "content": "Let them know it’s uncomfortable. Tell your parents that your leg hair causes you discomfort, either because you’re embarrassed to show it or because it makes you feel itchy or hot. Point out that you have to wear pants or tights even when it’s very hot out because of your embarrassment, and that this is very uncomfortable or even dangerous in high temperatures."
    },
    {
      "title": "Mention your activities.",
      "content": "Mention your activities. Bring up the fact that you are about to go to summer camp, start lifeguard training, or participate in a sport for which you’ll be wearing shorts all the time. Let them know this is an ideal time to start shaving. Point out that shaving your leg hair will help you to focus on and enjoy your activities more."
    },
    {
      "title": "Tell them it will boost your self-confidence.",
      "content": "Tell them it will boost your self-confidence. Let your parents know that you want to do this for YOU and not anyone else. Assure them that you don’t want to shave to impress others. Even if your motivation is just to fit in with others, explain that having self-confidence and being comfortable with your own body is really important for you and for all girls. You can say, “I just think having smooth, shaved legs will feel good and make me more comfortable with my body.”"
    },
    {
      "title": "Use a method they’re okay with.",
      "content": "Use a method they’re okay with. Talk to your parents and agree on a method for removing your leg hair if they’re concerned about the safety of shaving. Buy razors with nourishing strips and multiple blades to avoid cuts, or opt for waxing or a hair removal cream like Veet to avoid razors altogether. You can also opt for electrolysis or laser hair removal treatment later in life, but this is definitely an option to wait on till you are older and have enough money for the procedure."
    },
    {
      "title": "Show that you know about health and safety.",
      "content": "Show that you know about health and safety. Make a deal with your parents that you’ll do all the research about the health and safety risks of shaving and show them that you understand how to prevent those risks before you can start. Let them know that you understand shaving can cause razor burn or bumps, nicks and cuts, and even skin infections or painful ingrown hairs, and that you should use sharp and clean razors with shaving cream or soap and water to prevent these problems. [1] X Research source"
    },
    {
      "title": "Agree to a tutorial.",
      "content": "Agree to a tutorial. Allow your parents to give you a short shaving lesson either from them, an older sister, or a video. Make them feel more comfortable with you shaving by letting them control the information you get about doing it safely. You can even offer or agree to have your parents there with you while you shave the first couple of times. Consider sacrificing a little bit of privacy for what you want."
    },
    {
      "title": "Start with other body hair.",
      "content": "Start with other body hair. If you haven’t started shaving your underarm hair, ask your parents if you can start doing that first. Get them comfortable with the idea that you’re shaving at all by doing it to a smaller area of the body, and then they should soon work up to the idea of you shaving your legs, too. If you do already shave your underarm hair, you can use this to show your parents that you are already mature enough to shave safely. Make the point that doing the same to your legs is really no different."
    },
    {
      "title": "Offer to pay.",
      "content": "Offer to pay. Make an agreement with your parents to pay for any of the equipment you need to start shaving, like a razor and razor blades, shaving cream or gel, waxing strips, or hair removal cream. Save up your own money from an allowance or job for this. Offer to pay either for the first round of supplies, or for all shaving products in the future. Make a payment plan with your parents if you need to pay them back for supplies by agreeing to a certain amount taken out of your allowance every week, for example."
    },
    {
      "title": "Agree to shave part of your leg.",
      "content": "Agree to shave part of your leg. Start out by shaving your legs below the knees only if your parents are okay with just that. This is where hair is usually darkest and more noticeable anyway. [2] X Research source If you think your upper leg is hairy enough to shave above the knee, you can show how the smooth leg up to the knee contrasts with your thigh, if it's visibly hairy and grows at least a dark visible fuzz or some strong terminal hair, it's likely they're gonna agree to shave there. Your parents might also ask you not to shave more than a certain number of times per week or something similar, which you should follow."
    },
    {
      "title": "Be willing to wait.",
      "content": "Be willing to wait. If they won’t say yes right away, agree with your parents on a time when you can start shaving, or when you can bring up the issue again for them to reconsider. Show your parents that this means a lot to you by being patient and waiting until the agreed-upon time to ask again or get an answer. [3] X Research source Schedule and write down a time that everyone agrees with so you won’t forget and can remind each other."
    },
    {
      "title": "Accept your parents’ answer.",
      "content": "Accept your parents’ answer. If your parents don’t give their approval to you to start shaving, simply accept their decision without complaining or getting angry. Recognize that they only have your best interests at heart and there will come a time when they feel it’s right for you to start shaving. Thank your parents for their time listening to you. They will be much more likely to say yes at a later time if you deal with rejection in a mature and respectful way the first time."
    },
    {
      "title": "Try to enjoy not having to shave.",
      "content": "Try to enjoy not having to shave. Know that many parents, especially mothers, will try to delay you from shaving as long as possible simply because they know that once you start, shaving can quickly become an annoying burden, if you don't like to depilate often. Imagine waking up an extra 15 minutes early in the morning, or having to take the time to shave when you’re late for a pool party or want to wear shorts but need your legs to be smooth first. Shaving is an ongoing chore and time commitment."
    },
    {
      "title": "Embrace your leg hair as a good thing.",
      "content": "Embrace your leg hair as a good thing. Know that body hair is natural and considered very beautiful on women in many countries. It’s your decision, and you can choose not to shave at all. Know that shaving has no hygiene benefits. Shaving does not benefit your health or hygiene and is not required in any way. In fact, body hair holds good bacteria that can help you ward off dirt and illness. [4] X Research source Shaving might make your hair grow back more prickly and sometimes a little thicker and longer, over time, if you let it grow back, but it will stabilize at one point. Once you shave for the first time, your leg hair may be more noticeable than it was before and will have to be shaved more often, with time."
    },
    {
      "title": "Know that most people don’t notice leg hair.",
      "content": "Know that most people don’t notice leg hair. Consider the fact that most people don’t even see or notice your leg hair! Even if it seems like you’re the only one who doesn’t shave, many people won’t ever be close enough to your legs to notice, or won’t even care!"
    },
    {
      "title": "Stand up to peer pressure.",
      "content": "Stand up to peer pressure. Don’t let other people pressure you into feeling like shaving your legs is a requirement or necessary to fit in. Try finding a friend who doesn’t shave yet either and teaming up with them to show others it’s okay not to shave. [5] X Research source You can tell others that you don’t care or you don’t want to shave your legs, or you can tell them about the negative effects that you know, like razor burn or hair coming back in prickly and looking thicker and darker after shaving."
    },
    {
      "title": "Wear pants or tights.",
      "content": "Wear pants or tights. If you really can’t deal with having your legs exposed without feeling embarrassed, cover them up with tights or pants. You can also wear tall boots and leave the rest of your legs bare, as most of the hair is usually on the bottom of your legs."
    }
  ]
}