{
  "url": "https://www.wikihow.com/Adjust-Nat-Settings-on-Linksys-Router",
  "title": "How to Adjust Nat Settings on Linksys Router",
  "steps": [
    {
      "title": "Go to the Linksys router's settings.",
      "content": "Go to the Linksys router's settings. Make sure your router is connected and open your preferred Internet browser. Type in the correct address or command for your particular Linksys router. On most Linksys routers, this will be an IP address and usually 192.168.1.1, although it could also be just the word 'router' or another address. If 192.168.1.1 doesn't work, check the instructions that came with your router or the router itself, there is usually a sticker with that information and the default password for your router. For Linksys, the Linksys default username is admin, and the default password is password."
    },
    {
      "title": "Navigate to the Port Forwarding section.",
      "content": "Navigate to the Port Forwarding section. After you login, look for the phrase \"Port Forwarding\" on the left hand side of the screen. Click on it and scroll through the settings here. There are a few things to change here to get an open NAT setting, which is the type of NAT needed for local services such as Xbox Live to work the best. Find the box labeled UPnP and enable it. This works much the same way as Windows Plug and Play but on a network level, and allows your router to work out what it will take for a new item on your network to correctly interface with the Internet. For many users, this is enough to adjust their NAT settings to open. Find your computers IP address. If you are using port forwarding to open up the NAT settings, you will need your computer's IP address as well as the ports that need to be opened. To find your computer's IP, go to the Windows Start Menu and type 'cmd.exe' into the run box without the quotes. When the command utility opens up, type in ipconfig. This will give you information on your computer and what it's IP address is. The vast majority of the time, your IP address when connected through the router will share the first three number groups as the router itself. For example, on a Linksys router your computer would have an IP of 192.168.1.x, with x being the unique digit."
    },
    {
      "title": "Set your hardware in the router's DMZ.",
      "content": "Set your hardware in the router's DMZ. If enabling UPnP doesn't solve your NAT issues, another option is to set your computer, gaming console, or cell phone to bypass the router's safety features. This will allow your hardware to connect directly to the Internet, but will make it vulnerable to outside sources. Usually, this is only recommended for gaming consoles. If you do this for your main computer, remember to remove the computer from the DMZ when you are done using the service that was restricted by the Linksys NAT settings."
    }
  ]
}