{
  "url": "https://www.wikihow.com/Apply-Plexaderm",
  "title": "How to Use and Apply Plexaderm",
  "steps": [
    {
      "title": "Wash your face to get rid of any leftover makeup, dirt, or oils.",
      "content": "Wash your face to get rid of any leftover makeup, dirt, or oils. Use a facial soap and water to gently cleanse away any dirt or makeup from your face. Pay special attention to areas where you’ll be applying the Plexaderm, making sure these are clean. [1] X Research source Leaving oil or skin care product residue under Plexaderm can make it less effective. It's a good idea to wash your hands as well, since you'll be applying the cream with your fingers."
    },
    {
      "title": "Dry your face thoroughly with a soft towel.",
      "content": "Dry your face thoroughly with a soft towel. Plexaderm won’t work properly unless your skin is completely dry. After you’ve washed it, blot your skin gently with a clean towel until it’s dry. [2] X Research source"
    },
    {
      "title": "Prime the bottle before using it.",
      "content": "Prime the bottle before using it. [3] X Research source Place the Plexaderm bottle on a flat, level surface and remove the cap. Using your thumb, slowly and firmly push the pump down until it cannot go any further. Continue pushing down the pump until product begins to flow, typically about 10-15 pumps; however, it could take longer so be patient. Once the desired amount of product has been dispensed, replace the cp for safe storage. Do not tamper with the self-sealing valve, as this could damage the pump."
    },
    {
      "title": "Press down on the pump to dispense a small drop onto your finger.",
      "content": "Press down on the pump to dispense a small drop onto your finger. Press down on it slowly to avoid squeezing out a large amount of Plexaderm—you’ll only want to use a small amount to start with. Dispense about half the size of a pea. Once the desired amount of product has been dispensed, replace the cap for safe storage. [4] X Research source"
    },
    {
      "title": "Apply the Plexaderm to your skin using upward and outward strokes.",
      "content": "Apply the Plexaderm to your skin using upward and outward strokes. Use your fingers to spread the Plexaderm over fine lines, wrinkles, and any puffy areas of your face or neck. Be careful to avoid your eyes, as it may irritate them. If Plexaderm does get in your eyes, rinse your eyes out with cool, clean water."
    },
    {
      "title": "Blend the cream into your skin until it fully absorbs.",
      "content": "Blend the cream into your skin until it fully absorbs. You don’t need to rub it until it dries on your skin, just make sure it’s evenly spread out in a thin layer. If you use too much, you’ll notice the white residue on your skin—you can gently dab this away with a damp cloth."
    },
    {
      "title": "Let the Plexaderm set for 5-10 minutes while remaining expressionless.",
      "content": "Let the Plexaderm set for 5-10 minutes while remaining expressionless. While you can wait as little as 5 minutes, it’s best to wait 10 just to be sure the Plexaderm is working and has time to set. Don’t touch the spot where you applied it, and avoid talking, smiling, or moving your facial muscles. [5] X Research source If you do move your face before the 10 minutes are up and break the bond, you can apply a little bit more and wait another 5 minutes. After the 10 minutes are up, you can move your face again."
    },
    {
      "title": "Reapply after 10 minutes if the first application doesn’t show results.",
      "content": "Reapply after 10 minutes if the first application doesn’t show results. If you don’t see any noticeable change, you can follow the same steps to apply the Plexaderm to the same spot again. It’s important to wait the full 10 minutes to be sure that you need to reapply. [6] X Research source Only apply Plexaderm a second time if it’s really necessary—you don’t want to overuse the product on your skin. Overusing Plexaderm could cause your skin to look a bit unnatural, and excess product isn't good for the health of your skin."
    },
    {
      "title": "Use water-based moisturizers and makeup.",
      "content": "Use water-based moisturizers and makeup. Water-based products work best with Plexaderm. Use moisturizer at night, or at least 20 minutes before applying Plexaderm if you’re using them together. For makeup, try mixing 1/3 liquid foundation or concealer with 2/3 Plexaderm and apply with your fingertip. [7] X Research source Allow the Plexaderm mixture to set for 10 minutes. The ratio of Plexaderm to makeup ratio may vary depending on the brand of makeup."
    },
    {
      "title": "Store Plexaderm at room temperature.",
      "content": "Store Plexaderm at room temperature. Once the desired amount of the product has been dispensed, replace the cap and store the bottle at room temperature."
    }
  ]
}