{
  "url": "https://www.wikihow.com/Add-Friends-on-Roblox",
  "title": "How to Add Someone as a Friend on Roblox",
  "steps": [
    {
      "title": "Head to the Roblox Home page.",
      "content": "Head to the Roblox Home page . If you're on a tablet or a phone, just open the app."
    },
    {
      "title": "Log in or create an account.",
      "content": "Log in or create an account . Unfortunately, you can't add friends without an account, so you'll have to create one or log in."
    },
    {
      "title": "Click ≡, or the 3 bars symbol on the side menu bar.",
      "content": "Click ≡ , or the 3 bars symbol on the side menu bar."
    },
    {
      "title": "Click 'People.'",
      "content": "Click 'People.' That'll lead you to the menu where you can search for people."
    },
    {
      "title": "Type in the character name you want to find.",
      "content": "Type in the character name you want to find. If you don't know anyone, you could try joining a group or playing more games. If you really want that person to be your friend, try being nice to them. Once they see how nice you are, they might accept your friend request. Don't randomly send friend requests to random people. Chances are, they won't accept and will ignore. And don't keep sending them requests over and over if they decline - they'll think you're annoying if you do this and may block you."
    },
    {
      "title": "Find the character to go to their profile.",
      "content": "Find the character to go to their profile. Scroll down and locate the user you want to find."
    },
    {
      "title": "Scroll down and click Send friend request.",
      "content": "Scroll down and click Send friend request . After clicking, the button should then read Request sent if the request was sent. You can also accept the friend request by going there. Find the user, and if they sent you a request, it should say Accept request . Click it, and the button should change."
    },
    {
      "title": "Wait for them to either accept or decline.",
      "content": "Wait for them to either accept or decline. Remember, just because you send a request, it does not mean they will automatically be your friend. They have the right to decline the request, so do not be sad if you aren't accepted as their friend. Instead, find some other people who are willing to have fun playing the game with you. You'll receive a message if they accepted. Once they do, say hi and wait for them to respond. Then go on to playing games together and chatting!"
    },
    {
      "title": "Locate the ≡ on the top left corner.",
      "content": "Locate the ≡ on the top left corner. This will lead you to the game menu. On PC, you can use Esc as a keyboard shortcut."
    },
    {
      "title": "Click \"Players\" if you aren't already on the menu.",
      "content": "Click \"Players\" if you aren't already on the menu. After you're at the game menu, there will be four (or possibly five) more menus. Make sure you are on \"Players.\""
    },
    {
      "title": "Locate the button that says Add friend next to the player's username.",
      "content": "Locate the button that says Add friend next to the player's username. Click that button. Remember that the player will have to accept your request. If someone sent you a request, the button will read Accept request . That will make you friends instantly."
    },
    {
      "title": "Wait for confirmation.",
      "content": "Wait for confirmation. If the player accepts or declines, you'll receive a small box appear at your bottom right corner. It will read \"User accepted your friend request\" or \"User declined your friend request.\" If someone sends you a friend request, you will also receive a notification. You can click Accept or Decline ."
    },
    {
      "title": "Locate the player menu already on your screen.",
      "content": "Locate the player menu already on your screen. It should be on the top left corner. It will have a list of players. If it isn't there, click Tab on your keyboard, or proceed using method 2 ."
    },
    {
      "title": "Locate the player you want to find.",
      "content": "Locate the player you want to find."
    },
    {
      "title": "Click on the user name on the side menu.",
      "content": "Click on the user name on the side menu. There should be a few options. Select Send friend request .Remember that the player will have to accept your request. If someone sent you a request, the button will read Accept request . That will make you friends instantly."
    },
    {
      "title": "Wait for confirmation.",
      "content": "Wait for confirmation. If the player accepts or declines, you'll receive a small box appear at your bottom right corner. It will read \"User accepted your friend request\" or \"User declined your friend request.\" If someone sends you a friend request, you will also receive a notification. You can click Accept or Decline ."
    }
  ]
}