{
  "url": "https://www.wikihow.com/Check-for-a-Hernia",
  "title": "How to Check for a Hernia",
  "steps": [
    {
      "title": "Check for hernias that occur around the stomach, abdomen, or chest.",
      "content": "Check for hernias that occur around the stomach, abdomen, or chest. A hernia can affect different areas of your body in different ways, although a hernia in or around the stomach area may be the most common type of hernia. These hernias include: A hiatal hernia affects the upper part of your stomach. The hiatus is an opening in the diaphragm that separates the chest area from the abdomen. [1] X Trustworthy Source Cedars Sinai Hospital Website of one of the world's leading hospitals Go to source There are two types of hiatal hernia: sliding or paraesophageal. Hiatal hernias occur in people of both sexes, and are typically more common in people over the age of 50 and those who are obese. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source An epigastric hernia occurs when small layers of fat push through the belly wall between your breast bone and your navel. You can have more than one of these at a time. Although epigastric hernias often present no symptoms, it may need to be treated with surgery. [3] X Research source An incisional hernia happens when improper care after abdominal surgery results in bulging through the surgical scar. [4] X Research source Often, mesh lining is incorrectly installed and the intestines slip out of the mesh, causing a hernia. Umbilical hernias are especially common among infants. When the baby cries, coughs, or strains, a lump around the belly button area usually protrudes. [5] X Research source"
    },
    {
      "title": "Know the types of hernias that affect the groin area.",
      "content": "Know the types of hernias that affect the groin area. Hernias can also affect the groin, pelvis, or thighs when the intestines break out of their lining, causing uncomfortable and sometimes painful lumps in these areas. An inguinal hernia affects your groin area and happens when a portion of the small intestine bulges through the abdominal lining. [6] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Surgery is necessary for inguinal hernias, as complications can cause life-threatening situations. A femoral hernia affects the upper thigh, right below the groin. Although it may present no pain, it looks like a bulge in your upper thigh. Femoral hernias are more common in women than in men. [7] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source An anal hernia, or rectal prolapse, may cause the entire rectum to extend out of the anus, or may only push a part through. Anal hernias are rare and can affect anyone, but are more likely to be seen in older adults with a history of constipation or weak pelvic floors. They are often confused with hemorrhoids, but they are not the same thing. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Understand the other types of hernias.",
      "content": "Understand the other types of hernias. Hernias can affect areas other than the stomach and groin region. In particular, the following hernias may present medical problems for individuals: Herniated discs happen when a disc in your spinal column pops out and begins to pinch a nerve. The disks around the spinal column act as shock absorbers when you walk or run, but can be dislodged by injury or disease, resulting in a herniated disk. [9] X Research source Intracranial hernias , or brain herniation, occur inside the head. They happen when brain tissue, fluid, and blood vessels are moved away from their usual position in the skull, often after a head injury, stroke, or tumor. Any brain herniation is a medical emergency and needs to be taken care of immediately. [10] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Investigate possible symptoms or signs of a hernia.",
      "content": "Investigate possible symptoms or signs of a hernia. Hernias may be caused by a host of different factors. Once they are formed, they may or may not present pain. [11] X Research source Look for these symptoms, especially for hernias located in the abdominal or groin region: You see swelling, a bulge, or a soft lump where the pain is located. The swelling is usually on the surface of the areas such as the thigh, abdomen, or groin. In males with an inguinal hernia, the bulge may be in the scrotum. https://www.healthdirect.gov.au/hernias The swelling may or may not hurt. If the organ slipping through the muscle wall is not strangulated (has had its circulation cut off), it may not cause any pain. [12] X Research source Bulges, such as those that you find in an inguinal hernia, can often be pushed back into your abdomen when you lie down. Bulges that cannot be pushed in when pressed down on need immediate medical attention . [13] X Research source You may notice pain that ranges from mild discomfort to severe pain. A common symptom of hernias is pain present when straining or doing a strenuous activity. If you experience pain during the following activities, you may have a hernia: Lifting heavy objects. Coughing, sneezing, or straining. Exercising or exerting yourself. Hernia pain is often worse at the end of the day, or after long periods of standing."
    },
    {
      "title": "Check with a doctor to confirm a hernia.",
      "content": "Check with a doctor to confirm a hernia. Some hernias are what doctors called “trapped” or “strangulated,” meaning that the organ in question loses blood supply or blocks intestinal flow. [14] X Research source These hernias require immediate medical attention. Set up an appointment and meet with a doctor. Make sure to tell the doctor about all your symptoms. Undergo a physical examination. The doctor will check to see if the area increases in size when you're lifting, bending, or coughing. An imaging test like a CT scan may be taken when the bulge is small or may be confused with another condition."
    },
    {
      "title": "Know what puts you at an increased risk for hernias.",
      "content": "Know what puts you at an increased risk for hernias. Why do hernias affect more than 5 million Americans? [15] X Research source Hernias can happen for many reasons, including straining on the toilet, chronic constipation, heavy lifting, and smoking. Here are a few more of the factors that put people at an increased risk for hernias: [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Genetic predisposition: If any of your parents had hernias, you are more likely to develop one. Age: The older you get, the higher your chance of getting a hernia. Pregnancy: While pregnant, the mother's stomach stretches out, making a hernia more likely. Sudden weight loss: People who suddenly lose weight are at increased risk of developing a hernia. [17] X Research source Obesity: People who are overweight have higher chances of developing hernias compared to those who are not. [18] X Trustworthy Source Michigan Medicine The University of Michigan's medical center, which provides patient care, supports research, and educates the public on health topics Go to source Persistent cough: Coughing puts a lot of pressure and stress on the abdomen, and can lead to a hernia. A previous hernia, hernia repair surgery, or other abdominal surgery."
    }
  ]
}