{
  "url": "https://www.wikihow.com/Clean-Copper-Jewelry",
  "title": "How to Clean Copper Jewelry",
  "steps": [
    {
      "title": "Create a baking soda paste.",
      "content": "Create a baking soda paste. A baking soda paste works for most copper jewelry and can be made with materials you likely have around the house. Mix equal parts salt and baking soda with a little lemon juice until you have a paste. [1] X Research source"
    },
    {
      "title": "Mix a salt and vinegar solution.",
      "content": "Mix a salt and vinegar solution. Table salt and vinegar is also an easy cleaner to make with supplies you have at home. Simply mix equal parts white vinegar and salt to get a cleaning solution for your copper jewelry. [2] X Research source"
    },
    {
      "title": "Sprinkle table salt on a lemon.",
      "content": "Sprinkle table salt on a lemon. If you have a lemon, this can be rubbed on copper jewelry to clean it. Simply sprinkle table salt on the lemon and then rub down your jewelry with it. [3] X Research source If you find you need a deeper clean, add some cornstarch and baking soda to the lemon as well. This will provide a deeper clean."
    },
    {
      "title": "Use ketchup on its own.",
      "content": "Use ketchup on its own. Ketchup tends to work well for on jewelry with a lot of detailing, such as vintage copper jewelry. Ketchup can be squirted directly on your jewelry and then be rubbed in with your fingers or a cloth. [4] X Research source"
    },
    {
      "title": "Try water and mild soap.",
      "content": "Try water and mild soap. A mild soap, such as dish soap, can also be used on copper jewelry. Just make sure you use a small amount. A few drops of a mild soap is all it takes to clean copper jewelry."
    },
    {
      "title": "Use a commercial copper cleaner for the most effective option.",
      "content": "Use a commercial copper cleaner for the most effective option. You can find commercial copper cleaners at most hardware stores. Just make sure you wear rubber gloves and work in a well-ventilated area when you use a commercial cleaner. [5] X Expert Source Mark Sandler Graduate Gemologist, Jeweler, & Appraiser Expert Interview. 5 November 2019."
    },
    {
      "title": "Boil your jewelry in your solution for a deep clean.",
      "content": "Boil your jewelry in your solution for a deep clean. If you need a deep clean, use a cleaning solution that can you immerse your jewelry in. Vinegar and salt tends to work best. Simply fill a pot big enough to contain your jewelry with vinegar and salt, or your chosen solution. Bring the solution to a boil. Let the jewelry boil for a few minutes before removing it. [6] X Research source Make sure to use tongs when removing the jewelry and let it sit a few minutes to cool before rinsing it. Jewelry should be cool to the touch before your rinse it."
    },
    {
      "title": "Rub your cleaner onto the jewelry.",
      "content": "Rub your cleaner onto the jewelry. If you don't need a deep clean, you can simply rub your jewelry down with your chosen cleaner. Use a polishing cloth or something similar to rub your jewelry until it shines and any dirt and debris is removed. [7] X Research source To get into nooks and crannies, use a toothbrush to scrub your copper jewelry. When using ketchup, copper jewelry may come out shinier if you let the ketchup rest on the jewelry for a few minutes."
    },
    {
      "title": "Rinse and dry the jewelry.",
      "content": "Rinse and dry the jewelry. You can rinse copper jewelry with a clean cloth dampened with clean water. Then, dab the jewelry dry with a dry cloth. [8] X Research source Copper may rust if it's left wet too long, so make sure to dry it thoroughly before setting it aside."
    },
    {
      "title": "Polish",
      "content": "Polish the jewelry. After cleaning your copper jewelry, give it a good polish by squirting some lemon juice onto a rag. Then, buff the jewelry with the rag until it shines. When you're done, rinse off the jewelry with water. Lemon is usually okay to use, even if you already used lemon for cleaning. If you prefer, however, you can purchase a polish made specifically for copper jewelry."
    },
    {
      "title": "Clean your jewelry regularly.",
      "content": "Clean your jewelry regularly. Copper jewelry should be cleaned regularly to avoid discoloration and tarnish. Each time the jewelry becomes noticeably dingy or dirty, give it a cleaning. Keep in mind, times between cleanings vary depending on the type and age of your jewelry and how often you wear it. Keep an eye on your copper jewelry and clean it as needed."
    },
    {
      "title": "Store your jewelry in a dry place.",
      "content": "Store your jewelry in a dry place. Copper jewelry should be stored in a dry place as excess moisture can cause rust and discoloration. You should also store the jewelry in an airtight container or Ziploc bag to keep out extra moisture."
    },
    {
      "title": "Avoid swimming with copper jewelry.",
      "content": "Avoid swimming with copper jewelry. Swimming can damage copper jewelry, resulting in the need for more frequent washing and polishing. Take your copper jewelry off before swimming in a pool or body of water to keep it clean. [9] X Research source"
    }
  ]
}