{
  "url": "https://www.wikihow.com/Be-Confident-As-a-Short-Person",
  "title": "How to Be Confident As a Short Person",
  "steps": [
    {
      "title": "Make the jokes first.",
      "content": "Make the jokes first. When you're short, people are going to make jokes about it. They make jokes to make you feel bad. But if you're the first one to make jokes, if you participate in a little self-deprecating humor, they'll be much less likely to make them. It will also make them like you more because it will be clear that you have a good sense of humor, and people like that. \"You wanna come grocery shopping with me? I'm tired of having to rely on that creepy guy in aisle three to reach the top-shelf shampoo for me.\" \"I may be even shorter than Woody Allen but I'm also way more charming.\""
    },
    {
      "title": "Don't sweat being little.",
      "content": "Don't sweat being little. People will tease you about how you look so young or you're so little, but don't worry about it. We hate looking younger when we're young, but short people get to look younger even when they're old, and that's awesome. You're going to look young and hot for years after they start looking old and gross. [1] X Research source"
    },
    {
      "title": "Embrace your uniqueness.",
      "content": "Embrace your uniqueness. When people tease you, point out that they are average size and who would want to be average? Not you! You're unique and just can't fit in that average label. Boring!"
    },
    {
      "title": "Get more guys/girls.",
      "content": "Get more guys/girls. You might get teased about how you're going to find someone to date because of your size. But what they forget about is that there are lots of other average or small size people. Shorter/average size guys will want a short girl because they might not want to date a girl that's taller than them, and average size girls will have fun dating a guy that's their same size (because making out works a lot better!). [2] X Research source"
    },
    {
      "title": "Be too awesome for a team.",
      "content": "Be too awesome for a team. Another common joke is that you'll always get picked last in sports. But don't worry about this. Tell people that the reason you have to get picked last is because picking you first would give the team an unfair advantage: you're way too much awesome to have in a team all at once and they need to balance you out first with guys that suck."
    },
    {
      "title": "Come up with a better phrase.",
      "content": "Come up with a better phrase. You're not short. It's not fun to think of yourself as short. So find another term or phrase to use when people call you short. Make it funny and you'll get a lot of laughs and people will like you more. So now when someone calls you short you'll be able to say, \"No I'm not, I'm...\": [3] X Research source \"...travel-sized for your convenience.\" \"...vertically challenged!\" \"...height disadvantaged.\" \"...fun sized.\" \"...playing it safe with gravity.\" \"...enjoying the weather down here better.\""
    },
    {
      "title": "Get great clothes.",
      "content": "Get great clothes. You may hear that companies don't really make clothes for girls who are short, but don't think this will keep you from getting clothing. Short girls have way more options for a number of reasons. First, you can also shop in the teen section, which often has really cute clothes which are cheaper than the stuff in the women's section. Second, the smaller sizes are less in demand, so you will have a better chance of finding things on the rack or in the bins. It's also the fringe sizes, like the really small clothes, that go on sale most often."
    },
    {
      "title": "Don't sweat the too-long shirts and pants.",
      "content": "Don't sweat the too-long shirts and pants. Yeah, your pants drag on the floor. It sucks. But you have an option open to you that tall people do not: you can get them hemmed. Either learn to sew (either by hand or with a machine) and you'll have clothes that fit in no time. You can also easily get clothes tailored. This isn't as expensive as it sounds."
    },
    {
      "title": "Enjoy all the space you'll have.",
      "content": "Enjoy all the space you'll have. Everyone else is going to struggle to sit in crowded planes or trains. Meanwhile, for you, everything is like first class. Stretch those legs out! Suckers!"
    },
    {
      "title": "Milk your innocent look for all it's worth.",
      "content": "Milk your innocent look for all it's worth. Because you look more like a little kid, older people and even people your own age are going to assume you're super innocent. You can use this to your advantage and get out of all sorts of trouble and situations you'd rather not be in. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Realize that being tall sized isn't something you have to have to be beautiful.",
      "content": "Realize that being tall sized isn't something you have to have to be beautiful. There are a lot of short and pretty people in the world. Plus, if you're tiny and so are your features, you can be classed as cute-and that's pretty sweet. So don't feel so down about being short. If you're a man, remember that men get judged on a lot of things besides their appearance - jockeys are great athletes too. Skills, successes, fitness, brains, and resources can make you very attractive to women.Other than this short guys and tall women do look good together .No matter what people say if you are a good person and your mindset is healthy you can conquer this world. [5] X Research source"
    },
    {
      "title": "Play sports where you'll excel.",
      "content": "Play sports where you'll excel. Soccer, rugby, cycling, gymnastics, figure skating: there are lots of sports where being short is a huge advantage! Take advantage of this and boost your confidence by being the person that everyone wants on their team. [6] X Research source"
    },
    {
      "title": "Love other short people.",
      "content": "Love other short people. Lots of totally cool people are actually super short. Tom Cruise is 5'7\", Daniel Radcliffe is 5'5\", and Danny DeVito is 4'10\"! As for girls, lots of famous actresses are 5'3\" or shorter, like Vanessa Hudgens (5'1\"), Reese Witherspoon (5'1\"), and Snookie is only 4'8\"!"
    },
    {
      "title": "Find good things about your body.",
      "content": "Find good things about your body. Find things that you like about how you look. Maybe work out and get a nicer body over-all. Realistically, you have to remember that when people are looking for someone to date seriously, height is usually going to matter the least after general appearance personality, and work ethic. Find confidence in other things that people will find attractive and you won't have to worry about your height. [7] X Research source"
    },
    {
      "title": "Be proud of things other than your body.",
      "content": "Be proud of things other than your body. You should develop your confidence in things other than how you look, because this is a healthier mindset anyway. Learn a cool skill, travel around and have lots of experiences, or even just do something great like volunteering. This will make you proud of yourself and build your confidence. [8] X Expert Source Alyssa Chang Wellness Coach & Personal Trainer Expert Interview. 16 October 2019. Work hard and built a good career if you can. [9] X Research source"
    },
    {
      "title": "Dress well for the height you have.",
      "content": "Dress well for the height you have. You can make a short body look perfectly nice. Just wear clothes that fit and make you look proportional. Girls can wear heels if they want, and guys can sometimes get an extra inch out of platform shoes. Work with what you've got and you'll find that most people won't even notice. [10] X Research source You should also remember that while you can make yourself taller, really tall people can't make themselves shorter. You got the better deal."
    },
    {
      "title": "Stop hating on yourself.",
      "content": "Stop hating on yourself. You're awesome! People will perceive you the way you want to be perceived, so when you start thinking you're great, other people will follow. Tell yourself every day how awesome you are, take good care of yourself because you deserve it, stop the internal dialogue about how much you suck, and maybe make a list of all the things you like about yourself. [11] X Research source If you don't have a lot of things that you like about yourself, then work on that! You are more than your height, just as everyone else is. I mean, if height was all that was important, no one would like Tom Cruise. Find reasons to be proud of yourself because you should be proud of yourself. You're great!"
    },
    {
      "title": "Understand that tall people have confidence problems too.",
      "content": "Understand that tall people have confidence problems too. Tall people will have all sorts of their own problems to deal with and things that make them uncomfortable. It's a good case of be careful what you wish for, so just be happy with yourself the way you are."
    },
    {
      "title": "Realize that you might grow.",
      "content": "Realize that you might grow. If you're young, even as old as 18 or 19, you should keep in mind that you might still get taller. Many people are \"late bloomers\" and gain an extra several inches much later than people their same age. If you notice that your parents are average height or taller, you'll probably get there in time. [12] X Research source"
    }
  ]
}