{
  "url": "https://www.wikihow.com/Control-the-Temperature-of-a-Smoker",
  "title": "How to Control the Temperature of a Smoker",
  "steps": [
    {
      "title": "Locate the intake damper.",
      "content": "Locate the intake damper. The intake damper is located at the bottom of the smoker, where the fuel is. It controls how much oxygen reaches the fire. You can open and close it however much is necessary. [1] X Research source"
    },
    {
      "title": "Locate the exhaust damper.",
      "content": "Locate the exhaust damper. The exhaust damper is located near the top of the smoker. It helps pull the oxygen through the fire. It also allows the gasses, heat, and smoke to leave the smoker. You should always leave the exhaust damper open least partway in order to maintain airflow. [2] X Research source"
    },
    {
      "title": "Open the intake damper all the way to generate high heat.",
      "content": "Open the intake damper all the way to generate high heat. This setting may vary from recipe to recipe, but in general, it lays between 450 and 550 °F (232 and 288 °C). In order to get the smoker this hot, you need to open the intake damper all the way to allow the most oxygen in. [3] X Research source"
    },
    {
      "title": "Open the damper a quarter or halfway to get low or medium heat.",
      "content": "Open the damper a quarter or halfway to get low or medium heat. The more you close the intake damper, the cooler the smoker will become. To get a medium heat range of 350 to 450 °F (177 to 232 °C), leave the intake damper open halfway. To get a low heat range of 250 to 350 °F (121 to 177 °C) leave the intake damper open a quarter of the way. [4] X Research source"
    },
    {
      "title": "Open the damper up to a quarter of the way to get a low, slow smoke.",
      "content": "Open the damper up to a quarter of the way to get a low, slow smoke. Some recipes call for a low heat or a slow smoke. This usually converts to 225 to 275 °F (107 to 135 °C). In order to get the smoker this cool, you should leave the intake damper open an eighth to a quarter of the way. [5] X Research source"
    },
    {
      "title": "Adjust the exhaust damper if adjusting the intake damper doesn't help.",
      "content": "Adjust the exhaust damper if adjusting the intake damper doesn't help. If the bottom vent is closed all the way and the temperature is still too hot, try closing the top vent a little--not all the way. You can also try removing some fuel with metal tongs. Never dose coals inside the smoker with water. On the other hand, if the smoker is running too cool, you can try opening the exhaust vent more. [6] X Research source Still having trouble increasing airflow? Prop the lid open a little."
    },
    {
      "title": "Keep the water pan full to maintain temperature.",
      "content": "Keep the water pan full to maintain temperature. The water will help absorb the heat and regulate the temperature. Depending on the size of the pan, your smoker, and the temperature, expect to refill it every 3 to 4 hours. In most cases, you'll want to use hot water, but if the smoker is getting too hot, switch to cold water. [7] X Research source The water pan should be in the middle of the cooking section, right under the bottommost cooking grate. [8] X Research source"
    },
    {
      "title": "Don't peek.",
      "content": "Don't peek. Much like using an oven, you should not peek at your food. Each time you open the lid, you will increase the airflow and temperature. The only time you should open the cooker is to turn the meat, check the fuel, or add water. [9] X Research source"
    },
    {
      "title": "Be careful not to overshoot your target temperature.",
      "content": "Be careful not to overshoot your target temperature. It can take a long time before the temperature on the smoker starts to rise. Once the temperature starts to rise, however, it can shoot up pretty quickly. Be extra-vigilant during this time and make minor adjustments before the temperature reaches the target. [10] X Research source It is easy to overshoot your target temperature, but difficult to go back down to it. If the temperature is rising too fast, close the damper a little. The temperature will still rise, just at a slower rate."
    },
    {
      "title": "Give your smoker time to adjust to the new settings.",
      "content": "Give your smoker time to adjust to the new settings. Any adjustments that you make to the intake damper or fuel won't happen immediately. Give it a couple minutes or hours before you try something new. [11] X Research source"
    },
    {
      "title": "Be aware that the temperature will fluctuate naturally as the food cooks.",
      "content": "Be aware that the temperature will fluctuate naturally as the food cooks. Meat will absorb more heat during earlier stages of cooking, resulting in slower temperature rises. As the meat cooks, it will absorb less heat, resulting in faster temperature rises. [12] X Research source The temperature may spike as your fuel breaks down. It should climb back down after about 15 to 30 minutes."
    },
    {
      "title": "Perform a dry run the first time you use the smoker.",
      "content": "Perform a dry run the first time you use the smoker. A dry run is where you run your smoker without any food. This will help you gauge how long it takes your smoker to reach a certain temperature. Write down how long it takes for your smoker to reach the right temperature. Keep this for future reference. [13] X Research source Use a lid thermometer to keep track of the temperatures inside the smoker. Some smokers have built-in thermometers, but these can be off by 50 °F (10 °C)."
    },
    {
      "title": "Make sure that the thermometer is away from the edge of the grate.",
      "content": "Make sure that the thermometer is away from the edge of the grate. Some parts of a smoker are much hotter than others. If you place your thermometer near these areas, you won't get an accurate temperature reading. [14] X Research source Some thermometers, especially electric ones, are just inaccurate or go bad. You should replace it when this happens."
    },
    {
      "title": "Search for leaks if the temperature is inaccurate.",
      "content": "Search for leaks if the temperature is inaccurate. If the temperature inside the smoker does not match the temperature on the damper, you may have a leak. This is especially common among cheap, barrel-shaped smokers. The leaks typically occur around seams. Once you find them, seal them with gaskets or food-safe silicone. [15] X Research source If sealing leaks did not help, try using the exhaust damper instead of the bottom ones to adjust the temperature."
    },
    {
      "title": "Ensure that the smoker is clean.",
      "content": "Ensure that the smoker is clean. If the inside of the bowl or ash catcher are dirty, you will have poor airflow, which can affect the temperature. The bottom damper should also be clean to reduce clogs. If it is clogged, then you won't have enough oxygen reaching your fire, resulting in low temperatures. [16] X Research source If your smoker tends to run too hot, leave it smoky and greasy inside. This will make it less reflective and allow it to radiate heat outside the smoker. [17] X Research source"
    },
    {
      "title": "Adjust the intake damper on hot, cold, or windy days.",
      "content": "Adjust the intake damper on hot, cold, or windy days. If it is a hot or windy day, close the intake damper to reduce the temperature inside the smoker. If it is a cold day, open the damper to increase the temperature. If that doesn't help, try the following: [18] X Research source Hot day: move the smoker out of sunlight or shield it with a canopy or patio umbrella. Cold day: have extra fuel handy. Windy day: work downwind or move the smoker next to a wall to shield it."
    },
    {
      "title": "Check the fuel if the temperature is not rising fast enough.",
      "content": "Check the fuel if the temperature is not rising fast enough. If your intake damper is open and the temperature has not changed for several hours, give the charcoal or firewood a stir. If that doesn't help, add some more charcoal or firewood. [19] X Research source Switch up the brand of fuel. Sometimes, that is all that you need to do. Not all brands are created equal. [20] X Research source Lump charcoal tends to burn hotter and faster than coal briquettes. [21] X Research source If the smoke is white, the wood may not be burning properly. Open the intake damper to allow more oxygen and create a hotter fire."
    }
  ]
}