{
  "url": "https://www.wikihow.com/Calculate-a-Coupon-Payment",
  "title": "How to Calculate a Coupon Payment",
  "steps": [
    {
      "title": "Get the bond's face value.",
      "content": "Get the bond's face value. The first piece of information is the actual face value of the bond, sometimes called its par value. [2] X Research source Note that this value might be (and probably is) different from what you paid for the bond. It's given to you by your broker."
    },
    {
      "title": "Locate the bond expiration.",
      "content": "Locate the bond expiration. You'll also need to locate the bond expiration or maturity date. [3] X Research source That way, you can get a sense of how long you'll be receiving coupons and when you can expect to get your money back. This information is also provided to you by your broker."
    },
    {
      "title": "Find the bond coupon rate.",
      "content": "Find the bond coupon rate. The coupon rate is usually expressed as a percentage (e.g., 8%). [4] X Research source You'll need this information, also provided by your broker, to calculate the coupon payment."
    },
    {
      "title": "Get the current yield, if available.",
      "content": "Get the current yield, if available. The current yield will show you your return on your bond investment, exclusive of capital gains. [5] X Research source This value is necessary if you want to calculate your coupon payment based on the price that you're paying for the bond instead of its face value. The current yield may or may not be provided by your broker. If it isn't provided, don't worry about it."
    },
    {
      "title": "Use the coupon rate and the face value to calculate the annual payment.",
      "content": "Use the coupon rate and the face value to calculate the annual payment. If you know the face value of the bond and its coupon rate, you can calculate the annual coupon payment by multiplying the coupon rate times the bond's face value. For example, if the coupon rate is 8% and the bond's face value is $1,000, then the annual coupon payment is .08 * 1000 or $80. [6] X Research source"
    },
    {
      "title": "Use the current yield to calculate the annual coupon payment.",
      "content": "Use the current yield to calculate the annual coupon payment. This only works if your broker provided you with the current yield of the bond. To calculate the payment based on the current yield, just multiply the current yield times the amount that you paid for the bond (note, that might not be the same as the bond's face value). For example, if you paid $800 for a bond and its current yield is 10%, your coupon payment is .1 * 800 or $80. [7] X Research source"
    },
    {
      "title": "Calculate the payment by frequency.",
      "content": "Calculate the payment by frequency. Since bondholders generally receive their coupon payments semiannually, you just divide the annual coupon payment by two to receive the actual coupon payment. For example, if the annual coupon payment is $80, then the actual coupon payment is $80/2 or $40."
    }
  ]
}