{
  "url": "https://www.wikihow.com/Build-a-Cornhole-Game",
  "title": "How to Build a Cornhole Game",
  "steps": [
    {
      "title": "Build the top.",
      "content": "Build the top. You will need a sheet of plywood that is 24 inches (61.0 cm) by 48 inches (121.9 cm). This is the standard size that is promoted by the American Cornhole Organization (ACO). [1] X Research source"
    },
    {
      "title": "Measure 12 inches (30.5 cm) from one side, and 9 inches (22.9 cm) from the end that you decide will be the top.",
      "content": "Measure 12 inches (30.5 cm) from one side, and 9 inches (22.9 cm) from the end that you decide will be the top. Mark this spot with your pencil. This marked spot will be the center of your cornhole. [2] X Research source"
    },
    {
      "title": "Draw the hole.",
      "content": "Draw the hole. Use a drawing compass to draw a 6-inch diameter hole (3 inch radius). Place the point of the drawing compass on the dot you marked out in the previous step. Spread the compass so that it is 3 inches (7.6 cm) wide and draw a circle. The point of the compass should not leave the board. If you do not have a drawing compass, place a thumbtack over the pencil mark you have made. Place a piece of string under the thumbtack and push the thumbtack down so it holds the string in place. With a ruler, measure 3 inches (7.6 cm) away from the thumbtack, starting at the very center of the thumbtack. Tie a pencil to the string, making sure that the distance between the pencil tip and thumbtack is 3 inches (7.6 cm). Draw your circle."
    },
    {
      "title": "Drill a hole right on the inside of the circle you have just made, up against the pencil circle.",
      "content": "Drill a hole right on the inside of the circle you have just made, up against the pencil circle. Make sure the hole does not go outside the pencil mark. This hole will act as the starting point for your saw."
    },
    {
      "title": "Insert the blade of your jigsaw and cut the hole.",
      "content": "Insert the blade of your jigsaw and cut the hole. Try to cut as close to the penciled circle as possible. Your cut may not be perfect but that is ok because you can clean it up with sandpaper. You can also cut the hole using a hole saw or a router."
    },
    {
      "title": "Wrap a piece of sandpaper around a cylinder of some sort.",
      "content": "Wrap a piece of sandpaper around a cylinder of some sort. The handle of a hammer or a thin pipe will work. Run the sandpaper along the interior edges of the hole to smooth your cut out and make it even."
    },
    {
      "title": "Cut all of your wood.",
      "content": "Cut all of your wood. You will need six 2x4 pieces of wood to make one board. Use a mitre saw or a hand saw to cut the boards. Always use caution when using power tools. Don’t forget to factor in the saw’s blade width. [3] X Research source If you are not familiar with using a mitre or hand saw, ask an employee at the lumberyard to cut your wood for you. Make sure you bring the correct measurements to the lumberyard."
    },
    {
      "title": "Cut 2 of the 2x4s so that each is 21 inches (53.3 cm) long (these will be the ends of the frame).",
      "content": "Cut 2 of the 2x4s so that each is 21 inches (53.3 cm) long (these will be the ends of the frame). Cut 2 of the 2x4s so that each is 48 inches (121.9 cm) long (these will be the sides of the frame). Cut 2 of the 2x4s so that each is 16 inches (40.6 cm) long (these will be the legs that will be used later)."
    },
    {
      "title": "Build the frame.",
      "content": "Build the frame. Place the 21-inch boards in between the 48-inch boards."
    },
    {
      "title": "Using the drill and 2 ½ inch wood screws, screw the boards together by drilling from the outside of the 48-inch board into the end of the 21-inch board where both boards meet.",
      "content": "Using the drill and 2 ½ inch wood screws, screw the boards together by drilling from the outside of the 48-inch board into the end of the 21-inch board where both boards meet. Use two screws for each corner. [4] X Research source Drill your holes with a drill bit that is slightly smaller than your screws. This ensures that your wood won’t split when you drill the screws in, and allows the screws to go into the wood more easily."
    },
    {
      "title": "Place your board top on top of the frame.",
      "content": "Place your board top on top of the frame. Again, before drilling in your screws, drill holes with a drill bit that is slightly smaller than the screws you will be using."
    },
    {
      "title": "Use 10 long drywall screws to attach the board top to the frame.",
      "content": "Use 10 long drywall screws to attach the board top to the frame. Use 4 screws across the top, 4 screws across the bottom, and 2 on each side. [5] X Research source"
    },
    {
      "title": "Countersink",
      "content": "Countersink the screws so that you can cover them with putty later on."
    },
    {
      "title": "Take one of the 16-inch pieces of wood.",
      "content": "Take one of the 16-inch pieces of wood. Estimate where your bolt will pass through by using a ruler. Measure the width of your piece of wood and locate the exact middle. Keep in mind that a 2x4 is not actually 2 inches (5.1 cm) by 4 inches (10.2 cm). Your midway point (middle of the wood) should be close to 1 ¾ inches. (To make things clear, let us say that the middle of the width is 1 3/4 inches.) [6] X Research source"
    },
    {
      "title": "Place the ruler at the end of your wood and measure 1 3⁄4 inches (4.4 cm) (or whatever the length to the middle of the board was in the previous step.",
      "content": "Place the ruler at the end of your wood and measure 1 3 ⁄ 4 inches (4.4 cm) (or whatever the length to the middle of the board was in the previous step. ) Make a mark indicating this measurement. From that mark, draw a line going across the width of the wood. Extend your previous mark so that both lines form a ‘t’ and are perpendicular to one another. [7] X Research source"
    },
    {
      "title": "Take your drawing compass (or homemade drawing compass) and place the point directly in the center of the ‘t’ you have just made.",
      "content": "Take your drawing compass (or homemade drawing compass) and place the point directly in the center of the ‘t’ you have just made. Draw a half circle with the curve starting on the side of the board, arching up to the top of the board, and then arching back down to the other side of the board."
    },
    {
      "title": "Turn your cornhole table over so that it is face down.",
      "content": "Turn your cornhole table over so that it is face down. Take a piece of scrap wood (use a leftover piece of a cut 2x4) and place it against one of the top corners of your table so it lays flat against the top (i.e. it should not run parallel to the side of the frame)."
    },
    {
      "title": "Place one of the legs against the scrap wood so that it lies with the markings you have made facing outward.",
      "content": "Place one of the legs against the scrap wood so that it lies with the markings you have made facing outward. It should be perpendicular to the piece of scrap wood (i.e. it should be parallel to the side of the frame)."
    },
    {
      "title": "Transfer the leg’s midpoint line onto the frame.",
      "content": "Transfer the leg’s midpoint line onto the frame. Use a straightedge or ruler and draw the line with a pencil. Find the frame’s middle with a ruler and mark it along the line you have just made. Do not include the plywood board in the measurement, just the 2x4 frame. [8] X Research source This intersection will be where the drill bolt goes."
    },
    {
      "title": "Make a small hole at the intersection point with an extra screw.",
      "content": "Make a small hole at the intersection point with an extra screw. This will help you guide your screw or bolt into the correct position."
    },
    {
      "title": "Using a drill or power driver, drill a screw or bolt through the mark you have made.",
      "content": "Using a drill or power driver, drill a screw or bolt through the mark you have made. Make sure it goes through the frame and into the leg. Add the other leg in the same way."
    },
    {
      "title": "Measure from the top of the board to the ground.",
      "content": "Measure from the top of the board to the ground. If it is not 12 inches (30.5 cm), mark where you must cut the legs so that the board is 12 inches (30.5 cm) from the ground."
    },
    {
      "title": "Flip the board back over and saw the legs to your measurement.",
      "content": "Flip the board back over and saw the legs to your measurement. Saw the legs at an angle so that they run parallel to the ground. Sand them if your cut is slightly jagged."
    },
    {
      "title": "Use a putty knife to put wood filler into any holes or cracks on your board.",
      "content": "Use a putty knife to put wood filler into any holes or cracks on your board. Check the filler’s box for instructions on how long to let it dry. The surface of your cornhole board should be as smooth as possible. If you put too much filler in a crack, it can be sanded down once it is dried. [9] X Research source"
    },
    {
      "title": "Sand the surface of your table.",
      "content": "Sand the surface of your table. A smooth table will allow bean bags to slide better. Use an electric sander if you have one. If you don’t have one, medium grit sandpaper will work well. [10] X Research source"
    },
    {
      "title": "Apply a thin layer of primer paint to all visible surfaces of the board and legs.",
      "content": "Apply a thin layer of primer paint to all visible surfaces of the board and legs. You can use a paintbrush or roller. Let the primer dry. The primer will dry white."
    },
    {
      "title": "Add a layer of white high-gloss latex paint.",
      "content": "Add a layer of white high-gloss latex paint. This layer will act as the border if you are following a traditional cornhole design. Let this layer dry."
    },
    {
      "title": "Pick out your paint colors and design.",
      "content": "Pick out your paint colors and design. The traditional cornhole table has a white border 1.5 inches (3.8 cm) wide. It also has a 1.5-inch border around the circle. Use painters tape and cover whatever you want to stay white with the tape."
    },
    {
      "title": "Paint the rest of your board with whatever color you choose.",
      "content": "Paint the rest of your board with whatever color you choose. Make sure to use high-gloss latex paint. This type of paint will leave your board smooth so the bean bags will be able to slide more easily. Let the paint dry. If your paint is too light for your liking, add more layers. If you decide not to do the traditional paint pattern, get creative! Use painters tape to create shapes that you can paint on or around. Use bright colors and make your cornhole board stand out in a crowd."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. You will need a large piece of duck cloth (you can generally purchase swaths of duck cloth that are 7 inches wide and 56 inches long.) You will also need scissors, a ruler, a sewing machine, fabric glue, a bag of feed corn, and a digital baking scale. You can also use a needle and thread if you do not have a sewing machine."
    },
    {
      "title": "Cut the duck cloth into 7-inch by 7-inch squares.",
      "content": "Cut the duck cloth into 7-inch by 7-inch squares. Using your ruler, measure out 7 inches (17.8 cm) at a time to make sure you are accurate. You should make 8 of these squares. [11] X Research source"
    },
    {
      "title": "Match 2 of the squares up so that they are perfectly aligned.",
      "content": "Match 2 of the squares up so that they are perfectly aligned. Using either a sewing machine or a needle and thread, sew 3 of the sides closed. Keep in mind that you should be sewing 1/2 an inch in from the edge of the squares. [12] X Research source"
    },
    {
      "title": "Put a line of fabric glue in between the edges of the two squares.",
      "content": "Put a line of fabric glue in between the edges of the two squares. Only do this on the sides that you have sewn up. Even though you have sewed these sides, gluing the extra fabric together will make it less likely that your bean bags will leak. [13] X Research source"
    },
    {
      "title": "Flip your bag inside out.",
      "content": "Flip your bag inside out. Again, flipping your bag inside out makes it less likely that your corn will leak out."
    },
    {
      "title": "Add 15.5 ounces of feed corn to each bag.",
      "content": "Add 15.5 ounces of feed corn to each bag. Place the feed corn onto your digital baking scale and add or remove corn until it weighs 15.5 ounces. Then put the corn into the bag. [14] X Research source If you do not have a digital baking scale, 2 cups of feed corn is very close to 15.5 ounces. It may not be exact but it will be close enough. [15] X Research source"
    },
    {
      "title": "Measure 1/2 an inch in on the side that is still open.",
      "content": "Measure 1/2 an inch in on the side that is still open. Fold the 1 ⁄ 2 inch (1.3 cm) edges into the bag and hold closed. You can use a pin to hold the edges closed. [16] X Research source"
    },
    {
      "title": "Sew the final side shut.",
      "content": "Sew the final side shut. Try to place your stitches as close to the edge as possible. Doing this will make the bag as evenly sized as possible. [17] X Research source"
    }
  ]
}