{
  "url": "https://www.wikihow.com/Check-if-a-Company-Is-Genuine",
  "title": "How Do You Know if a Business Is Legitimate?",
  "steps": [
    {
      "title": "Check the company's website for a legitimate telephone number and address.",
      "content": "Check the company's website for a legitimate telephone number and address. If there’s no way to contact this company offline, this may be a red flag that the business is not legitimate. Since emails and domain names are easy to obtain, having an email address is not as trustworthy as offline contact information. Remember that both phone numbers and addresses are now super easy to fake, meaning phone numbers are no longer a sign of a real company. Before doing business, call the local chamber of commerce associated with the address and see if they are a real brick-and-mortar company. Note that not every company has a physical location, but if yours does, it's a sign it's legit. Be wary if you find the same supposedly local business page being used for another location. Usually these copied phony business web pages have broken hyperlinks for images and links, which is a tip-off that this may be a phishing business page."
    },
    {
      "title": "Browse the company's website for discrepancies and sloppiness.",
      "content": "Browse the company's website for discrepancies and sloppiness. If a website says one thing in one spot, and then contradicts itself in another spot, that's a sign that the business may be a scam that was hastily thrown together. If the website is sloppy (for example, there are stolen images and numerous spelling errors), this shows that little thought or care was put into creating the website, which could indicate a \"get rich quick\" scam. [1] X Research source"
    },
    {
      "title": "Review the website's policy pages for suspicious sounding language.",
      "content": "Review the website's policy pages for suspicious sounding language. Legitimate companies will almost always have terms of use or terms and conditions pages, as well as privacy policy pages. If they do have terms and privacy policies, read through them carefully suspicious sounding language. Red flags might include confusing or dense writing designed to discourage you from reading closely and finding any loopholes, or just plain sloppy, grammatically incorrect writing. [2] X Research source"
    },
    {
      "title": "Look for legitimate content about the business.",
      "content": "Look for legitimate content about the business. Phony referral business sites usually don't have much content on their sites, and they might try to seem trustworthy by having a lot of legitimate-looking stickers and Better Business Bureau logos on their site to trick you into trusting them. A big tip-off is stock photos or no photos of the company building, employees, or products. Avoid the company if all you see are stock photos of their so-called product, which is one of the easiest way to spot a fake web business! [3] X Research source"
    },
    {
      "title": "Make sure the company accepts payments.",
      "content": "Make sure the company accepts payments. It's a red flag when a company's website says they only accept payments via check or cash or another insecure method. PayPal and other secondary electronic payment providers are often considered the safest method for paying online businesses. Look into payment methods which will allow you to get your money back if things go sour and don’t require the release of unnecessary personal information."
    },
    {
      "title": "Visit the company's brick and mortar location.",
      "content": "Visit the company's brick and mortar location. You can learn a lot about a business by simply visiting its brick-and-mortar location. Your visit may allow you to communicate directly with management and ownership in order to determine legitimacy. [4] X Research source Trade and/or specialty businesses must have their relevant permits, licenses, and approved registration documentation clearly on display for customers. If so, check and make sure that these displayed certifications are up to date. Restaurants must have relevant documentation required by the local Department of Health and Sanitation clearly displayed on the wall. Typically, this type of documentation provides the business with a grade, and the presence of such documentation indicates the legitimacy of the restaurant. Not every company has a brick-and-mortar location, including many small businesses. If you can’t find a physical location for the company, that doesn't automatically mean it’s fraudulent."
    },
    {
      "title": "Check the registration data",
      "content": "Check the registration data for the company website. You can sometimes find the name and information for the person who registered the website, which you may want to use for further research. Determine when the website was created and when it will expire. If it was only created recently and will expire soon, that may point to the website being a temporary cover for a scam. The International Corporation for Assigned Names and Numbers (ICANN) provides registration authorization for many website domain names and is a great resource for determining who is the actual owner of the business website that you are researching."
    },
    {
      "title": "Find out if the business has registered with local, state, or federal authorities.",
      "content": "Find out if the business has registered with local, state, or federal authorities. Businesses that operate as LLCs, as Corporations, or under other official business entity vehicles are required to register with the secretary of state where they are operating. Similarly, businesses that pay wages to employees are assigned state and Federal Employer Identification numbers. A business being listed on a state or federal listing shows that they are likely a reputable business. Review the business's website or promotional materials to see whether they use the phrases “LLC,” “Inc,” or “Corp” in their official business name. If so, you’ll be able to check secretary of state websites to determine whether the company is properly registered, and thus has the right to use the particular business entity type designation in their name. [5] X Trustworthy Source Internal Revenue Service U.S. government agency in charge of managing the Federal Tax Code Go to source"
    },
    {
      "title": "Check the Better Business Bureau",
      "content": "Check the Better Business Bureau for info about the company. The Better Business Bureau (BBB) has both local and national branches that are committed to providing consumers with relevant and useful information regarding businesses operating within their communities. The BBB's website allows you to search for specific business names, and also provides general information regarding scam and fraud trends. [6] X Research source A lack of a listing on BBB does not automatically mean the business is a scam. In fact, some BBB listing pages have become a place where consumers can freely voice complaints about the fraudulent nature of a business, as well as past scams that have occurred."
    },
    {
      "title": "See if the business is registered with relevant industry organizations.",
      "content": "See if the business is registered with relevant industry organizations. Some industries have regulatory bodies they are required to register with in order to maintain relevant licenses and certifications. Local and national industry organizations may provide relevant information to the public about its members and the specific businesses that have successfully registered with the industry organization. For instance, contractors, doctors, lawyers, and many other professionals must be registered with a valid government agency or industry organization. Keep in mind that just because a company is registered (or claims to be) doesn't mean it's not fraudulent; rather, not being registered with necessary organizations is a red flag."
    },
    {
      "title": "Use a company credit report to check the legitimacy of a company.",
      "content": "Use a company credit report to check the legitimacy of a company . Using a company credit report service can allow to determine a company's credit score, contact details, financial performance, governance or leadership structure, number of years in operation, and past legal judgments brought against them. [7] X Research source"
    },
    {
      "title": "Use Google to search for the company name.",
      "content": "Use Google to search for the company name. You can locate reviews and other information about the company and whether it's a scam or not. If you don't see anything, try the search term \"[company name] scam,\" and see if results turn up that way. Although it's possible to manipulate a positive online presence, bad feedback is harder to hide. [8] X Research source"
    },
    {
      "title": "Check the company's customer reviews on consumer review platforms.",
      "content": "Check the company's customer reviews on consumer review platforms. Unlike personal blogs, consumer review platforms reflect the opinion of various customers and usually provide an unfiltered view of a company's overall reliability. Trustworthy consumer review platforms will not censor reviews in any way and fight hard against the posting of fake reviews. Be wary of fake reviews! If you notice a bunch of positive reviews in a short span of time, multiple reviews from the same IP address or similar reviewer names, generic reviews, or reviews that seem to be written in the same voice, they may be fraudulent. [9] X Research source"
    },
    {
      "title": "Ask friends about their past experiences with the company.",
      "content": "Ask friends about their past experiences with the company. Some of your best review resources are the people you know in real life. Take the time to ask your friends and family if they have any experience with the company you’re researching, and whether their experience was satisfactory or out of the ordinary. [10] X Research source"
    }
  ]
}