{
  "url": "https://www.wikihow.com/Calculate-the-Circumference-of-a-Circle",
  "title": "How to Calculate the Circumference of a Circle",
  "steps": [
    {
      "title": "Use the formula C = πd to find the circumference if you know the diameter.",
      "content": "Use the formula C = πd to find the circumference if you know the diameter. In this equation, \"C\" represents the circumference of the circle, and \"d\" represents its diameter. That is to say, you can find the circumference of a circle just by multiplying the diameter by pi . Plugging π into your calculator will give you its numerical value, which is a closer approximation of 3.14 or 22/7. [1] X Research source Diameter means a straight line segment that passes through the center of the circle and has its endpoints on the sides of the circle. [2] X Research source"
    },
    {
      "title": "Plug the given value of the diameter into the formula and solve.",
      "content": "Plug the given value of the diameter into the formula and solve. Check out the example problem below if you'd like extra practice. [3] X Research source Example problem: You have a circle tub with a diameter of 8 feet, and you want to build a white fence that creates a 6-foot wide space around the tub. To find the circumference of the fence that has to be created, you should first find the diameter of the tub and the fence which will be 8 feet + 6 feet + 6 feet, which will account for the entire diameter of the tub, plus the space between the tub and fence. The diameter for your circular fence is 8 + 6 + 6, or 20 feet. Now plug it into the formula, plug π into your calculator for its numerical value, and solve for the circumference: C = πd C = π x 20 C = 62.8 feet"
    },
    {
      "title": "Use the formula C = 2πr to find the circumference using the radius.",
      "content": "Use the formula C = 2πr to find the circumference using the radius . In this formula, \"r\" represents the radius of the circle. Again, you can plug π into your calculator to get its numeral value, which is a closer approximation of 3.14. [4] X Research source A radius is any line segment that extends from the center of the circle and has its other endpoint on the edge of the circle. [5] X Research source You might notice this is similar to the C = πd formula. That’s because the radius is half as long as the diameter, so the diameter can be thought of as 2r."
    },
    {
      "title": "Plug the given radius into the equation and solve.",
      "content": "Plug the given radius into the equation and solve. For this example, let's say you're cutting out a decorative strip of paper to wrap around the edge of a pie you've just made. The radius of the pie is 5 inches. To find the circumference that you need, just plug the radius into the equation: [6] X Research source C = 2πr C = 2π x 5 C = 10π C = 31.4 inches"
    }
  ]
}