{
  "url": "https://www.wikihow.com/Care-for-a-Rabbit-with-GI-Stasis",
  "title": "How to Care for a Rabbit with GI Stasis",
  "steps": [
    {
      "title": "Monitor your rabbit’s feces production.",
      "content": "Monitor your rabbit’s feces production. GI stasis is not always readily apparent in rabbits, especially in the early stages of disease. Since rabbits are prey animals, they tend to hide their pain to avoid looking vulnerable to a predator. Your own rabbit may do the same. [4] X Research source Fortunately, one of the most recognizable symptoms of GI stasis is a decrease or complete stop of feces production. If your rabbit is producing fewer fecal pellets than usual, or has completely stopped producing them, he probably has GI stasis. [5] X Research source"
    },
    {
      "title": "Observe your rabbit’s appetite.",
      "content": "Observe your rabbit’s appetite. Another telltale sign of GI stasis is a partial or complete lack of appetite. [6] X Research source It would be obvious if your rabbit is not eating at all, but not so obvious if he is eating less. Consider keeping a food diary where you can record how much you gave your rabbit to eat and how much he actually ate. In addition to eating less, your rabbit will drink less water, which can lead to serious dehydration. Instead of eating his normal food, your rabbit may eat non-food objects like paper or wood to try to increase his fiber intake. [7] X Research source Fiber helps move food through the GI tract, so your rabbit may become desperate to eat anything to get more fiber in his digestive system."
    },
    {
      "title": "Look at your rabbit’s demeanor.",
      "content": "Look at your rabbit’s demeanor. Unsurprisingly, your rabbit’s overall demeanor will change if he has GI stasis. Even if he tries to hide it at first, his mood will start to change as GI stasis takes its toll. For example, your rabbit will become depressed. He will also become lethargic. [8] X Research source Because of his intense pain, your rabbit will start hunching over. [9] X Research source Your rabbit may also grind his teeth due to the pain. [10] X Research source"
    },
    {
      "title": "Touch your rabbit’s abdomen.",
      "content": "Touch your rabbit’s abdomen. As GI stasis progresses, your rabbit’s intestines will fill up with gas. [11] X Research source If your rabbit will let you, gently place your hands on his abdomen. His abdomen will probably feel doughy to the touch. [12] X Research source Remember that your rabbit may be in a lot of pain, so touching his abdomen could make him very uncomfortable. [13] X Research source"
    },
    {
      "title": "Take your rabbit to your veterinarian.",
      "content": "Take your rabbit to your veterinarian. GI stasis in rabbits can be life threatening, [14] X Research source so do not delay in getting your rabbit to your veterinarian. Your veterinarian will physically examine your rabbit and run several diagnostic tests to confirm GI stasis. During the physical exam, your veterinarian will palpate your rabbit’s abdomen and put his or her stethoscope on the abdomen to listen for gut sounds. [15] X Research source Your veterinarian will also look at your rabbit’s mouth, since dental disease can lead to GI stasis. [16] X Research source In addition to the physical exam, your veterinarian will take several samples (feces, urine, blood) for analysis. He or she will also take an x-ray of your rabbit’s abdomen to get a better look at his GI tract. [17] X Research source Your veterinarian will need to make sure your rabbit has GI stasis, rather than an intestinal blockage, since these two conditions are treated differently. The difference between the two will be apparent on the abdominal x-ray. [18] X Research source If your rabbit has an obstruction, that will need to be treated as well. Do not attempt to diagnose GI stasis on your own. Not only is it difficult to recognize early on, but other diseases resemble GI stasis. [19] X Research source It is best to have your veterinarian diagnose your rabbit’s GI stasis."
    },
    {
      "title": "Relieve your rabbit’s pain.",
      "content": "Relieve your rabbit’s pain. Intensive care by your veterinarian is required to treat your rabbit’s GI stasis. [20] X Research source Your rabbit’s treatment plan will have many parts, one of which is pain relief. When his intestines fill with gas, this can stretch the walls of gut and cause intense pain. [21] X Research source In addition, pain can cause GI stasis. Therefore, pain relief is an important aspect of treating GI stasis. Several pain medications are available for your rabbit. Your veterinarian will decide which medication will work best for your rabbit."
    },
    {
      "title": "Rehydrate your rabbit.",
      "content": "Rehydrate your rabbit. When your rabbit drinks less water with GI stasis, his body will draw water out of his GI tract and move it to other parts of his body in an attempt to stay hydrated. [22] X Research source To treat your rabbit, your veterinarian will need to not only rehydrate your rabbit as a whole, but also rehydrate his GI tract so food can move through more easily. [23] X Research source Rehydration will also provide your rabbit with much-needed nutrients. [24] X Research source The fluids will help stimulate your rabbit’s gut motility."
    },
    {
      "title": "Feed your rabbit.",
      "content": "Feed your rabbit. Anorexia can cause serious health problems in rabbits (fatty liver disease, gastric ulcers), even after just 12 hours of not eating. [25] X Research source Since your rabbit has not been eating due to his GI stasis, it is critical for him to start eating again. Your veterinarian will probably feed him an emergency food called Critical Care. [26] X Research source If your rabbit may not be strong enough to eat on his own, your veterinarian will hand feed him using a syringe or feed him through a nasogastric tube. [27] X Research source In addition to this emergency food, your veterinarian will give your rabbit free-choice hay and leafy greens. [28] X Research source Since alfalfa hay can cause bloating, [29] X Research source your veterinarian will instead feed your rabbit some type of grass hay (e.g., timothy, oat, brome). [30] X Research source Fresh herbs can stimulate an anorexic rabbit to eat. Examples of herbs are mint, basil, and fennel. Alternatively, your veterinarian may want to use an appetite stimulant, such as B vitamins. [31] X Research source Your rabbit will need to be fed frequently (every 3 to 6 hours) to prevent complications from anorexia, restore nutrients, and stimulate gut motility. [32] X Research source [33] X Research source"
    },
    {
      "title": "Restore your rabbit’s normal gut motility.",
      "content": "Restore your rabbit’s normal gut motility. In addition to rehydrating and feeding your rabbit, your veterinarian will give your rabbit medications (‘prokinetics’) to get his gut moving again. Prokinetics should be given only if your rabbit does not have an intestinal obstruction. [34] X Research source Your veterinarian will have determined if your rabbit has an obstruction (e.g., hairball) with earlier diagnostic testing. Prokinetics may not work immediately. It may take a few weeks for gut motility to return to normal with prokinetics. [35] X Research source"
    },
    {
      "title": "Eliminate harmful toxins from your rabbit’s GI tract.",
      "content": "Eliminate harmful toxins from your rabbit’s GI tract. During the course GI stasis, harmful bacteria ( Clostridium ) can form in the gut and release bad toxins. [36] X Research source Your veterinarian may want to use a medication called Questran that can absorb these bad toxins and pass them through the feces. [37] X Research source By absorbing the toxins, Questran can aid the recovery process while other medications are working to restore gut motility. [38] X Research source Antibiotics should be used with caution when treating GI stasis in rabbits. Overuse of antibiotics can lead to the development of treatment resistant bacteria, which could make it even more difficult to treat GI stasis. [39] X Research source"
    },
    {
      "title": "Do NOT administer certain treatments.",
      "content": "Do NOT administer certain treatments. There are treatments that should be absolutely avoided when treating your rabbit’s GI stasis. For example, yogurt and probiotics are not recommended, since the milk starches and sugar in these substances can actually feed the bad bacteria growing in your rabbit’s GI tract. Feeding your rabbit cecotropes (his own droppings) is not a good idea for the same reason. [40] X Research source You may have heard that pineapples are a good hairball remedy for rabbits. [41] X Research source Since hairballs can form as a result of GI stasis, it may make sense to try to break down the hairball. However, the enzymes in pineapples cannot break down keratin, the main component of hair. [42] X Research source Your veterinarian should not give your rabbit pineapple."
    },
    {
      "title": "Feed your rabbit a high-fiber diet.",
      "content": "Feed your rabbit a high-fiber diet. As you can see, treating GI stasis in rabbits is intensive and extensive. It is much easier to prevent GI stasis than to treat it. [43] X Research source One of the best ways to prevent GI stasis is to feed your rabbit a high-fiber diet. Hay is an excellent source of fiber, so make sure your rabbit has unlimited access to fresh, high quality hay. The freshest hay will likely be at your local feed store. The fresher the hay, the more nutrients it will have. Your rabbit can also get a lot of fiber from fresh vegetables, such as leafy greens, celery, and green peppers. [44] X Research source The pellets you feed your rabbit should be at least 18 to 20% fiber."
    },
    {
      "title": "Increase your rabbit’s water intake.",
      "content": "Increase your rabbit’s water intake. In addition to fiber, water is essential to keeping food moving smoothly your rabbit’s GI tract. An easy way to get your rabbit to drink more water is to put it in a bowl instead of a sipper bottle. [45] X Research source Refill the bowl often to make sure your rabbit has enough water to drink at all times. Place the water in a sipper bottle if you will not be home enough to frequently refill a water bowl."
    },
    {
      "title": "Decrease your rabbit’s stress.",
      "content": "Decrease your rabbit’s stress. Stress can cause GI stasis, so you should try to identify and remove the stressors in your rabbit’s environment. Overcrowding is an example of a stressor. If you have more than one rabbit, you may need to separate them to relieve the overcrowding. [46] X Research source Excessive heat can also be stressful to your rabbit. [47] X Research source If his pen is by a window that gets a lot of direct sun, move his pen to an area of the room that gets less sun. Enriching your rabbit’s environment with different toys and digging material can keep him busy and help him feel less stressed when you are not around to play with him. [48] X Research source If you make any changes to your rabbit’s diet or daily routine, make them gradually. [49] X Research source Rapid changes can increase a rabbit’s stress."
    },
    {
      "title": "Take your rabbit to your veterinarian regularly.",
      "content": "Take your rabbit to your veterinarian regularly. Regular veterinary check-ups would help your veterinarian detect and treat underlying diseases that could eventually lead to GI stasis. [50] X Research source For example, your veterinarian can check your rabbit’s incisors and molars to see if their growth is affecting your rabbit’s ability to chew his food. [51] X Research source Regular veterinary visits may be costly, but may actually be inexpensive compared to the cost of treating GI stasis."
    }
  ]
}