{
  "url": "https://www.wikihow.com/Construct-a-Yu-Gi-Oh!-Deck",
  "title": "How to Construct a Yu Gi Oh! Deck",
  "steps": [
    {
      "title": "Acquire some Yu-Gi-Oh!",
      "content": "Acquire some Yu-Gi-Oh! cards. If you already have cards, lay them out so you can see them all and organize them easily. It's a good idea to have a lot of cards so you have some variety. If you don't think you have enough to work with, buy a tin or two. These offer a few cards from a lot of series to choose from. If you already have an idea of what you're looking for, you can buy singles online or at your local trading card store. Alternatively you may construct and test a deck with an online simulator, such as on the Dueling Book website (Dueling Network is down), before deciding to buy some cards. You will need between 40 and 60 cards to make a full deck. Always have as close to 40 cards as possible to lessen the chance of getting bad draws."
    },
    {
      "title": "Understand the rules",
      "content": "Understand the rules . Ensure you know the rules before you start. If you don't know the rules of Yu-Gi-Oh!, you can find a rulebook and many tutorials online. If you do know the basic rules, familiarize yourself with the more complex mechanics, like chaining, missing the timing, and conjunctions."
    },
    {
      "title": "Decide what kind of deck you want.",
      "content": "Decide what kind of deck you want. The best Yu-Gi-Oh! decks focus around a single archetype: a group of cards with similar names that support each other. An archetype deck will be much more powerful and consistent than a deck focused around an attribute or type, because of the synergy and support cards. A deck should also focus on a single mechanic or gimmick, like Synchro summoning or banishing. Before you build your own deck, you might want to watch or play a few games with a friend's deck to help decide on what strategies you prefer. You can also find good decks to use on the internet."
    },
    {
      "title": "Add monster cards.",
      "content": "Add monster cards. Monsters are the most important cards in Yu-Gi-Oh!, used by almost every deck to attack and defend. Around 12-18 cards in your deck should be monsters, which should support your archetype or work with your deck. Don't have too many monsters you can't summon - the majority of your deck should be level 4 or below. Only use around 3-4 level 5 and 6 monsters, and 1-2 level 7 and up monsters, unless your high-level monsters are readily summonable. Use effect monsters with useful effects, unless your deck focuses on normal monsters."
    },
    {
      "title": "Add spell cards.",
      "content": "Add spell cards. Most spell cards help you make your plays or get you out of tough spots. Good spells to use are: archetype support cards, searchers like Reinforcement of the Army or Preparation of Rites, monster destruction like Raigeki or Dark Hole, monster protection like Forbidden Lance, spell/trap destruction like Mystical Space Typhoon, and deck thinners like Upstart Goblin and Pot of Duality. Certain decks may also use field spells or ritual spells."
    },
    {
      "title": "Add trap cards.",
      "content": "Add trap cards. Trap cards are useful for disrupting your opponent's plays. Most decks use around 5-10 traps, though some use as low as 3. Good trap cards are those that can: prevent attacks like Mirror Force, negate summons like Solemn Warning, negate spell/trap activations like Wiretap, negate effects like Breakthrough Skill or Fiendish Chain, remove monsters like Ring of Destruction or Compulsory Evacuation Device, and prevent your opponent from making plays like Vanity's Emptiness. You should use trap cards to shore up your deck's weaknesses."
    },
    {
      "title": "Build an Extra Deck.",
      "content": "Build an Extra Deck. Nearly every deck in existence benefits from having an Extra Deck. If you have at least 3 summonable monsters of the same level, include some generic Xyz monsters of that rank. If you have a Tuner, add a few Synchro monsters who's levels equal the combined levels of that Tuner and you most commonly summoned monsters."
    },
    {
      "title": "Build a Side Deck.",
      "content": "Build a Side Deck. A Side Deck is optional, and you will not need one unless you plan to participate in tournaments. You can switch in the cards in your side deck between duels in matches. A side deck is limited to 15 cards, and contains cards that are good against certain strategies, but are too situational to include in your main deck. If you want a side deck, build it to counter the decks you are likely to face, such as your friends' decks or the decks at your local tournament."
    },
    {
      "title": "When building your deck, keep the metagame in mind.",
      "content": "When building your deck, keep the metagame in mind. Understand what cards are good at the time, and have strategies to counter the most popular decks and strategies."
    },
    {
      "title": "Once you've compiled your deck, test it out and learn the strengths and weaknesses of your deck.",
      "content": "Once you've compiled your deck, test it out and learn the strengths and weaknesses of your deck. Now would be a good time to make any card swaps, and build your Side Deck."
    },
    {
      "title": "Have consistency.",
      "content": "Have consistency. Consistency is essential. In order for you to draw the cards you need, you need to add copies of some cards. The more copies of the same card you carry, the higher chance there is that you will draw it. This step relies on a smaller deck. 40 card decks has smaller amount of cards than 60 card decks. If you have a 40 card deck with three copies of a card, you have a 1/13 chance to draw into the card. This means that every 13 cards you should draw one copy of the card. Combine this with cards that thin the deck from searching or special summoning along with drawing cards, and you may be carrying a deadly deck."
    }
  ]
}