{
  "url": "https://www.wikihow.com/Avoid-Someone-You-Are-Attracted-to",
  "title": "How to Avoid Someone You Are Attracted to",
  "steps": [
    {
      "title": "Go out of your way to prevent bumping into the person.",
      "content": "Go out of your way to prevent bumping into the person. This might seem pretty obvious, but it can also be challenging if you don't consciously think about it. You might not be able to totally stay away if you work or go to school with this person, but you can take extra steps to make sure you don’t see them unless you have to. [1] X Research source It can be really challenging to switch things up, especially when you're doing it for an emotional reason. Remember to be patient with yourself and start by doing what you can. This could mean changing up where you grab lunch or your morning coffee. If you used to bump into them while walking your dog, consider taking an alternate route."
    },
    {
      "title": "Switch up your schedule so that you don't see them.",
      "content": "Switch up your schedule so that you don't see them. In addition to trying out new places, you can start doing things at different times of the day. This is a great way to avoid them knowing what you're up to and popping in to say hi. Pick a couple of changes to make that won't make you feel too off-balance. This might feel really difficult, or even sad, but you can do it. [2] X Research source For example, if you used to work out at night, try hitting the gym or going for a run in the morning. It might seem like a pain to have to change your habits, but it’s probably one of the most effective ways to keep them out of sight."
    },
    {
      "title": "Avoid seeing their posts.",
      "content": "Avoid seeing their posts. If you keep seeing fun pics of them pop up, it might weaken your resistance. It might also make you feel a wave of emotions that you'd rather avoid, which is totally normal. To steer clear of the temptation to scroll through their photos or even show up to the spot where they are, set them to mute on your social media accounts. [3] X Research source If you want, you can unfriend them or stop following them. But if you’re worried that might invite questions or draw attention to yourself, the mute option is your best bet. You’ll stop seeing their posts but don’t have to stop being friends on social altogether."
    },
    {
      "title": "Don't flirt with them or touch them.",
      "content": "Don't flirt with them or touch them. If they are also attracted to you, it can be even harder to not act on your feelings. This can be especially tricky if you can’t totally avoid them. Make it clear with your words and actions that you’re not interested in pursuing things, even if that feels really hard. [4] X Research source Resist the urge to flirt even if they initiate it. Even if they start complimenting you and acting interested, resist the urge to reciprocate. If you work with them, say something like, “I’m trying to stay professional. Thanks for respecting that.” Avoid physical contact. Don’t casually touch them if you do run into each other. That can send the signal that you’re interested in them. It can be super tough to resist these urges, so don’t beat yourself up if you slip. Just try to get yourself back on track with a pep talk."
    },
    {
      "title": "Distract yourself from your crush by doing things you enjoy.",
      "content": "Distract yourself from your crush by doing things you enjoy. Take up a new hobby or revisit an old one. You could also take your mind off of your feelings by taking on an extra project at work if you feel up to it. [5] X Research source Try something new like taking tennis lessons or going to a painting class. This will engage your mind and give you something to do with your time. You could also spend time on projects you’ve been wanting to tackle, like cleaning out your closets. Even though you're going through something tough, there can be benefits to this time. Reader Poll: We asked 1070 wikiHow readers who’ve struggled to cope with a crush, and only 8% have had luck with confiding in a trusted friend or mentor for support. [Take Poll] So, while this may not be a great strategy according to our readers, focusing on things you enjoy may help distract you."
    },
    {
      "title": "Make an effort to connect with your loved ones.",
      "content": "Make an effort to connect with your loved ones. It will be fun and keep your mind off of your feelings. Just make sure to try to avoid places that you know the person you’re avoiding is likely to be. [6] X Research source Ask your best friend to take that road trip the two of you have been talking about forever. See if your mom wants to start taking a long hike with you on the weekends."
    },
    {
      "title": "Reach out to a good friend for empathy.",
      "content": "Reach out to a good friend for empathy. It can be hard to be attracted to a person that you know you can’t be (or shouldn’t be) with. It could help you to process your emotions if you work through them with a good friend. They might be able to offer some insight and can probably offer you some much-needed support. [7] X Research source Try saying, “Hey, I’m realizing I have feelings for Jamie. I don’t think it’s something I want to pursue, but I’m having trouble dealing with my attraction. Can you talk it out with me?” Make sure to choose someone that you can trust not to share your feelings with anyone else."
    },
    {
      "title": "Remind yourself of what could happen.",
      "content": "Remind yourself of what could happen. This can be emotionally tricky, so be patient with yourself during this process. If you’re trying to avoid someone you like, it might be because you know it’s not a good idea to be with them. Make a list of the reasons you know you shouldn't be together. It might help to see it in writing. When you need to talk yourself into staying away from them, remind yourself that you might get hurt if you pursue things. [8] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 27 October 2021. For example, you could tell yourself, “If I start seeing Taylor, it would really hurt Sam’s feelings. It hasn’t been very long since they broke up. I don't want to deal with that.” Or you might think, “Last time I tried dating Whitney, they hurt my feelings a lot. I felt bad about myself, and I don’t want to feel that way again.” Weigh the cons realistically. If you are attracted to someone that is off-limits, think about how being with them could harm your career, friendships, or family. If you or the other person is already in a relationship, remind yourself of that every time you are tempted to see them."
    },
    {
      "title": "Look for ways to redirect your thoughts.",
      "content": "Look for ways to redirect your thoughts. Processing your emotions is really important, but there's a fine line between thinking things through and obsessing. It's normal if you're doing the latter, but try to break that habit of thinking of them all day so that you can move on. When you catch yourself thinking of them, acknowledge your thought, and then send it away. [9] X Research source Think to yourself, \"Okay, I'm thinking about Jaime. I'm going to shift my thoughts and think about game night with my friends instead.\" Try giving yourself a time limit. Tell yourself that you will think about them for 5 minutes and then you'll move on. Set a timer on your phone so you stick to it."
    },
    {
      "title": "When you're ready to date, look for someone that has those qualities.",
      "content": "When you're ready to date, look for someone that has those qualities. Even though you can't be with this person, it doesn't mean that they don't have some great traits that you love. Think through why you are attracted to them and make a note of those attributes. Make these a priority when you're searching for someone new. [10] X Research source For example, maybe they were really kind to your pets. Make \"animal lover\" a non-negotiable when you start dating. If you admired their work ethic, focus on finding someone new with that same quality."
    },
    {
      "title": "Walk away from the situation if you can.",
      "content": "Walk away from the situation if you can. This might feel nearly impossible, and that's understandable. [11] X Research source You're in a really tough situation. If you've tried to shift your thoughts and set boundaries, good for you. But sometimes you might just need to cut off contact completely, even though that can be really tough. Don't answer their calls, texts, or social media messages. [12] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 27 October 2021. This can be super tough, so make sure to be kind to yourself. You can also lean on your friends when you need to."
    },
    {
      "title": "Evaluate if your needs are being filled.",
      "content": "Evaluate if your needs are being filled. [13] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 27 October 2021. Sometimes people develop a crush on someone very different from the person that they are currently with. That could mean that you are seeking change in your own relationship. Evaluate what attracts you to the person and then think about if that is a quality you’re missing in your partner. [14] X Research source For example, maybe you’re attracted to someone because they share your love of music. Ask your partner if they’re willing to go to some more concerts with you. That might fill your need and cause your feelings for your crush to cool down. This might be pretty emotional. Tell yourself it's okay to feel whatever emotions you're dealing with."
    },
    {
      "title": "Make an appointment to talk to someone.",
      "content": "Make an appointment to talk to someone. It can be really tough to deal with intense feelings towards someone, especially if you don’t feel like you can act on them. If this is causing you to feel depressed or causing you anxiety, seek professional help. They can help you figure out a healthy way to deal with the situation. [15] X Research source Try not to be nervous if it's your first time seeking counseling. It can feel awkward at first, but you're doing a great job of prioritizing your mental health."
    }
  ]
}