{
  "url": "https://www.wikihow.com/Add-Friends-and-Contacts-in-Facebook-Messenger",
  "title": "How to Add Friends and Contacts in Facebook Messenger",
  "steps": [
    {
      "title": "Open the Messenger app.",
      "content": "Open the Messenger app. This looks like a lightning bolt in a purple-blue speech bubble. If you aren't already logged in , enter your email address and password to do so now. By default, your Messenger contact list is the same as your Facebook friends. You can add friends on Facebook to add those people to your Messenger list automatically, or you can do so from the Messenger app. [1] X Research source"
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . You can find this in the top-right corner."
    },
    {
      "title": "Tap the cog icon.",
      "content": "Tap the cog icon. This will be to the right of your name. A new page will open."
    },
    {
      "title": "Tap See more in Accounts Center.",
      "content": "Tap See more in Accounts Center . You can find this at the very bottom of the page, underneath Meta Accounts Center ."
    },
    {
      "title": "Tap Your information and permissions.",
      "content": "Tap Your information and permissions . This will be below Search history ."
    },
    {
      "title": "Tap Upload contacts.",
      "content": "Tap Upload contacts . A new page will open with a list of your connected Meta accounts. This can be your Facebook , Messenger , Instagram , or another connected account."
    },
    {
      "title": "Tap your Facebook account.",
      "content": "Tap your Facebook account. You can also select another connected Meta account."
    },
    {
      "title": "Toggle on \"Upload Contacts\".",
      "content": "Toggle on \"Upload Contacts\". The switch will turn green, and a new page will open. You'll be able to find Facebook friends, which will be transferred to Messenger."
    },
    {
      "title": "Tap Continue.",
      "content": "Tap Continue . This is the blue button in the center of the page. Facebook will begin searching for friends to add using your email and phone number. If you don't have a phone number linked to your Facebook account, you can add it ."
    },
    {
      "title": "Tap Add friend.",
      "content": "Tap Add friend . This is the blue button to the right of the person's name. You'll need to wait until the person approves the request. When they do, the person will appear in your friends list on Messenger."
    }
  ]
}