{
  "url": "https://www.wikihow.com/Add-Multiple-Destinations-on-Google-Maps",
  "title": "Google Maps Directions: Adding Multiple Stops to Your Route",
  "steps": [
    {
      "title": "Open Google Maps on your Android, iPhone, or iPad.",
      "content": "Open Google Maps on your Android, iPhone, or iPad. This app icon looks like a multicolored map pin. You'll find it on one of your Home screens, in the app drawer, or by searching."
    },
    {
      "title": "Tap the Directions icon.",
      "content": "Tap the Directions icon. It's a blue circle with an arrow inside. You'll see it at the bottom-right corner of the map."
    },
    {
      "title": "Enter your starting location.",
      "content": "Enter your starting location. By default, Maps will use your device's current location. [1] X Research source You can start at a different location by tapping the \"Your location\" text field and entering the starting address. Tap Choose on map to place a pin on the map you want to use as your starting location."
    },
    {
      "title": "Select your transportation mode.",
      "content": "Select your transportation mode. Once you've selected a destination, you'll see several transportation modes and their estimated times at the top of the map. Choose driving, walking, or biking to be able to add multiple stops. Multiple destinations are not supported for public transit , ridesharing , or flights."
    },
    {
      "title": "Tap the ⋮ (Android) or ••• (iOS) button.",
      "content": "Tap the ⋮ (Android) or ••• (iOS) button. This three-dot button appears to the right of your destination."
    },
    {
      "title": "Tap Add stop.",
      "content": "Tap Add stop . This adds a new line below your first destination."
    },
    {
      "title": "Enter your second destination.",
      "content": "Enter your second destination. Search for an address or landmark, or tap Choose on map to place a pin."
    },
    {
      "title": "Continue adding more stops (if needed).",
      "content": "Continue adding more stops (if needed). You can add up to nine destinations. Each time you add a destination, a new \"Add stop\" line will appear underneath until the limit is reached. To rearrange your stops, drag and drop the two-line place-holder icons that are displayed to the right of the stop's address."
    },
    {
      "title": "Tap Done when you're finished adding destinations.",
      "content": "Tap Done when you're finished adding destinations. You'll see this blue text to the right of the estimated trip time, below the list of stops you've added."
    },
    {
      "title": "Tap Start.",
      "content": "Tap Start . You'll see this at the bottom of your screen and will start navigation. You may see Preview here first. If so, tap it first to preview the route."
    },
    {
      "title": "Go to https://www.google.com/maps on your computer.",
      "content": "Go to https://www.google.com/maps on your computer. The Google Maps site allows you to get directions for a trip that includes up to nine additional destinations."
    },
    {
      "title": "Click the Directions icon on the right side of the search box.",
      "content": "Click the Directions icon on the right side of the search box. This will open the sidebar and allow you to enter a starting location and your first destination. [2] X Research source"
    },
    {
      "title": "Select your mode of transportation.",
      "content": "Select your mode of transportation. Click the icon that describes how you're traveling, e.g., driving, walking, or riding a bicycle. It is not possible to add multiple stops for public transit directions."
    },
    {
      "title": "Enter your starting location.",
      "content": "Enter your starting location. Type an address, business, or landmark, or click a spot on the map. You must enter a starting location before you can add multiple destinations."
    },
    {
      "title": "Enter your first destination.",
      "content": "Enter your first destination. Click the \"Choose destination\" box, then enter a destination just like you did your starting point."
    },
    {
      "title": "Click the + button below the destination.",
      "content": "Click the + button below the destination. This will add a new destination line for your second destination. Make sure that you have both a starting location and a destination set, or the \"+\" will not appear. If you don't see the \"+\" button, you may need to close \"Route options.\" You may also have the wrong travel method selected, as airplanes and transit do not support multiple destinations."
    },
    {
      "title": "Add your next destination.",
      "content": "Add your next destination. Type the address of your second destination into the new field. You'll see your route adjust so that you're taken to your second destination after reaching the first."
    },
    {
      "title": "Repeat for additional destinations.",
      "content": "Repeat for additional destinations. You can continue to add destinations in this fashion until you've completed your trip. You can only specify a single method of transportation for the entire trip. You can set up to ten total stops, including your starting point. If your trip has more destinations, you may have to create multiple maps for your trip."
    },
    {
      "title": "Drag the dots next to each destination to reorder them.",
      "content": "Drag the dots next to each destination to reorder them. You can drag and release the dots next to each destination if you need to reorder your trip. The new route will automatically be calculated."
    },
    {
      "title": "Click the route you want to use.",
      "content": "Click the route you want to use. If there are multiple routes available for your trip, they'll be listed below your destinations, along with each route's total travel time. Click the route to view the turn-by-turn directions. You cannot send a trip with multiple destinations to your mobile device, so this option will be grayed out. Click the \"Print\" button to send the map to your printer. You'll have two options: printing with the map, or printing text directions only. You can also click the Share button and send a link to the map to others via email."
    }
  ]
}