{
  "url": "https://www.wikihow.com/Assemble-a-Senbazuru",
  "title": "How to Assemble a Senbazuru",
  "steps": [
    {
      "title": "Decide on the size and color of your cranes.",
      "content": "Decide on the size and color of your cranes. Think about how you want the completed senbazuru to look. Do you want large cranes or small? Do you want them all to be the same color or would you prefer to mix the shades of the cranes? Traditionally the cranes are made from a square sheet of paper that is 7.5 centimetres (3.0 in) on each side. However, you can make the cranes as large or as small as you choose, if the paper is square in shape. The cranes can all be the same color, multicolored, or you can use patterned paper."
    },
    {
      "title": "Begin with the colored side of the paper facing upwards.",
      "content": "Begin with the colored side of the paper facing upwards. Grab the bottom left corner and fold it up to the upper right corner. The paper should now form a triangle. Crease the paper, and then reopen. [1] X Research source As you make each fold, run your fingernail or a creasing tool, such as a bone folder, along the crease. This will make each fold sharp and crisp, giving a clean, professional finished shape. Fold the bottom right corner up to the upper left corner. The paper should again form a triangle. Crease the paper and reopen it."
    },
    {
      "title": "Turn the paper over and fold it in half.",
      "content": "Turn the paper over and fold it in half. Bring the left side over to the ride side and crease. The paper should be in the shape of a rectangle. [2] X Research source Fold the top of the paper down to the bottom edge. The paper should again form a rectangle. Crease and reopen. The creases in the paper should form an asterisk shape in the paper."
    },
    {
      "title": "Tilt the paper so that it looks like a diamond shape.",
      "content": "Tilt the paper so that it looks like a diamond shape. Make sure the colored side is facing down. When you look at the paper, there should be four smaller diamonds created by the crease lines. [3] X Research source Bring the top point down to the bottom, while folding the left and right corners into the center. This will bring all four corners of the paper together, and will create a small, flat, diamond shape. The end of the diamond closest to you, where all four corners of the paper come together, should be open. It should also have two flaps on the right and two flaps on the lap. There should be a vertical crease down the middle of the diamond."
    },
    {
      "title": "Take the top two layers on the right and fold inwards.",
      "content": "Take the top two layers on the right and fold inwards. Fold the layers to the vertical crease. Repeat with the top two left layers. The top two layers should now form a kite shape, while the bottom layers should still be in a diamond shape. [4] X Research source Turn the paper over and fold the top two layers on the right towards the vertical crease. Repeat with the left layers. The paper should now be a flat kite shape. Take the top triangle (the top of the kite), fold it down, and crease. Open the top triangle back up, and then repeat on the reverse. The paper will be back to a kite shape, but the crease from folding the triangles will act as guides for the next step."
    },
    {
      "title": "Unfold the kite so that the paper returns to a flat diamond shape.",
      "content": "Unfold the kite so that the paper returns to a flat diamond shape. Hold it so that the folds are facing you. Take the bottom flap and push it up; crease on the top of the diamond, using the last completed fold as a guide. [5] X Research source Fold the sides inwards, using the existing creases as guides. Then push the top down and crease. The top layers should now be in the shape of a longer, narrow diamond. Flip the paper over and repeat. The paper should now be a long, narrow diamond. There should a split in the middle of the lower half of the diamond; keep this split facing you."
    },
    {
      "title": "Fold the top layer of the bottom right triangle towards the center line.",
      "content": "Fold the top layer of the bottom right triangle towards the center line. Crease sharply and turn the paper over and repeat. Then, take the top two flaps and pinch them together so that they meet at the fold in the center. Crease sharply and repeat with the lower two flaps. [6] X Research source Turn the paper over and repeat on the other side. The paper should resemble a narrow ice cream cone, with a split in the bottom section."
    },
    {
      "title": "Hold the top layer of the lower point and fold it up over the top crease.",
      "content": "Hold the top layer of the lower point and fold it up over the top crease. Turn the paper over and repeat. All four points should be even, and they should point away from you. [7] X Research source"
    },
    {
      "title": "Hold the top flap and pinch the sides towards the middle.",
      "content": "Hold the top flap and pinch the sides towards the middle. Crease, and then flip the paper over and repeat. Flatten and crease the paper. [8] X Research source Take the triangle on the top layer and fold it down towards you. Turn the paper over and repeat; these folds will create the wings of the crane."
    },
    {
      "title": "Pull the left narrow point to the left.",
      "content": "Pull the left narrow point to the left. Hold the paper under the wings and pull the left point until it is lined up with the edge of the body of the crane. Pinch it and refold it so it stays lined up with the edge. Repeat with the right point but pull it towards the right. [9] X Research source Take the edge of the left point and bend it forward. Crease it sharply. This will form the head of the crane."
    },
    {
      "title": "Repeat the origami steps until you have 1000 cranes.",
      "content": "Repeat the origami steps until you have 1000 cranes. This may take several weeks or even months to complete."
    },
    {
      "title": "Decide how many strands you want to make.",
      "content": "Decide how many strands you want to make. Traditionally, there are 25 strands with 40 paper cranes each. You can divide the 1000 paper cranes any way that you wish, depending on how long you want each strand to be. With 40 cranes on a strand, use 1 metre (3.3 ft) of thread. If you are only putting 20 cranes per strand, use about 0.5 metres (1.6 ft) of string. If you want 10 strands of 100 cranes, you will need about 2.5 metres (8.2 ft) of string or wire. [10] X Research source"
    },
    {
      "title": "Cut a long length of thread according to your desired strand length.",
      "content": "Cut a long length of thread according to your desired strand length. Usually, each strand is about 1 metre (3.3 ft) long. The length depends on how much space you want between each crane. The more space you want to leave, the longer the length of string you will need to use. Also, remember to leave extra string so that you can hang the strand when it is completed. [11] X Research source If you want a much longer strand that will hang almost to the floor, use 2 metres (6.6 ft) or more of the thread. You can make each strand as small as you like, but keep in mind that any string shorter than 0.5 metres (1.6 ft) will not hold many cranes. Line up 40 paper cranes (or the number of cranes you are using per strand) and measure the thread or wire against them. This way you will ensure that there is enough thread or wire to string all the cranes."
    },
    {
      "title": "Thread your sewing needle.",
      "content": "Thread your sewing needle. Place the end of the string or wire through the eye of the needle so that at least 6 inches (15 cm) have passed through the eye. You will use this extra string to hang the strand. [12] X Research source If you are using string, it may be easier if you slightly dampen the end before threading the needle."
    },
    {
      "title": "Tie a bead at the bottom of the thread.",
      "content": "Tie a bead at the bottom of the thread. To prevent the bead from falling off the string, tie a loose knot at the end of the string that is furthest away from the needle. Then pull the needle and thread through the bead, until it is at the end of your string. [13] X Research source"
    },
    {
      "title": "Push the needle through the middle of the body of the crane up to the top.",
      "content": "Push the needle through the middle of the body of the crane up to the top. The crane is now on the string; simply slide it down so that it is next to the bead. [14] X Research source"
    },
    {
      "title": "Add another bead to the string if you're using spacers.",
      "content": "Add another bead to the string if you're using spacers. Pull the needle and thread (or wire) through the hole in the spacer bead. Then slide the spacer bead so that it is next to the crane. Spacer beads are not necessary, but many people find them helpful to prevent the cranes from bunching. [15] X Research source"
    },
    {
      "title": "Repeat the threading process for each paper crane.",
      "content": "Repeat the threading process for each paper crane. If you are using 40 paper cranes per strand, you will repeat these steps 40 times until each crane is on the string."
    },
    {
      "title": "Cut off any excess string or wire.",
      "content": "Cut off any excess string or wire. Leave a minimum of 6 inches (15 cm) of string to hang the strand. If there is more than this at the top of your strand, use the scissors or shears to trim the excess. [16] X Research source If you want your senbazuru to hang longer, you can leave more string at the top. It depends on how long you want the finished product to be."
    },
    {
      "title": "Finish each strand with a bead or charm.",
      "content": "Finish each strand with a bead or charm. When you have strung all the cranes on each strand, you will need to finish it. Add a bead or charm to the top. Loop the thread through the bead, and then tie a knot above the bead. This will prevent the bead, and the cranes, from sliding off the end of the strand."
    },
    {
      "title": "Tie a loose knot or loop at the top of the strand.",
      "content": "Tie a loose knot or loop at the top of the strand. Hang the strand from a hook, nail, chair, or doorknob to keep it neat. [17] X Research source"
    },
    {
      "title": "Tie each strand to a craft ring, pole, or strong wire to display them.",
      "content": "Tie each strand to a craft ring, pole, or strong wire to display them. This will keep all the strands together and make the senbazuru easier to display. Hang the craft ring, pole, or wire wherever you want to display the senbazuru. If you prefer, you can hang each strand individually on the wall or place them in a frame. If you are using the senbazuru as a wedding decoration, you can tie each strand to a pole or strong wire and then hang the wire or pole at the wedding venue. Many people also hang the senbazuru strands from a gazebo or the altar at weddings."
    }
  ]
}