{
  "url": "https://www.wikihow.com/Add-Grammarly-to-Microsoft-Word-on-a-PC",
  "title": "A Step-By-Step Guide to Add Grammarly to Word on PC",
  "steps": [
    {
      "title": "Go to https://www.grammarly.com/ in a web browser.",
      "content": "Go to https://www.grammarly.com/ in a web browser. You can install the Grammarly for Microsoft Office add-in using any web browser on your computer."
    },
    {
      "title": "Scroll all the way to the bottom of the page.",
      "content": "Scroll all the way to the bottom of the page. You will see several columns containing links."
    },
    {
      "title": "Click Grammarly for MS Office.",
      "content": "Click Grammarly for MS Office . It’s under the “Products” header (the first column)."
    },
    {
      "title": "Click Free Download.",
      "content": "Click Free Download . It’s the red button at the center of the page."
    },
    {
      "title": "Create a Grammarly account.",
      "content": "Create a Grammarly account. If you already have an account, click Log in at the top of the screen to sign in now. Otherwise, enter your name, email address, and a password you’ll use to access Grammarly, then click Sign Up ."
    },
    {
      "title": "Download the installer.",
      "content": "Download the installer. After signing up or signing in, the installer should start downloading. If the download doesn’t start, click here under the “Downloading Grammarly for MS Office” header at the top of the screen, and then click Save File (if prompted)."
    },
    {
      "title": "Navigate to your Downloads folder.",
      "content": "Navigate to your Downloads folder. This is where you’ll find the Grammarly installer. A quick way to find the Downloads folder is to press ⊞ Win + E to launch the File Explorer, and then click Downloads in the left panel."
    },
    {
      "title": "Double-click GrammarlyAddinSetup.",
      "content": "Double-click GrammarlyAddinSetup . It’s the file with green icon and a white “G” inside. A security warning will appear."
    },
    {
      "title": "Click Run.",
      "content": "Click Run . This opens the Grammarly installation wizard."
    },
    {
      "title": "Click Get started.",
      "content": "Click Get started . A list of Grammarly products for Microsoft Office will appear."
    },
    {
      "title": "Select Grammarly for Word.",
      "content": "Select Grammarly for Word . You may also see the option to add Grammarly to other Office apps. You can also select those apps if you want."
    },
    {
      "title": "Click Install.",
      "content": "Click Install . The Grammarly add-in will now install to Microsoft Word (and any other apps you selected)."
    },
    {
      "title": "Click Finish.",
      "content": "Click Finish . It’s at the bottom of the “Congratulations” screen you’ll see when Grammarly is finished installing."
    },
    {
      "title": "Open Microsoft Word.",
      "content": "Open Microsoft Word. To do so, click the menu, select All Apps , expand Microsoft Office , and select Microsoft Word ."
    },
    {
      "title": "Click Enable Grammarly to set up Grammarly.",
      "content": "Click Enable Grammarly to set up Grammarly. It’s at the top-right corner of Word. Once you set up and activate Grammarly, you can start using it to check your grammar and spelling in Microsoft Word. [1] X Research source"
    }
  ]
}