{
  "url": "https://www.wikihow.com/Access-Gmail-in-Outlook-2010",
  "title": "How to Access Gmail in Outlook 2010 (And What to Do If You Can’t)",
  "steps": [
    {
      "title": "Sign in to https://www.gmail.com on your computer.",
      "content": "Sign in to https://www.gmail.com on your computer. As of January 2025, IMAP is enabled by default in Gmail. If you prefer to use Gmail as a POP server, you will still need to enable POP in Gmail. [2] X Research source Not sure which to use? Here's a quick description of each: IMAP: This is the most common method to receive email. When you use IMAP, your messages stay in Gmail so you can access them on any device. IMAP will only download your messages when you click them in Outlook, which will be useful if you ever want to access your Gmail through the Gmail website or mobile app. IMAP is enabled by default, but continue with this method to make sure you haven't turned it off. POP: When you use POP to access your Gmail in Outlook, each Gmail message will be downloaded to your PC and erased from Gmail. Once you download the email, it will only exist in Outlook. If you want to use POP, continue with this method. If you've already set up Gmail in Outlook 2010 but it stopped accepting your password, jump down to Fixing Username and Password Not Accepted ."
    },
    {
      "title": "Click the gear icon .",
      "content": "Click the gear icon . It's in the upper-right corner of your inbox."
    },
    {
      "title": "Click See all settings at the top of the menu.",
      "content": "Click See all settings at the top of the menu."
    },
    {
      "title": "Click the Forwarding and POP/IMAP tab.",
      "content": "Click the Forwarding and POP/IMAP tab. It's the horizontal menu that runs across the top of the Settings page."
    },
    {
      "title": "Make sure IMAP is enabled (if using IMAP).",
      "content": "Make sure IMAP is enabled (if using IMAP). If it's currently disabled, select Enable IMAP to turn the feature on. This allows you to check your mail in other apps, including Outlook 2010."
    },
    {
      "title": "Enable POP (if needed).",
      "content": "Enable POP (if needed). If you want to use POP, you can choose whether to enable POP for all mail (including any already in your inbox), or for mail that arrives from now on . If using POP, you can choose what to do with the message once you retrieve it in Outlook. You can opt to keep Gmail's copy in your Inbox (a behavior similar to IMAP), mark Gmail's copy as read, archive Gmail's copy, or delete Gmail's copy."
    },
    {
      "title": "Scroll down and click Save Changes.",
      "content": "Scroll down and click Save Changes . Now that you've made this change, you can start setting up Outlook."
    },
    {
      "title": "Open Microsoft Outlook 2010 on your computer.",
      "content": "Open Microsoft Outlook 2010 on your computer. It'll be in the Microsoft Office folder in the Start menu."
    },
    {
      "title": "Click the File menu and select + Add Account.",
      "content": "Click the File menu and select + Add Account . You'll see + Add Account under \"Account Information.\" This opens the Add New Account wizard. If you already have a Gmail account set up and want to change its settings: Click Account Settings instead. Click Account Settings… Select your Gmail address and click Change . Skip to step 5 ."
    },
    {
      "title": "Select \"Manually configure server settings or additional server types\".",
      "content": "Select \"Manually configure server settings or additional server types\". It's the option at the bottom of the window. Click Next to move to the next step."
    },
    {
      "title": "Select \"Internet E-mail\" and click Next.",
      "content": "Select \"Internet E-mail\" and click Next . It's the first option."
    },
    {
      "title": "Enter your name and Gmail email address.",
      "content": "Enter your name and Gmail email address. Type your name the way you wish it to appear to other people. Then, type your Gmail address into the \"Email address\" field."
    },
    {
      "title": "Select IMAP or POP from the \"Account Type\" menu.",
      "content": "Select IMAP or POP from the \"Account Type\" menu. Choose the type of server you want to use in the \"Server Information\" section."
    },
    {
      "title": "Enter the Gmail server information into the blanks.",
      "content": "Enter the Gmail server information into the blanks. What you'll enter depends on whether you're using POP or IMAP: IMAP The incoming mail server is imap.gmail.com . The outgoing mail server (SMTP) is smtp.gmail.com . POP The incoming mail server is pop.gmail.com . The outgoing mail server (SMTP) is smtp.gmail.com . Type your Gmail address into the \"User Name\" field. Enter your Gmail password into the \"Password\" field."
    },
    {
      "title": "Click More Settings….",
      "content": "Click More Settings… . It's at the bottom-right corner of the window."
    },
    {
      "title": "Click the Outgoing Server tab.",
      "content": "Click the Outgoing Server tab. It's the second tab at the top of the window."
    },
    {
      "title": "Enter information for your outgoing mail.",
      "content": "Enter information for your outgoing mail. The information is as follows: Check the box next to \"My outgoing server (SMTP) requires authentication.\" Select Use same settings as my incoming mail server ."
    },
    {
      "title": "Click the Advanced tab.",
      "content": "Click the Advanced tab. It's the final tab in the window."
    },
    {
      "title": "Enter the required port and authentication information.",
      "content": "Enter the required port and authentication information. If you're using IMAP, the incoming server port should be 993 , and the encryption type should be SSL . [3] X Research source If you're using POP, the incoming server port should be 995 , and the encryption type should be SSL . The Outgoing server (SMTP) port should be 587 , and the encryption type should be TLS . If you have a hard time sending email with these settings, switch the encryption type to SSL and change the port to 465 ."
    },
    {
      "title": "Click OK and then Next to complete setup.",
      "content": "Click OK and then Next to complete setup. Outlook will now attempt to test your account settings. If everything is working properly, you will see a \"Congratulations!\" screen and can start using your account. Click Finish to close the window, and click the Home tab to head to your inbox. If the test is unsuccessful, return to your settings and make sure you've entered everything correctly."
    },
    {
      "title": "Go to https://myaccount.google.com/apppasswords in a browser.",
      "content": "Go to https://myaccount.google.com/apppasswords in a browser. If you get an error like Username and password not accepted or Invalid credentials , you'll be asked to enter your username and password repeatedly. If you're positive your Gmail password is incorrect, you're likely getting this error because Outlook 2010 doesn't have a high enough security level for Gmail. The most secure option is to get a newer version of Outlook, but you may be able to get around the problem by creating an app password for Outlook 2010. [4] X Research source"
    },
    {
      "title": "Log in to your Google account.",
      "content": "Log in to your Google account. Once you're signed in, you'll be taken to the \"App passwords\" screen."
    },
    {
      "title": "Type Outlook 2010 and click Create.",
      "content": "Type Outlook 2010 and click Create . This displays a 16-character app password."
    },
    {
      "title": "Enter the app password into Outlook 2010 when prompted.",
      "content": "Enter the app password into Outlook 2010 when prompted. Just type 16 characters displayed in the window to log in. Your Gmail messages should start to send and receive in a few moments."
    },
    {
      "title": "Allow less secure apps if the problem continues.",
      "content": "Allow less secure apps if the problem continues. If using an app password didn't work, you can try enabling Less Secure Apps for your Google account. This will not work if you have two-step verification enabled for your Google account, and we don't recommend disabling that helpful security feature . Still, if your only option is to use Outlook 2010 to access Gmail via POP or IMAP, this will work for you. You can enable this feature at https://myaccount.google.com/lesssecureapps . Once enabled, generate a new app password, then try to send and receive email via Gmail account. When you enter your 16-character app password, you will be able to check your messages."
    },
    {
      "title": "",
      "content": "If you can't get Outlook 2010 to work with Gmail because of Google's new security features, don't worry—you have plenty of better options: Use the latest version of Outlook (Outlook 365). You won't be able to add a Gmail account if you're using Outlook.com on the web. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Gmail accounts can be added to newer versions of the Outlook app. [6] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Use a free email app that supports OAuth, such as eM Client or Mozilla Thunderbird . Forward your Gmail to another account."
    }
  ]
}