{
  "url": "https://www.wikihow.com/Convert-Percents,-Fractions,-and-Decimals",
  "title": "How to Convert Percents, Fractions, and Decimals",
  "steps": [
    {
      "title": "Move the decimal point two places to the left to convert a percent to a decimal.",
      "content": "Move the decimal point two places to the left to convert a percent to a decimal. Unless otherwise noted, in a percent, the decimal point comes at the end of the last number. For example, envision that 75% actually looks like 75.0%. Moving the decimal point two places to the left converts the percent to a decimal. This is the same thing as dividing the number by 100. Examples: [1] X Research source 75% converts to .75 3.1% converts to .031 0.5% converts to 0.005"
    },
    {
      "title": "Express the percent as a fraction of 100.",
      "content": "Express the percent as a fraction of 100. Writing a number as a fraction of 100 is simply another way to write a percent. The number of the percent becomes the numerator of the fraction and 100 becomes the denominator. Simplify the fraction to its lowest form. [2] X Research source Example: 36% turns to 36/100. To simplify, look for the highest number that goes into 36 and 100. In this case, that would be 4. Determine how many times 4 goes into 36 and 100. When you simplify, the answer would be 9/25. To check that you’ve converted correctly, divide 9 by 25 (0.36) and multiply by 100 (36%). This number should equal your original percent."
    },
    {
      "title": "Remove the percent sign.",
      "content": "Remove the percent sign. Once the percent has been converted to a decimal or fraction, the % sign is no longer appropriate. Remember, percent just means per one hundred, so if you forget to remove the percent sign after converting, your answer will be off by one hundred. [3] X Research source"
    },
    {
      "title": "Multiply the decimal by 100 to change it to a percent.",
      "content": "Multiply the decimal by 100 to change it to a percent. Another way of saying this is to move the decimal point two places to the right. A percent just means “per one hundred”, so the decimal becomes “per one hundred” after being multiplied. Don’t forget to add the percent sign after multiplying. [4] X Research source Examples include: 0.32 becomes 32%, 0.07 becomes 7%, 1.25 becomes 125%, 0.083 becomes 8.3%."
    },
    {
      "title": "Convert a terminating decimal to a fraction.",
      "content": "Convert a terminating decimal to a fraction. A terminating decimal is one that does not repeat. Move the decimal point as many places to the right as you have decimals. This number is now the numerator of the fraction. The denominator is a 1 with as many zeros as you had decimals in the original number. Simplify the fraction at the end. [5] X Research source For example: 0.32 has two decimal places. Move the decimal two places to the right and divide by 100: 32/100. With a common factor of 4, the fraction simplifies to 8/25. Another example: 0.8 only has one decimal place. Move the decimal one place to the right and divide by 10: 8/10. With a common factor of 2, the fraction simplifies to 4/5. To check your work, simply divide out the fraction and make sure it equals your original decimal: 8/25 = 0.32."
    },
    {
      "title": "Change a repeating decimal into a fraction.",
      "content": "Change a repeating decimal into a fraction . A repeating decimal is one that has a sequence of numbers that continually repeat. For example, if the number is 0.131313... there are 2 repeating decimals (13 is repeating). Determine how many repeating decimals there are and then multiply the decimal by 10 n , where n is the number of repeating decimals. [6] X Research source For example, 0.131313... is multiplied by 100 (10 to the power of 2) and we get 13.131313... To determine the numerator (top number), subtract out the repeating portion of the decimal. For example, 13.131313... - 0.131313... = 13, so the numerator is 13. [7] X Research source To determine the denominator (lower number), subtract 1 from the number you multiplied with. For example, 0.131313... was multiplied by 100, so the denominator is 100 - 1 = 99. The final fraction for 0.131313… is 13/99 Additional Examples: 0.333... becomes 3/9 0.123123123... becomes 123/999 0.142857142857... becomes 142857/999999 If necessary, take the fraction to the lowest term. For example, 142857/999999 becomes 1/7."
    },
    {
      "title": "Divide the numerator by the denominator to change the fraction to a decimal.",
      "content": "Divide the numerator by the denominator to change the fraction to a decimal . Interpret the fraction bar to mean \"divided by\". This means for any fraction x/y, it is the same as saying x divided by y. [8] X Research source For example: The fraction 4/8 yields the decimal 0.5."
    },
    {
      "title": "Determine the number of decimal points.",
      "content": "Determine the number of decimal points. Many numbers don’t divide evenly into each other. When you divide them, you have to decide how many decimal places you want to give in your answer. Oftentimes, the standard is two places. Remember the rules of rounding when truncating a fraction: if the next number is a 5, round the previous number up. For example, 0.145 rounds to 0.15. For example: The fraction 5/17 yields the decimal 0.2941176470588… The final decimal can be written simply as 0.29."
    },
    {
      "title": "Divide the fraction and then multiply by 100 to change to a percent.",
      "content": "Divide the fraction and then multiply by 100 to change to a percent. Just as you did to convert the fraction to a decimal, divide the numerator by the denominator. Multiply the resulting decimal by 100 and add a percent sign to finish the conversion. [9] X Research source If you had 4/8, dividing 4 by 8 would give you .50, then multiplying that number by 100 would give you 50. Adding a percent sign gives you your final answer by 50%. Additional Examples: 3/10 = 0.30 * 100 = 30% 5/8= 0.625 * 100 = 62.5%"
    }
  ]
}