{
  "url": "https://www.wikihow.com/Broken-Vessel-Hollow-Knight",
  "title": "How to Defeat the Broken Vessel in Hollow Knight",
  "steps": [
    {
      "title": "Dodge the slam move and get some hits in.",
      "content": "Dodge the slam move and get some hits in. The Vessel starts with a slam attack where they jump up, pause, and pound the ground—sending infection blobs out the edges of the room. Stand near the Vessel when they’re in the air, just to the side of wherever they’ve jumped. When they land, get in 3-4 attacks. Get some early damage in. If you have already tried to fight the Vessel once already, fire your ranged attack as soon as you walk in past the edge of the room to sneak in some early damage as the Broken Vessel “wake-up” animation plays. [1] X Research source"
    },
    {
      "title": "Wait out the flail move.",
      "content": "Wait out the flail move. The Vessel usually moves into a flail attack where they swing their nail back and forth 4 times. You can’t stand in melee range here, so wait the attack out. A solid time to heal: You can normally get a heal off during the flail attack if you start channeling it right when the flail animation starts. You can throw a few ranged attacks at the Vessel when they’re in flail if you aren’t worried about saving the soul for heals later."
    },
    {
      "title": "Jump over the dash and slash attack.",
      "content": "Jump over the dash and slash attack. The Vessel’s slash and dash attack is a fast dashing move where they swing their nail horizontally. Jump over any dashes the Broken Vessel performs. Downslash your heart out. One of the best ways to speed through this fight is to use your bunny-hop downslash ability during the slash and dash moves. You’ve seen this attack before! This dash attack is basically identical to Hornet’s dashing attack and the sideways slash attack you faced when beating The Mantis Lords. Want to get really aggro? Dash in the air towards the landing spot at the opposite end of the map as the Vessel finishes their move. Get 2-3 hits in before dashing out."
    },
    {
      "title": "Dodge any leaps where there is no pause in the animation.",
      "content": "Dodge any leaps where there is no pause in the animation. Broken Vessel’s slam attack has a pause in the animation. The leap has no such pause. Dodge whenever the Vessel begins falling down towards you. There aren’t a whole lot of good attack options during this move, but feel free to try and get a hit off if you know you’re out of their way as they land. Note that there are two leaps: The Vessel will either jump up and down straight in the air, or jump at an angle to land on top of you."
    },
    {
      "title": "Stay on the ground during the aerial dash and slash.",
      "content": "Stay on the ground during the aerial dash and slash. The aerial dash and slash is identical to the normal dash and slash, except the Vessel does it in the air. Don’t jump and you’ll be fine. Get more damage in. Upslash multiple times while they’re dashing over you. They’ll never end this attack prematurely, so it’s free damage. Then, try to dash towards the landing location and get another 2-3 hits in before dashing away again. Note the height of the jump! Vessels slam attack and leap both take place much higher in the air than the aerial slash and dash. If the Vessel jumps only slightly off the ground and pauses in mid-air, they’re about to slash and dash."
    },
    {
      "title": "Survive the three cascade attacks.",
      "content": "Survive the three cascade attacks. Broken Vessel will perform the cascade attack three times over the course of the fight whenever you drop them below 1/3 of their health, which makes it a good “bookmark” to see how you’re doing in the fight. Broken Vessel jumps in the middle of the arena and shakes their head back and forth. Then, they release dozens of infected bubbles in the air. Dodge these bubbles. You’re best off around the edges. Based on the slam move bubbles, you may be tempted to stand next to the Vessel while they perform the cascade. You’ll almost always get burnt doing this. Your odds are best trying to maneuver around the rim of the map. Don’t stand still. Sometimes, this attack can kind of look like you’re best off standing on the rim of the map. If you want to avoid getting hit, this isn’t the way to go. There’s no “safe” spot here—you have to keep moving and dodging the infected bubbles. You get time to heal at the end. There’s a big pause at the end of cascades. You should be able to heal twice if you time it right."
    },
    {
      "title": "Kill the random infection “ghost” bubbles.",
      "content": "Kill the random infection “ghost” bubbles. Independent of all of Broken Vessel’s moves, they will randomly generate a ghost bubble that floats around the map. These only have 1 HP, so try to kill them whenever they float close. You can outlive these little guys—they’ll pop on their own after a while—but it’s usually better to just hit them once and buy yourself more time to whittle down Broken Vessel’s health."
    },
    {
      "title": "Defender’s Crest",
      "content": "Defender’s Crest Defender’s Crest causes you to emit a “foul odor” that deals a little bit of AOE damage. It’s normally not a top tier charm, but it’s perfect for the Broken Vessel fight because it kills all of the ghost bubbles. This dramatically streamlines the fight by getting rid of the only random variable so that you can focus on the Vessel, not the bubbles. If you don’t have Defender’s Crest yet, Spore Shroom is a good alternative."
    },
    {
      "title": "Quick Focus",
      "content": "Quick Focus Quick Focus is basically always useful. It makes focusing soul 33% faster. Since your healing windows are relatively limited in the Broken Vessel fight (you basically can only heal after cascade or during flail), Quick Focus will give you more opportunities to regain health. [2] X Research source"
    },
    {
      "title": "Stalwart Shell",
      "content": "Stalwart Shell If you had to pick one charm to bring into every boss fight in the game, it’s Stalwart Shell. It increases your invincibility frames and minimizes how much your hits recoil. It’s a great all-around charm for Broken Vessel (as it is with the other boss fights)."
    },
    {
      "title": "Quick Slash",
      "content": "Quick Slash Another great general charm, Quick Slash makes attacking faster. Broken Vessel is a fight where you don’t get a lot of “easy attack” time, so Quick Slash will make you much more efficient in combat."
    },
    {
      "title": "Mark of Pride",
      "content": "Mark of Pride This charm is perfect for boss fights that take place in closed spaces, which definitely includes Broken Vessel. Mark of Pride increases your nail’s range by 25%, which simply makes the fight a lot easier. If you only have Longnail , which is the weaker version of this charm, feel free to use that instead."
    },
    {
      "title": "Grubsong",
      "content": "Grubsong Grubsong gives you soul whenever you get hit. It’s not a great charm compared to other options, but if you find yourself getting killed over and over again in the Broken Vessel fight, this is a good “stay alive” option. [3] X Research source"
    },
    {
      "title": "Take the tram in Deepnest to Ancient Basin.",
      "content": "Take the tram in Deepnest to Ancient Basin. You need the tram pass to activate the tram. It’s in the northern portion of Deepnest to the left of the uppermost bench. Alternative route: You can also get to the Ancient Basin by crossing the collapsed bridge in the Royal Waterways."
    },
    {
      "title": "Drop down and go west, a little bit past the toll bench.",
      "content": "Drop down and go west, a little bit past the toll bench. There’s a large, horizontal chamber on the left side of the map. Keep going left. There is a U-shaped corridor along the way that dips below the area just to the right of the Broken Vessel. There’s a Simple Key down there."
    },
    {
      "title": "Approach the wall with the open gate.",
      "content": "Approach the wall with the open gate. The gate will shut down automatically once the broken vessel fight starts."
    },
    {
      "title": "Continue going left after killing the broken vessel.",
      "content": "Continue going left after killing the broken vessel. The Monarch Wings, which allow you to double-jump, are located at the end of the hall behind the Vessel’s corpse. Come back with the dream nail! Eventually, you’ll unlock the dream nail. When you do, come back to the Broken Vessel and hit the corpse with the dream nail to start a hidden boss battle!"
    }
  ]
}