{
  "url": "https://www.wikihow.com/Communicate-With-a-Deaf-and-Blind-Person",
  "title": "How to Communicate With a Deaf and Blind Person",
  "steps": [
    {
      "title": "Know that there are a variety of degrees of deaf-blindness, or dual-sensory loss.",
      "content": "Know that there are a variety of degrees of deaf-blindness, or dual-sensory loss. People with extremely limited sight and hearing can also be considered deaf-blind. Some people with dual-sensory loss may still have some vision or hearing, however limited. They may still be able to speak or read in certain instances. On the flip-side, communication may be limited or restricted to expression of physical needs. People who are unable to communicate are not dumb, but instead hold a great deal of potential for personal development. Congenital deaf-blindness is when a person is born without hearing and sight. This, depending on the level of auditory/visual loss and other factors like environment and other conditions, could greatly affect the individual's communication and basic self-care skills. Acquired deaf-blindness is developed later in life, through an injury, illness, or age. People who have had the opportunity to undergo a \"normal\" childhood are often more adaptable to different methods of communication, especially those involving knowledge such as spelling, a concept of labelling, space and of communication itself. Congenital deafness/acquired blindness is when someone is born deaf and loses their sight later in life due to injury, age, or illness. Congenital blindness/acquired deafness happens when someone is born without sight, and then later loses their hearing due to injury, illness, or age."
    },
    {
      "title": "Be aware that there are a variety of techniques used to communicate by and with people who are deaf and blind.",
      "content": "Be aware that there are a variety of techniques used to communicate by and with people who are deaf and blind. Each person is different. Because there is so much variance in the degree of sensory loss, and because overcoming these limitations is a massive challenge, there is much variance in the ways the deaf and blind navigate communication, including: Speech Written communication Graphic and non-tactile symbols Tactile symbols and object cues Gestures/movement cues Facial expressions or noises which indicate a feeling or opinion Manual sign language Tactile sign language Braille Touch cues Symbolic action (e.g. taking you to the tap for a drink)"
    },
    {
      "title": "Prepare to face miscommunication.",
      "content": "Prepare to face miscommunication. In certain cases, it may not be possible for the general public to communicate with the deaf-blind. It is not uncommon for trained communication partners to have difficulty or even fail entirely to communicate effectively with their deaf-blind partner. Frequently, people who are unable to properly communicate with the deaf-blind choose to ignore the communication or the person altogether. Do not do this, but rather, see if there is someone else who can understand what the person is trying to express or a different method of doing so. Do not give up."
    },
    {
      "title": "Take the deaf-blind person's hands.",
      "content": "Take the deaf-blind person's hands. Hands are the ears, eyes, and voice of many people who are both deaf and blind. Being hand-in-hand allows for continued communication through the physical connection. A person who is deaf and blind may not realize you are trying to engage him. Taking his hands enables him to experience your attempt to interact and communicate to him and to connect together physically."
    },
    {
      "title": "Seek medical advice about both senses.",
      "content": "Seek medical advice about both senses. Be open to anything the medical experts can recommend. Even a small improvement can improve the quality and/or quantity of sight and/or hearing, which in turn could improve communication. Be especially pushy about assessment and action if the deaf-blind individual is a child, as this is the critical period (most important time) for development and will affect the child's communication for the rest of their life. If possible, get the medical practitioner to test the type of hearing loss the individual has. Different hearing aids may have varying levels of success depending on where the problem in hearing lies. As well as typical inner-ear hearing aids, ask about bone-conducting hearing aids, which can be fitted on headbands and glasses for ease of wearing. Tests should ideally be conducted several times, especially if communication is a considerable issue. This ensures that results are accurate, rather than representing a day when the person was not feeling communicative."
    },
    {
      "title": "Look for a communication partner.",
      "content": "Look for a communication partner. In some cases, people with dual-sensory loss are accompanied by a partner trained to facilitate communication for the deaf-blind. This person will have sometimes formal education in deaf-blind communication, and will have developed rapport. It has been shown that the level of education in deaf-blindness has the greatest impact on communication with the deaf-blind."
    },
    {
      "title": "Look for more subtle cues.",
      "content": "Look for more subtle cues. The person may try to communicate with you without using a communication partner. These may include hints in the form of: Changes in body language Pre-written notes or cards Recordings or utterances Changes in the person's breathing Changing facial expressions Physical actions (such as taking you to the fridge for food) If they reach for your hands, this could be an attempt to communicate."
    },
    {
      "title": "Take any card or note that is provided to you, so that the person knows you have received the message.",
      "content": "Take any card or note that is provided to you, so that the person knows you have received the message. Then hand it back, unless instructed otherwise. A person who is deaf-blind might communicate using written messages or pre-recorded messages. These are used to convey essential information about their activities. [1] X Research source"
    },
    {
      "title": "Be patient.",
      "content": "Be patient. Communication for the deaf-blind can be extremely difficult. The person may need considerably more time than you are used to in order to express what he is trying to say. By giving him the time to fully convey or to try different ways to express the idea, you can help facilitate interaction."
    },
    {
      "title": "Use sign language if they do.",
      "content": "Use sign language if they do. Sign language comes in a variety of forms. Many people know the tactile finger-spelling signs, as well as some basic adapted American Sign Language. For people who do not know either, it is possible to use the POP, or Print On Palm, method, by using your index finger to trace the letters on a blind and deaf person's palm. Memorize the finger-spelling hand signs . Take an ASL ( American Sign Language ) class. Consider learning finger braille, a modern, Japanese way of signing with your fingers."
    },
    {
      "title": "Use tadoma if they do.",
      "content": "Use tadoma if they do. Tadoma is a method of communicating with the blind and deaf whereby their hands are placed on the lips of the speaker. The person with dual-sensory loss feels out the shape of the words as you say them. This is similar to lip reading. Not all people who are deaf-blind can use tadoma, and not everyone will be comfortable with another person placing a hand on their mouth. [2] X Research source"
    },
    {
      "title": "Wait at least five seconds before prompting for response.",
      "content": "Wait at least five seconds before prompting for response. Studies show that waiting five, ten, and fifteen seconds all were measurably more useful in communication with the deaf-blind. A zero to one second wait before prompting for a response is too short."
    },
    {
      "title": "Learn to use Braille if they do.",
      "content": "Learn to use Braille if they do. There are devices called braillers that allow you to type out a message for a blind person to read. Sometimes these can be very expensive, and you might think of also getting a (cheaper) braille label printer. Companies are even developing braille technology for smartphones."
    },
    {
      "title": "Be patient and don't give up.",
      "content": "Be patient and don't give up. If your deaf-blind loved one doesn't use any of these methods, be sensitive to their needs and persist with what works for them. Spend time with your loved one so that you can pick up even a subtle change to their demeanour, behaviour and communication patterns. Enthusiastically and overtly encourage any and every small communication success they have with them. Rome wasn't built in a day. Talk to their teachers or other people who spend time with them. If they're in education (of any shape or form) then there ought to be goals for the individual - or at least specific lessons. If they're not in education, you could seek it, or seek an expert. Alternatively, you could come up with some simple things yourself. Try accompanying one specific command with a sign if you think they might be able to see you. Repeat the sign every time you ask that of them, until they can anticipate what you will be doing with them from the sign. Maintain a healthy routine which enriches their life, because at the end of the day, your loved one's happiness is more important than any amount of communication."
    }
  ]
}