{
  "url": "https://www.wikihow.com/Clean-Plastic-Containers",
  "title": "How to Clean Plastic Containers",
  "steps": [
    {
      "title": "Remove the lid from the container.",
      "content": "Remove the lid from the container. After you pop it open, check to make sure there are no remnants of food left inside. Give the container a quick preliminary rinse with hot water. Drain and shake out the excess water and place the container on the kitchen counter. If there’s any dried or sticky residue inside the container, it may help to wipe it out with a paper towel before you begin cleaning."
    },
    {
      "title": "Fill the container with vinegar.",
      "content": "Fill the container with vinegar. For best results, use pure distilled white vinegar. If most of the stains are concentrate around the bottom, you’ll only need to add in an inch or two; if they reach up the sides, fill it to the top. Place the lid back on the container to keep the vinegar from spilling. [1] X Research source Vinegar is strong enough to make an effective cleaner and disinfectant, but not so strong that it needs to be cut it with water. If you don’t happen to have any vinegar handy, try using a little diluted rubbing alcohol or hand sanitizer. The alcohol in these products will produce an effect similar to the vinegar. [2] X Research source"
    },
    {
      "title": "Let the vinegar soak for 30 minutes.",
      "content": "Let the vinegar soak for 30 minutes. As it soaks, the acidity of the vinegar will help break down any discoloration present while neutralizing persistent odors. It will also help clear away hard water deposits from previous washings. For heavier messes, you can leave the vinegar in the container for an hour or longer before cleaning it out by hand. [3] X Research source Vinegar is naturally antimicrobial, which makes it useful for killing the bacteria that’s had time to begin growing on old food. Adding a squeeze of fresh lemon juice can help brighten dull, discolored plastic and leave it smelling more pleasant. [4] X Research source"
    },
    {
      "title": "Scrub the container vigorously.",
      "content": "Scrub the container vigorously. Once half an hour has elapsed, lift the lid and pour out the vinegar. Then, squirt a few drops of liquid dish detergent into the container and go over the inside using a kitchen sponge or stiff-bristled nylon dish brush. The rough surface of the scrubber should be enough to deal with any remaining stains. [5] X Research source You may not be able to erase certain stains (like the infamous tomato sauce) entirely. Once these have set up in the plastic, it can be nearly impossible to get them out. [6] X Research source Avoid scouring the container with anything more abrasive than a sponge. A device like steel wool or pumice stone may leave behind scratches in the plastic."
    },
    {
      "title": "Make a paste from baking soda and water.",
      "content": "Make a paste from baking soda and water. Sprinkle two tablespoons of baking soda into half a cup (120ml) of warm water. Stir the two ingredients together with a spoon until they’re about the same consistency as peanut butter. If the paste seems too thin, add a little more baking soda. If it’s too thick, stir in another half ounce of water at a time until you achieve the desired texture. [7] X Research source Baking soda is prized for its ability to cut through stains and absorb unwanted odors. It’s also slightly astringent, which will come in handy when it comes time to scrub the container. [8] X Research source It may be necessary to mix a bigger batch of baking soda paste if you’re trying to clean multiple (or especially large) containers."
    },
    {
      "title": "Spread the paste over the inside of the container.",
      "content": "Spread the paste over the inside of the container. Coat the walls of the container with a thin layer of the baking soda paste. Scoop whatever is left into the bottom. Try to use all of the mixture. [9] X Research source The paste will have an easier time sticking if the inside of the container is completely dry."
    },
    {
      "title": "Allow the paste to work overnight.",
      "content": "Allow the paste to work overnight. Put the lid on the container and find an out of the way place to leave it. As it sits, the combination of baking soda and water will begin chipping away at messes that have taken hold in the plastic without the need for scouring or scrubbing. In the morning, you can come back and observe the results of the baking soda. [10] X Research source Make sure you give the paste at least an hour or two to take effect."
    },
    {
      "title": "Rinse with hot water.",
      "content": "Rinse with hot water. Remove the lid and clear the container, using the corner of a washcloth to scrape out the rest of the baking soda. The container should now be stain and odor-free. If you want, you can go one step further and wash it out with soapy water. [11] X Research source Keep rinsing the container until the water runs clear. [12] X Research source Use baking soda periodically to restore old and heavily-used containers."
    },
    {
      "title": "Dry the container completely.",
      "content": "Dry the container completely. After cleaning, drain all water from the container and wipe it down inside and out with an absorbent towel. You can also simply leave it sitting with the lid off and allow it to air dry. Whichever method you choose, the lid should stay off until all moisture has evaporated from inside. [13] X Research source Replacing the lid on a plastic container while it's still wet can cause mold and mildew to develop."
    },
    {
      "title": "Mix together a small amount of bleach and warm water.",
      "content": "Mix together a small amount of bleach and warm water. Run a cup (240ml) of water into a glass measuring cup, then funnel in one tablespoon of bleach. Whisk the liquids together lightly. For your own safety, be sure to wear rubber gloves any time you’re working with bleach. [14] X Research source Chlorine bleach is a highly-toxic chemical that can be extremely harmful if it’s accidentally ingested or comes into contact with your skin. [15] X Research source Due to the hazards that bleach presents, this solution is best reserved as a last ditch effort for when other cleaning methods are unable to cut it."
    },
    {
      "title": "Pour the bleach solution into the container.",
      "content": "Pour the bleach solution into the container. Do this carefully to avoid spills or splashes. Once you’ve got the bleach inside, close the lid and give the container a gentle shake. Then, set it aside and allow the stain-fighting chemicals to begin working their magic. Leave the bleach-filled container somewhere that it won’t be mistaken for something else. Never mix bleach with any other cleaners, chemical or natural. [16] X Research source"
    },
    {
      "title": "Let the container soak for 1-2 hours.",
      "content": "Let the container soak for 1-2 hours. Bleach is exceptionally potent, so this will likely be all that’s needed to do away with even the worst odors and discoloration. Avoid moving or otherwise handling the container unnecessarily while there's bleach inside. [17] X Research source Set a timer so that you don’t forget to empty the container. If you leave the bleach in there for too long, it can eventually eat away at the plastic. If the lid of the container is also stained, you can place it in the sink and pour a small amount of the bleach solution over it. [18] X Research source"
    },
    {
      "title": "Wash out the container thoroughly.",
      "content": "Wash out the container thoroughly. Pour the bleach down the drain and rinse out the container with fresh, clean water. Squeeze in some dish soap and work it around with a soft kitchen sponge or washcloth until you’re satisfied that no oily residue or bleach remains. When you’re finished, your plastic containers should sparkle like new! [19] X Research source Most plastics are somewhat porous. For this reason, it’s important that you wash the container as usual after treating it with bleach to make sure that none of the chemical remains. [20] X Research source Continue washing the container until you can no longer detect the smell of bleach."
    }
  ]
}