{
  "url": "https://www.wikihow.com/Clean-a-Bicycle-Chain",
  "title": "How to Clean a Bicycle Chain",
  "steps": [
    {
      "title": "Secure your bike.",
      "content": "Secure your bike. A kickstand won't likely be good enough to hold your bike in place while you're working on it. A jostle or a bump could knock your bike on the ground and cause damage. If possible, use a bike stand that securely holds your bike, lean your bike against a wall, or set your bike upside down on the ground so it rests on the seat and handlebars. Having your bike oriented wheels upward is a definite bonus. This will make the chain and drivetrain of your bike more accessible, raising it up to a level more comfortable for you to work and inspect. A bike stand is a simple holder for your bicycle that you can buy or build from scrap parts. It usually consists of hooks attached to a frame. You should hang your bike by the wheels on the hooks, but be careful as you do. Cheap bike stands might not be very sturdy. [1] X Research source"
    },
    {
      "title": "Evaluate the state of your chain.",
      "content": "Evaluate the state of your chain. If you notice your bike chain is excessively dirty and grimy, with a crust of dirt and environmental gook, it's probably time to clean your chain. Regular cyclists will likely want to perform a chain cleaning once every week, or at least once every 200 miles (321 km). [2] X Research source A quick eye inspection should be enough to tell if your chain needs cleaning. However, if you are unsure, feel the chain with your fingers. If it feels as though the chain is caked or that its movement is limited by grime, it's time to clean. Preventative maintenance can prolong the life of your chain and keep your sprockets in good condition. By cleaning your chain regularly, you'll also be aware of changes that happen in your chain over time, like chain stretch or damaged links. While checking the state of your chain, you'll have an excellent opportunity to find the master link for the chain. The master link, like a Connex or SRAM Powerlink link, allows you to easily remove your chain from the drivetrain. Most have a pin/slot configuration where you can slide a small pin out of a slot to open the link and remove the chain. [3] X Research source If does not have a master link, you can install one of these yourself or have it done a local bicycle shop. This is usually fairly inexpensive, generally costing around $15 or less."
    },
    {
      "title": "Examine your drivetrain.",
      "content": "Examine your drivetrain. Especially if you're inexperienced when it comes to bicycle maintenance, it's important to have a good idea of how the chain functions and how it fits in the drivetrain of your bike. The drivetrain connects the motor, in this case you, to the wheels of your bike. Your chain fits into the drivetrain, transferring the force of your pedaling to the wheels. More complex/variable gear bikes might have complicated gear-shifting mechanisms at the wheels. You might want to take a few pictures with your cell phone of of these parts so you have a reference when it comes time to reattach your chain. [4] X Research source [5] X Research source"
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. Most of these are household items, but you might have to go to your local bike shop or hardware store to purchase a few, like a quality bicycle chain lubricant. Having your supplies on hand will make this job easier. In all, you'll need: A clean rag A quality bike chain lubricant A quality degreaser or isopropyl alcohol A wire clothes hanger Gloves (optional) 1 bottle [6] X Research source [7] X Research source"
    },
    {
      "title": "Wipe the chain with isopropyl alcohol on a rag for a quick clean.",
      "content": "Wipe the chain with isopropyl alcohol on a rag for a quick clean. Pour enough isopropyl alcohol onto a rag to wet it. Then, hold the rag against the chain. As you do so, pedal the bike slowly to move the chain across the rag. This is all you need to do to clean a bike chain in most situations. However, you can do a deeper clean, if desired."
    },
    {
      "title": "Fill a bottle with degreaser if you're planning to soak the chain.",
      "content": "Fill a bottle with degreaser if you're planning to soak the chain. To deep clean your chain, soak it first in a degreaser and then wipe away any remaining grime with a cloth. Fill enough degreaser in one bottle to completely immerse your chain. For excessively dirty chains, you may want to do a double rinse with your degreaser. To most efficiently do this, prepare another bottle with degreaser in the same fashion as you did the first. Your first rinse in degreaser will be quick, breaking up heavy grime. The second bottle can be used to soak the chain for deep cleaning. If you don't have a degreaser formulated for bicycle chains available, you can use an equivalent found in your home, though these might not be as strong or fast acting. Some options include paint thinner, kerosene, and isopropyl alcohol. [8] X Research source"
    },
    {
      "title": "Remove the chain from your bike.",
      "content": "Remove the chain from your bike. Since you scoped out the position of your master link while examining your chain, you should be able to easily find it again. Slide the pin holding the link closed out of its slot to open the master link. Once the master link is open, you should be able to easily pull the chain free by feeding it through the drivetrain. To prevent damage to the shifting mechanisms and sprockets of your bike, use firm but gentle pressure to remove it from the drivetrain. Yanking on your chain to tear it free can do damage to your bike. [9] X Research source"
    },
    {
      "title": "Degrease your chain.",
      "content": "Degrease your chain. Put your chain in the bottle containing degreaser and then put the lid on the bottle. Shake the bottle for several minutes to ensure the degreaser breaks up even the thickest, most stubborn film on your chain. For best results, after shaking you should allow your chain to soak for up to 20 minutes. Keep in mind that this will remove even the factory wax off of the chain, so you will need to lubricate the chain well after you are done. Allow your chain to soak give your degreaser time to work its way into the nooks and crannies between the links of your chain. Soaking also give your degreaser time to break up thick or stubborn grime. [10] X Research source"
    },
    {
      "title": "Remove the chain from the bottle and wipe it off.",
      "content": "Remove the chain from the bottle and wipe it off. To prevent getting your hands and clothes dirty with harsh degreaser, you can use a coat hanger to hook your chain and pull it free of the degreaser bottle. Wipe away the degreaser and any excess gunk with a dry rag. [11] X Research source Slide your chain through the rag and use your hand to apply pressure it to ensure the chain is free of degreaser. Make sure to relubricate the chain if you soaked it for a long time."
    },
    {
      "title": "Place your chain back in the drivetrain",
      "content": "Place your chain back in the drivetrain . There are many different kinds of bicycle, so particulars of how you reattach your chain will be unique to your bike. Use the pictures you took with your phone of the wheel mechanisms to insert your chain into the drivetrain properly. If you struggle reattaching your chain even when consulting the pictures you took of the drivetrain, its likely you can find a tutorial or manual for your bicycle online. Do a quick Internet search, and use the tutorial/manual to reattach your chain."
    },
    {
      "title": "Reattach your master link.",
      "content": "Reattach your master link. It'll be easiest to reconnect your master link if the ends of your bike chain meet at the midpoint between your wheels. To ensure this, you may want to lay and thread your bike chain into the drivetrain with one end extending to either the top- or bottom-middle point between your wheels. Slide the pin of your master link back into its slot to complete the master link and reconnect your chain. Feel the master link with your fingers to make sure it is properly fastened. If the link is skewed, sitting unevenly in its slot, it could warp."
    },
    {
      "title": "Lubricate your bicycle chain",
      "content": "Lubricate your bicycle chain . A good quality lubricant will help your bike chain run smoothly, but will also help protect it from the elements. Hold your bottle of lubricant above the top-middle point of the chain and squeeze out a thin, steady stream, spinning your pedals as you do so to move the chain. When you have completed a full revolution of the chain, your bike chain will be fully lubricated and ready to ride. [12] X Research source [13] X Research source"
    }
  ]
}