{
  "url": "https://www.wikihow.com/Contact-the-FBI",
  "title": "How to Call the Federal Bureau of Investigation (FBI)",
  "steps": [
    {
      "title": "Dial 1-800-CALL-FBI (1-800-225-5324) to report any information.",
      "content": "Dial 1-800-CALL-FBI (1-800-225-5324) to report any information. This is the FBI’s general tip line, where you can report anything you find relevant or concerning to a live operator. The number is available 24/7, every day of the year. If you are in an emergency situation, call 911. The FBI will get involved later down the line if the emergency ends up being relevant to their enforcement purview."
    },
    {
      "title": "Use the online tip form for written tips.",
      "content": "Use the online tip form for written tips. Information submitted via the \"FBI Tips and Public Leads\" form will be reviewed as soon as possible by an FBI agent or professional staff member. Note that you may not get a reply to your submission due to the large volume of submissions the FBI receives. Provide as much detail as possible when filling out the form."
    },
    {
      "title": "Email or call your local FBI field office.",
      "content": "Email or call your local FBI field office. Find contact info for your local FBI branch here . The FBI has 55 field offices in the U.S. and in the U.S. territory of Puerto Rico, as well as dozens more offices attached to U.S. embassies around the world. You can contact your nearest office with information on possible criminal activity. If you want to email the FBI, you will need to contact a field office, as the FBI has no central email address. Each branch also has its own phone number and address for letters. Each field office has a special agent in charge of the branch."
    },
    {
      "title": "Write to the FBI headquarters in Washington, D.C. for special questions.",
      "content": "Write to the FBI headquarters in Washington, D.C. for special questions. Though it is more efficient to submit a tip form or contact a local office, you can also call the FBI headquarters with a tip or complaint about criminal activity if you prefer to use that office specifically. The phone number is 202-324-3000, and the address is: FBI Headquarters 935 Pennsylvania Avenue, NW Washington, D.C. 20535-0001"
    },
    {
      "title": "Call the Major Case Contact Center (MC3) at 1-800-225-5324 for ongoing cases.",
      "content": "Call the Major Case Contact Center (MC3) at 1-800-225-5324 for ongoing cases. If you don't know what number to call to report a crime, then try the MC3 at 1-800-225-5324 (1-800-CALLFBI). Also use this number to respond to local or national requests for information put out by the FBI. [2] X Research source"
    },
    {
      "title": "Report a missing child or child exploitation at 1-800-843-5678 (1-800-THE-LOST).",
      "content": "Report a missing child or child exploitation at 1-800-843-5678 (1-800-THE-LOST). The FBI Child Exploitation Task Force works with the National Center for Missing and Exploited Children to investigate missing or sexually exploited children. If your child is missing, a child you know goes missing, or you suspect a child of being sexually exploited, you should contact the FBI immediately at any time of day. [3] X Research source You can also use the cyber tip line if you don’t need to make an emergency call. Contact the Child Exploitation Task Force officer at your local FBI field office . Contact the State Department if your child has been abducted and taken out of or into the United States by the other parent. From the U.S. and Canada, call 1-888-407-4747. From abroad call 1-202-501-4444. If you need to contact the National Center for Missing and Exploited Children, but the need is not an emergency, you can call 703-224-2150 or use their online contact form ."
    },
    {
      "title": "Call your local field office and 1-888-373-7888 for human trafficking.",
      "content": "Call your local field office and 1-888-373-7888 for human trafficking. Both the illegal smuggling of people across borders and the enslavement of people forced to work in prostitution or grueling conditions are investigated by the FBI and the Human Smuggling Trafficking Center. If you know of human trafficking or are a victim of it: Call the National Human Trafficking Resource Center at 1-888-373-7888. [4] X Research source Contact your local FBI field office . Submit an online tip ."
    },
    {
      "title": "Report cybercrimes to the Internet Crime Complaint Center (IC3) online.",
      "content": "Report cybercrimes to the Internet Crime Complaint Center (IC3) online . Internet crime primarily refers to hacking, online scams, and email hoaxes, including advance-fee schemes, non-delivery of goods or services, and business opportunity schemes. You can file a complaint so long as one of the two parties (the victim or person who defrauded them) is located in the United States. File your complaint at the IC3 site . You will be asked to include: [5] X Trustworthy Source Internet Crime Complaint Center Online reporting system for individuals to inform the FBI about Internet-related criminal activity Go to source Your name Your mailing address Your telephone number Name, address, and telephone number of the person or business that defrauded you Website and email address of the person or business that defrauded you Details on how you were defrauded"
    },
    {
      "title": "Report suspicious activity involving chemicals at 855-835-5324.",
      "content": "Report suspicious activity involving chemicals at 855-835-5324. This is the number if you have any concerns involving chemical, biological, or radiological crime. You might be being targeted for attack or the theft/purchase of raw materials if: [6] X Research source You are getting calls asking about your use of security guards, operating hours, or your total number of employees. You have received recent bomb threats . People are asking about your products but cannot explain what they will use them for. Potential customers are willing to pay cash for large orders. Potential customers are unaware of safe handling procedures. Customers want delivery to a suspicious location."
    },
    {
      "title": "Call the National Center for Disaster Fraud (NCDF) at 1-866-720-5721 for fraud cases.",
      "content": "Call the National Center for Disaster Fraud (NCDF) at 1-866-720-5721 for fraud cases. The NCDF was set up in the wake of Hurricane Katrina to combat fraudulent claims relating to the billions of dollars in federal aid distributed in the wake of the disaster. Since then, the center has investigated fraudulent claims linked to the BP oil spill, hurricane Sandy, and other disasters. If you suspect or have evidence of fraud, waste, and/or abuse related to local, state, or federal disaster relief, this is the section of the FBI you need to get in touch with. [7] X Trustworthy Source United States Department of Justice Official website of the U.S. Department of Justice Go to source Call: 1-866-720-5721 E-mail: disaster@leo.gov Write: National Center for Disaster Fraud, Baton Rouge, LA 70821-4909"
    },
    {
      "title": "Use the corporate fraud hotline at 1-888-622-0117 to report corporate corruption.",
      "content": "Use the corporate fraud hotline at 1-888-622-0117 to report corporate corruption. If you suspect fraud at your company, you can use this hotline, established in 2003 in the wake of the Enron investigation. [8] X Research source Corporate fraud investigated by the FBI includes: Falsification of financial information, including false entries, fraudulent trades to inflate profits or hide losses, and transactions designed to evade oversight Self-dealing by corporate insiders, including insider trading, kickbacks, misuse of corporate property for private gain, and tax violations Obstruction of justice designed to conceal the above crimes"
    },
    {
      "title": "Report public corruption with one of the local corruption hotlines found here.",
      "content": "Report public corruption with one of the local corruption hotlines found here . The FBI investigates corruption at all levels of government, from local to state to federal, and across all three branches. [9] X Research source Bribery is the most common form of corruption, but the FBI also frequently investigates extortion, embezzlement, racketeering, kickbacks, and money laundering, along with wire, mail, bank, and tax fraud. [10] X Research source Current areas of focus are corruption along the borders, corruption related to natural disaster relief funds, and election crimes involving campaign finance, voter/ballot fraud, or civil rights violations. [11] X Research source"
    },
    {
      "title": "Get a copy of your Identity History Summary (rap sheet).",
      "content": "Get a copy of your Identity History Summary (rap sheet). If you have been fingerprinted in connection with an arrest or for federal or military service, the FBI is sent a record of the fingerprints and the information associated with them. Individuals may request this information – or ask for certification that they have no Identity History Summary – for personal review, to challenge the information, to satisfy adoption requirements, or to satisfy requirements to move to a foreign country. Only you can request a copy of your own rap sheet. [12] X Research source To submit your request directly to the FBI: [13] X Research source Fill out an Applicant Information Form . Obtain a set of fingerprints on a standard fingerprint form . Include payment by credit card , money order, or certified check. Mail all of the above to: FBI CJIS Division – Summary Request, 1000 Custer Hollow Road, Clarksburg, WV 26306. To submit your request through an FBI-approved Channeler (a private business the FBI contracts to collect and pass on your application information): Contact an FBI-approved Channeler to schedule an appointment. You can usually fill out the Applicant Information Form, have your fingerprints taken, and pay at the Channeler facility. Be sure to discuss the exact procedure when you call the Channeler."
    },
    {
      "title": "Request records about yourself",
      "content": "Request records about yourself . The FBI may have a file on you beyond the Identity History Summary sheet associated with fingerprints. To obtain this file: [14] X Research source Use the U.S. Department of Justice Certificate of Identity Form DOJ-361 . Or write your own letter, sign it, and have it notarized or state “Under penalty of perjury, I hereby declare that I am the person named above and I understand that any falsification of this statement is punishable under the provisions of Title 18, United States Code (U.S.C.), Section 1001 by a fine of not more than $10,000 or by imprisonment of not more than five years, or both; and that requesting or obtaining any record(s) under false pretenses is punishable under the provisions of Title 5, U. S. C., Section 552a(i)(3) as a misdemeanor and by a fine of not more than $5,000.” Send your request by email to foiparequest@ic.fbi.gov. By fax to 540-868-4391/4997. By mail to: Federal Bureau of Investigation, Attn: FOI/PA Request, Record/Information Dissemination Section, 170 Marcel Drive, Winchester, VA 22602-4843"
    },
    {
      "title": "Request records about someone else.",
      "content": "Request records about someone else. You can review records in the FBI's electronic reading room, but if you want records sent to your home, or if you need to request unreleased records, you will need to submit a Freedom of Information Act (FOIA) request. The records, if available, will be sent to you on CD. To find out additional information about requesting records, email the FBI at foipaquestions@ic.fbi.gov. [15] X Research source Use the sample FOIA request letter , or write your own letter, including: Your complete name and address. Identifying information to locate what you are looking for, such as the subject's name, aliases, date and place of birth, social security number, and former addresses. A full description of any particular incident you are interested in. If you are requesting information about a living person, you will need evidence of their written consent. Use the U.S. Department of Justice Certificate of Identity Form DOJ-361 and complete the section titled Authorization to Release Information to Another Person. If you are requesting information about a deceased person, you must provide proof of death, such as an obituary, death certificate, a recognized media source, a date of birth over 100 years ago, or a Social Security Death Index page. State how much you are willing to pay in duplication fees. Send your request by email to foiparequest@ic.fbi.gov. By fax to 540-868-4391/4997. By mail to: Federal Bureau of Investigation, Attn: FOI/PA Request, Record/Information Dissemination Section, 170 Marcel Drive, Winchester, VA 22602-4843"
    },
    {
      "title": "Call the national press office if you are a member of the news media seeking information.",
      "content": "Call the national press office if you are a member of the news media seeking information. For questions regarding cases, personnel changes, policies, or other matters, you can contact the press office by calling 202-324-3000/3691."
    },
    {
      "title": "Contact the FBI about possible job openings.",
      "content": "Contact the FBI about possible job openings. You can learn more about jobs online at the FBI jobs site , by attending an event, or by contacting the nearest field office . Jobs are applied for online."
    },
    {
      "title": "Find out about business opportunities.",
      "content": "Find out about business opportunities. The Finance Division is responsible for the procurement needs of the FBI. They hold monthly vendor outreach in Washington, D.C., which you can register for by calling 1-800-345-3712. You can also contact the Small Business Program Office of the FBI directly. [16] X Trustworthy Source United States Department of Justice Official website of the U.S. Department of Justice Go to source By mail: Mr. L.G. Chuck Mabry, Small Business Specialist Acquisition Strategy and Planning Unit, Room 6863, 935 Pennsylvania Ave., NW, Washington, DC 20535 By phone: 202-324-0263 By email: Lafayette.mabry@ic.fbi.gov"
    },
    {
      "title": "Find out about law enforcement partnerships.",
      "content": "Find out about law enforcement partnerships. If you are part of a different law enforcement agency or organization and need to partner with the FBI, you should contact the FBI's Office of Partner Engagement. [17] X Research source By mail: Assistant Director Kerry Sleeper, Office of Partner Engagement, Federal Bureau of Investigation, U.S. Department of Justice, 935 Pennsylvania Avenue, NW, Washington, D.C. 20535"
    },
    {
      "title": "Contact the FBI regarding federal crimes and cyber crimes.",
      "content": "Contact the FBI regarding federal crimes and cyber crimes. As a federal investigative and intelligence agency, the FBI has the authority and responsibility to respond to a range of federal crimes, cybercrimes, and national security threats. Contact the FBI any time to give information on the following crimes: [18] X Research source Possible acts of terrorism or activities related to terrorism People sympathetic to terrorists Suspicious activities that could be a threat to national security, especially if foreign parties are involved Computer crimes , especially those related to national security Corrupt government activities at the local, state, or federal level, or in law enforcement Race-related and hate crimes Human trafficking Civil rights crimes Organized crime activities Financial crimes involving fraud (corporate fraud, mortgage fraud, investment fraud, etc.) Health care industry fraud People who have committed or are planning to commit crimes including bank robbery, kidnapping, extortion, valuable art theft, large interstate shipment theft, and monetary instrument theft Violent gang activity"
    }
  ]
}