{
  "url": "https://www.wikihow.com/Calculate-How-Much-Water-to-Drink",
  "title": "How to Figure Out How Much Water You Should Drink Every Day",
  "steps": [
    {
      "title": "Multiply your weight in pounds by ⅔ to calculate how many ounces of water to drink.",
      "content": "Multiply your weight in pounds by ⅔ to calculate how many ounces of water to drink. Record your weight in pounds, then multiply this number by ⅔ (0.67). The resulting number is how many ounces of water you need to drink each day—it’s that simple! In general, the more you weigh, the more water you’ll need. [1] X Research source For example, if you weigh 120 pounds, drink around 80 oz (2.4 L) of water a day (120 x 0.67 = 80.4)."
    },
    {
      "title": "Drink 30 to 40 ml of water for every kilogram of body weight.",
      "content": "Drink 30 to 40 ml of water for every kilogram of body weight. If you measure your weight in kilograms, multiply that number by 30 and 40 to get the range of how many milliliters of water to drink each day. For example, if you weigh 54 kilograms, drink between 1,620 ml (1.6 L) and 2,160 ml (2.1 L) of water each day. Where you fall exactly within this range depends on other factors, such as your activity levels, metabolism, and other health conditions."
    },
    {
      "title": "Go by age to determine how much water kids should drink.",
      "content": "Go by age to determine how much water kids should drink. Just like adults, a child’s individual weight, activity level, metabolism, and other factors will affect how much water they drink in a day. However, general estimates can be made for how much water kids need to be drinking based on how old they are. Use the following estimates as guidelines: [2] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source 6 months : 4-8 oz (118-236 ml) 1-3 years : 32 oz (946 ml) 4-8 years : 40 oz (1.1 L) 9+ years : 56-64 oz (1.7-1.9 L)"
    },
    {
      "title": "Drink more water before, during, and after exercising.",
      "content": "Drink more water before, during, and after exercising. Your body uses up a lot of water when you exercise, especially if you’re sweating buckets. Drink 16 to 20 oz (473 to 591 ml) of water 4 hours before exercising. If you’re doing a super intense workout and really sweating it out, drink 8 to 12 oz (236 to 254 ml) every 15 minutes during your workout. And, of course, be sure to guzzle down a glass of water when you’ve completed your workout. [3] X Research source For lower-intensity workouts where you don’t really break a sweat (walking, light yoga, etc.), drink 13 to 15 oz (384 to 443 ml) for every hour of exercise. [4] X Research source Avoid drinking more than 50 oz (1.5 L) within 1 hour. Drinking too much can increase your risk for hyponatremia (low sodium)."
    },
    {
      "title": "Consume more water when it’s hot and humid out.",
      "content": "Consume more water when it’s hot and humid out. If you’re hot, chances are you’re probably sweating out some of that water you just drank. If you live in a particularly hot and humid climate, make sure you’re drinking water throughout the day. Just as you would when exercising, add an extra 8 to 12 oz (236 to 254 ml) of water to stay properly hydrated . [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Drinking water when it’s cold is just as important. You might feel less thirsty when it’s cold out, but this increases your risk of becoming dehydrated. So even when the temperature starts to drop, make sure you’re always sipping on some water. [6] X Research source"
    },
    {
      "title": "Drink at least 80 to 104 oz (2.3 to 3 L) of water if you’re pregnant or breastfeeding.",
      "content": "Drink at least 80 to 104 oz (2.3 to 3 L) of water if you’re pregnant or breastfeeding. Drinking water is important in helping to form the amniotic fluid around the fetus when you’re pregnant. Breast milk is also 90% water, so adding extra water to your diet will help in producing more milk. If you’re pregnant, drink around 80 oz (2.3 L) or more a day. If you’re breastfeeding, bump this up to around 104 oz (3 L). [7] X Research source"
    },
    {
      "title": "Drink more water if you have a fast metabolism.",
      "content": "Drink more water if you have a fast metabolism. The metabolic process is what your body does to convert food and drinks into energy. People with a high metabolism usually need more food and water to keep their energy levels up since they burn through calories much faster. Calculate your basal metabolic rate (BMR) to find out how many calories your body tends to burn in a day. If it’s on the higher end, be sure to drink an extra glass of water or two. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Burning around 2,400 calories for women and 3,000 calories for men is on the higher end and might mean you have a fast metabolism. Things that affect your metabolic rate include your age, sex, genetics, muscle mass, activity levels, and whether or not you smoke."
    },
    {
      "title": "Drink water before you start feeling thirsty.",
      "content": "Drink water before you start feeling thirsty. Feeling thirsty is actually a sign that you’re already dehydrated. Stay ahead of the game by drinking water regularly throughout the day and also before you do any activities or workouts. Carry a water bottle around with you for easy access and a friendly reminder to stay hydrated. [9] X Research source Aim to drink at least 8 oz (1 cup) of water before your morning cup of coffee to start your day off right. Besides thirst, other symptoms of dehydration include headaches, dizziness, fatigue, a dry mouth, and constipation. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Monitor the color of your urine to see if you’re staying hydrated. If your urine is clear or a very pale yellow, you’re good to go. If you notice that your urine is a bright or dark yellow, that’s your body’s way of telling you to drink more water . [11] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source"
    },
    {
      "title": "Add some fun flavors or carbonation to your water.",
      "content": "Add some fun flavors or carbonation to your water. Buy some flavored water or make your own using fresh fruit. Apples, lemons, limes, and mangos are just a few great options. Let the fruit soak in your water glass for a bit so that it can infuse all of those delicious flavors. Also, try naturally flavored sparkling water to add a bit of texture to your water. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Unsweetened teas and milk are great drinks to have alongside water to stay hydrated. Drinks like fruit juices and sports drinks tend to have a lot of added sugars and can actually be dehydrating. Alcohol and caffeinated drinks, such as soda and coffee, are diuretics that increase urination, meaning you’ll need to drink even more to make up for the loss of water."
    },
    {
      "title": "Eat foods that have lots of water in them.",
      "content": "Eat foods that have lots of water in them. Did you know that the food you eat can also contribute towards your daily water goal? Foods like cucumbers, iceberg lettuce, watermelon, cauliflower, and strawberries are some foods that have a lot of water in them. You’re killing two birds with one stone by keeping your body hydrated and getting lots of good vitamins and nutrients. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Follow the “8 by 8” rule to get in at least 64 oz (1.9 L) of water a day.",
      "content": "Follow the “8 by 8” rule to get in at least 64 oz (1.9 L) of water a day. The 8 by 8 rule tells you to drink 8 glasses of water by 8 PM each day. This assumes that each glass is around 8 oz (236 m). While the amount of water you personally need to drink might be higher, the 8 by 8 rule is a good starting point. Start a little competition with yourself to see if you can reach this goal. It’ll definitely add a fun twist to drinking water. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Try setting an alarm on your phone to remind you to drink water with every meal. Avoid drinking too much water before bed so that you don’t have to interrupt your sleep by taking a trip to the bathroom in the middle of the night. As a general rule, stop drinking around 2 hours before you go to bed. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Your body needs water to function properly.",
      "content": "Your body needs water to function properly. This one might be a bit obvious, but it’s easy to forget just how much your body relies on staying properly hydrated to maintain certain functions. Staying hydrated helps your body regulate its temperature as well as get rid of waste through urine, sweat, and bowel movements. Your body also needs water to keep your joints properly lubricated and protect your spinal cord and other sensitive tissues. [16] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Water improves your skin by flushing out toxins.",
      "content": "Water improves your skin by flushing out toxins. Your skin is constantly being exposed to toxins throughout the day, but staying properly hydrated helps flush these out. Not drinking enough water can cause your skin to turn oily since it’s trying to get rid of these toxins on its own without the help of water. If one of your goals is to have flawless, dewy skin, start with a big glass of water before you try any 10-step skincare routines. [17] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Staying hydrated improves your cognition.",
      "content": "Staying hydrated improves your cognition. When you’re even mildly dehydrated, you’re less likely to do well with tasks that require more complex thinking. You might also find that you can’t focus as well. [18] X Research source On the other hand, drinking water increases the flow of blood and oxygen going to your brain, which improves your overall cognition and ability to concentrate. [19] X Research source"
    },
    {
      "title": "Drinking water is the key to staying energized.",
      "content": "Drinking water is the key to staying energized. One of the side effects of dehydration is fatigue. So if you’re feeling a bit off in the middle of the day, it might be because you haven’t had enough water. Drinking water keeps blood and oxygen circulating throughout your body to your major organs, leaving you feeling more energized, alert, and ready to tackle the day. [20] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you’re feeling particularly sluggish in the morning, drink a big glass of water before getting started with your day. You’re likely just a bit dehydrated after not drinking all night."
    },
    {
      "title": "Drinking water throughout the day helps curb cravings.",
      "content": "Drinking water throughout the day helps curb cravings. While just drinking water won’t necessarily help you shed any pounds, it’s a great way to support weight loss. When you drink a glass of water, it leaves you feeling fuller and less likely to snack and reach for sugary drinks throughout the day. Drink a glass of water before each meal to help avoid overeating. A lot of the time, you’re just thirsty and not actually hungry. [21] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}