{
  "url": "https://www.wikihow.com/Ask-Permission-from-a-Girl%27s-Father-to-Date-Her",
  "title": "How to Ask Permission from a Girl's Father to Date Her",
  "steps": [
    {
      "title": "Show your interest.",
      "content": "Show your interest. Before you ever talk to her father, you need to show the girl you're interested and find out if she's interested in you. If you haven't established that you both like each other, she's probably going to find it off-putting that you asked her dad permission before you asked her. If you don't know how to start a relationship, start just by talking to her. Find common ground, or use the classes or surrounding environment to strike up a conversation. For example, you could say, \"That test was hard, wasn't it? How do you think you did?\" just to get the conversation going. [1] X Research source"
    },
    {
      "title": "Develop your relationship.",
      "content": "Develop your relationship. Once you've started talking, work on developing a friendship. Continue to talk to her and seek her out. Show interest in what she likes to do, and don't be afraid to give her a compliment. You could say, \"You're so smart,\" or \"You're really good at math!\" [2] X Research source When you've spent a good deal of time together, you can bring up the topic of dating or going out. You could say something like, \"I enjoy spending time with you. I think I like you as more than a friend. Would you like to go out with me?\""
    },
    {
      "title": "Bring up the topic of asking for permission.",
      "content": "Bring up the topic of asking for permission. Once you've established that you'd both like to go out with each other, bring up the topic of asking her father. You need to explain your reasoning for asking his permission and ask her if it's okay, as she may have reasons that it's not a good idea. If she thinks it's a good idea, ask her a few questions about her dad, so you'll have a better idea of what you're walking into. You could ask her if he's strict, as well as his religious beliefs, as that could help you figure out an approach. You could say, \"I know most parents are uncomfortable with their kids dating, so I'd really like to talk to your dad about us dating before we go out. What do you think about that?\" Alternatively, you could say, \"I know your family is fairly conservative, so I'd feel more comfortable asking your dad's permission for us to date. How do you feel about that?\" Of course, it may be that she has brought up the topic of asking her father permission because she knows that's what he would want. In that case, ask her for tips about how to approach the conversation, since she knows her father much better than you do."
    },
    {
      "title": "Be prepared for the conversation.",
      "content": "Be prepared for the conversation. This conversation is not one you want to go into without thinking about what you want to say ahead of time. When you're faced with your potential girlfriend's dad, you're liable to get a little tongue-tied. Therefore, you need to think about what you're going to say before you get into that situation. [3] X Research source It can help to write out what you want to say, or at least write down enough to figure out your main points. You probably don't want to take what you wrote with you when you go, but just writing it down can help you work through it. For example, maybe you want to say something like \"Hello, Mr. Vail. I wanted to meet with you today to discuss your daughter. I would like to date her. I know that could be a problem for you, but I want you to know that I have nothing but respect for her. I give my word that I will treat her well.\""
    },
    {
      "title": "Work on your confidence.",
      "content": "Work on your confidence. Of course, you're going to be nervous. The trick is to seem confident despite your nerves. Confidence will give off a better impression, as you'll seem more sure of yourself. Don't overdo it, though, as you don't want to seem cocky. \\ Make sure to run through your speech several times to make sure you remember what you're going to say. That way, you'll be less likely to lose your nerve. Ask a sibling or a parent to go over it with you if you think it will help. One way to seem more confident is to pay attention to your body language. Look him in his eyes, especially when introducing yourself, and make sure you stand up straight. Be sure to smile, and when you shake his hand, do it with strength and confidence. In addition, don't be afraid to crack a joke or laugh at one he makes."
    },
    {
      "title": "Set up a time to talk.",
      "content": "Set up a time to talk. Call your potential girlfriend's father, and introduce yourself. When you introduce yourself, make sure you mention your connection to his daughter. Ask him if you can meet with him to talk to him about his daughter. [4] X Research source For example, you could say, \"Hello, Mr. Vail. I'm Terry Roberts, and I go to school with your daughter, Jessica. I was wondering if I could meet with you in the next week to discuss my relationship with your daughter.\" Letting him know ahead of time what you want to discuss gives him a chance to prepare his mind for the conversation. [5] X Research source Of course, it's possible that you already know her father. In that case, it's still polite to call and set up a meeting. When you do, you'll still state who you are and what you would like. You could say, \"Hello, Mr. Vail. It's your daughter's friend, Terry Roberts. We go to school together. I was wondering if I could meet with you soon to discuss my relationship with your daughter.\" If he agrees to the meeting, set up a time and place. Let him pick it out since you're asking him a favor. If he asks for more information, you can emphasize that you'd really like to meet with him in person."
    },
    {
      "title": "Dress to impress.",
      "content": "Dress to impress. Your potential girlfriend's father will not be impressed if you show up in clothes full of holes or covered in stains. You don't have to dress in a suit. However, some nice pants, a button-up shirt, and a tie wouldn't hurt. [6] X Research source Dressing up shows that you respect him and his daughter, and he'll be more likely to say yes. Also, make sure everything is ironed, and you're not missing any buttons or anything."
    },
    {
      "title": "Be on time.",
      "content": "Be on time. If you say you're going to show up at 4:00 P.M., make sure you are strictly on time. Being about 10 minutes early is even better, though you don't want to show up much earlier than that, especially if you're going to his house, as he may not be ready for you. Showing up on time shows you respect him enough to know his time is valuable. [7] X Research source"
    },
    {
      "title": "Introduce yourself again.",
      "content": "Introduce yourself again. When you show up to the meeting, it's polite to introduce yourself in person, even if you already introduced yourself over the phone. Give your name, and offer your hand to shake. It's also polite to offer an introduction to how you know his daughter, as it gives him some context about you. [8] X Research source You could say, \"Hello, sir, my name is Terry Roberts. As you know, I go to school with your daughter, Jessica.\" Then offer your hand to shake. Of course, if you know him, you don't need to introduce yourself, but it's still polite to greet him and offer your hand to shake."
    },
    {
      "title": "Don't be afraid to give a compliment.",
      "content": "Don't be afraid to give a compliment. Everyone loves compliments, as long as they're sincere. You don't necessarily have to compliment her father, if that makes you uncomfortable, but compliment something that's connected to him. For example, you could compliment his house or his car, such as, \"Your house is really amazing.\""
    },
    {
      "title": "Be direct.",
      "content": "Be direct. You don't want to spend time beating around the bush. Being direct is a much better approach, and it shows you have bravery (because it does take bravery to say that to a potential girlfriend's father). Therefore, start out by stating outright why you wanted to talk to him. [9] X Research source For example, you could say, \"I asked to meet with you because I would like to date your daughter. Even though I don't know you, I respect her and you enough to come here and ask your permission first.\" If you do know her father, you can leave out the part about not knowing him."
    },
    {
      "title": "State why you want to date his daughter.",
      "content": "State why you want to date his daughter. If you're still a teenager, be aware that most fathers are not going to want to hear that you \"love\" his daughter, especially if you aren't technically dating yet. However, you can express what you like and respect about his daughter so he understands your intentions. [10] X Research source For example, you could say, \"Sir, I'd like to date your daughter because I think she's very smart and funny. I enjoy spending time with her.\""
    },
    {
      "title": "Think about it from his perspective.",
      "content": "Think about it from his perspective. His daughter means the world to him, and he expects anyone that dates her to respect her and treat her well. You need to let him know that you will treat her well to put his mind at ease. [11] X Research source [ For example, you could say, \"I understand that anyone dating your daughter will need to treat her with respect. I promise I will do my best to treat her well and not hurt her. I know she deserves the best from anyone who dates her.\""
    },
    {
      "title": "Give him a chance to talk.",
      "content": "Give him a chance to talk. In any conversation, you've got to give the other person a chance to voice their feelings. In this case, that means letting her father voice his concerns. He'll likely have something to say, even if he does eventually give you permission. [12] X Research source Listen actively to what he has to say. That means making sure that you hear what he's saying, and that you're not just thinking about what you're going to say next. Also, be sure your body language shows you're listening. Look him in the eye, and nod along to what he's saying. You can also summarize what you're saying to make sure you are hearing his concerns correctly. For example, you could say, \"What I hear you saying is you're not sure if you're ready for your daughter to date. I completely understand that concern.\""
    },
    {
      "title": "Work on goals together.",
      "content": "Work on goals together. One way you can help your cause is to set boundaries with your potential girlfriend's father. That is, once you hear his concerns, try to figure out if there's a way you can calm his fears by agreeing to certain terms. [13] X Research source You could say, \"I hear what you're saying. What could I do to make you feel better about me dating your daughter? I would be willing to agree to whatever boundaries you set. For example, maybe we could start with group dating, or we could even go on a date with your supervision. I'm willing to prove to you that I'm worthy of dating your daughter.\" Remember what \"permission\" means. That is, you want to know if your potential girlfriend's father thinks it's fine for you to date his daughter. Then, it's up to him. He can say \"yes,\" but you've also given him a chance to say \"no.\" If he says \"no,\" you must accept that response. [14] X Research source"
    }
  ]
}