{
  "url": "https://www.wikihow.com/Be-Safe-When-Home-Alone-(Kids)",
  "title": "How to Be Safe When Home Alone (Kids)",
  "steps": [
    {
      "title": "Follow your parents' rules.",
      "content": "Follow your parents' rules. Your parents want you to stay safe. That's why they have rules. If you're not sure what the rules are, sit down with your parents and write out a list together, so you both have something to refer to. [1] X Research source The rules might cover who you can have over (if anyone), whether you can go outside, and whether you can take phone calls."
    },
    {
      "title": "Lock the doors and windows.",
      "content": "Lock the doors and windows. While break-ins are unusual, they can happen. The best thing you can do is keep the doors and windows locked when you're inside. That way, someone can't just walk in without your permission. [2] X Research source If your family has an alarm, learn how to set it so it can protect you while you're home. Set the alarm to \"Stay\", preferably \"Instant\", so that police are notified in the event of a break-in."
    },
    {
      "title": "Avoid opening the door to people you don't know.",
      "content": "Avoid opening the door to people you don't know. If someone comes to the door, it's best to ignore it if you don't know the person. If the person is delivering a package, ask them to leave it or come back later. Don't tell them you're by yourself. [3] X Research source It's also important not to tell people over the phone that you're by yourself at home. If someone calls for your parents, you can say, \"They can't come to the phone right now. Can I have them call you back?\""
    },
    {
      "title": "Stay away from dangerous items in the house.",
      "content": "Stay away from dangerous items in the house. Even though you're home alone, you don't have free rein to do anything you want. You still need to stay away from dangerous things. Don't play with matches, knives, or guns, for instance. Also, don't take medications unless you know what you're doing. Don't mix chemicals and cleaners you find around the house, as it can create fumes or liquids that can hurt you. [4] X Research source"
    },
    {
      "title": "Call your parents if you need to.",
      "content": "Call your parents if you need to. If something happens or you don't know what to do, call your parents or another trusted adult. They can walk you through the situation so you feel safe again. It's best to know your parents' cell phone numbers by heart, so you'll always be able to call even if you can't see the list of emergency numbers."
    },
    {
      "title": "Have emergency numbers ready.",
      "content": "Have emergency numbers ready. If something happens, you need to be ready. The main emergency number you need to know is 9-1-1 (in the United States). They can help with emergencies like fires, someone breaking in, or injuries. But you should only call them when it's truly an emergency. If you get a small cut, that's not a reason to call 9-1-1. [5] X Research source Keep other emergency numbers on hand, such as your parents' numbers, as well as other people you can call if you have an issue, such as a neighbor or family member. If you don't have these numbers handy, ask your parents to make a list and post it up for you to see easily. [6] X Research source"
    },
    {
      "title": "Practice what to say during an emergency call.",
      "content": "Practice what to say during an emergency call. When you call 9-1-1, the operator will want to know a few things. They'll want to know where you are (your address) and what's wrong. They'll also want to know your phone number so they can call back if needed. Try running through a practice call with your parents. [7] X Research source"
    },
    {
      "title": "Run through practice emergencies with your parents.",
      "content": "Run through practice emergencies with your parents. If something crazy happens, you may want to panic. Most people do. It's important to stay calm, though. One way you can learn to stay calm is to go over what to do when things happen with your parents ahead of time. [8] X Research source Things can go wrong in a house, such as a toilet overflowing, the smoke alarm going off, or something catching on fire in the kitchen. Ask your parents to go over potential problems with you."
    },
    {
      "title": "Learn where the emergency exits are.",
      "content": "Learn where the emergency exits are. You need to be able to know how to get out of your house in different ways. Of course, the back and front doors are good options. If there's a fire, though, you may need to escape through a window to get to safety. [9] X Research source Ask your parents to go over the best ways out of the house."
    },
    {
      "title": "Learn the basics of first aid.",
      "content": "Learn the basics of first aid. If you're at home alone, you need to know how to deal with getting a cut or a burn. If you have a bad cut or burn, you can call 9-1-1, but if you're only a little hurt, you can fix it yourself. [10] X Research source For instance, for a cut, wash your hands, then hold a clean cloth against it to stop the bleeding. Rinse out the cut with cool water. Use antibiotic ointment, and then put a band-aid over it. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For a bruise, prop the area up on a pillow. Apply an ice pack wrapped in a towel to help ease the swelling. Don't keep ice on it for more than 10 minutes. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source With a light burn, put it in cool, running water for about 10 minutes. Don't use ice. When it feels a little better, you can use aloe vera gel on it. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Ask your parents where your first aid kit is. If your home doesn't have one yet, buy one, or put one together with your parents."
    },
    {
      "title": "Don't go in your house if you see a broken window or open door.",
      "content": "Don't go in your house if you see a broken window or open door. If you come home and you see something not right, don't go in the house. A broken window could mean someone is inside. It's better to stay safe. Go to a neighbor or friend's house and call 9-1-1. You can even go back to school if you need to. [14] X Research source"
    },
    {
      "title": "Don't let people you know in if it doesn't feel right.",
      "content": "Don't let people you know in if it doesn't feel right. Even if you know an adult who's knocking on the door, you don't have to let them in if it doesn't feel right. Sometimes, even adults you know may not have good intentions. Trust your gut, and call your parents if you're not sure. Some families have code words, so if your parents send someone to help that you don't know, you'll know it's okay. Then you can ask for the code word if someone says your parents sent them."
    },
    {
      "title": "Check out strange noises.",
      "content": "Check out strange noises. Of course, many houses make odd noises from time to time, usually because the house is settling. However, if you hear a noise that's out of the ordinary, you should check it out. If you notice signs of trouble, take action. For instance, if you notice signs of someone breaking in, get out of the house if you can and run to a neighbor's for safety."
    },
    {
      "title": "Pay attention to warning signs.",
      "content": "Pay attention to warning signs. Your home is likely equipped with both smoke alarms and carbon monoxide detectors. When these go off, don't ignore them. If you don't know what to do, it's best to get out of the house, and dial 9-1-1 at a neighbor's house. [15] X Research source If you notice that something is smoking, it's likely time to call 9-1-1 so the fire department can help you. You can try to work a fire extinguisher if your parents have shown you how to use one. However, if the fire is more than a very small one, get out of the house. Also, if your house has a gas stove or heater, always pay attention to gas smells. The carbon monoxide detector should warn you, but it's always best to get out of the house if you smell gas. Natural gas has an additive to make it smell like rotten eggs."
    }
  ]
}