{
  "url": "https://www.wikihow.com/Command-Respect-from-Other-People",
  "title": "How to Command Respect from Other People",
  "steps": [
    {
      "title": "Exude confidence through your body language.",
      "content": "Exude confidence through your body language. [3] X Expert Source Carolyn Powery Business Etiquette Expert & Personal Image Branding and Confidence Coach Expert Interview. 26 Febraury 2025. Remember that it’s not how you feel that is important–it’s how the person watching you thinks you feel. This is a common problem with body language: often your non-verbal signals don’t convey what you intended them to. You may be slouching because you’re tired, but others might read it as a sign of disinterest. You may be more comfortable standing with your arms folded across your chest, but others will see you as resistant and unapproachable, and keeping your hands stiffly by your side or stuck in your pockets can give the impression that you’re insecure or hiding something – whether you are or not. To show confident body language, you need to stand tall instead of slouching, look ahead of you or at the people you're speaking to instead of the floor, and keep your hands relaxed and ready to gesture when appropriate. [4] X Expert Source Nicolette Tura, MA Empowerment Coach Expert Interview. 28 January 2020. [5] X Expert Source Carolyn Powery Business Etiquette Expert & Personal Image Branding and Confidence Coach Expert Interview. 26 Febraury 2025. Don't fidget with your hair, clothes, or hands, or you'll look either bored or insecure. Keep your body alert and active, giving yourself more presence."
    },
    {
      "title": "Manage your facial expressions.",
      "content": "Manage your facial expressions. Have you ever been asked a difficult question in a group? Probably you wanted to come across as knowledgeable, confident, and likable, but what if you clenched your jaw, raised your eyebrows or grimaced as you searched for the answer? Or did you sigh, smile condescendingly, and shake your head? And what do you think the people around you made of that? So take care about how you react. Keep your facial expression positive and confident, by smiling slightly, not looking down, and avoiding furrowing your brows or biting your lip. When you speak, make sure that you look like you believe in what you're saying instead of having an expression that says, \"I cannot believe the stuff that's coming out of my mouth.\""
    },
    {
      "title": "Don’t underestimate the power of touch.",
      "content": "Don’t underestimate the power of touch. [6] X Expert Source Carolyn Powery Business Etiquette Expert & Personal Image Branding and Confidence Coach Expert Interview. 26 Febraury 2025. We are programmed to feel closer to someone who has touched us. The person who touches also feels more connected. Firm touch is more effective than light touch, which can actually make someone less comfortable. It’s a compelling force and even momentary touching can create a human bond. A touch on the forearm that lasts a mere 1/40 of a second can make the receiver not only feel better but also see the giver as being kinder and warmer. Even with adults in business settings, a study on handshakes by the Income Centre for Trade Shows showed that people are twice as likely to remember you if you shake hands with them."
    },
    {
      "title": "Match your body language to your words.",
      "content": "Match your body language to your words. [7] X Expert Source Carolyn Powery Business Etiquette Expert & Personal Image Branding and Confidence Coach Expert Interview. 26 Febraury 2025. When your body language is out of sync with your words, people believe what they see. It is crucial to communicate congruently – that is, to align your body to support, instead of sabotage, an intended message. Mixed signals have a negative effect on performance and make it almost impossible to build relationships of trust. Whenever your non-verbal signals contradict your words, the people you are addressing — employees, customers, voters — become confused. And, if forced to choose, they will discount your words and believe what your body said. For example, if someone is talking to an audience about how much he or she welcomes their input, but stands behind a lectern, or leans back away from the audience, or shoves their hands in their pockets, then the audience will believe the non-verbal signal that that person is not interested in the audience, and couldn’t care less about them!"
    },
    {
      "title": "Remember that you are never off camera.",
      "content": "Remember that you are never off camera. As a leader, you are always communicating. People are unrelenting leader-watchers, and your “off-record” behaviour is being closely monitored. In the words of one savvy leader, “What I do in the hallway is more powerful than anything I say in front of an audience.” You can't give a forceful, commanding speech and then walk off the stage and start rebuking an employee or family member over the phone without losing respect. If you say something to a few people and then are seen contradicting your own words shortly after, then how can you expect to have their respect?"
    },
    {
      "title": "Think fewer, slower, lower.",
      "content": "Think fewer, slower, lower. Have you ever wondered why men are more likely to be perceived as leaders than women? They tend to use fewer, lower, and slower movements. In research, on average, women made 27 major movements when entering a room to a meeting, compared with only 12 for men. Women who do make it to be leaders use fewer, slower movements, on a par with men. So if you want to command respect, slow down and don’t wave your hands about."
    },
    {
      "title": "Be a good role model.",
      "content": "Be a good role model. If you want to command respect, then you have to be a good role model for people. They should see the way you live your life and feel inspired. Though this may sound a little general, you just need to live your life the way you think an ideal life should be lived. Be kind to people in the service industry, achieve your goals, give your work your all, and make time for kindness and generosity in your life. [8] X Expert Source Nicolette Tura, MA Empowerment Coach Expert Interview. 28 January 2020. If you are a person who lives your life with class, dignity, and grace, then you will be respected for your strong character."
    },
    {
      "title": "Don't take advantage of other people.",
      "content": "Don't take advantage of other people. Commanding respect does not mean taking advantage of other people. If you want to command respect, then you have to be respectful and kind to people, instead of trying to make them your minions or your puppy dogs. Don't take advantage of people in your office in a lower position, or of needy friends or acquiescent siblings. This won't make you look awesome because you have people doing everything for you; instead, you'll look like a person who doesn't care about anyone else, and nothing will make you lose respect faster than that. If people respect you, then they will be happy to work with you to achieve mutual goals. [9] X Expert Source Nicolette Tura, MA Empowerment Coach Expert Interview. 28 January 2020. But if you're just using people for money, rides, and favors, they'll catch on pretty quickly."
    },
    {
      "title": "Treat everyone with the same level of respect.",
      "content": "Treat everyone with the same level of respect. Even if you're the CEO of your company, it doesn't mean you have the right to be mean to the mail carrier. You should be grateful for whatever position you have and to treat people above and below you with kindness and care. This means that you should respect people in positions of authority and pay attention to the people who work under you; if you snap at a waitress or are mean to a new employee, then people will see that you don't give common courtesy to other people. [10] X Expert Source Nicolette Tura, MA Empowerment Coach Expert Interview. 28 January 2020. Sure, rising to the top at your company can earn you some respect. But giving the guy who delivered your company lunch an extra tip will earn you even more."
    },
    {
      "title": "Avoid bragging about your achievements.",
      "content": "Avoid bragging about your achievements. You may be so desperate for other people to respect you that you feel the need to flaunt every little thing you've ever done, from earning your first tennis trophy in middle school to winning the New York marathon. However, if you work hard enough and maintain your modesty, then people will learn about your achievements and will be impressed by them anyway. If you're the one who has to bring up all of the great things you've done, then your achievements will begin to lose their luster. It may take time for people to notice all of the great things you've done, but once they do notice, it'll be worth it."
    },
    {
      "title": "Praise people instead of gossiping about them.",
      "content": "Praise people instead of gossiping about them. If you want to command respect, then people have to see that you are so invested in the more important things in life to care about who hooked up with whom over the weekend. Instead, start a trend by saying something nice about people \"behind their backs.\" People will be impressed that you have so much good will and that you aren't nasty, jealous, or conniving. They'll respect you for not giving in to idle gossip and for not spreading rumors. And who knows, they may even follow your trend, and you will not only command respect for being kind, but for starting a positive movement. Additionally, it never hurts to compliment people to their faces. Resist the urge to snap at people or to be mean if you're in a bad mood and focus on being nice to people instead. People will tend to like -- and to respect -- you more if you make them feel good about themselves."
    },
    {
      "title": "Give your time.",
      "content": "Give your time. If you want to command respect, then you cannot live selfishly. Take time out of your busy schedule to volunteer in your community, to help a classmate or co-worker understand a difficult task, or to help your parents around the house. The act of selflessly giving your time, even if you don't have a lot of it, will not only make people respect you more, but it'll make you feel better about yourself as well. If you're so focused on achieving your goals and impressing everyone that you have no time for helping others, then you will certainly lose respect. Of course, you shouldn't volunteer or help others just so people will respect you more. It should be a natural impulse."
    },
    {
      "title": "Excel at something.",
      "content": "Excel at something. Another way to get people to respect you is to be truly excellent at something. You could be amazing at your job, write beautiful poetry, or be the best goalie your college team has ever had. You can even excel at making anyone laugh in under a minute, no matter how terrible they are feeling. Find what you're good at and take it to the next level. If you're truly going above and beyond in some aspect of your daily existence, then people will notice. Again, this doesn't mean that you should brag about how amazing you are at something. If you go about it the right way, then people will notice."
    },
    {
      "title": "Stick to your word.",
      "content": "Stick to your word. Being a man or woman of your word is the key to showing strong character and commanding respect. How can people respect you if they think you'll flake on them or go back on your word within minutes? If you say you're going to do something or make a promise, then you better back it up. And if you're not sure if you can really do it, then don't make empty promises that will only temporarily make people feel better. Work on being someone people can depend on and the rest will follow. Know your limits. Don't say you'll do twenty different things if you only have time for five of them."
    },
    {
      "title": "Stop apologizing for everything.",
      "content": "Stop apologizing for everything. A big part of having self-respect is being comfortable with what you're doing and who you are. And if you don't have that, nobody will respect you, either. So, stop apologizing for needing some me time, for not going to your friend's party because you'd rather hang out with your family, for not meeting your boss's unrealistic expectations, or for not being able to hang out with your family because you have a final exam coming up. Own your actions and don't make excuses for them, and other people will see that you're worthy of respect. This doesn't mean that you shouldn't apologize for anything. If you've done something wrong, you'll gain a lot more respect if you admit your mistakes than if you to to brush them under the rug."
    },
    {
      "title": "Learn to say no.",
      "content": "Learn to say no. A person who has no self-respect is always saying yes to people because it's simply easier than turning them down. You may say yes to pet sitting when you have no time, yes to giving your friend a ride when you'd rather be getting some rest, and yes to taking on more work because you don't want to upset your boss. If you want to have self-respect, then you have to learn to say no when you mean it without feeling bad about it. Don't make excuses for why you can't do it or apologize profusely unless the situation really calls for it. Be comfortable with your decision. If you really do feel bad about a situation and would still like to help in some way, you can offer the person who is asking for a favor another alternative."
    },
    {
      "title": "Make your boundaries clear.",
      "content": "Make your boundaries clear. You need to let people know exactly where you draw the line from the get-go. If you're always giving in to people and doing whatever they want, then they will push you further and further. For example, if you watch your sister's kids for five hours a week but say that you just can't help out any more than that, then she won't take advantage of you; but if you give in and help out over the weekend, too, then she'll see that she can get you to do anything. If your team thinks they can get away with asking you to do more of the work, then they'll quickly push you further than you really want to go. State your expectations from the start and stick to them, no matter what, and people will see that you respect your own value and your time."
    },
    {
      "title": "Hang out with people who respect you.",
      "content": "Hang out with people who respect you. If you want to have true self-respect, then you have to hang around people who make you feel good, not people who put you down and make you feel small. If the people around you are always making fun of you or making you feel ugly, poor, stupid, or just generally worthless, then how can you expect anyone in your orbit to have respect for you? If you allow yourself to be treated with flagrant disrespect by your closest friends, then other people will think it's okay for them to treat you that way, too. It's time to reevaluate your relationships. Are the people you spend time with making you feel like a more worthy person or like someone who is completely worthless? If they're not with you, then they're against you, and it's time to find people who treat you like you deserve to be treated."
    },
    {
      "title": "Don't beg.",
      "content": "Don't beg. People who don't respect themselves beg for help, favors, attention, and a lot of other things that lose their appeal after they are begged for. If you respect yourself, then you can ask for help with a difficult task, but you should not degrade yourself by begging for help from people who don't want to give it to you. If your girlfriend isn't paying enough attention to you, don't make her respect you even less by begging for it; instead, let her see how much you should mean to her by being your best self, and if that isn't enough, it's time to cut ties. Not only does begging for help show a lack of self-respect for the person you are speaking to, but people around you will see you as desperate if you look like you can't do something on your own."
    },
    {
      "title": "Take care of yourself.",
      "content": "Take care of yourself. If you want to command respect from other people, then you have to take good care of yourself. This means that you shouldn't let people see you getting overly intoxicated and that you should show up to work or school looking well-groomed and well-rested, instead of stumbling out of bed after three hours of sleep with your hair sticking up. You should make sure you eat three meals a day and have time to do the things you love; all of this has to do with taking care of yourself both physically and emotionally. If you're happy and proud of who you are, then you are a person who is taking good care of yourself. And if you're taking good care of yourself and show that you deserve respect, other people will give it to you. [11] X Expert Source Nicolette Tura, MA Empowerment Coach Expert Interview. 28 January 2020."
    }
  ]
}