{
  "url": "https://www.wikihow.com/Be-Outspoken",
  "title": "How to Be Outspoken",
  "steps": [
    {
      "title": "Gain self-knowledge through journaling.",
      "content": "Gain self-knowledge through journaling. Knowing who you are, what you believe, what you think, feel and want are the beginnings of knowing yourself, and journaling is a great way to establish that knowledge. Practice journaling for 15 minutes or more each night before bed. Not only can you know yourself better, journaling is an excellent tool to improve self-confidence. Self-confidence is the foundation of being outspoken. Try these journal topics to start your journey to greater self-knowledge: What would be your ideal birthday present and why? What is the most courageous thing you have ever done? Who do you most admire and why? How would you like to be remembered?"
    },
    {
      "title": "Be confident.",
      "content": "Be confident. In order to be outspoken, you have to believe that your voice has worth. [2] X Research source You have to believe that your input will make any conversation better. And it probably will! It's different opinions that make conversations or debates interesting. If you struggle with confidence, an easy way to start is on a specific topic that you are very familiar with. The more thoroughly you know a topic, the more comfortable you'll be talking about it. For example, if you are an avid martial artist, talk about martial arts. If you love maintaining a perfect garden, talk about gardening. Become comfortable talking about things close to your heart first. Getting practice in your area of expertise will help you branch out to more abstract topics, like government, ethics, or religion."
    },
    {
      "title": "Overcome shyness",
      "content": "Overcome shyness . Just because you're confident doesn't mean you like hearing your own voice. The next step is overcoming your shyness. [3] X Research source Overcoming a natural tendency towards shyness can seem daunting, but doing the opposite of your natural instinct can open up a whole new set of choices: bolder choices. The popular sitcom Seinfeld aired an episode called “The Opposite.” In this episode, George decides that every decision that he has ever made has been wrong. He concludes that if he did the opposite of his natural instincts, he would get better results. George then decides to do the complete opposite of what he would normally do in every situation. By the end of the show, he goes from being unemployed and living his parents, to getting a job with the New York Yankees organization and being able to get a place of his own."
    },
    {
      "title": "Find your strengths.",
      "content": "Find your strengths. Our strengths usually follow our interests; interests reveal passions. It is easy to be outspoken when talking about your interests and passions. Once you identify your strengths, [4] X Research source feel confident in expressing your views or even taking the lead in a project or activity where these strengths are used. Ask yourself these questions to discover your strengths: What am I interested in? What are my hobbies? What are my best subjects in school? In what areas do I excel at my job?"
    },
    {
      "title": "Develop your opinions.",
      "content": "Develop your opinions. You don't want to sound like you don't know what you're talking about -- or soon enough no one will listen to you. [5] X Research source Plus, it will make becoming outspoken very hard if you don't have anything to say! Think about how you feel about the hot button topics in your social circle. Only you have the answer, after all -- and you can't be wrong! If you don't really have an opinion about something, do a little research about it and decide what you think. Know that lacking an opinion on a matter can be a stance too; you just don't view it as important and worth arguing. For example, you may find yourself unengaged with celebrity gossip because you simply don’t care. It’s okay to say “I have other priorities right now,” or “I do not have an opinion about that.”"
    },
    {
      "title": "Back up your opinion with facts.",
      "content": "Back up your opinion with facts. Some people feel uncomfortable having or expressing an opinion because they don't know much about a topic. You can combat this feeling and have more confidence about your opinion if you learn facts that can support your opinion. For example, if your friends and family talk about healthcare reform all the time, read a few articles about it and decide what you think. If you can back up your opinion with facts, you will feel even more comfortable expressing yourself."
    },
    {
      "title": "Choose your battles.",
      "content": "Choose your battles. You don't want to be the person who's shoving your opinion in everyone's faces at all times, who seems to be outspoken only for the sake of being outspoken, or the one who takes pride in getting the last word in. Instead, know what you feel passionately about and stick to those things. Wait to speak out until you care about an issue. If you give out opinions or contradictions constantly, you may seem belligerent and annoying. The idea is to make people notice and care about what you think, not to hit them over the head with it."
    },
    {
      "title": "Know that being reserved has its place.",
      "content": "Know that being reserved has its place. Western society generally pushes us to be extroverts. The workplace values the person who speaks up, gets conversations going, and forms meaningful work relationships. However, there is nothing wrong with being reserved. Sometimes taking a step back can be the most diplomatic and effective option for communicating. As with most things, it's healthiest lying somewhere in the middle. Being outspoken 24/7 shouldn't be your goal -- you should aim to be outspoken when you feel and only when you feel your stance is being underrepresented or needs defending. If it doesn't, reserve away."
    },
    {
      "title": "Open your mind.",
      "content": "Open your mind. This is just general good-arguing etiquette. In order to state your opinion and come across as rational and someone who should be listened to, you can't come across as bigoted, closed-minded, or arrogant. Allowing the other parties to make their points fully can help you seem more reasonable and level-headed. This is important before, during, and after you speak your mind. It's just as impressive saying, \"You know -- you're right. I didn't think of that,\" as it is to bombard someone with a milieu of facts that are inarguable. Many people can go off on an unstoppable rant-- fewer can stop and admit they might be wrong."
    },
    {
      "title": "Practice with a trusted friend.",
      "content": "Practice with a trusted friend. It’s easy to misunderstand being outspoken for being rude and opinionated. [6] X Research source To learn the fine art of being outspoken, pick a friend who knows you and cares about you. Practice speaking your mind honestly and with boldness. A trusted friend can help you practice being outspoken until it feels more natural by giving you feedback. Being outspoken might sound like this, “I love astronomy and I think we can learn a lot from studying the night sky”. Being rude or opinionated would sound like this, “Anyone who cannot appreciate the night sky is an idiot”."
    },
    {
      "title": "Try to let go of your fears.",
      "content": "Try to let go of your fears. It can be easy to be intimidated if you are worried about what other people will think or say about you. [7] X Research source However, you have to let that go. By expressing yourself well when you have researched and formed a clear opinion about something, you can feel more confident about what you’re saying and worry less about the judgment of others."
    },
    {
      "title": "Be tactful.",
      "content": "Be tactful. You can be outspoken, still have tact, and be sensitive to others' feelings. [8] X Research source Knowing when to be outspoken, as well as knowing what you wish to say, can often be a matter of tact. If you are an avid atheist, a church memorial service for a recently deceased family member is probably not the best place to express your opinion that people who die simply die and don’t go anywhere. Keeping your opinion to yourself in that context is far more tactful."
    },
    {
      "title": "Be well-spoken.",
      "content": "Be well-spoken. It is a shame to allow a good argument to be undermined by improper expression. Many people will focus so much on how things are said that they miss what is being said; you can avoid that problem by doing your best to be well-spoken. [9] X Research source Think about how other well-spoken people, such as news anchors, tend to speak and arrange their thoughts, and try to emulate them. Sometimes part of being well-spoken is not just speaking in large words. It can be just as effective to be short and to-the-point as long as you are presenting thorough information. For example, saying, \"The tuna industry is an abomination. Anyone who eats tuna is being injurious to the ecosystem,\" is insufficient. Instead, back up what you’re saying: \"The tuna industry is completely unsustainable. It'll be off the shelves in 10 years if we don't stop. Humans are completely messing up the circle of life.\""
    },
    {
      "title": "Know when to let it go.",
      "content": "Know when to let it go. Along with picking your battles, you should be able to assess when to let the battle end. When you've said your piece, let your words and ideas speak for themselves. No need to beat a dead horse! Take cues from your peers, too. If someone is starting to get offended, exasperated, or is displaying any other negative emotion, back off. You can revisit the point later if need be."
    },
    {
      "title": "Practice and repeat.",
      "content": "Practice and repeat. Any personality trait is learned. Once you start being outspoken on a regular basis, the reaction will become automatic. Hearing yourself talk won't faze you. Seeing others react to your opinion won't be scary. It's just a natural part of human socialization. Aim to state your opinion once a day, to start. Slowly work your way up to every time you find yourself thinking something pertinent and not saying it. If you go too far, it'll be easier to draw yourself back. And if anyone asks why the change of heart, be honest! You're working on being outspoken. That's all."
    },
    {
      "title": "Be outspoken at home and at the workplace.",
      "content": "Be outspoken at home and at the workplace. It's easy to tell your family how you really feel about the world around you. It's a lot harder to walk into a meeting, raise your hand, and put yourself on the line. But the hard stuff is what really matters most. And it could mean that promotion you’ve been wanting! The more you do something, the more it becomes comfortable -- regardless of what it is. So tomorrow, start. When a thought occurs to you that you could say, say it. That's all you need to do. Do it once a day until being a vocal part of the team feels less scary. You can beef it up from there."
    },
    {
      "title": "Don't aim to convince.",
      "content": "Don't aim to convince. Intellectual, open-minded debates can be invigorating and tons of fun. However, talking to someone who's shoving their opinions down your throat, unrelenting until you admit your unenthusiastic conversion is not. [10] X Research source Don't be the person who won't stop until everyone in the room agrees with you. That's not the goal here."
    },
    {
      "title": "Know your opinion isn't the only one.",
      "content": "Know your opinion isn't the only one. Some people have a hard time keeping their opinions to themselves and not aiming to convince the other party. This is often because they firmly and steadfastly believe that they are 100% right. [11] X Research source The other person is just being ridiculous -- why can't they see it? Because the other person believes the exact same thing . The odds are that if you're on this page, you're not the \"I'm right and you're wrong\" kind of person. However, you're probably going to have to deal with this type of person once you're the one going against their opinion. Let them know that their one-sided view isn't conducive to a fun, intellectual debate. There's no point in arguing with someone like this, so don't do it!"
    },
    {
      "title": "Don't put others down.",
      "content": "Don't put others down. Once you start voicing your opinion, you're going to run into other people that feel compelled to voice theirs, too. You're also going to run into people that state their opinion and it'll leave you thinking, \" Did he really just say that...? I must have misheard.\" When this happens, don't tarnish your rationale by adding in comments like, \"You're acting crazy,\" or \"That's so dumb.\" That doesn't put you in a better position, nor them in a worse one. It just makes you look kind of mean. [12] X Research source Try your hardest to make your outspokenness non-judgmental when it comes to people. If you don't feel like going to a certain movie with your friends, outright say so -- but if, say, someone is talking about their struggle with weight loss, be a bit more diplomatic about the topic."
    },
    {
      "title": "Listen to other people.",
      "content": "Listen to other people. Follow Nelson Mandela's model; he once said, \"I have always endeavored to listen to what each and every person in a discussion had to say before venturing my own opinion. Oftentimes, my own opinion will simply represent a consensus of what I heard in the discussion.\" [13] X Research source Listening first is so important -- maybe your point has already been addressed -- or maybe someone had a better one! The only way you can really make sure your outspokenness is fulfilling its purpose is if you listen before you open your mouth. It'll save you a lot of grief later, too!"
    }
  ]
}