{
  "url": "https://www.wikihow.com/Aerate-Wine",
  "title": "Aerating Wine: Benefits, the Breakdown, & Which Wines You Can Skip",
  "steps": [
    {
      "title": "Open up a bottle of red wine.",
      "content": "Open up a bottle of red wine . If it is under eight years old, chances are, it will be slightly tannic. If the wine is older, it won't need any aeration."
    },
    {
      "title": "Pour the wine into a blender.",
      "content": "Pour the wine into a blender. If you do not have a blender, you can use a food processor with a blade attachment."
    },
    {
      "title": "Close the blender and pulse it on high for 15 to 30 seconds.",
      "content": "Close the blender and pulse it on high for 15 to 30 seconds. [2] X Research source This will help mix air into the wine and soften tannins. Don't worry if you see bubbles forming. This is simply the air bubbles, which will help aerate the wine."
    },
    {
      "title": "Pour the wine into wine glasses and serve.",
      "content": "Pour the wine into wine glasses and serve. For a better presentation, you can also use a funnel to pour the wine back into its original bottle."
    },
    {
      "title": "Get two pitchers.",
      "content": "Get two pitchers. You will be pouring the wine back and forth between the pitchers, so it might be a good idea to use ones that are lightweight and easy to handle."
    },
    {
      "title": "Pour a bottle of tannic red wine into the first pitcher.",
      "content": "Pour a bottle of tannic red wine into the first pitcher. If the wine is under eight years old, it will probably be somewhat tannic and need aeration. If the wine is older than it, you won't need to aerate it."
    },
    {
      "title": "Pour the wine into the second pitcher.",
      "content": "Pour the wine into the second pitcher. Don't worry about how fast or how slow you do this. You will be doing this repeatedly, which will help aerate the wine."
    },
    {
      "title": "Continue pouring the wine back and forth between the pitcher.",
      "content": "Continue pouring the wine back and forth between the pitcher. Do this for a total of 15 times. [3] X Research source"
    },
    {
      "title": "Serve the wine.",
      "content": "Serve the wine. At this point, you can pour the wine into the wine glasses, or you can pour it back into its original bottle. Place a funnel into the neck of the bottle first, so that you don't spill any wine."
    },
    {
      "title": "Choose a red wine glass with a large bowl.",
      "content": "Choose a red wine glass with a large bowl. Red wine glasses are different from white wine glasses for a reason: to help aerate the red wine. If you are serving a larger number of people, you can use a red wine decanter instead. [4] X Expert Source Murphy Perng Wine Specialist Expert Interview. 15 March 2019. Choose one with a larger bowl."
    },
    {
      "title": "Pour some tannic red wine into the glass.",
      "content": "Pour some tannic red wine into the glass. Stop pouring at the widest part of the glass. This will allow more of the wine to come in contact with the air. It will also prevent any sloshing or spilling when you swirl the wine. [5] X Research source As you pour, try to hold the bottle about 10 inches (25.4 centimeters) above the glass. This way, the wine will be exposed to more air on its way into the glass."
    },
    {
      "title": "Set the wine aside and let it breathe for at least 45 minutes.",
      "content": "Set the wine aside and let it breathe for at least 45 minutes. [6] X Research source The younger the wine is, the longer it will need to sit. For example, a young wine might need to sit for up to six hours, whereas an older wine might turn to vinegar after one hour. [7] X Research source If you are pouring an old, fragile, and mature wine, drink it within 30 minutes. Don't let it sit any longer than that. Lighter bodied red wines, such as pinot noir's, typically need only 15 to 20 minutes to breathe, if that."
    },
    {
      "title": "Swirl the wine in its glass and take a sip to test the flavor.",
      "content": "Swirl the wine in its glass and take a sip to test the flavor. Swirling the wine in the glass helps aerate it further."
    }
  ]
}