{
  "url": "https://www.wikihow.com/Clean-Bronze",
  "title": "How to Clean Bronze",
  "steps": [
    {
      "title": "Mix ⅔ cup (158 ml) of white vinegar and ⅔ cup (158 ml) of flour in a bowl.",
      "content": "Mix ⅔ cup (158 ml) of white vinegar and ⅔ cup (158 ml) of flour in a bowl. Use a bowl that is big enough to allow you to mix the two ingredients together without the flour flying everywhere. Blend these two until they are fully mixed together. [1] X Research source"
    },
    {
      "title": "Add ½ cup (118 ml) of salt to your mixture and stir.",
      "content": "Add ½ cup (118 ml) of salt to your mixture and stir. Your mixture should now be a paste of the vinegar, flour, and salt. [2] X Research source"
    },
    {
      "title": "Spread the paste on your bronze.",
      "content": "Spread the paste on your bronze. You can put a glove on your hand, dip it into the paste, and then spread it onto your bronze piece. You can also use a sponge. If your item is something small, like a piece of jewelry, place the jewelry in the bowl. Be sure that your item is completely covered in the paste. Then, leave the paste on for 1-2 hours. [3] X Research source"
    },
    {
      "title": "Rinse your bronze with warm water.",
      "content": "Rinse your bronze with warm water. After 1-2 hours, bring your item to the sink and rinse it under warm water. If your item is large and can’t be moved, bring a pot or bucket of warm water over to it, and pour the water over the item to rinse the paste off completely. [4] X Research source"
    },
    {
      "title": "Use a soft cloth, such as a chamois leather cloth, to dry the bronze.",
      "content": "Use a soft cloth, such as a chamois leather cloth, to dry the bronze. While you are drying the bronze, rub it with the cloth to remove any marks. Make sure it is completely dry and that all the paste is removed. [5] X Research source"
    },
    {
      "title": "Rub a dab of olive oil onto the bronze.",
      "content": "Rub a dab of olive oil onto the bronze. Add a few drops of olive oil to a soft clean cloth and rub it over the surface of your bronze. Olive oil has been a method for cleaning and protecting bronze since ancient times. [6] X Research source"
    },
    {
      "title": "Place your item in a pot of boiling water on your stove.",
      "content": "Place your item in a pot of boiling water on your stove. Choose a pot that is big enough to hold your entire bronze item. Bring the water to a boil first, and then place your bronze inside the pot. Leave it in the pot for a moment or two, until it is hot. [7] X Research source If your item is too large to fit in a pot of boiling water, consider using a different method to clean it."
    },
    {
      "title": "Remove the item from the pot carefully.",
      "content": "Remove the item from the pot carefully. Use tongs to grab the item from the hot water, or use a strainer to drain the water. Place the strainer in the sink, and carefully pour the water from the pot into the strainer. If your bronze item is delicate, be careful not to let it fall too far into the strainer."
    },
    {
      "title": "Dip a flannel cloth in water and soap.",
      "content": "Dip a flannel cloth in water and soap. The flannel cloth should be soapy and full of suds. Use it to pick up the warm bronze item, and then rub the item thoroughly with the cloth. Remove any marks or stains with gentle rubbing. [8] X Research source Use a natural, unscented soap. Avoid using alkaline soaps that don't have sodium hydroxide as an ingredient. Also, if your bronze is lacquered, avoid using detergents that have pyrophosphates, such as Tide, or solutions made of ammonia. These can cause the coating on your bronze to deteriorate. Be careful not to burn yourself if the bronze is still very hot. You can use the cloth as a barrier between your skin and the bronze."
    },
    {
      "title": "Dry the bronze with chamois leather or a shammy.",
      "content": "Dry the bronze with chamois leather or a shammy. Chamois leather is sheep or lambskin leather that is tanned using natural oils. It is known for being absorbent and non-abrasive, so it will not damage your bronze as you dry it. [9] X Research source"
    },
    {
      "title": "Cover your item with ketchup.",
      "content": "Cover your item with ketchup. Using a sponge, your hand (in a glove, if you want to avoid a mess), or simply a bowl full of ketchup, apply ketchup to the entire surface of your bronze. Let it stay covered in ketchup for about 15 minutes. Rinse it with warm water, and then dry it with a soft cloth. [10] X Research source"
    },
    {
      "title": "Apply lemon juice to your bronze item.",
      "content": "Apply lemon juice to your bronze item. You can squirt lemon juice onto it, or soak the item in lemon juice for 15-20 minutes. Remove the item, rinse it with warm water, and then dry it thoroughly with a soft cloth. [11] X Research source"
    },
    {
      "title": "Soak your item in white vinegar and water overnight.",
      "content": "Soak your item in white vinegar and water overnight. Pour equal portions of white vinegar and water into a large bowl, and soak your item in the solution overnight. The next morning, rinse your item off in warm water and dry it with a soft cloth. If your item is large, such as a statue, this method will be more difficult. If you do not have a bowl large enough to fit the statue inside of, consider trying a different method for cleaning. [12] X Research source"
    }
  ]
}