{
  "url": "https://www.wikihow.com/Add-Nitrogen-to-Compost",
  "title": "How to Add Nitrogen to Compost",
  "steps": [
    {
      "title": "Add fresh grass clippings to the compost.",
      "content": "Add fresh grass clippings to the compost. Collect the grass clippings left after you mow your lawn. Add the clippings in thin layers to the compost so that it doesn't clump up into big chunks. [1] X Research source Make sure that your grass clippings are fresh because dried grass clippings will add carbon to the compost. [2] X Research source"
    },
    {
      "title": "Add leafy plant clippings to the compost.",
      "content": "Add leafy plant clippings to the compost. Green plant clippings, weeds, and freshly cut flowers from your lawn can also increase the nitrogen found in your compost. After trimming the plants on your lawn, add the remains to your compost. Do not, however, let the green material dry out or you'll be adding more carbon to the compost. [3] X Research source Do not add badly diseased or insect-infested trimmings, or weeds that contain seeds to your compost unless your compost is hot enough to destroy them."
    },
    {
      "title": "Add chicken droppings.",
      "content": "Add chicken droppings. Chicken droppings are extremely rich in nitrogen and most poultry farmers are happy to give it away if you want. Just make sure the chicken manure you’re adding to the compost is aged."
    },
    {
      "title": "Add aged manure to increase the nitrogen in your compost.",
      "content": "Add aged manure to increase the nitrogen in your compost. A ratio of one part aged manure for every five parts of carbon material will bring your compost's nitrogen level to a healthy level. Look for aged manures or fertilizers that have a high nitrogen number, such as a 48-0-0 fertilizer. In a 5x5 foot (1.52 x 1.52 m) bin of compost you'd add 1/3 to 1/2 cup (113 - 170 g) of fertilizer to the compost."
    },
    {
      "title": "Pour corn-gluten meal into the compost.",
      "content": "Pour corn-gluten meal into the compost. Read the instructions on the back of the corn gluten meal to know how much you should add to your compost. Sprinkle the meal on top of the compost to increase the compost's nitrogen levels. You can purchase corn-gluten meal online or at some gardening stores."
    },
    {
      "title": "Combine coffee grounds into your compost.",
      "content": "Combine coffee grounds into your compost. Add one part coffee grounds to one part grass clippings and one part leaves to create a nitrogen rich compost pile. Coffee grounds contain 20 parts of nitrogen to one part of carbon, making it an exceptionally nitrogen-rich amendment. Use the leftover coffee grounds from after you brew coffee. If mold grows on your coffee grounds you can still use them because it will be broken down during the composting process, or help in the process."
    },
    {
      "title": "Add fruit and vegetable scraps to your compost.",
      "content": "Add fruit and vegetable scraps to your compost. Instead of throwing away vegetable and fruit scraps, add them to your compost pile after you're done with ingredient preparation. These are high in organic material and will add nitrogen to your compost pile. [4] X Research source"
    },
    {
      "title": "Be wary of adding meat, feces, eggs, or dairy products to compost.",
      "content": "Be wary of adding meat, feces, eggs, or dairy products to compost. These compost ingredients may attract wild animals if not covered. A well-running pile can POSSIBLY accept them. Avoid adding pet feces to the compost because it could spread disease."
    },
    {
      "title": "Lay twigs, straw, and dry leaves inside of a container.",
      "content": "Lay twigs, straw, and dry leaves inside of a container. Lay 4 - 8 inches (10.16 - 20.32 cm) of dry leaves twigs and straw on the bottom of a closed container. This carbon-rich material will help aerate the bottom of the compost and help keep it moist. [5] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Lay down 4 - 8 inches of nitrogen-rich material.",
      "content": "Lay down 4 - 8 inches of nitrogen-rich material. Use organic material like lawn clippings or table scraps and layer it on top of your twigs and leaves."
    },
    {
      "title": "Continue to alternate layers of carbon-rich and nitrogen-rich material.",
      "content": "Continue to alternate layers of carbon-rich and nitrogen-rich material. Continue to lay down the dry twigs and green organic material in layers until your compost pile is around 3 feet (91.44 cm) deep. [6] X Research source"
    },
    {
      "title": "Spray the organic material with water.",
      "content": "Spray the organic material with water. The compost materials should remain moist so that it breaks down to form compost. Check on your compost daily to make sure that it isn't drying out from the hot sun. Spray down the organic material every day so that it stays moist. [7] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Keep the bin in the sun.",
      "content": "Keep the bin in the sun. The center of the compost should be kept at 130 -150°F (54.4 - 65.5°C) if possible. Use a thermometer to get the temperature of the compost. Keeping the compost at a high heat will increase decay and quicken the time that the material turns into compost. You can also cover the container for the compost so that animals can't get into it, but this may cut off air supply. [8] X Research source Without heat, the compost will take anywhere from 6 -12 months to fully break down."
    },
    {
      "title": "Turn the compost once a week.",
      "content": "Turn the compost once a week. Continue to keep the compost hot and wet. Turning the compost over once a week will add oxygen to the compost, a necessary component to composting. [9] X Research source"
    },
    {
      "title": "Wait two months.",
      "content": "Wait two months. Continue to turn your compost once a week and water it regularly. In two to three months the compost will ultimately break down. When the compost is ready it will be brown, crumbly, and sweet-smelling. You can now use the compost to promote healthy growth in your lawn and plants. [10] X Research source"
    }
  ]
}