{
  "url": "https://www.wikihow.com/Avoid-a-Girl-Who-Doesn%27t-Love-You-Back",
  "title": "How to Avoid a Girl Who Doesn't Love You Back",
  "steps": [
    {
      "title": "Tell her you can’t be around her.",
      "content": "Tell her you can’t be around her. You should start by letting her know that your relationship is too damaging to you for it to continue. Clearly tell her that you can’t be around her anymore. Face-to-face contact is best. However, if you have to, you can call, text, or email. Say something like “I know you don’t share my feelings, so I think it's best we don’t hang out anymore.” Make sure to be polite and caring. Your goal should be to minimize contact with her, not to hurt her feelings."
    },
    {
      "title": "Walk away from her.",
      "content": "Walk away from her. If you run into her after letting her know you don’t want to be around her anymore, you need to walk away from her. Remember, though, it is better to subtly pass her by than to look as if you’re running away from her. This works best after you’ve already let her know that you can’t be around her anymore. Otherwise, she’ll wonder what’s going on and won’t understand. If you run into her by coincidence, you may want to politely acknowledge her before walking away. For instance, wave at her, smile, and keep walking. Avoid being rude or blurting out things like “I can’t see you anymore” in front of other people. [1] X Research source"
    },
    {
      "title": "Move out.",
      "content": "Move out. If you live together, you should move out. By living with her, you’ll have to confront her daily. This will likely hurt you and cause unneeded stress in your life. If you live in the same room, you should probably arrange to stay at a friend’s house until you can get your living situation sorted out. If you have different rooms in the same apartment, plan not to renew your lease. In addition, try to locate someone to sublet your room. Remember, even though you’re having personal problems, you are still obligated to pay rent to your landlord. Whatever you decide to do, you need to make sure your contractual obligations are fulfilled – this may include giving your landlord a 30-day notice that you are vacating. It is important to move out, as continuing to live together will hamper both of your abilities to move on. [2] X Research source"
    },
    {
      "title": "Plan outings without her.",
      "content": "Plan outings without her. By minimizing contact, you’ll be able to limit the damage the relationship can do to you. To do this, make sure you plan your social outings so you won’t have to hang out with her. Avoid socializing at places you know she frequents. For example, if she hangs out at a specific coffee house, stay away from it. Hangout with friends from another social circle. Inform your friends that you don’t want to be around her. This way, they can be conscious of the social activities they plan that involve you. [3] X Research source"
    },
    {
      "title": "Look to the future.",
      "content": "Look to the future. Don’t let one problematic relationship blind you to the fact that you have plenty going on in your life and have a lot to look forward to. Instead, try to think about the good things the future has in store for you. Think about where you’ll be in 1, 5, or 10 years. Does she really figure into your life plans? Consider other girls you know and may be interested in dating. That should give you motivation to try to avoid her."
    },
    {
      "title": "Be more confident.",
      "content": "Be more confident . Without confidence, you’ll likely get involved with people who aren’t good for you. There are several things you can do to build your confidence: Ask prior romantic partners about your positive attributes. Avoid scrutinizing yourself and focusing on your negative qualities. Tell yourself that you are an awesome person and should be valued and loved. [4] X Research source"
    },
    {
      "title": "Meet other people.",
      "content": "Meet other people. The easiest way to avoid a girl that doesn't love you is to look around for those that may truly value you. By getting out into the world and meeting a lot of people, you’ll set yourself up for positive and healthy relationships. Try to truly take in the compliments you receive from others, and try to build those positive relationships. Look for people who share your interests. Don’t view one or two dates as a commitment. Play the field a little and try to date a lot of people. The more people you meet, the more likely you are to find someone that will share your feelings. Get to know people in your friend group. [5] X Research source"
    },
    {
      "title": "Reflect on the history of the relationship.",
      "content": "Reflect on the history of the relationship. Your first step in figuring out if a girl doesn’t love you is to think about the relationship itself. By reviewing the history of your relationship, you’ll get a good idea of its problems and strengths, and be better positioned to walk away from it. Was the relationship ever different? For example, was there a time you thought the girl loved you? Make a list of the things you thought you shared. Reflect to see if these were more things you wanted to share, or things you actually connected over. Have you ever been romantically involved with her? If you’re not and never have been, she might view the relationship differently than you do. [6] X Research source"
    },
    {
      "title": "Determine if the relationship is abusive.",
      "content": "Determine if the relationship is abusive. After reflecting on the history of the relationship, you should think about whether it is somehow abusive. Some questions to ask yourself include: Does she verbally or physically abuse you? Does she consistently make you feel bad about yourself? Does she accept affection and compliments but never return them? Did she take advantage of your interest or affection? [7] X Research source"
    },
    {
      "title": "Look for ulterior motives.",
      "content": "Look for ulterior motives. Reflect a little on whether the girl in question has ulterior motives for being with you, being around you, or interacting with you. Once you think about this, you’ll have a better idea of whether she really doesn’t share your feelings. Consider if: You hang out in a friend group that is very popular (and she does not). She asks, or even expects, you to buy things for her. You have a friend she is really into. [8] X Research source Reader Poll: We asked 1779 wikiHow readers, and 53% of them agreed that the biggest red flag that a girl might be using you is if you feel like she is with you for your money . [Take Poll]"
    },
    {
      "title": "Observe if she returns your affection.",
      "content": "Observe if she returns your affection. Spend some time watching your interactions with her and determining if she doesn’t return your affections. If she doesn’t, you’re likely in an unhealthy relationship of some sort. Watch to see if she hugs back when you hug her. Ask yourself whether she enjoys physical contact with you. For example, does she like holding hands with you? Does she ever initiate any physical contact? Listen to see how she responds when you tell her you love her. For example, does she respond “I love you, too” or does she remain silent or even say something like “thanks.”"
    },
    {
      "title": "Engage in an honest conversation.",
      "content": "Engage in an honest conversation. The best way to find out how she feels about you is to engage her in a truthful conversation about both of your feelings. Without an honest conversation, you won't know for sure how she feels. Ask her to talk about your relationship. Make your feelings clear. Inquire about her feelings. Tell her not to spare your feelings. While it may hurt a little at first,"
    },
    {
      "title": "Find out if she is in a relationship.",
      "content": "Find out if she is in a relationship. If she is in a relationship, she may be uninterested in you or unable to express her feelings about you. Either way, you'll likely wind up being disappointed. Her mentioning her significant other should be a good sign that she is not interested in a relationship with you. [9] X Research source"
    },
    {
      "title": "Consider if she is in a different social circle.",
      "content": "Consider if she is in a different social circle. If you find yourself having romantic feelings for someone from a vastly different social circle, you may run into problems. This is especially true if the girl in question is considered dramatically cooler or hipper. If you are in a different social circle, you may have trouble getting one-on-one contact time. As a result, you may be unable to communicate that you'd like a romantic relationship. Consult your friends as to whether the girl in question is \"out of your league.\" Think seriously about your feelings if they tell you that the girl is too cool or too attractive for you. It is okay to try to pursue someone from outside your social circle. Just make sure you are open to unspoken cues she might send that suggest she is not interested in you. In addition, if she explicitly tells you that she is uninterested, you should back off. [10] X Research source"
    },
    {
      "title": "Think about whether she is trying to avoid relationships.",
      "content": "Think about whether she is trying to avoid relationships. You might find yourself having feelings for someone who for some reason isn't interested in getting into a relationship. If she's avoiding relationships for the time being, you may need to back off for now, but not necessarily for forever. Reflect on whether: She recently got out of a relationship that left her hurt or sad. She is focused on academics or her career. She has a lot going on in her life which leaves little time for romantic relationships."
    }
  ]
}