{
  "url": "https://www.wikihow.com/Care-for-a-Skink",
  "title": "How to Care for a Skink",
  "steps": [
    {
      "title": "Feed your skink a diet of insects.",
      "content": "Feed your skink a diet of insects. Skinks primarily eat insects. You can buy insects at a pet store. If there's not a pet store near you that caters to reptiles, you can see if you can purchase insects online. [1] X Research source Feeder insects and crickets should be the main staple of your skink's diet. King worms and mealworms are appropriate to feed to your skink on occasion. Make sure prey is live. Skinks will not eat insects they do not have to stalk."
    },
    {
      "title": "Supplement your skink's diet with fruits and vegetables.",
      "content": "Supplement your skink's diet with fruits and vegetables. In addition to eating insects, skinks enjoy a variety of fruits and vegetables. This can help supplement your skink's diet by adding some extra nutrients. [2] X Research source Brussels sprouts, carrots, greens, and peas are good vegetables to serve your skink. Fruits that skinks enjoy include blueberries, mangos, raspberries, papayas, cantaloupes, strawberries, and figs."
    },
    {
      "title": "Avoid certain products.",
      "content": "Avoid certain products. Always read nutritional information before feeding your skink. Skinks should not be fed food that's treated with pesticides. You should also avoid giving your skink any food with artificial coloring. Foods that contain by-products, like chicken and meat/bone meal, should not be given to a skink. [3] X Research source"
    },
    {
      "title": "Replace your skinks' water each day.",
      "content": "Replace your skinks' water each day. Skinks tend to get a lot of sand and debris in their water. You should have a water bowl in your skink's cage that cannot easily tip over. As it will get contaminated frequently, replace the water in this bowl each day. [4] X Research source"
    },
    {
      "title": "Get the right size tank for your skink.",
      "content": "Get the right size tank for your skink. Bigger is better when it comes to a skink's tank. Skinks need lots of room to roam to be healthy and happy. Hatchlings can be comfortable in a 10 to 20 gallon (37.9 to 75.7 L) tank. If you have a larger skink, make sure the tank is at least 30 to 40 gallons (110 to 150 L). If you have the space or money for a bigger tank, it's always nice for a skink to have extra room to roam. [5] X Research source"
    },
    {
      "title": "Fill the tank with substrate.",
      "content": "Fill the tank with substrate. Substrate is the substance used to fill the bottom of a tank. It's important to use a substrate that's comfortable for your skink. At least 6 inches (15.2 cm) of a quality substrate is necessary for your skink. [6] X Research source A mixture of soil, sand, and wood chips is usually a good option. If you have a pet store near you that sells reptiles, you may be able to find a substrate specifically for skinks there. Make sure to keep the substrate damp. The substrate should not be soaking wet, but it should have some moisture. Skinks require a somewhat humid environment."
    },
    {
      "title": "Keep the tank at the right temperature.",
      "content": "Keep the tank at the right temperature. Skinks require both a warm and cool end of their tank. Reptiles keep their bodies warm and cold by shifting between two different environments. [7] X Research source One area of the tank should be slightly above room temperature. A few UV lightbulbs near the cooler end of the tank should keep it warm enough. Make sure not to place the tank anywhere in your house where it gets very cold or very hot during certain times of the day. Another area should be around 90 degrees. You can get an under tank heating device, which you can purchase at a pet store. You can also use an overhead heating lamp. If you use both, turn the heating lamp off at night."
    },
    {
      "title": "Maintain adequate humidity.",
      "content": "Maintain adequate humidity. The tank does not need to be extremely humid, and does not require regular misting like other reptile tanks. Damp substrate should keep the tank humid, but you also need to provide your skink with a water bowl. Get a shallow water bowl for the tank big enough for your skink to lie down in. [8] X Research source"
    },
    {
      "title": "Give your skink plenty of space to dig and hide.",
      "content": "Give your skink plenty of space to dig and hide. Skinks will get bored or anxious if they don't have hiding spaces in their tank. Stop by your local pet store and get things like hidey holes and other enclosures. Place these around the tank so your skink can have a hiding place when it wants privacy. [9] X Research source Make sure your substrate remains six inches deep. This will allow your skink to hide when it wants to."
    },
    {
      "title": "Avoid cage mates in general.",
      "content": "Avoid cage mates in general. For the most part, skinks will not do well with a cage mate. Stick to one skink per tank. Skinks tend to be territorial. If you introduce a cage mate, one or both skinks may end up with bite marks or missing limbs. [10] X Research source"
    },
    {
      "title": "Introduce tank mates only if they're a similar size.",
      "content": "Introduce tank mates only if they're a similar size. If you have your heart set on a second skink, exercise extreme caution. Make sure the tank mate is the same size as your current skink. Skinks will attack smaller skinks. If the skinks begin fighting, you should resign yourself to keeping them in separate cages. If you have a fire skink, these tend to be very territorial. It's a bad idea to introduce a cage mate."
    },
    {
      "title": "Handle your skink with care.",
      "content": "Handle your skink with care. Skinks can learn to be social, but proper handling is required. When handling your skink, make sure to treat it with respect. Improper handling can cause your skink to bite and become aggressive. [11] X Research source Never handle a skink when it's not expecting it. Do not pick up a sleeping skink. Make sure the skink knows you're there before you attempt to pet it or pick it up. Make sure to support a skink's body weight when holding it. Do not turn a skink upside down. This causes distress. Avoid any abrupt movements when handling a skink."
    },
    {
      "title": "Make sure children know how to safely handle a skink.",
      "content": "Make sure children know how to safely handle a skink. Talk to children about the proper rules for handling a skink. Make sure they understand to handle the skinks with care, and not to do anything that could frighten them. You may want to avoid letting very young children handle a skink, as they may not understand how to control themselves around an animal. [12] X Research source"
    }
  ]
}