{
  "url": "https://www.wikihow.com/Contribute-to-wikiHow",
  "title": "How to Contribute to wikiHow",
  "steps": [
    {
      "title": "Sign up for an account for access to more tools.",
      "content": "Sign up for an account for access to more tools. While wikiHow allows anonymous users to edit most pages, creating an account gives you more tools to improve wikiHow. [1] X Research source You can also maintain one talk page instead of having your IP address change consistently, which is better for communicating with the rest of wikiHow’s contributors. Registered users can also start their own user page with an introduction about yourself, contribution statistics (e.g. articles started, article views, and more), and more."
    },
    {
      "title": "Help wikiHow readers by answering their questions about your favorite topics",
      "content": "Help wikiHow readers by answering their questions about your favorite topics . Use our Answer Questions tool to answer questions that real life readers have about the topics on our site. You can filter the queue by the topics you're an expert in, and dive in to provide help where you know the answers."
    },
    {
      "title": "Edit in the Topic Greenhouse",
      "content": "Edit in the Topic Greenhouse . Choose a category of articles you enjoy and edit articles about them. Expand and improve them, or even a simple edit would help improve the article. You can also run a search for topics you might be interested in and see if you can add information or make adjustments. No matter how minor or major it is, if it's helpful, any change is encouraged. As long as you don't vandalize articles, you may contribute indefinitely to any topic of your knowledge."
    },
    {
      "title": "Fix the issues, typos, and mistakes.",
      "content": "Fix the issues, typos, and mistakes. Are you a perfectionist ? If you see any kind of mistake, you can always click on the \"Edit Article\" tab at the top of an article and fix it on the spot. You don't even need to register. You can also use our Community Dashboard tools to focus on problems like these: Use the spellchecker tool to help fix potential spelling errors on different articles. Read our copyediting tips and use the Copyediting Greenhouse tool to tackle the articles that need help. Check out our formatting guidelines and use the Formatting Greenhouse tool to reformat articles that need it. Use the Cleanup Greenhouse tool to help out with articles that need all kinds of help: copyediting, reformatting, and other tweaks."
    },
    {
      "title": "Help us get organized.",
      "content": "Help us get organized. Use the Categorizing tool. Categorizing helps our readers find the articles they're looking for."
    },
    {
      "title": "Help us patrol recent changes.",
      "content": "Help us patrol recent changes . On any wiki, there's a queue of Recent Changes (RC) that show every change or addition that's been made to the site and allows volunteers to accept or rollback those changes. Most of the edits made on any given day are helpful, and any bad edits (vandalism) are usually quickly reverted by an RC patroller. Would you like to help out? Check out how it is done in this article: How to Patrol Recent Changes on wikiHow. Along similar lines, you can use other patrol tools to check other kinds of additions. You can use the Quality Guardian to vote on whether recently added videos are a good fit for the articles they've been added to."
    },
    {
      "title": "Write a new article on a topic that hasn't been started yet.",
      "content": "Write a new article on a topic that hasn't been started yet. Do you love to write ? Anyone can start a new page on wikiHow, even anonymous contributors! If you're not sure of what to write about, go to the Write an Article page and scroll down to the \"I want topic suggestions\" section. Type in a keyword and hit \"Submit\". This will give you ideas for articles that may not have been written about on wikiHow yet. Click on any red title to start that article. There are over 230,000 articles on wikiHow, so the topic you want to write about may already be covered. Articles on duplicate topics are merged, so your best bet is to edit the existing guide and improve it."
    },
    {
      "title": "Work on adding images or screenshots.",
      "content": "Work on adding images or screenshots. Do you like to take photographs or draw ? Look at our list of articles in need of step-by-step pictures. Consider taking instructional photos and adding them to articles! If you like to draw, many of our pages need diagrams too. You can scan or photograph your drawings and upload them the same way you would a photo. If you like or are good at taking screenshots, you can also look at our list of articles in need of screenshots. Consider taking screenshots and adding them to articles!"
    },
    {
      "title": "Help ensure accuracy.",
      "content": "Help ensure accuracy. Are you good at fact-checking and research ? Become familiar with our research standards and learn how to format citation links on wikiHow, then... Try your hand at accuracy patrol. Browse articles tagged as needing citations. Usually you'll see at least one sentence with \"citation needed\" at the end (e.g. [ citation needed ] ). Verify whether that statement is accurate and correct or remove it. Don't forget to remove the \"citation needed\" template by erasing {{fact}}. Expand a stub. Some articles are incomplete and need significant help to reach their full potential. Feel free to get involved with a major revision. Browse articles tagged as being unclear and see if you can clarify or elaborate."
    },
    {
      "title": "Add instructional videos.",
      "content": "Add instructional videos. If you enjoy watching instructional videos, then help us add them to our articles. Go to the Video Adder to view articles that need videos, or go to any article that doesn't have a video yet and add a video."
    },
    {
      "title": "Go to the new pages list and edit new articles.",
      "content": "Go to the new pages list and edit new articles. Fix spelling mistakes on them, copyedit or format it, etc. Leave a message for the contributor that started the article, and if they're new, you can welcome them to wikiHow. Mention that they did a good job creating a helpful article, and give them praise. Once you have some experience in reviewing new pages, you can become a New Article Booster if you meet the requirements. Boosters improve new articles so that they are ready for the public, and they also provide encouragement and friendly advice to new editors. All you'll need to do is have a valid email address and take a three-part test."
    },
    {
      "title": "Offer thanks and praise to your fellow editors.",
      "content": "Offer thanks and praise to your fellow editors. Appreciate their excellence, enthusiasm, and dedication. Add an award to an editor's Talk page. These acts of kindness increase the strength of our community. wikiHow is contributed by people from various countries, professions, age groups, colleges, and much more. You will find many who share something in common with you and those who are absolutely unique. Many of the articles are contributed by members who have experience with the information. For example, many articles about autism are written and maintained by autistic people who have transformed the category and the articles tremendously."
    },
    {
      "title": "Make suggestions along the way.",
      "content": "Make suggestions along the way. After contributing to wikiHow, you may have many helpful ideas in mind which you may discuss on the 'talk pages' of other editors. Although it is not guaranteed that your suggestion will be implemented, it's always worth sharing ideas, reflecting on policies and guidelines, and chiming in if you have opinions about particular articles and how they could better help people."
    }
  ]
}