{
  "url": "https://www.wikihow.com/Abrasive-Personality",
  "title": "14 Common Traits of Abrasive People and How To Deal With Them",
  "steps": [
    {
      "title": "People with abrasive personalities are often harsh and blunt.",
      "content": "People with abrasive personalities are often harsh and blunt. These are the types of people who will usually “rub others the wrong way.” When they interact with others, they can come off as quite overbearing, obnoxious, and even aggressive at times. They usually have no problem speaking their mind and taking control of a situation. [1] X Research source While the abrasive personality isn’t an official psychological diagnosis, there have been proposals to distinguish Abrasive Personality Disorder (AbPD) as an official personality disorder. [2] X Research source Abrasive behaviors can be self-conscious or unconscious. A self-conscious abrasive personality means the person intentionally acts aggressively or harshly. On the other hand, people who are unconsciously abrasive don’t realize that their comments or behaviors hurt others."
    },
    {
      "title": "They’re controlling and bossy.",
      "content": "They’re controlling and bossy. People with abrasive personalities often have very dominating personalities. The phrase “My way or the highway” probably best describes abrasive people. They often have no problem giving orders to other people and being overly nitpicky about others’ mistakes. This need for control might also make them reluctant to listen to people who have more authority than them. [3] X Research source For example, an abrasive manager might micromanage their employees and make unreasonable requests, such as asking them to work overtime most days of the week. An abrasive friend might always try to take over the conversation instead of letting everyone speak. Or, during a group project, an abrasive classmate might immediately start ordering others around and assigning roles before the entire group even has a chance to discuss things together."
    },
    {
      "title": "They’re aggressive.",
      "content": "They’re aggressive. Abrasive people are aggressive with both their words and actions. They might make comments that sound overly critical or harsh, and they may even raise their voice or swear at others. In terms of physical aggression, some abrasive people even go as far as hitting objects or throwing things when they’re frustrated. [4] X Research source For example, an abrasive person might bully others into doing what they want. Or, they might use intimidation to force others to give them the respect they think they deserve. Some people with abrasive personalities may even commit physical violence against others. If you find yourself in such a situation, seek help immediately. If someone at your place of work is being physically aggressive, contact your HR department as soon as possible."
    },
    {
      "title": "They’re impatient and intolerant of weakness.",
      "content": "They’re impatient and intolerant of weakness. People with abrasive personalities often have very high standards for other people, and they may be impatient if someone isn’t able to meet these expectations. They may get frustrated quickly when people ask too many questions or don’t understand something right away, or they might simply ignore someone they feel doesn’t live up to their standards. [5] X Research source For example, an abrasive manager might easily get frustrated when training a new employee and be very condescending. When an abrasive friend is explaining something to another person, they might roll their eyes when asked a question."
    },
    {
      "title": "They lack empathy.",
      "content": "They lack empathy. Abrasive individuals may not be the best candidates for providing comfort or reassurance when someone is going through a tough time. In fact, many abrasive people are often viewed as cold or distant, and they may have a hard time putting themselves in someone else’s shoes for the sake of offering empathy. Abrasive people might also not be as willing to open up to others and be vulnerable. [6] X Research source For example, an abrasive person might just tell their partner something like, “That sucks” or “Toughen up” when they come to them with a problem. An abrasive manager might not sympathize with their employees or cut them some slack when they’re facing a tough situation in their personal lives."
    },
    {
      "title": "They’re a perfectionist.",
      "content": "They’re a perfectionist. Many people with abrasive personalities are extremely intelligent and have high standards for their work. However, such traits often translate into perfectionist tendencies, and abrasive people are usually quite rigid when it comes to rules. They may also be very nitpicky and accuse others of doing things incorrectly. [7] X Research source For example, an abrasive person might constantly nag their partner about how messy the house is and constantly say things like, “Why haven’t you cleaned yet?” An abrasive boss might have very strict rules about how things need to be done and be unfairly harsh when reprimanding employees for making a mistake."
    },
    {
      "title": "They always have to be right.",
      "content": "They always have to be right. Abrasive people tend to be very opinionated, and their opinions always need to be right. If someone gets into an argument with an abrasive person, they might find it hard to get the other person to see things from their perspective or acknowledge their thoughts. [8] X Research source For example, a family member with an abrasive personality might frequently get into arguments about politics during big family get-togethers. Or, an abrasive romantic partner might insist they know best when it comes to financial planning for them and their partner despite having no real expertise on the subject."
    },
    {
      "title": "They’re competitive.",
      "content": "They’re competitive. Their perfectionist tendencies and often high levels of intelligence can make an abrasive person incredibly determined to always come out on top. Abrasive people also often come across as very ambitious due to this competitiveness, which can be both a good and bad thing depending on the situation. [9] X Research source For example, an abrasive manager’s competitiveness might give them the courage to take risks that’ll help their company excel above competitors and be more innovative. However, they may also become blinded by their competitive streak and ambition and neglect the wants and needs of their employees."
    },
    {
      "title": "They’re condescending and insulting.",
      "content": "They’re condescending and insulting. It’s not uncommon for an abrasive person to make insulting or belittling comments toward others, both intentionally and unintentionally. Their perfectionist mindset can cause them to become easily frustrated with others and make a condescending comment, or they may simply not realize their words are hurtful. [10] X Research source For example, an abrasive boss might call their employees “stupid” or “incompetent” when they make a mistake. An abrasive friend or partner might often make sarcastic comments, such as “Wow, are you just this bad at everything?”"
    },
    {
      "title": "They think they’re above everyone else.",
      "content": "They think they’re above everyone else. It’s not uncommon for an abrasive person to have a somewhat inflated sense of self. They might view themselves as “special” and believe that they’re entitled to special treatment and privileges. [11] X Research source For example, an abrasive coworker might loudly complain about how they deserve a raise despite the fact that their performance is only average. Or, an abrasive friend might not have any problem complaining to the management at a restaurant about having to wait for a table even though everyone else is waiting patiently."
    },
    {
      "title": "They’re overly sensitive to criticism.",
      "content": "They’re overly sensitive to criticism. Abrasive people often have no issue with doling out critical or harsh comments, but they can get very defensive when the roles are reversed. For example, they may simply brush off feedback from a coworker, boss, or teacher, or they might even get defensive when someone points out their mistakes. [12] X Research source For example, instead of accepting constructive criticism, an abrasive person might make excuses for their behavior and try to justify their actions. Or, they may be more aggressive and try to reroute the conversation by pointing out the other person’s flaws and mistakes."
    },
    {
      "title": "They play the victim and blame others.",
      "content": "They play the victim and blame others. In the mind of an abrasive individual, they can’t do any wrong and are always the victim of unfortunate circumstances. Rather than owning up to their mistakes, an abrasive person is more likely to throw someone else under the bus and blame them for whatever negative results came from their own actions. [13] X Research source For instance, an abrasive manager might blame their business failure on others who supposedly gave them “bad advice.” Or, an abrasive friend might blame an interviewer for being too biased when they don’t get the job they wanted, despite the fact that they have no evidence to prove this."
    },
    {
      "title": "They break the rules to fit their own agenda.",
      "content": "They break the rules to fit their own agenda. Many people with abrasive personalities tend to think that the world revolves around them, and they may feel like the rules simply don’t apply to them. They might ignore policies or social norms because they think they’re unfair or holding them back from getting the things they deserve. [14] X Research source For example, an abrasive person might have no problem with cutting in line because they’re in a rush and feel like they don’t need to wait for others. Or, an abrasive coworker might ignore company policies and simply take time off of work without letting anyone know."
    },
    {
      "title": "They manipulate others for their own gain.",
      "content": "They manipulate others for their own gain. Unfortunately, some abrasive people aren’t above using others to get what they want. This includes behaviors like lying, exaggerating, or even sabotaging others for their own benefit. [15] X Research source For example, an abrasive person might start rumors about their coworker to make themselves look better and get more people to sympathize with them. An abrasive person might also lie about their achievements to get more people to respect them. Abrasive people might also use gaslighting as a way to manipulate others and make them doubt themselves. For example, they might say things like, “Are you sure you’re remembering that correctly?”"
    },
    {
      "title": "They use hostility to control other people.",
      "content": "They use hostility to control other people. Making threats, blackmailing, or using intimidation to get others to do what they want isn’t uncommon for some abrasive people. They may see no issue in being hostile toward others if it means they’re able to get ahead and get what they want. [16] X Research source For example, an abrasive person might blackmail their friend and say they’ll reveal their secrets if they don’t agree to help them with something. Or, an abrasive boss might threaten employees with firing them as a way to keep people in line."
    },
    {
      "title": "Insecurity",
      "content": "Insecurity The root of many individuals’ abrasiveness lies in deep feelings of insecurity, anxiety, or fear. They may have doubts about their own abilities or fear being judged by others, so they compensate by trying to appear like they’re better than everyone else. [17] X Research source Many abrasive people tend to be perfectionists, which can be caused by a buildup of internal pressure, fear of failure, and fear of being criticized by others. [18] X Research source"
    },
    {
      "title": "Childhood abuse or neglect",
      "content": "Childhood abuse or neglect For some abrasive individuals, the unfortunate reality is that they may have faced emotional or physical abuse or neglect while growing up. Such treatment may have caused them to feel insecure and distrusting of others, leading to a cold, distant, and abrasive personality in adulthood. [19] X Research source"
    },
    {
      "title": "Other personality disorders",
      "content": "Other personality disorders The abrasive personality shares many behaviors commonly seen in other personality disorders, such as narcissistic personality disorder, sadistic personality disorder, and paranoid personality disorder. Common traits include things like manipulative behaviors, distrust, and aggression. [20] X Research source"
    },
    {
      "title": "Have a one-on-one conversation about their behavior.",
      "content": "Have a one-on-one conversation about their behavior. Some abrasive people don’t even realize that their words and actions are hurting others. To make them aware of their behavior, have a one-on-one conversation with them and address the behaviors that are causing problems. [21] X Research source If you’re dealing with an abrasive partner, friend, or family member, tell them you want to talk and list out the behaviors that have been concerning you lately. It would help using the \"sandwich\" method of communicating with an abrasive personality, which is to state the good (i.e., \"I like your dedication to making things perfect\"); the negative, or meat (i.e. \"I've noticed your comments may come off too harsh to others and perhaps we can talk openly if something is upsetting you without name calling\"); and the good again (i.e. \"I'm glad we can have these conversations—it shows us that we can work together well\"). For dealing with coworkers, managers, or other people in a professional environment, it might help to get HR or another third party involved to make sure that things remain professional."
    },
    {
      "title": "Speak from your perspective and avoid being confrontational.",
      "content": "Speak from your perspective and avoid being confrontational. Fighting fire with fire, or in this case, hostility with hostility, may simply escalate the issue and prevent you from making any progress. Instead, speak from your own perspective and avoid sounding like you’re accusing them of something. To do this, use “I” statements . [22] X Research source For example, instead of saying, “You’re really condescending and insensitive,” say, “I feel really hurt when you belittle my work.” Bring evidence of the other person’s behavior to show them the impact of their actions. Abrasive people may not be ready to listen to your side of the story, but bringing evidence can help convince them that there’s an issue they need to address. For example, bring copies of texts or emails you received from them that included overly harsh or critical language."
    },
    {
      "title": "Set boundaries to help stop the behavior.",
      "content": "Set boundaries to help stop the behavior. While it may not be possible to address every aspect of an abrasive individual’s personality, establishing firm boundaries about the most pressing issues can help set them on the path to changing their behaviors. It’s also important to come up with consequences if these boundaries are broken. [23] X Research source For example, set a boundary like, “You’re not allowed to criticize my work in front of other people.” If the abrasive person is a partner, friend, or family member, consequences might be things like taking time apart, breaking up, or moving out if the behavior persists. When dealing with people at work, school, or other professional environments, get a third party involved (HR, a teacher, a coworker, etc.) to help come up with boundaries and consequences that fit within the rules or policies."
    },
    {
      "title": "Remain calm and positive.",
      "content": "Remain calm and positive. Unfortunately, it can be very difficult to get an abrasive person to acknowledge their behavior and take action to fix it. However, maintaining a positive mindset can help protect you from being affected by their negative behavior. It might also help you stay motivated to help them. [24] X Research source Focus on their positive traits. For example, many abrasive people are actually very intelligent and ambitious people. Compliment these traits of theirs to keep the atmosphere positive and show that you genuinely do want to help them."
    },
    {
      "title": "Surround yourself with positive people.",
      "content": "Surround yourself with positive people. Being around abrasive people can be pretty taxing. While it’s admirable that you want to help them, remember to take some time for yourself and surround yourself with positive, encouraging people. Don’t be afraid to confide in them about what you’re going through and ask for help if you think you need it. [25] X Research source Be sure to set aside time to pursue your hobbies, hang out with friends , and talk with your family. An abrasive person’s behavior can take a toll on your mental and emotional health, so make sure to do things that make you feel happy and help you stay positive."
    },
    {
      "title": "Get a therapist involved if the behavior continues.",
      "content": "Get a therapist involved if the behavior continues. The process of getting a person to recognize and fix their abrasive behaviors can be complicated and may not be something you feel comfortable doing on your own—and that’s okay. There are many professionals out there, such as therapists, who can help an abrasive person confront their actions and give them exercises to change them. [26] X Research source If you’re talking with a partner, friend, or family member, do your best to convince them to see a therapist . Explain the benefits of therapy and reassure them that you’ll be there to support them. It may be inappropriate to bring up the topic of therapy with a coworker, manager, or anyone else in a professional environment. In this case, leave it up to a more authoritative figure or department, such as HR, to provide the abrasive individual with resources and options."
    },
    {
      "title": "Self-reflect on your behavior and interactions with others.",
      "content": "Self-reflect on your behavior and interactions with others. If you’re an abrasive individual, the most important thing is to acknowledge your actions and words that are negatively affecting others. Take some time to self-reflect on the things you’ve said and done, as well as your interactions with other people. Ask yourself these questions: [27] X Research source Is it possible that my words might have sounded rude or insulting? Did people show a negative reaction when we were talking? Does it seem like people intentionally avoid me? Do I make an effort to genuinely listen to other people? Remember—you aren't a bad person for being abrasive, the fact that you want to look at how your actions are hurting others shows great maturity and self-awareness."
    },
    {
      "title": "Set specific goals for traits you want to change.",
      "content": "Set specific goals for traits you want to change. Changing certain traits of your personality is only possible if you’re able to set specific goals that are also realistic. It’s unrealistic to expect yourself to change your entire personality within a month. Start small and identify one or two things you want to improve and give your 100% toward achieving those first before moving on. [28] X Research source Set goals that revolve around actions you can easily keep track of and observe. For example, instead of saying something generic like, “I’ll be less dominating,” say something like, “I will listen to other people and not interrupt when they’re talking.”"
    },
    {
      "title": "Hold yourself accountable for your actions.",
      "content": "Hold yourself accountable for your actions. Change is dependent on your ability to follow through with your actions. While setting goals is a great start, actually making an effort to achieve those goals and fix your behavior is when you’ll start to see improvements being made. Some ways to hold yourself accountable include giving yourself rewards for achieving goals or having another person monitor your progress. [29] X Research source For example, reward yourself with a nice meal or by buying a small treat when you achieve one of your goals. Or, have a friend watch your behavior and ask them for feedback about what you can improve."
    },
    {
      "title": "Seek professional help for more support.",
      "content": "Seek professional help for more support. It’s more than okay if you feel like you need a bit of help in changing these abrasive traits. One idea is to see a therapist who can provide a safe place to talk about your situation and give you advice about how to change your abrasive behavior. [30] X Research source"
    }
  ]
}