{
  "url": "https://www.wikihow.com/Color-Metal",
  "title": "How to Change the Color of Metal with Paint, Heat, or Dyeing",
  "steps": [
    {
      "title": "Soak your metal object in a solution made of 3 parts water, 1 part bleach.",
      "content": "Soak your metal object in a solution made of 3 parts water, 1 part bleach. Mix enough water and bleach to fully submerge the metal object. For instance, you could submerge a metal wrench in a solution containing 3 cups (700 mL) of water and 1 cup (240 mL) of bleach. Soak your object for 20 minutes, then rinse it with plain water. [1] X Trustworthy Source State of Pennsylvania Official website for the State of Pennsylvania Go to source Skip this step if your object is new or doesn’t have any trace of mildew. Wear kitchen gloves while handling your object to protect your hands from bleach."
    },
    {
      "title": "Use a wire brush to remove rust and paint from your object.",
      "content": "Use a wire brush to remove rust and paint from your object. This will help the paint adhere to the metal in later steps. Wear safety googles and a dust mask to protect your eyes and lungs from metal fragments, and use a pair of worker’s gloves to protect your hands from injuries. You can do this with an electric sander, or sand it by hand. Choose sandpaper with a grit between 36 and 100. You can also use liquid rust remover to eliminate rust, paint, and any debris stuck to the metal."
    },
    {
      "title": "Wipe your metal object with a rag soaked in mineral spirits.",
      "content": "Wipe your metal object with a rag soaked in mineral spirits. Mineral spirits are a type of turpentine-free paint thinner, which you can buy from a hardware store. Wipe thoroughly to remove any dust and debris to ensure the paint bonds to the metal in the next steps. Then use a dry rag to wipe away the mineral spirits. If some paint won’t come off the metal, wipe it again with a cloth soaked in turpentine . [2] X Research source Avoid spilling mineral spirits on painted surfaces since it will remove the paint."
    },
    {
      "title": "Spray a smooth, even layer of primer onto the metal and let it dry.",
      "content": "Spray a smooth, even layer of primer onto the metal and let it dry. Hold the can 12 inches (30 cm) from the object and spray continuously until the metal is fully covered. Use rust-resistant primer specifically recommended for metal surfaces, like oxidizing primer. If possible, use a primer color that matches the color of the paint you plan to use so the primer isn’t visible under the paint. Allow the primer to dry according to the directions printed on the can. [3] X Research source Apply the primer immediately after cleaning the metal to prevent dust and dirt from accumulating. If feasible, choose a primer and paint made by the same brand. That way, the colors are more likely to match and the paints will be chemically compatible. If your metal object is galvanized, choose an alkyd-free primer. This type of primer bonds better to galvanized metal surfaces. Use painter’s tape to cover any parts of the metal you want to avoid painting. For instance, you may want to paint a wrench’s handle but leave the upper section paint-free."
    },
    {
      "title": "Spray a coat of paint onto the dry primer.",
      "content": "Spray a coat of paint onto the dry primer. Use rust-resistant spray paint designed for metal surfaces. Hold the can 12 inches (30 cm) and spray continuously until the primer is fully covered with paint. Leave the paint to dry. [4] X Research source Check the product directions for the paint’s drying time. In some cases, the paint may take longer to try than the primer."
    },
    {
      "title": "Apply a second coat of paint once the first coat has dried.",
      "content": "Apply a second coat of paint once the first coat has dried. This prevents the paint from flaking off, helping it last longer. Let this layer fully dry before handling your object. [5] X Research source For best results, wait 24 hours between applying coats of paint. [6] X Research source"
    },
    {
      "title": "Choose an aluminum object to anodize.",
      "content": "Choose an aluminum object to anodize. Other types of metal, like steel or iron, won’t work. Make sure the aluminum is fully exposed with no paint or coatings of any kind. Wipe down the surface with a dry rag to remove debris. You can also use objects made from aluminum alloys (mixtures of metal that contain aluminum)."
    },
    {
      "title": "Choose a well-ventilated workspace like an open garage.",
      "content": "Choose a well-ventilated workspace like an open garage. Make sure there is plenty of air circulation to prevent acid fumes from building up during the next steps. You can also work in a backyard or other outdoor space. Keep children and pets away from your workspace."
    },
    {
      "title": "Gather 3 plastic tubs to hold your metal object, plus a plastic jug.",
      "content": "Gather 3 plastic tubs to hold your metal object, plus a plastic jug. Choose plastic tubs large enough to fit your metal object inside of them, with room on top to spare. Choose a plastic jug with a handle that holds at least 1 gallon (3.79 L) of liquid. Opt for a plastic water pitcher or a similar jug that’s meant for pouring. You’ll use it in future steps to hold and pour a neutralizing solution, which will react with acid."
    },
    {
      "title": "Wash your metal object with soap, then submerge it in water and lye.",
      "content": "Wash your metal object with soap, then submerge it in water and lye. Wearing rubber gloves, wash your object with dish detergent and water. In one of your plastic tubs, mix 3 tbsp (44 mL) of lye with 1 gallon (3.76 L) of water. Submerge your object in the lye-water mixture for 3 minutes. Then rinse your object with distilled water . [7] X Research source Discard the lye-water mixture and clean the plastic tub thoroughly with soap and water. Dry it with a rag so you can use it in future steps. Always wear gloves when handling your object, especially after cleaning it. Fingerprints and oils from your skin can interfere with the anodization."
    },
    {
      "title": "Combined baking soda and distilled water in your plastic jug.",
      "content": "Combined baking soda and distilled water in your plastic jug. Use 2 cups (473 mL) of baking soda and 1 gallon (3.79L) of distilled water. This will form your neutralizing solution. Keep this neutralizing solution nearby at all times. If you spill any acid (or any of the acid solution in the next steps), pour the neutralizing solution on the acid to prevent corrosion. [8] X Research source If you get acid on your skin, pour the neutralizing on your skin to prevent acid burns."
    },
    {
      "title": "Mix 5 parts water with 1 part sulfuric acid in a plastic tub.",
      "content": "Mix 5 parts water with 1 part sulfuric acid in a plastic tub. This will form your acid solution. Make enough acid solution to fully submerge your metal object in the plastic tub. To prevent fizzing, pour the water first, then add the acid. [9] X Research source For a small object, for example, you could use 5 quarts (4750 mL) of water and 1 quart (950 mL) of sulfuric acid . Wear rubber gloves when handling your acid solution."
    },
    {
      "title": "Connect jumper cables to a car battery and your metal object.",
      "content": "Connect jumper cables to a car battery and your metal object. Wearing rubber gloves, attach one cable to the car battery’s positive terminal and the other cable to the negative terminal. Connect the other end of the negative cable to your metal object. Then connect the other end of the positive cable to a piece of aluminum foil. Use a 20-volt car battery . Avoid letting your metal object contact the aluminum foil after the jumper cables are connected. This could short-circuit your battery and cause sparks."
    },
    {
      "title": "Submerge your object and the aluminum foil in the acid solution.",
      "content": "Submerge your object and the aluminum foil in the acid solution. Using rubber gloves, carefully lower your metal object into the acid solution, with the cable still attached. Then lower the aluminum foil into the solution, keeping its cable attached. Make sure the aluminum foil doesn’t touch the metal object, and that the two cables don’t come into contact. Avoid touching the solution with your gloved hand. Keep your rubber gloves on throughout this step to prevent electric shocks and acid burns."
    },
    {
      "title": "Leave your object in the acid solution for 60 minutes.",
      "content": "Leave your object in the acid solution for 60 minutes. The metal will anodize as negatively charged aluminum atoms attract the positively charged sulfuric acid molecules. Lots of bubbles will form around the aluminum foil, but very few will appear around the object you’re anodizing. For safety, stay in the area while your object anodizes. If you smell burning or see sparks or smoke coming from the wires or your battery, disconnect the wires from the battery terminals one at a time. Wear rubber gloves whenever you touch the wires or car battery. Keep a fire extinguisher nearby. If you see smoke or fire, put it out immediately with the fire extinguisher."
    },
    {
      "title": "Disconnect the cables and remove all items from the tub.",
      "content": "Disconnect the cables and remove all items from the tub. Wearing your rubber gloves, disconnect the clamp from the battery’s negative terminal, followed by the clamp on the positive terminal. Pull the wire and aluminum foil from the acid bath and disconnect the cable from the foil. Then do the same for your metal object. Be careful not to let acid drip off onto surfaces as you remove items from the tub."
    },
    {
      "title": "Wash your metal object in a sink to remove the acid.",
      "content": "Wash your metal object in a sink to remove the acid. Turn it back and forth under the water to clean it thoroughly. Wash the metal for 2-3 minutes to ensure all the acid is gone. Then do the same with your aluminum foil. To prevent acid from dripping on the floor, hold the container with your neutralizing solution under your object as you move it to the sink. Discard the aluminum foil once it’s clean, or save it for a future project. Discard the acid bath down a drain and clean the plastic tub thoroughly."
    },
    {
      "title": "Prepare the metal dye bath using the directions on the package.",
      "content": "Prepare the metal dye bath using the directions on the package. For instance, you may need to mix the dye with hot or boiling water. Once you’ve prepared the dye bath, pour it into an empty plastic tub. Add enough dye bath to fully submerge your metal object in the next steps. [10] X Research source Note any warnings on the product label. For example, the dye may stain fabrics, discolor bowls or metal cooking pots, etc."
    },
    {
      "title": "Submerge your object in the dye bath for up to 20 minutes.",
      "content": "Submerge your object in the dye bath for up to 20 minutes. The amount of time needed depends on your desired color and the specific dye you use. Check the dye’s product directions and adjust the time accordingly. [11] X Research source The dye can be reused. After you’re finished, store it in a plastic water jug for future projects. You may not get the exact color you expected. It may turn out lighter, have a slightly different hue, etc. Experiment with multiple objects made from the same material (that is, the same aluminum alloy, or pure aluminum) to compare the results."
    },
    {
      "title": "Boil the object in water for 30 minutes to seal the color.",
      "content": "Boil the object in water for 30 minutes to seal the color. Boil water in a large pot over a stove, then immerse the object in the boiling water. Remove the object after 30 minutes and place it on a dry towel to cool. Once the object is completely cool, the metal will shine with its permanent new color. [12] X Research source"
    },
    {
      "title": "Clean tools and containers with baking soda and the neutralizing solution.",
      "content": "Clean tools and containers with baking soda and the neutralizing solution. Rinse items with the neutralizing solution to remove the acid. Scrub any surfaces used to handle the acid, such as tables or workbenches. When finished, wash your hands thoroughly with soap and water. [13] X Research source Keep your rubber gloves while handling your items until they’re completely clean. Cover your car battery’s terminals with their rubber casings, then store the battery in a safe location away from children and pets."
    },
    {
      "title": "Select a heat source like a torch or open flame.",
      "content": "Select a heat source like a torch or open flame. Use a torch or Bunsen burner to create a variety of vivid colors. For more subtle variation, use an open flame like a stove or campfire. Choose any metals containing copper or iron, such as steel. [14] X Research source Use tongs to grip the metal and avoid burns. You can also heat the metal in an oven to produce a more balanced, even coloration. Depending on the temperature and type of metal, you can create colors ranging from pale yellow to blue."
    },
    {
      "title": "Expose the metal to the flame to change its color.",
      "content": "Expose the metal to the flame to change its color. You can’t control the colors that appear. However, heating the metal for longer produces more vivid colors, allowing random patterns of coloring to emerge. You can also use a small, narrow flame to trace patterns on large pieces of metal. [15] X Research source Heat metal in a well-ventilated area. Wear oven gloves and use caution to prevent burns. Use clean metal that’s free of rust, dirt, and paint."
    },
    {
      "title": "Allow the metal to cool.",
      "content": "Allow the metal to cool. Cool the metal slowly by setting it down on a rock or concrete floor, away from flammable materials. For faster cooling, dip the metal in a bucket of cold water. [16] X Research source Turn off the torch or heat source when finished. Close burners and torches, and douse campfires with water or sand. The colors may change as the metal cools. For example, reds may cool into bluish purples."
    }
  ]
}