{
  "url": "https://www.wikihow.com/Bathe-a-Pregnant-Dog",
  "title": "How to Bathe a Pregnant Dog",
  "steps": [
    {
      "title": "Keep her calm",
      "content": "Keep her calm . When dealing with a pregnant dog, it's even more important than usual to make sure she stays calm. Her extra weight might make her harder to hold down if she starts to struggle. Pet her in long strokes and speak to her in a soft voice. Do everything you can to relax her. If you think she might try to escape, get another person to help you. More hands means more petting! If your dog is afraid of baths, don’t force her. Just brush through her coat instead, trying to get as much dirt off the fur as you can. It will be easier on you both. Allow wet mud to dry into dirt before brushing her."
    },
    {
      "title": "Stick to your normal routine.",
      "content": "Stick to your normal routine. Even if you’re feeling worried about bathing her because she's pregnant, don't let her pick up on your anxiety. Act like it's a completely normal bath, and don't change the routine at all. For example, if you usually lift your dog into the bathtub, give her the bath in her normal place. Don't decide to spray her with a hose outside instead because you're afraid of lifting her."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. Keep treats on hand to reward her for calm behavior or coax her into the tub. You'll also need shampoo for the bath and several towels to dry her off before letting her loose in your home. [1] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source You can put one of the towels on the edge of the tub to stop some of the water from splashing onto the floor at your feet. Use a nice, mild oatmeal shampoo for dogs that won't irritate her skin. You're going to get wet, too, so dress down in clothes you don't mind getting dirty. [2] X Research source"
    },
    {
      "title": "Place a non-slip surface in the tub.",
      "content": "Place a non-slip surface in the tub. You know from experience that bathtubs can get slippery when you add water and soap to the mix. A non-slip mat will help your dog keep her footing while she's getting her bath. You can find non-slip mats in any department store or online."
    },
    {
      "title": "Lift the dog into the tub.",
      "content": "Lift the dog into the tub. Be gentle! Depending on how big she is, you may need two people to lift her. Don't lift her from under the belly, as this might be uncomfortable or painful for her. Instead, scoop one arm under her hind legs (behind the belly), and one under her neck. Lift lift her from the rump and chest. If your dog is small enough, you may be able to use the kitchen (or utility) sink."
    },
    {
      "title": "Start the water.",
      "content": "Start the water. Turn both the hot and cold nozzles to make sure the water comes out lukewarm. [3] X Expert Source Lancy Woo Certified Pet Groomer Expert Interview. 26 February 2020. If you have a shower nozzle, spray down your dog's fur to get it completely wet. If you don't have a nozzle, just pour cups of water over her. Pet her and talk softly to her the whole time to keep her calm."
    },
    {
      "title": "Fill the tub first if running water frightens your dog.",
      "content": "Fill the tub first if running water frightens your dog. The sound of a loud faucet can be scary! For some dogs, it may be less stressful to start with the tub already filled with as much water as you need. Once you’ve filled the tub, you can gently lift her in. Use a cup to pour water over her instead of using a shower nozzle with running water."
    },
    {
      "title": "Lather her up with dog shampoo.",
      "content": "Lather her up with dog shampoo. Work from the front to the back of her body. Start behind her head, then move your way down her neck and body. [4] X Expert Source Lancy Woo Certified Pet Groomer Expert Interview. 26 February 2020. Lather her legs and tail last. Touch her stomach very lightly, and only just enough to make sure it's clean. Don't rub forcefully or push on her stomach in any way. Don't put soap on her face, as it could get into her eyes, nose, or mouth. Instead, use a damp washcloth to wash her face with water. [5] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Avoid getting shampoo in her ears, too. [6] X Expert Source Lancy Woo Certified Pet Groomer Expert Interview. 26 February 2020."
    },
    {
      "title": "Rinse the shampoo from her fur.",
      "content": "Rinse the shampoo from her fur. If the sound of running water doesn't scare her, turn the water back on and use the shower nozzle to rinse the shampoo off her. If she's scared, use a glass to pour water over her coat. [7] X Expert Source Lancy Woo Certified Pet Groomer Expert Interview. 26 February 2020. Rinse until you can't see suds in her coat anymore."
    },
    {
      "title": "Lift her out of the tub.",
      "content": "Lift her out of the tub. Use the same method you used when putting her in the tub: lift her from the rump and chest. Again, be careful not to put any pressure on her belly. Make sure she has her footing on the ground before letting go her, so she doesn't fall."
    },
    {
      "title": "Dry your dog.",
      "content": "Dry your dog. If your dog is fearless in the face of loud noises, you can speed up the drying process by using a blow dryer. Most dogs prefer a light towel-dry, though. She has a lot more hair than humans, so you may need to go through a few towels. [8] X Expert Source Lancy Woo Certified Pet Groomer Expert Interview. 26 February 2020. You don't need to get her completely dry. Just dry her off enough to make sure she doesn't drip water all over your house. Let her coat air dry the rest of the way."
    }
  ]
}