{
  "url": "https://www.wikihow.com/Cook-Canned-Tuna",
  "title": "How to Cook Canned Tuna Into a Delicious Meal",
  "steps": [
    {
      "title": "Stuff a quesadilla with tuna fish for a simple meal.",
      "content": "Stuff a quesadilla with tuna fish for a simple meal. Mix 1 can of tuna with 1 ⁄ 2 cup (0.12 L) of mayonnaise and spread it and 1 ⁄ 4 cup (0.059 L) of shredded cheese over a tortilla. Fold the tortilla in half and heat one side over a lightly greased skillet, then flip the tortilla after 3-5 minutes to cook the other side. [1] X Research source You can use any kind of shredded cheese with this meal, but most recipes call for cheddar cheese."
    },
    {
      "title": "Do mac and tuna as an easy, delicious meal.",
      "content": "Do mac and tuna as an easy, delicious meal. Cook boxed macaroni and cheese over a stove top and add the cheese sauce as directed by the box. After adding the cheese sauce, stir in a can of tuna and serve when thoroughly mixed. [2] X Research source You can also add a can of tuna to homemade mac and cheese for a complex, cheesy meal."
    },
    {
      "title": "Make tuna cucumber bites for a healthy treat.",
      "content": "Make tuna cucumber bites for a healthy treat. Mix a can of tuna salad with 1 ⁄ 2 cup (0.12 L) of mayonnaise and lemon juice to taste. Chop a cucumber and top each slice with tuna, diced tomatoes and green onions, and a sprinkle of paprika. [3] X Research source"
    },
    {
      "title": "Try cucumber avocado bowls as an alternative to tuna salad.",
      "content": "Try cucumber avocado bowls as an alternative to tuna salad. Combine a can of tuna with a diced avocado and add a diced tomato, a chopped celery stalk, and the juice from 1/2 of a squeezed lemon. Divide the mix in half and fill either a bowl or the 2 halved avocado shells to serve. [4] X Research source If you're following the Paleo diet, this recipe is Paleo-friendly. You can also stuff cooked zucchini with this recipe and top with cheese for a warm, equally healthy snack. [5] X Research source"
    },
    {
      "title": "Try scrambled eggs with tuna as a protein-rich snack or breakfast.",
      "content": "Try scrambled eggs with tuna as a protein-rich snack or breakfast. Crack 4 eggs in a pan and cook over high heat while mixing continuously. When you have scrambled the eggs, add a can of tuna, 1.75 tablespoons (25.9 mL) of olive oil, a diced onion, and oregano to taste and fry for 4-5 minutes before serving. [6] X Research source This meal pairs especially well with fried potatoes when eaten for breakfast."
    },
    {
      "title": "Make tuna casserole if you want a hearty meal.",
      "content": "Make tuna casserole if you want a hearty meal. Mix 1/2 a box of boiled pasta, a can of tuna, a can of cream of celery or mushroom, 1 ⁄ 2 cup (0.12 L) of milk, 3 ⁄ 4 cup (0.18 L) of shredded cheddar, 1 ⁄ 4 teaspoon (0.0012 L) of bread crumbs, 1 ⁄ 2 cup (0.12 L) of green peas, and salt or pepper to taste in a bowl. Pour the bowl into a baking sheet and cook at 375 °F (191 °C) for 20-25 minutes. [7] X Research source"
    },
    {
      "title": "Cook tuna pasta for a delicious, creamy dish.",
      "content": "Cook tuna pasta for a delicious, creamy dish. Bring a pot of water to a boil and cook a box of fettuccine pasta for 8-10 minutes. After draining the noodles, combine them and a can of tuna, a can of peas, 2 cups (0.47 L) of Alfredo sauce, and garlic powder or oregano to taste and serve when thoroughly mixed. [8] X Research source"
    },
    {
      "title": "Use canned tuna in a simple sushi roll.",
      "content": "Use canned tuna in a simple sushi roll. Make cooked sushi rice and spread it over a piece of nori. Spread tuna salad, sliced avocado and cucumber, and diced green onions over half of the nori, roll the nori tightly, and slice the sushi roll to serve. [9] X Research source For spicy tuna rolls, add a squirt of wasabi or sriracha to the tuna salad."
    },
    {
      "title": "Try lemon rice and tuna as a nutritious, hearty meal.",
      "content": "Try lemon rice and tuna as a nutritious, hearty meal. Mix 3 ⁄ 4 cup (0.18 L) of white rice, and 2 cups (0.47 L) of chicken broth in a saucepan and let it simmer for 35 minutes with the lid on. Remove the lid and stir in a can of tuna, juice from 1/2 a lemon, and 2 cups (0.47 L) of baby spinach leaves, then continue cooking for 5 more minutes and serve. [10] X Research source Add garlic powder, black pepper, or onion powder to taste."
    },
    {
      "title": "Try a tuna sandwich for a classic lunch.",
      "content": "Try a tuna sandwich for a classic lunch. Combine 1 can of tuna with 1 ⁄ 2 cup (0.12 L) of mayonnaise and add lemon juice, salt, and pepper to taste. Spread the tuna mix evenly on a slice of bread, and place a slice of bread on top to finish your sandwich. [11] X Research source Tomatoes, lettuce, olives, pickles, cucumbers, avocados, and onions all make great toppings for tuna sandwiches."
    },
    {
      "title": "Make tuna melts for a twist on simple tuna sandwiches.",
      "content": "Make tuna melts for a twist on simple tuna sandwiches. Mix 1 can of tuna with 1 ⁄ 2 cup (0.12 L) of mayonnaise and toast 2 slices of bread. Spread the tuna on the bread slices, add cheese, and heat a skillet on medium heat. Press the 2 bread slices together against the skillet for 4-5 minutes to melt the cheese and serve. [12] X Research source"
    },
    {
      "title": "Mix tuna salad for a versatile dish.",
      "content": "Mix tuna salad for a versatile dish. Combine 1 can of tuna with 1 ⁄ 2 cup (0.12 L) of mayonnaise, 1 ⁄ 4 cup (0.059 L) of celery, 1 ⁄ 4 cup (0.059 L) of onion, 1 ⁄ 2 teaspoon (2.5 mL) of lemon juice, 1 ⁄ 4 teaspoon (0.0012 L) of garlic powder, and salt or paprika to taste in a bowl. Refrigerate the bowl overnight to chill the salad and serve within 2-3 days of making. [13] X Research source You can eat tuna salad by itself, dip chips in it, or add it to other meals like green salads or lettuce wraps. [14] X Research source"
    }
  ]
}