{
  "url": "https://www.wikihow.com/Clean-Fuzzy-Crocs",
  "title": "How to Wash Fuzzy Crocs to Get Rid of Stains & Odors",
  "steps": [
    {
      "title": "Tap the Crocs together to remove the outer layer of dirt or debris.",
      "content": "Tap the Crocs together to remove the outer layer of dirt or debris. When you’re walking around in your Crocs all day, dust, dirt, and crumbs can cling to the exterior and interior. To loosen debris, hit the Crocs against each other or smack them against a flat surface. If stubborn or sticky debris clings onto the fur lining, use your fingernails to pick away at it. Using a bristol brush or something similar can damage the fur, so using your hands is best. [1] X Research source"
    },
    {
      "title": "Rinse away extra loose debris with cold water.",
      "content": "Rinse away extra loose debris with cold water. Before you apply soap, wet the interior lining with cold water. This will allow the soap to absorb better and help eliminate any lingering debris. Use a damp microfiber cloth or a soft sponge to scrub the surface lightly. [2] X Research source"
    },
    {
      "title": "Add 1 tablespoon (15 mL) of mild dish soap, scrub, and rinse.",
      "content": "Add 1 tablespoon (15 mL) of mild dish soap, scrub, and rinse. Once the fur lining is soaked, drizzle 1 tablespoon (15 mL) of mild dish soap or laundry detergent on each shoe. Gently scrub the lining with a damp cloth or sponge in circular motions until you see suds. Rinse and repeat until the suds or water looks clear. [3] X Research source You may need more or less soap depending on the condition and size of your Crocs."
    },
    {
      "title": "Air dry the Crocs in a well-ventilated area for 1-2 days.",
      "content": "Air dry the Crocs in a well-ventilated area for 1-2 days. Once the Crocs are clean, place them in a well-ventilated area away from direct sunlight to let them dry. If you want to speed up the process, place them in front of a circulating fan. [4] X Research source Avoid putting your shoes in the dryer, in direct sunlight, or near an air heater, all of which can cause the shoes to shrink or warp."
    },
    {
      "title": "Fluff the interior lining with your fingers.",
      "content": "Fluff the interior lining with your fingers. Once the Crocs are dry, gently fluff the fur with your fingers to restore its softness and appearance. Simply combing your fingers through the fur, swiping in an upward motion. Now you’re ready to walk around in style!"
    },
    {
      "title": "Loosen dirt from the surface and place the Crocs in a mesh bag.",
      "content": "Loosen dirt from the surface and place the Crocs in a mesh bag. Before placing your Crocs in the washing machine, tap the shoes against each other to remove any lingering dust, dirt, and similar debris from the surface. For added protection, take a mesh laundry bag for delicate garments or lingerie and slip the shoes inside. Zip or tie the bag shut. [5] X Research source If you don’t have or want to use a mesh laundry bag, that’s okay. Wash the Crocs with old towels or rags to keep them from banging inside the machine. Note that the linings aren't removable. [6] X Research source"
    },
    {
      "title": "Set the washing machine to a gentle cycle with cold water.",
      "content": "Set the washing machine to a gentle cycle with cold water. When washing Crocs, you want to use as minimal heat as possible to avoid shrinking or warping them. Select a delicate or gentle cycle for deep cleaning. Use a mild dye-free laundry detergent to avoid staining them, especially if they’re light-colored Crocs. [7] X Research source Note that the manufacturer doesn't specifically recommend washing lined Crocs in the washing machine, but many customers have had success with this method. You can also machine-wash other popular styles like the Classic Clogs and Slides made with the Croslite foam material."
    },
    {
      "title": "Allow the Crocs to air-dry, then fluff the fur.",
      "content": "Allow the Crocs to air-dry, then fluff the fur. Avoid putting your Crocs in the dryer, which can damage them. Place the Crocs away from direct sunlight or a heater to let them dry properly for 1-2 days. To remove excess water, use a dry microfiber cloth to soak the water from the fur liner. Once they’re completely dry, use your fingers to comb through the fur to keep them looking soft and fresh! [8] X Research source"
    },
    {
      "title": "Pour 1 tbsp (14 g) of baking soda on the inside of each clog.",
      "content": "Pour 1 tbsp (14 g) of baking soda on the inside of each clog. To deodorize Crocs, shake a generous amount of baking soda to coat the bottom. Start with 1 tbsp (14 g) and add more if needed. Lay them flat in a plastic zip-top bag to contain the baking soda. You can also mix 3 parts of vinegar with 1 part of baking soda to create a paste for extra deodorizing power. Apply it to the fur lining with your fingers, letting it sit for a few minutes before proceeding with one of the cleaning processes above. [9] X Research source"
    },
    {
      "title": "Transfer the bag into the freezer and shake out the baking soda the next day.",
      "content": "Transfer the bag into the freezer and shake out the baking soda the next day. Some say putting odorous clothes or shoes in a sealable bag for 2 to 3 hours or overnight can help kill the bacteria causing the odor. [10] X Research source Pop the bag into the freezer before heading to bed. Remove the shoes and shake the baking soda over a trashcan the next morning. [11] X Research source If your Crocs are damp from thawing, allow them to air dry away from direct sunlight before wearing them."
    },
    {
      "title": "Clean your Crocs regularly.",
      "content": "Clean your Crocs regularly. To keep your clogs looking fresh, get into the habit of cleaning them regularly to avoid unsightly appearances and bad odors. Fortunately, the exterior is easy to clean with a wet cloth! Opt for a deep cleaning of the interior fur lining once a month."
    },
    {
      "title": "Use dye-free mild detergents to retain the Crocs’ color.",
      "content": "Use dye-free mild detergents to retain the Crocs’ color. Avoid soap stains from ruining the look of your Crocs by opting for dye-free mild soap or laundry detergent. Harsh detergents or bleaches may cause discoloration. [12] X Research source"
    },
    {
      "title": "Leave Crocs in cool, dry locations when you’re not wearing them.",
      "content": "Leave Crocs in cool, dry locations when you’re not wearing them. Crocs are made with closed-cell plastic, which can fade, shrink, bend, or even melt if exposed to direct sunlight for long periods. Keep your Crocs indoors, away from direct sunlight. Opt for a shoe cabinet or place them in a shoe cubby in the closet to keep them in good condition. [13] X Research source"
    }
  ]
}