{
  "url": "https://www.wikihow.com/Clean-Baseball-Pants",
  "title": "How to Clean Baseball Pants",
  "steps": [
    {
      "title": "Brush off excess dirt and debris.",
      "content": "Brush off excess dirt and debris. Using a stiff-bristled brush or dry sponge, remove as much dirt from the pants as you can while they’re still dry. Use long, sweeping strokes, being careful to avoid spreading dirt to clean areas. Shake the pants out thoroughly when you’re done. [1] X Research source Brush down the pants outdoors to keep from making a mess inside your home. It’s important to treat stains as soon as possible so that they’ll have less time to set up on the fabric. [2] X Research source"
    },
    {
      "title": "Combine hydrogen peroxide and a mild detergent in a spray bottle.",
      "content": "Combine hydrogen peroxide and a mild detergent in a spray bottle. Mix together roughly two parts hydrogen peroxide and one part liquid dish soap and shake to combine. Both of these ingredients contain active stain-fighting agents and will be instrumental in lifting the worst of the stains prior to laundering. [3] X Research source Keep a bottle of hydrogen peroxide solution mixed up so that you’ll have a ready supply on hand to treat a dirty uniform after each game."
    },
    {
      "title": "Spray the stain-fighting solution onto the pants.",
      "content": "Spray the stain-fighting solution onto the pants. Mist the pants liberally on both sides, focusing on areas where dirt and discoloration is the heaviest. Then, use your brush to work the solution further into the fibers of the garment where they can continue working on the stains. [4] X Research source Reapply fresh solution after chipping away at the stains with the brush. If the stains are very pronounced, turn the pants inside out and spray and brush the opposite side of the fabric as well. [5] X Research source"
    },
    {
      "title": "Allow the solution sit for 20-30 minutes.",
      "content": "Allow the solution sit for 20-30 minutes. Give the solution time to take effect before moving on to other deep-cleaning methods. You might be surprised how well the initial treatment can work on ground-in dirt, grass and blood stains. [6] X Research source Leave the pants on a flat, dry surface as they sit, like a countertop or the ironing board. The longer you let the stain-fighting solution work, the better the end result will be."
    },
    {
      "title": "Fill a large sink with warm water.",
      "content": "Fill a large sink with warm water. Run enough water to completely submerge the pants. It’s important to use warm or hot water as opposed to cold, as it will be more effective for loosening the most troublesome stains. You can also soak the pants in a bathtub if you’re short on sink space. If necessary, use a small, heavy object to weigh down the pants and keep them underwater."
    },
    {
      "title": "Mix in an oxygenated bleach cleaner.",
      "content": "Mix in an oxygenated bleach cleaner. Add about one cup of bleach-based cleaner like OxiClean or Clorox Oxy Magic to the sink. Whisk the water and cleaner together until they’re evenly distributed. These products are designed to cut tough messes using a mild natural bleaching action, so there’s no need to do a lot of scrubbing. [7] X Research source For best results, look for products that are specially formulated for use on white clothing. It’s a good idea to wear cleaning gloves when working with products containing bleach and other harsh chemicals."
    },
    {
      "title": "Soak the pants for several hours.",
      "content": "Soak the pants for several hours. Place the pants in the sink with the warm water and bleach cleaner. Ideally, the pants should remain in the solution for a minimum of 2-3 hours. If possible, soak them overnight to ensure that the cleaner has had ample time to work. [8] X Research source If you’re short on time, use a slightly higher concentration of cleaner and plunge the pants gently in the water by hand. Soaking is an indispensable step in removing stains from white fabrics."
    },
    {
      "title": "Rinse the pants with clean water.",
      "content": "Rinse the pants with clean water. Remove the pants from the sink and wring out the excess cleaning solution. Drain the sink and run a stream of fresh warm water over the pants. This will help flush away dislodged debris and dirty water. Squeeze all water out of the pants again after rinsing. You should follow up with a regular cycle in the washing machine, even if the stains have mostly disappeared from the pants. [9] X Research source"
    },
    {
      "title": "Place the pants in the washing machine.",
      "content": "Place the pants in the washing machine. After a good soak, it’s important to wash the pants right away before they have time to dry. Be sure to only wash your uniform pants with other white fabrics. If the rest of your uniform needs to be washed, you can throw them in together. Once loose stains dry a second time, they can be even harder to get out. [10] X Research source If you wash your uniform with bright colors that have a tendency to run, you could find yourself dealing with a whole new set of difficult stains."
    },
    {
      "title": "Pour in a strong detergent.",
      "content": "Pour in a strong detergent. Add the laundry detergent straight to the clothes, rather than to a separate dispenser. You’ll have the most luck with stain-dissolving detergents made specifically for whites. [11] X Research source Use a whole capful of detergent to provide the maximum amount of cleaning muscle."
    },
    {
      "title": "Wash the pants.",
      "content": "Wash the pants. Set the washing machine to a normal wash cycle. Use warm water. Whatever stains are leftover from the first two phases of cleaning should be totally erased following a thorough machine washing. [12] X Research source Add a cup of distilled white vinegar during the rinse cycle. Vinegar can brighten and soften light fabrics, making it a great way to provide the finishing touches to hard-wearing garments. [13] X Research source Especially dingy pants may need to be laundered on a heavier soil setting."
    },
    {
      "title": "Hang the pants up to air dry.",
      "content": "Hang the pants up to air dry. The intense heat of the dryer may shrink cotton and blended pants. To prevent this, hang the pants vertically in a well-ventilated area overnight. Afterwards, they’ll be clean and ready to go so you can look your best at the big game! [14] X Research source Pants made from polyester and other synthetic fabrics are typically dryer safe. If the pants are wrinkled after they dry, give them a few passes with an iron on a low heat setting. [15] X Research source"
    }
  ]
}