{
  "url": "https://www.wikihow.com/Become-an-Engineer",
  "title": "How to Become an Engineer",
  "steps": [
    {
      "title": "Identify the field of engineering you want to work in.",
      "content": "Identify the field of engineering you want to work in. Engineering is a broad and diverse field. You could be a robotics engineer, a civil engineer, a chemical engineer, or one of many other varieties. To identify the field you wish to work in, choose the field that interests you the most. Alternately, choose the field with the best job prospects or the one that enables you to earn the most money. [1] X Research source Check your national department of labor statistics to determine which fields of engineering will enable you to make the most money or increase your odds of landing a job. There are about 40 types of engineering degrees. There is no right or wrong field of engineering for you."
    },
    {
      "title": "Select a school that specializes in your field of engineering.",
      "content": "Select a school that specializes in your field of engineering. Different colleges excel in different areas. Some schools offer robust civil engineering programs, while others have strong robotics engineering programs. Run a search online for the best school in the field you’re interested in. [2] X Research source The schools with top engineering programs might be difficult to get into. Write a strong application letter and study hard for any entrance exams you might have to take."
    },
    {
      "title": "Add an international component to your education if you’re hoping to work abroad.",
      "content": "Add an international component to your education if you’re hoping to work abroad. Many engineering positions are available in developing countries. If you think you might want to leverage your engineering education into a position that allows you to work abroad, consider getting a minor in a foreign language, a certificate in international relations, or a similar qualification. You could also apply for a study abroad program through your school. [3] X Research source"
    },
    {
      "title": "Take advantage of university programs that connect you with engineering work.",
      "content": "Take advantage of university programs that connect you with engineering work. These programs might connect you with internships while you’re in school, or they might be designed to connect you with a job after you graduate. Talk to your professors about opportunities for engineering work while you’re still in school. These programs can both help you better understand how engineering looks in a practical environment and can help you get work experience that looks great on your resume."
    },
    {
      "title": "Ask smaller companies if they have work shadowing programs.",
      "content": "Ask smaller companies if they have work shadowing programs. Work shadowing programs allow you to follow an engineer through their day. Write a pleasant email to the company’s HR or hiring office inquiring about work shadowing opportunities. Alternately, you could call the company’s hiring office directly. In either case, ask, “Do you have any work shadowing opportunities available for an engineering student like me?” [4] X Research source Work shadowing opportunities allow you to get a feel for a particular company and to better understand how engineers go about their work."
    },
    {
      "title": "Apply for internship",
      "content": "Apply for internship after 1 or 2 years of university. Major companies and institutions with engineering departments often have internship programs. The process by which you secure an internship varies considerably from one company to the next, but it’s often no different than securing a job. Check the “Careers” page of major engineering firms for opportunities. You’ll need to fill out the application, submit a resume and/or references, and arrange an interview. [5] X Research source Aim for paid internships whenever possible. During an internship, you’ll be able to gain valuable on-the-job experience. If you’re pursuing a summer internship, you might even get to work in an engineering position full-time. Internships are a great way to network with other people who might be able to provide recommendations at their company or elsewhere after you graduate. You might be able to get school credit for your internship. Talk to your university advisor about such an option."
    },
    {
      "title": "Do a practicum in your final year of school.",
      "content": "Do a practicum in your final year of school. A practicum is a work opportunity that replaces or takes up a significant portion of your final university year. These placements carry a competitive salary and provide a deeper, more long-term experience than an internship. If you do well, practicums often lead to full-time positions after you graduate."
    },
    {
      "title": "Find work opportunities through your network or online.",
      "content": "Find work opportunities through your network or online. Your professors are a great source for finding work. Ask them if they know of any job openings or if they have an industry connection who might be able to help you. Your school’s career advisor might also be able to assist you in finding a job. [6] X Research source If your sources at school cannot help, or if you’re unsatisfied with their recommendations, check online. Employment sites like https://www.monster.com and https://www.Indeed.com are useful for finding jobs of all sorts, including engineering positions. Engineering organizations often post jobs online or connect recent graduates with work opportunities. Check out the websites of engineering organizations in your area for more information."
    },
    {
      "title": "Make a relevant resume.",
      "content": "Make a relevant resume . Your resume should not contain every work experience you’ve ever had. Focus on your education, your relevant work experience, and any relevant internships or volunteer roles you’ve had. Emphasize the ways in which your skills match the job description. For instance, if the job you’re applying for is looking for someone with experience in the automotive industry and you have experience working for an auto parts manufacturer, you should include this experience in your cover letter and in your resume. List your engineering skills and specialties. You can also list relevant coursework, if applicable."
    },
    {
      "title": "Expound on your experience in your cover letter.",
      "content": "Expound on your experience in your cover letter . Open the letter with a compelling introductory paragraph that explains why you want the job and why you’re the right person for it. Then, tailor your cover letter for the job. For instance, if your resume refers to an internship at an auto parts manufacturing factory, you should delve into more depth in your cover letter. Explain what your specific responsibilities were and how you made a positive contribution to the company in your time there."
    },
    {
      "title": "Do a mock interview with your college advisor or someone you trust.",
      "content": "Do a mock interview with your college advisor or someone you trust. Some college career centers have advisors who can help you prepare with a mock interview. Take advantage of this service if it’s available. If mock interview help is not available at your school, sit with a friend or family member (preferably someone with engineering experience) and provide them with a list of potential questions you expect to be asked during your job interview . Invite the mock interviewer to ask their own relevant questions if they think of any."
    },
    {
      "title": "Be prepared to explain why you’ve chosen to become an engineer.",
      "content": "Be prepared to explain why you’ve chosen to become an engineer. Employers want to see someone who has self-knowledge and a certain degree of passion for engineering. For instance, you might say, “I am passionate about engineering because I love the creative process, the collaborative lab environment, and the knowledge that my engineering is contributing to a better world. I’d like to bring that passion to your company.” Be able to describe your career goals in a sentence or two."
    },
    {
      "title": "Do some background research into the company you’re applying to.",
      "content": "Do some background research into the company you’re applying to. Read the company’s values and mission statement, and make note of how they resonate with you. Do some research into what sorts of products the company makes or what sorts of services it provides, and use this information in the interview to explain why you’re interested in working for them. For instance, if you’re applying to be a medical device engineer, you could say, “I believe in your company’s mission of empowering doctors and medical professionals to do their jobs better and, ultimately, save lives.”"
    },
    {
      "title": "Stay focused on the questions you’re asked when answering.",
      "content": "Stay focused on the questions you’re asked when answering. For instance, when you’re asked about what experiences make a great engineer, don’t talk about the importance of generosity. Talking too much or rambling will make the interviewers doubt your competency. Be as direct, focused, and concise as possible when answering your interviewer's questions. Your answers should typically be 30 to 90 seconds long."
    },
    {
      "title": "Don’t rush your answers or mumble.",
      "content": "Don’t rush your answers or mumble. Deliver your answers with confidence. Speak at a normal pace and an audible volume. Look your interviewers in the eye and smile as you speak."
    }
  ]
}