{
  "url": "https://www.wikihow.com/Be-Emotionally-Detached",
  "title": "How to Be Emotionally Detached",
  "steps": [
    {
      "title": "Explore the reasons for your strong emotional reactions.",
      "content": "Explore the reasons for your strong emotional reactions. In order to better detach yourself, you should be aware of the reason for your strong reaction. Three reasons why you may be feeling emotional are: you are being highly sensitive the situation is triggering a painful past event you are feeling a loss of control over the situation, which can provoke a lot of anger and frustration."
    },
    {
      "title": "Know the difference between healthy and unhealthy detachment.",
      "content": "Know the difference between healthy and unhealthy detachment. It is natural and normal to want to emotionally detach sometimes, especially if the emotion is too painful or overwhelming to fully deal with at the current time. However, extreme emotional detachment from others is associated with psychopathy, where individuals commit crimes against others without remorse. Extreme emotional disassociation can also be the result of experiencing trauma. If you want to detach sometimes due to intense emotions, that is perfectly healthy. We may not always be in the place to cope with strong emotions. However, if you find yourself isolating from others constantly or being emotionally numb (not feeling emotions), you could suffer from a larger psychological concern. Some signs you may need therapy or treatment include: social isolation, avoidance of social activities, intense fear of rejection, recurrent depressed or anxious mood, difficulty completing work (school or occupational duties), and frequent social conflict or physical fights with others."
    },
    {
      "title": "Accept your emotional state.",
      "content": "Accept your emotional state. Paradoxically, if we accept our emotions as valid and normal, we can be better at detaching from them when we need a break. [1] X Research source Oftentimes, we may want to push our emotions away because they do not feel good. However, these emotions give us valuable information about our situation and our perceptions. [2] X Research source Similar to physical pain, negative feelings (fear, anger, sadness, anxiety, stress) are your brain's way of alerting you that there is a problem. The next time you have a painful emotion such as anger, think to yourself, “I am angry because _____. This anger gives me good information about how I am reacting to this situation and will help me decide how I should deal with it. It is okay to feel angry.” The anger itself is not the issue, it is what you do with the anger you feel. You can choose to ignore it and stuff it down, but this could end up making it come back even more powerfully the next time. If you accept your emotion, and find a healthy way of coping with it, then it loses its power over you and you can healthily detach from it when you need to. In the moment, try shifting focus [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source , as well as deep breathing to activate the body's calming response. The first is a cognitive process associated with decreased anxiety, and the second is a physical action one can take to initiate the body's calming response. You can also cope by taking a nap, doing an art project, taking a walk, getting a massage, hanging out with a pet, drinking tea, listening to music, and even kissing your significant other [4] X Research source ."
    },
    {
      "title": "Express your feelings in a safe place.",
      "content": "Express your feelings in a safe place. Giving yourself the space to feel your emotions in a safe way is integral to being able to detach when you need to. Set a time each day to feel your feelings. Practice crying alone. Crying in front of the one who is harassing you will only provoke them to taunt you more or continue with their harassment. Breathing deeply and thinking of something other than the situation may prevent you from fully processing the situation and ultimately prevent you from crying. However, it is not healthy to keep that sadness in. Try your best to wait until the situation has ended and for the antagonist to leave the room before you begin to cry."
    },
    {
      "title": "Write down your feelings and thoughts[5] X Research source .",
      "content": "Write down your feelings and thoughts [5] X Research source . Just as it is unhealthy to keep from crying, it is also unhealthy to keep anger, confusion, and other negative emotions inside. Putting those feelings and thoughts on paper or on the computer can help you process and deal with difficult emotions so that you can detach when you feel the need. Write down how you feel in a secret journal or diary. To avoid ruminating on your negative thoughts, try identifying alternative ways of thinking about or looking at the situation. For example, if your negative thought is, \"This person is such a jerk!\" Perhaps you can also write down, \"However, this individual may have had a difficult life and is being this way to cope with anger or sadness.\" A little empathy can go a long way in helping you cope with difficult people and situations."
    },
    {
      "title": "Distract yourself.",
      "content": "Distract yourself. Think about or do something else [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source . Do not simply ignore the feeling or situation. If you try to stop thinking about something, you may just end up thinking about it more. This is called the white-bear phenomenon, where subjects in a research study were told not to think about a white bear; and of course that is all they could think about. [7] X Research source Instead of focusing on avoiding thinking about what is making you upset, try to think about something else instead. Try distraction activities like: gardening, playing a game, watching a movie, reading a magazine, playing an instrument, painting, drawing, cooking, or talking to a friend. [8] X Research source Reader Poll: We asked 222 wikiHow readers what form of creative expression best distracts them from negative thoughts, and 44% of them said writing, drawing, or painting to channel emotions into art. [Take Poll]"
    },
    {
      "title": "Take action physically.",
      "content": "Take action physically. Go for a walk, a bike ride or any other cardiovascular activity. Aerobic activity is proven to boost endorphins and will help you be in a better position to monitor and change your reactions to emotional predators. [9] X Research source Exercise can also be a great distracting or grounding technique. Consider the following physical activities: hiking, rowing, kayaking, gardening, cleaning, jumping rope, dancing, kickboxing, yoga, Pilates, Zumba, push-ups, sit-ups, sports, running, and walking."
    },
    {
      "title": "Self-reflect.",
      "content": "Self-reflect. One way to healthfully detach is to focus on observing yourself like an outsider, from an objective stance. This is sometimes called the “third eye,” where you have an additional vision of yourself from the outside. When you are alone, simply observe how you are feeling and thinking. Ask yourself, “How am I doing today? What am I thinking about?” You can also work on observing yourself in social situations. Pay attention to what you say, do, how you act, and what emotions you express."
    },
    {
      "title": "Validate yourself.",
      "content": "Validate yourself. Self-validation is an important component of learning how to distance yourself emotionally. Validation means confirming that how you are thinking or feeling is reasonable. You can use positive self-talk. Say to yourself, “It is okay and natural to feel how I am feeling. Even if I don’t want to show it, I am allowed to feel this way.”"
    },
    {
      "title": "Set emotional boundaries.",
      "content": "Set emotional boundaries. Setting emotional boundaries is about putting your needs first by setting limits on what you will tolerate from others. If you can, disengage from individuals who irritate or upset you, such as particular coworkers or neighbors. Try setting boundaries by telling individuals directly how you feel, and what you would like them to do. For example, if your brother teases you, you could say, “I feel angry when you tease me like that. I would appreciate it if you stop.” It may also be helpful to identify the consequences of breaking this boundary such as, “If you don’t stop, I might not want to continue to be around you.” Here, you calmly discuss your anger without blowing up."
    },
    {
      "title": "Use your wise mind.",
      "content": "Use your wise mind. According to Dialectical Behavioral Therapy (DBT), a prominent therapy modality that helps teach individuals distress tolerance, we have an emotional mind and a rational mind. Our wise mind is a mix of both emotions and rational thought. The key to detaching or distancing yourself from emotional pain for a period of time is to use your wise mind – the perfect balance between the logical part and emotional part of your brain. Instead of only reacting emotionally, attempt to think rationally about the situation. Acknowledge your feelings by saying, \"Emotions are natural. Even strong emotions pass. I can work out why I had such a strong reaction after I get myself calm.\" Ask yourself, \"Is this going to matter in 1 year, 5 years, 10 years? How much does this actually affect my life?\" Ask yourself if your thought is fact or fiction. What is the bigger picture?"
    },
    {
      "title": "Maintain emotional distance through mindfulness.",
      "content": "Maintain emotional distance through mindfulness . Creating emotional distance is useful if you need to be empathic toward someone, but do not want to be overwhelmed or overly affected by the person's emotions. Mindfulness can be a useful technique in achieving a level of empathy that includes a level of distance that reduces the possibility of being flooded by the other person's emotions. Try eating a piece of food mindfully (raisin, candy, apple, etc). [10] X Trustworthy Source Greater Good in Action An initiative by UC Berkeley's Greater Good Science Center promoting science-based practices for a meaningful life Go to source First focus on what it looks like, its color and shape. Then notice how it feels in your hands, its texture and temperature. Finally, eat a small piece of the food slowly and notice how it tastes, and feels when you are eating it. Pay close attention to this experience. Go on a mindfulness walk. Try walking for 20 minutes or so. Simply focus on your walking, and what is going on around you. How does the air feel? Is it hot, cold, windy, calm? What sounds do you hear? Are there birds chirping, people talking, or car alarms going off? How does it feel to move your body? What do you see? Are there trees swaying in the wind, or animals moving about? [11] X Trustworthy Source Greater Good in Action An initiative by UC Berkeley's Greater Good Science Center promoting science-based practices for a meaningful life Go to source Bring your focus back to the present moment instead of being caught up in your thoughts and feelings or other personal reactions. Mindfulness requires concentration on the present moment, awareness of your own reactions, acceptance and letting go of painful thoughts and emotions, and thinking of thoughts as ideas instead of truths."
    },
    {
      "title": "Take deep breaths[12] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source .",
      "content": "Take deep breaths [12] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source . If you are stressed out, your body naturally tenses and sends your thoughts racing. Breathe deep and slow to avoid a lack of oxygen that can add to the problem. Place yourself in a comfortable position and practice breathing deeply in through your nose and out through your mouth. Focus deeply on your breathing and how it feels throughout your body to inhale and exhale. Make sure you are breathing from your diaphragm; this means that you should feel your stomach move fully in and out as you breathe. It should feel like you are filling up a balloon and releasing it every time you breathe. Do this for at least 5 minutes."
    },
    {
      "title": "Use grounding exercises.",
      "content": "Use grounding exercises. Grounding is perfect for emotional detachment because it involves techniques specifically for distancing yourself from emotional pain. Try the following grounding techniques: count to 100 in your head, count imaginary sheep, count the number of things in the room, think of the names of all the United States, or name all of the colors you can think of. Try anything logical and unemotional that will take your mind off the situation."
    },
    {
      "title": "Keep up the habit.",
      "content": "Keep up the habit. Eventually, your mind will learn to store things away and you'll go into thinking of logical and unemotional things naturally. The more you practice, the better you will be at detaching from painful emotions."
    }
  ]
}