{
  "url": "https://www.wikihow.com/Beat-the-First-Gym-Leader-in-Pok%C3%A9mon-FireRed-and-LeafGreen",
  "title": "How to Defeat the Rock Gym in FR/LG: A Complete Tutorial",
  "steps": [
    {
      "title": "Fill your team with Pokémon that are strong against Rock types.",
      "content": "Fill your team with Pokémon that are strong against Rock types. The Pewter gym is led by Brock, who fights solely with Rock-type Pokémon—a Geodude and an Onix, to be exact. [1] X Research source To take down these Pokémon, fill your team with Pokémon that know Fighting-, Steel-, Water-, Ground- and/or Grass-type moves. [2] X Research source If you started with Squirtle or Bulbasaur, you’re already in great shape. By level 7, Squirtle already knows Bubble, a Water-type move. [3] X Research source Similarly, Bulbasaur learns Leech Seed, a Grass-type move, once it hits level 7. [4] X Research source"
    },
    {
      "title": "Grind your Pokémon to level 12 or higher.",
      "content": "Grind your Pokémon to level 12 or higher. Brock’s Geodude is level 12, while his Onix is level 14. [5] X Research source Level your Pokémon (at least the one you plan on attacking with) to level 12 so they can generate more powerful hits against Brock’s Pokémon. “Grinding” simply involves fighting wild Pokémon over and over again to gain XP and level up your Pokémon. Route 1, Route 22, Route 2, and the Viridian Forest are all potential spots where you can farm your Pokémon before fighting Brock. [6] X Research source"
    },
    {
      "title": "Enter the Pewter gym and beat Camper Liam.",
      "content": "Enter the Pewter gym and beat Camper Liam. The Pewter gym only has 1 challenger aside from Brock—his name is Camper Liam, and he’ll challenge you with his level 10 Geodude and his level 11 Sandshrew. As a Ground-type Pokémon, Sandshrew is especially weak to Water-, Ice-, and Grass-type moves, but you can easily take it down with a variety of other moves (as long as they aren’t Poison, Rock, or Electric). [7] X Research source If any of your Pokémon get hurt during this battle, heal them up with Potions before fighting Brock."
    },
    {
      "title": "Challenge Brock using your strongest Pokémon.",
      "content": "Challenge Brock using your strongest Pokémon. Rock-type Pokémon (like Geodude and Onix) are weak to Grass-, Steel-, Water-, Ground-, and Fighting-type moves, so start up the battle with your Pokémon that’s loaded up with one of these ability types. [8] X Research source A few good Pokémon abilities to consider include: Squirtle’s Bubble Bulbasaur’s Leech Seed Charmander’s Metal Claw"
    },
    {
      "title": "Defeat Brock to receive TM39 Rock Tomb and the Boulder Badge.",
      "content": "Defeat Brock to receive TM39 Rock Tomb and the Boulder Badge. Once you’ve successfully knocked out Geodude and Onix, Brock will award you the Boulder Badge—this proves that you’ve beaten the Pewter Gym, and also lets you use the HM05 Flash anytime you’d like (not just in a battle). [9] X Research source He also gives you Rock Tomb, a special offensive Rock-type ability. [10] X Research source"
    },
    {
      "title": "Butterfree",
      "content": "Butterfree Explore the Viridian Forest until you stumble upon and catch a Caterpie (a Bug-type Pokémon). Continue battling other wild Pokémon to level up your Caterpie and evolve it into a Metapod (at level 7) and then a Butterfree (at level 10). At level 10, Butterfree learns Confusion, an ability that can be effective against Brock’s Pokémon. [11] X Research source"
    },
    {
      "title": "Mankey",
      "content": "Mankey Head over to Route 22; believe it or not, this area is accessible before the Pewter gym. Wander around the grass until you find and catch a Mankey. [12] X Research source At levels 6 and 12, Mankey respectively learns Low Kick and Karate Chop, two Fighting-type abilities that’ll do a lot of damage to Brock’s Pokémon. [13] X Research source"
    },
    {
      "title": "Charmander",
      "content": "Charmander Yes, Charmander’s Ember attack isn’t very powerful against Rock-type Pokémon. If you get him to level 13, however, he will learn Metal Claw, a Steel-type move that’s naturally strong against Rock Pokémon. [14] X Research source"
    },
    {
      "title": "Gym #2: Cerulean City (Water)",
      "content": "Gym #2: Cerulean City (Water) As the second leader of the Kanto region, Misty’s team consists of a level 18 Staryu (Water) and a level 21 Starmie (Water/Psychic). [15] X Research source Water-type Pokémon don’t hold up well against Grass- or Electric-type Pokémon, so be sure to battle Misty with Pokémon that have these abilities in their move set. [16] X Research source Tip: Find TM09 Bullet Seed (a Grass-type ability) on the first floor of Mt. Moon and equip it on Bulbasaur or Paras (a Pokémon that can also be found in Mt. Moon). [17] X Research source"
    },
    {
      "title": "Gym #3: Vermilion City (Electric)",
      "content": "Gym #3: Vermilion City (Electric) Lt. Surge, the Electric-type gym leader, features a level 21 Voltorb (Electric), a level 18 Pikachu (Electric), and a level 24 Raichu (Electric) on his roster. [18] X Research source Electric-type Pokémon are super weak to Ground-type moves, so keep that in mind before you challenge him. [19] X Research source Tip: Use Geodude as a key player in your battle. As a dual Rock-Ground-type Pokémon, Geodude should have Ground-type abilities like Mud Sport and Magnitude by the time it’s level 16 or higher. [20] X Research source"
    },
    {
      "title": "Gym #4: Celadon City (Grass)",
      "content": "Gym #4: Celadon City (Grass) Erika is the game’s Grass-type gym leader who fights with a level 29 Victreebel (Grass/Poison), a level 24 Tangela (Grass), and a level 29 Vileplume (Grass/Poison). [21] X Research source Not to worry, though—Grass-type Pokémon are weak to a variety of different Pokémon types, including Fighting, Fire, Poison, Flying, Bug, and Ice. [22] X Research source Tip: Poison/Grass-type Pokémon like Vileplume and Victreebel won’t be as hurt by Poison-, Bug-, and Fighting-type Pokémon, but they are still weak to Ice-, Fire-, and Flying-type Pokémon, as well as Psychic-type."
    },
    {
      "title": "Gym #5: Fuchsia City (Poison)",
      "content": "Gym #5: Fuchsia City (Poison) Koga is the leader of the Poison-type gym, and fights with a level 37 Koffing (Poison), a level 39 Muk (Poison), a level 37 Koffing, and a level 43 Weezing (Poison). [23] X Research source Ground- and Psychic-type Pokémon pack an especially powerful punch against Koba’s team, so be sure to equip these types of Pokémon on your team. [24] X Research source Tip: Head through Diglett’s cave to catch either a Diglett or Dugtrio. [25] X Research source These Ground-type Pokémon can definitely give you an edge in battle!"
    },
    {
      "title": "Gym #6: Saffron City (Psychic)",
      "content": "Gym #6: Saffron City (Psychic) As the Psychic-type gym leader, Sabrina faces off using a level 38 Kadabra (Psychic), a level 37 Mr. Mime (Psychic), a level 38 Venomoth (Bug/Poison), and a level 43 Alakazam (Psychic). [26] X Research source Make sure some of your Pokémon have Dark-, Bug-, and/or Ghost-type attacks equipped, which do extra damage to Psychic types. [27] X Research source Tip: Be sure to have a Pokémon on your team that can handle Venomoth! This dual-type Pokémon takes a lot of damage from Psychic-, Fire-, Rock-, and Flying-type abilities."
    },
    {
      "title": "Gym #7: Cinnabar Island (Fire)",
      "content": "Gym #7: Cinnabar Island (Fire) Blaine, the leader of the Fire-type gym, battles with a level 42 Growlithe (Fire), a level 40 Ponyta (Fire), a level 42 Rapidash (Fire), and a level 47 Arcanine (Fire). [28] X Research source Water-, Rock-, and Ground-type attacks are all super effective against Fire-type Pokémon, so be sure to plan your team accordingly. [29] X Research source Tip: Bust out the TM03 Water Pulse that Misty gave you if you don’t have a lot of Water-type attacks on hand—it’ll come in handy during this gym battle."
    },
    {
      "title": "Gym #8: Viridian City (Ground)",
      "content": "Gym #8: Viridian City (Ground) Giovanni, the final gym leader you have to face, features a team full of Ground-type Pokémon: a level 45 Rhyhorn (Ground/Rock), a level 42 Dugtrio (Ground), a level 44 Nidoqueen (Ground/Poison), a level 45 Nidoking (Poison/Ground), and another level 50 Rhyhorn. [30] X Research source Water-, Ice-, and Grass-type Pokémon all do a lot of damage against Ground-type Pokémon, so make sure your Pokémon roster is up to the task. [31] X Research source Tip: Save your game before fighting Giovanni (and any other gym leader, if you want to be safe). If your team gets wiped out, simply reboot your game and start over! Once you beat all the gyms, you can progress to fighting the Elite Four ."
    }
  ]
}