{
  "url": "https://www.wikihow.com/Be-Safe-During-a-Landslide",
  "title": "How to Be Safe During a Landslide",
  "steps": [
    {
      "title": "Keep yourself alert and awake when there are active landslide warnings.",
      "content": "Keep yourself alert and awake when there are active landslide warnings. Landslides can occur quite suddenly, so you need to be ready to take action at a moment’s notice. Many landslide-related deaths occur while people are asleep. [1] X Research source If you are with other people, work together to keep one another awake. Watch and listen for warning signs of a nearby landslide, including sounds of falling debris or changes in water clarity or flow. It is imperative that you familiarize yourself with landslide warning signs, especially if you live in an at-risk area. Keep reading to learn more about landslide warning signs in detail."
    },
    {
      "title": "Listen to a local news station for updates.",
      "content": "Listen to a local news station for updates. Using a battery-powered radio or television, listen to your local news station for updates about the weather. Be alert to warnings about intense rainfall, which can trigger landslides. [2] X Research source"
    },
    {
      "title": "Evacuate if it is safe to do so.",
      "content": "Evacuate if it is safe to do so. Sometimes, your local law enforcement will order an evacuation, but other times, they may not be aware of a landslide until it is too late. If you think a landslide is imminent and it is safe to leave, evacuate immediately. Contact your neighbors and your local police or fire department to warn them of danger. [3] X Research source Be sure to bring your animals with you. Don't forget to bring your emergency kit, which contains essential items like food, water, and medication. You'll learn how to make one in a later section."
    },
    {
      "title": "Be cautious and alert while driving.",
      "content": "Be cautious and alert while driving. If you need to drive to leave a dangerous area, proceed with caution. Beware of flooded roads, collapsed pavement, fallen debris, and washed-out bridges. DO NOT cross flooded streams--instead, turn around and try to find an alternative route. [4] X Research source"
    },
    {
      "title": "Move to a second story, if possible.",
      "content": "Move to a second story, if possible. If it isn’t safe to leave the building, but you believe a landslide is imminent, move to the building’s second story, if possible. [5] X Research source"
    },
    {
      "title": "Move out of the path of the landslide as quickly as you can.",
      "content": "Move out of the path of the landslide as quickly as you can. Landslides move very quickly--much faster than you can run or walk. Trying to outrun a landslide is futile. Instead, remove yourself as fast as you can from the path of the landslide. [6] X Research source Before crossing any bridges, always look upstream to see if a landslide is approaching. If this is the case, do not cross the bridge and move out of the path of the landslide."
    },
    {
      "title": "Avoid river valleys and other low areas.",
      "content": "Avoid river valleys and other low areas. These areas are especially dangerous when landslides are imminent, so stay away. [7] X Research source"
    },
    {
      "title": "Curl into a ball if you cannot escape.",
      "content": "Curl into a ball if you cannot escape. In some cases, you may not be able to escape. If you are trapped in the path of a landslide, curl up into a tight ball and protect your head. [8] X Research source"
    },
    {
      "title": "Go to a public shelter.",
      "content": "Go to a public shelter. Your local community should have a designated public shelter. Go to the shelter if your home is unsafe or the authorities have called for an evacuation. [9] X Research source To find the shelter closest to you, text SHELTER + your ZIP code to 43362 (4FEMA). For example, if your zip code is 56789, you would text SHELTER 56789."
    },
    {
      "title": "Avoid the area where the landslide occurred.",
      "content": "Avoid the area where the landslide occurred. Landslides may recur in the same location. Avoid this area and seek shelter. [10] X Research source"
    },
    {
      "title": "Check for trapped and injured people.",
      "content": "Check for trapped and injured people. You should not enter the area where the landslide occurred. However, if you can see people who are trapped or injured in the area, notify the authorities immediately. [11] X Research source"
    },
    {
      "title": "Help neighbors who need special assistance.",
      "content": "Help neighbors who need special assistance. Infants, the disabled, and the elderly may experience extra difficulty in emergency situations. If it is safe to do so, help your neighbors with special needs. Remember that neighbors with large families may require additional assistance as well. [12] X Research source"
    },
    {
      "title": "Assess the area for damage and safety.",
      "content": "Assess the area for damage and safety. Report any damaged utility lines, roadways, and railways to the authorities. If you are in a building, examine its foundation, chimney and surrounding land to determine if the structure is stable. If the area appears unsafe, leave immediately. [13] X Research source"
    },
    {
      "title": "Replant the affected area.",
      "content": "Replant the affected area. Landslides often destroy vegetation. Without vegetation, the area is more susceptible to erosion and flash flooding, which can lead to another landslide. Replanting the affected area helps prevent future landslides. [14] X Research source"
    },
    {
      "title": "Talk to a geotechnical expert.",
      "content": "Talk to a geotechnical expert. If your property was damaged in the landslide, consider talking to a geotechnical expert to reduce landslide risk. The expert can evaluate your property and determine what modifications, if any, should be made to ensure your safety. [15] X Research source"
    },
    {
      "title": "Look for new areas of moisture.",
      "content": "Look for new areas of moisture. If you see springs or puddles in areas of the ground that are usually dry, this could be a sign of an imminent landslide. [16] X Research source"
    },
    {
      "title": "Look for warping in your home.",
      "content": "Look for warping in your home. Take note if your deck, patio, or concrete floors are tilting, pulling away from the building, or cracking. Sticking doors and windows could also indicate warping that precedes a landslide. [17] X Research source Broken water lines or other utilities may also be a warning sign."
    },
    {
      "title": "Look for warping and movement in the surrounding area.",
      "content": "Look for warping and movement in the surrounding area. Sunken roadbeds and leaning fences, telephone poles, and trees can signal an imminent landslide. [18] X Research source"
    },
    {
      "title": "Notice unusual sounds.",
      "content": "Notice unusual sounds. A faint rumbling sound that gets louder and louder could indicate an approaching landslide. Sounds like cracking trees or scraping rocks may signal moving debris from a landslide. [19] X Research source"
    },
    {
      "title": "Monitor changing water levels.",
      "content": "Monitor changing water levels. A sudden increase in creek water levels is a warning sign, as is a sudden decrease in water levels despite recent rain. [20] X Research source If you live near a waterway, check the water’s clarity. A change from clear to muddy could mean a landslide is imminent."
    },
    {
      "title": "Follow proper land-use procedures.",
      "content": "Follow proper land-use procedures. Proper land use-procedures dictate that you should not build near mountain edges, steep slopes, or natural erosion valleys. These areas are prone to landslides. [21] X Research source"
    },
    {
      "title": "Contact local officials about past landslides.",
      "content": "Contact local officials about past landslides. Landslides tend to happen in the same area where they have occurred before. Talk to local officials about landslides in your area. If you are in an at-risk area, consider getting a site analysis of your property. This will help you determine any necessary corrective measures. [22] X Research source You should be especially attuned to landslide warning signs if you live in an at-risk area."
    },
    {
      "title": "Consider building retaining or deflection walls.",
      "content": "Consider building retaining or deflection walls. Retaining walls, channels, and deflection walls can shield your property from landslide debris and divert debris flow. If you live in an area that is vulnerable to landslides, consult a professional to see what should be done. [23] X Research source Beware—if your channels or deflection walls cause debris to flow into a neighbor’s property, you may have to pay for damages. If you build a wall, putting drainage behind the wall is extremely important. This will prevent the wall from tipping over and sliding down the hill if any pressure buildup or water accumulates in front of it."
    },
    {
      "title": "Talk to an insurance agent if your area is at risk.",
      "content": "Talk to an insurance agent if your area is at risk. If your area is vulnerable to landslides, talk to an insurance agent to see if your insurance covers landslide-related damage. Although landslide insurance is not usually available, some flood insurance policies cover damage from landslide flows. [24] X Research source"
    },
    {
      "title": "Make an emergency kit.",
      "content": "Make an emergency kit. An emergency kit contains the essentials that your household will need during an emergency. Make your kit in advance so it is ready at a moment’s notice. Your kit should contain enough food and water to last for at least 72 hours, as well as supplies like medications, flashlights, batteries, cell phones, copies of personal documents, and cash. [25] X Research source Remember that landslides can cut off services like electricity, sewage treatment, gas, water, and telephones. Pack supplies in your kit that will allow you to deal with these outages. Choose food that is non-perishable and can be prepared during power outages. Pack any important items that would be difficult or impossible to replace."
    },
    {
      "title": "Discuss safety protocol in the event of a landslide.",
      "content": "Discuss safety protocol in the event of a landslide. Talk to your family about the appropriate actions to take in order to stay safe during a landslide, especially if you live in a vulnerable area. Be sure to discuss evacuation procedures, as well as safe locations and areas to avoid. [26] X Research source"
    },
    {
      "title": "Understand how to get emergency alerts.",
      "content": "Understand how to get emergency alerts. Make sure everyone knows how to get emergency alerts from local officials, whether it be via phone, television, or radio. Talk to your local emergency management agency to see how alerts are delivered in your area. [27] X Research source Don’t forget to emphasize the importance of listening to the local news station for emergency updates in the event of a landslide!"
    },
    {
      "title": "Collect family members’ contact information.",
      "content": "Collect family members’ contact information. Write down each family member’s phone number, email, social media, medical facilities, and school or workplace. Having this information on hand will make it easier for family members to get in touch in the event of the landslide or other emergencies."
    },
    {
      "title": "Pick an emergency meeting place.",
      "content": "Pick an emergency meeting place. In the event of a landslide or other emergency, choose a place where the family will meet to reunite. Select a location in your neighborhood and your town. Make sure everyone is aware of the location. [28] X Research source Choose a location that is accessible for everyone in your family, particularly for members with disabilities. If you have pets, pick a pet-friendly area. You might choose to meet at a neighbor’s house or your mailbox for your neighborhood location, and at a community center or a place of worship for your town location."
    },
    {
      "title": "Compile and share your plan.",
      "content": "Compile and share your plan. Compile contact information, landslide safety protocol, and your emergency meeting places on a single document. This is your emergency plan. Give every family member a copy and make sure they carry it with them at all times. [29] X Research source Put a copy somewhere central in your home, like on the fridge. You may also want to make an emergency plan for your business."
    },
    {
      "title": "Practice your plan.",
      "content": "Practice your plan. Meet with your household periodically to review your plan and practice landslide safety protocol. This is important if you live in an area where landslides are common. [30] X Research source"
    }
  ]
}