{
  "url": "https://www.wikihow.com/Address-a-Letter-to-a-Government-Official",
  "title": "How to Address a Letter to a Government Official",
  "steps": [
    {
      "title": "Learn the official's name.",
      "content": "Learn the official's name. Make sure that you know exactly who this person is, and that he or she is the appropriate person to contact about your case. Clarify why you are writing a letter to this particular official."
    },
    {
      "title": "Find the mailing address of the official.",
      "content": "Find the mailing address of the official. Run a web search for \"[government official] mailing address.\" If a web search doesn't turn up the answer, then visit the website for the relevant department of the local, state, or national government. If you’re in the US, you can find a comprehensive list of contact information for national, state, and local administrators at https://www.usa.gov/ . If you’re not sure who to address, look for the address of the relevant department. For instance, you could write your local DMV office or the Department of Homeland Security."
    },
    {
      "title": "Address the letter",
      "content": "Address the letter . Include the official's title and full name (e.g. President Barack Obama ) along with his or her official mailing address. Write the words clearly and legibly in the center of an envelope, and then seal the letter inside the envelope. Stick a stamp in the top-right corner of the envelope. If you are hoping for a response from this government official, make sure to write your full name and return address in the top-left corner of the envelope! [1] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source"
    },
    {
      "title": "Show due respect.",
      "content": "Show due respect. Open your letter with a formal salutation, and end it with an appropriate closing statement. Depending on the level of government, this official may employ a team of secretaries to read through his or her mailbox for important letters. A polite, thoughtful, and well-written letter will almost always be more likely to make it through this filtration system. [2] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source If writing to an embassy or ambassador, read How to Address Ambassadors ."
    },
    {
      "title": "Use the proper title.",
      "content": "Use the proper title. Address a government official using their title and last name. However, if there is only ever one person in a given post at a time (e,g, the President, the Mayor, or the Speaker of the House,) then you can address the person by his or her title alone: Mr. President or Ms. Mayor. If multiple people hold a given office at one time (e.g. Senator, Justice, Representative,) then you need to use the last name to clarify whom, exactly, you're addressing. [3] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source It never hurts to include the official's name, even if he or she is the only person holding the position. A personally-addressed letter lends a certain degree of humanity to your message."
    },
    {
      "title": "Read sample letters, or send a form letter.",
      "content": "Read sample letters, or send a form letter. Do your research to find out how other people have addressed letters to this particular government official. [4] X Research source Some activism groups and petition websites will actually provide specific information about contacting the officials relevant to a certain cause. You may also be able to simply email the official. [5] X Research source If you’re unsure of what to write, try looking up a form letter and a clear subject line that gets your point across. Some elected officials receive hundreds of letters a day, and oftentimes don’t read them all closely."
    },
    {
      "title": "Ask for something doable.",
      "content": "Ask for something doable. Before you send the letter , consider whether this government official will be able to meaningfully act on your letter. Avoid asking for unrealistic things. Do not ask the government official to do more than his/her job allows. Take a step back and consider whether there is a better channel for your complaint. [6] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source Petitions and form letters are usually well-written and actionable. Make sure, however, that the demanded actions fall within the scope of this official's duties."
    },
    {
      "title": "Get your letter to the top of the stack.",
      "content": "Get your letter to the top of the stack. Depending on rank, government officials may receive dozens to hundreds of letters each day. He or she may even employ professional letter-sorters to determine which select few messages actually wind up in the hands of the official. Make your letter polite, concise, and topical. In the first sentence or subject line, reference an issue that is at the top of the official's agenda. [7] X Research source The letters that wind up at the top of the stack will be readable, relevant, and easy for the official to understand. Be sure to include your qualifications and explain why the official should listen to you. For example, if you’re a Ph.D., you live in the town that’s been in the news lately, or you recently met the official, they may take note of your opinion."
    },
    {
      "title": "Make sure that your letter is appropriate.",
      "content": "Make sure that your letter is appropriate. Is it necessary, or are you just venting? Send a request that is polite, concise, and realistic. Do not swear or drop insults. Respect begets respect. [8] X Research source Do not threaten a government official. The letter can be traced back to you. Beyond any risk, your threats will not necessarily inspire productive action."
    }
  ]
}