{
  "url": "https://www.wikihow.com/Clean-Your-Hookah",
  "title": "How to Clean Your Hookah",
  "steps": [
    {
      "title": "Detach the hose from the hookah base.",
      "content": "Detach the hose from the hookah base. The hose through which you inhale the smoke is connected to the hookah, but not permanently. Twist the hose gently from side to side to work it loose from the base, then pull it so the pieces separate. If the hose seems lodged firmly, continue twisting rather than tugging insistently. Don't apply enough force to damage the hookah."
    },
    {
      "title": "Blow through the hose.",
      "content": "Blow through the hose. [1] X Research source You can perform this step after every single time you smoke your hookah — it only takes a couple seconds. By putting your mouth on the spout where you normally inhale, and blowing through it forcefully, you expel any lingering stale smoke that might affect the taste you experience the next time you smoke."
    },
    {
      "title": "Rinse the hose if it is washable.",
      "content": "Rinse the hose if it is washable. Do this whenever you feel the taste of your smoke is being affected — every tenth use or so at the least. If your hose is made of rubber or plastic and is labeled as “washable,” you can rinse it with water after every fourth or fifth use. You should never use soap or any other chemical products when rinsing your hose — simply run regular tap water through it. Run the faucet in your sink, placing one end of the hookah hose under the water. Make sure the water makes its way into the hose. Position the other end of the hose to make sure the water that’s pushed through the hose drains back into the sink. Let water rinse through the hose for about thirty seconds, then turn off the faucet. Lift one end of the hose up high to allow the water to drain out of the hose. Hang the hose somewhere with a towel underneath it to catch the water that will drip out of it as it dries. Don’t use the hose again until it has finished drying completely."
    },
    {
      "title": "Remove particulate matter from unwashable hoses.",
      "content": "Remove particulate matter from unwashable hoses. If your hose is not made of a washable material, you’ll have to rely on force and wind to try to clear it of any particulate gunk that might have accumulated over many uses. Fold the hose over so both ends are in on hand. Using moderate force, thwack the hose into a soft but sturdy object to jar loose the particulate matter within. A sofa is a good object to thwack it against. Don’t choose any surfaces that might damage the hose, like a sidewalk or a brick wall. Blow through each end of the hose as hard as you can to expel the particulate matter. Hook the hose up to a vacuum cleaner or air compressor (like a bicycle pump) if you have trouble summoning the required lung strength."
    },
    {
      "title": "Take the entire hookah apart.",
      "content": "Take the entire hookah apart. The top part of the hookah relies on the broad base at the bottom to stand up straight, so take all of the pieces apart to keep the hookah from toppling over. Make sure you keep all small pieces in a secure location so you don’t lose anything. Unscrew and remove the release valve. Remove the grommet from the hose port. Remove the bowl from the top of the hookah. Remove the bowl grommet that was underneath it. Lift off the tray that catches coal ash, making sure to dispose of any ash in it without making a mess. Twist and jostle the stem of the hookah gently until it comes loose from the base, and set it aside."
    },
    {
      "title": "Clean the tobacco bowl.",
      "content": "Clean the tobacco bowl. [2] X Research source If you still have old foil and tobacco over the bowl, remove those and dispose of them in the trash. Dig your fingers into the clean side of the foil to help jar the caked tobacco loose without getting your fingers dirty. Run warm faucet water over the bowl. Use your fingers to scrape off any caked-on tobacco that’s left behind. Bring a pot of water to a simmer. Carefully submerge the bowl in the water. Use the charcoal tongs that came with your hookah to get the bowl into the right position without burning your hand in the hot water. Leave the bowl in the simmering water for 3-5 minutes, then remove it using the tongs. Protecting your hand with a thick towel, scrub the bowl using steel wool to remove old, black burn marks."
    },
    {
      "title": "Rinse all grommets in warm water.",
      "content": "Rinse all grommets in warm water. The grommets are the protective disks that keep different parts of the hookah from rubbing up against and damaging each other. They don’t affect taste very much, but it’s good to clean them anyway. Simply run them under warm water, using your finger to smooth over the surface and remove any matter that might have accumulated there. Set them aside on a towel to dry."
    },
    {
      "title": "Rinse your release valve.",
      "content": "Rinse your release valve. Again, simply run warm water over it, rubbing the surface with your fingers. Set aside on the same towel to dry."
    },
    {
      "title": "Wash and scrub the ashtray.",
      "content": "Wash and scrub the ashtray. If you haven’t been keeping up with your regular hookah maintenance, you may well have a charred mess in your ashtray. If you only had loose ash, simply rinse the tray in warm water and rub over the surface with your fingers. If there are black, caked spots of ash on your tray, use hot water to rinse the tray. Scrub it with steel wool to dislodge the ash. Continue rinsing until the tray is clean and the water that comes off of it runs clear. Set it aside on the towel to dry."
    },
    {
      "title": "Run water through the stem.",
      "content": "Run water through the stem. Because the stem is very long, you may be unable to find an angle that will allow you to run water directly from your faucet into the opening at the top of the stem. If that’s the case, pour water into the stem from a glass or pitcher. Make sure the stem is over the sink, so the water can drain away. Do this for about thirty seconds."
    },
    {
      "title": "Scrub the inside of the stem using a stem brush.",
      "content": "Scrub the inside of the stem using a stem brush. [3] X Research source A stem brush is a long, thin brush with stiff bristles. You may have received one with your hookah when you originally purchased it; if not, you can buy one anywhere hookahs are sold, or online. With the stem brush inserted, pour water down into the stem. Pull the brush in and out of the stem vigorously, about 10-15 times. Flip the stem over and repeat the process from the other side."
    },
    {
      "title": "Scrub the stem with lemon.",
      "content": "Scrub the stem with lemon. Stop up the stem by plugging your finger into one end of it. Pour about two tablespoons of lemon juice (fresh or bottled) into the open end of the stem. Reinsert the stem brush and scrub again, scouring the inside of the stem with lemon juice. Remember to switch sides, plugging the other hole and scrubbing with the brush from the other side."
    },
    {
      "title": "Scrub the stem with baking soda.",
      "content": "Scrub the stem with baking soda. Pour a quarter to a half teaspoon of baking soda into the stem. Scrub again with the brush, remembering to insert the brush from both ends of the stem."
    },
    {
      "title": "Rinse the stem clean with warm water.",
      "content": "Rinse the stem clean with warm water. Standing the stem up in the sink, pour water into it with a glass or pitcher, rinsing the lemon juice and baking soda away. Run the water in from both ends of the stem — at least thirty seconds each."
    },
    {
      "title": "Run water through the hose port and release valve.",
      "content": "Run water through the hose port and release valve. Both are located on the sides of the stem. You should be able to angle the stem in the sink to get them under the faucet. But again, use a glass or pitcher if your sink’s dimensions don’t allow for it. Rinse for at least thirty seconds. Insert your finger into the hose port to clear away any debris that may have accumulated."
    },
    {
      "title": "Set the stem aside to dry.",
      "content": "Set the stem aside to dry. Leave it on the same towel where the rest of your smaller hookah parts are. Keeping everything in one place cuts down on the odds of losing something. Lean it up against a wall if possible, so gravity can force the water to drip down out of it."
    },
    {
      "title": "Pour out the old water.",
      "content": "Pour out the old water. If your hookah still has stale old water in it from the last time you used it, carefully pour it out into the sink, making sure not to spill up over the sides and make a mess."
    },
    {
      "title": "Run hot water into the base.",
      "content": "Run hot water into the base. Make sure your base is at room temperature before adding hot water to it; if you recently use ice with your hookah, adding hot water immediately might cause the base to crack. Use your fingers to rub inside the top of the base, as far as your fingers can comfortably fit. Pour the water back out."
    },
    {
      "title": "Add lemon juice and baking soda.",
      "content": "Add lemon juice and baking soda. Measure out about two tablespoons of lemon juice and one teaspoon of baking soda, then pour them into the base of the hookah. Swirl the base around to mix them together; it’s normal for the solution to fizz up a little when the two products come into contact."
    },
    {
      "title": "Scrub the base with a base brush.",
      "content": "Scrub the base with a base brush. A base brush is shorter than a stem brush, and the stiff bristles are much wider. Again, you may have received one with your initial purchase of the hookah; if not, they can be found anywhere hookahs are sold or online. With the lemon and baking soda mix still in the base, insert the base brush. Twist it around inside the hookah, making sure to press it up against the sides firmly to scrub well."
    },
    {
      "title": "Add a little bit of hot water and swirl.",
      "content": "Add a little bit of hot water and swirl. Once hot water has been added to the lemon juice and baking soda mixture, cover the open end of the base with the palm of your hand and swirl the contents around, making sure to cover all of the internal surface of the base."
    },
    {
      "title": "Fill the base up with hot water and let rest.",
      "content": "Fill the base up with hot water and let rest. Fill the base up all the way to the brim with hot water, then set it aside somewhere where it won’t be knocked over to rest. Let it sit for at least one hour; leave it overnight if you want to do a deep clean."
    },
    {
      "title": "Rinse the base.",
      "content": "Rinse the base. Once you’ve let the water, lemon juice, and baking soda mixture do its work for at least an hour, rinse the base clean with hot water. Turn it upside down over a towel to let it dry."
    }
  ]
}