{
  "url": "https://www.wikihow.com/Clean-Leather-Gloves",
  "title": "How to Clean Leather Gloves",
  "steps": [
    {
      "title": "Dampen a paper towel or clean cloth.",
      "content": "Dampen a paper towel or clean cloth. A soft microfiber washcloth works well, but a clean paper towel will also work. Place the cloth or paper towel under clean running water to get it wet and then gently wring it out to remove excess water. [1] X Expert Source Susan Stocker Stain Removal Specialist Expert Interview. 8 November 2019. The cloth or paper towel should be damp but not dripping."
    },
    {
      "title": "Use a mild soap to create a lather with the cloth.",
      "content": "Use a mild soap to create a lather with the cloth. You can purchase a soap specifically designed for leather, or you can use the mildest soap you have in your home. Put some soap on the cloth and rub it together, creating a lather on the cloth. [2] X Expert Source Susan Stocker Stain Removal Specialist Expert Interview. 8 November 2019. For example, saddle soap is a good option for your leather gloves as it cleans the leather while also protecting it. You can purchase a soap like this at a big box store or online."
    },
    {
      "title": "Rub the leather gloves with the sudsy cloth gently.",
      "content": "Rub the leather gloves with the sudsy cloth gently. Try to work the soap into the leather using the cloth, rubbing very gently so as not to ruin the exterior. Pay special attention to the dirty areas of each of your gloves. [3] X Expert Source Susan Stocker Stain Removal Specialist Expert Interview. 8 November 2019. It may be easier if you put on one of your gloves and clean it with the cloth using the other hand."
    },
    {
      "title": "Use a clean, damp cloth to remove the soap and dirt.",
      "content": "Use a clean, damp cloth to remove the soap and dirt. Dampen another cloth or paper towel just as you did with the first one, wringing it out so that it’s not dripping. Use this to gently remove the dirt and soap from the gloves with repeated rubbing motions. [4] X Expert Source Susan Stocker Stain Removal Specialist Expert Interview. 8 November 2019. Make sure you get all of the soap off of each of your gloves."
    },
    {
      "title": "Repeat the process if dirt still remains on the gloves.",
      "content": "Repeat the process if dirt still remains on the gloves. If you notice that there are still some dirt spots on one or both of your gloves, use a sudsy cloth to rub the dirt away gently. Use another clean damp cloth to remove the soap again. [5] X Research source"
    },
    {
      "title": "Put the gloves on your hands to wash them.",
      "content": "Put the gloves on your hands to wash them. This makes it easier to work the soap into the leather and gives you more control over the washing process. Put both of your gloves on, or just one if you’re only washing a specific one."
    },
    {
      "title": "Hold your hands under clean running water for roughly 3 seconds.",
      "content": "Hold your hands under clean running water for roughly 3 seconds. Turn on a faucet to lukewarm water. With the gloves on your hands, run your hands under the water for just a few seconds. You should get the entire surface of your glove wet, but don’t hold your glove under the water for an extended period of time. [6] X Research source"
    },
    {
      "title": "Rub the gloves gently using a mild soap.",
      "content": "Rub the gloves gently using a mild soap. A bar of soap works well for this as you can rub the bar all over your gloves. Once your gloves are sudsy, use your gloved hands to gently rub the soap into the leather. Be careful not to rub too vigorously so you don’t damage the gloves. [7] X Research source Soaps with lots of natural fat, like Marseille soap, are perfect for cleaning leather gloves."
    },
    {
      "title": "Rinse the gloves under clean running water to remove the soap.",
      "content": "Rinse the gloves under clean running water to remove the soap. Turn on clean running water again and place your hands under the stream. Use one gloved hand to help remove the soap from the other hand, and vice versa. Try to make sure all of the soap has been removed before turning off the water. [8] X Research source You can remove your gloves from your hands to help you get the soap out of the leather, if desired."
    },
    {
      "title": "Blot the gloves with a towel to remove excess water.",
      "content": "Blot the gloves with a towel to remove excess water. Set a clean towel on a flat surface and place a glove on the towel. Fold the towel over on top of the glove to blot the excess water from the leather, pressing down on the towel gently. Do the same thing with the other glove to remove as much water as possible. [9] X Research source Avoid twisting the glove to remove water as this can damage the leather."
    },
    {
      "title": "Lay the gloves flat to air dry.",
      "content": "Lay the gloves flat to air dry. Once you’ve removed as much water as possible, lay out the gloves on a flat surface to let them dry at room temperature. Make sure all of the fingers are flat and in the right form so that they dry correctly. [10] X Research source The gloves will likely take an entire day to dry. Avoid placing them near a fire or radiator."
    },
    {
      "title": "Wear the gloves periodically while they’re drying.",
      "content": "Wear the gloves periodically while they’re drying. Putting the gloves on 3-5 times while they’re drying will help them form to your hands again. If the gloves still feel stiff once they’re completely dry, wearing them for a day or two will return them to their stretched-out state. [11] X Research source"
    }
  ]
}