{
  "url": "https://www.wikihow.com/Cleanse-Tarot-Cards",
  "title": "8 Ways to Cleanse Tarot Cards & When To Do It",
  "steps": [
    {
      "title": "Shuffling",
      "content": "Shuffling Sometimes a quickly sorting your cards can be enough to release trapped energy. Simply arrange the cards in the deck in order, starting with the Major Arcana. Look at the cards while you do this, recalling their special meanings. Then, start shuffling the cards until you feel like a new energy has entered them. Try shuffling the deck 7 times to symbolize a spiritual awakening or revival. Love tarot? Take this quiz to discover which tarot card truly matches your personality."
    },
    {
      "title": "Breath",
      "content": "Breath Putting your energy onto the cards can help brush past energies away. Fan your deck of cards out in your hands. Take a deep breath, and start blowing over the fanned out cards. This method is great for a quick cleanse when the energy isn’t too heavy, but you want to start your reading with a clean slate. [1] X Research source"
    },
    {
      "title": "Knocking",
      "content": "Knocking Energy can sometimes get stuck inside a tarot deck. Luckily, this is an easy fix! Simply knock or tap on the stacked deck 3 times while visualizing the trapped energy moving away from the deck."
    },
    {
      "title": "Meditation",
      "content": "Meditation Meditating can help you cleanse your spirit, and it can also help cleanse your tarot deck. Simply press the cards between your hands and close your eyes. Imagine a white or golden glow traveling from your body and into the cards. This visualization helps you and the cards be at peace. [2] X Research source Try this visualization meditation with the cards before each reading to set an intention for your practice."
    },
    {
      "title": "Crystals",
      "content": "Crystals Selenite , clear quartz , and amethyst are commonly used to cleanse tarot cards. Place the crystal on top of the deck or the deck on top of the crystal. The crystal will absorb the energy from the deck, purifying it of past intentions and connections. [3] X Research source Try storing your tarot cards with crystals to charge them with specific energies. For instance, you may store your cards with amethyst for a reading about reducing stress or use rose quartz to look into romantic interests. Other crystal that helps clean negative energy include black tourmaline and black obsidian. Black tourmaline is great for self-healing. Black obsidian is great for protection because it repels. Make sure to cleanse your crystals after cleansing your deck, especially if you want them to channel a specific energy."
    },
    {
      "title": "Moonlight",
      "content": "Moonlight The moon phases can positively alter the energy of your tarot cards and reading. Each phase of the moon cultivates energy specific to certain moods or aspirations. Leave your deck under the moonlight outside or in a windowsill overnight to charge and cleanse. Cleanse your cards during the moon phase that matches the intentions of your next reading: [4] X Research source New moon: Reflection Waxing moon: Motivation Full moon: Forgiveness [5] X Research source Waning moon: Release"
    },
    {
      "title": "Sunlight",
      "content": "Sunlight The warmth of sunlight can recharge your tarot deck and cleanse them of negative energy. Bring your cards outside on a nice sunny day. Lay them out to bake in the light, or fan them around in your hands for a few minutes in the light. [6] X Research source Don’t leave your tarot cards in the sun for too long, as the light can cause their beautiful illustrations to fade."
    },
    {
      "title": "Smoke and smudge sticks",
      "content": "Smoke and smudge sticks Sage and rosemary smoke can cleanse tarot cards of their energy. Either light an incense of these scents or burn a smudge stick made of dried plants. Pass the smoke under the cards several times."
    },
    {
      "title": "Salt bath",
      "content": "Salt bath Salt naturally pulls energy away from objects, including tarot cards. If your cards seem to have a rather negative energy, place them in a sealable bag or airtight container and bury them with salt. Let them rest until your next reading to cleanse them from negative energies. [7] X Research source Opt for a natural salt like sea salt or Himalayan salt rather than table salt for the best results."
    },
    {
      "title": "Singing bowls",
      "content": "Singing bowls Sound frequencies help cleanse unwanted energies while soothing your soul. All you have to do is place your tarot deck inside a singing bowl and start playing. Focus on sounds that make you happy so your cards charge positively. [8] X Research source To play a singing bowl, hold the bowl in the palm of your hand and use the other hand to guide the mallet around the rim of the bowl. [9] X Research source"
    },
    {
      "title": "Cleanse your tarot deck when you first buy it.",
      "content": "Cleanse your tarot deck when you first buy it. Energy can linger on cards whether you buy them new or used. It’s always best to cleanse them before you start any readings or practices, as this will help keep unwanted energies out of your space. [10] X Research source"
    },
    {
      "title": "Aim to cleanse your tarot deck before each use.",
      "content": "Aim to cleanse your tarot deck before each use. Leftover energy from previous readings or practices could affect your current reading, especially if it’s for someone else. Clearing the cards before you use them gives you a clean slate to work with and helps invite new energy. [11] X Research source"
    },
    {
      "title": "Give your tarot cards a cleanse if something feels off.",
      "content": "Give your tarot cards a cleanse if something feels off. There’s no such thing as cleansing your deck too much! If the energy feels strange when you pick up the cards, trust your intuition. Try cleansing them differently than you did before or multiple times."
    },
    {
      "title": "Cleanse your cards so trapped energy doesn't affect your reading.",
      "content": "Cleanse your cards so trapped energy doesn't affect your reading. Tarot cards capture energy with intention, and this intention is what fuels a spiritual reading. Your intention will be different every time you use the deck, meaning your energy will be different. If you don’t cleanse your tarot deck, past emotions and thoughts may hinder your present reading. [12] X Research source Cleansed decks help you or your client reflect on current circumstances better. Think of it like cleansing crystals—you cleanse them to release unwanted energy and welcome new energy."
    }
  ]
}