{
  "url": "https://www.wikihow.com/Become-an-Agent-of-Western-Union",
  "title": "How to Become an Agent of Western Union",
  "steps": [
    {
      "title": "Own your own business",
      "content": "Own your own business . A prospective Western Union agent must own her own independent retail business, which is then deemed eligible to become a qualified Western Union location. [1] X Research source Some of the most common retail businesses that become Western Union agents include, but are not limited to: convenience stores [2] X Research source drug stores [3] X Research source financial service providers [4] X Research source liquor stores [5] X Research source newsagents [6] X Research source pawnbrokers [7] X Research source supermarkets [8] X Research source travel agencies [9] X Research source"
    },
    {
      "title": "Acquire the necessary equipment.",
      "content": "Acquire the necessary equipment. Every Western Union agent must have certain basic office equipment and internet service in order to conduct financial transactions. [10] X Research source The equipment typically required for Western Union transactions includes: a working computer [11] X Research source a reliable internet connection [12] X Research source a working printer (though not all locations require a printer at the business site - speak with a Western Union representative to determine whether your location requires a printer) [13] X Research source"
    },
    {
      "title": "Complete an application.",
      "content": "Complete an application. If you meet all of the business requirements, you may be eligible to become a Western Union agent. To confirm your eligibility, you'll need to complete an online application, which will then be reviewed by Western Union. [14] X Research source You can also call Western Union's customer service line at 1-800-325-6000 if you have any questions about the application process. [15] X Research source The application asks for the following pieces of information: confirmation that you own your own business [16] X Research source confirmation that you have a working computer with a reliable internet connection [17] X Research source your name and personal contact information (phone number and email address) [18] X Research source the name, address, and work number for your business [19] X Research source the nature (by type/category) of your business [20] X Research source how many locations your business operates [21] X Research source how you heard about becoming a Western Union agent [22] X Research source"
    },
    {
      "title": "Receive job training and software.",
      "content": "Receive job training and software. If your application to become a Western Union agent is approved, you will receive a free starter pack from Western Union. This starter pack includes all the necessary training information you'll need to begin making transactions, as well as marketing/promotional materials to advertise your new services to the public. You will also receive the necessary software to install on your computer so that you can begin making transactions at your business. Western Union agents also receive 24-hour customer support from the agency. A customer support representative will be able to answer any questions you have and guide you through any complications that may arise."
    },
    {
      "title": "Participate in anti-money laundering training.",
      "content": "Participate in anti-money laundering training. All money transfer services are required to provide Anti-Money Laundering (AML) training, in compliance with financial regulations. This training is intended to educate you as a new agent and to protect your business from any potential money laundering allegations in the future. Western Union's AML training is considered one of the industry-leading programs for agent training and support."
    },
    {
      "title": "Get your license.",
      "content": "Get your license. All money transfer services are required to have proper licensing, though the nature of this licensing may vary by location. Since Western Union has a worldwide network of money transfer agents, there is no single process that applies to all agents. However, Western Union facilitates all of the necessary licensing for their agents. You'll be in contact with a Western Union representative, who will inform you of the particular license you'll need and help you receive those credentials in a timely manner."
    },
    {
      "title": "Consider enrolling in Western Unions Agent Portal.",
      "content": "Consider enrolling in Western Unions Agent Portal. The Agent Portal is Western Union's online resource for agents around the world. It's free to enroll in the AgentPortal, and being enrolled will make it easier for you to order supplies, access training and fraud-prevention information, report your money transfers, and access customer service assistance. To enroll, simply go to the Western Union AgentPortal website at https://agentportal.westernunion.com/ap/custregister.do . Then fill out your name, contact information, agent account number, and operator ID number. [23] X Research source"
    },
    {
      "title": "Earn money from Western Union",
      "content": "Earn money from Western Union . Customers are charged a transfer fee on every money transfer they make with Western Union. That money goes to Western Union, and it's how WU earns a profit. However, Western Union will pay you a commission on every transfer fee that is processed from each transaction your business sends or receives. The more money you earn for Western Union at your business, the more commissions you earn."
    },
    {
      "title": "Understand the benefits.",
      "content": "Understand the benefits. There are many benefits to operating as a Western Union agent through your existing business. In addition to the monetary compensation you'll receive through regular commissions, you may even increase your store's business. Being a Western Union agent means that you will end up drawing in potential customers who need to transfer/receive money, and may end up buying goods or services from your business. [24] X Research source In addition, your role as a WU agent gives you a competitive advantage over other businesses who offer the same goods and services that you do, as your store will become more of a one-stop-shop. [25] X Research source"
    },
    {
      "title": "Enjoy being part of a worldwide network.",
      "content": "Enjoy being part of a worldwide network. Western Union operates in over 200 countries and territories worldwide. As part of that network, you'll enjoy the benefits of sending and receiving money for customers to/from all parts of the world. In addition, because Western Union operates all around the world, you'll have access to training and customer service support 24 hours a day, seven days a week. [26] X Research source"
    }
  ]
}