{
  "url": "https://www.wikihow.com/Accept-Criticism",
  "title": "How to Accept Criticism",
  "steps": [
    {
      "title": "Stay calm.",
      "content": "Stay calm. It is natural to feel defensive when you are being criticized, but allowing yourself to get upset and show your emotions will not help the situation. Keep in mind that we all make mistakes when we are learning a new skill, so criticism is inevitable and if you deal with it in a constructive way you may learn something valuable as a result. [1] X Expert Source Lauren Krasny Executive, Strategic, & Personal Coach Expert Interview. 27 March 2020. So try to stay calm even if the person who is criticizing you seems agitated. Do not match their emotions because it may make you seem incapable of handling criticism and it will interfere with your ability to learn something from the criticism. [2] X Research source Take a few minutes to breathe. [3] X Expert Source Donna Novak, Psy.D Licensed Clinical Psychologist Expert Interview. 9 December 2020. When you are being criticized, focusing on your breathing can help to keep you calm. Try counting to five (in your head) as you breathe in, then hold your breath to the count of five, and then exhale slowly. Try to smile. Even a small smile can help you to feel better and it may cause the person who is criticizing you to relax a bit too."
    },
    {
      "title": "Give yourself time to cool off.",
      "content": "Give yourself time to cool off. Before responding and even before thinking about the criticism that you received, give yourself time to cool down. Do something you enjoy for about 20 minutes such as listening to your favorite type of music, reading a book, or taking a walk. Giving yourself some time to cool down after receiving harsh criticism will help you to deal with it in a constructive way, rather than just reacting based on your emotional response. [4] X Research source Walk away from the situation if you need some time to think. [5] X Expert Source Donna Novak, Psy.D Licensed Clinical Psychologist Expert Interview. 9 December 2020."
    },
    {
      "title": "Separate the criticism from other areas of yourself.",
      "content": "Separate the criticism from other areas of yourself. [6] X Expert Source Lauren Krasny Executive, Strategic, & Personal Coach Expert Interview. 27 March 2020. When accepting criticism in a way that’s healthy for you, you need to remember to compartmentalize. Try not to think about criticism as being personal or speaking against other things that you do. Take it as it is and do not add things to it or make assumptions about other aspects of yourself based on what was said. [7] X Research source For example, if someone gives you criticism about a painting you did, it does not mean that you're a bad artist. You can have a few flaws in a piece or a painting that no one likes, and you can still be a great artist."
    },
    {
      "title": "Consider the motivation for the criticism.",
      "content": "Consider the motivation for the criticism. Sometimes criticism is not meant to help, it is meant to hurt. Before you decide what to do about the criticism you received, take some time to think about it. Ask yourself some questions to try to understand why the criticism was made. [8] X Research source Were the comments about something you can control? If not, why do you think they are being made? Does the critical person’s opinion of you really matter? Why or why not? Are you in competition with this person? If so, could the criticism be a reflection of that? Do you feel like you are being bullied? If so, have you sought help for the problem? (If you feel like you are being bullied at school or at work, talk to someone who can help such as a teacher or human resources representative.)"
    },
    {
      "title": "Talk to someone about what happened.",
      "content": "Talk to someone about what happened. Whether the criticism you received was based on your performance or just plain mean, it is important to discuss what happened and how it made you feel. Wait until you can get away from the person and find someone who you trust to confide in. Tell them about what happened and how it made you feel. Discussing the criticism with a trusted friend or family member may also help you to better understand the criticism and why it was given."
    },
    {
      "title": "Redirect your focus.",
      "content": "Redirect your focus. Once you have taken steps to calm yourself and understand the criticism, you will need to work on redirecting your focus onto the positive aspects of yourself. If you focus too much on things you need to improve, you may start to feel depressed and helpless. Instead, try making a list of as many strengths as you can think of to start rebuilding your self-esteem. [9] X Expert Source Lauren Krasny Executive, Strategic, & Personal Coach Expert Interview. 27 March 2020. For example, you might include in your list things like “good cook,” “funny,” or “avid reader.” List as many things as you can think of and read over your strengths to remind yourself of what you do well."
    },
    {
      "title": "Listen to the criticism.",
      "content": "Listen to the criticism. [10] X Expert Source Lauren Krasny Executive, Strategic, & Personal Coach Expert Interview. 27 March 2020. When the person is giving you the criticism, make sure that you listen very well and show that you are listening. Maintain eye contact and nod your head now and then to show that you are listening. It may be hard to do this, but it is in your best interest. If you don’t listen you might not respond in the correct manner, which may lead to more criticism. [11] X Research source Even if the advice or criticism is bad, it's still important to hear this person out. If they only send a note, you can \"listen\" at your own pace. Ask yourself if there's anything about the criticism that you think is true. [12] X Expert Source Donna Novak, Psy.D Licensed Clinical Psychologist Expert Interview. 9 December 2020."
    },
    {
      "title": "Restate what your critic just said.",
      "content": "Restate what your critic just said. After your critic has finished talking, it is a good idea to restate their criticism back to them so that you both understand what is needed. In other words, you want to eliminate the possibility of a more criticism due to a misunderstanding. You don’t need to repeat what your critic just said word-for-word, just summarize it. [13] X Research source For example, imagine you have just been criticized because you filed some documents incorrectly and it caused some problems for your coworkers. You might rephrase this to the critic as something like, “What I understood from what you just said is that I need to be more careful when I file documents so that my coworkers can effectively do their jobs. Is that right?” If you didn’t understand the criticism, ask them to explain or repeat something that was unclear to you. Say something like, “I want to make sure that I fully understand so that I can fix the problem. Can you please explain what you mean in a different way?”"
    },
    {
      "title": "Respond when you're ready.",
      "content": "Respond when you're ready. Some types of criticism might be too harsh or complicated to respond to right away. If possible, wait until you are calm, collected, and can have some time to think about the criticism before replying. Sometimes you need to respond to criticism right away, but it is better if you can give it time. Having time to come up with a mature response will lead to the best outcome. [14] X Research source Say something like, \"I appreciate your feedback. Let me take another look at the paper and I'll see what I can do. Can I send you a message tomorrow morning to get your advice on some changes?\""
    },
    {
      "title": "Apologize for your mistakes, if needed.",
      "content": "Apologize for your mistakes, if needed. If the criticism came because you made a mistake or someone got hurt, it's important to apologize for what happened right away. [15] X Research source Apologizing is different from dealing with criticism, so don't feel like apologizing obligates you to change or accept all of the criticism you have received. In most cases, all you need to say right away is something like, \"I am so sorry. I didn't mean for that to happen. I'm going to take another look at this and see how we can make sure that this never happens again.\""
    },
    {
      "title": "Acknowledge where they're right.",
      "content": "Acknowledge where they're right. Once you are ready to verbally respond to criticism, start by acknowledging what part of their criticisms are right. Hearing this will make them feel better and let them know that you have really thought about what they said. [16] X Research source You can simply say, “You are right.” Then move on. You don’t need to go into a lot of detail about why your critic is right. Just acknowledging that you agree with their perspective will help the critic to feel like his or her point has been heard. Of course, your critic might be completely wrong. In this case, it's a good idea to find an aspect of what they said that's right (\"I didn't handle this as well as I could have\", for example) or just thank them for their feedback and leave it at that."
    },
    {
      "title": "Talk about how you plan to change.",
      "content": "Talk about how you plan to change. Tell them how you plan to implement their advice or deal with the issue they criticized. This will reassure them that you're taking care of the problem. Taking criticism in this way, fully acknowledging it and responding to it, makes you come across as mature. When you address problems and take actions to fix them, people will be much more forgiving with you in the future. You can say something like, \"Next time, I'll come to you before I talk with the client and be sure that we're agreed on the response we want to take.\""
    },
    {
      "title": "Ask for their advice.",
      "content": "Ask for their advice. If they did not already recommend a better way of going about the problem, ask them how they would do things differently. If they did already give some advice, you can still ask for more, however. Getting advice gives you a way to learn, but it also makes the person who gave you the advice feel better. Stick to “what” questions instead of “why” questions. Asking “what” questions will lead to more helpful advice while asking “why” may make the situation worse and put the critic into defensive mode. For example, ask something like, “What do you think I should do differently next time?” Don’t ask something like, “Why did you say that about me?” [17] X Research source"
    },
    {
      "title": "Communicate the need for patience.",
      "content": "Communicate the need for patience. Ask for their patience if the changes are not something that you can put into action right away. Changing, especially if the changes are significant, can take time. Asking for their patience will take some of the pressure off of you and lead to a better understanding between you and the critic. When you communicate that you need time to work on improvements, it also tells that person that you plan on taking their criticism seriously. [18] X Research source"
    },
    {
      "title": "See this as an opportunity.",
      "content": "See this as an opportunity. The healthiest way to handle criticism is to see it as a chance to step back, evaluate your actions, and find ways to improve. [19] X Expert Source Lauren Krasny Executive, Strategic, & Personal Coach Expert Interview. 27 March 2020. Criticism is a good thing and can help to bring you up to the top of your game. When you see criticism in this way, you may have an easier time of accepting it. Not only will you be able to take it but you might even find yourself asking for it. [20] X Research source Even if someone was wrong in the criticism they gave, it might still help you find areas where you can improve anyway. Maybe the fact that someone feels like there is a problem with what you’re doing can tell you that there is something you need to work on, even if it is not what that person identified."
    },
    {
      "title": "Distinguish useful advice from useless advice.",
      "content": "Distinguish useful advice from useless advice. It is important, when implementing criticism, to understand what criticism you should listen to. Generally, if someone is just complaining without offering an idea for how you should change, they should probably be ignored. You also shouldn’t worry about criticism surrounding things you can’t change. Some people just hand out criticism so that they can make themselves feel better and you have to look out for situations like that. Don’t respond to criticism if it is useless. Acknowledging and fighting against it will only empower the critic. If the person hasn't given any good advice at all, then you know that they are not being constructive in their feedback. For example, saying something like \"That was terrible, the colours are screwed up and the presentation is messy\". Ask if they have any tips of how to improve. If they're still nasty and unhelpful, ignore them and take anything they say in the future with a grain of salt. Better criticism is when the negatives are accompanied by positives and the person give recommendations for improvements. For example, \"I'm not keen on the amount of red, but I like the hint of blue on the mountains\". They are being constructive and it is a good idea to take note of what they've said. Maybe you will heed this advice next time."
    },
    {
      "title": "Think about and write down some takeaways.",
      "content": "Think about and write down some takeaways. Consider the advice that you were given. Did they tell you what they thought you should do to change? Try to think of a few different approaches that achieve the same effect. This will give you options, so that you can find the best one for you. You should also think about if there’s anything else that you can learn from what the critic said. [21] X Research source It’s actually a really good idea to write it down, word for word, right after you get the advice. This is so your memory doesn’t distort the words later and you end up following only what your hurt feelings thought the criticism was."
    },
    {
      "title": "Make a plan.",
      "content": "Make a plan. Now that you’ve decided what parts of the advice are important to you, you’ll have to make a plan for how you’re going to implement the changes that you want to make. Having a plan, especially one that you write out, will make it easier for you to follow through and make the changes. You’ll also be more likely to take action. [22] X Research source What are the individual things you need to do to make this change happen? Write them out step by step so that you can start working on them. Make sure that your objectives are measurable and within your control. For example, if you have been criticized on a paper you wrote for a class, a measurable goal that is within your control might be to “begin writing my next paper as soon as it is assigned” or “get feedback from my teacher before the due date.” You would NOT want to set goals such as “be a better writer” or “get a perfect score on the next paper” because these goals are difficult to measure and control."
    },
    {
      "title": "Never give up on trying to be better.",
      "content": "Never give up on trying to be better. Be persistent when trying to implement criticism. Criticism often takes you in a direction completely different than what is normal for you or what you believe is the right way. This means that it will take work to improve yourself. Expect obstacles when trying to change your behaviors. Keep in mind that you might agree with what someone says, but struggle and end up falling back into what you know. Don’t feel like this means it’s impossible to change or think less of yourself for failing. You’re learning and if you’re determined and persistent, you’ll get there eventually."
    }
  ]
}