{
  "url": "https://www.wikihow.com/Avoid-Fake-Friends",
  "title": "How to Avoid Fake Friends",
  "steps": [
    {
      "title": "Notice if they don’t root for you to succeed.",
      "content": "Notice if they don’t root for you to succeed. A fake friend will be jealous of the good things in your life, so they won’t want you to attain the things you want. They may respond to good news with criticism or negativity, so think about how your friend acts when you tell them about positive changes in your life. [1] X Expert Source Tracy Carver, PhD Licensed Psychologist Expert Interview. 7 January 2021. Additionally, consider if they make you feel bad when you share good news. [2] X Research source You might say, “Today I finally received that promotion I’ve been working toward!” They may respond, “Yeah, but don’t you have to work more hours? Say goodbye to your hobbies.” Similarly, you could say, “Next month I’m spending a week in Cancun,” and they reply, “Must be nice to leave town whenever you like. Some of us actually have responsibilities.”"
    },
    {
      "title": "Pay attention when a friend is caught gossiping or spreading rumors.",
      "content": "Pay attention when a friend is caught gossiping or spreading rumors. Gossip and rumors are always cause for concern, even if they’re not about you. A friend who is willing to gossip about someone else will likely talk about you behind your back. Listen carefully to what your friend says about other people. Additionally, take note when people tell you your friend said something about you. [3] X Research source For example, they might trash talk a mutual friend that you share. Similarly, they may only share bad stories about the people they know, which is a red flag."
    },
    {
      "title": "Stay away from a friend who judges you.",
      "content": "Stay away from a friend who judges you. [4] X Expert Source Tracy Carver, PhD Licensed Psychologist Expert Interview. 7 January 2021. You might notice that your fake friend is critical about how you look, what you do, and what interests you. Similarly, consider if you find yourself feeling bad about yourself after spending time with them. If your friend doesn’t value who you are, then they’re likely a fake friend. [5] X Research source They might say things like, “I can’t believe you’re actually wearing that,” “Wow, I would quit if I had to do your job,” or “That might be fun to do if you’re boring.”"
    },
    {
      "title": "Set boundaries with a friend who’s always trying to compete with you.",
      "content": "Set boundaries with a friend who’s always trying to compete with you. You may have a close friend who claims to be a big supporter of you but constantly tries to one-up everything you do. Consider if your friend is always trying to top you and if they constantly pursue what you want or have. If this happens, let your friend know that you are rooting for their success and expect them to do the same. Then, limit what you share with them. [6] X Research source You might say, “It feels like you’re trying to compete with me, but we’re friends. I want you to be happy in life, and I hope you want the same things for me.”"
    },
    {
      "title": "Notice if your friend is fake to other people.",
      "content": "Notice if your friend is fake to other people. Listen to how your friend talks about other people versus how they treatment them. If your friend says bad things about a person behind their back but acts nice to their face, they’re being fake. This may mean that your friend is fake to you, as well. [7] X Research source For instance, your friend might say things like, “Amy is so annoying. I wish we could just stop hanging out with her.” Then, when Amy shows up, your friend might hug her and say, “It’s so good to see you! I’ve really missed spending time with you.”"
    },
    {
      "title": "Consider if your friend is using you to help them succeed.",
      "content": "Consider if your friend is using you to help them succeed. You may have a fake friend who’s hoping to use your friendship to help them improve their status at work or school. Notice if your friend asks you to help them with assignments but doesn’t offer help in return. Similarly, pay attention when your friend makes you look bad so they look good. [8] X Research source For example, your friend might blame you for a late assignment even though it was their fault, or they might tell your boss that you said something you didn’t."
    },
    {
      "title": "Notice if your friend only wants to hang out when things are going well.",
      "content": "Notice if your friend only wants to hang out when things are going well. Fair-weather friends are people who like spending time with you when your life is going well. Consider if you have a friend that’s always around when you have money and don’t need support but disappears as soon as times get hard. They may be a fair-weather friend. [9] X Research source For example, a fair-weather friend might spend a lot of time with you while you have a good job and can pick up the tab for meals and drinks. However, they might suddenly be busy when you lose your job and can’t afford to pay anymore."
    },
    {
      "title": "Pay attention if they only contact you when they need something.",
      "content": "Pay attention if they only contact you when they need something. They might need money, advise, support, or someone to go out with. Notice if every time your friend calls or texts it leads to some type of request or leads to you giving them your time and energy. If they only want you when they need you, they may be a fake friend. [10] X Research source For instance, after a week of ignoring you they might suddenly text, “Can I borrow $50 until Thursday?” “Can you give me a ride?” or “Today’s been rough.”"
    },
    {
      "title": "Question them when they break off plans at the last minute.",
      "content": "Question them when they break off plans at the last minute. Sometimes your friends will cancel plans for a valid reason, and that’s okay. However, a fake friend will cancel plans because something better came up or they just don’t feel like seeing you. When your friend cancels on you, ask them why. If they’re canceling plans often, it may be time to distance yourself from them. [11] X Research source You might say, “I’m really sorry you can’t make it tonight. Are you okay?”"
    },
    {
      "title": "Distance yourself from your fake friend.",
      "content": "Distance yourself from your fake friend. Cut back on how much time you’re spending with your friend. Instead, hang out with people you know care about you, or work on making new friends . During this time, consider if you want to continue with the friendship moving forward. You don’t need to tell your friend that you’re distancing yourself from them. Just don’t make plans with them. If they call or text, wait a few hours or days before you get back to them."
    },
    {
      "title": "Avoid sharing your secrets or personal information with them.",
      "content": "Avoid sharing your secrets or personal information with them. Don’t tell them anything they might use for gossip or could use to make you look bad. Keep your conversations focused on neutral topics, like the news, weather, and TV shows. [12] X Research source Try to keep them talking so you don’t have to share anything about yourself. Ask them questions, and show interest in what’s going on in their life. Ask, “What have you been up to lately?” “What’s your new boyfriend like?” and “What are you hoping to do next weekend?”"
    },
    {
      "title": "Talk to your friend if you want to break up.",
      "content": "Talk to your friend if you want to break up. Choose a time when you and your friend can talk alone. Then, tell them how your friendship is making you feel, as well as what you want out of a friendship. Thank them for the fun times you’ve had together, but tell them that you think it’s better if you don’t hang out anymore. [13] X Research source Say, lately I’ve felt really bad about myself after we hang out. I want a friendship that makes me feel good about myself. I really enjoyed the time we spent at the coffee house, so thanks for introducing me to that spot. However, I think we should stop spending time together.”"
    },
    {
      "title": "Express the hurt you feel in a letter, then destroy it.",
      "content": "Express the hurt you feel in a letter, then destroy it. You likely want your friend to feel bad about how they made you feel, but it’s unlikely that they’ll see things from your perspective. Your friend probably doesn’t even realize they’re a fake friend. To release your feelings, write a letter to your fake friend about how they made you feel. Then, tear it up or burn it. [14] X Research source Writing helps you vent all of your thoughts without having to share them with someone else."
    },
    {
      "title": "Expect a real friend to be there for you when you need them.",
      "content": "Expect a real friend to be there for you when you need them. [15] X Expert Source Tracy Carver, PhD Licensed Psychologist Expert Interview. 7 January 2021. When you need a shoulder to cry on or help with a problem, a real friend is going to offer you support. Make sure the friends you choose are reliable and follow through on their promises. This is a sign that they’re a true friend. [16] X Research source [17] X Research source Make sure that you reciprocate and help your friend when they’re in need. [18] X Expert Source Tracy Carver, PhD Licensed Psychologist Expert Interview. 7 January 2021."
    },
    {
      "title": "Look for friends that want you to be happy.",
      "content": "Look for friends that want you to be happy. When good things are happening in your life, a true friend will celebrate with you. They’ll be among your biggest supporters, and they’ll always encourage you to go after what you want. Ask yourself if your friends are your biggest cheerleaders. If they are, then they’re likely true friends. [19] X Research source For example, a true friend will be happy for you when you get engaged, even if they’re single. Similarly, a real friend will be happy for if you get your dream job or a new house."
    },
    {
      "title": "Pick friends who let you be yourself.",
      "content": "Pick friends who let you be yourself. While fake friends might criticize who you are, a true friend will accept you. They’ll appreciate how you dress and what you like. Ask yourself if you feel comfortable being yourself around your friends. If so, they’re probably true friends. [20] X Research source When you’re with a true friend, you shouldn’t have to hide how you think or feel. Similarly, you shouldn’t have to dress a certain way."
    },
    {
      "title": "Value friends who put an equal amount of effort into your relationship.",
      "content": "Value friends who put an equal amount of effort into your relationship. [21] X Expert Source Tracy Carver, PhD Licensed Psychologist Expert Interview. 7 January 2021. When you’re dealing with a fake friend, you might feel like you’re always the person making an effort to keep the friendship alive. However, a true friend will work just as hard as you do. Look for friends who sometimes contact you first and who reach out to make plans. [22] X Research source If you have a friend who’s been putting equal effort into your friendship but has recently been slacking, talk to them about what’s going on. They may be going through a rough time, so don’t assume that they’re being fake."
    },
    {
      "title": "Make mutual trust the foundation of your friendships.",
      "content": "Make mutual trust the foundation of your friendships. A true friend is someone you can trust with your secrets. At first, just tell the person minor details about yourself. As your trust grows, share more with them. [23] X Research source Let your trust build gradually. Don’t share your deep secrets with people when you first meet them. Start small and slowly reveal who you are over time."
    }
  ]
}