{
  "url": "https://www.wikihow.com/Assume-a-Mortgage",
  "title": "How to Assume a Mortgage",
  "steps": [
    {
      "title": "Learn whether you are permitted to assume the loan.",
      "content": "Learn whether you are permitted to assume the loan. Certain types of government-backed loans are much easier to assume than conventional loans. In most cases, you must meet the qualifications of the government agency in order to assume the loan. [1] X Research source Conventional loans usually prohibit assumptions; [2] X Research source however, a bank may be willing to allow you to assume a mortgage if the current owner is in a financial bind that jeopardizes the payback of the note. Additionally, if the buyer has the potential to add a large down payment to the current loan, the lender may be more likely to allow the assumption of the loan. Always talk with the lender, a real estate professional, and a lawyer to ensure you can assume the loan."
    },
    {
      "title": "Decide whether assumption of the mortgage is a good idea.",
      "content": "Decide whether assumption of the mortgage is a good idea. There are certain situations where you may want to assume a mortgage. For example, when you assume a mortgage you keep the interest rate that the original owner has on the loan. If interest rates have risen, then assumption may make financial sense. People also assume mortgages when awarded a property in divorce or as a gift in a will. An assumption can also save you time. Typically, it only takes 30 days to approve a mortgage assumption. [3] X Research source"
    },
    {
      "title": "Find out how much it costs.",
      "content": "Find out how much it costs. You will have to pay the owner for the equity that he already has in the property. For example, if the owner has $140,000 remaining on a mortgage but the selling price is $200,000, then you need to come up with a down payment of $60,000 to cover the equity that has built up in the house. [4] X Research source Furthermore, the lending company may expect you to put a substantial amount of money down in order to qualify you for the assumption. Assumption fees also apply, depending on where the property is located. Average assumption fees can range from $562-1062 or more. [5] X Research source Also understand that assuming the mortgage does not necessarily mean that you will be able to have identical terms as the current mortgage terms. Lenders often have the ability to alter loan terms if the loan is assumed, which could negate any benefit from assumption. Be sure that you understand precisely the terms of the mortgage before assuming it."
    },
    {
      "title": "Check whether you can obtain funds.",
      "content": "Check whether you can obtain funds. If you need to make a down payment, then you should figure out how to come up with the money. If you do not have the necessary amount in cash, then check if you can borrow the money from a bank or credit union. You should approach a mortgage assumption in a similar fashion as buying a house with traditional financing."
    },
    {
      "title": "Request an application from the lender.",
      "content": "Request an application from the lender. In order to assume a mortgage, you must qualify with the current lender. [6] X Research source Without the lender’s consent, you cannot assume the mortgage. To start the process of assuming the loan, request the assumption package from the current lender. The seller should let you know who this is."
    },
    {
      "title": "Gather financial information.",
      "content": "Gather financial information. Along with your application, you will have to submit proof of your financial condition. For example, you may need to provide evidence of pay stubs, as well as W-2 or other tax forms, some going back several years. You will also need information on the year and make of any vehicles you own, as well as the value of retirement accounts, life insurance, and other real estate. [7] X Research source You may also need to get the current property tax statement for the property. [8] X Research source Employment references will probably be requested. Find the address and the telephone number for any employer you have worked for during the past several years. The self-employed will need personal and business tax forms going back at least 2 years."
    },
    {
      "title": "Complete the application.",
      "content": "Complete the application. You will have to fill out many forms: an application with the lender, a real estate agent agreement, paperwork with a title company, and other necessary forms. To see an example of an application packet to assume a mortgage from Bank of America, click here . You will also have to complete an authorization to release information. This authorization allows the bank to call employers and others to double-check your financial information. This form should be in the packet as well. You should keep a completed copy of the forms in a safe place, such as a home safe. Also keep copies of any financial information you submitted along with the completed form."
    },
    {
      "title": "Answer follow-up questions and complete forms.",
      "content": "Answer follow-up questions and complete forms. After you submit an application, your credit scores will be pulled. You will also be sent forms mandated by the Real Estate Settlement Procedures Act. You must fill them out and mail them back. Your completed application will then be forwarded to a Senior Loan Processor, who may call with follow-up questions. [9] X Research source If you have questions, you should always contact your Senior Loan Processor."
    },
    {
      "title": "Sign an assumption agreement.",
      "content": "Sign an assumption agreement. Typically, this agreement is between the seller and the buyer. Depending on the loan, the bank or a government agency (such as a governmental housing authority) may have to sign the agreement as well. You can also sign this agreement before applying with the lender. In this situation, the agreement should state that it is contingent on the buyer being approved by the lender to assume the mortgage. [10] X Research source Always be sure to sign a release from liability for the seller. If this form is not completed, then the seller will still be liable on the mortgage should the new mortgage holder not make payments. A real estate agent should also have this form."
    },
    {
      "title": "Attend the closing.",
      "content": "Attend the closing. Anytime a house sells, whether you assume the note or not, you should have a closing process to sign all of the documents. However, with an assumption, the closing costs will be significantly less than with a conventional mortgage."
    }
  ]
}