{
  "url": "https://www.wikihow.com/Be-Helpful",
  "title": "How to Be Helpful",
  "steps": [
    {
      "title": "Just being present can be a huge help.",
      "content": "Just being present can be a huge help. If you know someone who is facing a difficult situation, ask if they’d like you to go along. For instance, you could offer to go with a family member to a stressful medical appointment, or just hang out with a friend who’s going through a rough breakup. [2] X Research source Say something like, “Want me to tag along when you go in for your checkup today?” or “I know things have been hard lately. Want me to come over to your place for a while this afternoon?” Even if you’re not actually doing much, your presence can be really reassuring to a loved one during a tough time."
    },
    {
      "title": "It’s sometimes best to find out what’s needed before jumping in.",
      "content": "It’s sometimes best to find out what’s needed before jumping in. Don’t always assume you know what someone wants or needs, especially if they’re dealing with a tough situation. They might need a hand running errands, or they might just want to talk about how they’re feeling. Just say something like, “Is there anything I can do to help?” [3] X Research source If the person is hesitant to name anything specific, try making some gentle offers. For example, “If you want, I could run out and grab you some lunch,” or “Would it help if cleaned up here while you go rest for a bit?” Don’t be pushy if they keep saying no, though."
    },
    {
      "title": "Random acts of kindness can really brighten a person’s day.",
      "content": "Random acts of kindness can really brighten a person’s day. Look around for things that need to be done, whether you’re at home, in school, at work, or visiting a friend. Instead of waiting for someone to ask, take the initiative and get it done! [4] X Research source For example, you could take out the trash, clean up after a meal, or wash the car before anyone says something about it."
    },
    {
      "title": "When it comes to being helpful, good communication is key.",
      "content": "When it comes to being helpful, good communication is key. When someone is talking to you about what they want or need, make an effort to really understand what they’re saying instead of just passively taking it in. Give signals that you’re paying attention, such as nodding and saying things like “Yes,” or “I hear you.” You can also rephrase what they’ve just said to make sure you understand it. [5] X Research source For example, say something like, “It sounds like you’re overwhelmed trying to finish all these projects on your own, and it would help if someone took one of them off your hands. Is that right?” You can also ask for clarification if you don’t understand something. For example, “Can you tell me more about the problem you’re having with the files? I didn’t quite understand that.” Sometimes, just the act of listening can be a huge help all on its own! Reader Poll: We asked 141 wikiHow readers how they like to cheer someone up, and 55% of them said listening and affirming their feelings without any judgment or criticism. [Take Poll]"
    },
    {
      "title": "When you act with intention, it’s easier to form new habits.",
      "content": "When you act with intention, it’s easier to form new habits. Instead of just telling yourself you’re going to be more helpful from now on, set some specific goals. Try to be consistent about doing this every day so that it becomes part of your routine. [6] X Research source Your goals don’t have to be huge, especially when you’re starting out. For example, you could say to yourself, “Today I’m going to help my mom out with the housework. I’ll offer to wash the dishes after breakfast.” If it helps, write down your intentions in a planner or a text document. You can even set a reminder for yourself on your phone."
    },
    {
      "title": "Journaling can inspire and motivate you to keep helping.",
      "content": "Journaling can inspire and motivate you to keep helping. Use your journal in any way that’s useful to you. For example, you might write down ideas for how to be more helpful, jot down specific goals and reminders, or keep track of helpful things you’re already doing. [7] X Research source It’s easier to form new habits if you have clear reasons behind them. Try writing down a list of reasons why you want to be more helpful. For instance, “Being helpful will give my life a sense of purpose,” or “Being more helpful will improve my relationships with others.”"
    },
    {
      "title": "When you’re busy, it’s hard to find time to do things for others.",
      "content": "When you’re busy, it’s hard to find time to do things for others. If you want to help out but you’re not sure when you can fit it in, sit down and take a look at your schedule. Figure out when you have a little free time—even if it’s just 10 or 15 minutes—to do something helpful every day. Having this kind of structure will make it easier to focus on what’s really important to you, like helping others. [8] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source For instance, you could set aside 20 minutes every afternoon to help your sibling with their homework."
    },
    {
      "title": "Set a good example for the people around you.",
      "content": "Set a good example for the people around you. When you’re kind to others, it creates a ripple effect. This means that you have the power to make your community better just by being your best self! When you interact with others, make an effort to be gracious, responsible, and respectful. They might just be inspired to pay it forward. [9] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source There are many small ways to set a good example for others. For example, you might make an extra effort to be polite to the cashier at the grocery store, or go out of your way to offer someone a sincere compliment. You can also be a positive influencer by acting in socially responsible ways. For instance, during the COVID-19 pandemic, set an example by wearing a mask and following social distancing rules."
    },
    {
      "title": "Look for organizations in your community that need a hand.",
      "content": "Look for organizations in your community that need a hand. Being helpful is about more than just looking out for people you know. You can also offer your time or skills to charities, service organizations, or schools in your area. Check with organizations that support causes you care about to find out if there’s anything you can do. [10] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source For example, you might volunteer to read to kids at the local library, spend time with the animals at a nearby shelter, or make fundraising calls for a charity you support. If you have any special skills, find ways to put them to use! For instance, if you’re a math whiz, you could offer to tutor kids at your neighborhood elementary school."
    },
    {
      "title": "Research charities and find out what kind of donations they need.",
      "content": "Research charities and find out what kind of donations they need. Donating to charity is a great way to help the people who need it most. When you find a charity that supports a cause you’re interested in, check out their website or give them a call to find out about your donation options. [11] X Research source Many charities prefer getting cash to receiving items. Before you donate goods, such as canned food or clothes, check to make sure they’re actually wanted. [12] X Research source Before donating, check out your potential charity’s reputation on a charity watchdog website like the BBB Wise Giving Alliance, Charity Navigator, or Charity Watch. That way, you’ll know whether your donation is really going to the people who need it. [13] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Being pushy about giving help can do more harm than good.",
      "content": "Being pushy about giving help can do more harm than good. Before you help someone, stop and think. Even if they look like they’re struggling, they might really want to be left alone—or they might not want the kind of help you think they do. When in doubt, it’s always best to ask! For instance, if someone is talking to you about a tough time they’re going through, don’t assume they want advice or are looking for a way to fix things. Instead of jumping in with advice, ask something like, “Is there anything I can do, or do you just feel like venting?” [14] X Research source Be especially sensitive when trying to help people with disabilities. Always ask before giving assistance unless you know the person and know that they want your help. [15] X Research source"
    },
    {
      "title": "Constructive criticism and feedback can help you to be more helpful.",
      "content": "Constructive criticism and feedback can help you to be more helpful. If you’re doing something for another person, check in with them occasionally. Ask if there’s anything they’d like you to do differently, or if whatever you’re doing is actually helpful to them. Take their answer to heart and keep it in mind next time you give them a helping hand. [16] X Research source For instance, you might ask your partner, “Would it be helpful if I keep bringing you lunches at work? Is there anything different you want me to put in next time?”"
    },
    {
      "title": "Sometimes you just can’t give someone the help they need.",
      "content": "Sometimes you just can’t give someone the help they need. If you feel like you’re in over your head, or the help you’ve been giving isn’t enough, it’s totally okay to get extra support. Don’t be afraid to ask a friend, loved one, or other trusted person to pitch in, or even get professional help. In some cases, it’s important to get a professional involved. For instance, if you’re worried that someone you love is having a mental health crisis, the best thing might be to encourage them to see a doctor or counselor. [17] X Research source If you think you’re dealing with an emergency situation, don’t hesitate to call 911 or your local emergency number. Don’t try to handle it by yourself! If you’re a kid or a teen, reach out to a parent, teacher, or other trusted adult if you need help and advice."
    }
  ]
}