{
  "url": "https://www.wikihow.com/Clean-a-Varnish-Brush",
  "title": "How to Clean a Varnish Brush",
  "steps": [
    {
      "title": "Wear rubber gloves and work in a well-ventilated room while cleaning your brush.",
      "content": "Wear rubber gloves and work in a well-ventilated room while cleaning your brush. Mineral spirits are a type of paint thinner useful for getting oil paints or varnishes out of brushes. Because they can be an irritant to the skin or eyes, put on a pair of rubber gloves before you touch the mineral spirits. Work in a well-ventilated area, preferably near an open window to prevent respiratory irritation. Although mineral spirits odors are not usually dangerous to inhale, they can cause loss of coordination, headaches, or even vomiting in severe cases. If you start to feel dizzy or nauseated while using mineral spirits, exit the room immediately and call Poison Control. Clean your varnish brush immediately after using it. Cleaning your varnish brush immediately after using it will prevent any buildup in the bristles, which can cause your brush to get stiff over time. Make it a habit to clean your brush every time you use it so it can stay in good condition. Don't let the brush dry out before you clean it"
    },
    {
      "title": "Pour enough mineral spirits to coat your brush into a bowl.",
      "content": "Pour enough mineral spirits to coat your brush into a bowl. Add a small amount of the mineral spirits to a wide bowl. Aim for just enough that you can dip your paintbrush into it. Do not fill the mineral spirits to the top. You will just need enough to immerse your varnish brush into the mineral spirits. [1] X Research source"
    },
    {
      "title": "Work the mineral spirits into the varnish brush.",
      "content": "Work the mineral spirits into the varnish brush. Dip the brush into the bowl of mineral spirits and rub the mineral spirits into the bristles with your hand. As you rub the mineral spirits into and through the brush, you should be able to feel the mineral spirits coming off of the brush. [2] X Research source If the mineral spirits do not seem to be doing the job, try adding a little more to the bowl and dipping the brush again."
    },
    {
      "title": "Rub the mineral spirits in until most of the varnish is gone.",
      "content": "Rub the mineral spirits in until most of the varnish is gone. Continue rubbing the mineral spirits into the brush until it is mostly washed of its varnish. Some residual varnish is okay, as this will be washed off with dish soap and water later on. [3] X Research source"
    },
    {
      "title": "Wipe the brush with a microfiber brush or cloth.",
      "content": "Wipe the brush with a microfiber brush or cloth. Use a dry microfiber brush or clean cloth to wipe off the mineral spirits and any varnish left on the brush. It's okay if a little varnish residue is left on the brush, but try to get as much off as possible. [4] X Research source"
    },
    {
      "title": "Dispose of your mineral spirits at a place that handles hazardous waste.",
      "content": "Dispose of your mineral spirits at a place that handles hazardous waste. Do not throw your mineral spirits in the trash or wash it down the drain. Mineral spirits are both toxic and flammable, and they cannot be thrown out with the trash. Call local landfills to ask if they dispose of hazardous waste or contact your city's hazardous waste disposal depot. [5] X Research source"
    },
    {
      "title": "Avoid using detergent or paint stripper to wash a varnish brush.",
      "content": "Avoid using detergent or paint stripper to wash a varnish brush. Most cleaning detergents will damage your brush's bristles, and paint stripper is strong enough to warp your brush's shape. To keep from damaging your varnish brush, stick to dish soap and water."
    },
    {
      "title": "Wash the brush with dish soap under warm running water.",
      "content": "Wash the brush with dish soap under warm running water. Rub dish soap into the brush bristles and work it into a lather. Keep the brush under the running water until it no longer has any soap bubbles in its bristles. [6] X Research source Avoid using hot water, which can damage the brush."
    },
    {
      "title": "Rinse the brush until the water runs clear.",
      "content": "Rinse the brush until the water runs clear. If your varnish has a tint, you may be able to see discoloration in the water. Hold the brush over the running water and check the color of the water that runs off your brush bristles. When that water is no longer tinted a certain color, it is clean and ready to dry. [7] X Research source You may not, however, notice any discoloration if the varnish is transparent. In this case, wash the brush until it no longer seems glossy or coated in a substance."
    },
    {
      "title": "Dry the bristles with a clean cloth.",
      "content": "Dry the bristles with a clean cloth. After rinsing out the varnish brush, take a microfiber brush and wipe it over the bristles. Continue wiping until the brush no longer drips and is slightly damp. Wipe in the direction that the bristles run rather than against it to avoid bending them. [8] X Research source"
    },
    {
      "title": "Wrap the bristles with the non-sticky side of a piece of duct tape.",
      "content": "Wrap the bristles with the non-sticky side of a piece of duct tape. Cut a piece of duct tape long enough to wrap around the brush. Wrap the non-sticky side around the middle of the bristles to hold them in place as they dry. Then, cut a piece of duct tape of an identical length and cover the sticky side so you can handle the brush easily. [9] X Research source Do not wrap the bristles with the sticky side, as this can bend or pull them out."
    },
    {
      "title": "Leave the varnish brush out to dry for 24 hours.",
      "content": "Leave the varnish brush out to dry for 24 hours. Let the brush dry for at least 24 hours, or until it no longer seems damp. Avoid touching your brush, particularly the bristles, while it is drying. Moving the bristles too much as they dry can cause them to lose their shape."
    },
    {
      "title": "Remove the duct tape before storing your brush.",
      "content": "Remove the duct tape before storing your brush. After your brush has finished drying, it no longer needs duct tape to protect the bristles. Slide the layer of duct tape off of your brush and dispose of it after the full 24 hours have passed."
    },
    {
      "title": "Keep your varnish brush in a dry box with a tight lid.",
      "content": "Keep your varnish brush in a dry box with a tight lid. When the brush is dry, store it in a dry box with a tight-fitting lid until you're ready to use it. This will prevent your brush from molding or mildewing. [10] X Research source"
    },
    {
      "title": "Do not store your brush in water or mineral spirits.",
      "content": "Do not store your brush in water or mineral spirits. Although some may advise you to store your brush in a jar of water or mineral spirits, this method can warp the bristles. Keep your brush in a box instead so it stays in better condition."
    }
  ]
}