{
  "url": "https://www.wikihow.com/Clear-Message-Notifications-on-Android",
  "title": "How to Clear Message Notifications on Android",
  "steps": [
    {
      "title": "Open your Android's Settings .",
      "content": "Open your Android's Settings . You'll find it in your app drawer. If you're receiving notifications for \"unread\" messages you've already opened (or for messages that don't appear in your SMS or messaging app's inbox), try this method. This may also resolve the issue of the badge number on the app's icon reflecting unread messages when all messages have been read. Sometimes these issues will clear up automatically upon receipt of a new message. Ask someone to send you a message to see if that corrects the issue."
    },
    {
      "title": "Tap the Apps menu.",
      "content": "Tap the Apps menu. The name of this menu will vary, but it will always contain the word App or Application . If your Android doesn't display all apps by default, tap the All option. It may appear as a tab but sometimes you'll have to open a menu and select something like Show all apps . [1] X Research source"
    },
    {
      "title": "Tap your messaging app.",
      "content": "Tap your messaging app. Choose the app for which you keep receiving non-stop notifications."
    },
    {
      "title": "Tap Storage.",
      "content": "Tap Storage . It's usually a button somewhere on the page. If you see an option that says Clear cache instead of Storage , you can skip this step."
    },
    {
      "title": "Tap Clear cache.",
      "content": "Tap Clear cache . This clears the app's cache, which may clear up the issue. [2] X Research source If you continue to get notifications for messages that aren't actually new, continue with this method."
    },
    {
      "title": "Tap Clear data.",
      "content": "Tap Clear data . A confirmation message will appear, letting you know that you may lose data such as settings and preferences. [3] X Research source"
    },
    {
      "title": "Follow the on-screen instructions to confirm.",
      "content": "Follow the on-screen instructions to confirm. Clearing the app's data will hopefully resolve the issue. If you continue to receive notifications about messages you've already dealt with, try another method."
    },
    {
      "title": "Open your Android's app drawer .",
      "content": "Open your Android's app drawer . You can usually do this by tapping the Apps icon, which is usually at the bottom-center part of the home screen. If your Android is displaying notifications or incorrect message counts for a messaging app (such as WhatsApp, Hangouts, or Facebook Messenger), you can usually resolve it by uninstalling and reinstalling the app and clearing the data for the \"BadgeProvider\" service. [4] X Research source If you don't see an icon with several dots or squares at that location, try swiping up from the bottom of the home screen."
    },
    {
      "title": "Tap and hold your messaging app's icon.",
      "content": "Tap and hold your messaging app's icon. After a second or so, you should see a trash can icon (or the word Uninstall ) at the top or bottom of the screen. Do not lift your finger from the icon."
    },
    {
      "title": "Drag the icon to the trash or \"Uninstall\" option.",
      "content": "Drag the icon to the trash or \"Uninstall\" option. When you lift your finger, the app will be uninstalled from your Android. If the app came with your Android and cannot be uninstalled, just skip to the next step."
    },
    {
      "title": "Open your Android's Settings .",
      "content": "Open your Android's Settings . You'll find this app in the app drawer."
    },
    {
      "title": "Tap the Apps menu.",
      "content": "Tap the Apps menu. Depending on your Android version, this may appear as Apps & notifications or Applications . This should display a list of the apps on your Android. If your Android doesn't display all apps by default, tap the All option. It may appear as a tab but sometimes you'll have to open a menu and select something like Show all apps ."
    },
    {
      "title": "Scroll down and tap BadgeProvider.",
      "content": "Scroll down and tap BadgeProvider . This is a default system app on your Android that controls the number that shows up on icon badges. [5] X Research source"
    },
    {
      "title": "Tap Storage.",
      "content": "Tap Storage . If you don't see this option, just skip to the next step."
    },
    {
      "title": "Tap Clear Data.",
      "content": "Tap Clear Data . A confirmation message will appear. [6] X Research source"
    },
    {
      "title": "Confirm the deletion.",
      "content": "Confirm the deletion. Once the process is complete, you can return to the home screen."
    },
    {
      "title": "Download",
      "content": "Download your messaging app again. Now that the notification badge service has been cleared you should no longer see an incorrect badge count."
    },
    {
      "title": "Download the Android Messages app from the Play Store .",
      "content": "Download the Android Messages app from the Play Store . If your Android's default SMS app keeps notifying you of \"new\" message you don't actually have, you can usually fix the issue by temporarily switching your default SMS app to something else. Android Messages is just one of many options, but it's a solid choice (even if you don't wind up keeping it). [7] X Research source The Play Store is located in your Android's app drawer. To download Android Messages, type messages into the Play Store's search bar, tap the search button, and then tap INSTALL next to the Messages app by Google. [8] X Research source"
    },
    {
      "title": "Open the Messages app.",
      "content": "Open the Messages app. It's the blue icon with a white chat bubble in your app drawer."
    },
    {
      "title": "Follow the on-screen instructions to make Messages your default SMS app.",
      "content": "Follow the on-screen instructions to make Messages your default SMS app. You'll be prompted to do this soon after launching the app for the first time. [9] X Research source Once Messages becomes your default app, your existing SMS messages will appear in the app. You may have to give the app permission to access your messages before they appear."
    },
    {
      "title": "Locate the message you're being notified about.",
      "content": "Locate the message you're being notified about. It may appear with a red exclamation point or some other indication that there's something wrong with it. The message may just also appear highlighted since it's unread. [10] X Research source"
    },
    {
      "title": "Tap and hold the problematic message.",
      "content": "Tap and hold the problematic message. After a moment, you'll see some different icons appear at the top of the screen. [11] X Research source"
    },
    {
      "title": "Tap the Delete icon.",
      "content": "Tap the Delete icon. It's the trash can icon at the top of the screen. [12] X Research source This deletes the message from your phone, and you should no longer see notifications for it. Repeat this for any other message for which you're continuously receiving notifications."
    },
    {
      "title": "Change your default SMS app back to your usual app.",
      "content": "Change your default SMS app back to your usual app. If you want to continue using Android Messages (it's pretty solid!), you can skip this step. If not, here's how to get back to your prior app: [13] X Research source Samsung Galaxy: Open your Android's Settings app. It's the gear icon in your app drawer. Tap Apps . Tap the three-dot menu at the top-right corner. Tap Default apps . Tap Messaging Apps . Select your regular messaging app and tap OK . Other models: Open your Android's Settings app. It's the gear icon in your app drawer. Tap Apps & Notifications . Scroll down and tap Advanced . Tap Default apps . Tap SMS app . Select your regular messaging app."
    },
    {
      "title": "Open your phone's default messaging app.",
      "content": "Open your phone's default messaging app. If you are having trouble clearing notifications or an incorrect badge count for an SMS or MMS message, try this method. The messaging app will usually be at the bottom of the home screen. The options vary by messaging app."
    },
    {
      "title": "Open your messaging app's menu.",
      "content": "Open your messaging app's menu. The location will vary, but it'll usually be at the top-left or top-right corner of the screen."
    },
    {
      "title": "Tap the Settings option.",
      "content": "Tap the Settings option."
    },
    {
      "title": "Locate and select the Manage SIM card messages section.",
      "content": "Locate and select the Manage SIM card messages section. The location may vary, but you'll usually have to select an option for Text Messages first. This will display a list of messages stored on the SIM card."
    },
    {
      "title": "Select the messages you want to delete.",
      "content": "Select the messages you want to delete. You can usually do this by tapping and holding one message and then tapping additional messages."
    },
    {
      "title": "Tap Delete or Delete messages.",
      "content": "Tap Delete or Delete messages . This will remove the selected messages from your phone's SIM card, which will hopefully prevent them from displaying notifications on your Android."
    }
  ]
}