{
  "url": "https://www.wikihow.com/Build-a-Model-Ship",
  "title": "How to Build a Model Ship",
  "steps": [
    {
      "title": "Look for a model to purchase.",
      "content": "Look for a model to purchase. There are many different models, styles and types of model boat kits available for purchase. If you are new to model boat building, you should spend some time finding a model ship kit that interests you. Purchasing a kit is one of the easiest ways for beginners to get into the hobby. Have fun and find a model that you want to build to get started. Your local hobby shops will likely have model boat kits available to buy. Many on-line hobby shops can send a model boat kit to your home. There are many different model boat kit styles that you can buy. Many of these will have a differing levels of difficulty and challenge. If this is your first time building a model boat, try to select a simple model for beginners. Do some research on the type of boat you are building to help you get an idea of what it will look like when finished. [1] X Research source"
    },
    {
      "title": "Buy the necessary tools.",
      "content": "Buy the necessary tools. Most model boat kits will require you to purchase some basic tools. These tools will help you to assemble the model and will make sure it goes together correctly. Check the model's tool requirements and purchase any additional tools that may be necessary. You will likely want a wood plane or sandpaper. Small pliers can help when assembling the model. You may find a complete ship model tool kit that will provide everything you need to get started."
    },
    {
      "title": "Follow the model boat kit's instructions and assemble your model.",
      "content": "Follow the model boat kit's instructions and assemble your model. Although many model boats will require you to take similar steps when assembling the model, your kit will come with its own specific instructions. Always follow the instructions for your model boat exactly to help ensure your model is built correctly and looks great when finished. Each model boat will have its own instructions. Always consult your instruction manual every step."
    },
    {
      "title": "Open the box and lay out your parts.",
      "content": "Open the box and lay out your parts. Once you have your model boat kit, you'll want to open it up and examine its contents. You should have all the parts and instructions necessary to assemble your boat. However, you'll want to make sure you actually have everything. Laying the pieces out can be a good way to notice if anything is missing or damaged. [2] X Research source Make sure all the parts are accounted for. Make sure none of the parts are damaged. Find your instructions manual and review it. You may need additional tools or materials. Check your instructions to see if you need to buy anything else before getting started."
    },
    {
      "title": "Build the frame.",
      "content": "Build the frame. Once you've confirmed that you have all the materials and tools you will need to construct your boat, you can get started buy building the frame. The frame of the boat will allow you to add planks, forming the actual body of the model boat. Remember to always consult your model's instructions to properly construct your model boat. Review these tips to help give you an understanding of what you can expect when building your model boat's frame: [3] X Research source [4] X Research source Slide the bulkhead frames into the keel. The keel will be the long piece of the frame, running the length of the boat. The bulkheads will slide into slots found on the keel. Bulkheads will help shape the planks of your boat when it's time to apply them. Once you're sure everything fits, you can glue the bulkhead frames into the keel. Make sure everything is level and flat on the top of the frame. If any bulkheads or areas of the keel are higher than others, use sandpaper to level them off."
    },
    {
      "title": "Level the bulkhead frames.",
      "content": "Level the bulkhead frames. A very important part of assembling your model boat will be to make sure the planks lay evenly over the bulkheads. If the planks aren't able to touch each bulkhead and lay flat, your boat may not be correctly assembled. Use these steps to see how flat the planks will fit across the bulkheads, ensuring that your model boat will be assembled correctly: [5] X Research source Place a plank over the bulkheads. If there is a space where the plank doesn't touch a bulkhead, sand the bulkheads down until the plank rests flatly against each bulkhead. Take your time and make sure each plank will lay flatly against the bulkheads. Make sure to test both sides of the bulkheads. If you sand one area down too much, you can add tiny slivers of wood later on to level off the plank."
    },
    {
      "title": "Add the first planks.",
      "content": "Add the first planks. Once you are sure the planks will lay flatly against the bulkheads, you can begin affixing them. Adding planks will create the hull of your model boat. The first plank you place will determine how each other plank is affixed, so take your time and apply it properly, according to your model's instructions. [6] X Research source You will likely place the first plank at deck level. Planks run the length of the boat, from fore to aft. Each plank will be glued to the bulkheads that it is meant to touch. Check your model's instructions to learn where you should place your first plank. Add planks in pairs to ensure they are even and level with one another. Your first planks should mirror images of one another. Soaking planks in water can help them become more flexible."
    },
    {
      "title": "Keep building the hull by adding planks.",
      "content": "Keep building the hull by adding planks. Now that you have your first few planks in place, you can begin adding the remaining planks to build the hull. These planks will need to fit tightly together, filling in any gaps between them. When you are finished, there should be no gaps between any planks, fully encapsulating the bulkheads and creating the hull. [7] X Research source [8] X Research source If there are any gaps, you can use wood filler or small pieces of wood to fill them in. Your model may have you add additional layers of planking. Follow your model's unique instructions when adding planks to ensure the best results. Additional layers of planking are often decorative. You may need to taper some planks to close up gaps."
    },
    {
      "title": "Sand the hull.",
      "content": "Sand the hull. After you've added all the necessary planks to form the hull, you can begin sanding the hull. Planks may have been slightly uneven in some places, giving your hull a lumpy or rough look. By sanding the hull, you can give your model boat a smooth and streamlined look. Take your time and work carefully to sand away any rough, unleveled, or bumpy areas of the hull. [9] X Research source [10] X Research source Your model boat's hull should look completely smooth after sanding it. Each plank will look like it was naturally blended or attached to the next. No one plank should stick out further than another."
    },
    {
      "title": "Add the deck.",
      "content": "Add the deck. Now that the hull has been sanded you can add in the deck. Adding the deck will complete the main body of your model boat. You will likely need to glue the model deck to the top of your bulkheads, keel, and deck level planks. After you've affixed the deck, you can move on to adding details, painting, and finishing your model boat. Double check your model before adding any finishing touches. You may need to use wood filler or small pieces of wood to make the deck piece lay level. Take a moment to sand down any rough areas that you might notice. Your model will likely have specific instructions for attaching the deck piece. Always check your instructions to make sure your model will be successfully completed."
    },
    {
      "title": "Paint or seal the hull and deck of the model.",
      "content": "Paint or seal the hull and deck of the model. Now that you've fully assembled the hull and deck of the boat, you can begin to apply paint, stains, or other sealants. This can help give your model the finished look that the real boat would have. Check your model's instructions for exact details on which kind of finish to apply and how to apply it. [11] X Research source Most wooden model boats will require some kind of wood stain and sealant to protect the wood. Some models can be decoratively painted to look like their real life counter parts. Matte or stain polyurethane finishes can be a great addition to your model boat."
    },
    {
      "title": "Add details.",
      "content": "Add details. Once the majority of your model boat has been painted, you can begin adding details. These small pieces can help add a level of realism to your boat, making the model look and feel completed. Your model kit will likely include all the necessary pieces to add. Follow the instructions in your kit to learn exactly where and how to place the detail pieces to your model. As an example, you may want to add elements like these to give your boat an authentic feel: [12] X Research source [13] X Research source Sails. Masts. Figurehead. The boat's wheel. Rigging. Cannons. Quarterdeck."
    },
    {
      "title": "Finish your model and display it.",
      "content": "Finish your model and display it. Before you complete your model, it's a good idea to give it one final check. Make sure everything is painted to your liking, that you've added all the detail items, and that you are satisfied with the way it looks in general. If there is something missing, feel free to go back and fix whatever it is you've noticed. After you've checked your model boat over, you can proudly display your hard work. You can buy model boat displays at many hobby stores. You shouldn't have any leftover parts from your model. If you do, try to figure out where it was supposed to go and add it if possible. Be careful with your finished model boat as it will be fragile."
    }
  ]
}