{
  "url": "https://www.wikihow.com/Aerie-Student-Discount",
  "title": "How Students Can Get a Discount at Aerie (& Other Stores)",
  "steps": [
    {
      "title": "Aerie doesn’t offer an official student discount, but StudentBean and UniDays do!",
      "content": "Aerie doesn’t offer an official student discount, but StudentBean and UniDays do! While lifestyle brand Aerie doesn’t officially offer discounts for students, StudentBeans is currently offering a 10% student discount, and UniDays has a 20% offer. StudentBeans and UniDays are apps and websites that offer college students discounts and exclusive deals to popular brands. All you have to do is sign up for StudentBeans or UniDays with your college or university email, then click Aerie's storefront through the app or website to be redirected to Aerie.com with automatic discounts applied. [1] X Research source You must shop online through StudentBeans or UniDays to get these offers. How do you know if your school has StudentBeans or UniDays discounts? Go to StudentBeans.com or myUniDays.com and try to create an account with your college- or university-given email. [2] X Research source If you're unable to create an account, you can request your institution to join UniDays or StudentBeans . [3] X Research source"
    },
    {
      "title": "Sign up for Real Rewards.",
      "content": "Sign up for Real Rewards. If you sign up for Aerie’s rewards program (called Real Rewards), you’ll receive exclusive perks, discounts, and rewards. There are 3 free levels of the program: [4] X Research source Level 1: Free for any customer Every $1 spent is 10 points 1,250 points is a $5 reward Free shipping on orders $75+ Level 2: Must spend $150 a year to access Every $1 is 15 points 1,250 points is a $5 reward Free shipping on orders $50+ Level 3: Must spend $350 a year to access Every $1 is 20 points 1,250 points is a $5 reward Free shipping on orders $25+"
    },
    {
      "title": "Get a Real Rewards Credit Card.",
      "content": "Get a Real Rewards Credit Card. The highest level of Real Rewards you can get is when you purchase a Real Rewards Credit Card . This card can be used at Aerie stores and online and includes bonus rewards and discounts regular Real Rewards members don’t have. Special perks include: [5] X Research source Every $1 spent is 40 points Free shipping on all orders 30% off first purchase 20% off once every year 16% back in rewards Exclusive cardholder sales and events A Real Rewards Visa Credit Card is also available and can be used anywhere Visa cards are accepted. [6] X Research source"
    },
    {
      "title": "Subscribe to Aerie’s mailing list.",
      "content": "Subscribe to Aerie’s mailing list. When you shop at Aerie, the cashier or website will ask if you’d like to receive email updates from the store. Signing up for these updates is a great way to see upcoming deals and get exclusive prices—so don’t be afraid to hand over your email! [7] X Research source Some Aerie locations may also offer a text service. Ask an employee at your local store for more information. [8] X Research source"
    },
    {
      "title": "Refer a friend for 20% off.",
      "content": "Refer a friend for 20% off. If you know someone who wants to shop at Aerie (or American Eagle), send them an exclusive link so you both receive 20% off your order. Simply follow this link and enter your and your friend’s email addresses. [9] X Research source"
    },
    {
      "title": "Find discounts on coupon websites.",
      "content": "Find discounts on coupon websites. Sometimes, the best discounts can be found through third-party apps and sites. For current offerings at Aerie, check websites like Coupons.com , Groupon , and Rakuten . These apps and sites change their offerings based on what’s currently available. In other words, you’ll never come across an old deal! Keep in mind that not every coupon is foolproof through these third parties. For instance, some offerings may only be good for a limited number of customers. So, don’t be discouraged if a discount code doesn’t work."
    },
    {
      "title": "American Eagle",
      "content": "American Eagle American Eagle and Aerie are one and the same! These brands are part of the same company (AEO, inc.), meaning many discounts and offers are interchangeable. If you sign up for Real Rewards, your points can go towards Aerie and American Eagle purchases. [10] X Research source Similarly, Real Rewards points can also be used as OFFL/NE by Aerie stores, AEO Factory stores, Aerie Factory stores, and The Gateway store."
    },
    {
      "title": "Urban Outfitters",
      "content": "Urban Outfitters Urban Outfitters is currently offering 10% off for students. Whether you’re shopping for cute outfits or dorm decor, UO has your back! All you have to do is sign up with your email when you go to check out. [11] X Research source UO also gives first-time customers 15% off their first order, so don’t let that discount go to waste! [12] X Research source"
    },
    {
      "title": "Aéropostale",
      "content": "Aéropostale Through UniDays, students can get an extra 15% off at Aéropostale! This offer is online exclusive, and all you have to do is join UniDays and verify your student status following this link . [13] X Research source To verify your UniDays account, you’ll need to use your school email address and provide a photo ID card or other school-supporting documentation. [14] X Research source"
    },
    {
      "title": "Nike",
      "content": "Nike High school, college, and university students can get 10% off at Nike.com and in the Nike App. All you have to do is verify your student status with SheerID (follow this link ) and provide documentation of your enrollment. [15] X Research source You must be 16 or older to receive this discount."
    },
    {
      "title": "ASOS",
      "content": "ASOS ASOS offers student discounts up until graduation. The standard discount is 10% but is subject to change. To apply, sign up for an ASOS account and link a student code to your account. [16] X Research source Follow the instructions on this page when signing up to receive your student code through SheerID."
    }
  ]
}