{
  "url": "https://www.wikihow.com/Cook-Hake",
  "title": "How to Cook Hake",
  "steps": [
    {
      "title": "Preheat the oven to 350 °F (177 °C).",
      "content": "Preheat the oven to 350 °F (177 °C). Set the oven to bake or convection and allow it to begin warming up as you get the rest of your ingredients together. Hake is a delicate fish that doesn’t take long to cook through, so it’s best to use a moderate temperature to prevent it from getting too done. Baking hake highlights the fish’s natural flavor without contributing unnecessary calories."
    },
    {
      "title": "Wrap each fillet in a sheet of aluminium foil.",
      "content": "Wrap each fillet in a sheet of aluminium foil. Make sure the skin side is facing down so that the meat is visible. Drizzle a small amount of olive oil over the fillets to keep them from sticking.The foil will trap in moisture, preventing the hake from drying out in the heat of the oven. [1] X Research source Make sure the foil you're using can go in the oven safely. Leave the top of the foil open for now in case you decide to thrown in a few herbs, spices, or vegetables for steaming."
    },
    {
      "title": "Season the fillets.",
      "content": "Season the fillets. Sprinkle the hake with kosher salt, black pepper, lemon zest, or other spices to taste. If you want, you can also add pungent vegetables or herbs to each packet. The fish will absorb the flavors of the other components as it cooks, giving a little more depth. [2] X Research source Onions, garlic, capers, and herbs like parsley and dill are all popular companions for baked hake."
    },
    {
      "title": "Fold or twist the ends of the foil closed.",
      "content": "Fold or twist the ends of the foil closed. Once you’ve seasoned the hake, seal up each of the packet to ensure that they'll hold in heat. Enclosing the fillets in foil will also keep any liquid from leaking out while they're baking, which means juicier fish and faster cleanup. [3] X Research source Avoid wrapping the fish too tight. This could mash it and ruin its natural texture."
    },
    {
      "title": "Arrange the wrapped fillets on a large baking sheet.",
      "content": "Arrange the wrapped fillets on a large baking sheet. Leave 2–3 inches (5.1–7.6 cm) of space between them for the heat to circulate. You should be able to fit at least half a dozen average-sized fillets on a single baking sheet. If you're preparing enough for a crowd, you might need to pull out a second sheet or do your baking in batches. If you're worried about the foil sticking, brush the surface of the baking sheet with a light coating of oil before laying out the packets."
    },
    {
      "title": "Place the hake in the oven for 10-12 minutes.",
      "content": "Place the hake in the oven for 10-12 minutes. Slide the baking sheet onto the center rack. Then, set a timer to remind you to check the fish’s progress after the first 10 minutes. If the fillets look like they need a little more time, pop them back into the oven for 2-3 minutes. [4] X Research source When properly cooked, the meat should be white and flaky, and give way easily under a fork. Be careful not to overcook the hake. Since it has such a light consistency, it can go from done to overdone in a matter of minutes."
    },
    {
      "title": "Serve oven-baked hake with your favorite sides.",
      "content": "Serve oven-baked hake with your favorite sides. Plate the fillets alongside a mound of rice pilaf or quinoa and a colorful tossed salad. For a heartier meal, try pairing the fish with steamed seasonal veggies, red potato salad, or corn on the cob. Garnish with a lemon wedge or sprig of parsley and enjoy! Make condiments like tartar sauce or lemon butter available for diners who prefer to dress up their fish. [5] X Research source Put away your leftovers in an airtight container in the refrigerator. When properly stored, cooked fish should last 3-4 days. [6] X Research source"
    },
    {
      "title": "Fill a deep saucepan with 2–3 inches (5.1–7.6 cm) of poaching liquid.",
      "content": "Fill a deep saucepan with 2–3 inches (5.1–7.6 cm) of poaching liquid. Run 7 ounces of water (about 200 ml) into the saucepan, then top it off with a splash of broth or stock. Make sure you use enough liquid to completely cover the fillets. Add your choice of aromatics, such as lemon slices, whole peppercorns, bay leaves, and allspice. [7] X Research source For a tangier poaching liquid, you can also use white wine in place of the broth or stock. Traditionally, a mixture of diced onion, carrots, and celery known as “ mirepoix ” is also incorporated into the poaching liquid. These ingredients can be useful for infusing your hake with a subtle savory flavor. [8] X Research source"
    },
    {
      "title": "Heat the poaching liquid to a low boil.",
      "content": "Heat the poaching liquid to a low boil. Place the saucepan on the cooktop over medium-high heat until it just begins to bubble. Allow the mixture to simmer for 2-3 minutes. This will give the various flavors a chance to mingle. For best results, your poaching liquid should reach a temperature between 160–180 °F (71–82 °C) before you add the hake. [9] X Research source Be careful not to let the liquid come to a full boil. High heat can cause the tender fish to disintegrate."
    },
    {
      "title": "Add the hake fillets to the pan in a single layer.",
      "content": "Add the hake fillets to the pan in a single layer. Lower the fillets carefully to prevent splashing. They should lie flat against the cooking surface and be completely submerged. If you haven’t used quite enough liquid, pour in additional water, wine, broth or stock until the fillets are covered. [10] X Research source If you run out of room in the pan, it may be necessary to cook the fish in batches."
    },
    {
      "title": "Stew the fillets for 10 minutes.",
      "content": "Stew the fillets for 10 minutes. The hot poaching liquid will quickly cook the hake through without drying it out. Keep an eye on the fillets in the meantime. When the meat turns opaque and takes on a plump, juicy appearance, they’re ready to come out. [11] X Research source Avoid stirring the fillets as they’re poaching. Handling them too much could cause them to fall apart. Poaching is one of the fastest ways to prepare lighter types of fish like hake."
    },
    {
      "title": "Drain and serve the hake.",
      "content": "Drain and serve the hake. Remove the fillets from the saucepan using a slotted spoon to strain the excess liquid. Place the fillets on a layer of folded paper towels to soak up any remaining moisture, then transfer them to individual plates for serving. Poached hake goes particularly well with bright, mild vegetables like tomatoes, mushrooms, and zucchini. Some buttery dinner rolls or a loaf of crusty, fresh-baked bread can help balance out the moistness of the fish nicely. Poach fish is best enjoyed fresh. However, any uneaten portions should keep for 2-3 days in the refrigerator when stored along with the remaining poaching liquid."
    },
    {
      "title": "Heat 2 tablespoons (30 ml) of oil in a large skillet.",
      "content": "Heat 2 tablespoons (30 ml) of oil in a large skillet. Place the skillet on the cooktop over medium heat and drizzle in just enough oil to cover the bottom. You’ll know it’s reached the right temperature when it begins to shimmer and smoke faintly. [12] X Research source Oils with high smoke points, such as olive, canola, or vegetable oil, tend to be best for pan frying. [13] X Research source"
    },
    {
      "title": "Place the hake fillets in the skillet with the skin side down.",
      "content": "Place the hake fillets in the skillet with the skin side down. The fish will begin sizzling as soon as it comes into contact with the hot oil, so be sure to release it as close to the pan as possible to safeguard yourself from pops and splatters. Situate the fillets roughly half an inch (2.7 cm) apart to prevent crowding or sticking. [14] X Research source You may only be able to fit 1-2 fillets in the skillet at a time, depending on the size of the fish and your cookware. A pair of tongs can come in handy if you’re worried about being burned."
    },
    {
      "title": "Fry the skin side of the fillets for 3-4 minutes.",
      "content": "Fry the skin side of the fillets for 3-4 minutes. This should be just enough time to get the exterior nice and crispy. Allow the fish to cook until the meat just above the skin begins to turn white. [15] X Research source Hake is typically eaten with the skin on, similar to heartier fish like salmon or bass."
    },
    {
      "title": "Turn the hake fillets over.",
      "content": "Turn the hake fillets over. Slide your spatula under the fillets and give them a flip. Press the spatula firmly against the top of each fillet for a moment until you feel it relax. This will help the underside sear evenly and loosen up the meat for a more tender bite. [16] X Research source Make sure you separate the skin from the pan prior to turning. Otherwise, it can easily stick and lead to breaking and tearing. Always use a spatula to flip fish rather than tongs. Not only is it easier, it also makes you less likely to mangle your main course in the process, improving its presentation."
    },
    {
      "title": "Continue frying for 1-2 minutes, or until done.",
      "content": "Continue frying for 1-2 minutes, or until done. The hake should only require another minute or so to finish cooking after being turned. Use the edge of your spatula to cut partway into a piece to see how it’s coming along. The interior should be white and flaky, with a light browning on both sides. [17] X Research source The fillets will be very hot when they first come out of the pan. It’s a good idea to give them a minute or two to cool down before you begin eating."
    },
    {
      "title": "Serve pan-fried hake with other delectable dishes.",
      "content": "Serve pan-fried hake with other delectable dishes. Whip up some crowd-pleasers like garlic mashed potatoes or sautéed spinach to round out the meal. For a lighter touch, slice a couple tomatoes or a put together a root vegetable medley instead. Pull up a chair and help yourself while it’s hot! [18] X Research source Rich cream sauces can make an excellent compliment to the crisp, golden-brown fillets. Stash your leftovers in the refrigerator and try to consume them within 3-4 days. Reheat the fried fish under the broiler in your oven or in a pan with fresh oil to preserve its tender texture and prevent it from becoming soggy. [19] X Research source"
    }
  ]
}