{
  "url": "https://www.wikihow.com/Be-a-Punk",
  "title": "How to Be a Punk",
  "steps": [
    {
      "title": "Have the state of mind.",
      "content": "Have the state of mind. Punk means to not care what other people say when it comes to pop culture. Punks encourage standing out from the crowd. Punks don't tend to follow any kind of guide line . It's based off music and \"do it yourself\" attitudes. [1] X Research source It's associated with rebellion and anti-establishment. Read up on classic punk topics like resisting tyranny, DIY, rebellion, anti-authoritarianism anarchism and violence. The more you know, the more easily you'll be able to express yourself. Find interesting ways to express what you know and why you think it's important. There is a difference between complaining about authority figures and being against the structure that allows for authority in the first place. Talk to like-minded people and different-minded people. You need to talk to both to really get comfortable with your own perspective. Also, if you're only talking to like-minded people, how will you deliver your radical message to those that need it most?"
    },
    {
      "title": "Find your scene.",
      "content": "Find your scene. Get to know other people who have the same beliefs. This way you'll feel comfortable exploring your punk side without judgement or conflict from squares. Go to some punk concerts. Some venues put up posters - check your local telephone poles. If you have an Instagram account, set it up with a punk or heavy metal theme. That way you can get more friends who are punks, even if you don't know them. Be unapologetically you. If you're autistic, stim in public. If you're LGBT, wear your colors loudly and proudly. Choose a punk music scene. It doesn't matter what music they do. Either punk rock, hardcore punk, or Oi! Choose a regional punk scene you're affiliated with, such as The Detroit Scene, The California punk scene or the Boston music scene. [2] X Research source Figure out where punks in your area meet, be it a specific corner or landmark. Punks usually don't meet at establishments unless it's for the sake of music - they try to use public space as much as possible. If all else fails, ask another punk on the street when the next gig is. Don't be afraid to admit that you're new to all of this. Everyone was new once, and they will probably understand. If you are friendly, people will like you whether or not you know every punk band on earth and have all the typical clothes. Join a punk online community. Here, you can meet other punks worldwide, trade MP3s, find shows or discover new bands. [3] X Research source If you choose your favorite regional scene, you have do some research."
    },
    {
      "title": "Avoid consumerism.",
      "content": "Avoid consumerism. Punks are very resourceful. [4] X Research source Find new ways to enjoy yourself without giving your money to big corporations. [5] X Research source Enjoy the outdoors, be it hiking a mountain or enjoying the park with your friends. Make or join a community garden. You can grow vegetables and cool plants and you won't have to buy them from any establishments Learn to cook. [6] X Research source Not only is it an enjoyable way to spend your time but it also saves money - more for you, less for the establishment. [7] X Research source Negative Approach vocalist John Brannon doesn't only earn his music career, but he got another job as a chef. Find free events through friends, the websites of venues you like or using local event forums. Get crafty. For each item you craft, you haven't supported a store that sells a similar manufactured version. Visit the mall or a big-box store only when necessity demands it. Even things like furniture can be found for free with sites like craigslist.org and freecycle.org. If you must buy something, try to find it used first. It'll be cheaper for you and a little more anti-establishment."
    },
    {
      "title": "Express your attitude through your clothing.",
      "content": "Express your attitude through your clothing. Punk clothing is iconic because it captures a unique sense of rebellion and individualism. Let that anti-establishment attitude show in your outfits. Punks are known for being unique - don't let yourself worry that you don't look like punk. Wear what you want, make sure its relatively alternative, and you'll fit in with any punk crowd. Make your own clothes if possible. Invest in a sewing machine. This way you can create truly unique looks without supporting the establishment. DIY (do it yourself). A lot of punk clothing has a DIY look to it. For a punk, it's always better to remake something old than support consumerism and buy something new."
    },
    {
      "title": "Start out with some punk staples.",
      "content": "Start out with some punk staples. If you're at a loss on how to build a punk wardrobe, here are some items to consider: Skinny jeans or cargo jeans [8] X Expert Source Natalie Tincher Style Strategist & Wardrobe Specialist Expert Interview. 4 June 2020. Black leather jackets or denim vests Studded or spiked clothing and bracelets Safety pins Pin-on buttons (side note: use tape if you put them on backpacks, or they may fall off) Mostly black clothes [9] X Expert Source Natalie Tincher Style Strategist & Wardrobe Specialist Expert Interview. 4 June 2020. Tartan, camouflage, animal print and blood stains. Ripped clothing held together with safety pins Band T-shirts [10] X Expert Source Natalie Tincher Style Strategist & Wardrobe Specialist Expert Interview. 4 June 2020. Punk band patches Black shirts Spiky hair, Mohawks or dyed hair Leather (or pleather) jackets with band patches, safety pins, or painted-on details such as an anarchy symbol. Bondage pants, or pants with added embellishments such as zippers going up the back of the legs, chains, metal rings, or other add-ons. Bullet belts Fishnets Classic accessories can include arm warmers, studded belts, bullet belts, and wristbands with pyramid studs, stars or spikes."
    },
    {
      "title": "Customize some of the shirts or jackets you buy.",
      "content": "Customize some of the shirts or jackets you buy. This is similar to remaking, but with an eye for little touches that express your unique viewpoints. Maybe by cutting off the sleeves, sewing political patches on, or just cutting the neckline, or back differently – these are all things that the traditional person wouldn't dare try - especially not for aesthetic effect. Rip or cut out a section of clothing, and replace it with a row of safety pins holding the fabric together, or expose your layers. Stencil band names or symbols onto your clothes yourself. Sew some patches on your jacket. Distress your own denim. Use scissors or an x-acto knife to make cuts, or run sandpaper over the fabric to make it look worn out. Strategically drip bleach onto jeans or T-shirts to make interesting patterns, or make them look more worn-in."
    },
    {
      "title": "Find punk footwear.",
      "content": "Find punk footwear. Consider that you may be walking more given your punk lifestyle, since its pretty common that punks ditch private transport whenever possible. You need a sturdy, long lasting pair of shoes, or two, but you need to obtain them in an a-traditional way. Boots - for men and women. [11] X Expert Source Natalie Tincher Style Strategist & Wardrobe Specialist Expert Interview. 4 June 2020. Boots are often dark and are usually the best choice: they last a long time, you can find them on the cheap and the aesthetic works with the rest of your clothes. Stay away from shoe brands. Because commercialism and materialism are frowned upon by punks, a lot of them choose to buy boots from the army surplus store. Common punk shoes include black boots, Dr. Martens, Converse and some skate shoes like Draven and T.U.Ks. Note that because these are owned by corporations, some punks refuse to buy from them despite the aesthetic and you may run into people who disagree with your shoe choice. Thrift stores are a good place to buy cheap shoes and boots, and then you don't have to think about whether your money is going to a multinational corporation."
    },
    {
      "title": "Get the hairstyle.",
      "content": "Get the hairstyle. Spike it up, or even put it in a mohawk. [12] X Research source You can also dye it. Both males and females can sport a mohawk , and (though a primarily 'guy' hairstyle) some girls can pull off a Devilock nicely. Research the different kinds and think about what best expresses you. You might want a fanned Mohawk, Bihawk, Trihawk, \"bitch\" handles, or even liberty spikes. If you're worried about fitting into a conservative work situation, there's always the \"Fauxhawk\" (a wider strip of stand up hair that can be combed down to hide the shaved sides of your head). Be warned, though, his style is sometimes frowned upon by other punks since the look can adapt to the mainstream world so well. Although it is most common for punks to have hair no longer than chin length, long hair is acceptable if you want to be a punk. Remember: It's about breaking away from expectations and \"The Norm\" Having random things - such as beads, ribbons and ties - in your hair also makes you stand out if that's what you're going for. There has also been a variety of 80s haircuts and even dreadlocks that have made appearances in punk subculture. Dreadlocks are often frowned upon by punks if they are on a white person because this can be considered cultural appropriation. Racism is NOT Punk. Consider dying your hair. You could go jet black, platinum blonde, bright red, or some unnatural color like green or blue. [13] X Expert Source Natalie Tincher Style Strategist & Wardrobe Specialist Expert Interview. 4 June 2020. Whatever you choose, be prepared to stick with it for a while (or try a temporary dye first). If you don't want to hassle with complicated hairstyles, shave your head. This is a huge message to others: you don't need to do what others do! A shaved head has always been a classic punk look, and can be used for both men and women."
    },
    {
      "title": "Get some piercings and tattoos.",
      "content": "Get some piercings and tattoos. Body modification is another outlet that punks use to identify themselves. You will see many punks with their ears gauged with rings, often to quite large sizes. Septum and lip piercings can be used for any gender. With tattoos , you will see a wide variety of images. A lot of punks sport their favorite band logos, or have spiderwebs on their elbows (please be aware that in the UK at least, spiderwebs on the elbow signify that you have been in prison). Straightedge punks sometimes have X's on each fist. Old-school-style tattoos (Sailor Jerry, for example) are also very popular, especially for chest pieces and sleeves. Just remember whatever tattoo you choose, it will be there forever! Make sure that you choose something that reflects your personality, not just a current band that you like! [14] X Research source"
    },
    {
      "title": "Be patient with your style.",
      "content": "Be patient with your style. Many people will tell you to avoid going from preppy to punk in one step, or that it's best if you ease into being punk or you may appear like a poser. This is kind of true, but there is no way to go from not punk to punk overnight. You can't buy knowledge of punk music and you can't get an entire punk wardrobe without searching hard. Go to shows, introduce yourself to other punks, and gradually your style will develop from there."
    },
    {
      "title": "Go to punk shows to see bands live whenever you can.",
      "content": "Go to punk shows to see bands live whenever you can. It is a large part of being a punk. The energy is amazing. [15] X Research source You do not have to get in the mosh pit but it is fun to watch. Play safe and have fun. Get to know your local scene, you will probably see the same people and bands at shows over time."
    },
    {
      "title": "Familiarize yourself with the music, new and old.",
      "content": "Familiarize yourself with the music, new and old. There are many different types of Punk music, and it is important to remember that not every punk listens to every band here. A lot of Punks focus on one era of this music genre as the style of music has radically changed over time. This is a list of each era of Punk music, and some bands that influenced it."
    },
    {
      "title": "Try some of the genres of punk:",
      "content": "Try some of the genres of punk: [16] X Research source Punk rock - Overall, it is loud hard rock music with electric guitars playing power chords, energetic drum beats, heavy bass and began in the movement of rebellion, DIY and anti-establishment. Normal punk rock: Ramones, the Clash, Sex Pistols, The Rezillos, Green Day (mostly old), Alkaline Trio, Rancid and Against Me!. Anarcho-Punk - Punk rock that promotes Anarchism. Bands that are influenced are Rudimentary Peni, Anti-Flag, Against All Authority, Code 13, The Mob, Political Asylum and the Bus Station Loonies Modern punk - Against Me!, 4th Curtis, Gallows, Dropkick Murphys, Title Fight, etc. Celtic punk - Punk with some Irish instruments. E.g.: Dropkick Murphys, Flogging Molly, the Briggs Hardcore punk (or hardcore): Faster and more harder punk with vocals usually lacking melody. E.g.: Black Flag, Minor Threat, Negative Approach, Necros, The Meatmen, Bad Brains, Gallows, Poison Idea, Suicidal Tendencies (although they are mostly crossover thrash), AFI (early), Conflict, Rise Against, Agnostic Front, Kill Your Idols, etc. Punk Blues - A subgenre of Garage Rock and Punk Rock. Using acoustic guitars and percussions and harmonicas along with electric guitars, bass, and drums. Bands are Laughing Hyenas, Soledad Brothers, Knoxville Girls, Mule and Pussy Galore. Beatdown hardcore (or moshcore/beatdown/youth crew/tough guy hardcore) - Hardcore punk made heavier with some more intense, shouted vocals and low-chugging breakdowns. Often traditional metalcore bands (Hatebreed, Converge, I Am War, Earth Crisis, Unit 731, Bury Your Dead) get called hardcore. Metalcore is much heavier than tough guy hardcore and has elements of metal in it. Beatdown bands: Madball, Agnostic Front (later), Youth of Today, Death Before Dishonor, etc. Bands of the genre who have played also metalcore include Terror, Vision of Disorder and Stick to Your Guns. Oi! - Often misconceived as a racist genre, it isn't. Oi! is far from racism.That is Rock Against Communism. Oi! is a punk genre in the scene of punks and skinheads (not racist ones) that were simple, pub-friendly, treble guitar-based and had some blues-influence. E.g.: Cockney Rejects, Sham 69, Skrewdriver (first album; before racism), 4-Skins, the Business, The Exploited, UK Subs, etc. Crust punk - Fast, insane and metal-influenced punk rock, born in the 1980s in England. Bands are Amebix and Electro Hippies. Often bands wore all black, wore black leather and denim, slogans, patches and dreadlocks. Thrashcore - Fast, insane and blast beats-filled hardcore began in the early 1980s. Bands include DRI, Raw Power and Electro Hippies. D-beat - Heavy metal influenced hardcore with some metal traits but still pure hardcore. The genre was played by bands like Discharge. The drumming was also extremely aggressive. Queercore - Hardcore punk that supported gay people and gay rights - Bands include the Dicks and Big Boys. Street punk - Began in the UK82 era (1980s) of punk. It is a hardcore punk style that had catchy choruses, chants, lyrics usually on anti-establishment/rebellion/politics/etc, short guitar solos and usually had bands who wore black leather jackets and clothes, denim vests, lots of studs and patches, skinny or tight jeans, plaid pants, black combat boots and multi-colored mohawks. Bands include The Exploited, the Casualties, Clit 45, GBH, Cheap Sex, the Virus, Street Dogs, etc. Powerviolence - Most of it is punk. It often has influences from hardcore, crust, thrashcore and grindcore. It is usually extremely chaotic thrashcore with shouting and screaming and usually really short songs. Bands include Iron Lung and Spazz. Ska punk - Punk with some ska influences - E.g.: Rancid, Against All Authority, Operation Ivy and Banda Bassotti Skate punk - Fast punk rock with lots of guitar riffs, sometimes solos, singing and a raw tone. It is enjoyed by punks and skaters. Bands include MxPx, NoFX, Blink-182 (1992-1997; before Travis joined), Bone Brigade, Guttermouth, Pennywise and was pioneered by Suicidal Tendencies. Bands also often have comedy lyrics. Melodic hardcore - Like hardcore punk, but has melodic vocals and instrumentation. Bands include Rise Against,Bad Religion, and The Descendants. Horror punk - A goth-punk style with a dark sound and horror-themed lyrics. Bands sometimes are seen wearing black, big and shock-stylized makeup, all black, leather, studs, and the hair put into devilocks (not to be confused with emo hair). E.g.: Misfits, Balzac, AFI (1998-2000), Murderdolls, etc. Deathrock - Some type of goth-punk music which is extremely dark, atmospheric and has haunting or gloomy lyrics and themes. Bands include Christian Death and Alien Sex Fiend. Post-punk - Punk, but more complex, introverted and experimental. Bands include Joy Division, the Clash, The Cure (early) Siouxsie & the Banshees, L-Seven and Easy Action (one with John Brannon)."
    },
    {
      "title": "Acknowledge derivatives of punk or fusion genres.",
      "content": "Acknowledge derivatives of punk or fusion genres. They aren't punk, but stem from it. A lot of people call it punk while some argue that they aren't. Emo - A type of music derived from punk/alternative with melody and emotional lyrics. Originally it was short for emotive hardcore, and was influenced by hardcore punk and post-hardcore. It later got reinvented for a non-punk sound and for an alternative/indie/poppy sound. At first it was bands like Rites of Spring, The Hated and Embrace. Later, it became Jawbreaker, Sunny Day Real Estate, Jimmy Eat World, the Get Up Kids, American Football and Drive Like Jehu. Now, it is bands like Senses Fail, My Chemical Romance, From First to Last, Snowing, Red Jumpsuit Apparatus, Thursday, Paramore,Saves the Day,Modern Baseball,Dashboard Confessional and the Used. Screamo - A subgenre of emo, only harsher and has some screams in it. At first it was bands like Pg 99, I Hate Myself, Orchid (not the metal band) and Saetia. Now it is bands like I Would Set Myself on Fire for You, Underoath, Thursday and Alexisonfire. Pop punk - A loud pop rock style with power chords and punk influences. It has catchy choruses, pop melodies, happy melodies, usually teenage-tinged lyrics and was influenced by bands like Descendants, Green Day, Ramones, Screeching Weasel, The Offspring and Bad Religion. Bands include Sum 41, Blink-182, Good Charlotte,All,Neckdeep, Lit, Jimmy Eat World, Man Overboard, New Found Glory, Yellowcard, Motion City Soundtrack, Millencolin, and Fall Out Boy. Rapcore - An interesting genre that fuses hip hop and hardcore punk, often considered a subgenre of rap rock or nu metal. Bands mainly include Zebrahead, Rage Against the Machine, and Biohazard (though they are mostly a heavy metal band). Folk Punk - A sweet combination of folk and punk, often using more acoustic instruments ( violins, harmonicas, trumpets, upright bass). Not always as fast-paced as a lot of punk genres, and has more of a saddened tone to the lyrics. The Pogues popularized the genre in the late 80's but even still it is viewed as an underground sub-genre. Some great groups include, Andrew Jackson Jihad, Wingnut Dishwasher's Union, Johnny Hobo and The Freight Trains, Ramshackle Glory, Mantits, Neutral Milk Hotel and Charles Manson. Nu Metal - Heavy metal style with either screaming, singing or rapping vocals. Bands who are in involved are Slipknot (early), Korn, and Molotov (although they do rap metal)"
    },
    {
      "title": "Ready yourself for a punk hairstyle?",
      "content": "Ready yourself for a punk hairstyle?"
    },
    {
      "title": "Don a punk style as a girl.",
      "content": "Don a punk style as a girl."
    },
    {
      "title": "Take your punk look to Prom.",
      "content": "Take your punk look to Prom."
    },
    {
      "title": "Try steampunk style.",
      "content": "Try steampunk style."
    },
    {
      "title": "Start making your own punk music.",
      "content": "Start making your own punk music."
    },
    {
      "title": "Punk out your wardrobe.",
      "content": "Punk out your wardrobe."
    },
    {
      "title": "Learn bands geared towards punk.",
      "content": "Learn bands geared towards punk. Alkaline Trio Ramones Action Swingers Sex Pistols The Clash Blondie Minor Threat 4th Curtis Satan's Rats Rancid Green Day Against All Authority! Anti-Nowhere League Bad Brains Negative Approach Necros Laughing Hyenas The Rezillos Gorilla Biscuits Crass The Exploited AFI Oxymoron Fugazi GBH Guttermouth The Offspring Blink-182 (every thing before the self-titled album) Siouxsie and the Banshees 45 Grave Killing Joke Joy Division The Casualties Clit 45 Anti-Flag Black Flag Gallows Title Fight MxPx Bone Brigade The Runaways Dead Kennedys Street Dogs Bad Religion Rise Against NoFX Social Distortion Aiden Murderdolls The Creepshow Calabrese The Misfits Samhain Scream Gray Matter The Descendants Screeching Weasel Teenage Bottlerocket Dropkick Murphys Hot Water Music Discharge DRI Suicidal Tendencies Balzac The Vandals Skrewdriver Against Me! The 4-Skins The Business Cockney Rejects Conflict UK Subs Blitz Anti-Heroes Blood on Blood Agnostic Front Madball Comeback Kid Death Before Dishonor Terror Antidote Youth of Today The Queers The Dicks Jawbreaker Buzzcocks Millencolin Pennywise Cock Sparrer The Partisans Sham 69 Cro-mags Beastie Boys ( only a few EPs before rap). Chaos UK Flogging Molly Operation Ivy The Damned Blanks 77 Less Than Jake"
    }
  ]
}