{
  "url": "https://www.wikihow.com/Cook-Beef-Tongue",
  "title": "How to Cook Beef Tongue",
  "steps": [
    {
      "title": "Purchase the tongue.",
      "content": "Purchase the tongue. Larger tongues can take much longer to cook, so choose the smallest tongue you can find, ideally below 3 pounds / 1.4 kg. Tongue has a short shelf life, so purchase it very fresh or frozen from a reliable butcher. (If frozen, thaw in the refrigerator for maximum safety.) Some tongues include the glands, bones, and fat at the root of the tongue. This area is edible when cooked, but not everyone likes the soft, fatty texture. [2] X Research source You may cut it off at home (before or after cooking), or look for a pre-trimmed \"Swiss cut\" tongue. [3] X Research source Brined tongue packs extra flavor and can be prepared the same way as fresh tongue."
    },
    {
      "title": "Clean the tongue.",
      "content": "Clean the tongue. Place the tongue in a clean sink and scrub thoroughly under cold running water. Clean until the surface is free of dirt and blood. Many recipes recommend soaking the tongue in cold water for an hour or two, changing the water whenever it becomes murky. Store-bought tongue is usually clean enough to skip this step, but it can freshen up the tongue's flavor."
    },
    {
      "title": "Prepare the broth.",
      "content": "Prepare the broth. Fill a large pot with chick or beef stock, or moderately salted water. Add vegetables and herbs of your choice. An onion or two, a couple bay leaves, peppercorns, and a carrot form a good simple base. Feel free to add other ingredients, such as oregano, rosemary, garlic, or chiles. Bring to a boil over high heat. Use a pressure cooker or slow cooker to speed up the process. If you want to create a thicker sauce to serve with the tongue, add four cans of condensed French onion soup."
    },
    {
      "title": "Add the tongue.",
      "content": "Add the tongue. Add the tongue to the broth and cover the pot. Bring to a boil again, then reduce to a simmer. [4] X Expert Source Ed Kuoha Chef Expert Interview. 9 November 2021. Keep the tongue completely submerged. You may need to add more water or weigh it down with a steamer basket."
    },
    {
      "title": "Simmer until tender.",
      "content": "Simmer until tender. The tongue is ready when it turns white and a knife easily pierces the thickest part. This typically takes about 50–60 minutes per pound (0.45 kg) of meat. [5] X Research source Fast cooking or undercooking makes the tongue tough and unpleasant. If you've got the time, err on the side of caution and keep simmering for an extra hour or two. If using a pressure cooker, heat until it starts to steam. Reduce to medium heat and cook for 10–15 minutes per pound (0.45 kg). Let cool until steam releases on its own."
    },
    {
      "title": "Peel the tongue while warm.",
      "content": "Peel the tongue while warm. Transfer the tongue onto a plate with a pair of tongs. Wait until the tongue is just cool enough to touch, then cut through the outer white layer lengthwise with a sharp knife. Peel off this layer with your fingers, cutting when necessary. (This layer is technically edible, but has an unpleasant taste and texture.) The tongue becomes much harder to peel once cooled. If it's already cooled to room temperature, though, it can help to submerge it in ice water. Save the broth to make a soup or flavor sauces."
    },
    {
      "title": "Cut the meat into 1⁄4 inch (0.6 cm) slices.",
      "content": "Cut the meat into 1 ⁄ 4 inch (0.6 cm) slices. [6] X Expert Source Ed Kuoha Chef Expert Interview. 9 November 2021. Cut diagonal slices with a sharp knife to serve with salsa verde, on a sandwich with brown mustard and greens, or baked for another half hour with roast potatoes. There's plenty of meat there, so consider saving some larger pieces to grill or try with the other recipes below. If the meat is tough, it's undercooked. Return it to the broth and keep simmering. You can easily turn a portion of the sauce into gravy by adding flour."
    },
    {
      "title": "Store leftovers in the fridge.",
      "content": "Store leftovers in the fridge. Boiled tongue will keep for about five days in an airtight container in the fridge. [7] X Research source"
    },
    {
      "title": "Clean and simmer the tongue.",
      "content": "Clean and simmer the tongue. Tongue needs a long, slow cooking process to become tender. Refer to the simmered recipe above for instructions on cleaning, then simmer in hot, salted water for at least 1 hour per pound of meat (0.45 kg). For extra flavor, add onions, carrots, garlic, bay leaves, and/or your favorite chiles. Check on it every hour or so. You may need to add water to keep the tongue submerged."
    },
    {
      "title": "Make or purchase salsa verde",
      "content": "Make or purchase salsa verde . You'll have plenty of time to make your own salsa while the beef is cooking. Just combine tomatillos with serrano peppers, diced onion, garlic, cilantro, lime, salt. Blend until combined but slightly thick. (For amounts and extra details, see linked recipe.)"
    },
    {
      "title": "Peel and slice the tongue.",
      "content": "Peel and slice the tongue. Once a knife can pierce through the thickest part of the tongue, remove it from the water with kitchen tongs. Once cool enough to handle — but still quite warm — cut through the white outer layer and peel off with your fingers. Slice into rough ½ inch (1.25 cm) slices for your tacos."
    },
    {
      "title": "Fry or grill until crisp.",
      "content": "Fry or grill until crisp. Tongue is a fatty meat, and tastes delicious when it develops a crisp outer layer. Add a generous amount of oil or lard to a pan, about 3 tbsp (45 mL) for six slices, and heat until it shimmers. Add the tongue and fry until brown and crisp on all sides, flipping occasionally. If you're using a grill instead, brush the slices generously with olive oil and heat on a 425ºF (220ºC) grill for about 10–15 minutes, flipping once. For a healthier options, just brown lightly in a small amount of oil, then simmer in the salsa verde for a few minutes."
    },
    {
      "title": "Serve in corn tortillas.",
      "content": "Serve in corn tortillas. Set up platters of beef tongue, corn tortillas, and salsa verde for your guests to make their own tacos. You can also add all your favorite taco toppings, such as lime and cilantro."
    },
    {
      "title": "Clean and simmer the tongue.",
      "content": "Clean and simmer the tongue. Clean as described in the basic simmer recipe. Place the tongue in a pot of hot water along with 1 of the onions, 2 carrots, 1 stick celery, and 1 clove garlic. Simmer the tongue for about one hour per pound (0.45 kg), until a knife can pierce the thickest part. Coarsely chop all vegetables, remove leaves from the celery, and crush the garlic. This is similar to the basic simmer preparation described above, which is how most tongue recipes begin. Refer to that method for more detail if you have any questions."
    },
    {
      "title": "Peel the tongue.",
      "content": "Peel the tongue. Remove the tongue with a pair of tongs. Peel off the white layer as soon as the meat is cool enough to touch. While warm, this should come off easily after a few incisions with a sharp knife."
    },
    {
      "title": "Sauté raisins, almonds, and the remaining onion.",
      "content": "Sauté raisins, almonds, and the remaining onion. Melt 2 tbsp (30 mL) butter in a pan. Chop and add the other onion along with ⅓ cup (80mL) raisins and 3 tbsp (45mL) chopped almonds. Heat while stirring occasionally."
    },
    {
      "title": "Add remaining ingredients to the sauté pan.",
      "content": "Add remaining ingredients to the sauté pan. Once the almonds are golden brown, stir in ⅓ cup (80mL) white wine vinegar and 1 tbsp (15 mL) tomato paste. Add ⅓ cup (80mL) Madeira and ⅔ cup (160 mL) broth from the pot with the tongue. Simmer for three minutes to reduce slightly."
    },
    {
      "title": "Slice the tongue and serve with the sauce.",
      "content": "Slice the tongue and serve with the sauce. Slice the tongue into thin slices and pour the raisin sauce over it. Season with salt and pepper to taste."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}