{
  "url": "https://www.wikihow.com/Clean-a-Glass-Pipe",
  "title": "How to Properly Clean a Glass Weed Pipe",
  "steps": [
    {
      "title": "Tap any loose ash or residue into a trash can.",
      "content": "Tap any loose ash or residue into a trash can. If there are still any large chunks still inside your bowl, use a pipe cleaner or a toothpick to scrape them out. Try rinsing your pipe with plain warm water since it can remove some of the buildup trapped inside."
    },
    {
      "title": "Bring a small pot of water to a boil.",
      "content": "Bring a small pot of water to a boil . Use enough water to completely submerge your pipe. As soon as the water is boiling, turn the heat down to medium-low. [1] X Research source"
    },
    {
      "title": "Soak your pipe in the boiling water for 20–30 minutes.",
      "content": "Soak your pipe in the boiling water for 20–30 minutes. Warm up the pipe in your hands or under warm water to ensure the temperature change doesn’t break it. Set your pipe in the pot so it’s completely underwater. [2] X Research source Keep your eye on the water level to make sure it doesn’t evaporate since the heat could cause it to crack. If the water level starts to get too low, add more warm water to your pot to cover your pipe."
    },
    {
      "title": "Use a pipe cleaner or cotton swab to remove any remaining residue.",
      "content": "Use a pipe cleaner or cotton swab to remove any remaining residue. Take your pipe out of the pot with a pair of tongs and hold it with an oven mitt. Run a cotton swab or pipe cleaner through your glass pipe to wipe away any resin that’s still trapped inside of it. Then, let it dry completely before using it to smoke. [3] X Research source Avoid rinsing your pipe underneath cold water since the quick temperature change could cause the glass to shatter. If you still see residue inside of your pipe, try boiling it again for another 20–30 minutes."
    },
    {
      "title": "Remove any loose residue from your pipe.",
      "content": "Remove any loose residue from your pipe. Hold your pipe upside-down over a trash can and gently tap the bottom so any loose particles fall out. Then gently scrape any stuck-on residue with a pipe cleaner , cotton swab, toothpick, or needle. It’s okay if there’s still some residue left on your pipe. Getting rid of the larger loose chunks will just make the cleaning solution work more effectively."
    },
    {
      "title": "Submerge the pipe with your cleaner in a resealable bag.",
      "content": "Submerge the pipe with your cleaner in a resealable bag. Use rubbing alcohol for the fastest, most effective clean since it breaks apart resin the best. If you want to clean your pipe without alcohol, then use hydrogen peroxide or white distilled vinegar instead. [4] X Research source If you’re cleaning a bubbler pipe that has multiple pieces, take them apart and put them in separate bags to clean. Use 99% rubbing alcohol if you have some since it’s the strongest cleaner. It’s okay to use a lower concentration, but it may not strip all the resin and tar off of your glass pipe."
    },
    {
      "title": "Add 1 tsp (7 g) of salt to the bag.",
      "content": "Add 1 tsp (7 g) of salt to the bag. Use coarse sea salt or Epsom salt if you have it since it will scrub away the resin easier. Otherwise, table salt will work if you need to clean your pipe quickly. [5] X Research source Salt acts like an abrasive on your pipe to clean out buildup that’s hard to reach inside your pipe. If you’re using vinegar, try adding baking soda instead of salt. It will still act as an abrasive, but it will also make a bubbling reaction that can help loosen residue on your pipe."
    },
    {
      "title": "Shake the pipe in the bag for 2–3 minutes for a quick clean.",
      "content": "Shake the pipe in the bag for 2–3 minutes for a quick clean. Start by gently shaking the bag so some of the salt goes inside your pipe. Then, put your fingers over the openings and vigorously shake the bag for 2–3 minutes so the cleaning solution breaks apart the resin. Hold onto your pipe firmly so it doesn’t slip out of your hands and break."
    },
    {
      "title": "Soak the pipe in the solution overnight if it’s extremely dirty.",
      "content": "Soak the pipe in the solution overnight if it’s extremely dirty. If you still see buildup inside your pipe, leave it inside the bag and let it sit in the cleaning solution for about 12 hours. The next day, shake the bag to get rid of any buildup that’s still stuck on your glass pipe before dumping the cleaning solution out down the drain. [6] X Research source"
    },
    {
      "title": "Rinse the pipe out with hot water.",
      "content": "Rinse the pipe out with hot water. Hold your pipe underneath hot water from your faucet to clean out any resin and leftover solution. Keep running water through your pipe until it comes out clear. [7] X Research source"
    },
    {
      "title": "Clean out any remaining spots with a pipe cleaner or cotton swabs.",
      "content": "Clean out any remaining spots with a pipe cleaner or cotton swabs. Dip the end of your pipe cleaner or cotton swab in your cleaner and gently rub it into any leftover stains. Give your pipe one final rinse when you’re finished and let it dry completely before smoking with it again."
    },
    {
      "title": "Try denture cleaning tablets for a quick clean.",
      "content": "Try denture cleaning tablets for a quick clean. Put your glass pipe inside a plastic container and fill it up with enough hot water to submerge the bowl. Then, drop 2-3 tablets into the water and let your pipe soak for about 30 minutes. Scrub off any leftover residue with a pipe cleaner before rinsing the pipe with warm water. [8] X Research source Denture tablets may also help get rid of surface stains on the glass."
    },
    {
      "title": "Use a dedicated pipe cleaning solution made for glass pipes.",
      "content": "Use a dedicated pipe cleaning solution made for glass pipes. Read the instructions on the cleaning solution you get since they may vary between brands. Some will have you fill your pipe with the cleaner and shake it for 1–2 minutes to remove the residue. Others may have you soak your pipe in the solution for a few hours before rinsing it out. [9] X Research source Avoid using other household cleaners on your pipe since they could leave the taste of chemicals inside your pipe when you smoke from it."
    },
    {
      "title": "Freeze the pipe to remove hard buildups.",
      "content": "Freeze the pipe to remove hard buildups. Put your pipe in the freezer for 30 minutes to an hour so the residue hardens up. Then, quickly scrape at the resin with a toothpick or needle to break it apart. Try to remove as much of the resin as you can within a few minutes before it starts feeling gummy again. If the resin becomes sticky or hard to work with again, put it back in your freezer for another 30 minutes. Freezing your pipe might not be enough to completely clean it, but it will help remove large pieces of residue to make other cleaning methods more effective."
    }
  ]
}