{
  "url": "https://www.wikihow.com/Adjust-Hop-Up-on-an-Airsoft-Rifle",
  "title": "How to Adjust Hop Up on an Airsoft Rifle",
  "steps": [
    {
      "title": "Shoot 10-20 BBs at a target 50 ft (15 m) away and watch their trajectory.",
      "content": "Shoot 10-20 BBs at a target 50 ft (15 m) away and watch their trajectory. Go to a safe, open area where you can shoot your airsoft rifle while you adjust the hop up. Pick a target and fire your BBs at it and watch whether they drop down right away or curve erratically upwards. For example, you could do this at an airsoft field before you play a match or in an unoccupied, rural field. Firing at least 10 rounds will warm up your airsoft rifle so you can see the true trajectory of the BBs."
    },
    {
      "title": "Flip open the adjustment wheel cover on the side of your airsoft rifle.",
      "content": "Flip open the adjustment wheel cover on the side of your airsoft rifle. The adjustment wheel cover is a rectangular cover that is usually on the right-hand side of your airsoft rifle directly above the BB magazine. Flip this cover down and hold it open to access the adjustment wheel. [1] X Research source An adjustment wheel is one of the most common adjustment mechanisms on airsoft rifles. Many M-4 style airsoft rifles have this mechanism, for example."
    },
    {
      "title": "Turn the adjustment wheel clockwise if your BBs are dropping too soon.",
      "content": "Turn the adjustment wheel clockwise if your BBs are dropping too soon. Turning the wheel clockwise will increase the hop up and make your airsoft rifle shoot BBs further. Grab the adjustment wheel by one of the notches and turn it to the right 1/4, 1/2, or 1 full turn, depending on how much hop you want to add. [2] X Research source For example, if your BBs are curving down right away without travelling straight at all, you might try turning the wheel 1 full turn. If you turn the wheel all the way to the right, you will set the hop all the way up and your BBs will curve up and travel erratically. Make small adjustments to the right to increase the hop a little at a time and find the ideal hop setting. There might be arrows and labels that say “up” and “down” next to the wheel to help you remember which way to turn the wheel."
    },
    {
      "title": "Rotate the adjustment wheel clockwise if your BBs are curving up.",
      "content": "Rotate the adjustment wheel clockwise if your BBs are curving up. This will decrease the hop and make your BBs travel more straight. Grab the adjustment wheel and turn it to the left 1/4, 1/2, or 1 complete turn, depending on how much you want to decrease the hop. [3] X Research source For example, if your BBs are travelling straight right after you shoot them, but then curving up before they reach your target, you might try turning the wheel counterclockwise by about 1/4-1/2 a turn. If you turn the wheel all the way to the left, there will be no hop on your airsoft rifle and the BBs will just drop out of the barrel without travelling straight at all."
    },
    {
      "title": "Test your airsoft rifle and make adjustments until the BBs go straight and far.",
      "content": "Test your airsoft rifle and make adjustments until the BBs go straight and far. Shoot 2-3 rounds out of your airsoft rifle after each adjustment you make. Keep turning the wheel about 1/4 turn at a time either clockwise to add hop or counterclockwise to remove hop until your BBs shoot straight and far. The ideal hop for your airsoft rifle will cause your BBs to go slightly up during their trajectory, but then drop down again towards the end before they hit your target, resulting in a straight, accurate shot. Keep in mind that wind and BB weight can affect the trajectory of your BBs as well."
    },
    {
      "title": "Test-fire 10-20 BBs at a target 50 ft (15 m) away and watch their flight path.",
      "content": "Test-fire 10-20 BBs at a target 50 ft (15 m) away and watch their flight path. Choose a safe, open area to test-fire your airsoft rifle and make adjustments to the hop up. Aim at a target, shoot the BBs at it, and take note of whether they curve erratically upwards or curve down right away. For instance, an empty airsoft field or somewhere in the woods where there are no trails or people around could be a good place to do this. Make sure to fire at least 10 rounds, so your airsoft rifle has time to warm up and you can see the actual flight path of your BBs."
    },
    {
      "title": "Slide open the adjustment slider bar cover on the side of your airsoft rifle.",
      "content": "Slide open the adjustment slider bar cover on the side of your airsoft rifle. The adjustment slider bar cover is usually on the right-hand side of your airsoft rifle directly above the BB magazine and looks like what cocks back to eject bullets on a real rifle. Slide this cover back to open it up and access the adjustment slider bar. [4] X Research source Slider-type hop adjustment bars are common on AK-47 type airsoft rifles."
    },
    {
      "title": "Slide the bar towards the butt of the rifle if your BBs are dropping too soon.",
      "content": "Slide the bar towards the butt of the rifle if your BBs are dropping too soon. Sliding the bar to the left will add hop up and make your BBs shoot further and straighter. Grab the slider bar and move it towards the butt of your airsoft rifle about 1/4 of the total length of the slot in the bar. [5] X Research source If you slide the bar all the way to the left, this sets the hop up to the maximum level. There might be notches and numbers on the slider bar that you can use to keep track of how far you’re adjusting it."
    },
    {
      "title": "Move the bar towards the barrel if your BBs are curving up.",
      "content": "Move the bar towards the barrel if your BBs are curving up. This will lower the amount of hop up to make your BBs travel more straight and not curve up drastically. Grab the adjustment slider bar and push it to the right towards the barrel about 1/4 of the length of the slot in the bar. [6] X Research source If you slide the bar all the way to the right, this takes away all the hop up from your airsoft rifle and your BBs will have no range when you shoot them."
    },
    {
      "title": "Shoot the airsoft rifle and adjust the bar until your BBs travel straight and far.",
      "content": "Shoot the airsoft rifle and adjust the bar until your BBs travel straight and far. Fire 2-3 rounds out of your airsoft rifle after each minor adjustment you make to the slider bar. Continue to slide the bar about 1/4 of the length of the slot in the bar, or less, to the left to increase hop or to the right to decrease hop. [7] X Research source Ideally, your BBs should travel straight right out of the barrel, then lift up slightly in the middle of their trajectory, then finally drop back down at the end to hit the target that you’re aiming straight at. Remember that the weight of your BBs and the amount of wind will affect how your BBs travel."
    }
  ]
}