{
  "url": "https://www.wikihow.com/Clean-Musty-Smells-from-a-Suitcase",
  "title": "How to Remove Musty Odors from Luggage",
  "steps": [
    {
      "title": "Air out your suitcase outside on a sunny, breezy day.",
      "content": "Air out your suitcase outside on a sunny, breezy day. To eliminate old, musty odors inside your suitcase, simply open it up and let it sit outside for several hours or overnight. Just choose a spot that gets lots of airflow and sunshine to let the odors waft out and leave your suitcase smelling fresh. [1] X Research source Sunlight also helps kill any bacteria and mold that might be causing your suitcase to smell. [2] X Research source"
    },
    {
      "title": "Sprinkle baking soda inside your suitcase and leave it overnight.",
      "content": "Sprinkle baking soda inside your suitcase and leave it overnight. Baking soda is a natural deodorizer that absorbs musty, mildew odors emanating from your luggage. Just sprinkle a thin layer of baking soda inside your bag and zip it closed. Let the baking soda sit overnight and then dump it out in your trashcan or vacuum it up. [3] X Research source If your suitcase still smells musty, set a bowl of baking soda in your suitcase and leave it inside for about 1 week. [4] X Research source"
    },
    {
      "title": "Place activated charcoal inside your bag for 1 to 2 days.",
      "content": "Place activated charcoal inside your bag for 1 to 2 days. Charcoal isn’t just for grilling—it also acts as an odor absorber to get unpleasant smells out of your luggage. Simply place several pieces of activated charcoal inside a bowl or open container and set it inside your bag. Zip it closed and then leave the charcoal to deodorize your luggage for 1 to 2 days."
    },
    {
      "title": "Pour kitty litter inside your bag and let it sit for 1 week.",
      "content": "Pour kitty litter inside your bag and let it sit for 1 week. Cat litter also contains odor-absorbing properties that remove smells from your suitcase. Simply fill your suitcase with litter, close it up, and let the litter be for about 1 week. Then, dump the used litter in your trashcan and vacuum up any debris left behind. [5] X Research source For a mess-free option, pour the kitty litter into a pillowcase and then set it inside your luggage."
    },
    {
      "title": "Spray the inside of your suitcase with white vinegar and water.",
      "content": "Spray the inside of your suitcase with white vinegar and water. Vinegar is a great household cleaner that also neutralizes odors. Simply combine 1 part distilled white vinegar with 3 parts water and mix the solution in a spray bottle. Then, spray it all over the inside of your suitcase. Just keep the bag open in a well-ventilated area to let the vinegar remove the musty smell as it dries. [6] X Research source If you don’t like the smell of vinegar, use lemon juice instead. For a slight variation, put a piece of white bread in a shallow bowl and pour white vinegar over it. Put the bowl in your suitcase, shut it, and let it sit for 24 hours to absorb the smell."
    },
    {
      "title": "Mist the inside of your bag with a commercial deodorizing spray.",
      "content": "Mist the inside of your bag with a commercial deodorizing spray . If you don’t have time to mix up a DIY spray to remove the musty smell from your luggage, just reach for a store-bought spray. Simply spritz the entire inside of your suitcase and then leave the bag open to let the spray dry."
    },
    {
      "title": "Fill your luggage with newspaper and leave it for 1 to 2 days.",
      "content": "Fill your luggage with newspaper and leave it for 1 to 2 days. Newspaper is a naturally absorbent material that soaks up old, musty odors in your bag. Just wad up enough newspaper to fill the inside of your suitcase. Then, close the lid and let the newspaper sit for about 1 to 2 days. [7] X Research source If your suitcase still smells musty, leave the newspaper in your bag for 1 to 2 weeks. Just replace the old newspaper with fresh sheets every few days. Or, add activated charcoal on top of the newspaper to accelerate the deodorization process."
    },
    {
      "title": "Place unused tea bags in your suitcase overnight.",
      "content": "Place unused tea bags in your suitcase overnight. The leaves of your favorite black, green, or herbal tea also work to absorb and neutralize musty odors permeating your suitcase. Just place a handful of unused teabags in your luggage, zip up your bag, and let the tea sit overnight or for 1 full day. [8] X Research source"
    },
    {
      "title": "Leave dryer sheets inside your luggage for 1 to 2 days.",
      "content": "Leave dryer sheets inside your luggage for 1 to 2 days. Dryer sheets not only freshen up your clothes but work to soak up unpleasant odors stinking up your luggage. Just grab a few dryer sheets from your laundry room, scrunch them up into balls, and set them inside your bag. Then, close the cover and leave the sheets inside for 1 to 2 days. [9] X Research source If your suitcase has separate compartments or pockets, place a dryer sheet in each one."
    },
    {
      "title": "Set a cotton ball soaked with essential oil in your bag for 1 to 2 days.",
      "content": "Set a cotton ball soaked with essential oil in your bag for 1 to 2 days. Your favorite essential oil scents can also help remove unwelcome odors from your luggage. Simply take a cotton ball and pour on several drops of the essential oil of your choice, like lavender, lemon, or eucalyptus. Then, drop in the cotton ball, zip up your bag, and leave it be for 1 to 2 days. [10] X Research source If your bag still smells after 2 days, make a fresh cotton ball and leave it in your bag for at least 1 week."
    },
    {
      "title": "Vacuum the interior of your suitcase.",
      "content": "Vacuum the interior of your suitcase. Get out your vacuum and put on a brush or crevice attachment. Then, open your suitcase and vacuum the inside, including any pockets or sleeves, to remove dust, crumbs, and other debris. If there are any spots your vacuum can’t reach, use your fingers to pick up the debris. [11] X Research source"
    },
    {
      "title": "Wipe the inside of your suitcase with liquid dish soap and water.",
      "content": "Wipe the inside of your suitcase with liquid dish soap and water. Mix ½ teaspoon (2.5 mL) of liquid dish soap in 1 cup (237 mL) of warm water. Then, dunk a clean cloth in the solution and wring it out until it’s slightly damp. Use the damp cloth to clean the inside of your suitcase and scrub off any dirt or stains. [12] X Research source If you have spots of mold or mildew in your bag , mix 1 cup (237 mL) of water with 1 cup (237 mL) of distilled white vinegar in a spray bottle. Spray the inside of your bag and let the solution sit for 5 minutes. Then, dip a toothbrush or soft-bristled brush in the mixture and scrub the inside of the bag. [13] X Research source Alternatively, use rubbing alcohol in place of white vinegar."
    },
    {
      "title": "Scrub the outside of your luggage with soapy water and an eraser.",
      "content": "Scrub the outside of your luggage with soapy water and an eraser. To clean off the outside of a fabric or hard-shell suitcase, dip a clean cloth in your mixture of liquid dish soap and warm water. Squeeze out the excess moisture and wipe down the exterior, handles, and wheels. Then, use a regular eraser to remove any sticky spots or scratches. [14] X Research source If a regular eraser doesn’t easily remove the stains and scratches, use a Magic Eraser ."
    },
    {
      "title": "Dry your suitcase with a towel and let it air dry for 1 to 2 days.",
      "content": "Dry your suitcase with a towel and let it air dry for 1 to 2 days. Use a clean towel to dry the interior and exterior of your suitcase, carefully blotting up any especially wet spots. Then, leave your luggage open to let it air dry for 1 to 2 days. [15] X Research source"
    },
    {
      "title": "Clean out your suitcase",
      "content": "Clean out your suitcase after you use it. Plane, train, and car smells, as well as other people’s luggage, can leave your suitcase smelling musty. So, whenever you get back from a trip, take a few minutes to vacuum out your luggage and wipe it down with a mixture of warm water and liquid dish soap. Then, let it air dry outside or in a well-ventilated spot indoors. [16] X Research source Dirty clothes can also be a source of musty suitcase smells. When you’re traveling, place used garments in a separate packing cube or plastic bag."
    },
    {
      "title": "Store your luggage in a cool, dry, well-ventilated place.",
      "content": "Store your luggage in a cool, dry, well-ventilated place. Your suitcase might smell musty due to mold, mildew, and bacteria. These microorganisms love dark, warm, and humid spaces that lack airflow, which makes your luggage the perfect spot. So, keep them away by storing your luggage in a well-ventilated area that’s temperature controlled and away from water, like your bedroom or closet. Or, keep your suitcase in your garage . [17] X Research source If you have a cloth or canvas suitcase, cover it with a towel to help prevent mildew from growing. Every few months, take your suitcase out of storage, open it up, and air it out to prevent mold and mildew from developing."
    },
    {
      "title": "Leave dryer sheets or soap in your luggage when you store it.",
      "content": "Leave dryer sheets or soap in your luggage when you store it. To keep your luggage smelling fresh when you're not using it, simply place a dryer sheet or an opened bar of soap inside. Then, when you air out your suitcase every few months, change the dryer sheet or bar of soap. [18] X Research source Alternatively, place an unwrapped and unlit scented candle or a small jar of coffee beans in your suitcase to keep it smelling fresh. Or, spray the inside of your suitcase down with 1 part vinegar and 3 parts water when you air it out. As another alternative, make your own sachets with lavender or other herbs and flowers and leave them in your bag."
    },
    {
      "title": "Place cedar shavings in your luggage to keep away moisture and bugs.",
      "content": "Place cedar shavings in your luggage to keep away moisture and bugs. The oils in cedar don’t just leave your suitcase smelling fresh, but they also limit moisture buildup, kill fungus, and keep away moths and other insects. When you store away your suitcase, just place several cedar shavings or cedar blocks inside. [19] X Research source Alternatively, use pine shavings in place of cedar."
    }
  ]
}