{
  "url": "https://www.wikihow.com/Clean-a-Fog-Machine",
  "title": "How to Clean a Fog Machine",
  "steps": [
    {
      "title": "Take the fog machine outside.",
      "content": "Take the fog machine outside. The vinegar mixture can be quite stinky and gives off an overwhelming odor, especially when used indoors. To avoid an uncomfortable situation, take your fog machine to an outdoor space when you want to clean it. This will be much better for you and anyone else who might be around. [1] X Research source Try cleaning the fog machine in your backyard next to an outdoor electrical outlet. If you can’t find a space like this that works, consider cleaning it in your garage with the garage door open."
    },
    {
      "title": "Empty the tank.",
      "content": "Empty the tank. Remove the tank from the machine. Unscrew the cap and dump the remaining fog liquid out in the sink. Make sure to empty it completely. Don’t worry about rinsing the tank out after you dump it. The vinegar solution will work to clean the tank for you."
    },
    {
      "title": "Make a mixture of water and vinegar.",
      "content": "Make a mixture of water and vinegar. Using distilled water and distilled white vinegar, make a cleaning solution that is equal parts of each ingredient – half vinegar and half distilled water. Be sure to use distilled water only, not tap water. Tap water contains minerals that can leave deposits inside your machine that will build up over time and cause problems later."
    },
    {
      "title": "Pour the vinegar mixture into the fog machine.",
      "content": "Pour the vinegar mixture into the fog machine. Put the tank back in the fog machine and pour the mixture of vinegar and distilled water into the opening. It should go into the same tank that is normally filled with fogging fluid. [2] X Research source You’ll need to use enough of the mixture to thoroughly clean the machine. The tank should be mostly full. For most fog machines, this is probably about half a liter of the cleaning solution. Turn the machine on and let it run with the vinegar water mixture inside it."
    },
    {
      "title": "Rinse with distilled water.",
      "content": "Rinse with distilled water. Once you’ve run the vinegar and water mixture, you should pour some distilled water (not mixed with anything) into the fog machine and run it once like this. The water will help flush out any remaining vinegar smell inside the machine and will help clean it out a bit more. [3] X Research source Let the machine air dry once you have finished this procedure."
    },
    {
      "title": "Scrape out the nozzle.",
      "content": "Scrape out the nozzle. Unplug your machine and allow it to cool down completely. Check the output nozzle (where the fog steam comes out of) for any deposits or debris. If you see something, use your fingernail or another firm object to scrape the opening of the nozzle. [4] X Research source Additionally, you can try using a pin (or small needle) to clean out any remaining dirt. Move it in and out of the nozzle hold a few times to remove excess build up."
    },
    {
      "title": "Wipe down the exterior.",
      "content": "Wipe down the exterior. Use a damp cloth to wipe down the exterior of the fog machine. Be sure to get in all the nooks and crannies of the machine to clean off any dust or residue that may have built up over time. Performing this kind of regular maintenance should prevent the machine from needing aggressive cleaning as often. It will also help prolong the life of your fog machine."
    },
    {
      "title": "Test the fogger fluid.",
      "content": "Test the fogger fluid. Once you have finished cleaning the fog machine, you can put some more fogger fluid in it to make sure it is working properly again. Let the machine run and produce fog for at least several minutes before you decide that it’s working the way you want it to. [5] X Research source Never store (or stop using) a freshly cleaned fog machine without first running another batch of fogging liquid to make sure it works."
    },
    {
      "title": "Purchase fog machine cleaner.",
      "content": "Purchase fog machine cleaner. There are quite a few products available online for purchase that are intended for use in cleaning fog machines. Simply purchase the cleaning fluid and run it through your fog machine. Make sure to do the procedure outdoors so you don’t stink up the place with a chemical smell. [6] X Research source Remember to always clean your fog machine before you store it."
    },
    {
      "title": "Follow the manufacturer’s cleaning instructions.",
      "content": "Follow the manufacturer’s cleaning instructions. Your fog machine should come with an owner’s manual that gives specific cleaning instructions. If you do some sort of cleaning routine that isn’t recommended by the manufacturer, it could void your product warranty. If the cleaning techniques don’t work, you may need to contact your manufacturer for a replacement, as long as your machine is still under warranty. So try not to do anything that may void the warranty."
    },
    {
      "title": "Avoid overdoing it.",
      "content": "Avoid overdoing it. Most fog machines don’t need to be cleaned regularly. In fact, fog machines typically don’t need to be cleaned at all unless you have been putting low quality fog liquid products in your fog machine – these lower quality products can cause the fog machine’s heater to clog. [7] X Research source You definitely don’t need to clean your fog machine every year unless it starts exhibiting some symptoms indicating it needs a good cleaning. Cleaning a fog machine too often can cause it to stop working altogether."
    },
    {
      "title": "Watch for decreased output.",
      "content": "Watch for decreased output. The main sign that your fog machine needs to be cleaned is when you start noticing a significant decrease in output of the fog effect. If your machine isn’t producing fog as much as it used to, then it’s probably time for a cleaning. [8] X Research source Since you don’t want to clean your fog machine too frequently, you should wait until you see a significant decrease in fog output – not just a small change."
    },
    {
      "title": "Clean before storing.",
      "content": "Clean before storing. If you use your fogger once a year (like at Halloween) and then put it away in storage for the rest of the year, you should clean the fog machine before you pack it up for storage. Don’t wait until you bring it out the next year because a clogged fog machine that sits unused for months on end will most likely be permanently unusable when you try to use it again. [9] X Research source Before you store your fog machine for an extended period of time, check its output to ensure you don’t need to clean it before storing it."
    }
  ]
}