{
  "url": "https://www.wikihow.com/Annotate-a-Book",
  "title": "How to Annotate a Book or Textbook",
  "steps": [
    {
      "title": "Underline key phrases.",
      "content": "Underline key phrases. Start by underlining any phrases that feel important to you. Often, key phrases appear at the end of a sentence or after a colon or a comma. Look for phrases that appear several times in the text, as they are likely important. [1] X Research source Try only to underline phrases that seem very important. Underlining or highlighting too much could make it harder to read the text. You can also underline phrases you like or find interesting. If a sentence strikes you or stands out to you, underline it so you can return to it later."
    },
    {
      "title": "Circle or box keywords.",
      "content": "Circle or box keywords. Look for words that seem important to the author. You may circle words that connect back to the main idea in a section, or you can draw a box around words that are repeated several times in the book. [2] X Research source For example, if you notice the word “power” appearing several times in the text, circle or box it. The author may tell you to keep certain words in mind as you read the text. Make sure you circle or box these words as part of your annotations."
    },
    {
      "title": "Bracket key sections.",
      "content": "Bracket key sections. If you feel several lines in a section are important, use brackets to indicate this in the text. Try to choose only several lines or short sections of the text to bracket. Bracketing long sections can make it hard for you to return to the annotation later and get a clear sense of why you noted the section. [3] X Research source For example, if a section focuses on a particular case study in the text you find interesting or important, use a bracket in the margins to annotate it."
    },
    {
      "title": "Write reflections in the book’s margins.",
      "content": "Write reflections in the book’s margins. Have a conversation with the text by writing down your thoughts and reflections in the margins as you read. You can write one or two words or jot down short phrases or sentences. [4] X Research source As you read, ask yourself questions like, \"What is the author trying to tell me as the reader?\" \"Why is this passage in the text?\" \"How do I respond emotionally to the text?\""
    },
    {
      "title": "Make a list of questions you have about the book.",
      "content": "Make a list of questions you have about the book. As you read, write down any questions you have about the text. Jot them down in the margins, at the bottom of the page, or on a sticky note. Ask questions about words or phrases that confuse you. Pose questions about ideas you find hard to follow or disagree with. [5] X Research source For example, you may ask questions like, \"Why did the author include this example in the book?\" \"What is the goal of the author in this passage?\" \"What is the author trying to say here?\""
    },
    {
      "title": "Make a list of words you don’t recognize.",
      "content": "Make a list of words you don’t recognize. Keep a running list of words you don’t know or are unfamiliar with on a separate paper. Then, look up the terms so you know what they mean. This can be super helpful when annotating a textbook or more formal text. [6] X Research source"
    },
    {
      "title": "Link ideas together with arrows.",
      "content": "Link ideas together with arrows. Use arrows or lines to connect common ideas and themes. Try circling keywords on the same page and then linking them with arrows, or highlight a passage and draw an arrow to another passage further down the page. [7] X Research source Linking ideas together can help you think critically about and analyze the text ."
    },
    {
      "title": "Summarize each section at the bottom of the page.",
      "content": "Summarize each section at the bottom of the page. Once you finish reading a section of the text (a chapter or section), condense the main points and ideas with a few keywords. Write these keywords at the bottom of the page. This is a great study tactic, as looking at the keywords can also help remind you what a specific passage is about, making it easier to find later. [8] X Research source For example, you may summarize a passage in the book with keywords like “power,” “female sexuality,” or “Freud case study.” You can also keep your summaries in a separate notebook or piece of paper; just be sure to identify which page or chapter they belong to."
    },
    {
      "title": "Create a color-coded key inside your book.",
      "content": "Create a color-coded key inside your book. Keep track of your annotations with a handy key or legend that states what each colored tab or mark means. Categorizing your notes will make it easier to find them in the future (not to mention it’s also aesthetic). This can be extremely helpful when annotating a textbook or writing a paper. [9] X Research source Use categories in your key like “Romance,” “Relatable,” “Metaphor,” “Quotes I love,” and “Plot twists.” Try using specific colors for specific characters. This is a great way to track their story and key storylines."
    },
    {
      "title": "Remove distractions while annotating.",
      "content": "Remove distractions while annotating. Go to a quiet, isolated spot to annotate so you can focus better. The library, a study hall, or a quiet bedroom are perfect locations. Turn off all your devices or place them in “Do Not Disturb” mode, and get to work. Studies have shown that quiet workspaces can benefit focus and ease stress. [10] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "Read slowly and carefully.",
      "content": "Read slowly and carefully. Take your time with the material, and pay attention to each word on the page. Even if you have a deadline, pretend you have all the time in the world! Moving slowly through the text ensures you don’t miss something crucial. [11] X Research source"
    },
    {
      "title": "Try not to think too hard about what you’re annotating.",
      "content": "Try not to think too hard about what you’re annotating. If you’re annotating a book for fun, do your best not to think too much about it. Circle, underline, and highlight what speaks to you in the moment. Write down your immediate thoughts and reactions. Even if they don’t make sense in the future, that’s okay! Getting your feelings on the page is what’s important. [12] X Research source Who says you have to react with words? Use smiley or frowny faces to describe how you feel about a moment in the margins."
    },
    {
      "title": "Annotate with a highlighter and a pen or pencil.",
      "content": "Annotate with a highlighter and a pen or pencil. One of the easiest ways to annotate a book is to use a highlighter and pen or pencil directly on the text. Choose a highlighter in a shade that is easy for you to read on the page, such as yellow, light blue, or orange. Go for a pen in a dark color that stands out on the page or one that matches a specific highlighter color. [13] X Research source Not sure what writing utensils or colors to pick out? Invest in an annotating kit that comes with everything you’ll need in aesthetically-pleasing themes."
    },
    {
      "title": "Use sticky notes and tabs.",
      "content": "Use sticky notes and tabs. Sticky notes and sticky tabs are ideal for tabbing pages or writing down notes. These stationery products come in all types of colors and sizes, so pick what works best for you! [14] X Research source If you can’t write in your book, opt for clear-backed sticky notes . These are stuck right on the page, allowing you to highlight and make marks without actually writing on the paper itself."
    },
    {
      "title": "Try an electronic annotation program.",
      "content": "Try an electronic annotation program. If you’re annotating a book on an eReader, there are several different annotation programs you can download. Programs like Skim and Marvin make it easy for you to annotate a text on an eReader, or you can simply search “annotation” in your device’s app store. If you primarily read on an eReader, consider investing in an eReader that’s annotation friendly, like the Kindle Scribe ."
    }
  ]
}