{
  "url": "https://www.wikihow.com/Change-the-Size-of-the-Crosshairs-in-Counter-Strike",
  "title": "How to Change the Size of the Crosshairs in Counter Strike",
  "steps": [
    {
      "title": "Go to the main menu, and click \"Options.",
      "content": "Go to the main menu, and click \"Options. \" The main menu is the first screen you see when opening the game."
    },
    {
      "title": "Click the tab that says \"Multiplayer.",
      "content": "Click the tab that says \"Multiplayer. \" It should be the button on the far right."
    },
    {
      "title": "Edit your crosshair by adjusting the sliders.",
      "content": "Edit your crosshair by adjusting the sliders. There are three sliders in the \"Crosshair Appearance\" section, named 'Size', 'Thickness', and one that changes Opacity (which just has a check box for 'Blend' next to it.), each of these sliders change the crosshair's looks in game. Adjust the sliders until the crosshair in the box to the left of the sliders matches what you want."
    },
    {
      "title": "Make sure the console is enabled.",
      "content": "Make sure the console is enabled. On the main or pause screen, click \"Options\" and select \"Game Settings\" from the drop-down menu. Click the arrow next to \"Enable Developer Console (~)\" so that it says \"Yes.\""
    },
    {
      "title": "Press the tilda button (~) to open the console.",
      "content": "Press the tilda button (~) to open the console. Do this in-game, so you can see what your crosshairs look like against the background. The console will appear as a gray or black box on your screen."
    },
    {
      "title": "Type \"cl_crosshairsize #\" with the desired number in place of the # sign.",
      "content": "Type \"cl_crosshairsize #\" with the desired number in place of the # sign. The larger the number, the larger your crosshairs. Play around with different sizes until you find one that works best for you. Leave the console box by pressing the escape (\"ESC\") key. The console box allows you to make tons of modifications to your crosshairs. You can change the dot (cl_crosshairdot #), thickness (cl_crosshairthickness #), gap (cl_crosshairgap #), outline (cl_crosshair_drawoutline #), and more."
    },
    {
      "title": "Download a crosshair generator online.",
      "content": "Download a crosshair generator online. One of the most popular is available on the steam workshop. It is a map by CrashZ called \"Crosshair Generator.\" You can also search for \"CSGO Crosshair Generator\" using your favorite search engine."
    },
    {
      "title": "Customize your crosshairs from within the map.",
      "content": "Customize your crosshairs from within the map. Opening the map will allow you to change the size of your crosshairs and will give you tons of different options to customize with color, gap, dot, and so on. You can also check your crosshairs against a variety of backgrounds to make sure it is visible. The CrashZ map allows you to select crosshairs used by professional Counter Strike players, so you can make like the pros."
    },
    {
      "title": "Generate a custom crosshair and paste the code into the developer console.",
      "content": "Generate a custom crosshair and paste the code into the developer console. Other crosshair generators will allow you to tinker with your settings and, once it's perfect, gives you a code with all your customizations. Copy this code, then open the developer console in Counter Strike and paste the code into the box. Your crosshairs will change to match the version you made in the generator."
    }
  ]
}