{
  "url": "https://www.wikihow.com/Air-Layer-a-Tree",
  "title": "Air Layering Your Tree: A Step-by-Step Guide",
  "steps": [
    {
      "title": "Start air layering in the spring.",
      "content": "Start air layering in the spring. Air layering works best when the plant has the whole summer growing season to form roots. Wait until mid-spring when blooms just start to form on the trees. Pick a cloudy day to air layer the tree so the sun doesn’t put stress on it. [1] X Research source You can also try air layering in the late summer months, though the roots may not grow as well if temperatures dip below freezing during the winter."
    },
    {
      "title": "Choose a branch from last season’s growth that’s thicker than a pencil.",
      "content": "Choose a branch from last season’s growth that’s thicker than a pencil. Look for branches that point up and are at least 1–2 ft (0.30–0.61 m) long. Try to choose branches that grew during the last year since they produce roots better than old, established ones. Make sure the branch is at least as thick as a pencil, or else it may not grow well later on. [2] X Research source If you’re air layering in the late summer, choose growth from the current season instead. Choose healthy branches that don't have any signs of disease, pests, or damage. You can air layer multiple branches on the same tree, but don't air layer more than you would cut off during a normal prune. For example, if you're air layering a lemon tree , don't air layer more than 1/3 of the branches since that's the most you would prune at a time."
    },
    {
      "title": "Remove the foliage and twigs 3 inches (7.6 cm) around a leaf node.",
      "content": "Remove the foliage and twigs 3 inches (7.6 cm) around a leaf node. Go back about 1 ft (0.30 m) from the end of the branch and choose a spot where leaves are growing—this is a node. Pinch the leaves off of the branch so there’s about 3 in (7.6 cm) clear on either side of the node. If there are twigs or other branches in that area, cut them off with a gardening knife or pruning shears. [3] X Research source Don’t remove all of the foliage from the branch or else it won’t grow as well when you remove it from the tree."
    },
    {
      "title": "Make 2 parallel cuts through the bark so they go around the branch.",
      "content": "Make 2 parallel cuts through the bark so they go around the branch. Push the blade of a gardening knife into the bark just below the leaf node until you feel it make contact with solid wood. Guide the knife around the branch to cut a ring into the bark. Cut another ring 1– 1 1 ⁄ 2 in (2.5–3.8 cm) lower down the branch. [4] X Research source Cutting a wide section out of the bark will help encourage rooting and will also make it harder for the branch to callous over. Don’t apply too much pressure to the knife blade, or else you could cut through the branch completely."
    },
    {
      "title": "Peel the ring of bark off of the branch.",
      "content": "Peel the ring of bark off of the branch. Put the knife against the top cut and push the blade down toward the bottom cut to start peeling the bark off. Pinch the piece of bark by hand and slowly tear it away from the branch. Continue removing the bark from the ring until you see green or white wood underneath. [5] X Research source You may need to make a vertical cut from the top ring to the bottom ring to help you get a better grip on the bark. Consider wearing gardening gloves so the tree sap doesn’t irritate your skin."
    },
    {
      "title": "Scrape the exposed wood with the knife blade.",
      "content": "Scrape the exposed wood with the knife blade. Hold the knife so the blade is parallel against the top of the ring. Drag the blade down to the bottom of the ring to remove the protective plant layer on the wood. Scrape the wood up and down as you work your way around the branch. [6] X Research source Rubbing the wood removes a layer of cells called cambial tissue, which would cause the bark to grow back if you left it on. Disinfect your knife blade with rubbing alcohol after cutting each branch if you plan on air layering multiple trees. That way, you prevent spreading diseases or bacteria between plants."
    },
    {
      "title": "Apply rooting hormone just above the exposed wood.",
      "content": "Apply rooting hormone just above the exposed wood. Dip a small paintbrush in liquid rooting hormone and tap off any excess. Spread the rooting hormone on the bark just above the exposed ring you cut into the wood—this is where new roots will emerge from the plant. You can buy rooting hormone from your local gardening store or online. Rooting hormone isn’t required to air layer trees, but it may speed up growth."
    },
    {
      "title": "Moisten a handful of sphagnum moss in clean water.",
      "content": "Moisten a handful of sphagnum moss in clean water. Sphagnum moss is a common rooting medium that retains moisture well. Take a large handful of the moss and soak it in a container with water for 1–2 minutes. Pull the moss out from the container and squeeze out any excess water so it isn’t dripping wet. If the moss is too wet, the excess moisture could prevent roots from forming and cause rot. [7] X Research source You can buy sphagnum moss online or from your local gardening center. If you’d like, you can use soil instead of moss, but moss typically holds moisture better."
    },
    {
      "title": "Wrap the sphagnum moss around the exposed wood.",
      "content": "Wrap the sphagnum moss around the exposed wood. Split the ball of moss into halves and hold one in each of your hands. Press the moss around the cut you made in the branch, then squeeze it tightly so it has firm contact with the wood and stays in place. [8] X Research source Let go of the moss slowly to make sure it doesn’t fall off the branch. If it starts to slip, keep holding it or ask a helper to hold it while you continue working."
    },
    {
      "title": "Cover the moss with plastic wrap or aluminum foil.",
      "content": "Cover the moss with plastic wrap or aluminum foil. Tear off a sheet of plastic cling wrap or aluminum foil large enough to cover the moss. Wrap the plastic or foil tightly around the moss and branch. Make sure to wrap the entirety of the moss so you trap in moisture and promote healthy root growth. [9] X Research source Plastic wrap allows you to see when roots form easier than foil, but either will work. If the moss-covered area gets direct sunlight throughout the day, use dark-colored or opaque plastic wrap to prevent it from drying out. If you’d like, you can protect the moss ball from drying out by covering it with a plastic container. To do that, cut a slit into a small plastic container, then carefully slide the container around the stem and moss ball. You can either put the container over the plastic wrap, or put the container on first, then wrap it in plastic."
    },
    {
      "title": "Leave the branch on the tree until the moss fills with roots.",
      "content": "Leave the branch on the tree until the moss fills with roots. Look through the wrap or peel back the foil about once a week to check for roots growing throughout the moss. If you don’t see any, leave the wrap on the branch and take care of the tree as you normally would. If you do see roots around the outside of the moss, then you can remove the air layer from the tree. [10] X Research source Typically, it will take around 6–8 weeks for healthy roots to fill in the moss, but it may vary based on the climate and tree species. The sphagnum moss should stay moist as long as it’s wrapped tightly, but rewet it if it feels dry when you check for roots."
    },
    {
      "title": "Fill half of a planter with potting soil.",
      "content": "Fill half of a planter with potting soil. Choose a pot that has a diameter and height at least twice the size of the roots growing on the air layer. Make sure the pot has drainage holes on the bottom so the soil doesn’t get waterlogged. Choose a potting mix meant for trees and pour it loosely about halfway up the pot. [11] X Research source Buy potting mix online or from your local gardening center. You can use clay or plastic pots for your propagation. It’s usually better to start your propagation in a pot, then transplant it to the ground once it’s well-established."
    },
    {
      "title": "Cut the branch off just below the new roots.",
      "content": "Cut the branch off just below the new roots. Hold the branch with your nondominant hand just above the moss to keep it steady. Use your other hand to cut through the branch with pruning shears just underneath the moss. Lift the cut branch away from the tree, being careful not to hit or damage the new roots. [12] X Research source If you have trouble cutting through the branch with pruning shears, use loppers instead."
    },
    {
      "title": "Remove the plastic wrap or foil from the roots.",
      "content": "Remove the plastic wrap or foil from the roots. Poke your gardening knife carefully through the plastic wrap or foil to make a starting hole. Carefully pull the wrap apart by hand so you don’t damage any of the roots inside. Pull off as much of the wrap or foil as possible, but leave the moss around the roots so you don’t stress them. [13] X Research source If you remove the moss from the roots, the tree may not grow well."
    },
    {
      "title": "Set the roots in the soil and backfill the pot.",
      "content": "Set the roots in the soil and backfill the pot. Hold the cut branch vertically with your nondominant hand and keep it steady in the center of the pot. Use a trowel to scoop more potting mix into the pot until the moss is completely covered. Continue filling the pot until there’s 1–2 in (2.5–5.1 cm) between the lip of the pot and the top of the soil. [14] X Research source Shape the soil around the tree into a small mound to help prevent it from getting waterlogged or developing root rot."
    },
    {
      "title": "Water the soil so it’s moist 2 in (5.1 cm) below the surface.",
      "content": "Water the soil so it’s moist 2 in (5.1 cm) below the surface. Slowly add water until it starts draining from the holes in the bottom of the pot. Stick your finger into the soil to feel whether the soil is wet 2 in (5.1 cm) below the surface. If the soil isn’t damp enough, add more water. [15] X Research source To keep your air layered tree healthy, water it whenever the soil feels dry 1 in (2.5 cm) below the surface."
    },
    {
      "title": "Keep the tree in a shady area out of direct sunlight.",
      "content": "Keep the tree in a shady area out of direct sunlight. If you’re keeping your tree indoors, place it near a north- or south-facing window so it gets light without being directly in the sun. Make sure there aren’t any drafts near it since it can cause the soil to dry out or damage the tree. Keep the plant in its pot while the root system adapts to the new growing medium. [16] X Research source If you keep the pot outside, place it in a shady area with indirect sunlight. If it gets too much sunlight, the tree will use most of its energy to make new leaves or blooms instead of roots."
    },
    {
      "title": "Water the plant cutting regularly for the first two years.",
      "content": "Water the plant cutting regularly for the first two years. One Tree Planted says, “Younger trees need to be watered regularly for two years until they’re established.” Keep the top 1 in (2.5 cm) of the soil moist while the tree is in the pot. After you transplant the tree to the ground, water about every 1–2 weeks for the first two years. After that, water it in periods of drought or depending on the needs of the individual tree."
    },
    {
      "title": "Plant the new tree in the ground during the next spring.",
      "content": "Plant the new tree in the ground during the next spring. Allow the plant’s roots to fully develop in the pot, which usually takes 4–5 months. When you’re ready to transplant, dig a hole in the ground that’s twice as wide and 6 in (15 cm) deeper than the pot. Carefully pull the tree out of the pot and set it in the hole before filling it back in. Water the tree as you normally would so it doesn’t get stressed. [17] X Research source If you want to help your tree grow straight, Briones recommends staking it. He says, “Stake the tree with two stakes on each side, then use tree ties to tie the stakes to the tree. That way, the tree has room to move and grow without restricting the trunk.” One Tree Planted recommends fertilizing the tree when you plant it in the ground. After that, “if your tree is healthy and blooming, no fertilizer is needed.”"
    },
    {
      "title": "Try air layering trees that flower or bear fruit.",
      "content": "Try air layering trees that flower or bear fruit. Good options include apple trees, orange trees, lemon trees, magnolias, rubber plants, and bonsai trees. Woody ornamental shrubs like azaleas, camellias, and holly can also be air layered. [18] X Research source"
    },
    {
      "title": "How long does it take to air layer a tree?",
      "content": "How long does it take to air layer a tree? It takes about a year to air layer a tree. Ideally, you should start air layering the plant in the spring. Cut the propagation away from the parent plant about 4–6 months after that, then transplant the new tree to the ground the following spring."
    },
    {
      "title": "What are the disadvantages of air layering?",
      "content": "What are the disadvantages of air layering? The main disadvantage of air layering is that it takes a long time. It will typically be about a year before you're able to transplant the new tree into the ground. Also, plants that are air-layered don't have a taproot, so their root system is more shallow than trees that grow from a seed. [19] X Research source A shallower root system could mean that the tree will be more susceptible damage by strong storms, especially for the first few years."
    },
    {
      "title": "Do air layered trees fruit faster?",
      "content": "Do air layered trees fruit faster? Some air layered trees may fruit faster. Because you're starting with established branches, air layered trees are already somewhat developed by the time you transplant them. This can shorten the amount of time they need to mature, so you may see fruit sooner."
    }
  ]
}