{
  "url": "https://www.wikihow.com/Change-Your-Address-on-a-Passport",
  "title": "How to Change Your Address on a Passport",
  "steps": [
    {
      "title": "Visit the website of your country's passport agency.",
      "content": "Visit the website of your country's passport agency. In many countries, including Australia, you can make simple updates to your passport information, such as a change of address, online. The website of the government agency in your country will have information on how to do this. [1] X Research source If you're just updating your address online, you typically won't have to pay any fees. However, keep in mind that your address will be updated in your biodata information only – the physical display of your address on your passport will be unchanged."
    },
    {
      "title": "Create an online account if you have not already done so.",
      "content": "Create an online account if you have not already done so. Many countries have a specific website where you can open an account and manage your passport details. Typically, you must have a valid email address to open an account. Then you'll provide identity information so the system can find your passport. [2] X Research source When creating an online account to manage your passport information, use a secure password that would be difficult for anyone to guess. Never access your passport account on a public computer or public wifi network."
    },
    {
      "title": "Click the available link to update your contact information.",
      "content": "Click the available link to update your contact information. If you've just created a new account, you'll typically be sent an email for verification purposes. Click through the link in the email to verify your email address and log into your account. Then look for a tab or menu item that allows you to update your personal or contact information. [3] X Research source Once you click the link, the page will show the information that you can update online. Click through to change your address. Double-check that you've entered everything correctly before you submit the updated information through the system."
    },
    {
      "title": "Confirm that your information has been updated.",
      "content": "Confirm that your information has been updated. You may get an email confirming that your address has been changed. You'll also typically get an immediate confirmation after submitting the information. You can also log out and then back into your account and check your address to make sure it reflects your new address. [4] X Research source If you want, you can insert a slip of paper in your passport with your new address. You may also want to print off the confirmation that your address was updated and keep that in your passport."
    },
    {
      "title": "Turn to the page on your passport where your address is displayed.",
      "content": "Turn to the page on your passport where your address is displayed. In some countries, such as Canada, you don't need to notify the passport agency at all if you move to a new address. Instead, you can simply change your address on your passport yourself. [5] X Research source On a Canadian passport, your address is listed on page 4 of your passport. In other countries, you may find it in a different spot."
    },
    {
      "title": "Cross out your old address.",
      "content": "Cross out your old address. Use an ink pen to strike through your old address on your passport. It isn't necessary to scratch it out until it is no longer legible. You just want to clearly indicate that it is no longer your correct address. [6] X Research source Avoid using a black marker, as the ink may bleed through to the other side of the page."
    },
    {
      "title": "Write your new address in the space below your old one.",
      "content": "Write your new address in the space below your old one. After you've scratched through your old address, write your new address neatly in ink. Print letters will typically be more legible than cursive. Use the same format for your new address that was used for your old one. [7] X Research source Make sure you write large enough that it can be read, but not so large that you run out of space. If there isn't enough room under your old address to write your new one legibly, write it on a separate sheet of paper. Insert the separate sheet of paper into your passport."
    },
    {
      "title": "Complete an application to have your passport re-issued.",
      "content": "Complete an application to have your passport re-issued. In some countries, such as India, you must get a new passport if you need to change your address. To do this, you'll need to fill out a new passport application. You may be able to download the application online. You can also go to the nearest passport agency office and fill out the form there. [8] X Research source When you fill out your application, provide your new address. You may need to indicate that your new address differs from the one on your original passport. Go to the website of your home country's passport agency for information about the process of having your passport re-issued and the fees required."
    },
    {
      "title": "Gather documents to prove your current address.",
      "content": "Gather documents to prove your current address. At a minimum, you will need at least one original document that you can use as proof of address. Your country's passport agency will be able to tell you what documents are accepted for this purpose. Typically, a utility bill, deed, or lease that clearly displays your name and your new address is sufficient. [9] X Research source In addition to proof of residency, you may also have to bring new passport photos. Your passport agency will let you know if new photos are required or if you can use the existing one."
    },
    {
      "title": "Go to the nearest passport agency office to complete your application.",
      "content": "Go to the nearest passport agency office to complete your application. Passport office staff will review your application and verify your proof of residence documents. Take your old passport with you when you go. [10] X Research source You'll have to pay a fee to have your passport re-issued. Call ahead to find out how much the fee is and what methods of payment are accepted."
    },
    {
      "title": "Receive your new passport in the mail.",
      "content": "Receive your new passport in the mail. When your passport is ready, it will be mailed to you at your new address. The time varies among countries and depending on how busy the passport agency is, but it shouldn't be more than a couple of weeks. [11] X Research source If your country requires you to get your passport re-issued to change your address, make sure you leave plenty of time to do this before you plan to travel out of the country. If you're cutting it close and don't think you'll get your passport in time for a scheduled trip, ask staff at the passport agency about expedited processing."
    }
  ]
}