{
  "url": "https://www.wikihow.com/Build-an-Underground-Root-Cellar",
  "title": "Everything You Need to Know to Build Your Very Own Root Cellar",
  "steps": [
    {
      "title": "Understand that the key elements of a root cellar have to do with temperature, humidity and ventilation.",
      "content": "Understand that the key elements of a root cellar have to do with temperature, humidity and ventilation. Keep these three details in mind and the cellar can be built using just about any method. [1] X Research source Building material options include native stone, concrete cinder blocks, earth-packed tires or cedar logs for walk-in root cellars. The most common of these is to use concrete cinder blocks. This material is readily available from a DIY store."
    },
    {
      "title": "Think out of the box for your underground root cellar.",
      "content": "Think out of the box for your underground root cellar. [2] X Research source Use a fiberglass water tank. These will be easy to modify and bury. Bury a 50 gallon (189.3 L) plastic drum in the ground."
    },
    {
      "title": "Cover either of the above choices with 1 foot (30.48) of dirt or other coverage for temporary fall storage.",
      "content": "Cover either of the above choices with 1 foot (30.48) of dirt or other coverage for temporary fall storage."
    },
    {
      "title": "Locate your root cellar in an area that has good drainage away from it.",
      "content": "Locate your root cellar in an area that has good drainage away from it. Ideally, this would be on a hill side facing north and limiting exposure to the opening of the cellar. [3] X Research source"
    },
    {
      "title": "Excavate for the root cellar so that, when the walls are buried, you have at least 4 feet (1.22 meters) of coverage.",
      "content": "Excavate for the root cellar so that, when the walls are buried, you have at least 4 feet (1.22 meters) of coverage. Ten feet (3.05 meters) is even better."
    },
    {
      "title": "Vent the cellar by installing two PVC pipes.",
      "content": "Vent the cellar by installing two PVC pipes. One pipe must enter the root cellar low to the floor to let cool air in, and the other one needs to be near the ceiling to vent out hot air. [4] X Research source The vent pipes will need to be screened to keep out pests and to protect the produce from weather that is too cool or too warm. Remember, cool air settles and warm air rises. Ventilation is also important to remove ethylene gases that fruit and vegetables produce as they ripen. Venting ethylene gases slows down the ripening process."
    },
    {
      "title": "Create an entry to the root cellar.",
      "content": "Create an entry to the root cellar. The door to the root cellar plays a double roll -- to keep the varmints and unwanted visitors out and to keep the cool air in. Most root cellars have 1 door at the surface and a second at the wall that opens to the root cellar (if this exists). This entry way acts as a little extra insulation in the form of dead space to keep the cool air in."
    },
    {
      "title": "Cover the floor of your root cellar with gravel or even a concrete floor.",
      "content": "Cover the floor of your root cellar with gravel or even a concrete floor. Either one can be wet down to help raise the humidity when you need it. [5] X Research source"
    },
    {
      "title": "Choose wooden shelves over metal.",
      "content": "Choose wooden shelves over metal. Metal transmits heat, warming up faster that wood. Wood helps you keep the temperature more in control as a result."
    },
    {
      "title": "Place a temperature and humidity gauge in the cellar and keep a record of the readings.",
      "content": "Place a temperature and humidity gauge in the cellar and keep a record of the readings. This will help you to track how effective these numbers are and reflect the best way to maintain your root cellar."
    }
  ]
}