{
  "url": "https://www.wikihow.com/Cancel-a-Planet-Fitness-Membership",
  "title": "How to Cancel Your Planet Fitness Membership by Phone or Mail",
  "steps": [
    {
      "title": "Find the contract you signed with Planet Fitness.",
      "content": "Find the contract you signed with Planet Fitness. Although you may have signed up with a \"no contract\" or \"no sign-up fee\" promotion, you still signed an agreement that designates how you can cancel and what situations may allow you to waive your cancellation fees. [1] X Research source"
    },
    {
      "title": "Read your contract.",
      "content": "Read your contract. Your contract lays out the exact terms and conditions, and you should be informed. You should also note if you have an annual or monthly contract. Regardless of whether you pay annually or monthly, you likely signed a 1-year contract. Also, check to see when your contract is up. It might be easier to wait a month or two until your contract is up to cancel if you only have a couple of months left on your contract. Cancellation fees can be as much as 5 or 6 months of regular payments."
    },
    {
      "title": "Pay attention to the billing cycle.",
      "content": "Pay attention to the billing cycle. Usually, for a monthly contract, you must cancel before the 10th of the month, as you are generally billed on the 17th, and the company needs time to process your request. For an annual contract, you must cancel before the 25th of the month prior to when you are billed. In other words, if you usually pay your annual bill in March, you need to cancel on or before February 25. [2] X Research source Think of a fitness contract like a leasing contract. Having to give 30 days notice and fees for early cancellation are common with gyms. In fact, if you don't cancel your membership correctly, you may have to pay your contract out in total."
    },
    {
      "title": "Get your gym fees waived.",
      "content": "Get your gym fees waived. If you can give written proof that you are injured or that you must move out of range of a Planet Fitness, then you may be able to have the fees waived. If you have an injury, ask your doctor's office to write a note confirming that you will be unable to use the gym facilities. Ask him or her to give a specific amount of time that you will be unable to use the gym. If you are moving to a new place, it must be farther than 25 miles (40 km) away from any Planet Fitness location. Planet Fitness aims to transfer memberships whenever possible. Ask your employer to write a relocation letter, and make sure to map out the distance before specifying where you will be moving. That is, establish that you will have no Planet Fitness gyms within 25 miles (40 km) of your new address. You can print off maps with your new location and the closest Planet Fitness locations marked to help your case. [3] X Research source If neither of these situations applies to you, you will be required to pay the cancellation fee, though you can plead your case if other situations inhibit your ability to go to the gym. Be sure to have written proof of your situation, as they will not just take your word for it."
    },
    {
      "title": "Write down the information you'll need.",
      "content": "Write down the information you'll need. You will need your membership identification number. You will also likely need some personal information, such as your address, your social security number , your driver's license number, and your date of birth."
    },
    {
      "title": "Write a one-page document asking to cancel your membership.",
      "content": "Write a one-page document asking to cancel your membership. Make sure it is in accordance with the contract's specifications. Mention in your letter that you want your cancellation fee waived if you're eligible, as well as the reason why. Also note what documentation you are including with the letter. Include all your personal information; you only need to include the last four digits of your social security number and your driver's license number. Sign it. Planet Fitness requires a written cancellation. Include your back-up documentation to request your cancellation fee be waived. Clearly indicate what each piece of documentation is at the top of the page."
    },
    {
      "title": "Check the hours for your location's Membership Services department.",
      "content": "Check the hours for your location's Membership Services department. Call the department, and request a meeting to cancel your membership."
    },
    {
      "title": "Tell them you want to cancel your membership.",
      "content": "Tell them you want to cancel your membership. Meet with a representative, and give them the written documentation."
    },
    {
      "title": "Ask for the cancellation in writing.",
      "content": "Ask for the cancellation in writing. Don't forget to request a signature from an employee. You want proof that you cancelled your membership, as you may need it later."
    },
    {
      "title": "Arrange to cancel any future monthly payments.",
      "content": "Arrange to cancel any future monthly payments. You may need to pay another month, but make sure that payment is cancelled after that. Settle up any cancellation fees so you can be sure your membership is cancelled."
    },
    {
      "title": "Ask for the name and number of an appropriate contact person.",
      "content": "Ask for the name and number of an appropriate contact person. If you run into trouble after canceling -- if, for example, you find that you are being charged improper fees -- you may need to contact a particular person to address the issue. [4] X Research source"
    },
    {
      "title": "Monitor your credit card or bank statements.",
      "content": "Monitor your credit card or bank statements. If monthly or annual charges show up that shouldn't be there, you need to contact the gym."
    },
    {
      "title": "Call Membership Services if any extra charges were taken out.",
      "content": "Call Membership Services if any extra charges were taken out. Act immediately to avoid losing money."
    },
    {
      "title": "Visit in person.",
      "content": "Visit in person. If the gym is still insisting you pay, show them the cancellation in writing to prove that you have done so."
    },
    {
      "title": "Alternatively, send a certified letter.",
      "content": "Alternatively, send a certified letter. Because certified letters can be tracked, you can ensure that the gym received the letter. To send a certified letter, buy the postage for certified mail at the post office or online. [5] X Research source Certified mail is only applicable to priority or first-class mail. [6] X Research source Choose electronic or physical delivery of the signature. Essentially, you are proving that someone at Planet Fitness accepted and signed for the letter. You will get there actual signature back if you choose the physical signature, or you will be emailed a copy of their electronic signature if you choose the other option. Physical may be better for this situation because it looks more official. [7] X Research source"
    },
    {
      "title": "Gather your letter together.",
      "content": "Gather your letter together. Don't forget to include a letter requesting the cancellation of membership, all of your documentation, your personal information, and your justification for waiving your fees, if applicable. Request that they send a notice of cancellation in writing, as well as provide a follow-up phone call to you to confirm your membership is cancelled."
    },
    {
      "title": "Take the letter to the post office.",
      "content": "Take the letter to the post office. Give it to an employee. Certified mail has to be given to an employee to receive a return signature. [8] X Research source"
    },
    {
      "title": "Call the gym if you do not receive notice your membership was cancelled.",
      "content": "Call the gym if you do not receive notice your membership was cancelled. If you don't receive notification that your membership was cancelled within a week and a half, call and talk to an employee. [9] X Research source You may need to visit in person if you cannot get it cancelled through a letter."
    },
    {
      "title": "Check your accounts.",
      "content": "Check your accounts. Make sure you do not have any monthly or annual charges beyond what you've agreed to pay. If you do, you need to visit Planet Fitness and show them the proof of cancellation."
    }
  ]
}