{
  "url": "https://www.wikihow.com/Adjust-a-Sliding-Screen-Door",
  "title": "How to Adjust & Align a Sliding Screen Door: Quick Steps",
  "steps": [
    {
      "title": "Inspect the track for debris causing the door to stick.",
      "content": "Inspect the track for debris causing the door to stick. Slide the door back as far as you can. Over time, debris fills the track, preventing the door from moving smoothly or even at all. It can also cause the wheels to come off the track. Fortunately, the debris is easy to spot by looking at the track and seeing if anything is inside of it. To keep a screen door working, set aside time to clean the track at least once every 6 months."
    },
    {
      "title": "Clean gunk out of the track with a stiff brush.",
      "content": "Clean gunk out of the track with a stiff brush. Use a wire brush to pull the debris out of the frame. Remove as much of it as you can before testing the door again. You don't need to use any water to clear out the track, but dipping the brush in a little bit of clean or soapy water sometimes helps loosen stubborn debris. Most home improvement centers sell wire brushes. If you’re unable to find one, try using an old toothbrush instead."
    },
    {
      "title": "Sweep or vacuum up the remaining debris in the track.",
      "content": "Sweep or vacuum up the remaining debris in the track. Clear out the remaining gunk with a small, handheld vacuum. If you can, use a crevice attachment to get more suction in the tight track space. Otherwise, sweep as much of the debris away from the door as possible, then scoop it up and throw it away. You may need to brush and vacuum out the door frame a few times before the screen door works the way you want it to. Test it on occasion to ensure it works properly."
    },
    {
      "title": "Try to slide the door on the track to see if you fixed the issue.",
      "content": "Try to slide the door on the track to see if you fixed the issue. If the screen door still doesn’t work after cleaning the track, you should check out the rollers/wheels and the door frame next. The problem may originate in one of those locations. Debris in the tracks is often a sign that the wheels need to be cleaned as well."
    },
    {
      "title": "Pull back the track to inspect the wheels for debris.",
      "content": "Pull back the track to inspect the wheels for debris. Dirty wheels may stop rotating, preventing the door from moving with ease. Locate the wheels along the top and bottom edges of the door by gently pulling the edges of the track away from it. Check for rust and debris, but also watch to see if the wheels spin when you move the door. [1] X Research source If the wheels look like they are in bad shape, consider taking the door down to give them a thorough cleaning. If they look damaged, you may need to replace them."
    },
    {
      "title": "Loosen the tension screws to make the door easier to remove.",
      "content": "Loosen the tension screws to make the door easier to remove. Find the pair of tension screws on the inner part of the frame. They will be close to the corners, over the wheels. Use a Phillips head screwdriver to turn them counterclockwise. [2] X Research source Once the door is loose, it will be unsteady in its tracks but won’t fall. Touch it to see if it feels steady in the tracks or loose and ready to be removed. Note that the wheels are difficult to reach without removing the door from its tracks. You may be able to pull up the tracks to reach the wheels with a small brush or at least a little bit of penetrating oil."
    },
    {
      "title": "Push the door up against the frame to remove it.",
      "content": "Push the door up against the frame to remove it. Hold onto the left and right sides of the door. Attempt to raise the door up slowly. If it has been sufficiently loosened, the bottom edge of the door will disengage from the track. Lower the door toward you to detach it from the top track. [3] X Research source Most screen doors aren’t too difficult to remove, but take it slowly. Be careful not to bend the door at all. If you’re planning on reusing the door, any damage to the frame could prevent it from working properly."
    },
    {
      "title": "Unlock the wheels with a screwdriver if you can’t remove the door.",
      "content": "Unlock the wheels with a screwdriver if you can’t remove the door. Some types of sliding screen doors take a little more effort but still aren’t too difficult to remove. To force the lower wheels off the track, stick the tip of a flathead screwdriver under them. Then, pry them up gently until they pop off the track. Once both wheels are off, you can lift the door out of the frame and set it aside. [4] X Research source Be gentle with the door, especially around the corners. Bending them could cause more problems. Bent corners have to be straightened out in order for the door to move along its tracks."
    },
    {
      "title": "Scrub the wheels with a wire brush to remove debris.",
      "content": "Scrub the wheels with a wire brush to remove debris. Debris often prevents the wheels from sliding across the track as smoothly as you would like. Scrape off as much debris as possible. You don’t need to use soap or water, although you could try dipping the brush in a little bit of water to treat stubborn dirt. Clean off each pair of wheels on the top and bottom edge of the door. [5] X Research source If you don’t have a wire brush, you could try using an old toothbrush moistened in a little bit of water. However, it isn’t as effective as using a wire brush. Make sure the track is clean as well, or else the wheels will get dirty again as soon as you put the door back in place! Scrape out and vacuum up as much of it as you can."
    },
    {
      "title": "Lubricate the wheels with a penetrating oil or a similar product.",
      "content": "Lubricate the wheels with a penetrating oil or a similar product. WD-40 is the most common option you can get, although there are many other choices out there. Once the wheels look spic and span, hold the canister nozzle close to them to coat them in in the oil. Remember that screen doors have 4 wheels in total to treat, or a pair on both its top and bottom edges. [6] X Research source Silicone sprays are an example of an alternative lubricant you could use. Try using sprays meant for garage door rollers. They can be more effective at keeping debris off the wheels."
    },
    {
      "title": "Fit the door back on its track to test it.",
      "content": "Fit the door back on its track to test it. To reinstall the screen door, focus on the upper wheels first. Push them into the upper track, then set the door on top of the lower track. Turn the tension screws clockwise until the door is secure and well-aligned with the strike on the frame. Then, test out the door to see if it works much better than before! You may need to use the tension springs a few times to get the door right where you want it. Turn them clockwise to raise the door and counterclockwise to lower it. If the door still doesn’t work well, it most likely needs to be repaired. Straightening the frame or replacing the wheels could help you adjust it."
    },
    {
      "title": "Slide the door along the track to see if it is aligned correctly.",
      "content": "Slide the door along the track to see if it is aligned correctly. If the screen door is hard to slide, the tension could be the issue. Close the door again and see if you notice a gap between the edge and the frame. Also, make sure the door lines up with the strike plate on the door frame so you are able to lock it without a problem. Always check to see if the track is clear first. A dirty track could prevent the door from moving smoothly. Dirty or rusty wheels could also be a problem, so lift the edges of the track to check them as well. The strike plate is the metal faceplate meant to connect to the door’s latch. It will be ahead of the front edge of the door and inside the frame."
    },
    {
      "title": "Look for the tension screws inside the door frame.",
      "content": "Look for the tension screws inside the door frame. The screws could be inside the top or bottom edge of the frame. Your door will typically have 4 of these screws, with one in each corner. They are always over the wheels and require a Phillips head screwdriver to turn. [7] X Research source The screws are pretty easy to locate. They are always accessible outside of the frame."
    },
    {
      "title": "Turn the tension screws to raise and lower the door.",
      "content": "Turn the tension screws to raise and lower the door. Rotate the screws clockwise to raise the door or counterclockwise to lower it. The screws usually aren’t difficult to rotate, but you could lubricate them with a penetrating oil if they appear rusty. Let them soak for up to 15 minutes, tap them with a hammer, and then try again. Slide the door along the track a few times when you’re done adjusting it. You may need to adjust it a few times to get it positioned in the perfect spot."
    },
    {
      "title": "Remove the screen door from its frame.",
      "content": "Remove the screen door from its frame. Loosen the screws along the inner part of the frame by turning them counterclockwise. Once the screen feels loose, push it up to disengage the wheels from the lower track. Then, pull the door toward you to finish the removal process. If the door is stuck, check the wheels to see if you need to pry them off the track with a flathead screwdriver. [8] X Research source Handle the door carefully to avoid bending it as you remove it from the frame."
    },
    {
      "title": "Straighten out the frame by hand if it appears bent.",
      "content": "Straighten out the frame by hand if it appears bent. A bent screen door won’t be able to slide properly along the track. To fix it, lay the door down on a flat surface. Check the corners to see if they are bowed, then gently push them in the opposite direction to straighten them out again. Try to make them as level as possible with the door to ensure they don’t get caught up in the tracks. [9] X Research source Screen doors are fairly flexible, so they don’t take a ton of force to bend. It’s best to do it slowly with your hands so you don’t end up damaging the door further."
    },
    {
      "title": "Remove the tension screws if you need to replace the wheels.",
      "content": "Remove the tension screws if you need to replace the wheels. Replace the wheels if they look broken or no longer turn when you slide the screen door. As long as you have a Phillips head screwdriver, they aren’t too difficult to swap out. Turn the screws counterclockwise until you are able to slide the wheels off of the door. Make sure you remove every broken wheel if you don’t plan on replacing all 4 of them at the same time. [10] X Research source Save the broken wheels to take with you to a hardware store. Use them to get similar replacement wheels. If you aren’t able to find what you need, search online or contact the screen door manufacturer. Keep in mind that sometimes adjusting the screws to the right tension can help the wheels stay on the track. If you haven’t tried it yet, it’s worth trying before removing the door."
    },
    {
      "title": "Install the replacement wheels into the slots on the door.",
      "content": "Install the replacement wheels into the slots on the door. Slide the top part of the wheel assembly into the opening on the door frame. The top part of the assembly has a hole in it that aligns with the screw hole on the frame. Once you have them aligned, slide a tension screw in and turn it clockwise to lock the wheel in place. [11] X Research source Make sure the screw holes align. If the screw won’t go all the way in, it is probably because the wheel isn’t positioned in the right spot."
    },
    {
      "title": "Reinstall the door to test the replacement wheels.",
      "content": "Reinstall the door to test the replacement wheels. Lift up the door, then push the top pair of wheels into the upper track. Afterward, position the door on the lower track. Slide the door back and forth a few times to make sure all the wheels are rolling. Use the tension screws as needed to fine-tune the adjustment. [12] X Research source Keep adjusting the tension screws until the door’s latch aligns with the strike on the frame. Turn them clockwise to raise the door and counterclockwise to lower it."
    }
  ]
}