{
  "url": "https://www.wikihow.com/Become-an-Excellent-Student",
  "title": "How to Become an Excellent Student",
  "steps": [
    {
      "title": "Choose a quiet place to study without distractions.",
      "content": "Choose a quiet place to study without distractions. The more time you spend studying, the more you’ll learn and the better grades you’ll earn. But the quality of your study time needs to be efficient, so remove all distractions (cell phones, television, loud/fast-paced music, and talkative friends/family members), to ensure a calm, focused environment. [1] X Research source If you can’t find a quiet place to study, wear noise cancellation headphones (but don’t play any music). Find time to study when most of your peers are doing something else. For instance, if you finish lunch early, head to the library or any other quiet place that won’t be too crowded."
    },
    {
      "title": "Avoid procrastinating and stay positive.",
      "content": "Avoid procrastinating and stay positive. It’s tempting to say, “I’ll do it later,” but often, later never happens. Make a point to study right when you get home or right when the last class lets out. If you have trouble with a particular subject, study that one first and stay positive! [2] X Research source If you are still procrastinating, ask a friend or family member to keep you accountable. You could say something like, “Could you check on me in an hour to make sure I’m still studying?” Repeat positive affirmations to yourself if you feel like you’re struggling to understand something. For example, you might tell yourself: “I can master these equations!” and/or “I am going to ace this test!”"
    },
    {
      "title": "Take short breaks from studying.",
      "content": "Take short breaks from studying. Your brain needs time to rest and digest information, so plan to take a 10-minute break after each hour. If you get stuck on a certain topic, that’s a good time to take a little break so you can come back refreshed. Set a timer on your phone or another device so a short 10-minute breather doesn’t turn into 30 minutes of procrastination. [3] X Research source"
    },
    {
      "title": "Read ahead and prepare questions for each class.",
      "content": "Read ahead and prepare questions for each class. Find out which chapter your teacher is covering tomorrow and read it before going to class. That way you become familiar with the material and can ask questions to clarify things you don’t understand. [4] X Research source Use a highlighter to draw attention to important information or write your questions on sticky notes."
    },
    {
      "title": "Do extra credit to further your understanding of a topic.",
      "content": "Do extra credit to further your understanding of a topic. If your teacher offers extra credit for doing extra assignments or readings, do them! Even if your grade in a class is 98%, you can still improve your grade and understand the material better. If you’re struggling to raise a low grade, ask your teacher if there’s anything you can do for extra credit. They’ll be impressed by your dedication!"
    },
    {
      "title": "Study for quizzes and tests early.",
      "content": "Study for quizzes and tests early. If you have a big test coming up, start studying a few days to a week before the test, or even when the test is announced. Make a study schedule, breaking up your time into sections, and stick to it. Don’t wait until the night before because cramming doesn’t allow your brain time to fully absorb information. [5] X Research source If you play sports or do any extracurricular activities, let your coach or teacher know that you might need to leave early or arrive a little late to make time for your studies. If your attendance is mandatory (like for theatre performances or championship sports games), plan your study time around the event. Don’t forget to pencil in small breaks to allow your brain some resting time!"
    },
    {
      "title": "Write small tests and quizzes for yourself.",
      "content": "Write small tests and quizzes for yourself. Take some time to write some problems up, or you could ask someone to write them for you. Just remember, the more you encounter and think about the information, the more likely it is to stick. [6] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source For instance, if you’re studying for algebra, have a friend write out some equations for you to solve. Time yourself if you struggle with time management during test-taking. For Language Arts courses, practicing writing paragraphs using relevant vocabulary words and varied sentence structures. Make it fun by writing a review of your favorite movie or jotting down your opinions on something you’re interested in."
    },
    {
      "title": "Read as much as you can to expand your vocabulary.",
      "content": "Read as much as you can to expand your vocabulary. Reading books that challenge you can expand your vocabulary and comprehension skills, which is useful when a teacher assigns linguistically arduous texts. If you are not already an avid reader, start at your level and work your way up. [7] X Research source Read something you like to get you into it. If you have a friend who likes to read, ask them for recommendations. Go to your school or local library and ask the librarian for recommendations based on your likes and dislikes in other mediums. For instance, you might say, “I really love superhero and mystery movies, do you have any books that have those kinds of themes?”"
    },
    {
      "title": "Create mind maps of topics to help you learn new things.",
      "content": "Create mind maps of topics to help you learn new things. Mind-maps help you make connections between old and new information, giving new facts some context so you remember them better. This practice is especially useful when you need to brainstorm ideas for big projects. To create a mind map, write the topic in the center, add lines that point in different directions, and write your ideas on top of the lines. [8] X Research source Try to come up with as many ideas as you can. If you are stuck, do some research for more information. Think of this exercise as a form of word or idea association."
    },
    {
      "title": "Pack your backpack with all your supplies for school before going to bed.",
      "content": "Pack your backpack with all your supplies for school before going to bed. Be prepared for each day by making sure you have everything you need with you. This means you’ll need to take books, folders, pens, pencils, homework, review sheets, highlighters, sticky notes, bookmarks and anything else that helps you stay organized. Paste a copy of your class schedule somewhere in your house where you’ll see it everyday. Write reminders to bring certain items certain days. That way, you’ll know exactly what class you have and what materials you’ll need."
    },
    {
      "title": "Keep a folder for each subject so you can easily pack and find things.",
      "content": "Keep a folder for each subject so you can easily pack and find things. Staying organized in school is extremely important because if you are organized, you are one step ahead in being successful. A good way to start off is to keep a folder for each subject. [9] X Research source This means putting your math papers in your math folder, your Language Arts papers in your Language Arts folder, your science papers in your science folder, and so on. Use color coding or label your folders and place them into either your desk or backpack neatly. This way, you will have an easier time searching for your folders and will have more time to review what you have learned yesterday. If you like, you can also place bookmarks in all of your folders to make them easier to be found when you take your folders home."
    },
    {
      "title": "Use a weekly planner to write assignments and due dates.",
      "content": "Use a weekly planner to write assignments and due dates. Use a weekly planner or calendar to write down important dates regarding assignments, quizzes, tests, and extracurricular activities. This will help you manage your time better. And checking off each completed task will give you a feeling of accomplishment. [10] X Research source Write down any other reminders (birthdays, special materials for classes, study group dates/times) in the “notes” section of your planner."
    },
    {
      "title": "Dedicate a certain area of your room or home for supplies.",
      "content": "Dedicate a certain area of your room or home for supplies. Keeping all of your writing utensils, folders, paper, and other necessities in one area will make it easier to locate them. If you don’t have a desk, get one and have a drawer for each group of items. For example, one drawer can be dedicated to writing utensils, another can hold hole punchers and staplers, and a third can store extra printer paper, journals, and folders. If you don’t have a desk with drawers, use table-top paper racks, pencil holders, shoe boxes, and/or storage bins to keep like items together."
    },
    {
      "title": "Take notes and ask questions to stay engaged in class.",
      "content": "Take notes and ask questions to stay engaged in class. Paying attention in class will help you learn better and may also boost your grade. When a teacher is giving a lesson, take notes, and if you don't understand something, raise your hand and ask questions. Try to take notes in your own words and add your own annotations instead of writing what the teacher says word-for-word. [11] X Research source For example, if the teacher says the definition of “ransack” is “to search through in a way that causes disorder,” you might write: “ransack: to pillage—like a pirate!” The more questions you ask, the more you’ll know about a certain topic. Teachers expect you to ask questions and form an impression of you based on how willing you are to do so. In some cases, class participation also counts toward your overall grade. Concentrate on staying focused. Keep your eyes on the teacher, keep your ears open, and keep taking notes. Sit in the front row if you’re prone to distractions."
    },
    {
      "title": "Avoid distractions in class.",
      "content": "Avoid distractions in class. Do not distract others and don't be distracted by them. Note the things that cause you to get distracted and try to avoid them. For instance, if you know you’re more likely to daydream in class when you’re hungry, eat a small snack beforehand. If you see your friends passing notes, don’t engage. Whatever you have to say can wait until after class. If friends constantly try to distract you, don't be mean! Just tell them you are working and say you will talk later during recess or lunch. They'll understand and may even feel the same way themselves."
    },
    {
      "title": "Review your notes when you have free time.",
      "content": "Review your notes when you have free time. Read over your notes whenever you get the chance to help you remember what you've written. Rewriting your notes can also be helpful if you’re taking exceptionally hard classes, such as legal studies, economics, engineering, sciences, and more. [12] X Research source"
    },
    {
      "title": "Get 7 to 8 hours of sleep.",
      "content": "Get 7 to 8 hours of sleep. Sleep deprivation can negatively impact your ability to focus and make you less enthusiastic about learning. Aim to get 7 to 8 hours per night. If you are short on sleep, try to take 20-minute power naps between classes (if your schedule allows). [13] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Avoid looking at your phone or watching television for an hour or two before bedtime. Do something relaxing like reading a book, taking a warm bath, or drawing. Avoid relying on caffeine to perk you up from a sleepless night. You may feel more energized after lots of coffee or an energy drink, but you won’t be able to focus nearly as well due to underlying sleep deprivation. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Eat well to feed your body and mind.",
      "content": "Eat well to feed your body and mind. Make sure to eat a variety of foods from each group (proteins, carbohydrates, and fats). Snack on whole foods like fresh fruits, vegetables, or nuts to keep you energized between meals. [15] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Do your homework as soon as possible.",
      "content": "Do your homework as soon as possible. Homework may seem like a drag, but it helps you review what you’ve learned that day and prepare for upcoming quizzes and tests. Try to start doing it at school so you can ask the teacher just in case you need help. [17] X Research source If your homework involves hand-written answers, write as legibly as possible using your teacher’s preferred tool (black/blue ink pen or pencil). Don’t rush it and check over your work when you’re finished."
    },
    {
      "title": "Turn in your assignments on time.",
      "content": "Turn in your assignments on time. Turning in your work before or by the due date is essential for getting good grades. Make a note of due dates on your study schedule so you won’t forget. You can even use colored sticky notes to remind yourself which assignments need to get done first. Sometimes teachers will deduct points for late assignments, and some won’t accept late work at all! Look at your syllabus to find out the penalty for late work."
    },
    {
      "title": "Set homework goals and reward yourself for completing them.",
      "content": "Set homework goals and reward yourself for completing them. Set realistic goals to finish certain tasks by specific deadlines. Giving yourself an incentive to finish your homework will help motivate you and keep you on task. [18] X Research source For instance, tell yourself: “If I finish this packet now I can go play the guitar for 20 minutes before dinner.” Make sure your goals are reasonable and achievable. For instance, a reasonable goal would be: “I will read the first 20 pages of the text before taking a break and finishing the last 20 pages.” An example of an unrealistic goal is: “I’m going to finish the entire book tonight before I can do anything else."
    },
    {
      "title": "Ask a friend or family member to check your work.",
      "content": "Ask a friend or family member to check your work. Ask someone else to check your homework for clarity and readability. Cheating isn’t okay, so make sure to choose a friend who won’t copy off of your work! And make sure your parent or sibling doesn’t try to redo the work for you. Instead, ask them for specific ways that you can improve. Some things you might ask them to look for are: Grammatical errors Legible handwriting Relevance (i.e., you’ve addressed the questions/topic/prompt) Depth of understanding (i.e., your work displays that you understand the concepts at hand)"
    }
  ]
}