{
  "url": "https://www.wikihow.com/Connect-a-Windows-7-Computer-to-the-Internet-Via-an-Android-Phone",
  "title": "How to Connect a Windows 7 Computer to the Internet Via an Android Phone",
  "steps": [
    {
      "title": "Attach your Android to your computer.",
      "content": "Attach your Android to your computer. Use the charging cable and a USB port on your computer to do this. USB tethering for Android phones is a Windows-only feature. [1] X Research source"
    },
    {
      "title": "Open your Android's Settings.",
      "content": "Open your Android's Settings. Swipe down from the top of the screen, then tap the \"Settings\" gear in the top-right corner of the drop-down menu. On some Android models, you'll have to swipe down using two fingers."
    },
    {
      "title": "Tap Network & Internet.",
      "content": "Tap Network & Internet . It's near the top of the page. On a Samsung phone or tablet, tap Connections instead."
    },
    {
      "title": "Tap Hotspot & tethering.",
      "content": "Tap Hotspot & tethering . You'll find this in the middle of the page. On a Samsung Android, tap Mobile Hotspot and Tethering instead."
    },
    {
      "title": "Tap the white \"USB tethering\" switch .",
      "content": "Tap the white \"USB tethering\" switch . It will turn blue . Your computer should now have a wired (LAN) connection to the Internet through your Android's data."
    },
    {
      "title": "Fix the connection if necessary.",
      "content": "Fix the connection if necessary. If your Windows 7 computer isn't recognizing the attached Android as an Internet location, you may be able to fix this problem by doing the following: [2] X Research source Open Device Manager: click Start , click the search bar, type in device manager , and click Device Manager . Double-click Network adapters . Right-click Remote NDIS based Internet Sharing Device . Click Update Driver Software... . Click Browse my computer for driver software . Click the Let me pick button at the bottom of the window. Uncheck the \"Show compatible hardware\" box. Click Microsoft Corporation in the \"Manufacturer\" column. Click Remote NDIS Compatible Device , then click Next . Click Yes when prompted, then click Close when prompted."
    },
    {
      "title": "Open your Android's Settings.",
      "content": "Open your Android's Settings. Swipe down from the top of the screen, then tap the \"Settings\" gear in the top-right corner of the drop-down menu. On some Android models, you'll have to swipe down using two fingers."
    },
    {
      "title": "Tap Network & Internet.",
      "content": "Tap Network & Internet . It's near the top of the page. On a Samsung phone or tablet, tap Connections instead."
    },
    {
      "title": "Tap Hotspot & tethering.",
      "content": "Tap Hotspot & tethering . You'll find this in the middle of the page. On a Samsung Android, tap Mobile Hotspot and Tethering instead."
    },
    {
      "title": "Tap Set up Wi-Fi hotspot.",
      "content": "Tap Set up Wi-Fi hotspot . It's in the middle of the page. On a Samsung, tap the white \"Mobile hotspot\" switch to enable the hotspot. You can then adjust the password by tapping Password , entering a new one, and tapping SAVE . Once you're done, skip ahead to the \"Open your computer's Wi-Fi settings\" step."
    },
    {
      "title": "Set up your Android's hotspot.",
      "content": "Set up your Android's hotspot. Fill in the following fields: Network name — The name that your Android will display in your computer's wireless network area. Security — Select a WPA2 option from this menu. Password — The password that you'll use to log in."
    },
    {
      "title": "Tap SAVE.",
      "content": "Tap SAVE . It's at the bottom of the menu. Doing so should return you to the Hotspot & Tethering page."
    },
    {
      "title": "Tap the white \"Portable Wi-Fi hotspot\" switch .",
      "content": "Tap the white \"Portable Wi-Fi hotspot\" switch . This is at the top of the Hotspot & Tethering page. The switch will turn blue . Your Android should now be outputting a Wi-Fi signal."
    },
    {
      "title": "Open your computer's Wi-Fi settings.",
      "content": "Open your computer's Wi-Fi settings. Click the Wi-Fi icon, which resembles a set of signal bars, in the lower-right corner of the screen. A pop-up window will appear. You may first have to click ▲ here to see the Wi-Fi icon."
    },
    {
      "title": "Click your Android's name.",
      "content": "Click your Android's name. It should be in the pop-up window."
    },
    {
      "title": "Enter the password.",
      "content": "Enter the password. Type in the password that you created during the setup, then click Connect or press ↵ Enter . If you didn't create a password during setup, your hotspot network's password will be listed on the hotspot's page in your Android's Settings. You may need to tap the hotspot's name to view the password."
    },
    {
      "title": "Wait for the network to connect.",
      "content": "Wait for the network to connect. Once your computer connects to the network, you'll be able to browse the Internet as usual."
    }
  ]
}