{
  "url": "https://www.wikihow.com/Avoid-Being-Raped",
  "title": "How to Avoid Being Raped",
  "steps": [
    {
      "title": "Be careful with drinks you receive, especially from someone you don't know.",
      "content": "Be careful with drinks you receive, especially from someone you don't know. When you’re out at a bar or party, you’ll need to take some precautions when accepting a drink from anyone, not just from strangers. It doesn’t matter if you know the person giving you the drink or if they look like an underwear model, it doesn’t necessarily make them safe or sane. Sadly, because you are more likely to be raped by someone you know, you don’t even want to take a drink from a friend in this situation. The only exception is if someone offers you a drink and you watch the bartender pour it and then hand it to you directly. A good person will be understanding about your wanting to be safe. Simply take the drink and talk to them but don’t drink it or thank them for the drink and say something like, “A friend of mine got roofied last year and now I’m just extra cautious.” This doesn’t even have to be true, since people will not usually argue with you on personal experience."
    },
    {
      "title": "Drink with a sober friend if you do decide to drink.",
      "content": "Drink with a sober friend if you do decide to drink. Even just being out with a friend who also drinks can help protect you, as long as you take things seriously and stick together. Take someone you trust and be just as trustworthy to them. The buddy system can not only add fun to your evening, but it can make a real difference in your safety on a large number of levels, not just in preventing rape. Going together can help you defend each other against theft, kidnapping, drunk driving, and other forms of physical harm that can result when you're drunk."
    },
    {
      "title": "Watch the bartender pour your drink.",
      "content": "Watch the bartender pour your drink. No matter if you’re buying your own drink or if someone is getting one for you, you should always watch the bartender pour it. Always. Even if you’re just getting your own drink, if it sits unattended on the counter for even a few seconds, someone could slip something in. Be vigilant."
    },
    {
      "title": "Keep an eye on your drink.",
      "content": "Keep an eye on your drink. You should never take your eye off your drink. Take it with you when you go to the bathroom. Don’t set it down on the table behind you while you show someone how much better you are at pool than they are. Keep it in your hand and clearly visible at all times."
    },
    {
      "title": "Have a ride home.",
      "content": "Have a ride home. Make sure you have a ride home already arranged, so that you don’t have to rely on a stranger or possibly dangerous acquaintance. Get a friend to come and pick you up, have the bartender get you in a cab (alone), or better yet, bring a sober friend with you. Taking a drunk person home is one of the most common techniques of a rapist."
    },
    {
      "title": "Consider safety precautions.",
      "content": "Consider safety precautions. Soon, there will be cups and straws readily available that will change color to alert you that your drink has been drugged. [4] X Research source You might want to also consider other safety precautions. There are many such apps that can set off an alarm, alert your friends that you need help, or help your family keep track of when you’re home safe (as well as a number of other features, available depending on which app you get)."
    },
    {
      "title": "Pay attention when you come home at night.",
      "content": "Pay attention when you come home at night. When you’re coming home at night, look around. Do you see anyone hanging out around your building door? Do you see any suspicious cars in your driveway? [5] X Expert Source Joseph Bautista Self-Defense Specialist, Martial Arts Instructor, & 1st Aid/CPR Instructor Expert Interview. 30 April 2020. If you do, call someone for help, or even just get a friend on the phone and have a conversation with them while you get safely into your home and lock the door. A good friend will understand, even if it’s late."
    },
    {
      "title": "Try not to be alone with people who might hurt you.",
      "content": "Try not to be alone with people who might hurt you. Since you are most likely to be raped by someone that you know, protect yourself by not being alone with someone that might hurt you. Be careful around new friends and other people that haven’t fully earned your trust yet, like neighbors. Don’t go into a neighbor’s house alone or have them over when you’re alone in your home (the same with new friends) until you know them much better."
    },
    {
      "title": "Make your home as safe as possible.",
      "content": "Make your home as safe as possible. Have a safe place that you can go within your home, if you’re worried about threats from your family. Consider putting a lock on your bedroom door, for example, if you have reason to believe that you are under threat from a family member. Of course, if you’re still a minor, you should consult with CPS or the relevant agency where you live if you really believe you are under threat. You should not stay in a home that is not safe. Loving your family is not a good enough reason to put yourself at risk. If you are an adult and feel at risk from your spouse or other family member, you may want to contact a friend or local women's shelter or similar that can take you and your children until the situation is resolved and another solution can be found."
    },
    {
      "title": "Speak up with your family members.",
      "content": "Speak up with your family members. Let your family know when someone makes you uncomfortable or does something bad to you. Many family members would be willing to stand up for you or get you help, but they may not be aware of what is going on. It can be a very scary experience, but any family member that is not willing to believe you or at least investigate further isn’t worthy of your love."
    },
    {
      "title": "Know when to get help.",
      "content": "Know when to get help. To avoid being raped by someone you know, all you can really do is look out for signs of trouble and get out or get help before the situation escalates to rape. For example, an abusive relationship can easily lead to rape. The same can be said of family members. Pay attention to see if they’re grooming you to stay quiet about physical or sexual violence, such as emphasizing the private, special nature of your relationship or trying to teach you that no one trusts you or thinks you’re smart. If you notice behaviors that seem suspicious, dangerous, or make you uncomfortable or afraid, get help . If you are a minor, contact CPS (Child Protective Services), a teacher at your school, a doctor, or other trusted adult. They will help analyze your situation and get you the help you need. If you are an adult in or at risk of an abusive relationship, get help by contacting a local organization or contact a National Domestic Abuse Hotline, for example 1-800-799-7233. You can also contact friends and family members. It’s hard to ask for help, but you will be surprised to find that most people will enthusiastically want to get into a better situation."
    },
    {
      "title": "Try putting up a fight if the attacker approaches you empty-handed.",
      "content": "Try putting up a fight if the attacker approaches you empty-handed. Many rapists think that they can simply overpower a victim and have their way with them. They are arrogant, but they are also wrong. The more you put up a fight, the better chances your attacker will give up and look for an easier target. Don't make yourself an easy target. Try using anything at your disposal to defend yourself — things everyone has, such as nails and fists, or everyday objects, such as umbrellas and rocks, to ward off the attacker. The good news is that, as late as 2001, only 11% of would-be rapists used a weapon during the attempted rape. [6] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source That means 9 out of 10 rapists had no more natural defense than you likely do. Carrying out a rape with a weapon means a lot more prison time. If the rapist is carrying a weapon, follow your instincts and take cues from the rapist. If you survive the sexual assault, you've done the right thing."
    },
    {
      "title": "Use pepper spray — or the threat of it — to deter your attacker.",
      "content": "Use pepper spray — or the threat of it — to deter your attacker. If you've got pepper spray handy, take it out and hold it out at arm's length, aiming for the attacker's eyes while shouting \"I've got pepper spray! I'll use it if I need to!\" If you don't have any pepper spray, you can try putting your hand in your bag and yelling the same threat — \"I've got pepper spray! I'll use it if I need to!\" — trying to outsmart the would-be attacker. Any rapist who's been stung by pepper spray before is very likely to think twice before assaulting you."
    },
    {
      "title": "If you suspect a rapist is following you, don't be afraid to tell them you'll fight back.",
      "content": "If you suspect a rapist is following you, don't be afraid to tell them you'll fight back. An informal sampling of rapists in prison found that many would leave a target alone if she threatened to fight back. Say \"Stay away! I will fight back if you get closer!\" Rapists are looking for easy targets; people talking on their phones while walking, rifling through their bags, etc. If you show them you won't go down without a fight, you could scare them off."
    },
    {
      "title": "Try pinching them where it hurts.",
      "content": "Try pinching them where it hurts. If an attacker wraps their arms around you or is close enough to touch, first try to pinch them in one of two places: inside the upper arm (between the elbow and the armpit) or the upper inner thigh. Pinch hard ; pinch like your life depends on it (because it could!) For context, try pinching yourself in either of these places. It hurts, doesn't it? And you're probably not even pinching as hard as you could."
    },
    {
      "title": "Punch, kick, claw, or otherwise aim for the groin.",
      "content": "Punch, kick, claw, or otherwise aim for the groin. If your attacker is male, a swift blow to the genital area will cause an intense amount of pain, and will dissuade most would-be rapists from following through with their intentions. [7] X Expert Source Joseph Bautista Self-Defense Specialist, Martial Arts Instructor, & 1st Aid/CPR Instructor Expert Interview. 30 April 2020. If your attacker is female, a kick or punch that lands on the vulva or clitoris will also cause considerable pain. A square hit in the groin area often incapacitates the attacker. If they are vulnerable after the groin attack, try punching them at the front of the throat (think Adam's Apple, women are sensitive here too). This is also extremely painful, and should render the attacker useless for enough time for you to get to safety. [8] X Expert Source Joseph Bautista Self-Defense Specialist, Martial Arts Instructor, & 1st Aid/CPR Instructor Expert Interview. 30 April 2020."
    },
    {
      "title": "Stomp on the attacker's toes or bend their fingers back, if possible.",
      "content": "Stomp on the attacker's toes or bend their fingers back, if possible. Really stomp on their toes if you get the chance. If you have access to the attacker's fingers, try bending them back with force. Humans have a lot of nerve-endings in our toes and fingers, making them excellent defensive targets."
    },
    {
      "title": "Learn SING.",
      "content": "Learn SING. This stands for Solar Plexus-Instep-Nose-Groin. First, elbow them in the solar plexus, stomp on their foot as hard as you can, when they let go, punch them or hit them using the palm of your hand in the nose, then knee them in the groin. This may give you enough time to run away. A person's eyes are another good target. [9] X Expert Source Joseph Bautista Self-Defense Specialist, Martial Arts Instructor, & 1st Aid/CPR Instructor Expert Interview. 30 April 2020."
    },
    {
      "title": "Do not immediately clean yourself up.",
      "content": "Do not immediately clean yourself up. The urge to immediately shower or take a bath or otherwise clean yourself will often be very strong, but you should not do this. You are a walking evidence locker, so bag your clothes and get yourself to a hospital so that a rape kit can be taken. This will be vital in supporting your case later if you eventually decide you want to prosecute."
    },
    {
      "title": "Report your rape.",
      "content": "Report your rape. Even if you do not want to prosecute, even if you don’t want anyone to know, even if you feel bad because you know the person, you should report your rape. Reporting is important, even if prosecution never happens, because it can serve as a red flag later if that person rapes again. It’s hard to relive a rape and the process of reporting a rape is rarely easy, but you should do it to protect both yourself and others."
    },
    {
      "title": "Get tested for pregnancy and for STIs or STDs.",
      "content": "Get tested for pregnancy and for STIs or STDs. If you’ve been raped, even if you don’t want to report it or prosecute, you still should absolutely get a pregnancy test if you could be pregnant and get tested for STDs and STIs no matter your gender. This is about protecting your own basic health, since some infections can be stopped in their tracks if intervention comes early."
    },
    {
      "title": "Talk to professionals who can help you.",
      "content": "Talk to professionals who can help you. Again, even if you don’t plan on doing anything in terms of reporting or bringing charges, you should still take precautions for your own health. People who have been raped are at high risk of depression, suicide, drug and alcohol abuse, and other mental health problems [10] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source , especially when they don’t get support. Call a rape crisis center or find and talk to a therapist. Both will be able to help you cope with the feelings that you’re having."
    },
    {
      "title": "Talk to your friends and family if you want to.",
      "content": "Talk to your friends and family if you want to. You’ll have to decide, if you are raped, if you want to talk to your friends and family about it. Studies have shown that support from those close to you can play a huge role in helping you reach “normalcy” again. However, rape is a deeply personal experience and you shouldn’t feel like you have to talk about it if you don’t want to."
    },
    {
      "title": "Stay safe from your attacker.",
      "content": "Stay safe from your attacker. If you are raped by someone you know, which is the most likely scenario, you should do everything in your power to get away from that person. They should not still be in your life. Being constantly exposed to your rapist puts you at higher risk for self-harm, depression, and a repeated attack. If you will not bring charges against them, move away, get a restraining order, or talk to CPS if you are young."
    },
    {
      "title": "Rape is sex while someone is unconscious.",
      "content": "Rape is sex while someone is unconscious. An unconscious person cannot consent to sex. This also applies to sex you can't remember, either because you were blacked out or because you were unconscious. Just because you didn’t have to “experience” it in the traditional sense, doesn’t mean you weren’t raped. Of course, before accusing someone of raping you in this way, you should look really hard at your own choices. Don’t use a serious matter as a cop-out for decision you know you made just because you regret it."
    },
    {
      "title": "Rape is sex while someone is impaired.",
      "content": "Rape is sex while someone is impaired. When someone is drunk, they do not have the ability to consent. They are too unaware of what is going on to really understand what they are doing or agreeing to. Some people may also have been made too affectionate by the alcohol, just like how people on ecstasy will think they love everyone."
    },
    {
      "title": "Rape is anyone having sex with someone against their will.",
      "content": "Rape is anyone having sex with someone against their will. Anyone can be raped, regardless of their gender. In fact, as we discussed above, it might even be just as common in some places as women getting raped. If you were forced into having sex with someone against your will, you were raped and you are entitled to protection under the law."
    },
    {
      "title": "Rape is forced oral sex.",
      "content": "Rape is forced oral sex. Some people believe that rape is only intercourse. However, simply because you are not penetrated in the normal sense does not mean that you weren’t raped. Any unwanted sexual contact is assault and you should report your rape."
    },
    {
      "title": "Rape is forced sex with no weapon present.",
      "content": "Rape is forced sex with no weapon present. Even if there is no weapon present, rape is still rape. The authorities should understand this. The abuser may use many different kinds of fear tactics to keep a victim from putting up a big fight."
    },
    {
      "title": "Rape is unwanted sex without physical resistance.",
      "content": "Rape is unwanted sex without physical resistance. Many victims don’t put up a fight when they are raped, out of fear of physical harm, blackmail, or other consequences. Just because you didn’t fight, doesn’t mean you weren't raped. All that matters is that you said “no”. The authorities will understand your concerns for your safety."
    },
    {
      "title": "Rape is unwanted sex between a married couple.",
      "content": "Rape is unwanted sex between a married couple. Even if two people are married, it doesn’t mean that one person has to have sex with their spouse. This is accepted as law in most countries in the world. If your spouse forced you to have sex, you are entitled to prosecute if you want to."
    },
    {
      "title": "Rape is unwanted or forced sex from someone you used to or are currently dating.",
      "content": "Rape is unwanted or forced sex from someone you used to or are currently dating. Even if you previously had consensual sex or even had consensual sex recently, that does not make all sex consensual between you. You are still protected by law and are entitled to help. All that matters is that you said “no”."
    },
    {
      "title": "Rape is a teacher sleeping with a student.",
      "content": "Rape is a teacher sleeping with a student. We tend to excuse female teacher-male student sex, or sex between a male teacher and a female student that the student encouraged. However, there are lots of reasons why this isn’t as consensual as it may appear, the most important of which is that children cannot consent (even if they’re teenagers). The young brain is not developed enough to comprehend consequences. Even for older teacher-student relationships, it is important to understand that a professor can abuse their position of authority, using it to intimidate a student into sex."
    },
    {
      "title": "Rape is any sex that you don't want.",
      "content": "Rape is any sex that you don't want. At the end of the day, rape is just any sex that you don’t want. People need to understand that no means no. Beyond that, people also need to understand that getting a conscious “yes” is really what they need to be looking for, not just the absence of a no. For the safety of members of all genders, we should all work together to prioritize consent, so that rape becomes as uncommon as possible among all walks of life."
    }
  ]
}