{
  "url": "https://www.wikihow.com/Convince-Your-Parents-to-Let-You-Have-Snapchat",
  "title": "How to Ask Your Parents to Get Snapchat & Ways to Convince Them",
  "steps": [
    {
      "title": "Show them that you are responsible.",
      "content": "Show them that you are responsible. Your parents are not going to let you have Snapchat if you are not responsible. Show your parents that you are well-behaved, and they will trust you more to use Snapchat. Do your chores, do your homework, and help out around the house. This will show your parents that you are responsible and can handle having Snapchat. If you already have another form of social media, such as Instagram or Facebook, don't post anything inappropriate or your parents might not think you are responsible enough for Snapchat. Keep up the good behavior even after you get access to Snapchat. If you start acting up or slacking on your chores, they might not let you use Snapchat anymore, or they might get frustrated that you only started being responsible to get something you want."
    },
    {
      "title": "Find a good time to ask them.",
      "content": "Find a good time to ask them. Make sure to bring up the subject of Snapchat at a good time. Don't ask when your parents are busy or half asleep. Find a good time to ask them when they are not distracted or stressed out. [1] X Research source Good times to ask your parents might be during dinner time or in the car. Start by saying, “Can I talk to you for a minute?” Ratson says to keep the conversation simple, and don't be afraid of asking."
    },
    {
      "title": "Ask them calmly and politely.",
      "content": "Ask them calmly and politely. When you ask your parents if you can have Snapchat, make sure you are calm and polite. Don't whine, cry, or beg. Your parents will be more likely to say no to someone having a tantrum than someone being polite and understanding when they ask. Try saying something like, “Is there any way I can please download the app Snapchat?” Ratson says that when you're asking your parents if you can do something, it's best to have an open conversation about it."
    },
    {
      "title": "Explain why you want it.",
      "content": "Explain why you want it. Have good reasons why you want to have Snapchat. Explain to them how it will help you socialize and be included in friend groups. Talk about how you will use it to get closer to friends and make new connections at school. You can explain to them how it is a great way to stay in touch with people more than regular messaging because you can see what people are doing. Say something like, “Many people at school have the app and I feel left out of conversations and groups because I don't have it. If I have the app I can connect with more people and become closer to other kids at school.”"
    },
    {
      "title": "Explain how you will use it responsibly.",
      "content": "Explain how you will use it responsibly. Your parents might be concerned about Snapchat because of how quickly the pictures disappear. This means that many people use Snapchat to send each other inappropriate photos. Talk to your parents about how you will not send anything inappropriate and that you understand the risk in people taking screenshots of your photos, even though the photos technically \"disappear.\" [2] X Research source For example, you could say “I promise I will be responsible with Snapchat. I won't post or send anything inappropriate. I understand that although the photos disappear, people can still take screenshots of what I send. But I'm only going to use Snapchat with my closest friends.”"
    },
    {
      "title": "Ask them why they are uncomfortable about you having it.",
      "content": "Ask them why they are uncomfortable about you having it. If your parents say no to you, calmly ask them their reasons. Understanding why they don't want you to have the app might help you convince them to let you download it. Ratson says that it's a good idea to understand why your parents might say no, and to use that to influence them to change their minds instead of trying to force them into saying yes."
    },
    {
      "title": "Discuss creating time limits.",
      "content": "Discuss creating time limits. If your parents don't want you to have Snapchat because they are worried about you being on it too much, consider a compromise that includes time limits. Agree to be outside a certain amount of time a day, without your phone. Promise to never use it during class time or after you go to bed."
    },
    {
      "title": "Suggest that they control your friends list.",
      "content": "Suggest that they control your friends list. Letting your parents control your Snapchat friends list might make them feel more comfortable about you having the app. This way they will know you are only talking to people they know and trust. Their rules might be that you can only be friends with kids of the same gender as you on your Snapchat or maybe they only want friends on your Snapchat that they have met. Agree to have “friends list checks” to make sure you are following the rules. [3] X Research source"
    },
    {
      "title": "Explain that random people can't message you on Snapchat.",
      "content": "Explain that random people can't message you on Snapchat. Snapchat only allows you to send and receive messages to your friends in the app as well as contacts on your phone. By default, the \"Friends\" only option is selected. Assure them that you'll only message people you know on the app, and random people can't send you messages out-of-the-blue. Explain to them that they can block people on Snapchat that they are uncomfortable with. [4] X Research source"
    },
    {
      "title": "Agree to not look at the media Snapchat stories.",
      "content": "Agree to not look at the media Snapchat stories. The reason your parents might not want you to have Snapchat is because of the stories from media outlets such as MTV and Buzzfeed. Your parents might be worried about inappropriate content showing up on these stories. Promise to not watch these stories if you get Snapchat."
    },
    {
      "title": "Convince them that you won't feel insecure as a result of the filters.",
      "content": "Convince them that you won't feel insecure as a result of the filters. Sometimes, filters can cause you to feel insecure and wish that you could look perfect. Tell your parents that you are capable of using them, with the understanding that they're not real."
    }
  ]
}