{
  "url": "https://www.wikihow.com/Control-a-TV-with-Your-Phone",
  "title": "How to Control a TV with Your Phone",
  "steps": [
    {
      "title": "Install the Apple TV Remote app from the App Store .",
      "content": "Install the Apple TV Remote app from the App Store . This is a free app that allows you to use your iPhone to control your Apple TV. [1] X Research source"
    },
    {
      "title": "Connect your iPhone to the same Wi-Fi network as the Apple TV.",
      "content": "Connect your iPhone to the same Wi-Fi network as the Apple TV."
    },
    {
      "title": "Turn on your Apple TV.",
      "content": "Turn on your Apple TV. The TV needs to be on so you can pair it with your iPhone."
    },
    {
      "title": "Open the Apple TV Remote app.",
      "content": "Open the Apple TV Remote app. It’s the black icon with a gray Apple and the letters ″tv″ inside. You’ll find it on one of your home screens."
    },
    {
      "title": "Tap Add Apple TV.",
      "content": "Tap Add Apple TV ."
    },
    {
      "title": "Tap your Apple TV.",
      "content": "Tap your Apple TV. In a few moments, a 4-digit code should appear on the TV screen. If you don’t see your Apple TV listed, you may need to restart it. Also, double-check to make sure the iPhone is connected to the same Wi-Fi network as the TV."
    },
    {
      "title": "Type the code into the iPhone app.",
      "content": "Type the code into the iPhone app. Once the code is authenticated, the iPhone and the TV will be paired. If no code appears, the iPhone is already paired with the TV."
    },
    {
      "title": "Use the remote app to control your Apple TV.",
      "content": "Use the remote app to control your Apple TV. You’ll see 5 or 6 different options in the app depending on your model. To get started, tap Menu , and then swipe through your options. When you see something you want to watch, tap it. [2] X Research source"
    },
    {
      "title": "Install the Android TV Remote Control app from the Play Store .",
      "content": "Install the Android TV Remote Control app from the Play Store . This free app lets you use your Android phone as a remote control for your Android TV. [3] X Research source"
    },
    {
      "title": "Connect your Android to the same Wi-Fi network as your Android TV.",
      "content": "Connect your Android to the same Wi-Fi network as your Android TV. This is required so that the phone can communicate with the TV."
    },
    {
      "title": "Open the Android TV Remote Control app.",
      "content": "Open the Android TV Remote Control app. It’s the blue rectangle icon with a round gray dial."
    },
    {
      "title": "Tap your Android TV.",
      "content": "Tap your Android TV. A 4-digit PIN will appear on the TV screen."
    },
    {
      "title": "Type the PIN into the Android app.",
      "content": "Type the PIN into the Android app."
    },
    {
      "title": "Tap Pair.",
      "content": "Tap Pair . The Android phone is now paired with the TV."
    },
    {
      "title": "Use your Android phone to control the TV.",
      "content": "Use your Android phone to control the TV. Tap the house icon to go to the Home menu, and use the arrow buttons to navigate."
    },
    {
      "title": "Install a universal remote app on your iPhone or Android.",
      "content": "Install a universal remote app on your iPhone or Android. Most modern Smart TVs can be controlled with an app on a phone or tablet. If you’re using a popular Smart TV model like a Samsung, Sony, or LG, download the app provided by the manufacturer for best results. If you use Xfinity cable, download the Xfinity TV Remote app from the App Store or Play Store . [4] X Research source"
    },
    {
      "title": "Connect your Android or iPhone to the same Wi-Fi network as the TV.",
      "content": "Connect your Android or iPhone to the same Wi-Fi network as the TV. This is usually required for the devices to communicate."
    },
    {
      "title": "Open the app on your phone.",
      "content": "Open the app on your phone. If there are any sign-in or welcome screens, follow the on-screen instructions until you get to a screen that allows you to select your TV."
    },
    {
      "title": "Tap your TV.",
      "content": "Tap your TV. This initiates the pairing process. A 4-digit code will usually appear on the TV screen."
    },
    {
      "title": "Type the code into the app and tap Pair.",
      "content": "Type the code into the app and tap Pair . Once the code is authenticated, the remote control app will be paired with the TV. You can now control your TV with your phone."
    }
  ]
}