{
  "url": "https://www.wikihow.com/Clean-a-Washing-Machine-Drain",
  "title": "How to Unblock a Clogged Washing Machine Drain",
  "steps": [
    {
      "title": "Shut off the water supply lines and grab some towels.",
      "content": "Shut off the water supply lines and grab some towels. This is unlikely to be a perfectly dry operation, so grab a stack of towels or rags. You’ll probably need a few buckets, too. On the wall behind your washing machine, there should be a set of red and white valves. These supply water to your washing machine. Shut the valves by turning them clockwise as far as they’ll go. [1] X Research source You may need to slide the washer out from against the wall first to access the supply lines."
    },
    {
      "title": "Follow the hose from the back of your washing machine.",
      "content": "Follow the hose from the back of your washing machine. See the plastic hose coming out of the back of your washing machine? That’s the drain hose. It either leads to a wall, where the water drains into a pipe, or it leads to a sink next to your washing machine. [2] X Expert Source Gevorg Grigorian Appliance Repair Expert Expert Interview. 30 July 2020. When identifying where the drain is, you will need to differentiate it from the hot and cold water lines coming into the washer. The hot and cold water lines should be half the size of the drain pipes. They’ll also have valves on them, which won’t be true of the drain pipe and hose."
    },
    {
      "title": "Remove the hose from the machine.",
      "content": "Remove the hose from the machine. Use pliers or channel locks to unlock the round clamp at the base of the hose where it connects to the machine. Then, wiggle the hose out of the machine to remove it. If there’s a zip tie holding the hose to the sink, cut that off to free the hose. [3] X Research source You should be able to look inside of the hose with a flashlight now to see if there’s a blockage. If there isn’t, the problem is either your filter or the drain pipe. If the hose drains directly into a sink, the problem is almost certainly the hose. You’ll snake or use drain cleaner on the hose, not the pipe."
    },
    {
      "title": "Take the hose out of the wall if it drains into a pipe.",
      "content": "Take the hose out of the wall if it drains into a pipe. The hose may be attached to the pipe with a clamp or connector, depending on how it’s set up. Unscrew or release whatever bracket there is. If there is no bracket or connector, simply pull the hose out of the drain. [4] X Expert Source Gevorg Grigorian Appliance Repair Expert Expert Interview. 30 July 2020. If the hose drains into a pipe in the wall, the blockage may be in either the hose or the drain pipe. Snake and use drain cleaner on both. If, after cleaning the drain hose and/or the drain pipe, you still have drainage issues, the problem is likely in the drain filter."
    },
    {
      "title": "Pour hot water down the drain or the hose for a minor clog.",
      "content": "Pour hot water down the drain or the hose for a minor clog. If your washing machine is draining slowly but it is not completely clogged, try simply pouring boiling water down the drain to clear it out. This can release soap buildup and scum that is narrowing your drainage pipe. [5] X Research source If you run your washer on hot most of the time, then this may not work for your drainage problem, as you have been doing this repeatedly. However, if you only run cold cycles, then pouring hot water down the drain may be worth a try. In areas that freeze during the winter, drainage pipes can freeze and get blocked up with ice. If your area is frozen and you think you have a clogged drain, try pouring hot water down the drain to get rid of any ice that may have accumulated."
    },
    {
      "title": "Pour baking soda and vinegar in the drain or hose for a natural option.",
      "content": "Pour baking soda and vinegar in the drain or hose for a natural option. Pour some boiling water down the drain or hose, then sprinkle some baking soda inside the drain or hose. Pour a cup of white vinegar down the drain wait 5-10 minutes. Then, reconnect everything and run a test cycle to confirm the blockage is gone. [6] X Research source This probably won’t work with larger blockages, but it’ll certainly get soap buildup and scum out!"
    },
    {
      "title": "Opt for a commercial drain cleaner for a stronger solution.",
      "content": "Opt for a commercial drain cleaner for a stronger solution. Follow the direction on the label to pour an appropriate amount of cleaner into the drain or hose. Wait for 30-45 minutes to give the cleaner time to break down the blockage. Then, run a test cycle to confirm the problem is gone. [7] X Expert Source Gevorg Grigorian Appliance Repair Expert Expert Interview. 30 July 2020. When buying a commercial drain cleaner, be sure to get one that is safe to use with your specific type of pipes and your type of drainage system. Some strong products that contain sulfuric acid can actually damage PVC pipes and they are generally not good for the environment as well."
    },
    {
      "title": "Place a drain auger at the opening of the drain or hose.",
      "content": "Place a drain auger at the opening of the drain or hose. A drain auger, aka a “snake,” consists of a long, sturdy wire that goes down a pipe to unclog it. There’s a handle at the end that rotates the coil to clear blockages. Place the end of the coil in the opening of the hose or the drain (depending on where you found the blockage). [8] X Expert Source Gevorg Grigorian Appliance Repair Expert Expert Interview. 30 July 2020. The average snake is about 50 to 75 feet (15 to 23 m) long. They work well for a variety of clogs, since they can clear clogs that sit far down in a pipe. For this job, you shouldn’t need to go more than 4–5 feet (1.2–1.5 m) if you’re snaking the drain in the wall. Blockages almost always occur at the J-trap, which is pretty close to the opening in the wall."
    },
    {
      "title": "Snake the drain to remove the blockage and clear the pipe or hose.",
      "content": "Snake the drain to remove the blockage and clear the pipe or hose. Turn the handles of the snake to extend the coil. Keep going until you feel a blockage. Turn the coil a few more times, then pull it out to manually remove whatever you caught on the snake. Do this repeatedly until you no longer feel any resistance where you previously did. [9] X Expert Source Gevorg Grigorian Appliance Repair Expert Expert Interview. 30 July 2020. If you get a lot of resistance from the blockage, it’s okay to use a good bit of force. The snake shouldn’t damage your pipes."
    },
    {
      "title": "Reattach the hose and test it by running a wash.",
      "content": "Reattach the hose and test it by running a wash. Once you’re sure that the clog is gone, put everything back together and reattach the hose to the machine. Attach the drainage hose to the machine, as this is a spot that tends to leak on a washing machine. Run a cycle to confirm the blockage is gone. [10] X Research source Look at the connection point between the machine and the drainage hose for any leaks."
    },
    {
      "title": "Locate the filter on the front or side of the machine.",
      "content": "Locate the filter on the front or side of the machine. Pull your washing machine out away from the wall a little. Then, look around the bottom of the machine on the front and the sides for a panel. This panel contains the pump that pushes water out through the hose, and the filter that blocks large debris from going into the hose. Pry the compartment out to access the filter and the pump. [11] X Expert Source Gevorg Grigorian Appliance Repair Expert Expert Interview. 30 July 2020. On some machines, the filter compartment is on the inside of the machine."
    },
    {
      "title": "Remove the filter and rinse it off with water.",
      "content": "Remove the filter and rinse it off with water. Every make and model looks different, but you should see a thick, round mesh item inside of the compartment. Pull it out of the machine and physically pry out any debris stuck in the mesh. Then, rinse the filter thoroughly under running water to remove all the other debris and gunk. [12] X Expert Source Gevorg Grigorian Appliance Repair Expert Expert Interview. 30 July 2020. You can replace the filter entirely if you prefer, but you can get by with a simple cleaning if the filter isn’t broken."
    },
    {
      "title": "Put the filter back and run a test cycle.",
      "content": "Put the filter back and run a test cycle. The problem should be resolved, so put the filter back over the pump where you found it and close the compartment. Reassemble the hose and the drain if you haven’t already and run an empty wash cycle to confirm you’ve resolved the problem. [13] X Expert Source Gevorg Grigorian Appliance Repair Expert Expert Interview. 30 July 2020. If this doesn’t work, you almost certainly need to replace your filter’s pump. This isn’t a DIY job, so contact an appliance repair person near you."
    }
  ]
}