{
  "url": "https://www.wikihow.com/Clean-a-Wrist-Brace",
  "title": "How to Clean a Wrist Brace",
  "steps": [
    {
      "title": "Read the manufacturer's instructions.",
      "content": "Read the manufacturer's instructions. If there are instructions on how to clean the brace, read them carefully to ensure that you don't damage the fabric or structure. The fabric of your brace needs to remain both strong and flexible in order to support your wrist during daily activities or exercise. [1] X Expert Source Vlad Gendelman, MD Board Certified Physician Expert Interview. 17 July 2020. You can find these instructions on the brace itself or enclosed within the product packaging. Usually these instructions will include specific information about the proper washing temperature, proper chemical detergents, and safe drying techniques."
    },
    {
      "title": "Gather your supplies to prepare for washing.",
      "content": "Gather your supplies to prepare for washing. In order to wash the brace, you’ll need: laundry detergent, a clean cloth, a large bowl, and a colander. Gathering your supplies in advance will save you time and energy. Use only mild detergent, in order to protect the synthetic fibers of your brace and the skin of your hands. You may substitute 1 tablespoon (14.8 ml) of dish soap for laundry detergent. [2] X Research source"
    },
    {
      "title": "Fill the bowl with warm (not hot) water.",
      "content": "Fill the bowl with warm (not hot) water. Most powdered detergents are designed for use with warm water, and warm water is recommended for man-made materials, as it removes stains and dirt with a lower chance of shrinking your brace than hot water. [3] X Research source You can also try a coldwater detergent as a more eco-friendly option, as a number of coldwater alternatives are equally efficient at cleaning fabrics. [4] X Research source"
    },
    {
      "title": "Mix the ingredients together well with a large spoon or whisk.",
      "content": "Mix the ingredients together well with a large spoon or whisk. Make sure that the detergent fully dissolves to avoid leaving residue on the brace, which could damage the fabric quality and irritate your skin."
    },
    {
      "title": "Remove the brace from your wrist.",
      "content": "Remove the brace from your wrist. Move with care and attention to your injury or pain, as your wrist will no longer have the support of the brace."
    },
    {
      "title": "Remove metal splints inside the brace, if necessary.",
      "content": "Remove metal splints inside the brace, if necessary. The chemicals in your detergent may damage or rust the metal components of the brace. Take note of the proper location for the metal splints so that you can replace them correctly after washing."
    },
    {
      "title": "Rub the cleaning solution on the wrist brace using a clean, lint-free cloth.",
      "content": "Rub the cleaning solution on the wrist brace using a clean, lint-free cloth. Using the cloth, instead of just your hand, will reduce your exposure to potentially harsh chemicals and will ensure a more thorough clean. Avoid vigorous rubbing that may damage the fibers of the brace. [5] X Research source Pay attention to small, hidden areas, especially between the finger area, to fully remove dirt and bacteria."
    },
    {
      "title": "Rinse the wrist brace.",
      "content": "Rinse the wrist brace. If your faucet has a sprayer, place the brace in the colander and rinse. If not, submerge the brace in a clean bowl of water and squeeze the water through until clear. [6] X Research source Rinse completely: residue remaining in the brace could irritate your skin. Avoid using running water, as the force of the water may stretch the fabric and reduce its effectiveness. [7] X Research source"
    },
    {
      "title": "Squeeze excess water out of the brace.",
      "content": "Squeeze excess water out of the brace. Avoid \"wringing,\" or twisting while squeezing, in order to prevent damaging the brace. Twisting can pull the fibers of the fabric apart and weaken the brace's support structure. [8] X Research source Lay the brace flat on a dry towel, then gently roll the towel and brace together to remove more water. [9] X Research source Avoid hanging to dry, as the weight of the water may stretch the fabric. [10] X Research source Do not dry the brace in direct sunlight, as the artificial materials of the brace can shrink when exposed to hot temperatures, and the UV rays of the sun may bleach or lighten the colors of the brace."
    },
    {
      "title": "Return the metal strips to the brace when it has completely dried, if necessary.",
      "content": "Return the metal strips to the brace when it has completely dried, if necessary. The synthetic fabric will dry quickly in just a few hours, although be sure check interior of any splint pockets to ensure they are thoroughly dry. Dampness in those slots could damage the metal components and decrease the long-term usability of the brace."
    },
    {
      "title": "Read all labels to ensure the brace can be safely machine washed.",
      "content": "Read all labels to ensure the brace can be safely machine washed. The label should indicate machine temperature and/or cycle setting, such as \"Gentle Cycle.\" [11] X Expert Source Vlad Gendelman, MD Board Certified Physician Expert Interview. 17 July 2020. If the label includes a water temperature, but not a cycle setting, you can assume the regular cycle is appropriate. Consider always using \"Gentle Cycle\" setting in order to protect the fabric fibers from too much agitation in the machine and to extend the life of your brace."
    },
    {
      "title": "Remove the brace from your wrist.",
      "content": "Remove the brace from your wrist. Be sure to move with care and attention to your injury, as your wrist will no longer have the support of the brace. [12] X Expert Source Vlad Gendelman, MD Board Certified Physician Expert Interview. 17 July 2020."
    },
    {
      "title": "Remove the metal splints from the brace.",
      "content": "Remove the metal splints from the brace. This will prevent damage to the metal splint inside the brace that is used for stabilizing and splinting the wrist. Additionally, removing the metal splints will protect the fabric from damage caused by any shifting of the metal components during the agitation cycle. Take note of the proper location for the metal splints so that you can replace them correctly after washing."
    },
    {
      "title": "Secure all fasteners on the brace before washing to prevent damage to the straps or fabric.",
      "content": "Secure all fasteners on the brace before washing to prevent damage to the straps or fabric. Fasteners may catch on other fabrics in the wash or become twisted, which may stretch the brace components and impair the support structure of the brace. Consider putting the brace in a mesh lingerie wash bag or a pillowcase to protect the it and other wash items from becoming entangled or twisted."
    },
    {
      "title": "Wash the brace in warm (not hot) water.",
      "content": "Wash the brace in warm (not hot) water. Most powdered detergents are designed for use with warm water, and warm water is recommended for man-made materials. Avoid using hot water, as it can shrink and damage the brace. You can also try a coldwater detergent as a more eco-friendly option, as a number of coldwater alternatives are equally efficient at cleaning fabrics. [13] X Research source"
    },
    {
      "title": "Use mild detergent that is safe to use on the brace's synthetic materials.",
      "content": "Use mild detergent that is safe to use on the brace's synthetic materials. Strong detergents or bleaches may harm the integrity of the brace and impact the effectiveness of the support. If your brace is particularly malodorous, you can add 1/2 cup of baking soda to the wash to freshen the material and increase the cleaning power of your detergent."
    },
    {
      "title": "Squeeze excess water out of the brace.",
      "content": "Squeeze excess water out of the brace. Avoid \"wringing,\" or twisting while squeezing, in order to prevent damaging the brace. Twisting can pull the fibers of the fabric apart and weaken the brace significantly. [14] X Research source Lay the brace flat on a dry towel, then gently roll the towel and brace together to remove more water. [15] X Research source Avoid hanging to dry, as the weight of the water may stretch the fabric. [16] X Research source"
    },
    {
      "title": "Lay the brace on a flat surface and allow to air dry.",
      "content": "Lay the brace on a flat surface and allow to air dry. Place the brace somewhere shaded, with good air flow, to promote quick drying. [17] X Expert Source Vlad Gendelman, MD Board Certified Physician Expert Interview. 17 July 2020. Do not dry the brace in direct sunlight, as the artificial materials of the brace can shrink when exposed to hot temperatures, and the UV rays of the sun may bleach or lighten the colors of the brace."
    },
    {
      "title": "Return the metal splints to the brace when it has completely dried, if necessary.",
      "content": "Return the metal splints to the brace when it has completely dried, if necessary. The synthetic fabric will dry quickly in just a few hours, although be sure check interior of any splint pockets to ensure they are thoroughly dry. Dampness in those slots could damage the metal components and decrease the long-term usability of the brace."
    }
  ]
}