{
  "url": "https://www.wikihow.com/Babysit-an-Infant",
  "title": "How to Babysit an Infant",
  "steps": [
    {
      "title": "Have a fill-in form ready for the parents.",
      "content": "Have a fill-in form ready for the parents. It should include parent emergency contact info, what to feed the baby, the baby's allergies, and other stuff you should know in case of an emergency. [1] X Research source You can find one online or make your own if you prefer."
    },
    {
      "title": "Check on the baby right away if the baby is crying.",
      "content": "Check on the baby right away if the baby is crying. Crying is one of the only ways that babies can communicate their needs. If they do start crying, it's usually because they're tired; hungry; have a wet or dirty diaper; or they're feeling frustrated, scared, or bored. [2] X Expert Source Denise Stern Parenting Specialist Expert Interview. 19 February 2021. It can be hard to know why a baby is crying at first. With practice, though, you may be able to tell what the baby needs just by the sounds of their cries. [3] X Expert Source Jessie Davidson Child Care Specialist Expert Interview. 11 June 2021. Start by checking the baby's diaper and offering them a bottle. [4] X Expert Source Denise Stern Parenting Specialist Expert Interview. 19 February 2021. You can also try offering them a pacifier if they use one. However, never try to force a pacifier into a baby's mouth. [5] X Expert Source Jessie Davidson Child Care Specialist Expert Interview. 11 June 2021. If the baby is teething, offer them a teething ring. [6] X Expert Source Jessie Davidson Child Care Specialist Expert Interview. 11 June 2021. Rock or soothe the baby if they're still upset. Sometimes, babies just need to be physically comforted when they're crying. [7] X Expert Source Jessie Davidson Child Care Specialist Expert Interview. 11 June 2021."
    },
    {
      "title": "Change the baby's diaper if it's dirty or wet.",
      "content": "Change the baby's diaper if it's dirty or wet. If the baby starts crying, check his or her diaper. [8] X Expert Source Jessie Davidson Child Care Specialist Expert Interview. 11 June 2021. If there is poop, or if the diaper is wet, the diaper needs to be changed. Get a fresh diaper before undoing the old one. To change a diaper, get out baby wipes, a fresh diaper, and something to keep the baby occupied while you change it. Wash your hands to avoid spreading germs, dirt, and bacteria, to the baby's fragile bottom. First, undo the diaper. Second, if the baby is male, place a clean diaper over his private area. If the baby is female, make sure to wipe front to back so you don't spread bacteria. Third, wipe the baby with as many wipes as you need, making sure to get into all the creases. Last, lift the baby's feet, remove the soiled diaper, and slide on a clean one. Latch the diaper, pattern side on the front. Wash your hands again, to wash off any pee or poop and to kill germs and bacteria so that they don't spread to other places in the house. Make sure that the baby's hands and feet are clean and free of any pee or poop after the diaper change. [9] X Research source"
    },
    {
      "title": "Give them a bottle if they're hungry.",
      "content": "Give them a bottle if they're hungry. [10] X Expert Source Denise Stern Parenting Specialist Expert Interview. 19 February 2021. If the baby is still crying or doesn't have a dirty diaper, that often means that the baby is hungry. [11] X Expert Source Jessie Davidson Child Care Specialist Expert Interview. 11 June 2021. So you will have to find the bottle and heat up the milk that the mother has told you to use. Remember, use one scoop of the formula for every two ounces and shake well. Then heat. Do not heat a bottle up in a microwave--microwaves can cause pockets of scalding hot milk and leave some parts unheated. Place the bottle in a pot on the stove and heat the water. After heating up the bottle, make sure the bottle cap is securely fastened and shake the bottle well. Then squirt some of the milk onto the meat of your wrist and if the milk is too hot, continue to shake the bottle until the milk isn't too hot anymore. Once the milk is ready for the baby to drink, prop the baby up and gently stick the rubber nipple into the baby's mouth. Do not point the nipple straight down because the baby could choke. Take breaks between sips. During breaks, sit the baby up and gently pat his/her back right between their shoulder blades. The baby will usually burp. [12] X Research source"
    },
    {
      "title": "Offer solid food to the baby if the parents ask you to.",
      "content": "Offer solid food to the baby if the parents ask you to. Babies shouldn't eat solid food until they're at least 6 months old. If you have been asked to feed the baby solid food, usually you will need to feed him/her cereal or baby food. If the baby food is too watery, mix in a tablespoon of baby rice, if it has been approved by the parent. Next, put a bib on the baby and place them in their high chair. Never leave the baby unattended in the chair. Fill a small spoon halfway with baby food, and gently put the spoon in the mouth. Do not force in the spoon. If it gags on the food or dodges the spoon, it is probably full. [13] X Research source"
    },
    {
      "title": "Play with the baby.",
      "content": "Play with the baby. No matter when you babysit there will always be a little time for play unless it is only in the night. This should be gentle and at the baby's pace. Keep small objects away from the baby and be sure to watch what he or she puts into the mouth. The feet are okay! Hold a baby toy a few inches away from their face. Try moving the toy back and forth. Younger infants will watch the toy with their eyes, older infants will actually reach and grab the toy. Dance! Cradle the baby in your arms and gently move from side to side and sway to the music. Any music will do as long as it is not loud or inappropriate. Avoid this right after eating; wait about a half an hour after eating before trying this activity. Action rhymes and games are fun. Try \"Hickory Dickory Dock.\" Move your fingers up the baby's body while you say the rhyme. Pinwheels are nice. Hold the pinwheel 6 inches away from the baby's face. Blow on it and watch the pretty colors! If the infant has an activity quilt that they can lay on, an activity gym, a baby bouncer, or a baby swing, lay them or sit them in one of these. Try pointing out the toys and activities, and encouraging interaction. Gently bounce or swing a baby if they are in a swing or bouncer, this calms them and helps them learn the difference between cause and effect, trust, and body awareness."
    },
    {
      "title": "Try singing songs or playing soft music.",
      "content": "Try singing songs or playing soft music. Music can be really soothing to babies, and it may help settle them if they're upset. [14] X Expert Source Jessie Davidson Child Care Specialist Expert Interview. 11 June 2021. Try \"Twinkle, Twinkle, Little Star\" or \"An Itsy Bitsy Spider.\" Look into the infant's eyes as you sing."
    },
    {
      "title": "Take a walk.",
      "content": "Take a walk. Avoid a walk if it is over 85 degrees out, or if it is below 30 degrees. Also, avoid a walk if it is around the time when mosquitoes are high. Place the infant in a stroller and strap them in for safety. Slowly walk and push the stroller. Point out items in nature such as: \"Look! There's a duck!\" Let baby feel items outside such as the cold snow or tickle grass on their tummy or feet. Read books. Books for infants should be cloth or board books to avoid infants from chewing up the pages or tearing them out. Many bright pictures with little text are usually best. When the infant starts to lose interest, stop reading, even if you are in the middle of the book, and move on to something else. Books with different textures in them are also great for babies. Try mirrors! Use unbreakable mirrors made for children. Hold the mirror in front of the baby and let them see themselves for a while. Then, sit them on your lap and hold the mirror in front of both of you. Make faces such as silly, a frown, a smile, and twitching your nose."
    },
    {
      "title": "To bathe the baby, fill the tub up 1/4 way with lukewarm water.",
      "content": "To bathe the baby, fill the tub up 1/4 way with lukewarm water. Then, gently lift the infant under its arms and bottom, and place it in the tub. Do not lay the baby down! Next, with a washcloth, pat on infant safe body wash. Still, be sure to get into every roll and crease. Rinse, but do not pour water over his/her face. Next, to wash the baby's head, do the same, but very, VERY gently. Rinse with a washcloth. When you are finished, dry the baby with a soft towel, and apply lotion. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Put on a new diaper as you did before and then put the baby's pajamas on.",
      "content": "Put on a new diaper as you did before and then put the baby's pajamas on. Let the baby drink more milk. Then pat the baby to make it burp."
    },
    {
      "title": "Rock the baby gently.",
      "content": "Rock the baby gently. All babies are different, and not all like to go to sleep the same way, but most like to be gently rocked. Try holding the baby in your arms and slowly swinging the baby back and forth, or holding the baby securely while walking around with a bouncy step, or rocking in a rocking chair. [16] X Expert Source Jessie Davidson Child Care Specialist Expert Interview. 11 June 2021. If the baby won't go to sleep, gently lift the baby up and lay the baby in its crib. Never leave a baby in its crib on its back with its bottle in its hands because the baby could choke. After the baby is asleep, sit in the baby's room with it and wait to make sure the baby will stay asleep, and that the baby's sleep environment is safe. Make sure there is nothing that the baby could play within the crib. It could distract the baby and it won't want to go to sleep. Also, soft toys should never be in a crib, because a baby could suffocate. Keep big, fluffy blankets or pillows out of the crib. Babies don't really need them and they are actually dangerous. Keep bed covers away from baby's face. [17] X Research source Do not lie a baby on its tummy, ever, even if the parent tells you to. Always place it on its back. Placing it on its tummy is very dangerous, and potentially fatal. (If the baby is old enough to flip itself over on its tummy by itself, though, it's okay if he flips himself over). [18] X Research source"
    },
    {
      "title": "Check on the baby.",
      "content": "Check on the baby. Keep checking on the baby as it sleeps. This is very important as it is your babysitting duty to make sure that the baby is safe, is not fussing, is not too hot or cold and does not have a dirty diaper. Baby monitoring is fine if the parents are fine with it, if they don't have a baby monitor, or grant you permission to use them, check on them every 15 minutes."
    }
  ]
}