{
  "url": "https://www.wikihow.com/Can-You-Use-Afterpay-on-Amazon",
  "title": "How to Use Afterpay on Amazon: 2 Tried & True Workarounds",
  "steps": [
    {
      "title": "Open the Afterpay app.",
      "content": "Open the Afterpay app. You can use the Afterpay app to shop directly on Amazon, and you can pay with a single-use payment. Single-use payments are currently not available on Afterpay.com. [1] X Research source Single-use payments allow you to shop at retailers like Amazon that don't normally take Afterpay while still letting you pay in installments over six weeks, interest free."
    },
    {
      "title": "Navigate to the Shop tab and select Amazon.",
      "content": "Navigate to the Shop tab and select Amazon."
    },
    {
      "title": "Shop on Amazon and add products to your cart.",
      "content": "Shop on Amazon and add products to your cart. Simply shop on Amazon like you normally would through the Afterpay app. If you're not already logged in, Amazon will prompt you to do so now."
    },
    {
      "title": "Check out when you're ready.",
      "content": "Check out when you're ready. Confirm your contact details and shipping address."
    },
    {
      "title": "Select Add a credit or debit card at the payment screen.",
      "content": "Select Add a credit or debit card at the payment screen. The Buy now, pay later button at the bottom of the screen will activate. If you've used other payment methods on your Amazon account before, you will need to tap Payment method , then + Add new in the upper right-hand corner to see the Add a credit or debit card option. Ensure the default payment method box isn't checked. If it is, Amazon will try to use the single-use payment details for your next purchase, and it will be declined."
    },
    {
      "title": "Tap the Buy now, pay later button.",
      "content": "Tap the Buy now, pay later button. Follow the on-screen prompts to enter your purchase amount including shipping and taxes and confirm the payment schedule. Afterpay will auto-fill the single-use payment details into the credit/debit card section on Amazon. If some of the info does not autofill, tap the Autopay button at the bottom of the screen and select Retry card details ."
    },
    {
      "title": "Tap the yellow Add and continue button at the bottom of the screen.",
      "content": "Tap the yellow Add and continue button at the bottom of the screen."
    },
    {
      "title": "Place your order.",
      "content": "Place your order. Your down payment will be authorized and the Amazon order will show up in your Afterpay app's Orders tab."
    },
    {
      "title": "Remove the single-use payment details from Amazon.",
      "content": "Remove the single-use payment details from Amazon. Once the order has been processed you can safely remove the payment details from your Amazon account to prevent using it again in the future, which will cause the order to decline."
    },
    {
      "title": "Go to the Afterpay website.",
      "content": "Go to the Afterpay website. You can buy gift cards on Afterpay, which can then be used like cash at their respective retailers. Afterpay sells Amazon gift cards for denominations between $5 and $500. Amazon gift cards may not be available to you if you're a brand new customer, if you haven't consistently repaid on Afterpay previously, or if you're not in Pulse Rewards. Amazon gift cards may also not be available in every market at all times. [2] X Research source"
    },
    {
      "title": "Purchase an Amazon gift card in your desired amount.",
      "content": "Purchase an Amazon gift card in your desired amount. The gift card will be delivered digitally via your email."
    },
    {
      "title": "Go to Amazon and shop.",
      "content": "Go to Amazon and shop. Place items in your cart like you normally would."
    },
    {
      "title": "Check out with your chosen items.",
      "content": "Check out with your chosen items. Proceed through the payment screen like you normally would."
    },
    {
      "title": "Input the Amazon gift card information when asked for payment details.",
      "content": "Input the Amazon gift card information when asked for payment details. Choose Enter a gift card or promotional code at the payment method screen. This is where you should enter the gift card number."
    },
    {
      "title": "Complete the order.",
      "content": "Complete the order. Amazon will process and ship your order, while you will be responsible for paying off the amount of the gift card to Afterpay."
    }
  ]
}