{
  "url": "https://www.wikihow.com/Clean-Your-Dog%27s-Ears-During-a-Yeast-Infection",
  "title": "How to Clean Your Dog's Ears During a Yeast Infection",
  "steps": [
    {
      "title": "Contact your veterinarian if your dog has symptoms of an infection.",
      "content": "Contact your veterinarian if your dog has symptoms of an infection. If you suspect that your dog has a problem with its ears, you should have it looked at by a vet. They will look in the ears and they may do diagnostic tests to determine what kind of infection is present. The common symptoms of a yeast infection in the ears include: Thick, dark brown or black discharge from the ears [2] X Research source Rubbing or scratching the ears Red, irritated skin Scaly skin Head shaking Rancid smelling ears History of allergic skin disease"
    },
    {
      "title": "Follow your veterinarian’s recommendations for treatment.",
      "content": "Follow your veterinarian’s recommendations for treatment. The veterinarian will either diagnose your dog based on the smell and the amount of thick brown wax in your dog’s ears, or they will look at the wax under a microscope to determine the cause. Once they recognize it’s an infection, they will tell you how to treat the condition. Follow their recommendations, which, for a yeast infection, usually include cleaning the ears, applying medication, and watching for changes in the dog’s symptoms. If your dog’s condition is not severe, your vet may simply suggest that you clean your dog’s ears daily. If the condition is severe, meaning the infection likely won’t clear up on its own, your vet will likely prescribe you medication."
    },
    {
      "title": "Put topical medication in your dog’s ears.",
      "content": "Put topical medication in your dog’s ears . If your vet prescribes a topical antifungal ointment or cream, apply it according to the directions you are given. In most cases, you will apply it in the ear once or twice a day right after cleaning the area. Massage the ear canal right after application to ensure that the medication is spread around the inner ear. [3] X Research source If your vet gave you drops, you will hold the ear open by holding the tip of the ear with one hand. Then use your other hand to drop the designated amount of drops into the ear canal. If your vet gives you an ointment, put the amount recommended in the instructions on your finger. Hold the ear open by the tip with your other hand and then put the ointment in the ear canal with your finger. Wash your hands right after application. Medications you may be prescribed for your dog include clotrimazole, nystatin or thiabendazole, among others. [4] X Research source"
    },
    {
      "title": "Give your dog a systematic medication if topical medication doesn’t work.",
      "content": "Give your dog a systematic medication if topical medication doesn’t work. If you have treated your dog’s infection, cleaning the ears and putting medication in the ears, and your dog’s yeast infection won’t go away, contact your vet again. They may prescribe a systemic anti-fungal medication, such as ketoconazole, itraconazole, or fluconazole. [5] X Research source These medications are usually only given if the infection is advanced or won’t go away after weeks of another type of treatment. Your vet may prescribe other medications to fight against underlying conditions that weaken the immune system, such as allergies. This way, your dog will be less likely to develop yeast infections."
    },
    {
      "title": "Purchase a cleanser made specifically for cleaning dog ears.",
      "content": "Purchase a cleanser made specifically for cleaning dog ears. Go to your local pet supply store and purchase a cleaner that says it can be used in the ears. These products can be put into the ear canal without damaging the eardrum or other parts of the ear. [6] X Research source Ask your veterinarian about what products will work best for your dog. They may have a prescription product that will be very effective at cleaning the ears."
    },
    {
      "title": "Position your dog in front of you and hold it still.",
      "content": "Position your dog in front of you and hold it still. In order to get your dog’s ears clean without injuring it, you need to keep the dog still. If you have a small dog, put it on your lap facing out. If you have a large dog, put it in front of you on the ground while you sit in a chair and hold it still. [7] X Research source It can be difficult for a dog to put up with having its ears cleaned. If your dog doesn’t like the procedure, you may need someone else to help you hold your dog while you do it."
    },
    {
      "title": "Put drops of cleaning solution into your dog’s ears.",
      "content": "Put drops of cleaning solution into your dog’s ears. With one hand, gently pull up the flap of your dog’s ear to open up the ear canal. With your other hand, drop the cleaning solution liquid into the dog’s ear canal. Hold your dog still while they drain down into the ear. [8] X Research source Follow the directions on the packaging of the cleaning solution, including how many drops to put in each ear. In many cases, you will put in enough drops to fill the ear canal."
    },
    {
      "title": "Remove the liquid with cotton balls or pads.",
      "content": "Remove the liquid with cotton balls or pads. Place a cotton ball or cotton pad over the opening of your dog’s ear. Lean the dog’s head toward the cotton ball or pad so that the cleaning solution comes out of the ear canal and onto the cotton. [9] X Research source Leave the dog’s head tilted for a few seconds to give time to let the moisture drain. Leaving moisture in your dog’s ear can exacerbate the infection, even if the moisture is an ear-cleaning solution."
    },
    {
      "title": "Clean each of your dog’s ears once or twice a day.",
      "content": "Clean each of your dog’s ears once or twice a day. In order to eliminate the fungal infection, you will need to keep your dog’s ear really clean. Use the cleanser daily, even if the condition appears to be improving, until all of the symptoms are gone. [11] X Research source"
    },
    {
      "title": "Check your dog’s ears weekly for discharge, odor, or swelling.",
      "content": "Check your dog’s ears weekly for discharge, odor, or swelling. Part of keeping your dog healthy is assessing its body for health problems on a regular basis. Lift its ears and look inside the ear canal for symptoms of an infection. If you see small amounts of redness, peeling, or excessive dirt or debris, your dog should have its ears cleaned."
    },
    {
      "title": "Dry your dog’s ears after they get wet.",
      "content": "Dry your dog’s ears after they get wet. Moisture in your dog’s ears can promote the growth of yeast. To keep this from happening, use a towel or cotton ball to remove as much moisture as possible after your dog has been swimming or has gotten its head wet otherwise. [12] X Research source Use a clean towel when you dry your dog's ears. Using a dirty towel can introduce fungus or bacteria into the ear canal, instead of keeping it clean."
    },
    {
      "title": "Trim fur out of your dog’s ears.",
      "content": "Trim fur out of your dog’s ears. If your dog has fur in its ears, trimming it away will help prevent an infection because less dirt and bacteria will be able to stay in the ear canal. Either ask your groomer to clear out the fur in the ears when you get your dog groomed or do it yourself with grooming tools. Removing the fur in the ears will allow your dog to keep their ears cleaner and will allow you to inspect the state of their inner ear more easily. Be wary of plucking hair from your dog’s ears since it could cause inflammation, which can weaken your dog’s skin and make it vulnerable to a secondary infection. Talk with your vet to determine the best course of action."
    },
    {
      "title": "Clean the ears of dogs with floppy ears on a regular basis.",
      "content": "Clean the ears of dogs with floppy ears on a regular basis. Dogs with big floppy ears are more prone to ear infections. The flap of the ear keeps dirt and debris in the ear canal and the ear being covered makes the canal more moist and humid, which encourages the growth of yeast. This does not mean that a dog without floppy ears can’t get a yeast infection. It is just less likely."
    }
  ]
}