{
  "url": "https://www.wikihow.com/Clean-Rusty-Snowboard-Edges",
  "title": "How to Clean Rusty Snowboard Edges",
  "steps": [
    {
      "title": "Prop your snowboard on top of a vise or other support.",
      "content": "Prop your snowboard on top of a vise or other support. Place your board in a large, open workspace, where you have plenty of room to inspect and tune up the edges. You don’t need to secure or fasten anything in place—just set your board binding-side-down on top of the table vises, so you can easily reach and polish your board edges. [2] X Research source It’s okay if you don’t have table vises! Two stacks of books can also get the job done while you work. You can also prop up your snowboard on 2 wood blocks. [3] X Research source"
    },
    {
      "title": "Glide a towel along your edges to find rust and burrs.",
      "content": "Glide a towel along your edges to find rust and burrs. Grab a basic hand towel and slide it slowly along your board’s edges. Feel for any sharp edges or sections—these are sure signs of burrs or rust spots. [4] X Research source The burrs will snag and pull off small fibers from your towel, which will make them easy to find again on your board."
    },
    {
      "title": "Smooth away burrs with a diamond stone and rubbing alcohol.",
      "content": "Smooth away burrs with a diamond stone and rubbing alcohol. Spritz rubbing alcohol on the surface of a diamond stone—this is a rough, sandpaper-like stone that helps buff your edges. Hold the diamond stone parallel to the board, dragging it along the metal edge. Move in smooth motions, working from tip to tail as you sand away the burs. Don’t place the stone flush with the edge—instead, keep it parallel as you work, so you can really focus on smoothing out the metal. [5] X Research source You can find diamond stones online, or at most sports goods stores. These are great for smoothing away imperfections from the sides of your snowboard."
    },
    {
      "title": "Drag a gummy stone from tip to tail along the sides of the board.",
      "content": "Drag a gummy stone from tip to tail along the sides of the board. Grab a gummy stone—this is a firm, abrasive, eraser-like stone that will work away some of the rust on your board. [6] X Research source Hold the ends of the gummy stone with both hands, placing it snugly along the thin edge of your board. Run the gummy stone down your board’s edge from tip to tail, working away any rust as you go. [7] X Research source If you don’t have a gummy stone, use fine- or medium-grit sandpaper instead. [8] X Research source If you have really extensive rust, a flat file can get the job done. Place the file flat on top the board and drag it back and forth along the edge, moving from tip to tail. [9] X Research source"
    },
    {
      "title": "Sand down the side edges with a diamond stone once again.",
      "content": "Sand down the side edges with a diamond stone once again. Grab your diamond stone again, placing it flush on the board’s edge. Don’t press on the stone—instead, hold it at a slightly upward angle, using your fingers to guide the stone along the edge. [10] X Research source This prevents the diamond stone from damaging the rest of the board."
    },
    {
      "title": "Go over the edges 1 more time with the gummy stone.",
      "content": "Go over the edges 1 more time with the gummy stone. Pick up your gummy stone and place it directly on board’s edge again, just like you did before. Move the gummy stone from tip to tail to get rid of any pesky, leftover rust from your board. [11] X Research source"
    },
    {
      "title": "Wipe down your board with a clean rag and some rubbing alcohol.",
      "content": "Wipe down your board with a clean rag and some rubbing alcohol. Spritz a clean towel with rubbing alcohol and drag it along the edges of your snowboard. Wipe away any small bits of metal that’ve collected on your board, so your equipment is nice and clean. [12] X Research source"
    },
    {
      "title": "Bring your snowboard inside instead of leaving it out in the snow.",
      "content": "Bring your snowboard inside instead of leaving it out in the snow. Water and rust are best friends—so, when you leave your snowboard outside, you’re really exposing it to a lot of frozen water and potential rust. Instead, place in a clean, dry area so rust doesn’t form on your board over time. [13] X Research source"
    },
    {
      "title": "Dry off your snowboard each time you use it.",
      "content": "Dry off your snowboard each time you use it. Keep a clean towel handy whenever you go snowboarding. Wipe down your entire board so there’s no leftover moisture, which is a recipe for rust. [14] X Research source If you drive out to the slopes a lot, keep a clean towel stashed somewhere in your car."
    },
    {
      "title": "Wax your snowboard",
      "content": "Wax your snowboard when you put it away for the season. Grab a clean towel and wipe away any leftover moisture from the slopes. Melt a cube of snowboard wax over the surface of your board before putting it away for good. Don’t scrape it off until next winter—this will keep your equipment protected during the warmer months. [15] X Research source"
    },
    {
      "title": "Don’t keep your snowboard on the top of your car.",
      "content": "Don’t keep your snowboard on the top of your car. When you drive to the slopes, keep your snowboard inside your car instead of on top of it. Although car racks are convenient, they’ll expose your board to a lot of wetness, open air, and road salt. [16] X Research source"
    }
  ]
}