{
  "url": "https://www.wikihow.com/Celebrate-Cinco-De-Mayo",
  "title": "How to Celebrate Cinco de Mayo in a Respectful Way",
  "steps": [
    {
      "title": "Cinco de Mayo celebrates Mexico's victory at the Battle of Puebla.",
      "content": "Cinco de Mayo celebrates Mexico's victory at the Battle of Puebla. Emperor Napoleon III, eager to establish a French stronghold in Mexico, commanded the French Army to start marching toward Mexico City. He sent a fleet ahead to attack, but the French army never made it there. A young Mexican general named Ignacio Zaragoza engaged the French troops at the city of Puebla and defeated them. This battle took place on May 5, 1862. [1] X Research source Cinco de Mayo celebrates Mexico's victory at the (first) battle of Puebla. It was a major morale boost for Mexico, but it didn’t end the war. Battles continued and the French invasion succeeded the following year. Cinco de Mayo isn’t an official Mexican holiday, but Mexicans do commemorate the date. The victory in battle is the primary reason for celebration in Mexico. In the United States, Cinco de Mayo focuses more on celebrating Mexican culture in general. American celebrations began in 1863 as a show of solidarity with Mexico against the French. [2] X Research source"
    },
    {
      "title": "Avoid cultural appropriation and negative stereotypes to be respectful.",
      "content": "Avoid cultural appropriation and negative stereotypes to be respectful. Celebrating Cinco de Mayo can be a beautiful and rich cultural experience. However, make the holiday about the history and avoid anything that reinforces racial or cultural stereotypes. Things to avoid: Wearing any type of “Mexican” costume (sombreros, ponchos, etc.) Wearing a fake mustache Speaking in a fake Mexican accent Using this as an excuse to drink margaritas and do tequila shots"
    },
    {
      "title": "The colors red, green, and white represent Mexico’s national flag.",
      "content": "The colors red, green, and white represent Mexico’s national flag. You can incorporate those colors using streamers, balloons, flags, garlands, banners, tissue poms, and any other Cinco de Mayo party décor that you like! Because Cinco de Mayo festivals and parades tend to be very colorful, feel free to work in other vibrant colors like orange and yellow. [3] X Research source Avoid stereotypical décor since that can come off as offensive. For example, decorating with sombreros and ponchos isn’t respectful (and neither is wearing them). [4] X Research source"
    },
    {
      "title": "Order Mole Poblano for a true Cinco de Mayo experience.",
      "content": "Order Mole Poblano for a true Cinco de Mayo experience. Mole Poblano originated in Puebla, where the battle against the French took place. Find an authentic Mexican restaurant in your area, preferably one owned by Mexican-Americans that boasts an authentic Mexican chef, and order their Mole Poblano. If they don’t have that specific dish, try any Mole dish they have on the menu. [5] X Research source Mole is a gravy-like sauce used as a filling and a topping in Mexican Cuisine. Mole recipes vary widely across different Mexican regions. Celebrate in the workplace by ordering food from an authentic Mexican restaurant."
    },
    {
      "title": "Keep it simple with foods like tacos, guacamole, pico de gallo, flan, empanadas, horchata, and salsa.",
      "content": "Keep it simple with foods like tacos, guacamole, pico de gallo, flan, empanadas, horchata, and salsa. There’s so much more to Mexican cuisine than these familiar dishes, but there’s nothing wrong with enjoying them as a way to celebrate Mexican culture! They’re delicious, kid-friendly, and a snap to whip up. Tortilla chips and salsa is another family favorite. Make guacamole with avocado, onion, serrano pepper, and cilantro. Whip up some tasty tacos . If you’re a vegetarian, feel free to omit the beef. Try an easy enchilada recipe for your family to enjoy."
    },
    {
      "title": "Mariachi music is one popular type of traditional Mexican music.",
      "content": "Mariachi music is one popular type of traditional Mexican music. If you’re able to get out and enjoy traditional Mexican music in a live setting, that would be a great way to celebrate! Mariachi music is a popular option, but there are two other types of traditional Mexican music you can explore: Norteño and Banda. [6] X Research source You might tune in to a radio station or look up Spotify playlists that showcase traditional Mexican music. Mexican-American musician Selena was known as the Queen of Tejano. If you aren’t sure where to start, or if you prefer music with a pop influence, you might look up some of Selena’s tunes. [7] X Research source"
    },
    {
      "title": "You’re more likely to find large celebrations in bigger cities.",
      "content": "You’re more likely to find large celebrations in bigger cities. This is especially true in cities where there’s a large Mexican-American population (Denver, Chicago, Portland, etc.) [8] X Research source If your area hosts a festival, go soak up the culture! There will likely be traditional Mexican music, dancing, and plenty of delicious food. [9] X Research source Fiesta Broadway in Los Angeles is one of the largest Cinco de Mayo celebrations in the world. If you’re within driving distance, this event would definitely be worth a road trip."
    },
    {
      "title": "See if local cultural centers are hosting educational events.",
      "content": "See if local cultural centers are hosting educational events. Local art galleries and museums may have special exhibits up during Cinco de Mayo. You can also see if any visiting Mexican artists or educators are giving public lectures, showcasing artwork, and so on. A quick internet search can help you find local venues and educational events."
    },
    {
      "title": "Cinco de Mayo is a great time to introduce children to Mexican culture.",
      "content": "Cinco de Mayo is a great time to introduce children to Mexican culture. Young children may not be able to grasp all the battle details, so focus on celebrating culture instead. Sharing a few cool facts with them can be the start of their cultural exploration. Pick simple facts that children can easily understand. For example: Mexico City is the oldest city in North America and Mexico’s capital. Chocolate is from Mexico. The cacao plant was first cultivated there. The dahlia is Mexico’s national flower. [10] X Research source"
    },
    {
      "title": "If you’re a book person, this is a great way to celebrate.",
      "content": "If you’re a book person, this is a great way to celebrate. There’s so much beautiful Mexican literature and poetry out there, from the classics to more contemporary writers. You can always do your own Google search to browse specific genres, but here are a few great books to get you started: Like Water for Chocolate by Laura Esquivel The Labyrinth of Solitude by Octavio Paz The Death of Artemio Cruz by Carlos Fuentes Guardian Devil by Xavier Velasco [11] X Research source"
    }
  ]
}