{
  "url": "https://www.wikihow.com/Build-a-Picnic-Table",
  "title": "How to Build a Picnic Table",
  "steps": [
    {
      "title": "Purchase durable lumber for the project.",
      "content": "Purchase durable lumber for the project. Treated southern yellow pine is a strong but relatively inexpensive choice for the table. You can also try woods like red cedar, Douglas fir, or redwood. Premium lumber, or even a synthetic material made from recycled plastics, leads to a higher quality table. To make an average-sized table, buy: [1] X Research source 15 boards that are 2 × 6 × 72 in (5.1 × 15.2 × 182.9 cm). [2] X Research source 7 boards that are 2 × 4 × 30 in (5.1 × 10.2 × 76.2 cm)"
    },
    {
      "title": "Wear safety goggles and a dust mask while working with the wood.",
      "content": "Wear safety goggles and a dust mask while working with the wood. Building the table involves a lot of cutting, drilling, and sawdust. Taking the proper safety precautions will protect your health in the long run. Also, wear earmuffs to protect your hearing while operating saws. Avoid wearing long clothing, jewelry, or gloves that can get caught by a saw blade."
    },
    {
      "title": "Measure and cut the 2 in × 6 in (5.1 cm × 15.2 cm) with a circular saw.",
      "content": "Measure and cut the 2 in × 6 in (5.1 cm × 15.2 cm) with a circular saw . The longer boards form the tabletop, seats, and table legs. Use a speed square and a pencil to measure out the cuts. A speed square is like a combination of a ruler and protractor. Hold it against the board to trace straight lines and angles. You can also use a miter saw to trim the boards to size. [3] X Research source Cut 5 of the boards to be 6 ft (1.8 m) long. These will form the tabletop. For the legs, cut 4 more boards to be about 3 ft (910 mm) long. Cut both ends of each board at a 25-degree angle, angled oppositely away from the board. Cut 2 more boards for the bench supports. Make them 5 ft (1.5 m). Make the benches by cutting 4 more boards about 6 ft (1.8 m) long."
    },
    {
      "title": "Saw the 2 in × 6 in (5.1 cm × 15.2 cm) boards to the proper length.",
      "content": "Saw the 2 in × 6 in (5.1 cm × 15.2 cm) boards to the proper length. Cut with a circular saw again or a miter saw if you know how to use one. The shorter boards form a lot of the bracing that gives the table stability. Measure and trim these down as needed. Make 3 battens 2.5 ft (76 cm) long. The battens are braces for the tabletop. Cut both ends at a 45-degree angle, angled oppositely away from the board’s center. Cut 2 boards about 2.33 ft (0.71 m) to form the table braces. Make a pair of cleats by cutting the final 2 boards 11.33 in (28.8 cm) long. Cleats are supports for the benches."
    },
    {
      "title": "Lay the 5 tabletop boards with their best side facedown.",
      "content": "Lay the 5 tabletop boards with their best side facedown. The side you place facedown will form the top of the table. You can lay the boards on a flat surface such as a patch of concrete or on sawhorses if you have them available. Position the boards so their ends align. Leave about 1 ⁄ 4 in (0.64 cm) between each board. [4] X Research source To space the boards properly, stick 1 ⁄ 4 in (0.64 cm) wood spacers or nails between them, then push them together. If you put the boards on sawhorses, clamp them in place so they can’t move while you’re working."
    },
    {
      "title": "Glue the battens to the table boards.",
      "content": "Glue the battens to the table boards. Measure about 16 in (41 cm) in from either of the table’s short ends. Place the cut battens there, then place a third batten directly in the middle of the table. Position the battens so they run across the width of the tabletop. Then, spread a waterproof polyurethane adhesive underneath each batten to hold it in place. The battens will be about 7 in (18 cm) from the table’s edges. [5] X Research source You may need to use a caulking gun to spread the adhesive. Load the gun and trim the tip off the adhesive canister. Press the trigger to release a bead of adhesive. Move slowly across the width, or short side, of the table to lay a smooth string of the adhesive."
    },
    {
      "title": "Pre-drill holes in the battens before screwing them in place.",
      "content": "Pre-drill holes in the battens before screwing them in place. Use a 5 ⁄ 32 in (0.40 cm) drill bit on the ends of each batten. Create a single hole in the center of each end. Drill diagonally down at about a 45-degree angle towards the tabletop boards. Then, place a 4 in (10 cm) deck screw in each hole to secure the battens in place. [6] X Research source To prevent the wood from cracking, always pre-drill holes before adding fasteners. Use galvanized screws on the table. They are much stronger than nails while also being resistant to water."
    },
    {
      "title": "Connect the legs to the outer battens and clamp them together.",
      "content": "Connect the legs to the outer battens and clamp them together. Position the legs up against the inside edges of the battens, 2 per side. Make sure the legs are flush with the tabletop. They will point diagonally out from the battens, forming an A-shape. The table’s stance needs to be wide to give it plenty of stability. [7] X Research source Put some polyurethane adhesive under the legs to secure them to the tabletop."
    },
    {
      "title": "Screw the legs to the battens with 3 in (7.6 cm) carriage bolts.",
      "content": "Screw the legs to the battens with 3 in (7.6 cm) carriage bolts. Countersink the carriage bolts by first drilling a pair of 1 in (2.5 cm) holes about 1 ⁄ 2 in (1.3 cm) deep. Then, pre-drill a 3 ⁄ 8 in (0.95 cm) wide hole through the center of the first hole. Finish by screwing in the bolts. [8] X Research source Position the holes along the edges where each leg and batten meet. Make the first hole near the bottom edge of the batten, closer to the center of the tabletop. Make the second hole along the top edge and near the batten’s outer edge. Leave about 1 ⁄ 2 in (1.3 cm) of space between the screws and the edges of the wood. For extra strength, screw a washer and nut onto the end of each bolt."
    },
    {
      "title": "Measure about 13 in (33 cm) up the legs to position the bench support.",
      "content": "Measure about 13 in (33 cm) up the legs to position the bench support. Measure from the bottom of the legs and use a pencil to mark them. Then, raise the 2 bench supports up and clamp them firmly in place. The bench supports will run across the legs, preventing them from moving. [9] X Research source Make sure the bench supports extend beyond the legs. The bench supports also hold up the benches, which can’t happen without that extra length of wood."
    },
    {
      "title": "Countersink the bench supports with 3 in (7.6 cm) carriage bolts.",
      "content": "Countersink the bench supports with 3 in (7.6 cm) carriage bolts. Attach the bench supports the same way you did the legs. Create 2 holes by drilling through the legs and into the supports. Position 1 hole along the bottom edge of the support and the leg’s centermost edge. Make the second hole opposite of the first. [10] X Research source Remember to drill a 1 in (2.5 cm) hole first, then drill a second, smaller hole directly in its center. Countersinking enables you to connect thin pieces of wood without breaking them. Place a washer and nut on the end of each bolt to strengthen it."
    },
    {
      "title": "Screw the braces to the bench supports and middle batten.",
      "content": "Screw the braces to the bench supports and middle batten. Make sure braces fit firmly in place before you attach them. Position them so they are flush with the batten and the top edge of the supports. When you’re sure they’re steady, use a 5 ⁄ 32 in (0.40 cm) drill bit to pre-drill pilot holes. Finish the supports with several 3 in (7.6 cm) deck screws. [11] X Research source Make the outer holes by drilling through the supports and into the braces. Make the inner holes by drilling through the braces and into the tabletop. To make your bench sturdy, install 2 screws on each end of the braces. You may need to measure and cut the braces again to make them fit. Use a speed square, pencil, and circular or miter saw for this."
    },
    {
      "title": "Invert the table so it is standing on its legs.",
      "content": "Invert the table so it is standing on its legs. You are almost done constructing the table. Now is a good time to check its stability. Push against each component to see how sturdy the table feels. When you’re satisfied, you are ready to create the seats. [12] X Research source If any component wiggles, it may not be sturdy. Make sure the boards are flush and screwed tightly together."
    },
    {
      "title": "Align the bench boards together on a flat surface.",
      "content": "Align the bench boards together on a flat surface. Lay them on the ground or on a sawhorse. Make sure you put the better sides facedown, since they will form the top part of each seat. Keep the edges of the boards flush with one another and separate them using 1 ⁄ 4 in (0.64 cm) wood spacers or nails. [13] X Research source Connect 2 boards per bench. Keep the benches separate."
    },
    {
      "title": "Attach the cleats to each bench.",
      "content": "Attach the cleats to each bench. Spread a line of polyurethane adhesive along the bench’s width. Then, press the cleat onto it directly in the center. Drill a pair of 5 ⁄ 32 in (0.40 cm) wide pilot holes through each cleat and into the bench boards. Screw them in place with 2 1 ⁄ 2 in (6.4 cm) deck screws. [14] X Research source Place the holes about 1 ⁄ 2 in (1.3 cm) away from the edges of each cleat. For additional stability, create 4 more cleats. Place them as close to the ends of the benches as possible."
    },
    {
      "title": "Screw the bench boards to the support boards.",
      "content": "Screw the bench boards to the support boards. Lay the benches over the supports so the cleats face the ground. Locate the points where each board meets the supports. Along the center of each board, drill down into the support. Place more 3 in (7.6 cm) deck screws to secure the benches in place. [15] X Research source You will need to create 2 holes for each board for a total of 4 holes per bench."
    },
    {
      "title": "Cut the corners off the tabletop at a 45 degree angle.",
      "content": "Cut the corners off the tabletop at a 45 degree angle. Use a saber saw or router to round off the table’s edges. Remove about 2 in (5.1 cm) off of each corner. Work carefully to ensure the table looks even on all sides. [16] X Research source While doing this is optional, it is recommended to prevent injuries from anyone bumping into sharp corners."
    },
    {
      "title": "Sand the table with 220-grit sandpaper.",
      "content": "Sand the table with 220-grit sandpaper. Rub the sandpaper lightly along the table’s grain. This will eliminate any splinters or rough edges. Feel the table with your hand afterwards. Make sure it feels smooth to the touch. Avoid pressing too hard. If the sandpaper leaves scratches on the table, use less pressure."
    },
    {
      "title": "Seal",
      "content": "Seal the wood to waterproof it if you desire. Try using a silicone or polyurethane sealer or wood stain. Spread the sealer or stain over the wood evenly with a rag, then let it dry for about 2 hours or the length of time specified by the manufacturer. Recoat the wood once or twice to protect your picnic table from the elements. Wood stain products turn the wood a darker color. Apply the stain in a light initial layer, then add more in subsequent layers until the table reaches the shade you desire."
    }
  ]
}