{
  "url": "https://www.wikihow.com/Break-Up-with-Someone-Who-Just-Doesn%27t-Get-It",
  "title": "How to Break Up with Someone Who Just Doesn't Get It",
  "steps": [
    {
      "title": "Ask for space to allow you to work through your anger and to be certain of your decision.",
      "content": "Ask for space to allow you to work through your anger and to be certain of your decision. You are probably angry or hurt, which leads to you wanting to get away from this person whom you either loved or even still love but don't wish to remain with. It's a contradictory thing. If you are angry and still forced to be around this person, it can lead to a blowup. It can also lead to sniping and arguments that bleed out any remaining good from a relationship. [1] X Research source Tell them you are feeling unhappy in the relationship and need some space to think and rid yourself of anger. It might take a firm tone to get this request across but do so and expect the other respects you enough to give you the time to think. Don't set aside a week to think and then hang out with them the next day. Distance yourself completely. Don't make or accept phone calls or texts. Don't see them, or if you can't avoid that, don't give them too much of your time. Make this time all about you, even if you miss them. If you miss them too much, try to put it into perspective. Make a pros and cons list. Make a list of what you require out of a relationship. Make a list of what you like about this person and what you dislike. Talk to your friends, go out, and don't change your Facebook status until, you're sure."
    },
    {
      "title": "Assess what isn't working in the relationship.",
      "content": "Assess what isn't working in the relationship. This helps you to be absolutely resolute when telling your boyfriend or girlfriend that it's over. It ensures that you won't cave into pleading to give things another go. Most of all, it'll help you to come across as meaning what you say about the relationship being over. Consider the following: Did you ask for changes to behavior that was hurting or upsetting you? Only to find that nothing came of it. Did you offer a reasonable cause of action for them to follow but they neglected to even try? In such cases, they've disrespected you and have shown no intention to shape up. Do you feel that your boundaries are always crossed? Do you feel resentful all the time because you feel as if you're the one giving up or giving in just to maintain the peace? That's not a relationship, it's you are being taken advantage of. Do you feel suffocated or stifled because this person is always clinging to you, hanging around, checking up on your or acting as if they can't trust you? Do you feel that you can't spend time with friends or other people out of fear of upsetting or angering your boyfriend or girlfriend? Can you spend time alone, just in solitude without them barging in? Clinging, jealous or people who lack trust don't make for good relationships. Until they deal with their low trust issues, they are going to make any relationship feel squeezed. Do you consider that you're being taken advantage of? Did your partner say they'd change, then refused to do so? In this case, you'll likely find that this becomes a repeated pattern, with you being used all the time. Are you taking care of yourself, of your own needs? Or is it all about him or her all of the time? Are you transforming yourself just to fit in with their needs and preferences? If this is the case, it's not healthy for you and you'll fail to blossom fully into the person you really are."
    },
    {
      "title": "Consider whether or not you're willing to give a second chance.",
      "content": "Consider whether or not you're willing to give a second chance. This will depend on the reason behind why you want to break up. If you've already given plenty of opportunities for this person to change, skip this step. On the other hand, if you feel that you need to do this in order to feel comfortable about having tried your best, perhaps give it one more try. You agreed to be with this person and therefore your judgement must have had some semblance of sanity once upon a time. Trust that judgement and the respect the person your judgement chose. Give them a second chance if you haven't already. It may happen that when you asked for time to think they were thinking too. And perhaps they were thinking about admitting fault or even changing their actions. If you don't have a crucial reason for breaking up, try again. Respect your original choice and give them another chance to measure up. [2] X Research source"
    },
    {
      "title": "Be sure that you've worked through your anger, as outlined in the previous section.",
      "content": "Be sure that you've worked through your anger, as outlined in the previous section. If you're angry, it can be hard to break up firmly but kindly and you really don't want emotions leading the breakup because that leaves you open to persuasion to not break up. After getting yourself some space, you can wait until you've forgiven them. Try to understand things from their point of view. Think about how much you loved/love them. Consider that this is going to hurt them too, maybe even more than you. That said, don't let guilt change your mind. If you want to break up, if you can't see it working anymore, don't let the guilt of hurting them hurt you more. You must take care of yourself first."
    },
    {
      "title": "Talk to your partner about what has led to this.",
      "content": "Talk to your partner about what has led to this. Refer to the problems, not the personality. Tell them the reasons why the relationship just doesn't work from your perspective. If you still love them, tell them that, it lessens the pain, but be honest. You are breaking up; you don't have to hold your tongue anymore. Tell them the truth about why you were unhappy. Perhaps they will learn from the experience and change for future relationships. Reader Poll: We asked 1129 wikiHow readers what the most important thing to keep in mind when breaking up with someone is, and 58% of them said being honest, but not unnecessarily harsh. [Take Poll]"
    },
    {
      "title": "Confirm the breakup with firmness.",
      "content": "Confirm the breakup with firmness. It is necessary to get the point across to them, so they know it's over. Do it gently, preferably right after the talk, but be firm. Let them know there is no more chances and that it is done. Whatever you say ought to make it clear as to how much you've thought things through. This isn't a spur of the moment decision, it's deeply considered, and this goes to helping your partner realize that you're not going to back down. For example: [3] X Research source \"I have had a long think about the possibility of us staying together and I just can't see us together in the future. I don't see us sharing the same interests, I don't see us following the same trajectory. I really have thought hard about this because I do care about you, but I just don't consider that we're compatible enough to stay together as a couple.\""
    },
    {
      "title": "Be ready for the possible responses to your firm breakup speech.",
      "content": "Be ready for the possible responses to your firm breakup speech. Things that you may confront include: They cry a great deal. This is hard and hugging is okay but nothing more intimate. Don't give in––tears are cathartic and a great form of release, so this is good for them even though it seems awful at the time. Reassure them that they'll be okay because they will be. They may get angry and shout and call you names. Stay calm and focused on why this is over. Say things such as \"I am sorry you feel so upset, I know this isn't easy, but it is over\", or \"I can understand why you're angry, but anger won't mend what is already broken.\" In some cases, it's best to say nothing more than \"Let's discuss this when you feel less upset. We can't decide anything while you're feeling this way.\" They may express relief. This may surprise you, but many people know when the breakup is about to happen, they've sensed it, they know it's on the cards, especially if you've already asked for time out to think. And in that time, they may have reached their own conclusion that it's not worth persevering but didn't want to be the one to initiate the breakup. Don't respond as if you're disappointed with their relief––this is a good outcome for both of you!"
    },
    {
      "title": "Reiterate your reasons for the breakup if needed.",
      "content": "Reiterate your reasons for the breakup if needed. Maybe the person needs to hear it again, through the tears, shock, or anger. That's okay, it reinforces the message and leaves less room for error. Just continue to be gentle and caring, as you would be with any human being you're talking to. There is absolutely no need to be mean or furious, and every reason to be gentle and considerate; this is a hurtful thing to happen but that doesn't undermine the fact it remains an essential thing to do. [4] X Research source Your partner may keep on saying over and over: \"I just don't understand why you'd do this to me.\" At this point, you can gently let them know that you're not doing it to hurt them, that it is about you realizing that you cannot be a part of a relationship that isn't feeling right to you , that it's about your feelings of incompatibility. Help them to understand that this isn't an act directed at them personally, that they're still a terrific person who deserves a relationship with someone who matches them precisely."
    },
    {
      "title": "Move on.",
      "content": "Move on. [5] X Research source Here comes the hard part. Do not remain in contact with your partner over anything other than having them collect their stuff or return things to you. Do not connect via online sites, do not connect via phone or email. Here are some other aspects to consider: [6] X Research source If they keep sending you texts, emails, messages, notes, whatever, then do not respond. It will only give a persistent person hope that there is an opening to get back together again. If they make use of friends, family, and anyone else to get to you, tell such people firmly that you still care about the well-being of this person but that the intimate relationship aspect is definitely over and that you'd appreciate these people not trying to fix what is essentially your own personal life and choices. If there are children involved, communicate strictly only about the needs of the children. Continue to see your children or share access to them without entering into discussions about your former love life with your partner. Do not use or allow your partner to use the children as go-between messengers. Remember—it's very, very normal to feel sad, depressed, or anxious after a breakup. Don't be afraid to reach out to friends, family members, or a therapist to get support and talk about your feelings. [7] X Research source [v160969_b01]. 11 April 2019. Putting a support system in place is vital to your healing process. [8] X Expert Source Kate Dreyfus Holistic Love Coach & Intuitive Healer Expert Interview. 22 November 2021."
    },
    {
      "title": "Be kind to your former partner.",
      "content": "Be kind to your former partner. Send their things on to them or let them collect these things without being mean about it. You loved this person once, there is no need to smash their record collection or rip up all their photos in a fit of rage. If the relationship was abusive, unkind, or unfaithful, dispose of any memento or image items quickly and quietly without a fuss (a calm ritual is okay) ––remember that this is about your karma too and that while voodooing and burning your ex's items might cause you to feel great in the moment, it feeds the anger. Let go to be happy and treat your former partner as a fellow human being who can go about their life without you now. Best of all, if you don't wreck their goods, back account or anything else they value, there is even less reason for them to keep annoying you or worst still, sue you, which are just more means to keep in touch. Yes, you may be surprised to learn that suing people is a really good way to stay in communication, albeit angrily. Let go in order to be set free yourself. [9] X Research source"
    },
    {
      "title": "Have others intervene on your behalf if your ex won't stop calling and contacting you.",
      "content": "Have others intervene on your behalf if your ex won't stop calling and contacting you. It may be helpful to have friends, family and others inform this person that you really won't respond and that you really meant the breakup when it happened. Sometimes it takes a third party spelling it out to clarify that the relationship truly has ended. It may seem callous but realize that you have already done your best to end things with this person."
    },
    {
      "title": "Realize that you may feel weary and shocked for a while.",
      "content": "Realize that you may feel weary and shocked for a while. Even with your thinking things through thoroughly, no longer being part of a couple is a big change in your life and it can take some getting used to. Allow yourself to mourn. It's over but the memories still form a part of who you were at that point in life. It's okay to cry, to perform a calm ritual of letting go (no angry ones) and to feel pain inside. [10] X Research source [v160969_b01]. 11 April 2019. [11] X Expert Source Kate Dreyfus Holistic Love Coach & Intuitive Healer Expert Interview. 22 November 2021. This is all normal. Let go. You're free now. [12] X Research source Even though it feels very intense, you will get through this period and be able to feel good again (and even fall in love)! [13] X Research source [v160969_b01]. 11 April 2019. Try creating a new routine to support your new life chapter—this can help you feel safe, grounded, empowered, and like you're moving forward and rebuilding your life. [14] X Expert Source Kate Dreyfus Holistic Love Coach & Intuitive Healer Expert Interview. 22 November 2021. [15] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Accepting that the relationship has ended is an important part of creating closure, healing, and peace. It also puts you in a position where you can start opening up to the possibility of what's next. [16] X Expert Source Kate Dreyfus Holistic Love Coach & Intuitive Healer Expert Interview. 22 November 2021."
    }
  ]
}