{
  "url": "https://www.wikihow.com/Attend-TED-Talks",
  "title": "How to Attend TED Talks",
  "steps": [
    {
      "title": "Sign up for a TED.com profile.",
      "content": "Sign up for a TED.com profile. To apply to attend a TED Talk Conference, you will need to first create a TED.com profile on their website: https://auth.ted.com/users/new . You will need to provide your first and last name, your email, and a password for your account. [1] X Research source"
    },
    {
      "title": "Select the TED Talk you wish to attend.",
      "content": "Select the TED Talk you wish to attend. TED releases a list of upcoming talks on their website: https://www.ted.com/attend/conferences/ted-conference . Read the description of each TED Talk and choose one that feels relevant to your interests and goals. TED Talks tend to fill up several months in advance so consider picking a talk that is several months away. You can then apply early and increase your chances of landing a spot on the attendance list."
    },
    {
      "title": "Choose your membership option.",
      "content": "Choose your membership option. TED offers four levels of membership for attendees: Vanguard, Standard, Donor, and Patron. If you have never attended a TED Talk Conference, you should choose the Vanguard option, as it is made for first time attendees. It is also the most affordable of the four options in terms of price, at US$5,000. [2] X Research source The other three options go up in price, and perks, ranging from $10,000-$250,000 USD."
    },
    {
      "title": "Set aside at least 2 hours for the application.",
      "content": "Set aside at least 2 hours for the application. The application consists of 6 short essay questions that you will need to answer in detail. Focusing on the application for 2 hours will ensure you put enough thought and effort into each question. You will need to provide a bio as well as answer questions about your goals, accomplishments, and professional work. [3] X Research source You may break up the application, working on it a little at a time, as you save and return to your application through your TED.com account."
    },
    {
      "title": "Discuss 1-3 professional goals.",
      "content": "Discuss 1-3 professional goals. Tell the reviewers what you hope to achieve professionally in your career, listing your short-term and long-term goals. Keep the goals specific and relevant to your professional work. [4] X Research source For example, you may note short-term goals like, “Building an app that tracks the effects of human activity on ocean coral” and long-term goals like, “Connecting human activity with human responsibility for the ocean.”"
    },
    {
      "title": "List at least 1-3 professional awards and accomplishments.",
      "content": "List at least 1-3 professional awards and accomplishments. Include any grants, fellowships, and other recognition you've received in your field. This will show the reviewers that you are ambitious and engaged in your work. You can also note any fellowships or grants that you hope to receive in the near future to help you achieve your goals. [5] X Research source For example, you may write, “As the lead of my research team, I received a $15,000 USD grant to fund work on ocean sustainability in local communities.”"
    },
    {
      "title": "Explain how you will contribute to the TED community.",
      "content": "Explain how you will contribute to the TED community. Tell the reviewers what you can bring to the TED talk as an audience member. Explain how the theme of the TED talk you are applying for relates to your professional work and interests. This will show the reviewer that you will be a valuable participant at the talk. [6] X Research source For example, you may write, “My work on an app about ocean sustainability relates to several aspects of the upcoming TED Talk, 'The Future You,' combining activism, science, and social media engagement in a unique way.”"
    },
    {
      "title": "Include links to your social media accounts.",
      "content": "Include links to your social media accounts. If you have Facebook, Twitter, and Instagram, include your social media handles for these accounts in your application. Make sure your social media accounts paint a positive, engaged picture of your professional work, as the reviewers will likely look at these accounts closely. [7] X Research source You may go through your social media accounts before you submit your application to ensure they are a good representation of your professional work, interests, and goals."
    },
    {
      "title": "Provide a personable, interesting bio.",
      "content": "Provide a personable, interesting bio . A key section of the application is your biography, where you introduce yourself and provide details about your background, your interests, and your work. Avoid simply copy and pasting an existing bio on your website or your social media pages. Make your bio personable and detailed so you stand out, using a professional, friendly tone. Your bio should be at least 200-500 words. [8] X Research source For example, rather than write, “My name is Jane Flowers and I am a microbiologist,” you may write, “As a microbiologist studying the impact of human activity on the ocean, I am all about examining the hidden details, the creatures of the deep.”"
    },
    {
      "title": "List 2-3 professional references who can speak to your goals and interests.",
      "content": "List 2-3 professional references who can speak to your goals and interests. Use references that you worked directly with or for in your field, such as a professor, a peer, a boss, or a mentor. Avoid using family members or a spouse as a reference, as this may not come across as very professional. [9] X Research source If you have a reference who has attended a TED Talk Conference in the past or is affiliated in some way to TED, make sure you mention them in your application. You will be prompted to list the names and contact information of your references in the application."
    },
    {
      "title": "Submit your application online.",
      "content": "Submit your application online. It is free to apply to attend a TED Talk Conference. [10] X Research source"
    },
    {
      "title": "Search for a TEDx Event in your area.",
      "content": "Search for a TEDx Event in your area. TEDx Events are put on by local organizations that partner with TED to create TED Talk-like events and discussions. Look for a TEDx Event using the search tool on TED.com: https://www.ted.com/tedx/events . Explore events by location, date, and whether there are spaces available. Look for an event that seems interesting and relevant to your work. Make sure the event is being held at a local venue on a date that fits your schedule so you do not have to travel to attend."
    },
    {
      "title": "Buy tickets for the TEDx event on TED.com.",
      "content": "Buy tickets for the TEDx event on TED.com. Tickets for TEDx Events can be purchased individually through TED.com, as you do not need to send in an application to attend at TEDx Event. The tickets will be significantly cheaper than a TED Talk Conference, range in price from $75-$100 USD, depending on the event. Look for tickets a few weeks or months before the event to increase your chances of getting them. Some TEDx Events can sell out quickly or have limited seating."
    },
    {
      "title": "Get tickets online through TEDx partners if you cannot find them on TED.com.",
      "content": "Get tickets online through TEDx partners if you cannot find them on TED.com. Do an online search for the TEDx Event, as organizations that partner with TED usually sell tickets for the event on their website. Some organizations will also offer tickets through their social media accounts to their followers."
    },
    {
      "title": "Budget for the admission fee for the TED Talk.",
      "content": "Budget for the admission fee for the TED Talk. If your application is accepted for a TED Talk Conference, you will need to pay the admission fee for attending the talk. The cost of attending depends on the membership type you selected when you applied. The base cost for attending a TED Talk is US$5,000. TED offers reduced ticket prices for young innovators through their TED Fellows Program. You can apply for this program here: https://www.ted.com/about/programs-initiatives/ted-fellows-program ."
    },
    {
      "title": "Factor in the cost of travel and accommodations to the TED Talk Conference.",
      "content": "Factor in the cost of travel and accommodations to the TED Talk Conference. If you are attending a TED Talk Conference, you will need to arrange your travel and accommodations, as they are usually held for several days in locations in North America and Europe. Look for flight deals online and go for cheaper accommodations like Airbnb, VRBO, or a budget hotel. TEDx Events are local and usually only last several hours so you may not need to worry about extra costs like travel and accommodations. You will still need to factor in the cost of the ticket for the TEDx talk."
    },
    {
      "title": "Pick 3-4 people on the guest list you'd like to meet.",
      "content": "Pick 3-4 people on the guest list you'd like to meet. As an attendee, you will receive a list of the speakers and other attendees at the talk. Go through the list of attendees and research them online to get a sense of their work and interests. Identify 3-4 people that you would like to connect with so you can network at the talk. Read up on these 3-4 people so you have talking points and conversation starters for when you meet them at the talk. The TEDx Event and TED Talk Conference usually have meet and greet times before and after the speakers at the event so you can get to know other attendees and the speakers. You can also reach out to other attendees and speakers before you attend the talk, especially if they work in the same or similar field as you. Look for attendees that are based close to where you are and contact them so you can meet before the talk as prep for the event."
    },
    {
      "title": "Participate in the Q&A for the TED Talk speakers.",
      "content": "Participate in the Q&A for the TED Talk speakers. Stand out of the sea of attendees by asking a thoughtful question or two during the Q&A portion of the TED Talk. This will show the speakers and other attendees that you did your homework and are willing to engage with the talk. You may need to do research on the speakers beforehand and talk notes during their talk to prepare your questions."
    },
    {
      "title": "Take advantage of the extra activities at the TED Talk.",
      "content": "Take advantage of the extra activities at the TED Talk. TED Talks are more than just speakers. There are also off site events, meet up and networking events, and more casual talks. Vendors and organizations will also have products and innovations on display that you can look at and experience. Be sure to take advantage of all the different activities and add-ons at the conference so you get the full TED Talk experience. [11] X Research source"
    }
  ]
}