{
  "url": "https://www.wikihow.com/Clean-a-Vibrator",
  "title": "How to Wash & Sanitize Vibrators (& Other Sex Toys)",
  "steps": [
    {
      "title": "Wash your vibrator with mild soap and water for 20 seconds.",
      "content": "Wash your vibrator with mild soap and water for 20 seconds. Use any mild soap that you’d use on your body, like liquid or foaming hand soap, clear body wash, or bar soap. Just wet the vibrator and a washcloth with warm water, apply soap to the cloth, and gently wash the toy for about 20 seconds. Rinse it under warm water and allow it to air dry for at least 24 hours. [1] X Research source You can also use a clean towel or a paper towel to dry your vibrator thoroughly. This method also works for other non-porous motorized, non-motorized, stainless steel, and glass toys."
    },
    {
      "title": "Apply a specialized sex toy cleaner, then wipe or rinse the vibrator.",
      "content": "Apply a specialized sex toy cleaner, then wipe or rinse the vibrator. You can also buy a cleaner that’s especially for cleaning sex toys that are usually slightly more expensive but are simple, effective, and super portable. [2] X Research source Simply apply the spray or foaming cleaner, leave it on the toy for the recommended amount of time (usually 5 to 10 seconds), then wipe or rinse the vibrator. Vibrator cleaning wipes can also be portable and convenient. However, they can leave behind fluids and bacteria, so they should just be used as a quick cleaning solution until you can wash your vibrator properly with soap and water. Avoid using any products that you wouldn’t put in your body to clean your sex toys, such as harsh chemicals or bleach."
    },
    {
      "title": "Check your manufacturer’s directions for any special instructions.",
      "content": "Check your manufacturer’s directions for any special instructions. If you’re not sure how to clean your specific vibrator, check out the manufacturer’s website or ask the staff at your local sex store. Your sex toy may have a more specific method of cleaning related to your specific vibrator design. [3] X Research source"
    },
    {
      "title": "Clean your sex toys thoroughly after each use.",
      "content": "Clean your sex toys thoroughly after each use. Bacteria can all spread through sex toys, so it’s important to clean them thoroughly after you use them. [4] X Research source You should also wash them between using them on different parts of the body, like the mouth, vagina, and anus. [5] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source One study in 2014 found that in some cases, human papillomavirus (HPV) could be detected on the surface of vibrators up to 24 hours after standard cleaning. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Set your sex toys aside for at least 24 hours to ensure any bacteria or viruses are dead before using them again. [7] X Trustworthy Source Go Ask Alice Medical advice site with content written by health promotion specialists affiliated with Columbia University Go to source"
    },
    {
      "title": "Store your vibrators and other sex toys in a clean sealable case or box.",
      "content": "Store your vibrators and other sex toys in a clean sealable case or box. Many sex toys come with a fabric pouch or case that they can be stored in when they’re not in use, but if yours didn’t you can use any sealable case or pouch. [8] X Research source Keep your vibrators and other toys stored individually in a cool, dark place out of direct sunlight and away from anywhere they could get wet. Wash your vibrators and other sex toys with soap and water before using them to get rid of any dust, pollen, or pet hair. [9] X Research source Store silicone anal toys in something breathable to cut down on odor."
    },
    {
      "title": "To surface-clean sex toys, wash them with soap and water for 20 seconds.",
      "content": "To surface-clean sex toys, wash them with soap and water for 20 seconds. Almost every kind of non-mechanized or waterproof sex toy can be cleaned with just mild soap, warm water, and air-drying. Then rinse or wipe the toy until it is completely clean, using plain water. Place the clean toy on a clean towel and allow it to air-dry. [10] X Research source If the toy has grooves or crevices, use a soft toothbrush reserved for this purpose to clean them. [11] X Research source If your sex toy is rated splashproof or if it’s not water-safe, wipe it down with a damp paper towel or washcloth and mild soap instead. If your toy is battery-operated, remove the batteries prior to cleaning and air dry it with the battery case open. Usually, a quick clean with soap and warm water is enough to do the trick. Deep-cleaning your toys may be necessary if they’re being used by multiple people, they’ve come into contact with gentiles during an active infection, or you’d like to remove an odor from an anal toy."
    },
    {
      "title": "To deep-clean non-mechanized sex toys, boil them for 3 to 5 minutes.",
      "content": "To deep-clean non-mechanized sex toys, boil them for 3 to 5 minutes. Disinfect your 100% silicone, stainless steel, and borosilicate glass toys by surface-cleaning them with soap and water and submerging them in a pot of boiling water for at least 3 to 5 minutes. [12] X Research source Remove your sex toys from the boiling water with tongs, then allow them to air-dry on a clean towel. Monitor the boiling process until you’re ready to remove the sex toy. If you’re boiling glass toys, place a washcloth in the pot to prevent them from cracking or breaking."
    },
    {
      "title": "Pop your sex toy in the dishwasher if it’s glass or stainless steel.",
      "content": "Pop your sex toy in the dishwasher if it’s glass or stainless steel. If your sex toys are non-mechanized and made of stainless steel, 100% silicone, or borosilicate glass, wash them with soap and water, then put them on the top rack of the dishwasher. Run your dishwasher on a sanitizing cycle without soap. [13] X Research source This method is convenient, but may not be as effective at disinfecting as boiling. The sanitize cycle is typically hot enough to kill most bacteria, but not necessarily hot enough to kill heat-tolerant viruses and fungi. [14] X Research source If you share your dishwasher with people other than your sexual partners, you may consider trying a different method."
    },
    {
      "title": "Soak your sex toys in a bleach-water solution.",
      "content": "Soak your sex toys in a bleach-water solution. Your sex toys can be disinfected by placing them in a ratio of ⅓ cup of household bleach per 1 gallon of water. [15] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Clean your sex toys with soap and water, then either spray or submerge the toys in the bleach solution. Let the toys sit in the mixture for at least 10 minutes. Thoroughly wash the toy with soap and water once again to make sure all of the bleach is removed. To keep your sex toys from getting damaged, avoid soaking or spraying your sex toys with pure bleach and always wash them with soap and water after deep cleaning. [16] X Research source If you have sex toys that are typically used in the vagina, try to avoid using this method to deep clean. Bleach and other harsh chemicals may throw off your natural pH balance. [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Skip UV sanitizers for cleaning sex toys.",
      "content": "Skip UV sanitizers for cleaning sex toys. UV sanitizers tend to be a more expensive and less effective method for killing bacteria on sex toys than boiling or bleaching. UV light tends to be ineffective against surfaces with bumps and ridges because it can only disinfect the areas it’s able to reach. [18] X Research source"
    },
    {
      "title": "Dispose of sex toys that change color, tear, or start to smell.",
      "content": "Dispose of sex toys that change color, tear, or start to smell. Bacteria and other germs can hide in holes, cuts, or deteriorating seams—if you notice any tearing in your sex toys, it’s time to retire it. If your sex toys warp or if the toy’s color starts to fade, that could also be a sign that you need to dispose of them. [19] X Research source Try to steer clear of any porous sex toys or jellies that can break down quickly, collect bacteria, and may have dangerous chemicals like phthalates that have been linked to cancer. [20] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Use condoms on porous sex toys made of silicone blends, jelly rubber, PVC, vinyl, TPR, TPE, elastomer, or other rubbery plastics that can absorb germs. [21] X Research source Unless you put condoms on them, avoid using silicone lube on silicone sex toys—the lube can damage your toys and increase the chances of passing on an infection. [22] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Try to stick to a water-based lube instead. [23] X Research source"
    }
  ]
}