{
  "url": "https://www.wikihow.com/Avoid-Microplastics",
  "title": "How to Avoid Microplastics: Reducing Your Everyday Exposure",
  "steps": [
    {
      "title": "Tap water contains less microplastic than plastic water bottles.",
      "content": "Tap water contains less microplastic than plastic water bottles. This is especially if you filter your water . If you're in the habit of picking up bottled water when you go out, make the switch to a reusable bottle and fill it up with filtered tap water throughout the day. You'll save money and reduce your microplastic intake! [2] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source In a large study on microplastics in bottled water, researchers found microplastic in 93% of the samples they tested. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source This means you're more likely to drink microplastics if you drink from a plastic water bottle than if you drink filtered tap water."
    },
    {
      "title": "Bring your own reusable cutlery and takeout containers.",
      "content": "Bring your own reusable cutlery and takeout containers. When hot food comes into contact with plastic to-go containers, more of the chemicals leach into your food. The same goes for your morning cup of coffee from a disposable cup, which is lined with plastic. To avoid microplastics in your food, bring your own bamboo utensils or cutlery and have metal or glass containers to package your food. [4] X Research source If you place a takeout order, tell them you'll bring your own containers when you pick the food up. Plastic utensils are used for an average of 3 minutes, but the plastic breaks down in the environment for hundreds of years."
    },
    {
      "title": "Avoid keeping your food in plastic wrap, plastic bags, or plastic containers.",
      "content": "Avoid keeping your food in plastic wrap, plastic bags, or plastic containers. When your food comes into contact with plastic for an extended period of time, it's more likely to absorb chemicals from the plastic. Instead, reach for metal or glass containers, and try beeswax wrap instead of plastic wrap. [5] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source To cut back on plastic wrap, get creative with plates—if you cut a lemon or onion in half, turn it upside down so it sits flat on a dish. Then, stick it in the fridge. No need for plastic."
    },
    {
      "title": "Microwaving food in plastic causes the plastic to break down faster.",
      "content": "Microwaving food in plastic causes the plastic to break down faster. It's much safer to put your food into a glass or ceramic dish and microwave it. Avoid eating frozen pre-packaged meals that you heat in the microwave. These foods have been in contact with plastic for a long time and heating them up in the plastic can release microplastic into the food. [6] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Fish and bivalves like clams and oysters consume plastic in the ocean.",
      "content": "Fish and bivalves like clams and oysters consume plastic in the ocean. When you eat seafood, you ingest those microplastics. While all seafood is exposed to microplastics, mussels and oysters have some of the highest levels. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you like seafood and don't want to give it up entirely, you might choose to skip bivalves and enjoy fish once in a while."
    },
    {
      "title": "Cut back on processed foods since they contain more microplastics.",
      "content": "Cut back on processed foods since they contain more microplastics. \"Processed foods\" are usually made in a factory (and typically, they'll have a super long ingredient list). Ultra-processed foods like chips, fast food, fries, and frozen meals contain higher levels of microplastics that break down into phthalates—chemicals that can contribute to chronic disease. [8] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source To play it safe, stick with unprocessed or minimally processed food. [9] X Research source You may have heard that some produce, like apples and carrots, contains microplastics. While this is true, fresh produce still contains fewer microplastics than processed convenience foods. Tea steeped in bags is actually high in microplastics, so switch to loose leaf tea."
    },
    {
      "title": "Synthetic fibers shed microplastics every time you wash them.",
      "content": "Synthetic fibers shed microplastics every time you wash them. In fact, textiles are one of the biggest contributors to microplastic pollution. Read labels when you shop for clothes, sheets, or blankets, and avoid buying synthetic materials—polyester, acrylic, nylon, spandex, rayon, and microfiber. Instead, get cotton, wool, hemp, or linen products. [10] X Research source If you can't afford natural fibers, check out secondhand shops. Even if you can't find natural fibers there, buying synthetic clothes from a thrift store is better than buying them brand new."
    },
    {
      "title": "Wait until you have a full load to run, so fewer microplastics are released.",
      "content": "Wait until you have a full load to run, so fewer microplastics are released. Set the machine to run a low-water or energy-efficient cycle using cold or cool water. If you don't have an energy-efficient option, wash your clothes on a short cycle to minimize the amount of time that your clothes rub against each other, releasing microplastics. [11] X Research source Look into getting a filter that attaches to your machine's hose or a ball that catches microplastics from your clothes—empty the ball into your trash to prevent microplastics from getting into the water system."
    },
    {
      "title": "Drying your clothes in a machine releases thousands of microplastics.",
      "content": "Drying your clothes in a machine releases thousands of microplastics. A simple way to drastically cut back on microplastics is to hang your clothes on a line or drying rack to air dry. Your clothes will last longer, too! [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Researchers found that running a load of laundry through the dryer released microfibers 30 feet (9.1 m) away from the vent—directly into the environment."
    },
    {
      "title": "Head to the bulk bins and use your own cloth bags.",
      "content": "Head to the bulk bins and use your own cloth bags. Packaging is a huge contributor to microplastic pollution—just look at your weekly grocery haul. The next time you shop, see what foods you can buy from the bulk bins and bring your own cloth bags . Many stores offer a discount for bringing your own bags, so you'll reduce your plastic consumption and save a little money. [13] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source If you have to buy food that's in plastic, avoid containers with the codes 3 and 6 since these are more harmful than codes 2, 4, and 5. Code 3 plastic is PVC, which leaches phthalates—a chemical that disrupts your hormones. Code 6 plastic is polystyrene or styrofoam, which breaks up really easily into microplastics. It's also a probable carcinogen. [14] X Research source"
    },
    {
      "title": "Read labels and avoid items that contribute to microplastic runoff.",
      "content": "Read labels and avoid items that contribute to microplastic runoff. While microbeads have been banned since 2015, microplastics are still in a lot of cosmetics, toothpaste, and skincare products. Shop around and pass on products that contain these plastics: [15] X Research source Polythelene Polypropylene Nylon Polymethyl methacrylate Acrylates Copolymer"
    },
    {
      "title": "Dust",
      "content": "Dust actually contains microplastics, so keep your home clean! Wipe down surfaces in your home and vacuum before you actually notice dust or you may breathe in more microplastics. [16] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source For the best results, use a vacuum with a HEPA filter . You may have been told to dust with a microfiber cloth, but microfiber cloths are a huge source of microplastics. Reach for old sheets, towels, or clothes to use as dusting rags instead."
    },
    {
      "title": "Driving your car causes the tires to break down and release microplastics.",
      "content": "Driving your car causes the tires to break down and release microplastics. This is why cities or areas with traffic congestion have higher pollution. Tire erosion contributes to something called \"city dust\"—a mix of microplastics from tires, household plastics, and industrial plastic use. To minimize microplastics, use public transit whenever you can to reduce tire erosion. [17] X Research source If it's not feasible for you to take public transit, ride your bike instead or carpool with neighbors and co-workers. If you have to drive, combine your errands, so you're being more efficient about driving."
    },
    {
      "title": "Read up on relevant legislation and urge representatives to pass it.",
      "content": "Read up on relevant legislation and urge representatives to pass it. Pay attention to plastics in politics at the federal, state, and local levels. Call or email your senators and representatives to let them know that reducing plastic production and use is important to you. [18] X Research source If you're unhappy with the steps your legislators may or may not be taking, start your own grassroots movement to reduce microplastics in your community. You might just be the change your community needs!"
    }
  ]
}