{
  "url": "https://www.wikihow.com/Clean-a-Hummingbird-Feeder",
  "title": "How to Clean a Hummingbird Feeder",
  "steps": [
    {
      "title": "Pour out all the nectar.",
      "content": "Pour out all the nectar. As you likely stock your feeder with nectar, make sure to remove that before cleaning the feeder. You should simply pour the nectar down the drain. Once birds have fed in the liquid it will contain mold and other contaminants so do not save unused sugar liquid from inside of the feeders. You can make more nectar later with simple sugar and water or restock the feeder with store-bought nectar. If your buy nectar from a store choose the colorless kind, not the kind that is dyed red. Birds are attracted to the red feeder parts and do not need to ingest unnecessary petroleum dyes. The birds prefer cane sugar over beet sugar and you should never use anything except cane or beet sugar."
    },
    {
      "title": "Disassemble the feeder.",
      "content": "Disassemble the feeder. You may need the manufacturer's guidelines to disassemble your feeder. However, disassembling a feeder is often self-explanatory. You can usually see the knobs and screws that must be undone to take the feeder part. If you are at all unsure, however, you should consult the guidelines to make sure you do not damage your feeder. If you lost the guidelines, you can type the name of your feeder into a search engine. You may be able to find a copy of the guidelines online. Some feeders, though, recommend using soap. Soap is not effective at removing black mold and soap is hard to remove without leaving residue that will harm the birds' stomachs."
    },
    {
      "title": "Select a cleaner.",
      "content": "Select a cleaner. Usually, bleach is not necessary unless there is black mold in the feeder. For the most part, weaker cleaners like peroxide and vinegar work best as they're less likely to leave behind harmful residue. [1] X Research source Unless you see mold, opt for white vinegar or 3% hydrogen peroxide as your cleaner. Vinegar should be diluted with water. Use two parts water to one part vinegar. You can also use simple dish soap. However, you should boil your feeder in a large pot of water to remove all soap residue because even a small amount of soap damages the stomach lining of the birds by attacking the stomach cells. If your feeder can't be boiled without deformation then don't use soap or use very little and soak the feeder in a large pot of water, stirring occasionally. Then rinse it very thoroughly."
    },
    {
      "title": "Soak your feeder.",
      "content": "Soak your feeder. Fill up your sink with your chosen cleaner. Allow your feeder to soak for several hours. This will remove any toxins and make it easier to scrub off any grime."
    },
    {
      "title": "Scrub down the interior of your feeder.",
      "content": "Scrub down the interior of your feeder. You will need a thin bottle brush to get into the various nooks and crannies of the feeder. Scrub the interior of your feeder with the bottle brush. You want to remove any nectar or sugar residue, as this can spoil and contaminate new nectar. Boiling the feeder, if it can be boiled without deforming, is a way of removing sugar residue without scrubbing. If you prefer not to scrub and have some mold, you can soak the feeder in an active chemical bath like vinegar or hydrogen peroxide. If soaked long enough, all biofilms (mold and such) should be destroyed. Remember that scrubbing does not always remove microscopic material. After being soaked, residue should come off easily. You should not have to scrub with too much force."
    },
    {
      "title": "Rinse the feeder completely.",
      "content": "Rinse the feeder completely. Rinse the feeder under hot, running tap water. Rinse each part of the feeder until the water runs clear. It's very important to rinse the feeder completely in order to keep harmful residue from getting into hummingbird nectar."
    },
    {
      "title": "Allow it to dry completely.",
      "content": "Allow it to dry completely. Set the feeder in a dry, safe place in your home. Allow it to air dry completely before reassembling it and putting it back in place. How long this will take depends on the humidity of your region. It can take anywhere from a few hours to overnight."
    },
    {
      "title": "Dilute your bleach.",
      "content": "Dilute your bleach. If there is black mold in your hummingbird feeder, you will need to clean it with bleach, peroxide, or vinegar. You should never use bleach without diluting it first, as this can be dangerous. You should also make sure to wear gloves when handling bleach and have adequate ventilation. Vinegar and peroxide are weaker so they will take longer to remove the black mold. However, they have the advantage of not creating toxic dioxin chemicals by reacting with organic compounds like sugar. To dilute bleach, mix a quarter cup of bleach with a gallon of water. It's easiest to put your bleach and water in a large bucket."
    },
    {
      "title": "Soak the feeder in the bleach for an hour.",
      "content": "Soak the feeder in the bleach for an hour. This is important to remove any mold and spores that could potentially harm hummingbirds. Submerge all parts of your bird feeder in the bleach solution. Allow them to sit for an hour. Remember to wear gloves when working with bleach."
    },
    {
      "title": "Clean the feeder with a bottle brush.",
      "content": "Clean the feeder with a bottle brush. Keeping your gloves on, remove the parts of the bird feeder from the bleach. Clean each part of the feeder with a bottle brush. Make sure to scrub off any traces of black mold. You do not want any black mold on the feeder when you put it back in place. Where gloves for the duration of the cleaning process."
    },
    {
      "title": "Rinse the feeder thoroughly.",
      "content": "Rinse the feeder thoroughly. It's vital to rinse the feeder as bleach can be dangerous to birds. Run the feeder under hot water until the water runs clear. Because bleach reacting with organic compounds like sugar can create very toxic dioxin chemicals, it is highly-recommended to boil the feeder in a large pot of water after rinsing it to ensure all traces of bleach residue are removed. If your feeder has a type of plastic that cannot be boiled then soak the feeder in a large pot of water for several hours, stirring periodically."
    },
    {
      "title": "Refill the feeder.",
      "content": "Refill the feeder. After bleaching a feeder, you do not need to let it air dry. You can simply refill it and put it back in place. However, if the feeder is very wet, you can pat it dry slightly with a towel before putting it back in place."
    },
    {
      "title": "Clean the feeder at the right frequency, depending on the season.",
      "content": "Clean the feeder at the right frequency, depending on the season. In the warmer months, feeders will need to be cleaned more often. In 90F or higher weather it may even be necessary to replace the liquid twice daily. Fermentation happens very quickly. Do not place hummingbird feeders in locations where they receive direct sunlight as it greater speeds up spoilage. In weather with temperatures in the 80s it is a good idea to change the liquid daily. In the 70s the liquid may last more than a day. Remember, you can't rely on liquid cloudiness to know it's time to change the liquid. Clear-looking liquid can be too fermented already. Beer looks clear but it's extremely fermented. [2] X Research source Check the hummingbird feeder each morning and evening. If it looks yellow or you see bugs in the nectar, change it. [3] X Research source"
    },
    {
      "title": "Replace the nectar regularly.",
      "content": "Replace the nectar regularly. Watch the nectar closely and throw it away when necessary. How long nectar lasts depends on the ambient temperature, how clean the feeder was before it was refilled, how many ports are open to let air in, and whether or not it gets direct sunlight. In high heat situations or when the feeder is in direct sunlight, nectar can go bad in less than a day. At a minimum, you'll need to change the nectar every 3-5 days. [4] X Research source"
    },
    {
      "title": "Deep clean the feeder at least once every seven days in hot weather.",
      "content": "Deep clean the feeder at least once every seven days in hot weather. Check the feeder periodically for a greasy residue. This can indicate that there is black mold. The feeder should be boiled, if it is made of parts that can be boiled, more often than it is deep-cleaned. When you deep clean the feeder periodically you have the option of boiling the feeder three times in a row for 30 minutes each time, allowing it to cool. This will kill mold spores which are very resistant to being killed by boiling. You can also soak the feeder in hydrogen peroxide or vinegar for an hour or more. If you notice black mold growing on the feeder that is especially bad and requires soaking in vinegar, peroxide, or a 1 part bleach 10 parts water liquid. You should not see any black mold on the feeder after soaking. If you see it then continue to soak until it has dissolved."
    }
  ]
}