{
  "url": "https://www.wikihow.com/Change-the-Keyboard-Shortcut-for-a-Mac-Screenshot",
  "title": "Step-by-Step Guide on Changing the Keyboard Shortcut for a Mac Screenshot",
  "steps": [
    {
      "title": "Click on the Apple icon.",
      "content": "Click on the Apple icon. It's the Apple logo located at the far left corner of the main menu bar on your Mac."
    },
    {
      "title": "Click System Preferences.",
      "content": "Click System Preferences ."
    },
    {
      "title": "Click the \"Keyboard\" icon.",
      "content": "Click the \"Keyboard\" icon. The icon itself appears as a keyboard. If you can't see the main menu, click the three rows of dots at the top left corner of the window, which displays as Show All in earlier versions of Mac OS X."
    },
    {
      "title": "Click Shortcuts.",
      "content": "Click Shortcuts ."
    },
    {
      "title": "Click Screen Shots on the left pane of the window.",
      "content": "Click Screen Shots on the left pane of the window."
    },
    {
      "title": "Double-click on a keystroke combination on the far right side of the pane.",
      "content": "Double-click on a keystroke combination on the far right side of the pane. You can choose from four main Screen Shot actions. Save a picture of screen as file will save the entire screen to your computer as an image file. Copy picture of screen to the clipboard will copy the entire screen to your clipboard for pasting. Save picture of selected area as a file allows you to save an image file of an area of your screen that you select. Copy picture of selected area to the clipboard will copy the area of your screen that you select to your clipboard for pasting."
    },
    {
      "title": "Type in a custom keystroke combination.",
      "content": "Type in a custom keystroke combination. Your keystroke combination must start with a modifier key. Modifier keys include ⇧ Shift , ⌥ Option , ⌘ Command , Control , ⇬ Caps Lock , or Fn . [1] X Research source Make sure that you enter a unique shortcut, meaning that the keyboard combination is not already designated to perform another task."
    },
    {
      "title": "Click the red \"x\" button.",
      "content": "Click the red \"x\" button. Your keyboard shortcut will be saved!"
    }
  ]
}