{
  "url": "https://www.wikihow.com/Change-Rear-Brake-Shoes",
  "title": "How to Change Rear Brake Shoes",
  "steps": [
    {
      "title": "Jack the vehicle up and remove the wheel.",
      "content": "Jack the vehicle up and remove the wheel. Park the vehicle on a firm, level surface. Use a tire iron or the appropriate socket to loosen the lug nuts on the first rear wheel, then slide a jack beneath one of the vehicle’s rear designated jack points to lift the vehicle up . [1] X Research source Always use jack stands when working on a jacked up vehicle. Unscrew the lug nuts and remove the wheel. Refer to your vehicle owner’s manual if you need assistance locating the designated jack points."
    },
    {
      "title": "Remove the dust cap with a screwdriver.",
      "content": "Remove the dust cap with a screwdriver. With the wheel removed, you will be able to see the outside of the brake drum directly behind where the wheel used to be. The center of the circular brake drum is a removable dust cap. Slide a flat head screw driver into the gap beneath the dust cap and pry it toward you to remove it. [2] X Research source The dust cap may have rusted in place or could be stuck due to brake dust and road grime. If the cap doesn’t come off easily, spray it with rust remover like WD40 and allow it to sit for a minute before trying again."
    },
    {
      "title": "Use a ratchet to unscrew the axle bearing nut.",
      "content": "Use a ratchet to unscrew the axle bearing nut. Beneath the dust cover, you’ll find the axle bearing nut. This large nut is usually a 22 or 24 millimeter metric socket, or a 7/8” standard socket. Use a breaker bar or half inch drive ratchet to turn the nut counterclockwise in order to remove it. [3] X Research source A traditional 3/8-inch drive socket wrench may not allow you to put enough pressure on the nut to break it loose. Set the nut aside someplace safe for use when reinstalling the drum."
    },
    {
      "title": "Twist the drum as you pull it backward to remove it.",
      "content": "Twist the drum as you pull it backward to remove it. With the axle nut removed, the drum will no longer be held in place, but may still be stuck on due to rust or grime. Twist the drum slightly as you remove it to break it free from any rust. [4] X Research source The drum may be extremely difficult to remove."
    },
    {
      "title": "Spray the drum with rust remover if it’s stuck.",
      "content": "Spray the drum with rust remover if it’s stuck. Rust removers like WD40 can help loosen the grip created by rust on your vehicle’s drums. Spray it around the outside circumference of the drum where it meets the vehicle and give it a few minutes to set in. Then attempt to remove the drum again. [5] X Research source You may bang on the drum with a rubber mallet to help loosen it up. Do not strike the drum with a hammer, as it may damage it. If you are replacing the drum as well, it doesn’t matter if you damage it."
    },
    {
      "title": "Use pliers to remove the primary brake shoe springs.",
      "content": "Use pliers to remove the primary brake shoe springs. The primary brake shoe springs are the large springs located beneath the drum once you remove it. Some vehicles will have one spring for each brake pad, while others may have two. All of the springs will need to be disconnected to relieve the tension and allow you to remove the pads. You may be able to remove the springs with your fingers, but it could pinch or injure you. Try not to bend the springs out of shape, as you will reuse them when installing the new brake pads."
    },
    {
      "title": "Pull out the brake shoe clips.",
      "content": "Pull out the brake shoe clips. Use the same needle nose pliers to remove the clips that hold the brake shoe in place. There should be two clips inside the brake system that need to be removed prior to removing the pads themselves. Make sure to set the clips aside someplace safe for reuse when installing the new brake pads. If the clips are damaged, you can often purchase replacement ones at your local auto parts store."
    },
    {
      "title": "Remove the parking brake cable.",
      "content": "Remove the parking brake cable. The parking brake cable will be much easier to remove after the spring tension has been relieved. In some applications, it may be easier to remove the parking brake cable after you’ve pulled the brake shoe set away from the backing plate. If you can’t determine how to remove the parking brake cable easily, refer to the service manual for your specific vehicle for further guidance."
    },
    {
      "title": "Pull the brake shoe set free from the backing plate.",
      "content": "Pull the brake shoe set free from the backing plate. Grip the brake pads on either side and pull them directly toward you to separate them from the backing plate. The springs will come with the brake shoe set, but the parking brake cable should remain with the vehicle. Once the brake shoe set have been removed from the backing plate, you can begin replacing the pads."
    },
    {
      "title": "Place the new brake set next to the old one.",
      "content": "Place the new brake set next to the old one. Lay out the new brake pad set on a table, then place the brake shoe set you just removed from the vehicle down on the table next to it. Be sure there are no other parts on the table that can get mixed up with the components as you transfer them from the old set to the new one. [6] X Research source Compare the two sets of brake pads. Aside from the wear on the old ones, the two sets should be identical."
    },
    {
      "title": "Swap components onto the new set.",
      "content": "Swap components onto the new set. Starting with the springs, remove the components on the brake shoe set you pulled from your vehicle and place them on the new brake pads until the new pads are ready to be installed back into the vehicle. [7] X Research source The number of springs and hardware you transfer may vary from vehicle to vehicle. Refer to the service manual specific to your vehicle for further guidance."
    },
    {
      "title": "Reset the parking brake adjuster.",
      "content": "Reset the parking brake adjuster. The parking brake adjuster will need to be transferred along with the springs as you transfer the hardware from the old brake set to the new one. Push the adjuster wheel away from the pin as you install it onto the new brakes. [8] X Research source You may also wind the threads inward to make the adjuster as short as possible before installing it if it does not have a pin. The adjuster is designed to self-adjust for your parking brake once installed."
    },
    {
      "title": "Hold the brake spring away from the end of the cable.",
      "content": "Hold the brake spring away from the end of the cable. Use a pair of pliers or dikes to pull the parking brake spring away from the end of the cable. This will leave the end of the cable exposed to make it easier to install it back onto the brake assembly. [9] X Research source If you are doing this job yourself, you may want to use locking pliers to hold the spring back from the end to make it easier to install."
    },
    {
      "title": "Place the shoe set against the backing plate and secure it.",
      "content": "Place the shoe set against the backing plate and secure it. Press the brake shoe set with the new brake pads up against the backing plate, then reinstall the brake shoe clips you removed previously to hold the brake set in place. [10] X Research source Some drum brake sets will come with replacement clips in the event you damaged the old ones."
    },
    {
      "title": "Connect the return springs.",
      "content": "Connect the return springs. Reconnect the brake springs you disconnected in order to remove the old brakes. Use a pair of pliers to ensure you don’t pinch or injure yourself in the process. If the springs become too bent or damaged in the process, they will have to be replaced. [11] X Research source Be careful not to overstretch the ends of the spring. If you do, you may be able to bend it back into place using the pliers, but if not, they will need to be replaced. You can purchase replacement springs at your local auto parts store. Reconnect the parking brake cable as well."
    },
    {
      "title": "Install the new drum.",
      "content": "Install the new drum. Remove the new drum from the packaging and compare it to the old drum to ensure they have the same diameter. Place the new drum over the brake shoe set and screw the axle nut on to hold it in place. [12] X Research source A new drum is required to allow the brakes to seat properly onto the new braking surface. Replace the dust cover, then mount the wheel back on the vehicle and repeat the process on the other wheel."
    }
  ]
}