{
  "url": "https://www.wikihow.com/Pay-with-Google-Pay-Online",
  "title": "Simple Ways to Pay with Google Pay Online",
  "steps": [
    {
      "title": "Go to the checkout.",
      "content": "Go to the checkout. After you're done shopping on a site and adding things to your cart, click the option to checkout. You can use Google Pay whether you're using a computer, smartphone, or tablet. If the retailer offers the Google Pay icon in the \"We accept\" area, you know that you can pay with Google Pay. Some online retailers offering Google Pay include DoorDash, Best Buy, American Eagles Outfitters, Macy's, Costco, and Target."
    },
    {
      "title": "Select Google Pay.",
      "content": "Select Google Pay. When you’re asked for your payment method, select “Google Pay\" to pay with the cards in your Google Wallet . You will be brought to the Google Pay Checkout page. The Google Pay icons look like the letter \"G\" in blue, green, yellow, and red, and can say \"GPay\" or \"Buy with GPay.\" If you aren’t signed into your Google account, type your Google account name and password in the field provided on the lower right portion of the page, and click the “Sign in” button to proceed. If you're using your computer and are signed into the Chrome web browser or on your Android phone and signed into a Google account, you'll skip this step."
    },
    {
      "title": "Select a payment method.",
      "content": "Select a payment method. If you have multiple payment methods or credit or debit cards linked to your Google Pay account, there’s a drop-down list before you click “Place order now.” Select your payment method for this purchase from here. If the card you want to pay with isn't an option, you can add it to your Wallet . Note that not every bank or card issuer works with Google Pay; look here to make sure your card will work with Google Pay/Wallet."
    },
    {
      "title": "Place your order.",
      "content": "Place your order. Once you’ve verified everything, click the Continue Checkout or Place order now button on the bottom of the page. Google Pay will process your payment using the payment method you’ve selected. You will receive a confirmation message once your payment has been processed. [2] X Research source"
    },
    {
      "title": "Go to https://wallet.google.com or open Google Wallet.",
      "content": "Go to https://wallet.google.com or open Google Wallet. Since the Google Pay app on smartphones doesn't work in the U.S., you'll need to open the Google Wallet app to add a payment method to Google Pay. Sign in if you aren't already signed in. If you want to add a bank account and live in Singapore, see Adding a Bank Account in Singapore ."
    },
    {
      "title": "Click Add payment method (website) or Add to Wallet (mobile app).",
      "content": "Click Add payment method (website) or Add to Wallet (mobile app). If you don't see the option to add a card on the website, click the Payment methods option in the menu on the left side of your screen. If you're using the mobile app, tap Payment card to continue."
    },
    {
      "title": "Select which type of payment method you want to add and select Next.",
      "content": "Select which type of payment method you want to add and select Next . You can add a credit or debit card or a bank account. If you're on an Android that's logged into a Google account, you'll also see cards that you've used with other Google services, like Google Play, Chrome, and YouTube."
    },
    {
      "title": "Enter the payment information.",
      "content": "Enter the payment information. The information you need to add is different depending on the kind of account you're linking. Bank account: Enter the name of the bank, the account type, routing, and account number. Credit or debit card: Enter the card number, expiration date, and the CVC or security code."
    },
    {
      "title": "Click or tap Save.",
      "content": "Click or tap Save . The card or bank account will be saved in your Wallet and linked to your Google Pay account. Can't add your card or bank? It might not be accepted, or there's a typo in the payment information. [3] X Research source"
    },
    {
      "title": "Open Google Pay.",
      "content": "Open Google Pay. If you live in Singapore or India, you can also use Google Pay to pay people directly. This doesn't work in the US or other regions."
    },
    {
      "title": "Start the payment.",
      "content": "Start the payment. You can do this multiple ways: VPA, UPI ID, or phone number: Search for this information in the top search bar, then select the receiver when you find them and tap Pay . If they are in your phone contacts, the information you enter may autofill, or you can search for their email to send them money. QR code: Tap Scan QR code and use your smartphone's camera to capture the QR code to send money to them. Bank account: Enter the bank account details on the page and tap Bank transfer . Continue to enter their bank account number and IFSC code. Tap Continue to proceed."
    },
    {
      "title": "Enter the amount you want to send.",
      "content": "Enter the amount you want to send. Use the keypad on your screen to enter the amount you want to send to the other person and tap Proceed. If you're sending money via UPI ID, you'll need to enter your UPI PIN for your payment to be processed. [4] X Research source You only need the UPI PIN to send money, not to receive it. After you send the money, you'll get a notification from Google Pay or an SMS text that you've sent the funds. If the transaction fails, you might get multiple SMSes for it. The first explains the debit, and the other explains the refund. If you can't find the person that you want to pay, or they can't find you, make sure the \"Allow people to find you\" option is enabled. It's disabled by default. You can do this in the app by tapping your profile picture, then going to Settings > Privacy and Security > How people find you on Google Pay > Allow ."
    },
    {
      "title": "Open the Google Pay app.",
      "content": "Open the Google Pay app. You can only add Standard Chartered Bank, OCBC, and DBS Paylah bank accounts."
    },
    {
      "title": "Tap your profile picture.",
      "content": "Tap your profile picture. It's on the top right of your screen."
    },
    {
      "title": "Tap Payment methods.",
      "content": "Tap Payment methods . This brings up more options."
    },
    {
      "title": "Tap Add bank account.",
      "content": "Tap Add bank account . You'll see a list of eligible banks."
    },
    {
      "title": "Tap your bank and sign into your account.",
      "content": "Tap your bank and sign into your account. You should be redirected automatically to your bank's website so you can sign in. Verify your identity by entering the code sent to your phone from the bank. You'll see a text field for the code once you log in."
    },
    {
      "title": "Choose the account you want to use with Google Pay.",
      "content": "Choose the account you want to use with Google Pay. If you have multiple accounts with one bank, you'll be able to select a specific account now. Tap Accept or Confirm to continue and accept the Terms of Service."
    },
    {
      "title": "Continue following the on-screen instructions.",
      "content": "Continue following the on-screen instructions. Once you accept the Terms of Service, you should be done! Your bank might have a few more buttons to press, like Confirm to make sure you want to link it to Google Pay. [5] X Research source"
    }
  ]
}