{
  "url": "https://www.wikihow.com/Make-a-Transverse-Flute-from-Household-Supplies",
  "title": "How to Make a Transverse Flute from Household Supplies",
  "steps": [
    {
      "title": "Use straws for a simple pan flute.",
      "content": "Use straws for a simple pan flute. The pan flute, or pan pipe, is a type of flute consisting of a group of small pipes of graduated length to produce a melody. Pan flutes are usually made of wood, but many other materials can be used. A very basic pan flute can be built out of drinking straws."
    },
    {
      "title": "Gather several straws.",
      "content": "Gather several straws. Most people are comfortable making a pan flute with eight straws, but you can use more or fewer depending on how many you can manage on one instrument."
    },
    {
      "title": "Leave one straw uncut, then use a scissors to cut an inch off the second straw, so that each straw is an inch shorter than the previous one.",
      "content": "Leave one straw uncut, then use a scissors to cut an inch off the second straw, so that each straw is an inch shorter than the previous one."
    },
    {
      "title": "Tear or cut a length of tape sufficient to wrap around the straws.",
      "content": "Tear or cut a length of tape sufficient to wrap around the straws."
    },
    {
      "title": "Lay the straws side by side on the tape and fold the tape around the straws.",
      "content": "Lay the straws side by side on the tape and fold the tape around the straws. If you wish, you can decorate the tape with markers or crayons either before or after you secure the straws."
    },
    {
      "title": "Play the pan flute by blowing across the top of the straws.",
      "content": "Play the pan flute by blowing across the top of the straws. Hold the straw you wish to play vertically under your lower lip. Gently blow across the top of the straw until you get a sound."
    },
    {
      "title": "Gather and wash the bottles you want to use.",
      "content": "Gather and wash the bottles you want to use. You can use as many bottles as you want, and any material, but at least six are recommended. Glass bottles are recommended, but you can also use plastic. [1] X Research source"
    },
    {
      "title": "Blow a note on each bottle to determine their pitch.",
      "content": "Blow a note on each bottle to determine their pitch. Raise the pitch by adding water to each bottle."
    },
    {
      "title": "Arrange the bottles according to pitch.",
      "content": "Arrange the bottles according to pitch."
    },
    {
      "title": "Pick up a bottle and start playing.",
      "content": "Pick up a bottle and start playing."
    },
    {
      "title": "Make a cardboard tube kazoo.",
      "content": "Make a cardboard tube kazoo . Gather your materials. You will need a cardboard tube like the ones from a roll of paper towels or toilet paper, a piece of waxed paper big enough to cover one end of the roll, and a rubber band. Decorate the tube, if desired. If you use crayons, be careful not to crush the tub. Or you can use paints. Be sure to let the paint dry overnight. Poke holes down the side of the tube. You can use a sharp pencil, or any instrument with a sharp point. Make sure children have adequate supervision when handling any kind of sharp instrument. Secure the waxed paper to one end of the tube with the rubber band. Play the kazoo by holding the open end to your mouth. Try to produce a kazoo sound by humming or singing syllables like \"doo, doo, doo\" into the tube. Vary the pitch of the notes by covering one or more holes with your fingers."
    },
    {
      "title": "Make a simple tube flute.",
      "content": "Make a simple tube flute. You can create a simple flute using a small-diameter cardboard such as a paper towel or empty wrapping paper roll. Since making a cardboard flute requires the use of sharp objects like craft knives and scissors, young children should be supervised by an adult if they will be handling these tools."
    },
    {
      "title": "Cut the tube to the desired length.",
      "content": "Cut the tube to the desired length. The Music Revitalization Project, an organization dedicated to keep concert band music alive, recommends a length of no more than two feet."
    },
    {
      "title": "Using scissors or a craft knife, cut an oval hole approximately two inches from the end of the tube about one-half to one inch to create a sound hole (embouchure).",
      "content": "Using scissors or a craft knife, cut an oval hole approximately two inches from the end of the tube about one-half to one inch to create a sound hole (embouchure)."
    },
    {
      "title": "Plug the end closest to the sound hole using modeling clay or any other medium that closes the end completely.",
      "content": "Plug the end closest to the sound hole using modeling clay or any other medium that closes the end completely."
    },
    {
      "title": "Cut six holes down the length of the tube at even intervals.",
      "content": "Cut six holes down the length of the tube at even intervals. Make sure the holes are not bigger than your fingertips."
    },
    {
      "title": "Decorate the flute with crayons, markers, or any other medium.",
      "content": "Decorate the flute with crayons, markers, or any other medium. If you use paint, allow it to dry at least overnight."
    },
    {
      "title": "Play the flute by holding it parallel to the ground and blowing across the sound hole.",
      "content": "Play the flute by holding it parallel to the ground and blowing across the sound hole. Create notes by covering and uncovering the finger holes in various combinations. Keep practicing until you get a sound."
    },
    {
      "title": "Use PVC for a more durable DIY flute.",
      "content": "Use PVC for a more durable DIY flute. Polyvinyl Chloride (PVC) pipe is inexpensive and readily available. It can be cut like wood, and produces a durable flute that you can carry in a backpack without worrying about breakage. The following method is inspired by the instructions for the Native American-like PVC Flute featured on the Physics of Music site."
    },
    {
      "title": "Gather these materials and tools.",
      "content": "Gather these materials and tools. Please note that the use of drills, files, and other tools should only be used by persons who are proficient with using them. 3/4\" PVC (Hot/cold water) pipe 1/2\" PVC pipe (short length, optional) 3/4\" to 3/4\" PVC coupler 3/4\" to 1/2\" PVC reducer Wood dowel, cork or other plug material. Drill with 1/8\", 1/4\" and 3/16\" bits Small file (jeweler's file) or equivalent Sandpaper Ruler"
    },
    {
      "title": "Cut 3/4\" PVC pipe to length.",
      "content": "Cut 3/4\" PVC pipe to length."
    },
    {
      "title": "Flatten approx 1.5\" at one end with file, sandpaper, (or use a router or end mill).",
      "content": "Flatten approx 1.5\" at one end with file, sandpaper, (or use a router or end mill)."
    },
    {
      "title": "Drill 1/4\" hole at very end of tube.",
      "content": "Drill 1/4\" hole at very end of tube."
    },
    {
      "title": "Drill two 1/8\" holes side by side for rectangular hole",
      "content": "Drill two 1/8\" holes side by side for rectangular hole"
    },
    {
      "title": "Use a small file to make the hole approximately 3/16\" x 5/16\" wide with (optional) undercutting as in the diagram on the website.",
      "content": "Use a small file to make the hole approximately 3/16\" x 5/16\" wide with (optional) undercutting as in the diagram on the website."
    },
    {
      "title": "Drill finger holes.",
      "content": "Drill finger holes."
    },
    {
      "title": "Make and install the plug.",
      "content": "Make and install the plug. Use cork, modeling clay, doweling, or a rubber stopper to make the plug."
    },
    {
      "title": "Assemble the adapters as shown on the website.",
      "content": "Assemble the adapters as shown on the website. Insert pipe reducer into pipe coupler. Slide pipe coupler assembly onto closed end of flute."
    },
    {
      "title": "Focus on fun, especially for children.",
      "content": "Focus on fun, especially for children. Music education enhances skills in other area of learning. [2] X Research source Kids can learn social skills, language skills, and building skills while having fun."
    },
    {
      "title": "Have a maker party.",
      "content": "Have a maker party. Small children can have fun making and decorating straw and cardboard tubes for flutes, while older children and adults can learn to handle sharp implements and power tools."
    },
    {
      "title": "Organize a band.",
      "content": "Organize a band. Make flutes and other instruments of different sizes and shapes and let the children (and adults) make their own music. Host a virtual jam session. During times when it is not possible to get together, organize a concert online with a video conferencing service like Zoom . Using the meeting function of Zoom, make sure \"Share Screen\" and \"Multiple participants can share simultaneously\" are enabled. [3] X Research source There may be some false starts and stops while jamming, but that's all part of the fun."
    },
    {
      "title": "Have the kids write their own music to go with the instruments.",
      "content": "Have the kids write their own music to go with the instruments. Teach the kids to read music. Memorizing notes and scales are a necessary part of learning to read music. Make it more fun by letting children play the notes as they learn them."
    },
    {
      "title": "Create a presentation for a science or maker fair.",
      "content": "Create a presentation for a science or maker fair. Demonstrate principles of science and art by having the band play their homemade instruments and original music,"
    }
  ]
}