{
  "url": "https://www.wikihow.com/Movie-Drinking-Games",
  "title": "25 Movie Drinking Games",
  "steps": [
    {
      "title": "",
      "content": "Starring Neve Campbell, Courteney Cox, and Drew Barrymore, Scream follows a group of high school students as they’re terrorized by the mysterious masked serial killer, Ghostface. [1] X Research source Scream is one of the most iconic slasher films of the '90s, and it’s a great choice if you’re hoping to play a fun drinking game. Here are the rules: Take a sip whenever: A phone rings. A character dies. Ghostface appears on screen. Gale is rude to her cameraman. Randy lists his rules for surviving a horror movie. There’s a reference to a different horror movie."
    },
    {
      "title": "",
      "content": "In Jurassic Park , a paleontologist is invited to tour a new theme park filled with some very interesting attractions—genetically engineered dinosaurs. Directed by Steven Spielberg and starring Sam Neill, Laura Dern, and Jeff Goldblum, this all-time classic is the perfect movie for a drinking game! Take a sip whenever: Someone says “DNA.” Someone is killed. The Jurassic Park logo appears on screen. Someone mentions outdated technology. Hammond says “Spared no expense…” The iconic theme music plays."
    },
    {
      "title": "",
      "content": "If you loved Shrek when you were a kid, you’ll probably find that it’s just as entertaining to watch as an adult. In this classic, a cranky ogre named Shrek goes on a quest to rescue a beautiful princess in order to regain control of his beloved swamp. Starring Mike Myers, Eddie Murphy, and Cameron Diaz, Shrek is a nostalgic and hilarious choice for your drinking game. Take a sip whenever: Shrek yells “Donkey!” Someone says “Lord Farquaad.” Shrek mentions his swamp. Donkey starts to sing. Fiona turns into an ogre. There’s a joke about a bodily function (burping, etc). [2] X Research source"
    },
    {
      "title": "",
      "content": "With its notoriously bad acting and dialogue, The Room is widely considered to be one of the worst movies ever made. However, in the years following its release, The Room became a cult hit with incredibly loyal fans. [3] X Research source If you’re looking for a wild and hilarious drinking game experience, The Room might be right up your alley. Here are the rules: Take a sip whenever: A character says, “Oh, hi.” Someone throws a football. A random character enters with no introduction. You hear the phrase “Don’t worry about it.” A pointless or unnecessary scene ends. Johnny laughs."
    },
    {
      "title": "",
      "content": "Zoolander stars Ben Stiller as Derek Zoolander, an incredibly ditzy male model who gets wrapped up in a sinister plot. The movie also stars Owen Wilson as rival model Hansel, and Will Ferrell as villainous fashion mogul, Mugatu. Zoolander is a truly wacky and wild ride, which makes it a fitting choice for a drinking game. Here are the rules: Take a sip whenever: Someone says “blue steel.” Someone says “Hansel” or “Mugatu.” Someone says “good looking.” Someone walks down a runway. There’s a celebrity cameo. Zoolander mispronounces a common word."
    },
    {
      "title": "",
      "content": "The Rocky Horror Picture Show follows a couple named Brad and Janet who come upon a spooky mansion after getting a flat tire in a storm. At the mansion, they encounter a cast of strange characters, including a butler named Riff Raff, a maid named Magenta, and the mad scientist Dr. Frank-N-Furter. This movie musical is a cult classic, and it’s an excellent choice for a drinking game. Take a sip whenever: Brad says “Janet.” Janet faints. Someone dies. Dr. Frank-N-Furter has an outfit change. A motorcycle appears on screen. Characters break out into song or dance."
    },
    {
      "title": "",
      "content": "Based on Stephen King’s novel, The Shining is a classic of the horror genre. The movie follows a writer named Jack Torrance who takes a job at an isolated hotel in an attempt to cure his writer’s block. As Jack and his family spend time in the hotel, strange and sinister happenings begin to occur. If you’re looking for a spooky option for your movie night, The Shining is an excellent choice! Take a sip whenever: Room 237 is mentioned or shown. A title card comes up on the screen. Danny rides his bike. Someone says “Doc.” Wendy says “Jack.” There’s blood on screen."
    },
    {
      "title": "",
      "content": "In this classic slasher film, a terrifying villain named Freddy Krueger haunts the dreams of a group of teens. Unfortunately, when the teens die in their dreams, they also die in real life! A Nightmare on Elm Street is filled with frights, making it a great choice for a movie night around Halloween. Here are the rules to follow for your drinking game: Take a sip whenever: Someone falls asleep. Someone wakes up. You see Freddy Krueger. You’re not sure if a character is awake or in a dream. Freddy scrapes his finger-knives against something. A character tries to stay awake by eating or drinking something."
    },
    {
      "title": "",
      "content": "In Back to the Future , high school student Marty McFly is accidentally sent back in time when an experiment goes wrong. As he travels through time, Marty must make sure his parents meet and fall in love in the past, so that he can continue to exist and make it back to his own time. This sci-fi classic is a super entertaining watch, and it’s a great choice for a drinking game. Take a sip whenever: Someone says “McFly.” Doc says “Great Scott!” Marty accidentally references the future. Someone uses 1950s slang. Someone says the date. You hear the theme music."
    },
    {
      "title": "",
      "content": "In this beloved classic, a farmhand named Wesley goes on a quest to be reunited with his one true love Buttercup, who has been forcibly engaged to the prince of the kingdom they live in. The Princess Bride is filled with adventure and romance, and it’s a super popular choice for movie nights. Here’s a fun drinking game to play while watching: Take a sip whenever: Someone says “as you wish.” Someone says “inconceivable.” Someone says “true love.” Prince Humperdink is mentioned. Inigo Montoya says “My name is Inigo Montoya. You killed my father. Prepare to die.” The story cuts back to the grandson and grandfather reading the book."
    },
    {
      "title": "",
      "content": "Starring Mark Hamill as Luke Skywalker, Carrie Fisher as Princess Leia, and Harrison Ford as Han Solo, the original Star Wars trilogy is one of the most beloved film series of all time. If you’re a fan of this iconic franchise, consider hosting a movie marathon and playing this super fun drinking game: Take a sip whenever: A lightsaber is turned on or off. Someone mentions the Force. Yoda says something wise. You see a wipe transition between scenes. Someone says “I’ve got a bad feeling about this.” The Imperial March plays."
    },
    {
      "title": "",
      "content": "In these classic action movies, Harrison Ford stars as Indiana Jones, an adventurous archaeologist who embarks on various exciting quests. The Indiana Jones movies are beloved by many, and the films have even inspired a fun ride at Disneyland! Here are the rules to follow if you want to play a drinking game while watching: Take a sip whenever: Indy uses his whip. The classic theme music plays. Indy’s journey is shown on a map. Someone says “Dr. Jones.” Snakes are shown on screen. Indy loses his hat."
    },
    {
      "title": "",
      "content": "One of the biggest blockbusters of the ’90s (and of all time), Titanic follows Jack and Rose as they fall in love on the titular doomed ship. Packed with action, romance, and tragedy, Titanic is an incredibly entertaining choice for a movie night, and it also works perfectly for a drinking game. Here’s how to play: Take a sip whenever: Someone mentions the Titanic being “unsinkable.” Someone mentions “The Heart of the Ocean” necklace or you see it on screen. The melody to “My Heart Will Go On” plays. You see the iceberg on screen. Rose says “Jack” or Jack says “Rose.” There’s an instance of ominous foreshadowing."
    },
    {
      "title": "",
      "content": "Based on the fantasy novels by J.R.R. Tolkien, The Lord of the Rings trilogy is one of the most successful film franchises ever. The movies follow Frodo Baggins, a Hobbit who embarks on a quest to destroy a mysterious and powerful ring. [4] X Research source Whether you’re planning a marathon viewing of all three films or just watching one, this drinking game is sure to entertain everyone! Take a sip whenever: Gandalf smokes his pipe. A Hobbit talks about food. Gollum says, “My precious.” Frodo puts on the ring. Sam says “Mr. Frodo.” Gimli and Legolas compete with each other to kill more orcs."
    },
    {
      "title": "",
      "content": "The Harry Potter films follow a young wizard named Harry as he attends Hogwarts School of Witchcraft and Wizardry and faces off with the villainous Lord Voldemort. These movies hold a special place in many people’s hearts, which makes them the perfect choice for a movie night with your friends. Set up some decorations, make some themed cocktails and snacks, and play this super fun drinking game : Take a sip whenever: Someone says the full name “Harry Potter.” Someone mentions Muggles. Someone mentions “He Who Must Not Be Named” or “You Know Who.” Harry’s scar hurts. Hermione answers a question in class. Ron says “Bloody hell.” Malfoy says, “My father will hear about this!” Points are awarded or taken away from any of the houses."
    },
    {
      "title": "",
      "content": "Perhaps the most iconic teen movie of the early 2000s, Mean Girls follows the story of Cady Heron, a teenage girl who moves to the U.S. after growing up in Africa. When she enrolls in her new school, Cady meets the Plastics, a clique of mean girls run by the terrifying queen bee, Regina George. Mean Girls is funny and endlessly quotable, making it the perfect choice for a drinking game. Take a sip whenever: Someone says Regina George’s full name. Cady’s name is mispronounced. Karen is called stupid. Gretchen says “fetch.” Janis crosses off a task on her blackboard. The Burn Book is mentioned or shown."
    },
    {
      "title": "",
      "content": "Legally Blonde stars Reese Witherspoon as Elle Woods in one of her most iconic roles. After Elle's boyfriend unexpectedly dumps her for not being “serious” enough, she decides to apply to Harvard Law School to prove him wrong. Co-starring Selma Blair, Jennifer Coolidge, and Luke Wilson, Legally Blonde is a modern classic that you’re sure to enjoy while playing your drinking game. [5] X Research source Take a sip whenever: Elle uses legal terminology. Bruiser appears in a new outfit. Someone says “Harvard.” Someone mentions a wedding or engagement ring. Someone says “Bend and snap.” Someone says “Warner Huntington III.”"
    },
    {
      "title": "",
      "content": "This beloved movie musical stars Amanda Seyfried as Sophie, a young woman who invites three of her mother’s past lovers to her wedding to try to figure out which one of them is her father. Also starring Meryl Streep, Pierce Brosnan, and Colin Firth, Mamma Mia is an incredibly fun movie musical packed with amazing ABBA songs. Here’s a drinking game to play while you watch: Take a sip whenever: Someone says the names “Harry,” “Bill,” or “Sam.” Sophie says “father” or “dad.” A song begins. A character drinks alcohol. A character gets in the ocean. The wedding is mentioned."
    },
    {
      "title": "",
      "content": "When the iconic vampire movie Twilight was released in 2008, it became a worldwide phenomenon. The series follows Bella Swan, a high school student who falls in love with a vampire named Edward Cullen. Starring Kristen Stewart, Robert Pattinson, and Taylor Lautner, the Twilight saga is a great choice for a movie marathon, complete with themed food and drinks, costumes, and this fun drinking game . Take a sip whenever: A vampire sparkles in the sun. Bella bites her lip. Anyone says the word “vampire.” Jacob takes his shirt off. Bella refers to either of her parents by their first names. The vampires and werewolves act hostile toward each other."
    },
    {
      "title": "",
      "content": "This comedy horror film follows a group of survivors as they trek across America in search of a new home during a zombie apocalypse. [6] X Research source The cast includes Jesse Eisenberg, Emma Stone, Woody Harrelson, and Abigail Breslin, and the movie is packed with humor, scares, and of course, zombies. Here’s a drinking game to play while watching: Take a sip whenever: One of Columbus’s rules appears on the screen. Someone talks about Twinkies. Tallahassee kills a zombie. The word “zombie” is said. A living character is introduced. Someone talks about life before the zombies."
    },
    {
      "title": "",
      "content": "The Hangover follows a group of friends who head to Vegas for a bachelor party and end up having a truly wild and memorable time. It’s a hilarious favorite for movie nights, and with a title like The Hangover, it’s definitely a fitting choice for a drinking game! Here are the rules: Take a sip whenever: The characters drink alcohol. Someone says “Vegas.” You see a famous Vegas landmark. The group remembers something that they’d forgotten. Stu mentions his missing tooth. Alan says an alternative to a swear word."
    },
    {
      "title": "",
      "content": "In this comedy, an ensemble cast of actors including Jonah Hill, Seth Rogen, Michael Cera, and Emma Watson play fictionalized versions of themselves. When the apocalypse starts during a Hollywood party, the cast of celebrities find themselves in the middle of a fight for survival. This Is the End is a fast-paced, wild ride, making it a fun choice for your drinking game. Take a sip whenever: Someone dies. Someone is “captured.” A character mentions one of the films they starred in. The characters fight over food and/or water. Seth and Jay’s friendship troubles are mentioned. A demon or scary creature appears."
    },
    {
      "title": "",
      "content": "Since the release of Iron Man in 2008, Marvel Studios has churned out tons of superhero blockbusters, including the Guardians of the Galaxy , Thor , and Captain America movies. Whether you’re watching one of these films or embarking on a Marvel movie marathon, this drinking game is sure to make the experience even more fun! Take a sip whenever: A character puts on a super suit. A villain appears. There’s a reference to another Marvel movie. SHIELD is mentioned. Nick Fury is shown or mentioned. Stan Lee makes a cameo."
    },
    {
      "title": "",
      "content": "Leonardo DiCaprio and Carey Mulligan star as Gatsby and Daisy in Baz Luhrmann’s adaptation of the classic novel. Filled with glitz, glamour, and a great soundtrack, The Great Gatsby is a super entertaining choice for a drinking game. To get in the mood, you can even dress up in 1920s-inspired outfits and make themed cocktails! Take a sip whenever: Gatsby says “old sport.” Gatsby’s smile is mentioned. The green light is visible in the distance. Nick is a third wheel with two other characters. A modern song plays. Gatsby is shown looking through a window. The TJ Eckleberg billboard is shown, or “the eyes of God” are mentioned."
    },
    {
      "title": "",
      "content": "Starring Timothée Chalamet and Zendaya, the Dune movies are hugely entertaining sci-fi blockbusters. Packed with great acting, epic battle scenes, and an incredible score by Hans Zimmer, the Dune films make the perfect double feature for your movie night. Here’s a drinking game to play while you watch: Take a sip whenever: A character uses The Voice. A sandworm appears on screen. Someone mentions “spice.” Stilgar says “Lisan al Gaib.” Paul has one of his visions. Someone says “Arrakis.”"
    }
  ]
}