{
  "url": "https://www.wikihow.com/Meet-Your-Girlfriend%27s-Parents",
  "title": "How to Meet Your Girlfriend's Parents",
  "steps": [
    {
      "title": "Dress neat and have your hair well kempt.",
      "content": "Dress neat and have your hair well kempt. When meeting her family for the first time, your appearance is vitally important. Take extra time showering and doing your hair. Dress business casual unless you are going to a formal event. The better you look, the better you’ll feel. [1] X Research source Business casual will include slacks or khakis and a button down or a dress. Opt for closed toed shoes, as well."
    },
    {
      "title": "Find out basic information about them from your girlfriend.",
      "content": "Find out basic information about them from your girlfriend. Find out what her parents do, where they’re from, and basic tidbits about their personalities before meeting them. [2] X Research source For instance, if she tells you that her mom is a neat freak, you will want to be as clean as possible when meeting her. Know their first names and make special note of their last names and if they are different if they’re unmarried or divorced."
    },
    {
      "title": "Clean your place if they’re coming over.",
      "content": "Clean your place if they’re coming over. Maybe you have decided to cook dinner for her parents. If so, be sure that the place is spotless before their arrival. Don’t just clean the common areas like the kitchen and dining room; be sure to tidy up the bedroom and other areas so you can give them a full tour. If you and your girlfriend live together, don’t expect her to do all the cleaning and cooking when her parents visit. Contribute an equal amount."
    },
    {
      "title": "Bring a gift.",
      "content": "Bring a gift. Though it is certainly not required, bringing a gift for her family is a thoughtful gesture. If her parents drink, bring a bottle of wine. Alternatively, you can bring a bouquet of flowers for her mother."
    },
    {
      "title": "Prepare for questions.",
      "content": "Prepare for questions. If she is close with her parents, they will likely have questions for you. Prepare for any questions they may ask. For instance, they might ask you what your intentions are with their daughter or what you do for work. If they ask you a tough one, don’t worry. Just be honest and be yourself. You’ll do great! [3] X Research source You can respond by saying something like “I really like your daughter. She’s a wonderful person and you all did a great job raising her. I have nothing but the best intentions for her.”"
    },
    {
      "title": "Show up on time.",
      "content": "Show up on time. Show your girlfriend’s family that you respect them and their time by being punctual. Give yourself more time to get ready than usual so you aren’t rushed and set an alarm on your phone alerting when you need to leave. If you’re driving to meet them, leave early in case of traffic. [4] X Research source If you’re meeting them at their home, be exactly on time. Don’t arrive early - they might still be preparing for your visit. If meeting them at an event or restaurant, arrive a few minutes early to greet them."
    },
    {
      "title": "Greet them with handshakes or hugs.",
      "content": "Greet them with handshakes or hugs. Find out from your girlfriend how her parents typically greet others. Depending on where they're from, they might have different forms of greetings. They may prefer to bow, shake hands, hug, or even kiss on the cheek. [5] X Research source If her father likes to shake hands, extend your hand to him when you meet. Give him a firm handshake, but not too firm. When in doubt, wait to see how they greet you. Many parents will shake hands or hug without you initiating."
    },
    {
      "title": "Use the appropriate greeting when meeting them.",
      "content": "Use the appropriate greeting when meeting them. Don’t call them by their first name unless they tell you to. Give them a formal greeting by calling them Mr. and Mrs./Ms. followed by their last name(s). [6] X Research source Find out if her mother is married before greeting her. Mrs. is the formal greeting for married women. Ms. is for unmarried women."
    },
    {
      "title": "Be affectionate but not sexual with your girlfriend.",
      "content": "Be affectionate but not sexual with your girlfriend. Pull her chair out, open doors for her, and touch her on occasion. This will show her parents that you care about and respect their daughter. [7] X Expert Source Erika Kaplan Relationship Advisor Expert Interview. 1 October 2020. Try not to kiss her in the lips in front of her parents, but do put your arm around her or hold her hand."
    },
    {
      "title": "Maintain good posture and eye contact.",
      "content": "Maintain good posture and eye contact. Good posture demonstrates confidence, so sit up straight and walk with a purpose. Make eye contact most of the time while speaking, but look away occasionally. If you feel nervous, just talk a few deep breaths in and out quietly. Remember - everything’s going to be okay. [8] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source If you're feeling nervous the day of meeting them, try doing a 30-minute session of cardio earlier in the day. Go jogging or ride a bike. Even a brisk walk will help get rid of your nerves."
    },
    {
      "title": "Turn off your phone.",
      "content": "Turn off your phone. When you’re with her family, be completely focused on them. Keep your phone off or at least out of your hands during this meeting. Show them that they and their daughter are important to you by giving them your full attention. [9] X Research source If you have to keep your phone on for work, let them know. Say “If my phone rings, I want to apologize in advance. I’m actually on call tonight at work.”"
    },
    {
      "title": "Have good dinner-time manners.",
      "content": "Have good dinner-time manners. Whether eating in their home or going to a restaurant, have good manners at the dinner table. Don’t slurp or eat your food too fast. [10] X Expert Source Erika Kaplan Relationship Advisor Expert Interview. 1 October 2020. Try to eat as much food as you can so you don’t seem wasteful. Eat if they cooked for you unless you have dietary restrictions. Turning food down can be seen as a sign of disrespect. Ask if you can help with the dishes when eating in their home. Be sure to clean up after yourself, too. If you spill anything or leave crumbs, use your napkin to wipe it up. If you went out to a restaurant with them, pay if you’re financially able to. Be careful when drinking alcohol. Only accept a drink if you are of legal age. You may wish to avoid drinking at all unless you are offered a drink. Even then, avoid drinking too much. Reader Poll: We asked 942 wikiHow readers, and 53% of them agreed that the best way to make a good impression on your partner's parents is to offer to help out with cooking or cleaning . [Take Poll]"
    },
    {
      "title": "Be respectful of their home.",
      "content": "Be respectful of their home. When visiting them at their home, have good manners. Compliment them on how lovely their house is. When you walk through the door, ask them if they would like you to remove your shoes. [11] X Research source"
    },
    {
      "title": "Find something you have in common.",
      "content": "Find something you have in common. Don’t force conversations with them; instead, find natural ways to spark discussion. Maybe her dad is wearing a jersey of your favorite team or her mom mentions a book you’re reading. [12] X Expert Source Erika Kaplan Relationship Advisor Expert Interview. 1 October 2020. Her family will appreciate having common interests with you. [13] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source You might say “Oh, you watch Insecure , too? That’s one of my favorite shows. Are you Team Issa or Team Lawrence?”"
    },
    {
      "title": "Ask open-ended questions.",
      "content": "Ask open-ended questions. Instead of basic 'yes' or 'no' questions, or questions that require one or two word answers, ask thought-provoking questions. This will show that you are genuinely interested in getting to know them. [14] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source For instance, instead of asking what college they went to, you can say “Kelsey tells me you went to Duke. Did you have a good experience there or go to any basketball games?”"
    },
    {
      "title": "Ask for funny stories about your girlfriend.",
      "content": "Ask for funny stories about your girlfriend. Another way to keep the conversation flowing is to ask for funny stories about your girlfriend. Ask them to show you baby pictures or tell you stories about her growing up. These stories will probably make all of you laugh and will help ease any tension you might still be feeling. Say something like “Sarah was telling me about the beach trip that you all went on where she was pinched by a crab. Do you have any other funny stories about her growing up?”"
    },
    {
      "title": "Keep the conversation light.",
      "content": "Keep the conversation light. Avoid discussing very serious topics like politics or religion. If they start discussing the subjects and you disagree with their views, keep your opinions to yourself. You don’t want to get into debates this early in the game. [15] X Research source"
    }
  ]
}