{
  "url": "https://www.wikihow.com/Remove-Static-from-Polyester-Clothes",
  "title": "How to Remove Static from Polyester Clothes",
  "steps": [
    {
      "title": "Pour fabric softener to the wash.",
      "content": "Pour fabric softener to the wash. Polyester clothes can typically be washed at home in warm water unless otherwise specified on the tag. [1] X Research source Next time you are washing your polyester garments, add a capful of your favorite fabric softener to help reduce the build-up of static. The fabric softeners are positively charged, so they will bond with the negative charge found in the polyester clothes, which helps balance and neutralize static buildup. [2] X Research source [3] X Expert Source Kamel Almani Laundry & Cleaning Specialist Expert Interview. 13 April 2021."
    },
    {
      "title": "Use a dryer sheet.",
      "content": "Use a dryer sheet. The friction created when garments rub together in a dry environment, like a tumble dryer, can cause electrical charges to cling to the fabric, which creates static electricity. [4] X Research source To help minimize static, add a couple of dryer sheets to your tumble dryer. As the sheets heat up, they release an oil that lightly coats the polyester clothing. This lubrication helps minimize the amount of friction, which reduces static cling. [5] X Research source Be sure to dry polyester garments at a low temperature. [6] X Research source"
    },
    {
      "title": "Add a few dryer balls.",
      "content": "Add a few dryer balls. When added to the dryer, wool dryer balls can help clothes dry more quickly and help reduce static cling by preventing the clothes from sticking together. As they move around, the balls help separate the clothing and expose them to the dry air. [7] X Research source This separation also reduces friction, thereby minimizing static. Dryer balls aren’t as effective if they are added to a large load of clothes. Make sure you only add them to small and medium loads so they have room to move around. [8] X Research source Add three large dryer balls per load. [9] X Research source If you don't have a dryer ball, add a tennis ball or two to your tumble dryer to get the same effect."
    },
    {
      "title": "Hang your clothes to dry.",
      "content": "Hang your clothes to dry. Skip the dryer all together and air dry your polyester clothes to prevent the buildup of static electricity. [10] X Expert Source Kamel Almani Laundry & Cleaning Specialist Expert Interview. 13 April 2021. Allowing polyester clothing to air dry won’t damage the garments, so clip the garments on a clothes line to dry in the sun, or drape the clothes over a drying rack indoors. [11] X Research source"
    },
    {
      "title": "Spray aerosol hairspray onto your garment.",
      "content": "Spray aerosol hairspray onto your garment. If your polyester garment is holding a static charge, turn the garment inside out. Grab a can of aerosol hairspray and hold it about eight inches away from the polyester garment. Spray the hairspray onto the garment to alleviate the static cling. [12] X Research source This helps reintroduce moisture in the fabric, which can help break up static charge. [13] X Research source"
    },
    {
      "title": "Moisturize with lotion before wearing a polyester garment.",
      "content": "Moisturize with lotion before wearing a polyester garment. Dry skin carries a positive charge and polyester carries a negative charge. As your skin rubs against the polyester garment, it creates static electricity. This is common in the winter when skin tends to be drier. Alleviate the charge by moisturizing before getting dressed."
    },
    {
      "title": "Rub a dryer sheet over your clothes.",
      "content": "Rub a dryer sheet over your clothes. Dryer sheets are great for eliminating static in the tumble dryer, but they can also be used to remove static after the clothes have already dried. Grab a dryer sheet and glide it over the polyester garment to remove some of the static cling. [14] X Research source"
    },
    {
      "title": "Clip a safety pin along the hem of your polyester clothes.",
      "content": "Clip a safety pin along the hem of your polyester clothes. If you are at the office and your polyester garments are clinging to you, use a safety pin to remove the static buildup. Clip a safety pin inside the lining of your garment along the hem or a seam so you do not damage the clothing. The metal in the pin will act as a grounding device, which neutralizes the static charge in your clothes."
    },
    {
      "title": "Rub a wire hanger over your clothing.",
      "content": "Rub a wire hanger over your clothing. If you have a wire coat hanger, you can use that to remove static cling. Simply rub the wire hanger over the affected area to break the charge. Like the safety pin, the metal hanger neutralizes the buildup of electrical ions on your clothing, removing the static cling. [15] X Research source If you notice your garment has a buildup of static before putting it on, run a wire hanger over it to remove the charge."
    },
    {
      "title": "Use water to remove static.",
      "content": "Use water to remove static. Lightly dampen a washcloth or your hands with water. Glide the washcloth or your damp hands over the garment. The water will neutralize the static charge and remove the cling. [16] X Research source Plus, because polyester dries quickly, you won’t have damp clothes for too long."
    },
    {
      "title": "Touch grounded metal.",
      "content": "Touch grounded metal. If you are out and about and your polyester garment has a static cling, look for a metal pole, pipe, or lamppost that you can safely reach. Simply hold onto the metal pole. The metal will help remove the static charge from your clothing."
    },
    {
      "title": "Run a humidifier in your home.",
      "content": "Run a humidifier in your home. A humid environment can help reduce static cling and static shocks. A static charge can be dispelled more quickly when there are more water particles in the air to break it up. Buy a humidifier from your local pharmacy or department store to help eliminate static cling in your polyester garments. [17] X Research source"
    }
  ]
}