{
  "url": "https://www.wikihow.com/Purchase-a-Vehicle-for-Business",
  "title": "How to Purchase a Vehicle for Business",
  "steps": [
    {
      "title": "Register your company as an LLC or other business entity.",
      "content": "Register your company as an LLC or other business entity. Before you can purchase a vehicle in your company's name, your company must be registered with your state as a separate business entity apart from you. If you operate as a sole proprietor you can still purchase a vehicle and use it for business, but you'll be personally liable for the vehicle. [2] X Research source Even if you plan on buying the vehicle with cash, you still need a formal business structure to put the vehicle in the name of the business. A sole proprietorship that has a business name registered with the state as a \"dba\" may be able to purchase and register a vehicle in that name. However, since you are still operating as a sole proprietorship, you're still personally responsible for that vehicle."
    },
    {
      "title": "Get an employer identification number (EIN) from the IRS.",
      "content": "Get an employer identification number (EIN) from the IRS. Even if you don't have any employees, your EIN identifies your business legally for tax and financial purposes. You'll need an EIN to open a bank account in the name of your business and establish credit. [3] X Research source Set up an EIN directly with the IRS for free using the IRS's website. Go to https://sa.www4.irs.gov/modiein/individual/index.jsp to get started."
    },
    {
      "title": "Open business bank accounts.",
      "content": "Open business bank accounts. Once you have your EIN, you can set up bank accounts for your business. Shop around to find the bank you believe would best suit the needs of your business, both now and as it grows. [4] X Research source Depending on the type of business you have, you may need several different bank accounts. You'll need at least one operational account. If you have employees, you'll likely also need a separate payroll account. For retail sales, you'll also want a separate sales tax account."
    },
    {
      "title": "Establish your credit file.",
      "content": "Establish your credit file. Using your business name and EIN, register with a business credit bureau such as Dun & Bradstreet. You'll get a registration number to use when applying for business credit. You may want to start with a basic business credit card. If you are a contractor or builder, you also may be able to get credit from suppliers. Retailers may be able to get credit on inventory purchases. Once you have credit, make all payments on time and in full if possible. This will help strengthen your score as well as give you access to additional credit. Ideally, you want to have a 720+ credit score to get the best deal. Keep in mind it may take 2 or 3 years to build up your business's credit to the point that you can purchase a vehicle in your company's name on favorable terms. [5] X Research source"
    },
    {
      "title": "Find a local dealer with business vehicle experience.",
      "content": "Find a local dealer with business vehicle experience. A good way to find a reputable local dealer is to talk to fellow business owners and ask who they would recommend. You may also find referrals from local trade associations or small business organizations. [6] X Research source Shop smart. Visit the dealership on a weekday, when salespeople are less likely to be inundated with shoppers. Towards the end of the month or quarter, you may get a better deal from a salesperson desperate to make a quota. [7] X Research source There are many pros to working with a local dealer, including a full vehicle history report, but there can be less room for negotiation when it comes to price."
    },
    {
      "title": "Go directly to the manufacturer for fleet purchases.",
      "content": "Go directly to the manufacturer for fleet purchases. If you need several vehicles for your business, you can typically get the best deal with fleet vehicles purchased directly from the manufacturer. However, each manufacturer has its own restrictions for fleet purchasing. [8] X Research source For example, Ford requires you to have 15 cars in your fleet already, or have purchased 5 Fords in the past year. If you don't need this many vehicles, fleet purchasing won't work for you. Search on the internet for the fleet purchasing website of the manufacturer you're interested in for more information if you want to pursue this option."
    },
    {
      "title": "Explore financing options.",
      "content": "Explore financing options. If you're not planning to pay cash for the car, look for the best possible financing deal for your company. Optimally, you may qualify for a deal with 0 percent financing if your business has a solid credit history. [9] X Research source Dealers typically offer better financing options and slash prices at the end of the model year. The tricky part is that not all manufacturers debut their new model year cars at the same time of the year, so you'll have to do some research to find out when new model year cars are being released so you can plan ahead."
    },
    {
      "title": "Use a lease if you can't find a good financing deal.",
      "content": "Use a lease if you can't find a good financing deal. When you can't afford to buy a vehicle with cash, a lease may get you a lower down payment and smaller monthly payments than you would get if you financed the purchase of the vehicle. [10] X Research source Before you go with a lease, consider carefully how many miles a year you plan to drive the vehicle, and how long you intend to own it. For example, if you are using the vehicle for deliveries and will have it on the road for several thousand miles a week on average, a lease may not be the best option for you, regardless of the price."
    },
    {
      "title": "Get insurance for the vehicle.",
      "content": "Get insurance for the vehicle. If the vehicle will be used exclusively for business, you'll likely have to purchase commercial auto insurance. Typically you must show proof of insurance before you complete the final purchasing paperwork. [11] X Research source If you offer pick-up or delivery services to the general public during the course of your business, your state may require higher liability insurance coverage. [12] X Research source"
    },
    {
      "title": "Have documents drawn up in the name of your business.",
      "content": "Have documents drawn up in the name of your business. Even if you're personally signing the financing or lease agreement, the agreement should be made with your business, using your business's name and your business's EIN. [13] X Research source When you sign the documents, include your business title and indicate on all documents that you're signing on behalf of the business."
    },
    {
      "title": "Complete the tag and title application.",
      "content": "Complete the tag and title application. Each state has a tag and title application you must complete to register your vehicle with the state. Fill this out using your business's name and EIN to register the vehicle in your business's name. [14] X Research source You can get the application at your local DMV. Some states also make the application available for download online."
    },
    {
      "title": "Gather purchase documents and proof of identity.",
      "content": "Gather purchase documents and proof of identity. When you submit your tag and title application to the local DMV, you'll need documents to prove the business owns the vehicle, such as a bill of sale, finance agreement, or title (if you purchased the vehicle outright with cash). You'll also need a state-issued driver's license for yourself. [15] X Research source Some states require driver's license information for all owners of the business. For example, if you own an LLC with 2 other members, you would need driver's license information for all 3 members of the LLC. You also must provide proof of insurance for the vehicle before it will be registered. Check with the DMV or with your state's department of transportation to make sure you have the necessary insurance coverage for your type of business. [16] X Research source"
    },
    {
      "title": "Provide proof of your business's legal existence.",
      "content": "Provide proof of your business's legal existence. Just as a government-issued photo ID is required for individuals, you must show proof that your business is real. A copy of your business license is an easy way to do this. Other documents such as your articles of incorporation or organization, a partnership agreement, or employer tax registration may also be acceptable. Contact your state's department of motor vehicles to find out what you need."
    },
    {
      "title": "Take your application and documents to the DMV.",
      "content": "Take your application and documents to the DMV. Make a copy of your documents and application for your business's records before you submit them to the DMV. Making an appointment may save you wait time if that service is available. [17] X Research source You'll have to pay a fee for title and registration. You may also have to pay taxes. Call the DMV in advance to find out how much you'll have to pay and what methods of payment are accepted. Make sure you pay all fees and taxes from a business bank account."
    },
    {
      "title": "Get your vehicle inspected.",
      "content": "Get your vehicle inspected. Most states and many cities require safety and emissions inspections for all registered vehicles. Typically you must complete these inspections before your tags will be issued. [18] X Research source The DMV will inform you of the inspections you need to complete. You can also find out this information by calling in advance or checking the DMV's website. Pay any inspection fees using a business bank account and keep your receipts."
    },
    {
      "title": "Receive your tags and registration papers.",
      "content": "Receive your tags and registration papers. Once the DMV receives and processes your application, you'll get your tags and registration in the mail, usually within a week or so. Keep the original registration papers in the glove box of the car, and make copies for your business records. [19] X Research source Record the tag number in your business records as well. It can also be helpful to set calendar reminders so you'll know when you need to get another inspection or renew your registration."
    },
    {
      "title": "Use your business bank accounts to pay all vehicle expenses.",
      "content": "Use your business bank accounts to pay all vehicle expenses. Using a business bank account or credit card ensures that you're keeping business and personal expenses separate, and aren't inadvertently exposing yourself to liability. [20] X Research source If employees pay expenses, such as buying fuel while making deliveries, make sure you reimburse them for those expenses out of company funds. Keep all receipts for vehicle expenses, including insurance, fuel, and maintenance costs. These expenses are tax-deductible."
    }
  ]
}