{
  "url": "https://www.wikihow.com/Sell-a-Film-to-Netflix",
  "title": "How Can I Get My Movie on Netflix?",
  "steps": [
    {
      "title": "Identify and develop your movie’s selling points.",
      "content": "Identify and develop your movie’s selling points. Netflix (and the film industry in general) is extremely competitive, so you have to find ways for your movie to stand out. Consider the following questions and come up with answers for them before you move forward in your pitch process. If you don’t have good answers to these questions, take time to flesh out your film’s premise, development, and the buzz surrounding it before moving forward. [1] X Research source How has your film been received online? Has it created any buzz? Does your film have a substantial social media following? Do you have any big names or influencers in your film? How has your film engaged with its target audience? Does your movie focus on a popular and well-received subject? How does your movie fill a gap in Netflix’s current content offerings? How will your movie help Netflix to keep or attract subscribers?"
    },
    {
      "title": "Create a well-rehearsed pitch that makes your film stand out.",
      "content": "Create a well-rehearsed pitch that makes your film stand out. A pitch is basically a snapshot of your movie—it’s your chance to show how your film is unique and what sets it apart from the crowd. Use your pitch to present your movie’s title, synopsis, characters, setting, and other key details. Highlight any special selling points, like a big fan following or any noteworthy talent or influencers who helped make the film. [2] X Research source Make sure you have a really good grasp of your story because your agent or distributor will likely ask you follow-up questions. Have a fleshed-out picture of the setting, story arc, character arcs, and general themes. Also, be sure to keep your target audience in mind. Figure out what demographic you aim to reach with your film, then focus your pitch on their interests, concerns, and viewing habits. Add visual aids to your pitch (which is usually in a slideshow or slide deck form) to really make it pop—you are a filmmaker, after all! Plus, you can include visuals that help to sell the “world” that your story takes place in, like concept art, storyboards, and mood boards that convey your movie’s aesthetic and tone. [3] X Research source"
    },
    {
      "title": "Submit to a distributor or sales agent that has a relationship with Netflix.",
      "content": "Submit to a distributor or sales agent that has a relationship with Netflix. According to Netflix, the only way to submit a film to them is by going through a sales agent or a distributor who already has ties to their company. If you try to send your film or pitch to Netflix directly, you’re highly unlikely to hear back from them. So, look online for agents and distributors that have a history of selling films to Netflix and pitch your film to them—if they like your movie and think you have a good chance of being licensed by Netflix, they’ll pitch it to Netflix on your behalf and help you with any next steps. [4] X Research source Before you make a deal with an agent, decide on your distribution goals and non-negotiables when it comes to your deal. Also, ask your agent about all costs involved in your deal—you should know up-front what they’ll charge for marketing, deliverables, and other services related to your movie’s release. Unfortunately, Netflix doesn’t advertise which distribution agencies it works with, and it can be extremely competitive to get a pitch meeting with these companies. Keep trying, and make sure to only submit to distributors who have a solid reputation for transparency and open communication. [5] X Research source If you’ve been submitting to agents and haven’t heard anything back, you can try some other tactics. For instance, submit your film to a well-known film festival and see if Netflix reaches out. Netflix keeps a close eye on film festival screenings and often buys movies directly from them. [6] X Research source"
    },
    {
      "title": "Wait to receive a response from Netflix.",
      "content": "Wait to receive a response from Netflix. Once your agent or distributor submits your film pitch on your behalf, Netflix will either accept or reject your pitch. Expect to wait a few weeks for a response—if Netflix is interested in your movie, they’ll iron out the licensing details with the distributor or sales agent rather than working with you directly. Typically, Netflix purchases a 1-2 year licensing fee for indie films. [7] X Research source If Netflix is not interested in your film, you usually won’t get any feedback or further information from them. Try not to take their decision personally—Netflix is highly competitive, and many factors go into their licensing process that have nothing to do with the quality of your movie."
    },
    {
      "title": "Pitching a show is like pitching films, but with a pilot script and series bible.",
      "content": "Pitching a show is like pitching films, but with a pilot script and series bible. Selling a TV show to Netflix requires the same set of steps required to sell a film : develop your idea, identify selling points, write a pitch, submit to a distributor with Netflix connections, and hope that both the distributor and Netflix accept your pitch. However, the pitch for a TV show should include two additional elements: the pilot script and the series bible. [8] X Research source A pilot script is the script for the first episode of your TV series. It should set up the world and plot that all of your characters exist in, as well as introduce any potential conflicts that will continue throughout the first season. It’s a good idea to write scripts for the first few episodes as part of your pitch, but the pilot script is especially crucial. A series bible is a fleshed-out pitch document that includes your logline (a 1-2 sentence summary of your show’s central story), a synopsis of the first season, and series-long story arc, character biographies, a detailed pilot outline, a pilot script, a writer’s statement and a short summary for other episodes in your first season. Keep your series bible to under 7 pages in length. Here are some example series bibles from popular Netflix TV shows: Stranger Things Fargo Dirk Gently’s Holistic Detective Agency"
    },
    {
      "title": "Movie Pitch Template",
      "content": "Movie Pitch Template Use this rough outline to draft and complete your movie pitch. You can choose to create a slide deck for your pitch, which is more common nowadays, or present it in a printed document. Whatever format you choose, make sure to include the following elements and anything else you think is needed to convey the quality of your film: [9] X Research source Introduction: Brief overview of the film, including title, logline, genre, and theme. Explanation of whether your story is fictional, non-fictional, or based on a true story. Writer’s statement on why this screenplay is important and what it means to you. Synopsis: Premise of the film Description of the basic plot (without giving away the whole story) Character introductions: Bio for each main character (protagonist, antagonist, secondary characters) Outline of each character’s motivations, arcs, and compelling traits Filmmaking elements: Specific cinematography, styles, lighting, or music that you plan to use Unique elements of your filmmaking Budget and existing financing Any directors or actors that are currently attached Conclusion: Explanation of how the story ends (including cliffhangers) Statement on why it’s important to make this film at this moment Any personal elements to help sell the idea"
    },
    {
      "title": "Television Pitch Template",
      "content": "Television Pitch Template Fill in the outline below to begin drafting your TV show’s pitch for Netflix. TV pitches are usually presented in slideshow format or as a printed booklet, but go with whichever option is most comfortable and useful for you. Either way, make sure to include all of these elements and any other supporting information you deem necessary: [10] X Research source Introduction: Catchy and memorable title Logline that summarizes the show’s main premise in a unique way Genre and theme of show Target audience Synopsis: Brief overview of the plot, characters, setting, and tone Description of target audience Character introductions: Detailed descriptions of key characters The background, motivations, and relationships of each character Episode outline: Overview of the pilot episode and potential future episodes Explanation of the overall series arcs, themes, and key plot points Market analysis: Comparison of the program to existing shows in the same genre Explanation of why this show is so appealing to networks and audiences Production & monetization details: Specific production needs, like special effects or locations Estimated budget Opportunities for revenue and financial backing"
    },
    {
      "title": "Consider submitting to other platforms, like Amazon Prime and Hulu.",
      "content": "Consider submitting to other platforms, like Amazon Prime and Hulu. There are more than 200 streaming services worldwide, including major platforms like Amazon Prime, Hulu, HBO Max, Showtime, and STARZ. A good distributor or agent will help you figure out which platform is best for you and which ones you can apply to, but you can also explore whether any of these streaming services allow you to pitch your film to them directly. [11] X Research source"
    },
    {
      "title": "Netflix approves new pitches and buys finished projects from trusted sources.",
      "content": "Netflix approves new pitches and buys finished projects from trusted sources. Since Netflix doesn’t allow for movies and shows to be pitched to them directly, you might be wondering how they get so much content on their site! Well, Netflix has four main avenues through which they find, license, or create content: [12] X Research source A team of creative executives and buyers receive pitches from industry distributors with whom they have relationships. Members of the creative community and talent agencies who regularly work with Netflix may pitch projects directly. Buyers from Netflix review film festival releases and purchase completed movies. Netflix creates its own content by generating ideas internally and hiring creatives to develop those projects."
    },
    {
      "title": "Working with a distributor or aggregator can cost over $1,000.",
      "content": "Working with a distributor or aggregator can cost over $1,000. Different groups use different pricing models, so there isn’t a universally consistent charge that you can expect. However, most groups charge at least $1,000 to get your film on Netflix, while other groups may add on pitch fees and annual charges as well. [13] X Research source"
    },
    {
      "title": "Netflix typically offers 4-figure deals to independent filmmakers.",
      "content": "Netflix typically offers 4-figure deals to independent filmmakers. It can be tough to break even with an indie film’s budget, especially if you spend a lot of money on production. Typically, Netflix offers a 4-figure licensing fee for indie films. [14] X Research source On occasion, Netflix might offer 5-figures for your movie. Netflix will also generally ask for an exclusive deal in exchange for your licensing offer. They’d prefer to be the only streaming platform where viewers can watch your film during your licensing period."
    }
  ]
}