{
  "url": "https://www.wikihow.com/Man-Braid",
  "title": "How to Man Braid",
  "steps": [
    {
      "title": "Start with a fade or undercut.",
      "content": "Start with a fade or undercut . This is where your hair is longer at top and shaved down the sides. You will need this to get the right look. [1] X Research source"
    },
    {
      "title": "Gather a triangle-shaped section from your hairline.",
      "content": "Gather a triangle-shaped section from your hairline. Place your thumbs to either side of your temples, right where your hair starts to get long. Push them back through your hair, angling them until they touch. Separate this section of hair from the rest. It should only be 1 to 2 inches (2.54 to 5.08 centimeters) deep. [2] X Research source"
    },
    {
      "title": "Split the section into three equal sized sections.",
      "content": "Split the section into three equal sized sections. Hold the left section in you left hand and the right section in your right."
    },
    {
      "title": "Begin a standard braid.",
      "content": "Begin a standard braid. Cross the left section over the middle one, then cross the right section over the middle one. If you don't know how to braid, see if your barber or hairstylist will help you braid your hair. Try YouTube tutorials for braiding hair. Ask a long-haired friend if you can practice on their hair, or if they can teach you how."
    },
    {
      "title": "Add some hair to the left strand, then cross it over the middle one.",
      "content": "Add some hair to the left strand, then cross it over the middle one. Gather some hair from the left side of your part. Add it to the left strand. Cross the now-thicker left strand over the right one. If you are having trouble with this, try crossing the left strand over first, then adding the strand to it (now in the middle). [3] X Research source"
    },
    {
      "title": "Repeat the process on the right side.",
      "content": "Repeat the process on the right side. Gather some hair from the right side of your part. Add it to the right section, then cross it over the middle one."
    },
    {
      "title": "Continue braiding in this fashion until you run out of hair.",
      "content": "Continue braiding in this fashion until you run out of hair. This style of braiding is also known as \"French braiding.\" When you have no more hair to gather into your \"French\" braid, stop. Work in small sections and keep the braid nice and tight."
    },
    {
      "title": "Twist your hair into a bun.",
      "content": "Twist your hair into a bun . You can either braid the rest of your hair into a bun or stop the braiding at the edge of your scalp and do a regular pony-tail bun. Whatever you chose, coil your hair into a braid and then tie it off with a clear or hair-colored elastic."
    },
    {
      "title": "Tuck in the ends and secure the bun.",
      "content": "Tuck in the ends and secure the bun. Use your fingers to tuck the tail end of your ponytail/braid under the bun. Slide two or three bobby pins through the bun to help keep it together."
    },
    {
      "title": "Set the style with hairspray.",
      "content": "Set the style with hairspray. Again, you don't really have to do this, but your braid will last a lot longer if you do, especially if your fade/undercut was not that long to begin with. [4] X Research source"
    },
    {
      "title": "Begin with a fade or undercut.",
      "content": "Begin with a fade or undercut . This means that your hair should be longer on top and shaved down the sides. [5] X Research source"
    },
    {
      "title": "Part your hair down the center.",
      "content": "Part your hair down the center. Run the handle of a rat-tail comb through the middle of your hair, starting at your forehead and ending at your crown. Brush the left side to the left and the right side to the right. [6] X Research source"
    },
    {
      "title": "Twist and clip the right side out of the way.",
      "content": "Twist and clip the right side out of the way. If you don't have a hair clip, you can twist the hair into a loose bun and secure it with a hair tie. [7] X Research source"
    },
    {
      "title": "Split the front of your hair into three sections.",
      "content": "Split the front of your hair into three sections. Go to the left side of your hair. Gather some hair from your hairline and slit it into three, equal-sized sections. [8] X Research source"
    },
    {
      "title": "Braid the sections for two stitches.",
      "content": "Braid the sections for two stitches. Cross the left strand over the middle one, then cross the right strand over the middle one."
    },
    {
      "title": "Add some hair to the left strand, then cross it over.",
      "content": "Add some hair to the left strand, then cross it over. Gather some hair from the left side of the part, right where your hair starts to get long. Add it to the left section to make it thicker, then cross it over the middle one."
    },
    {
      "title": "Repeat the process for the right strand.",
      "content": "Repeat the process for the right strand. Gather from hair from your part. Add it to the right strand, then cross the now-thicker strand over the middle one. Some people find it easier to cross the strand first, then add the hair to it. [9] X Research source"
    },
    {
      "title": "Continue to braid in this fashion until you run out of hair to gather.",
      "content": "Continue to braid in this fashion until you run out of hair to gather. Continue adding strands of hair to the left and right sections before crossing them over. Keep the sections as small and tight as possible. Stop when you reach the back of your undercut and you have no more hair left to gather. This style of braiding is also known as \"French braiding.\""
    },
    {
      "title": "Repeat the process on the right side of your head.",
      "content": "Repeat the process on the right side of your head. This time, start by crossing the right strand over the middle one first. [10] X Research source"
    },
    {
      "title": "Coil your hair into a bun.",
      "content": "Coil your hair into a bun . If you want to also have a braided bun, weave the two braids together over one another. If you want a regular bun, stop braiding once you can't French braid any longer and gather the two ponytails into one ponytail, securing everything with a clear or hair-colored elastic. Coil your hair into a bun, and secure it with two to three bobby pins. [11] X Research source"
    },
    {
      "title": "Set the style with hairspray, if desired.",
      "content": "Set the style with hairspray, if desired. You don't really have to do this, but it will help the braid last a lot longer."
    }
  ]
}