{
  "url": "https://www.wikihow.com/Set-the-Stereo-Balance-on-a-Mac",
  "title": "How to Set Stereo Balance on a Mac, Plus Troubleshooting",
  "steps": [
    {
      "title": "Open the Apple Menu.",
      "content": "Open the Apple Menu. It's in the top left corner. This will open a drop-down menu. [1] X Research source"
    },
    {
      "title": "Select System Preferences….",
      "content": "Select System Preferences… . You'll see it in the drop-down menu. The System Preferences window will open up. [2] X Research source"
    },
    {
      "title": "Click Sound.",
      "content": "Click Sound . Look for the Sound button in the System Preferences menu and select it to open the Sound control panel. [3] X Research source"
    },
    {
      "title": "Open the Output tab.",
      "content": "Open the Output tab. This will display a list of output devices currently connected to your Mac, including the built-in speakers, any wirelessly connected devices, and anything that is plugged into the audio port. [4] X Research source"
    },
    {
      "title": "Choose your sound output device from the list.",
      "content": "Choose your sound output device from the list. You can adjust the stereo balance for each output device separately. Click the one you want to adjust. [5] X Research source If you select an AirPlay-enabled device from the list, you may be prompted to enter an AirPlay code before you can make any adjustments. This code should be displayed on the screen of your AirPlay device. [6] X Research source Any device that is plugged into the sound port on your Mac will be displayed as Headphones in the list."
    },
    {
      "title": "Drag the balance slider to adjust the balance.",
      "content": "Drag the balance slider to adjust the balance. Right under the header Settings for the selected device, you should see a Balance slider. This slider controls how much sound comes through one speaker or the other. Put the slider in the middle for an equal balance, or move it closer to the left or right if you want the speaker on either side to be louder. [7] X Research source The settings should be applied automatically as soon as you move the slider."
    },
    {
      "title": "Update",
      "content": "Update to the latest version of your operating system. Over the past several years, many Mac users have reported issues with the stereo balance changing on its own, especially when a new output device is connected to the computer. Keeping your OS up to date may help resolve this problem, especially as new patches and bug fixes come out. To update your MacOS: [8] X Research source Back up your Mac first if you haven’t done so recently. Open the Apple Menu at the top left corner of your screen. Select System Preferences . Click Software Update . Click Update Now to update your current OS, or Upgrade Now to install a newer OS if one is available."
    },
    {
      "title": "Disconnect and reconnect your output device.",
      "content": "Disconnect and reconnect your output device. Sometimes connection issues can affect the balance of speakers or headphones connected to your Mac. Try unplugging or unpairing your speakers or headphones from the computer, restarting the computer, and reconnecting the output device. Make sure your speaker or headphones are fully charged if they are wireless. [9] X Research source You can also try turning them off and on again before reconnecting them to your computer. If you’re using earbuds, check to be sure that both of them are clean . A buildup of gunk in one of the speaker ports can cause the sound to be faint or muffled on one side."
    },
    {
      "title": "Test your speakers or headphones with a different computer.",
      "content": "Test your speakers or headphones with a different computer. If you’ve set the balance through your Mac’s Sound control panel and you still aren’t getting a well-balanced sound from your speakers or headphones, the problem might be with your output device rather than your Mac. Try connecting them to another computer, tablet, or phone and see if you still notice the problem. If the issue is with your speakers or headphones, check your user’s manual for troubleshooting advice."
    },
    {
      "title": "Install a third-party app to keep the balance from changing.",
      "content": "Install a third-party app to keep the balance from changing. If your computer’s stereo balance settings keep reverting no matter how many times you change them, you may need to install an app to fix the problem. The only app that currently addresses this issue is Balance Lock , which is available through the App Store : https://apps.apple.com/us/app/balance-lock/id1019371109?mt=12 . Balance Lock keeps the balance slider centered by default, but you can also set a custom balance point."
    }
  ]
}