{
  "url": "https://www.wikihow.com/Save-a-Friendship",
  "title": "How to Save a Friendship",
  "steps": [
    {
      "title": "Ask yourself if it's a good idea to save your friendship.",
      "content": "Ask yourself if it's a good idea to save your friendship. Typically, there’s a reason your friendship isn’t going well. Think about what seems to be keeping you apart and if you can solve that problem. Then, decide if it's the right decision to try. Here are some reasons your friendship may be dying: [1] X Research source You aren’t making time for each other. [2] X Research source One or both of you is going through a stressful time. You don’t have much in common. [3] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. One or both of you has trouble listening. One or both of you criticizes the other."
    },
    {
      "title": "Communicate with your friend daily to maintain your connection.",
      "content": "Communicate with your friend daily to maintain your connection. If you and your friend used to talk a lot in the past, try to get back into that habit. Talk to them in person, text them, or send them digital messages. Regular communication will help you keep your friendship going, even when both of you are busy. [4] X Research source For instance, send your friend a meme every morning. Don’t be afraid to be the first person to text. However, don’t send more than 2 texts without receiving a response because they might feel like you're bombarding them with texts. If you haven't spoken to your friend in awhile, reach out to see how they're doing. You might text, \"Hey! This is Amy from camp. How have you been?\" [5] X Research source"
    },
    {
      "title": "Tell your friend how much you value your relationship.",
      "content": "Tell your friend how much you value your relationship. It’ll be easier for you to heal your friendship if you and your friend are both on the same page. It’s likely that they don’t realize that you’re trying to fix things. Choose a time when you can talk to them alone, then tell them that you’re hoping to improve your friendship. [6] X Research source You might say, “I know we haven’t been able to hang out lately, but I really miss you. I’m hoping that our friendship can be as close as it was before.”"
    },
    {
      "title": "Make time for your friend so they feel important.",
      "content": "Make time for your friend so they feel important. Your schedule is probably packed, and your friend is likely really busy, too. However, you guys will need to make time for each other if your friendship is going to work. Include them in your life more by trying the following: [7] X Research source Invite them to go do something fun. Have a meal together. Join a club with them. Take a class together. Set up a study date. Exercise together. Set up a talk or text date. Do a video chat."
    },
    {
      "title": "Ask your friend what’s going on in their life in person or via text.",
      "content": "Ask your friend what’s going on in their life in person or via text. Your friend will feel more connected to you if you show an interest in their life. The easiest way to do this is to ask them how they’re doing and what they’ve been up to lately. Then, listen to what they have to say. [8] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. [9] X Research source You might ask or text them, “How are things going?” or “Anything new in your life?” Be sure to ask follow-up questions like, \"What did he say when you told him that?\" \"What are you going to do now?\" or \"How are you feeling about all this?\" Make sure that you aren’t interrupting your friend to talk about yourself."
    },
    {
      "title": "Give your friend a small, personal gift to show you care.",
      "content": "Give your friend a small, personal gift to show you care. You don’t need to spend a lot to give a nice gift. Pick out something small that will mean something to your friend. Here are some gifts you might give them: [10] X Research source Bake your friend’s favorite cookies. [11] X Research source Frame an instant photo of you 2. Give your friend the book you just finished reading. Make your friend a bracelet. Get your friend’s favorite candy. Give your friend a memento from a memory you share."
    },
    {
      "title": "Set a regular date with your friend.",
      "content": "Set a regular date with your friend. It’s easy to forget to make plans with people, even if you really care about them. To prevent this, set a regular date with your friend so that you never forget! Turn this into a regular habit so you can keep your friendship going strong. [12] X Research source For example, you and your friend could have a movie night on the first Saturday of every month, or you could meet up every Wednesday night for pizza."
    },
    {
      "title": "Allow time for you both to calm down before you reach out.",
      "content": "Allow time for you both to calm down before you reach out. Don't try to meet up with them or reach out to them right after the fight happens. Both of you will be upset, and this can make the situation worse. Instead, take the time you need to work through your feelings and give your friend some space to deal with theirs. Once you feel like you can talk to them without getting upset, try to start a conversation by messaging or calling them. [13] X Research source If your friend says they need more time, give them the time and space they need. It could take them longer to calm down, and pushing them will likely make them more upset. [14] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. Try not to worry if your friend doesn't want to make up immediately. That doesn't mean your friendship is over! However, it might be best for you to spend some time with other people you care about."
    },
    {
      "title": "Apologize",
      "content": "Apologize for your part in the fight. It’s hard to apologize, especially if you feel like you didn’t do anything wrong. However, acknowledging that you made mistakes will help repair your friendship. [15] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. [16] X Research source Tell your friend that you realize you aren’t perfect and know you could do better. If you know what you did wrong, be specific about what you would change. [17] X Research source You might say, “I’m really sorry for what I said yesterday. I didn’t mean to hurt your feelings, but I know I did. In the future, I’ll try to see things from your perspective.” Similarly, you could say, “I’m sorry for my part in our fight yesterday. I know I could’ve reacted better.”"
    },
    {
      "title": "Use “I” statements when talking about what happened.",
      "content": "Use “I” statements when talking about what happened. “I” statements keep the focus on how you’re feeling and what you’re doing, so they don’t put the other person on the defensive. This helps you explain what happened without assigning blame. As you talk to your friend, make sure you’re sticking to “I” statements. [18] X Research source For example, you’d say, “I felt like you weren’t listening to me,” instead of, “You don’t listen to me.” Similarly, say, “I need to feel like I’m choosing what we do sometimes,” rather than, “You always pick what we do.”"
    },
    {
      "title": "Listen",
      "content": "Listen to your friend’s perspective on what happened. You and your friend experienced what happened through different perspectives, so you likely won’t agree on everything that happened. Both of you can see the situation differently while both being right! Ask your friend to tell you how they experienced your fight so you can see things from their perspective. [19] X Research source Say, “How do you feel about what happened yesterday?”"
    },
    {
      "title": "Forgive",
      "content": "Forgive your friend for their actions. While forgiveness is hard, it helps you move on so you can have a bright future. [20] X Research source Additionally, it’s the only way for your friendship to heal. Reflect on the hurt your friend caused, then tell them that you forgive them. Do your best not to bring it up in the future. [21] X Research source You might say, “What you said yesterday really hurt me, but I know you didn’t mean to make me cry. I forgive you for what happened.”"
    },
    {
      "title": "Remind your friend of the good times you had together.",
      "content": "Remind your friend of the good times you had together. Right now, you’re probably both feeling hurt about what happened. It may be helpful to talk about your good memories. Tell your friend about your favorite moments in your friendship. Then, ask them to remember their favorite moments. [22] X Research source Say, “My favorite memory of you as a friend is the time we both got each other the same sweater as a holiday gift. That was the moment I knew we were meant to be BFFs.”"
    },
    {
      "title": "Tell your friend what you expect from the friendship moving forward.",
      "content": "Tell your friend what you expect from the friendship moving forward. You and your friend probably have different expectations for your friendship, and your friend likely doesn't know what you expect. Talk to your friend about how you want your relationship to be. Then, listen to what your friend expects from you. [23] X Research source Say, “In the future, I want us to talk to each other without making critical comments about each other’s bodies,” or “Moving forward, I need to be able to pick half of the activities we do.”"
    },
    {
      "title": "Make the first move to start the healing process.",
      "content": "Make the first move to start the healing process. Being the first person to reach out is super scary, but it may be the only way to fix things. Don’t let your fear hold you back. Send the first text, give the first smile, or say the first, “Hey, how’ve you been.” Soon, your friendship might be on the road to recovery. [24] X Research source Keep things simple at first. Send a simple text that says, “Hey! :)”"
    },
    {
      "title": "Act like you’re just getting to know them for the first time.",
      "content": "Act like you’re just getting to know them for the first time. You likely wish things could go back to the way they were, but that may not be possible. Instead of trying to pretend things are the same, embrace the chance to start over. Get to know your friend all over again by having long talks and making new memories together. [25] X Research source Invite your friend to have coffee or bake cookies. Then, use this time to talk about yourselves."
    },
    {
      "title": "Enjoy new experiences with your friend.",
      "content": "Enjoy new experiences with your friend. Doing fun, new things will help you move your friendship forward. Choose something you and your friend have always wanted to try, or pick something that’s scared you in the past. [26] X Research source For instance, you might go skydiving, run a 5K, take an art class, or try out for a play. Ask your friend if they have any ideas for activities you can try."
    },
    {
      "title": "Acknowledge your differences and compromise on your expectations.",
      "content": "Acknowledge your differences and compromise on your expectations. Talk to your friend about your differences and how they might affect your friendship. [27] X Research source Then, work together to figure out how you can still make your friendship work. [28] X Research source For example, let’s say you have a job but your friend doesn’t. You’ll have a lot more demands on your time, and you need to make that clear to them. In this case, you could make plans for after work or on your day off. Similarly, your friend may have family responsibilities that you don’t have. It’s important to respect your friend’s time with their family and the demands they face. To compromise, you might spend more time at their house or you could include their younger siblings or children in your activities."
    },
    {
      "title": "Give your friend space if they need it.",
      "content": "Give your friend space if they need it. Despite all of your efforts, it’s possible your friend will want to slow things down. If so, respect their wishes. Keep your distance while they sort through their feelings and decide what they want. In the meantime, work on building new friendships . [29] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. [30] X Research source Tell them, “I understand how you feel. I hope that we can be friends again in the future, so I’m going to give you space until you’re ready to talk.”"
    },
    {
      "title": "Don’t expect them to give more than they’re willing.",
      "content": "Don’t expect them to give more than they’re willing. If you’re putting a lot into saving this friendship, it’s understandable that you’d want them to put in the same amount of effort. However, you can’t force them to do something they’re not willing to do. Focus on what you’re putting into the relationship and don’t expect anything in return. [31] X Research source If you feel like your friend isn’t doing enough, talk to them about how you feel. Say, “I feel like I’m the only one trying to make plans.” If your friend refuses to step up, it may be best for you to focus on your other friendships."
    }
  ]
}