{
  "url": "https://www.wikihow.com/Match-Paint-Colors",
  "title": "How to Match Paint Colors",
  "steps": [
    {
      "title": "Download a paint-matching app if you can’t take a sample.",
      "content": "Download a paint-matching app if you can’t take a sample. Most major paint brands have their own apps for matching paint colors, including Sherwin-Williams, BEHR, Glidden, and Valspar. Visit the app store on your smartphone and choose an app that will scan your wall color and provide you with a color match. If you remember the brand you used originally, download their app. If you don’t know the brand, try a few different apps to see which gives you the closest match, or try an app like Paint My Place which uses multiple paint brands. [1] X Research source"
    },
    {
      "title": "Scan your paint in natural lighting for the best result.",
      "content": "Scan your paint in natural lighting for the best result. Differences in lighting can make your paint more yellow or more blue, depending on which type of light is being used. To avoid these inconsistencies, try to test your paint sample in an area with plenty of natural light if you can, like near an open window or door. [2] X Research source Since natural light changes throughout the day, it may help to take a color reading in the morning, afternoon, and evening. If your room doesn’t have much natural light, use the room’s primary light source to test the paint. Incandescent lights will make paint seem warmer, while fluorescent lights look cooler. Halogen bulbs more closely resemble daylight."
    },
    {
      "title": "Test the paint in an inconspicuous area to make sure it’s a good match.",
      "content": "Test the paint in an inconspicuous area to make sure it’s a good match. Differences in lighting and cameras can make digital paint matching imprecise. If you purchase paint based on the results you get from an app, be sure to test it somewhere where the difference won’t be obvious. Let the paint dry completely before you check whether it’s a match, since wet paint can look like a different color at first."
    },
    {
      "title": "Take a picture of the original color before you go to the paint store.",
      "content": "Take a picture of the original color before you go to the paint store. If you’re planning to pick up color samples from the paint store, take along a photo of the original paint. Pictures won’t give you an exact color match, but they can be helpful if you’re trying to remember the general hue. If you can, try snapping pictures at different times of day, since the changes in lighting will make the paint look different. [3] X Research source If you’re in a hurry and don’t have time to wait a few hours for the light to change, try taking pictures with the flash on and off, or with the main light on, followed by lamplight. Holding up a true white piece of paper or cardstock in the picture can help your camera to automatically correct the color balance. [4] X Research source"
    },
    {
      "title": "Choose a handful of samples to bring home with you.",
      "content": "Choose a handful of samples to bring home with you. The lighting in the paint aisle won’t be the same as it is in your home, and different shades can seem really similar, so it’s important to bring the paint samples to the wall to compare the colors. Choose a handful of colors that seem close to the shade you want to match. If you’re not sure what brand the original color was, be sure to get shades from several different brands, as well. [5] X Research source If you like, you can also purchase or borrow a fan deck of colors from the paint store so you’ll have access to all of the shades a particular brand offers."
    },
    {
      "title": "Tape the samples to the wall and examine them at different times of day.",
      "content": "Tape the samples to the wall and examine them at different times of day. It can be tempting to just hold up the samples and immediately choose which one is the closest, but since the color of the room will change slightly as the sun moves throughout the day, you should hang the samples and come back to them every couple of hours. [6] X Research source Of course, if none of the samples are a match, you will probably be able to tell right away. If one sample is a match early in the day and another matches better in the evening, ask the paint store if they can mix a shade in between."
    },
    {
      "title": "Paint a small section of each color on the wall if you’re still not sure.",
      "content": "Paint a small section of each color on the wall if you’re still not sure. Most paint stores will sell you a small can of paint that you can use to paint a sample. If you can’t decide between 2 or 3 different shades, purchase a sample size of each. Paint a small swatch of each color onto the wall and look at them for a few days before making your final decision. [7] X Research source In addition to changes in light throughout the day, changes in weather can also affect your paint color. Your swatches might look different on a sunny day than they do on a day when that’s overcast."
    },
    {
      "title": "Clean the area you're trying to paint match.",
      "content": "Clean the area you're trying to paint match. Over time, fingerprints, dust, and dirt can collect on the surface of an object or a wall, and this can make the paint color seem darker than it actually is. To make sure you're testing the actual color, wipe the paint down with a damp, soapy sponge, and allow it to dry completely before you try to match the color. In addition to giving you a more accurate color match, cleaning the wall will help the new paint adhere better."
    },
    {
      "title": "Scrape off a 1 in (2.5 cm) sample of drywall paint with a razor knife.",
      "content": "Scrape off a 1 in (2.5 cm) sample of drywall paint with a razor knife. [8] X Expert Source Juli Roland Certified Color Specialist Expert Interview. 27 March 2020. If you’re trying to match paint on sheetrock or drywall, the easiest way to get a perfect match is to bring a sample with you to the paint store. Use a utility knife to score a square into the surface of the sheetrock about 1 ⁄ 8 in (0.32 cm) deep, then peel away the paper. [9] X Research source Place the sample in a plastic bag or an envelope so it doesn’t get smudged before you get to the paint store. Once the store has analyzed the color, dab a little of the paint onto a corner of the sample and let it dry to ensure it’s a perfect match."
    },
    {
      "title": "Bring the item you’re matching to the paint store if it's portable.",
      "content": "Bring the item you’re matching to the paint store if it's portable. Thanks to the computerized color-matching technology at most paint stores, you can match almost anything! If you’re trying to find a paint that’s the same color as an object, you can bring that object in with you when you go to buy paint. The staff at the paint store will then scan the item and come up with an exact or near-exact digital match to the color of the object. [10] X Research source [11] X Expert Source Juli Roland Certified Color Specialist Expert Interview. 27 March 2020. If there’s not an existing color that matches your object, the paint store can mix one up for you."
    }
  ]
}