{
  "url": "https://www.wikihow.com/Pierce-Your-Eyebrow",
  "title": "How to Pierce Your Eyebrow",
  "steps": [
    {
      "title": "Sterilize your equipment",
      "content": "Sterilize your equipment . First, boil your needle for five to ten minutes on a stove. Keep your needle and your jewelry in rubbing alcohol. If you have newly bought them, this might not be necessary, as they would already be sterile, but it is highly recommended that you sterilize them too, just to be on the safe side. Avoid using cotton balls o swabs to clean your jewelry."
    },
    {
      "title": "Locate where you want your eyebrow piercing.",
      "content": "Locate where you want your eyebrow piercing. Evenly mark two points using a pen or a marker, wherever you want your piercing to be."
    },
    {
      "title": "If you have a low tolerance for pain, you might want to numb the area with the aid of an ice cube or numbing gel.",
      "content": "If you have a low tolerance for pain, you might want to numb the area with the aid of an ice cube or numbing gel. [1] X Research source The numbing gel is a better option, as ice only numbs the first layer of skin, and in addition to that, it tightens the pores of the skin, making it harder for the hollow needle to go through."
    },
    {
      "title": "Pinch the skin between the two points that you marked, using a clamp, or your other hand.",
      "content": "Pinch the skin between the two points that you marked, using a clamp, or your other hand. Pull the skin out, away from the eye. [2] X Research source"
    },
    {
      "title": "Poke the needle through from one point to the other.",
      "content": "Poke the needle through from one point to the other. Push the needle out from the other point. [3] X Research source"
    },
    {
      "title": "Gently remove the needle from your eyebrow and then insert and fasten your chosen jewelry.",
      "content": "Gently remove the needle from your eyebrow and then insert and fasten your chosen jewelry."
    },
    {
      "title": "Do not remove your jewelry for a minimum of two months.",
      "content": "Do not remove your jewelry for a minimum of two months. Clean it daily with rubbing alcohol or a saline solution."
    }
  ]
}