{
  "url": "https://www.wikihow.com/Mime",
  "title": "How to Mime",
  "steps": [
    {
      "title": "Use your body to talk.",
      "content": "Use your body to talk. This is one of the first and most important things to know about miming. Talking or mouthing words is unnecessary during miming. Instead, use facial expressions, gestures, and posture to do the \"talking.\" [1] X Research source For example, furrow your eyebrows and place your hands on your hips to demonstrate annoyance."
    },
    {
      "title": "Assess your facial expressions and poses in a mirror.",
      "content": "Assess your facial expressions and poses in a mirror. Use a mirror to assess what movements are the most successful in conveying emotions, attitudes, and reactions. Practice facial expressions and simple movement and poses at first. The poses can be whatever comes to mind; they don’t have to mime movements just yet. A full-length mirror is a necessity for beginners, but bear in mind the mirror is a friend you will need to leave behind at performance time. [2] X Research source A video camera, if available, is another invaluable tool."
    },
    {
      "title": "Cultivate your imagination.",
      "content": "Cultivate your imagination. Using your imagination can’t be emphasized enough when it comes to creating illusions. It’s very important for a mime to truly believe the illusion is real. Naturally, the realer the illusion is for the mime, the more realistic it will be for your audience. This can be accomplished through practice. [3] X Research source For instance, imagine a wall. See the wall in different colors. Feel the wall in different textures such as rough, smooth, wet, or dry. Use these same techniques while practicing all illusions. You will also find your body reacting naturally to the illusion if you are convinced it's real."
    },
    {
      "title": "Take advantage of a fixed point.",
      "content": "Take advantage of a fixed point. This may be more commonly referred to as “pointe fixe,” however that is simply the original French wording of “fixed point.” This is a simple idea. The mime locates a point with his body, and then keeps it motionless in space. This technique is the basis of all illusions a mime can create. [4] X Research source For example, you can create a fixed point by holding one hand directly in front of you. Keep your hand in that position, but move your body."
    },
    {
      "title": "Add lines to fixed points.",
      "content": "Add lines to fixed points. The line builds upon a fixed point by simply adding a second fixed point in space. For example, put up another hand so that both of your hands are in front of you. You can move your body or move both of your hands and keep your body still. A good application of this concept is the “mime wall.” [5] X Research source The relative distance between the two points becomes the definition of this “construction block.”"
    },
    {
      "title": "Make a dynamic line.",
      "content": "Make a dynamic line. Find a wall and place both of your hands on it at approximately shoulder height. Push lightly into the wall with your hands. As you push try to feel where pressure builds up in your body. You should feel pressure in your hands, of course, but you should also feel some tension in your shoulders and hips. [6] X Research source If you can't feel anything, gently increase the pressure until you do. Try different positions and feel how they change the pressures in your body. This is the idea applied to “pulling the rope,” but it can be applied to virtually any use of force in an illusion."
    },
    {
      "title": "Manipulate space and matter.",
      "content": "Manipulate space and matter. This is a fancy phrase for \"making things out of thin air.” This technique makes use of many of the elements from the creating a fixed point, a line, and a dynamic line. It is best served by an example illusion: dribbling a basketball. Make a rounded palm with fingers gently curled over it. This shape defines the space where the illusion exists and allows the basketball, the “matter,” to exist in the illusion. [7] X Research source Space and matter manipulation can be used to create any number of objects, characters, or events by utilizing this principle."
    },
    {
      "title": "Pretend to be in a box.",
      "content": "Pretend to be in a box. If you are in an invisible box, you can press the air out in front of you with your hands—first your palm and then your fingers. Act as if you are trying to find a way out of this invisible box by identifying its corners and sides. Run one hand across the \"edges\" of your imaginary box as you try to find the lid and your way out. [8] X Research source If you want, you can eventually find the lid and flip it open dramatically with both arms in a triumphant gesture."
    },
    {
      "title": "Grab a rope.",
      "content": "Grab a rope. Pretend to have a rope dangling before you and attempt to climb it. Slide down and clamber back up for best effect. Imagine and feel your full body weight. Pretend your muscles are stretching and straining. Contort your face into a grimace. When you reach the top, wipe the perspiration off your brow. [9] X Research source If you have never climbed a real rope, do so with supervision in a padded gym. Make mental notes of your actions and reactions."
    },
    {
      "title": "Climb a ladder.",
      "content": "Climb a ladder. Grab at imaginary ladder rungs going up in the air. Place the ball of one foot on the ground as if you were putting it on a ladder rung. Pull down on the rungs while keeping your hands moving together. Alternate feet and hands each time you \"climb.\" Keep your focus upwards, as though you were looking at the place to which you are climbing. [10] X Research source"
    },
    {
      "title": "Do the lean.",
      "content": "Do the lean. Pretend to be leaning against a lamp post, wall, or a counter. It might sound easy, but it takes quite a lot of strength and coordination to \"lean\" on nothing. The basic lean has two parts: [11] X Research source For the top part: Hold your arm slightly away from your body with the elbow bent so that your forearm is parallel to the ground and your hand is near your torso. Now raise your shoulder as you move your chest towards your elbow (keeping the elbow at the same point in space). The bottom part: At the same time, bend your knee slightly and transfer your weight onto the bent leg. The net effect should be that your elbow stays where it is, but it looks as though your weight has settled onto the imaginary place where your elbow rests. Keep your opposite leg perfectly straight as this adds to the illusion. For a more active show of leaning, the act can also incorporate stumbling, sliding, and missing the leaned-on object altogether."
    },
    {
      "title": "Struggle against the wind.",
      "content": "Struggle against the wind. Pretend that it is very windy, and that you are having a hard time standing up in it. Let the wind move you back and forth. For added amusement, include a struggle with an umbrella that keeps turning inside out."
    },
    {
      "title": "Mime eating.",
      "content": "Mime eating. Pretend to be consuming a very sloppy hamburger or hot dog with all the contents slopping down the front of your clothing. Use a pretend napkin to wipe off the spill. Accidentally squirt some ketchup towards your eye for comical effect. Or, try peeling a banana and then slipping over on the peel. [12] X Research source"
    },
    {
      "title": "Make up a story.",
      "content": "Make up a story. You can go for a simple routine, or you can create a story. If you create a story from your mime, you will be engaging your audience and providing true artistic resonance to the art of miming. Think in advance of a \"tale\" you would like to tell. Keep in mind that mime can be very beautiful and moving if done well. [13] X Research source One story example: It is a windy day (wind/umbrella mime), and you meet a friend who has a cat stuck up a tree. Your friend asks you to climb the ladder to rescue the cat (ladder mime). When you return the cat (mime holding a squirming cat), your friend treats you to a hamburger (sloppy mime)."
    },
    {
      "title": "Apply the white base.",
      "content": "Apply the white base. A mime is instantly identifiable by their signature makeup. A white base for the face is traditional for mimes. Find a white “grease” or paint and apply it all over your face with a sponge or brush. Your natural skin tone should not show through the white makeup when you are done. [14] X Research source Be sure not to get to white makeup in your eyes. You might also try small circles of light pink blush for a happy or girlish mime."
    },
    {
      "title": "Add the dark makeup.",
      "content": "Add the dark makeup. After you’ve applied the white base, apply thick black eyeliner all around your eyes. Then, go over your natural eyebrows with black paint. You can also add stylized \"tears\" running to the middle of the cheekbones. Finish with black or dark red lipstick. [15] X Research source Keep in mind that you can alter the makeup to your character and preference."
    },
    {
      "title": "Wear the traditional black and white striped mime costume.",
      "content": "Wear the traditional black and white striped mime costume. Serious mimes might not wear the classic \"costume\" anymore, but you can wear this costume as a beginner. Find a black-and-white horizontally striped shirt—ideally with a boat neck and three-quarter sleeves. Wear dark pants, black suspenders, white wrist-length gloves, and a black bowler hat to complete the look. You can also wear a black or red beret. [16] X Research source This outfit and make-up has been a tradition of many famous mime artists, including the legendary Marcel Marceau. You do not need to dress this way. In fact, it is considered a cliché by modern mime artists."
    },
    {
      "title": "Choose a costume for your character.",
      "content": "Choose a costume for your character. If you wish to create a character, adopt a mood with your clothing, makeup, and lighting. For instance, you may wish to highlight the plight of the homeless sleeping out in the cold during winter. Paint on a sad face, wear tattered clothing, and use dim lighting. Think through a story that allows you to mime trudging despair as the homeless person seeks shelter for the night."
    }
  ]
}