{
  "url": "https://www.wikihow.com/Set-up-and-Play-the-Game-of-Life",
  "title": "The Game of Life: Board Game Directions",
  "steps": [
    {
      "title": "Assemble the board and punch the pieces if it’s your first time playing.",
      "content": "Assemble the board and punch the pieces if it’s your first time playing. The Game of Life has a spinner and may have buildings that attach to the board. Each plastic piece has a letter on it that matches up with a letter on the board. Fit the buildings, mountains, and bridges into their matching places on the board. Then, insert the spinner into the slot on the board. [1] X Research source If you have an older version of Life, you may need to attach stickers to the board pieces"
    },
    {
      "title": "Shuffle and separate the decks of cards.",
      "content": "Shuffle and separate the decks of cards. The backs of the cards are labeled House, Action, Career, College Career, and Pet. Separate the cards by type, shuffle them , and put them face-down next to the game board. [2] X Research source If your game has Stock cards, you do not need to shuffle them. Just place them somewhere near the board."
    },
    {
      "title": "Give each player a car, pegs, tokens, and starting money.",
      "content": "Give each player a car, pegs, tokens, and starting money. You can play The Game of Life with 2-4 people. Give each person one of the cars with the matching circular token, 1 Person peg, and 1 Pet peg. Place the pegs inside of the car and place them on the starting space of the board. Then, give each player $200,000 in paper money. [3] X Research source Some older versions of the game support up to 6 players. In older versions, players start with only $10,000 and do not have tokens or Pet pegs. [4] X Research source"
    },
    {
      "title": "Choose a banker.",
      "content": "Choose a banker. Pick a player at random to be the banker for the entire game. The banker still plays the game, but they're also in charge of giving players their salaries and bank loans. Have the banker sit near the spinner so they can be near the money supply. [5] X Research source If you’re the banker, keep your personal money supply separate from the rest of the cash in the bank."
    },
    {
      "title": "Have each player choose to start with Career or College.",
      "content": "Have each player choose to start with Career or College. Take turns spinning the spinner, and whoever has the highest number goes first. One at a time, decide if you want to start the game with a Career to start earning money right away, or choose to go to College to have a potentially higher salary later in the game. Move your car to the space that you decide on. [6] X Research source If you pick Career, look at the top two cards of the Career deck. Pick one to put face-up in front of you, and put the other on the bottom of the deck. The Career path is the shorter route. If you pick College, pay the bank $100,000 right away. Even though you start on a longer path and lose money right away, you have a better chance at a high-paying job later. From start to finish, The Game of Life takes about 1 hour for you to play."
    },
    {
      "title": "Buy Insurance or Stocks if you’re able to afford them.",
      "content": "Buy Insurance or Stocks if you’re able to afford them. In older versions of the game, you have the option to buy Automobile Insurance, Homeowner’s Insurance, and Stocks right at the beginning of your turn. If you want to add any of these to your personal supply, pay the amount listed to the bank and keep the cards in front of you. [7] X Research source Automobile insurance costs $10,000, and it will protect you from paying for accidents, damage, or theft later in the game. Homeowner’s insurance policies depend on the home that you own later in the game. Once you buy a home in the game, check its card for the homeowner’s insurance cost. To buy a Stock, choose any from the deck and pay the cost to the bank. Whenever a player spins the number listed on your Stock, gain $10,000 from the bank. You may only own 1 Stock. If you’re playing the most recent version of the game without these cards, then you can skip this step."
    },
    {
      "title": "Spin the spinner and move that many spaces.",
      "content": "Spin the spinner and move that many spaces. At the start of your turn, quickly spin the spinner and wait for it to land on a number. Once it stops spinning, follow the path on the board and move that many spaces forward. [8] X Research source If you move over a green Payday space , then immediately collect the amount listed on your Career or Salary card from the bank. If you move into a red Stop space , leave your car there even if you have more movement left. In older versions of the game, if you spin a 10 and another player has the Police Officer career card, then you must pay them $5,000. However, if the Police Officer doesn’t notice you spun a 10 and the next player starts their turn, there’s no penalty."
    },
    {
      "title": "Take the action for the board space you land on.",
      "content": "Take the action for the board space you land on. Once you land on a space, follow the instructions for the space color or icons. We’ll cover each of the board spaces in the next section. After you complete the action, your turn is over and the next player to the left takes their turn. Board spaces may vary between different versions and editions of the game. Always check the instruction manual that came with the game for specific instructions on the board spaces."
    },
    {
      "title": "Take out a bank loan whenever you’re running low on money.",
      "content": "Take out a bank loan whenever you’re running low on money. If you are running low on cash at any point during your turn, ask the banker to take out a loan. Take a Bank Loan certificate as well as $50,000 from the bank. [9] X Research source At the end of the game, you must repay $60,000 to the bank for each bank loan, so only take out loans if you really need them. In older versions of the game, bank loans are worth $20,000 each and you must pay back $25,000 for each one by the end of the game."
    },
    {
      "title": "Collect your salary when you pass a green Payday square.",
      "content": "Collect your salary when you pass a green Payday square. Collect the salary listed on your Career card or on your Salary card in older versions. If you land exactly on a Payday square, collect your salary plus another $100,000 as a bonus! [10] X Research source"
    },
    {
      "title": "Draw an Action card when you land on a gold Action space.",
      "content": "Draw an Action card when you land on a gold Action space. Each space has a faint circle image on it. Read the action card aloud and do what it says. It may help you earn more money, or you may have to pay the bank. [11] X Research source Keep any action cards you earn because they could be worth money at the end of the game. In older versions of the game, there are orange Action spaces with directions printed directly onto the board. On a blue Action space in older games, you can choose whether or not to take the action. If it has a Life symbol, then take a Life token and keep it face-down. Life tokens are worth random amounts of money at the end of the game. Some actions (or spaces in old versions), like Mid-life crisis and Lose your job force you to draw a new Career card. Some spaces on older versions have Career spaces with symbols next to them, such as “Taxes Due” spaces. If you land on this space and another player has a matching Career card, pay them the money listed. If no one has the Career card, then pay the bank instead."
    },
    {
      "title": "Draw a Pet card when you land on the pink paw space.",
      "content": "Draw a Pet card when you land on the pink paw space. Read the card aloud and follow its instructions. These cards may have effects on your pet, add more pets to your car, or have you pay money to the bank. [12] X Research source Keep the card next to you after you're done because they are worth money at the end of the game."
    },
    {
      "title": "Play the Spin to Win minigame when you land on the spinner icon.",
      "content": "Play the Spin to Win minigame when you land on the spinner icon. Each player puts their circular token next to a number on the \"Spin to Win\" image in the corner of the board. Then, take the extra, silver token out of the box and place it next to a second number. Spin the spinner until it points to a number someone has chosen, and give them $200,000 from the bank. [13] X Research source"
    },
    {
      "title": "Add pegs to your car when you land on Baby spaces.",
      "content": "Add pegs to your car when you land on Baby spaces. Add one pink or blue Person peg to your car as soon as you land on a space labeled “Baby.” Add 2 pegs instead if the space says “Twins.” [14] X Research source Each Baby is also worth $50,000 at the end of the game. In older versions of the game, take a Life token any time you land on a Baby space."
    },
    {
      "title": "Buy and sell houses on a House space.",
      "content": "Buy and sell houses on a House space. When you land on a square that has a picture of a House, you may either buy a house, sell a house, or do nothing. [15] X Research source To buy a house, draw two cards from the House deck. Pick one to keep, pay the bank the price listed on the card, and put the second card on the bottom of the deck. If you have a house already and want to sell it, spin the spinner and look at the inner circle to see if it landed on red or black. Collect the amount of money listed on your House card next to that color. Put that House card back on the bottom of the deck."
    },
    {
      "title": "Stop moving when you hit a red STOP space.",
      "content": "Stop moving when you hit a red STOP space. Even if you have extra moves left, stop your piece on the red square. Each STOP space has its own special rules or choices to make: [16] X Research source Graduation : Look at the top two College Career cards, pick one to put in front of you, and put the other on the bottom of the deck. Spin and move again. Get Married : Add a blue or pink peg (your spouse) to your car. Spin and look at the inner circle: if it's red, everyone gives you $50,000 each. If it's black, everyone gives you $100,000 instead. Spin and move again. Night School : If you want to change your career, pay the bank $100,000, draw the top card of the College Career deck, and choose whether or not to replace your old Career with it. Spin again and move on the Night School path. Alternatively, you can keep your current career, spin again, and keep moving forward on the Life path. Family : Spin again and move onto either the Family path if you want kids or the Life path if you don't want to have kids in the game. Spin for babies: Spin the spinner, and add that many People pegs to your car. Then, spin and move again. Risky/Safe : Spin and move again onto either path. The Risky Road has some squares with special instructions that can make you win or lose big money, but the Safe Route has normal squares."
    },
    {
      "title": "Stop moving when you reach the Retire space.",
      "content": "Stop moving when you reach the Retire space. Once you get to the end of the board and hit the Retire space, you no longer have to spin the wheel, draw cards, or purchase things. Move your piece to either Millionaire Estates or Countryside Acres to finish your game. [17] X Research source Getting to the Retire space first does not mean you immediately win the game, but you get a cash bonus for getting there early. The first player that reaches the Retire space gets $400,000, and the following players get $300,000, $200,000, and $100,000. In the latest version of The Game of Life, it doesn’t matter where you move your car. In older versions, move to the Millionaire Estates if you think you have more money than other players for a chance to earn 4 bonus Life tokens. Go to Countryside Acres if you want to play it safe and think you have less money. [18] X Research source"
    },
    {
      "title": "Repay your loans plus any interest you owe.",
      "content": "Repay your loans plus any interest you owe. If you have any bank loan cards in front of you, pay them back once you finish. Put this money from your personal supply back into the bank. [19] X Research source In current versions of the game, it costs $60,000 to repay a bank loan. For older copies of the game, repaying bank loans costs $25,000."
    },
    {
      "title": "Count your money at the end of the game to see who wins.",
      "content": "Count your money at the end of the game to see who wins. Once everyone has gone through the whole board and hit the Retire space, start counting all of the paper money you have in your supply. Then, tally up your money from cards, babies, and Life tokens you have. Whoever has the most money, wins! [20] X Research source Sell your Houses by spinning the wheel for each one and looking at the inner wheel color (red or black). Earn the amount of money listed next to that color on your House card. Get $100,000 for each Action card and each Pet card. Earn $50K for each baby you had during the game. Add the cash amounts listed on the back of Life tokens in older versions of games."
    }
  ]
}