{
  "url": "https://www.wikihow.com/Senior-Assassin",
  "title": "How to Play Senior Assassin Safely",
  "steps": [
    {
      "title": "Senior Assassin is a game in which students “assassinate” each other with water guns.",
      "content": "Senior Assassin is a game in which students “assassinate” each other with water guns. Senior Assassin, or Senior Water Wars, is a version of the Assassin game that seniors in high school play before graduation. Students are usually given a specific student to target, and they eliminate that target from the game by squirting them with a water gun. [1] X Research source Usually, students pay a fee to play the game, and the winner gets a grand prize of all the money collected. The game is usually played “bracket style,” meaning each student is assigned a specific target until only one person remains."
    },
    {
      "title": "Sign up for the game and receive your target from the host.",
      "content": "Sign up for the game and receive your target from the host. Each game of Senior Assassin has a game host who organizes the game and does not play. [2] X Research source See the host to sign up (and pay your application fee, if necessary). They’ll then give you your target, or the person you need to eliminate."
    },
    {
      "title": "Understand your game’s rules and boundaries.",
      "content": "Understand your game’s rules and boundaries. Each class plays Senior Assassin a bit differently, so make sure to read the rules carefully before you begin playing. These are often found on a designated social media page, but the host should inform you where to find them. These rules include where and when you can ambush a target, whether there are any “safe zones” or “power-ups” that will protect you from elimination, and the time frame in which you must eliminate your target. [3] X Research source In general, students are not allowed to play Senior Assassin on school grounds or on private property because the game is not sanctioned by the school or police. The rules are typically decided by the host or an anonymous organizer or group of students within the school."
    },
    {
      "title": "Research your target to know when to attack.",
      "content": "Research your target to know when to attack. Depending on the size of your class, you may not know the person you’re targeting. Look them up on social media and ask your friends for information to learn their schedule. This will help you figure out where and when to ambush them. [4] X Research source For example, learn if they have an after school job or what time they usually get home in the afternoon."
    },
    {
      "title": "Be aware of your surroundings and don’t trust anyone.",
      "content": "Be aware of your surroundings and don’t trust anyone. Remember, someone is trying to eliminate you, too. Be aware of your surroundings at all times, especially when you’re in vulnerable places, like leaving work, getting out of your car, or unlocking your front door. When playing Senior Assassin, you can’t trust anyone—even your closest friends. Be vigilant and don’t be afraid to lie about your whereabouts. [5] X Research source To avoid surprises, keep your water gun on you at all times, as well as any items or accessories that protect you from elimination."
    },
    {
      "title": "Plan a surprise attack to eliminate your target.",
      "content": "Plan a surprise attack to eliminate your target. Some of the most common ambush attacks include hiding in the bushes outside of your target’s house, waiting for them to leave for work or go to their car, and making deals with their parents or siblings to be let inside the house. Squirt your target with a water gun to eliminate them from the game. [6] X Research source If you get eliminated before you can ambush your target, you’re out of the game. The person who eliminated you will then go after your target. Depending on the rules, you may have to have at least one witness or video evidence to prove that you eliminated your target. In general, you’ll likely have to tell your game host when you eliminate someone so they can keep track of who’s still in the game."
    },
    {
      "title": "Go after your next target until you’re the last person standing.",
      "content": "Go after your next target until you’re the last person standing. In general, once you eliminate your original target, they’ll tell you who their target was. This is the next person you must eliminate to advance in the game. If you eliminate that person, you’ll go after their target and so on until only you and one other person remain. [7] X Research source It’s also possible the game host will give you an entirely new target, not the target of the person you eliminated. This varies depending on your game’s rules."
    },
    {
      "title": "There are many variations and ways to play Senior Assassin.",
      "content": "There are many variations and ways to play Senior Assassin. While the main goal usually remains the same, some schools play unique versions of the game. If you and your friends want to mix things up, here are a few common variations: [8] X Research source Play in teams of two or more and split the prize if you win. Give half of the prize money to a charitable organization and the other half to the winner. Use “power-ups” to protect yourself from elimination, like tutus, inflatable arm bands, or cowboy hats. Place a student on a “bounty board” or “hit list” if they cannot assassinate their target within the given time frame. Other students then aim to eliminate this student. Use another fake weapon, like water balloons or Nerf guns, instead of water guns."
    },
    {
      "title": "Senior Assassin gained popularity in the 2010s.",
      "content": "Senior Assassin gained popularity in the 2010s. While the exact origins of the game are hard to pinpoint, Senior Assassin began gaining popularity after its portrayal in teen shows like iCarly and Gossip Girl . Many participants also post videos of the game on social media, like TikTok, Instagram, and YouTube, spreading interest to a larger audience. [9] X Research source"
    },
    {
      "title": "Students playing the game may get hurt or in trouble with the law.",
      "content": "Students playing the game may get hurt or in trouble with the law. While Senior Assassin started out as a fun, innocent game, it has been condemned by many authorities, including school districts and the police, in many areas because it can be dangerous for both students and those who are not involved. Participating students are often mistaken for burglars with real guns, which sometimes results in police involvement. [10] X Research source In 2017, three students in Massachusetts were almost charged with felonies when they accidentally ambushed the wrong house, thinking it was their target’s. The homeowner, unfamiliar with the game, locked them in and called the police. In 2023, a school in Pennsylvania was evacuated after it was reported a student had brought a gun to a sporting event, though it was actually a water gun for Senior Assassin. In 2024, two students in Chicago attempted to eliminate their target in a restaurant but had a real gun pulled on them because a man thought they were robbers. The students’ water guns looked like real guns."
    },
    {
      "title": "The name “Senior Assassin” is controversial due to school shootings.",
      "content": "The name “Senior Assassin” is controversial due to school shootings. Because of the rise of school shootings across America, many people believe the name “Senior Assassin” is tone deaf and could be offensive or triggering for survivors. For this reason, the game is sometimes referred to as Senior Water Wars instead."
    },
    {
      "title": "Use brightly colored water guns.",
      "content": "Use brightly colored water guns. One of the easiest ways to stay safe while playing Senior Assassin is to use a water gun that is obviously a water gun. Do not use a model that is made to look like a real gun, as people may think you’re a threat. [11] X Research source"
    },
    {
      "title": "Do not disguise yourself.",
      "content": "Do not disguise yourself. Some students have worn ski masks or headgear to hide their identity while playing Senior Assassin, but this is dangerous. Someone may mistake you for an actual criminal, which could get you hurt or in trouble with the police. Make sure your face is visible at all times."
    },
    {
      "title": "Do not aim at people who aren’t playing the game.",
      "content": "Do not aim at people who aren’t playing the game. Even if your water gun is brightly colored, being aimed at could cause people to feel threatened, or even just annoyed, which may cause them to call the police. For everyone’s safety, only point your water gun at your target or friends who are also participating. [12] X Research source"
    },
    {
      "title": "Do not trespass on private property or play in business areas.",
      "content": "Do not trespass on private property or play in business areas. Those participating in Senior Assassin sometimes end up in trouble or danger by playing somewhere they’re not supposed to, like a restaurant. For your safety, play only in designated areas, like public parks or in your neighborhood. Do not trespass on your neighbors’ property without their permission. [13] X Research source In some cases, playing in public spaces could result in disorderly conduct charges, so use your discretion to determine where you’re willing to play."
    },
    {
      "title": "Do not go into someone's house unless you have permission.",
      "content": "Do not go into someone's house unless you have permission. Students playing Senior Assassin are sometimes mistaken for real burglars, so don’t attempt to ambush your target unannounced. If you know them well, ask their parents’ permission and arrange a time to attack. Otherwise, stick to attacking outdoors or in a designated area. [14] X Research source"
    },
    {
      "title": "Avoid playing after dark.",
      "content": "Avoid playing after dark. If someone who is unaware of the game sees you sneaking around with a gun at night, they’re likely going to call the police. For your safety and the wellbeing of others, set boundaries for when you can attempt to eliminate a target. It’s generally safest to play the game during the day, when people can see that you have a water gun and not a real one."
    },
    {
      "title": "Tell your parents where you’re going and what you’re doing.",
      "content": "Tell your parents where you’re going and what you’re doing. As an extra precaution, let your parents or guardians know where you’re going and how long you expect to be gone when playing Senior Assassin. This way, if something goes wrong, they’ll know where to find you. If you have a phone, keep it on you so they can contact you. [15] X Research source Additionally, let your parents know if you suspect someone will try to ambush you at your house. This way, your parents won’t be alarmed and try to call the cops."
    },
    {
      "title": "Use common sense.",
      "content": "Use common sense. When planning an attack, stop and consider what could go wrong and if there would be any consequences. Don’t do anything illegal or anything that could put you in danger. If you’re not sure about a plan, don’t do it. Wait until you come up with something you know will be safe. [16] X Research source For example, don’t play Senior Assassin in or around moving vehicles. Don’t break into someone’s house in the middle of the night just to eliminate them."
    },
    {
      "title": "Have an honest discussion about the dangers of Senior Assassin.",
      "content": "Have an honest discussion about the dangers of Senior Assassin. Sit down with your child and explain why Senior Assassin can be dangerous, using real-life examples. Allow your child to ask questions, and work together to decide if they’re allowed to play and what your expectations are regarding their behavior and participation in the game. [17] X Research source"
    }
  ]
}