{
  "url": "https://www.wikihow.com/Quit-Facebook",
  "title": "How to Close or Deactivate Your Facebook Account for Good",
  "steps": [
    {
      "title": "Click or tap your profile icon on Facebook and select Settings & privacy.",
      "content": "Click or tap your profile icon on Facebook and select Settings & privacy . You'll see your profile icon in the top right corner of the web browser. You can follow these steps on your computer or using the Facebook mobile app on your smartphone or tablet. Once you delete your account, you can delete or uninstall the mobile apps from iPhone and Android . Facebook is updating Accounts Center all the time, so words and positioning of buttons may vary slightly. [1] X Research source"
    },
    {
      "title": "Click or tap Settings.",
      "content": "Click or tap Settings . It's next to a gear icon."
    },
    {
      "title": "Click or tap See more in Accounts Center.",
      "content": "Click or tap See more in Accounts Center . It's in the top left corner. This might say \"Accounts Center\" instead. If you don't see \"Accounts Center\", use Settings instead."
    },
    {
      "title": "Click or tap Personal details.",
      "content": "Click or tap Personal details . You'll see this in the left menu under \"Account settings.\" If this option is at the bottom of the menu, you'll need to delete your account using Facebook settings instead."
    },
    {
      "title": "Click or tap Account ownership and control.",
      "content": "Click or tap Account ownership and control . It's the last item under \"Personal details.\""
    },
    {
      "title": "Click or tap Deactivation or deletion.",
      "content": "Click or tap Deactivation or deletion . Another window will appear with your connected accounts."
    },
    {
      "title": "Select the account you want to delete.",
      "content": "Select the account you want to delete. If you have an Instagram account as well as a Facebook account, you'll see them both here. Choose your Facebook account to proceed."
    },
    {
      "title": "Choose whether to deactivate or delete.",
      "content": "Choose whether to deactivate or delete. The differences between deleting and deactivating are below: [2] X Research source Deactivate account is a temporary action and means your account will be hidden until it's reactivated in Accounts Center. You can also reactivate the account by logging in. None of your data will be deleted. Use this option if you want to quit Facebook without deleting it. Delete account is a permanent action. Your comments, profile, photos, videos, and likes will be permanently removed. You cannot recover an account that has been deleted."
    },
    {
      "title": "Follow the on-screen instructions to finish deleting your account.",
      "content": "Follow the on-screen instructions to finish deleting your account. When deleting (or deactivating) your Facebook account, Facebook will walk you through the steps. You may have to enter your password to be able to complete the deletion process."
    },
    {
      "title": "Click or tap your profile icon on Facebook and select Settings & privacy.",
      "content": "Click or tap your profile icon on Facebook and select Settings & privacy . You'll see your profile icon in the top right corner of the web browser. You can follow these steps on your computer or using the Facebook mobile app on your smartphone or tablet."
    },
    {
      "title": "Click or tap Settings.",
      "content": "Click or tap Settings . It's next to a gear icon."
    },
    {
      "title": "Click or tap Profile Access and Control.",
      "content": "Click or tap Profile Access and Control . It's in the menu on the left side of the page. If you don't see this menu option, you'll have to delete your account using Accounts Center ."
    },
    {
      "title": "Click or tap Deactivation or deletion.",
      "content": "Click or tap Deactivation or deletion . Another window will appear with your connected accounts."
    },
    {
      "title": "Select the account you want to delete.",
      "content": "Select the account you want to delete. You can read if you want to \"Deactivate account\" or \"Delete account.\" Deactivate account is a temporary action and means your account will be hidden until it's reactivated in Accounts Center. You can also reactivate the account by logging in. None of your data will be deleted. Use this option if you want to quit Facebook without deleting it. Delete account is a permanent action. Your comments, profile, photos, videos, and likes will be permanently removed. You cannot recover an account that has been deleted."
    },
    {
      "title": "Select \"Delete account\" and click or tap Continue.",
      "content": "Select \"Delete account\" and click or tap Continue . Follow the on-screen instructions to delete your account, such as entering your account password. [3] X Research source"
    },
    {
      "title": "Does deleting my Facebook account delete all my data?",
      "content": "Does deleting my Facebook account delete all my data? Deleting your Facebook account will delete all the data that you have personally uploaded to the site, such as photos and posts. However, Facebook will retain logs that contain a record of what users do on the site (such as log in, visit a page, post a comment, etc.). These logs are kept forever, but your personal data is not attached to these logs. [4] X Research source Data about you that was added to Facebook by someone other than you, however, will remain on Facebook as long as that user is on the platform. This includes photos posted of you and messages to a friend."
    },
    {
      "title": "Can I still use Messenger without Facebook?",
      "content": "Can I still use Messenger without Facebook? You can still use Messenger without a Facebook account. Facebook Messenger is a separate mobile app you can continue using even after you quit Facebook. If you decide that you want to delete your Messenger account as well, do the following after deleting your Facebook account on an iPhone or Android: [5] X Research source Open the Facebook Messenger app. Tap the three-line button to open the menu. Tap the cogwheel button. Tap these menu items in order: Accounts Center > Personal details > Account ownership and control > Deactivation or deletion > Continue to Facebook account deactivation and deletion > Continue to account deactivation . Enter your password. Tap Continue to finalize the deletion."
    },
    {
      "title": "What happens after I delete my Facebook account?",
      "content": "What happens after I delete my Facebook account? All connected Meta Quest information is also deleted. If you use Facebook to log into Meta Quest, that data, such as your purchases and achievements, will also be deleted from your FB account. You won't be able to return any apps and will lose store credits if you have any. You won't be able to use Facebook login information for other apps. Apps like Spotify and Uber give you the option of signing in with your Facebook account rather than with an email address. If you selected this option when signing up for a service, make sure you change the preferred login to an email address or a phone number. Most of these services will also allow you to log in with a phone number, so you should be fine if you have one on record."
    }
  ]
}