{
  "url": "https://www.wikihow.com/Replace-Bearings-for-an-Induction-Motor",
  "title": "How to Replace Bearings for an Induction Motor",
  "steps": [
    {
      "title": "Unplug the appliance and disconnect the motor.",
      "content": "Unplug the appliance and disconnect the motor. If you still have your motor plugged in or attached to an appliance, unplug the power cord. Leave the motor unplugged throughout the entire time you’re working so you don’t injure yourself. Look for any wires attached to the side of the motor and unplug the box-shaped connector holding them there. Undo any bolts holding the motor inside of the appliance with a wrench so you can take the motor out. [1] X Research source Never work on your motor while it’s still connected to power since you could get electrocuted. The process for removing the motor will vary depending on what appliance you’re working on. Refer to your appliance’s user manual to determine the best way to disconnect the motor."
    },
    {
      "title": "Remove the fan cover and fan from the end of the motor with a ratchet.",
      "content": "Remove the fan cover and fan from the end of the motor with a ratchet. Look for the end of the motor that’s enclosed and has vents. Locate the bolts around the top and bottom edges of the cover and loosen them with your ratchet. Set the cover aside to expose the fan underneath it. Use your ratchet or a screwdriver to detach the fan from the motor’s main body. [2] X Research source If you have trouble turning the bolts on the cover or the fan, try lubricating them with WD-40 to help loosen them. Screw the bolts back into the holes when you finish taking the cover off so you don’t lose them."
    },
    {
      "title": "Mark the top of the motor’s end caps and the main housing along their seams.",
      "content": "Mark the top of the motor’s end caps and the main housing along their seams. The end caps are the metal housings that protect the internal electronics of your motor, but it can be hard to tell which way to reinstall them later on. Find the seams between the end caps and the motor’s main body. Draw a line with your marker so it crosses over the seam. That way, you can line up your marks when you put the end cap back on. [3] X Research source You don’t have to mark the top of the end cap if you don’t want to."
    },
    {
      "title": "Unscrew the nuts from the threaded ends of the tie rods.",
      "content": "Unscrew the nuts from the threaded ends of the tie rods. The tie rods are the long horizontal bolts that hold the end caps on your motor. Check each end cap for 4 nuts that are screwed onto the threaded tie rods. Use a ratchet or wrench to loosen the nuts and take them off of the tie rods. [4] X Research source Typically, you’ll find the threaded ends of the tie rods on the same side of the motor as the fan. Only one of the end caps will have nuts. The other end cap will have fixed bolts instead."
    },
    {
      "title": "Pull the tie rods out from the motor.",
      "content": "Pull the tie rods out from the motor. Once you take off all of the nuts, grab one of the bolts on the other end cap. Carefully pull the tie rod straight out from the motor and set it aside. Then remove the rest of the bolts the same way. [5] X Research source Screw the nuts back onto the tie rods so you don’t lose them."
    },
    {
      "title": "Tap the end caps off of the motor with a dead blow hammer.",
      "content": "Tap the end caps off of the motor with a dead blow hammer. A dead blow hammer is a mallet coated in rubber so it doesn’t leave damage or dents when you use it. Place the edge of your hammer against the end cap’s seam right behind the hole for the top left nut. Lightly hit the end cap away from the motor 3-4 times to help loosen it. Switch to the bottom right hole and tap your hammer there. Alternate between hitting the end cap from opposite sides until it pops off. Then repeat the process on the end cap on the other side. [6] X Research source Avoid using a metal hammer since you could possibly damage the internal components of the motor."
    },
    {
      "title": "Clean the motor’s shaft with a degreaser.",
      "content": "Clean the motor’s shaft with a degreaser. You can use any chemical spray degreaser on your motor. Locate the horizontal metal shaft running through the middle of the engine and spray the exposed ends with your degreaser. Let the degreaser sit for 5–10 seconds before wiping it off with a shop cloth. [7] X Research source You can buy a spray degreaser from your local hardware store."
    },
    {
      "title": "Secure a bearing extractor on the back of one of your bearings.",
      "content": "Secure a bearing extractor on the back of one of your bearings. Locate the silver donut-shaped bearing attached to one end of the shaft. Set the center pole of the extractor on the end of the shaft so its claw reaches toward the bearing. Turn the adjustment knob on the extractor to open the claw so the bearing can fit inside of it. Tighten the knob again so the claw closes around the bearing. Make sure the tips of the claw touch the bearing’s inner ring, or else you could damage your motor. [8] X Research source You can purchase a bearing extractor online or from your local hardware store. Bearings fit tightly on the motor’s shaft so you usually cannot remove them without an extractor."
    },
    {
      "title": "Turn the extractor's handle with a wrench to pull the bearing off the shaft.",
      "content": "Turn the extractor's handle with a wrench to pull the bearing off the shaft. Locate the handle at the end of the extractor that attaches to its center pole. Grip the handle with a wrench or ratchet and turn it clockwise. As you tighten the handle, the center pole will get longer and force the bearing off of the shaft. Keep turning the handle until the bearing easily slides off the shaft. [9] X Research source If the bearing still doesn’t move, try spraying the shaft with WD-40 or another lubricant to help loosen it. If the motor’s shaft also rotates when you turn the handle, try holding it still with your other hand or a wrench. Otherwise, the extractor may not work properly."
    },
    {
      "title": "Repeat the process on the second bearing.",
      "content": "Repeat the process on the second bearing. Turn the motor around so you can take the bearing off of the other side. Secure the extractor around the second bearing so the center pole presses against the end of the shaft. Rotate the handle clockwise to pull the bearing straight off of the shaft. [10] X Research source Save at least one of your bearings so you can ensure you buy the same size replacements. Otherwise, you can recycle them or take them to a local scrapyard."
    },
    {
      "title": "Buy new bearings that are exactly the same size and type as the old ones.",
      "content": "Buy new bearings that are exactly the same size and type as the old ones. You can buy bearings for your motor online or at your local hardware store. Bring one of the old bearings with you so you can compare the sizes and types. Typically, bearings are sold in pairs but you may have to buy them separately. [11] X Research source Check the main body of the motor for a sticker or imprint since it may list the bearing sizes you need. Avoid using bearings that are the wrong size or type since they could damage your motor or cause it to work inefficiently. Keep your bearings in their packaging until you’re ready to install them so they don’t get dirty."
    },
    {
      "title": "Heat the bearing on an induction heater until it’s 70–120°F (20–50°C) warmer.",
      "content": "Heat the bearing on an induction heater until it’s 70–120°F (20–50°C) warmer. Check the temperature of the bearing with a laser thermometer and write down the measurement. Put the heating rod from the induction heater through the middle of the bearing and let it warm up. Check the display on the heater or use your thermometer every 30–60 seconds to see if the bearing is 50–70°F (20–50°C) warmer than its initial temperature. If it is, turn the heater off. [12] X Research source Only heat one bearing at a time since the other may cool down before you have a chance to install it. You can buy an induction heater specifically made for bearings online or at your local hardware store. Avoid heating your bearings any hotter than 250 °F (121 °C) since you could damage them. Heat helps expand the bearing’s inner ring so it’s easier to slide onto the motor’s shaft. Otherwise, the bearing may be too tight to slide on."
    },
    {
      "title": "Put on heat-resistant work gloves.",
      "content": "Put on heat-resistant work gloves. Since the bearing will be extremely hot, don’t touch it with your bare hands. Choose a thick pair of heat-resistant work gloves so you can safely handle the bearing without burning yourself. [14] X Research source If you don’t have gloves, only use pliers or tongs to handle the bearing."
    },
    {
      "title": "Push the bearing onto the shaft until it touches the washer.",
      "content": "Push the bearing onto the shaft until it touches the washer. Once the bearing heats up, carefully pull out the heating rod and set it aside. Pick up your bearing and guide it onto the shaft on either end of the motor. Push the bearing all the way onto the shaft until it presses tightly against the washer. [15] X Research source You do not need to lubricate the shaft before putting the bearing on. If you used an oil bath, wipe the bearings clean before you install them on the motor."
    },
    {
      "title": "Use a bearing installation tool to move the bearing if it doesn’t slide on easily.",
      "content": "Use a bearing installation tool to move the bearing if it doesn’t slide on easily. Even if you heat the bearing, sometimes it may get stuck on the motor’s shaft. Position a bearing installation tool, which looks like a long tube with a circular end the same size as your bearing so it’s pressed flat against the front of the bearing. Tap the other end with your dead blow hammer to force the bearing into position. [16] X Research source You can buy a bearing installation tool kit online or from your local hardware store. You can also use a bearing installation tool if you don’t heat the bearing, though it will take more time to install."
    },
    {
      "title": "Heat and install the second bearing on the other side of the motor.",
      "content": "Heat and install the second bearing on the other side of the motor. Put the heating rod through the middle of the second bearing and allow it to warm up. Once it’s 50–70°F (20–50°C) warmer, take it off of the heater and slide it on the shaft on the other end of the motor. Make sure the bearing presses firmly against the washer. [17] X Research source"
    },
    {
      "title": "Let the bearings cool down before reassembling the motor.",
      "content": "Let the bearings cool down before reassembling the motor. Avoid moving the motor around since the bearings are still loose and may slide out of position. Leave the bearings until they feel cool to the touch. Once they are, screw the end caps, fan, and fan cover back on the motor! [18] X Research source It will typically take 30–60 minutes for the bearings to cool down."
    },
    {
      "title": "Reinstall the motor in your appliance and plug it in.",
      "content": "Reinstall the motor in your appliance and plug it in. Place your motor back in the appliance and bolt it back down so it doesn’t move around. Plug the wire connector back into the side of the motor so power runs through it again. Once you have everything installed, plug the appliance into a power outlet and you’re finished! If the motor still doesn’t work, you may need to hire someone to come and repair it."
    }
  ]
}