{
  "url": "https://www.wikihow.com/Run",
  "title": "How to Run",
  "steps": [
    {
      "title": "Establish a base level of fitness.",
      "content": "Establish a base level of fitness. If you're starting from zero, shooting out the front door and onto your first 10k will leave you frustrated, angry, and so sore you never do it again. In other words, don't bite off more than you can chew. If you start running with no prior exercise habits, you'll probably end up hurting yourself and quitting before you ever really started. The simplest thing to do would be to start walking. But it can be anything -- as long as you're getting physically active on a regular basis, your body will be able to handle the impending pavement pounding. Go hiking, swimming, or dancing. If it's fun, all the better!"
    },
    {
      "title": "Get a good pair of running shoes.",
      "content": "Get a good pair of running shoes. Some research suggests that barefoot running leads to fewer injuries than running in running shoes, even the fanciest ones. [1] X Research source However, you're probably not going to be running barefoot anywhere, unless it's after chasing a kid or a meatball that rolled away unexpectedly. So look for a shoe that can simulate running barefoot. If you're willing to rock those toe shoes (Vibrams), more power to you, but there are many minimalist running shoes that do not have toe sleeves. A good pair of shoes should not disrupt the way you run."
    },
    {
      "title": "Warm up.",
      "content": "Warm up. The last thing you want is shin splints, a pulled hamstring, or some other injury that can be avoided. Take five or ten minutes before your run to warm up. However, this does not mean stretching. In fact, static stretching beforehand can hurt you! [2] X Research source Instead, warm up your muscles by doing deadlifts, donkey kicks, lunges, and other similar exercises that stretch your muscles, but also get them working. Save the stretching for after the run."
    },
    {
      "title": "Keep a relaxed stance.",
      "content": "Keep a relaxed stance. Make sure your body is fluid and relaxed, but not hunched over. Try to keep your shoulders and arms loose while keeping your back straight. [3] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. Keep your head and neck relaxed, too. Holding tension there extends down through your spine and the rest of your body, which can tire you out well before you would be otherwise. [4] X Research source"
    },
    {
      "title": "Breathe steadily and deeply",
      "content": "Breathe steadily and deeply . What matters most is that you breathe with a rhythm that provides a consistent supply of oxygen to your body. Instead of being a chest-breather, be a belly-breather. Make a conscious effort to fill up your stomach, using your diaphragm. You'll get more oxygen and your muscles (heart included) will be less tired. [5] X Research source Don't worry about whether you are breathing through the nose or the mouth. Some runners find that breathing through their mouth gets them the most oxygen, while others find that breathing in through the nose and out through the mouth works best. Find whatever seems efficient to you. [6] X Research source If you're running at an easy pace, you should be able to carry on a simple conversation with a running partner without gasping. If you cannot, you are running too fast to go very far."
    },
    {
      "title": "Look ahead.",
      "content": "Look ahead. Keep your head in a neutral position, not looking up or down. Look approximately 35 feet in front of you if you're running a distance of more than 400 meters. [4] X Research source If you're on a treadmill, try not to look down at your feet or the controls too much; it puts tension on your back."
    },
    {
      "title": "Know how to move your arms.",
      "content": "Know how to move your arms. Keep your elbows at around a 90 degree angle, close to your body. Use a 110 degree angle for long-distance (except when you are working up a hill). Swing each arm forward and backward in time with the opposite leg; this provides momentum and prevents your body from twisting. Do not tense your fists. It will waste energy and make your palms sweaty. Imagine that you have two fragile items in each of your hands and if you tense too hard, you will break them. Don't let your hands cross the midline of your torso, or you'll create a twisting motion. This could cause cramps. [7] X Research source"
    },
    {
      "title": "Increase your cadence.",
      "content": "Increase your cadence. Aim to hit the ground about 180 times per minute. The simplest way to do this is to minimize the time your feet are on the ground. Whether you're in a light jog or running from a crowd it is up to you -- just don't go so hard you hurt yourself! Do what's comfortable. If you can't run an 8-minute mile, don't be hard on yourself. It'll come with time. The fact that you're out there and running is great! Simply aim to improve a little bit every time you pound the pavement."
    },
    {
      "title": "Control how you land on your feet.",
      "content": "Control how you land on your feet. Have your feet land under you as you run. [1] X Research source Try mimicking it when you go for your real runs at the gym or on the trail. However, don't be too strict in your control. It should feel natural. Don't try to force a certain kind of strike as forcing it will add strain on your body. If you're sprinting, you want to stay on the balls of your feet as much as is humanly possible. The more you barely touch the ground, the more you'll practically be flying. However, even if you're running long distances, it's best to stay off your heels. [8] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. When you land with the back of your foot, the angle you create from foot to calf (you're forming an unnatural \"V\" shape) can lead to injury."
    },
    {
      "title": "Start jogging in place, then lean forward from the hips.",
      "content": "Start jogging in place, then lean forward from the hips. Voila! You're running! See you soon."
    },
    {
      "title": "Cool down and stretch.",
      "content": "Cool down and stretch. Before ending your workout, slowly taper your run down to a jog, and your jog down to a walk, over the course of about 5 minutes. This allows your circulation and breathing to normalize after your run, minimizing the work your heart has to do. Now it's time for stretching. Concentrate on your calves, glutes, and hamstrings since those are the ones that worked the hardest. It's incredibly important to stretch after running because during, the muscles have a tendency to tighten up. Stretching them out relaxes them and returns them to normal. How you need them tomorrow!"
    },
    {
      "title": "Warm up.",
      "content": "Warm up. If you're running around a track, do one lap at a walk and another at a jog. You're sort of easing your mind and body into the oncoming sprints. Just like in the previous section, don't stretch now -- stretch later. Warm up your core muscles and your legs not by stretching but with core exercises like lunges and deadlifts."
    },
    {
      "title": "Run all out.",
      "content": "Run all out. The length of your sprint is up to you -- do you want to do it by distance or time? If you're aiming for interval training (which is a great idea), keep it to about 30 seconds. Interval training seems to be where it's at. If you're looking for a quick way to blast away calories with the strength of a zillion lightsabers or if you're just low on time, this is the workout for you. All you do is run SUPER FAST for about 30 seconds, slow down for a minute, and repeat. Continue the cycle for about 15 minutes, adjusting as you need to. [9] X Research source And then ta da! Finished. Lunch break over."
    },
    {
      "title": "Run faster by using your entire body.",
      "content": "Run faster by using your entire body. There are two ways here to run faster: using your core and using your arms. You can use your own body to your advantage when it comes to getting that faster time. You'll find that leaning a bit forward propels your body to run faster to balance your weight. This is helpful when running uphill, but can lead to injury otherwise. Take this piece of advice with a grain of salt. [10] X Research source In addition to placing your core forward, use your arms for momentum. Keep them in a straight line, mirroring the movement of your legs. Keep them loose and not hunched up to your shoulders -- ow. [10] X Research source"
    },
    {
      "title": "Slow down.",
      "content": "Slow down. After your sprints, cool down for a moment and walk. This allows you to normalize your oxygen levels again and prepare for the next sprint. If you experience pain, stop. It's your body telling you it should not be doing what you're making it do. It's better to stop now to be okay later than to not stop now and not be okay later."
    },
    {
      "title": "Sip water.",
      "content": "Sip water. If you need water between sprints, take small sips. Don't guzzle or gulp, even if it's tempting; consuming too much water in the middle of a run can lead to cramps. That being said, it's very important to stay hydrated. If you're not, you may experience dizziness or even fainting. If you don't drink water during your run, make sure to drink it before and after."
    },
    {
      "title": "Cool down and stretch out.",
      "content": "Cool down and stretch out. Gently work your muscles after your sprints to reduce cramping and shin splints. Do light versions of the exercises you did to warm up in addition to stretching. Walk around the area or for another minute or so on the treadmill. Your heart works to speed your body up and slow it down, so going from 140 to 60 is just as hard on it as going 60 to 140. You're probably running to be healthy, so it's best to do it right!"
    },
    {
      "title": "Get the right fit for your shoes.",
      "content": "Get the right fit for your shoes. Make sure your running shoes fit your feet as close as they can without being too tight. [11] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. You don't want to be distracted by blisters in the middle of your run. The longer you run, the better your shoes need to be. If you run every day, your shoes will only last 4-6 months. If your feet all of a sudden begin hurting, it's high time to get a new pair. To increase shoes' lifespan you can swap two pairs every day, which will allow moisture to evaporate and cushioning to decompress. There are shoe stores that can design shoes for your feet. If you can afford it, consider getting shoes that match your arch and shape."
    },
    {
      "title": "Load up on carbs.",
      "content": "Load up on carbs. If you're going for a 10k or more, it's wise to load up on carbs a day or two before. But you've got to do it right! You don't want too much fiber, protein, or fat. And it needs to be easily digestible to avoid risk of nausea during the race! Tortillas, oatmeal, bread, pancakes, waffles, bagels, yogurt, and juice are all good, high-carb, easy-to-digest options. Fruit has carbs, too, but many are high-fiber, so peel the skin beforehand. [12] X Research source Don't feel guilty -- you'll definitely burn the calories later. A phenomenon many serious runners have made a habit of is pounding energy goo (or Gu, if you want to go brand-name). It's basically sugar and carbs in goo form, though you can get some that's chewable. It replenishes your glucose levels and will give you a burst about 20 minutes after consuming it. Many swear by it! Try out the goo while you're still training. You don't want stomach troubles during a long race!"
    },
    {
      "title": "Warm up.",
      "content": "Warm up. Run at a conversational pace or a little slower for 10 minutes and a quicker pace for 5. Then follow it with drills. (High knees, Butt kicks, skipping) This will get your circulation going without expending too much energy prematurely. It's all about getting primed and having your heart rate begin to rise. Do some core exercises, too. Regardless of whether you're sprinting or running long distances, the importance of warming up remains the same."
    },
    {
      "title": "Pace yourself.",
      "content": "Pace yourself. At the beginning of a long run, you'll be ready and raring to go. You'll start off like a bat out of hell...and then tire really quickly. Instead of running all out (like you would in a sprint), run at a pace you can keep steadily. You'll last much, much longer. [13] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. You probably know what you're capable of. As long as you're training, if you find yourself slowly getting capable of more and more, you're doing it right. Each person has their own level of expectation and improvement. Know what yours is and aim for it."
    },
    {
      "title": "Do not give up when you're tired.",
      "content": "Do not give up when you're tired. When you're tired, try focusing on another goal, such as another half mile, or think of something to treat yourself with once you finish. For beginning runners, a common goal is running for around 10 minute mile pace. If time is a factor you're considering, try timing your miles or kilometers and aiming for a specific, timed goal."
    },
    {
      "title": "Stay hydrated.",
      "content": "Stay hydrated. It's of utmost importance that you stay hydrated during a long run. If it is longer than 50 minutes on a hot day, have a water stop. However, if you take water with you on your run, only drink small sips. Guzzling water in the middle of a run will lead to cramps. And it may make you need to pee! Keep your water cold, if you can. The colder it is, the faster it will get absorbed into your system. [14] X Research source Since you're sweating so much, staying hydrated is key!"
    },
    {
      "title": "Cool down.",
      "content": "Cool down. At the end of your run, downshift to a jog, then a walk. Your heart rate should be close to resting speed by the time you stop. Stopping like you hit a brick wall will put your heart and muscles on high alert, jarring them. That's the kind of activity that leads to injury! Do not let this become a part of the workout however. If you are on a 30 minute run, do a 30 minute run, and then, and only then, the cool down. And the next time you go running, aim for a bit longer or a bit faster!"
    },
    {
      "title": "Clean up your diet.",
      "content": "Clean up your diet. Technically, to run, you could eat whatever the heck you like. However, it's gonna be a lot easier to run and feel good during and after if you're loading up on healthy stuff beforehand. A good way to think about it would be to eat like a caveman -- going as au natural as possible. If it's processed, do your best to avoid it. Fruits and veggies should make up a large portion of your diet, with some lean meat, low-fat dairy, and whole grains thrown in. [15] X Research source If you want to see changes in your body, this step is a must-do."
    },
    {
      "title": "Start strength training",
      "content": "Start strength training if your goal is to lose weight. Straight up, running doesn't do wonders for toning your body, at least your upper body. It's a great way to lose weight and burn fat -- but unfortunately, it can burn muscle, too. If you just run, you may end up with that \"skinny-fat\" look. [16] X Research source It doesn't have to be much and it doesn't have to be in the gym. Simply doing core workouts (like planks, etc.) can tone your upper bits. Stick to a couple times a week -- your muscles need time to heal themselves after getting ripped, torn, and creating new fibers."
    },
    {
      "title": "Scope out a trail.",
      "content": "Scope out a trail. Getting started running is a lot about not getting discouraged too soon. If you think it's too difficult or not enjoyable enough, you won't stick with it. If you're hitting the gym, find a gym that's convenient to get to and that has nice equipment. If you're running outside, consider terrain, scenery, and level. Are you running on dirt, gravel, or blacktop? Is it pretty enough to keep you relaxed and in the zone? Is there plenty of flat terrain, or is it uphill or downhill?"
    },
    {
      "title": "Get gear.",
      "content": "Get gear. All you really need to run is a good pair of shoes. If the budget doesn't allow for the fancy, technical gear, don't sweat it. You don't need any. Women should have a decent sports bra, but that's about it. CoolMax or Dri-Fit are two brands of synthetic fabrics that keep the moisture (read: sweat) off your skin if you're interested, but you can run just as well as long as you're comfortable."
    },
    {
      "title": "Join a club.",
      "content": "Join a club. Odds are your area has a running, triathlon, or marathon club you can join. Being surrounding by like-minded people will only fill you with more gusto -- and it'll keep you on track when you're feeling less than motivated. Need a buddy to run a race with? Problem solved. Don't know where to find one? Try your local running shoe shop. It's probably a smaller network of serious runners than you realize! Soon you'll be on a first name basis."
    },
    {
      "title": "Sign up for a race.",
      "content": "Sign up for a race. Now that you're a runner, might as well do some good with your new hobby! There are millions of 5 and 10ks out there to support good causes. With two minutes of research, you're bound to find one in your area!"
    }
  ]
}