{
  "url": "https://www.wikihow.com/Prevent-Hair-from-Knotting",
  "title": "How to Prevent Hair from Knotting",
  "steps": [
    {
      "title": "Brush your hair before you wash it.",
      "content": "Brush your hair before you wash it. Always use a wide-tooth comb or a paddle brush with plastic tipped bristles, [1] X Research source and comb through your hair before showering. This will help stop your hair from tangling when you wash it. [2] X Research source As a general rule of thumb, don’t brush your hair when it’s wet, as wet hair is more prone to damage and breakage. Instead, use a wide-toothed comb to gently detangle your hair. [3] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019."
    },
    {
      "title": "Shampoo properly.",
      "content": "Shampoo properly. Wash your hair by focusing your shampooing on the scalp, rather than the hair, and never pile your hair on top of your scalp. Use a natural shampoo that doesn’t contain sulfates or harsh detergents, as these can dry out your hair. [4] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019. When you wash your hair, work the shampoo in a downwards motion from the roots to the tips. Do not work the shampoo up the hair as this can cause the hair to tangle more. Don’t wash your hair every day, as this can strip your hair of oils, leaving it dry and more prone to breakage. [5] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019."
    },
    {
      "title": "Condition after you shampoo.",
      "content": "Condition after you shampoo. After you shampoo, scrunch conditioner into the ends of your hair until your hair feels slippery. Carefully run your fingers through your hair to remove all the knots, then gently comb through your tresses with a wide-toothed comb. [6] X Research source This will detangle your hair without breaking the strands. Leave the conditioner in for 2-3 minutes, then rinse it out. It is important that you use a comb and not a brush for this step. If you have thick, coarse, and tightly curled hair, condition your hair twice daily as opposed to just once. Condition once in the morning or after you shampoo your hair, and again before bed with a moisturizer, leave-in conditioner, or dry conditioner."
    },
    {
      "title": "Dry your hair gently.",
      "content": "Dry your hair gently. Instead of wrapping, twisting, or rubbing your hair, gently squeeze it with a microfiber towel to get out the excess moisture. [7] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019. It’s also best to avoid heat products, such as blow dryers and flat irons, which can dry out your hair and leave it prone to damage and tangling. If you must blow dry your hair, towel and air dry it until the hair is mostly dry. This will help cut down on the blow dryer time. If using a hair dryer, never point the nozzle up towards the roots. Instead, work it down the strands towards the tips to help protect the cuticle of your hair. Always use a heat protectant spray when blow-drying your hair, as it can help you avoid any potential heat damage. [8] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019."
    },
    {
      "title": "Moisturize hair regularly.",
      "content": "Moisturize hair regularly. Healthy and moisturized hair is less likely to knot and tangle, so along with regular conditioning, try a weekly hair mask or deep conditioning. To deep condition, work a quarter-sized dollop of deep conditioner into your hair. Wrap your head with a shower cap or plastic wrap, and allow it to rest for 30 minutes to an hour before rinsing. [9] X Research source"
    },
    {
      "title": "Seal the tips of your hair.",
      "content": "Seal the tips of your hair. After you condition your hair, apply a hair butter or oil to the tips. This will seal in the moisturizing conditioner and help smooth and relax the ends of the hair, thereby preventing them from coiling around themselves and forming knots. [10] X Research source Another way to seal your hair is to switch your hair dryer to its cool setting. Blow the cool air over your hair, starting up near the roots and moving downwards towards the tips. This step can be skipped if you have fine or medium hair, but should be followed for hair that’s thick, coarse, and tightly curled."
    },
    {
      "title": "Gently stretch the ends of your hair.",
      "content": "Gently stretch the ends of your hair. This is particularly useful for tightly curled hair, as the stretching will prevent the hair from coiling around itself and forming single-strand knots. You can stretch the tips of your hair by wrapping the ends around rollers. You can also protect your hair from knots by using hair styles that stretch your hair, such as twists, braids, and buns."
    },
    {
      "title": "Tie your hair up when you're being active.",
      "content": "Tie your hair up when you're being active. If you're playing sports, swimming, or exercising, prevent your hair from knotting by wearing it in a braid, ponytail, or bun. The less your hair moves around and the less it gets matted with sweat and dirt, the more likely you are to be able to brush through it when you're done. Prevent damage to your hair and scalp by positioning your buns and ponytails in different spots on your head every time, and always make sure that such hair styles are loose. When you are finished exercising, let your hair down. This will help sweat evaporate from your scalp."
    },
    {
      "title": "Protect your hair in the wind.",
      "content": "Protect your hair in the wind. Whether you're going for a summer drive with the windows down or if it’s just a windy day, wrap your hair in a scarf, cover it with a hat, or wear it in a protective hair style to stop it from blowing around too much. Not only will the wind ruin your hair style, but it will also blow your tresses into a tangled mess."
    },
    {
      "title": "Care for your hair when you sleep.",
      "content": "Care for your hair when you sleep. While cotton is a popular choice for bedding, hair can catch on cotton pillow cases as you sleep, and this can create knots. Instead, look for a polished cotton pillow case, or a smooth fabric such as silk. You can also wear a satin bonnet or wrap your hair with a protective fabric to prevent knotting when you sleep. [11] X Research source"
    },
    {
      "title": "Get regular trims.",
      "content": "Get regular trims. To keep your hair healthy and remove damaged ends, you should trim your hair every eight months, [12] X Research source but if your hair is prone to tangling, consider trimming it every three months. Removing knots can cause breakage, and frequent trims will remove split ends and broken tips, and ensure your hair stays healthy looking and radiant."
    },
    {
      "title": "Work in small sections.",
      "content": "Work in small sections. Tie or pin up the majority of your hair, and leave a small section of hair free. Once you detangle that section, start a new bun or ponytail to keep the detangled hair separate, and move on to a new section of tangled hair."
    },
    {
      "title": "Finger comb your hair.",
      "content": "Finger comb your hair. On the first section of hair, start near the tips and run your fingers through your hair to remove knots and tangles. Combs can actually make knots tighter, so untangle what you can with your fingers first. [13] X Research source As you detangle the bottom of that section of hair, move up the strands and continue removing knots until you reach the top of your hair."
    },
    {
      "title": "Apply water and conditioner as necessary.",
      "content": "Apply water and conditioner as necessary. When you encounter particularly nasty knots, apply some watered down conditioner to the area. Let it sit for a couple minutes, then go back to detangling with your fingers."
    },
    {
      "title": "Repeat with a comb.",
      "content": "Repeat with a comb. Once you’ve removed all the knots you can with your fingers and can easily run your fingers through the entire length of your hair, gently comb through the same section with a wide-tooth comb. Like before, start at the bottom and work your way to the top. Divide the section of hair into even smaller sections if you have trouble running the comb through. Add more conditioner as needed to help loosen knots."
    },
    {
      "title": "Use a needle on tough knots.",
      "content": "Use a needle on tough knots. If you come across a knot that you can't loosen with your fingers or the comb, insert the needle of a safety pin into the center of the knot and move it around to loosen the knot."
    },
    {
      "title": "Trim the knot as a last resort.",
      "content": "Trim the knot as a last resort. In case you come across a knot that you absolutely cannot remove with conditioner, your fingers, the comb, or the safety pin, you may have to trim it off. Use sharp barber scissors, and make sure you remove as much excess hair from the knot as you can before making any cuts. Try to work the knot down toward the tip of the hair as far as you can to minimize the amount of hair you have to trim."
    }
  ]
}