{
  "url": "https://www.wikihow.com/Recognize-a-Potentially-Abusive-Relationship",
  "title": "How to Recognize a Potentially Abusive Relationship",
  "steps": [
    {
      "title": "Understand the definition of abuse.",
      "content": "Understand the definition of abuse. An abusive relationship describes a relationship where one person consistently and constantly uses tactics to psychologically, physically, financially, emotionally, and sexually control and have power over another person. A relationship that is considered to have domestic violence is a relationship where there is an imbalance of power. [1] X Trustworthy Source National Domestic Violence Hotline Organization providing lifesaving tools, support, and resources for victims and survivors of domestic abuse Go to source"
    },
    {
      "title": "Recognize signs of physical abuse.",
      "content": "Recognize signs of physical abuse. Physical attacks can vary greatly. They can happen just once in a while, or they can happen with great frequency. They can also vary in severity. They can also be a one-time incident. Physical attacks can “cycle”, in that there is a period of calm, followed by an escalation, and then the attack. After the attack, the entire cycle can begin again. If physical threats are a constant, underlying or overt threat, they make you fear for your safety or the safety of the people, things, or even pets you love. The physical abuse can permeate and affect every aspect of your life. The actual acts of physical violence might seem like they are self-explanatory or too obvious to mention. But for people who grew up getting hit, they might not realize that this is not a normal, healthy behavior. Some examples of physical abuse include: [2] X Trustworthy Source National Domestic Violence Hotline Organization providing lifesaving tools, support, and resources for victims and survivors of domestic abuse Go to source “Pulling your hair, punching, slapping, kicking, biting or choking you.” [3] X Trustworthy Source National Domestic Violence Hotline Organization providing lifesaving tools, support, and resources for victims and survivors of domestic abuse Go to source Denying you the right to meet your basic needs, such as food and sleep. Breaking your belongings or destroying things in your home, such as throwing dishes or punching holes in the walls. Threatening you with a knife or gun, or using a weapon on you. Physically barring you from leaving, calling 911 for help, or going to the hospital. Physically abusing your children. Kicking you out of your car and leaving you in strange places. Driving aggressively and dangerously while you are in the car. Making you drink alcohol or take drugs."
    },
    {
      "title": "Know how to recognize sexual abuse.",
      "content": "Know how to recognize sexual abuse. Sexual abuse can be any form of sexual activity that is unwanted. [4] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source This includes “sexual coercion,” which in simple terms makes you feel like you are being forced to have sex. It also includes “reproductive coercion,” which means not allowing you to have a choice in pregnancy, tracking your periods and so on. Sexual abusers may try any of the following things: Control the way you dress. Rape you. Purposely give you a sexually transmitted disease. Drug you or get you drunk to have sex with you. Make you pregnant or terminate your pregnancy against your will Make you view pornography against your will."
    },
    {
      "title": "Recognize signs of emotional abuse.",
      "content": "Recognize signs of emotional abuse. Emotional abuse includes behaviors that are non-physical. Emotional abuse usually results in the victim having lowered self-esteem, emotional pain and scarring, and loss of self-confidence [5] X Research source Emotional abuse may include: Name-calling Constant criticism Intentionally embarrassing you Threatening you Using your children against you Threatening to hurt your children or your pets Acting like everything is your fault Isolating you from friends or family Having affairs with other partners or provocative behavior with others Making you feel guilty"
    },
    {
      "title": "Recognize what financial abuse looks like.",
      "content": "Recognize what financial abuse looks like. This can entail abusers not allowing you to have your own money, even if you earned it. An abuser might also take your credit cards or take one out in your name and ruin your credit history. [6] X Research source An abuser also might move into your home and not contribute to paying any of the bills or expenses. An abuser might withhold money for your basic needs, such as groceries or prescriptions."
    },
    {
      "title": "Recognize what digital abuse looks like.",
      "content": "Recognize what digital abuse looks like. An abuser can utilize technology to threaten, stalk, or bully you. Abusers may use social media to send harassing messages, blackmail you, and stalk you. [7] X Research source Abusers will insist you keep your cell phone on you at all times and answer your telephone the moment it rings. Abusers may use social media to threaten you or emotionally abuse you. They may tell you who you can be friends with on social media. They may insult you in status updates or tweets. They may insist on knowing your passwords."
    },
    {
      "title": "Know the characteristics of an abuser.",
      "content": "Know the characteristics of an abuser. Everyone is different, but physically abusive partners tend to have certain characteristics that could contribute to the cycle of violence and control. An abuser might have the following characteristics: Emotionally intense and codependent. Charming, popular, and talented. Fluctuates between emotional extremes. Might be a former victim of abuse. May suffer from alcoholism or drug addiction. Controlling. Bottles emotions up. Inflexible and judgmental. Might have a history of abuse and violence in childhood."
    },
    {
      "title": "Recognize the prevalence of domestic abuse.",
      "content": "Recognize the prevalence of domestic abuse. Abuse in relationships is more prevalent than many people think. Over one-quarter of women in the U.S. experience domestic violence. Men can also be victimized by their partners: over 10% of men experience domestic abuse. Domestic violence occurs across all socioeconomic and cultural backgrounds. Domestic violence is most prevalent in the poorest of neighborhoods and people who went to college but did not finish school."
    },
    {
      "title": "Recognize that men can be victims as well.",
      "content": "Recognize that men can be victims as well. Men who are victims of domestic violence don't just happen in LGBTQ and gay relationships. Men can also be abused by women. This often occurs in relationships where the men, for one reason or another, are in a financially inferior position to that of their women partners. Men who suffer from domestic violence often feel much more embarrassed of having endured the abuse, so they might not be as likely to come forward. They may feel they need to maintain a macho reputation. They are more likely to be afraid of appearing weak. Abused men have an added stigma and often have no recourse when they are abused by women. They are often not believed, nor are people as sympathetic towards their predicament. This can lead to further isolation and stigmatization."
    },
    {
      "title": "Understand the physical and emotional cost of abuse.",
      "content": "Understand the physical and emotional cost of abuse. Domestic violence situations cause disability and deteriorate your health. It can be compared to “the effects of living in a war zone.” 1,200 women die each year from domestic violence. Two million women sustain injuries every year from domestic violence. Domestic violence victims are at increased risk for emotional, mental, and physical disabilities. This abuse also raises victims' likelihood by 50% that they cannot walk without using a device for assistance (like a cane or walker), or that they will need a wheelchair. The risk for illnesses increases as well. Victims' chance of having a stroke is raised by 80%, heart ailments and arthritic joints by 70%, and asthma by 60%. Victims of domestic violence are more at risk for alcoholism."
    },
    {
      "title": "Track your own feelings.",
      "content": "Track your own feelings. If you are in a potentially abusive relationship, you may be experiencing new and negative feelings. Keep track of your feelings, emotions, and actions for a week or two. This will help you identify if your relationship is having a negative effect on you because it is potentially abusive. These feelings might include: Loneliness Depression Powerlessness Embarrassment Shame Anxiety Suicidal Fear Isolated from family and friends Struggling with alcohol or drug abuse Trapped with no hope of escape"
    },
    {
      "title": "Listen to your internal monologues about yourself.",
      "content": "Listen to your internal monologues about yourself. If your partner constantly puts you down and treats you badly, you may start to internalize these negative comments. You may start telling yourself that you're not good enough, you're not good looking enough, or you're not a good person. Recognize that your partner is using these comments and the resulting low self-esteem to gain control over you."
    },
    {
      "title": "Think about how and when your relationship got serious.",
      "content": "Think about how and when your relationship got serious. Many abusive relationships get serious very quickly. The abuser is ready to make a commitment without allowing you to get to know each other well. Your partner may rush you or push you to become more involved at a faster pace than you are comfortable with. If they don’t respect your need to move slowly, or tries to guilt or coerce you into something you're not ready for, things could potentially turn abusive. Sometimes, the emotions are just unbalanced and your partner feels more for you sooner than you do. This is fairly normal for a relationship. But pushing or rushing can feel really uncomfortable. If it's persistent or relentless, think about stepping away from the relationship."
    },
    {
      "title": "Observe the way arguments proceed.",
      "content": "Observe the way arguments proceed. Not everyone agrees all the time, even in the healthiest of relationships. In healthy relationships, misunderstandings, miscommunications, and conflicts are dealt with promptly and assertively. Observe the way you and your partner have disagreements. Do you calmly express your feelings and negotiate a resolution that's satisfying to both of you? Or does every disagreement escalate into a huge, hours-long row? Does your partner instantly begin pouting, yelling, or calling names? This can be a clue to bad things in store. Particularly, watch for your partner to shut down into a moody, angry sulk, with the only responses to your complaints a terse or angry answer."
    },
    {
      "title": "Think about how you communicate with each other.",
      "content": "Think about how you communicate with each other. People in healthy relationships communicate openly and honestly. This means also that healthy couples can share their feelings with each other. One partner doesn't need to be right all the time, and both partners listen to each other in a loving, open, and nonjudgmental way. [8] X Expert Source Joshua Pompey Relationship Expert Expert Interview. 27 November 2019. Assertive communication maintains a level of kindness and respect within the relationship, as well as encourages cooperation in solving problems and issues. There is a healthy amount of respect towards each other. In that, Healthy couples are kind to each other. They do not name-call, put each other down, yell, or exhibit other signs of abusive behaviors. They support each other privately and in public. They also honor their partner's boundaries."
    },
    {
      "title": "Listen to the way your partner talks about you.",
      "content": "Listen to the way your partner talks about you. Language is a powerful tool. It can also be wielded as a weapon to keep you in line and under the abusive person's \"spell.\" Expressing contempt while still professing love is a sign of danger and a sign of an emotionally abusive partner. There's no set of vocabulary that's a sure sign of emotional abuse, but listen to the context to be sure. If you're being denigrated regularly, or disrespected, or put on a level below that of your partner, it's a sign of abuse. You have the same rights as your partner, and you should be on the same level. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Watch for patterns of extreme jealousy.",
      "content": "Watch for patterns of extreme jealousy. If your partner gets angry or sulky when you want to go and have a night out with friends, they are being overly jealous. They may question you mercilessly any time you're seen talking to a member of the opposite gender (if you’re in a heterosexual relationship). If you feel you're being kept away from friends and relatives, or smothered because you can't go anywhere without your partner, it's a sign of a potentially abusive relationship."
    },
    {
      "title": "Watch for signs of possessiveness.",
      "content": "Watch for signs of possessiveness. Part of abuse is establishing control over the relationship, and thereby over you. Pushing constantly for affirmation or for more intimacy, especially early on, can be a sign of the type of insecure behavior that can help create an abusive relationship. Does your partner insist that you go everywhere together and never spend time apart? Does your partner tag along to events that they have no business attending? It may be a sign of possessiveness. [10] X Research source Saying things such as, \"You belong to me, and only me\" is a sign that your partner views you as property. They will likely become jealous when you behave like a normal person who talks to and interacts with others. Proclamations of love when you've only been dating a few days or weeks can also be a sign of a possessive and obsessive partner."
    },
    {
      "title": "Watch for unpredictability.",
      "content": "Watch for unpredictability. You may have trouble predicting your partner's moods. One moment, your partner may seem gentle and caring. Then they immediately transition into threats and intimidation. You never know where you stand with this person."
    },
    {
      "title": "Pay attention to your partner's substance use.",
      "content": "Pay attention to your partner's substance use. Are alcohol or drugs being used to excess? Does your partner become more violent, difficult, nasty and selfish when using drugs or alcohol? Have you discussed treatment options with them. Are they willing to quit? An addict who chooses to stay in a drug- or alcohol-infused state of rage is dangerous, selfish and in need of rehabilitation. You do not deserve to be harmed and your partner may need more help than you can offer. While alcohol or substance use is not necessary a sign of abuse in a relationship, abusing substances or using to excess are risky behaviors. These should be considered along with other warning signs of an abusive relationship. At the very least, take substance abuse as a sign that your partner needs help."
    },
    {
      "title": "Watch how your partner treats friends and family.",
      "content": "Watch how your partner treats friends and family. If your partner is rude or dismissive to their own parents or friends, how do you think you'll be treated? Remember that, right now, while your relationship is relatively young, your partner is on good behavior. How will things be when there is no longer any need to impress you?"
    },
    {
      "title": "Watch your partner's interactions with strangers.",
      "content": "Watch your partner's interactions with strangers. Notice if your partner treats waiters or waitresses, taxi drivers, concierges or anyone else in the service industry disrespectfully. This is a sign that someone has a mean superiority complex. They divide the world into worthiness and unworthiness and this sense of unworthiness will soon be inflicted on you."
    },
    {
      "title": "Consider what your partner thinks about your gender.",
      "content": "Consider what your partner thinks about your gender. Abusers often stereotype gender. Men who are abusers, for example, often use ‘male privilege’ to dominate women. [11] X Research source They can have negative attitudes about women and women's roles, thinking that women should be kept in the home and kept submissive. For relationships in which a woman is the abuser, there may be contempt for men that influences how they treats their partner."
    },
    {
      "title": "Adopt a zero tolerance policy for violence.",
      "content": "Adopt a zero tolerance policy for violence. If your partner ever becomes physically violent, your relationship needs to be terminated immediately. Physical abuse is never \"for your own good,\" and it's never your fault. Don't let manipulative partners coerce you into feeling guilty over being hit. It's not okay, and it's most definitely a sign of an abusive relationship, and it will happen again. Get out of this relationship immediately. [12] X Research source Threats to hurt you are as bad as physical violence. Regard them seriously and see them as danger signs of abuse to come. If your partner hurts or injures other people, animals, or is generally very physically violent, this is a sign of a violent person who should be avoided."
    },
    {
      "title": "Do not allow yourself to be intimidated.",
      "content": "Do not allow yourself to be intimidated. No matter how much you love your partner, if you're afraid in your own living space, you have a problem. You may miss your partner terribly when you're apart, but actually dread coming home. That's a clue that your relationship has already crossed the line and needs to be ended safely."
    },
    {
      "title": "Don't allow forceful behavior or coercion.",
      "content": "Don't allow forceful behavior or coercion. If your partner ever forces you to do anything you don't want to do, or manipulates you into agreement, you need to end the relationship. If your partner wheedles, begs, sulks, or starts a fight over something, until you end up caving just to stop the argument, that's an unacceptable and dangerous sign of emotional manipulation and possible abuse. An abusive person will often insist that you do things their preferred way and won't back down until you agree. This might pertain to the clothes you wear, how you do your makeup, what you eat, or the activities you do. If your partner has ever forced you to have any kind of sexual contact without your consent, this is sexual assault. It doesn't matter that you're in a relationship or if you've previously consented to sex."
    },
    {
      "title": "Trust your instincts.",
      "content": "Trust your instincts. While these warning signs and deal breakers are fairly definitive signs of a manipulative and abusive partner, these things can still be ambiguous. They can be clouded by conflicted feelings and may be difficult to detect. The best way to determine whether or not you're in a potentially abusive relationship is to trust your gut. If someone gives you a sinking feeling or fills you with a sense of foreboding, take it as a sign. You don't have to put a name on it to know when something just isn't right. [13] X Expert Source Joshua Pompey Relationship Expert Expert Interview. 27 November 2019."
    },
    {
      "title": "Talk to someone if you sense a shift in your relationship.",
      "content": "Talk to someone if you sense a shift in your relationship. When a relationship goes from unsure to turbulent or scary, it's time to take action. For more advice, call the National Domestic Violence hotline: 1-800-799-SAFE. You can also talk to a trusted friend, family member, or other person for advice. Start planning how to end the relationship safely and as quickly as possible."
    },
    {
      "title": "Call 911 immediately if things get violent.",
      "content": "Call 911 immediately if things get violent. This will ensure that the violence will stop, at least momentarily. Tell the police about the physical abuse. Describe to them what happened in detail and show where you were hurt. Have them take photos of the marks immediately or the next day when bruising shows up. Then the photos can be used in court. Remember to ask for the responding officers' names and badge numbers. Get the case or report number as well."
    },
    {
      "title": "Make your personalized safety plan.",
      "content": "Make your personalized safety plan. [14] X Expert Source Jay Reid, LPCC Licensed Professional Clinical Counselor Expert Interview. 7 August 2020. A safety plan is a worksheet that helps you work through what you would do in case your relationship puts you at risk. Find an example from the National Center on Domestic and Sexual Violence here . Print it out and complete the worksheet."
    },
    {
      "title": "Find a safe shelter.",
      "content": "Find a safe shelter. Make a list of all the places you can go. Think of friends or family who your partner doesn't know. Also include places like safehouses. Safehouses are usually maintained by nonprofit organizations. They have a secret location and are usually accessible 24 hours a day. This way, you can sneak away while your partner is sleeping if you need to. They can help you coordinate with government social services to get benefits to get you started. They can also help you get a court order of protection, and many offer counseling services."
    },
    {
      "title": "End the relationship as soon as possible",
      "content": "End the relationship as soon as possible . Put a plan in place to end your relationship safely. Once you've made your decision, try not to struggle with your complicated feelings right now: just get it done. Now's not the time to mourn for your failed relationship or reconsider. Now is the time to make yourself safe. Once you decide to leave, your abuser will suddenly do anything to get you back. This is yet another way that he seeks to control you. It's unlikely he can modify his behaviors without significant psychological counseling and/or a batterer's intervention program."
    },
    {
      "title": "Have the talk.",
      "content": "Have the talk. Plan out what you'll say, rehearse it, and keep it short and sweet. Make it clear that you're done with this relationship. You are not interested in the possibility of salvaging the relationship. Limit the conversation to as short a time as possible. Have another person with you for support, so that you won't be manipulated. If you're scared for your safety, don't break off the relationship in person, or find a public place to meet. Bring another person with you. Make certain to ensure your safety first and foremost."
    },
    {
      "title": "Don't try to tough it out.",
      "content": "Don't try to tough it out. Leave an abuser at the first signs of abuse as soon as safely possible. Reach out to at least one trustworthy person when you break up with your abusive partner. Get trustworthy and safe support from a reliable network of friends and relatives to help you through this transition."
    },
    {
      "title": "Get a personal protection order",
      "content": "Get a personal protection order if necessary. A personal protection order (PPO) is issued by the Circuit Court in your region. It protects you from contact with the abuser. This person is restricted from threatening, harassing or stalking you. This person will not be allowed to come into your home or visit you at your workplace. If you need to get a PPO, you should also move somewhere new and change your regular patterns for a while. This will make it harder for your abuser to find you and harass you."
    },
    {
      "title": "See a counselor.",
      "content": "See a counselor. It can be a good idea to see a counselor with expertise working with domestic violence victims. Even if you got out of the relationship before things got too bad, you may still want to talk about your experience with a mental health professional. [15] X Expert Source Jay Reid, LPCC Licensed Professional Clinical Counselor Expert Interview. 7 August 2020. This person may be able to help you avoid future problematic relationships."
    }
  ]
}