{
  "url": "https://www.wikihow.com/Palm-a-Basketball",
  "title": "How to Palm a Basketball",
  "steps": [
    {
      "title": "Practice finger stretches.",
      "content": "Practice finger stretches. Find a table or some other flat surface, and place your hand on it, palm-down. Stretch your fingers out as flat as you can on the table and hold for 30 seconds to one minute before releasing. Do not force your joints. If you can't flatten your hand completely, work up to it. Try this exercise a few times with each hand. Find a flat surface and place your hand on it, palm-down. Take your other hand and slide it under your fingers. Carefully push your fingers up and back towards your wrist. Hold for 20 seconds and release. Repeat this exercise 3 or 4 times. Be careful not to lift your wrist or your palm when doing this stretch."
    },
    {
      "title": "Try claw stretches.",
      "content": "Try claw stretches. Holding your hand out in front of you, bend your fingers until your fingertips touch the base of your finger joint. Your hand should resemble a claw. Hold your hand like this for at least 30 seconds, all the way up to one minute. Release and repeat with the other hand."
    },
    {
      "title": "Stretch your palms.",
      "content": "Stretch your palms. Lay your hand palm-down on a flat surface, and spread your fingers out. Try to stretch your pinky out as far as you can. Brace your thumb against the palm of your other hand. Lift your hand off the table, keeping your fingers pressed onto the flat surface. Press your fingers into the table as you stretch the palm. Hold for 20 seconds, release, and try the stretch with your other hand."
    },
    {
      "title": "Stretch your thumbs.",
      "content": "Stretch your thumbs. Hold your hand in front of you with the palm up, and stretch your thumb away from your hand. Try to stretch your thumb as far away from your hand as you can. Stretch your thumb in the other direction, and try to touch it to the base of your pinky. Hold this stretch for 30 seconds, up to one minute. Repeat with the other hand."
    },
    {
      "title": "Practice plate pinching.",
      "content": "Practice plate pinching. Find two 5 lb plate weights and place them together. Grip the plates with your thumb on one plate and your fingers on the other. Hold the plates together for 20 seconds. [1] X Research source As it becomes easier to hold the plates together, increase the weight to continue building strength. Move from two 5 lb weights to two 10 lb weights. [2] X Research source For an added challenge, try gripping the plates using just your thumb and your pinky. [3] X Research source This exercise is designed to help you focus your pinch grip strength. [4] X Research source"
    },
    {
      "title": "Practice reverse curls.",
      "content": "Practice reverse curls. Curls work the biceps, but can also increase grip strength. Using an overhand grip, hold onto the bar. Keep your hands about shoulder width apart. [5] X Research source Keep your back straight and your elbows in. Push your shoulders back and lift the bar to your chest by bending at the elbow. [6] X Research source Don't lean back and don't push your elbows out as you lift. Avoid using any momentum to lift the bar. Try to lift slowly and focus on the muscles you're using. [7] X Research source"
    },
    {
      "title": "Try fingertip push-ups.",
      "content": "Try fingertip push-ups. Place your hands on the ground about shoulder width apart, as if you were going to do a regular push-up . Spread your fingers out and place your fingertips on the ground. [8] X Research source Using your fingertips, push your body off the ground. [9] X Research source Keep your back straight as you lift your body up. When you lower back down, keep your chest just above the ground. [10] X Research source Don't strain your fingers as you practice this exercise. Start slow and work your way up to multiple push-ups."
    },
    {
      "title": "Practice your pull-ups.",
      "content": "Practice your pull-ups . Find a pull-up bar and grab it with your hands about shoulder-width apart, using an overhand grip. Lift your torso up to the bar, pulling up with your back muscles. [11] X Research source To further enhance your grip strength, try pull-ups using two towels. Find two towels and drape them over the pull-up bar. Grip the towels and perform a regular pull-up. [12] X Research source"
    },
    {
      "title": "Line your fingers up with the grooves of the ball.",
      "content": "Line your fingers up with the grooves of the ball. Place your thumb on the straight groove that runs around the middle of the ball. Place your other four fingers on the groove just above the center groove. [13] X Research source You can palm the ball from anywhere, but when you are starting out it may help to line your fingers up with the grooves. [14] X Research source Don't worry if you can't stretch your pinky to the groove, just get it as close as possible. [15] X Research source"
    },
    {
      "title": "Grip the ball using your thumb, index, middle, and ring fingers.",
      "content": "Grip the ball using your thumb, index, middle, and ring fingers. When palming a ball, your fingertips do more work than your palm. Grip the ball by pressing your fingertips into the ball. [16] X Research source Your palm may not even touch the ball once you are able to properly palm a basketball. Your fingertips should be doing all the work. [17] X Research source"
    },
    {
      "title": "Practice squeezing the ball.",
      "content": "Practice squeezing the ball. To help you build finger strength, spend time squeezing your fingertips into the ball. [18] X Research source Remember to practice squeezing with both hands."
    },
    {
      "title": "Practice a fake pass.",
      "content": "Practice a fake pass. Once you can palm a basketball, try to put your new skill to use. Thrust the ball out as if you were going to pass it, but use your fingertips to keep the ball in your hands. [19] X Research source Get used to moving the ball around while palming it. This will help your overall ball control and allow you to keep building grip strength."
    }
  ]
}