{
  "url": "https://www.wikihow.com/Open-a-Wine-Bottle-Without-a-Corkscrew",
  "title": "8 Awesome Ways to Open a Bottle of Wine without Using a Corkscrew",
  "steps": [
    {
      "title": "Find an object with blunt ends.",
      "content": "Find an object with blunt ends. It should be narrower than the cork and something that will not stab, shatter, burst, chip, or break the cork or bottle. A cheap white ballpoint pen or basic marker (including a highlighter or dry erase marker), in each case with the cap on, will work well. You could also use a long rod, a cylindrical container of chapstick, or a slim knife sharpener. Carabiners work well, too. [1] X Research source"
    },
    {
      "title": "Place the bottle on the floor or a steady surface.",
      "content": "Place the bottle on the floor or a steady surface. You can put in your lap to keep it in place. You could simply rest it on a table as well. [2] X Research source You can also place the object against a wall or other vertical surface and press horizontally. Push on the bottle's wide base to force the cork in easily. Hold the neck area and the other end of your object to prevent slipping. Make sure the surface is strong enough so that it will not dimple, or protected, like a wall padded with some junk mail."
    },
    {
      "title": "Set your object against the cork.",
      "content": "Set your object against the cork. The cork is usually already recessed slightly into the bottle's neck. If the cork is flush with the end of the bottle, push your object against the cork to force it in a little. This will allow your object to stay in place without slipping off the side of the bottle."
    },
    {
      "title": "Push the cork down.",
      "content": "Push the cork down. Point the bottle away from people, just in case wine sprays out. While gripping the bottle with one hand and your object with the other hand, push firmly on the cork until it falls into the bottle. Be ready for the wine to splash a bit when the cork hits it. [3] X Research source This method works well but you will likely end up with small pieces of cork in your wine. You can strain the wine through a coffee filter before serving it to remove any cork pieces. [4] X Expert Source Murphy Perng Certified Wine Consultant Expert Interview. 19 February 2020. The surrounding area (and the opener's clothes!) should be stain-resistant as a little wine may spill; don't try this with red wine and a nice outfit or over a carpet . Have some napkins handy; you may wish to wrap one around the neck as you push."
    },
    {
      "title": "Find a pocket knife or a paring knife.",
      "content": "Find a pocket knife or a paring knife. The blade has to fit easily into the neck of the bottle. You can also try using a serrated knife so that it grips the cork better. [5] X Research source Exercise caution when using a knife. Make sure not to cut yourself."
    },
    {
      "title": "Insert the blade into the cork.",
      "content": "Insert the blade into the cork. Carefully work the knife back and forth into the cork, using very little downward pressure. It should go all the way through the cork. [6] X Research source"
    },
    {
      "title": "Twist back and forth to slowly remove the cork.",
      "content": "Twist back and forth to slowly remove the cork. With the blade buried in the cork, twist the knife with a slight pull, and slowly work it out. Be careful not to break off pieces of the cork into your wine. [7] X Research source"
    },
    {
      "title": "Wedge the knife in between the bottle and the cork.",
      "content": "Wedge the knife in between the bottle and the cork. Use the knife to pry the cork out from the side. Carefully insert the knife between the edge of the cork and the bottle. Apply slow, even pressure on the cork by pulling the knife towards you so that its blade moves inward, like a lever. If applying pressure from the side, it works best to grip the bottleneck with your free hand slightly below the knife. Check out more ways to open a wine bottle without a corkscrew on wikiHow’s “Foolproof way to open a wine bottle without a corkscrew?” forum ."
    },
    {
      "title": "Remove the wine bottle's protective cover.",
      "content": "Remove the wine bottle's protective cover. Make sure no plastic or foil is covering the cork. It should be just the cork and the bottle. To remove the cover, simply slide it off by pulling it upwards. If it doesn't slide off, pull on the tab if it has one, which will remove the top portion of it. Alternately, cut it off with a knife by gently tracing a knife around the edge of it."
    },
    {
      "title": "Place the bottle of wine in the opening of your shoe.",
      "content": "Place the bottle of wine in the opening of your shoe. It can be any kind of flat shoe (not high heels or flip flops), as long as its opening is large enough to accommodate a bottle of wine. The bottle should go in bottom first so that the cork is facing you. To keep the bottle in the shoe, you will hold the bottle with one hand and the shoe with your other hand."
    },
    {
      "title": "Hit the sole of your shoe holding the wine bottle gently against a wall.",
      "content": "Hit the sole of your shoe holding the wine bottle gently against a wall. Continuing to hold both the shoe and the bottle, hit the bottom of your shoe against a wall several times. The bottle should be horizontal and you only need to make contact on the wall with the portion of your shoe directly under your bottle. Your shoe will protect the bottle from breaking, but don't hit it too hard. A firm hit several times should begin to move the cork out due to the pressure in the bottle. If you are on a picnic and there isn't a wall nearby, you could hit your shoe against a pole or a tree. Just make sure not to miss it or you will likely drop your bottle! If you don't have a shoe that fits a wine bottle, you could wrap the bottle in a towel or hold a book behind the bottle while hitting it. The shoe's purpose is simply to protect the bottle from breaking."
    },
    {
      "title": "Remove the cork.",
      "content": "Remove the cork. Once the cork has moved out of the bottle by about an inch, you can simply pull out the cork with your fingers. Your bottle of wine is now ready to enjoy ."
    },
    {
      "title": "Find a screw and pliers.",
      "content": "Find a screw and pliers. The wider the distance between threads on the screw, the better. Make sure that any objects which come into contact with the cork are clean as dirty objects increase the likelihood of tainting your wine."
    },
    {
      "title": "Twist the screw into the cork.",
      "content": "Twist the screw into the cork. Turn the screw into the center of the cork until there is about ½\" (1.2 cm) sticking out. You should be able to do this using only your fingers, but if you need help, you could use a screwdriver. [8] X Research source Work carefully to ensure that the cork does not break apart into smaller pieces."
    },
    {
      "title": "Pull on the screw with pliers.",
      "content": "Pull on the screw with pliers. Use the pliers to pull the screw out – the cork should come with it. The claw (nail-pulling side) of a hammer also works well in place of pliers, as does a fork. You simply need some object that can grip the screw better than your fingers."
    },
    {
      "title": "Remove the screw with a corncob holder.",
      "content": "Remove the screw with a corncob holder. Simply replace the pliers with the corncob holder, making a T shape. The screw should be vertical and the corncob holder should be horizontal. Place the corncob holder where the prongs are hugging the screw. Place your index and middle fingers on the prongs and handle respectively, and pull up. Make sure the corncob holder is thinner than the flat end of a small to medium threaded screw."
    },
    {
      "title": "Use a bicycle hook instead of a screw.",
      "content": "Use a bicycle hook instead of a screw. Find a bicycle hook (the kind used to hang bikes from rafters). Screw it into the cork. Using the vinyl-coated hook as a handle, pull the cork out, away from your body. This way, you don't need pliers or another object to remove it."
    },
    {
      "title": "Straighten the hook of a wire hanger.",
      "content": "Straighten the hook of a wire hanger. Get a cheap wire coat hanger and bend the hook part out straight."
    },
    {
      "title": "Make a mini hook at the bottom of the hanger.",
      "content": "Make a mini hook at the bottom of the hanger. Use pliers to make a little hook by bending the last half inch (10 mm) back until it makes an angle of about 30 degrees (a bit like a fishhook). [9] X Research source"
    },
    {
      "title": "Wedge the wire in between the cork and the wine bottle.",
      "content": "Wedge the wire in between the cork and the wine bottle. The wire should be straight against the edge of the bottle (the hook shouldn't face in yet). Push the wire down beside the cork until the little hook is below the cork. You will need to push it down at least 2” to accomplish this. [10] X Research source"
    },
    {
      "title": "Rotate the wire 90 degrees.",
      "content": "Rotate the wire 90 degrees. This will allow the hook to grab the bottom of the cork so that you can easily pull it out. Simply twist the hanger so that the little hook moves towards the center of the bottle. [11] X Research source"
    },
    {
      "title": "Remove the cork.",
      "content": "Remove the cork. Pull on the hanger slowly, wobbling it back and forth a bit to ease out the cork. You might want to wear gloves, as the wire can hurt your fingers. The hook should enter into the cork while pulling up so that the cork moves with the hanger."
    },
    {
      "title": "Use the hanger as a corkscrew.",
      "content": "Use the hanger as a corkscrew. An alternate method with a coat hanger is to use the hanger in place of a corkscrew. After straightening the hook, simply insert it into the center of the cork. Twist the hanger while pulling on it gently. This will gradually remove the cork."
    },
    {
      "title": "Get two paperclips and a pen.",
      "content": "Get two paperclips and a pen. Partially straighten the paperclips, leaving the U-shapes intact. Pull the outer portion of the paperclip into a straight line without straightening the innermost U shape."
    },
    {
      "title": "Insert one of the paperclips in the side of the bottle.",
      "content": "Insert one of the paperclips in the side of the bottle. Work one of the small U's into the bottle between the glass and the cork until the U is below the cork and the straight portion remains out of the bottle. Rotate the wire 90 degrees so that the U will be beneath the cork when you pull up. [12] X Research source Repeat on the opposite side of the cork with the second paperclip."
    },
    {
      "title": "Join the ends of the paperclips together.",
      "content": "Join the ends of the paperclips together. Twist the ends together a few times. They should be securely joined so that they stay together when pulling out the cork."
    },
    {
      "title": "Remove the cork.",
      "content": "Remove the cork. Insert a suitable utensil, such as a spoon handle, pen barrel, or pencil, under the twisted wires. Slide your fingers under the utensil, with the wires between your middle and ring fingers, and slowly pull out the cork. [13] X Research source"
    },
    {
      "title": "Find 3 short finishing nails and a hammer.",
      "content": "Find 3 short finishing nails and a hammer. Ideally, you will want the nails to reach just to the bottom of the cork."
    },
    {
      "title": "Gently hammer the nails into the cork.",
      "content": "Gently hammer the nails into the cork. Hammer them straight down and form a line with the nails. Keep the nails close to each other. Don't hammer too hard or you could break the cork into pieces. [14] X Research source"
    },
    {
      "title": "Place the claw of the hammer around the nails.",
      "content": "Place the claw of the hammer around the nails. It should grip them tightly to allow for removal."
    },
    {
      "title": "Pry the nail-embedded cork out of the bottle.",
      "content": "Pry the nail-embedded cork out of the bottle. Simply pull on the hammer and gradually move the cork towards you. You can gently rock it back and forth to help with removal. You can also use the hammer and nails to hold the cork in place and twist the bottle away from you to separate the cork from the bottle. If at first the cork does not come out, hammer nails in again in a line perpendicular to the original line and try again."
    },
    {
      "title": "Get a pair of scissors.",
      "content": "Get a pair of scissors . It is best to use smaller craft scissors or scissors for children (not safety scissors)."
    },
    {
      "title": "Open the scissors all the way.",
      "content": "Open the scissors all the way. Be sure not to touch the sharp side of the blades. Hold the handles of the scissors and open them fully."
    },
    {
      "title": "Insert the thinner blade into the middle of the cork.",
      "content": "Insert the thinner blade into the middle of the cork. Carefully apply a slight amount of pressure and push the scissor blade halfway into the cork. Be careful not to push the cork into the bottle or break the cork. [15] X Research source"
    },
    {
      "title": "Twist the scissor handles while pulling up.",
      "content": "Twist the scissor handles while pulling up. Hold the bottle tightly with one hand while twisting the handles of the scissors. Alternately, hold the handles of the scissors still and twist the bottle instead. The cork will come out on the scissor blade if you have the blade wedged deep enough or the cork will come out far enough to be pulled out by hand. [16] X Research source"
    }
  ]
}