{
  "url": "https://www.wikihow.com/Register-Your-Dog-As-a-Service-Dog",
  "title": "How to Register Your Dog As a Service Dog",
  "steps": [
    {
      "title": "Recognize the difference between unofficial registration and government requirements.",
      "content": "Recognize the difference between unofficial registration and government requirements. The United States does not require official registration for service dogs. No proof, official training, or documentation is required for your dog to be a service dog. If a landlord, business, or other organization asks for official registration, let them know that service dogs are not legally registered. [2] X Research source"
    },
    {
      "title": "Avoid websites that register your service dog for a fee.",
      "content": "Avoid websites that register your service dog for a fee. Some unofficial registration sites use fear tactics to con people with service dogs out of money. They claim that unless their dog is \"officially registered\" with them, their service dog is not validated. Avoid any registration sites that cost money to sign your dog up for, as they are designed to scam uninformed dog owners. Some well-known scam sites include: [3] X Research source Service Animal Registry of America (SARA) United Service Animal Registry (USAR plus) Goldstar German Shepherds Service Dogs America (SDA) Registered Service Dog Service Dog Certification of America (SDCA) National Service Animal Registry (NSAR) American Service Dogs Service Dog ID Certified Service Dog National Association of Service Dogs Service Dog Tags Free My Paws Canadian Registry of Therapy Animals and Service Animals (CRTASA) United States Service Dog Registry (USSDR) Official Service Dog Registry Service Dog Kits"
    },
    {
      "title": "Remember the 2 questions businesses can legally ask service dog owners.",
      "content": "Remember the 2 questions businesses can legally ask service dog owners. Although business owners or other organizations cannot ask what disability a service dog owner suffers from, they can ask two things to assess the validity of a service dog instead of documentation. If a business or organization wants to see legal registration, let them know that the United States does not offer official registration and answer these 2 questions instead: [4] X Research source Is this a service dog required because of a disability? What is it trained to do to mitigate the disability?"
    },
    {
      "title": "Seek unofficial registration for your own personal interest.",
      "content": "Seek unofficial registration for your own personal interest. Although you cannot officially register your service dog, you may be interested in registering your dog unofficially for the novelty. If this is the case, look for a service that does not claim to offer legal registration and notes that their services are not official documentation. Do not claim that your unofficial registration is legal documentation of your service dog, as this may be considered illegal. [5] X Research source"
    },
    {
      "title": "Train your dog to meet the ADI standards as an alternative to registration.",
      "content": "Train your dog to meet the ADI standards as an alternative to registration. Although you cannot officially register service dogs in the United States, training them to pass the ADI Public Access Test can give proof of your service dog's skills. If you need to document your service dog's abilities, the ADI Public Access Test is considered the most credible service animal skills test."
    },
    {
      "title": "Find an established service dog trainer.",
      "content": "Find an established service dog trainer. In the United States, there is no certification requirement for service dogs or service dog trainers. While not legally required, however, training your dog to pass a certification test can make them a more qualified service dog. To find a reputable service animal trainer, ask friends or family members for recommendations or contact a nearby veterinarian. Some different companies and trainers specialize in different dog services. Legitimate dog trainers might also be registered with a training organization like: [6] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Pet Partners: https://petpartners.org/ Assistance Dogs International: https://www.assistancedogsinternational.org/"
    },
    {
      "title": "Take the Public Access Test, the standard service dog certification.",
      "content": "Take the Public Access Test, the standard service dog certification. Although there is no internationally-recognized test for service dogs, the Public Access Test is considered an \"unofficial standard\" for service dogs. It is not legally required but can give you an idea of how efficient your service dog is. The Public Access Test requires your dog to meet several expectations, including: [7] X Research source Safely crossing a street No solicitations for food or affection Avoiding distractions Self-control of excitement Only urinating or defecating on command No biting, barking, growling, or other aggressive behavior Other disability-related tasks"
    },
    {
      "title": "Record your dog performing the Public Access Test for documentation.",
      "content": "Record your dog performing the Public Access Test for documentation. Official certification of the Public Access Test usually isn't required or given. If you need verification of your dog passing the Public Access Test, record your dog completing the test. You can then use the video as proof if required. [8] X Research source Although the United States does not require dogs to take the Public Access Test, they do require your dog to be trained (either self-trained or via a trainer) before they can meet the definition of a service dog."
    },
    {
      "title": "Avoid fraudulent or unqualified dog trainers.",
      "content": "Avoid fraudulent or unqualified dog trainers. Watch out for warning signs when choosing a dog trainer. If your potential trainer does not talk about their previous experience and qualifications, cannot provide previous clients as references, or will not directly answer your questions, choose a different trainer. Unqualified trainers will not be able to teach your dog the skills it needs for the Public Access Test. [9] X Research source"
    },
    {
      "title": "Request a doctor's letter if you have a psychiatric service dog.",
      "content": "Request a doctor's letter if you have a psychiatric service dog. Unlike emotional support dogs, which primarily provide comfort, psychiatric service dogs are trained to assist their handlers with mental illness-related disabilities. Landlords, airlines, or other organizations can require a doctor's letter for psychiatric service dogs. Like the ADI Public Access Test, a doctor's letter is not considered legal registration. It can, however, be a helpful document to give individuals or organizations that request proof of your service dog's credibility. Many airlines require that psychiatric service dogs have a doctor's note before allowing them on the plane."
    },
    {
      "title": "Ask your doctor or therapist for an official letter.",
      "content": "Ask your doctor or therapist for an official letter. For your letter to be legitimate, it must be written by a clinical or mental health professional. Let them know what you feel comfortable with them disclosing in your letter—you do not need to share your diagnosis or the nature of your disability. [10] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source Tell your doctor or therapist what you need the letter for so they can base the information on your needs. [11] X Research source"
    },
    {
      "title": "Avoid online websites that provide fraudulent \"doctor consultation letters.\"",
      "content": "Avoid online websites that provide fraudulent \"doctor consultation letters.\" Some scam websites may offer \"doctor consultations\" by phone or email, then claim to send an official doctor's note. These websites are fraudulent and do not provide real doctor's letters. Schedule an appointment with a licensed physician or therapist to ask about a legitimate letter."
    },
    {
      "title": "Request a letter for non-psychiatric service dogs to make accessibility easier.",
      "content": "Request a letter for non-psychiatric service dogs to make accessibility easier. Apart from psychiatric service dogs, other service dogs do not need a letter of recommendation. If your service dog is not for a psychiatric disability, a doctor's letter can still make housing, traveling, or other activities simpler. It is not, however, required by law. [12] X Research source"
    }
  ]
}