{
  "url": "https://www.wikihow.com/Pierce-Ears-with-a-Sewing-Needle",
  "title": "How to Pierce Ears with a Sewing Needle",
  "steps": [
    {
      "title": "Clean the area where you'll be piercing your ears.",
      "content": "Clean the area where you'll be piercing your ears. The least recommended place is the washroom as microbes from the toilet and sink faucet are contaminated. If you'd like to do your piercings there, wipe off countertops, sink faucets, toilet; in general, clean your washroom as many bacteria and viruses usually cause infection."
    },
    {
      "title": "Gather your materials and wash your hands well with an anti-bacterial soap and hot water.",
      "content": "Gather your materials and wash your hands well with an anti-bacterial soap and hot water. Doing so will kill most bacteria on your hands. Dry your hands with a CLEAN paper towel and use your hand sanitizer to kill off 99.99% of the germs. You want to prevent any infections before piercing."
    },
    {
      "title": "Sanitize your needle in a boiling pot of hot water for about 2 minutes.",
      "content": "Sanitize your needle in a boiling pot of hot water for about 2 minutes. Sanitize again with an open flame for about 5 seconds then wipe off the residue. Sanitize one more time with the Isopropyl Alcohol and Hand sanitizer mixed in a clean container and leave it for about a minute. Do the same step with your earrings."
    },
    {
      "title": "Take out the earrings and needle from the alcohol solution and wipe them clean with a paper towel and cover with a paper towel.",
      "content": "Take out the earrings and needle from the alcohol solution and wipe them clean with a paper towel and cover with a paper towel."
    },
    {
      "title": "Wash your hands again with hot water and the anti-bacterial soap.",
      "content": "Wash your hands again with hot water and the anti-bacterial soap. Use the hand sanitizer."
    },
    {
      "title": "Clean your ears with the anti-bacterial soap and sanitizer with a cotton swab.",
      "content": "Clean your ears with the anti-bacterial soap and sanitizer with a cotton swab. Add your numbing gel on your ears and wait for about a minute"
    },
    {
      "title": "Piercing time!",
      "content": "Piercing time! Mark the place where you want to pierce your ears. Make sure the guides are even so when you pierce your ear, the holes will be even and perpendicular on both sides."
    },
    {
      "title": "Grab your sterilized needle and pierce the marked area.",
      "content": "Grab your sterilized needle and pierce the marked area. You do not want to pierce to the back of your head, you want to pierce it at a 45 degree angle, to the back of your neck."
    },
    {
      "title": "Push the needle through as straight as possible but swiftly as well.",
      "content": "Push the needle through as straight as possible but swiftly as well. The longer you push, the more your ear will hurt even if you use numbing gel. Numbing gel only numbs the first layer of skin."
    },
    {
      "title": "Once you pierce your ears, follow through with the earring or take your needle out and put the jewellery in as quick as possible.",
      "content": "Once you pierce your ears, follow through with the earring or take your needle out and put the jewellery in as quick as possible."
    },
    {
      "title": "Once you have your jewellery in, clean your ears again with anti-bacterial soap and sanitizer.",
      "content": "Once you have your jewellery in, clean your ears again with anti-bacterial soap and sanitizer. DO NOT USE PEROXIDE! Peroxide dries out the skin and will not let the pierced area heal."
    },
    {
      "title": "Finally, wash your hands with hot water, anti-bacterial soap and hand sanitizer and you are finally done!",
      "content": "Finally, wash your hands with hot water, anti-bacterial soap and hand sanitizer and you are finally done! Enjoy your new piercing!"
    }
  ]
}