{
  "url": "https://www.wikihow.com/Practice-Shamanism",
  "title": "How to Practice Shamanism",
  "steps": [
    {
      "title": "Learn the history of shamanism.",
      "content": "Learn the history of shamanism. The word \"shaman\" originated in the Evenki language of Siberia, where its exact meaning is unclear. From this murky beginning, anthropologists have spread the term to describe spiritual practitioners of many cultures, and the term \"shamanism\" has been adopted by many native Americans and other groups. There is still an incredibly wide variety in the types of traditional shamanism practiced across the world. Shamanism is based on the belief that all things (animals, plants, sun, soil, even man-made things) have spirit and life in them, and can be communicated with. Shamanism is not a religion, and historically, there was no organization for it."
    },
    {
      "title": "Understand neoshamanism in Western culture.",
      "content": "Understand neoshamanism in Western culture. In the 20th century, the historian Mircea Eliade and the anthropologist Michael Harner separately argued that many varieties of spiritual traditions around the world could all be defined as \"shamanism,\" with core principles at the heart of different practices and beliefs. [1] X Research source [2] X Research source This directly led to many new traditions, mostly started by white Westerners, such as \"core shamanism,\" and many types of \"neoshamanism\" or \"New Age shamanism.\" [3] X Research source"
    },
    {
      "title": "Understand the controversy.",
      "content": "Understand the controversy. Traditional shamanism, in its hundreds of different forms, is still alive today, and its practitioners (as well as scholars of religion) have a range of reactions to more recent shaman traditions. There are many sides to this discussion, and not all types of shamanism or individual shamans agree with all of these points, but you may wish to be aware of as you begin exploring shamanism: Although it is not uncommon for shamans to charge for services, some new \"shaman businesses\" are often considered cynical. [4] X Research source [5] X Research source Most new-style shamans use traditions from other cultures. This can be done respectfully and knowledgeably, or in an uninformed or incorrect way that many find offensive. [6] X Research source Western shamanism is often taught as a self-improvement technique, while many older traditions cause harm to the shaman, include \"evil\" or \"grey area\" practices, or focus on helping the community. [7] X Research source"
    },
    {
      "title": "Study Western neoshamanism.",
      "content": "Study Western neoshamanism. If you decide you would like to learn more about a modern shamanism tradition, you can find many materials online or in mass-published books. Most of these are unique theories and practices developed by a single person, but a few resources listed below are examples of especially influential voices. You can also read more about general trends in these movements in the section below on practicing shamanism. The Foundation for Shamanic Studies promotes \"core shamanism,\" claiming to teach the essential principles at the core of shamanic traditions worldwide. Cleargreen Incorporated practices 20th-century pseudo-Mexican shamanism called \"Tensegrity.\" Terence McKenna was an influential supporter of shamanism in the 1990s, tying it to many New Age theories and psychedelic experimentation."
    },
    {
      "title": "Study traditional shamanism.",
      "content": "Study traditional shamanism. The method of becoming a traditional shaman varies from culture to culture but typically involves a sudden supernatural event, inheriting the position, or training as an apprentice. If you do not belong to a culture with shamanic traditions, you may need to visit an indigenous community to study under a shaman or someone in a similar role. You can also learn more about these traditions by reading books by anthropologists and other people who describe shamanistic practices of a specific culture: The book Ancient Land, Sacred Whale by Tom Lowenstein describes the rituals and myths of the Alaskan Tikigaq whale hunters."
    },
    {
      "title": "Induce a drumming trance.",
      "content": "Induce a drumming trance. Entering the spirit world, or discovering another reality next to our own, is one of the most common shamanic practices. One of many ways to do this is to enter a trance. Try blindfolding yourself and beating a drum with a steady beat for several minutes, or until you enter a different state of awareness."
    },
    {
      "title": "Meditate",
      "content": "Meditate . Another way to enter a trance, or to become in touch with your inner self, is to practice meditation. Many people consider it a solid foundation for any spiritual path, and a source of health benefits that match well with some shamanic tradition's message of self-improvement. There are many schools of meditation, but it all begins with closing your eyes and sitting in a quiet place."
    },
    {
      "title": "Listen to your dreams.",
      "content": "Listen to your dreams. Dreams are often important to people practicing shamanic rituals. They may be holding great truths, revelations or some other spiritual significance. Keep a dream journal so that when you wake up, you'll be able to write or draw some of the images down. The images you draw may hold power. Be wary if you do not know what they represent."
    },
    {
      "title": "Interact with spirits and other entities.",
      "content": "Interact with spirits and other entities. There is no universal way to encounter these entities, but in many traditions, you cannot be a shaman without doing so. During a trance, a meditation, or a sudden, unexpected experience, you may encounter another being. This may be a nature spirit, a spirit in the afterlife, or even entities that some consider gods. There is no single pantheon or worldview that can explain what you encounter, but an experienced shaman can help you identify them and teach you how to make deals with them, serve them, or master them, depending on the traditions you follow. Be aware that some of these entities may be malevolent or tricky to deal with. Often, rituals that involve drugs, sacrifice, or other sources of power attract potentially more dangerous entities."
    },
    {
      "title": "Find a teacher.",
      "content": "Find a teacher. While you can develop your own shamanic practices, almost everyone finds the guidance of a teacher of a fellow journeyer helpful. This could be a shaman practicing the traditional shamanism of her culture, or a shaman from a \"neoshamanism\" tradition. This step is recommended before trying any of the steps below, or if you have a dangerous or frightening encounter with spirits. If you believe that all things have some sort of spirit that you can communicate with, and that you can utilize these different unseen forces for healing or for benefiting others, it doesn't make you a shaman yet. It only means that you have shamanic capabilities and are tuned into shamanic practice, but you still have a lot to learn."
    },
    {
      "title": "Be cautious with drugs.",
      "content": "Be cautious with drugs. Entheogens, or substances that \"generate the divine within,\" can be powerful allies in affecting our consciousness, but they are not always necessary. [8] X Research source Learn how to hone your own abilities as a Shamanic Practitioner before integrating these into your practice, and learn how to use them with trusted, human individuals watching over you. Plenty of legal substances are used in shamanic traditions, such as tobacco. In the United States, drugs such as peyote and ayahuasca are legal or in a legal grey area when used by people who can prove they are part of traditional culture."
    },
    {
      "title": "Conduct healing rituals.",
      "content": "Conduct healing rituals. Healing is a major duty of many experienced shamans. The exact ritual varies and is usually passed on by teachers. This can involve many techniques: Dancing, singing, or playing instruments to attract spirits. Making offering to the spirits of food, drink, tobacco, and other substances. (Sometimes, the spirits are brought inside your body first.) [9] X Research source Drawing the sickness out of the body and into an animal, object, or symbol. Traveling to another reality to intercede with the spirits on the sick person's behalf."
    },
    {
      "title": "Perform divination",
      "content": "Perform divination . Many New Age shamans use divining rods, séances, crystals, or other divining implements. Some attempt to see the future, while others use these tools to seek guidance for their own life, or to communicate to spirits in the afterlife."
    }
  ]
}