{
  "url": "https://www.wikihow.com/Polish-Bronze",
  "title": "How to Polish Bronze with Home Ingredients",
  "steps": [
    {
      "title": "Lemon juice and baking soda:",
      "content": "Lemon juice and baking soda: Squeeze the juice of one lemon into a bowl, then stir in enough baking soda to create a paste that’s similar in consistency to either thick honey or toothpaste. It’ll take roughly equal amounts of lemon juice and baking soda to make the paste, but it’s not really necessary to do measurements here. [1] X Research source It’s fine to use bottled lemon juice if it is in fact 100% juice. Start with about 2 US tbsp (30 ml) of juice and add baking soda until you get the proper consistency."
    },
    {
      "title": "Flour, salt, and vinegar:",
      "content": "Flour, salt, and vinegar: To begin, add equal amounts (by volume) of table salt and all-purpose flour to a mixing bowl. Slowly pour in white vinegar, stirring constantly, until you end up with a paste that has a toothpaste consistency. [2] X Research source For a small-to-medium bronze item, for example, you might start with 1/2 c (60 g) of flour and 1/2 c (135 g) of salt. You’ll probably need around 4 fl oz (120 ml) of vinegar to make a thick paste."
    },
    {
      "title": "Toothpaste:",
      "content": "Toothpaste: Basic white toothpaste works best here, rather than gels or other variations, but any type should do. The same mild grittiness that helps the toothpaste clean your teeth will help to clear away tarnish from your bronze item. [3] X Research source You’ll need enough toothpaste to apply a thick coating over the entire item—in most cases, a standard tube should be plenty."
    },
    {
      "title": "Ketchup:",
      "content": "Ketchup: Yep—just go to the fridge and grab your ketchup bottle! You’ll just need enough of it to apply a full coating over your bronze item. Alternatively, you can pour the ketchup into the bowl and completely submerge the bronze item in it. [4] X Research source The acids in ketchup work to break down tarnish on bronze. Unlike the other DIY options here, ketchup lacks grittiness to help manually polish your bronze item. So it’s probably best suited for use on lightly-tarnished items or delicate items that you’re worried about polishing too harshly."
    },
    {
      "title": "Commercial metal polish:",
      "content": "Commercial metal polish: Not everyone wants to go the DIY route, of course, and there are plenty of brands of metal polish out there that work on bronze. Brasso is probably the best known brand, but any alternative (such as Blue Magic) that lists bronze on the package should do an effective job. Pastes and creams tend to be less messy and easier to use than liquid formulations, but that’s mostly up to personal preference."
    },
    {
      "title": "Dust or rinse off the bronze item to remove surface debris.",
      "content": "Dust or rinse off the bronze item to remove surface debris. To remove accumulated dust, simply brush it off with a dusting cloth or wand . If dust has collected in hard-to-reach areas, go ahead and rinse the item under a gentle stream of clean water. Removing this surface debris beforehand makes it easier for the polish to get to work right away."
    },
    {
      "title": "Rub a coating of polish onto the item with circular motions.",
      "content": "Rub a coating of polish onto the item with circular motions. Put on cleaning gloves and use a rag, paper towel, t-shirt scrap, toothbrush, and/or cotton swab as your buffing tool(s). Scoop up some of the polish (toothpaste, ketchup, etc.) and massage it into the bronze item. Work in small, circular motions and apply steady pressure. [5] X Research source Scoop up more polish as needed and buff it into another part of the item until you’ve covered the entire thing. Apply more polish and pressure to the areas that are more heavily tarnished. You can skip putting on cleaning gloves if you’re using a DIY polish (not commercial metal polish), but wearing gloves will save your hands from some unnecessary irritation."
    },
    {
      "title": "Leave the coating of polish on the bronze item for up to 60 minutes.",
      "content": "Leave the coating of polish on the bronze item for up to 60 minutes. Once you're done buffing the entire item with your chosen polish, leave it in place so the acids can keep working on the tarnish. How long should you leave it on? That depends on which polish you chose: [6] X Research source Lemon juice and baking soda: 30-60 minutes. Flour, salt, and vinegar: 30-60 minutes. Ketchup: 30-60 minutes. Toothpaste: 5-15 minutes. (Toothpaste lacks the tarnish-busting acids of the other options here, so the benefits of leaving it on after buffing are limited.) Commercial metal polish: Follow the specific product instructions. Your chosen brand of polish may or may not recommend any amount of “leave on” time."
    },
    {
      "title": "Wipe off the excess polish with a clean cloth.",
      "content": "Wipe off the excess polish with a clean cloth. After waiting up to 60 minutes to let the polish do its work, use a damp cloth, paper towel, or sponge to clean off the clumps of polish on the bronze item. Use a finer tool like a cotton swab to remove any clumps of polish from nooks and crannies. [7] X Research source Work over the kitchen sink to capture the falling debris. You could also use a paper towel or sponge since this process will get your cleaning rag a little messy."
    },
    {
      "title": "Rinse off the bronze item with clean water.",
      "content": "Rinse off the bronze item with clean water. Turn on the kitchen faucet and use the stream of water to wash away any remaining polish from the bronze item. Use your rag or cotton swab again to remove any stubborn bits of polish as they work loose under the running water. [8] X Research source Using hot water may help to dissolve and loosen the polish more quickly."
    },
    {
      "title": "Wipe the item with a drying cloth, then let it air dry.",
      "content": "Wipe the item with a drying cloth, then let it air dry. Use a clean, dry, lint-free microfiber cloth or towel to remove all the moisture from the polished bronze. Make sure you soak up any drops of water that are left within the grooves of the bronze to prevent water spots from forming. Give the item an hour or two to completely dry before moving on to the next step. Since body oils can get bronze dirty, wear cleaning gloves or cotton gloves when you’re drying off and handling bronze. If you notice some areas still have a dirty-looking patina, you can repeat the polishing process."
    },
    {
      "title": "Burnish the bronze with a few drops of olive oil to restore its shine.",
      "content": "Burnish the bronze with a few drops of olive oil to restore its shine. Use a clean, soft cloth to rub a small amount of olive oil into the newly polished surface of your bronze item. Work in small, circular motions and apply steady pressure to coat the bronze in a thin layer of olive oil. [9] X Research source A little olive oil goes a long way here! You only need a few drops for a smaller bronze item. The finished product should be slightly glossy, not greasy. Wear gloves so you don’t transfer skin oils to the bronze. The olive oil will provide a shiny finish and will seal off the metal from the elements naturally. Alternatively, use the same technique to apply clear paste wax to the item to add a more protective coating."
    }
  ]
}