{
  "url": "https://www.wikihow.com/Measure-Relative-Humidity",
  "title": "How to Measure Relative Humidity",
  "steps": [
    {
      "title": "Choose a digital hygrometer for the most accurate reading.",
      "content": "Choose a digital hygrometer for the most accurate reading. Digital hygrometers measure the relative humidity in the air by using a sensor to monitor an electrical current. As the moisture in the air affects the electric current, the hygrometer is able to measure the relative humidity. [1] X Research source Digital hygrometers can keep track of multiple humidity readings so you can compare and track changes in the air over time. Most digital hygrometers feature an LCD display that makes checking the measurements easy to do."
    },
    {
      "title": "Select an analog hygrometer for an inexpensive option.",
      "content": "Select an analog hygrometer for an inexpensive option. Analog hygrometers use a coil spring with moisture-sensitive material attached. As the material expands or contracts based on the moisture in the air, the coil spring moves a needle on a circular dial that gives you a measurement of the relative humidity. [2] X Research source Analog hygrometers are cheaper than digital hygrometers and are often much more durable. The analog versions are not as accurate as digital hygrometers and take longer to adjust to humidity fluctuations in the air."
    },
    {
      "title": "Install the hygrometer on a wall where you want to measure humidity.",
      "content": "Install the hygrometer on a wall where you want to measure humidity. Whether you want to measure the relative humidity outside or in a room in your home, place the hygrometer on the wall so it’s high enough to take a reading and isn’t in the way. Don’t place the hygrometer in direct sunlight or it could affect the accuracy of your readings. [3] X Research source Place the hygrometer at least 5 feet (1.5 m) off of the ground."
    },
    {
      "title": "Allow the hygrometer to adjust to the humidity in the area.",
      "content": "Allow the hygrometer to adjust to the humidity in the area. Before you can check the reading, you need to wait at least 5 minutes to give the hygrometer time to adjust to and measure the humidity in the air around it. Analog hygrometers especially need a few minutes before you can accurately measure the humidity with it. [4] X Research source Don’t stand directly next to the hygrometer as it adjusts. Your body heat and breath could affect the measurement."
    },
    {
      "title": "Check the reading on the hygrometer to see the humidity level.",
      "content": "Check the reading on the hygrometer to see the humidity level. After you’ve installed your hygrometer and allowed it to adjust, you can check the reading to get a measurement of the relative humidity in the area. Relative humidity refers to the amount of water vapor present in the air and is expressed as a percentage. Your hygrometer will give you a percentage level of humidity. [5] X Research source For example, if the screen or the arrow shows a reading of 85%, then the relative humidity level is 85%. A comfortable relative humidity level is in the 40-50% range. However, normal relative humidity levels vary from location to location."
    },
    {
      "title": "Download a hygrometer app to your smartphone or tablet.",
      "content": "Download a hygrometer app to your smartphone or tablet. You need to have a tablet or smartphone that has a built-in humidity sensor in order for the app to work. A hygrometer app will use the sensor to take a reading of the relative humidity in the room around it. Go to your smartphone or tablet’s app store and search for a hygrometer app to download. [6] X Research source Go to the app store to download a hygrometer app to your iPhone . Use the Google Play Store to download an app to your Android . You can also connect a sensor to your smartphone via Bluetooth or a cable to measure the relative humidity. Popular hygrometer apps include Analog Weather Station, Meteo Calculator, and Hygrometer."
    },
    {
      "title": "Open up the application.",
      "content": "Open up the application. After you’ve downloaded the app, find it in your menu, and tap on it with your finger to launch it. If you’ve just downloaded it, it may take a few moments for the app to update and calibrate. [7] X Research source Wait until the app is fully downloaded before you try to open it."
    },
    {
      "title": "Choose the relative humidity option to get a reading.",
      "content": "Choose the relative humidity option to get a reading. Depending on which app you download, you’ll have different options to choose from. Some apps also use data from local weather stations to calculate the relative humidity and may need to know your location. Select the relative humidity option to get a percentage of the water vapor in the air. [8] X Research source Allow a few minutes to let the app adjust to the environment."
    }
  ]
}