{
  "url": "https://www.wikihow.com/Smile-for-Pictures",
  "title": "How to Smile for Pictures",
  "steps": [
    {
      "title": "Smile with your eyes.",
      "content": "Smile with your eyes. When it comes to smiling for pictures, the worst offense is flashing a jack-o-lantern: all teeth, no eyes. In order for your smile to look authentic, you've got to bring your eyes into it and give what is called a Duchenne smile. A true Duchenne smile is naturally authentic, since it's very difficult to engage the muscles around the eyes unless you truly have something to smile about. Check out the difference in the mirror. Do you see how much less happy you look when your eyes aren't engaged? When you're smiling for a picture, pretend like you're smiling at someone you love . Your eyes will crinkle convincingly and your smile will look authentically beautiful. Try to think about something that makes you happy, like a puppy. [1] X Expert Source Traci Halvorson Modeling Agent Expert Interview. 17 June 2021."
    },
    {
      "title": "Show some teeth.",
      "content": "Show some teeth. It's not necessary to give a big, toothy grin, but showing some teeth in your smile will brighten your face. Try showing just your upper teeth, rather than smiling so big that all of your teeth are exposed. If you prefer a close-mouthed smile, that's fine - just know that you'll probably look more serious than everyone else in the picture. Practice a range of different smiles so you're ready for the camera. [2] X Expert Source Traci Halvorson Modeling Agent Expert Interview. 17 June 2021."
    },
    {
      "title": "Find your best angle.",
      "content": "Find your best angle. Facing the camera head-on isn't the most flattering pose for most people. It flattens your features and can cause you to look a bit distorted in the photograph. Instead, show off your pretty bone structure by turning your head slightly to one side. If you have what you would consider a \"good\" side - a side that makes your features look finer - bare that side to the camera. While angling your face can make your picture look more flattering, it can also look contrived if you overdo it. Make sure your face is tilted at what looks like a natural angle. If possible, stand a bit below the camera, so that it's pointing slightly down at you instead of pointing up."
    },
    {
      "title": "Hold your face level with the camera.",
      "content": "Hold your face level with the camera. If you tuck in your chin, the shape of your face will look distorted. If you tilt your head up and stick your chin out, it'll look like you're trying to hide a double chin. The most natural position for your face is to hold it level with the camera, as though you were going to have a conversation with it."
    },
    {
      "title": "Say a word that ends in \"uh.\"",
      "content": "Say a word that ends in \"uh.\" Photographers love to tell their subjects to say \"cheese,\" but this tends to result in \"cheesy\" photos for two reasons. First, the \"ee\" sound stretches the mouth into an unnaturally, fake-looking smile. Second, your smile won't look authentic unless you're authentically cheerful, and being told to say cheese causes most people over the age of 8 to feel annoyed. The solution? Think of something you love that ends in an \"uh\" sound. Pronouncing \"uh\" causes the lips to form a more natural smile. Thinking of something you love also results in a natural smile. Doing both at the same time will help you produce your most gorgeous expression! [3] X Research source For example, if you love a person named Elijah, think of him and say his name when it's time to smile for the camera. Any other person, place or thing works just as well, as long as it brings a smile to your face when you think about it."
    },
    {
      "title": "Have good dental hygiene.",
      "content": "Have good dental hygiene. Your best smile will stem partly from feeling confident in your appearance. [4] X Expert Source Traci Halvorson Modeling Agent Expert Interview. 17 June 2021. If your teeth aren't clean, you're not going to want to reveal them to the world. Make sure you brush and floss your teeth and get regular dental cleanings to keep them looking as bright and pretty as can be."
    },
    {
      "title": "Brighten your teeth with whitening methods.",
      "content": "Brighten your teeth with whitening methods. If your teeth are yellowed or discolored, you might feel more confident in your smile if you whiten them. There's no need to get an expensive whitening treatment done. You can brighten your smile in just a few minutes using a natural whitening technique. Here's what to do: Rinse your teeth with hydrogen peroxide. It's a safe, natural bleaching agent that will brighten them a few shades. Brush your teeth with baking soda. Add a little to your toothpaste or make a simple paste of baking soda and water, then brush away. Don't do this too often, though, or it could wear away your enamel."
    },
    {
      "title": "Wear lipstick that makes your teeth look pearly.",
      "content": "Wear lipstick that makes your teeth look pearly. Certain lipstick shades downplay the yellow in your teeth and make them look brighter and whiter. You can give your smile a boost by applying one of these shades before you get your picture taken: Rich berry reds. These contrast highly with your teeth to make them stand out. Shades with blue undertones. They downplay the yellow in your teeth. Steer clear of orange and yellow-toned lipstick. These bring out the yellow and make your smile look duller. [5] X Research source Whitening strips are another good option. [6] X Expert Source Traci Halvorson Modeling Agent Expert Interview. 17 June 2021."
    },
    {
      "title": "Make sure your lips are moisturized.",
      "content": "Make sure your lips are moisturized. Smiling with flaky or chapped lips can make you feel self-conscious and result in an unflattering picture. Exfoliate your lips with a facial scrub and apply lip balm or gloss to keep them in good shape. When it's time to smile, you won't worry about how your lips might look."
    },
    {
      "title": "Use other makeup to bring out your smile's contours.",
      "content": "Use other makeup to bring out your smile's contours. Applying foundation, blush, and bronzer can provide contrast to your smile and make it stand out even more. Choose shades that work well with your skin tone. Your teeth will look whiter if you err on the side of using darker makeup that helps you look like you have a tan."
    },
    {
      "title": "Be confident with what you've got.",
      "content": "Be confident with what you've got. Smiling isn't about looking perfect - it's about looking happy and confident. Your smile will look more beautiful if you face exudes confidence and relaxation. Worrying too much about your appearance will come through in your face, and you'll end up looking tense or disturbed in your photos. Just remember to be relaxed and think happy thoughts, and you'll be rewarded with a photo that captures you at your best."
    },
    {
      "title": "Practice in the mirror.",
      "content": "Practice in the mirror. If you have an event during which pictures will be taken coming up, and you're nervous your pictures will come out looking stiff, take some time to practice your smile beforehand. [7] X Expert Source Traci Halvorson Modeling Agent Expert Interview. 17 June 2021. Look in the mirror and find your best angle and the right amount of teeth to show. Don't forget to smile with your eyes, too. When you find a smile you love, notice how it feels on your face, so you can replicate it at will."
    },
    {
      "title": "Feel out an authentic smile.",
      "content": "Feel out an authentic smile. If you're worried that the expression on your face in pictures tends to look fake, pay attention to how it feels next time your face cracks into a genuine smile - like when someone is making you laugh, or your favorite comedy is cracking you up. [8] X Expert Source Adam Kealing Professional Photographer Expert Interview. 7 April 2020. Ask yourself the following questions that will help you \"memorize\" the way your authentic smile feels: What feelings are flooding your brain when you flash a real smile? See if you can recreate those when you're in front of the camera. What position is your face naturally taking? If possible, glance in the mirror before your smile fades and make a mental note of what your genuine smile looks like. When it's time to get your picture taken, try to recreate the facial positioning that come together to create your most winning smile."
    },
    {
      "title": "Blink before smiling.",
      "content": "Blink before smiling. If your eyes tend to be half-closed in pictures, try a little trick to help you look wide-eyed and alert. Just before the photographer takes your picture, let yourself blink for a full second or two before opening your eyes and smiling. You'll be less likely to give in to the urge to blink when the flash goes off."
    },
    {
      "title": "Wet your teeth before you smile.",
      "content": "Wet your teeth before you smile. If your teeth are a little dull, there's quick fix to try that requires no preparation: just before you smile, run your tongue over your teeth to wet them. Teeth that are a little shiny will look brighter than dry teeth. The gloss will keep your smile from looking dull. Some makeup artists actually advise rubbing a little petroleum jelly over the front of the teeth to keep them looking smooth and shiny throughout the photo session."
    },
    {
      "title": "Don't think too much about how you look.",
      "content": "Don't think too much about how you look. If you're worried about the way you look, chances are that negative emotion is going to show up in your smile. You'll end up looking tense and strained instead of natural and happy. Next time you're posing for the camera, ignore the photographer's encouragement to say cheese, and go to your own \"happy place.\" Instead of thinking about how awkward your face must look, think about something that you can't help but smile about. [9] X Expert Source Adam Kealing Professional Photographer Expert Interview. 7 April 2020. Your positive feelings will shine through, brightening your smile."
    }
  ]
}