{
  "url": "https://www.wikihow.com/Remove-HTML-Tags-in-Excel",
  "title": "How to Remove HTML Tags in Excel",
  "steps": [
    {
      "title": "Open your project in Excel.",
      "content": "Open your project in Excel. You can either open the program within Excel by clicking File > Open , or you can right-click the file in your file explorer. This will work for Excel for Office 365, Excel for Office 365 for Mac, Excel for the web, Excel 2019, Excel 2016, Excel 2019 for Mac, Excel 2013, Excel 2010, Excel 2007, Excel 2016 for Mac, and Excel Starter 2010."
    },
    {
      "title": "Press Ctrl+H.",
      "content": "Press Ctrl + H . This keyboard shortcut will open the Find and Replace tool on both Mac and Windows, but it's also located in the Home tab, in the Editing group. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Type one of the HTML tags you want to delete into the \"Find what\" field.",
      "content": "Type one of the HTML tags you want to delete into the \"Find what\" field. Remember to include the brackets <> that surround your HTML code. For example, if you want to delete all of the <b> tags, you'd enter <b> . If you don't want to search for each HTML tag individually, you can use a wildcard (an asterisk) to automatically delete everything surrounded by < > brackets. You should only do this if you don't have any other types of tags surrounded by these brackets that you want to keep. To do this, enter <*> into the \"Find What\" field."
    },
    {
      "title": "Leave the \"Replace with\" field blank.",
      "content": "Leave the \"Replace with\" field blank. This tells the program to look for those HTML tags you've entered and replace them with blank space."
    },
    {
      "title": "Click Replace All.",
      "content": "Click Replace All . All HTML tags that match your search will be deleted. [2] X Research source If you entered <*> into the \"Find What\" field, every HTML tag will be deleted and you won't have to repeat this for other codes. If you entered a specific tag instead of the asterisk variation, you can delete additional tags the same way. Enter the next tag you want to strip from the file, and then click \"Replace All\" to delete it throughout the document. [3] X Research source"
    }
  ]
}