{
  "url": "https://www.wikihow.com/Play-Piano-Tiles-2",
  "title": "How to Play Piano Tiles 2",
  "steps": [
    {
      "title": "Download the game.",
      "content": "Download the game. Open the Apple App Store on your iOS devices (iPhone and iPad) or the Google Play Store on your Android devices. Just search Piano Tiles 2 on the Amazon App Store. For Apple Arcade, in the App Store, just select Arcade. Search \"Piano Tiles 2\" on the search bar. For Apple Arcade, it’s Piano Tiles 2+. (Note: There is a difference between the logos of the normal version and the Arcade version). Tap Piano Tiles 2 in the search results. Tap “GET” (for iOS) and install (for Google Play) next to the Piano Tiles 2 graphic. Click “Get App” for Amazon."
    },
    {
      "title": "Open the app.",
      "content": "Open the app. Once you’re finished downloading, open the app and you will immediately see the Home page of the game. You can start playing the first level: Twinkle Twinkle Little Star. In the lower corner of the screen, you can see the different sections in the game such as Music, Events, Store and Settings. Click Play to start playing the song. Click on “Start” and start tapping."
    },
    {
      "title": "Tap the black tiles.",
      "content": "Tap the black tiles. This is the overall game mechanic, you have to tap the black tiles to match the rhythm of the song. The speed of the tiles increases over time as you move along the way. This can really test your hand coordination. There are several types of tiles during gameplay. Single Tiles are tapped once they reach the bottom. Double Tiles appear side by side and are tapped at the same time. Long Tiles are tiles that are tapped and held until they end. Slider Tiles are tiles that are tapped and slid in a certain direction, usually left or right (in some gameplays). Lastly, Combo Tiles are tiles that need to be tapped correctly in a row without missing. Keep your finger pressed to the longer tiles for more points."
    },
    {
      "title": "Do not miss a tile.",
      "content": "Do not miss a tile. You have to tap all the incoming tiles because once you miss a single tile, you’re out."
    },
    {
      "title": "Use multiple fingers.",
      "content": "Use multiple fingers. You can use multiple fingers to tap the black tiles. This can be a good strategy to not get eliminated easily. Tip: Use your thumbs or index fingers when playing so it’s easier to tap the tiles."
    },
    {
      "title": "Collect coins and diamonds.",
      "content": "Collect coins and diamonds. After every game, you can earn diamonds that can be used to unlock more levels. Just continue playing all current unlocked levels and save up coins and diamonds to unlock other levels and challenges. You can also collect album fragments to unlock more songs."
    },
    {
      "title": "To select from all the diverse in-game music that Piano Tiles 2 offers, explore the Music section.",
      "content": "To select from all the diverse in-game music that Piano Tiles 2 offers, explore the Music section. Here you can see the Level, Selection, Favorites and Featured sections respectively. To see all the amazing music that can be played in the game go to the Level section and to unlock certain levels, players can collect coins by playing available songs. There are 408 songs currently available. To access song selections exclusive for players with VIP subscriptions head to the Selection selection. To put all your favorite songs, navigate to the Favorites section. To do this just tap the heart icon beside the Play button. To access all the latest hits and Melody's vault, go to the Featured section."
    },
    {
      "title": "To join exciting Live Events, see the Song of the Day and records achieved all over the world go to the Events section.",
      "content": "To join exciting Live Events, see the Song of the Day and records achieved all over the world go to the Events section. To view the Song of the Day and see Live Events, go to the Events section. To show game records made by players across the world go to the Speed, Gameplay and Classic sections. Note that players can participate in the challenge but must have enough energy and achieve a certain level."
    },
    {
      "title": "To Buy all the albums on Piano Tiles 2, exciting items and diamonds go to the Store section.",
      "content": "To Buy all the albums on Piano Tiles 2, exciting items and diamonds go to the Store section. To see different album collections that can be unlocked through diamond go to the Albums section. To purchase the game's premium version, diamonds and more go to the Items and Diamonds section."
    },
    {
      "title": "To customize general settings like sound, notifications, language and more go to Settings.",
      "content": "To customize general settings like sound, notifications, language and more go to Settings. To view your profile, just click on Profile."
    }
  ]
}