{
  "url": "https://www.wikihow.com/Put-Up-a-Christmas-Tree",
  "title": "How to Put Up a Christmas Tree",
  "steps": [
    {
      "title": "Pick a spot for your tree that’s away from heat sources.",
      "content": "Pick a spot for your tree that’s away from heat sources. While Christmas trees are a magical part of the holiday season, they’re also a fire hazard, unfortunately. You can reduce your risk of a fire by keeping your tree far away from things like fireplaces, heaters, stoves, and candles. Make sure your tree won’t be near anything that gets hot. [1] X Research source For instance, you might place it in the corner of your living room or in the center of an open-concept space for maximum enjoyment. If you have a staircase, try placing the tree near the stairs so you can admire it while you come down. Although your tree needs to be close enough to an electrical outlet for you to plug in the lights, don’t put it right up against the outlet. If you do, it’s possible a spark could ignite your tree. If necessary, clear a spot for your Christmas tree by removing furniture and other items."
    },
    {
      "title": "Measure the height of your ceiling before choosing a tree.",
      "content": "Measure the height of your ceiling before choosing a tree. Finding out your perfect Christmas tree doesn’t fit in your home can be a big bummer. Fortunately, this is an easily preventable problem. Use a tape measure to find the height of the room where you plan to put your tree. Write the measurement down or type it into your phone so you’ll have it while you’re tree shopping. [2] X Research source Ideally, the perfect Christmas tree should be at least 6 in (15 cm) shorter than your ceiling. [3] X Research source If the tree is too tall, you won't be able to use a tree topper."
    },
    {
      "title": "Weigh the pros and cons of a real or artificial tree.",
      "content": "Weigh the pros and cons of a real or artificial tree. The type of tree you choose is a personal decision, and there are pros and cons on both sides. You might prefer a real tree if you enjoy the pine scent, want the experience of going to a tree lot, or want to stick to all-natural materials. On the other hand, you might pick an artificial tree if you like the easy clean-up and plan to re-use your tree year-after-year. Get the type of tree that best fits your needs. [4] X Research source Shopping for a real tree can be a fun experience for your family, especially if you have small kids. If you choose a real tree, consider fir varieties like Fraser firs, Douglas firs, or noble firs, which are popular for their longevity and needle retention."
    },
    {
      "title": "Look for a tree with a shape that appeals to you.",
      "content": "Look for a tree with a shape that appeals to you. Christmas trees come in all shapes and sizes, so you can easily find one that fits your tastes. Some people prefer short, fat trees, while others like long, skinny trees. You might also just want a tree that looks like a perfect cone shape. Choose a tree that best fits your space, the width and height of the spot where you'll display it, and your personal aesthetic. [5] X Research source You might like a smaller tree if you have little kids, since it will seem big to them. On the other hand, you might prefer a large tree if you have high ceilings, since a small tree might look even tinier by comparison. Consider how many ornaments you have or plan to buy. A larger tree will require more decorations to look finished."
    },
    {
      "title": "Touch and smell the needles to make sure the tree is fresh if you're buying a natural one.",
      "content": "Touch and smell the needles to make sure the tree is fresh if you're buying a natural one. Since the tree is cut, it’ll slowly die and dry out. To help your tree last longer, you’ll want a freshly cut one. Check the freshness of the tree by pressing your fingers down on the edge of a branch and dragging them toward you. A fresh tree will shed minimal needles. Then, squeeze the end of a branch and sniff it to make sure it smells like pine. [6] X Research source If the needles are already falling off easily, it’s best to choose another tree."
    },
    {
      "title": "Check the height of the tree before you buy it to make sure it will fit.",
      "content": "Check the height of the tree before you buy it to make sure it will fit. You might be surprised to learn this, but people often underestimate the height of a Christmas tree when it’s outdoors. It’s super easy to accidentally buy a tree that’s too tall even if you know exactly what you’re looking for. Look at the label to check the height if you're buying an artificial tree. If you want a real tree, ask the lot employee to direct you to the trees that are the type you want and fit your height requirements. [7] X Research source If you like, you can also measure the tree with a tape measure to double check. If you don't have a tape measure, ask the employee at the tree lot to measure the tree or estimate the height. Since they’re used to working with trees, they should be able to give you a fairly accurate estimate. Don't forget to account for the height of your stand, as well."
    },
    {
      "title": "Give your tree a shake before taking it inside to shed dry needles.",
      "content": "Give your tree a shake before taking it inside to shed dry needles. A real tree can have a few loose needles on it, even if it’s fresh. Remove any dead needles by shaking it outside. Gently move the tree back and forth or lift it up and down. [8] X Research source Ask for help with this if you can so it’ll be easier to handle the tree."
    },
    {
      "title": "Saw off the bottom of the tree stump to remove dried sap.",
      "content": "Saw off the bottom of the tree stump to remove dried sap. After a pine tree is cut, it naturally forms a layer of sap over the end of the stump. Unfortunately, the sap will prevent the trunk from absorbing water, so your tree will die faster. To extend the life of your tree, use a saw to make a fresh cut on the bottom of the trunk. [9] X Research source If you don’t have a saw or don’t feel comfortable doing this, the tree lot will offer to cut the bottom of the tree trunk for free or a small fee. You might also look for a tree lot that sells trees in water, as the water will prevent the sap from forming."
    },
    {
      "title": "Insert the stump into your tree stand with the help of a partner.",
      "content": "Insert the stump into your tree stand with the help of a partner. Place your tree stand flat on the floor and loosen all of the screws on the sides so it's wide enough for you to insert the tree trunk. Then, lift the tree up and position the stump over the center of the stand. Slide the tree down into the stand. [10] X Research source As you do this, don’t let go of the tree because it will fall over."
    },
    {
      "title": "Tighten the screws on the tree stand around the tree stump.",
      "content": "Tighten the screws on the tree stand around the tree stump. Make sure the tree is standing straight up before you tighten the screws around the trunk. Every tree stand is different, but they usually have 3 screws on the sides that you’ll tighten over the trunk to hold the tree in place. Twist the screws clockwise to tighten them over the tree trunk. If you use a Christmas tree watering system attach it to your stand once the tree is securely in the stand. [11] X Research source Gently shake the tree to make sure it feels stable."
    },
    {
      "title": "Pour water into the tree stand to keep the stump moist.",
      "content": "Pour water into the tree stand to keep the stump moist. Use a cup, bowl, or pitcher to add water to the tree stand. Fill the tree stand completely up so the tree can drink. If you use a Christmas tree watering system add water the to system. NO crawling under your tree. NO spilling water on your floor. [12] X Research source"
    },
    {
      "title": "Refill the tree stand with water daily so your tree doesn’t dry out.",
      "content": "Refill the tree stand with water daily so your tree doesn’t dry out. Make sure the bottom of the stump is always covered in water. Otherwise, sap will form over the end of the stump. Additionally, the tree may become a fire hazard since it can dry out. Add water daily so the tree stand stays full. [13] X Research source For instance, you might refill the water every morning or every evening before bed. Try to establish a habit."
    },
    {
      "title": "Take the tree parts and instructions out of the box.",
      "content": "Take the tree parts and instructions out of the box. Use scissors or a box cutter to cut the tape that secures the top of the box. Be careful that you only cut the tape and not the tree inside the box. Carefully pull each piece out of the box and set them on the floor. Most average-sized trees will come with a stand and 3 sections that form the body of the tree. [14] X Research source The sections of the tree may be labeled. For instance, they may have “A,” “B,” and “C” on them. It’s best to read and follow the specific instructions that came with your tree. Every tree is a little bit different. Save your box so that you can use it for storage after the holiday is over."
    },
    {
      "title": "Set up the Christmas tree stand according to the instructions.",
      "content": "Set up the Christmas tree stand according to the instructions. Some stands come already in one piece, while others require a little assembly. If yours is in 1 piece, spread the legs out to form a sturdy tree stand. If the Christmas tree stand comes in multiple pieces, follow the instructions that came with your tree to attach the pieces. Typically, you’ll slide the feet of the stand onto the base. [15] X Research source Check that the stand feels sturdy and secure before you continue. Place the stand on the floor and gently shift it around. If it wobbles, review the instructions and try again."
    },
    {
      "title": "Insert the base of the tree into the stand.",
      "content": "Insert the base of the tree into the stand. Pull the cap off the bottom of the pole on the base of the tree, if there is one. Then, position the pole on the bottom of the base over the hole in the stand. Gently push down to insert the base into the stand. If the stand has a screw on the side, tighten it now to secure the base of the tree inside the stand. [16] X Research source Check that the base feels stable before continuing. You might save the cap to put back on the pole when you’re ready to pack up your tree."
    },
    {
      "title": "Slide the middle section of your tree into the base.",
      "content": "Slide the middle section of your tree into the base. Push the top branches on the base of the tree aside if necessary to reveal the hole in the top of the base. Remove the cap off of the bottom of the pole on the middle section, then position the pole over the hole in the base. Push down on the middle section to insert it into the base. [17] X Research source If you’re using a pre-lit tree, plug the lights for the middle section into the lights for the base."
    },
    {
      "title": "Complete the tree by inserting the top section.",
      "content": "Complete the tree by inserting the top section. Pull apart the top branches on the middle section to find the hole where you’ll insert the top of the tree. Remove the cap covering the pole at the bottom of the treetop. Then, position the treetop over the hole at the top of the middle section and slide the pole down into the hole. [18] X Research source Don’t forget to plug up your lights if you’re using a pre-lit tree."
    },
    {
      "title": "Spread out the tree's branches to fill in sparse areas.",
      "content": "Spread out the tree's branches to fill in sparse areas. Most artificial Christmas trees are stored bunched up, so your tree will likely look sparse when you first unpack it. Use your hands to gently pull the branches apart and push them into shape. Step back to check your work, then adjust more branches as needed. [19] X Research source You may need to make several adjustments before you’re happy with how the tree looks. This is totally normal. If the branches are wired, bend them into your desired position, as they should hold the shape."
    }
  ]
}