{
  "url": "https://www.wikihow.com/Send-a-Snapchat-Without-a-Photo",
  "title": "How to Send a Snapchat Without a Photo",
  "steps": [
    {
      "title": "Tap the Snapchat app to open Snapchat.",
      "content": "Tap the Snapchat app to open Snapchat. Snapchat should open directly to the camera interface."
    },
    {
      "title": "Swipe right.",
      "content": "Swipe right. This will bring up the Chat page; you'll find all of your recent conversations here in chronological order."
    },
    {
      "title": "Swipe right on a contact's name.",
      "content": "Swipe right on a contact's name. This will open a chat window with that specific contact. There is no way to group chat on Snapchat."
    },
    {
      "title": "Type a message in the \"Send a chat\" field.",
      "content": "Type a message in the \"Send a chat\" field. From here, you can also attach a picture, call or video call your recipient, or attach a Bitmoji if you have the service installed on your phone. Your recipient will receive a notification that says \"[Your name] is typing...\" when you begin typing, and another notification when you send your chat."
    },
    {
      "title": "Tap \"Send\" when you're done.",
      "content": "Tap \"Send\" when you're done. This will send your chat. Your chat will show up on the \"Chat\" page as a blue arrow; when your recipient opens it, the blue arrow will become hollow. Unless you or your recipient tap and hold the chat text to save it, Snapchat chats disappear entirely once both parties have read the chat. [1] X Research source"
    },
    {
      "title": "Tap the Snapchat app to open Snapchat.",
      "content": "Tap the Snapchat app to open Snapchat. Snapchat should open directly to the camera interface."
    },
    {
      "title": "Swipe left.",
      "content": "Swipe left. This will take you to the Stories page, where all of your contacts' stories are arranged in order from newest to oldest."
    },
    {
      "title": "Tap a story to open it.",
      "content": "Tap a story to open it. You should see a \"Chat\" option toward the bottom of the screen."
    },
    {
      "title": "Tap the \"Chat\" arrow at the bottom of the screen.",
      "content": "Tap the \"Chat\" arrow at the bottom of the screen. Tapping the \"Chat\" button will freeze the story in place, so don't worry about running out of time."
    },
    {
      "title": "Type a message in the \"Send a chat\" field.",
      "content": "Type a message in the \"Send a chat\" field. This will overlay the story image with your text."
    },
    {
      "title": "Tap \"Send\" when you're done.",
      "content": "Tap \"Send\" when you're done. This chat will show up on the \"Chat\" page as a blue arrow; when your recipient opens it, the blue arrow will become hollow."
    }
  ]
}