{
  "url": "https://www.wikihow.com/Shave-Your-Head",
  "title": "Best Ways to Shave Your Head without Irritation",
  "steps": [
    {
      "title": "Pick a guard based on how close you want your shave.",
      "content": "Pick a guard based on how close you want your shave. The guard is what will determine how short your hair is. If you want the closest shave possible, take the guard all the way off. To keep some length, use a #1 guard. [1] X Research source If you have long hair, start with a #2 guard, then switch to a #1 guard. That way, the clippers are less likely to get clogged. Lay down newspapers before you shave your head to collect the excess hair."
    },
    {
      "title": "Clip your hair in the opposite direction of your hair growth.",
      "content": "Clip your hair in the opposite direction of your hair growth. With a razor, you'd shave your hair in the direction of the grain. However, this isn't necessary with clipping because you won't get as close of a shave as with a razor. Start with the clippers pointing upwards in the opposite direction that your hair grows. [2] X Research source Clip your hair when it’s completely dry, not damp. That way, the clippers are much less likely to clog."
    },
    {
      "title": "Start at the sides of your head where your sideburns begin.",
      "content": "Start at the sides of your head where your sideburns begin. This is usually level with the middle of your ear. Place your clippers against your skin and move them upwards toward the crown of your head. Make several passes until you reach the area behind your ear. [3] X Research source If you feel more comfortable starting on a different section of your head, that’s okay. Do what’s easiest for you."
    },
    {
      "title": "Move from front to back when shaving the top of your head.",
      "content": "Move from front to back when shaving the top of your head. Position the clippers at the top of your forehead. Then, slowly glide them back toward the crown of your head. Stop shaving when you reach the back of your crown. [4] X Research source"
    },
    {
      "title": "Shave from bottom to top when finishing up the back.",
      "content": "Shave from bottom to top when finishing up the back. Place your clippers at the nape of your neck. Next, slowly bring the razor up toward your crown. Continue working your way across the back of your hair until you’ve shaved your entire head. [5] X Research source Shaving the back of your head is the most difficult part of the process. Try setting up 1 mirror in front of you and 1 mirror behind you so you can see. If you have a friend around, ask them to help you shave the back for the best results. Or, use a handheld mirror to check your progress."
    },
    {
      "title": "Buzz your hair with a pair of clippers first for best results.",
      "content": "Buzz your hair with a pair of clippers first for best results. Remove the guard or use the 1 guard so your hair is cut very close to your scalp. This will reduce the resistance on your blade and help you get the closest shave possible. [6] X Research source You can skip this step if your hair is already less than about .25 inches (0.64 cm) long. Put down some newspapers to collect the hair as you trim it, especially if your hair is very long."
    },
    {
      "title": "Take a warm shower before you shave so your hair will be softer.",
      "content": "Take a warm shower before you shave so your hair will be softer. Warm or hot water opens your pores and softens your hair. This allows the razor to more easily slide over your head, so you end up with less irritation after your shave. [7] X Research source As an alternative, run warm water over your head for a few minutes before you shave."
    },
    {
      "title": "Use a new blade every time you shave your head to minimize irritation.",
      "content": "Use a new blade every time you shave your head to minimize irritation. A dull blade will cause more friction, which may leave your scalp red and itchy. Additionally, it can lead to clogged pores or ingrown hairs. [8] X Research source It’s best to choose a razor with 3-5 blades, which will provide a better shave in a single pass. You can purchase a razor made specifically for shaving your head, or you can use a razor made for shaving body hair. As long as it has multiple blades, it will work just the same."
    },
    {
      "title": "Apply shaving cream to your head so the blade slides over it easily.",
      "content": "Apply shaving cream to your head so the blade slides over it easily. Work the cream into a lather, then slather it onto your head. Shaving cream helps you avoid a razor burn. Plus, it makes it easier to see where you’ve already shaved. [9] X Research source If you have very sensitive skin, you can also apply a shaving oil to your scalp before you apply the shaving cream. The oil provides an extra barrier to protect your scalp, and it allows the razor to more easily slide over your skin."
    },
    {
      "title": "Slide your razor in the direction of the grain of your hair.",
      "content": "Slide your razor in the direction of the grain of your hair. Make firm, steady strokes from front to back. Do your best to make just one pass over each section of your scalp, as multiple passes will cause skin irritation. [10] X Research source Going with the grain will reduce irritation and lower your risk of ingrown hairs."
    },
    {
      "title": "Rinse your blade in hot water every 2 to 3 strokes.",
      "content": "Rinse your blade in hot water every 2 to 3 strokes. This keeps your blade clean and free of hair buildup. A clean blade will cause less irritation and is less likely to clog your pores. [11] X Research source While it’s best to rinse your blade in running water, it’s also okay to rinse it in a clean cup of hot water."
    },
    {
      "title": "Pull your skin taut to minimize wrinkles and grooves.",
      "content": "Pull your skin taut to minimize wrinkles and grooves. Use your free hand to lightly pull down on your skin near where you're shaving. This will make your skin temporarily smooth. Since a razor provides a closer shave, it’s best if your scalp is as smooth as possible. Otherwise, you’re more likely to nick or cut your skin. [12] X Research source This is especially helpful near the back of your head where your neck tends to create folds and divots."
    },
    {
      "title": "Shave the top of your head from back to front.",
      "content": "Shave the top of your head from back to front. The hair on the top of your head is usually thinner, so it's easier to shave. Place your razor at the back of your crown, then pull it forward toward your forehead. Continue making even strokes until the top of your head is clean-shaven. [13] X Research source In addition to your hair being thinner on top, you also can see the top of your head more easily than you can see the back. It's best to work from the easiest section to the hardest section because you'll develop a rhythm as you shave. Use a handheld mirror to check your work, as necessary."
    },
    {
      "title": "Do the sides of your head next.",
      "content": "Do the sides of your head next. Place your blade just above the side patch of hair. Then, pull your razor down in an even stroke, stopping once you reach the top of your sideburns. Once you finish the first side, switch to the other side and repeat. [14] X Research source The hair on the sides of your head is thicker than the hair on the top, but it's also still visible when you look in the mirror. Check your work in your handheld mirror for a more close-up view."
    },
    {
      "title": "Shave the back of your head last.",
      "content": "Shave the back of your head last. Position your blade at the back of your crown, then pull it down toward the nape of your neck. Make slow, even passes with your blade until your head is completely shaved. [15] X Research source Take your time, as you likely won't be able to see what you're doing. If you have a friend or loved one nearby, ask them to check your work. Use your small handheld mirror to check your progress. It's helpful to take a look after each pass with your razor, but this isn't necessary."
    },
    {
      "title": "Rinse your scalp with water.",
      "content": "Rinse your scalp with water. You can step into the shower or just rinse off in the sink. Use lukewarm water to soothe your scalp and get rid of any leftover shaving cream. [16] X Research source You don’t need to shampoo your head, but you can use a mild shampoo or soap if you would like. As you rinse, feel your head with your hands to see if you missed any spots. If you did, reapply the shaving cream and shave off any areas that still have hair on them."
    },
    {
      "title": "Apply aftershave to your freshly shaved scalp to reduce irritation.",
      "content": "Apply aftershave to your freshly shaved scalp to reduce irritation. Opt for an aftershave lotion or balm if one is available. These formulas are better for the sensitive skin on your scalp than splashes. However, an aftershave splash is better than going without it. [17] X Research source If you’re going to be shaving your head often, it’s a good idea to invest in an aftershave that’s formulated for your scalp. You can find these products near the shaving supplies at your local department store or online."
    },
    {
      "title": "Use topical hydrocortisone to treat razor burn or cuts.",
      "content": "Use topical hydrocortisone to treat razor burn or cuts. If you slipped up and accidentally nicked your head, that’s okay. Apply a topical ointment to treat and soothe the irritated areas, and give your head a break from shaving for about 1 week. After that, your scalp will feel much better. [18] X Research source If you have sensitive skin, you may experience some slight redness or itchiness after you shave. Adding moisture with aftershave will help soothe your skin and prevent further irritation."
    },
    {
      "title": "Wash your head daily with a gentle shampoo.",
      "content": "Wash your head daily with a gentle shampoo . Put a pea-size amount of cleanser in your hands and work it into a lather. Then, rub the lather into your scalp to clean away the sweat and grime that naturally build up over the course of the day. Rinse with warm water. [19] X Research source Dandruff shampoo can help with dry scalp, if that’s a problem for you. Avoid using harsh cleansers on your scalp, as it’s more sensitive than the rest of your skin. Limit your showers to once a day so you don’t dry out your scalp."
    },
    {
      "title": "Apply a moisturizer to your head at least twice a day.",
      "content": "Apply a moisturizer to your head at least twice a day. You can use face or body moisturizer, but it’s best to use one formulated to protect your scalp. Slather it on in the morning and evening, especially if you’ve just taken a shower. [20] X Research source Moisturizer helps prevent dry patches and wrinkles. Additionally, it helps your scalp look freshly shaved for a longer period of time. If you’re worried about shine, look for a matte moisturizer ."
    },
    {
      "title": "Protect your head from the sun using sunscreen or a hat.",
      "content": "Protect your head from the sun using sunscreen or a hat. Choose an SPF 30 broad-spectrum sunscreen, and apply it at least 15 minutes before you leave home. When you’re outside, reapply your sunscreen every 2 to 4 hours. As an alternative, you can wear a hat for sun protection. [21] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Your shaved head will be very vulnerable to sunburn, which can cause skin damage, pain, and skin cancer."
    },
    {
      "title": "Shave when re-growth becomes noticeable.",
      "content": "Shave when re-growth becomes noticeable. It’s easier to shave hair when it’s less than .25 inches (0.64 cm) long, so try not to let it grow longer than this. However, you don’t want to shave your head too often, as this can cause irritation. [22] X Research source Try to shave your head no more than once a week. If weekly shaves still cause irritation, try going a little longer between shaves. As an alternative, you could add a shaving oil to your routine or apply moisturizer more often."
    }
  ]
}