{
  "url": "https://www.wikihow.com/Pack-Ties",
  "title": "How to Pack Ties",
  "steps": [
    {
      "title": "Fold your tie in half, lengthwise.",
      "content": "Fold your tie in half, lengthwise. Fold the tie so that it’s inside out and the front of the tie is facing inward. Folding the tie like this will protect the front of the tie from getting dirty or wrinkled while it’s in your suitcase or bag. [1] X Research source"
    },
    {
      "title": "Lay the tie on a flat surface.",
      "content": "Lay the tie on a flat surface. Lay the tie down so that the thinner end of the tie is on top. The inside portion of the front of the tie should be facing up. [2] X Research source You can use a flat surface like an ironing board or table. Clean off the flat surface before you fold your clothes on it."
    },
    {
      "title": "Roll the tie up, starting from the smallest end.",
      "content": "Roll the tie up, starting from the smallest end. You can put a pair of socks on top of your tie to help you roll it but it isn’t necessary. Start rolling the smaller end of the tie and continue down the length of the tie until it’s completely rolled up. When you're done it should look like a cylinder. [3] X Research source"
    },
    {
      "title": "Put your tie in a ziplock bag or small tie box.",
      "content": "Put your tie in a ziplock bag or small tie box. Putting your tie in a ziplock bag or tie box will help it stay rolled up and will protect it from getting dirty. [4] X Research source Tie boxes are small cardboard boxes designed to store rolled up ties that you can purchase online or at a suit store. [5] X Research source If you are rolling up more than a single tie, get a ziplock bag that is large enough to accommodate all of them. If you don’t have a tie box or a ziplock bag, you can usually fit a rolled up tie into the foot-hole of your shoe."
    },
    {
      "title": "Tuck the tie box or ziplock bag into your suitcase.",
      "content": "Tuck the tie box or ziplock bag into your suitcase. Tuck the ties into a corner so that they don’t move around or unravel. You can fit the ties in any snug fitting spot in your luggage or in zipped internal pockets if you have them."
    },
    {
      "title": "Slide the small end of the tie through the loop.",
      "content": "Slide the small end of the tie through the loop. Most ties will come with a loop on the backside of the front of the tie. Fold the tie over and run the small end through the loop so that the front of the tie is facing outward. [6] X Research source"
    },
    {
      "title": "Line up the top and bottom tips of the tie.",
      "content": "Line up the top and bottom tips of the tie. Pull on both ends of the tie so that it's taut. The tie should be folded in half, lengthwise. The front of the tie should still be facing outward. [7] X Research source"
    },
    {
      "title": "Fold the tie again and run the smaller end through the loop.",
      "content": "Fold the tie again and run the smaller end through the loop. Pull the smaller end through the loop again, and make sure that both ends of the tie line up. The tie should now be folded over twice. [8] X Research source"
    },
    {
      "title": "Lay the tie flat in between 2 pieces of clothing.",
      "content": "Lay the tie flat in between 2 pieces of clothing. Position the tie on your pants, jacket, or shirt and put another piece of folded clothing on top of it. This will keep it flat and prevent it from becoming wrinkled. [9] X Research source You can also put your folded ties in a tie box or ziplock bag."
    },
    {
      "title": "Purchase a tie case instead of storing your ties with your clothes.",
      "content": "Purchase a tie case instead of storing your ties with your clothes. Tie cases are made specifically to store ties as you travel. Place your folded tie under the elastic straps inside of the case to hold them in place. A tie case is a more expensive option, but may be worth it if you're packing expensive ties."
    },
    {
      "title": "Pack a tie with a suit if you’re using a suit bag.",
      "content": "Pack a tie with a suit if you’re using a suit bag. If you are using a suitcase or a book bag, use one of the other two methods. This method is best used with a suit bag because, if you have to fold the suit to fit it in a suitcase, it may also leave fold lines in your ties."
    },
    {
      "title": "Put your suit on a felt coat hanger.",
      "content": "Put your suit on a felt coat hanger. Get a traditional hanger that looks like a triangle. The felt material will prevent the tie from slipping off. [10] X Research source Put the left and right corners of the coat hanger into the arms of your suit, then use the hook to hold it up. Other materials like wood and plastic may be too slippery to hold the tie in place."
    },
    {
      "title": "Fold the tie over the bottom portion of the hanger.",
      "content": "Fold the tie over the bottom portion of the hanger. Thread the smaller end of the tie through the bottom part of the hanger so that the tie is folded over it. Line up both ends of the tie. [11] X Research source"
    },
    {
      "title": "Thread the small end of the tie through the loop to secure it.",
      "content": "Thread the small end of the tie through the loop to secure it. Push the skinny end of the tie through the loop attached to the back of the tie itself. This will keep the tie from slipping off the hanger or coming undone."
    },
    {
      "title": "Pack your suit in a suit bag.",
      "content": "Pack your suit in a suit bag. Place the suit inside of the suit bag and position the hook on the hanger so that it sticks through the hole in the suit bag. Then, zip up the suit bag and use the hanger to carry your suit. Your tie should now be packed with your suit."
    }
  ]
}