{
  "url": "https://www.wikihow.com/Rearrange-Photos-in-an-iPad-Photo-Album",
  "title": "3 Quick Ways to Rearrange Photos in an iPad Photo Album",
  "steps": [
    {
      "title": "Open the Photos app.",
      "content": "Open the Photos app. This looks like a multicolored flower icon. [1] X Research source This method will work on iPad and iPhone devices."
    },
    {
      "title": "Tap the album you want to rearrange.",
      "content": "Tap the album you want to rearrange. You'll find your albums underneath the Albums header. You can't rearrange the default Recents album. It must be an album you created . However, you can use filters to sort any album."
    },
    {
      "title": "Tap and hold the picture you want to move.",
      "content": "Tap and hold the picture you want to move. It will become slightly larger when it is active."
    },
    {
      "title": "Drag the picture to its new location and release it.",
      "content": "Drag the picture to its new location and release it. As you drag the picture around, you'll notice that the other pictures shift as you move over them. Drag the picture until it's in the location you want it in. If it snaps back to its original location, it means you chose an invalid spot. Repeat for each image you want to rearrange."
    },
    {
      "title": "Open the Photos app.",
      "content": "Open the Photos app. This looks like a multicolored flower"
    },
    {
      "title": "Tap the album you want to filter.",
      "content": "Tap the album you want to filter. If needed, you can create a new one."
    },
    {
      "title": "Tap ••• .",
      "content": "Tap ••• . This is in the top-right corner."
    },
    {
      "title": "Tap Filter.",
      "content": "Tap Filter . This is in the pop-up menu."
    },
    {
      "title": "Select an option.",
      "content": "Select an option. You can filter the album by: Favorites , Edited , Photos , or Videos . The filter will be applied immediately. To remove the filter, tap the filter icon in the top-right corner and select All Items ."
    },
    {
      "title": "Open the Photos app.",
      "content": "Open the Photos app. This looks like a multicolored flower icon."
    },
    {
      "title": "Tap +.",
      "content": "Tap + . This is in the top-left corner of the Photos home page. If you're in an album, tap the back arrow."
    },
    {
      "title": "Tap New Album.",
      "content": "Tap New Album . This is the first option."
    },
    {
      "title": "Name the album and tap Save.",
      "content": "Name the album and tap Save . A new window will open with your photos."
    },
    {
      "title": "Tap the photos you want to add.",
      "content": "Tap the photos you want to add. You can select more than one photo."
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . The photos will be added to the album. If you're using a newer device or iOS version, you'll see Add instead."
    },
    {
      "title": "Add photos to an existing album (optional).",
      "content": "Add photos to an existing album (optional). If the album already exists, you can add photos from your Camera Roll. Do the following: Open Photos . Tap the photo you want to move. To select more than one, tap Select in the top-right corner and select all photos. Tap the Share icon. Tap Add to Album . Select an album."
    }
  ]
}