{
  "url": "https://www.wikihow.com/Reset-a-Toshiba-Laptop",
  "title": "How to Reset Any Toshiba Laptop: A Step-by-Step Guide",
  "steps": [
    {
      "title": "Open your Windows Settings.",
      "content": "Open your Windows Settings. To do so, press the Windows key on your keyboard, then click the gear icon. Also, if your Toshiba laptop is not plugged in, plug it in now. You'll have two options for resetting your Toshiba laptop: One is a factory reset, which deletes all personal files and restores your laptop to its original factory settings. The other option, which is meant for troubleshooting , is to keep your files and just remove apps and settings. Be sure to back up your data so you don't lose anything important."
    },
    {
      "title": "Click Update & Security (Windows 10).",
      "content": "Click Update & Security (Windows 10). If you're using Windows 11, click System in the left panel instead. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Recovery.",
      "content": "Click Recovery . This displays several recovery options in the right panel."
    },
    {
      "title": "Click Reset this PC in the right panel.",
      "content": "Click Reset this PC in the right panel. If you're using Windows 11, you'll see Reset PC instead."
    },
    {
      "title": "Click Get Started (Windows 10 only).",
      "content": "Click Get Started (Windows 10 only). If you're using Windows 11, you can skip this step."
    },
    {
      "title": "Choose whether to keep your files or remove everything.",
      "content": "Choose whether to keep your files or remove everything. If your goal is to get rid of your computer, you'll want to select Remove everything . If you want to reset your laptop because you're having problems with it, you can select Keep my files to keep your personal data and just remove the apps. If you choose Keep my files , you'll be prompted to back up your data to a local drive or the cloud. Select an option as needed. And, if prompted to \"Restore preinstalled apps,\" you can select Yes to reinstall any additional apps Toshiba installed on your laptop originally."
    },
    {
      "title": "Follow the on-screen instructions to reset your Toshiba laptop.",
      "content": "Follow the on-screen instructions to reset your Toshiba laptop. Once reset, your laptop will reboot and prompt you to set up Windows."
    },
    {
      "title": "Back up your personal data.",
      "content": "Back up your personal data. Resetting your Toshiba laptop will wipe and erase all personal data. To avoid losing data, back up to an external USB drive or cloud storage service."
    },
    {
      "title": "Power off your laptop and disconnect external devices.",
      "content": "Power off your laptop and disconnect external devices. If you have an external mouse, monitor , or USB drive connected to your laptop, disconnect it now."
    },
    {
      "title": "Connect your Toshiba laptop to a power source.",
      "content": "Connect your Toshiba laptop to a power source."
    },
    {
      "title": "Power on your laptop and press the F12 key repeatedly.",
      "content": "Power on your laptop and press the F12 key repeatedly. Continue pressing F12 until the Boot Menu screen appears."
    },
    {
      "title": "Use the arrow keys to navigate to HDD Recovery.",
      "content": "Use the arrow keys to navigate to HDD Recovery ."
    },
    {
      "title": "Press ↵ Enter.",
      "content": "Press ↵ Enter . The Advanced Startup menu will display on-screen."
    },
    {
      "title": "Click Troubleshoot and then Reset.",
      "content": "Click Troubleshoot and then Reset . Your Toshiba laptop will take anywhere between 15 minutes and two hours to reset. When complete, your laptop will restart and display the initial welcome screen. [2] X Research source"
    },
    {
      "title": "Back up your personal data.",
      "content": "Back up your personal data. Resetting your computer will wipe and erase all personal data, so make sure you back up your data to an external USB drive or cloud storage service. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Power off your laptop and disconnect external devices.",
      "content": "Power off your laptop and disconnect external devices. If you have an external mouse, monitor, or USB drive inserted, disconnect it before continuing."
    },
    {
      "title": "Connect your Toshiba laptop to a power source.",
      "content": "Connect your Toshiba laptop to a power source."
    },
    {
      "title": "Press and hold down the “0” key, and power on your laptop at the same time.",
      "content": "Press and hold down the “0” key, and power on your laptop at the same time. [4] X Research source"
    },
    {
      "title": "Release the “0” key when the recovery warning message displays on-screen.",
      "content": "Release the “0” key when the recovery warning message displays on-screen."
    },
    {
      "title": "Select the operating system that applies to your Toshiba laptop.",
      "content": "Select the operating system that applies to your Toshiba laptop. For example, if your laptop runs on Windows 7, select “Windows 7.”"
    },
    {
      "title": "Click Yes to confirm you understand resetting your laptop will wipe all data.",
      "content": "Click Yes to confirm you understand resetting your laptop will wipe all data. The Toshiba Recovery Wizard will display on-screen. [5] X Research source"
    },
    {
      "title": "Select “Recovery of Factory Software” and click Next.",
      "content": "Select “Recovery of Factory Software” and click Next . [6] X Research source"
    },
    {
      "title": "Follow the remaining on-screen prompts to finish resetting your laptop.",
      "content": "Follow the remaining on-screen prompts to finish resetting your laptop. The reset process may take anywhere between 15 minutes and two hours. When complete, your laptop will restart and display the initial welcome screen."
    }
  ]
}