{
  "url": "https://www.wikihow.com/Remove-Glue-from-Photos",
  "title": "How to Remove Glue from Photos",
  "steps": [
    {
      "title": "Scrape off the glue with your fingernail or a razor blade.",
      "content": "Scrape off the glue with your fingernail or a razor blade. This removal method can be time-consuming, but it’s also the safest option. Use your fingernail or a razor blade to gently scrape away the glue before attempting more extensive strategies. [1] X Research source While this isn’t as risky as other methods, keep in mind that scraping could still permanently scratch your photo, especially if the photo has a glossy finish."
    },
    {
      "title": "Heat the glue with a hair dryer and then wipe it off.",
      "content": "Heat the glue with a hair dryer and then wipe it off. Plug in a hair dryer and turn it on low heat. Hold the dryer about 2 inches (5.1 cm) away from the photo and slowly move it back and forth over the glue. After doing this for a couple of seconds, try to wipe the glue off with a paper towel. If it still doesn’t come off, heat the area with the dryer again for a few more seconds."
    },
    {
      "title": "Freeze the photo and then chip off the glue.",
      "content": "Freeze the photo and then chip off the glue. Put the photo in a plastic bag and zip it closed or put it in a tupperware container. Then put it in the freezer for about 5 minutes so that the glue hardens. Take it out, remove it from the bag or tupperware container, and try to chip off the glue with your fingernail. [2] X Research source"
    },
    {
      "title": "Use an adhesive solvent to remove glue on the back of photos.",
      "content": "Use an adhesive solvent to remove glue on the back of photos. Try using an adhesive solvent, such as Un-Du Adhesive Remover, if nothing else is working. Test the solvent on a small, inconspicuous part of the photo before using more of it to remove the glue. [3] X Research source Make sure the adhesive solvent is photo-safe and avoid getting it on the front of the photo if possible."
    },
    {
      "title": "Soak the photo in lukewarm water as a last resort.",
      "content": "Soak the photo in lukewarm water as a last resort. Fill a tray with lukewarm water and soak the photo in it for several minutes so that the glue loosens. Then take the photo out and try using your fingernail to scrape off the loosened glue. Don’t try this method first, as it’s one of the riskier options that can potentially cause damage to your photos. If the edges of your photos curl up after doing this, flatten them by pressing them between a couple of books for a few days."
    },
    {
      "title": "Slide dental floss between the photo and album page.",
      "content": "Slide dental floss between the photo and album page. If your photo is stuck inside an old photo album, first take out some unwaxed dental floss. Break a piece off and slip it underneath one of the photo’s corners. Gently pull the floss back and forth in a sawing motion to separate the photo from the album page. [4] X Research source"
    },
    {
      "title": "Use a hair dryer and a metal spatula.",
      "content": "Use a hair dryer and a metal spatula. Get a thin metal spatula and slip it underneath the photo and on top of the album page. Plug in a hair dryer and turn it on low heat. Point it in the general direction of the photo but avoid pointing it directly at the photo. As you apply the heat, glide the spatula across the album page to free the photo. [5] X Research source"
    },
    {
      "title": "Soak the album page in water for 20-30 minutes.",
      "content": "Soak the album page in water for 20-30 minutes. If other methods aren’t working, fill up a tray with room temperature water. Keep the album page submerged in the water for half an hour or so. Then remove the page and gently pull at the corners of the photo to see if it’ll come off. Set the photo out flat and let it air dry overnight in a well-ventilated area. [6] X Research source"
    }
  ]
}