{
  "url": "https://www.wikihow.com/Samsung-Washer-Sc-Code",
  "title": "How to Fix the SC Error Code on Your Samsung Washer",
  "steps": [
    {
      "title": "The SC, 5C, or 5E code means your washer isn't draining properly.",
      "content": "The SC, 5C, or 5E code means your washer isn't draining properly. Fortunately, this code is something you can usually fix at home. Here are the most common reasons you'll see this error code on a Samsung washer: Clogged drain pump filter Kinked drain hose Blocked drain hose The washer is not level Faulty pressure switch"
    },
    {
      "title": "Clean the drain pump filter.",
      "content": "Clean the drain pump filter. Lint and debris can clog your filter and prevent it from draining properly. To clean the filter, follow these steps: Locate the access door for the drain pump filter on the front of your washing machine, usually at the bottom-right corner. Lay a towel on the floor in front of the access door. Also, have a shallow bowl or dish ready to collect the small amount of water that will drain from the hose. Open the access door by pressing in firmly or using a small, thin tool (or a coin) to pull it open. Pull out the emergency drain hose, position it over your dish, and remove the cap. When the flow stops, cap the hose and put it back inside the access door. Remove the drain filter by turning it counterclockwise and pulling it out of its housing. If there is debris inside, remove it, and wash the filter with warm water. Wipe the inside of the housing with a damp cloth to ensure nothing is building up around the filter. Reinsert the filter, turn it clockwise until it clicks into place, and close the access door."
    },
    {
      "title": "Check the drain hose for kinks.",
      "content": "Check the drain hose for kinks. A kink in the hose can prevent the washer from draining. There are two different installation types for the drain hose: For spigot connections: Make sure the blanking cap is removed, that the hose is pushed in completely, and that there are no kinks or sharp bends that can constrict water flow. For standpipe connections: Make sure the hose is secure with hose clips, that it is at least 60 cm above the floor, that the standpipe covers the hose completely, that there is no more than 150mm of the drain hose inside the pipe, and that there are no kinks or sharp bends that can prevent the flow of water."
    },
    {
      "title": "Check the drain hose for blockages.",
      "content": "Check the drain hose for blockages. Blockages prevent your washer from draining, which can lead to the SC error code. To check your drain hose: Turn off the power to your washing machine from the circuit breaker panel and unplug it from the wall. Remove any laundry from the drum. If the door is locked shut, here are some ways you can unlock it. Pull the washer away from the wall so you can comfortably fit behind it. Find the drain hose. It's usually the thickest hose and is connected to a drainpipe instead of a tap. Detach the drain hose from the washing machine. You might need a screwdriver to do this. Detach the drain hose from the other end. Use a long, thin tool like a straightened-out hanger or a plumber's snake tool to remove material and debris creating the blockage. Reconnect the hose at both ends, push the washer back in, turn the power on, and run a test load to see if you fixed the error. [1] X Research source"
    },
    {
      "title": "Make sure your washer is level.",
      "content": "Make sure your washer is level. If it isn't level, it won't be able to drain completely, which will trigger the SC code. You can usually tell your washer isn't level when you see water that hasn't drained sitting on one side of the washer or hear a loud thumping noise during the spin cycle. Fortunately, Samsung washers have adjustable legs, which makes leveling easy. Front-loading washers: Place a spirit level on top of the washer to see if it is level. If not, use the adjustable legs to level the washer . [2] X Research source Use a wrench to loosen the locking nut of the foot you want to adjust. Once loosened, use the clamp nut to adjust the height: Turning the clamp nut counterclockwise raises the height, and clockwise lowers it. Tighten the locking nut to lock the new height into place. Top-loading washers: Open the lid and pour water in, up to a little below the pulsator level. If the machine is level, the pulsator will be at the center of the water. If not, adjust the leveling feet. [3] X Research source Loosen the locking nut (some models require a wrench) on the foot you want to level. Turn the foot clockwise to increase the height, or counterclockwise to decrease it. Tighten the locking nut to lock the new height into place. After leveling any Samsung washer, calibrate it for the best results. Power the washer off, power it back on, then hold down Temp and Delay End for 3 seconds. Press and hold Start/Pause to run the calibration cycle. [4] X Research source"
    },
    {
      "title": "Test the pressure switch.",
      "content": "Test the pressure switch. A faulty pressure switch can prevent your washer from draining and result in an SC error. To test the switch to see if it's the problem: Disconnect your washer from power. Turn off the water supply to your washer. Find the pressure switch. It's generally at the top of the unit, but check your manual to find its location for your specific model. Disconnect the switch and remove it from the washer. Test the switch with a multimeter to see if the switch manages power correctly. If the test fails, replace your pressure switch."
    }
  ]
}