{
  "url": "https://www.wikihow.com/Permanently-Lower-Your-Voice",
  "title": "How to Permanently Lower Your Voice",
  "steps": [
    {
      "title": "Find where you should be speaking from.",
      "content": "Find where you should be speaking from. Your voice will be its most natural and powerful when it comes from the area just behind and around your nose. In order to practice speaking from this place, hum mmm-hmm, as if you were responding to a question affirmatively. Feel the vibration in your face as you hum. This is where you should focus on speaking from. [1] X Research source"
    },
    {
      "title": "Learn how to breathe from your diaphragm.",
      "content": "Learn how to breathe from your diaphragm. Breathing from your diaphragm as opposed to your chest will make your voice both more powerful and deeper. When you breathe, your stomach should rise, and your chest and shoulders should remain still. These are full, diaphragm breaths. [2] X Trustworthy Source American Lung Association Nonprofit health organization dedicated to improving lung health through education, advocacy, and research Go to source"
    },
    {
      "title": "Speak from the diaphragm.",
      "content": "Speak from the diaphragm. You want your breath to come from your diaphragm, and go out through the part of your face you identified in step one. Practice this often, saying anything you like, but focusing on these two parts of your body. You will notice that you can get more power in your voice with less vocal strain, resulting in a louder, deeper voice. [3] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Keep practicing.",
      "content": "Keep practicing. At first, breathing this way will feel unnatural and you'll probably switch back to your normal way of breathing and speaking often. But if you practice for a couple of weeks, as often as you can remember, eventually it will become second nature. Learning to breathe from your diaphragm is one of the easiest ways to naturally improve your voice ."
    },
    {
      "title": "Start speaking from your stomach instead of your throat.",
      "content": "Start speaking from your stomach instead of your throat. Consciously lower your Adam's apple by slowly swallowing, the last movement of a swallow before your throat goes up is the position you want. Another way is to lower the back of your tongue into your throat. This sounds difficult but play around with it till you find something that works."
    },
    {
      "title": "Start off slow.",
      "content": "Start off slow. If your close friends or family suddenly hear you go from a 1st soprano to a bass you're going to be found out and have decongestants thrown at you. In conversation say a few words at the beginning and end of a sentence in a lower tone. Just be subtle. [4] X Research source Trying to speak too deep too soon not only will seem conspicuous, it can do serious damage to your vocal chords over time. Be careful, and reign it back if you start to feel serious strain. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Lower the end of your sentences.",
      "content": "Lower the end of your sentences. Whenever you find yourself speaking and you've forgotten to try to consciously lower your pitch, just take a deep breath , clear your throat, and finish whatever you were saying with a lower voice. Ending sentences with a high pitch indicates a question, therefore, consciously lowering the end of your sentences will help you sound more confident. [6] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Practice consciously lowering your voice for a while till it becomes habit.",
      "content": "Practice consciously lowering your voice for a while till it becomes habit . Like any other habit, you will forget often at first. With enough practice, what once was a conscious habit will become something you do unconsciously. The only key is to continue consciously speaking in a deeper tone until it becomes natural."
    },
    {
      "title": "Decide whether more costly options are right for you.",
      "content": "Decide whether more costly options are right for you. Depending on your reasons for trying to deepen your voice, you might decide that it's worth pursuing options that cost money. Voice training and surgery are two of these options, both with large potential for success. If you want a lower voice to improve your confidence or social or dating life, you may want to stick to the slower but safer and cheaper options."
    },
    {
      "title": "Look into voice lowering surgery.",
      "content": "Look into voice lowering surgery. One surgery shown to reduce the pitch of one's speaking voice permanently is called a thyroplasty and it involves reducing the tension in the vocal chords. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Another involves injecting a subjects own fat into their vocal folds, which can reportedly lower pitches and improve voice quality . Though hormone replacement therapy alone usually lowers trans men's voices to more masculine levels, surgeries like these can be a next step for those that desire deeper voices."
    },
    {
      "title": "Get voice training from a speech expert.",
      "content": "Get voice training from a speech expert. Vocologists specialize in helping their clients improve their speech in any number of ways, including altering their pitch. A good vocologist will help you identify the causes of your high-pitched voice and teach you change them. There are even vocologists who specialize in helping transgender people achieve more masculine or feminine voices. [8] X Research source Your chances of lowering your pitch permanently are increased greatly if you get the help from a professional rather than just relying on self-guided practice. [9] X Research source"
    }
  ]
}