{
  "url": "https://www.wikihow.com/Perform-the-Epley-Maneuver",
  "title": "How to Perform the Epley Maneuver",
  "steps": [
    {
      "title": "Schedule an appointment with your doctor if this is your first Epley maneuver.",
      "content": "Schedule an appointment with your doctor if this is your first Epley maneuver. If you are experiencing vertigo and have recently been diagnosed with BPPV, you should to go to a doctor who will perform the Epley maneuver to reposition your inner ear crystals. A doctor or therapist is the only person who should do this maneuver if this is your first time experiencing BPPV. However, they will teach you how to perform it on yourself, just in case your symptoms return in the future. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Understand why it is important to have the maneuver done by a doctor before trying it yourself.",
      "content": "Understand why it is important to have the maneuver done by a doctor before trying it yourself. While you can do the maneuver at home (covered in Method Two of this article), going through the process with a doctor first will help you understand what it feels like to have the procedure done correctly. Trying at home without any context can actual further displace your ear crystals and make your vertigo worse! If you already know what this procedure feels like when done correctly, you can move to method two to refresh your memory on how to perform it."
    },
    {
      "title": "Be prepared to feel vertigo in the first step of the maneuver.",
      "content": "Be prepared to feel vertigo in the first step of the maneuver. The doctor will seat you on the edge of a table or bed, with your head facing forward. Your doctor will then place one hand on each side of your head and will quickly move your head 45 degrees to the right. She will then immediately lie you down on the table so that your head is still in the 45 degree angle to the right. Your doctor will ask you to remain in this position for 30 seconds. [4] X Research source Von Brevern M, Seelig T, Radtke A, Tiel-Wilck K, Neuhauser H, Lempert T. Short-term efficacy of Epley’s manoeuvre: a double-blind randomized trial. J Neurol Neurosurg Psychiatry. 2006; 77:980. Your head will be lying off the examination table or, if you have a pillow behind your back, your head will be on the table. Whatever level your head is resting at, the goal is to have your head lower than the rest of your body when you lie down."
    },
    {
      "title": "Be ready for the doctor to rotate your head again.",
      "content": "Be ready for the doctor to rotate your head again. While you remain in the position she has just placed you in, she will reposition herself and then quickly rotate your head 90 degrees to the opposite side (which means that she will turn your head so that it is facing to the left). [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You should pay attention to any feelings of vertigo that you have. These will most likely stop after 30 seconds in this new position."
    },
    {
      "title": "Roll onto your side.",
      "content": "Roll onto your side. Next the doctor will ask you to roll onto your left side, while she rapidly rotates your head to the right (your nose will now be angled at the floor). To visualize what you will be doing, imagine that you are lying on your right side on your bed, but your face is pointing down into your pillow. You will hold this position for 30 seconds. [6] X Research source Seo T, Miyamoto A, Saka N, Shimano K, Sakagami M. Immediate efficacy of the canalith repositioning procedure for the treatment of benign paroxysmal positional vertigo. Otol Neurotol 2007; 28: 917. Double check the rotation side and nose direction. Note that if your doctor determines the problem is on the right, they will rotate your body and head to the left, and vice versa."
    },
    {
      "title": "Return to a sitting position.",
      "content": "Return to a sitting position. After 30 seconds, your doctor will quickly lift you into a sitting position. You should not feel any vertigo at this time; if you do, this maneuver can be repeated until you are no longer having vertigo. Sometimes it takes more than one maneuver to get all of your inner ear crystals back into their proper places. [7] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Note that, for BPPV on the LEFT side, the same procedure should be performed with the sides reversed."
    },
    {
      "title": "Allow yourself to heal after the maneuver is performed.",
      "content": "Allow yourself to heal after the maneuver is performed. [8] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source After your appointment with the doctor, you might be given a soft neck brace that you will most likely be instructed to wear for the rest of the day. Your doctor will also give you instructions on how to sleep and move around so that you do not experience vertigo again. These instructions are covered in Part 3 of this article."
    },
    {
      "title": "Know when to perform the maneuver at home.",
      "content": "Know when to perform the maneuver at home. You should only perform the maneuver at home if your doctor has clearly diagnosed you with BPPV. If there is a chance that your vertigo is caused by some other condition, the maneuver should only be done by a doctor. The maneuver you will do at home is almost the same as the one the doctor performed, only there will be some slight adjustments. You should not do the Epley maneuver at home if you have had a recent neck injury, if you have a history of stroke, or if you have a limited range of your neck motion."
    },
    {
      "title": "Put your pillow in the right position.",
      "content": "Put your pillow in the right position. Place a pillow on your bed so that when you lie down, it will be behind your back and your head will be lower than the rest of your body. Sit on the bed and turn your head 45 degrees to the right. [9] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source If possible ask someone to be there while you do this maneuver. It will be very helpful to have someone keep time for you, as you will have to remain in each position for 30 seconds."
    },
    {
      "title": "Lie down in a swift motion.",
      "content": "Lie down in a swift motion. With your head still rotated 45 degrees to the left, quickly lie back so that the pillow is under your shoulders and your head is lower than your shoulders. Your head should be resting on the bed. Keep your head at the 45 degree angle facing the right. Wait for 30 seconds. [10] X Research source Von Brevern M, Seelig T, Radtke A, Tiel-Wilck K, Neuhauser H, Lempert T. Short-term efficacy of Epley’s manoeuvre: a double-blind randomized trial. J Neurol Neurosurg Psychiatry. 2006; 77:980."
    },
    {
      "title": "Move your head 90 degrees to the left.",
      "content": "Move your head 90 degrees to the left. [11] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source While you are lying down, quickly turn your head 90 degrees to the opposite side (in this case the left). Do not lift your head when you turn it; if you do, you may have to start the maneuver over. Stay in this position for 30 seconds again."
    },
    {
      "title": "Shift your whole body (including your head) to the left.",
      "content": "Shift your whole body (including your head) to the left. From your position where you are facing the left, move your body so you that you are lying on your right side. Your head should be facing down so that your nose is touching the bed. Keep in mind that you head will be turned more than your body. [12] X Research source Seo T, Miyamoto A, Saka N, Shimano K, Sakagami M. Immediate efficacy of the canalith repositioning procedure for the treatment of benign paroxysmal positional vertigo. Otol Neurotol 2007; 28: 917."
    },
    {
      "title": "Hold the last position and then sit up.",
      "content": "Hold the last position and then sit up. Wait 30 seconds in the last position, lying on your right side with your head facing down so your nose touches the bed. Once the 30 seconds is up, sit up. You can repeat the self-maneuver 3 to 4 times a day until you do not feel any sensations of vertigo. Note that, if you have BPPV on the left side, do the same exercise but with the sides reversed. [13] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Opt to perform the maneuver just before bed.",
      "content": "Opt to perform the maneuver just before bed. Especially if it is your first time performing the Epley maneuver on yourself, it is ideal to do it right before bed. This way, if something goes wrong and you inadvertently trigger more dizziness or vertigo, you can sleep it off (as opposed to having it negatively impact your day). Once you have practiced the maneuver and feel comfortable performing it on yourself, feel free to do it at any time during the day."
    },
    {
      "title": "Wait for 10 minutes before leaving the doctor's office.",
      "content": "Wait for 10 minutes before leaving the doctor's office. It is important to wait so that the debris in your inner ear can settle before you inadvertently shake it up again. This helps to avoid any rebound symptoms of vertigo right after leaving the doctor's office (or right after performing the maneuver on yourself). After about 10 minutes, the debris should be settled and you are safe to proceed with your day as normal."
    },
    {
      "title": "Wear a soft collar for the rest of the day.",
      "content": "Wear a soft collar for the rest of the day. After you get the maneuver performed on you by a doctor, you will be given a soft collar (also known as a soft neck brace) that you will be asked to wear for the rest of the day. The collar will help to control your head movements so that you don’t accidentally move your head in a way that makes your inner ear crystals get out of place again. [14] X Research source Snow, J. B., Wackym, P. A., &amp; Ballenger, J. J. (2009). Ballenger's otorhinolaryngology: Head and neck surgery. Shelton, Conn: People's Medical Pub. House/B C Decker."
    },
    {
      "title": "Sleep with your head and shoulders in a mostly upright position.",
      "content": "Sleep with your head and shoulders in a mostly upright position. [15] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source The night after you have the maneuver done, you should plan on sleeping with your head kept up at a 45 degree angle. You can do this by propping yourself up with pillows or by sleeping in a reclining chair."
    },
    {
      "title": "Keep your head as vertical as possible during the day.",
      "content": "Keep your head as vertical as possible during the day. This means keeping your neck as straight as possible, with your head facing forward. Avoid doing things like going to the dentist or hairdresser, where they tilt your head backwards. You should also avoid exercises where your head moves around a lot. You should not tilt your head back more than 30 degrees. [16] X Research source Tarulli, A. (2011). Neurology: A clinician's approach. Cambridge: Cambridge University Press. When you shower, position yourself so that you are directly under the shower head so that you don’t have to tilt your head back. If you are a man who needs to shave, bend your body forward rather than tilting your head to shave. Avoid any other positions that are known to trigger your BPPV for at least one week after the Epley maneuver has been performed. [17] X Research source"
    },
    {
      "title": "Test the results.",
      "content": "Test the results. After you have waited for a full week avoiding symptoms that are known to provoke your BPPV, try an experiment and see if you can cause yourself to experience vertigo again (by assuming one of the positions that may previously have triggered it). If the maneuver was successful, you should not be able to trigger the vertigo in yourself at this time. It may return again down the road, but the Epley maneuver is highly successful and serves as a temporary cure for BPPV in about 90% of people. [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    }
  ]
}