{
  "url": "https://www.wikihow.com/Send-an-Email-from-Yahoo!-Emailing-Site",
  "title": "Sending an Email from Yahoo! Mail: Easy Instructions & Troubleshooting",
  "steps": [
    {
      "title": "Go to https://mail.yahoo.com/ and log in.",
      "content": "Go to https://mail.yahoo.com/ and log in. You have to use this site to send emails if you aren't using the Yahoo mobile app or a third-party email client, like Thunderbird ."
    },
    {
      "title": "Click Compose.",
      "content": "Click Compose . This is located in the top left of the page and opens up a new tab so you can write an email. If you haven't used the Yahoo site in a while or if this is your first time sending an email, you'll get a prompt so you can choose if you want to create a new email in a compact tab or in a new window. You can use either display method to write and send your email."
    },
    {
      "title": "Add the email's recipient and press ↵ Enter.",
      "content": "Add the email's recipient and press ↵ Enter . Once you type the name, it will be a circled entry; click x to remove that person from the email list. If you want to add multiple recipients, press Enter after each entry, then type another email address. Click Cc Bcc if you want to add those areas as well. Cc stands for Carbon Copy; Bcc stands for Blind Carbon Copy, which you can use to hide other emails from anyone who gets your email. Read this wikiHow article to learn more about using Bcc and Cc."
    },
    {
      "title": "Type the subject.",
      "content": "Type the subject. It should be a short summary of the entire email. A longer subject line can be cut off and become illegible. For example, if you're sending out an email that outlines a conference call, you should have something like \"Conference Call Reminder & Details\" in the subject line."
    },
    {
      "title": "Enter the rest of your email.",
      "content": "Enter the rest of your email. Using the bottom, largest text field, enter your email. Use tools at the bottom of the email to add attachments or format the text in your email, like adding a hyperlink ."
    },
    {
      "title": "Press Send.",
      "content": "Press Send . The window will disappear and you'll see a notification at the top of your screen that your email has been sent. You can find this email in your \"Sent\" folder. [1] X Research source"
    },
    {
      "title": "There's no Send button, so I can't send email through Yahoo!",
      "content": "There's no Send button, so I can't send email through Yahoo! Yahoo will grey out or remove the \"Send\" button if your account has been flagged as spam. Check this by looking in the \"Sent\" folder to make sure that every email located in that folder is original and came from you. If you think your account was flagged by mistake, contact Yahoo Support for help. If you see evidence that your account was hacked, change your password immediately. Update your account security settings if needed and make sure you have two-step verification enabled. [2] X Research source"
    },
    {
      "title": "Buttons or formatting tools are missing from the bottom bar.",
      "content": "Buttons or formatting tools are missing from the bottom bar. Try a different web browser. For example, if you're using Edge, use Firefox or Chrome and the missing button(s) may become visible. If you can't access the Send button, you can also use the keyboard shortcut to send the message without clicking a button. On Windows, press Ctrl + Enter ; on Mac, press Cmd + Return . It might also help to clear your browser cache and try again."
    }
  ]
}