{
  "url": "https://www.wikihow.com/Replace-a-Fascia-Board",
  "title": "How to Replace a Fascia Board",
  "steps": [
    {
      "title": "Uninstall the gutter system from the fascia board you’re replacing.",
      "content": "Uninstall the gutter system from the fascia board you’re replacing. Unscrew the gutters from behind your existing fascia board with an electric screwdriver. Then, locate the brackets underneath your gutter holding them in place and unscrew them so you can lift the gutter up and away from the fascia. Remove the gutter brackets from your fascia so you can reuse them on the new board. Work with a partner so you don’t damage your gutters when you remove them. If your fascia board doesn’t have any gutters, you may skip this step."
    },
    {
      "title": "Cut the board into 3 ft (0.91 m) sections with a reciprocating saw.",
      "content": "Cut the board into 3 ft (0.91 m) sections with a reciprocating saw. Mark out 3 ft (0.91 m) sections along your fascia board with a pencil. Make vertical cuts into the fascia board between your roof rafters. Cut out each 3 ft (0.91 m) section one at a time until you’ve removed the full board. This step is not required, but it makes it easier to remove the board in pieces."
    },
    {
      "title": "Pound the boards off of the rafters from behind with a hammer.",
      "content": "Pound the boards off of the rafters from behind with a hammer. Keep the fascia board steady with your nondominant hand. Hold a hammer with your dominant hand behind your existing fascia boards and start pounding it to loosen the nails. Continue hitting the board until the nails behind it come out from the rafters. Once the board is loose, pull it off from your home. If the fascia board is rotting, try to break off as much of the rotting wood as possible before sawing through the boards."
    },
    {
      "title": "Saw through any nails going into your roof with a blade meant for metal-cutting.",
      "content": "Saw through any nails going into your roof with a blade meant for metal-cutting. Some boards are connected from the top through the roof as well as the rafters. Put a blade meant for cutting metal onto your reciprocating saw and cut along the top seam of the board so you have a flat surface for your new board. Don’t pound the nail back into the roof since it may damage the shingles above it."
    },
    {
      "title": "Measure the length of your roof where you’re installing your fascia board.",
      "content": "Measure the length of your roof where you’re installing your fascia board. Use a tape measure to find how long your roof is where you’re putting in the new fascia. Make sure to double check your measurements so your cuts are precise."
    },
    {
      "title": "Cut the board to the length you need with a circular saw.",
      "content": "Cut the board to the length you need with a circular saw . Use a board made for outdoor use so it doesn’t develop any rot, such as outdoor-treated spruce, pine, or cedar. Set the board on saw horses or a sturdy work surface so the end you’re cutting hangs over the edge. Turn on your circular saw and cut through the wood. [1] X Research source Wear safety glasses as you work with a circular saw so your eyes are protected."
    },
    {
      "title": "Miter the end of your board to make a clean seam with another.",
      "content": "Miter the end of your board to make a clean seam with another. Mitered corners hide seams by cutting the ends of your boards to 45-degree angles. Set the angle on your circular saw to a 45-degree angle and trim the end of your board. [2] X Research source You can also rent a miter saw if you want to make more precise cuts, but a circular saw will work if it’s all you have. Miter cuts only need to be made if you’re putting your fascia on a corner."
    },
    {
      "title": "Mark the locations of your rafters on the drip edge above the fascia.",
      "content": "Mark the locations of your rafters on the drip edge above the fascia. Fascia boards need to be secured to the rafters in order to stay in place. Use a pencil to mark the locations of the rafter boards so you know where to place your nails later on. [3] X Research source Drip edges are metal flashing pieces along the edge of your roof to help water flow away from your fascia. If you don’t have a drip edge, mark the measurements on the edge of your roof or on the fascia board itself."
    },
    {
      "title": "Use 1-2 nails through each rafter to secure your fascia board.",
      "content": "Use 1-2 nails through each rafter to secure your fascia board. Hold the board in place, and use 2 in (5.1 cm) nails and a hammer to secure it in place. Place your nails in line with the marks on your drip edge and place it in the center of your fascia board. Drive 1-2 nails in per rafter so it doesn’t move around. Make sure each end of your fascia board is nailed into a rafter so they don’t bow out or break your seal. Have a partner help you hold the board in place while you nail it so it’s kept straight."
    },
    {
      "title": "Cover all of the seams with body filler.",
      "content": "Cover all of the seams with body filler. Use a bonding body filler putty so water can’t get in between the seams and damage the wood. Mix the filler with a putty knife on a flat sheet of cardboard or on a plate and scrape it onto your fascia board. Go over the seam 2-3 times so the putty gets pushed into it. Then, cover all of your nails with the putty as well. Wait for 1 day for your putty to completely set. [4] X Research source Body filler can be purchased from your local hardware store. Only mix a small amount of the body filler at a time since it dries quickly."
    },
    {
      "title": "Paint the new fascia board",
      "content": "Paint the new fascia board if you want it to match the rest of your home. Once the fascia board is sealed, paint 1-2 coats of outdoor primer onto the wood and let it dry for 6 hours. When the primer is dry and evenly coats the surface, use a layer of outdoor paint to help protect your wood and blend it into the rest of your home. Let the first layer of paint dry completely before applying another coat. [5] X Research source Use any leftover paint you may have from the last time your house was painted."
    }
  ]
}