{
  "url": "https://www.wikihow.com/Request-No-Gifts-at-a-Birthday-Party",
  "title": "How to Request No Gifts at a Birthday Party",
  "steps": [
    {
      "title": "Create an invitation that politely asks guests not to bring gifts.",
      "content": "Create an invitation that politely asks guests not to bring gifts. It’s important to make this request using clear, concise language so there’s no confusion. You might write a simple, “No gifts, please!” on the invitation or say, “Your presence is the perfect gift, please no things!” [1] X Research source Another way to phrase this is by saying, “Please no gifts, your presence is the gift!” If you want to give a reason for not wanting gifts, you might say, “Our house is already overflowing with items, so please no gifts!”"
    },
    {
      "title": "Explain any alternatives for gift giving so guests know what to do.",
      "content": "Explain any alternatives for gift giving so guests know what to do. If you want guests to donate to an organization or bring something specific with them instead of a regular birthday gift, make this clear on the invitation. Put the link to a donation page on the invitation to make donating easy and be as specific as possible when nicely telling people what is okay to bring. For example, you might write, “Instead of birthday gifts this year, please bring a canned food item with you to be donated.”"
    },
    {
      "title": "Say that any gifts will be donated to make it clear that you’re serious.",
      "content": "Say that any gifts will be donated to make it clear that you’re serious. If you’re worried about guests feeling obligated to bring a gift even though you’ve asked that they don’t, make it clear you’d really like them to respect your request. You might create an invitation that says, “No gifts, please!” followed by “Any birthday presents received will be donated to a local charity,” or something similar. [2] X Research source"
    },
    {
      "title": "Be grateful if a guest does end up bringing a gift.",
      "content": "Be grateful if a guest does end up bringing a gift. Even if you ask guests not to bring gifts on your party invitation, a few of them may still bring one anyways. If you or the birthday recipient is given a gift, just say “thank you” and place the gift to the side to be opened later. [3] X Research source Many people feel awkward showing up to a birthday party without bringing a present, so they may bring a little something no matter what."
    },
    {
      "title": "Ask for donations to a charity that’s important to the guest of honor.",
      "content": "Ask for donations to a charity that’s important to the guest of honor. This could be something like a local nonprofit or an animal shelter. Choose a charity that’s important to you or the birthday honoree and ask that guests donate any amount they feel comfortable with to the charity instead of bringing a gift. You can even post a link to a charity on Facebook to make donating super easy. [4] X Research source Provide guests with the website or direct link to donate to the chosen charity."
    },
    {
      "title": "Have guests bring a wrapped book to exchange with one another.",
      "content": "Have guests bring a wrapped book to exchange with one another. Ask each guest to wrap up a new or used book and place them in a pile once they arrive at the party. Each person can choose a different book from the one they brought from the pile, letting them bring home a party favor. [5] X Research source If you’d rather let everyone choose the book they bring home, ask guests not to wrap each book."
    },
    {
      "title": "Suggest that each person bring an item for a gift exchange.",
      "content": "Suggest that each person bring an item for a gift exchange. This is a great way to make sure everyone leaves with a party favor while also providing entertainment. Set a limit on how much each person should spend on the gift so that the items are roughly the same value and no one feels pressure to purchase something expensive. [6] X Research source For example, you might ask each guest to bring a gift that’s $5 or less to participate in a gift exchange."
    },
    {
      "title": "Encourage guests to pitch in towards one big gift.",
      "content": "Encourage guests to pitch in towards one big gift. If there’s a specific thing that you or the guest of honor wants for their birthday, ask guests to donate a small amount to this one specific gift. This might be a new bike, a small vacation, or a concert ticket. [7] X Research source Have guests pitch in whatever amount of money they’re comfortable with. You might collect the money at the party in envelopes or create a page online to collect donations."
    },
    {
      "title": "Request that guests bring a non-perishable food item to be donated.",
      "content": "Request that guests bring a non-perishable food item to be donated. This is a great way to support a local food bank or similar nonprofit while also helping guests feel like they’re not showing up to the party empty-handed. Ask guests to bring a canned food item or other non-perishables to the party to be donated to a local charity or organization. [8] X Research source"
    },
    {
      "title": "Ask guests for a hand-written note that the birthday honoree can keep.",
      "content": "Ask guests for a hand-written note that the birthday honoree can keep. This is a great sentimental gift that will mean a lot to the person whose birthday it is. Encourage guests to write a letter sharing things like memories they have with the birthday honoree or advice they might have for the future. [9] X Research source Gather the notes or letters together at the beginning of the party to put them into one book that could be read by everyone."
    },
    {
      "title": "Have each guest bring a snack or food to be shared at the party.",
      "content": "Have each guest bring a snack or food to be shared at the party. This is a great way to provide food at the party, similar to a potluck. Ask each guest to bring a small food dish, side item, or even an ingredient that will be used or shared at the party. [10] X Research source For example, you might have a pizza party where each guest brings a pizza ingredient, or you could plan to make ice cream sundaes at the party and ask each guest to bring their favorite topping."
    }
  ]
}