{
  "url": "https://www.wikihow.com/Score-Goals-in-a-Soccer-Game",
  "title": "How to Score Goals in a Soccer Game",
  "steps": [
    {
      "title": "Learn to shoot with both feet.",
      "content": "Learn to shoot with both feet. One of the most important skills to master to improve your ability to score goals is shooting leg flexibility. By learning to shoot the ball with either foot, you increase your chances of scoring a goal. You will not have to set up the shot to hit the ball with your dominant foot - you can hit the ball as it is. Train your non-dominant foot by drilling with it instead of your dominant foot. The only way to learn how to shoot with both feet is to train both feet. At first, it will be uncomfortable and your technique will be terrible. This is to be expected. Continue pushing yourself and using your non-dominant foot to take shots, to dribble , and to do everything else. [1] X Research source Juggle with your weak foot by letting the ball bounce and then kicking it up with the laces on your weak foot. Alternate touching the ball with the out-step of your foot, then the instep, over and over until you build rhythm and speed. Practice trapping the ball with your weak foot, increasing the intensity as you improve. Pass with your weaker foot, starting off with passing against a wall and then finding a partner and passing the ball back and forth. After you've done these things and gotten some control with your weak foot, try shooting with your non-dominant foot. This skill takes practice and patience. You will not train your non-dominant foot overnight. It will take weeks of practice. Do not give up - your hours of practice will pay off at the end. During the time it takes for you to set up a shot with your dominant foot, the other team can swoop in and steal the ball. Being able to kick with your non-dominant foot doesn't give the opposite team time to steal."
    },
    {
      "title": "Learn to put the ball in the goal with any part of your foot.",
      "content": "Learn to put the ball in the goal with any part of your foot. As a goal scorer, you want to be able to put the ball into the net with either foot and with any part of the foot. Just like being able to shoot with either foot gives you flexibility, learning to shoot with all parts of your foot does the same. Learning how to use any part of either foot means you can shoot with just about any set up. To develop good technique with all of your foot, practice dribbling, passing, and shooting with all six parts of your foot - insides, outsides, heels, toes, instep (laces) and soles. [2] X Research source Devote time to practicing only with certain parts of your feet during every practice session."
    },
    {
      "title": "Perfect your shooting technique.",
      "content": "Perfect your shooting technique. Since soccer is a fluid game that is constantly changing, you can't hope for the same situation you found yourself in when you practiced. You need to be ready for anything the game throws you. Do this by practicing shooting control, ball technique, accuracy, and direction. Complete target practice and drills and technique execution drills. [3] X Research source"
    },
    {
      "title": "Practice against pressure.",
      "content": "Practice against pressure. Make sure your practice sessions are intense and aggressive enough to prepare you for situations you will face in a game. You want to practice in all sorts of situations to improve your technique, your ability to anticipate, and your adaptability."
    },
    {
      "title": "Practice with a goalie and defenders.",
      "content": "Practice with a goalie and defenders. Shooting goals into an unguarded net is easy. You need to get used to shooting and aiming with someone trying to block your shot. In addition to practicing with goalies, practice with defenders. Your practice sessions should teach you how to perfect your technique, accuracy, and control while other players are trying to steal the ball and block you. Try shooting partners. Go through shooting exercises with someone else to improve your technique. Critique each other and try to fix any weaknesses. Remember to practice all of the shooting techniques - you want every skill possible so you can be the best player. [4] X Research source"
    },
    {
      "title": "Develop these skills slowly.",
      "content": "Develop these skills slowly. Start by perfecting technique. This may mean you practice alone against a wall, or with a partner. You should practice shooting into a goal without a goalie to get the hang of it. Add more difficult obstacles as you improve."
    },
    {
      "title": "Get the best shooting stance.",
      "content": "Get the best shooting stance. Just before you get to the ball, look at the goalie to see where he or she is. Keep your non-kicking foot alongside the ball. Square your hips towards where you want the ball to go. Your eyes should remain down and focused on the ball when you're striking. Keep your knee and head over the ball. Make sure to make contact with the middle or top half of the ball. [5] X Research source"
    },
    {
      "title": "Go for the goal quickly.",
      "content": "Go for the goal quickly. When you get the chance to score, go for it; don't stand there and overanalyze. While you hesitate and try to figure out what the best play is, the opposing team can come in and steal the ball. During a game, don't try to set up the ball for a better shot. If you have a shot, take it by only touching the ball one or two times. You always want to finish fast. This takes practice and confidence. When you practice or play recreationally, always go for fast, one touch finishes. If you practice in a situation where you can take your time, set up perfect shots, and not have to worry about aggressive opponents, you will not be ready when you play a good team or a fast-paced game. Practice for difficult games. This is where foot flexibility and all your hours of technique training help you. Being flexible and having a strong skill set makes you ready to finish fast."
    },
    {
      "title": "Be confident and aggressive.",
      "content": "Be confident and aggressive. If you have an open shot, take it. If you think you can take your defender, try it. If you have the opportunity to take a daring pass, go for it. A lot of missed goals come from hesitating as you overanalyze your next move. Be confident and go for it. You may miss a lot of goals at the beginning as you learn how to effectively finish fast. Remember, fast finishes require accuracy and ball technique. If you always miss the net, go back and work on your accuracy and ball technique and try again. Your team should encourage shooting - and missing - goals if the player is in position. But the team should also encourage passing to open teammates and working together to get a goal. Being the person who scores is important, but playing defense, helping set up the shots, and doing all the other things involved in a match is equally important."
    },
    {
      "title": "Shoot wide and low.",
      "content": "Shoot wide and low. If you shoot high, there is a greater chance that the goalie will intercept the ball. Shooting wide aims the ball for the corners instead of right at the goalie, and keeping it low on the ground makes it more difficult for them to crouch down and grab the ball. The technique to shoot wide and low is similar to passing. You can practice both skills at the same time. Most importantly, when you are practicing your shooting technique, go for wide, low shots instead of high shots right down the middle. This will decrease the chances of the goalie blocking it. Try to position your hips in the direction you'd like the ball to go. [6] X Expert Source Walter Merino Soccer Coach Expert Interview. 29 January 2020. According to a recent study, over 60% of successful scoring shots are made in the bottom part of the net, while less than 20% are at the top of the net. Over 65% of goals were made in the corners from wide shots instead of straight down the middle. [7] X Research source"
    },
    {
      "title": "Remember that sometimes less power is more.",
      "content": "Remember that sometimes less power is more. Delivering the ball into the net isn't always achieved by kicking the ball with all the power you can muster. This usually ends in a miss, either because it wasn't aimed at the right place or it sails over the goal. Accuracy is the key to a goal, not power. [8] X Research source When you're near the 18 yard (16.5 m) box, don't kick with all your power. Instead, aim outside of the goalie's reach and kick with greater accuracy and a little bit of power. Use your powerful kicks for when you are more than five yards outside the penalty box. [9] X Research source A sidefoot technique is better for accuracy, while instep/laces is better for power."
    },
    {
      "title": "Keep moving.",
      "content": "Keep moving. Never stand still as you wait for the ball to come to you. Move back, forward, to the left and to the right. Mark your opponents. Stand right behind them, not in front of them, as they get ready to punt or kick the ball. Watch what they do with the ball and move easily in front of the opponent to steal the ball or steal the ball when the opponent turns. [10] X Research source When the ball comes near you, start moving into position, planning where you need to be for your best play."
    },
    {
      "title": "Anticipate your next move.",
      "content": "Anticipate your next move. Know your plan of action before you get the ball. This saves valuable time where you are not hesitating that can be used to your advantage. The ball is not always going to be where you expect or want it to be, but being mentally prepared when you finally get the ball increases your chances of scoring. Knowing if you should shoot, where you should shoot, if you should pass, or who you should pass to can be difficult. This comes with experience and practice as your instincts get sharper. If you have the chance to score, go for it. But remember, spotting an open teammate and passing the ball is just as important. Always plan ahead. [11] X Research source Always be one step ahead of your opponents. Try to figure out where the ball is about to be kicked and get there. This is a very good way to get possession and is especially useful when nearby the opponent's goal. Many a time, the opposing team doesn't expect you to get it and is unprepared, allowing you to score before they know what hit them."
    },
    {
      "title": "Watch the goalie.",
      "content": "Watch the goalie. Keep your eyes on the goalie, watching for any openings that you can use to your advantage. There is no way you can score if you don't notice where the goalie is. Start watching him or her as you approach the goal. [12] X Expert Source Walter Merino Soccer Coach Expert Interview. 29 January 2020. Check to see where the goalie is at even before you receive the ball. [13] X Expert Source Walter Merino Soccer Coach Expert Interview. 29 January 2020. Try aiming for the corners because most goalies are not covering that section of the goal."
    }
  ]
}