{
  "url": "https://www.wikihow.com/Play-Snap",
  "title": "How to Play Snap",
  "steps": [
    {
      "title": "Gather a group of players.",
      "content": "Gather a group of players. Snap can be played with as few as two players and up to six (or even more). The game does become a bit hard to control when there are more than six players. It will require a second deck of cards for playing when you go above six players."
    },
    {
      "title": "Choose a deck of cards.",
      "content": "Choose a deck of cards. The deck does not have to be completely full, because what matters are the ranks of the cards and not their suits. Some people choose to play Snap with decks from other card games, such as Old Maid, as long as the backs of the cards are all the same. [1] X Research source"
    },
    {
      "title": "Shuffle the deck thoroughly.",
      "content": "Shuffle the deck thoroughly. Before beginning to pass out cards, the dealer must carefully and thoroughly shuffle the deck."
    },
    {
      "title": "Deal the cards face-down one at a time.",
      "content": "Deal the cards face-down one at a time. [2] X Research source Starting with the person to the left of the dealer, each person is given one card at a time, and it needs to be face-down. The dealer continues to pass out the cards face-down in piles in front of each player until the last card is dealt. No players should look at their cards while they are being dealt."
    },
    {
      "title": "Begin play with the player to the left of the dealer.",
      "content": "Begin play with the player to the left of the dealer. The first person picks up the card at the top of his/her face-down pile. The card must be turned over very quickly so that he/she cannot see it before anyone else. Then, the card is laid down face-up in a new pile next to the face-down pile. It is recommended to flip the card over in such a way that the face is away from the player. This way, if the card is flipped too slowly, then the player will be the last person to see it. [3] X Research source"
    },
    {
      "title": "Continue clockwise around the table, with each person repeating Step 5, until the first round is completed.",
      "content": "Continue clockwise around the table, with each person repeating Step 5, until the first round is completed. At the end of the round, each person should have one card face-up next to his/her larger pile of face-down cards."
    },
    {
      "title": "Call “Snap” when two cards of the same rank appear face-up.",
      "content": "Call “Snap” when two cards of the same rank appear face-up. This game requires the skill of paying attention to what is going on around you, as well as to what you are doing. [4] X Research source The first person to notice that two cards with the same rank (i.e. 6, King, 2, et cetera) are face-up yells “Snap!” Remember that the suit does not matter. The person who calls “Snap!” does not have to be one of the players with the matching cards, although you can play a variation with the rule that it does have to be one of those players."
    },
    {
      "title": "Take the two piles with matching cards and add them to the bottom of the face-down pile.",
      "content": "Take the two piles with matching cards and add them to the bottom of the face-down pile. The player who successfully calls “Snap!” first gets to take both piles of face-up cards and add them to the bottom his/her own face-down card pile. [5] X Research source"
    },
    {
      "title": "Resume play with the person to the left of the last person who flipped over a card.",
      "content": "Resume play with the person to the left of the last person who flipped over a card. The game should immediately continue after the two matching piles have been collected. The players who lose their face-up piles will start new ones from their remaining face-down pile. This means that they are closer to being out, unless they win piles by calling “Snap!”"
    },
    {
      "title": "Create a snap pool if two players call “Snap” simultaneously.",
      "content": "Create a snap pool if two players call “Snap” simultaneously. When this happens, take the two matching piles and combine them into one pile in the middle of the table. [6] X Research source This is the snap pool. Play will resume, and when someone draws a card that matches the top card of the snap pool pile, the first player to yell “Snap pool!” first wins the middle pile."
    },
    {
      "title": "Move a player's face-up pile to the middle of the table for a snap pool if he/she incorrectly calls “Snap!”",
      "content": "Move a player's face-up pile to the middle of the table for a snap pool if he/she incorrectly calls “Snap!” When a player calls “Snap!” at the wrong time, his/her face-up pile becomes a snap pool. [7] X Research source Play is the same as in Step 10. Players must continue playing with the cards they have left if they lose their piles."
    },
    {
      "title": "Reuse the face-up pile of cards when all cards in the face-down pile are gone.",
      "content": "Reuse the face-up pile of cards when all cards in the face-down pile are gone. Pick up your face-up pile of cards, turn it face-down without shuffling, and continue play. Eventually, as the game gets closer to the end, players with strong memories can memorize the order of their cards so that they can spend more time looking at their opponent's piles to call “Snap!” [8] X Research source"
    },
    {
      "title": "Remove players from the game as they run out of cards.",
      "content": "Remove players from the game as they run out of cards. When a player is completely out of cards, he/she is out of the game. The winner of the game is the player who wins all of the cards."
    },
    {
      "title": "Gather a group of players.",
      "content": "Gather a group of players. Single pile snap is great for young kids, for example, because it is easier to track. [9] X Research source Only one pile in the middle of the table has to be tracked instead of several piles around the table for all players."
    },
    {
      "title": "Get a deck of cards.",
      "content": "Get a deck of cards. You can choose to play with education-themed cards for kids instead of regular playing cards. [10] X Research source The deck does not have to be a full 52 cards."
    },
    {
      "title": "Shuffle the deck of cards.",
      "content": "Shuffle the deck of cards. If children are playing, assist them in shuffling the cards or simply shuffle the deck for them."
    },
    {
      "title": "Deal the cards face-down one at a time until all cards have been dealt.",
      "content": "Deal the cards face-down one at a time until all cards have been dealt. [11] X Research source You can start with the person to the left of the dealer, or you can start with the youngest player or some other variation. No one should look at their cards while they are being dealt."
    },
    {
      "title": "Begin play with the person to the left of the dealer, the youngest player, or however you choose.",
      "content": "Begin play with the person to the left of the dealer, the youngest player, or however you choose. This player turns the card at the top of his/her pile over and places it face-up in the middle of the table. All players will add to this central pile of face-up cards throughout the game."
    },
    {
      "title": "Continue play in a clockwise fashion around the table.",
      "content": "Continue play in a clockwise fashion around the table. Each player will flip over the top card of his/her pile and place it at the top of the center pile. Each player must turn over his/her top card quickly so that no advantage is given to one person by seeing the card first."
    },
    {
      "title": "Call “Snap” when two matching cards are laid down one after the other on the center pile.",
      "content": "Call “Snap” when two matching cards are laid down one after the other on the center pile. The player who calls “Snap!” collects the center pile and adds it to the bottom of his/her face-down pile. [12] X Research source Play resumes after the pile has been collected."
    },
    {
      "title": "Create a snap pool when multiple players call “Snap” at the same time during the game.",
      "content": "Create a snap pool when multiple players call “Snap” at the same time during the game. When this happens, push the center pile off to the side. Continue play with a new pile. The first player to spot a card that matches the top card in the original center pile calls “Snap pool!” and collects both piles. The cards are added to the bottom of his/her face-down pile. [13] X Research source"
    },
    {
      "title": "Give away a card if a player calls “Snap” incorrectly.",
      "content": "Give away a card if a player calls “Snap” incorrectly. When this happens, the player who wrongly called “Snap!” must give the top card of his/her face-down pile to the player on whose card they mistakenly called “Snap!” [14] X Research source"
    },
    {
      "title": "Continue play until only one player remains with cards.",
      "content": "Continue play until only one player remains with cards. When the other players of the game are out because they ran out of cards, the player who is still holding cards or who has won most of the cards by calling “Snap!” wins the game."
    }
  ]
}