{
  "url": "https://www.wikihow.com/Put-an-iPhone-on-Silent",
  "title": "How to Silence Your iPhone: Do Not Disturb vs. Silent Mode",
  "steps": [
    {
      "title": "Understand what silent mode is.",
      "content": "Understand what silent mode is. The iPhone's silent mode turns off the phone's sound for calls and notifications and causes the phone to vibrate instead. Silent mode is a fast and convenient way to (mostly) silence your phone. [1] X Research source Note: an alarm set through the iPhone Clock app will ignore silent mode and go off at the appointed time. Alarms set with other apps may not."
    },
    {
      "title": "Flip the Silent/Ring Switch (iPhone 15 and earlier).",
      "content": "Flip the Silent/Ring Switch (iPhone 15 and earlier). This switch (also called a \"Mute\" switch) is located on the upper left side of the phone. Flipping the switch \"down\" (to silent) will cause the phone to vibrate and will reveal an orange stripe beneath the switch itself. [2] X Research source The switch's “up” position means the phone's sounds are \"on\". If you enter silent mode when your iPhone's display is on, you will see a “Silent Mode On” notification on your screen."
    },
    {
      "title": "Enable Silent mode in Settings on iPhone 15 Pro or later.",
      "content": "Enable Silent mode in Settings on iPhone 15 Pro or later. If you’re using one of the latest iPhone models, your phone doesn’t have a Silent/Ring switch. Instead, there’s an Action Button on the top left side of your phone. To silence your phone , go to Settings > Sounds & Haptics and toggle Silent on. [3] X Research source If you like, you can also configure the Action Button to enable Silent mode. Go to Settings > Action Button and swipe through the actions until you see the silent mode icon, which looks like a bell with a line through it. You can now press and hold the Action Button to silence or unsilence your phone. [4] X Research source"
    },
    {
      "title": "Adjust your “Sounds\" settings to stop your phone from vibrating.",
      "content": "Adjust your “Sounds\" settings to stop your phone from vibrating. To make your phone truly silent, you can stop it from vibrating while in silent mode by going to Settings > Sounds & Haptics. Tap Haptics and select Don’t Play in Silent Mode . [5] X Research source You can also select Never Play if you never want your phone to vibrate. You can also toggle off System Haptics in the main Sounds & Haptics menu to turn off all vibrations for notifications and calls. This setting will not prevent your screen from lighting up when notifications or calls come in."
    },
    {
      "title": "Silence your keyboard clicks.",
      "content": "Silence your keyboard clicks. If you're still hearing your keyboard keys make noise, you can silence these in Settings > Sounds & Haptics . Tap Keyboard Feedback and make sure both Sound and Haptic are toggled off."
    },
    {
      "title": "Turn off \"Lock Sound\".",
      "content": "Turn off \"Lock Sound\". Your phone makes a noise when you lock the screen, regardless of whether it is in silent mode. To turn this sound off, navigate to Settings > Sounds & Haptics and find Lock Sound near the bottom of the menu. Move the toggle from green (on) to white (off) to silence all lock sounds."
    },
    {
      "title": "Turn off all vibrations in Accessibility settings.",
      "content": "Turn off all vibrations in Accessibility settings. If you want to completely turn off all vibrations— including those for emergency alerts —you can do so in your iPhone’s accessibility settings. Go to Settings > Accessibility and select Touch . Tap the toggle next to Vibration to switch it off. [6] X Research source"
    },
    {
      "title": "Understand what \"Do Not Disturb\" mode is.",
      "content": "Understand what \"Do Not Disturb\" mode is. iPhone's \"Do Not Disturb\" mode temporarily blocks all noises, vibrations, and lights so you can be distraction-free. When your iPhone is in this mode, it will receive calls and messages as normal but will not vibrate, ring, or light up. Note: Alarms set in the iPhone Clock app will still sound as normal when your phone is in \"do not disturb\" mode. Many people place their phones in this mode overnight so that they are not woken up by unwanted vibrations, rings, or lights from their phones. According to Tech Expert Naseem Speech, if you enable this mode, other iPhone users will be notified that you have Do Not Disturb enabled if they try to contact you."
    },
    {
      "title": "Swipe down from the top right corner of your screen.",
      "content": "Swipe down from the top right corner of your screen. This brings up the iPhone Control Center. [7] X Research source"
    },
    {
      "title": "Tap the Focus button.",
      "content": "Tap the Focus button. This button with a crescent moon symbol on the left side of your control panel enables \"Do Not Disturb\" mode. If the button is white and the moon is purple, \"Do Not Disturb\" is on. Tap the button again (back to gray) if you'd like to disable \"Do Not Disturb\". [8] X Research source"
    },
    {
      "title": "Enter and exit this mode at set times each day.",
      "content": "Enter and exit this mode at set times each day. If the \"Do Not Disturb\" mode is a feature you use daily, you may program your iPhone to automatically enter and exit this mode at specific times of day. Select Settings > Focus > Do Not Disturb , then tap Add Schedule . [9] X Research source You can set Do Not Disturb to turn on at certain times of the day (e.g., during your regular work hours), at specific locations (like your school, your workplace, or the library), or when you open an app (such as Books or Google Docs )."
    },
    {
      "title": "Permit certain phone numbers to interrupt you in \"Do Not Disturb\".",
      "content": "Permit certain phone numbers to interrupt you in \"Do Not Disturb\". By default, \"Do Not Disturb\" allows contacts that you've designated \"Favorites\" to get through and disturb you. You can customize these settings by going to Settings > Focus > Do not Disturb > People . Under the Phone Calls header, select Everybody , Allowed People Only , Favorites , or Contacts Only . To add allowed people, tap the Add People button with the blue + sign inside. Select people from your contacts who you’d like to add to your list of Do Not Disturb exceptions."
    },
    {
      "title": "Allow repeated calls to get through.",
      "content": "Allow repeated calls to get through. If you like, you can set Do Not Disturb to allow calls through if the caller calls back a second time within three minutes. To do this, go to Settings > Focus > Do Not Disturb > People . Toggle on the switch next to Allow Repeated Calls ."
    },
    {
      "title": "Allow notifications from select apps.",
      "content": "Allow notifications from select apps. If you’d still like certain apps to send you notifications even in Do Not Disturb mode, you can do so in Settings. Go to Settings > Focus > Do Not Disturb and tap Apps . Tap the Add Apps button to select allowed apps. You can also flip the toggle switch at the bottom of the screen to allow Time Sensitive Notifications. For even more control over how different apps behave when Do Not Disturb is enabled, go to Settings > Focus > Do Not Disturb and tap Focus Filters . From here, you can do things like setting only certain calendars or email accounts to send notifications while Do Not Disturb is active."
    }
  ]
}