{
  "url": "https://www.wikihow.com/Say-Poop-in-Spanish",
  "title": "How to Say \"Poop\" in Spanish",
  "steps": [
    {
      "title": "“La caca” (la CAH-cah):",
      "content": "“La caca” (la CAH-cah): This is the standard translation for “poop” in Spanish. This is a common word for “poop” in Spanish, and similar to how that word is used in English, you’ll often hear this word used among families and friends of all ages. [1] X Research source Spanish: \"Mi vecina no recoge la caca del perro.\" Translation: “My neighbor doesn’t pick up her dog’s poop.”"
    },
    {
      "title": "“El popó” (el po-POH):",
      "content": "“El popó” (el po-POH): This kid-friendly word can be translated as “poo.” It’s more commonly used among children than adults, but is appropriate in all contexts. [2] X Research source Spanish: “El popó de gallina es un buen fertilizante.” Translation: “Chicken poo is a great fertilizer.”"
    },
    {
      "title": "“La mierda” (la mee-ER-da):",
      "content": "“La mierda” (la mee-ER-da): This is the Spanish version of a four-letter English word for poop (one that starts with “s”). Although it literally refers to poop, you’ll hear this word commonly used as an expletive that isn’t always directly tied to its literal meaning, just like its English equivalent. [3] X Research source Spanish: “Pisé la mierda del perro.”' Translation: “I stepped in dog poop.”"
    },
    {
      "title": "“El excremento” (el eks-krem-EN-to):",
      "content": "“El excremento” (el eks-krem-EN-to): This Spanish word means “excrement.” Like its English equivalent, it’s a bit less common as a term for poop, and is mainly used when speaking in a more formal context. [4] X Research source Spanish: “Al río van a dar todos los excrementos de la ciudad.” Translation: “All of the excrement from the city goes to the river.”"
    },
    {
      "title": "“Las heces” (las EH-sehs):",
      "content": "“Las heces” (las EH-sehs): This word is the Spanish translation for “feces.” You may encounter this word in a medical context. “Heces” is a word that has a biological connotation, and is less likely to be used in casual conversation. [5] X Research source Spanish: “El análisis de heces no muestra nada anormal.” Translation: “The fecal analysis didn’t show anything abnormal.”"
    },
    {
      "title": "“Los desechos” (los des-EH-chos):",
      "content": "“Los desechos” (los des-EH-chos): Use this word for the Spanish equivalent of “waste.” Like in English, “desechos” doesn’t necessarily mean poop, but refers to waste in many different forms. In certain contexts, however, this word gets used as a euphemism for poop. [6] X Research source Spanish: “Los colectores transportan los desechos.” Translation: “The sewers transport waste.”"
    },
    {
      "title": "“Ir al baño” (eer al BAN-yo):",
      "content": "“Ir al baño” (eer al BAN-yo): This is the most polite way to say you need to go to the bathroom. Keep in mind that this phrase literally means “to go to the bathroom,” and therefore it doesn’t indicate whether you need to poop or pee. [7] X Research source Spanish: \"Disculpe, voy al baño.\" Translation : “Excuse me, I’m going to the bathroom.” This expression uses the irregular verb “ir,” meaning “to go.” To use it in a sentence, practice conjugating it ahead of time."
    },
    {
      "title": "“Hacer del dos” (ah-SER dell dohs):",
      "content": "“Hacer del dos” (ah-SER dell dohs): This phrase translates to, “to go number 2.” Although this expression isn’t so popular among the general population in English-speaking countries, the Spanish equivalent is quite common. [8] X Research source Spanish: “Tengo ganas de hacer del dos.” Translation: “I have to go number 2.” The conjugation for “hacer” (“to do”) is also irregular. Master this common verb so that you can create all kinds of expressions."
    },
    {
      "title": "“Cagar” (cah-GAR):",
      "content": "“Cagar” (cah-GAR): This lightly vulgar phrase means “to take a crap.” Although this isn’t the most delicate way to talk about pooping, it’s very common among friends. [9] X Research source Spanish: “Algo me cayó mal y hoy estuve cagando todo el día.” Translation: “I ate something bad and today I’ve been crapping all day.”"
    },
    {
      "title": "“Zurrarse” (soor-RAR-seh):",
      "content": "“Zurrarse” (soor-RAR-seh): This is a vulgar expression for pooping that’s used in some Spanish-speaking countries, including Mexico, Spain, Honduras, and Nicaragua. Although it’s less common than other expressions for pooping, if you’re in one of these countries, you might encounter this word. Spanish: “No le dío tiempo de llegar al baño y se zurró.” Translation: “He didn’t make it to the bathroom and he crapped himself.”"
    },
    {
      "title": "“Defecar” (de-FEH-car):",
      "content": "“Defecar” (de-FEH-car): For a bit more of a formal expression, use the Spanish equivalent of “defecate.” Like its English equivalent, you probably wouldn’t use this verb in a casual conversation. Instead, save this word for when you’re discussing official or medical subjects. [10] X Research source Spanish: “Prohibido defecar en la calle.” Translation: “Defecating in the street is not permitted.”"
    },
    {
      "title": "“Evacuar” (eh-VAHK-oo-ar):",
      "content": "“Evacuar” (eh-VAHK-oo-ar): Another elevated way to taking about pooping is this verb, meaning “to evacuate.” This word is more commonly used to describe evacuating a building or other location, but it can be used as a euphemism for pooping. Spanish: “Estoy estreñido y no puedo evacuar.” Translation: “I’m constipated and can’t have a bowel movement.”"
    },
    {
      "title": "“Deponer” (deh-PON-er):",
      "content": "“Deponer” (deh-PON-er): This is a medical expression to describe pooping. You may hear this word in the context of pooping if you are in a hospital or speaking with a medical practitioner. Otherwise, it’s quite a formal expression, and isn’t likely to appear in casual conversations. Spanish: “Ella siente dolor al deponer.” Translation: “She feels pain during bowel movements.”"
    }
  ]
}