{
  "url": "https://www.wikihow.com/Sell-a-Laptop",
  "title": "How to Sell a Laptop",
  "steps": [
    {
      "title": "Research your laptop online and choose a competitive price to sell your laptop for.",
      "content": "Research your laptop online and choose a competitive price to sell your laptop for. In order to actually sell your laptop, you need to find a reasonable price. Research your laptops value both brand new, and second-hand to get a rough idea of how much you should sell it for. [1] X Research source The price should be roughly the same as other second-hand ones, but this may vary with the condition of your laptop. Technology is developed so fast meaning that it depreciates in value quite quickly as well. If you bought your laptop over a year ago, chances are the value will have fallen, meaning you need to price your laptop underneath that in order to sell it."
    },
    {
      "title": "Look into selling your laptop online.",
      "content": "Look into selling your laptop online. eBay, Craigslist, or Facebook marketplace, etc... are all great options if you want to sell your laptop for cash, and offer sellers the most control for selling your laptop. [2] X Research source For this option you will need to post a listing, and may end up having to pay a success fee, however you have the ability to raise the price of your laptop to cover this. Exercise caution when selling on person to person platforms. Most experiences go smoothly, however you do hear about the occasional sale gone wrong!"
    },
    {
      "title": "Inquire into selling your laptop in person.",
      "content": "Inquire into selling your laptop in person. There may be a local paper you could advertise in or a garage sale near you that you could sell your laptop at. This is a great way to make a quick sale for cash."
    },
    {
      "title": "Look into trading your laptop if you want store credit.",
      "content": "Look into trading your laptop if you want store credit. This can be a great option when upgrading, as you will be able to directly knock off a part of the price tag of your new laptop. This also takes away the hassle of putting up a listing and waiting for offers. Consider multiple places when trading in your laptop, and not just your original supplier. Different places will give you different offers, so look around to pick the best one."
    },
    {
      "title": "Choose the platform on which you want to sell your laptop.",
      "content": "Choose the platform on which you want to sell your laptop. Use the information you have gathered to decide on a method for selling your laptop. An alternative is to list your laptop at a high price on a trading website (Eg: eBay) and if it doesn't sell in the allotted time, then trade it in at a store."
    },
    {
      "title": "Create a good heading for your listing.",
      "content": "Create a good heading for your listing. The two things that people will see first, are the headline, and the main photo. It is important you create a heading that tells potential buyers the product name, and a quick hook, or reason to buy it. Pick the best feature (Eg: Free Shipping, Brand new, 16GB RAM, etc...) of your laptop and put that in your heading alongside the product name. An example of a good heading might be “HP EliteBook 14\" LED UltraBook (Intel Core i7-4600U, 8GB RAM)”"
    },
    {
      "title": "Take good quality photos, showing off the best parts of your laptop.",
      "content": "Take good quality photos, showing off the best parts of your laptop. Include multiple photos from different angles so that potential buyers can get a good idea of the product you are trying to sell. [3] X Research source It is not a good idea to post stock photos of the laptop on your listing. You should use your own photos so that potential buyers can see the exact condition of the laptop they might be buying."
    },
    {
      "title": "Write a clear and concise body for your listing.",
      "content": "Write a clear and concise body for your listing. This is where viewers will come to get more information. Make sure to present all the details in a well written, clean way that makes it easy to understand. [4] X Research source List the specifications of your laptop like screen size, CPU, graphics card, RAM, and hard drive space for the viewers to analyse. Be sure to list the best features first, but if there are any issues, it is best to list those as well, near the bottom. That way you won’t be ripping anyone off."
    },
    {
      "title": "Include special features in your listing.",
      "content": "Include special features in your listing. Be sure to clearly advertise these features. Buyers on trading websites are looking for the best value for money they can get, so the more special features you can offer, the better the price you will get, and the faster the sale will be. You might be selling your laptop with a free case, free shipping or an extended warranty. These are all great features that will help your laptop sell faster!"
    },
    {
      "title": "Indicate how you will be shipping your laptop.",
      "content": "Indicate how you will be shipping your laptop. Include a flat rate for shipping (or include free shipping for that extra sale feature), or give a rough location for where buyers can pick your laptop up from you. [5] X Research source Whether you send your laptop via courier, or the buyer picks it up can often depend on the sale platform you used. If you traded in your laptop, you will most likely be able to just drop it off in store."
    },
    {
      "title": "Wait for your offers to flood in and pick the best one.",
      "content": "Wait for your offers to flood in and pick the best one. If you’ve written a great ad, chosen the right platform, and priced your laptop accordingly, offers should come flooding in for your brand-spanking second-hand laptop!"
    },
    {
      "title": "Backup important data",
      "content": "Backup important data that your don't want to lose, from your laptop. Any files, documents, photos or applications that you might want to keep need to be saved to an external hard drive so that they can be transferred over to your new laptop or PC. [6] X Research source"
    },
    {
      "title": "Perform a factory reset on your laptop.",
      "content": "Perform a factory reset on your laptop . This will get rid of any leftover personal data on your laptop that you don’t want falling into other people's hands. To ensure all of your content is erased, try a DOD wipe or use KillDisk. Or, just reinstall the operating system and don't add anything to it."
    },
    {
      "title": "Clean up your laptop for the next person.",
      "content": "Clean up your laptop for the next person. Give your laptop a little wipe down, getting rid of the dust and make sure there are no fingerprints or stains on the laptop, or the screen. This is just so the person you’re selling to has a good experience with you, a lot of selling platforms have ratings and feedback that is visible when using the platform again, so be sure to put in that little bit of extra effort!"
    },
    {
      "title": "Ship your laptop to your buyer.",
      "content": "Ship your laptop to your buyer. Take your laptop to the post office, purchase the shipping that you advertised, and send off your laptop to your buyer. Be sure to email or text the buyer with a tracking number if you are provided with one. Package the laptop up well and address it all correctly. You don’t want to send it to the wrong place! Do a check to be sure that you’ve included everything you agreed upon (Charger, laptop case etc…) in the packaging."
    }
  ]
}