{
  "url": "https://www.wikihow.com/Smoke-a-Cigarette",
  "title": "How to Smoke a Cigarette",
  "steps": [
    {
      "title": "Tamp the pack.",
      "content": "Tamp the pack. There are certain preparatory rituals associated with smoking, and chief among those is packing. This is accomplished by inverting an unopened pack of cigarettes, and rapping it smartly, three to six times, against a table or your palm (spanking the camel). [2] X Research source This condenses the loose tobacco so that it's a little tighter in the paper, and in theory, burns a little smoother, and lasts longer."
    },
    {
      "title": "Open the pack.",
      "content": "Open the pack. Either tear open one end of the exposed silver foil, or for flip-top packs, remove the cellophane, then the foil. At this point, many people remove the first cigarette, invert it so the tobacco side is up, and then replace it in the package. For some, this is for good luck. For others it's just a ritual that they may have learned from another smoker. In any case, the lucky cigarette is the last one smoked."
    },
    {
      "title": "Remove a cigarette.",
      "content": "Remove a cigarette. A new pack of smokes will be fairly tightly packed. Invert the pack of exposed cigarettes and rap it against your finger to encourage the cigarettes to come out of the pack. When one has emerged far enough to take up with your fingers, do so. A pack that's been partially emptied will be much easier to retrieve cigarettes from. There is a significant degree of coolness imparted when one removes the emerging cigarette with teeth and lips, rather than fingers."
    },
    {
      "title": "Hold the cigarette.",
      "content": "Hold the cigarette. Whether you pull it from the pack with your fingers or your mouth, you'll eventually be holding the cigarette. This is an entirely personal choice with no rules, but there are some common methods of smoking to be aware of: Classic. Hold the cigarette between the index and middle finger, between the first and second knuckle, palm facing downward. Sophisticated. Same as the Classic, but with the palm facing you and fingers pointing upward. Casual. The cigarette is set behind the second knuckle of the middle finger and secured by wrapping the index finger around it. The hand is in a relaxed, closed position, with the palm towards you or facing downward. Euro I. The cigarette is held between the thumb and forefinger, palm out, cigarette pointing outward. Euro II. The cigarette is held between thumb and forefinger, palm facing in and slightly up, with filter end pointing directly at you. This is how they always spotted the Nazi spy in the movies. (Or by not holding it this way, how they found the American spies). Palmed. The cigarette is pinched between thumb and forefinger, but the palm is facing in, and the cigarette is secreted in hand, pointing towards the inner wrist. Useful when you don't want it to be obvious that you're smoking. Feminine. The cigarette is held between the first and second knuckles of the index and middle fingers. The hand is relaxed and bent backward, with the palm facing up."
    },
    {
      "title": "Put the cigarette in your mouth.",
      "content": "Put the cigarette in your mouth. If you pulled it out of the pack with your teeth, you're already there. If not, put the filtered end of the cigarette between your lips. Some prefer to smoke on one side or another, others in the middle. If you want to know, before you light up in public for the first time, try practicing with a pen or pencil to see what feels right for you. If you're smoking unfiltered cigarettes (\"straights\"), such as Lucky Strikes or Camel Studs, in theory, it doesn't matter which end you put between your lips. In general, however, you'll insert the end with the logo or brand on it."
    },
    {
      "title": "Light it up!",
      "content": "Light it up! Bring your match or lighter up to the tip of the cigarette, and suck in as if you're sucking a milkshake through a straw. Don't inhale when lighting a cigarette: just take a couple of short, the firm draws on it to get the tobacco lit. Factory-made cigarettes will generally light quickly and burn uniformly."
    },
    {
      "title": "Inhale the smoke.",
      "content": "Inhale the smoke. Once your cigarette is lit, pull a little smoke into your mouth. When you're first starting, avoid bringing in too much smoke — you'll regret it when you turn green and start coughing."
    },
    {
      "title": "Hold the smoke in your mouth for a moment.",
      "content": "Hold the smoke in your mouth for a moment. This will let it cool down, which will help keep your throat from becoming irritated. It will also alter the flavor of the smoke, which is objectionable to some. This you will decide with experience."
    },
    {
      "title": "Remove the cigarette from your mouth.",
      "content": "Remove the cigarette from your mouth. As you take it out, inhale the smoke into your lungs by taking a deep breath. This will help avoid irritating your throat and triggering the cough reflex. Note that this is not like smoking a joint, where you inhale directly into your lungs. An alternate form of inhalation is called \"Frenching\" . To do this, before you inhale, push some of the smoke back into the air (without exhaling), and as it exits your mouth, suck it in with your nose. [3] X Research source This may take some practice to perfect. As you continue to smoke, your tolerance for the smoke will increase. This is where the problems arise: the more tolerance you have for the sheer act of inhaling smoke, the easier it will be to smoke. The more you smoke, the more nicotine you ingest, the more addicted you get as you build a tolerance for nicotine. To get the same feeling you did from your first cigarette, you need greater amounts of nicotine, which makes you smoke more."
    },
    {
      "title": "Position your hand.",
      "content": "Position your hand. Part of the ritual of smoking is where you place your cigarette hand when you remove the cigarette from your mouth. Like holding a cigarette, there are no hard and fast rules, but there are common practices, depending on the sex of the smoker. Women often rotate their arm from the shoulder, keeping the cigarette at mouth level, to one side, with palm up and hand facing outward. Men rotate their arm at the elbow, keeping their palm inward, and lowering their hand to mid-torso."
    },
    {
      "title": "Blow out the smoke.",
      "content": "Blow out the smoke. As you move your hand into position, blow the smoke out through your mouth or nose. There is no right or wrong way to do this, but you will develop preferences. [4] X Research source Some say blowing out through their nose lets them get more flavor from the smoke, while others don't like the burning sensation. Some people let the smoke \"dribble\" out of their mouth, exhaling slowly, while others blow it out forcefully. With practice, you can learn to blow smoke rings by forming your mouth in an \"O\" shape, then using your throat to push the smoke over your tongue and through your lips."
    },
    {
      "title": "Tap the ashes",
      "content": "Tap the ashes . Another ritualistic (yet necessary) part of smoking is flicking off the ash. As you burn the cigarette, the part that has been smoked will remain on the tip of your cigarette as fine gray ash that's remarkably tenacious. Still, when it reaches a certain point, gravity takes over and the ash will fall to the ground. If you're walking down the street, this is not a problem. If, however, you're standing indoors, most people frown on having cigarette ash dropped on their floor, so it's best to use an ashtray to remove the ash from your cigarette. How you hold your cigarette will determine how you flick your cigarette. If you hold it such that the filter end is in the vicinity of your thumb, a quick flick over the ashtray, and the ash will tumble neatly into the tray. If you're holding the cigarette pinched between thumb and forefinger, a quick tap in the middle of the cigarette with your index or ring finger will send those ashes tumbling. You can also tap the cigarette itself against the lip of the ashtray so that the ashes are encouraged to fall into the tray."
    },
    {
      "title": "Stub it out.",
      "content": "Stub it out. Once you're done with the cigarette, you'll want to dispose of it safely. You do this by grinding it and stubbing it in the ashtray until it stops smoking. Outside, grind the cigarette against a non-flammable surface until it's out, then dispose of the cigarette properly. Nobody wants to deal with your used butts—it's rude, crude and socially unacceptable. Flicking your butts out the window is also extremely dangerous and has been the start of many forest and brush fires. [5] X Trustworthy Source US National Park Service Agency responsible for the maintenance and promotion of national parks and monuments Go to source Get caught flicking, and you could be fined heavily. Get caught causing a brush fire, and you're looking at serious legal problems. How much of the cigarette you smoke before you're done depends on how much of a cigarette you like to smoke. Obviously, you won't smoke the filter, and if smoking straights, there's only so much cigarette you can smoke until you're frying your lips. Many people smoke until it's just above the filter, or till you can't put it in your mouth. Others prefer to put out a cigarette after it reaches the halfway point, so the smoke remains cleaner and cooler."
    }
  ]
}