{
  "url": "https://www.wikihow.com/Repost-on-Instagram",
  "title": "How to Repost on Instagram",
  "steps": [
    {
      "title": "Download Reposter for Instagram.",
      "content": "Download Reposter for Instagram. Reposter is a free app that allows you to repost someone else's posts—both photos and videos—to your own Instagram feed. To download the app: Open the App Store . Tap Search at the bottom-right corner. Type reposter for instagram into the search bar at the top of the screen and tap the search key, and then select Reposter for Instagram (the pink-and-white \"R\" icon with two surrounding arrows). Tap GET and follow the on-screen instructions to start the download."
    },
    {
      "title": "Open Instagram.",
      "content": "Open Instagram. It's a multicolored app that resembles a camera. If you're already logged into Instagram, doing this will take you to the home page. If you aren't logged into Instagram, type in your username (or phone number) and password and tap Login ."
    },
    {
      "title": "Navigate to a photo or video you wish to repost.",
      "content": "Navigate to a photo or video you wish to repost. Scroll through your home page feed to view recent posts, or tap the magnifying glass icon to search for a particular user. Only public photos and videos can be reposted with Reposter. If the poster's account is set to Private, you won't be able to share it on your own profile."
    },
    {
      "title": "Tap the three dots ….",
      "content": "Tap the three dots … . It's above the top-right corner of the post. A menu will expand."
    },
    {
      "title": "Tap Copy Link.",
      "content": "Tap Copy Link . It's near the middle of the menu. This copies the post's link to your clipboard."
    },
    {
      "title": "Open Reposter for Instagram.",
      "content": "Open Reposter for Instagram. It's the pink-and-white \"R\" icon surrounded by two arrows. You'll find it on one of your home screens."
    },
    {
      "title": "Tap and hold the gray bar and select Paste.",
      "content": "Tap and hold the gray bar and select Paste . This pastes the direct link to the post into Reposter."
    },
    {
      "title": "Tap Preview Photo or Video.",
      "content": "Tap Preview Photo or Video . It's the blue button near the bottom of the screen. A preview will appear. If you see an ad, wait a few seconds and you'll see a small X appear in one of the corners. Tap it to close the ad and view the preview, or wait for the ad to finish. If you're reposting a video, you can watch the preview by tapping the Play button at the center of the thumbnail."
    },
    {
      "title": "Customize the post.",
      "content": "Customize the post. The free version of Reposter let you choose the location of the original poster's Instagram handle, as well as the color of its text. It's not possible to include the caption with the free version, but you'll have a chance to ad your own."
    },
    {
      "title": "Tap the Sharing icon .",
      "content": "Tap the Sharing icon . It's the round blue icon with a bracket and arrow inside. A menu will expand."
    },
    {
      "title": "Tap Repost on Instagram.",
      "content": "Tap Repost on Instagram . It's at the bottom of the menu. This opens the video or photo in an Instagram window. If it's your first time using the app, tap Open to allow it to launch Instagram."
    },
    {
      "title": "Tap Feed at the bottom-right corner.",
      "content": "Tap Feed at the bottom-right corner. This tells Reposter to add the story to your profile/feed instead of your Story. If you'd rather add it to your story, select Story instead."
    },
    {
      "title": "Crop your photo or video and tap Next.",
      "content": "Crop your photo or video and tap Next . Cropping is optional, but you can do it by placing two fingers on the screen and extending them away from each other to zoom in. When you're finished, tap Next at the top-right corner of the screen."
    },
    {
      "title": "Select a filter and tap Next.",
      "content": "Select a filter and tap Next . Filters appear along the bottom of the screen. If you don't want to apply a filter, you can just tap Next at the top-right corner."
    },
    {
      "title": "Type in a caption.",
      "content": "Type in a caption. You'll do so in the \"Write a caption...\" box near the top of the screen. This is a good place to tag the post's original author and mention that you're reposting their work."
    },
    {
      "title": "Tap Share.",
      "content": "Tap Share . It's in the top-right corner of the screen. This shares the post with your Instagram followers."
    },
    {
      "title": "Install Repost for Instagram on your Android.",
      "content": "Install Repost for Instagram on your Android. This is a free app that lets you someone else's photo or video post to your own feed. To download the app: Open the Play Store in your app list. Type repost for Instagram into the search bar. Tap Repost for Instagram . It's the blue icon with two white squared arrows inside. Tap Install and follow the on-screen instructions."
    },
    {
      "title": "Open Instagram.",
      "content": "Open Instagram. It's a multicolored app that resembles a camera. You'll usually find it on the home screen or in the app drawer. If you're already logged into Instagram, doing this will take you to the home page. If you aren't logged into Instagram, type in your username (or phone number) and password and tap Login . Only public photos and videos can be reposted with Reposter."
    },
    {
      "title": "Navigate to the photo or video you want to repost.",
      "content": "Navigate to the photo or video you want to repost. Scroll through your home page feed to view recent posts, or tap the magnifying glass icon to search for a particular user."
    },
    {
      "title": "Tap the three dots ⁝.",
      "content": "Tap the three dots ⁝ . It's in the top-right corner of the post."
    },
    {
      "title": "Tap Copy Link.",
      "content": "Tap Copy Link . It's near the middle of the menu. This copies the post's link to your clipboard."
    },
    {
      "title": "Open Repost for Instagram.",
      "content": "Open Repost for Instagram. It's the blue icon with two squared arrows inside. You'll find it in your app list."
    },
    {
      "title": "Paste the copied URL into the blank.",
      "content": "Paste the copied URL into the blank. If the URL doesn't appear automatically, tap and hold the typing area and select Paste ."
    },
    {
      "title": "Tap the arrow on the right side of the post.",
      "content": "Tap the arrow on the right side of the post. This opens some editing options and a preview."
    },
    {
      "title": "Customize the post.",
      "content": "Customize the post. You can control where on the post the original poster's Instagram tag appears, as well as whether the background is dark or light."
    },
    {
      "title": "Tap Repost.",
      "content": "Tap Repost . It's the blue button at the bottom. This opens the photo in Instagram."
    },
    {
      "title": "Crop your post or video and tap Next.",
      "content": "Crop your post or video and tap Next . If you want crop the post, place two fingers on the screen and extend them away from each other to zoom in on the photo. When you're finished, tap Next at the top-right corner of the screen."
    },
    {
      "title": "Select a filter and tap Next.",
      "content": "Select a filter and tap Next . Filters appear along the bottom of the screen. If you don't want to apply a filter, you can just tap Next at the top-right corner."
    },
    {
      "title": "Type a caption.",
      "content": "Type a caption. You'll do so in the \"Write a caption...\" box near the top of the screen. This is a good place to tag the post's original author and mention that you're reposting their work."
    },
    {
      "title": "Tap Share.",
      "content": "Tap Share . It's in the top-right corner of the screen. This shares the post with your Instagram followers."
    },
    {
      "title": "Open Instagram.",
      "content": "Open Instagram. It's the pink, purple, and yellow camera icon. You'll usually find it on the home screen, in the app drawer (on an Android), or by searching. This method will only work if you're reposting a still image."
    },
    {
      "title": "Navigate to a photo you wish to repost.",
      "content": "Navigate to a photo you wish to repost. Scroll through your home page feed to view recent posts, or tap the magnifying glass icon to search for a particular user."
    },
    {
      "title": "Take a screenshot.",
      "content": "Take a screenshot. Scroll to (or tap) the post so the image you want to share is on the screen, and capture screenshot using the button combination required by your phone or tablet. See How to Capture a Screenshot to learn how to take a screenshot on your phone or tablet."
    },
    {
      "title": "Tap +.",
      "content": "Tap + . It's at the bottom-center of Instagram. This creates a new post."
    },
    {
      "title": "Tap Library.",
      "content": "Tap Library . You'll find this option in the bottom-left corner of the screen."
    },
    {
      "title": "Tap your screenshot.",
      "content": "Tap your screenshot. This displays a preview at the top of the screen."
    },
    {
      "title": "Crop your screenshot and tap Next.",
      "content": "Crop your screenshot and tap Next . To crop the screenshot, place two fingers on the screen and extend them away from each other to zoom in on the photo. When you're finished, tap Next at the top-right corner of the screen."
    },
    {
      "title": "Select a filter and tap Next.",
      "content": "Select a filter and tap Next . Filters appear along the bottom of the screen. If you don't want to apply a filter, you can just tap Next at the top-right corner."
    },
    {
      "title": "Type a caption.",
      "content": "Type a caption. You'll do so in the \"Write a caption...\" box near the top of the screen. This is a good place to tag the post's original author and mention that you're reposting their work."
    },
    {
      "title": "Tap Share.",
      "content": "Tap Share . It's in the top-right corner of the screen. Doing so will post your screenshot, effectively reposting the original photo to your Instagram page."
    }
  ]
}