{
  "url": "https://www.wikihow.com/Name-of-Machines-at-the-Gym",
  "title": "33 Workout Equipment Names with Full Descriptions & Instructions",
  "steps": [
    {
      "title": "Arm Curl Machine",
      "content": "Arm Curl Machine Arm curl machines, or preacher curl machines, isolate your arms during your workout. Adjust the weights so you can lift them easily at first but they become more challenging after a few reps. Sit down, and sit close to the armrest so it's near your armpits. Place your upper arms on the rest and grab the handles. Slowly curl your arms and bring your hands up toward your head to complete a rep. [1] X Research source Targeted Muscles: Biceps and forearms Workout Tip: Drive your elbows into the arm rest as you’re curling to get more power from your biceps."
    },
    {
      "title": "Arm Extension Machine",
      "content": "Arm Extension Machine Arm extension machines isolate your triceps so they build the most muscle. Sit down at the machine and set the weight. Then, bend your elbows to 90 degrees to rest them on the pad and hold onto the handles. Push the handles forward to extend your arms and lift the weight. [2] X Research source Targeted Muscles: Triceps Workout Tip: Keep your feet firmly planted on the ground in front of you throughout the exercise so your body doesn’t move around."
    },
    {
      "title": "Dip Machine",
      "content": "Dip Machine Dip machines have a seat to make it easier to do tricep dips without adding extra stress to your body. Put your hands on the top of the bar and straighten your arms to lift yourself up. Bend your knees to 90 degrees. Slowly bend your elbows to lower yourself until they’re at 90 degrees. Then, straighten your arms to lift yourself back up again. [3] X Research source Targeted Muscles: Triceps, chest, shoulders, and upper back Workout Tip: Some dip machines have a seat or knee rest that helps lift you back up so you do more targeting tricep workouts."
    },
    {
      "title": "Shoulder Press Machine",
      "content": "Shoulder Press Machine Sit down on the machine’s seat and set the handles to shoulder height. Bend your elbows and grab onto the bottoms of the machine’s handles. Straighten your arms to push the weight up above your head and hold it for a count. Then, slowly lower the weight back down to the starting position. [4] X Research source Targeted Muscles: Shoulders, deltoids, and triceps Workout Tip: Press your back firmly against the backrest so your body is fully supported and your shoulder muscles are isolated."
    },
    {
      "title": "Lateral Raises Machine",
      "content": "Lateral Raises Machine Doing lateral raises is easy when you have a machine to guide the weights. Sit down and bend your elbows to 90 degrees so your forearms press against the arm pads. Hold tightly onto the handles and lift your arms up to the side until they’re parallel with your shoulders. Then, slowly lower your arms back down to the side. [5] X Research source Targeted Muscles: Front and middle shoulders Workout Tip: Keep a slight arch in your back throughout the exercise to fully support your shoulders."
    },
    {
      "title": "Chest Press Machine",
      "content": "Chest Press Machine Adjust the seat so the machine’s handles are aligned with the middle of your chest. Hold onto the handles so your elbows are bent to 90 degrees. When you’re ready to start, push the handles forward and straighten your arms. Hold the position for a count and then slowly bring your arms back to the starting position. [6] X Research source Targeted Muscles: Chest, biceps, back, deltoids, and shoulders Workout Tip: Keep the handles in front of your chest so you don’t put additional stress on your shoulders during your workout."
    },
    {
      "title": "Chest Fly Machine",
      "content": "Chest Fly Machine Sit on the seat and reach out to the handles on the side so your arms are parallel with the floor. Keep your shoulders down and back straight. Keep your arms engaged and pull the handles out in front of you like you’re giving someone a hug. Slowly move your arms back to the starting position to finish a rep. [7] X Research source Targeted Muscles: Chest, shoulders, biceps, and triceps Workout Tip: Keep the rest of your body still so the only muscles you’re working are your chest, shoulders, and arms."
    },
    {
      "title": "Bench Press",
      "content": "Bench Press Load weights onto the barbell and lie on your back on the bench. Position yourself so the bar is in line with your eyes. Reach up and hold the bar slightly wider than shoulder-width apart. To do a bench press , lift the bar and hold it over your chest. Bend your arms to lower the bar to your chest. Then, slowly push the bar back up to your starting position. Targeted Muscles: Chest, back, shoulders, biceps, and triceps Workout Tip: Keep your feet flat and firmly planted on the ground throughout the exercise so you can support your body."
    },
    {
      "title": "Back Extension Machine",
      "content": "Back Extension Machine Place the backs of your feet against the foot pads and rest your thighs against the bench. Keep your upper body straight and in line with your legs. Cross your arms over your chest and slowly hinge at the hips to lower your upper body toward the ground. Then, slowly lift your body back up to the starting position. Targeted Muscles: Lower back and core muscles Workout Tip: Make sure your hips are just above the edge of the bench pads so you don’t restrict your movement."
    },
    {
      "title": "Lat Pulldown Machine",
      "content": "Lat Pulldown Machine Sit on the seat facing the weight rack at the back of the machine. Reach up and take a wide grip on the handle above you. Activate your core and slowly pull the bar down to your chest until your elbows are bent to 90 degrees. Then, slowly raise the bar back up to the starting position. [8] X Research source Targeted Muscles: Lats (upper back), biceps, deltoids, and traps Workout Tip: Try putting your hands closer together on the bar if you want to engage more of your traps and middle back muscles."
    },
    {
      "title": "Ab Crunch Machine",
      "content": "Ab Crunch Machine Sit on the machine with your back firmly against the seat. Hook your ankles behind the roller pads and hold onto the handles at the top of the machine. Tighten your core muscles and lower your torso while bringing up your legs. Try to get your knees close to your elbows for a count and then relax back to the starting position. [9] X Research source Targeted Muscles: Abdominals Workout Tip: Exhale when you crunch forward and inhale when you relax so the movements are easier."
    },
    {
      "title": "Leg Press Machine",
      "content": "Leg Press Machine Set the weight to something you can comfortably lift. Sit on the bench with your back and head flat on the seat. Position your feet on the rest shoulder-width apart. Tighten your core and straighten your legs out to push the footrest and weights out. Slowly bend your knees again to return to your starting position. [10] X Research source Targeted Muscles: Hamstrings, quads, calves, and glutes Workout Tip: Fully extend your legs without locking your knees. Locking your knees puts pressure on your knee joint and may cause more pain."
    },
    {
      "title": "Leg Extension Machine",
      "content": "Leg Extension Machine Sit down in the seat and position your feet and ankles behind the roller bar near the bottom. Hold onto the seat’s handles to brace your upper body. When you’re ready, straighten your knees to raise the roller bar and the weights to do a leg extension . Then, lower your legs back down to the starting position. [11] X Research source Targeted Muscles: Quads Workout Tip: Pull yourself down into the seat when you’re using the machine so you don’t put added stress on the backs of your knees."
    },
    {
      "title": "Leg Curl Machine",
      "content": "Leg Curl Machine Lie down on the bench, keep your legs straight, and place your calves below the roller pad at the back. Hold onto the handles at the front of the machine and tighten your core. Bend your knees and bring your calves straight up to do a hamstring curl . Hold the position for a count before straightening out your legs again. [12] X Research source Targeted Muscles: Hamstrings Workout Tip: Try to slowly move your legs while you’re doing leg curls so you don’t have jerky movements."
    },
    {
      "title": "Glute Ham Developer",
      "content": "Glute Ham Developer Position your body so your ankles are between the rollers pads and plant your feet firmly on the footrest. Bend your knees to 90 degrees so your upper body is perpendicular to the floor. Cross your arms in front of your chest and slowly straighten your knees to lower your body parallel to the floor. Flex your hips and bend your knees to lift yourself back up again. [13] X Research source Targeted Muscles: Hamstrings, glutes, and abs Workout Tip: Maintain a straight and neutral position with your back and neck so your core and upper leg muscles do the heavy lifting."
    },
    {
      "title": "Smith Machine",
      "content": "Smith Machine A Smith machine has a fixed barbell that only moves up or down so you can focus on doing weighted squats or bench presses without the bar moving side to side. Set the height for the bar and twist the bar to unlock it from the rack. Perform your exercises as you normally would, and twist the bar back toward the rack to lock it in place. [14] X Research source Targeted Muscles: Chest, back, triceps, hamstrings, quads, and glutes Workout Tip: Smith machines are great for lifting heavy loads of weight if you don’t have a spotter because there are multiple safety catches on the rack."
    },
    {
      "title": "Cable Crossover Machine",
      "content": "Cable Crossover Machine A cable crossover machine is one of the largest in the gym because it has 2 weight racks. Depending on the workout you want to do, set the weight for each rack and attach handles to the ends of the cables. Pull on the cables to lift the weight and then slowly move them back to the starting position. [15] X Research source Targeted Muscles: All muscle groups (depending on exercise) Workout Tip: When you’re doing chest flys to build your pecs, stagger your feet so one is in front of you and the other is behind you. Try to keep your body still and only move your arms and shoulders."
    },
    {
      "title": "Functional Trainer",
      "content": "Functional Trainer Functional trainers are an all-in-one machine that have weights, cables, and usually a pull-up bar so you can do a variety of workouts without switching equipment. Simply adjust the weights and attach the appropriate bar or handle for the exercise you want to do. [16] X Research source Targeted Muscles: All muscle groups (depending on exercise) Workout Tip: Alternate between doing an upper body workout one day and lower body workout the next so you don’t fatigue your muscles."
    },
    {
      "title": "Treadmill",
      "content": "Treadmill Treadmills have a moving belt so you can walk or run while you’re indoors. To use a treadmill , straddle the belt and set the machine to a comfortable walking speed. Step on the belt to start walking, and gradually increase your speed if you want to jog or run instead. Some treadmills also let you adjust the incline to help burn more calories. [17] X Research source Targeted Muscles: Legs and glutes Workout Tip: Always clip the treadmill’s safety key to your clothes. That way if you fall, the key will come out and stop the belt from moving. [18] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Elliptical Machine",
      "content": "Elliptical Machine When using ellipticals , or cross trainers, you’ll be standing on sliding steps, so these machines don’t cause as much stress on your knees and joints as treadmills. [19] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Stand on the steps and hold the handles with your hands. Keep your body straight and core engaged while moving your arms and legs back and forth. Add resistance or incline for a more strenuous workout. [20] X Research source Targeted Muscles: Chest, back, triceps, biceps, glutes, and legs Workout Tip: Try pedaling the elliptical backwards for a more targeted glute and hamstring workout."
    },
    {
      "title": "Exercise Bike",
      "content": "Exercise Bike Exercise bikes, or “spin bikes,” are stationary and have a single wheel that spins as you pedal. To use the exercise bike , sit on the seat and slip your feet into the pedals. Use your legs to pedal the bike, and adjust the resistance if you want a tougher ride. [21] X Research source Targeted Muscles: Core, back, glutes, quads, and hamstrings Workout Tip: Keep your core engaged and your back straight while you’re biking. Look down , and try to avoid craning your neck up and looking forward."
    },
    {
      "title": "Air Bike",
      "content": "Air Bike Air bikes, or assault bikes, have a large fan instead of a wheel. When you pedal, the air resistance makes it more difficult to pedal so your body works harder while exercising. Sit on the seat, put your feet on the pedals, and hold onto the handles. Start pedaling and moving the handles back and forth with your arms to start your workout. [22] X Research source Targeted Muscles: Full body Workout Tip: Adjust your seat so you have a slight bend in your knees when the pedal is near the bottom. If your legs are fully straight, it may make you overextend your hips."
    },
    {
      "title": "Stair Climber",
      "content": "Stair Climber Stair climbers have steps that move down so you can get the same workout as going up a flight of stairs. Get onto the machine’s steps, and turn it on at a low speed. Keep your core engaged as you climb up the stairs, and increase the speed if you want to go faster and burn more calories. [23] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Targeted Muscles: Core, glutes, and legs Workout Tip: Alternate between a slower speed and a faster speed for 5 minutes at a time to add more intensity to your cardio workout."
    },
    {
      "title": "Vertical Climber",
      "content": "Vertical Climber Vertical climbers simulate the movements you would use when you’re rock climbing. Put your feet onto the steps and hold onto the handles at the top. Keep your core engaged and your back straight. When you’re ready to start, move your arms and legs up and down at a steady pace. [24] X Research source Targeted Muscles: Full body Workout Tip: Increase the resistance on your climber so it’s more difficult and helps you burn more calories. Just make sure you can maintain a consistent pace without starting or stopping."
    },
    {
      "title": "Rowing Machine",
      "content": "Rowing Machine Rowing machines mimic the movement of rowing a boat. To use the machine , move the seat forward to sit down and strap in your feet. Extend both arms and hold onto the handles while keeping your back straight. Push your legs forward and pull the handles to your chest. Then, relax your arms and bend your knees to go back to the starting position. [25] X Research source Targeted Muscles: Full body Workout Tip: Focus on using your legs and lower body for the most power while you’re rowing, and avoid rounding your shoulders forward."
    },
    {
      "title": "Ski Erg",
      "content": "Ski Erg A ski erg is like a vertical rowing machine that simulates the movements of cross-country skiing. Stand with your feet shoulder-width apart. Pull the handles down so your elbows are bent to 90 degrees and your hands are eye-level. Engage your core and pull the handles down toward your knees. Then, stand straight up and bring your arms back to the starting position. [26] X Research source Targeted Muscles: Full body Workout Tip: Sit in a chair or on a bench while using a ski erg to isolate your upper body and core."
    },
    {
      "title": "Power Rack",
      "content": "Power Rack A power rack, or a squat rack, is a large metal frame that you can use for multiple barbell workouts. For a lower body workout, do weighted squats by placing the barbell on the rack at chest height. To do an upper body workout, move a bench underneath the rack and perform bench presses instead. [27] X Research source Targeted Muscles: Full body Workout Tip: Adjust the height of the safety racks to the lowest barbell position during your squats. That way, if the weight is too heavy, the racks will catch the barbell if you need to tap out."
    },
    {
      "title": "Kettlebells",
      "content": "Kettlebells Kettlebells are heavy ball-shaped weights with handles on top, and they’re really versatile for any workout. For a basic kettlebell swing, bend at the hips with your legs shoulder-width apart and knees bent. Hold the kettlebell’s handle. Swing the kettlebell between your legs. Use the momentum to swing the kettlebell up so you’re in a standing position. [28] X Research source Targeted Muscles: Full body Workout Tip: Keep your back straight and neutral instead of curving your shoulders."
    },
    {
      "title": "Resistance Bands",
      "content": "Resistance Bands Resistance bands are long pieces of elastic that you can use in place of weights to make exercises more challenging. Some resistance bands have handles on the end so you can get a better grip on them. Normally, you’ll step on or secure the end of the resistance band to increase the tension and the intensity of your workout. [29] X Research source Targeted Muscles: Full body Workout Tip: Bands are color-coded depending on how much resistance they have. For a lighter workout, use tan or yellow bands. For an intense workout, try black or silver bands."
    },
    {
      "title": "Medicine Ball",
      "content": "Medicine Ball Medicine balls are weighted and come in a variety of sizes. Hold onto a medicine ball while doing bodyweight or core workouts to add extra weight and resistance. Alternatively, tossing the ball helps you build up more explosive muscle power. [30] X Research source Targeted Muscles: Full body Workout Tip: Try balancing on one leg while doing curls or exercises with a medicine ball to help improve your balance and core strength."
    },
    {
      "title": "Trap Bar",
      "content": "Trap Bar Trap bars (often called hex bars) look like barbells, but they have a hexagonal opening where you stand in the middle. Trap bars are made specifically for performing deadlifts so you can maintain the proper form. Just load your weights onto the ends of the trap bar, squat down and hold the handles in the middle, and straighten your legs to lift the weight. [31] X Research source Targeted Muscles: Quads, glutes, hamstrings, core, and traps Workout Tip: When you lift the trap bar, keep your back straight and neutral and drive your hips forward at the top of your motion."
    },
    {
      "title": "Plyometric Boxes",
      "content": "Plyometric Boxes Plyometric (plyo) boxes are rectangular pieces of equipment made from wood, steel, or foam that come in various heights. For a simple workout, step up onto the plyo box one foot at a time and then step back down. For a more intense exercise, jump up onto the box with both feet. [32] X Research source Targeted Muscles: Glutes, quads, hamstrings, and calves Workout Tip: Bend your knees when you land on a plyo box so you don’t feel as much impact."
    },
    {
      "title": "Battle Ropes",
      "content": "Battle Ropes Battle ropes are long ropes where one end is attached to the wall or a machine. Hold on to the other end of the rope with your feet shoulder-width apart and your knees bent, and whip the ropes up and down for your workout. [33] X Research source Targeted Muscles: Back, abs, triceps, biceps, and glutes Workout Tip: Switch between whipping both ropes at the same time and alternating your arms for a more complete workout."
    },
    {
      "title": "Warm up for a few minutes before working out.",
      "content": "Warm up for a few minutes before working out. Take 5-10 minutes to warm up with light exercises or stretches . Take a short walk, go for a quick job, or lift light weights to get your blood flowing and your muscles ready for your workout. [34] X Research source Exercising without warming up could lead to strain or injury."
    },
    {
      "title": "Adjust the machine to fit your body.",
      "content": "Adjust the machine to fit your body. Most machines have adjustments you can make for seats, handles, height, and weight. When you first start using a machine, adjust the pieces so the equipment is comfortable to use. If you’re not sure how to make the adjustments on the machine, just ask a gym employee or a trainer to assist you."
    },
    {
      "title": "Start with lower weights.",
      "content": "Start with lower weights. Set the weight on your workout machines so it feels easy at the start but feels a little challenging when you complete 10-15 reps. As you get stronger and more comfortable using the machines, then gradually increase the weight over 2-4 weeks to continue building muscle. [35] X Research source Don’t get discouraged if you have to start with lighter weights than you anticipated. As your muscles and joints get used to working out, your exercises will become a lot easier."
    },
    {
      "title": "Use slow and controlled movements while using the equipment.",
      "content": "Use slow and controlled movements while using the equipment. To lift weights safely , use smooth and slow motions so you don’t injure yourself or strain a muscle. Take a few seconds to lift the weight and then slowly lower it back down. [36] X Research source Slow movements also make your workouts more effective because you activate the targeted muscles even more. While you’re lifting, don’t forget to breathe. Exhale on as you’re lifting and contracting your muscles, and inhale as you relax."
    },
    {
      "title": "Maintain your form during each exercise.",
      "content": "Maintain your form during each exercise. As you’re working out, keep your muscles activated so you work out the proper muscles and don’t cause any strain. If you need to, have a friend or trainer watch you during your exercises to make sure you keep your form. [37] X Research source If you’re having trouble maintaining your form, try reducing the weight you’re lifting or do fewer reps."
    },
    {
      "title": "Have someone spot you if you’re using heavy weights.",
      "content": "Have someone spot you if you’re using heavy weights. If you’re pushing the limits on how much weight you’re lifting, ask a friend or another person at the gym if they can help out. A spotter will keep an eye on you to make sure you’re maintaining the proper form and help you lift the weight if it starts feeling too heavy. [38] X Research source If you don’t have someone to work out with, then ask an employee or trainer at the gym to help you out."
    },
    {
      "title": "Rest your muscles for 1-2 days before working them again.",
      "content": "Rest your muscles for 1-2 days before working them again. Your muscles need time to repair and grow in between workouts. Wait at least 24 hours before targeting the same muscles again or give it 2 days so you don’t feel sore. [39] X Research source While one muscle group is recovering, workout a different muscle group. If you did an upper body workout one day, you could do a lower body workout the next day."
    }
  ]
}