{
  "url": "https://www.wikihow.com/Paint-a-Room",
  "title": "How to Paint a Room",
  "steps": [
    {
      "title": "Choose a water- or oil-based paint designed for interior use.",
      "content": "Choose a water- or oil-based paint designed for interior use. Interior paint is meant to have a smooth finish that's easy to clean. Exterior paints, on the other hand, may have chemicals added meant to preserve the paint against exposure to the elements, so it's safest to use interior paint when you're painting indoors. [1] X Research source The 2 primary options for indoor paint are water-based and oil-based paints. Water-based paint is a versatile paint that you can use almost anywhere. It's also quick-drying and is low in the chemicals that create harsh fumes. However, if your wall was previously painted with oil paint, the water-based paint may not stick. Oil-based paint has strong fumes, but it has a rich, glossy finish and is very durable. It's great for use in rooms with higher humidity, like a kitchen or bathroom. If you're a novice painter, the longer drying time can give you more time to fix errors. Latex paint is another option for interior paint. However, it's not as durable as water- or oil-based paints."
    },
    {
      "title": "Purchase 1 US gal (3.8 L) of paint for every 400 sq ft (37 m2).",
      "content": "Purchase 1 US gal (3.8 L) of paint for every 400 sq ft (37 m 2 ). When you’re determining how much paint you’ll need, measure the width and height of each wall. Then, multiply those two numbers together to get the area of each wall. Add the areas from all the walls. If it’s less than 400 sq ft (37 m 2 ), you’ll probably only need 1 US gal (3.8 L) of paint. If it’s more, buy extra paint. [2] X Research source You’ll typically need more paint if you're using a dark color, if the wall is textured, or if the walls are dark and you want to switch to a light color. This estimate works for primer, as well. You can also use a paint calculator to determine how much paint you’ll need, which you can find online. Just type “paint calculator” into your search engine."
    },
    {
      "title": "Remove furniture, wall art, and rugs from the room.",
      "content": "Remove furniture, wall art, and rugs from the room. Before you start painting, empty the room of as many furnishings as possible. Take everything off of the walls, move lightweight furniture to another room, and roll up rugs and store them elsewhere. If there’s anything that has to stay in the room, like a big, heavy piece of furniture, push it to the center of the room. [3] X Research source Remember to remove outlet covers and light switch covers so you don’t accidentally paint them! You’ll probably need a Phillips-head screwdriver for that."
    },
    {
      "title": "Cover anything that’s left in the room with plastic sheeting.",
      "content": "Cover anything that’s left in the room with plastic sheeting. Drape plastic sheets or tarps over the floor, along with anything you had to store in the center of the room. [4] X Expert Source Patrick Coye Painting Specialist Expert Interview. 22 July 2020. Even if you’re very careful, paint can drip or splatter, and it can be hard or sometimes even impossible to remove paint from some surfaces without damaging them. [5] X Research source You can purchase plastic sheeting wherever paint supplies are sold. Avoid using cloths to cover the floor and furniture, like towels or bedsheets. The paint can soak through the fabric, and the stains will be harder to clean if you don’t notice them right away."
    },
    {
      "title": "Wash the walls with a sponge and TSP (trisodium phosphate).",
      "content": "Wash the walls with a sponge and TSP (trisodium phosphate). TSP is a cleaner that cuts through dust and grease, which can prevent paint from adhering to the wall. You can buy it wherever paint supplies are sold . It comes in liquid form, or you can buy a concentrate that has to be mixed with water. Either way, read the label instructions carefully before you use it. Wear gloves and long sleeves when you’re working with TSP, as it can be irritating to your skin. If you don’t have access to TSP, use soap and water instead. Fix any cracks or holes in the walls before you paint. [6] X Expert Source Barry Zakar Handyman Expert Interview. 16 July 2020. You should also remove any nails, adhesives, or anything else that you don’t want to paint over."
    },
    {
      "title": "Apply strips of painters tape around any trim, outlets, or casings.",
      "content": "Apply strips of painters tape around any trim, outlets, or casings. Peel off a piece of tape that’s about 12 in (30 cm) long and use your fingers or a putty knife to press it down along the line you want to paint. Then, tear off another strip that’s about the same size and overlap it slightly with the one you just put down. This will help prevent gaps that might allow paint to seep through. [7] X Research source Choose a painters tape designed for the type of wall you’re painting (such as drywall, wood, or wallpaper). Cover the areas you do not want to paint with tape. [8] X Expert Source Patrick Coye Painting Specialist Expert Interview. 22 July 2020."
    },
    {
      "title": "Open the doors and windows to ventilate the room.",
      "content": "Open the doors and windows to ventilate the room. Paint fumes can be dangerous, so it’s important to work in a well-ventilated area. Open the windows and doors to the room, and turn on a fan if you have one nearby. [9] X Research source Unfortunately, opening windows and doors does run the risk of dirt, dust, pollen, and insects flying into the room, and potentially getting stuck in the paint. If you can, try to open only the windows that are covered with a screen, or tape a piece of mesh over the window if that’s not an option.. Fumes from painting can potentially cause you to become dizzy, short of breath, and nauseous. You might also experience headaches. If you notice any of this, go to an area with fresh air, and double-check the ventilation in the room. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Sand the walls lightly if they have a high-gloss finish.",
      "content": "Sand the walls lightly if they have a high-gloss finish. If the walls are already glossy or slick, paint might have a harder time adhering to the existing finish. Use a fine-grit sandpaper, like 220-grit, and go over the walls lightly in a circular motion. Sand just enough to remove the shiny surface of the paint, then wipe down the walls with a dry cloth to remove any dust. [11] X Research source Don’t sand enough to sand down into the paint or the wall underneath, as this might create an uneven appearance in your finished paint job. This job will go a lot faster if you have an orbital sander. If you don’t have one, you may be able to rent one from a nearby home improvement store. However, you can also sand by hand if that’s a better option for you."
    },
    {
      "title": "Use primer on unpainted walls or if you're changing the color drastically.",
      "content": "Use primer on unpainted walls or if you're changing the color drastically. You don’t always have to prime a wall before you paint it. However, if it’s a wall that’s never been painted before, if you’re going from a very dark to a very light color (or very light to dark), or you had to patch up any holes in the wall, you should prime the walls. This creates a smooth base that will result in a more even application of your final paint color. [12] X Research source If you're painting a wall that's already been painted, it's fine to use a paint and primer in one, rather than priming separately. [13] X Expert Source Barry Zakar Handyman Expert Interview. 16 July 2020."
    },
    {
      "title": "Pry open the primer can and stir the primer with a paint stick.",
      "content": "Pry open the primer can and stir the primer with a paint stick. Paint and primer can settle or even separate as they sit. When you first open the can of primer, give it a good stir to ensure it’s evenly mixed. [14] X Research source If the primer has been sitting for a while, you may want to shake the can vigorously before you open it, then stir it afterward."
    },
    {
      "title": "Apply primer around the borders of the walls with an angled brush.",
      "content": "Apply primer around the borders of the walls with an angled brush. This is a technique known as “cutting in,” and it makes it easier to paint with a roller. Dip a 2 1 ⁄ 2 in (6.4 cm) angled paintbrush brush in the primer and tap it against the side of the can to remove excess. Then, carefully glide the brush along any doorways, trim, windows, and the ceiling, using the tip of the brush to get as close to the trim as possible without painting it. [15] X Research source Painters who are experienced enough at cutting in might not even have to use painter’s tape!"
    },
    {
      "title": "Use a paint roller to roll the primer onto the walls.",
      "content": "Use a paint roller to roll the primer onto the walls. Pour some primer into a paint tray and add a screen. Slip a clean cover onto your roller, then dip the cover into the primer in the tray. Roll the cover across the screen once to remove any excess, then roll the primer along the wall. When you start seeing small gaps where you’re painting, it means the cover is getting dry and it’s time to add more primer. [16] X Research source Painting in an M or a W motion can help you avoid streaks in your primer. You can find rollers, covers, paint trays, and screens at your local home improvement store or paint store."
    },
    {
      "title": "Allow the primer to dry and add a second coat if needed.",
      "content": "Allow the primer to dry and add a second coat if needed. You may need 2 coats of primer to get full coverage. Allow the primer to dry according to the manufactuer’s instructions, then look at the room. If you can easily see the wall underneath the primer, you probably need another coat. If it looks fairly solid, one coat of primer may be enough. [17] X Research source"
    },
    {
      "title": "Sand the primer before you paint the walls.",
      "content": "Sand the primer before you paint the walls. Once all of your coats of primer have dried completely, go over it with 220-grit sandpaper. Don’t sand away all of your primer—you don’t want to undo the work you just did. Instead, sand just enough to create a slightly rough surface. This will help the paint bond to the wall better, giving it a smoother appearance when you’re finished."
    },
    {
      "title": "Open the paint can and stir the paint.",
      "content": "Open the paint can and stir the paint. Paint can settle as it sits, which can sometimes lead to the color being more concentrated at the bottom of the can. To avoid getting an uneven application, stir the can with a paint stick as soon as you open it. If the paint’s been sitting a while, you might even want to shake the can vigorously first, then open it. [18] X Research source Use a paint can opener or a flathead screwdriver to pry the top off the paint can. [19] X Expert Source Patrick Coye Painting Specialist Expert Interview. 22 July 2020."
    },
    {
      "title": "Use a 2 1⁄2 in (6.4 cm) angled paintbrush to cut in along the wall’s edges.",
      "content": "Use a 2 1 ⁄ 2 in (6.4 cm) angled paintbrush to cut in along the wall’s edges. Dip your brush into the can and tap it to remove any excess. Then, carefully run the paintbrush along the trim, about 1 ⁄ 2 in (1.3 cm) from the edge where you want the paint to stop. Then, go back over the same section a second time, this time painting all the way to the trim. Typically, you’ll get the best results by cutting in one wall at a time, then rolling that wall before moving to another. Cutting in around the doors, windows, and ceiling is more intensive than rolling the walls. If you do roll the walls first, you may be more tired, which can make you more likely to make mistakes. [20] X Expert Source Barry Zakar Handyman Expert Interview. 16 July 2020."
    },
    {
      "title": "Fill the deep end of the tray with paint, if you’re using one.",
      "content": "Fill the deep end of the tray with paint, if you’re using one. Unless you’re using a large bucket with a screen, you’ll need to use a paint tray. Carefully pour some of the paint from the can directly into the tray. You don’t need much; just enough to cover the bottom of the deepest part of the tray. Place a metal paint screen in the tray, as well."
    },
    {
      "title": "Dip the roller in the tray and roll off the excess.",
      "content": "Dip the roller in the tray and roll off the excess. Fit the roller with a cover, then lower the roller into the deep end of the paint tray. Once you've picked up some paint, roll the paint roller across the metal paint screen to remove excess paint. Roller covers are sold according to the thickness of the nap, or the fibers that make up the cover. For an interior painting job, a 1 ⁄ 2 – 3 ⁄ 4 in (1.3–1.9 cm) nap will give you plenty of coverage, but it won't soak the walls with too much paint like a deeper nap might. [21] X Research source"
    },
    {
      "title": "Place the roller near the top of the wall about 6 in (15 cm) from an edge.",
      "content": "Place the roller near the top of the wall about 6 in (15 cm) from an edge. Once you've put paint on the roller, lift the roller and place it against the wall close to where you cut in along the ceiling. However, avoid starting right at a corner or other edge, as you might end up with a thick layer of paint that will be hard to smooth out. Instead, start about 6 in (15 cm) from the edge and work your way back. [22] X Research source Don't put the roller all the way on the top of the wall, or you might accidentally paint the ceiling."
    },
    {
      "title": "Roll the paint onto the wall using V-shaped or M-shaped motions.",
      "content": "Roll the paint onto the wall using V-shaped or M-shaped motions. This will help you avoid having streaks in the paint. Try to paint all the way up to where you cut in along the ceiling, then all the way back down to where you cut in on the bottom trim. [23] X Research source If you’re having trouble painting from the top of the wall to the bottom in an even motion, draw an imaginary horizontal line halfway down the wall. Paint a v-shape above the line, then another below, overlapping the wet edges of paint slightly."
    },
    {
      "title": "Wait for the paint to dry completely, then add a second coat.",
      "content": "Wait for the paint to dry completely, then add a second coat. You’ll almost always need at least 2 coats of paint to get a professional-looking finish. Allow the paint to dry as long as the manufacturer suggests, then go back over the whole wall with a second coat of paint. [24] X Research source Don’t try to just touch up certain spots, as the end result will look messy. Apply an even coat of paint to the whole wall, instead."
    },
    {
      "title": "Clean up the room once the walls are dry.",
      "content": "Clean up the room once the walls are dry. When you’re satisfied with the look of your paint job, it’s time for the clean up! Carefully pull away the strips of painters tape from the borders of the room. Then, remove the drop cloths, wash your brushes, and put everything back in the room. [25] X Research source If the paint seeped under the tape, consider whether you should paint the trim to cover it up."
    }
  ]
}