{
  "url": "https://www.wikihow.com/Minecraft-Education-Edition-Mods",
  "title": "How to Get & Install Mods on Minecraft: Education Edition",
  "steps": [
    {
      "title": "Search for mods to download.",
      "content": "Search for mods to download. The most common website you can use to find Minecraft: Education Edition and Minecraft: Bedrock Edition mods is https://mcpedl.com/ . You can use the search bar on the left. You can also search for mods on the internet. Minecraft: Education Edition mostly supports the same mods as Minecraft: Bedrock Edition. Minecraft: Education Edition supports \".mcpack\" and \".mcworld\" mod files. Minecraft mods designed for Minecraft: Java Edition are not supported by Minecraft: Education Edition or Minecraft: Bedrock Edition. Some mods that were designed for earlier versions of the game may not be supported by later versions of the game."
    },
    {
      "title": "Download the mod file.",
      "content": "Download the mod file. Once you find a mod you want to download, click the link to open the information page. Scroll down to the bottom of the page and click the download link. You will be taken to a third-party site where you can download the \",mcpack\" or \".mcworld\" file."
    },
    {
      "title": "Warning:",
      "content": "Warning: You may need to go through an advertisement website, like linkvertise.com, to get to the download link. If so, click the option to get free access with ads. Select a couple of ads to watch. They may open an ad in a new browser tab. You can close it once you are done. Once you view the required ads, you should be taken to the Mediafire.com page where you can click the blue button to download the mod or add-on. If the file you download is not a \".mcpack\" or \".mcworld\" file, delete it immediately. [1] X Research source"
    },
    {
      "title": "Open the mod file.",
      "content": "Open the mod file. By default, your downloaded files can be found in your Downloads folder. Simply double-click the \".mcpack\" or \".mcworld\" file in your downloads folder to open it in Minecraft. When Minecraft launches, you should see \"Importing started\" at the top of the title screen. [2] X Research source If you have Minecraft: Bedrock Edition installed on your computer as well as Minecraft: Education Edition, right-click the file and click Open with... . Then select Minecraft: Education Edition ."
    },
    {
      "title": "Activate the mod.",
      "content": "Activate the mod. To do so, click Play on the title screen. Create a new world or click the pencil icon next to an existing world. \"Mcworld\" files can be found in your list of saved worlds. Click Resource packs and click Available or My packs . Click Activate next to the mod you downloaded. This enables the mod for that world. [3] X Research source"
    },
    {
      "title": "Furnicraft.",
      "content": "Furnicraft. Furnicraft is a mod that adds furniture blocks to your game, including chairs, sofas, appliances, and more. Some have full functionality. You can rotate the furniture blocks in any direction you want. You can download the Furnicraft mode here ."
    },
    {
      "title": "SERP Pokédrock 1.",
      "content": "SERP Pokédrock 1. The SERP Pokédrock 1 is a mod that allows you to play Pokémon inside of Minecraft. It adds Pokémon to your game and allows you to catch and battle them. You can download the SERP Pokédrock 1 here"
    },
    {
      "title": "More Tools.",
      "content": "More Tools. The More Tools add-on adds 7 new materials to game as well as 40+ armor types, 1,000 new tools, and more than 20 new decorative blocks. You can download the More Tools mod here"
    },
    {
      "title": "Actual Guns 3D.",
      "content": "Actual Guns 3D. This mod brings a whole bunch of guns and modern weaponry into Minecraft. A great mod for fans of classic FPS games. You can download the Actual Guns 3D mod here . [4] X Research source"
    },
    {
      "title": "True Backpack.",
      "content": "True Backpack. True Backpack is a great add-on for survival mode. It adds a variety of backpacks in a variety of different styles to the game. Each give you extra space in your inventory. You can download True Backpack here . [5] X Research source"
    },
    {
      "title": "Create a new game or edit an existing Bedrock Edition game.",
      "content": "Create a new game or edit an existing Bedrock Edition game. You can enable Minecraft: Education mode in any Minecraft: Bedrock Edition game. Either create a new game or click the pencil icon next to an existing saved game to edit an existing game. You will not be able to earn achievements in your Minecraft: Education Edition world."
    },
    {
      "title": "Click Cheats.",
      "content": "Click Cheats . If you are creating a new game, click Cheats in the menu bar to the left below the \"Create\" button. If you are enabling Education mode in an existing game, scroll down to the \"Cheats\" header below \"Game Settings\" in the panel to the right."
    },
    {
      "title": "Click the toggle switch next to \"Education Edition.\"",
      "content": "Click the toggle switch next to \"Education Edition.\" This enables Education mode in your Minecraft game and allows you to experience Minecraft: Education Edition in your regular Minecraft game."
    }
  ]
}