{
  "url": "https://www.wikihow.com/Remove-Shellac-Nail-Polish",
  "title": "How to Remove Shellac Nail Polish",
  "steps": [
    {
      "title": "Fill a shallow bowl with acetone.",
      "content": "Fill a shallow bowl with acetone. Pure acetone will have the strongest effect, but acetone nail polish removers will also work as long as the concentration of acetone is around 60 percent or more. [1] X Research source Acetone-free nail polish removers or those that contain very little acetone will not be effective for removing shellac nail polish. You can use pure acetone, which is available at most drugstores, but pure acetone will cause your nails and skin to become extremely dry. As a result, it is best if you do not use it frequently. The dish you pour the acetone in should have a mouth that is wide enough for you to fit your balled-up hand in. You only need to pour enough acetone into the dish to fill up about 1/2-inch (1.25-cm)."
    },
    {
      "title": "Apply cuticle oil to your cuticles.",
      "content": "Apply cuticle oil to your cuticles. Rub cuticle oil into the skin around your nails. Do not wipe away the excess. [2] X Research source Cuticle oil is a product designed to soften and moisturize your cuticles, and it can be found at any major drugstore. Applying it to your cuticles before removing the shellac nail polish will provide your skin with a protective layer against the harsh, drying acetone needed for this process."
    },
    {
      "title": "Soak your nails in the acetone.",
      "content": "Soak your nails in the acetone. Partially ball up your hand so that all five nails are exposed. Hold your hand in this position and dip it into the acetone. Keep it there for 10 minutes. [3] X Research source It is important that you expose as little skin as possible to the acetone since it can severely dehydrate your skin. By holding your hand in this position, you end up dipping your nails and cuticles into the acetone instead of your entire fingertip or hand. Keep your nails submerged in the acetone for the full 10 minutes, even if you see the shellac nail polish flaking off before the full amount of time passes."
    },
    {
      "title": "Scrape the shellac polish off.",
      "content": "Scrape the shellac polish off. After 10 minutes, remove your nails from the acetone and scrape the flaking shellac off with an orange stick or manicure stick. [4] X Research source To scrape the shellac polish off, place the flat edge of the orange stick at the bottom of the nail and gently push it along the length of the nail, beneath the shellac. Repeat this gesture until all the polish has been scraped off each nail. You could also begin scraping the shellac nail polish off after 8 minutes with your hand still submerged in the acetone. This will allow the acetone to continue working on more stubborn spots while you begin stripping away spots that are already ready to come off. [5] X Research source"
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. Use warm water and soap to gently remove the acetone and shellac residue from your hands. After removing the shellac nail polish, you may see a chalky white residue on your nails and fingers. This is residue left behind by the acetone and will wash away with soap and water."
    },
    {
      "title": "Apply lotion and more cuticle oil.",
      "content": "Apply lotion and more cuticle oil. Rub a generous amount of hand lotion over both hands when finished. Also rub additional cuticle oil around your fingernails. [6] X Research source No matter how careful you are, the acetone will dry out at least some of your skin. Lotion and cuticle oil will help restore some of this lost moisture, and applying them immediately after washing your hands will produce the strongest effect."
    },
    {
      "title": "Trim cotton pads and aluminum strips.",
      "content": "Trim cotton pads and aluminum strips. Cut sterile cotton pads into small squares that are just large enough to cover the nail bed of each finger. Cut a sheet of aluminum foil in 3-inch (7.6-cm) squares. [7] X Research source You should have ten cotton squares and ten aluminum foil squares. You will need one of each for each finger. The aluminum foil squares need to be large enough to wrap securely around each fingertip. You could also use cotton balls instead of cotton pads. If using cotton balls, there is no need to trim them down to size. The aluminum foil strips may need to be slightly larger to accommodate the larger thickness of the cotton balls, though."
    },
    {
      "title": "Apply cuticle oil to your cuticles.",
      "content": "Apply cuticle oil to your cuticles. Rub cuticle oil into the skin around your nails. [8] X Research source Cuticle oil is designed to protect, soften, and moisturize your cuticles. Applying it before stripping the nail polish will help to prevent your cuticles from drying out more than absolutely necessary."
    },
    {
      "title": "Soak the cotton in acetone.",
      "content": "Soak the cotton in acetone. Dip the cotton square or cotton ball into acetone nail polish remover until it is fully saturated. There is some debate over whether to use pure acetone or a diluted acetone nail polish remover. Pure acetone is most effective, but it can also cause your nails and skin to become extremely dehydrated. At the very least, you should not use pure acetone frequently. [9] X Research source Acetone-free polish removers are not powerful enough to work on shellac nails."
    },
    {
      "title": "Place the cotton onto your nail.",
      "content": "Place the cotton onto your nail. Position each square of cotton directly over your nail, covering it completely."
    },
    {
      "title": "Wrap the foil around your nail.",
      "content": "Wrap the foil around your nail. [10] X Research source Tightly wrap a square of tinfoil around each fingertip to hold the acetone-soaked cotton pad in place. Wrap each fingertip tight enough to secure the cotton but not so tight that you tear the aluminum foil or cause circulation problems. Aluminum foil creates heat, which actually improves the effectiveness of the nail polish remover. Give each nail a gentle press to make sure that the acetone comes into contact with the nail."
    },
    {
      "title": "Wait 2 to 10 minutes.",
      "content": "Wait 2 to 10 minutes. The shellac will begin to peel away after 2 minutes, but you may find it more effective if you leave it on for a full 10 minutes, instead. The more highly-concentrated the acetone is, the sooner you can remove the cotton. If you wait much longer than 10 minutes, the cotton can dry out. If this happens, it can get stuck to your nail, making it more difficult to remove."
    },
    {
      "title": "Scrape or wipe away the shellac nail polish.",
      "content": "Scrape or wipe away the shellac nail polish. Gently peel the flaking shellac polish off with an orange stick or manicure tool. [11] X Research source Place the flat edge of the tool against the bottom of your nail. Gently scrape the length of the nail until all the nail polish is removed. You might be able to wipe the remaining polish away with another cotton pad soaked in more acetone remover."
    },
    {
      "title": "Buff the nail, if necessary.",
      "content": "Buff the nail, if necessary. If there is any sticky or chalky residue left, use a soft cloth or other soft buffer to gently wipe it away. [12] X Research source Avoid buffing tools that use a motor or have a rough texture since these can weaken your nails."
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. Remove additional residue with warm water and soap."
    },
    {
      "title": "Apply lotion and more cuticle oil.",
      "content": "Apply lotion and more cuticle oil. After washing your hands, put some moisture back into them with hand lotion. Rub more cuticle oil into your cuticles and over your nails to further moisturize them. No matter how careful you are, some dehydration is likely to occur. Lotion and cuticle oil will help restore some of the lost moisture."
    }
  ]
}