{
  "url": "https://www.wikihow.com/Safely-Sedate-a-Dog",
  "title": "How to Safely Sedate a Dog",
  "steps": [
    {
      "title": "Understand that you must get a prescription for sedative drugs.",
      "content": "Understand that you must get a prescription for sedative drugs. The drugs used to sedate a dog are very effective, so they require a prescription from a veterinarian and can only be administered by a veterinarian. The 3 most common drugs used by veterinarians to calm dogs are acepromazine (PromAce®), diazepam (Valium®), and dexmedetomidine (Sileo). [1] X Research source These drugs block certain signals in the central nervous system (CNS), making the animal calm or sedated. Sileo is a gel that can be applied to the inside of a dog’s cheek or to its gums. It is approved by the FDA to treat anxiety or phobias in dogs caused by loud noises (such as fireworks)."
    },
    {
      "title": "Give your dog Acepromazine (PromAce®).",
      "content": "Give your dog Acepromazine (PromAce®). [2] X Research source Acepromazine is used to calm fractious or aggressive animals. It alleviates itching, and also has anti-emetic properties (prevents vomiting), making it ideal for animals that are being transported long distances."
    },
    {
      "title": "Consider giving your dog Diazepam (Valium®).",
      "content": "Consider giving your dog Diazepam (Valium®). Diazepam is also a sedative which has muscle relaxant properties, appetite stimulating properties, and anti-convulsant properties, making it ideal for dogs with seizure and/or appetite problems. [3] X Research source"
    },
    {
      "title": "Make sure your dog gets plenty of exercise.",
      "content": "Make sure your dog gets plenty of exercise. Many experts on dog behavior recommend that a dog be exercised before travelling, or before being engaged in any activity that might get the dog restless and agitated. [4] X Research source A well-exercised dog will be very inclined to rest because it has burned off its excess energy. Therefore, it's a good idea to schedule a brisk 30-minute walk before taking off."
    },
    {
      "title": "Bring your dog’s favorite toys, blanket or rug when travelling.",
      "content": "Bring your dog’s favorite toys, blanket or rug when travelling. Your dog’s favorite blanket or toys contain a lot of familiar scents, and will reduce anxiety when the dog is brought to an unfamiliar place. [5] X Research source"
    },
    {
      "title": "Try aromatherapy.",
      "content": "Try aromatherapy. Do this by placing a few drops of lavender oil on your hands and massaging the dog at the back of its head, or the base of the spine. Lavender oil has a calming scent and is used in spas for humans. [6] X Research source"
    },
    {
      "title": "Offer your dog a casein supplement.",
      "content": "Offer your dog a casein supplement. Supplements containing casein, a protein found in milk, may be calming for some dogs. Try a supplement such as Zylkene if you want to try a gentle, natural approach to soothing anxiety. [7] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source These supplements come in a variety of forms, such as capsules and chews."
    },
    {
      "title": "Use products that contain appeasing pheromones.",
      "content": "Use products that contain appeasing pheromones. Studies have shown that pheromones are present in all mammals during the nursing stage. In dogs, this is the hormone secreted by the puppies’ mother, so when the puppies smell this hormone it calms them and reassures them that mom is around. [8] X Research source Examples of products that contain this hormone are: Adaptil® collar and spray, Sentry® Calming collar, and Comfort Zone® Diffuser with Dog Appeasing Pheromone. These products are very easy to use. The collars are simply placed on the dog’s neck to provide a sustained release of the pheromone which lasts for a month. Diffusers are simply plugged into a socket, and the pheromone is slowly and continuously released for a month. This type of product is ideal for rooms. Spray preparations can be used to spray cages, cars, or any carrier where the dog is placed."
    },
    {
      "title": "Use melatonin supplements.",
      "content": "Use melatonin supplements. Melatonin is a hormone produced by the pineal gland. It is a sleeping hormone that causes the animal to have a good rest at night. It has a seasonal variation in animals and humans, increasing when there are fewer hours of daylight in winter. [9] X Research source Melatonin has sedative and anticonvulsant properties, and it regulates body rhythms and reproductive cycles. It is mainly used in the treatment of separation anxiety in dogs, and other stressful or frightening conditions like noise anxieties brought about by fireworks or thunder storms. Give this drug to your dog before travelling and/or before introducing your dog to a potentially frightening situation. An example of a product containing Melatonin is K9 Choice ™ Melatonin 3 mg tablets. The dose is 3 mg for every 35–100 pounds (16–45 kg) body weight, twice a day. For smaller dogs below 35 pounds (16 kg), the dose is 1.5 mg of melatonin, and for larger dogs greater than 100 pounds (45 kg), the dose is 6 mg twice times a day. [10] X Research source"
    },
    {
      "title": "Try calming herbal agents.",
      "content": "Try calming herbal agents. Herbal pills and oils prepared specifically for dogs are commercially available. Examples include Dorwest Herbs™ Scullcap and Valerian tablets. This herbal medicine preparation can be used for the relief of anxiety, restlessness, excitability, and travel behavioral problems, and can even be used as a supporting supplement for epilepsy. It has been proven effective in dogs with noise phobias, travel anxiety, and hyperactivity. [11] X Research source Skullcap and Valerian Tablets are safe for long term and short term use and can be given from 2 months of age onwards. The dose for Dorwest Herbs™ Scullcap and Valerian tablets is 1 to 2 tablets per 5 kilograms (11 lb) of body weight daily. For one off occasions, use 2 tablets per 5 kilograms (11 lb) of body weight 12 hours before and again 2 hours before the desired effect is required. Skullcap and valerian are not recommended for pregnant or lactating females. Vetzyme Stay Calm Liquid®: this herbal oil is composed of a unique blend of chamomile and ginger oils. Research has shown that these 2 herbs possess calming, soothing, and relaxing properties. The dose is 2.5 millilitres (0.51 tsp) of the oil mixed into the dog’s food daily. [12] X Research source"
    },
    {
      "title": "Prepare your own herbal concoction.",
      "content": "Prepare your own herbal concoction. Do this by mixing 1 teaspoon each of German chamomile, skullcap and catnip. Place these in a cup and set aside. Heat .5 cups (120 mL) of water to boiling and pour this over the cup of herbs. Leave and let it steep for 6 minutes, then strain the liquid and pour 3 tablespoons (44 mL) of honey into the concoction. Store the mixture at room temperature for 24 hours before giving it to the dog."
    }
  ]
}