{
  "url": "https://www.wikihow.com/Season-Broccoli",
  "title": "What Spices and Herbs to Put on Broccoli",
  "steps": [
    {
      "title": "Try a lemon-herb seasoning for something refreshing.",
      "content": "Try a lemon-herb seasoning for something refreshing. For every 3 cups (525 grams) of cooked broccoli florets, you will need: 1 tablespoon (15 milliliters) of olive oil, 2 teaspoons of lemon juice, ¼ teaspoon of garlic salt, and ¼ teaspoon of thyme. Mix your seasoning in a small bowl, then add some freshly-ground black pepper to taste. Pour it over your cooked broccoli, toss to mix, then serve. [1] X Research source Don't like garlic? Use regular salt instead."
    },
    {
      "title": "Use a lemon-garlic seasoning for something more zesty.",
      "content": "Use a lemon-garlic seasoning for something more zesty. For a small bunch of cooked broccoli, about ¾-pound (340 grams), you will need: 1 chopped garlic clove, 1½ tablespoons (22.5 milliliters) of olive oil, and 1½ teaspoons of lemon juice. Mix together your seasonings, then heat in a skillet over medium heat until the garlic turns soft and fragrant, about 1 to 2 minutes. Pour the mixture over the steamed broccoli, toss to coat, then serve immediately. [2] X Research source [3] X Research source"
    },
    {
      "title": "Go for sesame oil and toasted sesame seeds if you'd like a milder flavor.",
      "content": "Go for sesame oil and toasted sesame seeds if you'd like a milder flavor. Cut the broccoli into florets first, then steam it. Drizzle some sesame oil over it, then sprinkle toasted sesame seeds on top. If you'd like, garnish the broccoli further with a sprinkle of thinly-sliced scallions. [4] X Research source"
    },
    {
      "title": "Try some simple seasonings.",
      "content": "Try some simple seasonings. If you don't feel like going fancy, you can choose 1 or 2 seasonings from the list below, and add them to your broccoli after you have already cooked it. Here are some ideas to get you started: [5] X Research source Fresh herbs, such as dill, parsley, or thyme. Chopped, sliced, or minced garlic. Lemon juice, lemon zest, or lemon slices."
    },
    {
      "title": "Season the broccoli while you are cooking it for something different.",
      "content": "Season the broccoli while you are cooking it for something different. Fill a saucepan with ¼ cup (60 milliliters) of water, 1 tablespoon (15 milliliters) of olive oil, 1 minced garlic clove, and ½ teaspoon of crushed, red pepper flakes. Add some salt and freshly-ground black pepper to taste, then bring the water to a boil over high heat. Cut 1 head of broccoli into florets and add it to the water. Cover the saucepan with a lid, cook for 3 minutes, then turn off the heat. Let the broccoli sit for 2 to 3 minutes more, then drain the water, and serve it. [6] X Research source"
    },
    {
      "title": "Season oven-roasted broccoli before you start cooking it.",
      "content": "Season oven-roasted broccoli before you start cooking it. Preheat your oven to 425°F (219°C). Lightly grease a baking sheet, then spread 24 ounces (700 grams) of broccoli florets over it. Add 3 tablespoons (45 milliliters) of olive oil, 4 minced garlic cloves, and some salt and freshly-ground black pepper. Toss the broccoli to coat, then bake it for 10 to 12 minutes. Garnish it with the juice of 1 lemon and ¼ cup (25 grams) of grated Parmesan cheese. [7] X Research source"
    },
    {
      "title": "Give it an exotic twist with garam masala and shredded coconut.",
      "content": "Give it an exotic twist with garam masala and shredded coconut. Just before you roast the broccoli, toss it with some garam masala and shredded coconut. You can use as much or as little as you'd like. You can roast broccoli on a baking sheet in the oven at 425°F (219°C) for 10 to 12 minutes. [8] X Research source"
    },
    {
      "title": "Get extra flavor presto with pesto!",
      "content": "Get extra flavor presto with pesto! Preheat your oven to 425°F (219°C). Toss some broccoli florets with just enough pesto sauce to lightly coat them, then spread them on a baking sheet. Bake them for 10 to 12 minutes, ten serve immediately. [9] X Research source"
    },
    {
      "title": "Add a little bit of fish sauce, lime juice, and brown sugar for a Vietnamese twist.",
      "content": "Add a little bit of fish sauce, lime juice, and brown sugar for a Vietnamese twist. In a small bowl, combine some fish sauce, lime juice, and a little bit of brown sugar. Roast your broccoli florets in the oven, then pour the mixture over it. Toss the broccoli to coat, then serve it. You can use as much of this seasoning as you want; you need at least enough to lightly coat the broccoli florets. [10] X Research source"
    },
    {
      "title": "Give it a hint of spice and flavor with Parmesan cheese and red pepper flakes.",
      "content": "Give it a hint of spice and flavor with Parmesan cheese and red pepper flakes. Chop the broccoli into florets first, then toss it with some dried bread crumbs, grated Parmesan cheese, and a pinch of red pepper flakes. Roast the broccoli on a baking sheet in the oven at 425°F (219°C) for 10 to 12 minutes. [11] X Research source"
    },
    {
      "title": "Try lemon juice, honey, and chili flakes for something zesty.",
      "content": "Try lemon juice, honey, and chili flakes for something zesty. In a small bowl, whisk together the lemon juice, honey, and chili flakes. Toss it with the broccoli florets, then sauté the broccoli until it turns bright green and crisp. This works well for both fresh and frozen broccoli. [12] X Research source"
    },
    {
      "title": "Give olive oil, garlic, and red pepper flakes a try for something spicier.",
      "content": "Give olive oil, garlic, and red pepper flakes a try for something spicier. Heat ¼ cup (60 milliliters) of olive oil in a sauté pan over medium-high heat. Add 3 tablespoons of minced garlic and 1 teaspoon of read pepper flakes, and cook for 1 minute. Add 2 heads of broccoli, chopped into florets, and cook for 3 to 4 minutes. Add a splash of water, soy sauce, or chicken stock, cover, and steam for 2 to 3 minutes. Transfer to a large bowl, and serve. [13] X Research source"
    },
    {
      "title": "Season sautéed broccoli with some Parmesan cheese for a tasty twist.",
      "content": "Season sautéed broccoli with some Parmesan cheese for a tasty twist. Mix together 3 tablespoons (45 grams) of grated Parmesan cheese and 1 teaspoon of brown sugar, then set it aside. Toss 1 pound (453 grams) of chopped, blanched broccoli florets into a large skillet with 2 tablespoons (30 milliliters) of olive oil, 1 teaspoon of red pepper flakes, ¼ teaspoon of salt, and ⅛ teaspoon of freshly-ground pepper. Cook for 1 to 2 minutes, then dust with the cheese and sugar mixture. Serve immediately. [14] X Research source"
    },
    {
      "title": "Give it an Asian twist with light brown sugar and soy sauce.",
      "content": "Give it an Asian twist with light brown sugar and soy sauce. Chop 1½ pounds (680 grams) of broccoli into florets, then cook it in about 3 tablespoons (45 milliliters) of water and 2 teaspoons of vegetable oil. In a small bowl, stir together the following: 1/4 cup (60 milliliters) water, 3 tablespoons (45 milliliters) soy sauce, 1 tablespoon cornstarch, 1 tablespoon light brown sugar, ¼ teaspoon red pepper flakes, and 3 finely-chopped garlic cloves. Add the sauce to the pan, and cook for 1 minute, or until the sauce thickens. Garnish the broccoli with 1 teaspoon of toasted sesame seeds, and serve."
    },
    {
      "title": "Season slow-sautéed broccoli with black pepper and grated Parmesan cheese.",
      "content": "Season slow-sautéed broccoli with black pepper and grated Parmesan cheese. Heat 6 tablespoons (90 milliliters) of olive oil in a skillet over medium heat. Once hot, add 1 1/2 large heads of broccoli, chopped into florets, and sauté for 2 minutes. Add some salt and pepper, and cook over low to medium-low heat for 20 minutes. Reduce the heat to the lowest possible, and cook for another 15 to 20 minutes. Transfer it to a serving bowl, then toss it with 3 tablespoons (45 grams) of grated Parmesan cheese, and some more salt and pepper."
    },
    {
      "title": "Season raw broccoli with lemon juice, olive oil, salt, and pepper.",
      "content": "Season raw broccoli with lemon juice, olive oil, salt, and pepper. Chop the broccoli into florets, rinse it, then place it into a salad bowl. Toss it with some lemon juice, olive oil, salt, and pepper. Plan on using 3 parts olive oil to 1 part lemon juice. Here are some other ideas for seasoning raw broccoli: Vinegar, especially balsamic or red wine vinegar Lemon juice Garlic powder Curry powder, cumin, or garam masala"
    },
    {
      "title": "Go simple with mustard, vinegar, and olive oil.",
      "content": "Go simple with mustard, vinegar, and olive oil. In a bowl, stir together 1 tablespoon of seeded mustard, 1 tablespoon (15 milliliters) of rice wine vinegar, and 2 tablespoons (30 milliliters) of extra virgin olive oil. Add a dash of salt and pepper, if needed. Toss the dressing over 1 head of broccoli, chopped into florets. To turn this into a salad, add 3½ ounces (100 grams) of crumbled feta cheese and a handful of pine nuts."
    },
    {
      "title": "Marinate raw broccoli overnight for a tasty treat.",
      "content": "Marinate raw broccoli overnight for a tasty treat. Chop 1 head of broccoli into florets. Rinse it, pat it dry, then put it into a large, re-sealable bag. Add 2 tablespoons (30 milliliters) of olive oil, 2 tablespoons (30 milliliters) of lemon juice, and ½ teaspoon of salt. Zip the bag shut, shake it to combine, then leave it in the fridge overnight."
    },
    {
      "title": "Try a creamy yogurt-based dip.",
      "content": "Try a creamy yogurt-based dip. In a small bowl, mix together some low-fat Greek yogurt with a pinch of paprika, fresh chives, and minced garlic. You can dip the broccoli florets directly into this, or use it as a rich and creamy dressing instead. Put the dressing into a bowl, and toss the broccoli florets in it until they are evenly-coated. How much yogurt and seasonings you use is entirely up to you! [15] X Research source"
    },
    {
      "title": "Try some mayonnaise diluted with milk.",
      "content": "Try some mayonnaise diluted with milk. Dilute some mayonnaise with enough milk until it is smooth, sort of like salad dressing. Pour it over chopped broccoli florets, then toss the broccoli to combine. You can turn this into a tasty salad by adding a handful of crumbled, fried bacon and some cashew nuts."
    }
  ]
}