{
  "url": "https://www.wikihow.com/Read-a-Book-in-a-Week",
  "title": "How to Read a Book in a Week",
  "steps": [
    {
      "title": "Choose a reasonably sized book.",
      "content": "Choose a reasonably sized book. Once you have an idea of how many hours per week will be required to complete your book, you’ll be more likely to choose a book that can be reasonably read within a week. Don’t choose a short story that can be read in 30 minutes; likewise don’t read an 800 page book that will take 13-14 hours to complete if you don’t have the time nor patience. Timing is especially relevant when you have a deadline such as an assignment for school. Also consider your history with reading. If you are used to reading only one 400 page book per month, try to choose a book that is a fraction of that size, like 150-200 pages. This allows your goal to be realistic while still challenging."
    },
    {
      "title": "Pick a high-interest book.",
      "content": "Pick a high-interest book. If you have a choice, pick a book that will really pique your interest instead of choosing a boring book that will only make you want to stop reading. Try one from your favorite author, read a review online, choose based on recommendations from others, or choose based on your personal interest in subjects. [1] X Research source Many people read a variety of subjects as a means to get better at being a human and being a life-long learner. [2] X Research source Try keeping a reading list of books that you want to read. Whenever you come across a book that interests you, update your list so you always have something interesting from which to choose."
    },
    {
      "title": "Read because you have to.",
      "content": "Read because you have to. There are many times people are unable to choose their reading material because it has been assigned to them for school, work, or other projects. Even if you find yourself hating the material, set a plan in motion to keep reading. Keep in mind that even if you don’t like something, you can always learn from it, which is usually the goal. Not only will it be preparing you for an immediate gain (like a good grade on a test), but it will also provide you with knowledge of a person or topic of which you were previously unaware. [3] X Research source Even if you feel the text doesn’t keep your attention, you can always focus on what worked or didn’t work, what the author did well and what they didn’t. Not only will this show a deep analysis of the text, but it will also help you in determining what books you prefer to read. Commit to your goal. If you are forced to read an assigned book within a week’s time, prepare yourself by truly committing to the goal. Always remind yourself of what depends on your completion of the book (a grade, a report, a presentation, etc.)."
    },
    {
      "title": "Make a routine.",
      "content": "Make a routine. This is especially helpful if you have an assignment due date or if you consider yourself a weak-willed individual. Having a routine in place will help you to stick with reading and help you reach your goal. Learning your reading speed will help you determine how many hours it will take you to complete the book. [4] X Research source ] Learn how fast you read. Determining how many words per minute (wpm) you are able to read will help you to determine what size book to choose as well as how much time per day should be spent reading. Time required can fluctuate based on the difficulty of the text, but having an idea of how long it will take will give you a measurable goal to work with. Choose the right time of day to read. You should always choose the time of day when you have the most energy so you’ll be more focused and more prepared to learn. Try treating it like an appointment and schedule time with yourself each day to read. Wake up, take a shower, and read while eating breakfast; or stop at your favorite coffee shop on the way to work and spend 30 minutes reading while enjoying your coffee. By putting everything in its “proper place,” you’ll be more likely to stick to your assigned task"
    },
    {
      "title": "Start reading.",
      "content": "Start reading. The more you read, the more you will enjoy reading. Try to sit alone and read for at least 10 minutes before taking a break. Before you know it, those 10 minutes will have passed and you’ll be hooked. [5] X Research source The more you learn to read for pleasure, the easier it becomes. Keep in mind the number of pages or chapters you need to read daily to meet your goal. After your goal of 10 minutes, aim for reading one to two chapters. By then, your interest will have been piqued and you’ll want to continue reading without checking the time. [6] X Research source"
    },
    {
      "title": "Use all your free time.",
      "content": "Use all your free time. Aside from your scheduled time, use your free time to read a few extra pages or chapters. Instead of checking Facebook or playing games on your phone, use the extra 5-10 minutes to catch up on your reading. Depending on how often you read, you can add an extra 30 minutes to 1 hour each day. This equates to an increase of about 5 hours per week. [7] X Research source Carry your book anywhere you go so you will always be prepared to read. Use your phone or an electronic reading device such as a Kindle to always have a book at your fingertips. [8] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you’re on a deadline, remove distracting apps from your phone for the week. [9] X Research source Even if you’re only able to read ahead a few pages, you’ll still be ahead of your goal which can boost your confidence and give you a rewarding feeling. [10] X Research source"
    },
    {
      "title": "Skim if needed.",
      "content": "Skim if needed. If you are falling behind in your reading and have a deadline to meet, feel free to skim over a few pages. Read the first few pages of the chapter and look for the main idea of the chapter and how it fits into the flow of the book. [11] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Look for any important plot points or new characters that will be helpful in later chapters. Skim headings and subheading to search for organization and main ideas. Read the first and last sentence of each paragraph. If you are able to abstract the meaning, move on; otherwise, it may be necessary to read the entire paragraph. [12] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Stick to it.",
      "content": "Stick to it. No matter what happens, don’t stop reading. If your deadline is approaching and you feel like you won’t reach your goal, continue pushing and read as much as you can. If you don’t have a deadline, continue your routine and determine how long it actually takes you to finish reading the book. This will help you in being able to realistically set future reading goals."
    },
    {
      "title": "Listen to your book as an audiobook.",
      "content": "Listen to your book as an audiobook. If you have a tough time keeping your eyes glued to the page, listen to your book instead. It may feel like cheating, but it's not--you're still getting the same information and activating the same language centers in your brain. You might just find it more fun, too! [13] X Research source"
    },
    {
      "title": "Avoid falling behind.",
      "content": "Avoid falling behind. Once you fall behind in your reading it is hard to catch up. Try not to “owe yourself one” or think that you’ll double up on time later. This can cause people to feel overwhelmed and helpless, and can cause people to give up instead of pushing forward. Try sticking to a schedule and routine to avoid falling behind. If you do fall behind, make a realistic plan about how to get back on track. Give up television for one evening or take your book to the gym to make up time. Be sure to control your emotions if you find yourself behind in your goal. Keep from feeling overwhelmed and hopeless by putting a realistic plan into action. [14] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source The best way to avoid this feeling is to stay ahead of your reading at all times."
    },
    {
      "title": "Limit distractions.",
      "content": "Limit distractions. Get rid of any outside source that has the potential to steal your attention away from your book. Turn off your laptop, close yourself in your bedroom, turn off the television, and leave your phone on the charger. [15] X Trustworthy Source Reading Rockets Online resource supported by PBS providing research-based strategies for assisting children to become confident readers Go to source Make this time an important priority over everything else."
    },
    {
      "title": "Don’t read when sleepy.",
      "content": "Don’t read when sleepy. If you read while tired, you’ll either fall asleep within a few pages or you won’t retain any important information. Instead of reading at the end of the day when you’re drained, try reading as early in the day as possible when your mind is still fresh and fully functioning. [16] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Being comfortable is a major part of reading; but being comfortable and tired is usually a recipe for disaster. Avoid reading in bed unless it has become habit or part of your winding down routine for bedtime."
    },
    {
      "title": "Avoid going into it without practice.",
      "content": "Avoid going into it without practice. Attempting to read a book in a week without previous practice can be a difficult task. By reading and sharpening your learning skills, you are able to practice your \"meta-skills\" and become more proficient in learning, reading, remembering and thinking. If possible, try to increase your reading skills before setting your goal to read a book in a week. This practice can be equated to cutting wood. If you have wood to cut you must first sharpen your saw when cutting the first log, not the last. You can build your skills by reading more (not just books), reading often, or trying a speed reading program."
    }
  ]
}