{
  "url": "https://www.wikihow.com/Screenshot-on-Acer",
  "title": "Simple Ways to Take a Screenshot on Acer",
  "steps": [
    {
      "title": "Press the ⊞ Win and ⎙ PrtScr keys at the same time.",
      "content": "Press the ⊞ Win and ⎙ PrtScr keys at the same time. The Print Screen key is in the upper right corner (next to the Pause/Break key). [1] X Research source This is the fastest and easiest method for taking full-screen screenshots on Acer. You can do this if you have Windows 10 or 11 and on any Acer computer or laptop. Find your screenshots in the Pictures folder. Screenshots captured with the Win + Prtsc keys are in a location like \" C:\\Users\\username\\Pictures\\Screenshots. \" If you don't see it there, try opening a program like Paint and pressing Ctrl + V to paste the image that's copied to your clipboard."
    },
    {
      "title": "Press ⎙ PrtScr and paste it into an image editor.",
      "content": "Press ⎙ PrtScr and paste it into an image editor. Once you press the Print Screen key, a copy of your full-screen capture will go into your clipboard. Then open an image editing program like Paint, paste your image, and save it."
    },
    {
      "title": "Press ⊞ Win+⇧ Shift+S.",
      "content": "Press ⊞ Win + ⇧ Shift + S . This will prompt the Windows Snipping Tool to open so you can capture the screen. [2] X Research source"
    },
    {
      "title": "Use your mouse to select the entire screen (if you want to capture everything on your screen).",
      "content": "Use your mouse to select the entire screen (if you want to capture everything on your screen). If you don't want to capture the entire screen, you can just select the portion that you want to screenshot."
    },
    {
      "title": "Open Paint and paste the capture.",
      "content": "Open Paint and paste the capture. You can paste by pressing Ctrl + V . Then you can save it by going to File > Save . [3] X Research source"
    },
    {
      "title": "Press ⊞ Win and type \"Snip & Sketch,\" then click the app search result.",
      "content": "Press ⊞ Win and type \"Snip & Sketch,\" then click the app search result. The Snipping Tool opens with a warning window that prompts you to use the new \"Snip & Sketch\" app instead. \"Snip & Sketch\" features a sketch tool that will be super useful if you want to markup the screenshot before sharing it. [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click New.",
      "content": "Click New . This will move the Snip & Sketch window so you can capture a screenshot. If you aren't ready immediately for the screenshot, you can click the down arrow next to New and select an option like Snip in 10 seconds ."
    },
    {
      "title": "Select a mode.",
      "content": "Select a mode. At the very top of your screen, you'll see 5 icons: Rectangular snip, freeform snip, window snip, fullscreen snip, and close snipping. Click a mode to use it. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Take the screenshot.",
      "content": "Take the screenshot. Depending on the mode you picked, you'll take screenshots in different ways. For the rectangular and freeform snips, use your mouse to select the area of the screen that you want to screenshot; for window and fullscreen snips click the screen you want to capture. [6] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Your screenshot will appear in the Snip & Sketch window so you can edit and save it."
    },
    {
      "title": "Edit and save your screenshot.",
      "content": "Edit and save your screenshot. You can use the icons above your screenshot preview to edit it by highlighting areas, drawing on it, or cropping the image. [7] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Save your work.",
      "content": "Save your work. Click the save icon (it looks like a floppy disk) from the lower right corner. From there, you'll need to choose a save location in your File Explorer and save it."
    },
    {
      "title": "Press ⊞ Win+G.",
      "content": "Press ⊞ Win + G . This opens the Xbox Game Bar overlay that will even open if you're playing a game in full-screen mode. [8] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source All Windows 10/11 computers come with Xbox Game Bar, so it's always an option if the other screenshot methods don't work for you!"
    },
    {
      "title": "Click the icon that looks like a webcam.",
      "content": "Click the icon that looks like a webcam. It displays \"Capture\" when you hover your mouse over it and prompts another window to open."
    },
    {
      "title": "Click the icon that looks like a camera.",
      "content": "Click the icon that looks like a camera. It'll snap a screenshot, but you can also press Win + Alt + PRT SCR to screenshot with Xbox Gaming Bar overlay using a keyboard shortcut. [9] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you get a pop-up that says features aren't enabled, click the prompt to enable those features. After that, you'll be able to screenshot anything! Including game-play. You can find your screenshots by clicking See my captures once you click the web camera icon."
    },
    {
      "title": "Press the Windows key icon and Volume Down.",
      "content": "Press the Windows key icon and Volume Down. Press these buttons at the same time. [10] X Research source The screen will flash to indicate that you've taken a screenshot. Tap the pop-up to view the screenshot or find it in your photos."
    }
  ]
}