{
  "url": "https://www.wikihow.com/Recover-a-Hacked-Facebook-Account",
  "title": "How to Recover a Hacked Facebook Account",
  "steps": [
    {
      "title": "Open Facebook.",
      "content": "Open Facebook. It's the dark-blue app with a white \"f\" on it. This will open the login page if you've been kicked out of your account."
    },
    {
      "title": "Tap Need Help?.",
      "content": "Tap Need Help? . This link is below the email address and password fields. A menu will appear. If you see Forgot Password? on this page, skip this step."
    },
    {
      "title": "Tap Forgot Password?.",
      "content": "Tap Forgot Password ? . It's in the menu. Tapping this takes you to Facebook's password reset site."
    },
    {
      "title": "Enter your email address or phone number.",
      "content": "Enter your email address or phone number. Tap the text box at the top of the page, then type in the email address or phone number that you use to log into your Facebook account. [1] X Research source If you never added your phone number to Facebook, you'll have to use your email address."
    },
    {
      "title": "Tap Search.",
      "content": "Tap Search . It's a blue button below the text box. This should bring up your Facebook account. [2] X Research source"
    },
    {
      "title": "Select an account recovery method.",
      "content": "Select an account recovery method. Tap one of the account recovery options at the top of the page: [3] X Research source via email - Facebook will send a reset code to your Facebook account's email address. via SMS - Facebook will text a reset code to your Facebook profile's registered phone number."
    },
    {
      "title": "Tap Continue.",
      "content": "Tap Continue . It's a dark-blue button below the account recovery options. Doing so will prompt Facebook to email or text a code to you."
    },
    {
      "title": "Retrieve your account's code.",
      "content": "Retrieve your account's code. Depending on your chosen reset method, this process will vary: Email - Open your email inbox, look for a message from Facebook, and note the six-digit code listed in the subject line. SMS - Open your phone's messages , look for a new message from a five- or six-digit phone number, and look for the six-digit code in the text's message."
    },
    {
      "title": "Enter the code.",
      "content": "Enter the code. Tap the \"Enter your six-digit code\" text box, then type in the six-digit code from the email or text. Make sure you don't wait more than a few minutes between receiving the code and entering it, or the code will be invalid. You can tap the Resend Code option to get a different code."
    },
    {
      "title": "Tap Continue.",
      "content": "Tap Continue . It's below the text box. Doing so will submit your code and take you to the next page."
    },
    {
      "title": "Check the \"Log me out of other devices\" box, then tap Continue.",
      "content": "Check the \"Log me out of other devices\" box, then tap Continue . This logs out your Facebook account on any computer, tablet, or phone on which it is currently logged in, which will log out the hacker as well."
    },
    {
      "title": "Enter a new password.",
      "content": "Enter a new password . You'll enter your new password in the text box near the top of the page."
    },
    {
      "title": "Tap Continue.",
      "content": "Tap Continue . This will replace your old password with your new password. You can now log into your Facebook account with your new password, and the person who hacked your account can no longer access it."
    },
    {
      "title": "Open the Facebook website.",
      "content": "Open the Facebook website. Go to https://www.facebook.com/ . This should open the Facebook login page."
    },
    {
      "title": "Click Forgotten password?.",
      "content": "Click Forgotten password? . It's a link below the \"Password\" text box in the upper-right side of the page. Doing so will take you to the \"Find your account\" page."
    },
    {
      "title": "Enter your email address or phone number.",
      "content": "Enter your email address or phone number. Click the text box in the middle of the page, then type in the email address or phone number that you use to log into the account. [4] X Research source"
    },
    {
      "title": "Click Search.",
      "content": "Click Search . It's below the text box. Doing so will find your account. [5] X Research source"
    },
    {
      "title": "Select an account reset option.",
      "content": "Select an account reset option. Click one of the following options: Send code via email - Sends a six-digit code to the email address that you use to log into Facebook. Send code via SMS - Sends a six-digit code to the phone number that's associated with your Facebook profile. Use my Google account - Allows you to log into your Google account to verify your identity. This bypasses the code reset process."
    },
    {
      "title": "Click Continue.",
      "content": "Click Continue . This will send the code to your email or messages. If you chose the Use my Google account method, a window will open."
    },
    {
      "title": "Retrieve your verification code.",
      "content": "Retrieve your verification code. Depending on your chosen account reset option, your next steps will vary: Email - Open your email inbox, look for an email from Facebook, and note the six-digit code in the subject line. SMS - Open your phone's messages , look for a text from a five- or six-digit phone number, and note the six-digit code in the text. Google account - Enter your email address and password."
    },
    {
      "title": "Enter the code.",
      "content": "Enter the code. Type the six-digit code into the \"Enter code\" field, then click Continue . This will take you to the password reset page. Skip this step if you used a Google account to reset your password."
    },
    {
      "title": "Enter a new password.",
      "content": "Enter a new password. Type a password into the \"New password\" text field near the top of the page. This will be the password you use to log into Facebook from now on."
    },
    {
      "title": "Click Continue.",
      "content": "Click Continue . Doing so saves your password change."
    },
    {
      "title": "Check the \"Log out of other devices\" box and click Continue.",
      "content": "Check the \"Log out of other devices\" box and click Continue . Doing so will log your account out on all computers, phones, and tablets—including the one from which your account was hacked—and take you to the News Feed on your current computer, phone, or tablet."
    },
    {
      "title": "Open Facebook's hacked account page.",
      "content": "Open Facebook's hacked account page. Go to https://www.facebook.com/hacked/ on a computer browser."
    },
    {
      "title": "Click My Account is Compromised.",
      "content": "Click My Account is Compromised . This blue button is in the middle of the page. Doing so will open a search page."
    },
    {
      "title": "Enter your email address or phone number.",
      "content": "Enter your email address or phone number. Click the text field in the middle of the page, then type in the email address or phone number that you normally use to log into Facebook. If you never added your phone number to Facebook, you'll have to use your email address."
    },
    {
      "title": "Click Search.",
      "content": "Click Search . It's below and to the right of the text field. This will prompt Facebook to find your Facebook account."
    },
    {
      "title": "Enter a password.",
      "content": "Enter a password. Type in the most recent password you can remember using for the Facebook account. Do so in the \"Current or Old Password\" text field."
    },
    {
      "title": "Click Continue.",
      "content": "Click Continue . It's a blue button near the bottom of the page."
    },
    {
      "title": "Select a valid reason.",
      "content": "Select a valid reason. Check one of the following boxes: I saw a post, message, or event on my account that I didn't create Someone else got into my account without my permission I don't see the right option on this list"
    },
    {
      "title": "Click Continue.",
      "content": "Click Continue . This will take you to the beginning of the hacked account recovery page. If you check one of the options not listed in the \"valid reason\" section previously, you'll end up on a Facebook help page instead."
    },
    {
      "title": "Click Get Started.",
      "content": "Click Get Started . It's in the lower-right side of the page. Doing so will evaluate your Facebook account for recent changes or activity. [6] X Research source"
    },
    {
      "title": "Click Continue.",
      "content": "Click Continue . This is in the bottom-right side of the page."
    },
    {
      "title": "Enter a new password.",
      "content": "Enter a new password. Type a new password into both the \"New\" text field and the \"Re-type New\" text field. [7] X Research source"
    },
    {
      "title": "Click Next.",
      "content": "Click Next . It's a blue button at the bottom of the page."
    },
    {
      "title": "Check the box next to your name, then click Next.",
      "content": "Check the box next to your name, then click Next . Doing so will select your current name as the account's name. If you don't see this option, skip this step."
    },
    {
      "title": "Edit any information that you didn't change.",
      "content": "Edit any information that you didn't change. Facebook will present you with several different posts, settings, and other changes that were made recently; you can approve these changes if you made them, or revert or delete them if someone else made them. If you're prompted to edit posts that you created, just click Skip at the bottom of the page."
    },
    {
      "title": "Click Go to News Feed.",
      "content": "Click Go to News Feed . This will take you to your News Feed. You should now have full access to your account again."
    }
  ]
}