{
  "url": "https://www.wikihow.com/Respond",
  "title": "How to Respond",
  "steps": [
    {
      "title": "Use casual language when you’re texting.",
      "content": "Use casual language when you’re texting. Emails, letters, and even in-person conversations can take on a much more formal structure. Because of the short, limited nature of text messaging, using more relaxed language is appropriate and conveys the sense that the conversation is more personal. [1] X Research source For example, you can use “U” instead of “you” to save space, type a message quicker, and to convey a relaxed tone. The rules of punctuation are often much more lenient in text messaging. For instance, a rigid adherence to comma usage can make the conversation feel stilted and formal. Don’t always assume that a text message conversation can be so informal, but if the other person is using informal language, you should reciprocate to make them feel comfortable."
    },
    {
      "title": "Ask open-ended questions",
      "content": "Ask open-ended questions to expand a conversation. If you want to keep the text conversation going , asking open-ended questions allows the other person to say more and express their opinion on something. Asking questions that prompt a short, yes or no response can cause a conversation to fizzle out. [2] X Research source For example, if you’re talking to someone about a business matter, you could ask them something like, “How do you feel about the new project?” If you want more insight into what a person is thinking about a subject, try texting them something like, “I agree with you, but why do you think that is?”"
    },
    {
      "title": "Avoid sending short or one-word replies.",
      "content": "Avoid sending short or one-word replies. Text messages should be relatively brief, but short or abrupt responses can convey a sense that you’re angry or upset with the other person. If you’re responding to a message from another person, get them engaged within the conversation and give them a true response that is at least a sentence or 2 long. [3] X Research source Sometimes, it’s perfectly acceptable to respond with “OK” if it makes sense in the context. But avoid the “K” reply, which can feel terse and rude."
    },
    {
      "title": "Use punctuation and emoticons to convey a tone.",
      "content": "Use punctuation and emoticons to convey a tone. Because of the impersonal nature of text messaging, people can interpret a tone or an emotion through the short language. You can clearly convey your meaning by including punctuation and emoticons if your message feels ambiguous. [4] X Research source For example, you could respond with, “Got it, thanks. :)” so the message doesn’t feel like you’re upset or being short with the other person. Sometimes a hard period can make it feel like you’re frustrated. For instance, it can sound much more relaxed to say, “No, it doesn’t” than it does to say “No. It does not.”"
    },
    {
      "title": "Review the message before you send it.",
      "content": "Review the message before you send it. Before you hit send on your message, take a quick second to look over it. Check for typos and to make sure that you’re conveying the information properly and using the right tone. [5] X Research source Once you send a message, you can’t take it back! So it’s best to take a quick look before you do."
    },
    {
      "title": "Don’t send multiple messages back to back.",
      "content": "Don’t send multiple messages back to back. Multiple notifications and a series of text messages can annoy and frustrate another person. Send a response message that contains everything you wanted to say, rather than sending multiple, short messages. [6] X Research source It’s okay to add another message if you forgot to include or you need to clarify something. If someone doesn’t reply to 2 messages in a row, they may not want to talk to you or they’re away from their phone. Either way, give them time and space to reply."
    },
    {
      "title": "Request a call if the conversation becomes too involved for text.",
      "content": "Request a call if the conversation becomes too involved for text. Text messages are meant to be short and concise. If the text conversation starts to get to be too much for you to adequately express your thoughts, ask the person if they can give you a call so you can elaborate or fully discuss the matter. [7] X Research source Try texting something like, “This would be easier to explain with a call. Can you give me a shout when you get a chance, thanks!”"
    },
    {
      "title": "Listen",
      "content": "Listen closely when someone is speaking to you. Whenever someone is talking to you, make eye contact with them and pay attention to what they’re telling you. It shows them that you’re listening to them and understand what they’re saying. [8] X Research source Focus your attention entirely on the speaker so they feel comfortable speaking to you. Lean in close or ask the person if you can move to a quieter area if you’re having trouble hearing."
    },
    {
      "title": "Pay attention to nonverbal cues from the person speaking.",
      "content": "Pay attention to nonverbal cues from the person speaking. Body language can say just as much if not more a person’s words. While someone is talking to you, observe their body language to help inform how you should respond. [9] X Research source For example, if someone keeps looking around or shifting on their feet, they may be nervous or scared. You may want to ask them if they’re alright rather than responding to what they say. Also listen to how they say what they’re saying. If their voice is loud or aggressive, they may be getting upset or angry about the conversation. You may need to take a different approach when you respond to avoid further escalating the situation."
    },
    {
      "title": "Avoid planning your response while someone is talking.",
      "content": "Avoid planning your response while someone is talking. If you get so excited or eager to respond before someone has finished speaking, they’ll notice and they may get upset. Wait until they’ve finished speaking and you’ve heard everything that they wanted to say before you start to plan your response. [10] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source It’s very rude to interject with your own thoughts while someone is speaking."
    },
    {
      "title": "Wait until they’re finished talking before you talk.",
      "content": "Wait until they’re finished talking before you talk. When you’re talking to someone, allow them to finish their thought before you respond. That way you have all of the facts and information that they wanted to convey so you can give a considered and informed response. [11] X Research source Sometimes people will add an additional bit of information after they finished their thought. For example, they may say something like, “Oh wait, I forgot to say something.” Let them finish saying what they wanted to say."
    },
    {
      "title": "Think about your response so you can say it with confidence.",
      "content": "Think about your response so you can say it with confidence . Before you give your response, take a brief moment to consider all of the information that was given to you. If you give a response that is ill-informed, it could show the person that you weren’t really listening to what they were saying. [12] X Research source Taking a moment to think about your response also ensures that you give an intelligent response."
    },
    {
      "title": "Ask questions if you need clarification or more information.",
      "content": "Ask questions if you need clarification or more information. If you couldn’t quite hear or understand what someone was saying, don’t try to respond with partial or an incorrect understanding. Ask them what they said or what they mean so you can give them a real response. If you’re unsure of someone’s intention or if you want to allow them to explain what they really mean before you respond, ask an open-ended question like, “What do you mean by that?” [13] X Research source It never hurts to ask someone to repeat themselves if you couldn’t hear or didn’t fully understand what they said."
    },
    {
      "title": "Speak directly and clearly when you respond.",
      "content": "Speak directly and clearly when you respond. After you’ve considered what was said to you and you’ve thought about what you want to say, speak clearly and confidently. Don’t use vague or contradictory language to try to sound smarter or clever. People appreciate sincerity , so give them a genuine response that shows them that you care and that you understand them. [14] X Research source Make sure they’re paying attention to you so you don’t have to repeat yourself. Recognize if someone else wants to speak and allow them room to talk as well. Allow the person to respond to what you’ve said as well. Don’t just walk away or end the conversation because you’ve had a chance to speak."
    },
    {
      "title": "Be ready for someone to disagree with you.",
      "content": "Be ready for someone to disagree with you. Even if you’ve thought about what you wanted to say, there is always the possibility that somebody will disagree with what you have to say. That’s okay! Just be prepared for someone to dispute or try to disparage you for what you have to say. [15] X Research source Keep a cool head and don’t lose your temper if someone is trying to provoke you. Allow someone to state their beliefs and opinions. Don’t try to force them to accept your views."
    },
    {
      "title": "Respond to an email within 48 hours.",
      "content": "Respond to an email within 48 hours. It’s important that you reply to an email in a timely manner as a matter of courtesy and professionalism. You don’t have to respond immediately, but you should reply within at least 2 days. [16] X Research source Even if the email wasn’t related to you or was sent erroneously, reply to the sender so they know that you’re not the right person."
    },
    {
      "title": "Use a professional salutation in an email response.",
      "content": "Use a professional salutation in an email response. Emails are often more formal than a text message or a phone call. Start your email response with a “Hello” or a “Hi” before the person’s name to start the email off on the right foot. [17] X Research source If the person you’re responding to prefers a certain greeting or if they ask you to call them by their name, then do what they ask. For example, if they prefer that you call them by a shortened version of their name, like “Bob” instead of “Robert” then use that nickname."
    },
    {
      "title": "Use exclamation points sparingly.",
      "content": "Use exclamation points sparingly. Your email response should use good grammar, spelling, and punctuation. However, overusing the exclamation point can make you seem disingenuous or overly excited. Avoid using them unless it’s appropriate. [18] X Research source An exclamation point is a great way to congratulate someone or convey excitement, but if you overuse them, they lose their effect."
    },
    {
      "title": "Avoid wacky fonts when you use email.",
      "content": "Avoid wacky fonts when you use email. Keep your font choices to a classic font so your email appears professional . Don’t use multi-color fonts or a typeface like Comic Sans when you send an email response. [19] X Research source A classic choice is to use a 10 or 12 point type with a font like Arial or Times New Roman."
    },
    {
      "title": "Pay attention to who you copy in your response.",
      "content": "Pay attention to who you copy in your response. It can oftentimes be useful to copy another person on a response so you can include them into a discussion. However, copying a supervisor or co-worker unnecessarily can really upset or anger the person you’re replying to. [20] X Research source If it’s necessary for you to include somebody else in the email chain, you can use the option to blind copy or “BCC” them."
    },
    {
      "title": "Decide who you want to reply to on a group email.",
      "content": "Decide who you want to reply to on a group email. If the appropriate response is to reply to everyone in the group message, then choose to “Reply All” when you send your response. But if you need to ask or explain a specific topic or issue to 1 person, then respond directly to that person. [21] X Research source If there’s a large group of people included on the email but you only need to respond to a few, just choose those people to respond to."
    },
    {
      "title": "Avoid sending an email to say thanks unless it’s necessary.",
      "content": "Avoid sending an email to say thanks unless it’s necessary. Short emails that don’t add to a conversation aren’t necessary. Unless the sender asks you to confirm that you have received and understand an email, sending an email saying “Thanks” is unnecessary and annoying. [22] X Research source"
    },
    {
      "title": "Proofread your email and confirm the recipient before you send it.",
      "content": "Proofread your email and confirm the recipient before you send it. A spelling or grammatical error can make your email seem unprofessional. Before you click send, take a moment to read over your response. Check for correct spelling and grammar and make sure you’re sending it to the right person. [23] X Research source Don’t rely on spell-checker to catch everything! Try reading your email out loud before you send it so you can hear how it sounds. Email apps or programs often autofill email addresses as you type in the recipient bar, which can lead to you accidentally sending an email to the wrong person."
    }
  ]
}