{
  "url": "https://www.wikihow.com/Repair-a-Faux-Leather-Sofa",
  "title": "How to Repair a Faux Leather Sofa",
  "steps": [
    {
      "title": "Peel and sand away any loose sections of faux leather.",
      "content": "Peel and sand away any loose sections of faux leather. Faux leather tends to peel, sort of like paint. If that happens, peel away most of the loose “leather” on top of the fabric backing. Next, use a fine-grit sanding sponge to smooth down any rough edges and bubbles. [1] X Research source Don't get too carried away here! You only need to peel away the coating that's within the damaged area."
    },
    {
      "title": "Apply a coat of interior latex house paint, then let the paint dry.",
      "content": "Apply a coat of interior latex house paint, then let the paint dry. For the smoothest finish, pour the paint into a tray, then apply it with a mini foam paint roller. Wait for the paint to dry completely before moving on. This could take a few hours, depending on the type of paint that you are using. [2] X Research source Bring 1 of the sofa cushions to the store so that they can color-match the paint for you. You can use \"fabric and vinyl\" spray paint as well. Apply 1 coat of gesso first, let it dry for 1 day, then apply the spray paint."
    },
    {
      "title": "Lightly sand the paint, then wipe away any dust.",
      "content": "Lightly sand the paint, then wipe away any dust. Get a piece of fine-grit sandpaper or a fine-grit sanding sponge. Use it to lightly sand the paint until the surface feels smooth, then wipe the dust away with a soft cloth. [3] X Research source This step will reveal some of the backing material under the paint. This is fine, and all part of achieving a smooth finish."
    },
    {
      "title": "Repeat the painting and sanding process up to 4 more times.",
      "content": "Repeat the painting and sanding process up to 4 more times. Each time you apply a coat of latex paint, you fill in the grain on the exposed backing. When you sand the paint, you smooth down any raised bumps. How many times you end up doing this really depends on how bad the damage is. [4] X Research source Keep painting, drying, and sanding the surface until it looks smooth."
    },
    {
      "title": "Buff the painted surface with a paste wax until it feels smooth.",
      "content": "Buff the painted surface with a paste wax until it feels smooth. This is important as it acts as a sealant for the paint and prevents it from getting sticky. Simply rub the paste wax on, then wipe it off with a soft cloth. Keep buffing the surface until it feels smooth and the wax is absorbed into it. [5] X Research source Paste wax can take up to 20 minutes to dry. Fortunately, you can do a few things to help it dry faster, as described in the next step."
    },
    {
      "title": "Dust baby powder or talcum powder over the wax.",
      "content": "Dust baby powder or talcum powder over the wax. This is not absolutely necessary, but it will help the wax set and dry faster. Use a powder brush to apply the powder, wait a few minutes for the powder to absorb into the wax, then dust the rest off. [6] X Research source"
    },
    {
      "title": "Purchase a vinyl upholstery repair kit.",
      "content": "Purchase a vinyl upholstery repair kit. Sometimes, these kits may be labeled for \"leather and vinyl,\" which is fine. An upholstery or fabric store may carry them, but your best bet would be to look online. These kits usually come with basic colors, such as black, white, red, yellow, and blue. The kit described in this method requires heat setting."
    },
    {
      "title": "Mix the paint colors until you match the color on your sofa.",
      "content": "Mix the paint colors until you match the color on your sofa. Some kits include a color mixing chart, which you can use as a reference. You may still have to lighten or darken the color to get the exact shade you need. [7] X Research source Most kits usually include a few empty pots for mixing and storing new colors. You can use these pots, or you can use a little dish instead."
    },
    {
      "title": "Brush the paint onto the affected area, overlapping the edges.",
      "content": "Brush the paint onto the affected area, overlapping the edges. Use the brush included with the kit to apply the paint over the exposed surface. Be sure to extend the paint by a few millimeters onto the edge of the faux leather as well; this will help seal it in better. If your kit did not come with a brush, use a stiff bristled brush; don’t use a soft, camelhair brush. This paint is heat-set, so it won’t dry until you apply heat to it."
    },
    {
      "title": "Apply the included texture relief paper to the paint, if desired.",
      "content": "Apply the included texture relief paper to the paint, if desired. Most kits will include some sort of textured paper that mimic the texture of leather and pleather. If you want to make the repair more seamless, you can use this paper. [8] X Research source Skip this step if your kit did not include this paper."
    },
    {
      "title": "Press the included heat tool against an iron until it turns hot.",
      "content": "Press the included heat tool against an iron until it turns hot. Most heat tools will look like a stick with a metal disk at one end. The easiest way to heat this tool is to press the metal disk against a hot iron. [9] X Research source If you don't have an iron, you can heat the tool up against a lit burner on your stove, or even a candle flame. If you lost the heat tool, you can try using a regular clothing iron on instead. Use a cotton, no-steam setting."
    },
    {
      "title": "Press the heat tool against the paper for 2 minutes.",
      "content": "Press the heat tool against the paper for 2 minutes. Move the tool around so that you distribute the heat evenly, then peel the paper away. If the texture is not up to your liking, apply the paper and heat tool again. [10] X Research source Keep the tool hot. Re-heat it a few times against the iron, especially if you can feel it cooling town. If you are using a regular iron, press the paper with just the tip; avoid touching the rest of the sofa. If this softens the faux leather too much, lower the heat."
    },
    {
      "title": "Repeat the process if needed.",
      "content": "Repeat the process if needed. Peel the paper away and take a look at your work. If the damage is still showing through, give it another layer of paint, then reapply the paper and heat tool. If the texture is not enough for you, then just replace the paper, and \"iron\" it with your heat tool again."
    },
    {
      "title": "Cut a denim patch a little larger than the tear.",
      "content": "Cut a denim patch a little larger than the tear. Depending on the shape of the tear, your patch may be square or rectangular; it just needs to be big enough to cover the entire tear, plus about 1 ⁄ 4 to 1 ⁄ 2 inch (0.64 to 1.27 cm) extra to each side. [11] X Research source Be sure to round the corners of the rectangle or square to help prevent buckling. This will go behind the tear and “leather,” so the color of the fabric does not matter. You can use an actual denim repair patch, or you can cut a patch from an old pair of jeans. If you don’t have any denim on hand, another sturdy fabric, like canvas, may work."
    },
    {
      "title": "Use tweezers to insert the patch into the tear.",
      "content": "Use tweezers to insert the patch into the tear. Avoid using your fingers for this, as they can cause the faux leather to warp. Simply use the tweezers to push and slide the denim unto the tear. [12] X Research source Run your fingers across the faux leather to either side of the tear. If you feel any bumps, smooth them out with the tweezers from the inside. Don't remove the sofa cover. Insert the patch through the slit into the sofa, then smooth it out."
    },
    {
      "title": "Apply a flexible glue to the back of the faux leather with a toothpick.",
      "content": "Apply a flexible glue to the back of the faux leather with a toothpick. Coat a toothpick with a strong, flexible glue, then slide it into 1 side of the tear. Move the toothpick around so that it coats the back of the faux leather, then repeat the process for the other side of the tear. [13] X Research source A flexible super glue made for fabric and vinyl will work fine for this; do not use regular super glue, however, as it dries too hard. You can also use fabric glue."
    },
    {
      "title": "Wipe off the excess glue, if needed, then press the tear together.",
      "content": "Wipe off the excess glue, if needed, then press the tear together. Use a paper towel or a soft cloth to wipe off any excess glue that may have leaked out from the tear. Next, using your fingers, press the edges of the tear together so that they are flush. [14] X Research source Work quickly so that the glue does not dry. You want to get everything into position before the glue sets. Depending on the brand of glue that you are using, you’ll have about 10 to 15 minutes to work with."
    },
    {
      "title": "Press down on the tear with a board until the glue dries.",
      "content": "Press down on the tear with a board until the glue dries. You can also use another hard, flat object such as a hardcover book or a tray. Make sure that it is rigid so that it doesn’t flex when you press down on it. Center the board over the tear, then lean against it. [15] X Research source Check the directions on the bottle to find out how long the glue needs to dry. Most glues are touch-dry within 10 to 15 minutes, which is all you need."
    },
    {
      "title": "Texturize the tear with super glue and a paper towel.",
      "content": "Texturize the tear with super glue and a paper towel. For this step, you actually do want to use regular super glue. Simply fill the crack with a little bit of super glue, then pat it with a scrunched up paper towel. The paper towel will help lift the excess glue as well as add some texture. [16] X Research source This step is not absolutely necessary. It is purely for aesthetic reasons."
    },
    {
      "title": "Coat the damage with vinyl paint, if desired.",
      "content": "Coat the damage with vinyl paint, if desired. It would be best if you used a specialized paint made for repairing vinyl, but if you can’t find any, then interior latex paint or acrylic paint will do. Apply the paint over the tear with a sponge brush, then dry it with a hair dryer. [17] X Research source Again, this step is for aesthetic purposes. If you just want to patch up the tear, then you don’t need to do this. If you texturized the tear with super glue, then you should apply the paint to help blend it in. Take one of the sofa pillows to the store with you so that you can match the color of the paint to it."
    },
    {
      "title": "Blend the tear in further with sanding and more glue, if needed.",
      "content": "Blend the tear in further with sanding and more glue, if needed. Take a look at your repair. The tear looks seamless, then you are good to go. If you see some bumps and ridges, sand the surface down with 220- to 325-grit sandpaper, then apply more super glue. Pat the glue with a paper towel, apply more paint, then heat-set the paint with a hairdryer. [18] X Research source Be careful with bonded leather, which is just a thin layer of paint on a fabric-like backing. If you sand outside the painted area, you risk damaging the surface."
    }
  ]
}