{
  "url": "https://www.wikihow.com/Pronounce-Les-Miserables",
  "title": "Pronounce Les Misérables Properly with This Step-By-Step Guide",
  "steps": [
    {
      "title": "Say \"lay.",
      "content": "Say \"lay. \" To pronounce \"Les Misérables\" like a true French person, start by saying the English word \"lay,\" which is very close to the pronunciation of the French word \"les.\" [1] X Research source If you want to be extra-accurate, try to pronounce \"lay\" a little \"breathier\" than you normally would as an English speaker; almost like a puff of air. French is a very \"breathy,\" nasal language. [2] X Research source Listening to a native French speaker can help you imitate this quality."
    },
    {
      "title": "Say \"me.",
      "content": "Say \"me. \" In French, the i can be pronounced with a long e sound, so the first syllable of \"misérables\" sounds much like the English word \"me.\" [3] X Research source Again, keep your pronunciation short and \"airy\" here."
    },
    {
      "title": "Say \"zeh.",
      "content": "Say \"zeh. \" The second syllable of \"misérables\" is pronounced similarly to how it would be in English. Use a soft s or z sound (as in the word \"zero\") and follow it with a short e sound (as in the word \"bed\"). [4] X Research source"
    },
    {
      "title": "Say \"rhab\" with an airy r sound at the top of the mouth.",
      "content": "Say \"rhab\" with an airy r sound at the top of the mouth. The r sound in French can be difficult for non-native speakers to master. Forget about changing the standard English r sound into French. Instead, make an entirely new sound here by following these steps: [5] X Research source After saying \"zeh\" (the previous syllable), let air flow through your throat. Without stopping, move the middle-back part of your tongue to the top of your mouth. Let the air flow narrow, but don't block it completely. Move your tongue back down. The sound should have a light, \"airy\" combination between the English r and h sounds. After the r , use the short o sound (like in the English name \"Rob\"), then end with a b ."
    },
    {
      "title": "Say a soft \"bluh.\"",
      "content": "Say a soft \"bluh.\" The final part of the word isn't as hard as dealing with the r , but it can still be a challenge. Sound out the syllable \"bluh,\" but, as before, very briefly and lightly. [6] X Research source Let your lips \"bounce\" off of each other a little here, giving the sound a \"jowelly\" quality (almost like the way Droopy the cartoon dog talks). Note that, as with \"Les,\" the final s in \"Misérables\" is not pronounced. French pronunciation takes some getting used to, but once you get it, it's not impossible—even for someone who's never spoken anything but English!"
    },
    {
      "title": "Avoid pronouncing the s at the end of either word.",
      "content": "Avoid pronouncing the s at the end of either word. When anglophones (the French term for \"English speakers\") try to say \"Les Misérables,\" they usually make one of a few mistakes. One of the most common is pronouncing the s at the end of \"Le s \" or \"Misérable s .\" It's \"lay meezerhabluh,\" not \"lez meezerhabluhs.\" [7] X Research source This is a rookie mistake for new French speakers, so don't give yourself away by falling for this easy slip-up! In French, an s at the end of a word is silent if the letter before it is a consonant or an e without an accent. [8] X Research source This means that there are other French words (like \"vis\") where you will pronounce the s at the end, so don't get too caught up on this rule."
    },
    {
      "title": "Avoid using a standard English r sound.",
      "content": "Avoid using a standard English r sound. Don't use the hard English r sound for \"misérables.\" [9] X Research source This sound doesn't exist in French, so putting it in \"Les Misérables\" will immediately out you as a non-French speaker. If you need more help with the French r sound, don't worry—it's usually what English speakers have the most trouble with, so there are lots of help materials online. For example, try this French pronunciation guide . The r sound examples are about halfway down the page."
    },
    {
      "title": "Avoid pronouncing the ending \"bluh\" very heavily.",
      "content": "Avoid pronouncing the ending \"bluh\" very heavily. French words have lots of endings that sound strange to English speakers. In \"Les Misérables,\" the final \"bluh\" syllable sounds like something should come after it to an English ear because in English words almost never end with \"bluh.\" This can lead English speakers to emphasize the \"bluh\" a little too much when it should remain light and airy. [10] X Research source Remember, you want it to sound like a jowelly puff of air—not like Dracula. Another good example is the French word \"chèvre\" (\"goat\"). It's tempting to pronounce it \"shever\" because in English words end with an \"errr,\" not a light \"ruh.\" The correct pronunciation is the latter: \"shevruh.\""
    },
    {
      "title": "Say \"lay.\"",
      "content": "Say \"lay.\" If you don't care about sounding like a real French speaker and just want to be able to describe the book and musical in English, the first step is to just say \"lay.\" [11] X Research source"
    },
    {
      "title": "Say \"mizz.\"",
      "content": "Say \"mizz.\" This sounds like the word \"miss,\" only with a soft s sound. The syllable should rhyme with the word \"whizz.\" You can omit the long e sound you'd normally use in French here if you’re not worried about perfecting your French pronunciation. [12] X Research source"
    },
    {
      "title": "Say \"er.\"",
      "content": "Say \"er.\" This syllable should rhyme with \"whirr\" or \"burr.\" Feel free to use the standard English hard r sound here, like what’s used in \"car\" and \"form.\" [13] X Research source"
    },
    {
      "title": "Say \"obb.\"",
      "content": "Say \"obb.\" The last syllable should rhyme with \"blob\" or \"mob.\" You don’t have to bother with the specific pronunciation of \"les\" if you’re not worried about sounding French. [14] X Research source"
    },
    {
      "title": "String the syllables together to say \"lay mizzerrobb.\"",
      "content": "String the syllables together to say \"lay mizzerrobb.\" That's all you need to pronounce \"Les Misérables\" in an anglicized way. Unless you're actually trying to speak proper French, there's no need to be ashamed of this anglicized pronunciation, as it's the way most English speakers choose to say the words. Even with this easier pronunciation in wide use, some English speakers still use different pronunciations of \"Les Misérables.\""
    },
    {
      "title": "“Les misérables” means “the miserables ones” in French.",
      "content": "“Les misérables” means “the miserables ones” in French. Deemed popular by Victor Hugo’s 1862 novel and the 1980 musical, “les misérables” has become a household phrase. The French phrase directly translates to “the miserable ones” or “the wretched.” In terms of the novel and musical, this alludes to the characters’ overall suffering. [15] X Research source"
    }
  ]
}