{
  "url": "https://www.wikihow.com/Put-Earrings-In",
  "title": "How to Put Earrings In",
  "steps": [
    {
      "title": "Smudge a cotton ball with rubbing alcohol.",
      "content": "Smudge a cotton ball with rubbing alcohol. It's very important to sanitize an piece of jewelry before you put it into your body. Even if you think that the earring is clean, there is still a chance that it might have picked up bacteria. Better to spend a minute cleaning the earrings than to risk a painful infection! [1] X Expert Source Stephanie Anders Piercing Specialist Expert Interview. 4 December 2019. If you don't have a cotton ball, you can use a tissue, toilet paper, or any clean piece of cotton. The cleaning fabric should be able to absorb the rubbing alcohol. If you don't have rubbing alcohol, use hydrogen peroxide or any other skin-safe disinfectant."
    },
    {
      "title": "Clean the earrings.",
      "content": "Clean the earrings. Wipe down the front and back pieces of each earring, and slide them into the alcohol-doused rubbing alcohol. Let the earring soak in the disinfectant for about 30 seconds. Then, remove the earring and wipe it dry with a clean cloth or tissue. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Make sure to clean the earrings before any time that you put them into your ears. You never know when a piece of jewelry will pick up harmful bacteria!"
    },
    {
      "title": "Consider lubing up the earrings.",
      "content": "Consider lubing up the earrings. Put some petroleum jelly or other petroleum jelly on the sharp end of each earring to make it slippery. This way, you may be able to more easily slide it into the ear. [3] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Pierce your ears",
      "content": "Pierce your ears ! Make sure that your ears are pierced before you try to put in an earring. If possible, visit a professional piercer at the mall or at a tattoo parlor. The earring will go in much more easily if you've already pierced the ear in question. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Make sure that the gauge of your piercing matches the gauge of the ring. If you are feeling especially bold, try piercing your ears at home . Be careful to sterilize all of your equipment. Consider asking a more experienced friend for help."
    },
    {
      "title": "Put the earring into your earlobe.",
      "content": "Put the earring into your earlobe. Slide the end into your ear, point-first, and slowly twist the earring as it goes in. You need to wiggle it around a bit to get it in and find the hole. Sometimes it's at an awkward angle! Push until the front of the earring is flush against your ear – or until the earring is as far in as you want it to go. [5] X Research source The earlobe is a common location for first earrings. It is a thick part but do not contain cartilage, it is ideal for dangling pieces, and it is one of the least painful places to put an earring through."
    },
    {
      "title": "Tug your earlobe if you have trouble getting the earring in.",
      "content": "Tug your earlobe if you have trouble getting the earring in. This will make the hole a bit wider, momentarily, so that the jewelry fits more easily. As you wear your earrings, the hole should gradually widen around the gauge."
    },
    {
      "title": "Clasp the earring.",
      "content": "Clasp the earring. Once the front half of the earring is all the way in, slide the back portion onto the metal hook. Slowly and gently bring the back half to the middle of the earring to seal it in place. Your earring should be ready to wear around! [6] X Research source Some earrings may not have a \"back half.\" If the earring is just a metal hook, then make sure that the hook is securely slid through your ear. If you are putting in a hoop earring, then the clasp—if any—is probably located on the hoop itself. Slide the hoop into your ear so that a smooth, unbroken portion makes contact with your ear. Then, close the ring and arrange it so that the clasp sits behind your ear."
    },
    {
      "title": "Make sure that each earring is all the way in.",
      "content": "Make sure that each earring is all the way in. Wiggle it back and forth to ensure that it is comfortable. Look in the mirror to check that the earrings look exactly how you want them to look. Make sure that the earrings are facing the right way. If you've put in a pair of big, decorative earrings, there may be a distinct \"front\" and \"back\" side. Check that the earrings match."
    },
    {
      "title": "Remove earrings",
      "content": "Remove earrings . Look in the mirror if it's your first time. Unclasp the back of the earring from the back of your ear, and pull it gently away from the front. Then, pull the earring from the front of your ear, twisting slightly. Let the hook slide smoothly out of your skin. [7] X Research source Consider disinfecting earrings after you wear them as well as before you put them in. If you leave the earrings out for too long, the piercing holes will close up. Put your earrings back in regularly to put off the need for another piercing session!"
    },
    {
      "title": "Wear earrings with sensitive skin.",
      "content": "Wear earrings with sensitive skin. You may find that the metal in some inexpensive earrings irritates your skin. Try putting a thin layer of clear nail polish onto the backs of the earrings to protect your skin. You may need to reapply after some use. Ask the manufacturer what type of metal was used in the earrings. Many people are allergic to nickel, and you may be more likely to find nickel in cheaper earrings."
    }
  ]
}