{
  "url": "https://www.wikihow.com/Not-Cry-at-a-Funeral",
  "title": "How to Not Cry at a Funeral",
  "steps": [
    {
      "title": "Concentrate on your breathing to help you calm down.",
      "content": "Concentrate on your breathing to help you calm down. Take deep, slow breaths through your nose if you feel yourself getting emotional. This will help you calm down and give you something concrete to focus on. You can even count your breaths if you want to really distract yourself from any sad feelings. [1] X Research source For example, try inhaling for 5 seconds, holding your breath for 5 seconds, and then exhaling your breath for 5 seconds until you feel more calm."
    },
    {
      "title": "Sip water to get rid of the lump in your throat.",
      "content": "Sip water to get rid of the lump in your throat. When you cry, the muscle at the back of your throat opens up and makes your throat feel as if it has a lump in it, which can feel uncomfortable. Taking sips of water will help get rid of the lump, and you'll gain better control of your crying. [2] X Research source Plan ahead and bring a small bottle of water with you if you think you might get emotional during the funeral."
    },
    {
      "title": "Relax your facial muscles so that you're not frowning.",
      "content": "Relax your facial muscles so that you're not frowning. Your facial muscles become tense when you cry, and it's natural for you to frown beforehand. Try to relax your frown and release all the tension from your face. You don't have to smile—you're at a funeral, after all—but relaxing your face will help keep you from crying. [3] X Research source If you feel your facial muscles tensing up, take a couple deep breaths and relax your shoulders. Relaxing other parts of your body will help you relax your face as well."
    },
    {
      "title": "Distract yourself with small amounts of pain.",
      "content": "Distract yourself with small amounts of pain. Doing things like clenching your fists, biting your lip, or pinching the skin in between your fingers will help redirect your emotions. Instead of sadness being the overwhelming feeling, the tiny amount of pain will help you refocus and gain control of your emotions. [4] X Research source These distractions shouldn't be incredibly painful—they're just meant to distract you."
    },
    {
      "title": "Pinch the bridge of your nose to help prevent you from crying.",
      "content": "Pinch the bridge of your nose to help prevent you from crying. Your tear ducts are at the bridge of your nose, so if you pinch this section of your face, you're much more likely to stop the flow of tears. Pinch the bridge of your nose for just a few seconds to see if it helps stop the crying. [5] X Research source You don't need to pinch your nose so hard that it hurts, but create slight pressure with your fingers."
    },
    {
      "title": "Blink your eyes and tilt your head back if you feel tears starting.",
      "content": "Blink your eyes and tilt your head back if you feel tears starting. Blinking several times when you feel tears starting to form, as well as tilting your head backwards, will help prevent the tears from falling. Blinking and tilting your head helps redistribute the tears so that you won't cry as easily. [6] X Research source If you've already started crying, this method won't work as well since the tears have likely already spilled."
    },
    {
      "title": "Think about something the person did that made you laugh.",
      "content": "Think about something the person did that made you laugh. Instead of feeling sad that the person is gone, try to remember a time when they made you laugh or smile. This could be something they said or did, or a special thing you both experienced. Thinking about something funny will help contain your tears and make you feel more positive. [7] X Research source For example, maybe the person gave you a funny birthday present or you both attended a hilarious play. Focus on these fun memories to help lift your spirits."
    },
    {
      "title": "Focus on positive thoughts or events in your life.",
      "content": "Focus on positive thoughts or events in your life. Think of the first positive or funny thing that comes to mind, whether it's a funny joke you heard recently, good news you received at work, or an event you're looking forward to. Focus on this positive thought for a minute or two, letting it distract you from your sadness so that you won't cry. [8] X Research source For example, maybe you helped a friend out recently and they were very appreciative, or you heard an uplifting song on the radio earlier in the day."
    },
    {
      "title": "Shift your gaze to another focal point.",
      "content": "Shift your gaze to another focal point. It's helpful to find something in the room to focus on to help relieve your tears. A stable, ordinary object works well, or you can focus on a section of the wall. When focusing on the thing, try to empty your mind and let any talking or noise fade. [9] X Research source If you find yourself starting to cry during the eulogy, try to focus on a corner of the podium or the back of a stranger's head to help you calm down. If necessary, you can also focus on an item super close to you, such as your handbag, fingernail, or jacket sleeve."
    },
    {
      "title": "Distract your mind with other thoughts.",
      "content": "Distract your mind with other thoughts. Try to keep your mind from focusing on the events of the funeral by distracting yourself with other thoughts or tasks. You can do things like sing song lyrics in your head or make a mental grocery list to prevent yourself from crying. You can also recite poetry in your head or list the things you need to do in the upcoming week."
    }
  ]
}