{
  "url": "https://www.wikihow.com/Signs-Someone-Is-Hiding-Their-Feelings-for-You",
  "title": "The Top 15 Signs Someone Is Hiding Their Feelings for You",
  "steps": [
    {
      "title": "The way someone looks at you can clue you in about how they feel.",
      "content": "The way someone looks at you can clue you in about how they feel. If they make intense eye contact when you two talk, they could be trying to connect with you on a deeper level. When you’re hanging out together, do you find yourself locking eyes with them for just a little bit longer than you do with other people? [1] X Research source Does the other person catch your eye from across the room and then quickly glance away? [2] X Research source The classic “look and look away” might be their subtle way of hinting, “Hey, I want you to notice me, but I’m not quite confident enough to be direct.” [3] X Research source"
    },
    {
      "title": "You’re one of their favorite people, so it’s natural that they light up around you.",
      "content": "You’re one of their favorite people, so it’s natural that they light up around you. To really gauge their interest, compare how they act around you to their mood around other people. If they seem happier the second you walk in, that’s a sign they care about you. [4] X Research source Play along and smile back if you’re interested."
    },
    {
      "title": "Have they started finding a ton of excuses to touch you?",
      "content": "Have they started finding a ton of excuses to touch you? Someone with hidden feelings might casually slide over towards you on the couch while you’re watching a movie, try to straighten your collar, or brush a stray piece of hair out of your face. We’ll even let you in on a psychology secret—the flirtiest places to touch someone are on their waist, shoulder, face, or forearm. [5] X Research source If you're comfortable with the physical affection, flirt back! Lean your head on their shoulder or briefly touch their arm when you're talking. If you're not comfortable with how they're touching you, just say something like, \"I'm not big into hugs or anything like that.\""
    },
    {
      "title": "Let’s be real, it’s hard to stay cool when you’re crushing.",
      "content": "Let’s be real, it’s hard to stay cool when you’re crushing. When you’re around, their heart might start racing, and they might act pretty awkward. Does your ultra-confident friend suddenly seem like a shy guy? Everyone gets nervous or shy when they’re around someone they like. [6] X Research source Here are a few classic signs of nervousness to watch out for: [7] X Research source Fidgeting Blushing A racing pulse Tripping up over words"
    },
    {
      "title": "Do they get dressed up to see you or try to impress you?",
      "content": "Do they get dressed up to see you or try to impress you? When someone has feelings for you, they’ll want to present the best possible version of themselves. They might try to look snazzier than usual, brag about their big promotion, or cook a magazine-worthy meal when you come over. Watch out for “preening” behavior. If someone’s consistently fidgeting with their hair or fussing with their appearance, that’s a telltale sign of attraction."
    },
    {
      "title": "Gift-giving and acts of service are “love languages” for a reason.",
      "content": "Gift-giving and acts of service are “ love languages ” for a reason. When someone goes out of their way for you, it means they care deeply about you. People have different ways of expressing how they feel, and someone hiding their feelings for you might show affection through gestures rather than words. [8] X Research source They might show up with your favorite takeout, surprise you with a custom playlist (that just happens to be full of love songs), or offer to help you out with small tasks whenever you need it. These romantic gestures mean that this person is thinking of you often, even when you're not around. Reader Poll: We asked 1179 wikiHow readers, and 69% agreed the surest sign of developing deeper feelings for someone is constantly thinking about them and fantasizing about being together . [Take Poll]"
    },
    {
      "title": "Trust your gut to tell a flirty compliment from a friendly compliment.",
      "content": "Trust your gut to tell a flirty compliment from a friendly compliment. While it’s totally normal for friends to hype each other up, pay attention to how often this person compliments you. Does it seem like they compliment you more often than they compliment others? Are their compliments really specific and thought out? [9] X Research source If they compliment your physical appearance, that could mean they’re into you in a more-than-friends kind of way. [10] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source Someone who has feelings for you might also speak highly of you to other people when you’re not around. They might get ultra nervous when they give you a compliment! If they can’t look you in the eye while telling you how incredible you are, that could mean they’re hiding feelings for you."
    },
    {
      "title": "Is this person the friend you turn to when you need a morale boost?",
      "content": "Is this person the friend you turn to when you need a morale boost? When you need a shoulder to cry on, they’re right there. When you need a ride to the airport at 5 AM, they show up with coffee. [11] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source Emotional support is a key part of friendship, but it’s also the secret building block to deep romantic connection. [12] X Research source When you two already have a close bond, there’s definitely a potential they might have developed deeper feelings. When someone says “I’m here for you,” it’s their way of saying that they want to be part of your life. [13] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source If someone close to you seems especially protective of you, they might have deeper feelings."
    },
    {
      "title": "When someone has feelings for you, they’ll want to know everything about you.",
      "content": "When someone has feelings for you, they’ll want to know everything about you. The more personal the questions get, the more likely they’re interested in you. Listen for open-ended questions about your personality, your beliefs, and your values. [14] X Research source They might ask questions to get a read on what you think about them, like, \"What was your first impression of me?\" If they're feeling bolder, they might ask questions about your love life. For instance, they might ask, \"Hey, just wondering, what's your type?\" or \"What are your dealbreakers in a relationship?\""
    },
    {
      "title": "Someone with hidden feelings might latch onto things you like to feel closer to you.",
      "content": "Someone with hidden feelings might latch onto things you like to feel closer to you. If this person seems to have a razor-sharp memory for all your favorite movies, restaurants, and activities, they’re likely interested in you. Hanging onto all those details gives them topics to talk about with you and new ways to impress you with their knowledge. [15] X Research source For example, someone who likes you might start listening to the obscure band you said you liked or watch all 5 seasons of the show you just briefly referenced."
    },
    {
      "title": "Even when you’re not together IRL, they’ll want to stay in touch.",
      "content": "Even when you’re not together IRL, they’ll want to stay in touch. When it comes to texting, they might have a lighting-fast response time. After all, you’re one of the most important people in their life. [16] X Research source They might hang around your social media page, quickly like your posts, and leave comments. On the flip side, if they’re really shy, you might notice that they view all your stories, but never like or comment on your posts. Look at the timing of their texts, too. “Good morning” and “good night” texts show romantic interest since you’re probably the first and last person on their mind. [17] X Research source"
    },
    {
      "title": "A little jealousy is normal when someone feels a strong connection with you.",
      "content": "A little jealousy is normal when someone feels a strong connection with you. Check if they seem to shut down or get upset when you hang out with other people or bring up potential love interests. [18] X Research source Here are a couple more signs of jealousy: [19] X Research source They might be overly critical about other romantic interests in your life or avoid asking you about your love life altogether. They’ll have trouble being happy or supportive of you when you’re romantically seeing other people. They’ll act bummed out in front of you and your romantic partner, but they’ll act normal once your partner leaves."
    },
    {
      "title": "Someone who’s hiding their feelings will gravitate towards you.",
      "content": "Someone who’s hiding their feelings will gravitate towards you. They might take a seat right next to you or stand close to you in a crowd. If they’re feeling bold, they might pull you away from a group to talk to you privately. Notice if they pay attention to what you’re saying more than they tune into other conversations. [20] X Research source When someone who likes you pops up nearby, they’ll usually try to start a conversation with you or catch your eye to make sure you know they’re around. If they don’t try to announce their presence in some subtle way, it might be a coincidence that you two keep winding up close to each other."
    },
    {
      "title": "Wanting “alone time” with you is a good sign someone has romantic feelings.",
      "content": "Wanting “alone time” with you is a good sign someone has romantic feelings. They’ll plan activities with just the two of you—and those activities might feel suspiciously like fun date ideas. If you suggest a group activity instead, they might even seem a little disappointed. [21] X Research source A person hiding their feelings will try and spend as much time with you as possible. For instance, if you plan to go on a hike together, they might suggest grabbing coffee afterwards to extend the amount of time they get with you. They’ll tend to make time for you, no matter how busy they are."
    },
    {
      "title": "Someone with hidden feelings might act hot and cold with you.",
      "content": "Someone with hidden feelings might act hot and cold with you. One minute, they might want to stay up all night texting you, and the next, they don’t seem to want to hang out at all. If someone’s not sure whether you have feelings for them, they might distance themselves to avoid getting hurt. If you have feelings for this person and think they might feel the same way, let them know! You can say something like, “Hey, I have feelings for you, and I’m curious if you feel the same way.” [22] X Research source If you’re not interested in being with them, be careful not to lead them on. Give them space and time to work through their feelings."
    }
  ]
}