{
  "url": "https://www.wikihow.com/Reset-Your-Apple-ID",
  "title": "How to Reset Your Apple Account Password When You've Forgotten It",
  "steps": [
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. If you’ve forgotten your Apple Account password, you can easily reset it from your device. This method will work on a trusted iPhone, iPad, Apple Vision Pro, or Apple Watch. [1] X Research source If you’re already logged in with your Apple Account, this method will work whether you remember your old password or not."
    },
    {
      "title": "Tap your name.",
      "content": "Tap your name. If you’re logged in with the Apple Account you want to reset, you should see your name at the top of the Settings menu. Tap on it to access your account settings."
    },
    {
      "title": "Select Sign-In & Security.",
      "content": "Select Sign-In & Security . It’s near the top of the menu."
    },
    {
      "title": "Choose Change Password.",
      "content": "Choose Change Password . This is under the SECURITY header. You may be prompted to authenticate with Face ID, Touch ID, or your device’s passcode."
    },
    {
      "title": "Enter your new password.",
      "content": "Enter your new password. It needs to be at least 8 characters long and include at least one number, one uppercase letter, and one lowercase letter. Enter the same password twice in the two text fields, then tap Continue . A window will pop up asking if you want to sign out of other devices using the same Apple Account. If you think someone else might know your old password, it’s a good idea to sign out of your other devices. Once you’ve changed your password, you’ll get a notification in your email that there has been an update to your Apple Account."
    },
    {
      "title": "Use the “Forgot Password?”",
      "content": "Use the “Forgot Password?” option on a new or logged-out device. If you’re logged out of your Apple Account or trying to log in on a new iPhone or iPad, the process is slightly different. Open Settings and tap Apple Account at the top of the menu. Select Sign in manually . Tap Forgot password? . Follow the instructions to finish resetting your password. You may need to enter a code that will be sent to a trusted device."
    },
    {
      "title": "Click the Apple menu.",
      "content": "Click the Apple menu. If you’re signed into the Apple Account you want to reset, you can easily do it from your Mac’s Settings, even if you don’t remember your old password. First, click the Apple icon in the top left corner of your screen. [2] X Research source"
    },
    {
      "title": "Select System Settings….",
      "content": "Select System Settings… . It’s at the top of the menu."
    },
    {
      "title": "Click your name.",
      "content": "Click your name. You’ll see this at the top left side of the System Settings window. This will take you to the settings for your Apple Account."
    },
    {
      "title": "Click Sign-In & Security.",
      "content": "Click Sign-In & Security . This option is near the top of the window."
    },
    {
      "title": "Select Change Password….",
      "content": "Select Change Password… . This is next to the Password header about a third of the way down in the menu. If you’ve changed your password before, you’ll see the date of the last change here."
    },
    {
      "title": "Enter the password for your Mac.",
      "content": "Enter the password for your Mac. A window will pop up asking you to enter your password to give permission to make changes to your Apple Account. Enter it and click Allow ."
    },
    {
      "title": "Type in your new password twice.",
      "content": "Type in your new password twice. Type it once in the New Password field, then again in the Verify field. Your password needs to be at least 8 characters long and must include at least one number, one uppercase letter, and one lowercase letter. Click Change when you’re done."
    },
    {
      "title": "Select whether to sign out on your other devices.",
      "content": "Select whether to sign out on your other devices. If you’re resetting because you suspect someone else has access to your account, it’s a good idea to sign out on your other devices. You’ll have to sign back in on each device where you want to use your Apple Account. Once you’ve made your selection, you’ll get an email letting you know you updated your Apple Account."
    },
    {
      "title": "Enter your Mac’s password.",
      "content": "Enter your Mac’s password. A window will pop up asking you to enter the password for your Mac. This will allow you to continue to make changes in Settings if you need to. Enter it and click Continue ."
    },
    {
      "title": "Use the “Forgot password” option on a new Mac.",
      "content": "Use the “Forgot password” option on a new Mac. If you’re using a new Mac or you’re logged out of your Apple Account, you can still reset your password. Here’s how: Go to Apple menu > System Settings > Sign in . Click Forgot password . Follow the prompts to reset your password. You may need to access a verification code that will be sent to another trusted device."
    },
    {
      "title": "Visit https://iforgot.apple.com/.",
      "content": "Visit https://iforgot.apple.com/ . This website will help you reset your password and restore your Apple Account. You can use this method from any device. You just need access to a web browser. If you know your Apple Account password and want to change it, you can do so by going to https://account.apple.com/ and signing in. [3] X Research source Select Sign-In and Security in the left-hand menu, then click Password . Enter your current password, then enter and verify your new password. Click Change Password ."
    },
    {
      "title": "Click Reset Password.",
      "content": "Click Reset Password . It’s the blue button at the bottom of the page."
    },
    {
      "title": "Enter the email or phone number associated with your account.",
      "content": "Enter the email or phone number associated with your account. Put this information in the first text field on the page. If you’re on an iPhone or iPad that’s already logged into an Apple Account, you may be able to skip the next few steps and go straight to entering your new password: [4] X Research source Just tap Reset My Password at the bottom of the screen, then verify your identity with your Face ID, Touch ID, or device passcode. On the next screen, enter your new password twice, just like you would if you were changing your password in Settings. If you’re on a computer or a non-Apple device, continue with the rest of this method."
    },
    {
      "title": "Type the code in the grey box and click Continue.",
      "content": "Type the code in the grey box and click Continue . Below the text field for your email address or phone number, you’ll see another text field. A box next to it will display a combination of letters and numbers. Enter the code into the second text field, then click or tap the Continue button."
    },
    {
      "title": "Enter your phone number.",
      "content": "Enter your phone number. On the next screen, you’ll be asked to enter the phone number that’s linked to your Apple Account. Click Continue after typing in the number."
    },
    {
      "title": "Check your Apple devices for a notification.",
      "content": "Check your Apple devices for a notification. If you’re logged in on multiple devices, you may get the notification on more than one of them. Click or tap the notification to view it. If you don’t have a trusted Apple device handy, you’ll need to attempt signing in on another Apple device, then clicking or tapping the Forgot Password option. Follow the prompts to continue resetting your password. If you don’t have access to any Apple device, you may be able to get someone else’s help resetting your account. Otherwise, you will need to use account recovery . You may need to wait several days while Apple Support reviews your request before you can reset your password. [5] X Research source"
    },
    {
      "title": "Click or tap Reset Password.",
      "content": "Click or tap Reset Password . The notification will ask you if you want to reset the password for your Apple Account. If so, click or tap Reset Password . You may be prompted to verify with the password, passcode, Face ID, or Touch ID you use to unlock your device."
    },
    {
      "title": "Enter your new password.",
      "content": "Enter your new password. Enter and verify your new password. When you’re finished, tap Change or Continue . Your password needs to be at least 8 characters long and must include at least one number, one uppercase letter, and one lowercase letter. When you’re done, you’ll get a notification letting you know that your Apple Account has been updated. You may also see a message asking whether you want to log out of your other Apple devices. It’s a good idea to do so if you’re resetting because you think someone else has access to your Apple Account."
    },
    {
      "title": "Open the Apple Support app on a friend’s device.",
      "content": "Open the Apple Support app on a friend’s device. If you can’t access any of your own Apple devices, you can reset your account on a borrowed device. Don’t know anyone with an Apple device? You can use one at your nearest Apple store. [6] X Research source You will need to have access to a trusted phone number associated with your Apple Account. This is something you may have set up if you have two-factor authentication enabled for your account. If the device you’re using doesn’t have the Apple Support app, you or the owner can download it from the App Store."
    },
    {
      "title": "Tap Reset Password.",
      "content": "Tap Reset Password . Scroll down to find this in the Support Tools section."
    },
    {
      "title": "Select Help Someone Else.",
      "content": "Select Help Someone Else ."
    },
    {
      "title": "Enter your Apple Account email or phone number.",
      "content": "Enter your Apple Account email or phone number."
    },
    {
      "title": "Tap Continue.",
      "content": "Tap Continue . From here, follow the prompts to continue the reset process. You may be prompted to enter a verification code sent to your trusted phone number. Don’t worry—any sensitive information that you enter won’t be stored in the device you’re using."
    },
    {
      "title": "Try this method if you’ve [Add-a-Recovery-Contact-to-Your-Apple-ID set up a recovery contact].",
      "content": "Try this method if you’ve [Add-a-Recovery-Contact-to-Your-Apple-ID set up a recovery contact]. If you’re using iOS 15 or later and you have two-factor authentication set up, you have the option to designate someone as your recovery contact. You can use this person’s help to reset your account if you aren’t able to use any of the other methods. If you haven’t set up a recovery contact and would like to do so in the future, here’s how: [7] X Research source On an iPhone or iPad, go to Settings > [your name] > Sign-In & Security > Recovery Contacts . Tap the blue Add Recovery Contact button and follow the prompts to add and verify your chosen contact. On a Mac, go to Apple Menu > System Settings > [your name] > Sign-In & Security > Recovery Contacts > Add Recovery Contact . Select a contact and click Continue . If you’re part of a Family Sharing group, you can add members of the group automatically. Other contacts will need to accept a request sent to their device."
    },
    {
      "title": "Attempt to unlock or reset your account.",
      "content": "Attempt to unlock or reset your account. If you’re unable to reset your password or access your Apple Account using other methods, you’ll eventually be offered the option to get help from a recovery contact."
    },
    {
      "title": "Provide any requested information.",
      "content": "Provide any requested information. Before your recovery contact can help you, you’ll need to answer some security questions or provide information to verify your identity. Once you’ve done this, you’ll be prompted to reach out to your recovery contact. [8] X Research source"
    },
    {
      "title": "Ask your recovery contact for a code.",
      "content": "Ask your recovery contact for a code. Once you’re ready for your recovery code, call your contact or talk to them in person. Here’s what they’ll have to do: On an iPhone or iPad, your contact will go to Settings > [their name] > Sign-In & Security > Account Recovery . They’ll tap your name, then select Get Recovery Code . On a Mac, ask your contact to go to Apple Menu > System Settings > [their name] > Sign-In & Security > Account Recovery . They need to click on your name in the Account Recovery For section, then click Get Recovery Code ."
    },
    {
      "title": "Enter the code on your device.",
      "content": "Enter the code on your device. Have your recovery contact read the code to you. Enter it on your device, then follow the instructions to reset your password."
    },
    {
      "title": "Try this method as a last resort.",
      "content": "Try this method as a last resort. Account recovery takes longer and is more complicated than other methods for resetting your Apple Account password. Try this method if nothing else works, including getting help from a friend or family member. [9] X Research source"
    },
    {
      "title": "Start the password reset process.",
      "content": "Start the password reset process. To get to account recovery, you’ll need to begin the process of resetting your password either from your device or from https://iforgot.apple.com/ . If you reach a point where you’re not able to continue—e.g., because you don’t have access to an Apple device, a recovery contact, or a trusted phone number—you will be offered the option to begin account recovery."
    },
    {
      "title": "Provide any requested information.",
      "content": "Provide any requested information. You may be asked to provide information to verify your identity. For instance, you might need to provide a credit card number or use a verification code sent to your primary email address. Once you start the account recovery process, shut off any other devices signed into the same Apple Account. Avoid using the device where you started the recovery process until you’ve finished recovering your account."
    },
    {
      "title": "Wait for the recovery process to finish.",
      "content": "Wait for the recovery process to finish. It might take a few days for Apple to recover your account. You should get an email within 72 hours of submitting your request with details about when you can regain access to your account. Once that period is over, you’ll get a text or automated phone call with instructions for completing the recovery process. In most cases, there’s no way to speed up account recovery. If you don’t get the text or phone call, go to https://apple.com/recover after the recovery period elapses, then follow the instructions there to finish recovering your account. To check on the status of your recovery request, visit https://iforgot.apple.com/ and enter the email address or phone number for your Apple Account. If you remember your password, you can log into your Apple Account at any time to cancel the recovery process."
    },
    {
      "title": "On an iPhone or iPad:",
      "content": "On an iPhone or iPad: You can easily change the primary email associated with your Apple Account from your device’s settings. Here’s how: [10] X Research source Open the Settings app and tap your name at the top of the menu. Select Sign-In & Security . Tap your primary email address at the top of the menu. To remove the address completely, tap Remove from Account . If you want to assign a different address as your primary, toggle off Primary Email . When prompted, choose a different primary email address from the emails already associated with your account, or add a new one. Follow the steps to verify your new email address. You’ll get an email with verification instructions. If you’re using iOS 18 or later and the only email address associated with your Apple Account is an iCloud address, you’ll have the option to change your iCloud address. You can’t remove this address—only change it. You’ll continue to receive messages at the new address."
    },
    {
      "title": "On the web:",
      "content": "On the web: If you don’t have access to a trusted Apple device, such as an iPhone or iPad, you can change your Apple Account primary email on the web. If you only have an iCloud email address associated with your account, you won’t be able to change it this way. Visit https://account.apple.com/ in a browser. Log in with your Apple Account and click Sign-In and Security . Click Email & Phone Numbers . Click the Remove button (it looks like a - ) next to your primary email. Follow the prompts to enter and verify a new primary email address."
    }
  ]
}