{
  "url": "https://www.wikihow.com/Read-Tarot-Cards",
  "title": "How to Read Tarot Cards",
  "steps": [
    {
      "title": "First, pick a deck that speaks to you.",
      "content": "First, pick a deck that speaks to you. One of the most widely used and most widely taught is the Rider-Waite Tarot , which is a great option for your first tarot deck. Still, a tarot deck must speak to you specifically, so take your time to look through different options so you can find the best deck for you. For example, The Modern Witch Tarot Deck is an option that features modern and contemporary artwork based on the original tarot imagery. Other fun options include The Nightmare Before Christmas Tarot Deck , which includes illustrations based on the classic movie, and the Mystic Mondays Tarot , which has a more abstract aesthetic."
    },
    {
      "title": "Learn about how the tarot deck works.",
      "content": "Learn about how the tarot deck works. The 78 cards of the tarot deck are split into two groups: the major arcana and the minor arcana. The first 22 cards of the deck make up the major arcana, and they represent major life events. The remaining 55 cards make up the minor arcana, and they deal with more day-to-day matters. [1] X Research source Work on memorizing the cards and their meanings so that you’ll be able to identify and interpret them in a reading. This will take time, so be patient with yourself and don’t get discouraged!"
    },
    {
      "title": "The Major Arcana",
      "content": "The Major Arcana The major arcana is made up of the first 22 cards in the tarot deck. These cards are arranged in a specific order, illustrating the journey you take over the course of your life. The journey starts with The Fool (young, pure energy in spirit form), then moves through the many stages and cycles of life. Finally, the journey ends with The World card (completion, achievement, and the end of our life cycle). [2] X Research source The major arcana deals with archetypes, major life events, and overarching themes. 0: The Fool: New beginnings, purity, journies, young spirits 1: The Magician: Self-confidence, resourcefulness, inner ability 2: The High Priestess: Perceptiveness, self alignment, internal monologue 3: The Empress: Kindness, loveliness, romance, connection, harmony 4: The Emperor: Ruling, strength, structure 5: The Hierophant: Guidance, messages from above, tradition 6: The Lovers: Relationships, choices, dedication 7: The Chariot: Overcoming, positive results, personal triumph 8: Strength: Victory and success at the end of a long personal battle 9: The Hermit: Introspection, intelligence, solitude 10: Wheel of Fortune: Changing of circumstances, power shifts 11: Justice: Truth, equality, laws 12: The Hanged Man: Big changes, releasing things, waiting 13: Death: Closing doors, opening doors; cycles 14: Temperance: Harmony, patience, satisfaction 15: The Devil: Weakness, bad luck, fear, addiction 16: The Tower: Falling to pieces, weak foundations, endings 17: The Star: Hope, healing, positivity 18: The Moon: Deep-seated internal feelings and truths, mysteriousness 19: The Sun: Happiness, energy, starting on the right path 20: Judgment: Transforming into your best self, growth 21: The World: Triumph, a happy ending, fate Which tarot card are you? Take this quiz to find out which card of major or minor arcana best fits your essence."
    },
    {
      "title": "The Minor Arcana",
      "content": "The Minor Arcana The minor arcana deals with more day-to-day circumstances, and it offers advice on how to navigate them. It's made up of four suits, each associated with one of the elements: Wands (Fire), Cups (Water), Pentacles (Earth), and Swords (Air). The suits each include cards numbered ace through 10, as well as 4 court cards (page, knight, queen, and king). [3] X Research source Each suit represents a different aspect of life: The suit of wands represents passion, drive, and creativity. The suit of cups is associated with emotions, intuition, and relationships. The suit of pentacles deals with the material world, stability, and nature. The suit of swords deals with the mind, intellect, and communication. [4] X Research source"
    },
    {
      "title": "Use a tarot guidebook or your intuition to decode the cards.",
      "content": "Use a tarot guidebook or your intuition to decode the cards. A well-written guidebook will help you understand the basics of tarot so that you can get started with your readings. Some great options include How to Read Tarot: A Modern Guide by Jessica Wiggan, and The Ultimate Guide to Tarot Card Meanings by Briget Esselmont. Apply the meaning behind the cards you draw to your questions or readings. Look at each card and decide what you think it means. Don't worry about being right—just go from your gut. Then look in your book and see what it says. Pay attention to where your interpretations diverge, and where they’re similar. This will take the focus off of pure memorization and the fear of being wrong, allowing you to personally connect with the cards. For example, you might draw The Star while performing a read that's meant to tell you more about your next year. The Star is all about renewal, growth, and healing; so you might be able to assume that in the coming year, you'll move past old wounds and feel new."
    },
    {
      "title": "Start with a Yes/No reading.",
      "content": "Start with a Yes/No reading. A yes or no reading is also a great way to get into tarot as a beginner. This type of reading involves asking the tarot one question and drawing a single card for a yes or no answer. Make sure to choose a question that can be answered with a “yes” or a “no,” and only ask a single question at a time. [5] X Research source If the question is too vague or requires a longer explanation, the yes or no tarot reading might not be the right choice, and you might want to try another tarot spread instead. Here are some examples of yes/no tarot questions: “Am I on the right spiritual path?” “Is there a good energy surrounding my current relationship?” “Is there a positive change coming my way financially?” [6] X Research source"
    },
    {
      "title": "Try a basic 3-card spread.",
      "content": "Try a basic 3-card spread. A 3-card spread is another great option for beginners who have just started reading. Assign the positions in advance, lay out the cards in your spread from left to right, and use what you've learned about card meanings and combinations to tell a story based on the cards you've drawn. Here are some examples of popular 3-card spreads: In a Past/Present/Future reading, the first card you draw represents your past, the second represents your present, and the third represents your future. The other 3 card spreads follow this same structure. These include Current Situation/Obstacle/Advice, You/The Other Person/The Relationship, Opportunities/Challenges/Outcomes, and Mind/Body/Spirit readings. [7] X Research source"
    },
    {
      "title": "Try the Celtic Cross spread.",
      "content": "Try the Celtic Cross spread. When you're ready, try out a slightly more thorough spread. The Celtic Cross is a popular spread that involves drawing 10 cards. Draw your first card and place it in front of you. Draw your second card, and place it across the first card. Place your third card on the left side of your first card, and place your fourth card on the right side of your first card. Place your fifth card above your first card and your 6th card below your first card. Arrange cards seven through ten in a vertical line to the right of the cards you’ve already laid out. Place the seventh card at the bottom, the eighth directly above it, and so on. Here’s what each of the cards represents: 1st card: The present/your current situation 2nd card: The challenges or obstacles you’re facing 3rd card: The past 4th card: The future 5th card: Your goal or aspiration 6th card: Your subconscious and underlying feelings 7th card: Advice 8th card: External influences 9th card: Hopes and fears 10th card: Outcome [8] X Research source"
    },
    {
      "title": "Make constellations.",
      "content": "Make constellations. Tarot constellations are made up of all cards that carry the same digit (numbers one through nine). For example, the Tarot constellations for the number four would be the number four card from each of the suits, the Emperor (which carries the number four), and Death (which carries the number 13 but reduces to the number four (1+3=4). Line up all the cards to form a constellation in front of you, and ask yourself how you feel about each card (what attracts or repels you, how they're alike and different, what symbols they share). Record your impressions in a journal. Numbers have specific meanings in the tarot. For example, threes in the tarot represent growth and groups, while fives represent conflict and instability. [9] X Research source Understanding these energies will facilitate a smoother reading when multiples of the same number come up. Instead of focusing on individual meanings, you'll be able to focus on the energy they bring in as a group."
    },
    {
      "title": "Pick a space with the right vibes.",
      "content": "Pick a space with the right vibes. Whether you’re performing a reading for yourself or someone else, it’s important to choose the right physical setting. Pick a comfortable space where you can sit with a table in front of you to lay out your cards. To set the scene, you could light a candle, lay out some crystals, or burn some incense to cleanse the space of any outside energies. [10] X Research source Once you’ve created the perfect vibes for your tarot reading, it’s time to get started!"
    },
    {
      "title": "Pick a question to guide your reading.",
      "content": "Pick a question to guide your reading. Make sure to pick an open-ended question to ask the tarot. [11] X Research source Asking a question that’s too specific or narrow might not leave enough room for the tarot to provide a thorough answer. Open-ended questions allow the tarot room to provide in-depth insights into the situation and the energies surrounding it. Here are some examples: What can I do to invite more love into my life? How can I progress and grow in my career? Why am I feeling distant from my loved ones? [12] X Research source"
    },
    {
      "title": "Shuffle your deck.",
      "content": "Shuffle your deck. Once you’ve picked your question, start shuffling your tarot deck to transfer your energy to the cards. While doing this, think about the question you’re asking and your intention for the reading. If other people have touched or handled your deck, you may want to cleanse it before shuffling and starting your reading. When other people handle your deck, their energy can transfer to it. When you do a reading, however, you’ll want the cards to be tuned into your energy specifically. Here are some ways to cleanse your deck: Place a crystal, like selenite or clear quartz, on top of your deck for some time. You can even store your tarot cards this way when you’re not using them! You can also use incense smoke to cleanse your cards. Allow the smoke to waft around the cards to clear any outside energies. Another easy option is charging your cards in the moonlight. Place your tarot deck near a window overnight during a full moon to vet them ready for a reading! [13] X Research source"
    },
    {
      "title": "Draw and lay out the cards in the spread of your choice.",
      "content": "Draw and lay out the cards in the spread of your choice. Once you’ve got your question in mind and you’ve shuffled your cards, it’s time to draw cards and arrange them in a spread. The decision of what spread to use is entirely up to you, but some spreads are better suited to answer certain types of questions. [14] X Research source For example, if you have a simple question, a Yes/No reading could be the right way to go. If you have a more complex question, like “Why do I feel unhappy in love,” a Past/Present/Future reading might be the best choice. Tarot spreads can be helpful tools to guide a reading, but you don’t need to use one every time. Sometimes, you might feel pulled to lay out the cards in a different way. When this happens, listen to your intuition and place them in the way that feels right. Tarot doesn’t need to follow a rigid set of rules—it can be creative and fun, too!"
    },
    {
      "title": "To get rid of negative energy, cleanse your deck.",
      "content": "To get rid of negative energy, cleanse your deck . There are many ways to do this, but a simple way involves calling on one of the four elements. When using this method, begin by fanning the deck; if extreme cleansing is needed, the cards can be cleared one at a time. Earth: Bury your protected deck in sand, salt or dirt for 24 hours. Or, fan your deck on a tablecloth and sprinkle it with salt, sand, or any combination of basil, lavender, rosemary, sage or thyme for 1-2 minutes. Water: Sprinkle your cards lightly with water, herbal tea or a plant infusion and wipe immediately, or expose your deck to moonlight in a protected area for half the night. Fire: Taking care not to burn yourself, pass your deck quickly through a candle flame. You can also expose your deck to sunlight in a protected area for half a day. Air: Pass your deck five to seven times over burning incense. Or, breathe deeply and slowly onto your deck 3 times."
    },
    {
      "title": "Store your deck properly.",
      "content": "Store your deck properly. Tarot cards can pick up negative energy that can interfere with your readings. Store your cards in a black-lined bag or in a wooden Tarot card box. You can add gemstones or herbs that increase psychic abilities."
    }
  ]
}