{
  "url": "https://www.wikihow.com/Save-Photos-on-Telegram-on-Android",
  "title": "Saving Photos on Telegram on Android + Fixes",
  "steps": [
    {
      "title": "Open Telegram on your Android.",
      "content": "Open Telegram on your Android. Its icon is a white paper airplane on a blue background. Tap the Telegram icon on your Home screen or Apps menu to open Telegram."
    },
    {
      "title": "Tap the chat that contains the image.",
      "content": "Tap the chat that contains the image. This displays all messages in the chat."
    },
    {
      "title": "Tap the image you want to save.",
      "content": "Tap the image you want to save. The image now appears at the center of the screen. [1] X Research source Do not tap and hold the image. This will only give you the option to forward the image within Telegram. Tap the image quickly to display the menu icon in the upper-right corner."
    },
    {
      "title": "Tap ⁝.",
      "content": "Tap ⁝ . It's at the top-right corner of the screen. This displays the menu. If you don't see the menu button and you see a green checkmark next to the image, you held the image for too long. Tap the \"X\" icon in the upper-left corner and tap the image again quickly."
    },
    {
      "title": "Tap Save to gallery.",
      "content": "Tap Save to gallery . The photo is now saved to the gallery on your phone or tablet. If you don't see the \"Save to Gallery\" option in the three-dot menu, make sure Telegram has the appropriate photo-storage permissions. Go to the app's Permissions page in Settings ( Settings > Apps > Telegram > Permissions ) and enable \"Files and media.\" If you already have automatic download enabled, you will not see the \"Save to Gallery\" option in the menu so you don't download duplicates."
    },
    {
      "title": "Open Telegram on your Android.",
      "content": "Open Telegram on your Android. Its icon is a white paper airplane on a blue background. Tap the Telegram icon on your Home screen or Apps menu."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . It's the icon with three horizontal lines in the upper-right corner. This displays the menu."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . It's near the bottom of the menu. It's next to an icon that resembles a gear."
    },
    {
      "title": "Tap Data and Storage.",
      "content": "Tap Data and Storage . The icon looks like a pie chart."
    },
    {
      "title": "Tap to enable the \"Save to Gallery\" feature for everything.",
      "content": "Tap to enable the \"Save to Gallery\" feature for everything. As long as you want to be able to save pictures from a private chat, a channel, or a group chat, make sure all of these are enabled. You can also only enable individual switches too. [2] X Research source"
    },
    {
      "title": "",
      "content": "Tap the back arrow to navigate back to Settings."
    },
    {
      "title": "Tap Chat Settings.",
      "content": "Tap Chat Settings . It's next to an icon that resembles a speech bubble."
    },
    {
      "title": "Scroll down and tap the toggle switch next to \"Save to Gallery.\"",
      "content": "Scroll down and tap the toggle switch next to \"Save to Gallery.\" With this enabled, all images sent over Telegram will automatically be saved to the Gallery on your phone. Tap this option again if you want to stop Telegram from automatically saving every image to your gallery. See if you have \"Enable auto-download media\" on if you're frequently switching between Wi-Fi and data. Some images may not automatically download and make you wonder where they are! Open Telegram, tap the three-line menu icon and select Settings > Data and storage and check under \"Automatic media download.\" Both \"when using Wi-Fi\" and \"when using data\" should be checked if you want every image downloaded automatically to your gallery."
    },
    {
      "title": "Update the app.",
      "content": "Update the app. If your app is out of date, you may not see \"Save to Gallery\" in the three-dot menu. Even if your app is up-to-date, an update could be in the Google Play Store tomorrow, so check frequently. Not seeing \"Save to Gallery\" is a popular bug that many users are reporting, so there should be an update soon to fix it."
    },
    {
      "title": "Restart your phone.",
      "content": "Restart your phone. Even if you just updated the app, your phone could still be glitched or bugged and restarting it is a good option."
    },
    {
      "title": "Check Telegram server status.",
      "content": "Check Telegram server status. It's not uncommon that the servers could be experiencing an outage. You can do a simple search on Google to find statuses from sites like Downdetector that indicate the Telegram server statuses."
    },
    {
      "title": "Uninstall the app and reinstall it.",
      "content": "Uninstall the app and reinstall it. In your Android's settings under Apps, you can uninstall Telegram. Then, open Google Play and reinstall it. If the cache is still full, try clearing it , then uninstalling and reinstalling the app to see if that helps."
    }
  ]
}