{
  "url": "https://www.wikihow.com/Remove-Temporary-Tattoos",
  "title": "How to Remove Temporary Tattoos",
  "steps": [
    {
      "title": "Apply a small amount of baby oil to the temporary tattoo.",
      "content": "Apply a small amount of baby oil to the temporary tattoo. Keep in mind that most temporary tattoos are able to stand up to water and soap, so oil is generally the best way to go if you want to scrub a temporary tattoo off. You could also try to use a face or body scrub . The beads from the scrub should help remove the tattoo from your skin. [1] X Research source Alternatively, you can use special temporary tattoo remover wipes like Limisan. Those wipes contain silicons which ensure easy removal of the temporary tattoo. Alternatively, you can pour a small amount of rubbing alcohol onto a cotton ball or piece of paper towel. Be aware that rubbing alcohol may burn a bit. If you do not have baby oil, you can use olive oil on your tattoo as well."
    },
    {
      "title": "Let the baby oil sit on the tattoo for a minute.",
      "content": "Let the baby oil sit on the tattoo for a minute. Doing this will allow the baby oil to soak into the tattoo (and your skin) making it easier to rub the temporary tattoo away. [2] X Research source"
    },
    {
      "title": "Get a washcloth and rub the tattoo vigorously.",
      "content": "Get a washcloth and rub the tattoo vigorously. The tattoo should begin to become clumpy and start to peel off and rub away. Keep rubbing until all of the temporary tattoo has been removed. You can use a paper towel in place of a washcloth."
    },
    {
      "title": "Wash the remaining oil off with warm water and soap.",
      "content": "Wash the remaining oil off with warm water and soap . Wash your skin until there is no oil left. Pat the area dry with a towel."
    },
    {
      "title": "Rip several pieces of tape off of its roll.",
      "content": "Rip several pieces of tape off of its roll. Clear tape, such as Scotch tape, works better than masking or painter’s tape. Hang the tape pieces by one end off of the side of a table or counter (wherever you will be working)."
    },
    {
      "title": "Press a piece of tape down onto the temporary tattoo.",
      "content": "Press a piece of tape down onto the temporary tattoo. Make sure that you press it down firmly so that it attaches to the surface of the temporary tattoo. Use a finger to rub the tape down along your skin."
    },
    {
      "title": "Peel the tape off of your skin.",
      "content": "Peel the tape off of your skin. The temporary tattoo should peel off with the tape. This process might take several tries, particularly if it is a large temporary tattoo. [3] X Research source"
    },
    {
      "title": "Rub an ice cube on the spot where the temporary tattoo was.",
      "content": "Rub an ice cube on the spot where the temporary tattoo was. Do this after all of the temporary tattoo has been removed. Doing this will reduce the redness caused by peeling the tape from your skin."
    },
    {
      "title": "Apply cold cream to the temporary tattoo.",
      "content": "Apply cold cream to the temporary tattoo. Make sure that the tattoo is fully covered by the cream."
    },
    {
      "title": "Let the cold cream sink into the skin.",
      "content": "Let the cold cream sink into the skin. You should leave the cream on for an hour or so to make sure that it thoroughly works its magic on the temporary tattoo."
    },
    {
      "title": "Rub the cold cream away with a washcloth.",
      "content": "Rub the cold cream away with a washcloth. Use warm water and soap to remove any remaining cold cream."
    },
    {
      "title": "Wet a cotton ball with nail polish remover.",
      "content": "Wet a cotton ball with nail polish remover. If you do not have nail polish remover, you can also use rubbing alcohol. [4] X Research source"
    },
    {
      "title": "Rub the temporary tattoo with the cotton ball.",
      "content": "Rub the temporary tattoo with the cotton ball. Scrub at the tattoo so that it begins to flake off of your skin. You may need to wet the cotton ball again or get a new cotton ball, depending on how large your temporary tattoo is."
    },
    {
      "title": "Wash your skin with warm water and soap.",
      "content": "Wash your skin with warm water and soap. Use a washcloth to rinse your skin where your temporary tattoo was. Use warm water and soap to remove any of the acetone left behind by the nail polish remover."
    },
    {
      "title": "Soak make up remover into a cotton ball.",
      "content": "Soak make up remover into a cotton ball."
    },
    {
      "title": "Rub over the temporary tattoo.",
      "content": "Rub over the temporary tattoo. Rub gently."
    },
    {
      "title": "Wash off with soap and warm water.",
      "content": "Wash off with soap and warm water."
    },
    {
      "title": "Allow to air dry or dab with a soft towel.",
      "content": "Allow to air dry or dab with a soft towel. [5] X Research source"
    },
    {
      "title": "Repeat if needed.",
      "content": "Repeat if needed."
    }
  ]
}