{
  "url": "https://www.wikihow.com/Not-Stalk-Your-Ex-on-Social-Media",
  "title": "How to Stop Looking at Your Ex’s Social Media Accounts",
  "steps": [
    {
      "title": "Recognize that looking at your ex’s social media is normal—but painful.",
      "content": "Recognize that looking at your ex’s social media is normal—but painful. Although you may think that checking up on your ex on social media is stalking, it's actually a completely normal behavior after a breakup. You may want to see if your ex is feeling as devastated as you are, or you may be holding on to hope that you’ll reconcile. [1] X Research source Unfortunately, this can create a bad cycle of using social media for reassurance that ultimately makes you feel worse. “To stop this self-sabotaging behavior, the first step is to recognize what is happening in your brain,” says Chan. [2] X Expert Source Amy Chan Relationship Coach Expert Interview. 1 May 2019. Every time you stalk your ex, you're triggering the motivation system in your brain and releasing dopamine, like an addict who’s craving a fix. [3] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source “Thus, every time you replay that romantic video of your vacation, stalk their social media, or text them, you are falling into a mental trap that keeps you addicted,” she says. Because of this, digitally detoxing from your ex is usually the best way to let go and move on. [4] X Expert Source Amy Chan Relationship Coach Expert Interview. 1 May 2019."
    },
    {
      "title": "Block your ex on social media sites.",
      "content": "Block your ex on social media sites. Blocking your ex entirely on all social media platforms may seem like the most extreme way to stop stalking them, but it’s also the most effective. “Your brain is primed for obsessive behavior during this time, and your motivation system is seeking dopamine,” Chan explains. Blocking your ex makes it impossible to check up on them, no matter how tempted you are, which interrupts this addictive cycle. [5] X Expert Source Amy Chan Relationship Coach Expert Interview. 1 May 2019. On the other hand, if you simply unfollow or unfriend your ex, you’ll still be able to visit their profile and see their posts if they have a public account, and it can be tough to resist this temptation. If you don’t think you’d be able to stop yourself from checking in on them, blocking (rather than unfollowing) is probably the right way to go. Reader Poll: We asked 691 wikiHow readers about how they use social media after a breakup, and 50% of them said that they block their ex and make their profile private . [Take Poll]"
    },
    {
      "title": "Unfriend or stop following your ex if you don't want to block them.",
      "content": "Unfriend or stop following your ex if you don't want to block them. This is a less extreme option than blocking, but it can still be effective. It will limit your exposure to what’s going on in their life, since their posts and photos won’t show up in your feeds—you’d have to actually seek them out to see them. If you maintain your willpower and resist the temptation to visit their accounts, it may be enough to simply unfriend and unfollow your ex. [6] X Research source If you share mutual friends with your ex, they may notice that you’ve unfollowed them and ask questions about why you did this. You don’t owe anyone an explanation, but if you want to share how you’re feeling, just keep things simple and direct. You could say something like, “Honestly, I need a break. Maybe in the future I can follow them on social media, but for now, I need to not be able to see what they’re doing, so I can move on.”"
    },
    {
      "title": "Mute your ex for a less extreme option.",
      "content": "Mute your ex for a less extreme option. If you’re worried that blocking or unfollowing your ex might be too extreme, try limiting what you see on social media. On Instagram, for example, you can mute someone’s story or posts, so that they don’t show up on your feed. Some social media sites like Facebook will even automatically prompt you to limit exposure when you change your relationship status. [7] X Research source Doing this frees you from the constant reminder of your ex, and helps you maintain your willpower to stop checking their profile."
    },
    {
      "title": "Stop following the feeds of mutual friends.",
      "content": "Stop following the feeds of mutual friends. Depending on your network of friends, your ex may appear in other people’s statuses, location updates, and photos on social media. This can be upsetting, especially if you see that your ex has a new partner, or if it seems like they’re living their best life without you. To avoid seeing your ex's name or photos, consider taking the extra step of unfollowing or silencing your mutual friends' social media posts. [8] X Research source If you don’t want these mutual friends to know that you’ve muted their accounts, you can say something like “Oh, I must have missed that,” if they mention a photo or post that you didn’t see. On the other hand, you can always be honest with them, and say something like, “I’m so sorry, but it’s just too painful to see Gregory in your photos and stories. I really value your friendship, though, and I’d love to catch up with you in other ways.”"
    },
    {
      "title": "Remove your ex's contact information from your devices.",
      "content": "Remove your ex's contact information from your devices. Many social media platforms use your contact list on your phone to suggest new accounts for you to follow. As a result, sites like Instagram and TikTok may suggest your ex’s account to you if you still have their number in your phone, which could lead to more stalking. You can prevent this by deleting your ex’s contact information from your devices. Deleting or even blocking your ex’s number is a good idea in general, explains Chan. “Block their number if you have to, so you don’t obsess about them not contacting you,” she says. [9] X Expert Source Amy Chan Relationship Coach Expert Interview. 1 May 2019. This also frees you from the temptation of reaching out to them yourself. If you’re worried that you might need to contact them at some point, write their contact information on a piece of paper, and store it somewhere out of sight."
    },
    {
      "title": "Avoid giving into the urge to check up on your ex.",
      "content": "Avoid giving into the urge to check up on your ex. From time to time, you may be tempted to poke around social media and search engines for your ex. One innocent profile view could lead to a night of obsessively questioning things, such as whether or not the person who liked your ex’s photo is a friend or new love interest. Remind yourself that it’s better to avoid your ex’s social media and web presence altogether, no matter how good you think it might feel to get one more look at what’s going on in their life. [10] X Research source “Recognize that you have the choice to either let that urge control you, or take control of the urge,” says Chan. “Before you look at old photos or check your ex’s Instagram, stop and ask, ‘Am I being kind to myself right now?’ You know the answer.” [11] X Expert Source Amy Chan Relationship Coach Expert Interview. 1 May 2019."
    },
    {
      "title": "Pause and remind yourself why you broke up.",
      "content": "Pause and remind yourself why you broke up. When you feel the sudden urge to look at your ex’s social media profiles, pull out a sheet of paper and write down a list of reasons why your relationship didn't work. [12] X Research source Once you’ve taken a few minutes to pause and reflect on the negative aspects of the relationship, the temptation to check your ex’s accounts will likely have passed, and you'll feel less inclined to idealize about the past."
    },
    {
      "title": "Avoid mentioning your ex.",
      "content": "Avoid mentioning your ex. An ex-partner was a significant part of your life, so it’s natural to want to talk about them after you’ve broken up. Unfortunately, this can remind you of the person, and as Chan explains, it’s best to avoid reminders of the relationship to truly move on. [13] X Expert Source Amy Chan Relationship Coach Expert Interview. 1 May 2019. Consciously not talking about your ex can help you stop thinking about them, and by extension, stop checking up on them on social media. Ask your friends to avoid mentioning your ex around you, too. This may remind you of your ex and could make you want to find out further details on social media. If you don’t feel comfortable asking mutual friends not to talk about your ex, you can also step away from the conversation until they start talking about a new topic."
    },
    {
      "title": "Focus on creating the life you want.",
      "content": "Focus on creating the life you want. “Being single is a valuable time to get back to you ,” explains Chan. “It’s the time to reconnect with the relationship you have with yourself, to start that passion project you’ve procrastinated on, to take that solo trip you’ve always wondered about.” [14] X Expert Source Amy Chan Relationship Coach Expert Interview. 1 May 2019. Shifting your focus toward your own hobbies, passions, and goals can help distract you from thoughts of your ex, which can help mitigate your urges to check their social media accounts. Try doing some relaxing, self-care activities like getting a massage, attending a yoga class, or spending time out in nature. Explore new hobbies and activities, like learning how to cook, joining a book club, or taking a rock climbing class. “Your breakup is merely the end of one chapter and the beginning of your next,” says Chan. “So make this chapter colorful, vibrant, playful, and fun!” [15] X Expert Source Amy Chan Relationship Coach Expert Interview. 1 May 2019."
    },
    {
      "title": "Lean on your support system.",
      "content": "Lean on your support system. It’s normal to feel sad and vulnerable after a breakup, but this is the perfect opportunity to lean on your support system and reconnect with family and friends, says Chan. [16] X Expert Source Amy Chan Relationship Coach Expert Interview. 1 May 2019. Be open with them and let them know that you’re struggling to stop looking at your ex’s social media. They can help distract you with fun activities, provide emotional support, and remind you to stay strong when you’re feeling tempted to check up on your ex."
    },
    {
      "title": "Get to know new people.",
      "content": "Get to know new people. Making new friends and connecting with new people can be an excellent distraction. It opens up your world and reminds you that there are tons of interesting people out there beyond your ex. This can help you feel less hung up on them and less tempted to check in on them on social media, and it may even open your heart to the possibility of falling in love with someone new. “Remember, there isn’t just one person out there for you–there’s many,” says Chan. [17] X Expert Source Amy Chan Relationship Coach Expert Interview. 1 May 2019. To meet new people, try attending social events in your area, joining a club or group, or signing up for a class for a hobby that you enjoy. Consider flirting with the new people you meet if you feel like you might share a connection. You might not be ready to date, but a little flirting can boost your self-confidence and distract you from your ex."
    }
  ]
}