{
  "url": "https://www.wikihow.com/Report-Section-8-Fraud",
  "title": "How to Report Section 8 Fraud",
  "steps": [
    {
      "title": "Determine if the person is committing financial fraud.",
      "content": "Determine if the person is committing financial fraud. If you suspect that your tenant or neighbor should be able to support their family with their income without Section 8 support, the police may be interested in investigating the situation. Section 8 assistance is given to those with low income to help them afford housing for themselves and their families. Sometimes, a tenant's income level will rise, but they will not report the increase in income in order to keep qualifying for Section 8 assistance. This is financial fraud. In other cases, a high-earning spouse may be living in the home but not listed on the lease. If you sense a disconnect between the tenants' standard of living and the assistance they are receiving, keep an eye out for more concrete evidence, such as long-term \"guests\" who aren't on the lease."
    },
    {
      "title": "Identify unauthorized people permanently living in the home.",
      "content": "Identify unauthorized people permanently living in the home. There is usually nothing wrong with a tenant having guests overnight or even for an extended period of time. However, those receiving Section 8 assistance will sometimes take on roommates or sublet space to help pay the rent. They will keep these arrangements hidden because they no longer qualify for Section 8 assistance but want to keep receiving benefits. [2] X Research source If you see people who are not on the lease coming and going regularly from the home, it may warrant an investigation. A visitor becomes an \"unauthorized guest\" if they stay more than 15 consecutive days without approval from the Public Housing Authority (PHA), or more than 30 days in one twelve-month period. [3] X Research source"
    },
    {
      "title": "Be aware of other fraudulent arrangements.",
      "content": "Be aware of other fraudulent arrangements. It is a violation for some convicted felons to reside in Section 8 housing, depending upon the type of offense and how long ago the offense was committed. Disqualifying offenses include violent crimes, sexual offenses, drug trafficking, and some types of fraud. You might also encounter a Section 8 tenant who reports that there are more people living in the home than are actually present. For example, a Section 8 applicant might report to HUD that his children are living in the home and that he needs additional assistance to afford a home with more rooms, when in fact he is living alone in a larger home than he would otherwise be able to afford. [4] X Research source If you decide to investigate on your own, be careful not to cross the line into intrusiveness or harassment. Make note of or even discretely photograph people who regularly come an go from the property but should not be living there. Look out also for business transactions on the premises that could indicate drug-related activity."
    },
    {
      "title": "Gather evidence and details.",
      "content": "Gather evidence and details. When you make your report, you will need to provide enough information to convince the investigating agency that fraud seems to be occurring, and enough detail to indicate who and where to investigate. If your information is too vague or unsubstantiated, the investigating agency might choose not to take any action. [5] X Research source Be prepared to provide as much of the following as you can: The violator's name; The violator's address; How you know the violator is receiving Section 8 assistance; Why you believe the violator does not qualify for Section 8 assistance; What benefit the violator is receiving through his or her fraud; What actions or scheme the violator is using to commit fraud; [6] X Research source Descriptions of people living at the address, or photographs, if you have them; and Any other documentation that supports your claim."
    },
    {
      "title": "Decide whether or not to remain anonymous.",
      "content": "Decide whether or not to remain anonymous. You generally have the option to make an anonymous fraud report. [7] X Research source However, if you remain anonymous, the investigator will not be able to contact you again for any additional information or details. Whether or not you remain anonymous, you are not entitled to receive follow-up information about the investigation from the investigating agency. [8] X Research source"
    },
    {
      "title": "Report fraud to the Department of Housing and Urban Development.",
      "content": "Report fraud to the Department of Housing and Urban Development. HUD has an Office of Inspector General (OIG), which is the law enforcement arm of the department. OIG investigates fraud, waste, and abuse in the Section 8 program. You can visit, call, email, or fax to report fraud. Note that OIG may choose to let your local PHA investigate your report. You can make your report by doing one of the following: Visit an OIG regional office. You can find address and contact information for each location at: https://www.hudoig.gov/about-hud-oig/contacts-locations . Email your report to: hotline@hudoig.gov. [9] X Research source Write to: HUD Inspector General Hotline (GFI), 451 7th Street, SW, Washington, DC 20410. [10] X Research source Contact OIG via fax at: 202-708-4829. [11] X Research source Submit an intake form. Fill out the one-page form and mail or fax it to the address or number at the bottom of the page."
    },
    {
      "title": "Locate your local Public Housing Authority.",
      "content": "Locate your local Public Housing Authority. You may choose to report instances of fraud to your local PHA instead of reporting to HUD. To locate your local PHA, use the database provided by HUD at http://portal.hud.gov/hudportal/HUD?src=/program_offices/public_indian_housing/pha/contacts . Select your state, which will direct you a list of city and county PHAs with addresses and contact information."
    },
    {
      "title": "Report fraud to your local PHA.",
      "content": "Report fraud to your local PHA. Each PHA has its own system for processing fraud reports. For example, the Housing Authority of New Orleans operates a webpage at https://www.hano.org/Tenants/IncidentReport# where you can find a hotline number or fill in an online incident report form. Other PHAs may redirect you to a third party. For instance, the Housing Authority for the City of Los Angeles accepts online reports through [mysafeworkplace.com]."
    }
  ]
}