{
  "url": "https://www.wikihow.com/Report-a-Bad-Airbnb-Stay",
  "title": "How to Report a Bad Airbnb Stay",
  "steps": [
    {
      "title": "Contact your host.",
      "content": "Contact your host. Navigate to https://www.airbnb.com/help/contact_us . Log into your Airbnb account, if prompted. Click on the text “Resolve Issue” on the left-hand side. A box with your recent host(s) should appear. Click “Send Message” under the appropriate host’s name. Use the message to outline and detail your concerns. You can contact your host during or after your stay if something is missing, not working, or otherwise not the way you expected. [2] X Research source Allow your host some time to respond. If you don’t hear back, you can try their listed email address or phone number. [3] X Research source"
    },
    {
      "title": "Contact Airbnb directly",
      "content": "Contact Airbnb directly if your host remains unresponsive. Navigate to https://www.airbnb.com/contact . Alternately, you can reach Airbnb by phone at 1-855-424-7262. Explain your situation and that you attempted to reach the host but have not heard back. Contact Airbnb at https://www.airbnb.com/contact within twenty-four hours of your check-in to make a record of the issue and initiate a hold on your payment. The Airbnb phone number is available 24/7. The average wait time on the line is twelve minutes. [4] X Research source"
    },
    {
      "title": "Check your refund eligibility.",
      "content": "Check your refund eligibility. Navigate to https://www.airbnb.com/help/article/2868 . Review Airbnb’s Guest Refund Policy to see if you may qualify for a refund. Eligible travel issues tend to fall into one of the following categories: the host failed to provide reasonable access to the location; the listing misrepresented details; or the location was unclean, unsafe, or contained an animal not mentioned in the listing. [5] X Research source You must have used reasonable efforts to resolve the situation with the host before filing a claim. In other words, you must have contacted your host and attempted to resolve the issue with them directly before resorting to initiating a claim. You won’t be eligible for a refund if you’re directly or indirectly responsible for the travel issue. Your own action, negligence or omission must not have caused the travel issue."
    },
    {
      "title": "Submit a refund request.",
      "content": "Submit a refund request. Navigate to https://www.airbnb.com/resolutions to submit a refund request to your host. Click the “Request money” button. Use the Resolutions tool to select the appropriate reservation. Choose the radio button to “request a refund.” Enter the refund amount and reason, and click “Send Message.” Contact your host first to agree upon a refund amount. [6] X Research source If you’ve been unable to reach a resolution with your host, use Airbnb’s 30-day satisfaction guarantee instead. Navigate to the Profile tab and contact Airbnb. You have up to 60 days after checkout to submit a Resolution Center request. [7] X Research source"
    },
    {
      "title": "Contact Airbnb if you can’t reach an agreement with your host.",
      "content": "Contact Airbnb if you can’t reach an agreement with your host. Request that Airbnb make the final decision. Wait at least 72 hours since you opened the request. Navigate to https://www.airbnb.com/resolutions . Choose the reservation you had issue(s) with. Click “Involve Airbnb.” [8] X Research source Make sure to answer any requests Airbnb may have for additional information."
    },
    {
      "title": "Go to your Airbnb reviews.",
      "content": "Go to your Airbnb reviews. Navigate to https://www.airbnb.com.pe/login?_set_bev_on_new_domain=1713489667_MTA2OTc1ZGM4OGNk . Alternately, you can reach the Airbnb login screen by going to Airbnb’s homepage at https://www.airbnb.com and clicking on “Log In” in the upper right-hand corner. Enter your email address and password. If you signed up for Airbnb through Facebook or Google, click the respective button instead. If you lost your password, click the link under the Password field that says “Can’t log in?” Enter the email address you used to sign up for Airbnb. Check your email and click the link to reset your password."
    },
    {
      "title": "Find the stay you want to review.",
      "content": "Find the stay you want to review . Click on the tab that says “Reviews By You.” Select the user profile you wish to post a review about. Your stay must be completed and you’ll need to be checked out of the location before writing your review. You have fourteen days from the time of checkout to submit a review about your stay. [9] X Research source"
    },
    {
      "title": "Assign a star rating.",
      "content": "Assign a star rating. Rate the stay in various categories, on a scale from one to five stars. Half stars are acceptable throughout the rating scale. Rate the accuracy, communication, cleanliness, location, check in, and value of your stay."
    },
    {
      "title": "Write the text of your review.",
      "content": "Write the text of your review. Type your review into the text field. Keep your review within 500 characters (including spaces and punctuation). You may want to write your review in a text-editing program first. When you’re finished, copy and paste it into the text field of your Airbnb review. [10] X Research source Have the text-editing program check your spelling. View your character count occasionally as you go. It’s also a good idea to write your review in a text-editing program first because you don’t want to lose the text you’ve written if there’s a problem with the website or your internet connection as you try to submit your review."
    },
    {
      "title": "Evaluate and submit your review.",
      "content": "Evaluate and submit your review. Make sure you’ve complied with Airbnb’s Content Policy, viewable at https://www.airbnb.com/help/article/546/what-is-airbnb-s-content-policy . Click the “Enter” button to submit your review. Go back to the “Reviews By You” tab or refresh the webpage to ensure that your review was posted. For example, the content you submit can’t be profane, threatening, or illegal. Your review must represent the personal experience of you or your travel companions during that stay."
    }
  ]
}