{
  "url": "https://www.wikihow.com/Six-Word-Stories",
  "title": "A Complete Guide to Six-Word Stories (With 66 Funny & Heartfelt Examples)",
  "steps": [
    {
      "title": "A six-word story is a short narrative that’s told in exactly six words.",
      "content": "A six-word story is a short narrative that’s told in exactly six words. Six-word stories are meant to encapsulate an entire plot or narrative in just one sentence (or six words). Typically, six-word stories evoke a sense of emotion and offer a resolution while still leaving some room for reader interpretation. They’re often used as writing exercises for writers and writing students to practice creativity and concision in their craft. [1] X Research source Stevens recommends writing exercises like the six-word story because, even if it’s out of your comfort zone, it’s going “to add to your skills as a writer because you’ve done something you’ve never done before. And then you can build on that, find the resources, and get a little bit better each time.”"
    },
    {
      "title": "Hemingway allegedly wrote the first 6-word story:",
      "content": "Hemingway allegedly wrote the first 6-word story: “For sale: baby shoes, never worn.” According to popular retellings, Hemingway was seated with a group of fellow writers in a hotel during the 1920s. He bet his friends that he could write a story with a full narrative in just six words. After his friends accepted his bet, he scribbled a few words on a napkin and passed it around the table. Those words, of course, were “For sale: baby shoes, never worn.” Even though this story was only six words long, the other writers had to admit that it told a complete story. [2] X Research source While the historical accuracy of this story is debated, Hemingway is nevertheless credited with the invention of this writing exercise that combined the poetic with the narrative. His story inspired the modern-day Six Words Memoirs Project , which asks users to sum up the story of their life in six words. [3] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source Although many writers have tried, few have achieved the same level of skill, concision, and emotion that Hemingway’s story displays. In just six words, his powerful story conveys universal themes of loss, grief, and mortality."
    },
    {
      "title": "",
      "content": "The six-word story is a fairly well-known and well-loved writing exercise, so it shouldn’t come as a surprise that many famous authors, poets, songwriters, and public figures have taken a stab at this particular medium. Some of these notable individuals stuck to the traditional format of the six-word story, while others wrote a six-word memoir instead (i.e., they summed up their own life in six words). [4] X Research source Here are our favorite examples of celebrity six-word stories: [5] X Research source “I win lottery. Sun goes nova.” – Steven Meretzky “As she fell, her mind wandered.” – Rebecca Miller “Defenestrated baby, methamphetamine, prison, rehab, relapse.” – Jeffrey Eugenides “Wasted day. Wasted life. Dessert, please.” – Steven Meretzky “Found true love. Married someone else.” – Dave Eggers “Big bang. No God. Fadeout. End.” – Stephen Baxter “Lovely spring weather. Bubonic plague raging.” – Evelyn Waugh “Starlet sex scandal. Giant squid involved.” – Margaret Atwood “Longed for him. Got him. Shit!” – Margaret Atwood “Designed in Asia, assembled in California.” – Ian Chen “Friendship test: willingness to be inconvenienced.” – Gay Talese “Former Boss: ‘Writing’s your worst skill!’” – Amy Tan “Me see world! Me write stories!” – Elizabeth Gilbert “Couldn’t cope, so I wrote songs.” – Aimee Mann “Immigrants, we get the job done.” – Lin-Manuel Miranda"
    },
    {
      "title": "",
      "content": "Following in the footsteps of Hemingway’s original six-word story, plenty of writers choose to focus on heartfelt and emotionally impactful themes in their own brief narratives. Common themes include mortality, death, sadness, grief, and love. Here are some poignant and moving examples: [6] X Research source “Sunny outside, but it’s cloudy inside.” – Anonymous “Out of everyone, I chose you.” – Samantha Yanez-Chavez “you must live through the night.” – Leslie Loredo “These years writing about those ones.” – Jamie-Lee Josselyn “We did not say our farewell.” – Peter Schwarz “One box of tissues wasn’t enough.” – Neha J. “Please, Time, I am not ready.” “Bathed dead baby while parents wept.” – Kathleen Tillman, RN “That evening the sun didn’t set.” – Zoe Stoller “Worst of all, it goes on.” – Steph Barron “This time, I actually hit send.” – Naomi Tsai “I know. You were the one.” – Damiana Andonova “‘It’s better this way,’ she lied.” – Anonymous “I am my mother’s daughter, eternally.” – Mary Beth Aungier “Trade your halo for my life.” – Angie Soudrette \"The war is over, isn’t it?\" – Anonymous \"Being pretty is not your job.\" – Anonymous \"I pushed him. He didn’t fall.\" – Anonymous \"Tomorrow I leave, he said again.\" – Anonymous"
    },
    {
      "title": "",
      "content": "While it’s true that six-word stories traditionally pack an emotional punch, they certainly don’t have to! Some stories take a more comedic angle, relaying a funny anecdote or commenting on a silly aspect of daily life. Here are some excellent examples of funny and witty six-word stories: [7] X Research source “The waterproof mascara was a lie.” – Tianyi Huang “Lawn roller skating: a bad idea.” – Tara K. Torme “Google knows me, therefore I am.” – Chris Mustazza “He betrayed me. Married the dog!” – Patricia O’Connor “What to do with word seven.” – John Meo “Dorms are weird(er) in your thirties.” – Jamie-Lee Josselyn “Up and showered. God bless steroids!” – Deirdre McCarthy “Is God on a lunch break?” – Kristen St Louis “Devastated daughter wanted pancakes, not waffles.” – Jen Mayberry “I accidentally fed the dog twice.” – Ashlyn Dixon “Survived dog attack, Beatlemania, and egomania.” – Catherine Palmer “Beats by Dre, Capital by Marx.” – Max Karpinski “Have yet to figure it out!” – Cami Potter “I’m beside myself; cloning machine works.” – J.D. Grafton “I leave. Dog panics. Furniture shopping.” – Reed (No Last Name) “Coffee before art. Goodbye straight lines.” – Vinsula (No Last Name)"
    },
    {
      "title": "",
      "content": "Outside the realm of standalone six-word stories, there are also plenty of famous quotes and phrases that have just six words—and still pack quite a punch! While these lines don’t necessarily fit the bill for a six-word story , they can still bring some inspiration for aspiring writers and further demonstrate how just a few words can make a serious impact: “Marley was dead. To begin with.” – Charles Dickens “To be, or not to be.” – William Shakespeare “It was dark inside the wolf.” – Margaret Atwood “In the beginning, there was light.” – The Bible “These violent delights have violent ends.” – William Shakespeare “Never, ever refuse a breath mint.” – Lemony Snicket “Think and wonder. Wonder and think.” – Dr. Seuss “You’ve got a friend in me.” – Randy Newman “Guess what? I’m not a robot.” – Marina and the Diamonds “It’s been a hard day’s night.” – The Beatles “I’m the king of the world.” – Titanic “It’s good to be king.” – The Blues Brothers “Fear of a name increases fear.” – Harry Potter and the Prisoner of Azkaban “It’s not magic, it’s friendship.” – Harry Potter and the Sorcerer’s Stone “I do not leave you comfortless.” – The Bible"
    },
    {
      "title": "Decide what theme and mood you want your story to convey.",
      "content": "Decide what theme and mood you want your story to convey. Hemingway’s classic six-word story about grief strikes a melancholy tone. You can do something similar with a topic that’s emotionally impactful—like love, death, dreams, or friendship. However, you can also go for a more light-hearted and even funny six-word story, as long as you can pack the punchline into six words or less! You might already have an idea for your story’s narrative—if not, take some time to brainstorm ideas or read some example stories to get inspiration. [8] X Research source If you need more information, Stevens recommends looking at any kind of art or the world around you. Listen to music, go out in nature, or explore a new neighborhood. Stevens herself shares that she does “fantasy-themed jigsaw puzzles, another form of art. There’s a visual that [she] can draw from to create new stories and characters.”"
    },
    {
      "title": "Write a rough draft with a complete narrative arc.",
      "content": "Write a rough draft with a complete narrative arc. What makes a six-word story a story is that it follows the same overall structure as a short story or novel. So, your story should establish a topic, present a conflict, and end with a feeling of resolution (even if that resolution is open to interpretation). You might feel that a six-word story doesn’t need a big moment of conflict, but the more conflict you can include (or imply) in your story, the more attention-grabbing the work is going to be, comments Stevens. Be sure to also include a subject followed by a verb in order to give the story action and movement. [9] X Research source When you’re first jotting down your narrative arc, don’t worry so much about the word count—just write down your complete story (but try to keep it to 12-15 words or less)."
    },
    {
      "title": "Whittle down your story to the most intentional and meaningful words.",
      "content": "Whittle down your story to the most intentional and meaningful words. Now that you have a rough outline of your story’s narrative arc, it’s time to filter out some words and condense it to exactly six words. With so few words, it’s extra important to choose strong words that have purpose and meaning and that serve to drive your story forward. [10] X Research source If you’re struggling with this aspect, go word by word and ask yourself: What is the word’s purpose in the story? What emotion or image does this word evoke? Is that emotion or image absolutely necessary for my story? Does this word have a similar purpose or meaning to another word in my story? If you want to get better with strong word choice in general, consider trying to improve your vocabulary. “Reading is the number one way to improve your vocabulary,” asserts Stevens. “Readers make the best writers.” Stevens also recommends consulting a physical or online thesaurus frequently, as well as to “take a linguistics class…if you have the means. It’s very cool to learn how words are put together, how they’re created, and which ones get included in official dictionaries."
    },
    {
      "title": "Use contractions and punctuation to shorten your word count.",
      "content": "Use contractions and punctuation to shorten your word count. Tweaking the grammar and structure of your poem can help you cheat around certain filler words that you don’t actually need. Look for any opportunities where a pair of words can be turned into a contraction : e.g., “should not” → “shouldn’t,” “could not have” → “couldn’t’ve,” “she has” or “she is” → “she’s.” Similarly, try to replace any conjunctions (e.g., \"and,\" \"but,\" \"or\") with punctuation marks, colons, or em dashes ( — ). [11] X Research source"
    },
    {
      "title": "Invite the reader to draw their own conclusions about your story.",
      "content": "Invite the reader to draw their own conclusions about your story. While you can certainly evoke strong emotions in just six words, your reader may still be left with wonderings about the exact details or meaning of the story. Capitalize on this natural intrigue to draw your reader in. Allow certain things to remain unsaid, as long as they can be reasonably inferred from the words included in your final draft. Let your readers fill in the blanks of the story’s larger plot. [12] X Research source For example, Hemingway’s six-word story (“For sale: baby shoes, never worn”) describes a pair of shoes that were bought for a baby but were never worn, implying that the baby passed away. However, the reader is left to ponder how the baby died, who bought the shoes, or if the baby died at all—maybe the shoes were just out of style!"
    },
    {
      "title": "Optionally, submit your story to popular websites and publications.",
      "content": "Optionally, submit your story to popular websites and publications. Once you’ve put the finishing touches on your unique story, consider submitting it to a website or forum dedicated to this type of writing. Post your six-word story on Tumblr or Reddit , or submit it to a site or magazine like Narrative , Six-Word Memoirs , or WIRED . [13] X Research source"
    }
  ]
}