{
  "url": "https://www.wikihow.com/Setup-and-Use-the-Tor-Network",
  "title": "How to Set Up and Use Tor: Windows, Mac, Linux, & Mobile",
  "steps": [
    {
      "title": "Download the official Tor installer for Windows.",
      "content": "Download the official Tor installer for Windows. If you're using Windows 10 or Windows 11, you can easily install the latest version of the Tor browser from The Tor Project. [1] X Research source Unfortunately, Tor support for Windows 7, Windows 8, and Windows 8.1 was discontinued with Tor Browser 14. Go to https://www.torproject.org/download and click Download for Windows . Click Save to save the installer to your computer."
    },
    {
      "title": "Run the Tor installer.",
      "content": "Run the Tor installer. Double-click the downloaded file, which you'll find in your default download folder—it should be called something like tor-browser-windows-x86_64-portable-14.0.4.exe ."
    },
    {
      "title": "Select your language and click OK.",
      "content": "Select your language and click OK . You'll then be prompted to select a location to install Tor."
    },
    {
      "title": "Select a location and click Install.",
      "content": "Select a location and click Install . The default is your desktop, which means you'll be unpacking the Tor files for your language into a folder on your desktop. If you want to install Tor somewhere else, choose a different folder. Once you click Install , the installer will unpack the files to your desktop (or your selected location)."
    },
    {
      "title": "Choose whether to add shortcuts.",
      "content": "Choose whether to add shortcuts. If you want to add Tor to your Start menu, keep the box checked. Otherwise, you can uncheck the box and click Finish ."
    },
    {
      "title": "Connect to the Tor network.",
      "content": "Connect to the Tor network. When you launch the Tor browser, you'll be prompted to connect to the Tor network, which allows you to view .onion websites and keeps your physical location and IP address a secret from the sites you visit. [2] X Research source Open Tor Browser from the Start menu, then click Connect to connect to the Tor network. [3] X Research source"
    },
    {
      "title": "Download the Tor installer.",
      "content": "Download the Tor installer. Go to https://www.torproject.org/download and click Download for macOS under the Apple logo to save the DMG file to your default download location."
    },
    {
      "title": "Double-click the downloaded DMG file.",
      "content": "Double-click the downloaded DMG file. It will usually be called something like tor-browser-macos-14.0.4.dmg , and you'll typically find it in your downloads folder."
    },
    {
      "title": "Follow the on-screen instructions to install the Tor browser.",
      "content": "Follow the on-screen instructions to install the Tor browser. Once installed, you will be able to launch Tor from the Applications menu."
    },
    {
      "title": "Connect to the Tor network.",
      "content": "Connect to the Tor network. When you launch the Tor browser, you'll be prompted to connect to the Tor network, which allows you to view .onion websites and keeps your physical location and IP address a secret from the sites you visit. [4] X Research source Open Tor Browser from Applications, then click Connect to connect to the Tor network. [5] X Research source"
    },
    {
      "title": "Download the Tor tarball from The Tor Project website.",
      "content": "Download the Tor tarball from The Tor Project website. To make sure you're installing the most current official release of Tor for Linux , go to https://www.torproject.org/download and click the Download for Linux link under the penguin logo."
    },
    {
      "title": "Unpack the downloaded files.",
      "content": "Unpack the downloaded files. The file will usually have a name like tor-browser-linux-x86_64-14.0.4.tar.xz . If you're using Ubuntu, and many other versions of Linux, you can unpack the files with tar without installing any extra software—just use the command tar -xf tor-browser-linux-x86_64-14.0.4.tar.xz to do so. Replace that file name with the name of the file you downloaded, which should be in your default download location. [6] X Research source"
    },
    {
      "title": "Make the \"start-tor-browser.desktop\" file executable.",
      "content": "Make the \"start-tor-browser.desktop\" file executable. In most cases, this file (which is in the extracted folder) will not be executable yet. To make it executable, enter the directory you unpacked, then run the command chmod +x start-tor-browser.desktop ."
    },
    {
      "title": "Add Tor to your desktop application list.",
      "content": "Add Tor to your desktop application list. If you want Tor to be accessible from GUI application menus, run the command .start-tor-browser.desktop --register-app . This is optional."
    },
    {
      "title": "Connect to the Tor network.",
      "content": "Connect to the Tor network. You can now start Tor from the applications menu (if you added it) or by running ./start-tor-browser.desktop & . When you launch Tor, you'll be prompted to connect to the Tor network, which allows you to view .onion websites and keeps your physical location and IP address a secret from the sites you visit. Click Connect to connect to the Tor network. Adding the ampersand to the end of the command will open Tor in a separate window so you can close the terminal without closing Tor."
    },
    {
      "title": "Get the Tor Browser app from the Play Store.",
      "content": "Get the Tor Browser app from the Play Store. To access the Tor network from your Android phone or tablet, you just need to install the official Tor app from the Google Play Store . Just be sure to find the official Tor app developed by the Tor Project—other apps called \"Tor\" are not the official Tor browser. If you'd rather install Tor from an APK, go to https://www.torproject.org/download and click Download for Android under the Android robot logo. You can then select the download link for your platform to download it. If you use F-Droid, you can also install the official Tor browser from there."
    },
    {
      "title": "Connect to the Tor network.",
      "content": "Connect to the Tor network. Once you've installed Tor, open the app from your app list, then tap Connect to connect to the Tor network. You can now visit .onion sites, as well as browse the clear web without site owners knowing your actual location."
    },
    {
      "title": "Install Orbot from the App Store.",
      "content": "Install Orbot from the App Store. There is no official Tor app in the App Store, but The Tor Project recommends using Orbot, a free Tor-powered VPN, along with a browser called Onion Browser, to access Tor on your iPhone. You can get Orbot from the App Store . [7] X Research source Once you download the app, open it, then tap Install to install the VPN on your device. Follow any prompts requesting permissions."
    },
    {
      "title": "Install Onion Browser from the App Store.",
      "content": "Install Onion Browser from the App Store. Onion Browser was not developed by The Tor Project, but the project does recommend it for accessing the Tor network on iOS. You can download Onion Browser from the App Store . [8] X Research source"
    },
    {
      "title": "Connect to the Tor network.",
      "content": "Connect to the Tor network. Open Onion Browser in your apps list, then tap the Start Orbot button. This will redirect you to the Orbot app you've just installed, where you'll need to tap Start to continue. Once connected, you can use Onion Browser to browse .onion sites and the clear web without site owners knowing your location. Check out How to Use Tor on an iPhone for tips on protecting your privacy with Tor on iOS."
    },
    {
      "title": "Download Tor from a different recommended download site.",
      "content": "Download Tor from a different recommended download site. Don't just search for other places to download Tor—The Tor Project only recommends two alternative sites from which you can download the app if it's blocked by your network: [9] X Research source https://tor.eff.org/ https://tor.calyxinstitute.org/"
    },
    {
      "title": "Use GetTor via email.",
      "content": "Use GetTor via email. If your network blocks the Tor download site, you can still get the Tor install files using the GetTor service provided by The Tor Project. To do so, send an email message to gettor@torproject.org. In the body of the message, include your operating system (for example, Windows or Ubuntu). The Tor Project will respond with official links from which you should be able to download and install Tor without your network knowing what the file is."
    },
    {
      "title": "Get Tor via Telegram.",
      "content": "Get Tor via Telegram. If you use Telegram , you can send a message to The Tor Project's Telegram bot to receive the installer. To do so, compose a message in Telegram to @GetTor_Bot, type /start , and press Enter or Return . When prompted, select your language, select Send me Tor Browser , and follow the bot's instructions to get Tor."
    }
  ]
}