{
  "url": "https://www.wikihow.com/Read-Personal-Ads",
  "title": "How to Read Personal Ads",
  "steps": [
    {
      "title": "This often describes the relationship status, gender, or sexuality of the writer.",
      "content": "This often describes the relationship status, gender, or sexuality of the writer. TLA stands for three-letter acronym, and the first letter in this acronym often reveals important information regarding the writer and what they’re looking for. With this in mind, you can interpret the letter within one of those contexts: Relationship D: Divorced M: Married S: Single W: Widow/Widower (WI, alternatively) Gender Identity/Sexual Preference(s) BI: Bisexual F: Female G: Gay L: Lesbian M: Male or Man TG: Transgender (T, alternatively) TS: Transsexual (T, alternatively, rarely used) W: Woman"
    },
    {
      "title": "The second letter usually describes the writer’s ethnicity or race.",
      "content": "The second letter usually describes the writer’s ethnicity or race. Common letters found in the second position of a TLA are as follows: A: Asian B: Black C: Christian H: Hispanic J: Jewish I: Indian L: Latino or Latina NA: Native American W: White"
    },
    {
      "title": "The third letter in the TLA indicates what the writer wants.",
      "content": "The third letter in the TLA indicates what the writer wants. This letter can serve to identify a specific type of person or a relationship type: C: Couple (CPL, alternatively) F: Female M: Male or Man TG: Transgender (T, alternatively) TS: Transsexual (T, alternatively) W: Woman"
    },
    {
      "title": "In this context, 4 means “looking for” or “searching for.”",
      "content": "In this context, 4 means “looking for” or “searching for.” The TLA structure can be modified to include the number four in place of the second letter. The first and third letters in the TLA maintain the same meanings and positioning."
    },
    {
      "title": "Personal ads can include many other acronyms.",
      "content": "Personal ads can include many other acronyms. Reading a personal ad doesn't begin and end at the TLA. Many may include acronyms that don’t have anything to do with the three-letter acronym structure described in steps one through three. Here are some examples: AL: Animal lover. ALA: All letters answered. ALAWP: All letters answered with photo. ASL: Age/sex/location. (A/S/L, alternatively) AT: All that. BB: Barebacking; bodybuilder. BBW: Big beautiful woman; big breasted woman. B&D: Bondage & discipline/domination. (B/D, alternatively) BF: Boyfriend. BHM: Big handsome man. BMW: Big Mexican woman. C: Cute. CD: Crossdresser. (C/D, alternatively) D/D: Drug/disease. D/DF: Drug/disease free. (DDF, alternatively) D/S: Dominance and submission. (D&S, alternatively) DL: Down low. DTE: Down to earth. FA: Fat admirer; fat acceptance. Fet: Fetish. FTA: Fun travel adventure. FS: Financially secure; financially stable. FWB: Friends with benefits. GF: Girlfriend. GG: Genetic girl. GSOH: Good sense of humor. Het: Heterosexual (a straight person). HWP: Height-weight proportionate. IPT: Is partial to. IRL: In real life. ISO: In search of. K: Kid(s). LD: Light drinker. LDR: Long-distance relationship. LDS: Latter Day Saints. LS: Light smoker; legally separated. LTR: Long-term relationship; lifetime relationship. MBA: Mutual business agreement; married but available. MM: Marriage-minded. MOTOS: Members of the opposite gender. MOTSS: Members of the same gender. NBM: Never been married. ND: Non-drinker; no drugs. NK: No kids. (N/K, alternatively) NS: Non-smoker. (N/S, alternatively) NSA: No strings attached. NSc: Non-scene. OHAC: Own house and car. PnP: Party 'n' play. P: Professional. RTS: Real-time sex. SAE: Self-addressed envelope. SASE: Self-addressed, stamped envelope. S&M: Sadomasochism. (S/M, SM, alternatively) SD: Social drinker. SI: Similar interests. SOH: Sense of humor. SSBBW: Super-sized big beautiful woman. SSBHM: Super-sized big handsome man. STD: Sexually transmitted disease. STI: Sexually transmitted infection. SWS: Sex without strings. TDH: Tall, dark, and handsome. TY: Thank you. TYVM: Thank you very much. VAS: Vasectomy. VGL: Very good looking. W/: With. WAA: Will answer all. WE: Well Endowed. (W/E, alternatively) WLTM: Would like to meet. W/O: Without. W/S: Watersports. (WS, alternatively) WTR: Willing to relocate. X: Extreme. Y: You; your. ##YO: ## years old. So, 32YO means \"32 years old.\""
    },
    {
      "title": "Not all acronyms are straightforward.",
      "content": "Not all acronyms are straightforward. For example, in a swingers personal ad, an \"M\" in \"M4W\" may stand for \"married looking for a woman\" as opposed to \"man looking for a woman.\" Think about the context of the personal ads when reading acronyms."
    }
  ]
}