{
  "url": "https://www.wikihow.com/Preserve-Guava",
  "title": "How to Preserve Guava",
  "steps": [
    {
      "title": "Leave the guava on the counter to ripen if they're still firm.",
      "content": "Leave the guava on the counter to ripen if they're still firm. Your guavas should be soft to the touch and have a strong, heady scent before you refrigerate them. If the guavas aren't ripe yet, let them sit on the counter for 2-3 days until the skin yields when you press on the fruit. [1] X Research source Avoid placing guava near a window because the heat and light can make it ripen too quickly. If the guava is taking a long time to ripen, try placing it in a paper bag with the top slightly open."
    },
    {
      "title": "Put the ripe guava in a plastic or paper bag.",
      "content": "Put the ripe guava in a plastic or paper bag. Before you refrigerate the guava, place the entire fruit in a bag to protect it in the refrigerator. Other fruits can give off gasses that encourage ripening, and the bag will ensure that the guava is safe. [2] X Research source Make sure the bag is clean and dry before putting the guava in it. Dirt and water can cause the guava to ripen further in the refrigerator. Remember to label the bag with the date for future reference."
    },
    {
      "title": "Place the bag in the crisper drawer of the refrigerator.",
      "content": "Place the bag in the crisper drawer of the refrigerator. Be sure to set the crisper drawer to a medium humidity to ensure that the guava doesn't become too dry or too moist. Leave the bag open slightly at the top to let air circulate through the bag and the drawer. [3] X Trustworthy Source Produce for Better Health Foundation Nonprofit organization focused on promoting plant-based diet information to help consumers live healthier lives. Go to source If possible, store the guava in a separate drawer from other fruits such as apples or oranges, which can cause the guava to go bad quickly."
    },
    {
      "title": "Use or eat the guava within 3-4 days of refrigerating.",
      "content": "Use or eat the guava within 3-4 days of refrigerating. Refrigeration will slightly prolong the life of the guava, but be sure to use it in a timely manner. After 4 days in the refrigerator, the guava will be past ripe and should be thrown away. [4] X Trustworthy Source Produce for Better Health Foundation Nonprofit organization focused on promoting plant-based diet information to help consumers live healthier lives. Go to source If you can't tell how ripe your guava is, press on the skin to feel if the fruit is very soft. Over-ripe guava will dent when you press on it."
    },
    {
      "title": "Wash and peel the skin off of the guava.",
      "content": "Wash and peel the skin off of the guava. Rinse the guava under cool water and blot the fruit dry with a paper towel. Then, use a knife or peeler to carefully remove all of the skin from each guava. You can dispose of the skin, or you can place it in a compost pile with other food scraps. [5] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source Be careful when using the peeler on the guava. The small, rounded shape can cause the peeler to slip."
    },
    {
      "title": "Cut the guava in half with a sharp knife.",
      "content": "Cut the guava in half with a sharp knife. On a cutting board, slice the guava in half through the widest part in the middle of the fruit. You can cut the halves again to make chunks, or leave them in halves to freeze. [6] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source This will help the sugar in the simple syrup to permeate into the fruit and keep it tasting sweet after the freezing process."
    },
    {
      "title": "Place the halves in an airtight container or bag.",
      "content": "Place the halves in an airtight container or bag. Once the guava is cut, get a freezer bag or airtight container with a lid. Make sure it's large enough to fit all of the fruit with about 0.5 to 1 inch (1.3 to 2.5 cm) of empty space at the top of the container, called headspace. [7] X Research source The headspace will allow for quicker freezing time, which keeps the guava fresh for a longer period in the freezer."
    },
    {
      "title": "Pour simple syrup over the guava to preserve the taste of the fruit.",
      "content": "Pour simple syrup over the guava to preserve the taste of the fruit. Simple syrup is a mixture of equal parts water and sugar that is heated to a boil to create a sweet syrup. Pour the cooled syrup into the container or bag until the guavas are completely submerged, but remember to leave enough headspace in the container. [8] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source If you've just made the simple syrup, let it cool before pouring it over the fruit. Warm syrup can cook the guava, causing a change in taste."
    },
    {
      "title": "Seal the container and place it in the freezer.",
      "content": "Seal the container and place it in the freezer. Make sure the lid of the container is closed tightly or the bag is completely sealed. Label the container or bag with the date and let it sit in the freezer undisturbed for at least 12 hours before thawing. [9] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source If you're going to freeze the guavas for a long period of time, avoid placing them in the door of the freezer. The door experiences more temperature changes than the rest of the freezer, which can cause thawing."
    },
    {
      "title": "Use the guava within 1 year of freezing.",
      "content": "Use the guava within 1 year of freezing. While guava can last in the freezer for long periods of time, the taste of the fruit will deteriorate after a year. When you're ready to use it, place the guava in the refrigerator for 2-3 hours to thaw before taking it out of the container. [10] X Research source If you're not sure how to use your frozen guava, you can try making juice , baking guava-based pastries, or even whipping up a guava barbecue sauce!"
    }
  ]
}