{
  "url": "https://www.wikihow.com/Prepare-for-Death-of-Spouse",
  "title": "How to Prepare for Death of Spouse",
  "steps": [
    {
      "title": "Seek guidance from healthcare professionals about end-of-life care.",
      "content": "Seek guidance from healthcare professionals about end-of-life care . In facing the death of a spouse or loved one, you may feel overwhelmed about what to do in caring for your spouse. If your spouse has been diagnosed with a terminal illness, and no further treatments are being done, talk with your doctor or healthcare providers about options through hospice and palliative care. Often the hospital's social work department is most helpful in this situation. Consider contacting hospice agencies directly about what they may offer. Hospice is a Medicare benefit that will generally pay 100% of medical expenses related to your spouse's primary diagnosis. Hospice benefits are often offered through private insurance too. [1] X Research source"
    },
    {
      "title": "Be present and provide reassurance.",
      "content": "Be present and provide reassurance. Provide a loving hand, and a soothing voice, to your spouse. Let them know that that they have permission to go, as it may provide them a sense of peace and comfort. Also, really focus on how you can be present for them. For instance, you might work together to complete a task from their bucket list, or you might just be as attentive to their needs as possible. [2] X Expert Source Ken Breniman, LCSW, C-IAYT Licensed Clinical Social Worker & Certified Yoga Therapist Expert Interview. 24 April 2020. Ask the person what they need to be comfortable. They may want items from home, etc. They may want more jolly music or to look through old photos, etc. Respect what they do or do not want to do — if you think they might like something, and they say no, then respect their wishes and don't force it on them. Create a peaceful atmosphere with soft lighting and soothing music. Reduce noise where possible. If appropriate, engage in prayer for your loved one in this time of need. Read a poem, book, or spiritual passage to your loved one. You might also gently massage their hands or feet, or simply hold hands."
    },
    {
      "title": "Find ways to say goodbye.",
      "content": "Find ways to say goodbye. Saying goodbye to a loved one is heart-breaking, but can be a great comfort for the loved one who is dying. While you may have many feelings of sadness, fear, or loneliness, avoid burdening your loved one with these feelings in their final moments. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Allow family and friends to be share their good-byes, and give them an opportunity to visit or say a few words. Often the ability to hear is the last of the five senses to go, so while your loved one may seem unaware, they may be listening. [4] X Research source Allow them to reminisce and reflect on their life. Check in with your spouse regularly to see if they need some quiet time."
    },
    {
      "title": "Recognize the signs and symptoms when death is near.",
      "content": "Recognize the signs and symptoms when death is near. Your healthcare providers may help provide education about signs and symptoms for a person's end-of-life care, depending on the diagnosis. In general, a person who is at end-of-life will often sleep more, eat and drink less, become more withdrawn, and communicate less during the final one to three months before death. In the final weeks, the loved one will likely become bed-bound and may experience the following: [5] X Research source Continued loss of appetite and thirst, with difficulty in swallowing Increased pain, that can be treated, and fatigue Changes in blood pressure, heart rate, and breathing Congested breathing due to secretions that build up in the throat, which sound like gurgling Changes in body temperature and skin Possible disorientation or hallucinations such as talking to people who aren't there Slowing of urine and bowel output Changes in sleeping patterns"
    },
    {
      "title": "Engage in a family discussion about your spouse's end-of-life wishes.",
      "content": "Engage in a family discussion about your spouse's end-of-life wishes. By having an open and honest conversation early, this may reduce stress in the long run. In terms of medical care and treatment, work with your spouse and family on completing an advanced directive and medical treatment preferences regarding their care. Often you want to have this conversation, then break for a while to let everyone process and think about it. This helps you and your family not be ruled by your emotions when making decisions. Reconnect later to hash out the official decisions. These can include the following: [6] X Research source Appointing a \"health care agent\" or Medical Power of Attorney. You are the default decision-maker regarding your spouse's care, unless another family member is appointed via the advance directive; or if you are unable to mentally or physically assist with decisions. Determining medical treatment preferences, such as Do Not Resuscitate (DNR) Status if no heart rate, or unable to breathe independently. Deciding if you wish to donate your organs or body for medical purposes."
    },
    {
      "title": "Make a living will and get your finances in order.",
      "content": "Make a living will and get your finances in order. Talk with a lawyer about estate planning, and how to address any financial assets that may change ownership if your spouse passes. Obtain current information about your spouse's financial holdings, debts, and assets, in order to avoid headaches and surprises after your loved one passes. [7] X Trustworthy Source American Bar Association Leading professional organization of lawyers and law students Go to source If seeking legal advice is too costly, look into lower cost options through your state's legal aid program, or if you or your spouse are over 60, there may be a senior legal aid hotline through your state."
    },
    {
      "title": "Discuss funeral preferences and ways to memorialize.",
      "content": "Discuss funeral preferences and ways to memorialize. Depending on your family's spiritual background, there may be specific wishes, such as burial versus cremation. There may also be preferences about location of the burial, or where to scatter the ashes. By understanding your loved one's specific wishes, you can honor their choices. You or other family members may have differences of opinion about how to memorialize a loved one, but the best way is to respect those choices made by your spouse. Consider calling various funeral homes, before your loved one is near death, in order to understand the varying costs and options available. By understanding your budget for funeral expenses, you can be better prepared when the time comes, and not face additional financial burdens."
    },
    {
      "title": "Keep a list of your spouse's personal contacts and financial information.",
      "content": "Keep a list of your spouse's personal contacts and financial information. In our modern age, your spouse may have many online accounts for email, banking, retirement, insurance, and bill paying. Collect the passwords and account details of all these accounts that need to be monitored, paid, and closed. As the spouse, you will likely become the primary person responsible for handling the bills, and closing accounts, in your loved one's name. Consider making a \"Lifebox\" folder with all the various details of the spouse's medical, financial, and personal contacts. In an emergency, it will be easier to reference this folder, than to rummage through files, or piles of paper."
    },
    {
      "title": "Honor your spouse's memory and legacy.",
      "content": "Honor your spouse's memory and legacy. Discuss with your spouse and family if there are ways to honor your spouse after they have passed. Depending on what your spouse loved most, these actions could be big or small, and they can either be very personal or very public, depending on what feels the most authentic to you and your spouse. [8] X Expert Source Ken Breniman, LCSW, C-IAYT Licensed Clinical Social Worker & Certified Yoga Therapist Expert Interview. 24 April 2020. Plant a tree Dedicate something in your spouse's name Give or donate personal possessions, or your time, to the community Create a scrapbook of happy memories Set up a charitable fund in your spouse's name"
    },
    {
      "title": "Reduce caregiver burnout.",
      "content": "Reduce caregiver burnout. If your spouse has a terminal illness, you may be overwhelmed by the level of care needed. Reach out to healthcare professionals such as doctors, nurses, and social workers to identify ways to reduce your physical and emotional stressors. Respite options may be available through in-home care, or care at a facility. [9] X Research source Ask friends or family to sit with your loved one, so that you can run errands, or have a short break. Be sure to take really good care of yourself during this time. It might be hard to reach outward, but it's important to proactively seek support from your friends, family, or a support group, so you're not taking everything on yourself. [10] X Expert Source Ken Breniman, LCSW, C-IAYT Licensed Clinical Social Worker & Certified Yoga Therapist Expert Interview. 24 April 2020. You appetite may be down, but try to eat something a few times per day. Also, nap when you feel like you could sleep, even if that's not during the night. Find other ways for family to be useful in helping with your spouse's care. If someone offers to help, say yes. Most of the time our instinct is to say thank you, I'm fine. Then later we regret it when we are overwhelmed with things to do. Challenge yourself to find something they can do to lighten your load. Saying yes along the way can keep things from snowballing out of control."
    },
    {
      "title": "Give yourself permission to feel your emotions.",
      "content": "Give yourself permission to feel your emotions. Be open with people who you trust about your feelings. It is natural to be sad, upset, anxious, afraid, and lonely when your spouse is near death or has passed away. This is one of the most difficult transitions you may ever experience. Here are some ways to get help: [11] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Talk one-on-one with trusted family and friends about what you're feeling. If appropriate, talk with a chaplain or other religious support system about your feelings of loss. Engage in activities that help you cope effectively and positively with your emotions. Avoid alcohol and other substances as a means to cope. Join a grief and loss support group, and share with those who have had similar experiences. Talk one-on-one with a grief counselor."
    },
    {
      "title": "Recognize that there may be both emotional and financial challenges after a spouse has passed.",
      "content": "Recognize that there may be both emotional and financial challenges after a spouse has passed. If your spouse was the primary breadwinner, you may face financial turmoil about how to manage bills, or possibly taking on the care of children or family members without your spouse's support. This can be a shock. It is important to discuss with friends and family about the options available, and if adjustments to living situations need to be made. See if your spouse has life insurance to help with bills in the short term. You may even be able to withdraw your spouse's life insurance policy earlier without penalty, when a terminal illness has been diagnosed. Life insurance policies may also have a cash value component, but this may be less than if used upon death. [12] X Research source If you or your spouse are over retirement age, you may have access to spousal benefits via Social Security. A reduction in income may change your standard of living, or you may need to find work. Put the word out that you need help finding employment. You will generally have an army of people looking for some way to help."
    },
    {
      "title": "Recognize that your time to heal is your journey, and no one else's.",
      "content": "Recognize that your time to heal is your journey, and no one else's. Each person's experience with grief and loss is theirs alone, and cannot be determined by family or social pressures. Family and friends often want to help, but may not always know how. Be mindful that their hearts are often in the right place. Be open to accepting hope, love, and peace for the future. Family and friends may encourage you to \"move on\" before you are ready, so kindly ask them to support you and respect your time frame. They will often say these things out of their own discomfort because they don't know what to do when you are grieving. Remember that is about them, not you. Forgive yourself, and don't let regrets about what should have been, or what you could have done, stand in the way of remembering the good things that you and your spouse share. Your spouse will someday pass away, but you can still continue to honor their memories — past, present, and future. Remember that it is never too early to talk about the above-mentioned arrangements — even if all parties are healthy. Take action now to avoid having to deal with that stress while trying to grieve."
    }
  ]
}