{
  "url": "https://www.wikihow.com/Roll-for-Stats-5e",
  "title": "How to Roll Stats: Best Ways to Generate Ability Scores in D&D 5e",
  "steps": [
    {
      "title": "Stats reflect your character’s mental and physical prowess.",
      "content": "Stats reflect your character’s mental and physical prowess. In D&D, “stats” is the casual term for “ability scores,” which are basically measures of your character’s innate capabilities and training. Is your character as wise as an owl? Strong as an ox? Ability scores determine their strengths and weaknesses, affecting ability check and saving throw rolls you’ll make as you play. [1] X Research source There are 6 stats (ability scores) in total: Strength (STR). This determines a character's physical power. Wisdom (WIS). This determines a character's perception and insight. Dexterity (DEX). This determines a character's agility. Intelligence (INT). This determines a character's memory and mental acuity. Constitution (CON). This determines a character's health and endurance. Charisma (CHA). This determines a character's force of personality."
    },
    {
      "title": "Each class in D&D typically has a primary stat and 2 secondary stats.",
      "content": "Each class in D&D typically has a primary stat and 2 secondary stats. Every character you’ll make for D&D will have a class—which is the equivalent of their profession or skillset . For example, wizard, fighter, and rogue are all D&D classes. Depending on your chosen class, your character will rely on a few different stats for their abilities, making rolling stats an important task! [2] X Research source For example, wizards are primarily spellcasters, and their spells are intellect-based. That means the higher their Intelligence score is, the more effective they’ll be. Similarly, a martial class like a fighter relies more heavily on strength or dexterity. Intelligence isn’t a high priority for them, but they’ll need a high STR or DEX stat to make the most of their abilities. Keep in mind that every race option (elves, dwarves, and so on) comes with a couple of ability score bonuses. This can buff up ability scores you didn't roll well on or make great ability scores exceptional."
    },
    {
      "title": "A character’s stats also determines their stat modifiers.",
      "content": "A character’s stats also determines their stat modifiers. Every ability score (stat) comes with a modifier based on the score’s total, and that modifier is what players use when they roll ability checks and saving throws. The higher your character’s ability score is, the higher their stat modifier will be. This is a good thing because high modifiers give you a greater chance of succeeding on rolls! A 10 is considered average for stats, so the modifier is 0. Stats lower than 10 have lower modifiers (-1, -2, and so on), while stats higher than 11 have higher modifiers. You can refer to the D&D rulebook for a modifier table. Say you roll a 12 for one of your character’s stats and assign it to their Charisma. The modifier for a 12 is +1, which means you’ll add a +1 to every Charisma-based check and saving throw you make."
    },
    {
      "title": "Roll 4 x 6-sided dice, remove the lowest, and add the other numbers.",
      "content": "Roll 4 x 6-sided dice, remove the lowest, and add the other numbers. Calculating an ability score for your character is easy; grab 4 x 6-sided dice (4d6) and roll them. Then, find the lowest number you rolled and set it aside—you don’t need to include it in the final score. Add up the total of the other dice, and you have your ability score! [3] X Research source For example, say you roll 4d6 and get a 2, 3, 5, and 6. Discard the 2 since it’s the lowest number, and add 3, 5, and 6 for a total of 14. Most character stats fall somewhere between an 8 (considered fairly low) and 18 (the highest you can roll). This is usually referred to as the “Manual/Rolled” method for calculating ability scores. It’s also the most widely used because it’s old-school; it's the original stat-rolling method from when D&D first began."
    },
    {
      "title": "Continue rolling 4d6 die until you have 6 stats calculated.",
      "content": "Continue rolling 4d6 die until you have 6 stats calculated. Now that you have your character’s first stat, repeat the first step another 5 times—roll 4d6, remove the lowest number, add up the die, and make a note of the total. Once you have 6 stats prepared, you’re ready to assign them all to your character’s ability scores. [4] X Research source For example, after rolling the 14 above, you might continue rolling dice in groups of 4d6 and end up with the 6-stat array: 9, 10, 13, 14, 15, and 17. You can assign stats however you want, but it’s a good idea to hold off on assigning any until you’ve rolled all 6. That way, you can look at all your options and figure out where each number would best suit your character."
    },
    {
      "title": "Assign each calculated stat to one of your character’s ability scores.",
      "content": "Assign each calculated stat to one of your character’s ability scores. Think carefully about how you want your character to function before you match your rolled stats with your character’s 6 main ability scores. Most people tend to do this according to the ability scores that will be most valuable to their character, based on their class and abilities—but, ultimately, the choice is up to you. [5] X Research source For example, say you’re playing a sorcerer. Sorcerers rely on Charisma-based spellcasting in combat, making Charisma their primary stat. Assigning the 17 to your character’s CHA score would make the most sense! From there, assign the other stats based on how important you think they’ll be. For example, a sorcerer will probably make a lot of Concentration saves, which relies on Constitution, so assigning the 15 to their CON score is a solid choice. Some enjoy assigning stats based on roleplaying potential rather than effectiveness in battle. For example, sorcerers don’t really need strength, but you could play a ridiculously strong bodybuilder sorcerer anyway."
    },
    {
      "title": "Standard Array",
      "content": "Standard Array The Standard Array is the most structured and simple way to assign ability scores for your character. Essentially, this method gives you 6 pre-determined stats: 8, 10, 12, 13, 14, and 15. From there, all you have to do is decide where to assign each stat that you’ve been given. [6] X Research source This is a useful method for beginners or anyone who prefers using a set of “average” stats to taking a risk and rolling them. It’s also useful if you’re making a character in a hurry—especially for a quick one-shot game or creating a relatively short campaign ."
    },
    {
      "title": "Point Buy",
      "content": "Point Buy The Point Buy system basically gives you 27 “points” to work with and build your own stats rather than rolling them. Your character will start, by default, with an 8 for every ability score. Then, you can add those 27 points to the base scores, spending a maximum of 9 points on a single score. This ensures that every character you make is fairly balanced. [7] X Research source To increase any stat below 13, it only takes 1 point. However, scores of 14-15 take 2 points to increase. You can find a complete table in the D&D 5e rulebook. For example, if you begin with an intelligence score of 8 and want to increase it to 15, it’ll consume a total of 9 points (5 points for every increase through 13 and 4 points for increasing the score from 13 to 15). Some players like this method because it allows them to customize their stats without having to roll dice."
    },
    {
      "title": "Pros",
      "content": "Pros Plenty of D&D players feel that rolling for stats is just part of the fun of making a brand-new character! It’s old-school, and there’s a sense of excitement because it’s all about the luck of the draw. You also have the chance to roll a higher stat than you can get using the other methods (up to an 18), and it can be really good team bonding to roll your stats together before the game. [8] X Research source There are entertaining roleplaying opportunities even when you roll low stats! After all, playing D&D tends to be more enjoyable when you focus on having fun rather than the results of every roll. For example, consider the humor in playing a low-intelligence fighter who can’t tie their own shoes or a low-constitution wizard who needs to be carried every time the party does something strenuous!"
    },
    {
      "title": "Cons",
      "content": "Cons The main downside to rolling your stats is, of course, the potential to get some really low ability scores. There’s even a possibility, slim though it may be, that you’ll roll a 3 (if you roll all 1s)—and that’s a pretty dismal ability score! Players who don’t like leaving their character’s abilities up to chance might not enjoy rolling their stats as much. [9] X Research source Rolling can also be risky because it might feel slightly unfair if your stats are much lower overall than another person's. If you’re worried about rolling too low on your stats, talk to your DM (Dungeon Master) . There are plenty of homebrew rules out there you can use to level the playing field—or you could just use one of the other methods listed here."
    },
    {
      "title": "Roll stats as a group and distribute the scores equitably.",
      "content": "Roll stats as a group and distribute the scores equitably. Group rolling is more than just a team-building experience; it can actually help every player feel a little more comfortable with their character’s stat rolls. Get together with all the players in your group and roll your 6 stats as usual. Then, record every stat in a group pool and assign them together, deciding who gets which number and how to split them evenly. [10] X Research source With group rolling, you can exchange a low stat you rolled with a high stat that another player rolled if you feel like you have too many low stats."
    },
    {
      "title": "Reroll any 1s as you calculate stats.",
      "content": "Reroll any 1s as you calculate stats. Some DMs may allow you to simply reroll 1s that you get as you roll your 4d6 die for each stat. Talk to your DM about doing this first (or, if you’re the DM, let your players all know that this is an option for them). A good DM will be willing to address your concerns somehow, and this is a good way to prevent super-low rolls. [11] X Research source If you or your DM don’t want to reroll every 1 that might come your way, you could institute a house rule allowing a certain number of rerolls. That way, you must be a little judicious about rerolling dice."
    },
    {
      "title": "Roll 7 sets of numbers and drop the lowest.",
      "content": "Roll 7 sets of numbers and drop the lowest. Another way to avoid an unusually low score is to roll your stats as usual, then roll a 7th stat as well. After that, you can drop the lowest stat you rolled, thereby ensuring that even if you have a couple of mediocre scores, your character won’t have too many low numbers on their character sheet. [12] X Research source Alternatively, you could roll all 6 of your stats and then replace the lowest one with a 16. This guarantees you’ll have at least one higher stat in your array and not as many low stats."
    },
    {
      "title": "Allow larger stats using the Point Buy method.",
      "content": "Allow larger stats using the Point Buy method. Some players like the idea of Point Buy but feel like they can’t get a high stat using that method (since the highest you can get from Point Buy, barring racial bonuses, is a 15). In that case, talk to the DM about instituting house rules to allow players to give their characters a higher stat (16, 17, or 18, for example) using Point Buy. [13] X Research source This rule is easy enough to follow; simply allow players to spend 3 points each to increase a stat to 16 or 17, 4 points for 18, and so on."
    }
  ]
}