{
  "url": "https://www.wikihow.com/Recognize-Signs-of-Autism-in-Yourself",
  "title": "How to Recognize Signs of Autism in Yourself",
  "steps": [
    {
      "title": "Think about how you react to social cues.",
      "content": "Think about how you react to social cues. Autistic people have trouble understanding subtle social cues. This can make a variety of social situations difficult, from making friends to getting along with co-workers. Consider if you've experienced things like: Having trouble understanding how another person is feeling (e.g. wondering if they are too sleepy to talk or not) Being told that your behavior was inappropriate, awkward, strange, or impolite [1] X Expert Source George Sachs, PsyD Licensed Psychologist Expert Interview. 9 October 2020. Not realizing that someone is bored of talking and wants to do something else Frequently feeling mystified by other people's behavior Having trouble making eye contact with others [2] X Expert Source George Sachs, PsyD Licensed Psychologist Expert Interview. 9 October 2020. Overthinking social interactions for fear you'll slip up without realizing it"
    },
    {
      "title": "Ask yourself if you have trouble understanding other people's thoughts.",
      "content": "Ask yourself if you have trouble understanding other people's thoughts. While autistic people may feel empathy and care for others, \"cognitive empathy\" (the ability to figure out what other people are thinking based on social cues such as tone of voice, body language, or facial expression) is usually impaired. [3] X Research source Autistic people often struggle with figuring out the subtleties of others' thoughts, and this can lead to misunderstandings. They usually rely on other people to be clear with them. Autistic people might have trouble figuring out what someone's opinion on something is. Detecting sarcasm and lies can be hard, because autistic people may not realize when someone's thoughts are different from what they're verbalizing. Autistic people may not always pick up on non-verbal hints. In extreme cases, autistic people have extreme difficulty with “social imagination” and cannot comprehend that other people have ideas that differ from theirs (“theory of mind”). [4] X Research source"
    },
    {
      "title": "Consider your use of routines and feelings towards the unexpected.",
      "content": "Consider your use of routines and feelings towards the unexpected. Autistic people often rely on familiar routines to feel stable and secure. Scheduled changes in routine, unfamiliar new events, and sudden changes in plans can be upsetting to autistic people. [8] X Expert Source George Sachs, PsyD Licensed Psychologist Expert Interview. 9 October 2020. [9] X Research source Many autistic people don't like surprises and uncertainty. This can look like: Eating the same foods over and over Having precise morning and bedtime routines Making mistakes easily, such as skipping meals or pills, without a routine to ground you Feeling upset, nervous, or angry if an expected thing changes, such as a restaurant no longer offering the same food you always order"
    },
    {
      "title": "Watch yourself to see if you stim.",
      "content": "Watch yourself to see if you stim . Stimming, or self-stimulatory behavior, is much like fidgeting, and it's a type of repetitive movement done for self-calming, [10] X Research source focusing, expressing emotions, communication, and coping with difficult situations. While everyone stims, it's especially important and frequent for autistic people. If you haven't been diagnosed yet, your stims may be on the more subtle side. You may have also \"unlearned\" certain stims from childhood if your stimming was criticized. [11] X Research source Flapping or clapping hands Rocking Hugging yourself tightly, squeezing your hands, or piling heavy blankets on yourself Tapping toes, pencils, fingers, etc. Crashing into things for fun Playing with hair Pacing, spinning, or jumping Looking at bright lights, intense colors, or moving GIFs Singing, humming, or listening to a song on repeat Smelling soaps or perfumes"
    },
    {
      "title": "Identify any sensory issues.",
      "content": "Identify any sensory issues. Many autistic people have Sensory Processing Disorder (also known as Sensory Integration Disorder), which means that the brain is overly sensitive, or not sensitive enough, to certain sensory input. You may find that some of your senses are amplified, while others might be dulled. Here are some examples: [12] X Research source Sight —Becoming overwhelmed by bright colors or moving objects, not noticing things like road signs, attraction to the sight of hustle and bustle Hearing —Covering ears or hiding from loud noises such as vacuum cleaners and crowded places, not noticing when people are talking to you, missing things that people say Smell —Feeling disturbed or nauseated by smells that don't bother others, not noticing important smells like gasoline, loving strong scents and buying the strongest-smelling soaps and food available Taste —Preferring to eat only bland or \"kid food,\" eating extremely spicy and flavorful food while disliking anything bland, or disliking trying new foods Touch —Being bothered by certain fabrics or clothes tags, not noticing when people touch you lightly or you are injured, or constantly running your hands along everything Vestibular —Getting dizzy or sick in cars or on swing sets, or constantly running around and climbing things Proprioceptive —Constantly feeling uncomfortable sensations in your bones and organs, bumping into things, or not noticing when you are hungry or tired"
    },
    {
      "title": "Notice a need for more alone time.",
      "content": "Notice a need for more alone time. Keeping up with the demands of the outside world can be hard for autistic people. Thus, they might need more quiet time to recharge and recover. Lots of time for peace and quiet is essential for autistic people's wellbeing. A packed schedule can be a nightmare for autistic people. An autistic person may need a sparser schedule (e.g. taking fewer credit hours in college) to keep peace of mind. Sharing a bedroom with a roommate can be difficult for autistic people because they need a quiet space to retreat to when overwhelmed."
    },
    {
      "title": "Consider whether you experience meltdowns or shutdowns.",
      "content": "Consider whether you experience meltdowns or shutdowns. Autistic people may bottle up stress until finally breaking down in overwhelm. This can look like a meltdown or shutdown. A meltdown is a dramatic outburst of overwhelm, anger, or panic. [13] X Research source [14] X Research source [15] X Research source A shutdown is a quieter response in which a person becomes withdrawn, slow, and less able to move or communicate. [16] X Research source [17] X Research source These events aren't intentional and the person will need time to recover afterwards. You may view yourself as sensitive, hot-tempered, and/or immature. How rarely or often you experience these will depend on how much stress is in your life and how many coping strategies you have to de-stress."
    },
    {
      "title": "Think about your executive function.",
      "content": "Think about your executive function. Executive function is the ability to stay organized, manage time, and transition smoothly. Autistic people often struggle with this skill and may need to use special strategies (such as rigid schedules) in order to adapt. Symptoms of executive dysfunction include: [18] X Research source Trouble switching between activities Procrastination and difficulty starting a task Trouble with time management Forgetting things easily Forgetting to do things, from homework to laundry to brushing your teeth Losing things Disorganization and messiness (Is your room/desk a disaster?) Difficulty managing strong emotions Impulsivity"
    },
    {
      "title": "Consider your passions.",
      "content": "Consider your passions . Autistic people often have intense and unusual passions, which are called special interests. They can be anything, from fire trucks to writing fiction to autism itself. Special interests are notable in their intensity, and finding a new special interest can feel like falling in love. Here are some signs that your passion is stronger than what non-autistics experience: Talking about your special interest for long periods of time, and wanting to share it with others Being able to concentrate on your passion for hours; losing track of time Organizing information for fun, such as charts, tables, and spreadsheets Being able to write/say long and detailed explanations of nuances of your interest, all off of the top of your head, perhaps even quoting passages Feeling excitement and bliss from enjoying your interest Correcting people who are knowledgeable about the subject Being wary of talking about your interest, for fear that you'll annoy people"
    },
    {
      "title": "Think about how easy it is for you to talk and process speech.",
      "content": "Think about how easy it is for you to talk and process speech. Autism is often associated with difficulties related to spoken language, the degree of which greatly varies from person to person. If you're autistic, you may experience things like: Learning to speak later in life (or not at all) Difficulty speaking or losing the ability to speak, when overwhelmed Word-finding problems Long pauses in conversations so you can think Avoiding difficult conversations because you aren't sure you can express yourself Struggling to understand speech when the acoustics are different, such as in an auditorium or from a movie without subtitles Not remembering spoken information, especially longer lists Needing extra time to process speech (e.g. not reacting in time to commands like \"Catch!\")"
    },
    {
      "title": "Notice literal thinking.",
      "content": "Notice literal thinking. While autistic people are capable of abstract thought, they tend to be literal thinkers by nature. Sometimes this is very subtle, especially when the autistic person has developed workarounds and/or their loved ones show understanding. Here are some ways literal thinking can present itself: [19] X Research source [20] X Research source [21] X Research source Not catching sarcasm or exaggeration, or being confused when others are not Misunderstanding figurative language, such as thinking \"wrap it up\" means \"wrap up the package\" when the speaker meant \"I want you to finish up.\" Not picking up on subtext, such as when \"I don't know if I have enough money\" actually means \"please pay for my food.\" Making literal jokes for the amusement of others, such as slapping the pavement when told, \"it's time to hit the road.\""
    },
    {
      "title": "Think about masking behavior.",
      "content": "Think about masking behavior. \"Autistic masking\" is the process of suppressing your natural instincts and trying to blend in with non-autistic people. While most people adjust their behavior a little, autistic people feel much more pressure to make much larger changes to avoid judgment and abuse. Masking can lead to burnout, fatigue, loss of identity, and mental health problems. [22] X Research source Here are some things an autistic person may do to \"mask\" their autism: [23] X Research source [24] X Research source Force or fake eye contact even though it's uncomfortable Suppress stimming or redirecting to subtler stims (like leg bouncing instead of hand flapping) Fake a smile Avoid talking about their interests Practice scripts and expressions to use in conversation Study how to behave \"appropriately\" in different situations"
    },
    {
      "title": "Search for autism quizzes online.",
      "content": "Search for autism quizzes online. Quizzes such as the AQ and RAADS can help give you a sense if you're on the spectrum. They are not a substitute for a professional diagnosis, but they are a useful tool. Some professional questionnaires are available online. [25] X Research source"
    },
    {
      "title": "Read the official diagnostic criteria.",
      "content": "Read the official diagnostic criteria. Read the DSM-5 criteria and think them over. It may help to check a few reputable websites for overviews of autism as well. The DSM-5 uses clinical language that may be hard to understand. Autistic writers have written examples that help translate it to everyday life. [26] X Research source [27] X Research source"
    },
    {
      "title": "Turn to autism-friendly organizations.",
      "content": "Turn to autism-friendly organizations . A truly autism-friendly organization is usually run partially or completely by autistic people, such as the Autistic Self-Advocacy Network and the Autistic Women and Nonbinary Network. These organizations provide a much clearer view of autism than organizations run exclusively by parents or family members do. [28] X Research source Autistic people best understand their own lives and can offer the most insights. Avoid toxic and negative autism organizations. Some autism-related groups say terrible things about autistic people, and may push pseudoscience. [29] X Trustworthy Source Austistic Self Advocacy Network Nonprofit organization run by and for individuals on the autism spectrum that empowers autistic people through education and public advocacy Go to source [30] X Research source Autism Speaks is a prominent example of an organization that uses disaster rhetoric. Look for organizations that provide a more balanced point of view, and empower autistic voices instead of excluding them."
    },
    {
      "title": "Read the work of autistic writers.",
      "content": "Read the work of autistic writers. Many autistic people love the blogosphere, where they can communicate freely. Many bloggers will discuss signs of autism and offer advice for people who are questioning whether they're on the spectrum."
    },
    {
      "title": "Turn to social networking.",
      "content": "Turn to social networking. Many autistic people can be found in hashtags such as #ActuallyAutistic and #AskingAutistics. In general, the autistic community is very welcoming to people who are wondering if they are autistic, or who are self-diagnosed. To hear from others who are wondering if they're autistic, check out wikiHow's \"I think I may be autistic, how do you tell?\" forum ."
    },
    {
      "title": "Start researching therapies.",
      "content": "Start researching therapies. What types of therapies do autistic people sometimes need? Do any of the therapies sound like they would help you? Check which therapies have scientific backing. Remember that every autistic person is different. A therapy type that is useful to someone else may not be useful to you, and a therapy that someone else found unhelpful may help you. Be careful: scammers often target autistics and their families with fake therapies that may waste your money or even cause harm. Some therapies, notably ABA , may involve cruel methods or goals that focus on training you to act \"normal\" instead of helping you be healthy and happy."
    },
    {
      "title": "Research similar conditions.",
      "content": "Research similar conditions. Many autistic people have co-occurring conditions that can benefit from treatment. It's also possible to mistake another condition for autism. Autism can come with sensory processing disorders , anxiety disorders , depression, epilepsy, gastrointestinal issues, ADHD , sleep disorders, and other conditions. Autism can be confused with conditions like sensory processing disorder, ADHD , social anxiety , schizoid personality disorder , complex PTSD , reactive attachment disorder , selective mutism , nonverbal learning disability, and others."
    },
    {
      "title": "Keep in mind that autism is inborn and lifelong.",
      "content": "Keep in mind that autism is inborn and lifelong. [31] X Research source Autism is mostly or completely genetic, and it begins in the womb [32] X Research source (although behavioral signs don't become noticeable until toddler years or later). People are born autistic, and will always be autistic. However, this is nothing to be afraid of. Autistic people's lives can improve with the right support, and it's possible for autistic adults to lead happy, fulfilling lives. The most popular myth about autism causes is that vaccines cause autism, which has been disproven by over a dozen studies. [33] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source [34] X Research source [35] X Research source [36] X Research source This hoax was engineered by a single researcher who faked data and was hiding financial conflicts of interest. His work has been thoroughly disproven since, and he has lost his license for malpractice. [37] X Trustworthy Source Immunization Action Coalition Nonprofit organization focused on promoting the use of vaccines by distributing information about vaccines and the diseases they prevent. Go to source Reported rates of autism likely aren't increasing because more autistic people are being born. [38] X Research source Experts are becoming better at identifying autism, especially in girls and people of color (who have been historically overlooked [39] X Research source ). Autistic children become autistic adults. Stories of people who \"recover\" from autism either feature people who have learned to hide their autistic traits (and may suffer mental health problems as a result), or who were never autistic in the first place."
    },
    {
      "title": "Realize that autistic people are not automatically devoid of empathy.",
      "content": "Realize that autistic people are not automatically devoid of empathy. Autistic people may struggle with the cognitive parts of empathy, while still being deeply caring and kind. While autistics may not understand someone's feelings, they generally experience average amounts of emotional empathy and above-average amounts of distress when they see someone who is upset. [40] X Research source Autistic people may have a strong desire to help people, especially through concrete means such as organizing or giving them items they need. For example, an autistic person may be quick to offer tissues and a comfort object if they see someone crying. [41] X Research source Some autistic people experience intense affective (emotional) empathy, sometimes to the point that it is painful. [42] X Research source Experiences with empathy may vary with the presence of alexithymia, [43] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source [44] X Research source a condition that impacts someone's emotional understanding."
    },
    {
      "title": "Don't assume that autistic people are lazy or intentionally rude.",
      "content": "Don't assume that autistic people are lazy or intentionally rude. Autistic people have to try harder to conform to many social expectations of politeness. Sometimes they fail. They may realize it and apologize, or need someone to tell them that they missed their mark. Negative assumptions are the fault of the person who makes them, not of the autistic person. Rather than thinking \"outside the box,\" autistic people do not see the box at all. [45] X Research source Thus, they may not understand what is expected in social situations. This can result in a lot of guesswork. Some everyday situations can be uncomfortable or overwhelming for autistic people. This can make socializing more difficult. In this case, it's not any person who needs to change, but the environment."
    },
    {
      "title": "Realize that autism is an explanation, not an excuse, for inappropriate behavior.",
      "content": "Realize that autism is an explanation, not an excuse, for inappropriate behavior. Most times when autism is brought up after a disagreement, it is as an explanation for the autistic person's behavior, not an attempt to escape consequences. When an autistic person brings up their diagnosis during a misunderstanding, it's usually because they want you to know they're trying hard, not because they want to escape consequences. Usually, people who complain about autistic people \"using it as an excuse\" either met one bad person, or are upset about autistic people showing signs of their disability. This isn't helpful or kind."
    },
    {
      "title": "Don't believe the myths about autism and violence.",
      "content": "Don't believe the myths about autism and violence. While media speculation has sometimes blamed violent or harmful behavior on autism, the reality is that the large majority of autistic people are nonviolent. In fact, an autism diagnosis is associated with reduced violent behavior in childhood and adult years. [46] X Research source [47] X Research source When autistic children do lash out, it is usually in reaction to provocation. They are less likely to initiate violence than non-autistic children are. [48] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The average autistic person is very unlikely to hurt anyone and would probably be very upset if they accidentally did so."
    },
    {
      "title": "Rid yourself of the idea that there's something wrong with stimming.",
      "content": "Rid yourself of the idea that there's something wrong with stimming. Stimming is a natural mechanism that helps with self-calming, concentration, meltdown prevention, and expression of feelings. Preventing someone from stimming is damaging and wrong. There are only a few possible instances in which a stim is a bad idea: It causes bodily harm or pain. Head-banging, biting oneself, or hitting oneself, are all bad things. These can be replaced by a harmless stim, such as head-shaking and biting chewy bracelets. It violates someone's personal space. For example, playing with someone else's hair without their permission is a bad idea. Autistic or not, people need to respect others' personal space. It prevents people from working. It's good to be quiet in places where people work, such as schools, offices, and libraries. If people are trying to focus, it's good to stim subtly , or go to a place where quiet isn't necessary."
    },
    {
      "title": "Recognize that people who catastrophize about autism are wrong.",
      "content": "Recognize that people who catastrophize about autism are wrong. Autism is not a disease, not a burden, and not a life-destroying disorder. [49] X Trustworthy Source Austistic Self Advocacy Network Nonprofit organization run by and for individuals on the autism spectrum that empowers autistic people through education and public advocacy Go to source Many autistic people are capable of living worthwhile, productive, and happy lives. Autistic people have written books, founded organizations, run nationwide or worldwide events, and improved the world in many different ways. Even those who cannot live on their own or work can still improve the world through their kindness and love. Some organizations use gloom-and-doom scare tactics as a way to raise more money. Don't let it fool you."
    },
    {
      "title": "Stop seeing autism as a puzzle to be solved.",
      "content": "Stop seeing autism as a puzzle to be solved. Autistic people are already complete. They add diversity and meaningful perspectives to the world. There is nothing wrong with who they are."
    },
    {
      "title": "Ask your autistic friends about it.",
      "content": "Ask your autistic friends about it. (If you have no autistic friends, then go find some and come back.) Explain that you think you may be autistic, and that you're wondering if they've observed any signs of autism in you. They may ask you questions to better understand your experiences."
    },
    {
      "title": "Ask your parents or guardians about your developmental milestones.",
      "content": "Ask your parents or guardians about your developmental milestones. Explain that you've been curious about your early childhood, and ask when you met different developmental milestones. It's normal for autistic children to hit their milestones late or out of order. See if they have any videos from your childhood that you could watch. Look for stimming and other signs of autism in children . [50] X Research source Consider late childhood and teen milestones too, like learning to swim, ride a bike, cook, clean a bathroom, do laundry, and drive."
    },
    {
      "title": "Show a close friend or family member an article on signs of autism (such as this one).",
      "content": "Show a close friend or family member an article on signs of autism (such as this one). Explain that when you read it, it reminded you of yourself. Ask if they also see similarities. They may point out things that you didn't realize about yourself. Keep in mind that no one understands what's going on inside your head. They do not see all the adjustments you make to appear more \"normal,\" and thus might not realize that your brain works differently. Some autistic people can make friends and interact with people without anyone realizing that they are autistic."
    },
    {
      "title": "Talk to your family",
      "content": "Talk to your family once you feel that you're ready. Consider seeing a specialist to get diagnosed. Many health insurance plans will cover various therapies, such as speech, occupational, and sensory integration therapy. A good therapist can help you improve your skills to best adapt to a neurotypical world."
    }
  ]
}