{
  "url": "https://www.wikihow.com/Remove-Sharpie",
  "title": "How to Remove Sharpie",
  "steps": [
    {
      "title": "Lay the stained fabric face down on a layer of paper towels.",
      "content": "Lay the stained fabric face down on a layer of paper towels. Make sure that you have enough paper towels to absorb the excess stain remover. These towels should also absorb some of the stain. You may need more paper towels as you work, so keep a roll of paper towels handy. You should also work on the stain on a surface that will not be damaged by the stain remover. For example, you could work on the stain while the item is in top of your washer or dryer."
    },
    {
      "title": "Apply stain spot remover.",
      "content": "Apply stain spot remover. Apply stain remover to the underside of the stain. You can do this by turning the article of clothing inside out, but make sure that you place paper towels between the layers of fabric. Applying stain remover to the underside of the stain will push it out through the top instead of pushing it further into the fabric."
    },
    {
      "title": "Wash the fabric, if possible.",
      "content": "Wash the fabric, if possible. If the fabric you are cleaning is something that you can throw into the washer, then you will want to do so right away. After applying the stain remover, wash the fabric in cold water with detergent. Do not use warm water, do not dry in a dryer, and do not iron. Heat can cause the stain to set. If you cannot wash the fabric because it is part of a chair or other piece of furniture, then you may be able to just dab the area with some cold water to remove the fabric cleaner. Follow the label’s instructions for how to treat this type of fabric. If the item is all white, then you may consider adding about ¼ cup of bleach to the washer as well. Make sure that you add the bleach using your washer’s bleach dispenser. Do not just pour the bleach into the washer."
    },
    {
      "title": "Head to the dry cleaners.",
      "content": "Head to the dry cleaners. Some items cannot be washed in a washing machine and they require dry cleaning instead. If your item label specifies that it is “dry clean only,” then you will need to take it to a professional cleaner instead. You may also consider taking your item to the dry cleaners if the stain remover did not work. If none of these methods worked, or if you are working with a delicate fabric, then your best bet is to ask a professional to remove the stain for you. Make sure that you explain that the stain was from a Sharpie when you take the item to the dry cleaners. [1] X Research source"
    },
    {
      "title": "Use a \"magic eraser.\"",
      "content": "Use a \"magic eraser.\" These handy cleaning products can be found in the same aisle as your household cleaners at the store. A “magic eraser” is made of melamine foam packed with air and uses no chemical solvents. It lifts stains from your surfaces using a type of physical reaction, rather than a chemical one, and it essentially works by sanding the stained surface on a microscopic level. [2] X Research source Simply scrub the marked wall with the \"magic eraser\" until the stain lifts out. Wipe the wall with a moist cloth when done to remove any melamine residue left behind. Do not use a magic eraser on glossy paint because it can dull some of the glossiness away."
    },
    {
      "title": "Try a regular eraser.",
      "content": "Try a regular eraser. You may also be able to lift a stain from a tablet screen, countertop, or other hard surface just by using a regular pink eraser. [3] X Research source Rub a large pink eraser over the surface of the Sharpie stain as if you are erasing it. You may need to go over the stain several times to see any progress."
    },
    {
      "title": "Make an alcohol solution.",
      "content": "Make an alcohol solution. You can create a solution of alcohol and water to use as a stain remover. Mix one part isopropyl alcohol with two parts water. Then, use a clean white cloth to rub some of the solution onto the stain. You may need to repeat this treatment several times before the stain comes out. [4] X Research source"
    },
    {
      "title": "Apply a dry erase marker over the permanent marker.",
      "content": "Apply a dry erase marker over the permanent marker. You may also be able to get rid of a Sharpie stain by coloring over it with a non-permanent dry erase marker. This method works best if the stain is on a dry erase board or similar surface, such as a window or computer screen. The chemicals in the dry erase marker cling to those in the permanent ink, thereby lifting it out of the surface and away. [5] X Research source Color over the Sharpie stain completely with the dry erase marker. Wipe the colored area with a paper towel. Repeat as needed until the stain lifts away."
    },
    {
      "title": "Try nail polish remover or acetone on plastic.",
      "content": "Try nail polish remover or acetone on plastic. [6] X Research source Acetone and nail polish removers containing acetone can strip away most paints and dyes, and the dye in Sharpies is usually weak against it. Cover the bottle of nail polish remover or acetone with a clean cloth. Tip the bottle upside-down briefly, just long enough to soak the portion of cloth above the bottle with the product. Rub the portion of your cloth soaked in nail polish remover on the stain. You should notice the stain lifting out with only moderate pressure. Increase pressure as you scrub only if necessary. Wipe clean with a dry portion of the cloth."
    },
    {
      "title": "Soak your skin in warm soapy water.",
      "content": "Soak your skin in warm soapy water. Soaking the area of your skin that is stained with Sharpie will help to moisten it and make it easier to remove the stain. Soak the area by placing it into a bowl of warm soapy water or saturate a washcloth with warm soapy water and lay it over the Sharpie stained area of your skin. [7] X Research source"
    },
    {
      "title": "Scrub the area.",
      "content": "Scrub the area. After you have soaked your skin, you can use a washcloth to scrub the area for about one minute. Rub the area in a circular motion to try to remove the Sharpie stain. For extra exfoliation, you can apply some sugar to the stained area of your skin and use the washcloth to work it into your skin."
    },
    {
      "title": "Wash the area with soap and water when done.",
      "content": "Wash the area with soap and water when done. You can follow up the scrubbing by washing the Sharpie stained area of your skin with warm water and soap. Use your fingertips to apply the soap and then rinse it away with warm water. Pat the area dry when you are finished."
    },
    {
      "title": "Apply some alcohol based hand sanitizer.",
      "content": "Apply some alcohol based hand sanitizer. If the sharpie does not come out using plain soap and water, then you may want to try a bit of alcohol-based hand sanitizer to remove the Sharpie from your skin. Apply a dime sized amount (or more if it is a larger area) to your skin and rub it in. Then, rinse the area with warm water. You may want to apply some moisturizer after all of this scrubbing. Over-washing your skin can cause dryness and irritation."
    },
    {
      "title": "Treat the stain as soon as possible.",
      "content": "Treat the stain as soon as possible. The sooner you start treating the stain, the better your chances of removing the stain will be. Do not hold off on treating the stain or do part of the process and then put it aside. Treat the stain completely as soon as you notice it. [8] X Research source"
    },
    {
      "title": "Test stain removers on an inconspicuous area.",
      "content": "Test stain removers on an inconspicuous area. Some stain removers may lead to discoloration of fabrics and other surfaces, so it is best to test an area of the fabric or surface that people will not notice. [9] X Research source For example, you might test the inside of the leg of a pair of jeans, the back of a sofa, or an area of hardwood flooring that is always covered by an area rug."
    },
    {
      "title": "Avoid using heat.",
      "content": "Avoid using heat. Using heat may set the stain, so avoid exposing the stain to heat. Do not use a hair dryer, clothing dryer, or iron to treat the stain. [10] X Research source"
    }
  ]
}