{
  "url": "https://www.wikihow.com/Save-Yourself-from-Toxic-People",
  "title": "How to Save Yourself from Toxic People",
  "steps": [
    {
      "title": "Spot the toxic waste before it gets too close.",
      "content": "Spot the toxic waste before it gets too close. We all have our down days. But when it comes to toxic people, the blues are a constant rain cloud. And they want everyone to be just as wet and miserable as them. If you never see emotions other than anger, sadness, and jealousy, it is best to steer clear of that personality. Keep an eye out for the following toxic traits: [1] X Research source Jittery, nervous energy. Constant whining and complaining Clinginess and dependency Criticism, usually aimed everywhere Negative or cynical worldview And in extreme cases, abuse"
    },
    {
      "title": "Trust your gut-- if someone makes you upset and uncomfortable, make some space.",
      "content": "Trust your gut-- if someone makes you upset and uncomfortable, make some space. When you walk into the store to buy a new box of Cheerios, you know immediately what kind of mood the cashier is in. You can see it, even feel it, in your interaction. You can do this with your friends and coworkers, too! Even if you don't see the tell-tale signs, you know when something is off, and you know to avoid some people. Trust yourself -- there are plenty of happy people out there without trying out all the sourpusses."
    },
    {
      "title": "Pay attention to body language and tone of voice.",
      "content": "Pay attention to body language and tone of voice. Listen to the sounds made, more than what people actually say. You can hear it when someone is just going through the motions. How do people relate to you? What do they seem to be thinking when they speak? Bad body language looks like a sullen, sulky teenager -- shoulders down, lack of eye-contact, big, hostile gestures, etc. [2] X Research source Good body language looks like George Washington across the Delaware: back straight, chin up, shoulders back, etc. [3] X Research source"
    },
    {
      "title": "Keep your eyes and ears peeled for hotheads.",
      "content": "Keep your eyes and ears peeled for hotheads. Anger, shouting, and negative criticism are major signs of a toxic personality. Angry people sometimes need a lot of help, but it's not your job to be their punching bag. It is definitely not your job to try and fix them! Staying around a person like this will cause you to become angry too. So kick back and find someone else to talk to: you'll have a lot more fun. People who have control over their emotions don't usually feel the need to shout, so watch out for the loud ones. Watch out for quiet, simmering anger as well. Some people won't say much, but will use poor body language and bottle it up instead. These people lash out at odd times, when anger doesn't seem called for. Luckily, this is basically a neon \"Personal BioHazard\" sign. If you have to work with angry people, never stoop to anger -- you'll just rile them up further. Keep in professional, polite, and quick, and just walk out if they lose their temper. They'll hate you for it, but they'll learn their lesson sooner or later."
    },
    {
      "title": "Stay away from the cynics.",
      "content": "Stay away from the cynics. Do you know someone who finds the darkness in everything? Much like your parents on Thanksgiving, misery loves company. These people will always complain about something, never see the good in anything, and claim they hate everything. It's exhausting just thinking about it, which is why they'll try to drag you into their little pity party. [4] X Research source People with very negative worldview will often be competitive about their misery, trying to outdo other people's sadness. This is the worst. Watch out for people who constantly, even gleefully, talk about their failures and sadness. Anyone who criticizes the failures of others, or seems overly cynical, might have a toxic personality worth avoiding."
    },
    {
      "title": "Stand away from the attention seekers.",
      "content": "Stand away from the attention seekers . Insecure people are unable to create their own sense of self-worth, and often cling on to others to get it. While not always toxic, these reality-TV hopefuls can get nasty when they don't get the attention they crave. If you don't give it to them, they'll find a way to make it themselves. And no one needs that kind of drama in their life. [5] X Research source Humble-brags (\"I can't believe I only made fifteen sales today\") and obsessive posting might be a sign of this toxic personality. These kinds of people often \"one-up\" everyone around them, or always swing conversation back to something about them."
    },
    {
      "title": "Keep the gossip girls and rumor mill men at bay.",
      "content": "Keep the gossip girls and rumor mill men at bay. Instead of supporting others, gossips feed on envy. Gossip can be thrilling sometimes (duh), making you feel close with your fellow gossipers. If you've ever gotten caught up in gossip, you're not alone. But you should know that, once your back is turned, constant gossipers will start talking about you. Gossipers constantly compare themselves to others, which is a good way to set yourself up for disappointment and failure. Don't worry about your neighbors, worry about your own backyard."
    },
    {
      "title": "Ask yourself, honestly, if any of your friends are toxic.",
      "content": "Ask yourself, honestly, if any of your friends are toxic. Do the people in your life bring out the best in you, or are you a sponge for their negativity? Are there people who just make you feel bad, or that make you feel great when you leave? It's hard to put friendship aside. But don't let the worst people in your life pose as your best friends."
    },
    {
      "title": "Don't try to control or clean up the toxic mess -- you'll just get dirty.",
      "content": "Don't try to control or clean up the toxic mess -- you'll just get dirty. Toxic personalities are only toxic if they affect you negatively. You can be friends with angry people. You can be friends with negative people. Accept people for who they are and what they are like, and don't let them affect you. Not everyone is going to be friends! It's just the way of the world. Some people just aren't fun. Negative emotions have a time limit. But if someone is holding on to anger and negativity, just throw out the clock and move on."
    },
    {
      "title": "Empathize, but don't try to change people.",
      "content": "Empathize, but don't try to change people. Ask yourself if there is a reason someone is such a bummer. Are they going through something? Do they have a tough job or home life? Remember that you can't change another person, only yourself, so don't bog yourself down with excuses. Just try and get where they are coming from -- it'll make dealing with their crap a lot easier down the road. [6] X Research source"
    },
    {
      "title": "Tune the haters out.",
      "content": "Tune the haters out. If you don't like what someone is saying, stop paying attention to it. Tune into the positive and constructive parts of the conversation, and start daydreaming when this person goes into negative territory. Imagine them in your underwear. Imagine yourself as a knight and them a dragon. Whatever you do, don't engage with them. Battle away negativity with positivity -- they won't know what hit them. When they say, \"school sucks and this place is terrible,\" remind them \"at least there is lunch and recess!\" They'll move on to someone more on their toxic level. Change the topic of conversation. Every time the person tries to steer the conversation negative, pull something else out to talk about. If your buddy wants to say \"Work sucks and my boss is a jerk,\" then change it up. Say, \"Yeah. At least football is good. What games did you watch on Sunday?\" [7] X Research source Stick to the facts with hot-tempered types. Point out what needs to be done to fix a problem. Avoid talking about opinions or guesses and they'll have nothing to try and shove back down your throat."
    },
    {
      "title": "Avoid toxic people like, well, toxic sludge.",
      "content": "Avoid toxic people like, well, toxic sludge. If you're struggling to deal with the negativity that people bring into your life, it may be time to start limiting those interactions. You can't change the way that people behave, but you can remove yourself from the equation. If you regularly initiate your interactions with this person, stop. If this person stops getting in touch, you're in luck! If someone asks you if something is wrong, be honest. \"I have trouble dealing with your negativity. You bring down my mood when you __________. I like you, but I think we need to see less of each other.\""
    },
    {
      "title": "End toxic relationships completely",
      "content": "End toxic relationships completely . If someone is really affecting your mental health and well-being with their negativity, end the relationship . It will hurt a bit -- no doubt about it -- but it will hurt a lot less than a lifetime with a person who makes you feel terrible. Telling someone, \"We can hang out, but only if you're not negative\" would be like telling them you could only hang out if they were a different person. If it's not possible, come to terms with it. Cut them loose."
    },
    {
      "title": "Put your needs and desires first.",
      "content": "Put your needs and desires first. What is most important to you? What do you want out of your life? Listen to what other people have to say, but remind yourself that you, like George W. Bush, are The Decider. You decide your life, not the toxic sludge people surrounding you. If they can't accept that, they can get out of the way. Write down your short and long-term plans on paper. Paste it on a wall where you can constantly remind yourself and stay focused. This will also help you when times get tough and you feel the gripping desire to fall back into older negative habits. [8] X Research source"
    },
    {
      "title": "Make your own decisions.",
      "content": "Make your own decisions. Lots of people go through life saying, \"My parents wanted me to do X, so I did X\", or \"My spouse wanted to go to city X, so we went to city X.\" Do you want your life to be decided by someone else? Make a choice, for better or worse, and live with the consequences. Don't allow other people or their preferences to be an excuse for you. Saying, \"I'd be happy if X were different\" is just another way of saying, \"I'm not in charge of my own life. It's true that sometimes you need to need to make compromises with the people close to you. But don't let compromise be your go-to."
    },
    {
      "title": "Build a \"support group\" of happy, healthy people.",
      "content": "Build a \"support group\" of happy, healthy people. Why would you hang out with people you don't like to be around? Find the guys and gals who are optimistic, upbeat, and happy. Your smiles will form a natural barrier against the haters. [9] X Research source Move to a new town or switch jobs if you're surrounded by negative people at your old one. End that relationship and start a new one with someone who builds you up instead of dragging you down."
    },
    {
      "title": "Be the positivity you want to see.",
      "content": "Be the positivity you want to see. Use the inspirational example of positive people in your life to guide yourself away from the toxic people. Smile, give compliments, say thank you, make eye contact, and generally do the things you would expect normal, nice people to do. Being nice is not hard, but some people need you to play the Big Bird to their Oscar the Grouch."
    },
    {
      "title": "Kick back and chill out, man",
      "content": "Kick back and chill out, man . If you constantly do battle with the negativity of others around you, you need to make a serious commitment to de-stressing. Find something that calms and centers you and to which you can retreat when you need to re-energize yourself. Kick loose and enjoy the world, wherever you are: meditation Yoga Hiking or nature walks Martial arts Listen to music, read a book, or watch a movie."
    }
  ]
}