{
  "url": "https://www.wikihow.com/March",
  "title": "How to March",
  "steps": [
    {
      "title": "Stand at Attention",
      "content": "Stand at Attention . There are two possible commands for standing at attention: \"Fall In\" is used to either assemble individuals into formation or return the marchers to their original lineup. \"Attention\" is a command given during rest position. You should respond to both commands by standing at attention. Bring your heels together evenly, with the toes slightly pointed outward to form a 45-degree angle between your feet. Try to balance your weight across the entirety of both feet. Don't lock your knees, but keep your legs straight. Keep your shoulders square, your chest lifted, and your upper body level with your hips. Hang your arms on both sides of your body without any stiffness. Your fingers should be slightly curled, with your thumbs touching your index finger's first joint on the side. Keep your thumbs in a straight line with the seams of your pant legs, with your index fingers' first joints touching your pant legs. Remain silent while standing at attention, and don't move or speak unless you are told to. A variant on Standing at Attention is \"Snap to Attention.\" In this stance, everyone must stand at Attention, but with expedited speed. The heels are also brought together quickly (hence the \"snap\" part of Snapping to Attention)."
    },
    {
      "title": "Go into Parade Rest.",
      "content": "Go into Parade Rest. Parade Rest is a command given to marchers who are currently in the Position of Attention. This type of rest is also known as a \"rest position at the halt.\" [1] X Research source Do not enter Parade Rest until you are given the command. On command, keep your right foot planted while moving your left foot approximately 10 inches to the left. Keep your legs straight, but do not lock your knees. Balance your weight across the entirety of both feet, just as you did while standing at attention. Place both hands behind you, at the small of your back. Keep the fingers of both hands extended and link your two thumbs together with your right palm facing outward. Keep your hands on your lower back, make sure your arms stay straight. Center both hands linked together in the middle of your back (also called \"centered on the belt\"). Keep your head and eyes straight ahead of you as you did while standing at attention. Do not speak or move until you are told to do so."
    },
    {
      "title": "Stand at Ease",
      "content": "Stand at Ease . Standing at Ease is similar to the Parade Rest position, except you turn your head and eyes to directly face the person in charge of your formation. As with the Parade Rest position, you are not to move or speak unless directed to do so."
    },
    {
      "title": "Respond to the \"At Ease\" command.",
      "content": "Respond to the \"At Ease\" command. The \"At Ease\" command is slightly different from the \"Stand at Ease\" command in that individuals are permitted to move slightly when told \"At Ease.\" However, while standing At Ease, a marcher must still keep his right foot in place and remain silent unless directed to do otherwise."
    },
    {
      "title": "Rest.",
      "content": "Rest. The last Rest Position at the Halt is the command \"Rest.\" When given the Rest command, a marcher may move his arms, talk, smoke, or take a drink of water, unless he is given other directions. During the Rest position, each individual must still keep his right foot in place on the ground."
    },
    {
      "title": "Face from the Position of Attention.",
      "content": "Face from the Position of Attention. There are five facing movements marchers are required to learn: Left FACE, Right FACE, Half Left FACE, Half Right FACE, and About FACE. Each of these movements is entered from the Position of Attention. [2] X Research source Facing to the Flank - also known as Left/Right FACE. On command, slightly raise your right heel and left toe simultaneously to turn 90 degrees toward the direction you've been given. Keep your arms at the Position of Attention the entire time, and on count two bring your feet into Attention. Facing to the Rear - also known as About FACE. Move the ball of your right foot about half a foot-length behind and slightly to the left of your left heel. On the count of two, pivot to the right 180 degrees (on the ball of your right foot and the heel of your left) while keeping your arms in the Position of Attention the entire time. Half Left and Half Right FACE are only executed in a situation where a 90-degree turn would not face the desired direction. It is usually used to face the flag to render honor, such as during reveille or retreat."
    },
    {
      "title": "Give a Hand Salute",
      "content": "Give a Hand Salute . The Hand Salute is executed when given the command, \"Present ARMS.\" This command may be given while the marcher is stationary or while in motion. If the command is given during a march, only the individual in charge of your formation salutes and acknowledges a salute. If the formation is double-timing, you must come to Quick Time before saluting. [3] X Research source If wearing headgear with a visor, on command you should raise your right hand sharply with the fingers and thumb extended and joined. Keep your palm down and touch the tip of your right forefinger to the rim of your visor just to the right of your right eye. If wearing headgear without a visor or no headgear, the Hand Salute is the same, only you should touch the tip of your right forefinger to your forehead just to the right of your right eyebrow. If you are wearing glasses and a visor-free headgear (or no head gear), the Hand Salute is the same, only you should touch the tip of your right forefinger to the part of your glasses where the frame's temple piece meets the right edge of your right eyebrow. If you are given the command \"Order ARMS\" from a Hand Salute, return your hand quickly to your side and resume the Position of Attention."
    },
    {
      "title": "Learn basic marching information.",
      "content": "Learn basic marching information. Even when learning the steps for an individual marcher, it's best to become acquainted with the basic marching information that the entire squad will be expected to know. This will help you with both your individual marching steps and with a group formation. Any movements that you execute from the Halt command should be initiated with the Position of Attention. All marching movements except Route Step March and At Ease March are executed while marching at Attention. Marching at Attention combines the Position of Attention with the prescribed marching steps, performed simultaneously. If performing steps executed from the Halt, every movement except Right Step begins on your left foot. One step is considered the distance from one of your heels to the other. All marching steps are carried out in Quick Time, meaning 120 steps per minute. The only exception is the 30-inch step, which you may be commanded to carry out in 180 steps per minute if given the command, \"Double Time, MARCH.\""
    },
    {
      "title": "Perform the 30-inch step.",
      "content": "Perform the 30-inch step. If you are performing the 30-inch step from a Halt, you will be given the command, \"Forward, MARCH.\" It is a two-part movement. When given the command, \"Forward,\" shift your weight slightly to the right foot. On the \"MARCH\" command, step forward 30 inches, leading with your left foot. Continue to take 30-inch steps forward, alternating feet depending on which step you are on. [4] X Research source Do not bend your elbows, and do not exaggerate your movements. Let your arms swing in a natural motion. Aim for approximately nine inches ahead of you and six inches behind you as you swing your arms. Keep your eyes and head facing forward. Make sure your fingers remain curled, as in the Position of Attention."
    },
    {
      "title": "Halt from a march.",
      "content": "Halt from a march. Before you are about to receive the Halt command, you will be given the preparatory command, either \"Squad\" or \"Platoon,\" while one of your feet strikes the ground. The final command, \"Halt,\" will be given the next time that foot strikes the ground. [5] X Research source Bring your trailing foot alongside your lead foot. Assume the Position of Attention. Cease any further movement until you are given a command."
    },
    {
      "title": "Change step.",
      "content": "Change step. The Change Step command is only given to a marcher who is out of step with everyone else in his formation, but it's an important command to learn if you hope to march with a formation. It will only be executed during a forward march with a 30-inch step. [6] X Research source You will be given the command, \"Change Step, MARCH.\" \"Change Step\" will be spoken while your right foot strikes the ground. On \"MARCH,\" take one additional step with the left foot, then over one count, place your right toe near your left heel. Step off again with your left foot. Keep your arms swinging naturally, and try to match the step of everyone else in your formation."
    },
    {
      "title": "Execute an At Ease March.",
      "content": "Execute an At Ease March. At Ease March is a rest movement that will be commanded during the 30-inch step. The command, \"At Ease,\" will be given when one of your feet strikes the ground. On the command, \"MARCH,\" you are no longer required to retain your cadence with your formation. Even though you are not required to keep marching in step, you must remain silent and maintain the approximate intervals and distance that you were performing in step."
    },
    {
      "title": "Perform a Route Step March.",
      "content": "Perform a Route Step March. The Route Step March is executed identically to the At Ease March. The only difference is that in a Route Step March, you may drink from your canteen and talk with other marchers."
    },
    {
      "title": "March in place.",
      "content": "March in place. If you are expected to march in place, you will be given the command \"Mark Time, MARCH.\" The command will be given while one of your feet is striking the ground, usually during either a 30-inch step or 15-inch step forward. On the \"MARCH\" command, bring your trailing foot up alongside your leading foot and begin marching in place. Alternate raising each foot two inches off the ground. Do not move your feet forward. Simply alternate feet while marching in place. Keep your arms swinging naturally, as you would during a 30-inch step forward. If you are given the follow-up command, \"Forward MARCH,\" take one more step in place on the \"MARCH\" command before you begin the forward 30-inch step."
    },
    {
      "title": "Maintain proper distance.",
      "content": "Maintain proper distance. While marching in formation, it is important that you maintain the proper distance from the person marching in front of you. This is to ensure that everyone in formation keeps step and does not bump into anyone else. The proper distance between individuals while marching is one arm's length plus an additional six inches (approximately 36 to 40 inches total)."
    },
    {
      "title": "Form a squad.",
      "content": "Form a squad. Squads typically form in a linear formation. A squad may re-form in a column if each member in formation can identify his precise position, but this usually only occurs when equipment from each individual is left on the ground where he was in formation. [7] X Research source The squad leader will stand in the Position of Attention and issue the command \"Fall In.\" On the command \"Fall In,\" you must double time to your position in the formation and follow the lead of the right flank man. Stand in the Position of Attention, turn your head and eyes to the right, and raise your left arm the way your right flank man is standing. Keep your left arm raised to shoulder level with the elbow locked, fingers and thumb extended and joined, and your palm facing down. Take short steps either forward or backward to be in line with your right flank man. Take short steps either left or right so that your shoulder is touching the fingertips of the individual to your right. Once you are in place (called \"Normal Interval\"), lower your arm to your side, turn your head and eyes to face forward, and resume the Position of Attention."
    },
    {
      "title": "March with the squad.",
      "content": "March with the squad. When marching over short distances, you and your squad may be marched in a line formation moving forward. If marching over a longer distance, you and your squad may be marched in a column formation. If you are expected to form a column from a line formation, you will be given the command \"Right, FACE.\" [8] X Research source"
    },
    {
      "title": "Follow a march to the flank.",
      "content": "Follow a march to the flank. If you are in a column moving a short distance, you may be commanded to march to the flank. The command you will receive is \"Right (or Left) Flank, MARCH.\" [9] X Research source On the command of Right or Left Flank, the foot that is striking the ground is the direction you're expected to march towards. On the \"MARCH\" command, take one more step, pivot 90 degrees on the ball of your lead foot to face the desired direction, and step off with the trailing foot toward the new direction. As you begin marching in the new direction with your squad, glance out of the corner of your right eye and dress to the right to ensure you are properly in formation."
    },
    {
      "title": "Get dismissed from the squad.",
      "content": "Get dismissed from the squad. Being dismissed from the squad releases you from the formation, but not from your duty day (unless otherwise instructed before the command \"DISMISSED\"). You will be dismissed at Attention. If you are marching with arms, you will be given one of the following commands before being dismissed: [10] X Research source Inspection, ARMS Ready, Port, ARMS Order (Sling), ARMS Any of these may be followed by the command, \"DISMISSED.\""
    }
  ]
}