{
  "url": "https://www.wikihow.com/Sharpen-a-Knife-With-a-Stone",
  "title": "How to Sharpen a Knife With a Stone",
  "steps": [
    {
      "title": "Examine your knives.",
      "content": "Examine your knives. Get out the knives you'd like to sharpen. Determine how dull the blades are so you know what grit size you'll need on the sharpening stone. To test the blade, slice through a tomato or piece of fruit. Feel how much resistance you're getting as you slice. The more resistance, the duller your knives are. [1] X Research source You should also think about how often you use your knives. If you use them every day, they're probably duller than if you only use them every once in a while."
    },
    {
      "title": "Choose the style of stone.",
      "content": "Choose the style of stone. You'll need to choose a natural or synthetic stone that can be used wet (soaked in water), with oil, or dry. There are also diamond stones that are actually very small diamonds attached to a metal surface. Stones that are soaked in water are softer stones which means you can quickly sharpen your knives. Unfortunately, these stones will wear down faster than the others. Oil stones are the least expensive and they're made of a harder material. [2] X Research source Oil stones are a little messier to use and clean up although the stone will last for a long time. Diamond stones are the most expensive, but they'll last the longest."
    },
    {
      "title": "Select the grit of the stone.",
      "content": "Select the grit of the stone. Sharpening stones are available with different grit sizes. For example, you can choose fine, medium and coarse stones. You should use a coarse stone followed by a fine grit if your knives are dull. If your knives have been sharpened recently or they aren't too dull, consider using a medium grit. Try to use a grit level ranging from 325 (for coarse) to 1200 (for extra fine). [3] X Research source You may be able to choose a stone that has different grit levels on both sides."
    },
    {
      "title": "Follow the instructions that came with your stone.",
      "content": "Follow the instructions that came with your stone. Because there's such variety in sharpening stones, it's important to read the instruction manual that came with your stone. The instructions will tell you if you should soak the stone in water or if it will need to be lubricated with oil while you're sharpening. Diamond stones can usually be used dry or lubricated with water."
    },
    {
      "title": "Practice holding the knife at a 20 degree angle.",
      "content": "Practice holding the knife at a 20 degree angle. Most straight blades need to be sharpened at a 20 degree angle. To find the angle, hold the directly in front of you so it's straight up and down. This is 90 degrees. Tilt the knife halfway towards the table so it's at a 45 degree angle. Tilt the knife halfway again so it's about an inch (2.5 cm) above the table. This should be a 20 degree angle. [4] X Research source Your knife might need a larger sharpening angle if the blade is very large or thick. If you're using a very coarse stone, you may want an even shallower (lower) angle so you don't sharpen off too much of the blade."
    },
    {
      "title": "Soak the water stone for 45 minutes.",
      "content": "Soak the water stone for 45 minutes. If you're using a water stone, place it in a tray and pour water over the stone so it's completely covered. Let the stone soak for at least 45 minutes before you begin sharpening your knives. [5] X Research source If your stone is too dry, it can scratch or nick your knife blades. Avoid putting an oil stone in water because this can damage it."
    },
    {
      "title": "Place the stone on a damp cloth.",
      "content": "Place the stone on a damp cloth. Run water over a wash cloth and wring it out. Lay the damp cloth on your work surface and place the stone on it. The cloth will keep the stone in place while you're sharpening your knives. Set any style of stone (wet, oil, or diamond) on the cloth. If you're using a stone with different grits on both sides, place the coarser side facing up. This way you can quickly sharpen your knives before turning the stone over to polish up. You may want to use an old cloth for this since you won't be able to wash the grit out of it."
    },
    {
      "title": "Lubricate an oil stone.",
      "content": "Lubricate an oil stone. If you're using a stone that needs to be oiled, you can spray the stone with oil or pour a little directly onto the stone. Use your fingers to massage the oil into the stone. Ensure that the stone is completely coated in the oil. [6] X Research source You can use oil specifically sold as sharpening or honing oil. These are usually made of mineral oils or made with non-petroleum products. They contain additives that protect the metal of your blades. Avoid using cooking oils (such as vegetable or canola oil) to lubricate the stone."
    },
    {
      "title": "Hold the knife against the stone.",
      "content": "Hold the knife against the stone. Use one hand to hold the knife so the blade is at a 20 degree angle. The edge of the blade should be facing away from you. Place the fingertips of your other hand on the flat part of the blade near the sharp end. [7] X Research source Your fingertips on the blade can control the pressure and direction of the blade as you sharpen it."
    },
    {
      "title": "Sweep one side of the blade across the stone.",
      "content": "Sweep one side of the blade across the stone. Slowly slide the blade down the stone and sweep it in an arc as it moves. You should draw the entire edge of the blade from heel to tip across the stone so it's evenly sharpened. Continue to run the first side of the blade against the stone until it's sharp. [8] X Research source Remember to wet or oil down the stone as soon as it starts to feel dry."
    },
    {
      "title": "Turn the knife over and sharpen the other side.",
      "content": "Turn the knife over and sharpen the other side. Turn the knife over and move the blade from heel to tip across the sharpening stone until the blade feels sharp when you touch it with your fingertips. [9] X Research source Be very cautious when touching any knife edge against your skin."
    },
    {
      "title": "Sharpen the stone on a finer grit.",
      "content": "Sharpen the stone on a finer grit. If your knives had been very dull and you used a coarse grit to sharpen the edge, you may want to use a stone with a fine grit to polish the edge. Run the blade against a fine grit stone from the heel to the tip of the blade. Turn the knife over and sharpen the other side of the blade as well. [10] X Research source Always sharpen the knives evenly so the blade remains balanced. For example, if you used 6 strokes to sharpen the first side of the blade, you should also use 6 strokes to sharpen the other side of the blade."
    },
    {
      "title": "Test the sharpness of the knife.",
      "content": "Test the sharpness of the knife. Once you think you've completely sharpened your knife, wash it and dry it. Hold a piece of paper up and try to slice down through it using the knife. If the knife is sharp enough, it should easily cut through the paper. If not, you'll need to sharpen it a little more."
    },
    {
      "title": "Clean the knives and stone.",
      "content": "Clean the knives and stone. As soon as you've finished sharpening your knives, wash and dry the blades. You should also clean the stone according to the manufacturer's instructions. For example, if you have an oil stone, you might need to scrub it occasionally with a stiff fiber brush and soak it in oil. For a water stone, wash off any of the residue and store it in a dry cloth until you need to use it again. [11] X Research source To prevent your knives from dulling faster, store them in a knife block, on a magnetic strip, or with knife guard covers."
    }
  ]
}