{
  "url": "https://www.wikihow.com/Precious-Moments-Value",
  "title": "How Much Are Precious Moments Figurines Worth?",
  "steps": [
    {
      "title": "Most figurines are valued somewhere between $50 and about $400.",
      "content": "Most figurines are valued somewhere between $50 and about $400. It ultimately depends on how many there are in circulation and how long they were available before being discontinued. Generally, the longer time they spent on shelves, the less they’re worth today. [1] X Research source However, there are a few collections that can be worth much more: Items from the original 1978 collection can go for several hundred dollars, or potentially over $1,000 if they’re popular. Rare or popular figurines from the Disney line can fetch over $1,000. A collection of them was once marked for $15,000 (although it included several mint condition and signed pieces). Limited edition figurines can easily go for several hundred to over $1,000 each."
    },
    {
      "title": "Rarity",
      "content": "Rarity Whether because of its age or its limited-edition run, some Precious Moments figurines are rare to come across in the 21st century. These include 1978 versions of the original 21 Precious Moments figurines, limited-edition figurines, and chapel exclusives. A rare Precious Moments figurine is usually worth more than a common one. [2] X Research source"
    },
    {
      "title": "Condition",
      "content": "Condition With any collectible, condition has a major influence on price. Items in mint (like new) or very good condition are worth more than items in poor condition. If your Precious Moments figurines are still in their boxes, or at least undamaged and well-maintained, you can ask a higher price for them than for damaged or broken figurines."
    },
    {
      "title": "Signature or Certificate of Authenticity",
      "content": "Signature or Certificate of Authenticity If your Precious Moments figurine features a signature from company founder Samuel Butcher, it may be worth more than one that isn’t signed. The same goes for a figurine with a certificate of authenticity, which assures the buyer that it’s a legitimate collectible and not a reproduction or knock-off."
    },
    {
      "title": "Popularity",
      "content": "Popularity While all Precious Moments figurines are cute, some are more popular than others. The collaborations between Precious Moments and Disney are among the most sought-after. Certain holiday-themed or Biblical figurines are also fan-favorites for collectors. Popular collectibles usually sell for higher prices than unpopular ones because there’s more demand for them."
    },
    {
      "title": "True Love Conquers All",
      "content": "True Love Conquers All Precious Moments’ partnership with Disney allows them to create adorable figurines themed around iconic characters. The “True Love Conquers All” figurine from 2018 depicts Sleeping Beauty, Maleficent, and Prince Phillip in a dramatic scene. Its artful detail makes it one of the most coveted modern figurines. [3] X Research source Value: Sold in 2024 for $2,364."
    },
    {
      "title": "Love One Another",
      "content": "Love One Another “Love One Another” is one of the original 21 Precious Moments figurines, and the only one that’s never been retired. However, limited-edition versions of the darling statue about friendship have fetched high prices. In particular, the 9 in (23 cm) Easter Seals version from 2001 has sold for over $1,000. Only 1,500 were made. Value: Sold in 2025 for $1,899."
    },
    {
      "title": "Disney Cinderella Carriage Figurine (2010)",
      "content": "Disney Cinderella Carriage Figurine (2010) Back in February 2019, a Precious Moments figurine showing Disney’s Cinderella beside a horse-drawn carriage sold for $1,500. While the figurine is one of the newer ones in the Precious Moments lineup, only 1,500 were made, inflating its value past many of the vintage statues. [4] X Research source Value: Sold in 2019 for $1,500."
    },
    {
      "title": "Disney Rapunzel Tangled Figurine",
      "content": "Disney Rapunzel Tangled Figurine In 2014, Precious Moments and Disney released “The Power of Your Love Astounds Me,” an intricate porcelain figurine featuring the lead characters from the film Tangled . For Disney fans who love Rapunzel, the beautiful figurine is priceless. Value: Sold in 2024 for $1,000."
    },
    {
      "title": "God Loveth a Cheerful Giver",
      "content": "God Loveth a Cheerful Giver Of the original 21 Precious Moments figurines, “God Loveth A Cheerful Giver” is estimated to be the most valuable. The cute figurine of a little girl giving away puppies has sold for $250 and $188 over the years. [5] X Research source One Precious Moments dealer listed it at $750 in 2025. [6] X Research source Value: Sold in 2025 for $450 (autographed)."
    },
    {
      "title": "Make A Joyful Noise",
      "content": "Make A Joyful Noise “Make A Joyful Noise” is another one of the original 21 figurines. It was retired in 2000, so it’s increased in rarity and value in recent years. One source reports that a version of the figurine sold for $409 on eBay. [7] X Research source Value: Sold for $409."
    },
    {
      "title": "We Would See Jesus",
      "content": "We Would See Jesus Precious Moments figurines with more than one figure on the base tend to sell for more than solo figurines. The limited-edition “We Would See Jesus” figurine depicts three characters, a play on the three Magi from the Bible. Issued in 2001, only 1,500 were made. [8] X Research source Value: Sold in 2025 for $400."
    },
    {
      "title": "A Portrait of Loving, Caring, and Sharing",
      "content": "A Portrait of Loving, Caring, and Sharing In 2002, Precious Moments released a figurine exclusively for club members to celebrate the company’s 25th anniversary. Titled “A Portrait of Loving, Caring, and Sharing,” it shows a cherubic family getting their picture taken. Value: Sold in 2025 for $400. This figurine was a chapel exclusive, meaning collectors could only purchase it at the Precious Moments Chapel in Carthage, Missouri."
    },
    {
      "title": "I Will Be Glad And Rejoice In You",
      "content": "I Will Be Glad And Rejoice In You Seasonal figurine “I Will Be Glad And Rejoice In You” depicts a winter scene with a young boy and girl in a horse-drawn sleigh. The charming limited-edition figurine had an issue of just 3,000 statues. [9] X Research source Value: Sold in 2025 for $369."
    },
    {
      "title": "Come Let Us Adore Him Nativity Set",
      "content": "Come Let Us Adore Him Nativity Set If you have your hands on a complete Precious Moments set, it’s usually worth more than individual figurines. One popular set is a miniature nativity featuring nine individual pieces. Over the years, complete sets have consistently sold for over $300. Value: Sold in 2024 for $345."
    },
    {
      "title": "The original 21 Precious Moments figurines debuted in 1978.",
      "content": "The original 21 Precious Moments figurines debuted in 1978. At the time, the figurines were sold as regular giftware, not as collectible items. As of 2025, 20 of the 21 original figurines have been retired. [10] X Research source Look for a “Jonathan & David” signature logo to determine if your figurine is from 1978. Depending on their condition and rarity, these original figurines usually sell for $50 to $200 on sites like eBay, but could potentially go for over $1,000 in some cases. A complete original collection could fetch thousands! [11] X Research source The original 21 Precious Moments figurines (with catalog numbers): Unto Us, A Child Is Born (E-2013) Jesus Is Born (E-2012) His Burden Is Light (E-1380G) Come Let Us Adore Him (E-2011) Love Lifted Me (E-1375A) Jesus Is The Answer (E-1381) Make A Joyful Noise (E-1374G) Prayer Changes Things (E-1375B) He Leadeth Me (E-1377A) We Have Seen His Star (E-2010) Jesus Is The Light (E-1373G) Jesus Loves Me (Boy) (E-1372B) Jesus Loves Me ( Girl) (E-1372G) Love One Another (E-1376) God Understands (E-1379B) Smile God Loves You (E-1373B) God Loveth A Cheerful Giver (E-1378) Love Is Kind (E-1379A) O, How I Love Jesus (E-1380B) He Careth For You (E-1377B) Praise The Lord Anyhow (E-1374B)"
    },
    {
      "title": "Identify your figurines by comparing them to pictures online.",
      "content": "Identify your figurines by comparing them to pictures online. Before selling, try your best to figure out which Precious Moments figurines you have. Inspect the figurine for any identifying information, and compare them to pictures on the Precious Moments website , Precious Moments retailers’ websites , or online marketplaces until you find a match. Try to determine the name, year, and collection (if applicable) of each figurine. Be wary of figurines that were reissued or have the same name. Look at multiple sources to verify the name and year of the figurine you have. If you’re having a hard time identifying a figurine, it may be a piece from a set. Look at pictures of sets to see if it’s part of one of them."
    },
    {
      "title": "Research your figurines’ market value to price them.",
      "content": "Research your figurines’ market value to price them. Check current and completed listings for your Precious Moments figurines on sites like eBay, Poshmark, and Depop. Get a sense of how much they’ve sold for in the past, paying attention to the condition of the figurines and whether or not they were sold as part of a set. Doing your homework will help you price them accurately . Check the official 2023 Precious Moments price guide to help you value your figurines, even if they’re not the most valuable ones."
    },
    {
      "title": "Visit an appraiser if you have a large collection or a valuable figurine.",
      "content": "Visit an appraiser if you have a large collection or a valuable figurine. Appraising a large collection on your own takes a lot of time and effort. Plus, if you have a figurine that seems particularly valuable, it doesn’t hurt to get a professional valuation before selling. Visit a professional, certified antique appraiser in your area to get an estimate of the value of your collection."
    },
    {
      "title": "Create a listing to sell your figurines online.",
      "content": "Create a listing to sell your figurines online. eBay is the most popular online marketplace for Precious Moments figurines and other collectibles. Before creating a listing, take high-quality photos of your figurines from different angles. This will entice buyers and make them feel confident they know what they’re getting. When taking product pictures, “[you] always want to make sure that there's great lighting and that the background isn't too busy,” says social media marketing expert Candace Gasper. Include a detailed description with your listing. Specify the name and issue year of the figurine, as well as any damage buyers should know about. Set a price that’s competitive but fair based on the market research you did earlier."
    },
    {
      "title": "Keep figurines in their original boxes if possible.",
      "content": "Keep figurines in their original boxes if possible. If your figurines are in the box they were sold in, they’ll be worth more than ones that are missing their box. It’s tempting to take them out for display, but if you want to sell or trade them, leave them in the box."
    },
    {
      "title": "Display your figurines out of direct sunlight.",
      "content": "Display your figurines out of direct sunlight. Over time, sunlight exposure can warp and fade objects, including Precious Moments figurines. The company recommends storing your collectibles in a temperature-controlled environment—so no attics or basements—and away from sunlight. [12] X Research source"
    },
    {
      "title": "Clean the figurines with soap and water.",
      "content": "Clean the figurines with soap and water. If your Precious Moments figurines are stained with dust or other grime, they won’t be as attractive to buyers. Use lukewarm water and mild dish detergent to clean them. [13] X Research source Dab at them gently with a soft cloth until the dirt is gone, then dab them dry with another cloth."
    },
    {
      "title": "Handle your figurines with nitrile gloves.",
      "content": "Handle your figurines with nitrile gloves. Whenever you touch your Precious Moments collection, oils from your hands may stick to the items, helping dust collect and tarnishing their appearance. Avoid this by wearing nitrile gloves (synthetic rubber gloves stronger than latex ones) when you touch your figurines. [14] X Research source"
    },
    {
      "title": "Repair broken figurines with adhesive.",
      "content": "Repair broken figurines with adhesive. Accidents happen, but you can fix breaks or cracks to keep your figurines display-ready. The Precious Moments company recommends using Loctite Gel Super Glue or Duco Cement to repair broken figurines. [15] X Research source"
    }
  ]
}