{
  "url": "https://www.wikihow.com/Melt-Glass",
  "title": "How to Melt Glass Using a Microwave Kiln or Regular Kiln",
  "steps": [
    {
      "title": "Cut the kiln fiber paper to the size of the chamber.",
      "content": "Cut the kiln fiber paper to the size of the chamber. The fibre paper sits on the kiln shelf and is what the glass rests on to melt. A square which is large enough to cover the kiln base from the glass, but small enough to not touch the sides is ideal. The kiln fiber paper prevents the melting glass from sticking to the insulating base of the kiln. Test the fiber paper for size by placing it on the kiln base and putting the cover on. Make sure the paper does not touch the cover in any spot, but can fully protect the base from the glass."
    },
    {
      "title": "Place the glass on the fiber paper on the kiln base.",
      "content": "Place the glass on the fiber paper on the kiln base. Make sure the glass does not go over the edge of the paper at any point, and does not touch the bottom, top, or sides of the microwave kiln. If the glass is too big for the microwave kiln, you will have to cut it into smaller pieces using a glass cutter. Only small pieces of glass can cope with the rapid temperature rise of a microwave kiln. The maximum size of the glass for melting in a microwave kiln is 1 x 1 ½ in (2.5 x 3.8 cm)."
    },
    {
      "title": "Put the kiln base into the microwave.",
      "content": "Put the kiln base into the microwave. Center the kiln base on the rotator tray. Check that the fiber paper and glass is still in the right place. In some microwave models, the rotator tray can vibrate or shift slightly while it's running. This will cause the glass to move and may disrupt the firing process. If this is the case, remove the rotator tray from the microwave and place the kiln in the centre of the microwave. A rotator tray is more effective however, as this will help to distribute the heat and to melt the glass evenly."
    },
    {
      "title": "Cover the kiln base with the lid.",
      "content": "Cover the kiln base with the lid. Carefully fit the lid over the kiln base in the microwave. Be careful as the black coating on the inside of the lid is very delicate and can crack off if knocked. The black coating is a high temperature susceptor material which absorbs microwave energy. The composition of the black coating differs among kilns, but is usually a combination of graphites and iron oxides."
    },
    {
      "title": "Run the microwave for between 3 to 12 minutes.",
      "content": "Run the microwave for between 3 to 12 minutes. The amount of time that it takes for the glass to melt depends on the size of the microwave kiln, the composition of the glass, and the wattage of the microwave. Generally the lower the wattage of the microwave, the longer the firing time will be. Refer to the instruction manual of your microwave kiln to determine the exact firing time that will be needed the melt the glass. For simply melting the glass, 3 to 4 minutes usually does the trick. However if you are fusing glass pieces together, it could take up to 12 minutes."
    },
    {
      "title": "Remove the kiln from the microwave immediately when the firing is complete.",
      "content": "Remove the kiln from the microwave immediately when the firing is complete. Hold both the top and the bottom of the kiln firmly as you lift it out, and place it on a heat resistant surface such as tile or brick. Make sure that the lid isn’t bumped throughout the process, and that it is kept tightly in place. A good way to tell if the firing process is complete is to watch for a yellow glow at the top of the kiln. The glow will change from red, to orange, to yellow throughout the firing process, which indicates that the glass has melted. Taking the kiln out of the microwave straight away will prevent the microwave ceiling from being damaged by the heat escaping from the kiln vent."
    },
    {
      "title": "Keep the kiln closed for 40 minutes before opening.",
      "content": "Keep the kiln closed for 40 minutes before opening. Make sure that there is at least at least a 6 in (15 cm) space allowance around the kiln as you open it, as it will remain very hot for a long time. When opening, place the kiln lid upside down to prevent heat building up beneath it. Removing the lid too soon can result in thermal shock, which may cause the glass to break."
    },
    {
      "title": "Take the melted glass out of the kiln when cool.",
      "content": "Take the melted glass out of the kiln when cool. The glass should be cool after around 40 minutes, however if the piece is larger it may take slightly longer. You can then remove the fiber paper off the base of the glass by using a damp paper towel, or rinsing the glass with warm water. Wait until the kiln is completely cool before using it for firing glass again. Using the kiln continuously without letting it cool can damage it."
    },
    {
      "title": "Clean out the kiln to remove all dirt.",
      "content": "Clean out the kiln to remove all dirt. It’s common for the kiln to have debris and dust from prior projects scattered inside. Vacuum inside the kiln, and repair any loose screws or elements. The instruction manual for your kiln will provide details on how to best keep it maintained and clean."
    },
    {
      "title": "Determine whether you want a tack, medium, or full fuse.",
      "content": "Determine whether you want a tack, medium, or full fuse. The type of fuse determines the characteristics of the finished product, and how the pieces of glass will join together. The fuse type will also influence the firing profile that you pick later on, because as the temperature increases, the glass loses its hard edges and corners. [1] X Research source A tack fuse (1350 - 1370°F / 732 - 743°C) is the lowest temperature fuse. The glass pieces will stick together, but will maintain many of their original features, such as edges and relief. A tack fuse is best for projects with lots of detail. [2] X Research source A medium fuse (1400 - 1450°F / 760 - 788°C) is a common fuse type. It is similar to a tack fuse, as many characteristics of the glass pieces are kept, however the edges become rounded. [3] X Research source A full fuse (1460 - 1470°F / 793 - 799°C) occurs when the glass is heated for long enough, or at a high enough temperature, to melt the glass entirely together. Glass that has been fully fused is smooth and glossy, with rounded corners and edges. [4] X Research source"
    },
    {
      "title": "Load the glass project into the kiln.",
      "content": "Load the glass project into the kiln. Place the glass in the centre of the kiln either on kiln fiber paper, or on a kiln shelf. If you use the kiln shelf, make sure to paint it first with batt wash. The fiber paper and the batt wash both act as a separator, and will prevent the glass from sticking to the kiln."
    },
    {
      "title": "Establish the firing profile.",
      "content": "Establish the firing profile. The firing profile is the sequential process of heating and cooling the glass across different rates and temperatures. This is what will determine how the pieces of glass in your project will fuse together, and what the finished product will look like. [5] X Research source An example of a generic firing profile is - segment 1: Heat the kiln at 400°F (200°C) per hour, up to 1100°F (600°C). Segment 2: Slow the heating rate to 200°F (111°C) per hour. Segment 3: Hold the temperature at 1240°F (670°C) for 30 minutes. Segment 4: Heat at the highest rate to 1480°F (804°C). Segment 5: Soak for 10 minutes. Segment 6: Cool the kiln down at the fastest rate to 950°F (510°C). Segment 7: Hold the temperature for 30 minutes. Segment 8: Cool the kiln down to room temperature at 200°F (111°C). The success of a firing profile can be dependent on the type of glass that you are using. Experiment using different types of profiles and glass until you get your desired result. [6] X Research source There are many firing profiles available online, and it is likely that there will also be some in the manual of your kiln. You can adjust the firing profile to better suit your project if needed. [7] X Research source"
    },
    {
      "title": "Heat up the kiln to 1000°F (538°C).",
      "content": "Heat up the kiln to 1000°F (538°C). The initial heating segment of the firing profile differs between kilns. It can be done at different rates, and can take different amounts of time depending on the kiln, the firing profile, and your project. [8] X Research source You can heat up the kiln from between 500°F (260°C) to 1000°F (538°C) per hour, depending on your firing schedule."
    },
    {
      "title": "Soak the glass for 10 minutes once it reaches 1000°F (538°C).",
      "content": "Soak the glass for 10 minutes once it reaches 1000°F (538°C). Soaking means to hold the glass at a particular temperature for a certain amount of time. This is a generic outline for soaking, and may be slightly different according to your firing schedule."
    },
    {
      "title": "Heat the kiln to 1175°F (635°C) and hold for 10 minutes.",
      "content": "Heat the kiln to 1175°F (635°C) and hold for 10 minutes. This will help to relax the glass. The number of bubbles that form between the layers will also be reduced. [9] X Research source This segment allows the glass to devitrify. Devitrifying makes the glass brittle, and white bubbles will form on the surface at this time. It’s important to get the glass through this segment for fusing to be able to occur. [10] X Research source"
    },
    {
      "title": "Increase the kiln setting to high to reach the target temperature.",
      "content": "Increase the kiln setting to high to reach the target temperature. This will fuse the glass at the fastest possible firing rate for your kiln. Reaching 1460°F (793°C) will fully fuse your project, but you can reduce this to 1350°F (732°C) if you are only wanting a tack fuse. [11] X Research source Depending on the type and brand of kiln, this can either be done by pressing the \"full\" button, or by adjusting the temperature to 9999°F (5537°C) to help the kiln reach the target as fast as possible. [12] X Research source"
    },
    {
      "title": "Hold the kiln at the target temperature for 20 minutes.",
      "content": "Hold the kiln at the target temperature for 20 minutes. This will be when the glass has melted sufficiently and your project looks as desired. A slightly longer or short amount of time can significantly change how the glass looks, so keep a close eye on it. [13] X Research source If you hold the kiln at the target temperature for too long, it may lose its set shape. You can remove the kiln peephole plug after 10 minutes in order to check the glass. Just make sure that you replace it once you have finished looking."
    },
    {
      "title": "Cool the kiln down to 950°F (510°C) and hold for 30 minutes.",
      "content": "Cool the kiln down to 950°F (510°C) and hold for 30 minutes. This lets the melted glass anneal, which is the process of slowly cooling down the glass so that the internal temperature is the same as the external temperature. This allows the glass to relieve the stress of rapid heating, and results in a successful project without breakage. [14] X Research source The exact annealing point of the glass differs, so check with the manufacturer or where you bought the glass from to find out."
    },
    {
      "title": "Cool the kiln to room temperature.",
      "content": "Cool the kiln to room temperature. Keep the kiln closed, but turn it off and unplug it from the wall. The glass will slowly cool to room temperature, and the time this takes depends on the size of your project. [15] X Research source Glass that is between two and three layers thick will generally take 6 - 8 hours to cool. [16] X Research source Never remove the glass from the kiln until it has cooled to room temperature. Otherwise the glass could experience thermal shock and break. [17] X Research source"
    }
  ]
}