{
  "url": "https://www.wikihow.com/Put-Music-on-an-SD-Card",
  "title": "How to Transfer Music to an SD Card: A Guide to Windows and Mac",
  "steps": [
    {
      "title": "Plug your SD card into your computer.",
      "content": "Plug your SD card into your computer. It should fit into the thin, rectangular slot on your computer's housing. Most Windows computers have an SD card slot in the computer housing, but if yours doesn't, you'll need a USB adapter. If you're attaching a micro-SD card, you'll need to buy a micro-SD-to-USB adapter."
    },
    {
      "title": "Open Start .",
      "content": "Open Start . Click the Windows logo in the bottom-left corner of the screen or press the ⊞ Win key. On Windows 8, place your mouse in the upper-right corner of the screen, then click the magnifying glass icon."
    },
    {
      "title": "Click .",
      "content": "Click . It's on the lower-left side of the Start window."
    },
    {
      "title": "Go to the folder where you keep your music.",
      "content": "Go to the folder where you keep your music. You may have to open multiple folders to do this. For example: if your music is stored in a \"Music\" folder that's in Documents , you'd click Documents and then double-click the \"Music\" folder in the main Explorer window."
    },
    {
      "title": "Select the music you want to move.",
      "content": "Select the music you want to move. You can click and drag the mouse across the music files to select and highlight them, or you can hold the Ctrl key while clicking individual files to select each one you click. You can also select an entire folder of music files instead of the individual files. If you want to select everything in the current folder you can press Ctrl + A ."
    },
    {
      "title": "Click the Home tab.",
      "content": "Click the Home tab. It's in the upper-left corner of the File Explorer window."
    },
    {
      "title": "Click Copy to or Move to.",
      "content": "Click Copy to or Move to . Both options are in the \"Organize\" section of the toolbar that's at the top of the File Explorer window. Copy to will make duplicates of the selected music files and keep the originals where they are so you can transfer the duplicates to SD card. Move to will transfer the original music files from their current location so you can put them on the SD card. They will not remain in their current location."
    },
    {
      "title": "Click Choose location.",
      "content": "Click Choose location . It's at the bottom of the drop-down menu below the option you clicked ( Copy to or Move to )."
    },
    {
      "title": "Scroll down and click your SD card's name.",
      "content": "Scroll down and click your SD card's name. It will be beneath the \"My Computer\" or \"This PC\" heading. You may first have to expand \"My Computer\" or \"This PC\" by clicking the arrow next to it."
    },
    {
      "title": "Click Copy or Move.",
      "content": "Click Copy or Move . The button you see here depends on the whether you selected \"copy to\" or \"move to\" earlier. Doing so will prompt your music to begin transferring to your SD card."
    },
    {
      "title": "Wait for your music to finish transferring.",
      "content": "Wait for your music to finish transferring. The time it takes for the music files to transfer will vary based on your computer's speed and the amount of music you're putting on the SD card."
    },
    {
      "title": "Remove your SD card",
      "content": "Remove your SD card . Once the files have been copied, click the thumb-drive shaped icon in the bottom-right corner of the screen, then click Eject . You can then unplug the SD card from the computer. You may have to click before you are able to see the thumb-drive icon."
    },
    {
      "title": "Plug your SD card into your computer.",
      "content": "Plug your SD card into your computer. It should fit into the thin, rectangular slot on your computer's housing. If your computer doesn't have a regular SD slot, you'll need an SD-to-USB adapter. The same goes for a micro-SD card."
    },
    {
      "title": "Open the Finder.",
      "content": "Open the Finder. It's a blue, face-like icon in your Mac's Dock. Doing so will open a window with the different locations on your computer listed."
    },
    {
      "title": "Select the music you wish to add.",
      "content": "Select the music you wish to add. Click a folder where you keep music, then click and drag the mouse cursor across multiple music files to select them. You can also hold ⌘ Command and click each file you wish to select. If you can't find your music folder, click All My Files to browse through all files on your Mac. Music files on Mac resemble the iTunes logo on a white background."
    },
    {
      "title": "Click the Edit menu item.",
      "content": "Click the Edit menu item. It's in the upper-left corner of your Mac's screen."
    },
    {
      "title": "Click Copy.",
      "content": "Click Copy . This option is in the Edit drop-down menu."
    },
    {
      "title": "Click your SD card's name.",
      "content": "Click your SD card's name. You'll find it below the \"Devices\" heading on the left side of the Finder window. Doing so will open the SD card's window in the Finder. Your SD card's name will be \"NO NAME\" by default."
    },
    {
      "title": "Click the Edit menu item again, then click Paste Items.",
      "content": "Click the Edit menu item again, then click Paste Items . This will copy your selected music files onto the SD card. This process may take awhile, depending on the number of files you're moving and your computer's speed. If you only copied one music file, you'll click Paste Item instead."
    },
    {
      "title": "Click the eject button.",
      "content": "Click the eject button. It's an upward-facing arrow to the right of your hard drive's name in Finder. Doing so once the music has finished transferring ensures that you can remove your SD card without having to worry about losing or corrupting your music files."
    }
  ]
}