{
  "url": "https://www.wikihow.com/Play-Capture-the-Flag",
  "title": "Capture the Flag: How to Play & Win",
  "steps": [
    {
      "title": "Choose 2 similar objects to be “flags.”",
      "content": "Choose 2 similar objects to be “flags.” Use literal flags, or just use 2 random objects, as long as they’re of similar size and shape. If you’re playing at night, it’s best to have something light colored. Some good options include: Bandanas Old t-shirts Balls and Frisbees (you may make a rule that they can be passed once found, or they have to be carried) Cones Old toys"
    },
    {
      "title": "Locate a large, open area to play.",
      "content": "Locate a large, open area to play. You need plenty of room to run around and places to hide the flag. Lots of obstructions and obstacles, such as bushes or trees, will give you places to hide as you search for the opponents’ flag, which can make the game more fun as well. Play in a big front or backyard, a paintball course, or a large stretch of woods, especially with a stream or set of power lines in the middle. [1] X Research source Try using a local park if it’s empty enough. If you don’t have access to enough outdoor space, or if you want to play during inclement weather, play in a big indoor space such as a gymnasium. Playing on land with obstructions gives you places to hide, but you can play a modified version of capture the flag on completely flat ground. Simply place the flags at the farthest ends of the field in plain sight. Split the field in half, then start playing. The game then becomes more about running, dodging, and tagging than hiding."
    },
    {
      "title": "Mark the boundaries of the playing field.",
      "content": "Mark the boundaries of the playing field. First and foremost, designate the center line dividing your territory from your opponents’ territory. It is often easiest to use a natural line, like the edge of the house or 2 big, noticeable trees. Then decide how far back and to the sides you will be playing. This prevents one team from hiding the flag incredibly far from the center line. While natural lines (trees, shrubs, roads, etc.) may be easy to use as boundary markers, old shirts, athletic cones, and small objects like toys can make it easier for everyone to see the center line if there are no good natural dividing lines. You don't have to mark off the back and sides. As long as everyone knows not to hide the flag past the boundaries there likely won’t be a problem."
    },
    {
      "title": "Hide your team's flag secretly on your territory.",
      "content": "Hide your team's flag secretly on your territory. Once the boundaries are set, each team will designate 1-2 players as \"hiders\" who will run off to secretly tuck their flags away. The other team members will stay together, out of sight (in the house or garage, at the center line, etc.), and make sure no one is looking where the flags are hidden. There are a few rules to flag hiding; modify or skip them if you want the game to be harder: [2] X Research source The flag must be partially visible and not totally concealed. The flag cannot be tied down or wedged—players need to be able to grab it as they run past. The flag can't be buried or raised up too high; it must be at a level where it can be easily snagged. Keep the flag visible, but remember: the goal of the game is to locate and steal your opponent's flag, so don't make your flag too easy to find!"
    },
    {
      "title": "Pick \"jails\" for each team.",
      "content": "Pick \"jails\" for each team. Jail is where a player goes if they get tagged by an opponent. If your teammate is tagged, run over and tag them to \"free\" them again. Jails are usually established right in the center of each team's territory, and they must both be the same distance from the center line for each team."
    },
    {
      "title": "Find an even number of people to play with and break into 2 teams.",
      "content": "Find an even number of people to play with and break into 2 teams. You can play with any number of people, but it tends to be more fun with at least 10 or 12. This way you have 2 even teams of 5 or 6. If possible, try and find a way to separate the teams with different color shirts, hats, or bandanas. [3] X Research source The game can still work with an uneven number of players. Have the extra player hide the flags by themselves, for example, so neither team knows where to look. They can then act as a referee, judging whether or not someone was tagged. Consider making it so that the team with the \"better territory\" (for example, a backyard with many more hiding spots) has one less player, evening the playing field. If you've got a lot of people (say, more than 30), consider breaking into more than 2 teams to prevent any one team from getting overcrowded. This also makes for a more exciting and chaotic game!"
    },
    {
      "title": "Make sure everyone is aware of any \"specialty\" rules before starting the game.",
      "content": "Make sure everyone is aware of any \"specialty\" rules before starting the game. Capture the flag is a pretty simple game—you try and get the flag from the other team back to your side. If you get tagged you go to jail until someone on your team saves you. But there are some small rules that are best worked out before you start playing. There is no \"right\" way to play, so simply pick the rules that you like the most and make sure everyone is on the same page. Here are some questions to consider as you establish the rules you’ll play by: [4] X Research source When a player is freed from jail, do they need to run back to their side before getting re-tagged, or do they get a free walk back? Can a player save everyone in jail at once, or just one person? Players must steal their opponents' flag and take it back to their territory to win. If a player grabs the flag and is tagged on the way back to their side, do they drop the flag there or let the other team return it? Can you move your own team's flag somewhere new? If players guard their flag, it can make it impossible for the other team to get. How far must a player stand away from their own flag? [5] X Research source If you're playing with more than 2 teams, does the winning team need to capture every opponent's flag, or just the majority of the flags?"
    },
    {
      "title": "Break your team up into \"guards\" and \"attackers.\"",
      "content": "Break your team up into \"guards\" and \"attackers.\" The best way to play as a team is to have set roles. This way you know that a certain number of people will be defending your flag, no matter what. You may want one more guard than attacker, someone who focuses on getting your team out of jail if anything goes wrong. Guards: Guards patrol the center line and the rest of your field, ready to tag anyone who crosses or tries to find your flag. They alert the rest of the team when they've found someone hiding or sneaking on their side. They also try to prevent jailbreaks. Attackers: Attackers try to sneak away or outrun the guards, looking for the flag. They will often go to jail while searching, so other attackers need to take turns saving them so that all the attackers don't end up in jail at once. Once they find the flag, they tell the rest of their team and try to capture it. Scouts/Rangers/Recon (Optional): If you have a big team, you'll want a few fast players who can switch between offense and defense, depending on the team's needs. These players usually save others from jail, help search for the flag near the border, defend when the guards are outnumbered, or slowly sneak into enemy territory while the attackers distract the guards."
    },
    {
      "title": "Plan your modes of attack with your team members.",
      "content": "Plan your modes of attack with your team members. The fun of capture the flag comes from the strategy involved. Do you want to play defensively, picking off the other team's attackers and then rushing them with superior numbers? Or do you want to try and sneak into their side, hiding and moving slowly to spend as much time looking for the flag as possible? Talk with your team to work out a game plan for the best results. Some strategies include: The Mad Rush: A desperate move, or one used if you know where the flag is, this involves sending almost everyone in at once in the hopes that one person gets the flag back safely. The Decoy: Risky but rewarding, this involves sending some of your fastest players all to one side of the field. Their goal is simply not to get tagged, drawing as many guards to chase them as possible, while another player on the other side of the field quietly sneaks around to look for the flag. Blockers: If you have the flag or know where to find it, group up with 3-4 other teammates. Run together towards the flag with your fastest person in the middle and the rest of the team 4–5 feet (1.2–1.5 m) away on either side, taking tags as \"blockers.\" Note, however, that once a player is tagged they must stop playing and go to jail. They cannot keep blocking after they've been tagged."
    },
    {
      "title": "Hide your flag cleverly.",
      "content": "Hide your flag cleverly. There are a lot of things to consider when hiding a flag, and the \"best spot\" might not be what you expect at first. Try to think about the first places you would look if you were the other team, as they will likely look their first as well. You usually want a spot that is far back in your territory, but not too near the jail. The farther away your flag, the more ground the team has to cover without being tagged, making it easier to defend. That said, mixing in a very close location once in a while may be a risk worth taking, as the other team might not even look at the nearby hiding spots if they expect it farther back. If the flag has to be visible, try and make it only visible from behind so that the team needs to run all the way around to get a view of it. Putting the flag near your jail may lead to a prisoner seeing it while they wait to be freed, so try and keep some distance."
    },
    {
      "title": "Switch sides after every game.",
      "content": "Switch sides after every game. In order to prevent one team from feeling like they got the \"worst side,\" you should switch sides every game. If the games are quick, play until one team wins by 2 games (3-1, 5-3, etc.). This ensures that the winning team fairly won on both sides of the field."
    },
    {
      "title": "Freeze people when you tag them instead of sending them to jail.",
      "content": "Freeze people when you tag them instead of sending them to jail. If you're tagged, simply stop moving and stand in place until someone on your team tags you. Once you're unfrozen, continue to play again as if nothing ever happened."
    },
    {
      "title": "Play with a frisbee or ball for your flag that you pass to teammates.",
      "content": "Play with a frisbee or ball for your flag that you pass to teammates. This often makes the game much faster and more offensive-minded. If you capture the flag, throw it to a teammate to try and get it out of your territory. The tagging rules still apply. Consider adding a rule stating that if the flag is dropped (by a bad pass or missed catch), the flag must be returned to the starting space. This is a great variation for open-field games, where it is impossible to hide a flag."
    },
    {
      "title": "Hide multiple flags per team.",
      "content": "Hide multiple flags per team. This is a great way to extend the game longer, or make it more fun for larger groups (20+) in large areas. Give each team 3-5 flags to hide individually. The game is not over until all the flags are found by one team. [6] X Research source Consider giving each flag a point score, based on the difficulty of finding and returning it to your base. Set a time limit on the game, and the team with the most points at the end wins. [7] X Research source"
    },
    {
      "title": "Play capture the flag at night.",
      "content": "Play capture the flag at night. Don flashlights or headlamps and head out for a spooky, extra challenging game of capture the flag. Playing at night can lead to some dangerous collisions, so make a rule that players must have a light on while running. However, turning your light off and sneaking slowly around is a great way to search for the flag, or spring a trap on an unsuspecting attacker. Try Capture the Flag REDUX for a ready-to-play glow-in-the-dark capture the flag kit."
    },
    {
      "title": "Tag people with water balloons or \"flour bombs\" instead of your hands.",
      "content": "Tag people with water balloons or \"flour bombs\" instead of your hands. Take a few pairs of pantyhose and cut the legs into 3–4 inch (7.6–10 cm) long sections to create little pantyhose “tubes.” Tie one end of a tube up and fill it with about 1 cup (250 g) of flour. Tie the top up, and make sure all the players are wearing dark clothing. Instead of tagging someone, hit them with the flour bomb, which will leave a puff of flour as proof. [8] X Research source Water balloons or water guns can be substituted as well, but refilling them takes time, especially over a long game."
    },
    {
      "title": "Set up a neutral zone where no one can be tagged.",
      "content": "Set up a neutral zone where no one can be tagged. Having a neutral zone prevents impossible-to-judge situations where 2 players tag each other near or on the line dividing their territories. Simply make the center line 3–5 yards (2.7–4.6 m) wide. If you're in this area, no one can be tagged and sent to jail. Players are not allowed to go to the neutral zone and loiter there! That’s considered cheating."
    }
  ]
}