{
  "url": "https://www.wikihow.com/Measure-Tires",
  "title": "How to Measure Tires",
  "steps": [
    {
      "title": "Check the tire's sidewall to read its wheel diameter.",
      "content": "Check the tire's sidewall to read its wheel diameter. The wheel diameter is often, though not always, printed on the tire's sidewall. You will be able to spot the diameter number by looking for the number followed after a capitalized \"R.\" The tire diameter may be printed in inches or meters, depending on your country. If the wheel diameter is 15 inches (38 cm), for example, the diameter will read as \"R15\" on the number string."
    },
    {
      "title": "Lay the tire down on its side to measure wheel diameter manually.",
      "content": "Lay the tire down on its side to measure wheel diameter manually. If you cannot find a wheel diameter number on your tire's sidewall, measure it yourself. Take the wheel out of your car, then lay it on a flat, smooth surface. A table or an area of ground with no incline works well for measuring tire diameter."
    },
    {
      "title": "Measure the tire from top to bottom for a precise measurement.",
      "content": "Measure the tire from top to bottom for a precise measurement. Take the measurement over, not to the side of, the hub. Depending on your needs, you may also measure the hubcap in a similar way: start at the bottom of the hubcap and finish measuring at its tip. [1] X Research source Use a stiff tape measurer to calculate the wheel diameter. Looser tape measures may not provide as accurate of a diameter calculation because they can bend or tilt."
    },
    {
      "title": "Check your hubcap diameter after you measure wheel diameter.",
      "content": "Check your hubcap diameter after you measure wheel diameter. Hubcap diameter is measured similar. Instead of from the top to bottom of the tire, however, measure from tip to end of the hubcap. Make sure to take your measurement over, not around, the hubcap here as well."
    },
    {
      "title": "Check for the tire width along its sidewall.",
      "content": "Check for the tire width along its sidewall. Often, the tire width will be printed along with other measurements. In most countries, the tire width is printed in millimeters or meters. The tire width number is usually printed directly following a capitalized \"P.\" [2] X Research source [3] X Expert Source Howard Fleischmann Automotive Tire & Repair Specialist Expert Interview. 4 June 2021. If your tire width is 1.75 metres (69 in), for example, the width number will usually be written as \"P175.\" [4] X Expert Source Howard Fleischmann Automotive Tire & Repair Specialist Expert Interview. 4 June 2021."
    },
    {
      "title": "Measure your tire width from one end of the tire to the other.",
      "content": "Measure your tire width from one end of the tire to the other. If you can't find a tire width number on the sidewall, calculate it on your own.The tire width is measured from endpoint to endpoint. If your tire is not connected to your car, stand it vertically while you measure. Take your measuring tape, and record the measurement you get from one end of the tire to the other. [5] X Research source Prop your tire against a straight object if it does not stand up on its own."
    },
    {
      "title": "Check for the aspect ratio along the sidewall as well.",
      "content": "Check for the aspect ratio along the sidewall as well. The tire aspect ratio is the ratio of the tire height divided by the tire width. On a tire sidewall, the aspect ratio will generally be written after a backslash (\"/\"). Aspect ratios are written in percentages. [6] X Expert Source Howard Fleischmann Automotive Tire & Repair Specialist Expert Interview. 4 June 2021. If your aspect ratio is 65%, for example, the number will likely be written as \"/65.\""
    },
    {
      "title": "Divide your width by your diameter to calculate aspect ratio.",
      "content": "Divide your width by your diameter to calculate aspect ratio. Calculate aspect ratio manually if the number is not contained on the sidewall. When you've divided and come to a number, convert that number from a decimal to a percentage. This is your aspect ratio number. If your width is 4 inches (10.2 cm) and your diameter is 24 inches (61 cm), for example, then your aspect ratio is 60%. Make sure you calculated the diameter and width in the same measurement system (e.g. inches or meters) before you calculate the aspect ratio. Use this online aspect ratio calculator as an alternative: https://www.calculator.net/ratio-calculator.html"
    },
    {
      "title": "Position a penny into a groove on your tire tread.",
      "content": "Position a penny into a groove on your tire tread. Tire tread measurements are taken more approximately than other tire measurements. Take your penny and stick it into a groove in your tire. Position it so that Lincoln's head is sticking into the tread. [7] X Research source If you purchased your tires at different times, check all four tires separately."
    },
    {
      "title": "Check whether the tire grooves cover Lincoln's hairline.",
      "content": "Check whether the tire grooves cover Lincoln's hairline. The tire grooves should not cover the entire head but should cover the entirety of Lincoln's hair. If it is, your tire does not need to be replaced. New or used tires with this measurement are safe to purchase."
    },
    {
      "title": "Replace your tires if Lincoln's hairline is left uncovered.",
      "content": "Replace your tires if Lincoln's hairline is left uncovered. If you can see his entire head sticking out, or if you can see part or all of his hairline, your tread is too thin. Purchase new tires as soon as you notice that they are worn to prevent blowouts or other emergencies. Do not purchase used tires that show Lincoln's hairline or his entire head. Their tread is too thin."
    },
    {
      "title": "Measure your tire tread with a quarter as an alternative.",
      "content": "Measure your tire tread with a quarter as an alternative. Stick your quarter into the tire groove in the same way as you inserted the penny, with George Washington's head first. If your tread covers the tip of Washington's head, it is safe to drive on. If there is a gap between the tire tread and Washington's head, replace your tires as soon as you can. [8] X Research source If you prefer not to keep pennies on hand but want to perform a coin test, quarters may be ideal. Quarters, however, offer a less precise measurement than pennies because it may be hard to tell if the tire tread is touching Washington's head."
    },
    {
      "title": "Look for your tire's indicator bars if you do not have access to US currency.",
      "content": "Look for your tire's indicator bars if you do not have access to US currency. Tires often have indicator bars that can help you check how worn your tire tread is. These small bars built into your tire begin revealing themselves as your tire becomes too worn. Replace your tires if you can see the indicator bars partially or fully. [9] X Research source If you are located in the United States, check your indicator bars and perform the penny or quarter test as an added precaution."
    }
  ]
}