{
  "url": "https://www.wikihow.com/Shrink-Leather-Gloves",
  "title": "How to Shrink Leather Gloves with Water or Rubbing Alcohol",
  "steps": [
    {
      "title": "Fill a bowl or basin with lukewarm water.",
      "content": "Fill a bowl or basin with lukewarm water. To get the right temperature, combine tap and boiling water. First, fill the bowl with 2/3 tap water. Next, boil a kettle of water and slowly add the boiling water to the bowl. In the end, the water should be moderately warm to the touch. [1] X Research source Using boiling rather than warm water could affect the color of the gloves."
    },
    {
      "title": "Submerge the gloves and let them soak for 5 to 10 minutes.",
      "content": "Submerge the gloves and let them soak for 5 to 10 minutes. Most gloves feature some kind of water protectant, so to ensure the water soaks through them, it's best to leave the gloves in the bowl for longer than a minute or two."
    },
    {
      "title": "Remove the gloves from the bowl and squeeze out as much excess water as you can.",
      "content": "Remove the gloves from the bowl and squeeze out as much excess water as you can. To do so, simply hold the gloves lengthwise in your hands and squeeze. Start in the center and work your way to the cuff and fingertips. [2] X Research source Be sure not to wring or twist the gloves, which could cause damage to the fibers. Also, do not crumple the gloves."
    },
    {
      "title": "Place the gloves on a clean towel and squeeze once more.",
      "content": "Place the gloves on a clean towel and squeeze once more. You could again hold the covered gloves in your hands and squeeze, starting from the center. You also could press them with your hands while they're inside the towel and on a flat surface. The gloves should feel damp but not wet after this step."
    },
    {
      "title": "Leave the gloves out to air-dry for 24 hours.",
      "content": "Leave the gloves out to air-dry for 24 hours. As a small accessory, it's possible your gloves will feel dry in half the time or overnight. However, to be absolutely sure, leave them alone for a day. [3] X Research source To quicken the drying process, you could use a hair dryer, but this approach can damage the leather. [4] X Research source"
    },
    {
      "title": "Try on your shrunken leather gloves.",
      "content": "Try on your shrunken leather gloves. After the gloves are completely dry, it's time to see how much they shrunk. If all goes well, your gloves should be a snug fit once again. Flex your fingers and ball your hands into fists if the leather feels stiff. Repeat the process if you feel the gloves can shrink more. The initial shrinking will be the most significant."
    },
    {
      "title": "Combine one part water and one part rubbing alcohol in a bowl.",
      "content": "Combine one part water and one part rubbing alcohol in a bowl. The water should be tepid. To get the right temperature, add boiling water to tap water until the water is moderately warm to the touch. Then add the rubbing alcohol until you achieve a 50-50 solution. [5] X Research source Unlike water, which repels oil, alcohol and oil can dissolve in one another. [6] X Research source The rubbing alcohol will help strip away the leather's oil more effectively, allowing the water to truly penetrate the fibers."
    },
    {
      "title": "Add the solution and 2 drops of liquid dish soap to a spray bottle.",
      "content": "Add the solution and 2 drops of liquid dish soap to a spray bottle. Pour the water-alcohol solution into a clean spray bottle. To this 50-50 solution, add a few drops of dishwashing liquid, which will help further break down the leather's oils. Tighten the bottle's top and then shake well."
    },
    {
      "title": "Spray the gloves generously with the solution.",
      "content": "Spray the gloves generously with the solution. You can place the gloves on a clean towel on a flat surface and spray each side. Alternatively, you could hold a glove up by its cuff and spray, turning the glove as you do."
    },
    {
      "title": "Squeeze out any excess water from the gloves.",
      "content": "Squeeze out any excess water from the gloves. Spraying will not result in the gloves becoming saturated like they would have had you submerged them in the solution. However, if there is any drip to the gloves, squeeze this water out. Do not wring, twist, or crumple the gloves when squeezing."
    },
    {
      "title": "Wear the gloves until they're dried.",
      "content": "Wear the gloves until they're dried. As said, this method will not soak the gloves, so it'll take less time for them to fully dry. The rubbing alcohol will also speed up the drying process. Also, wearing the gloves as they dry allows them to conform to the shape of your hand. Putting on a pair of nitrile or latex gloves will help separate the damp feel of the gloves from your skin. You could leave the gloves to air-dry on a clean towel."
    }
  ]
}