{
  "url": "https://www.wikihow.com/Prune-an-Elm-Tree",
  "title": "How to Prune an Elm Tree",
  "steps": [
    {
      "title": "Prune only during the early spring to prevent elm bark beetles.",
      "content": "Prune only during the early spring to prevent elm bark beetles. Many experts claim that the scent of pruned elm bark attracts beetles, which can carry Dutch Elm Disease. Only trim your elm tree in the early spring, preferably before March 31st if you live in the Northern Hemisphere. [1] X Research source Some areas have specific restrictions on the dates when residents are allowed to trim their elm trees. Contact your local government to check if there are regulations in your area."
    },
    {
      "title": "Spray a mixture of bleach and water onto the equipment before pruning.",
      "content": "Spray a mixture of bleach and water onto the equipment before pruning. Before you cut any part of the tree, spray all of your equipment with a mixture of equal parts bleach and water, including the chain of a chainsaw, the blade of a handsaw, pruners, loppers, and shears. This will kill any bacteria that is living on the tools and protect your tree from damage. If you plan to use the equipment to cut another elm tree, dry the tools and re-apply the mixture to the equipment to prevent the spread of Dutch Elm Disease. If you’re using a saw, make sure the blade is sharpened before you begin pruning the tree."
    },
    {
      "title": "Cut the branches about 2 in (5.1 cm) from the trunk.",
      "content": "Cut the branches about 2 in (5.1 cm) from the trunk. When selecting branches for removal, keep in mind that all cuts should be made at the “branch collar,” which is the area where the branch meets the trunk of the tree. Removing branches away from the collar can cause thin regrowth and improper healing. [2] X Research source Even if the branch is healthy, it should still be cut close to the trunk to encourage healthy growth."
    },
    {
      "title": "Remove dead or dying branches with a saw annually.",
      "content": "Remove dead or dying branches with a saw annually. For a mature elm tree, the easiest way to remove branches is with a handsaw or chainsaw. Remember to cut at the branch collar, and look for branches that have broken during the year, or those that have no or very little new growth. If you can’t determine whether a branch is dead or not, try knocking on the wood. If it makes a hollow noise, it is likely dead and can be removed. For young trees, a set of pruning shears or loppers, which are pruning shears with long handles can help to remove dead branches that are less than 3 inches (7.6 cm) in diameter. Have a plan for where your branches are going to fall before making any cuts. Use proper safety equipment, like safety glasses or harnesses, when working with saws, chainsaws, and ladders. Hire a professional service if you don’t have the proper equipment for pruning your tree."
    },
    {
      "title": "Prune any branches that are rubbing against each other.",
      "content": "Prune any branches that are rubbing against each other. Branches that rub together can damage the bark and slow the growth of the tree. Choose one of the branches to cut at the branch collar, and leave the other branch intact for the following year. If possible, cut the branch with the most damage to the bark. If neither have substantial damage, pick the branch whose collar is closer to the top of the tree to increase the amount of light that penetrates to the lower branches."
    },
    {
      "title": "Adjust the shape of the tree by removing middle and upper branches.",
      "content": "Adjust the shape of the tree by removing middle and upper branches. If you want to shape your tree by pruning it, start by removing a few branches in the middle and upper portions of the tree to increase light and oxygen flow in the tree. If possible, select branches that have long offshoots that stick out from the general shape of the tree. Be aware that cutting too much of the top of the tree, or “topping,” can cause the tree to die. Select only a few branches to remove in order to achieve the desired shape and size of the tree. When cutting healthy branches, cut the branch into pieces from the tip of the branch to the collar of the tree. If you cut the entire branch off in one piece at the collar, it might be too heavy and cause other branches to break as it falls to the ground. Don’t remove more than one-third of the canopy in a year."
    },
    {
      "title": "Dispose of all pruned branches and wood to prevent Dutch Elm Disease.",
      "content": "Dispose of all pruned branches and wood to prevent Dutch Elm Disease. In many areas, keeping elm for firewood is illegal because the decaying logs can attract beetles that carry Dutch Elm Disease. Check with your local government to see how you should dispose of pruned branches as soon as possible. [3] X Research source In some cases, you can take the branches to a local landfill as soon as you cut them. However, some areas require that a professional company picks up the wood. If you have to wait for more than 4-5 days to dispose of the branches, put them in garden waste bags, and store them indoors in a garage or shed. Do not burn elm wood, as the chemicals released from burning can also attract beetles."
    },
    {
      "title": "Observe the tree carefully throughout the year for signs of infection.",
      "content": "Observe the tree carefully throughout the year for signs of infection. Elm trees can show signs of Dutch Elm Disease throughout the year. If you notice any changes in the growth of your tree, contact your local government or a professional arborist to test the tree for infection. [4] X Research source In the spring, look for branches that have very small or no leaves compared to the rest of the tree. During the early summer, watch for wilting, shriveling, or brown leaves on some of the branches. As the summer progresses into fall, keep an eye out for yellowing leaves that fall earlier than the rest of the leaves. The rest of the branches will wilt and brown after the yellow leaves begin to fall."
    },
    {
      "title": "Contact a professional to remove infected trees.",
      "content": "Contact a professional to remove infected trees. If your tree is exhibiting signs of Dutch Elm Disease at any point during the year, contact a professional arborist to remove the tree entirely to prevent the spread of disease. Do not try to remove an infected elm tree by yourself, even if you have experience with cutting down other trees. [5] X Research source In the meantime, monitor the tree and other plants closely for signs of disease, and inform any immediate neighbors that you have an infected tree."
    }
  ]
}