{
  "url": "https://www.wikihow.com/Play-Phigros",
  "title": "How to Play Phigros",
  "steps": [
    {
      "title": "Open the App or Play Store.",
      "content": "Open the App or Play Store. The App Store is represented by a letter A on a blue background. The Play Store's icon has a multicolored triangle pointing to the right. Phigros can also be downloaded from third-party app store TapTap. It is not necessary to install TapTap to install Phigros, however."
    },
    {
      "title": "Search Phigros.",
      "content": "Search Phigros . This rhythm game should be one of the top results because of its popularity."
    },
    {
      "title": "Download the game.",
      "content": "Download the game. Phigros is completely free to download and install; there is no fee to download Phigros, nor are there any in-app transactions or advertisements."
    },
    {
      "title": "Open Phigros.",
      "content": "Open Phigros. The game's app icon has a snippet of one of the album covers or one of the characters in-game depending on the version."
    },
    {
      "title": "Understand the judgement line.",
      "content": "Understand the judgement line. This line can move up, move down, tilt, flash, bounce, and disappear. There can also be multiple judgement lines present at a time and false judgement lines appear in a few beatmaps. When the judgement line and the notes collide, that is your cue to hit them. Hit too early or too late and you will get a \"Bad\" judgement (indicated by the note disappearing with no animation) or \"Miss\". Hit the note perfectly and you will get \"Perfect\" - a gold square with a circle inside of it appears where the note is hit. Hit the note almost perfectly and you will get a \"Good\" - a blue square with a circle inside of it appears where the note is hit."
    },
    {
      "title": "Know how notes are registered.",
      "content": "Know how notes are registered. Notes are registered by touching in the same column as where the note is falling. You do not have to touch the judgement line exactly for the note to register."
    },
    {
      "title": "Hit the tap notes.",
      "content": "Hit the tap notes. These notes appear as flat blue lines. Tap these notes when they touch the judgement line. Tap notes are assigned \"Perfect\", \"Good\", \"Bad\", or \"Miss\", depending on your accuracy."
    },
    {
      "title": "Hold the hold notes.",
      "content": "Hold the hold notes. These notes appear as taller blue bars. Tap these notes when they touch the judgement line, then hold your finger down until the hold note vanishes. If the hold note moves, then move your finger to keep it aligned with the note. Hold notes are assigned \"Perfect\", \"Good\", or \"Miss\", depending on your accuracy."
    },
    {
      "title": "Catch the catch notes.",
      "content": "Catch the catch notes. These notes are colored yellow. Make sure that your finger is present at the location of the catch note when it touches the judgement line. Catch notes are assigned \"Perfect\" or \"Miss\". While you can catch the notes a little bit ahead or behind, the note will not register if you are too far ahead or behind. You do not need to tap catch notes; just ensure your finger is pressed in the same column as a flick note when it hits the judgment line."
    },
    {
      "title": "Flick the flick notes.",
      "content": "Flick the flick notes. These notes are colored pink and have a point in the center. These can be flicked in any direction. Flick notes are assigned \"Perfect\" or \"Miss\". In sequences of multiple flick notes, you do not need to lift your finger between flick notes."
    },
    {
      "title": "Score at least 700000 to pass the level.",
      "content": "Score at least 700000 to pass the level. Any score between 700000 and 819999 is a C, 820000 and 879999 is a B, 880000 and 919999 is an A, 920000 and 959999 is an S, 960000 to 999999 is a V, and 1000000 is a φ."
    },
    {
      "title": "Obtain an S on a song's hard difficulty to unlock the same song's insane difficulty, and obtain an S on insane to unlock the another difficulty.",
      "content": "Obtain an S on a song's hard difficulty to unlock the same song's insane difficulty, and obtain an S on insane to unlock the another difficulty. This can be used to play harder and harder songs in the game. It shall be noted that not all songs have an another difficulty level beatmap."
    },
    {
      "title": "Obtain an A on a song to unlock the next song in the pack/story.",
      "content": "Obtain an A on a song to unlock the next song in the pack/story. Upon doing this, all songs up to the difficulty just passed will be unlocked. Harder difficulties will remain locked."
    },
    {
      "title": "Obtain \"storage\" to get new songs in the Single Collection.",
      "content": "Obtain \"storage\" to get new songs in the Single Collection. Each song costs about 16 MB, while new songs may cost 8 MB. Phigros does not have in-app purchases, so the only way to get more \"storage\" is to pass songs with high marks and to view the story files."
    },
    {
      "title": "Read the story files to get hints on how to unlock hidden or harder songs.",
      "content": "Read the story files to get hints on how to unlock hidden or harder songs. Some songs have hidden difficulties. Other songs remain completely hidden until you complete their required objectives. For example, you may need to play a certain series of songs and get specific grades or scores in order to unlock hidden songs."
    }
  ]
}