{
  "url": "https://www.wikihow.com/Remove-Bing-from-Chrome",
  "title": "2 Fast Ways to Remove Bing from Chrome: PC, Mac, & Mobile",
  "steps": [
    {
      "title": "Open Chrome and click the three-dot menu ⋮.",
      "content": "Open Chrome and click the three-dot menu ⋮ . You'll find this menu at the upper-right corner of Chrome. [1] X Research source"
    },
    {
      "title": "Click Extensions on the menu.",
      "content": "Click Extensions on the menu. This displays a list of all browser extensions installed in Chrome. [2] X Research source"
    },
    {
      "title": "Remove any Bing-related browser extensions.",
      "content": "Remove any Bing-related browser extensions. If you see any extensions like Microsoft Rewards, Give with Bing, Bing Pages, or Microsoft Bing FrontPage, or Microsoft-related extensions, you can click Remove to delete it from Chrome. These extensions rely on Bing, so removing them will bring you closer to removing Bing from Chrome. If you see any other browser extensions you don't want or don't use, you can remove those as well."
    },
    {
      "title": "Click the three-dot menu and select Settings.",
      "content": "Click the three-dot menu and select Settings . This is the same three-dot menu you clicked earlier. [3] X Research source"
    },
    {
      "title": "Click Search engine.",
      "content": "Click Search engine . It's in the left column. [4] X Research source"
    },
    {
      "title": "Click Change next to \"Bing.\"",
      "content": "Click Change next to \"Bing.\" If Bing is your default search engine, you'll see it listed here. Clicking Change will bring up additional search engines to choose from. If you see Google or another search engine here, Bing is not your default search engine, so you can skip to step 8 ."
    },
    {
      "title": "Select a search engine other than Bing as your default.",
      "content": "Select a search engine other than Bing as your default. Click the three-dot menu ⋮ next to your preferred search engine, like Google or DuckDuckGo , then click Make default . [5] X Research source To remove Bing from the list of suggested search engines, click the three dots next to Bing and select Delete ."
    },
    {
      "title": "Click the On startup tab.",
      "content": "Click the On startup tab. You'll see this tab in the left panel of your Chrome settings."
    },
    {
      "title": "Remove Bing from your startup pages.",
      "content": "Remove Bing from your startup pages. The easiest way to do this is to select Open the New Tab Page , which ensures that all new tabs open to the default Chrome start page and not Bing. If Chrome is set to \"Open a specific page or set of pages,\" check the list of websites for any instances of Bing. To remove a page, click the three dots next to it, then select Remove . Alternatively, you can choose Continue where you left off so Chrome always opens to the last page you were viewing."
    },
    {
      "title": "Reset Chrome",
      "content": "Reset Chrome if you're still redirected to Bing. If you've completed this method and still see Bing in Chrome, resetting Chrome could help. This will delete all of your cookies, pinned tabs, shortcuts, and saved preferences. You won't lose your saved passwords , web-browsing history, or bookmarks. To reset Chrome: [6] X Research source Click the three-dot menu and select Settings . Click Reset Settings in the left panel. [7] X Research source Click Restore settings to their original defaults . Click Reset settings ."
    },
    {
      "title": "Scan for viruses",
      "content": "Scan for viruses and malware if you're still redirected to Bing. If, at this point, you're still seeing Bing when searching or browsing the web, it's likely due to a malware infection called Bing Redirect. Run a malware scan on your PC or Mac to located and remove potentially-unwanted programs. After removing this (or similar) malware, repeat the steps in this method to clear out any remaining instances of Bing from Chrome. A great malware scanner that's free to use and available for both Windows and macOS is Malwarebytes . Mac users can also use ClamXav. If you're using Windows, you can also scan using Windows Security, which should detect Bing Redirect with no issues. Type security into the Windows search bar and click Windows Security in the search results. Click Virus & threat protection , click Scan options , select Microsoft Defender Offline Scan , and follow the on-screen instructions."
    },
    {
      "title": "Open Chrome and tap the three-dot menu ⋮ ••• .",
      "content": "Open Chrome and tap the three-dot menu ⋮ ••• . If you're using an Android, the dots are vertical and next to the address bar. If you're on an iPhone or iPad, the dots are horizontal and at the bottom-right corner of Chrome. [8] X Research source"
    },
    {
      "title": "Tap Settings on the menu.",
      "content": "Tap Settings on the menu. [9] X Research source"
    },
    {
      "title": "Tap Search engine.",
      "content": "Tap Search engine . If you're using an Android, it'll be in the \"Basics\" section. If you have an iPhone or iPad, it's in the second group of settings."
    },
    {
      "title": "Select a search engine other than Bing.",
      "content": "Select a search engine other than Bing. If Bing is your default search engine, searching from the browser address bar would run the search through Bing. Tap a different search engine here (such as Google or DuckDuckGo ) to prevent Bing from opening. [10] X Research source"
    }
  ]
}