{
  "url": "https://www.wikihow.com/Play-Music-Through-Mic",
  "title": "Play Music Through Your Microphone: Share Music With Friends",
  "steps": [
    {
      "title": "Set up your microphone to pick up music.",
      "content": "Set up your microphone to pick up music. Microphones vary in shape, quality, and pickup pattern. Some can even change their pickup pattern! Whether you’re performing live music online, or streaming music from a source, setting up your microphone differently can improve the quality on the listener’s end. Place your microphone on a stand or mount. If you’re using mic without a good stand (like your phone ), this can help prevent it from picking up vibrations from your desk. Upgrade your microphone. Switching from something like a laptop’s built-in microphone to a dedicated USB mic can make a significant difference in streaming quality. Research your microphone’s pickup pattern. Microphones have different pickup patterns, which are the directions that the mic best picks up sound from. For example, the cardioid pattern picks up the most sound from directly in front of the mic, and nearly none from behind it."
    },
    {
      "title": "Play your music at a high quality.",
      "content": "Play your music at a high quality. Microphones can’t preserve the quality of your music perfectly. Plus, streaming the music over the internet will cause even more reduction in quality. Playing your music at the highest quality possible will mean you’re starting better off! Here are some tips for better music quality: Increase the audio quality from the music streaming source. Upgrade the speakers you're using to play music. Potentially play your music from a record player for higher quality sound."
    },
    {
      "title": "Improve the acoustics in your room.",
      "content": "Improve the acoustics in your room. A room with less than ideal acoustics may cause your music to become distorted or muffled. Or, there might be an echo. You can install soundproofing foam in your room to help prevent these issues. Or, place some rugs near your setup! They’re great for absorbing sound."
    },
    {
      "title": "Open the Control Panel.",
      "content": "Open the Control Panel. You can search “control panel” in the Windows Start menu to open it. In this method, you’ll switch your audio input to “Stereo Mix” so you can stream music directly from your computer’s sound output. This feature might be called “What U Hear” on some devices. [1] X Research source The Stereo Mix option is only available if your sound card and audio driver support it."
    },
    {
      "title": "Click Hardware and Sound.",
      "content": "Click Hardware and Sound . If this isn’t an option, select Sound ."
    },
    {
      "title": "Click Sound.",
      "content": "Click Sound . This will open the control panel Sound options."
    },
    {
      "title": "Right-click a blank area in the Recording tab.",
      "content": "Right-click a blank area in the Recording tab. Make sure the following options have a checkmark: Show Disabled Devices Show Disconnected Devices"
    },
    {
      "title": "Right-click Stereo Mix.",
      "content": "Right-click Stereo Mix . If your sound card supports it, Stereo Mix should appear in the list of recording sources."
    },
    {
      "title": "Select Enable.",
      "content": "Select Enable . This is in the right-click options menu. Stereo Mix will now be available as an audio input source in your streaming software. Your streaming software may not support multiple mic input channels, meaning that you can only play computer audio or voice audio, not both. You can use a software with audio mixing such as Open Broadcast Software (OBS) to create an audio channel with both computer sound and microphone input. If you want to get really advanced, you could try using a physical sound mixer ."
    }
  ]
}