{
  "url": "https://www.wikihow.com/Ottermode",
  "title": "How to Get an Ottermode Body: Exercise & Diet Tips",
  "steps": [
    {
      "title": "An ottermode body is lean and muscular with broad shoulders.",
      "content": "An ottermode body is lean and muscular with broad shoulders. People with an ottermode body type have a physique similar to professional swimmers. This body type is characterized by a lean and fit build, defined but not bulky muscles, sculpted abs, a V-shaped torso, broad shoulders, and a slightly lower body fat percentage than average. [1] X Research source People with an ottermode body tend to have a body fat percentage comparable to athletes. This is between 9 and 12% body fat for men and 14 and 24% body fat for women. [2] X Research source Most people with an ottermode body have a healthy BMI (body mass index) range between 18.5 and 24.9. [3] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source The ottermode body type is the opposite of the bear mode body type . People with a bear mode physique have a larger build and more prominent muscles."
    },
    {
      "title": "Do weight training exercises weekly.",
      "content": "Do weight training exercises weekly. To build your muscles, weight train all of your major muscle groups at least 2 times a week. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Personal trainer and strength coach Brendon Rearick says to do 2 to 3 sets of 8 to 12 repetitions for most exercises. Rearick recommends focusing on compound movements that work all of your muscles at once, like squats, bench presses, deadlifts, push ups, and pull ups. Use a weight that feels like a challenge to lift at the end of your reps. If you can easily lift the weight by rep 10 or 12, use a heavier weight. [5] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Spend 5 to 15 minutes warming up before lifting weights . We’ll go over the best exercises to incorporate into your routine in the section below!"
    },
    {
      "title": "Get regular cardio exercise each week.",
      "content": "Get regular cardio exercise each week. Cardio exercises help you lose body fat and reveal the muscles you’re building from weight training. Just get at least 150 minutes of moderate cardio exercise each week , such as by walking, biking, or swimming. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Spread out your cardio exercise throughout the week by doing 20 to 30 minutes of cardio each day. Do dynamic stretches before cardio to warm up your muscles. For instance, walk at a slow to moderate pace or do high knees , leg swings, or butt kicks . [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source To burn more calories than traditional cardio exercises , incorporate HIIT (high-intensity interval training) workouts into your weekly routine. HIIT workouts involve short, 30-second bursts of high-intensity exercise followed by several minutes of less intense movements. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Eat a diet of lean protein, complex carbs, and healthy fats.",
      "content": "Eat a diet of lean protein, complex carbs, and healthy fats. Certified personal trainer and nutritionist Pete Cerqua says “the ratio of protein, carbohydrates, and fats I like to see [is] at least 50% protein in each meal…the other 50% is going to be made up of probably 40% carbohydrates and 10% fat.” He says the high ratio of protein is “what's needed for building muscle and burning fat.” Lean protein includes chicken, turkey, salmon, tuna, eggs, tofu, chickpeas, black beans, and almonds. [9] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Complex carbs include whole grains (pasta, quinoa, brown rice), potatoes, corn, squash, lentils, and all kinds of fruits and vegetables. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Healthy, unsaturated fats include avocados, nuts (almonds, cashews), seeds (pumpkin, sunflower), and olive oil. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Eat at maintenance or at a slight caloric deficit.",
      "content": "Eat at maintenance or at a slight caloric deficit. If you’re at a healthy weight and want to maintain it, balance the amount of calories you consume with the amount of calories your body needs each day. If you want to lose excess fat, eat about 500 fewer calories each day. This can lead to a healthy weight loss of 1 pound (0.5 kg) per week. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source To calculate how many calories you need to maintain your current weight, use an online calorie calculator . Or for a rough estimate, multiply your current weight by 15. [13] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Try to maintain your body fat percentage between 9 and 12% for men and 14 and 24% for women. [14] X Research source Calculate your body fat percentage with a tape measure , use an online body fat calculator , or get a DEXA scan."
    },
    {
      "title": "Day 1: Chest, biceps, and cardio.",
      "content": "Day 1: Chest, biceps, and cardio. Warm up and do 2 to 3 sets of 8 to 12 reps of each exercise: [15] X Research source Bench press : Lie back on a bench with your feet planted on the ground about shoulder-length apart. Grip your hands around the barbell with your palms facing away, positioning them slightly wider than shoulder length. Lift the bar off the rack and lower it to your chest so your elbows bend outwards to just below the bench. Lift the bar straight up. Then, slowly lower it back to your chest. [16] X Research source Incline bench press : Adjust a bench to a 40° to 60° incline. Sit back on the bench with your feet planted shoulder-length apart. Grab the barbell in an overhand grip (palms facing away), positioning your hands slightly wider than shoulder length. Lift the bar off the rack and lower it to your chest so your elbows bend outwards and line up with your wrists. Lift the bar straight up and then lower it back to your chest. [17] X Research source Flys : Lie back on a bench with your feet planted on the ground shoulder-length apart. Grab a dumbbell in each hand with your palms facing up. Lift your arms straight up and keep them shoulder-length apart. Slowly lower both dumbbells until they are level with your chest, all while keeping your arms straight. Then, raise the dumbbells back up so they’re straight above you. [18] X Research source Dumbbell curls : Stand up straight with your feet shoulder-length apart. Grab a dumbbell in one hand with your palm facing upwards. Press your elbow to your body and slowly lift the weight up to your shoulder. Keep your wrist straight and rigid and do not swing your arm or elbow. Then, slowly lower the weight back to position. Switch to your other hand when you finish the set. [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Note : Get a spotter to help you when doing bench presses. This exercise plan is similar to the one Brad Pitt followed to prepare for Fight Club . [20] X Research source"
    },
    {
      "title": "Day 2: Legs and cardio.",
      "content": "Day 2: Legs and cardio. Warm up your body and do 2 to 3 sets of 8 to 12 reps of each exercise: Deadlifts : Stand with your feet shoulder-width apart so your shins are almost touching the barbell. Certified personal trainer Melody Sayers says to “sit your butt back and stay heavy in the heels” while keeping your back straight and chest lifted upwards. Grab the barbell with one palm facing you and the other facing up. Press your feet into the floor as you sink back into your hips. Keep your back straight as you straighten your legs and bring the barbell off the floor. Pause and then lower yourself back into the starting position. [21] X Research source Squats : Adjust a rack so the barbell is just below shoulder height. Lower yourself under the bar so it presses against your neck and the top of your back. Grab the bar so your palms face away from you and position them slightly wider than shoulder width. Stand up straight to lift the bar and take a step backward. Sayers says to “take a nice wide stance with [your] feet hip-width apart, and toes pointed straight ahead.” Then, “sit your butt back as if you are about to sit in a chair and keep all the weight heavy in the heels behind you…mak[ing] sure your knees do not come over the front toes.” Press your feet into the ground and straighten your legs to return to the starting position. [22] X Research source Leg extension : Sit on the leg extension machine and adjust the seat so your knees rest against the edge and the bar so it rests against your shins. Then, raise your legs up to lift the bar. [23] X Research source Calf raises : Stand about 1 foot (30 cm) away from a wall with your feet shoulder-length apart. Place your palms on the wall at about chest height. Lift both heels off the floor and pause before lowering them to the ground. [24] X Research source"
    },
    {
      "title": "Day 3: Rest day.",
      "content": "Day 3: Rest day."
    },
    {
      "title": "Day 4: Back and cardio.",
      "content": "Day 4: Back and cardio. Do 2 to 3 sets of 8 to 12 reps of each exercise after warming up: Pull ups : Grab the pull up bar with your palms facing away from you and position your hands slightly wider than shoulder width. Cross one leg behind the other and tighten your core. Pull yourself upwards while bringing your elbows down to your sides. Pause when your chin reaches the bar. Then slowly lower yourself until your arms are fully extended. [25] X Research source Dumbbell row : Stand with your feet shoulder-width apart. Grab a dumbbell in each hand and hang your arms against your sides with your palms facing each other. Push your hips backward and slightly bend your knees while keeping your back straight. Pull the dumbbells to your chest, bringing your elbows behind your back. Then, extend your arms back towards the floor. [26] X Research source Lateral pulldowns : Sit up straight on the lat pulldown machine. Personal trainer Landis Owens says “put your hands at shoulder width apart” on the bar and pull it “directly to your chest.” Press your shoulder blades together and extend your elbows behind you. Then, straighten your arms back to the starting position. [27] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Day 5: Rest day.",
      "content": "Day 5: Rest day."
    },
    {
      "title": "Day 6: Shoulders, triceps, and cardio.",
      "content": "Day 6: Shoulders, triceps, and cardio. Warm up and then do 2 to 3 sets of 8 to 12 reps of each exercise: Dumbbell shoulder press : Stand up straight with your feet shoulder-width apart. Grip a dumbbell in each hand with your palms facing you. Position the weights in front of your shoulders and engage your core. Lift your arms straight over your head, pause, and then slowly lower them back into position. [28] X Research source Dumbbell shrugs : Grab a dumbbell in each hand with your palms facing you. Position your arms by your sides with your feet shoulder-width apart. Contract your core and shrug your shoulders up towards your ears. Pause and then lower your shoulders. [29] X Research source Cable pushdowns : Place a rope attachment on a cable machine and adjust it so it’s above your head. Stand with your feet shoulder-length apart and grab each end of the rope with your palms facing each other. Bend your elbows against your sides. Then, slowly push the rope down to the floor, straightening your arms at your sides. Pause and then return to position. [30] X Research source Overhead tricep extension : Stand up straight with your feet shoulder-width apart. Hold a dumbbell vertically with both hands, wrapping them around the top of the weight. Straighten your arms above you. Then, slowly lower the dumbbell behind your head by bending your elbows at a 90° angle. Lift your arms back up to the starting position. [31] X Research source"
    },
    {
      "title": "Day 7: Rest day.",
      "content": "Day 7: Rest day."
    },
    {
      "title": "An ottermode body type can improve your metabolism.",
      "content": "An ottermode body type can improve your metabolism. By increasing your muscle mass and reducing fat through weight training and cardio, you improve your body’s ability to change food into energy. This also increases your insulin sensitivity and reduces your risk for type 2 diabetes. [32] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "It can improve your health and lower your risk of disease.",
      "content": "It can improve your health and lower your risk of disease. Getting regular exercise helps improve your heart health, lowers your blood pressure, and benefits your mental health. Cardio and weight training can also reduce your risk of developing cardiovascular diseases, heart attacks, and cancer. [33] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source"
    },
    {
      "title": "It can increase your balance.",
      "content": "It can increase your balance. The weight training and cardio exercises you do to achieve an ottermode body strengthen your core and lower body, which help improve your stability and balance. [34] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source This in turn can reduce your risk of falls and injuries. [35] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "It can help improve your endurance.",
      "content": "It can help improve your endurance. Cardio exercises strengthen your heart, increase blood flow, and improve your lung functioning. Together, these components help boost your stamina, increase your energy, build your strength, and fight against tiredness. [36] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "It can increase your flexibility.",
      "content": "It can increase your flexibility. Working out your muscles helps improve your range of motion, allowing you to move and stretch your body farther and with greater ease. [37] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Warming up and cooling down with stretches also increases your flexibility. [38] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Michael Phelps",
      "content": "Michael Phelps Because the ottermode physique is compared to a professional swimmer’s build, it might come as no surprise that former Olympic swimmer Michael Phelps has this body type. Phelps is well known for his long, V-shaped torso, broad shoulders, and low body fat percentage. [39] X Research source"
    },
    {
      "title": "Brad Pitt in Fight Club",
      "content": "Brad Pitt in Fight Club Brad Pitt is also noted for having the ottermode body type while he was filming the movie Fight Club . His character is famous for his lean and defined physique."
    },
    {
      "title": "Aziz Shavershian",
      "content": "Aziz Shavershian Aziz Shavershian, more commonly known as Zyzz, was a famous bodybuilder and YouTuber known for his motivational fitness videos. He was admired for his muscular but lean build."
    }
  ]
}