{
  "url": "https://www.wikihow.com/Say-Goodnight-to-Your-Boyfriend-over-Text",
  "title": "23 Romantic Goodnight Texts to Send to Your Boyfriend",
  "steps": [
    {
      "title": "Send a simple, affectionate text to let your boyfriend know that you care.",
      "content": "Send a simple, affectionate text to let your boyfriend know that you care. Texting complex, dramatic goodnight messages can be fun, but to make your boyfriend smile before bed, wishing him a sweet, peaceful night’s sleep will do the trick too. Depending on your relationship, swap in “I love you” with “You’re special to me,” “You amaze me,” or “I really care about you.”"
    },
    {
      "title": "Reassure your boyfriend that you think he’s an amazing person.",
      "content": "Reassure your boyfriend that you think he’s an amazing person. Flattery and compliments can show him just how much you care. To feel connected from afar, describe what you admire most about your boyfriend. If there are physical or personality traits you know he loves being recognized for, mention them (for example, maybe he loves being complimented on his smile). [1] X Research source"
    },
    {
      "title": "Flattery is a great way to make your boyfriend feel truly loved.",
      "content": "Flattery is a great way to make your boyfriend feel truly loved. Because this is such an intimate observation, he probably hasn't heard this from someone before. So tell him he looks sweet falling asleep, and your compliment will be extra touching."
    },
    {
      "title": "Explain how much you value him to make him smile before bed.",
      "content": "Explain how much you value him to make him smile before bed. Make him feel appreciated and reassured even while you're far apart. For your boyfriend, feeling cherished by someone special to him (AKA, you!) is bound to send him to sleep feeling amazing. [2] X Research source"
    },
    {
      "title": "Let him know that you absolutely love talking with him.",
      "content": "Let him know that you absolutely love talking with him. End the conversation in a way that reminds your boyfriend that if you had it your way, you'd never stop chatting with him. This way, he'll falls asleep feeling great about himself and your relationship."
    },
    {
      "title": "Explain that even in your sleep, you don’t want to be away from him.",
      "content": "Explain that even in your sleep, you don’t want to be away from him. When you’re crazy about your partner, spending just a night away can feel unimaginable. Let him know that you want to be with him all the time—even in your sleep. This’ll send your boyfriend to bed feeling adored, connected, and secure in your relationship."
    },
    {
      "title": "Send your boyfriend a text that proves he’s special to you.",
      "content": "Send your boyfriend a text that proves he’s special to you. When you really care about someone, it feels great knowing that you're just as important to them. Explain to your boyfriend that out of everyone in your life, he’s the one you’ll be thinking of before bed. [3] X Research source"
    },
    {
      "title": "Explain that even when you’re sleepy, he’s still a top priority.",
      "content": "Explain that even when you’re sleepy, he’s still a top priority. This message is as sweet as it gets. You’re emphasizing that even when you’re nearly asleep, your boyfriend’s happiness is still on your mind. Send a message that makes him picture you with your eyes half shut, typing out a loving message before you crash. He’ll feel completely adored."
    },
    {
      "title": "Remind him that when he wakes, a good-morning text will be waiting.",
      "content": "Remind him that when he wakes, a good-morning text will be waiting. Though it's sad to fall asleep in different beds, you two can look forward to the fact that there's so much more to come in your relationship. For every goodnight text, there's a good-morning text soon to follow! Direct his attention towards that positive, and he'll go to sleep with a smile."
    },
    {
      "title": "Send a silly text that’ll make him smile before he falls asleep.",
      "content": "Send a silly text that’ll make him smile before he falls asleep. Send a playful message and not only will you make him feel appreciated before bed—but you’ll make him laugh, too. This'll boost his spirits, and he'll go to bed thinking of how much his girlfriend brightens his mood."
    },
    {
      "title": "To create a sweet, playful moment, pretend you sent him a kiss.",
      "content": "To create a sweet, playful moment, pretend you sent him a kiss. He’s probably wishing he could actually give you a smooch before he goes to bed, so explain that you're wishing the same thing. Follow up with a kiss emoji or a photo of you making a kissy face."
    },
    {
      "title": "He's probably missing your smile, so send a photo to comfort him.",
      "content": "He's probably missing your smile, so send a photo to comfort him. Receiving a photo of you could totally brighten your boyfriend’s spirits, even when he’s feeling lonely without you. If you know there’s something in particular that he’d love to see in a picture, send it over. For instance, send a pic of your beautiful smile or you wearing that shirt he bought you."
    },
    {
      "title": "Send your boyfriend a text that makes him imagine you two together.",
      "content": "Send your boyfriend a text that makes him imagine you two together. When you’re apart, your imagination can be a source of comfort and connection. Describe wanting to cuddle him or kiss him, and your boyfriend will be over the moon. You'll send him to bed dreaming about you two together."
    },
    {
      "title": "Guide him through an imaginative exercise to help you two feel close.",
      "content": "Guide him through an imaginative exercise to help you two feel close. Remind him that if he closes his eyes, you could just as easily be in bed next to him. Bridge the physical gap between you two for the evening, and you'll get to feel connected before falling asleep."
    },
    {
      "title": "Coordinate with him to create a palpable feeling of closeness over text.",
      "content": "Coordinate with him to create a palpable feeling of closeness over text. Tell your boyfriend to look at the same moon, thumb over your matching set of rings, or put his hand on his heart. Tell him that you'll be doing the same thing. The gesture will create a feeling of connection and send him to bed feeling close to you."
    },
    {
      "title": "Borrow lyrics from romantic songs to express your feelings.",
      "content": "Borrow lyrics from romantic songs to express your feelings. Choose lyrics from a song you both love, and you'll remind him of all the great memories you have listening together. Or, send song lyrics that just really speak to you. Your boyfriend will feel touched by your tender words, and he’ll go to bed feeling cared for by you."
    },
    {
      "title": "If you have an affectionate nickname, include it in your goodnight text.",
      "content": "If you have an affectionate nickname, include it in your goodnight text. Pet names help you feel close to your boyfriend because they can feel like they're a part of your own secret, loving language. When you wish him sweet dreams, use the nickname he likes best."
    },
    {
      "title": "Reminisce on the great times you’ve had together.",
      "content": "Reminisce on the great times you’ve had together. To feel connected to your boyfriend, turn his attention to your amazing shared history. For bonus points, send him a screenshot of a message that made you smile. This could be a compliment he sent you, texts where you made plans for a fun date, or the very first messages you sent each other. [4] X Research source"
    },
    {
      "title": "Explain that you’re grateful for the good times you share together.",
      "content": "Explain that you’re grateful for the good times you share together. Part of what makes goodnight texts so endearing is that they’re a way to celebrate all of the fun and emotional connection you two share together every single day. So thank him for creating another amazing memory with you today, whether it was mini-golf, a movie night, or a homemade dinner."
    },
    {
      "title": "Focus on good times that lie ahead—not missing each other tonight.",
      "content": "Focus on good times that lie ahead—not missing each other tonight. To put a smile on his face and show him how much you care, remind him of all the great times you'll have together down the line. Your excitement will flatter him, and he’ll go to bed feeling positive about your relationship—not lonely without you."
    },
    {
      "title": "Dream of your future together to make lonely nights easier to bear.",
      "content": "Dream of your future together to make lonely nights easier to bear. You may not be able to fall asleep together tonight. So instead, send a message that helps him imagine a time when you'll never have to be apart. Distract him from how much he’s missing you and explain that you dream of a serious future with him."
    },
    {
      "title": "Write an intensely romantic message to connect over text.",
      "content": "Write an intensely romantic message to connect over text. To drum up tons of passion while you two are apart, write a message that expresses deep, profound feelings for him. Send something he hasn't heard you say before, and not only will you fight off feelings of disconnection while you're apart, but you’ll actually manage to create new, exciting intimacy over text."
    },
    {
      "title": "Remind your boyfriend that he never needs to fear losing you.",
      "content": "Remind your boyfriend that he never needs to fear losing you. Gaining reassurance from the person we care about can feel so powerful, so give your boyfriend that gift before he goes to bed. Send him to sleep feeling totally secure in your loving relationship by letting him know that he’s all yours."
    },
    {
      "title": "Explain to your boyfriend that there's no one like him.",
      "content": "Explain to your boyfriend that there's no one like him. To turn up the romance, tell your boyfriend that he has a powerful, unique effect on you. This will make him feel special and in all likelihood, elicit a passionate, emotional response from him before he hits the hay."
    },
    {
      "title": "If you feel your affection can't be captured in words, tell him that.",
      "content": "If you feel your affection can't be captured in words, tell him that. Sometimes words just can't seem to explain how deep your feelings are for someone. Let him know that your love for him is bigger than you know how to say, and he'll fall asleep feeling completely adored."
    },
    {
      "title": "Turn your boyfriend's attention toward your exciting future together.",
      "content": "Turn your boyfriend's attention toward your exciting future together. This text will make him feel appreciated, connected, and hopeful about your relationship. Instead of focusing on how you're apart tonight, explain to your boyfriend that with you, the best is yet to come."
    },
    {
      "title": "Send a flirty message to make him wish you two were together.",
      "content": "Send a flirty message to make him wish you two were together. If you’re looking to make him miss you a little, craft a suggestive or sexy message. Send a text that implies you wish you could get physical with him right this second. This will get him excited and send him to bed feeling dazed. He'll go to bed thinking of how lucky he is to have a girlfriend who turns him on—even from far away."
    },
    {
      "title": "Turn up the heat with a sexy, suggestive goodnight text.",
      "content": "Turn up the heat with a sexy, suggestive goodnight text. This message will flatter and excite him. You'll have him wishing that he could show up at your door, ready to warm you up."
    },
    {
      "title": "Raise the sexual tension to make him feel passionate before bed.",
      "content": "Raise the sexual tension to make him feel passionate before bed. To turn up the intensity, stimulate his imagination. Mention the clothes you’re wearing, something you’re doing, or something you’re thinking about. This will drive him wild, and leave you both dreaming of your next meet-up."
    },
    {
      "title": "With a sultry goodnight text, you'll have him hanging on your every word.",
      "content": "With a sultry goodnight text, you'll have him hanging on your every word. Offer him a sexy message, and if you want, you can even open the door to more flirtatious texts before bed. If you want to go down that route, try following up with a question to engage him: \"What do you think we'd do if you were here?\""
    },
    {
      "title": "Turn his attention to how amazing it’ll be the next time you two hook up.",
      "content": "Turn his attention to how amazing it’ll be the next time you two hook up. If you want to make him crave your presence (but don’t want him to feel bummed about being apart), get him thinking about your next rendezvous. This way, you’ll turn up the sexual tension while turning his focus toward a positive: that you two will get to express your passion for each other soon enough."
    }
  ]
}