{
  "url": "https://www.wikihow.com/Reheat-Fried-Chicken",
  "title": "How to Reheat Fried Chicken",
  "steps": [
    {
      "title": "Let the chicken sit out while the oven preheats to 375 degrees.",
      "content": "Let the chicken sit out while the oven preheats to 375 degrees. Take your chicken out of the refrigerator and remove it from any container that it's in. Let the pieces sit evenly-spaced on a plate or platter until they come to room temperature — about half an hour. [1] X Research source Use this time efficiently by doing any other prep work you need to do. Preheating the oven is a must, but you can also prepare side dishes, set the table, and so on."
    },
    {
      "title": "Place the chicken on a baking sheet.",
      "content": "Place the chicken on a baking sheet. Set the chicken pieces on an oven-safe baking sheet. You may want to line the sheet with aluminum foil first for an easier clean-up. It shouldn't be necessary to grease the sheet but this won't hurt your final product. Try to avoid prepping the chicken pieces for the oven before they're room temperature. Cold meat on the inside can interfere with the \"crisping\" process going on at the outside of the meat that's needed to make fried chicken so delicious."
    },
    {
      "title": "Set the chicken in the oven.",
      "content": "Set the chicken in the oven. Place the pan with the chicken pieces in the oven on the center rack. Set a timer for 10 minutes. Some online sources will recommend spritzing the pieces of chicken with a small amount of water to prevent them from drying out, while others omit this step. To add moisture to your fried chicken, in a baking dish, add some vegetable broth or chicken broth and cover it with a lid. Plan for at least 10 minutes of cooking time and as much as half an hour. As you'll see in the next step, cooking times can vary."
    },
    {
      "title": "Check on the chicken pieces frequently.",
      "content": "Check on the chicken pieces frequently. The only difficult part of this reheating method is that different pieces of chicken can heat at different speeds. As a general rule, bigger, thicker pieces (like breasts and thighs) will heat more slowly than smaller pieces (like wings and drumsticks). Since you don't want your smaller pieces to dry out, check them every few minutes after about ten minutes have passed. If they are crispy on the outside and warm all the way through, they're done. One online source lists legs and wings as taking about 15-20 minutes to reheat to perfection and breasts and thighs as taking about 20-25 minutes. [2] X Research source"
    },
    {
      "title": "Remove the chicken from the oven and cool.",
      "content": "Remove the chicken from the oven and cool. When your chicken pieces have regained a somewhat crispy exterior and are warm all the way to the bone, they're ready to eat. Take them out of the oven and carefully move them to a wire rack to cool for about five to ten minutes before eating. Enjoy! You shouldn't generally need to re-season your chicken — any seasoning in the batter will be preserved."
    },
    {
      "title": "Let the chicken come to room temperature.",
      "content": "Let the chicken come to room temperature. Another great way to get fried chicken back to a delicious crispy, golden-brown consistency is to simply fry it again. As with the oven method above, you'll want to take your chicken out of the refrigerator and let it sit in a safe spot for about half an hour before you start to cook it. Do any required prep work (like setting the table, making side dishes, etc.) while you wait. If you don't let the chicken warm back up, it can affect the frying process. Dropping cold chicken into hot oil will significantly reduce the temperature of the oil for a minute or two, preventing you from giving it a crispy exterior. [3] X Research source"
    },
    {
      "title": "Heat frying oil in a heavy pan.",
      "content": "Heat frying oil in a heavy pan. When your chicken is nearly at room temperature, set a pan on the stove and turn the burner to high. Heavier pans like cast iron skillets and dutch ovens are best as they tend to retain heat well. Add plenty of frying oil to the pan and allow it to heat — you want at least enough that the bottoms of your chicken pieces will be submerged. Don't use olive oil or another oil with a similarly low smoke point, as the smoke can give your chicken a bitter, burnt flavor. Instead, use a high-smoke point oil with a neutral flavor like canola, peanut, or vegetable oil. [4] X Research source If you have a deep fryer, you may use it for this method, though this equipment is not required."
    },
    {
      "title": "Fry the chicken pieces for several minutes.",
      "content": "Fry the chicken pieces for several minutes. Carefully add the chicken pieces to the hot oil (a set of tongs can help protect from splashes). Fry the pieces in the oil for about two to three minutes, turning regularly. Feel free to adjust the precise cooking time as you wish. Longer cooking times will give you a drier, crispier skin, but cooking for too long will eventually dry out the meat itself. [5] X Research source Don't be afraid to check your chicken's texture as it cooks."
    },
    {
      "title": "Remove and allow to drain.",
      "content": "Remove and allow to drain. When its skin is dry and crispy, the chicken is done. Transfer the pieces one by one to a wire rack set over a pan and allow them to drain. This step is crucial — letting the oil drain out will help get the skin even crispier. It should take about three to five minutes for the chicken to drain completely. [6] X Research source"
    },
    {
      "title": "Serve and enjoy.",
      "content": "Serve and enjoy. Carefully dispose of the excess oil (or reuse it ) after allowing it to cool. Enjoy your chicken as soon as it is cool enough to eat."
    },
    {
      "title": "Don't use the microwave.",
      "content": "Don't use the microwave. Microwaves are a quick and convenient way of reheating many foods, but they're terrible for fried chicken. Microwaves do nothing to dry out the soggy skin of cold fried chicken as they cook it. [7] X Research source This means that while your final product will be warm, it will generally have a soft, unappealing exterior that simply doesn't compare to the crisp skin of chicken that's been reheated properly."
    },
    {
      "title": "Avoid toaster ovens when possible.",
      "content": "Avoid toaster ovens when possible. In a pinch, when you don't have any other options, you can try using a toaster oven to reheat fried chicken. However, these can often heat chicken unevenly, leaving you with a piece of meat that's hot on the outside and cold on the inside. [8] X Research source In addition, many toaster ovens lack the heating power necessary to get that crucial, crispy texture on the outside of the meat."
    },
    {
      "title": "Don't sear the chicken in a skillet.",
      "content": "Don't sear the chicken in a skillet. Cooking fried chicken in a skillet that isn't full of frying oil is a bad idea. It's more difficult to evenly heat the irregularly-shaped pieces of fried chicken this way, but even if you do, you risk drying out the meat as its fat leaches into the dry pan."
    },
    {
      "title": "Don't let the chicken cool on a paper towel.",
      "content": "Don't let the chicken cool on a paper towel. A stack of paper towels can seem like a good place to cool reheated fried chicken since they can soak up some of the excess grease. However, doing this will also keep some of the pieces of chicken in direct contact with the hot, steamy mixture of the oil and liquid that's draining out of it. This moisture will rehydrate the delicious skin that you worked to get dry and crispy, undoing your hard work."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}