{
  "url": "https://www.wikihow.com/Open-Pistachios",
  "title": "How to Open Pistachios",
  "steps": [
    {
      "title": "Use your thumb to fully crack open the shell if there’s a wide gap.",
      "content": "Use your thumb to fully crack open the shell if there’s a wide gap. Most store-bought pistachios are ripe and ready to be eaten. When you examine a shelled pistachio, observe whether you can see the green meat of the nut between the two halves of the shell. If so, simply pry open the two halves using your thumb. It should give pretty easily and yield a tasty pistachio ready for you to eat. [2] X Research source When shelling pistachios, it’s helpful to have two bowls in front of you: one for the discarded shells, and one for the nut itself. That way, you can keep the shells separate from the nuts."
    },
    {
      "title": "Twist a coin between the shell halves to keep your fingers clean.",
      "content": "Twist a coin between the shell halves to keep your fingers clean. Always use a clean coin (disinfect it before you use it if you aren’t sure of its cleanliness) to make sure you aren’t accidentally introducing bacteria to the pistachio you’re about to eat. Place the coin between the two shell halves and twist it to release the nut. [3] X Research source To clean your coin, wash it with warm water and dish soap; scrub it with a soft-bristled brush to remove any dirt or grime."
    },
    {
      "title": "Crack a barely-opened pistachio with another pistachio shell.",
      "content": "Crack a barely-opened pistachio with another pistachio shell. Sometimes you’ll come across a pistachio that isn’t open wide enough for you to easily access the nut. In this case, look for a slim opening that shows just a glimpse of the green meat inside. Take half of a discarded shell, insert the pointed tip into the crack, and twist the shell while pushing it forward into the pistachio. This movement should act as a lever and force the two halves apart. [4] X Research source"
    },
    {
      "title": "Use gentle pressure to crack open the shell with a jar or can.",
      "content": "Use gentle pressure to crack open the shell with a jar or can. Put a towel over the nut to keep it from skittering away after you crack it. Gently smash the nut with the flat part of a jar, can, or something similar. Once you hear or feel a crack, stop hitting it so you don’t crush the nut. [5] X Research source When you’re outdoors and have pistachios you want to open, you could even use a rock or something similar."
    },
    {
      "title": "Crack multiple nuts at once with a cutting board and a rolling pin.",
      "content": "Crack multiple nuts at once with a cutting board and a rolling pin. Set out a single layer of pistachios on a cutting board, then cover the nuts with a clean dishtowel. Hit the nuts with a rolling pin and repeat this motion over the entire cutting board. Take off the towel, remove the cracked nuts, replace the towel, and repeat until all the nuts are cracked. [6] X Research source"
    },
    {
      "title": "Opt for a nutcracker or a garlic press to crack open a sealed shell.",
      "content": "Opt for a nutcracker or a garlic press to crack open a sealed shell. This option protects your counters or table from potential dings from the shell getting hit against it. Squeeze the pistachio shell until it cracks and then pick the nut out of it. [7] X Research source If you’re using something like a garlic press, make sure to clean it beforehand so your nuts don’t smell and taste like garlic."
    },
    {
      "title": "Invest in a pistachio opener to quickly shell a lot of pistachios at once.",
      "content": "Invest in a pistachio opener to quickly shell a lot of pistachios at once. Some recipes call for a large amount of pistachios, and it can take a long time to shell them all. A pistachio opened can shorten your shelling time, helping you get to baking a lot sooner. [8] X Research source Pistachio openers generally cost anywhere from $10 to $30, depending on the brand. You can buy them online or at your local home goods store."
    },
    {
      "title": "Place the unshelled pistachios into clean, dry, airtight containers.",
      "content": "Place the unshelled pistachios into clean, dry, airtight containers. Use plastic containers with lids or zip-up plastic bags to store your shelled pistachios. Pack them in as tight as you can—it won’t hurt them to be pressed tightly together. The less air the nuts come into contact with, the better they’ll keep. [9] X Research source Avoid using a container that was previously used to store something with a strong scent, like onions or garlic. Even if the container was washed out, the residual scent could still seep from the container into the pistachios."
    },
    {
      "title": "Keep pistachios at room temperature for 2 to 3 months.",
      "content": "Keep pistachios at room temperature for 2 to 3 months. You can put the pistachios into a cupboard or even keep them on a counter or on top of the fridge. Just make sure they’re stored in an airtight container, and try to keep them out of direct sunlight so they don’t get dried out. [10] X Research source If you notice any strange smells or discoloration when you open up the container, chances are the nuts are starting to spoil and you should get rid of them."
    },
    {
      "title": "Store pistachios in the fridge for up to 1 year.",
      "content": "Store pistachios in the fridge for up to 1 year. To prolong the life of your pistachios, keep them in a cool location, like the fridge or a cellar. Always store them in an airtight container rather than in something open, like a basket. [11] X Research source Label the date on the container so you remember how long the nuts will be good for."
    },
    {
      "title": "Freeze pistachios safely for up to 3 years.",
      "content": "Freeze pistachios safely for up to 3 years. Place the pistachios in a freezer-safe bag or plastic container. Keep them frozen until you need them. To defrost them, simply leave the nuts on the counter for 30 to 40 minutes. [12] X Research source Keep the nuts near the front of the freezer to keep them from developing freezer burn."
    }
  ]
}