{
  "url": "https://www.wikihow.com/Measure-Acreage-with-Google-Earth",
  "title": "How to Measure Acreage with Google Earth",
  "steps": [
    {
      "title": "Open the Google Earth program installed on your computer.",
      "content": "Open the Google Earth program installed on your computer. Once launched, you will see a beautiful 3D rendition of our world."
    },
    {
      "title": "Search for the plot of land.",
      "content": "Search for the plot of land. Use the search box on the upper left corner and enter the location of the land you want to measure. Click the Search button beside the search field to continue.The map will move to your new location."
    },
    {
      "title": "Locate the navigation bar.",
      "content": "Locate the navigation bar. At first glance, you may not see the navigation area on the right of the map. Hover over it and it will appear clearly. You will see some navigation buttons to help you move around the map."
    },
    {
      "title": "Focus on the area you want to measure.",
      "content": "Focus on the area you want to measure. Make sure it fits on the screen. Use the navigation buttons and arrows to move around the map and to zoom in or out. Stop when you reach the map view where you can measure properly. Wait a few moments for the rendering to be completed for the location."
    },
    {
      "title": "Bring out the ruler.",
      "content": "Bring out the ruler. Click “Tools” from the header menu bar, then select “Ruler.” A small window will appear for the Ruler functionality."
    },
    {
      "title": "Select the mode of measuring.",
      "content": "Select the mode of measuring. The ruler can measure distance between two points on the ground and distance between multiple points on the ground. Since you want to measure area, you want the latter. Click on the Path tab to measure distance between multiple points on the ground."
    },
    {
      "title": "Identify unit of measure.",
      "content": "Identify unit of measure. Click the drop-down list for the options for the different units of measure. You can choose from Centimeters, Meters, Kilometers, Inches, Feet, Yards, Miles, Nautical Miles, and Smoots. Select Feet from the list, or any other unit of measurement for which you can find the conversion to acreage."
    },
    {
      "title": "Draw the area to be measured.",
      "content": "Draw the area to be measured. Enclose the area you want to measure by plotting points on the ground. You can plot as many as you need to make it as accurate as possible. Each point you add will be connected to the previous point by a yellow line. Connect the final point to the first point to close the area."
    },
    {
      "title": "Get acreage.",
      "content": "Get acreage. The total area will be displayed in the Ruler window. There are 43,560 sq feet in an acre or 4,047 sq meters. Divide the area shown by the appropriate conversion factor to determine the acreage of the land."
    }
  ]
}