{
  "url": "https://www.wikihow.com/Remove-a-Palm-Tree",
  "title": "How to Remove a Palm Tree",
  "steps": [
    {
      "title": "Take a picture of your palm tree.",
      "content": "Take a picture of your palm tree. Several palm tree varieties are considered valuable, and you can make money by uprooting them instead of destroying them. Some companies will remove the tree, buy it from you, and then relocate it. You will need to take a picture of your palm so you can figure out what type it is. [1] X Research source Palm trees differ by their leaves, their trunk shape, their height, and other features. Make sure these are visible in your photo. The Mexican Fan Palm and Queen Palm are the most common varieties, so they are not considered valuable. A couple of palm trees, such as the Chilean Wine Palm or the Kentia Palm, may be valuable."
    },
    {
      "title": "Research your palm tree online to find its species.",
      "content": "Research your palm tree online to find its species. Search online for a picture guide of palm tree varieties. Compare your photo to the pictures to figure out what kind of palm tree you have. Then, you can make a decision on how to remove the tree. [2] X Research source Try a palm tree guide such as http://www.palmidentifier.com/ . If you are unsure, palm tree nurseries or removal companies may be able to help you identify your tree."
    },
    {
      "title": "Make sure the palm tree is in an accessible location.",
      "content": "Make sure the palm tree is in an accessible location. Removal services need plenty of space to work. Clear the area of any vehicles, furniture, and debris. Also, look for any nearby power lines the tree may fall on during removal. If your palm tree is in a small area, such as in an enclosed yard, the palm may cost too much to remove, so relocation services may decide against buying it. [3] X Research source Removing a palm near buildings or power lines can be dangerous, so you should hire a professional tree removal service. Trees in tight spaces are hard to remove safely, so removal companies will charge you more."
    },
    {
      "title": "Consult your local laws about removing tall trees.",
      "content": "Consult your local laws about removing tall trees. Your local government may have laws against removing tall trees. This is for safety reasons, since dealing with a large tree can be dangerous for yourself or others. If your tree is very tall, consult a professional removal service. [4] X Research source For example, in California, you may not be permitted to cut palm trees over 12 ft (3.7 m) on your own. Tall trees often require more workers and tools to cut, so removal companies may charge you more."
    },
    {
      "title": "Contact a reputable tree removal service.",
      "content": "Contact a reputable tree removal service. Once you have decided what to do with your palm tree, find a company willing to remove it. Discuss your options with removal companies in your area. Before choosing a company, always search for the company’s name online to gauge their credentials first. Read reviews from other customers. [5] X Research source For a palm you plan on selling, contact a tree relocation service or nursery to dig up the tree without destroying it. If you plan on cutting down the tree, call a professional removal service."
    },
    {
      "title": "Research the tree before digging it up.",
      "content": "Research the tree before digging it up. You can take a picture of the tree and look for it in an online database. This can help you figure out if the tree is worth uprooting. Some palm varieties are considered valuable by growers and planting companies, and they may want to purchase the tree from you. [6] X Research source If the tree is valuable, or you want to move it without harming it, dig it up instead of cutting it down. Palm tree nurseries and tree removal services can help identify your palm tree and its value."
    },
    {
      "title": "Assess which way the tree should fall.",
      "content": "Assess which way the tree should fall. Stand where you ideally want the palm tree to fall. This should be away from power lines, buildings, and other trees. Detect the tree’s lean by looking along the trunk to the branches. View the tree at other angles as needed to figure out the lean, as well as spot any signs of damage that could change the palm's trajectory. [7] X Research source Check the local regulations before you begin to make sure you follow all laws on tree removal. Plan on bringing the tree down in the direction of the lean. If this isn’t possible, guide the tree by digging out about 24 in (61 cm) of soil around the roots in the direction you want the tree to fall. Make sure the tree’s fronds aren’t tangled up in power lines or anything else that will fall with the tree. Consult a professional if these obstacles are present."
    },
    {
      "title": "Anchor the palm tree to the ground with rope.",
      "content": "Anchor the palm tree to the ground with rope. This is needed in case the tree topples and causes damage, especially if the tree is large. About ⅓ of the way up the tree, wrap 4 strong pieces of rope around the tree trunk. Stretch each rope at least 2 ft (0.61 m) away from the tree. Plant a metal stake in the ground at the end of each rope, then tie the rope tightly to the stake. Each rope should travel an equal distance from the tree. Make sure the ropes are tied tightly. Another way to secure the tree is to stand wood boards against it. Nail 1 end of each board to the tree about ⅓ of the way up the trunk, then stake the other end in the ground. If the tree begins to fall, immediately clear the area. Move to a safe spot out of the tree’s range."
    },
    {
      "title": "Mark a circle around the base of the tree.",
      "content": "Mark a circle around the base of the tree. Measure the tree’s width to make an estimate of the root ball. Expect the root ball to be twice as wide as the tree, up to about 24 in (61 cm) in diameter. Mark this by drawing a circle around the tree with spray chalk. Roots spread out more in taller palm trees. Trees over 16 ft (4.9 m) may have root balls larger than 24 in (61 cm) in diameter. If you plan on transferring or replanting the tree, you may want to make the circle 30 in (76 cm) or larger to avoid damaging larger roots."
    },
    {
      "title": "Dig inwards from the edge of the circle.",
      "content": "Dig inwards from the edge of the circle. Dig around the edge of the circle first, moving the dirt until you can see the bottom of the root balls. Palm trees have a lot of small, stringy roots that don’t spread as far as roots from other trees. Once you have located the ends of the roots, begin working towards the tree trunk until you expose the top of the root ball. [8] X Research source Although palm trees need most of their roots in order to be replanted successfully, a little bit of root damage won’t kill the tree. A crane may also be rented and used to dig underneath the root ball without harming the palm tree."
    },
    {
      "title": "Sever long or stubborn roots with a shovel.",
      "content": "Sever long or stubborn roots with a shovel. Your palm tree can survive some root damage. You can prune large roots that go beyond the root ball. Use a sharp tool like a hoe, shovel, or saw to cut through them. Place the blade on the root near the root ball, then press down on it to sever it. If you can expose the bottom of the root ball successfully, you will not need to sever any roots."
    },
    {
      "title": "Dig beneath the root ball to free the tree.",
      "content": "Dig beneath the root ball to free the tree. Continue digging around the tree until you see the bottom of the root ball. You will need to get your shovel underneath the root ball in order to wedge the tree free. Once the root ball is exposed, the tree is ready to be moved. Cut any long roots if you can’t get to the bottom of the root ball. If the tree begins to fall, move out of the way quickly in case the supports fail."
    },
    {
      "title": "Lower the tree to the ground.",
      "content": "Lower the tree to the ground. The tree can be lowered once the roots are exposed. Ask some helpers to assist you, since palm trees are very heavy. Loosen the ropes on 1 end, then slowly lower the tree to the ground. Do not stand underneath the tree on the side it falls towards. As long as you avoid sawing off the top of the trunk or cutting a lot of roots, the tree can be replanted elsewhere in a hole deep enough to cover the root ball. If the tree is large, you will need a crane to move it after it falls. After it's replanted, it'll need aftercare, such as regular watering, to ensure it takes root."
    },
    {
      "title": "Search for your palm tree online to find out if its worth cutting.",
      "content": "Search for your palm tree online to find out if its worth cutting. Common palm tree varieties, such as the Mexican Fan Palm, cost more to transplant than they do to remove. You can check this by taking a picture, searching through a palm tree database online, and by contacting a tree nursery or removal service for confirmation. If the tree isn’t valuable and you don’t want to save it, you can safely cut it down. [9] X Research source If the tree is in a hard to reach area, such as near buildings and power lines, it is costlier to transplant. These sorts of trees are usually cut down."
    },
    {
      "title": "Wear ear muffs and a facemask.",
      "content": "Wear ear muffs and a facemask. A chainsaw used improperly is dangerous. Protect your hearing by wearing noise-reducing ear muffs. Also put on a hard hat with a flip-up face mask to guard against flying shards of wood. [10] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source Also wear long-sleeve clothing, sturdy work boots, and gloves."
    },
    {
      "title": "Wear a safety harness if you need to climb up a tall tree.",
      "content": "Wear a safety harness if you need to climb up a tall tree. If you plan on trimming your tree first to reduce its weight, you need to climb up it. A harness or hydraulic lift is necessary for trees approximately 12 ft (3.7 m) or taller. Attach the harness to the tree or another stable structure, such as a nearby building. [11] X Research source You can purchase a harness online or at a home improvement store. If you don’t feel safe climbing the tree, either cut the tree without trimming it or hire a professional tree removal service."
    },
    {
      "title": "Evaluate which way the tree will fall.",
      "content": "Evaluate which way the tree will fall. Stand away from the palm and look up the trunk to figure out which way it is leaning. It is most likely to fall in the direction it is leaning. Make sure the tree is clear of any power lines and won’t fall on anything else. [12] X Research source Make sure you are in accordance with local regulations on tree removal, and contact a professional if your palm is near obstacles like power lines. If you can’t fell the tree in the direction it is leaning, you will need to make a deeper notch cut in the direction you want it to fall towards. Cut about ⅓ of the way into the tree’s trunk. If the tree has cracks or holes, it could fall towards the damaged spots. Be aware of these spots and work around them."
    },
    {
      "title": "Clear the area before cutting the tree.",
      "content": "Clear the area before cutting the tree. Make sure everyone is out of the area before you begin working on the tree. Palm trees are very heavy and even the fronds can be damaging if they fall. Keep children and pets far away from the tree until it is on the ground. Always be aware of your surroundings. Have a way to escape in case the tree begins to crack, splinter, or fall towards you."
    },
    {
      "title": "Climb up to reach the tree fronds.",
      "content": "Climb up to reach the tree fronds. If the tree is short enough, you can reach the leaves by using a ladder. Position the ladder next to the branch you wish to cut so it doesn’t fall on you. Otherwise, climb up on a nearby structure or use a hydraulic lift so you are above the fronds. Stand beside or above the palm fronds when trimming them. Never stand under them. Ask a helper to watch the tree to look for splintering or the tree falling in the wrong direction. For example, the person holding your ladder may be able to watch the tree. You may be able to rent a hydraulic lift from a home improvement store."
    },
    {
      "title": "Trim the palm fronds with a pruning saw.",
      "content": "Trim the palm fronds with a pruning saw. Use the saw to cut through the palm fronds 1 at a time. Cut each frond as close to the tree’s trunk as possible. You can use a chainsaw, although fronds are often tough and will wear out several blades. Change your chainsaw blade when it no longer cuts through the branches cleanly. Let the cut branches drop to the ground. Make sure no one is standing under the tree while you work. If you cannot cut the fronds, you can cut the whole tree down at once. However, remember that the fronds make the tree heavier and can affect how it falls. The wind will effect the direction that the tree falls, especially if there are still fronds on the tree."
    },
    {
      "title": "Make",
      "content": "Make a notch cut at the tree’s base. Use a proper cutting technique to control the direction of the tree’s fall. Make a triangular cut on the side you want the tree to fall towards. To make the cut, use a chainsaw to slice diagonally down about 1/4 of the way through the tree, then pull the saw back out of the trunk. Make the cut at waist or chest-level to minimize the size of the stump left after felling the palm. If you aren’t comfortable felling the tree, you can use the chainsaw to cut the tree from the top. Cut off about 12 in (30 cm) at a time until only a stump remains."
    },
    {
      "title": "Cut through the tree from the other side.",
      "content": "Cut through the tree from the other side. Go around to the other side of the tree and use your chainsaw to cut straight through it. Saw through the tree until you reach the tip of the notch cut you made. Quickly move away from the tree when you hear cracking. The tree will most likely fall towards the notch cut. You may need to replace the chainsaw blade a few times to cut all the way through the tree."
    },
    {
      "title": "Use a stump grinder to remove the rest of the tree.",
      "content": "Use a stump grinder to remove the rest of the tree. Rent a power stump grinder to take out the remaining piece of the palm tree. You will need to cut down through the stump, removing it piece by piece. This can take a lot of effort, so be patient and whittle the stump down slowly. [13] X Research source You will need to dig around the stump to expose the part in the ground. To make the stump easier to remove, you can apply a potassium nitrate tree stump killer."
    }
  ]
}