{
  "url": "https://www.wikihow.com/Print-Vinyl-Stickers",
  "title": "How to Print Vinyl Stickers with an Inkjet or Laser Printer",
  "steps": [
    {
      "title": "Sketch your sticker design on paper.",
      "content": "Sketch your sticker design on paper. Before making your vinyl stickers, brainstorm what you want them to look like. What shape will the sticker be? Will it feature a scenic landscape, an inspirational word, or both? Doodle your ideas on a piece of paper to visualize what the finished product might look like. Make sure your design is small enough to fit on an 8 x 11 inch (20.3 x 27.9 cm) piece of paper. Look at other vinyl sticker designs online for inspiration by searching “vinyl stickers” or “vinyl sticker designs.” If you're having trouble coming up with a design, try using copyright-free graphics or images. Sites like Flickr , Pexels , and Canva have a range of designs you can choose from."
    },
    {
      "title": "Create your design on the computer.",
      "content": "Create your design on the computer. Softwares like Adobe Photoshop and Adobe Illustrator are excellent choices, but if you don’t have these softwares, free sites like GIMP or Canva work well too. Simply recreate your sketched design using the software’s drawing and editing tools, or scan and upload your sketch directly. Make sure the resolution of your design is at least 300 pixels per 1 inch (2.5 cm), so it prints clearly later. [1] X Research source"
    },
    {
      "title": "Paste your design on an 8 x 11 inch (20.3 x 27.9 cm) document.",
      "content": "Paste your design on an 8 x 11 inch (20.3 x 27.9 cm) document. Once you’ve finished your sticker design, save it to your computer as a .png file. Then, open a new document in your image editing software. Import your sticker design into the new document. If you want to make multiple stickers of the same design, paste the design multiple times and arrange the copies in rows. [2] X Research source If the software you're using doesn't let you specify the size when you open a new document, edit the size after you open the document. Look for the size button in your software's menu bar. Consider adding multiple designs to one document to print multiple sticker types at once. [3] X Research source Make sure none of your stickers are in the document's margins; otherwise, they’ll get cut off while printing."
    },
    {
      "title": "Print your stickers on 8 x 11 inch (20.3 x 27.9 cm) vinyl sticker paper.",
      "content": "Print your stickers on 8 x 11 inch (20.3 x 27.9 cm) vinyl sticker paper . Load the printable vinyl paper into the printer’s tray, so the print side (non-adhesive side) is face up. Set your printer to a high-quality print mode and hit the print button in your image editing software. [4] X Research source Use clear vinyl printer paper if you want the background of your stickers to be transparent. Try glossy vinyl printer paper to give your stickers some extra shine. Both inkjet and laser printers can print on vinyl paper—just make sure your vinyl paper is compatible with your printer type."
    },
    {
      "title": "Apply an over-laminate sheet to your printed sheet.",
      "content": "Apply an over-laminate sheet to your printed sheet. Peel back the backing only at the top of the over-laminate sheet. Line the top edge of the laminate with the top edge of the vinyl paper, and then use your fingers to press the laminate to the vinyl paper, so it sticks. [5] X Research source Laminating your stickers makes them water resistant and UV protected. If your over-laminate sheet isn’t the same size as your sticker sheet, it’s all good! Simply cut the over-laminate to size before pressing it onto the sticker sheet."
    },
    {
      "title": "Peel the rest of the over-laminate backing away slowly.",
      "content": "Peel the rest of the over-laminate backing away slowly. Place one hand on the sticker sheet and use the other to pull the rest of the laminate backing away. Keep pulling until you’ve peeled off all the backing and the whole sheet of stickers is laminated. [6] X Research source Use the edge of a ruler or credit card to press the laminate onto the vinyl paper to prevent air bubbles."
    },
    {
      "title": "Cut out your stickers with scissors or a Cricut machine.",
      "content": "Cut out your stickers with scissors or a Cricut machine . Now that your stickers are laminated, all that’s left to do is cut them out of the vinyl sheet. [7] X Expert Source Nicole Bolin Crafts & DIY Specialist Expert Interview. 9 September 2020. For larger, simpler designs, use a pair of sharp scissors to cut the stickers out by hand. For finer, more intricate designs, consider using a Cricut machine for an accurate and smooth cut. [8] X Research source If you don’t have a Cricut, no worries! Try cutting out lettering or smaller sticker designs by hand using a craft blade ."
    },
    {
      "title": "Peel off the backing of your stickers and stick them wherever!",
      "content": "Peel off the backing of your stickers and stick them wherever! Simply grab a corner of the vinyl backing and peel it away from the sticker design—just like a sticker you’d buy at the store. Apply your DIY vinyl sticker to a flat surface like a water bottle, mug, laptop, phone case, or notebook, and press it down. Now you can show your awesome design and crafty skills to the world! [9] X Expert Source Nicole Bolin Crafts & DIY Specialist Expert Interview. 9 September 2020. The vinyl backing is on the opposite side of the over-laminate (basically, the back of the sticker). Clean the area where you want to put your sticker before placing it to avoid air bubbles or peeling. Vinyl stickers stick to almost any hard, smooth surface indoors and outdoors, so get creative and stick them wherever you’d like!"
    }
  ]
}