{
  "url": "https://www.wikihow.com/Recognize-Someone-With-Antisocial-Personality-Disorder",
  "title": "How to Recognize Someone With Antisocial Personality Disorder",
  "steps": [
    {
      "title": "Know the requirements for a clinical diagnosis of antisocial personality disorder.",
      "content": "Know the requirements for a clinical diagnosis of antisocial personality disorder. In order to be diagnosed with ASPD, a person must exhibit at least three of the antisocial behaviors classified in the DSM (Diagnostic Statistical Manual). [2] X Research source American Psychiatric Association. (2013). Diagnostic and statistical manual of mental disorders: DSM-5. Washington, D.C: American Psychiatric Association The DSM is the official compilation of all mental illnesses and their symptoms, and is used by psychologists to determine a diagnosis. [3] X Research source"
    },
    {
      "title": "Check for a history of criminal activity or arrests.",
      "content": "Check for a history of criminal activity or arrests. Someone with antisocial personality disorder will have a history of repeatedly being arrested for crimes, major or petty. These crimes often begin in adolescence and continue on into adulthood. People with antisocial personality disorder also tend to have drug and alcohol abuse problems, meaning that they may be arrested for possession or use of drugs or have a DUI. You may want to run a background check yourself if the individual does not disclose his past history to you."
    },
    {
      "title": "Identify compulsive lying or conning behavior.",
      "content": "Identify compulsive lying or conning behavior. Sufferers of the disorder will show lifelong habits of compulsive lying, even about mundane or irrelevant things. As they grow older, this pattern of lying may turn into a form of con artistry, in which they manipulate others for their own gain using their lies. As a related symptom, they may develop aliases to hide behind, either for the purpose of conning people, or just as another form of lying."
    },
    {
      "title": "Watch out for a reckless disregard for safety.",
      "content": "Watch out for a reckless disregard for safety. People with antisocial personality disorder tend to disregard safety of both themselves and others altogether. They may either ignore a potentially dangerous situation or put themselves or someone else intentionally into danger. On a small scale, this might include driving at high speeds or starting fights with strangers, while on a more extreme scale it might mean physically injuring, torturing, or altogether neglecting another person."
    },
    {
      "title": "Identify impulsive behavior or a failure to plan ahead.",
      "content": "Identify impulsive behavior or a failure to plan ahead. It is common for a sufferer of the disorder to show a lack of planning ability, for either near-to-date or future plans. They may not sense a correlation between their current behaviors and long-term outcomes, such as how doing drugs now and going to jail might affect their future plans. They may do things quickly without judgment, or make rash decisions without thinking."
    },
    {
      "title": "Beware of repeated physical assaults on others.",
      "content": "Beware of repeated physical assaults on others. Physical assaults by individuals with ASPD can vary greatly, from a bar fight to kidnapping and torture. However, someone with antisocial personality disorder will have a background of physically abusing others, which they may or may not have been arrested for. If they had Conduct Disorder earlier in life, this pattern would extend into their childhood when they abused other children or possibly their own parents or caretakers."
    },
    {
      "title": "Watch for poor work and financial ethics.",
      "content": "Watch for poor work and financial ethics. Those with antisocial personality disorder traditionally have a hard time keeping jobs, have multiple complaints from their bosses or coworkers, and may have overdue bills and debt. In general, the sufferer will not be financially or work stable, and will spend his money unwisely."
    },
    {
      "title": "Look for a lack of empathy and rationalization of inflicted pain.",
      "content": "Look for a lack of empathy and rationalization of inflicted pain. This is often one of the most commonly associated symptoms of the disorder; someone who has ASPD will not be able to empathize with someone to whom he has caused pain. If he is arrested for a personal crime, he will rationalize his motive/actions and find little or no reason to be bothered or feel guilty for his behavior. He will have a hard time understanding someone who is upset as a result of his own behavior."
    },
    {
      "title": "Pick up on a pattern of disregard for and violation of the rights of others.",
      "content": "Pick up on a pattern of disregard for and violation of the rights of others. More severe than a lack of empathy, some people with ASPD will be completely indifferent to other people and will flagrantly cross personal boundaries without appearing to care. [4] X Research source"
    },
    {
      "title": "Avoid contact when possible.",
      "content": "Avoid contact when possible. Though it can be difficult to cut ties with a close friend or family member, you may need to give yourself some distance from a person suffering from antisocial personality disorder. This can be for your own emotional or even physical safety."
    },
    {
      "title": "Set appropriate boundaries.",
      "content": "Set appropriate boundaries. Maintaining a relationship with an individual suffering from antisocial personality disorder can be quite difficult. If you cannot avoid an individual with ASPD, you should set clear boundaries for what you consider to be acceptable interaction with the individual. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Due to the nature of the disease, those suffering from ASPD are likely to test and violate boundaries. It is important that you stand your ground and seek counseling or support groups to help you manage the situation. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Anticipate signs of potentially violent behavior.",
      "content": "Anticipate signs of potentially violent behavior. If you have a relationship with an individual with ASPD, particularly if the individual also practices substance abuse, [7] X Research source Moeller, F.G., &amp; Doughert, D.M. (2001). Antisocial personality disorder, alcohol, and aggression. Alcohol Research and Health, 25(1), pp. 5-11. you need to recognize the warning signs of violent behavior to protect yourself and others. No prediction can be 100% accurate, but Gerald Juhnke recommends watching out for warning signs with the acronym DANGERTOME: [8] X Research source Juhnke, G. (2010). The DANGERTOME personal risk threat assessment scale: An instrument to help aid immediate threat assessment for counselors, faculty, and teachers. Journal of Creativity in Mental Health, 5, p. 177-191. Delusions (or violent fantasies) Access to weapons Noted history of violence Gang involvement Expressions of intent to harm others Remorselessness about harm inflicted Troublesome abuse of alcohol or drugs Overt threats of harm to others Myopic focus on harming others Exclusion from others or increased isolation"
    },
    {
      "title": "Contact the police.",
      "content": "Contact the police. If you notice an escalation in threats or feel as though a threat of violence is imminent, contact your local police department. You may need to take steps to protect yourself or others."
    },
    {
      "title": "Seek a diagnosis from a qualified psychologist or psychiatrist.",
      "content": "Seek a diagnosis from a qualified psychologist or psychiatrist. Antisocial personality disorder can be difficult to spot, because there are so many possible symptoms and variations that can occur. As a result, it may seem like someone has the disorder when he does not meet all of the necessary symptomatic requirements. Only a qualified mental health professional can offer an official diagnosis. However, you can recognize signs of the disorder by looking for a combination of symptoms, occurring over a lifetime. [9] X Research source Antisocial personality disorder is similar in many ways to narcissistic personality disorder; someone may be diagnosed with symptoms of both. Individuals who suffer from antisocial personality disorder tend to display a lack of empathy; they also present manipulation and deceit. Reader Poll: We asked 504 wikiHow readers and 55% of them agreed that the best way to try to manage ASPD is by seeking an official diagnosis from medical professionals . [Take Poll]"
    },
    {
      "title": "Avoid offering an amateur diagnosis.",
      "content": "Avoid offering an amateur diagnosis. It is one thing to suspect someone has a personality disorder, but quite another to seek to \"diagnose\" the person unless you're a qualified psychiatrist or psychologist. If the person you're worried about is a family member or a friend, seek to get him supported through professional help.Treatment may include psychotherapy and rehabilitation. Antisocial behavior may not always be related to a disorder. Some people are just comfortable with living recklessly and form bad habits of living carelessly and irresponsibly. Be aware that people suffering from antisocial personality disorder rarely want treatment because they often do not believe that there is anything wrong with them. [10] X Research source You may have to be persistent to get the person help and try to keep him out of jail."
    },
    {
      "title": "Look for signs of antisocial personality disorder across a person’s lifetime.",
      "content": "Look for signs of antisocial personality disorder across a person’s lifetime. Antisocial personality disorder is caused by a unique combination of biological and social factors, which manifest over a person’s entire life. Someone with antisocial personality disorder will display symptoms from the time he is a child, but he cannot be clinically diagnosed until he turns at least 18. On the other hand, the symptoms of antisocial personality disorder tend to dissipate beyond the age of 40-50; they do not disappear entirely, but they often lessen either as a result of biological factors or social conditioning. [11] X Research source Glenn, A.L., Johnson, A.K., &amp; Raine, A. (2013). Antisocial personality disorder: A current review. Current Psychiatry, 15, pp. 427-435. DOI: 10.1007/s11920-013-0427-7 Personality spectrum disorders are thought to be genetic in part, and therefore may never go away altogether. [12] X Research source Glenn, A.L., Johnson, A.K., &amp; Raine, A. (2013). Antisocial personality disorder: A current review. Current Psychiatry, 15, pp. 427-435. DOI: 10.1007/s11920-013-0427-7"
    },
    {
      "title": "Watch for substance abuse along with ASPD.",
      "content": "Watch for substance abuse along with ASPD. People with this disorder frequently have an underlying substance abuse problem such as drug addiction or drug dependence. An epidemiological survey found that individuals with antisocial personality disorder were 21 times more likely than the general public to exhibit alcohol abuse and dependence. [13] X Research source Moeller, F.G., &amp; Doughert, D.M. (2001). Antisocial personality disorder, alcohol, and aggression. Alcohol Research and Health, 25(1), pp. 5-11. However, this may not always be the case. Individual cases are unique and ASPD does not necessitate alcohol or drug abuse."
    },
    {
      "title": "Understand that antisocial personality disorder is rare in women.",
      "content": "Understand that antisocial personality disorder is rare in women. Although scientists aren't exactly sure why, antisocial personality disorder manifests primarily in men. Research indicates that men make up three out of every four diagnosed cases of ASPD. [14] X Research source Alegria, A.A., Blanco, C., Petry, N.M., Skodol, A.E., Liu, S.M., Grant, B., &amp; Hasin, De. (2013). Sex differences in antisocial personality disorder: Results from the National Epidemiological Survey on Alcohol and Related Conditions. Personality Disorders: Theory, Research, and Treatment, 4(3), pp. 214-222. DOI: 10.1037/a0031681 ASPD may present differently in men and women. Whereas men are more likely to demonstrate recklessness and violence in the forms of traffic violations, animal cruelty, starting fights, using weapons, and starting fires, women are more likely to report having many sexual partners, running away, and gambling. [15] X Research source Robins, L.N., Tipp, J.E., &amp; Przybeck, T. (1991). Antisocial personality. in L.N. Robins &amp; Regier (Eds.), The epidemiologic catchment area study (pp. 258-290). New York, NY: The Free Press. [16] X Research source Mikulich-Gilbertson, S.K., Slomonsen-Sautel, S., Sakai, J.T., &amp; Booth, R.E. (2007). Gender similarities and differences in antisocial behavioral syndromes among injection drug users. The American Journal of Addictions, 16, 372-382. DOI: 10.1080/10550490701525558"
    },
    {
      "title": "Identify a history of abuse in those with ASPD.",
      "content": "Identify a history of abuse in those with ASPD. Because the illness is thought to be biological only in part, a serious risk factor for triggering it is extensive childhood abuse. People with antisocial personality disorder are typically abused physically and emotionally by someone close to them in their lives for many years. They may also have suffered extensive periods of neglect as children. The abusers are often parents who also have anti-social tendencies, which they pass along to their children."
    },
    {
      "title": "Recognize the relationship between conduct disorder and antisocial personality disorder.",
      "content": "Recognize the relationship between conduct disorder and antisocial personality disorder. Conduct disorder is the young-age counterpart of antisocial personality disorder; essentially, conduct disorder is antisocial personality disorder for children. It is indicated by bullying behavior, disregard for life (mistreating animals), anger and authority problems, inability to show/feel remorse, and general poor or criminal conduct. [17] X Research source These conduct problems often appear early and are developed by age 10. [18] X Research source Stickle, T. R., Kirkpatrick, N.M., &amp; Brush, L.N. (2009). Callous-unemotional traits and social information processing: Multiple risk-factor models for understanding aggressive behavior in antisocial youth. Law and Human Behavior, 33. pp. 515-529. DOI: 10.1007/s10979-008-9171-1 Most psychologists and psychiatrists consider conduct disorder to be a top predictor of a future diagnosis of antisocial personality disorder. [19] X Research source Corff, Y.L., &amp; Toupin, J. (2014). Overt versus covert conduct disorder symptoms and the prospective prediction of antisocial personality disorder. Journal of Personality Disorders, 28(6), pp. 864-872."
    },
    {
      "title": "Watch for characteristics of conduct disorder.",
      "content": "Watch for characteristics of conduct disorder. Conduct disorder involves behavior that intentionally inflicts harm on others, including aggression towards other children, adults, and animals. It is behavior that is repeated or developed over time, rather than isolated to a single event. [20] X Research source American Psychiatric Association. (2013). Diagnostic and statistical manual of mental disorders: DSM-5. Washington, D.C: American Psychiatric Association The following behaviors may indicate conduct disorder: [21] X Research source Stickle, T. R., Kirkpatrick, N.M., &amp; Brush, L.N. (2009). Callous-unemotional traits and social information processing: Multiple risk-factor models for understanding aggressive behavior in antisocial youth. Law and Human Behavior, 33. pp. 515-529. DOI: 10.1007/s10979-008-9171-1 Pyromania (obsession with fire) Prolonged bed wetting Animal cruelty Bullying Property destruction Theft"
    },
    {
      "title": "Realize the treatment limitations for conduct disorder.",
      "content": "Realize the treatment limitations for conduct disorder. Neither conduct disorder nor antisocial personality disorder are easily treated with psychotherapy. [22] X Research source Hatchett, G.T. (2015). Treatment guidelines for clients with antisocial personality disorder. Journal of Mental Health Counseling, 37(1), pp. 15-27. Treatment is complicated by the commonality of co-morbidity, which is the tendency of conduct disorder to coincide with other disorders such as substance abuse problems, mood disorders, or psychopathy. [23] X Research source Glenn, A.L., Johnson, A.K., &amp; Raine, A. (2013). Antisocial personality disorder: A current review. Current Psychiatry, 15, pp. 427-435. DOI: 10.1007/s11920-013-0427-7 This co-morbidity makes the treatment of these individuals increasingly complex, necessitating the involvement of psychotherapy, medication, and other approaches. [24] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The effectiveness of even a multifaceted approach may vary based on the severity of the individual case. More severe cases are less likely than milder cases to respond successfully to treatment. [25] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Differentiate between conduct disorder and oppositional defiance disorder (ODD).",
      "content": "Differentiate between conduct disorder and oppositional defiance disorder (ODD). Children suffering from ODD challenge authority, but they feel responsible for the consequences of their actions. [26] X Research source American Psychiatric Association. (2013). Diagnostic and statistical manual of mental disorders: DSM-5. Washington, D.C: American Psychiatric Association They often challenge adults, break rules, and blame others for their problems. ODD can be treated successfully with psychotherapy and medication. This treatment often includes involving parents in family cognitive behavioral therapy and giving the child social skills training. [27] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Do not assume that conduct disorder will always lead to antisocial personality disorder.",
      "content": "Do not assume that conduct disorder will always lead to antisocial personality disorder. It is possible for conduct disorder to be treated before it develops into ASPD, particularly if the symptoms of conduct disorder are mild. [28] X Research source Corff, Y.L., &amp; Toupin, J. (2014). Overt versus covert conduct disorder symptoms and the prospective prediction of antisocial personality disorder. Journal of Personality Disorders, 28(6), pp. 864-872. The more severe the symptoms of conduct disorder are in a child, the more likely the child is to develop antisocial personality disorder as an adult."
    }
  ]
}