{
  "url": "https://www.wikihow.com/Midnight-Blade-Blox-Fruits",
  "title": "Your Complete Guide to the Midnight Blade in Blox Fruits",
  "steps": [
    {
      "title": "The Midnight Blade is a Legendary sword.",
      "content": "The Midnight Blade is a Legendary sword. You can get it by giving 100 Ectoplasm to El Admin, who is found in a bedroom on the Cursed Ship. [1] X Research source The Cursed Ship is found near the Graveyard in the Second Sea. Ectoplasm is dropped by various enemies on the Cursed Ship or in the Haunted Shipwreck sea event in the Third Sea: Ship Deckhand (Cursed Ship): 1 Ectoplasm Ship Engineer (Cursed Ship): 1 Ectoplasm Ship Steward (Cursed Ship): 1 Ectoplasm Ship Officer (Cursed Ship): 1 Ectoplasm Ghost Shark (Haunted Shipwreck): 4-5 Ectoplasm Haunted Crew Member (Haunted Shipwreck): 4-5 Ectoplasm Cursed Captain (Cursed Ship): 10 Ectoplasm (guaranteed)"
    },
    {
      "title": "The Midnight Blade works well with the Buddha Fruit.",
      "content": "The Midnight Blade works well with the Buddha Fruit. It's pretty easy to get if you're over level 1250. Because it works well for close-range combat, can stun, and has good mobility, it has great synergy with the Buddha Fruit ."
    },
    {
      "title": "Upgrading the Midnight Blade gives it +13% damage.",
      "content": "Upgrading the Midnight Blade gives it +13% damage. To upgrade the Midnight Blade, bring 40 Ectoplasm and 15 Scrap Metal to the Blacksmith. The Blacksmith can be found in the Pirate Village (First Sea), Kingdom of Rose (Second Sea), and Port Town (Third Sea)."
    },
    {
      "title": "Portal Opening (Z)",
      "content": "Portal Opening ( Z ) Mastery: 150 Mastery Damage: 5162 Cooldown: About 9 seconds Description: You shoot a mirror image of yourself towards the cursor. Both you and the mirror image slash forward. If the slash hits, you'll create a small quantum explosion that pulls in enemies and damages them for the duration of the AoE. A direct hit will break instinct."
    },
    {
      "title": "(X)",
      "content": "( X ) Mastery: 325 Mastery Damage: 5346 Cooldown: About 13.5 seconds Description: You dash forward, leaving a blue trail in your wake. If you hit an enemy, all nearby enemies will be pulled in before you spin, which triggers an AoE explosion that pushes the enemies away. Both a direct hit and the slash break instinct."
    },
    {
      "title": "Pros",
      "content": "Pros Not too difficult to get Does a lot of damage Has great combo potential Both moves break instinct Both moves can hit the Sea Beast"
    },
    {
      "title": "Cons",
      "content": "Cons Does not hit Blade Fruit users Has small hitboxes in general Not good for ranged combat Portal Opening can only be used if there's an enemy nearby Crescent Dash is slow and is dodged easily"
    }
  ]
}