{
  "url": "https://www.wikihow.com/Make-a-Windshield-Rainbow-Prank",
  "title": "How to Make a Windshield Rainbow Prank",
  "steps": [
    {
      "title": "Find a friend who will appreciate the joke and/or love seeing a rainbow appear on their windshield.",
      "content": "Find a friend who will appreciate the joke and/or love seeing a rainbow appear on their windshield. Don’t try this prank on a someone who is likely to totally lose it and never do it to someone who is learning to drive or uncertain about driving. Choose that good buddy who will totally enjoy the prank. Consider creating the rainbow to cheer up a friend or someone who has been sad or depressed. It might be a fun, sunny way to let that person know that everything will be okay."
    },
    {
      "title": "Choose a suitable day to create the rainbow.",
      "content": "Choose a suitable day to create the rainbow. It's probably best to do this on a day when you know it might rain (so that the windshield wipers will be necessary). However, avoid days where the rain is bucketing down; it's a fine balancing act to get a day with light rain!"
    },
    {
      "title": "Choose a time when you can apply color to the windshield without your friend knowing what you're doing.",
      "content": "Choose a time when you can apply color to the windshield without your friend knowing what you're doing. Distract them somehow until you're ready. Don’t allow for too much time to pass between when you apply the color and when you want the rainbow to appear, as the paint may dry over time."
    },
    {
      "title": "Squeeze a line of color directly on top of the windshield wiper, on the windshield.",
      "content": "Squeeze a line of color directly on top of the windshield wiper, on the windshield. Place first color toward the end of the wiper blade (toward the outside) and then work your way toward the middle. Create a 1” to 2” (2.5-5cm) line with each color. You want enough color to create the rainbow, but without being overly suspicious or within the driver’s sight line. For the sake of safety, only add the colors to the passenger side window, so that the driver can still see."
    },
    {
      "title": "Add the next color directly next to the previous color.",
      "content": "Add the next color directly next to the previous color. You want the rainbow colors to blend once the windshield wiper has been activated, so the colors should be placed close together."
    },
    {
      "title": "Plan to be in the car.",
      "content": "Plan to be in the car. That way you can see the driver/your friend’s reaction immediately (which presumably, is the whole point). Alternatively, you could hide so your intended driver/target has no idea you are the one who placed the color on the windshield. But where's the fun in that?!"
    },
    {
      "title": "Wait for your friend to start the car.",
      "content": "Wait for your friend to start the car. Get ready!"
    },
    {
      "title": "Rainbow time!",
      "content": "Rainbow time!"
    },
    {
      "title": "Be ready to spring into action if the driver becomes angry or upset.",
      "content": "Be ready to spring into action if the driver becomes angry or upset. Be available right away to tell your friend the paint is washable and then offer to remove it if they don't see the humor in the prank."
    }
  ]
}