{
  "url": "https://www.wikihow.com/Prevent-Eye-Bags",
  "title": "How to Prevent Eye Bags",
  "steps": [
    {
      "title": "Apply a cool compress when you wake up.",
      "content": "Apply a cool compress when you wake up. Take a clean washcloth, and dampen it with cool water. Wring out the excess water. Drape it over your eyes and press down gently. Hold this position for a few minutes. This can prevent or reduce eye bags that might appear in the morning. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Use light pressure when touching your eyes.",
      "content": "Use light pressure when touching your eyes. Eye bags can form if you treat your eyes too roughly. Avoid rubbing, tugging, or pulling the skin around your eyes. Instead, use your ring finger to gently pat in creams and moisturizers. [2] X Research source"
    },
    {
      "title": "Remove your makeup before you go to bed.",
      "content": "Remove your makeup before you go to bed. If you leave makeup on while you sleep, it can cause the area to swell. To remove makeup safely, apply eye makeup remover to a cotton pad or ball. Press it gently against your eyes for a minute to dissolve the makeup. Sweep up the eyelashes with the pad to remove mascara. [3] X Research source When you are done, rinse the area with water and wash your face with your normal cleanser. This will ensure that all of the makeup is gone."
    },
    {
      "title": "Apply a daily eye cream to your eyes.",
      "content": "Apply a daily eye cream to your eyes. Creams will moisturize the skin around your eyes to prevent wrinkles and bags. Some may be able to thicken the skin to reduce dark circles as well. Use the cream twice a day: once when you wake up and once before you go to bed. To apply the cream, use a finger to dot it into the ridge at the top of your cheekbone. [4] X Research source Creams with retinoids can thicken the skin around your eyes. This can reduce darkness under the eyes and prevent eye bags from forming. Creams with vitamin C, kojic acid, caffeine, and licorice extract may be able to reduce darkness and soothe irritation around the eyes, helping you avoid puffiness. [5] X Expert Source Christin Birckhead Makeup Artist Expert Interview. 14 April 2020. If a cream causes your eyes to water, itch, or turn red, wash it off immediately. Do not use the cream again."
    },
    {
      "title": "Wear a non-irritating sunscreen under your eyes.",
      "content": "Wear a non-irritating sunscreen under your eyes. The sun can damage the area around your eyes. To stop this damage, wear sunscreen underneath your eyes every day. Apply sunscreen 15 minutes before you go out. Carefully tap the sunscreen around your eyes using your ring finger. Avoid getting it in your eye. [6] X Research source Some eye creams will contain SPF protection. Look for one with an SPF of at least 15. Wearing large sunglasses with UV protection can also help protect your eyes from sun damage. Wear large brimmed hats when you go out in the sun to help protect your eyes."
    },
    {
      "title": "Drink a glass of water before you go to bed.",
      "content": "Drink a glass of water before you go to bed. Drinking water can actually prevent fluid building up around your eyes. [7] X Expert Source Christin Birckhead Makeup Artist Expert Interview. 14 April 2020. One 8 ounce (230 g) glass before bed could help stop bags from appearing in the morning when you wake up. [8] X Research source"
    },
    {
      "title": "Sleep for 7-8 hours a night with your head raised.",
      "content": "Sleep for 7-8 hours a night with your head raised. [9] X Expert Source Christin Birckhead Makeup Artist Expert Interview. 14 April 2020. Puffy eyes often appear when you haven’t gotten enough sleep. To reduce eye bags as you rest, sleep on your back with your head propped up on a pillow. Keep your head elevated all night. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Eat a low-sodium diet.",
      "content": "Eat a low-sodium diet. Salt can cause your body to hold more water. This, in turn, can cause swelling or puffiness around your eyes. Reducing salt in your diet may be able to stop eye bags before they even start. [11] X Research source Cook your own food instead of eating out or buying prepared dishes. This will allow you to control exactly how much salt you add to your food. If you do order out, avoid adding extra salt to the dish. Avoid fried food, prepackaged snacks, canned soups, sauces, and processed meats like ham or bacon. These are all usually high in sodium. Look for low-sodium options when shopping, such as unsalted pretzels, low sodium soups, or sodium-free salad dressings."
    },
    {
      "title": "Stop smoking.",
      "content": "Stop smoking. Smoke from cigarettes can irritate your eyes and cause swelling. If you smoke, now is the best time to quit. In addition to preventing eye bags, you’ll also improve your general health and reduce your risk of developing wrinkles. [12] X Research source Talk to your doctor if you want to quit smoking. They may be able to give you a prescription to reduce cravings or help you create a plan to quit."
    },
    {
      "title": "Reduce how much alcohol you drink.",
      "content": "Reduce how much alcohol you drink. An occasional drink or night out won’t hurt your skin in the long run, but too much drinking can cause dehydration. Dehydration can increase swelling and puffiness around the eyes. Aim to drink no more than 1 drink a day on average. [13] X Research source If you have a few drinks, drink plenty of water the next day to counteract the effects. Mixed drinks might also contain salt, which can make your eyes look puffy."
    },
    {
      "title": "Exercise regularly.",
      "content": "Exercise regularly. Exercising can reduce swelling in your body and improve circulation, which will make your eyes look less puffy. If you’re not able to exercise regularly, try doing some yoga instead."
    },
    {
      "title": "Talk to your doctor if you suffer from seasonal allergies.",
      "content": "Talk to your doctor if you suffer from seasonal allergies. An antihistamine or another allergy medication may be able to reduce your eye bags as well as any other unpleasant symptoms you may get from allergies. If possible, go to your doctor before allergy season starts to prevent bags from forming. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Visit a dermatologist to get tear trough fillers.",
      "content": "Visit a dermatologist to get tear trough fillers. Fillers can prevent eye bags from appearing for roughly 9 months. They work by filling the empty socket (known as a tear trough) under your eyes. Your dermatologist may be able to recommend a treatment based on your needs. [15] X Research source Juvederm and Restylane are the most common fillers used under the eyes. Talk to your dermatologist to determine which is best for you. The cost of one injection can be between $800-1000 USD. [16] X Research source"
    },
    {
      "title": "Undergo eyelid surgery (blepharoplasty) to remove eye bags.",
      "content": "Undergo eyelid surgery (blepharoplasty) to remove eye bags. If you want to prevent eye bags from worsening, eyelid surgery may be an option for you. During this surgery, a plastic surgeon will make a cut under your eyes. They will remove excess fat from the area or tighten your muscles to make the skin appear firm and smooth. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Ask your doctor for a referral to a qualified, certified surgeon. You can also find one by using the American Society of Plastic Surgeon's online database here: https://find.plasticsurgery.org/ . It may take 10-14 days to recover from this surgery. The average cost of this surgery is around $3,000 USD. [18] X Research source"
    },
    {
      "title": "Try home remedies if you can’t afford medical treatments.",
      "content": "Try home remedies if you can’t afford medical treatments. Some home remedies can temporarily reduce the appearance of eye bags. Lay down somewhere comfortable and rest chilled spoons, slices of cucumbers, or tea bags on your eyes to reduce puffiness. You can also drink chicken bone broth to increase the collagen levels in your body, which will help prevent eye bags."
    }
  ]
}