{
  "url": "https://www.wikihow.com/Rate-Movies-on-Amazon-Prime",
  "title": "How to Rate Movies on Amazon Prime",
  "steps": [
    {
      "title": "Log into your Amazon Prime account.",
      "content": "Log into your Amazon Prime account. Log in and hover the cursor over the section that says “Hello, “your name.” This will bring up a menu. Select “Your Prime Video.”"
    },
    {
      "title": "Select the movie you want to rate.",
      "content": "Select the movie you want to rate. The website will change to Prime Video. This should bring up titles of movies and series. If you see the title of the movie you want to rate, click on it. If not, type the name of the movie into the search bar. [1] X Research source"
    },
    {
      "title": "Click on the show or series that you want to review.",
      "content": "Click on the show or series that you want to review. Click on “Write Your Review.” This will allow you to give the movie a star rating or write out a review. You will also be able to see ratings others have already given the movie."
    },
    {
      "title": "Log into your Amazon Prime account.",
      "content": "Log into your Amazon Prime account. Provide your user information to log in. Once you’ve done that, hover over the part that says “Hello” and your name on the Amazon menu. One of the options should be “Improve Your Recommendations.” [2] X Research source"
    },
    {
      "title": "Select the “Improve Your Recommendations” options.",
      "content": "Select the “Improve Your Recommendations” options. This will bring you to a page that shows recommendations for various items. Look at the navigation menu and click on “Videos You’ve Watched.” [3] X Research source"
    },
    {
      "title": "Rate the videos you’ve watched.",
      "content": "Rate the videos you’ve watched. You can now give a star rating to the videos you’ve watched. This rating will not be shared with other customers. It will only improve your future video recommendations. [4] X Research source"
    },
    {
      "title": "Sign into IMDb with your Amazon account.",
      "content": "Sign into IMDb with your Amazon account. Amazon Prime also takes their ratings from IMDb ratings. When you go onto the IMDb webpage, you will be given an option to sign in through your Amazon account. Select this option and sign in. [5] X Research source"
    },
    {
      "title": "Select the movie you want to rate.",
      "content": "Select the movie you want to rate. Movies will be displayed under categories, but you can also search for a specific movie. Type in the movie you want to rate. Click on the title when it appears. [6] X Research source"
    },
    {
      "title": "Click on the “rate this” option to select a star rating.",
      "content": "Click on the “rate this” option to select a star rating. The “rate this” option will be shown above a star. Click on “rate this” and give the title as many stars as you’d like. You can rate the movie between one and ten stars. [7] X Research source"
    }
  ]
}