{
  "url": "https://www.wikihow.com/Measure-Height-Without-a-Measuring-Tape",
  "title": "6 Ways to Measure Height Without a Tape Measure",
  "steps": [
    {
      "title": "Stand with your back against the wall on non-carpeted flooring.",
      "content": "Stand with your back against the wall on non-carpeted flooring. Place your feet together and flat on the floor. Your heels should also be flush against the wall while you hold your back straight—slouching can affect the accuracy of your measurement. It’s easiest to have another person measure your height, but you can also do this alone. [1] X Research source Do not stand on a carpet or a rug, which will sink a bit when you stand on it and may affect your measurement. Also avoid walls with molding or radiators along the bottom, which will make it impossible for you to stand fully flush against the wall. Remove your shoes, thick socks, and any hair accessories that might get in the way. If you have a tall hairstyle like a ponytail or bun, undo it."
    },
    {
      "title": "Position a book atop your head at a right angle with the wall.",
      "content": "Position a book atop your head at a right angle with the wall. You can also use another common household item that is flat and firm—for example, a cutting board or a cardboard box—as the measuring object. Regardless of what item you’re using to measure, place it firmly in contact with the crown of your head. Make sure it’s at a right angle with the wall. If you have a partner, have them hold the object. If you are measuring alone, it may be easier to use a light aerosol can such as a shaving cream can or air freshener. Press the bottom flat against the wall, which will ensure a right angle. [2] X Research source"
    },
    {
      "title": "Mark where the bottom of the object meets the wall with a pencil.",
      "content": "Mark where the bottom of the object meets the wall with a pencil. If you have a partner, they should do this while you’re still standing against the wall. If you’re alone, hold the headpiece in place while you turn and mark the location. [3] X Research source Use a pencil so you can erase the mark from the wall when you’re done."
    },
    {
      "title": "Measure the distance from the floor to the mark using a ruler.",
      "content": "Measure the distance from the floor to the mark using a ruler . Place one end of the ruler flat on the floor and position it so it's pressed vertically against the wall. Mark the top end of the ruler with a pencil. Then, move the ruler up so the bottom aligns with that pencil mark and mark the new top edge. [4] X Research source Repeat this process until you’ve reached the mark for your height. It may be easiest to keep track of each individual measurement on a separate sheet of paper so you can easily add them all together at the end. This is the simplest and most accurate way to measure your height without a measuring tape."
    },
    {
      "title": "Print out a ruler for an accurate makeshift measuring tool.",
      "content": "Print out a ruler for an accurate makeshift measuring tool. There are a number of 12 in (30 cm) ruler templates that you can download online and print. Use the printed ruler just like a wooden or plastic ruler to measure the distance from the floor to your marked height. Other than an actual ruler, this will provide the most accurate measurement of your height."
    },
    {
      "title": "Use your phone to measure your height.",
      "content": "Use your phone to measure your height. Download a ruler app to your phone like NixGame’s Ruler . Place your phone upright against the wall, starting from the floor. Toggle the tape measure feature and slowly move your phone straight upward, stopping at the mark. Check your measurement on your screen. Be sure to hold your phone flat against the wall and align the ‘0’ with the floor. If the app you’re using doesn’t have a tape measure feature where the ruler adjusts itself as you move your device, use the method described in the ruler step above. Mark the top of the ruler on your screen, move the device up, mark again, and so on to get your height. On iPhone Pro or Pro Max models from 12 to 16, use the Measure app to approximate someone’s height with your phone camera. [5] X Research source"
    },
    {
      "title": "Use an American dollar bill to measure the distance to the mark.",
      "content": "Use an American dollar bill to measure the distance to the mark. A dollar bill in the United States is 6.14 inches (15.6 cm) long and 2.61 inches (6.6 cm) tall. Press the bill flat against the wall and slide it down so one short edge of the bill is flat against the floor. Mark the top edge of the bill on the wall with a pencil. Move the bill up so the bottom edge is now flush with your original mark, then mark the new height. [6] X Research source Continue until you’ve reached the mark you made recording your height. You may need to use the height of the bill—2.61 inches (6.6 cm)—to measure the final few inches of your height. You can also fold the dollar bill in half to measure approximately 3 inches (7.6 cm), or in quarters for 1.5 inches (3.8 cm)."
    },
    {
      "title": "Create a makeshift measuring tool with a piece of printer paper.",
      "content": "Create a makeshift measuring tool with a piece of printer paper. A standard sheet of letter paper is 8.5 inches (22 cm) wide and 11 inches (28 cm) long. Use this sheet of paper to measure the distance between the ground and the mark you made by the crown of your head. Fold the paper in half or in quarters to create more precise measurements, which you can mark with a pencil to create a makeshift ruler. [7] X Research source Make sure you’re using a standard sheet of printer paper. Other sizes of paper have different dimensions."
    },
    {
      "title": "Translate your shoe size into inches or centimeters.",
      "content": "Translate your shoe size into inches or centimeters. If you know your shoe size, you can roughly translate that number into a measurement. Look up a sizing chart online to estimate the length of your foot based on your shoe size. Then, place your foot on a sheet of paper and mark the distance. Use this to measure the wall between the floor and your marked height. [8] X Research source For example, with European shoe sizing, size 35 is roughly 9 inches (23 cm) and 40 is 10 inches (25 cm). You could also cut a piece of string the size of your foot, then use the string to measure the distance from floor to marking."
    },
    {
      "title": "Multiply your height in inches by 2.54 to convert to centimeters.",
      "content": "Multiply your height in inches by 2.54 to convert to centimeters. First, convert your height from feet and inches to just inches (1 foot equals 12 inches). Then, multiply your height in inches by 2.54 to convert it to centimeters (since 1 inch equals 2.54 centimeters). To convert back from centimeters to inches, divide your height in centimeters by 2.54. Example: If your height is five feet and eight inches, multiply five by 12 to get 60 inches. Add the eight inches to get 68 inches. To convert your height to centimeters, multiply 68 by 2.54. Your height is 172.72 centimeters. Reverse example: Say your height is 172.72 centimeters. Divide 172.72 by 2.54. The result is 68 inches. To convert this answer into feet and inches, divide 68 by 12 and leave the remainder as additional inches. Your height is five feet and eight inches."
    },
    {
      "title": "Refer to a conversion chart.",
      "content": "Refer to a conversion chart. For a quick conversion without the math, search online for a height conversion chart or tool that converts from Imperial to Metric. You can choose to convert from feet and inches to centimeters, feet and inches to meters, or from inches to centimeters or meters."
    }
  ]
}