{
  "url": "https://www.wikihow.com/Play-Bean-Bag-Toss",
  "title": "How to Play Bean Bag Toss",
  "steps": [
    {
      "title": "Buy or make a cornhole set.",
      "content": "Buy or make a cornhole set. Many sporting goods stores and big-box stores sell manufactured cornhole sets of varying degrees of quality. Buying a set is the simpler route, but potentially more costly. If you don’t want to buy a set, build a cornhole game yourself and customize it any way you wish. If you want to throw together a quick game, cut two 2ftx4ft (.6mx1.2m) pieces of cardboard for makeshift boards. Cut a hole near one end of each board that is six inches (15 cm) in diameter. Prop the boards up so the hole end is six or eight inches (20 cm) off of the ground."
    },
    {
      "title": "Set the boards between 27 feet (8.2 m) and 45 feet (13.7 m) apart.",
      "content": "Set the boards between 27 feet (8.2 m) and 45 feet (13.7 m) apart. Choose the distance depending on the skill level and preference of those playing the game. Set the boards in a straight line with each other. [1] X Research source Regulation rules state that boards should be 45 feet apart, but casual players may opt for closer to 30 feet (9 m) apart. For younger players, set the boards 10-15 feet apart."
    },
    {
      "title": "Choose to play singles or doubles.",
      "content": "Choose to play singles or doubles. Cornhole is played with either two players or four players. For a singles game, players stand at the same board and throw to the opposite board. For a doubles game, one player from each team stands at each board and they throw back and forth. [2] X Research source Designate a bean bag color for each team. For singles, each player should have four bags of the same color. For doubles, each team should have four bags of the same color."
    },
    {
      "title": "Throw the bags at the opposite board, aiming for the hole.",
      "content": "Throw the bags at the opposite board, aiming for the hole. Choose one player to start the first round and alternate so that each player on that side throws one bag at a time. Players must stay behind the front of the board or the throw does not count. Once all eight bags have been thrown, count up the score for that round. Bags that hit the ground before they hit the board do not count. If the bag is hanging on the edge of the board and touching the ground, it doesn’t count. Players aim to get bags in the hole, but they also get points for bags that land on the board."
    },
    {
      "title": "Score the round.",
      "content": "Score the round. For every bag that a player gets on the board, they get one point. For every bag that a player gets in the hole, they get three points. Add up each team’s total and subtract the lower number from the higher number. The player with the higher score gets the points that remain after the lower player’s score is subtracted. For example, one team uses blue bags and one team uses red bags. The blue team gets two bags on the board and two bags in the hole for a total of eight points. The red team gets one on the board and one in the hole for a total of four points. Subtract four (red team) from eight (blue team) and the blue team scores four points that round."
    },
    {
      "title": "End the game when someone ends a round with exactly 21 points.",
      "content": "End the game when someone ends a round with exactly 21 points. Continue to add each round’s score to each team or player’s total. The game ends when someone has 21 points at the end of a round. If a round ends and a player or team has over 21 points, they must go back to 11 and the game continues. [3] X Research source Players who know their opponent is over 21 often throw their bags away from the board on purpose to make their opponent bust."
    },
    {
      "title": "Set up a ladder for a bean bag toss.",
      "content": "Set up a ladder for a bean bag toss. Set up a ladder in the backyard and write 10, 20, 30, 40, and 50 on sheets of paper. Tape one piece to each step of the ladder. Have kids toss bean bags between the steps of the ladder. Keep track of the points they score as they play. [4] X Research source Have bonuses for getting a bean bag to land on one of the steps. This works great for one kid, who can try to beat their own score each time, or let multiple kids play to see who gets the highest score. Make more or less point cards depending on how many steps the ladder has."
    },
    {
      "title": "Use bean bags to play tic-tac-toe.",
      "content": "Use bean bags to play tic-tac-toe. Make a tic-tac-toe grid on the ground with chalk, tape, or pieces of rope. With two different colors of bean bags, allow players to toss their bags into spaces on the grid. Each player tries to get three in a row to win the game. Make a line a few feet from the grid that players have to stand behind to add a challenge to the game."
    },
    {
      "title": "Play bean bag basketball using a bucket.",
      "content": "Play bean bag basketball using a bucket. Get a bucket and set it on the ground. Have the child stand five to ten feet from the bucket and attempt to throw the bean bag into the bucket. Use three or four bean bags to see how many they can make in the bucket. Let multiple children takes turn and see who gets the most bags in the bucket. [5] X Research source This game allows for many variations such as using their non-dominant hand, closing one eye, throwing it over their head at the bucket behind them, or simply standing at farther distances. If you don’t have a bucket, use a box or any other container that some bean bags will fit in."
    },
    {
      "title": "Practice reading with a flashcard bean bag toss game.",
      "content": "Practice reading with a flashcard bean bag toss game. Take a set of flashcards with colors, numbers, or other vocabulary words and lay them out on the ground. Have kids throw a bean bag and try to land it on one of the cards. If the bag lands on a card, have them pick it up and read the word on it. [6] X Research source This is a fun way to practice reading skills and also get them active. This game can be modified by changing the cards to fit any type of learning you need. Make flashcards with math problems on them or pictures to work on recognition."
    }
  ]
}