{
  "url": "https://www.wikihow.com/Ride-a-Motorcycle-(Beginners)",
  "title": "How to Ride a Motorcycle for Beginners",
  "steps": [
    {
      "title": "Get a helmet.",
      "content": "Get a helmet. Your motorcycle helmet is the single most important piece of equipment for motorcycling riding. It protects your head from injury in the event that your motorcycle goes down. For it to do its job, the helmet must fit well, while maintaining your field of vision. The best helmet for you is an individual thing. [1] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source To get the desired protection, get a helmet designed for motorcycle riders that meet established safety standards. It does not need to be the most expensive helmet to do the job of protecting your head. A motorcycle helmet that meets the DOT (U.S. Department of Transportation) or ECE (Economic Commission for Europe) standard is designed to do the job of protecting your head in an accident. These two standards are rigorously tested for the required safety standards to ride on public roads. Additional safety features add to your protection and comfort. Some riders prefer the Snell brand of helmets because they meet higher safety requirements (as set by the not-for-profit Snell Memorial Foundation), including performing at higher speeds and on harsher surfaces. To find the right size, get a professional fitting at a store that specializes in motorcycle equipment. Alternatively, you can measure yourself by using a soft measuring tape to measure around your head about 0.5 inches (13 mm) above your eyebrows. Compare your head measurement to the measuring table of the brand that you wish to buy. Note that each brand differs in its sizing, so consult the sizing table of each brand that you are considering. To find the right fit, try on the helmet. The correct fit puts the eye port just above your eyebrows with a very tight fit of your finger between your head and the helmet. Your helmet needs to have a snug fit to protect your head properly. Different helmets fit different head shapes. If your helmet is the right size but uncomfortable in the fit, consider a different one. For the most comprehensive protection, look at full-face or modular helmets."
    },
    {
      "title": "Get a jacket.",
      "content": "Get a jacket. A motorcycle jacket protects your torso, including your internal organs, in an accident. Motorcycle jackets are made of leather or manufactured materials, such as Kevlar. Look for a jacket that has impact-absorbing body armor. If the jacket carries a CE (Certified European) mark, it has met certification standards for sale in Europe. The best fit of a motorcycle jacket is snug through the torso with free motion in your arms. Consider the environmental conditions in which you will use this jacket for riding, so the weight and features meet your needs. For example, warmer weather jackets have more zippers and vents to allow for adjustment of airflow around the body. If you opt for a leather jacket, make sure it’s motorcycle specific. Regular leather jackets aren’t built to protect you. Besides protection, jackets also provide protection from environmental conditions, such as sun, wind, precipitation, and cold temperatures. Staying comfortable keeps you alert and makes the ride more enjoyable."
    },
    {
      "title": "Get motorcycle boots, gloves, and other gear.",
      "content": "Get motorcycle boots, gloves, and other gear. Both pieces of equipment provide greater safety and comfort while riding. Boots provide protection to your feet and ankles. Gloves provide protection to your hands. Pants provide protection to your hips and legs. Your feet can take a lot of abuse while riding, so protect them. Proper motorcycle boots cover your ankles and have non-slip soles with an integrated metal toe. Use the grab the toe and heel and twist test to see how your boot selection might perform in a crash. The less easily it twists the more protection that the boot provides you in an accident. The purpose of gloves is to reduce injury from being hit by insects and flying debris, as well as keep your fingers warm. Get ones that allow for maximum dexterity. Look for ones with a retention strap around the wrist. This strap is designed to keep the gloves on your hands in a crash. Kevlar gloves will keep your fingers mobile while being strong and absorbing. Pants are often overlooked. Jeans are designed more for style than function; thus, they often shred in accidents. A better choice is pants made from the same materials as your jacket. They are designed to take on the destructive forces of an accident."
    },
    {
      "title": "Take a motorcycle safety course.",
      "content": "Take a motorcycle safety course. A course gives you the best instruction to learn proper riding techniques and safety. It is highly recommended as a starting point for all new riders. It is only a requirement for your license in some states, so whether this is a requirement for you depends on where you reside. New riders with little or no experience can take a basic rider course. Check your local government's department of motor vehicles and transportation to see if courses are available in your area. Basic rider courses offered by your local government may not always be available in your area. However, there are usually non-government-run courses available. [2] X Research source A training course may provide you with a motorcycle to use if you don’t have one. The course will also teach you the basics of operation and safety. Many courses consist of both a classroom and riding portion, ending with you taking a test to receive your license."
    },
    {
      "title": "Learn the controls.",
      "content": "Learn the controls. Familiarize yourself with the basic controls before riding. When you’re actually riding you will have to think quickly, if you’re not familiar with the operations it could be dangerous. The hand clutch lever is typically located on the left handlebar and is used to disengage the power from the rear wheel when shifting gears. The gear shifter is typically located by your left foot and is used to shift one gear up or down while you’re pulling the clutch lever. The throttle is on the right handlebar and used to accelerate. The handbrake, which applies the brakes to the front wheel, is the lever on the right handlebar. The lever on the right side of the bike near your foot works the rear brake. As a rule, the left side of your motorcycle controls gears, while the right side controls acceleration and braking."
    },
    {
      "title": "Get on the bike.",
      "content": "Get on the bike. To properly get on your bike, face the motorcycle from the left side. Grab the left handlebar, and swing your right leg over the seat. Plant your feet firmly on the ground. The best way to get to know how a bike operates is to sit on it and go over the functions of the controls before starting it up. Get a feel for how you fit on the motorcycle. Grip the handlebars, clutch lever, and brake lever. Make sure you can reach these controls comfortably. Your arms should have a slight bend in the elbow when gripping the handlebars. Switches should be within easy reach of your fingers. Make sure you can easily plant your feet on the ground. Get a feel for the weight of the bike underneath you. Additionally, you should be able to operate the rear shifter without lifting or sliding your foot off the peg. [3] X Research source"
    },
    {
      "title": "Practice getting a feel for the clutch.",
      "content": "Practice getting a feel for the clutch. The clutch is used to change gears. When you pull the clutch in, you’re releasing the engine from the transmission. This action puts your bike in neutral, allowing you to shift gears. [4] X Trustworthy Source State of Massachusetts Official website for the State of Massachusetts Go to source Think of your clutch as a dimmer switch when using it. Unlike an “On-Off” switch, you want to gradually and smoothly pull and release the clutch to prevent your bike from stalling. When starting, pull in the clutch lever and put the bike into 1st gear by pushing down on the gear shifter with your left foot. You may have to push down several times. You'll know you're in 1st when you don’t feel any more resistance or indication the gears are moving. Most motorcycles operate in a “1 down, 5 up” shifting pattern. The pattern is typically 1st gear, neutral, 2nd gear, 3rd gear, and so on. When shifting gears you will see the appropriate number light up on your gauge. When you’re driving, you should shift gears by first pulling on your clutch with your left hand to disengage the rear wheel. As you pull the clutch, reduce the throttle. Reducing the throttle will prevent your bike from jerking as you re-engage the rear wheel. Continue by shifting gears with your left foot. Feather the throttle with your right hand to keep the transmission smooth. Finally, release the clutch, engaging the rear tire."
    },
    {
      "title": "Start your engine",
      "content": "Start your engine . Pull the clutch lever in and locate your kill switch. This is usually a red switch located on the right handlebar. Flip it down into the “on” position. Most modern bikes don’t require you to kick-start your engine, but if you have an older bike you may have to. The kick start lever, if you have one, can be found behind the foot peg on the right side of your bike. [5] X Research source Turn your key to the “ignition” position and check to make sure the lights and gauges are on and operating. Put your bike into neutral. The easiest way to do this is to downshift to 1st gear and then shift up once. Look for the “N” on your gauge to light up. With your right thumb, push the “Start” button. This is usually located under the kill switch. Start buttons are often identified by a circular arrow with a lightning bolt in the middle. Once the engine has turned over, let your bike warm up for about 45 seconds so the engine will work properly. When your feet are flat on the ground, pull the clutch lever back in. Then roll back onto your heels and repeat until you have a good feel for the clutch."
    },
    {
      "title": "Try \"power walking\" the bike.",
      "content": "Try \"power walking\" the bike. Start with your feet in front of you and on the ground. Slowly let the clutch out until the bike starts to pull itself forward. Using only the clutch, walk the bike forward, keeping it steady with your feet. Repeat this until you can keep the bike upright when you pull your feet off the ground. You want to get a good sense of balance on your bike."
    },
    {
      "title": "Begin driving your motorcycle.",
      "content": "Begin driving your motorcycle. Once the engine has started and warmed up, you can begin to ride . This is done by shifting down into 1st gear and letting the clutch lever out while simultaneously pulling back on the throttle. [6] X Research source Make sure your kickstand isn’t out. Slowly let out the clutch lever until the bike starts to roll forward. You may have to pull back on the throttle slightly to prevent your bike from stalling while releasing the clutch. Once you are moving, accelerate slightly and pull you feet up onto the pegs. Try straight-line riding. As you let the clutch out and slowly roll the throttle back to pick up a little speed, continue riding in a straight line. When you are ready to stop, pull in the clutch lever, and slowly apply the front and rear brakes simultaneously. Use your left foot to steady the bike at a stop. When you are stopped, put your right foot on the ground."
    },
    {
      "title": "Practice shifting gears.",
      "content": "Practice shifting gears . Once you’re able to start riding in a straight line, get a feel for shifting. Get a feel for the \"friction zone\". The friction zone is the area of resistance created as the clutch becomes engaged. This area allows for the transfer of power from the engine to the rear wheel. Motorcycle transmissions are sequential, meaning that you have to shift one gear in consecutive order, whether shifting up or down. It will take some practice to be able to feel and hear when it's time to shift. The engine will start revving at higher rpms when it's time to shift. [7] X Research source With your bike on, shift all the way down into 1st gear. You’ll know you’re in 1st gear when the shift pedal doesn’t click down anymore. You should hear a bit of a clicking noise when in 1st. Very slowly let your clutch out until the bike starts moving forward. When you want to start moving faster, pull back on the throttle slightly as you let out the clutch. To get to 2nd gear, pull the clutch back, ease off the gas, and pull up firmly on your shifter to move through neutral. Check to make sure your neutral light is not on. Let the clutch out and engage the throttle again. Repeat this process to shift through higher gears. After 2nd gear, you don’t have to pull up with your left toe quite as hard since you’re not going through neutral. To downshift, release the throttle, squeezing the brake lever slightly. Pull your clutch in and press down on your shifter. Then let out your clutch. Once you get a hang of downshifting, you can come to a stop while in second gear. Then, once at a stop, shift down again into 1st."
    },
    {
      "title": "Practice turning",
      "content": "Practice turning . Much like a bicycle, a motorcycle is turned, once you're at about 10 mph or higher, by countersteering. Push down on the handgrip on the side of the bike you want to turn. Look up and through your turn. As you enter your turn, remember to slow down. Don’t apply the brakes during your turn. Release the throttle and break if you have to before you start your turn. Keep your head up and look through the turn. Press the handlebar in the direction you want to go. Slowly roll on the throttle as you glide through the turn to keep momentum. As you slow down, turn your head to look to the end of the turn. Your bike will follow your eyes. Find a point at the end of your turn to aim for and keep your eyes on it. Never look at the ground or down into your turn. Though you may feel weird and want to watch your turn, this is dangerous and can cause you to not complete your turn properly. Press on the side you want to turn. If you are making a left turn, push away from yourself on the right side of the handlebar. This will cause the bike to lean to the left. Lean with it and slowly roll on the throttle to slightly increase your speed. As you come out of the turn, keep the throttle steady or add a bit more gas while you lean back up. Let the bike right itself, don’t jerk the handlebars."
    },
    {
      "title": "Practice slowing down and stopping.",
      "content": "Practice slowing down and stopping. Finally, now that you’ve practiced starting, shifting, and turning your bike, you need to know how to slow down and come to a stop. Remember that the lever on the right handlebar operates your front brake, while the brake by your right foot operates the brake for the back wheel. As a general rule, you want to begin braking with your front brake and employ your rear brake after to help you slow down and stop. [8] X Research source When coming to a full stop, it’s best, to begin with your front brake and apply the rear brake after you’ve slowed down some. As you slow down, make sure you downshift. You don’t always need to go all the way into 1st gear. You can downshift into 2nd gear and stop before shifting down to 1st. Pull in the clutch when braking and gearing down. Apply pressure to both your front and rear brake as you slow down and begin braking. Make sure you aren’t pulling back on the throttle. This is made easy by the fact that the front brake handle is situated so that you have to roll your hand forward to reach it. Gradually increase pressure on your brakes, don’t engage the brakes completely, this can cause your bike to stop abruptly and jolt. Once you are at a stop, keep the front brake engaged, and plant your feet firmly on the ground. Start with your left foot, then your right."
    }
  ]
}