{
  "url": "https://www.wikihow.com/Open-a-Lobster",
  "title": "How to Open a Lobster",
  "steps": [
    {
      "title": "Bend the tail back and twist it off the body.",
      "content": "Bend the tail back and twist it off the body. Hold your cooked lobster upside-down with the body in one hand and the tail in the other. Press your thumbs into the spot where the tail connects to the body along the lobster’s back. Slowly press your thumbs down and bend the tail backward to break the shell. Then twist the tail to separate it from the body. [1] X Research source"
    },
    {
      "title": "Twist the claws off of the body.",
      "content": "Twist the claws off of the body. Grab the base of the lobster’s knuckle, which is the part between the claw and the body. Hold the lobster’s body still with your other hand. Slowly twist the knuckle until you feel it loosen from the body and carefully pull it off so you don’t break the meat apart. [2] X Research source"
    },
    {
      "title": "Pull the legs out from the base of the body.",
      "content": "Pull the legs out from the base of the body. Get a good grip on the lobster’s body and use your other hand to pinch the base of one of the legs between your fingers. Simply twist the leg in either direction to break it off of the body. Continue pulling the remaining legs off your lobster. [3] X Research source Don’t throw away the head or body just yet. You’ll still be able to get some meat out of it later on."
    },
    {
      "title": "Break claws and knuckles with a shell cracker for a quick method.",
      "content": "Break claws and knuckles with a shell cracker for a quick method. Shell crackers are metal or plastic tools with 2 handles that have gripping teeth on the inside. You only need them to break apart solid pieces of shell, like the claws and knuckles. Position the shell between the handles against the teeth. Then squeeze the handles together to crack apart the shell. [4] X Research source If you don’t have a shell cracker, you can use a nutcracker instead. Shell crackers damage the meat inside the shell, so they aren’t the best if you want to present the meat in a clean way."
    },
    {
      "title": "Tap the blade of a chef’s knife against the shell to break it apart.",
      "content": "Tap the blade of a chef’s knife against the shell to break it apart. Even though a lobster cracker is a little easier to work with, a sharp chef’s knife is a great alternative you probably have in your kitchen already. To break apart the shell, lightly tap the shell with the blade until it sticks in. Then, twist the blade to split the shell. [5] X Research source Always be careful when you’re breaking apart lobster shells since they could be sharp. Make sure you pick out any pieces of the shell before serving the meat."
    },
    {
      "title": "Cut off cartilage and separate the shell with seafood scissors.",
      "content": "Cut off cartilage and separate the shell with seafood scissors. You can buy seafood scissors from your local kitchen goods store. Seafood scissors have sharp blades meant for cutting through shells, so they’re more durable than standard kitchen scissors. Use your scissors to cut through bits of the shell so the meat stays intact and looks great when you serve it."
    },
    {
      "title": "Cut the underside of the tail with your seafood scissors.",
      "content": "Cut the underside of the tail with your seafood scissors. Hold your lobster tail upside-down in your non-dominant hand so the fins point away from you. Place the tip of your scissors on the clear part of the shell near the open end of the tail. Slowly cut the shell along the entire length of the tail. Be careful not to push the scissors too deep into the tail or else you’ll damage the meat inside."
    },
    {
      "title": "Squeeze the tail shell tightly to crack it.",
      "content": "Squeeze the tail shell tightly to crack it. Keep the tail upside-down and squeeze the shell in your hand. Use enough force so that you hear the shell crack, but not so hard that you push the meat out. This helps separate the meat from the shell so it’s easier for you to pull out. [6] X Research source If you need to get a better grip on the lobster tail, hold it in a towel while you squeeze it. You don’t need a lobster cracker to break open a lobster tail since it will easily crack by hand."
    },
    {
      "title": "Pull the tail apart to remove the meat in one piece.",
      "content": "Pull the tail apart to remove the meat in one piece. Grab the sides of the shell and pull them apart as if you were opening a book. You’ll see a large portion of meat inside of the shell, so slide it out with your fingers without breaking it apart. [7] X Research source Use a skewer or a fork to push the meat out from the shell if you have trouble getting it out by hand."
    },
    {
      "title": "Bend and break off the small pincers.",
      "content": "Bend and break off the small pincers. Grab the smallest pincer on the claw and bend it straight backward toward the base of the claw. Pull the pincer gently away from the claw so you don’t damage any of the meat that was inside. If the meat does break apart inside of the pincer, use a bamboo skewer or small fork to scrape it out."
    },
    {
      "title": "Crack the base of each claw with a cracker or knife.",
      "content": "Crack the base of each claw with a cracker or knife. If you’re using a lobster cracker, position the teeth around the base of the claw and squeeze the handles together to break the shell. If you’re using a chef’s knife, stand the claw up and hold it by the large pincer. Tap the blade of your knife lightly into the top edge of the claw’s shell until it sticks in. Then, twist the handle of the knife to snap the shell. [8] X Research source Using a knife lets you pull the shell off the meat easily, while using a cracker might be a little messier."
    },
    {
      "title": "Gently pull the shell off of the meat.",
      "content": "Gently pull the shell off of the meat. Slide the shell at the base of the claw off of the meat and set it aside. Then, put your pinky in the hole where the smallest pincer used to be to help push the meat out. Grab the exposed claw meat and carefully pull it straight out from the claw."
    },
    {
      "title": "Yes, you can use a rolling pin to get the meat out.",
      "content": "Yes, you can use a rolling pin to get the meat out. Slice the ends of each leg at an angle with a pair of seafood scissors to help push the meat out easier. Lay the meat on a cutting board and place a rolling pin at one end of the leg. Roll along the entire length of the leg to push the meat out. Repeat the process for the rest of your lobster legs. [9] X Research source Lobster legs have some of the sweetest meat, so don’t let them go to waste. Alternatively, you can just suck on the ends of the legs to eat the meat."
    },
    {
      "title": "You can also find meat in the knuckles that attach to the claws.",
      "content": "You can also find meat in the knuckles that attach to the claws. Twist or cut the knuckles off of the base of the lobster claws. Use a cracker or the blade of a chef’s knife to break the shell around the knuckle. Peel off any broken shell pieces and use a fork to slide the meat out. [10] X Research source"
    },
    {
      "title": "You can find some more meat in the lobster’s head by the leg joints.",
      "content": "You can find some more meat in the lobster’s head by the leg joints. Flip the lobster’s head upside-down so you see small pockets where the legs used to attach to the body. Push a fork into each of the pockets and gently scoop out the rest of the meat. [11] X Research source This meat is sometimes referred to as “the oyster of the lobster” since it’s so tender."
    },
    {
      "title": "Try the green liver found in the lobster’s head for a strong, unique flavor.",
      "content": "Try the green liver found in the lobster’s head for a strong, unique flavor. This is tomalley, or the lobster’s liver, and it’s considered a delicacy in many places. It can be an acquired taste, so try a little bit if you want to have a different flavor. If you don’t like it, then just throw it away or save it to flavor seafood stock. [12] X Research source While it is edible, the FDA has advised against consuming tomalley from lobsters caught in New England since it might contain high levels of toxins. [13] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source"
    },
    {
      "title": "You can also steam and eat the lobster eggs from a female lobster.",
      "content": "You can also steam and eat the lobster eggs from a female lobster. When you pull out your lobster’s tail, you may see black or red roe inside of its body. If the roe is red, you can eat it right away. If it looks black, steam it for a few minutes until it turns red before eating it. [14] X Research source"
    }
  ]
}