{
  "url": "https://www.wikihow.com/Sak-Yant-Tattoo-Rules",
  "title": "What Are the Sak Yant Tattoo Rules?",
  "steps": [
    {
      "title": "Sak yant is a traditional school of spiritual tattooing in Thailand.",
      "content": "Sak yant is a traditional school of spiritual tattooing in Thailand. Sak yant is a type of tattooing in Thailand performed by Buddhist monks. The artist uses traditional Buddhist designs and prays or chants while applying the tattoo to imprint it with spiritual energy and powers. [1] X Research source Sak yant tattoos are always hand poked with a metal spike or bamboo shoot—there are no machines used and nothing is automated. Depending on the design, a sak yant tattoo may be associated with healing from trauma, good luck, strength, protection against evil, or some other spiritual meaning. Getting a sak yant tattoo can be a deeply spiritual experience. The artist will choose the design for you based on how you describe yourself and your life, and they’ll perform rituals throughout the process. The most popular place to get an authentic sak yant tattoo is at the Wat Bang Phra Buddhist temple. It’s the first documented temple to practice sak yant. [2] X Research source Sak yant means “to tap” or “to tattoo” in English. It’s often referred to as “yantra,” as well. A note on authenticity: There is debate over whether non-monks can create “real” sak yant tattoos. Many sak yant tattoo artists are either former monks or trained under monks. Regardless of the route you take, make sure you work with a licensed and sanitary artist. [3] X Research source"
    },
    {
      "title": "",
      "content": "Once you’ve received a sak yant tattoo, there are a handful core rules you are supposed to follow (your tattoo artist may cover these ahead of time, after the tattoo, or not at all). Breaking these rules will supposedly break any spiritual benefits of the sak yant tattoo. While every tattoo carries different rules, there are 5 core rules that will basically always apply regardless of your tattoo’s design. [4] X Research source"
    },
    {
      "title": "Do not kill another living being.",
      "content": "Do not kill another living being. This includes insects, so you better get used to mastering the cup and paper method to let them outside!"
    },
    {
      "title": "Do not steal or lie.",
      "content": "Do not steal or lie. Many monks will separate this into two separate rules, but they’re often put together because they both involve deception."
    },
    {
      "title": "Do not be unfaithful in your relationships.",
      "content": "Do not be unfaithful in your relationships. Sometimes, the monk will specify that this includes not lusting after men or women in a committed relationship."
    },
    {
      "title": "Do not become intoxicated.",
      "content": "Do not become intoxicated. Look, we never said that it’d be easy to follow all the sak yant rules. While many monks have different rules for what qualifies as “intoxicated,” it’s usually meant to include alcohol, caffeine, and tobacco."
    },
    {
      "title": "Do not speak ill of your family.",
      "content": "Do not speak ill of your family. Family is extremely important in Thai culture, and respecting your elders is an important component of Buddhism. As a result, being kind to your loved ones is a big rule for sak yant tattoos."
    },
    {
      "title": "Your artist may assign additional rules based on your tattoo’s meanings.",
      "content": "Your artist may assign additional rules based on your tattoo’s meanings. Every design element of your tattoo and every chant or prayer performed while completing your tattoo have specific spiritual meanings. The monk who completes your tattoo may also assign additional rules based on those meanings. [5] X Research source Some popular rules include: Do not commit evil deeds. Do not spit in the toilet. Do not eat food from banquets, weddings, or funerals. Do not claim to have special powers because of your tattoo. Do not slander anyone’s mother. Do not duck under a washing line."
    },
    {
      "title": "Ong Phra (Buddah’s body)",
      "content": "Ong Phra (Buddah’s body) Representing guidance and illumination, ong phra depicts 5 (or 9) bodies of Buddah. It’s often the foundation for larger sak yant pieces. [6] X Research source"
    },
    {
      "title": "Ha-thaeo (five rows)",
      "content": "Ha-thaeo (five rows) The ha-thaeo is meant to be a blessing for success and good luck. Each of the 5 lines represent a different yant (or spell). [7] X Research source The ha-thaeo is often placed on the back of your left shoulder."
    },
    {
      "title": "Kao-yot (nine spires)",
      "content": "Kao-yot (nine spires) The 9 spires represent the 9 blessed qualities of the Buddha. It has traditionally been used as a talisman to protect weapons, soldiers, and fighters. [8] X Research source The 9 qualities are a key foundation of Buddhism. They are: accomplishment, enlightenment, clear vision and virtuous conduct, sublimity, knowledge of words, leading of men, teaching of gods, enlightenment, and blessing. [9] X Research source"
    },
    {
      "title": "Si-yot (four spires)",
      "content": "Si-yot (four spires) The 4 spires are designed to influence others to be favorable to the owner of the tattoo so that they may be protected. [10] X Research source Si-yot, also known as See Yord, is heavily associated with metals like copper, lead, silver, and gold. It’s a popular design for gemologists, welders, and people who work in finance. Paet-thit (eight points){endbold} The paet-thit depicts the 8 directions of the universe. It’s a round shape with 8 points that is designed to protect the world and keep the wearer of the tattoo in balance with the universe. [11] X Research source Sip-thit is a popular variation on this design that uses 10 points instead of 8."
    },
    {
      "title": "Maha-niyom (great preference)",
      "content": "Maha-niyom (great preference) The maha-niyom is designed to grant the wearer of the symbol preference throughout their life from others. [12] X Research source This design is usually placed on the opposite side of the ha-thaeo on the right shoulder."
    },
    {
      "title": "Yot Mongkut (spired crown)",
      "content": "Yot Mongkut (spired crown) The crystal or spired crown is intended to provide good fortune and keep the wearer of the tattoo safe in battle. It’s often placed on or near the head. [13] X Research source The crown is often one of the last design elements to be added as it can convey the final coronation of the wearer of the design."
    },
    {
      "title": "Uṇālom (ūrṇā curl)",
      "content": "Uṇālom (ūrṇā curl) The uṇālom is everywhere in Thailand. It’s a common motif in Buddhism that roughly depicts a “third eye”—the spiritual eye in your forehead that can lead you to the path of Nirvana. This design is a popular element in sak yant art. [14] X Research source"
    }
  ]
}