{
  "url": "https://www.wikihow.com/Play-Golf-(Card-Game)",
  "title": "How to Play Golf (Card Game)",
  "steps": [
    {
      "title": "Have the players sit in a circle and shuffle a deck.",
      "content": "Have the players sit in a circle and shuffle a deck. If there are four or more players, shuffle two decks together. [1] X Research source If there are eight or more players, shuffle three decks together. [2] X Research source If you want to use a variant rule, make sure everyone agrees before the game begins. Once the cards have been dealt, the rules cannot be changed."
    },
    {
      "title": "Deal out six cards to each player face down.",
      "content": "Deal out six cards to each player face down. Someone can volunteer to be dealer or you can select one randomly. Don't look at the cards you've been dealt! If anyone does, shuffle the cards again and re-deal. If you play multiple rounds, take turns as the dealer, going clockwise. The dealer should give himself the same number of cards."
    },
    {
      "title": "Make a draw and discard pile.",
      "content": "Make a draw and discard pile. Place the remainder of the deck in a face down stack to from the draw pile. Flip over the top card face up next to it to form the discard pile."
    },
    {
      "title": "Each player arranges their cards in a 3x2 grid in front of them.",
      "content": "Each player arranges their cards in a 3x2 grid in front of them. Don't look at the cards or turn them face up yet."
    },
    {
      "title": "Each player turns any two cards in their grid face up.",
      "content": "Each player turns any two cards in their grid face up. You can choose the second one after you've turned over your first."
    },
    {
      "title": "Explain the scoring system.",
      "content": "Explain the scoring system. Use the Scoring Guide for a common system, or use a variation. Write or print it out for people who haven't played before. Points are bad! Make sure everyone knows the goal of the game is to get the lowest score, not the highest!"
    },
    {
      "title": "The player to the dealer's left takes the first turn.",
      "content": "The player to the dealer's left takes the first turn. If possible this should be someone who has played the game before, so the new players can learn by watching them. After that player is finished, play continues clockwise, each player taking a turn in order."
    },
    {
      "title": "At the start of your turn, draw a card.",
      "content": "At the start of your turn, draw a card. You can take the top card of the discard pile if you think it will be useful. Otherwise, draw a card from the top of the draw pile (the rest of the deck). Read the rest of these rules or see Strategy to help you make this decision."
    },
    {
      "title": "Decide whether to replace one of the cards in your grid with the drawn card.",
      "content": "Decide whether to replace one of the cards in your grid with the drawn card. You can replace any card, whether it's face up or face down. Pick up the card you want to replace from your grid and put it face up in the discard pile. Place the newly drawn card face up in its place. You cannot shift the position of your grid around before you do this. If you don't like the card you just drew, you can discard it face up in the discard pile instead of replacing a card in your grid. You cannot do this if the card you drew just came from the discard pile."
    },
    {
      "title": "Try to make pairs of the same card.",
      "content": "Try to make pairs of the same card. If the two cards in a column share the same number or letter (for instance, a Queen above another Queen), they cancel each other out and are worth nothing (zero points). Remember, you're trying to get the lowest score possible! If you like, you can take columns that have canceled out and place them on the bottom of the discard pile (NOT the top). This makes the table less cluttered."
    },
    {
      "title": "Take one final turn after a player's grid is entirely face up.",
      "content": "Take one final turn after a player's grid is entirely face up. Once someone replaces their last face down card, each other player turns their grid face up as well and takes one final turn in clockwise order."
    },
    {
      "title": "After the final turn, score your points.",
      "content": "After the final turn, score your points. Wait until the last player takes their turn, then flip every card in front of you face up. Use a sheet of paper with each player's name on it to record their score for the round. Refer to the scoring guide to count up players' points. Remember to follow any variations the players agreed upon beforehand."
    },
    {
      "title": "Shuffle the cards and play as many rounds as you like.",
      "content": "Shuffle the cards and play as many rounds as you like. Whoever sat left of the dealer in the last round is the new dealer for this round. The person sitting left of the current dealer always goes first in a round. Keep score after each round until: You play 9 rounds, 18 rounds, or some other number everyone agrees on. The traditional numbers of rounds are named after the golf theme and sometimes called \"holes\" instead of rounds. A player reaches 100 points, 200 points, or some other number everyone agrees on. When people decide to stop. This works well for casual groups so no one gets bored, but more competitive people might not like stopping when they're behind!"
    },
    {
      "title": "Whoever has the lowest total score wins the game.",
      "content": "Whoever has the lowest total score wins the game. Each player adds up their score from each round, and the lowest total wins. If two players are tied, either let them share the glory or decide on another game to break the tie (such as rock paper scissors)."
    },
    {
      "title": "Shuffle the deck and deal out four cards.",
      "content": "Shuffle the deck and deal out four cards. This variation can be played with 2 or more players but works best with 3 to 5. If you have 8 or more players, shuffle two decks together. [3] X Research source If you want to use a variant rule, make sure everyone agrees before the game begins. Once the cards have been dealt, the rules cannot be changed. No one should look at any cards yet. The dealer should give herself four cards as well."
    },
    {
      "title": "Make a draw and discard pile.",
      "content": "Make a draw and discard pile. Place the remainder of the deck in a face down stack to from the draw pile. Flip over the top card face up next to it to form the discard pile."
    },
    {
      "title": "Each player arranges their cards in a 2x2 grid in front of them.",
      "content": "Each player arranges their cards in a 2x2 grid in front of them. Remember not to look at the cards yet! They should always be kept face down."
    },
    {
      "title": "Each player peeks at any two cards in their grid.",
      "content": "Each player peeks at any two cards in their grid. Don't let anyone else see what they are. Put them back in place when you've memorized them. If you're playing with young kids or other people who have trouble memorizing cards, see the \"4 cards in hand\" Variation or try using the 6-card rules instead."
    },
    {
      "title": "Teach everyone the scoring system.",
      "content": "Teach everyone the scoring system. See the Scoring Guide for a common system, or use a variation. Write or print it out for people who haven't played before. The goal of the game is to get the lowest score . Make sure no one is trying to \"win\" by getting the highest instead!"
    },
    {
      "title": "At the start of your turn, draw a card.",
      "content": "At the start of your turn, draw a card. This can be from the discard pile or draw pile (rest of the deck). Read the rest of these rules or see Strategy to help you make this decision. Hold this card in your hand. If it came from the face down draw pile, don't let anyone else see it."
    },
    {
      "title": "Decide whether to replace one of the cards in your grid with the drawn card.",
      "content": "Decide whether to replace one of the cards in your grid with the drawn card. You can replace any card, whether it's one you've peeked at or not. Pick up the card you want to replace from your grid and put it face up in the discard pile. Place the card you just drew face down to fill the empty space in your grid. You may not move the cards in the grid to different positions. Remember to memorize the card you just put down! This variation tests your memory, so you are not allowed to peek at a card after the beginning of the game. If you don't like the card you just drew, you can discard it face up in the discard pile instead of replacing a card in your grid. You CANNOT do this if the card you drew just came from the discard pile."
    },
    {
      "title": "Try to make pairs of the same card.",
      "content": "Try to make pairs of the same card. A pair of the same card in a row or column are worth zero points. Don't show the other players or turn any cards face up to \"cancel\", though. They remain a face down secret until the end of the game. If you have three of a kind, only two of them will cancel out. The third will still be worth its usual value. If you have four of a kind, your entire grid is worth zero points."
    },
    {
      "title": "When you want to end the game, knock on the table.",
      "content": "When you want to end the game, knock on the table. Instead of taking your normal turn, anyone can knock on the table to signify that they think they'll win. That player skips their turn, and each other player takes one final turn. Then the round ends. You can't knock after someone has already knocked."
    },
    {
      "title": "After the final turn, score your points.",
      "content": "After the final turn, score your points. Wait until the last player takes their turn, then flip every card in front of you face up. Use a sheet of paper with each player's name on it to record their score for the round. Refer to the scoring guide to count up players' points. Remember to follow any variations the players agreed upon beforehand."
    },
    {
      "title": "Shuffle the cards and play as many rounds as you like.",
      "content": "Shuffle the cards and play as many rounds as you like. Whoever sat left of the dealer in the last round is the new dealer for this round. The person sitting left of the current dealer always goes first in a round. Keep score after each round until: You play 9 rounds, 18 rounds, or some other number everyone agrees on. The traditional numbers of rounds are named after the golf theme and sometimes called \"holes\" instead of rounds. A player reaches 100 points, 200 points, or some other number everyone agrees on. When people decide to stop. This works well for casual groups so no one gets bored, but more competitive people might not like stopping when they're behind!"
    },
    {
      "title": "Whoever has the lowest total score wins the game.",
      "content": "Whoever has the lowest total score wins the game. Each player adds up their score from each round, and the lowest total wins. If two players are tied, either let them share the glory or decide on another game to break the tie (such as rock paper scissors)."
    },
    {
      "title": "You can use each scoring system for any variation of the game.",
      "content": "You can use each scoring system for any variation of the game. Scoring Cards Basic System Harder Variation Ace 1 point 1 point 2 2 points 2 points 3 3 points 3 points 4 4 points 4 points 5 5 points 5 points 6 6 points 6 points 7 7 points 7 points 8 8 points 8 points 9 9 points 9 points 10 10 points 10 points Jack 10 points 11 points Queen 10 points 12 points King 0 points (zero) 13 points"
    },
    {
      "title": "Jokers or \"bonus cards\".",
      "content": "Jokers or \"bonus cards\". For this optional variation, shuffle in 2 Jokers for each 52 card deck. If you don't have Jokers, instead designate a specific card the \"bonus card\" (usually Twos or \"one eyed Jacks\"). The Joker or bonus card is worth -2 (negative two) points instead of its usual value. A pair of Jokers or bonus cards cancel each other out just like normal pairs, increasing your score from -4 to 0."
    },
    {
      "title": "Penalties for Ending the Game Early.",
      "content": "Penalties for Ending the Game Early. This optional rule punishes players who try to end the game too early, and rewards players who correctly guess when they're ahead. Here are a couple variations. The player who ends the game (by \"knocking\" or by flipping their last card face up) gains 10 points if they do not have the lowest score this round. If the player who ended the game does not have the lowest score this round, that player gains a number of points equal to the player who did. For example, Scrooge \"knocks\". After each player takes their final turn and counts up their score, Scrooge has 17 points and Marley has 12. Because Scrooge didn't win the round by getting the lowest score, Scrooge is punished for knocking and adds Marley's 12 points to his own. The final scores are Scrooge 29 and Marley 12."
    },
    {
      "title": "8-card or 10-card Golf.",
      "content": "8-card or 10-card Golf. Follow the rules for 6-card golf, but give each player a 4x2 or 5x2 grid. This will make the game quite a bit longer and may require an additional deck of cards shuffled with the other(s)."
    },
    {
      "title": "4-cards in hand.",
      "content": "4-cards in hand. Follow the rules for 4-card golf, but give each player a hand of four cards instead of a grid. Players can look at all cards in their hand at any time. Any two cards in hand cancel out if they have the same value. There is no \"grid position\" in your hand. This creates a short simple game with no need to memorize cards."
    },
    {
      "title": "9-card Golf.",
      "content": "9-card Golf. Follow the rules for 6-card golf, but give each player a 3x3 grid. Each player turns up 3 cards instead of 2 at the start of the game. A player can only cancel cards by getting 3 of a kind in the same row or column. When they do, they can remove those 3 cards and place them at the bottom (NOT the top) of the discard pile. This will make the game quite a bit longer and may require an additional deck of cards shuffled with the other(s)."
    },
    {
      "title": "Variant rules in 6-card Golf.",
      "content": "Variant rules in 6-card Golf. There are many different ways to play 6-card golf, and different families and gaming groups will have their own rules. Here are some common ones: When you flip over your first two cards, they have to be in the same column, or they must be in different columns. [4] X Research source Two of the same card anywhere on the layout cancel out, not just in the same column. This makes the game easier for younger players or beginners. [5] X Research source If you have two columns next to each other with FOUR of the same card in them, they cancel out to zero points AND each other player gets 10 points added to their score this round. [6] X Research source Players can only draw from the top of the draw pile during the final turns, not the discard pile."
    },
    {
      "title": "Variant rules in 4-card face down Golf.",
      "content": "Variant rules in 4-card face down Golf. Again, there are many ways to play. Here are some common additions or changes to the rules: You can only peek at the two cards closest to you. Pairs across from each other diagonally also cancel out. Pairs don't cancel out at all. The only goal is to take the lowest cards and try to end the game when you think you're ahead. Players can only draw from the top of the draw pile during the final turns."
    },
    {
      "title": "Choose the starting cards wisely.",
      "content": "Choose the starting cards wisely. If you're playing a variation that allows you to start with face up cards, choose cards in different columns. This gives you more chances to \"cancel\" out a column."
    },
    {
      "title": "Replace your highest scoring cards.",
      "content": "Replace your highest scoring cards. Unless you can cancel out your high scoring cards, you want to get rid of them so they don't add their high values to your score. This is especially important as the game draws to a close. If your opponent is almost out of face down cards (or is looking smug), toss out your liabilities as quickly as possible!"
    },
    {
      "title": "Pay attention to the players on your right and left.",
      "content": "Pay attention to the players on your right and left. Much of the strategy in Golf comes down to paying attention to the other players. [7] X Research source If the player to your right is picking up Sixes, you should give up trying to cancel your own Sixes. They aren't likely to discard any. If the player to your left is trying to finish a column of Nines, try to avoid discarding your own Nine."
    }
  ]
}