{
  "url": "https://www.wikihow.com/Remove-Someone-Under-13-from-Family-Sharing",
  "title": "How to Remove Someone Under 13 from Family Sharing",
  "steps": [
    {
      "title": "Sign out of your child's account everywhere it's signed in.",
      "content": "Sign out of your child's account everywhere it's signed in. If the child's Apple ID is still signed in when the account is deleted, you could run into problems using that device later. Complete the following steps anywhere your child is signed in: iPhone/iPad: Open Settings and tap your child's name at the top. Scroll down, tap Sign Out , enter your password, and then tap Turn Off . Choose which data to keep on the device and select Sign Out . Mac: Click the Apple menu, select System Preferences , and then click the child's Apple ID. Click Overview , click iCloud (High Sierra and earlier only), and then click Sign Out . [1] X Research source"
    },
    {
      "title": "Go to https://privacy.apple.com in any web browser.",
      "content": "Go to https://privacy.apple.com in any web browser. The only way to delete your child's Apple ID is to have the child submit a request, which you will later approve. [2] X Research source"
    },
    {
      "title": "Log in with your child's Apple ID and password.",
      "content": "Log in with your child's Apple ID and password. This takes you to Apple's Data and Privacy statement."
    },
    {
      "title": "Click Request to delete your account.",
      "content": "Click Request to delete your account . It's at the bottom of the statement. You'll see a \"Parental consent is required\" message."
    },
    {
      "title": "Click Request consent.",
      "content": "Click Request consent . This sends an email to the parent's email address to request permission."
    },
    {
      "title": "Click Sign Out.",
      "content": "Click Sign Out . It's at the top-right corner. You'll need to be signed out so you can sign in to your own account."
    },
    {
      "title": "Click the Sign in with your Apple ID link in the email message from Apple.",
      "content": "Click the Sign in with your Apple ID link in the email message from Apple. This takes you to the Apple ID sign-in screen."
    },
    {
      "title": "Log in with your own Apple ID.",
      "content": "Log in with your own Apple ID. Once you're signed in, you'll be able to approve the deletion request."
    },
    {
      "title": "Select a deletion reason and click Continue.",
      "content": "Select a deletion reason and click Continue . You may also have to confirm your billing info so you can prove your identity. Don't worry, you won't be charged."
    },
    {
      "title": "Review the terms and click Continue.",
      "content": "Review the terms and click Continue . If you click Continue , you're agreeing to the terms you reviewed."
    },
    {
      "title": "Write down and confirm the 12-digit access code.",
      "content": "Write down and confirm the 12-digit access code. This code will be used to verify your identity if you have to contact Apple about this matter down the road. After writing it down, click Continue , re-enter it, and then click Continue again."
    },
    {
      "title": "Click Delete account.",
      "content": "Click Delete account . This permanently deletes your child's Apple ID, thus removing them from Family Sharing. [3] X Research source"
    },
    {
      "title": "Open your iPhone or iPad's Settings .",
      "content": "Open your iPhone or iPad's Settings . The family organizer of the group you want to invite the child to must complete these steps on their iPhone or iPad. Once the child is invited, the organizer of the current family can approve the move, which will remove the child from the original family. The child (or someone who knows their password) should be with the person sending the invitation so they can enter their own username and password."
    },
    {
      "title": "Tap your name at the top.",
      "content": "Tap your name at the top. Remember, the person doing these actions is the organizer for the family your child is moving to ."
    },
    {
      "title": "Tap Family Sharing.",
      "content": "Tap Family Sharing . It's in the second group of settings."
    },
    {
      "title": "Tap Add Member.",
      "content": "Tap Add Member . You'll see it below current family members."
    },
    {
      "title": "Tap Invite People and select Invite in Person.",
      "content": "Tap Invite People and select Invite in Person . Now you'll be asked to enter the new member's Apple ID and password."
    },
    {
      "title": "Log in as the child and follow the on-screen instructions.",
      "content": "Log in as the child and follow the on-screen instructions. Once the child is signed in with their Apple ID, the organizer of the original family group will receive an email to confirm the change."
    },
    {
      "title": "Follow the instructions in the email from Apple.",
      "content": "Follow the instructions in the email from Apple. To approve the change, the organizer should click Sign in with your Apple ID in the message and log in with your (or their) Apple ID. Then, follow the on-screen instructions to confirm the switch."
    },
    {
      "title": "Open System Preferences on your Mac.",
      "content": "Open System Preferences on your Mac. The organizer of the family you want to invite the child to must complete these steps on their Mac. After inviting the child, the previous organizer must approve the move, which will remove the child from the original family. The child (or someone who knows their password) should be with the person sending the invitation so they can enter their own username and password."
    },
    {
      "title": "Click the Family Sharing icon.",
      "content": "Click the Family Sharing icon. It's the cloud icon at the top-right corner of System Preferences."
    },
    {
      "title": "Click the + and select Invite People.",
      "content": "Click the + and select Invite People . This opens a list of options."
    },
    {
      "title": "Click Invite People.",
      "content": "Click Invite People . This blue button is at the bottom-right corner."
    },
    {
      "title": "Log in as the child and follow the on-screen instructions.",
      "content": "Log in as the child and follow the on-screen instructions. Once the child is signed in with their Apple ID, the organizer of the original family group will receive an email to confirm the change."
    },
    {
      "title": "Follow the instructions in the email from Apple.",
      "content": "Follow the instructions in the email from Apple. To approve the change, the organizer should click Sign in with your Apple ID in the message and log in with your (or their) Apple ID. Then, follow the on-screen instructions to confirm the switch."
    }
  ]
}