{
  "url": "https://www.wikihow.com/Mean-Mugging",
  "title": "What Does Mean Mugging Mean?",
  "steps": [
    {
      "title": "Mean mugging means to stare with an irritated or angry facial expression.",
      "content": "Mean mugging means to stare with an irritated or angry facial expression. This slang term is a verb that refers to making a scowling facial expression and directing it at another person. It usually involves frowning and furrowing your eyebrows, which makes you look angry or threatening. You might “mean mug” another person to look intimidating, express that you’re upset or frustrated, or signify that you’re judging them. [1] X Research source Mean mugging isn’t always intentional or meant to be offensive. Some people’s faces naturally rest in a frown, while other people might make this expression while they’re concentrating or simply tired. Pronunciation : Mean mugging is pronounced “meen-mugh-ing” or “meen-mugh-in.”"
    },
    {
      "title": "Mean mugging can be used seriously or humorously.",
      "content": "Mean mugging can be used seriously or humorously. Mean mugging is usually used to describe an unpleasant look someone is giving you that makes you feel upset, uncomfortable, or offended. However, you can also use it playfully to poke fun at someone’s expression, like a baby unintentionally scowling at you. “This girl at the coffee shop was mean mugging me. She gave me the rudest glare because she thought I took her order. Thankfully the barista called her name right after I got my coffee!” “Remind me not to get on Nick’s bad side! He was mean muggin’ everyone who kept talking in class. From his face, I thought he was gonna go over there and make them be quiet!” “I was mean mugging everyone on the road today. People kept cutting me off and tailgating. I hope my face doesn’t stay like this!” “I love it when babies look like they’re mean mugging. Like what could they possibly be so annoyed about? Their expressions are too funny.” “I swear your cat was mean mugging me! He had such an angry facial expression. I think he’s mad because I didn’t give him every single treat in the bag.”"
    },
    {
      "title": "Mean mugging is a combination of the terms “mean” and “mug.”",
      "content": "Mean mugging is a combination of the terms “mean” and “mug.” “Mean” is an adjective that describes someone who’s unkind, rude, or bad-tempered. “Mug” is an old slang term from the 1700s that means “face.” It’s more of a derogatory term, as it usually refers to an unattractive or unpleasant face. [2] X Research source In the 1700s, it was a popular trend to draw or sculpt ugly faces on mugs (the drinking cups). So, people believe that “mug” became slang for “face” due to the fad!"
    },
    {
      "title": "Mean mugging originated in the Black community.",
      "content": "Mean mugging originated in the Black community. Mean mugging comes from AAVE (African American Vernacular English) slang. It was primarily popularized by hip-hop and rap artists in the 1990s and 2000s. For instance, popular artists like 2Pac, The Notorious B.I.G., and Nas mention mean mugging in their songs. [3] X Research source"
    },
    {
      "title": "Giving someone a dirty look",
      "content": "Giving someone a dirty look When you give someone a dirty look, it means you’re looking at them with a mad or irritated facial expression. This usually means that you’re upset, angry, or annoyed at something they did and want them to know. [4] X Research source “Oh, Josie knows I’m mad. I gave her a dirty look after she said that mean comment about Sloane. And, she just texted me to apologize!”"
    },
    {
      "title": "Giving someone the side eye",
      "content": "Giving someone the side eye Side eye is a slang phrase that refers to looking at someone from the corner of your eye. This sidelong glance is meant to express disapproval, judgment, suspicion, or disgust about someone’s actions. [5] X Research source “I gave Bryce’s girlfriend the side eye when she said she doesn’t like dogs. Did she forget that Bryce works at an animal rescue and has 2 pups himself, or does she just not care?”"
    },
    {
      "title": "Giving someone the evil eye",
      "content": "Giving someone the evil eye People in many cultures believe in the evil eye , which is a hateful or nasty look that someone gives you which is believed to bring you bad luck. It can also more generally refer to an angry or irritated facial expression that’s meant to express disapproval, frustration, or annoyance. [6] X Research source “The librarian gave me the evil eye for talking. I’ve never seen her look so scary! I think I’m gonna wear an evil eye bracelet from now on to stay protected.”"
    },
    {
      "title": "Resting b*tch face",
      "content": "Resting b*tch face Resting b*tch face , or RBF, is a slang phrase that refers to someone’s resting facial expression that appears annoyed, unhappy, or irritated. People with RBF often feel misunderstood, because even when they’re relaxed or happy, their neutral expression makes them look upset. [7] X Research source “Everyone always asks me if I’m mad at them and when I ask why, they tell me that I look annoyed. Do I have resting b*tch face?”"
    }
  ]
}