{
  "url": "https://www.wikihow.com/Reinstall-Windows-7-Without-CD",
  "title": "How to Reinstall Windows 7 Without CD",
  "steps": [
    {
      "title": "Check your computer's bit number",
      "content": "Check your computer's bit number . When you download a fresh version of Windows 7, you'll need to know whether your computer has a 32-bit processor or a 64-bit processor."
    },
    {
      "title": "Find your Windows 7 product key.",
      "content": "Find your Windows 7 product key. This is the 25-character key that you received with your copy of Windows 7. You can usually find it on the bottom of your computer (laptops only), or inside of the Windows 7 box. If you registered your copy of Windows 7 online, Microsoft most likely sent to your registered email address a confirmation email with your product key. If you can't find a hard copy of your product key, you can check it on your computer using Command Prompt or software."
    },
    {
      "title": "Select an installation method.",
      "content": "Select an installation method. You can use either a blank USB flash drive or a blank DVD to create your installation tool. Keep in mind that if you choose a flash drive, it must have a capacity of larger than 4 gigabytes. [1] X Research source Before choosing a DVD as your method, make sure that your computer has a DVD drive. You can check this by looking for the DVD logo on or near the disc tray. If you don't have a DVD drive, you won't be able to burn the DVD on your computer."
    },
    {
      "title": "Open Microsoft's Windows 7 download page.",
      "content": "Open Microsoft's Windows 7 download page . This is the official webpage for Windows 7 software downloads."
    },
    {
      "title": "Scroll down and enter your product key.",
      "content": "Scroll down and enter your product key. You'll find the \"Enter your product key\" text field near the bottom of the page; click this field and type in the 25-character product key that you retrieved earlier."
    },
    {
      "title": "Click Verify.",
      "content": "Click Verify . It's a blue button below the product key text field. Doing so will verify your product key and take you to the language selection page."
    },
    {
      "title": "Select a language.",
      "content": "Select a language. Click the Choose one drop-down box and then click your preferred language in the drop-down menu. [2] X Research source"
    },
    {
      "title": "Click Confirm.",
      "content": "Click Confirm . This button is below the language drop-down box."
    },
    {
      "title": "Select a download.",
      "content": "Select a download. Click either 64-bit Download or 32-bit Download in the middle of the page. The download that you choose here should match your computer's bit number. The file will begin downloading. Depending on your browser's settings, you may first have to select a download location or confirm the download."
    },
    {
      "title": "Wait for the file to finish downloading.",
      "content": "Wait for the file to finish downloading. The Windows 7 installation file will download in ISO format. After it finishes downloading, you can usually find it in your computer's Downloads folder."
    },
    {
      "title": "Create your installation tool.",
      "content": "Create your installation tool. Once your installation tool has been created, you can proceed with installing Windows 7. Plug in your USB flash drive or insert your DVD, then do the following: Flash drive - Select the ISO file, press Ctrl + C to copy it, click your flash drive's name in the lower-left side of the window, and press Ctrl + V to paste the file onto your flash drive. DVD - Burn the installation file onto the DVD by finding and selecting the file in Windows Explorer , clicking Burn disc image , and clicking Burn at the bottom of the pop-up window. [3] X Research source You can also burn ISO files on Windows 10 ."
    },
    {
      "title": "Back up your files",
      "content": "Back up your files . Even though most modern operating systems give you the option of keeping your files when installing the operating system, backing up your files is a safety precaution that you shouldn't skip."
    },
    {
      "title": "Make sure that your installation tool is inserted.",
      "content": "Make sure that your installation tool is inserted. Your USB flash drive or burned DVD should be attached to/inserted into your computer."
    },
    {
      "title": "Restart your computer.",
      "content": "Restart your computer. Click Start in the bottom-left corner of the screen, then click the arrow to the right of Shut down and click Restart ."
    },
    {
      "title": "Start pressing your computer's BIOS key.",
      "content": "Start pressing your computer's BIOS key. You'll need to do this as soon as your computer begins to restart. This key is usually the Esc , Delete , or F2 key, though your computer's BIOS key may be different. Don't stop pressing the key until the BIOS is open. If you miss the BIOS activation window, you'll need to restart your computer and try again. For a brief moment, you can usually see the key that you need to use listed at the bottom of the screen in a \"Press X to enter startup\" message. You can check your computer's manual or product page online to confirm the BIOS key."
    },
    {
      "title": "Find the \"Boot Order\" section.",
      "content": "Find the \"Boot Order\" section. Each computer's BIOS varies slightly, but you'll usually see a \"Boot Order\" or \"Boot Options\" tab that you can navigate to using the arrow keys. On some BIOS layouts, you'll find the \"Boot Order\" options in the Advanced Options tab. Some BIOS layouts have the \"Boot Order\" section right on the initial page."
    },
    {
      "title": "Select your installation tool's option.",
      "content": "Select your installation tool's option. Using the arrow keys, select either Removable Storage (or something similarly descriptive of a flash drive) or CD Drive (or something similar). This will depend on whether you used a flash drive or a DVD to create your installation tool."
    },
    {
      "title": "Move the installation tool to the top of the section.",
      "content": "Move the installation tool to the top of the section. Usually, you'll press the + key while the tool's option is selected to do this. With your installation option at the top of the \"Boot Order\" list, your computer will be able to find and recognize the Windows 7 installation file. There's normally a key legend that tells you which keys perform which actions in the lower-right side of the BIOS page."
    },
    {
      "title": "Save and exit the BIOS.",
      "content": "Save and exit the BIOS. Press your BIOS' \"Save and Exit\" key (check the key legend), then wait for the BIOS to close. You may have to confirm this decision by selecting YES and pressing a key."
    },
    {
      "title": "Press any key when prompted.",
      "content": "Press any key when prompted. Doing so will begin the installation process."
    },
    {
      "title": "Check the \"I agree\" box and click Next.",
      "content": "Check the \"I agree\" box and click Next . Checking the box indicates that you agree to Microsoft's current terms of use, while clicking Next in the bottom-right corner of the window takes you to the next page."
    },
    {
      "title": "Delete the current Windows 7 installation.",
      "content": "Delete the current Windows 7 installation. Select the hard drive on which Windows 7 is installed, then click Delete below the storage window."
    },
    {
      "title": "Click Yes when prompted.",
      "content": "Click Yes when prompted. Doing so will completely erase your old copy of Windows 7 from the hard drive."
    },
    {
      "title": "Select an installation location, then click Next.",
      "content": "Select an installation location, then click Next . Click the now-empty hard drive to select it as your installation location."
    },
    {
      "title": "Allow Windows 7 to install.",
      "content": "Allow Windows 7 to install. This may take several minutes to an hour, depending on how fast your computer is. Your computer will restart multiple times during the installation process."
    },
    {
      "title": "Enter your preferred username, then click Next.",
      "content": "Enter your preferred username, then click Next . Type your preferred username into the text field at the top of the window."
    },
    {
      "title": "Create a password, then click Next.",
      "content": "Create a password, then click Next . Fill out the following fields: Type a password (recommended) - Type in your preferred password. Retype your password - Re-type in your preferred password. Type a password hint - Create a password hint (optional)."
    },
    {
      "title": "Click Use recommended settings when prompted.",
      "content": "Click Use recommended settings when prompted. This will allow Windows to set up your security for you."
    },
    {
      "title": "Wait for Windows 7 to finish installing.",
      "content": "Wait for Windows 7 to finish installing. Once Windows 7's installation is complete, you should be on the desktop."
    }
  ]
}