{
  "url": "https://www.wikihow.com/Measure-Force",
  "title": "How to Measure Force",
  "steps": [
    {
      "title": "Understand the relationship between force, mass, and acceleration.",
      "content": "Understand the relationship between force, mass, and acceleration. The force of an object is simply the product of its mass and acceleration. [1] X Research source This relationship can be defined by the following formula: Force = Mass x Acceleration. Here are a few other things to keep in mind as you measure force: [2] X Research source The standard unit for mass is kilograms (kg). The standard unit for acceleration is m/s 2 . The standard unit for force is the newton (N). The newton is a derived standard unit. 1N = 1 kg x 1m/s 2 ."
    },
    {
      "title": "Measure the mass of a given object.",
      "content": "Measure the mass of a given object. An object's mass is the amount of matter that it contains. [3] X Research source The mass of an object never changes, no matter what planet it's on; while weight fluctuates depending on gravitational pull, your mass is the same on Earth and on the Moon. [4] X Research source In the metric system, mass can be expressed in grams or kilograms. Let's say the object we're working with is a truck that has a mass of 1000 kg. To find the mass of a given object, place it on a triple beam or a double pan balance. This will calculate the mass in kilograms or grams. In the English system, mass can be expressed in pounds. Because force can also be expressed in pounds, the term \"pound-mass\" has been coined to distinguish its usage. However, if you find the mass of an object using pounds in the English system, it's best to convert it to the metric system. If you know an object's mass in pounds, simply multiply it by .45 to find the mass in kilograms."
    },
    {
      "title": "Measure the object's acceleration.",
      "content": "Measure the object's acceleration. In physics, acceleration is defined as a change in velocity, which is defined as speed in a given direction, per unit of time. In addition to the common definition of acceleration as speeding up, it also can mean an object is slowing down or changing direction. [5] X Research source Just as velocity can be measured with a speedometer, acceleration is measured with an accelerometer. Let's say the acceleration of the 1000 kg truck we're working with is 3m/s 2 . In the metric system, velocity is expressed in centimeters per second or meters per second, and acceleration is expressed as centimeters per second per second (centimeters per second squared) or meters per second per second (meters per second squared). In the English system, one way to express velocity is as feet per second, so acceleration can be expressed in feet per second squared."
    },
    {
      "title": "Multiply the object's mass by its acceleration.",
      "content": "Multiply the object's mass by its acceleration. This is the force's value. Simply plug in the known numbers into the equation and you will know the force of the object. Remember to state your answer in newtons (Ns). [6] X Research source Force = Mass x Acceleration Force = 1000 kg x 3m/s 2 Force = 3000N"
    },
    {
      "title": "Find mass if you know force and acceleration.",
      "content": "Find mass if you know force and acceleration. If you know the force and acceleration of an object, simply plug them into the same formula to find the object's mass. Here's how to do it: [7] X Research source Force = Mass x Acceleration 3N = Mass x 3m/s 2 Mass = 3N/3m/s 2 Mass = 1 kg"
    },
    {
      "title": "Find acceleration if you know force and mass.",
      "content": "Find acceleration if you know force and mass. If you know the force and mass of an object, simply plug them into the same formula to find the object's mass. Here's how to do it: [8] X Research source Force = Mass x Acceleration 10N = 2 kg x Acceleration Acceleration = 10N/2kg Acceleration = 5m/s 2"
    },
    {
      "title": "Find the acceleration of an object.",
      "content": "Find the acceleration of an object. If you want to find the force of an object, you can calculate its acceleration as long as you know its mass. All you have to do is use the formula for finding the acceleration of an object. The formula is (Acceleration = Final Velocity - Initial Velocity)/Time . [9] X Research source Example: A runner reaches a speed of 6 m/s in 10 seconds. What is his acceleration? The final velocity is 6 m/s. The original velocity is 0 m/s. The time is 10s. Acceleration = (6 m/s - 0 m/s)/10s = 6/10s = .6m/s 2"
    }
  ]
}