{
  "url": "https://www.wikihow.com/Put-an-eBook-on-an-iPad",
  "title": "How to Put an eBook on an iPad",
  "steps": [
    {
      "title": "Open Apple Books.",
      "content": "Open Apple Books. It has an orange icon with an image that resembles a book. Tap the icon to open Apple Books."
    },
    {
      "title": "Tap Search .",
      "content": "Tap Search . It's the tab in the lower-right corner. It has an icon that resembles a magnifying glass. This allows you to search for books by name. Alternatively, you can tap Book Store to browse books."
    },
    {
      "title": "Enter the name of a book or an author in the search bar and tap Search.",
      "content": "Enter the name of a book or an author in the search bar and tap Search . The search button is on the keyboard on the right. This displays a list of books that match your search criteria."
    },
    {
      "title": "Tap a book you want to purchase.",
      "content": "Tap a book you want to purchase. This displays the book's information page."
    },
    {
      "title": "Tap Buy.",
      "content": "Tap Buy . It has the price next to it. This displays the App Store checkout pop-up."
    },
    {
      "title": "Enter your password, Face ID, or Touch ID.",
      "content": "Enter your password, Face ID, or Touch ID. If you have Face ID enabled, hold the iPad up so the camera can view your eyes. If you have Touch ID enabled, place your finger over the Home button. If prompted to enter your password, enter your password to authenticate your account. This completes your purchase and downloads the book to your iPad."
    },
    {
      "title": "Tap the Library tab.",
      "content": "Tap the Library tab. This is where you can access the books you have purchased and downloaded. If you purchased an audiobook, tap the Audiobook tab instead."
    },
    {
      "title": "Tap a book.",
      "content": "Tap a book. This opens the book. You can turn the pages by swiping left and right. To return to the Library, tap the center of the book. Then tap the back arrow in the upper-left corner. Apple Books also supports other eBook formats such as PDF and EPUB files that do not have a DRM lock on them. You can transfer these files to your iPad by sending them via email or uploading them to iCloud and retrieving them from your iCloud account. Apple Books does not support Kindle file formats, such as \".mobi\", \".azw\", or \".azw3\" formats. However, you can read Kindle file formats using the Kindle app. [1] X Research source"
    },
    {
      "title": "Download and install Kindle.",
      "content": "Download and install Kindle. If you have an Amazon account, you can purchase and download eBooks from the Amazon website and read them in the Kindle app. Use the following steps to download and install Kindle: Open the App Store. Tap the Search tab. Type \"Kindle\" in the search bar. Tao Search on the keyboard. Tap GET next to Kindle."
    },
    {
      "title": "Go to https://www.amazon.com/ in a web browser.",
      "content": "Go to https://www.amazon.com/ in a web browser. Before you can access eBooks from the Kindle app, you need to purchase them from the Amazon website. You cannot purchase eBooks from within the Kindle app. Visit Amazon.com from any web browser on your iPad, or another device. If you are not logged into Amazon on the web browser, tap Hello, sign in in the upper-right corner and sign in with the email address and password associated with your Amazon account. Then tap Sign In ."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . It's in the upper-right corner of the Amazon home page. This displays the menu."
    },
    {
      "title": "Tap Kindle E-readers & Books.",
      "content": "Tap Kindle E-readers & Books . It's below the \"Digital Content & Devices\" header in the menu."
    },
    {
      "title": "Tap Kindle Books.",
      "content": "Tap Kindle Books . It's below the header that says \"Kindle Store\" in the menu to the left."
    },
    {
      "title": "Type in the title or author of your book in the search bar and tap .",
      "content": "Type in the title or author of your book in the search bar and tap . The search bar is at the top of the page. This displays a list of books that match your search criteria."
    },
    {
      "title": "Tap a book you want to buy.",
      "content": "Tap a book you want to buy. This displays the information page for the book."
    },
    {
      "title": "Tap Buy now with 1-click.",
      "content": "Tap Buy now with 1-click . It's the orange button to the left. This will purchase the book with the credit card you have on file. The book will be automatically delivered to your Kindle library. Alternatively, tap the drop-down menu below the \"Buy now with 1-click\" to select which device to deliver the book to."
    },
    {
      "title": "Open the Kindle app on your iPad.",
      "content": "Open the Kindle app on your iPad. It has a blue icon with the silhouette of a person reading a book. Tap the Kindle icon to open Kindle."
    },
    {
      "title": "Tap Library.",
      "content": "Tap Library . It's the second tab with an icon that resembles a book at the bottom of the Kindle app. This displays a list of books in your library."
    },
    {
      "title": "Tap a book you want to read.",
      "content": "Tap a book you want to read. If the book has not been downloaded to your iPad, it will start downloading. Tap it again to open it again once it finishes downloading to read the book. Swipe left and right to turn the pages. To return to your library, tap the center of the book. Then tap the back arrow in the upper-right corner. You can transfer Kindle eBook file formats (i.g, \".mobi\", \".awz\", \".awz3\") to your iPad using email or by uploading them to iCloud. The Kindle app does not support EPUB format."
    },
    {
      "title": "Go to a PDF book website in a web browser.",
      "content": "Go to a PDF book website in a web browser. There are lots of websites that allow you to read classic public-domain books for free from your web browser. You can view these sites in Google Chrome or any other web browser. Some PDF book sites include the following: [2] X Research source https://manybooks.net/ https://www.free-ebooks.net/ https://archive.org/details/books https://bookboon.com/en"
    },
    {
      "title": "Enter the name or title of a book in the search bar.",
      "content": "Enter the name or title of a book in the search bar. This displays a list of books that match your search criteria. Alternatively, many websites allow you to browse books on their web page."
    },
    {
      "title": "Tap the option to download the book or read it online.",
      "content": "Tap the option to download the book or read it online. If you download a PDF, you can find it in your Files app. It has an icon that resembles a blue folder. If you read it online, you can tap the arrow icon to the left and right side of the book to turn the pages as you read in your web browser. Some websites may require you to register an account with the website before you can download or read the book online."
    }
  ]
}