{
  "url": "https://www.wikihow.com/Save-an-Active-Drowning-Victim",
  "title": "How to Identify & Rescue Someone Drowning",
  "steps": [
    {
      "title": "Practice scanning and observing the water.",
      "content": "Practice scanning and observing the water. When you are near water, it is smart to get in the habit of surveying your surroundings. The first step in helping a drowning victim is being able to spot someone in trouble. Lifeguards call surveillance of the area \"scanning and observing\". [1] X Research source To scan and observe, you should spend a few seconds every couple of minutes looking around your area. Look at the water, and also look at the pool deck or beach. Keep your eyes out for people in distress, or in potentially risky situations. For example, if there is someone swimming far from shore in choppy waters, you'll want to keep a close watch on them. Keep your eye out for the elderly and young swimmers. This is especially important if there are children with you, or others who are not strong swimmers."
    },
    {
      "title": "Recognize the physical signs of drowning.",
      "content": "Recognize the physical signs of drowning. Active drowning means that the person is in the process of drowning. They will be impaired due to inhalation of water. There are several things to look for to determine whether someone is actively drowning, including: [2] X Research source Active drowning can begin within 20 seconds of the person being in distress. An active drowning victim will not be able to call for help. While an active drowning victim might still be vertical in the water, they will be unable to move towards help or safety. Active drowning victims will not be able to wave for assistance or reach for equipment. Once drowning has begun, the victim cannot voluntarily control his arm movements. Active drowning victims typically struggle on the surface for 20-60 seconds before being submerged. Active drowning victims will have their heads tilted back so their mouth and nose is above water, this is an instinct."
    },
    {
      "title": "Keep an eye out for other problems.",
      "content": "Keep an eye out for other problems. There are many other types of problems that can occur in swimmers. Make sure you are aware of different signs so that you can accurately assess the situation. For example, a distressed swimmer is a person who may have become tired or suffered a cramp. They may call out for help and may appear to be flailing. [3] X Research source A passive drowning victim is someone who is unconscious in the water. Assume the person needs medical attention and call for help. A tired swimmer might be using short, weak strokes and appear to be looking for something to cling to. They might call for assistance."
    },
    {
      "title": "Shout for help along the shore.",
      "content": "Shout for help along the shore. If you do decide to get into the water and help the victim, let someone know before you go in. You can either tell a fellow lifeguard or swimmers nearby so they can keep an eye out for the both of you. [4] X Research source Bystanders may also be able to help with the rescue if you’re struggling. If the drowning victim is unconscious, have someone call for emergency services right away."
    },
    {
      "title": "Prepare to reach the victim.",
      "content": "Prepare to reach the victim. Once you have determined that you are looking at an active drowning victim, get ready to reach the person. Based on your scanning and observing, you should be able to tell whether you need to go in the water or whether you can offer assistance from land. Take any tools you need, such as a flotation device, life vest, or pole. [5] X Research source Do not attempt a rescue unless you are a strong swimmer and know what you are doing. If you are a weak swimmer, you can put both yourself and the drowning victim in danger. The assistance of a flotation device even if you are a strong swimmer is important. Most professional lifeguards carry some sort of flotation device."
    },
    {
      "title": "Bring a safety tool along with you.",
      "content": "Bring a safety tool along with you. Before you attempt a rescue, you need to make sure that you are not putting yourself in danger. It is a good idea to remember a phrase used by lifeguards: \"Reach, Throw, Row, Go with Support\". This means that you should always utilize safety tools to aid in the rescue. [6] X Research source Make sure to always take a flotation device with you. You will need it in case you encounter problems, or you become tired. You may also need it to support the victim. If possible, use a rescue tube. These devices are the easiest to utilize while performing a rescue."
    },
    {
      "title": "Reach the person from land if you can.",
      "content": "Reach the person from land if you can. If the drowning victim is nearby, you may be able to use equipment to reach them. For example, almost all swimming pools have a tool called a shepherd's crook hanging on a wall or fence. The shepherd's crook is a long, thin pole that has a loop at one end. If you have experience using this tool, it is possible that you can extend the pole and aim the loop so it surrounds the victim. You can then pull the victim to shore. Do not attempt to loop the victim if you are unfamiliar with this process. You might inadvertently cause more panic."
    },
    {
      "title": "Perform a rear approach rescue if you need to swim.",
      "content": "Perform a rear approach rescue if you need to swim. If possible, you should always approach an active drowning victim from behind. You may need to swim underwater and come up behind the victim to make this happen. As you perform the rescue, you want the victim to keep the shore in sight. For this reason, it's better to approach from the rear and propel them with you towards the shore. [7] X Research source Victims often begin to panic even more if they are turned away from the shore, which can cause them to drown faster. Remember that the victim cannot control their arm movements. Therefore, do not waste time saying things such as \"grab on\"."
    },
    {
      "title": "Support the victim with your flotation device.",
      "content": "Support the victim with your flotation device. This will make it easier for you to safely swim to shore. Place the victim on the rescue tube or other flotation device, and ask the victim to help you kick if you need it. [8] X Research source To do this, approach the victim from behind and put your arms under their armpits, grab their shoulders and flip them on to you keeping your head to the side and out of harm’s way. Your rescue tube should be under your arms and between you and the victim. Try to calm them by telling them who you are, and that you are here to help. Before you find yourself in an emergency situation, it is a good idea to practice this movement. In the safety of a pool, ask a friend or family member to volunteer to be your practice buddy. Practice swimming from behind and firmly lifting the \"victim\" onto the tube."
    },
    {
      "title": "Tow the victim to shore.",
      "content": "Tow the victim to shore. Once the victim is on the device, you need to get them back to land. Wrap your arm around their waist and begin to swim to shore using a sidestroke. [9] X Research source As you tow your victim, make sure you keep an eye on them. You want to make sure they remain safely on the flotation device. If necessary, pause to reposition them so they are stable. If the flotation device is easy to grasp, you can pull the victim to shore by holding onto the device and towing that while you swim."
    },
    {
      "title": "Care for the victim once they’re safe.",
      "content": "Care for the victim once they’re safe. Once you have reached shore, you need to continue to help the victim. If you have not already, call for medical help. It is very likely that the victim will still be having difficulty breathing, due to the water inhalation. Be sure to use ABC to check the person's airway, breathing, and circulation . First, check their airway by looking into their mouth and throat to see if you see anything lodged in it. Then, check to see if they are breathing and check for a pulse. [10] X Research source Place your ear next to the victim’s mouth to listen for breathing. You can also look at their chest to see if it is rising and falling due to breathing. If you cannot see or hear breathing, check their pulse. Place your two first fingers on the wrist or neck and hold them there for 10 seconds. If you cannot detect a pulse, begin CPR . Place the heel of your hand in the center of their chest, in line with the nipples. Make sure not to press on the ribs. Begin chest compression by pressing down at the rate of at least 100 pulses per minute. Complete 30 compressions, make sure the chest is going all the way down and coming back up. There is a high chance of breaking their ribs, so be prepared for that. Check for breathing. If they are not breathing, start CPR again. It is very important to take CPR classes through your local Red Cross so that you can practice this technique."
    },
    {
      "title": "Strengthen your swimming skills.",
      "content": "Strengthen your swimming skills. It is important to remember that only extremely competent swimmers should attempt rescues. If you do not know what you are doing, it is possible you could make the situation worse, despite your best intentions. If you are going to be near water, or plan to be, it's a great idea to take an advanced swimming course. Check with sources such as your local YMCA for options. Before you find yourself in this situation, make sure that you are aware of your own swimming skills. Don't attempt a rescue if you cannot easily swim 50 yards doing a breaststroke or front crawl. You must be a strong swimmer and confident in your swimming skills. Make sure that you are capable of treading water for at least 2 minutes without struggling. Some protocols state that you should be able to tread 2 minutes in the water with a 10 lb weight. If you cannot do this, it is unlikely you are a strong enough swimmer to conduct a successful rescue."
    },
    {
      "title": "Practice caution.",
      "content": "Practice caution. Accidents happen, and it is certainly not possible to ensure that drowning incidents don't occur. However, there are many steps you can take to reduce the likelihood. By practicing caution and observing general safety rules, you can help keep those around you safe. For example, make sure that when you are near water that you have a flotation device with you. [11] X Research source If possible, take a cell phone with you to the pool or beach so that you can call for help if necessary. Immediately after assessment point to someone and tell them to call EMS immediately. Make sure that people who aren't strong swimmers have a life vest to wear. Be aware of your surroundings. Even if you do not plan to swim, know that accidents can happen even when you are on the shoreline or by the side of a pool. Watch for people falling in the water accidentally."
    },
    {
      "title": "Swim in designated areas.",
      "content": "Swim in designated areas. It is always best to swim with a lifeguard on duty. This is important for everyone, even strong swimmers. If you are going to be swimming in a pool, look for one with a regular lifeguard. You can also find beaches that employ lifeguards. Do not go in natural bodies of water if the conditions are unfavorable. For example, do not go in a lake if it is especially windy and the waves are strong. You should avoid going in the ocean when the tides are aggressive. Many beaches post signs or flags advising you of conditions. Do not swim if a warning is posted."
    },
    {
      "title": "Teach children the rules.",
      "content": "Teach children the rules. While anyone can drown, children are especially susceptible. If you have kids, make sure that you teach them to act responsibly around water. Have a set of rules for family swim excursions, and make sure that your children understand them. Supervise children at all times when they're around water. [12] X Expert Source Brad Hurvitz Certified Swimming Instructor Expert Interview. 13 February 2020. For example, you could implement the buddy system. Make sure that your child knows that they are never allowed to swim alone or without supervision. If you are going out on a boat, take life vests that are child-sized. Children can learn to swim as early as 1 year old. It's an excellent idea to begin swim lessons early. [13] X Expert Source Brad Hurvitz Certified Swimming Instructor Expert Interview. 13 February 2020."
    }
  ]
}