{
  "url": "https://www.wikihow.com/Perform-a-Carotid-Massage",
  "title": "How to Perform a Carotid Massage",
  "steps": [
    {
      "title": "Ask the patient to lie on their back.",
      "content": "Ask the patient to lie on their back. For safety purposes, a CSM should be performed first supine (flat on the back) and then sitting up with at least 5 minutes of rest in between. After performing the maneuver in both of these positions the patient should be observed for 10 minutes while in a supine position. [3] X Research source If you’re in a medical office, you can ask the patient to lie on an examination bed. If you’re performing the CSM at someone’s home, ask the patient to lie on a couch or bed. It’s important that the patient be lying down, in case they experience any lightheadedness or loss of consciousness from the CSM."
    },
    {
      "title": "Place an electrocardiograph (ECG) on the patient.",
      "content": "Place an electrocardiograph (ECG) on the patient. This medical tool will monitor the electrical activity of the patient’s heart while the CSM is administered. Since the CSM is primarily a diagnostic measure, [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source the ECG is valuable in monitoring the heart during the procedure. If the ECG indicates asystole (heart stops beating) for more than 3 seconds the CSM should be discontinued immediately. An ECG may also help with the diagnosis of carotid sinus syndrome. [5] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Even if you’re performing a CSM to reduce a patient’s excessively rapid heartbeat (supraventricular tachycardia, or SVT), you should still monitor the heart’s electrical activity via ECG. Use an ECG every time a CSM is performed. [6] X Research source"
    },
    {
      "title": "Monitor the patient’s blood pressure before, during and after the procedure using a continuous blood pressure and heart rate monitor.",
      "content": "Monitor the patient’s blood pressure before, during and after the procedure using a continuous blood pressure and heart rate monitor. This data may give information on the cause of any rhythm abnormalities. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Monitoring blood pressure is also done for safety reasons. Once the patient has lain down, and you have applied the ECG and began monitoring blood pressure, wait five minutes before beginning the procedure. This will allow the patient’s heart to slow to a resting rate so you can get an accurate baseline measurement of blood pressure and heart rate."
    },
    {
      "title": "Find the carotid sinus massage point.",
      "content": "Find the carotid sinus massage point. There are two carotid sinuses, and you’ll need to perform a CSM on each. The carotid sinus is located in the patient’s neck. Find the front mid-point of the patient’s neck (near their Adam’s apple), and identify the angle of the patient’s jaw. Then trace your finger around the side of the patient’s neck, until it’s directly below the angle of their jaw. Your finger should be resting on the patient’s carotid sinus. [8] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source The angle of the jaw should be the location at which their jawbone bends, about 4 inches (10 centimeters) back from the tip of their chin. The second carotid sinus will be located in the identical position on the other side of the patient’s neck."
    },
    {
      "title": "Massage the right carotid sinus for 5–10 seconds.",
      "content": "Massage the right carotid sinus for 5–10 seconds. A CSM is usually first performed on the right side of a patient’s neck. Press firmly on the patient’s carotid sinus massage point. Using a circular motion, rub and massage the carotid sinus for a period of 5–10 seconds. [9] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Avoid pressing too hard, or you may risk reducing the flow of oxygen to the patient’s brain. As a rule of thumb, use the amount of pressure that you would need to indent the surface of a tennis ball."
    },
    {
      "title": "Massage the patient’s left carotid sinus.",
      "content": "Massage the patient’s left carotid sinus. After performing the carotid massage on the right side of a patient’s neck, repeat the massage on the patient’s left carotid sinus. Massage in a circular motion for 5–10 seconds. [10] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source"
    },
    {
      "title": "Direct the patient to lay still for 10 minutes.",
      "content": "Direct the patient to lay still for 10 minutes. Following the completion of the CSM, the patient may experience some lightheadedness or may feel mildly dizzy. Ask them to continue lying supine for another 10 minutes. This will allow their heart rate to return to regular (if it was abnormally high to begin with) and will allow a healthy level of oxygen to return to their brain."
    },
    {
      "title": "Stop performing a CSM if the ECG shows asystole.",
      "content": "Stop performing a CSM if the ECG shows asystole. Asystole is a serious form of cardiac arrest which may be caused by the CSM. If the ECG monitor shows an absence of electrical activity and ventricular contraction for over 3 seconds, stop performing the maneuver immediately. [11] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source If the patient’s cardiac arrest continues once you’ve stopped administering the CSM, you may need to begin performing live-saving measures, such as a precordial thump (chest blow). [12] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Do not defibrillate unless the ECG shows a shockable rhythm such as ventricular fibrillation or ventricular tachycardia. Asystole is not a shockable rhythm."
    },
    {
      "title": "Stop the CSM if the patient faints.",
      "content": "Stop the CSM if the patient faints. If the patient loses consciousness in any way while you’re performing a CSM—even if it’s only for a brief period—stop administering the massage. You or a medical assistant should record that the patient experienced syncope (loss of consciousness) or pre-syncope (dizziness or lightheadedness immediately preceding unconsciousness). [13] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source If you’re performing the CSM for diagnostic purposes, ask the patient if the lightheadedness or fainting that they just experienced is similar to other symptoms they commonly experience."
    },
    {
      "title": "Stop performing the CSM if any neurological complications, such as a stroke, occurs.",
      "content": "Stop performing the CSM if any neurological complications, such as a stroke, occurs. In the case of a stroke, aspirin should be given (if not contraindicated) and the patient should be closely observed. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Do not administer CSM to patients with carotid sinus hypersensitivity.",
      "content": "Do not administer CSM to patients with carotid sinus hypersensitivity. Patients with carotid sinus hypersensitivity, or CSH, are acutely sensitive to pressure on their carotid sinus. This condition most commonly afflicts men older than 50, although women over 50 can experience CSH as well. Administering a CSM to a patient with CSH can lead to cardiac arrest or other serious heart and blood-pressure conditions. [15] X Research source Ask your patient if a physician has diagnosed them with CSH, or if they have ever had a negative reaction to—or lost consciousness during—a carotid sinus massage."
    },
    {
      "title": "In addition, do not perform CSM on patients that have any of the following conditions:",
      "content": "In addition, do not perform CSM on patients that have any of the following conditions: [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Myocardial Infarction Transient Ischemic Attack within the past 3 months Cerebrovascular Accident within the past 3 months History of Ventricular Fibrillation History of Ventricular Tachycardia Carotid Artery Occlusion Previous adverse reaction to CSM If a patient has a carotid bruit, a carotid ultrasound should be done first to check for stenosis."
    }
  ]
}