{
  "url": "https://www.wikihow.com/Overcome-Psychological-ED",
  "title": "4 Effective Ways to Overcome Psychological ED (Erectile Dysfunction)",
  "steps": [
    {
      "title": "Get a medical diagnosis from your doctor.",
      "content": "Get a medical diagnosis from your doctor. It’s rare for ED to be 100% physical or 100% psychological in nature. To determine the range of contributing causes in your case, it’s important to see your doctor for a proper medical diagnosis. That way, you can develop a treatment program that’s suited specifically for your needs. [1] X Expert Source Michael Dickerson, PsyD Licensed Clinical Psychologist Expert Interview. 3 August 2021. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Physical causes of ED are often related to reduced blood flow, which can be tied to a range of cardiovascular issues. In some cases, medication interactions, injuries, and obstructions (such as tumors) can also be factors. You may feel embarrassed to bring up the issue with your doctor, but remember that ED is a very common condition, not just for men over 40 but for younger men as well. ED isn’t abnormal and it isn’t inevitable—it’s a common and treatable condition. Be direct in discussing the issue: “Over the past couple of months, I’ve been having a lot of trouble maintaining erections during sexual encounters, even though I feel the same amount of arousal as before.”"
    },
    {
      "title": "Utilize medical treatments for physical ED factors, if needed.",
      "content": "Utilize medical treatments for physical ED factors, if needed. In the event that your ED is entirely psychological in nature, you should focus primarily on psychological treatments. However, if there’s a physical aspect as well, it’s important that you utilize medical as well as mental health treatments. Discuss your best treatment options with your doctor. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source There are a wide range of medical interventions that can improve your ability to physically achieve and maintain an erection. These include pills, injections, manual devices, and implants, among others. Taking a pill may (or may not) enable you to get an erection if your ED is psychological in nature. It won’t do anything, however, to address the psychological issues that are causing your ED in the first place. You’ll simply be masking a deeper problem."
    },
    {
      "title": "Attend therapy to address your mental health concerns.",
      "content": "Attend therapy to address your mental health concerns. If your doctor doesn’t find any significant physical causes for your ED, then it’s safe to assume that your condition is primarily psychological in nature. [4] X Expert Source Michael Dickerson, PsyD Licensed Clinical Psychologist Expert Interview. 3 August 2021. In this case, it’s important that you identify and address your specific psychological factors. Working with a licensed therapist is a critical part of this process. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Depending on your condition, your therapist may help you develop strategies for managing anxiety and reducing stress that aren’t directly related to sex. They might also utilize cognitive behavioral sexual therapy (CBST), which is a variation on CBT that can help you develop new thoughts and behaviors related to sexual activity."
    },
    {
      "title": "Reduce excessive stress with calming techniques that work for you.",
      "content": "Reduce excessive stress with calming techniques that work for you. Sources of stress in your daily life, even when they have nothing to do with your bedroom activities, can contribute to ED. Excessive stress can make it tough to relax, which is a key component of a healthy erection, and can make it physically more difficult to become erect by increasing your blood pressure. [6] X Expert Source Michael Dickerson, PsyD Licensed Clinical Psychologist Expert Interview. 3 August 2021. [7] X Research source The key to relieving excess stress is finding calming techniques that work for you. Try activities like yoga, meditation, deep breathing, light exercise, talking to loved ones, listening to soothing music, reading a good book, or other healthy activities. Doing some deep breathing exercises before a sexual encounter, for instance, may provide the calming effect you need. Work with a professional therapist if you need help dealing with stress."
    },
    {
      "title": "Address general anxiety with therapy, self-care, and possibly medication.",
      "content": "Address general anxiety with therapy, self-care, and possibly medication. As with stress, your anxiety doesn’t have to be related to your sex life in order to contribute to ED. Especially if you’re feeling crippled (sexually and otherwise) by your anxieties, seek the assistance of an experienced therapist. [8] X Expert Source Michael Dickerson, PsyD Licensed Clinical Psychologist Expert Interview. 3 August 2021. [9] X Research source Your therapist may use strategies such as cognitive behavioral therapy (CBT) to help you recognize and overcome your anxieties. Your doctor may in some cases recommend medication to help you manage anxiety. However, some anxiety medications can contribute to ED, so you may want to exhaust your alternatives first."
    },
    {
      "title": "Deal with sexual performance anxiety with an open mind.",
      "content": "Deal with sexual performance anxiety with an open mind. Being anxious about your sexual performance can make it more difficult to sexually perform (including by contributing to ED), so it’s important to use a range of strategies to break this cycle. First and foremost, be open and honest with your partner about your anxieties—simply talking about it may provide the calming effect you need. [10] X Research source In some cases, changing up your sexual routines may be helpful. Or, taking a break from sexual activity for a while might benefit you. Talk to a therapist to get specific advice that may help you."
    },
    {
      "title": "Manage low self-esteem with introspection and communication.",
      "content": "Manage low self-esteem with introspection and communication. Feeling confident and comfortable in your own skin makes it easier to perform sexually. If low self-esteem is contributing to your ED, try a range of strategies—including, perhaps, professional therapy—to overcome it. [11] X Research source Take time each day to think deliberately about your life and your accomplishments. You may even want to write down a list of your achievements each day. Look for opportunities to help others, such as by volunteering. Talk to your partner about your feelings, and don’t be afraid to contact a therapist for assistance."
    },
    {
      "title": "Speak, listen, and work together to address relationship troubles.",
      "content": "Speak, listen, and work together to address relationship troubles . Experiencing difficulties in any aspect of your relationship can lead to performance issues in the bedroom. In many cases, poor communication is the root cause of relationship troubles. Focus on improving your communication with your partner as the first step toward moving past your troubles. [12] X Research source Choose times when you’re both calm and focused in order to talk openly and honestly about your feelings. Use “I” statements, focusing on how you’re feeling, rather than using accusatory “you” statements. Give your partner an equal opportunity to speak, and listen carefully to them. Contact a couples therapist for additional assistance."
    },
    {
      "title": "Treat depression with professional help.",
      "content": "Treat depression with professional help. Depression is a common mental health condition, and it is often a contributing factor to psychological ED. If you have “the blues” or simply don’t feel like yourself, don’t ignore the issue—see your doctor and get a referral for therapy with an experienced mental health professional. [13] X Research source Your therapist may use CBT or other therapy techniques to help you recognize and better manage your feelings. As with anxiety medications, some antidepressants can contribute to ED. Work closely with your doctor to determine your medication needs and options."
    },
    {
      "title": "Talk honestly (while clothed) with your partner about ED.",
      "content": "Talk honestly (while clothed) with your partner about ED. ED is a difficult condition to hide from a partner anyway, so you might as well be open and honest about what you’re experiencing. Instead of trying to talk about it during or after a frustrating sexual encounter, wait for a time when you’re both calm, clothed, and ready to talk. [14] X Research source Be straightforward: “I think I may be experiencing ED, and that it may be related to all the stress in my life right now. I’m going to make an appointment with my doctor.” If your partner judges or criticizes you for your inability to perform sexually up to their expectations, rather than being supportive, you may want to reconsider their suitability as a partner. Don’t let them blame themselves—for instance, by saying they must not be “exciting” or “sexy” enough for you: “This has nothing to do with you—I’m still very aroused when we’re together. It’s a treatable condition that I need to discuss with my doctor.”"
    },
    {
      "title": "Make time to be intimate more often and in different ways.",
      "content": "Make time to be intimate more often and in different ways. Having ED—whether physical, psychological, or both—does not mean your sex life has to be put on hold. In fact, you can use it as an opportunity to add more frequency and variety to your intimacy. Try things like holding hands, cuddling, nuzzling, kissing, giving sensual massages, or engaging in sexual activities that don’t involve your penis. [15] X Research source Increasing the frequency and variety of your intimacy can help you to overcome the psychological barriers that may be contributing to your ED. You may feel more confident, comfortable, and relaxed with your partner in intimate situations, instead of feeling an overwhelming pressure to perform in a particular manner. Take the opportunity to find new ways to pleasure your partner—they won’t complain! Reader Poll: We asked 700 wikiHow readers if they think kissing and cuddling make sex better, and 50% of them said yes. [Take Poll]"
    },
    {
      "title": "Slow down your episodes of sexual intimacy.",
      "content": "Slow down your episodes of sexual intimacy. Your process of achieving an erection is likely to change over time, and anxiety over this may contribute to your psychological ED. Especially as you reach age 40 and beyond, you may find that it takes more time, stimulation, and arousal for you to achieve an erection. In this case, make sure you’re not trying to rush things—take your time during your intimate encounters with your partner. [16] X Research source Add more emphasis on foreplay and treat your intimate encounters as times to be savored, not rushed through. For instance, plan for a solid hour of intimacy rather than a “quickie.” If you have kids who tend to barge into your room at night, tell them you need some private time and lock the door. Or, even better, send them to spend the night at your in-laws’ house!"
    },
    {
      "title": "Attend sex therapy sessions together, if possible.",
      "content": "Attend sex therapy sessions together, if possible. ED can be caused by relationship issues, it can cause relationship issues, or it can do both. Managing psychological ED in particular will be much easier if you have a supportive partner who sees it as something to be addressed together. One good way to work together is to attend sex therapy sessions with a licensed mental health professional. [17] X Research source Use sex therapy as an opportunity to talk openly and honestly about your intimate lives together. You may uncover both sources of your psychological ED and solutions for it. If your partner is unwilling to attend sessions, it will still benefit you to see a therapist on your own."
    },
    {
      "title": "Get cardiovascular benefits from diet, exercise, and smoking cessation.",
      "content": "Get cardiovascular benefits from diet , exercise , and smoking cessation . Even if your ED is primarily psychological in nature, you’ll benefit from taking steps to improve your physical ability to achieve and maintain erections. Eating a healthy diet, getting regular exercise, and quitting smoking can also help relieve stress, reduce anxiety, and improve your mental wellbeing, any of which may be contributing to your ED . [18] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Eat more fruits and vegetables, whole grains, lean proteins, and healthy fats, and fewer packaged and processed foods, high-sodium foods, unhealthy fats, and sugary drinks. Aim for 150 minutes of moderate-intensity cardiovascular exercise per week, as well as 2-3 sessions of both strength training and flexibility training per week. Talk to your doctor before starting a new diet or beginning an exercise program, especially if you have existing cardiovascular issues or other health conditions. Discuss your best options for quitting smoking with your doctor."
    },
    {
      "title": "Lose excess weight",
      "content": "Lose excess weight , especially around your waist. Being overweight is a risk factor for cardiovascular issues, which in turn contribute to physical ED. Carrying extra weight around the midsection is particularly problematic because it can further constrict blood flow to your genitals. While losing weight alone won't address psychological ED, it can make getting erections easier and improve your overall mental health. [19] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Work with your doctor to determine if you need to lose weight, what your weight loss goal should be, and how best to achieve it. Choose healthy weight loss options like diet and exercise."
    },
    {
      "title": "Do pelvic floor exercises to improve your ability to maintain an erection.",
      "content": "Do pelvic floor exercises to improve your ability to maintain an erection. Pelvic floor exercises, often called Kegels, are not only useful for women—they can help men better maintain erections. As with diet, exercise, and weight loss, improving your physical ability to get an erection may help make the psychological aspects of your ED more manageable. [20] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Start by stopping your urine stream mid-flow to identify your pelvic floor muscles. Empty your bladder fully before doing the exercises. Contract your pelvic floor muscles for 5 seconds, then release the contraction for 10 seconds. Repeat this process 10 times in total. Work your way up to doing 3-4 sets of these exercises per day, and see if you can increase the contractions to 10 seconds at a time. A man’s pelvic floor muscles help hold blood in his penis during an erection."
    },
    {
      "title": "Employ masturbation and pornography in a more realistic fashion.",
      "content": "Employ masturbation and pornography in a more realistic fashion. If you watch porn that is wildly out of line with your typical sexual experiences, it may desensitize you both physically and mentally and make it difficult to get an erection during “normal” (for you) sexual activity. The same thing can happen if you masturbate forcefully or aggressively in a way that’s out of line with your normal sexual behaviors. [21] X Research source Utilizing pornography and especially masturbation in moderation can in fact help address psychological ED factors. The goal, however, is to recreate more realistic scenarios that approximate your sexual experiences and behaviors with a partner. You may want to view porn and masturbation as ways to train your mind and body (including your penis) to respond in a certain manner during sexual encounters."
    }
  ]
}