{
  "url": "https://www.wikihow.com/Prune-Kiwis",
  "title": "How to Prune Kiwis (& When to Prune Kiwis)",
  "steps": [
    {
      "title": "Prune your young kiwi vine down to 1 or 2 buds.",
      "content": "Prune your young kiwi vine down to 1 or 2 buds. Kiwi buds look like small, fuzzy ovals or bulbs on the new vine. You can pinch them off or use trimming scissors. Because they’re so delicate, they’ll come right off. This trains your kiwi vines in the first year of planting. Keep just 1 or 2 buds so the vines won’t bend, tangle, and twist with other buds, which will prevent kiwis from growing."
    },
    {
      "title": "Remove side shoots as the plant grows so you have 1 main shoot.",
      "content": "Remove side shoots as the plant grows so you have 1 main shoot. After they start growing, kiwi vines will have lots of shoots. Look at all the shoots on your kiwi vine and pick the one that looks the longest and strongest. That main shoot will be your trunk, and it will support the side shoots that grow on the kiwi vine. [1] X Trustworthy Source University of Georgia Cooperative Extension Division of the University of Georgia focused on research and community education Go to source You don’t want to train all of the shoots or they’ll get tangled up in a growing structure, like a T-shaped trellis or vertical wall."
    },
    {
      "title": "Tie the main shoot to a stake to help keep it straight as it grows.",
      "content": "Tie the main shoot to a stake to help keep it straight as it grows. Monitor the kiwi vine to make sure it doesn’t start to wrap around the stake. If it’s not straight, side shoots won’t be able to grow. Loosely wrap string around the stake every 2 weeks for extra support. [2] X Trustworthy Source University of Georgia Cooperative Extension Division of the University of Georgia focused on research and community education Go to source Don’t tightly bundle the string around the trunk, because that puts too much pressure on it."
    },
    {
      "title": "Remove all fragile shoots that grow off the main shoot.",
      "content": "Remove all fragile shoots that grow off the main shoot. Even your main shoot, the trunk, should be pruned or “topped” if it’s twisting or breaking. When an old trunk is cut off, choose the strongest shoot left and train it as your new trunk. Getting rid of all the weakest shoots frees up space so the ones left can grow without tangling. The sturdiest shoots have the best chance of fruiting. [3] X Research source Use sharp hand pruners to trim the shoots you don’t want. Those shoots will still be stronger than kiwi buds, so you can't just pinch them off. Prune an old trunk until it's 2 inches (5.1 cm) below the wires of your T-shaped trellis or vertical wall. Cutting it will help new kiwi buds grow next season."
    },
    {
      "title": "Stop training a trunk when it’s 2–3 inches (5.1–7.6 cm) above any wires.",
      "content": "Stop training a trunk when it’s 2–3 inches (5.1–7.6 cm) above any wires. Once a trunk makes enough straight, upward progress, it will reach above the wires of your T-shaped trellis or vertical wall. When it’s gotten to this point, you’re ready to move on to training side shoots. [4] X Research source If your trunk reaches the wire early in the season, even if it’s your kiwi vine’s first year, you can train your side shoots."
    },
    {
      "title": "Keep 2 side shoots on opposite sides of the kiwi vine.",
      "content": "Keep 2 side shoots on opposite sides of the kiwi vine. These will become your fruiting shoots. By selecting 2 that are far apart, they’ll grow in a “Y” shape and give each other lots of space. In the first season, “head” them back, or prune these side shoots down. Clip the thin ends of the side shoots. Stop when your side shoots are 4 inches (10 cm) in diameter. Train your side shoots along the center wire of your T-shaped trellis or vertical wall. That will give them room to spread out and fruit."
    },
    {
      "title": "Wrap the growing side shoots around wires every 18–24 inches (46–61 cm).",
      "content": "Wrap the growing side shoots around wires every 18–24 inches (46–61 cm). Side shoots start quickly growing out in your kiwi vine’s second season. Hang them over the closest wire of your T-shaped trellis or vertical wall. [5] X Research source As side shoots get longer, wrapping them in 18–24 inches (46–61 cm) intervals keeps them from falling off the wires."
    },
    {
      "title": "Keep and secure the canes that grow between the side shoots.",
      "content": "Keep and secure the canes that grow between the side shoots. Every 8–12 inches (20–30 cm), tie any canes to the outer wires of your T-shaped trellis or vertical wall. [6] X Research source In the summer, remove twisting canes. They might wrap around shoots, preventing them from fruiting. In the dormant season, usually early winter, prune your canes and side shoots down until they’re .25 inches (0.64 cm) or more in diameter. Your first crop of fruit will begin growing on pruned canes and side shoots in their third year. If there are any suckers, which look like small leaves, or any other new growths on your kiwi trunk, remove them. You just want to keep the canes and side shoots."
    },
    {
      "title": "Prune male kiwi vines in late spring.",
      "content": "Prune male kiwi vines in late spring. Male kiwi vines produce flowers that grow into fruit when pollinated. Let most of spring go by before you prune so male kiwi vines can fully flower. After kiwi vines have flowered, trim canes until they’re 5.9–12 inches (15–30 cm) long. Delaying pruning gives male kiwi vines more surface area, or “flowering wood\", to pollinate. If it’s trimmed too soon, the kiwi plant will grow much less fruit because it didn’t have enough flowers to pollinate. Remove dead or diseased wood from male vines in the dormant season. This will also help free up space for new flowers to blossom."
    },
    {
      "title": "Remove 70% of last season’s wood from female kiwi vines in early to mid-winter.",
      "content": "Remove 70% of last season’s wood from female kiwi vines in early to mid-winter. Cut off the majority of the wood toward the top of the vine. It’s probably already fruited. If you see any canes or shoots with small bulbs, keep them. Those are “spurs,” signs of very fruitful wood. [7] X Research source New wood with spurs can usually be found at the base of female kiwi vines. They’re very short and are just starting to grow. Older, longer wood can have spurs, too. Replacement canes that are far away from the rest will be bare because they’ve already been cut once to start new growth. They’ll still fruit next season. Most canes or shoots with heading cuts can be trimmed off. You’ve already pruned them, and they’ve already fruited."
    },
    {
      "title": "Prune overgrown kiwi vines in the dormant season (winter) to control them.",
      "content": "Prune overgrown kiwi vines in the dormant season (winter) to control them. You can cut off side shoots and canes more easily when they’re dry. Use strong electric hedge trimmers if your vigorous kiwi vines are too strong to cut with manual hedge shears. [8] X Research source In the spring, it’s more difficult to prune kiwi vines because they’ve ripened in the sun. The vines will be full of sap, and cutting them off will be challenging since they’ll leak a lot."
    },
    {
      "title": "Trim off extra buds on second-year canes.",
      "content": "Trim off extra buds on second-year canes. Keep second-year canes if they’ve grown 18–48 inches (46–122 cm) past where any fruit grew last year. Cut away all but 2-4 buds on fuzzy kiwi canes and 8-12 buds on hardy kiwi canes. [9] X Research source Make sure all first, second, and third-year canes you keep are spaced out on the wires of your T-shaped trellis or vertical wall. You don’t want them to crowd each other next season."
    },
    {
      "title": "Cut off wood that can damage your female kiwi vine.",
      "content": "Cut off wood that can damage your female kiwi vine. Twisted, tangled, or crossing shoots can prevent your female kiwi vine from fully growing. [10] X Research source After fully pruning your female kiwi vine, you should be left with about 30-40 canes that will fruit next season."
    },
    {
      "title": "Prune shoots off of male kiwi vines right after they flower.",
      "content": "Prune shoots off of male kiwi vines right after they flower. Male kiwi vines are \"vigorous\", meaning they can grow lots of shoots that will crowd your kiwi plant and block new growth. You'll typically prune them in the summer, so you can give male kiwi vines a chance to pollinate kiwifruit. [11] X Research source Make sure to trim away any other flowers closely gathered around your kiwi vine. These flowers compete for the attention of bees. Your kiwi vine's blossoms don't self-pollinate, and they need honey bees to fully grow. [12] X Research source"
    }
  ]
}