{
  "url": "https://www.wikihow.com/Score-a-Game-of-Go",
  "title": "How to Score a Game of Go",
  "steps": [
    {
      "title": "Wait until both players have passed play.",
      "content": "Wait until both players have passed play. A game of Go is not over until both players have passed play or when one player resigns. In Go, you pass play if you have no moves left. Therefore, if both players pass play, then there are no more good moves to be made and the game is over."
    },
    {
      "title": "Look for empty points on the board that your stones surround.",
      "content": "Look for empty points on the board that your stones surround. The intersections or points in Go are worth one point each. Count up the points that you have surrounded with your stones. [1] X Research source If you have an area partially surrounded, then it is considered neutral and it does not count for a point. Write down the total number of points that you have."
    },
    {
      "title": "Count the number of stones you still have on the board.",
      "content": "Count the number of stones you still have on the board. After you have counted your points, you will need to count up your stones. Any stones that are left on the board may be included in this total. Write down this number after you have finished counting up all of your stones. [2] X Research source"
    },
    {
      "title": "Add up your score and determine a winner.",
      "content": "Add up your score and determine a winner. Once you have determined your total number of empty points and your total number of stones, add these two numbers together. Your total number is your final score. Compare your total score to your opponent’s total score to determine the winner. [3] X Research source"
    },
    {
      "title": "Wait until both players have passed play.",
      "content": "Wait until both players have passed play. A game of Go is not over until both players have passed play or when one player resigns. In Go, you pass play if you have no moves left. Therefore, if both players pass play, then there are no more good moves to be made and the game is over."
    },
    {
      "title": "Look for empty points on the board that your stones surround.",
      "content": "Look for empty points on the board that your stones surround. The intersections or points in Go are worth one point each. Count up the points that you have surrounded with your stones. [4] X Research source If you have an area partially surrounded, then it is considered neutral and it does not count for a point. Write down the total number of points that you have."
    },
    {
      "title": "Determine where your stones are in seki and count those stones.",
      "content": "Determine where your stones are in seki and count those stones. [5] X Research source Stones that are in seki are in danger of being captured, but they are nearby an opponent’s stones that are also in danger of being captured. Seki means mutual life. In a seki situation, neither player can move because the player who moves will lose stones. Look for areas on the board where you and your opponent have each other surrounded, but you only have one liberty each. Count the stones within this area and write down this number."
    },
    {
      "title": "Count the number of stones your opponent has captured.",
      "content": "Count the number of stones your opponent has captured. You will need to know the total number of stones your opponent has captured from you to get your score. These are the stones that have been removed from the board and set aside in a captured pile. Count up these stones and write this number down as well. [6] X Research source"
    },
    {
      "title": "Add together the seki stone total and the captured stone total.",
      "content": "Add together the seki stone total and the captured stone total. Once you have determined your seki stone total and your captured stone total, you should add these two numbers together. Write down the total of these two numbers. [7] X Research source"
    },
    {
      "title": "Subtract the seki/captured stone total from the empty points total.",
      "content": "Subtract the seki/captured stone total from the empty points total. The last thing you need to do to get your score is to subtract your seki and captured stone total you’re your empty points total. The equation should look something like this: Empty Points – (seki stones + captured stones) = final score. Complete this equation using your numbers and then write down your answer. [8] X Research source"
    },
    {
      "title": "Compare the numbers to see who won.",
      "content": "Compare the numbers to see who won. After you and your opponent have calculated your scores, you should compare them to see who won the game. The player with the highest score is the winner. If you want to determine the margin of victory, then you can subtract the lower score from the higher score. Doing this just lets you know how many points you or your opponent won by. [9] X Research source"
    }
  ]
}