{
  "url": "https://www.wikihow.com/Print-Web-Pages-with-Chrome",
  "title": "3 Easy Ways to Print Web Pages With Google Chrome",
  "steps": [
    {
      "title": "Click the menu button ⋮in Google Chrome.",
      "content": "Click the menu button ⋮ in Google Chrome. It's the button with three dots in the upper-right corner. This displays the menu."
    },
    {
      "title": "Click Print.",
      "content": "Click Print . It's in the drop-down menu. This opens the Print dialogue box. Alternatively, you can press Ctrl + P (Windows) or Command + P (Mac) to open the print dialogue box."
    },
    {
      "title": "Select a printer.",
      "content": "Select a printer. If you have more than one printer, you can select which printer you want to print from using the drop-down menu next to \"Destination.\" You can also select \"Save as PDF\" to save the print preview as a PDF so that it can be printed later."
    },
    {
      "title": "Select which pages you want to print.",
      "content": "Select which pages you want to print. By default, Google Chrome will print the entire web page, but it may take several pages of print paper. You can see what will be printed on which page in the print preview window. If you only want to print some pages, select Custom in the drop-down menu next to \"Pages.\" Enter a range of pages in the field below the drop-down menu (e.g, 1-3) or enter the page numbers you want to print separated by commas (e.g, 1, 4, 5)."
    },
    {
      "title": "Select how many copies you want to print.",
      "content": "Select how many copies you want to print. By default, Google Chrome will only print 1 copy. If you want to print more than one copy, type the number of copies you want to print in the field next to \"Copies.\""
    },
    {
      "title": "Select the page layout.",
      "content": "Select the page layout. Use the drop-down menu next to \"Layout\" to select the page layout. You can select \"Portrait\" or \"Landscape.\" Portrait prints the pages from top to bottom. Landscape prints the pages from side to side."
    },
    {
      "title": "Select if you want to print in color or black-and-white.",
      "content": "Select if you want to print in color or black-and-white. To print using color ink, use the drop-down menu next to \"Color\" to select Color.\" Select \"Black and White\" to use black ink. Color prints can use up a lot more ink. If you are mostly printing text or images that don't require color, consider printing in black-and-white. Use color only if you need it."
    },
    {
      "title": "Click More Settings (optional).",
      "content": "Click More Settings (optional). If you want to set any additional print settings, you can find them under the More Options menu. This allows you to select your paper size, adjust the size of the print, print multiple pages on one page, turn off footers and headers, and more."
    },
    {
      "title": "Select additional print settings (optional).",
      "content": "Select additional print settings (optional). Use the drop-down menus next to the options below \"More Settings\" to select any additional print settings you want to select. The options below \"More Options\" are as follows: Paper size: This allows you to select the size of the paper your printer is using (e.g. letter, legal, tabloid, etc). Pages per sheet: This allows you to select how many pages you want to print on each sheet of paper. Printing multiple pages on one sheet will reduce the size of the print. Margins: This allows you to adjust the size of the margins in the print. Scale: This allows you to adjust the size of the print. Options: Click the checkboxes to toggle headers and footers on or background images."
    },
    {
      "title": "Click Print.",
      "content": "Click Print . This prints the web page. A pop-up will appear that displays the print progress."
    },
    {
      "title": "Connect your phone to a wireless printer",
      "content": "Connect your phone to a wireless printer . In order to print from a mobile device, your phone needs to be connected to a wireless printer on the same Wi-Fi network. Consult the user's manual or manufacturer's web page for your wireless printer to learn how to connect it to your wireless network."
    },
    {
      "title": "Open Google Chrome and navigate to a web page you want to print.",
      "content": "Open Google Chrome and navigate to a web page you want to print. Tap the Chrome icon on your Home screen or Apps menu to open Chrome on your Android device. It has an icon that resembles a yellow, red, and green wheel with a blue dot in the middle. Then enter the web page you want to print in the search bar at the top."
    },
    {
      "title": "Tap the menu button ⋮.",
      "content": "Tap the menu button ⋮ . It's the icon with three dots in the upper-right corner. This displays the menu."
    },
    {
      "title": "Tap Share .",
      "content": "Tap Share . It's next to an icon that resembles three dots connected by two lines. This opens the Share menu."
    },
    {
      "title": "Tap Print .",
      "content": "Tap Print . It's below an icon that resembles a printer. This opens the print preview page."
    },
    {
      "title": "Select a printer.",
      "content": "Select a printer. If you have more than one printer connected to your wireless network, you can select which printer you want to print from. Tap the drop-down menu at the top of the screen and then tap the printer you want to print from. You can also select \"Save as PDF\" to save the pages to be printed later."
    },
    {
      "title": "Tap to display more print options (optional).",
      "content": "Tap to display more print options (optional). If you want to select more print options, tap the icon that resembles a bracket pointing down. It's at the top of the print preview page."
    },
    {
      "title": "Set additional print settings (optional).",
      "content": "Set additional print settings (optional). To set additional print options, tap the drop-down menu below each option and select the setting you want to use. Additional print options include the following: Copies: This allows you to select how many copies you want to print. Color: This allows you to select if you want to print in color or black-and-white. Double-sided: This allows you to select if you want to print on both sides of the page. Note: This requires a printer that supports double-sided printing. Paper size: This allows you to select the size of the paper your printer is using (e.g. letter, legal, tabloid, etc). Orientation: This allows you to select if you want to print in portrait or landscape. Pages: This allows you to select if you want to print all pages or a range of pages (e.g. 1-3) or individual pages (e.g. 1, 3, 5)."
    },
    {
      "title": "Tap Print .",
      "content": "Tap Print . It's the yellow button that has an icon that resembles a printer. It's in the upper-right corner of the page. This prints the webpage with your settings."
    },
    {
      "title": "Connect your iPhone or iPad to a wireless printer",
      "content": "Connect your iPhone or iPad to a wireless printer . In order to print from a mobile device, your iPhone or iPad needs to be connected to a wireless printer that supports AirPrint on the same Wi-Fi network. Consult the user's manual or manufacturer's web page for your wireless printer to learn how to connect it to your wireless network."
    },
    {
      "title": "Open Google Chrome and navigate to the web page you want to print.",
      "content": "Open Google Chrome and navigate to the web page you want to print. Tap the Chrome icon on your Home screen or Apps menu to open Chrome. It has an icon that resembles a yellow, red, and green wheel with a blue dot in the middle. Then enter the web address for the web page you want to print in the address bar at the top."
    },
    {
      "title": "Tap the Share button .",
      "content": "Tap the Share button . It's the button that resembles a box with an arrow pointing up. It's in the upper-right corner of Google Chrome."
    },
    {
      "title": "Scroll down and tap Print .",
      "content": "Scroll down and tap Print . It's near the bottom of the share menu. It's next to an icon that resembles a printer."
    },
    {
      "title": "Select a printer.",
      "content": "Select a printer. If there is more than one AirPrint capable printer connected to the network, you can select which printer you want to print from. To select a printer, tap Select Printer and then tap the printer you want to use."
    },
    {
      "title": "Select how many copies you want to print.",
      "content": "Select how many copies you want to print. If you want to print more than one copy, tap the plus (+) icon in the Printer Options menu to increase the number of copies you want to print. Tap (-) to decrease the number or copies you want to print."
    },
    {
      "title": "Select a print range.",
      "content": "Select a print range. By default, Google Chrome will print the entire web page. This may take several pages. What will be printed on each page is displayed in the print preview. If you want to print all pages, leave \"Page Range\" set as \"All Pages\". To change the page range, tap All pages and then swipe up on the numbers to indicates the page range you want to print (e.g, 1 to 3)."
    },
    {
      "title": "Tap Print.",
      "content": "Tap Print . It's in the upper-right corner. This prints the page range you selected from the printer you chose."
    }
  ]
}