{
  "url": "https://www.wikihow.com/Monitor-Internet-Speed-over-Time-on-iPhone-or-iPad",
  "title": "How to Monitor Internet Speed Over Time on iPhone or iPad",
  "steps": [
    {
      "title": "Download the Traffic Monitor app to your iPhone or iPad.",
      "content": "Download the Traffic Monitor app to your iPhone or iPad. This is a third-party app you can download from the App Store . It is a useful app that allows you to check your internet speed and shows you your average internet speed over time. The app is listed as \"Traffic Monitor with Widget\" and now includes a helpful widget that works on iOS 14 and later. Alternatively, you can try a different data monitoring app. There's a variety of free and paid options on the App Store with minor differences in user interfaces."
    },
    {
      "title": "Open Traffic Monitor on your iPhone or iPad.",
      "content": "Open Traffic Monitor on your iPhone or iPad. The Traffic Monitor icon looks like a blue square with half a globe, bar charts, and a speed meter in it. You can find it on your home screen or in your app library after your download is finished."
    },
    {
      "title": "Review the terms and tap Accept.",
      "content": "Review the terms and tap Accept . You'll only have to do this the first time you launch the app. You will only have to do this once when you first open the app."
    },
    {
      "title": "Tap the speed meter on your screen.",
      "content": "Tap the speed meter on your screen. This will begin an instant internet speed test on your iPhone or iPad. You will see a message that says the speed test will transfer data, which may incur fees depending on your mobile data plan. If you're okay with this, tap OK , or OK, don't ask again . Otherwise, tap Cancel . If you're asked to use your current location, just tap any of the options you prefer. It won't affect your speed test."
    },
    {
      "title": "Tap Ok in the pop-up.",
      "content": "Tap Ok in the pop-up. This allows Traffic Monitor to find other devices on your network to check local network speeds. Once you select this, your current speeds will appear on the page."
    },
    {
      "title": "Tap the Data Usage tab.",
      "content": "Tap the Data Usage tab. It's the three horizontal bars at the bottom-left corner. This displays your monthly and daily traffic information."
    },
    {
      "title": "Tap the time period you want to view.",
      "content": "Tap the time period you want to view. You can open your daily and monthly internet traffic data logs here. Tapping an option will open the time log for the selected period and display your speeds over the selected time period. You can view the Current Month and Last Month under \"MONTHLY TRAFFIC,\" and Today and Yesterday under \"DAILY TRAFFIC.\" You can view your speed averages for every day in a month or speed logs for every few minutes in a day."
    },
    {
      "title": "Add the widget.",
      "content": "Add the widget. Adding the internet speed widget allows you to view your internet speed by swiping right on your home screen to view your widgets. Use the following steps to add the Internet Speed widget to the widget screen: Swipe right on your Home screen until you reach the first panel to the left. Tap Edit . Tap Customize at the bottom of the screen. Tap the plus ( + ) icon next to \"Traffic Monitor - Speed.\" Tap Done ."
    },
    {
      "title": "Download the Speed Test SpeedSmart app to your iPhone or iPad.",
      "content": "Download the Speed Test SpeedSmart app to your iPhone or iPad. This is a free app you can download from the App Store."
    },
    {
      "title": "Open SpeedSmart on your iPhone or iPad.",
      "content": "Open SpeedSmart on your iPhone or iPad. The SpeedSmart app looks like a Wi-Fi icon in a blue odometer on a white background. You can find it on your home screen or in your app library after your download is finished."
    },
    {
      "title": "Tap Allow in the pop-up.",
      "content": "Tap Allow in the pop-up. When you first open SpeedSmart, you'll see a pop-up asking you to allow the app access to your location. This will help the test find the closest server to you."
    },
    {
      "title": "Tap the blue START TEST button.",
      "content": "Tap the blue START TEST button. It's at the center of the screen. It will start testing your current internet speed. The test results show your current download and upload speeds, as well as the results of ping and jitter tests."
    },
    {
      "title": "Tap the bar chart icon to view historical data.",
      "content": "Tap the bar chart icon to view historical data. It's the icon of three vertical lines at the bottom of the screen—the icon is the second from the left. Each time you test your speed, the results will be added to this screen and stored on the server. [1] X Research source The \"Date\" column shows the date and time the test was performed. Tap a date/time to view more detailed information about the test. The data collected is stored on a remote server, not your iPhone or iPad."
    }
  ]
}