{
  "url": "https://www.wikihow.com/Measure-Liquid",
  "title": "How to Measure Liquid",
  "steps": [
    {
      "title": "Bend down to get eye level with standard measuring cups and pour.",
      "content": "Bend down to get eye level with standard measuring cups and pour. Get a standard liquid measuring cup that has a pouring spout and at least 1 to 2 inches (2.5 to 5.1 cm) of space above the red measuring lines. These features will make pouring easier and spilling less likely. When pouring liquid into the measuring cup, bend down and look at it straight on instead of down at an angle so that your measurement is accurate. [1] X Research source"
    },
    {
      "title": "Look down into angled measuring cups as you pour.",
      "content": "Look down into angled measuring cups as you pour. You can also purchase an angled measuring cup, which allows you to get an accurate measurement without bending down. Look down into the angled measuring cup as you pour in order to ensure that you measure the right amount. [2] X Research source"
    },
    {
      "title": "Bring measuring spoons up to eye level and pour.",
      "content": "Bring measuring spoons up to eye level and pour. To measure small amounts of liquid, use standard measuring spoons. Hold the spoon level in the air straight across from your eyes. Carefully trickle the liquid into the measuring spoon until it reaches the rim. [3] X Research source"
    },
    {
      "title": "Stop when the meniscus is at the bottom of the line.",
      "content": "Stop when the meniscus is at the bottom of the line. When you pour liquid into your measuring cup, the liquid will appear higher near the glass walls of the cup than towards the middle. The surface of the liquid is called the meniscus. Pour liquid in until the bottom of the meniscus is perfectly level with the graduation line. [4] X Research source"
    },
    {
      "title": "Steady the cylinder with one hand and pour with the other.",
      "content": "Steady the cylinder with one hand and pour with the other. Graduated cylinders are tall, thin glass tubes that are most commonly used to measure volume during science experiments. Hold the cylinder securely on a flat surface before using your other hand to pour so that you don't knock over the cylinder and spill the liquid. [5] X Research source You could also use beakers that are labeled with milliliters or ounces to get an accurate measurement."
    },
    {
      "title": "Bring the cylinder straight up to eye level.",
      "content": "Bring the cylinder straight up to eye level. When measuring with a graduated cylinder, it's best to bring it up to eye level, rather than bending down, so that the risk of knocking the cylinder over is smaller. This is especially important if you're measuring chemicals. [6] X Research source"
    },
    {
      "title": "Determine the measurement by seeing where the meniscus falls.",
      "content": "Determine the measurement by seeing where the meniscus falls. To read the measurement, determine which horizontal line on the cylinder is closest to the meniscus, or lowest point in the surface of the water. [7] X Research source The surface of the liquid dips like this because the molecules in the water are more attracted to the glass than they are to each other."
    },
    {
      "title": "Read the medication's instructions and/or label carefully.",
      "content": "Read the medication's instructions and/or label carefully. Whether you're measuring out and administering over-the-counter liquid medication or prescription medication, it's important to first read any instruction that's provided. Prescription labels typically include direct instruction on how much to take and how often. Over-the-counter medication labels include a lot of important information, including what it's used for, how to use it, and what's in it. [8] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source"
    },
    {
      "title": "Weigh the person taking the medication to get an accurate dosage.",
      "content": "Weigh the person taking the medication to get an accurate dosage. When measuring and administering over-the-counter medications, you can typically determine dosage by age or weight. Weight is much more accurate, so step on the scale to find out how much medication is needed. [9] X Research source Some medications determine dosage based on age or time alone. If this is the case, simply take the recommended amount for your particular age and/or don't take another dose until the instructions specify that it's safe to do so."
    },
    {
      "title": "Use the measuring device that comes with the medication.",
      "content": "Use the measuring device that comes with the medication. Many over-the-counter liquid medications come with a measuring device, which is nearly always better to use than other measuring tools. Don't measure your medication with household measuring devices, such as a standard liquid measuring cup, unless you've misplaced the device that came with the medication. [10] X Research source Measuring with a household device may work just fine, but the one that came with your medicine is the safest bet because it was made specifically for administering it. Some types of measuring devices that may come with your medication include measuring cups, dosing spoons, droppers, and syringes. [11] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source"
    },
    {
      "title": "Pour the medication in at eye level.",
      "content": "Pour the medication in at eye level. Similar to when you're measuring liquids for cooking or for science experiments, you'll need to be eye level in order to get an accurate measurement. If the medication comes with a measuring cup or any other measuring device with a flat bottom, set it on a flat surface and bend down when you pour the medication in. Otherwise, hold the device up at eye level when you pour. [12] X Research source"
    }
  ]
}