{
  "url": "https://www.wikihow.com/Never-Give-Up",
  "title": "How to Never Give Up",
  "steps": [
    {
      "title": "Develop a more positive attitude.",
      "content": "Develop a more positive attitude. Though you may find it nearly impossible to be positive if you feel like you’ve tried everything and nothing is working for you, it’s important to stay as optimistic as you can if you want to never give up. Being positive makes you see all of the good things in your life that you may be missing out on because you’re focusing on the negative things. [1] X Expert Source Erin Conlon, PCC, JD Executive Life Coach Expert Interview. 31 August 2021. It will also make you more open to more opportunities and possibilities because you’ll be looking at life with a “can do” attitude. [2] X Research source It’s true. Being more positive will not only make it easier for you to deal with challenges, but it will help you embrace new ones. If you’re bitter or focused on all of your failures, then you won’t be able to move forward. If you catch yourself complaining or whining, try countering your negative comment with two positive ones. Though you shouldn’t feel like you’re faking it when you’re acting positive while feeling sad on the inside, you should know that the more you fake it, the more you’ll slowly begin to see the brighter side of life. One way to be more optimistic is to surround yourself with happier people who make you appreciate life more. If all of your friends are negative and discouraging, then yeah, it’ll be hard to have a positive mindset and to feel like you shouldn’t give up."
    },
    {
      "title": "Learn to embrace change.",
      "content": "Learn to embrace change. If you want to work on developing the right mindset for not giving up, then you have to be able to roll with the punches and to not only accept change, but to thrive in it. Sure, you might have been thrown for a loop when your boyfriend broke up with you out of nowhere or when your family announced you were moving to a new city, but you have to learn to adapt to a new situation, to focus on whatever aspects of it exist, and to make a game plan for thriving in a new situation. [3] X Research source As Sheryl Crow once said, sometimes “A change will do you good.” Even if you’re shocked or thrown off guard, tell yourself that this could be the very best thing for you. Look at change as an opportunity to learn something new, to meet new people, and to become a more well-rounded person. Though you may not see any positive aspects of the situation just yet, you should be proud of yourself for handling it with grace and for moving forward."
    },
    {
      "title": "Learn from your mistakes.",
      "content": "Learn from your mistakes. If you want to be able to not give up, then you have to get into a mindset that allows you to come to terms with the mistakes you’ve made and to learn from them so you don’t keep having the same old problems. Though you may feel only discouraged or embarrassed when you first make a mistake, you should take a step back to understand what you did wrong and make a plan for not making the same mistake the next time. Though nobody wants to make a mistake, mistakes help you learn how to avoid future problems. For example, you may feel like you really messed up by dating a possessive boyfriend who ended up breaking your heart, but this mistake earlier in life may save you from picking the wrong husband in the future. Don’t be in denial about the fact that you could have acted differently. If you’re so focused on looking perfect all the time, then you won’t ever learn."
    },
    {
      "title": "Know that there will always be more opportunities for success.",
      "content": "Know that there will always be more opportunities for success. If you want to work on never giving up, then you have to have the mentality that there will always be more ways to succeed in the future. Though it’s important to live in the present, you should work on getting excited about the future instead of thinking that it has nothing to offer you; if you have the attitude that you’ve missed the boat somehow, then good opportunities will never come because you won’t be able to see them. You may feel that, because you didn’t get the dream job you’ve been on three rounds of interviews for, that you’ll never find a career that suits you, but in the long run, you’ll see that you’ll be able to find plenty of jobs that also feel like that perfect fit, even if it takes a while to get there. You can also work on opening up your definition of success. Sure, you might have thought that true success would be selling your novel when you were 25, but at 30, you may see that success can also be found in teaching literature to eager high school students."
    },
    {
      "title": "Seek knowledge.",
      "content": "Seek knowledge. If you want to have a resilient mindset that helps you really succeed and not give up, then you have to continue gaining knowledge and learning more about life as well as the situation you’re in. If you have a thirst for knowledge and are excited about the world, then you’ll see that there’s always more for you to learn and more opportunities to seek. You can also gain knowledge in whatever it is you’re trying to do, whether it’s to apply to college, find a new job, or sell your novel; the more you know, the more capable you’ll be to handle any challenge that comes your way. Of course, reading as much as you can is the time-tested way to gain knowledge. This can mean reading novels, reading the news, or reading up on your chosen field on the Internet. However, you can also gain knowledge by talking to experts in your field, trying to network, or getting advice from people who know their stuff. As long as you’re aware that there’s more for you to learn out there, you won’t be able to truly give up."
    },
    {
      "title": "Be more patient—good things will happen if you keep trying.",
      "content": "Be more patient—good things will happen if you keep trying. Another reason that you may be thinking of giving up is because you want great things to happen to you right this second. You may think that just because you applied to 10 jobs, sent your novel manuscript to 5 agents, or have gone on dates with 4 different guys, that something should have worked out for you. However, the road to success is paved with plenty of failure, and you shouldn’t give up before you even really start trying. Sometimes it can help to talk to other people who are going through the same process. For example, you may be feeling low because you applied to 20 jobs and haven’t heard a peep from any hiring managers; well, your friend who just got a new job may tell you that she applied to 70 jobs before even getting asked for an interview. It takes commitment and work to go after the life you want. Sure, you may think that you’re smart, talented, and hardworking and that any college, employer, or potential soul mate would be lucky to have you. While this may be true, you can’t expect people to simply choose you because you and the people who know you know how awesome you are; it takes work and time to prove yourself."
    },
    {
      "title": "Don’t become a victim of learned helplessness.",
      "content": "Don’t become a victim of learned helplessness. If you become a victim of learned helplessness, then you’ll believe that you won’t ever be able to succeed because the world is pitted against you. People who are victims of learned helplessness believe that they’ll never get anywhere because they haven’t had good results in the past. If you want to be able to deal with adversity, then you have to learn to embrace new opportunities instead of thinking that you’re destined to fail. [4] X Research source A person who has fallen victim to learned helplessness will believe something like, “Well, I haven’t gotten the last five jobs I interviewed for, so this must mean that I’ll just never be able to find a job. There must be something wrong with me, or finding jobs is all about networking anyway, so I might as well not even bother if I keep failing.” A person who wants to take control of her destiny will work on thinking positively and feeling like she has the power to change the situation. She’ll believe something like, “Even though the last five interviews haven’t worked out for me, I should be encouraged by the fact that hiring managers are interested in me at all. If I just keep sending out my resume and going on interviews, I know I’ll find a great job eventually.”"
    },
    {
      "title": "Get a mentor you trust.",
      "content": "Get a mentor you trust. Another way to deal with adversity is to find a mentor you trust who can help you deal with the more difficult challenges in life. Having a person who has been through what you’re going through or who has found a way to succeed in your field can help you feel more confident about continuing to go after what you want. Talking to another person can give you more advice and perspective on your situation, and can also help you feel encouraged. [5] X Expert Source Erin Conlon, PCC, JD Executive Life Coach Expert Interview. 31 August 2021. Plus, it’s likely your mentor has dealt with his or her fair share of challenges and setbacks. Hearing about these will help you want to keep going, too."
    },
    {
      "title": "Maintain a strong social network.",
      "content": "Maintain a strong social network. In addition to having a mentor you trust, having a strong social network can help you stay strong during a time of great need. Having friends to rely on, family members who love and care about you, and being part of a strong community of people who really care for each other can help you feel less alone and like you are capable of dealing with the challenges ahead of you. If you feel like you have to deal with this situation alone, then you are much more likely to feel hopeless and like you have to give up. Having someone to talk to about your setbacks, even if that person can’t always give you the best advice, can help you feel less alone. Just having a person to talk to can make you feel like there’s hope for the future. Talking to other people who care for you about your struggles can also help you relieve stress; you’ll be much more likely to feel discouraged if you have to bottle up all of your feelings inside."
    },
    {
      "title": "Don’t forget to take care of yourself.",
      "content": "Don’t forget to take care of yourself. If you’re going through a serious period of hardship, then the case may be that the last thing you want to do is to eat three meals a day, shower regularly, or get enough rest. However, if you want to keep going, then this is exactly what you have to do to stay mentally and physically strong. It will be much easier to want to give up if you feel tired, are eating poorly, or if you haven’t showered in a few days. [6] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Making an effort to eat three healthy, balanced meals that contain lean proteins, fruits or veggies, and healthy carbs can make you feel more energized and ready to tackle any challenges that come your way. Try to sleep for at least 7-8 hours a night and to go to bed and wake up around the same time. This will help you feel capable of dealing with whatever the world throws at you."
    },
    {
      "title": "Be a person of action.",
      "content": "Be a person of action. If you want to be able to not give up, then you can’t sit around complaining about all of your failures, moping in bed, or just making excuses for all of the reasons you failed. You have to be a person of action and to make a game plan for succeeding; this means putting yourself out there, applying for jobs, networking, going on dates, or doing whatever it is you have to do to reach your goals. If you’re sitting around bemoaning all of the failure you’ve faced and feeling sorry for yourself, then good things won’t happen to you. Of course, we all need to sit back, throw a personal pity party, and feel sorry for ourselves from time to time. However, you can’t let these feelings get you into a funk that keeps you from trying again. First, sit down and make a written plan for success. Having these items listed out will make you feel much more capable of getting what you want."
    },
    {
      "title": "Build your confidence.",
      "content": "Build your confidence. It’s true, your confidence may be shaken if you’ve spent so many years at the same low-paying job where you don’t feel valued, but you can’t let that keep you from feeling worthy of something better. You should make an effort to embrace all of the things you love about yourself, to address the flaws that you can change, and to feel happy about being the person who you are. Though building true confidence takes a long time, the sooner you start, the sooner you’ll be able to deal with challenges. Work on erasing self-doubt and feeling like you can achieve anything you put your mind to. If you’re the first person to doubt yourself, then anyone you meet will follow you. Hang out with people who make you feel good about yourself instead of putting you down. Fake it until you make it with positive body language. Stand tall, don’t slouch, and don’t cross your arms over your chest. Look happy and open to what the world may bring."
    },
    {
      "title": "Grow stronger from failure.",
      "content": "Grow stronger from failure. You may have heard the optimistic expression, “Whatever doesn’t kill you makes you stronger.” However, strictly speaking, this expression isn’t always true. In fact, if you experience a lot of failure and let yourself be truly discouraged by it, then you’ll actually be getting yourself beat down, instead of developing a thicker skin. You need to learn to embrace failure and to look at what you can learn from it, instead of letting it make you feel like you’re unworthy of success. Every time you fail, don’t just let it make you feel worse, but sit down and think about what you’ve learned from it. Think about what you could have done differently to succeed the next time around. Be proud of yourself for failing. Many people never put themselves out there to begin with. Sure, it’s no fun to fail, but it’s the only way to get what you want."
    },
    {
      "title": "Don’t let your past dictate your future.",
      "content": "Don’t let your past dictate your future. You may think that, because you’ve failed so many times in the past, and have had no luck with selling your first novel, dating people, or losing weight, that you’ll never be able to amount to anything. However, many successful people come from humble beginnings, were raised in poverty, or had the door slammed in their faces again and again and again. Let your past empower you and drive you to succeed, instead of having it make you think you’re not worthy. Sure, you may feel like all of your jobs so far have only lowered your self-worth and made you feel inadequate. However, this doesn’t mean your future jobs have to be like that. In fact, they should inspire you to find something better for yourself. If you think you’re only destined to repeat the past, then you’ll be sabotaging yourself. For example, if you’re in a great relationship but all you can think of is all of your failed relationships, then yeah, you’re going to mess this one up, too, because you don’t think you deserve any better."
    },
    {
      "title": "Set and meet reasonable goals.",
      "content": "Set and meet reasonable goals. Another way to stay strong is to make sure that you’re setting reasonable goals that you can achieve. Of course, it’s great to aim for the moon so you fall among the stars if you fail, and so on, but the reality is, you should create small goals that build up to your ultimate goals, so that you feel proud of what you’re accomplishing along the way. Making your life feel more manageable will drive you to not give up. For example, if your goal is to publish a novel, then yeah, you’re bound to be disappointed for all of the years that you can’t do it, because you’re going to make yourself feel like a failure. However, if you set smaller goals, like publishing a short story in a small journal, and then publishing a short story in a more established journal, and then writing a draft of a novel, and so on, then you’ll be much more capable of achieving these little goals along the way and will feel more confident moving forward."
    },
    {
      "title": "See if you need to find a new way to make your dreams come true.",
      "content": "See if you need to find a new way to make your dreams come true. Okay, so nobody wants to hear it, but sometimes, you may want to sit back and think about whether or not you’re just torturing yourself by setting ridiculously hard goals for yourself. Sure, you may want to be a Broadway actress; while this is a dream come true, you may also find a way to do what you love and inspire others in other ways, such as being a Drama teacher, landing smaller acting gigs, or even starting a blog about your attempts to enter the arts. [7] X Expert Source Erin Conlon, PCC, JD Executive Life Coach Expert Interview. 31 August 2021. You shouldn’t think of this as a way of lowering your expectations, but as a way to make it easier for you to enjoy your life. You don’t want to spend your whole life feeling like a loser because you never rose to fame, do you? That kind of feeling will leave you feeling unsatisfied with all you have achieved."
    },
    {
      "title": "Manage your stress.",
      "content": "Manage your stress. Another way to stay strong in the face of failure is to learn how to cope with all of the stress you may be feeling from wanting to give up. Whether you simply can’t find a job that gives you the health benefits you so badly need, or you can’t deal with juggling a family and trying to write a screenplay, you need to find a way to manage your stress to make your path to success more possible. Here are some things you can do to manage your stress: Spend time with people who help you feel calm Ditch as many stressful factors in your life as you can Scale back on your work where you can Do yoga or meditate Drink less caffeine Avoid alcohol as a coping mechanism Talk to a friend, loved one, or therapist about your problems Write in a journal"
    },
    {
      "title": "Stop doing the same thing and expect different results.",
      "content": "Stop doing the same thing and expect different results. If you want to stay strong and to not give up, then another thing you can do is to find a new way to look at your situation. Okay, if you submitted 70 job applications and haven’t heard a peep, then your best bet may not be to submit another 70, but to have someone look at your cover letter or resume to make sure they are up to speed, to seek out more volunteer experience, or to spend more time on networking. If you keep doing the same old thing over and over again, then you’ll start to feel like you’re butting your head against the wall. For example, if you’ve gone on 25 first dates and 0 second ones, then you should ask yourself what you can do differently to connect with more people. This does not mean that there’s something wrong with you, but that you need to shift your perspective. Sometimes, you may find that all you need is a change. For example, if you’ve been begging your bosses to give you a raise or more responsibilities at work but you’re getting nothing back, then you may only be able to get what you want if you search for a new job."
    },
    {
      "title": "Don’t let anyone else lower your self-worth.",
      "content": "Don’t let anyone else lower your self-worth. It’s easy to feel like giving up if all of the people around you are making you feel like this is the best option. However, you can’t let other people tell you who you are, whether they are literary agents, hiring managers, or boyfriends. You have to work on letting your self-worth come from within and not letting people make you feel like less of a person. [8] X Research source Of course, if people are giving you constructive feedback, then you should listen to it instead of calling them haters. If people really want you to improve, then you should listen to them and see how you can do better the next time. Know that it’s a cold world out there, and that most people spend the majority of their lives dealing with rejection. Don’t think you’re unique for being rejected so much and focus on changing your attitude toward this unfortunate aspect of life."
    },
    {
      "title": "Keep your life in perspective.",
      "content": "Keep your life in perspective. If you want to have the drive and motivation to keep going, then you have to learn to step back and take a look at the big picture. Is your life really as completely terrible as you think it is? Sure, you may not have your dream job right now, but you’re lucky to find work in this economy. Okay, so it sucks to be single sometimes, but at least you have your health and so many friends who want the best for you. Remind yourself of all of the good in your life and use it to motivate you to achieve great things. [9] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Make a gratitude list. Write down all of the things that make your life worth living and look at it frequently. This will make you see that things aren’t as bad as they seem. Take the time to thank your friends and loved ones for all they have done for you. This will help you see that your life isn’t all doom and gloom."
    },
    {
      "title": "Be a part of a community of people who want the same thing.",
      "content": "Be a part of a community of people who want the same thing. Another way to not give up is to join a group of people who are going through a similar quest. If you’re dealing with alcoholism, then join AA. If you’re trying to get your novel published, join a writer’s group. If you’re trying to meet a significant other, go to singles mixers. You may feel like you’re the only person in the world dealing with your particular struggle, but if you make an effort, you’ll see that you are far from alone. A community of like-minded people can help you get great advice, encouragement, and a feeling of belonging."
    }
  ]
}