{
  "url": "https://www.wikihow.com/Play-the-Erhu",
  "title": "How to Play the Erhu",
  "steps": [
    {
      "title": "Buy",
      "content": "Buy or rent an erhu. The erhu is rather uncommon in the western world, so most stores would not have an erhu for you to rent. If you cannot find an erhu to rent, you could always buy one online or go to a convention. Beginner erhus typically cost between $50 and $100. Intermediate erhus are normally between $100 and $200. Professional erhus tend to go from $200 to $1000."
    },
    {
      "title": "Look at the accessories of the erhu.",
      "content": "Look at the accessories of the erhu. Erhus should come with a bow. Like a violin bow, you will need to apply rosin to it. It is a good idea to buy a tuner with your erhu so you can always play in tune. It is also a good idea to get a book of sheet music so you don't need to extend the effort of learning them by ear or finding them online. You will need to apply much more rosin the first time you use the bow. The bow will be between two strings. Don't try to take it out and don't put too much pressure when applying rosin to it. If you don't want to buy a tuner, you could always use a free online tuner."
    },
    {
      "title": "Set up your erhu.",
      "content": "Set up your erhu. Having your erhu set up properly is very important for tone quality and confidence levels when learning. Make sure the strings are twined at the tip of the pegs. The inner string should be going counterclockwise with the outer going clockwise. There should be a roll of string called a Qianjin that holds your two strings together. Now you can slide in your bridge. Pull up the strings and slide the bride into the center of the instrument. Then, you can put the damper under the bridge. Your damper should either be a block of sponge or a piece of cloth."
    },
    {
      "title": "Tune your erhu before you play.",
      "content": "Tune your erhu before you play. It's always a good idea to tune before you play your erhu. You should typically tune your inner string (the string most toward you) to a D and your outer string to an A. You should twist your pegs in towards the instrument to prevent the pegs from accidentally falling out and getting loose."
    },
    {
      "title": "Get into playing position.",
      "content": "Get into playing position. To do this, rest your erhu on the top of your left leg. Once it is resting on your left leg, relax your left hand to grip the instrument. Your arm and elbow should be relaxed down by your side. Your fingers should be hanging downwards parallel to the strings. Make sure you don't grip the erhu tightly. Hold your erhu at around a 45 degree angle to you. Make sure your palm isn't touching the neck of the instrument."
    },
    {
      "title": "Understand the structure of the erhu.",
      "content": "Understand the structure of the erhu. The erhu should have a bow between the two strings. Don't try to take it out. The two strings - inner and outer, are the only strings of the erhu. The inner string should be most toward you and the outer string should be farther away from you. There should be a ornamented box-like structure below the strings."
    },
    {
      "title": "Learn how to hold the bow.",
      "content": "Learn how to hold the bow. Lay the bow down sideways and rest your index finger under the bow and your thumb down on the bamboo. Then, loosely fold your index finger in so it is parallel to the bamboo. Slide your middle and ring finger in between the bow and the strings. Lastly, put your pinky on the other side of your ring finger so that the plastic is in between your ring finger and pinky. Make sure that your middle and ring finger are only touching the plastic, not the horsehair (the white-yellow part of the bow)."
    },
    {
      "title": "Practice using the bow.",
      "content": "Practice using the bow. There are two strings - inner and outer. To play the inner string, put pressure on your middle and ring fingers. This will change the direction of the bow and will play the inner string. To play the outer string, stop putting pressure on your fingers and simply relax them. Imagine you're pulling a piece of string in and out."
    },
    {
      "title": "Learn the D scale.",
      "content": "Learn the D scale. The D scale is the easiest scale on the erhu because its root is D, your tuning note. The notes in the D scale are D, E, F#, G, A, B, C#, and D. All these notes should be on the upper 4th of your instrument (first position). The first four notes (D, E, F#, and G) should be played on your inner string while the last four (A, B, C#, and D) should be on the outer string. These steps will teach you to play the D scale: To play E on the inner string, grip your hand right below the yarn on the strings. Hold the instrument there. Using your index finger, press down on the strings. Playing B on the outer string is the same as playing E on the inner string, except you would move the bow to the outer string. To play F# on the inner string, keep your index finger where it is. Use your middle finger to put some pressure on the strings about a finger's width away from your index finger. Do the same for the outer string to play C#. To play G on the inner string, use your ring finger to place it next to your middle finger. Do the same to play high D on the outer string."
    },
    {
      "title": "Work on your fingerings for the other three positions.",
      "content": "Work on your fingerings for the other three positions. The inner string only has two positions while the outer string has four. Once, you get below the halfway point on the inner string, no real notes will come out. The lower you get on the string, the higher the notes go so, feel free to use your tuner to figure out your exact fingerings for each of these notes."
    },
    {
      "title": "Practice",
      "content": "Practice daily. To learn an instrument well, you need to practice daily. When learning, 15 minutes a day will do to reinforce your knowledge and figure out new things. Once you get better at the instrument, you might want to consider adding more time to your daily practice routine so you can keep learning. You can always watch online videos and tutorials to figure out something you don't know."
    }
  ]
}