{
  "url": "https://www.wikihow.com/Repair-a-Luggage-Tear",
  "title": "How to Repair a Luggage Tear",
  "steps": [
    {
      "title": "Thread a sewing needle with a heavy-duty type of thread.",
      "content": "Thread a sewing needle with a heavy-duty type of thread. Most suitcases and travel bags are constructed of thick, hard-wearing fabrics, so it’s a good idea to use a thread that can hold up to the physical demands of constant packing, loading, and shuffling from place to place. Multi-ply polyester, cotton-wrapped polyester, or nylon upholstery thread should do the trick nicely. [1] X Research source You’ll find many different varieties of thread at your local craft store, or any shop that carries sewing supplies. If all you have is regular thread, double it over on itself and tie the ends together to beef it up."
    },
    {
      "title": "Weave the needle back and forth",
      "content": "Weave the needle back and forth through both torn edges in a zig-zag pattern. Keep sewing until you reach the far end of the tear where the material is still intact. The closer together you situate your stitches, the more you’ll be able to make room for, and the more durable the finished seam will be. [2] X Research source Avoid inserting your needle too close to the frayed edge of the tear, or the resulting stitch could come out easily. This is nothing but your basic straight stitch, the most elementary technique in sewing. [3] X Research source"
    },
    {
      "title": "Tie off your thread 2-3 times to make sure the knot will hold.",
      "content": "Tie off your thread 2-3 times to make sure the knot will hold. There are a couple of ways you can do this. The first is to slip your needle under your last stitch and pull it through the loop formed by the thread before snipping off the excess length. The other is to cut your thread a little long, then gather up the loose ends and tie a series of half knots by hand. [5] X Research source Either of these methods will work just fine, as long as your knots are tight and neat."
    },
    {
      "title": "Apply a small amount of high-strength fabric glue to both sides of the tear.",
      "content": "Apply a small amount of high-strength fabric glue to both sides of the tear. Start by separating the two sections of fabric as much as possible without doing any further damage. Then, carefully dab some glue onto the top of one section and the bottom of the other. Be careful not to accidentally spread the glue to any other part of your luggage. [6] X Research source Make sure the glue you're working with is suitable for use on fabrics. Many ordinary superglues aren't effective on woven materials. Gluing both sides of the tear rather than just one will improve its chances of staying closed."
    },
    {
      "title": "Align the top and bottom sections of the tear.",
      "content": "Align the top and bottom sections of the tear. Doing your best not to get glue all over your fingers, position the two edges so that the one with the glue on the bottom is directly above the one with the glue on the top. There should be a small amount of overlap between the sections. If you don’t overlap the fabric, the glue will have nothing to stick to but itself, and the tear will likely open back up before long."
    },
    {
      "title": "Press and hold the two sections together for at least 2-3 minutes.",
      "content": "Press and hold the two sections together for at least 2-3 minutes. Once you get the edges of the tear lined up properly, clamp them together between your fingers and apply firm, steady pressure. It should only take a few minutes for the glue to dry to the point where you can let go of the fabric without it coming apart. [7] X Research source Be sure to apply additional glue as needed to any gaps or openings you notice in the mended fabric. Keep in mind that the more glue you slather on, the longer it will take to dry."
    },
    {
      "title": "Purchase a fabric patch that matches your luggage.",
      "content": "Purchase a fabric patch that matches your luggage. Shop around for a patch that approximates the look of your bag as closely as possible. Fabric patches come in a wide variety of colors and styles, so you shouldn’t have too much trouble finding one that fits the bill. [8] X Research source Most fabric patches are made from cotton or polyester, and aren’t recommended for use on materials like nylon or rayon. There are also leather patches available for renewing leather bags and suitcases."
    },
    {
      "title": "Sew around the edges of ordinary fabric patches.",
      "content": "Sew around the edges of ordinary fabric patches. Straight-stitch your way along the outer perimeter of the patch until you get back to your starting point, then snip your thread and tie it off 2-3 times to secure it. Provided you do this correctly, your finished patch should stand up to even the most crowded baggage claim terminals. [10] X Research source For maximum durability, use an extra-thick type of thread, such as cotton-wrapped polyester or nylon upholstery thread. You can also double-up a strand of normal thread to increase its strength. Sewing your patch is the best way to guarantee that it will stay on."
    },
    {
      "title": "Stick on patches with flat backs using fabric glue.",
      "content": "Stick on patches with flat backs using fabric glue. Spread a liberal amount of high-hold glue onto the backside of the patch and carefully move it into place over the tear. Press down firmly on the patch for 30-60 seconds to make sure it will stay put. Afterwards, avoid handling the patch for at least 10 minutes as the glue begins to set. [11] X Research source Other types of flexible, waterproof glues, like Gorilla Glue, multi-purpose industrial glue, or hot glue sticks , may also work for this project. [12] X Research source Once the glue has had a full 24 hours to cure, it will be safe to expose your luggage to rain, sleet, snow, and other adverse weather conditions."
    },
    {
      "title": "Heat iron-on patches for quick and easy repairs.",
      "content": "Heat iron-on patches for quick and easy repairs. Place the patch on the damaged spot and take a moment to get it positioned right where you want it while your iron heats up. Place a thin piece of cloth (such as a bandanna or pillowcase) over the patch and press the hot iron into the cloth for 30-45 seconds. If possible, flip the luggage fabric over and iron the other side as well to further cement the bond. [13] X Research source Spraying the backside of the patch with a bonding agent can help lock it down for good. The backs of iron-on patches are coated with powerful adhesives that form a strong bond when activated by heat."
    }
  ]
}