{
  "url": "https://www.wikihow.com/Skip-a-Class-in-Middle-School",
  "title": "How to Skip a Class in Middle School",
  "steps": [
    {
      "title": "Weigh the consequences.",
      "content": "Weigh the consequences. Make sure the benefits will outweigh the consequences of skipping class. Know the rules at your middle school. Each school has a different absentee policy, but you will want to know what is going to happen if you skip a class before you decide to leave. Beyond the penalty dealt by your middle school, there are effects on your likelihood of success as a student if you are a habitual skipper. [1] X Research source It’s possible you will get detention and have to spend more time at school. Will you be allowed to take a test later if you skip a class to miss a test? What are the consequences of turning homework in late? What will happen if your parents find out? Will this just lead to longer stints of boredom and less opportunity to hang out with friends because you’re grounded? Students who skip more than 10 days of school in a year are 20% less likely to get a high school diploma and 25% less likely to go to college. Those who do skip often feel like they are behind in their learning."
    },
    {
      "title": "Have a good excuse.",
      "content": "Have a good excuse. Understand the truancy laws. Public schools require attendance. If you are absent and do not have a reason which falls under excused absences, you will be marked as truant. This applies even if you get a note from your parents excusing you if the excuse does not qualify to avoid truancy. Excused absences are usually related to illnesses, a death in the family, or religious observances. Some excuses that could work are telling them you got a migraine headache and needed some quiet, you suddenly feel nauseated, you needed to call your parents. Extended absences for health reasons will often require a doctor's note."
    },
    {
      "title": "Plan in advance.",
      "content": "Plan in advance. Rather than just wandering in the halls and getting caught, think of different ways you can get out of class without getting into trouble. Make sure you know what you want to do and how you want to do it before the class period you want to skip. Come up with a list of options which may work, then choose the one you think is best. [2] X Research source Consider going to class and asking to be released by the teacher to see the counselor, go to the bathroom, spend some time in the library, or call home. Check with the counselor and set an appointment for later in the day during the class you would like to skip. If you don’t think the teacher will let you out of class, choose a place you can hide between classes, maybe even go by these places between other class periods to see if they look like good hiding places."
    },
    {
      "title": "Enlist the help of an adult.",
      "content": "Enlist the help of an adult. There are several ways to get out of class without getting in trouble. Get help from an adult who can vouch for you, like your parents or school administrators. If you just need a break, call your parents and ask them to send you an early dismissal. If you are not feeling well, go visit the nurse’s office and see if you can get sent home. At the very least, you will have gotten a break from class for a little while. Visit the counseling office. Speak to your counselor about what is bothering you, or why you need a break, and ask if they will excuse you from your class."
    },
    {
      "title": "Hide in a safe place.",
      "content": "Hide in a safe place. There are several rooms available at school which may be empty or acceptable for you to spend some time in. Try the bathroom, library or cafeteria. You may be able to use an empty classroom if it is the teacher's off-period or lunch break, but be aware, they may return and you could get caught. Get a pass to go to the bathroom and just hang out there until you feel ready to return to class. This will likely only work once or twice per class since the teacher will notice if you continue to stay away for long periods of time. Get a pass to the library or just go there between classes and stay after the bell rings. You will have plenty of reading material to keep you entertained during your break. Sneak into an empty classroom and hide in a corner where you can't be seen from the hall. You can hide in the cafeteria by going during a lunch break other than your own, or hiding out in the corner when it is empty. Note that there may still be cafeteria personnel working even when no one is eating lunch."
    },
    {
      "title": "Act normal.",
      "content": "Act normal. If you are going to skip class, don’t make a big show of it. People who are nervous tend to react with either fight or flight mode. If you feel like you are about to get caught, avoid running or being combative with someone who approaches you. If you are feeling nervous, take several deep breaths to calm yourself down. Don’t act super sneaky or brag about it, just do what you need to do to take a break. This will make it less likely for you to get caught in the process and easier to explain yourself afterward."
    },
    {
      "title": "Catch up on your schoolwork.",
      "content": "Catch up on your schoolwork. If you skipped a class because you didn’t study for a test, or you hadn’t finished your homework, be sure to make up for that on your time off. This will make skipping that class worthwhile if it improves your grades. Not catching up will put you further behind and tempt you to skip more classes."
    },
    {
      "title": "Be respectful.",
      "content": "Be respectful. If your parents or a school administrator approach you about your missed classes, be respectful. Explain calmly why you were not in class that day and accept the consequences without arguing. [3] X Research source If they do not give you the opportunity, politely ask them to let you explain what happened. While you may choose to disobey the rules, it doesn’t mean you need to have a negative attitude toward the person whose job it is to enforce the rules. [4] X Research source Tell the truth. Listen when they are talking. Nod and respond with an occasional, \"yes\" or \"I understand.\" [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you do get upset during the conversation, try to end it as quickly as possible by accepting what the other person is saying. Write down your thoughts and ask to speak to them again once you feel like you are calmer and in more control."
    },
    {
      "title": "Accept the consequences.",
      "content": "Accept the consequences. If you weighed your consequences in advance, you should be prepared to accept them. There is no going back now, so the best choice is to accept the consequences and move on. You will gain more respect from the people involved in punishing you and be better able to assess your future choices when you take responsibility for what you have done. Take responsibility for your actions and avoid blaming others for what you have done. [6] X Research source If the consequences don’t seem worth it, find ways to engage with your classes when you feel bored. Consider how the things you are learning will help you in the future, and connect it to your life outside of school."
    }
  ]
}