{
  "url": "https://www.wikihow.com/See-What-Your-Friends-Like-on-Facebook",
  "title": "How to See What Your Friends Like on Facebook: Mobile & PC",
  "steps": [
    {
      "title": "No, you can't see what posts your friends Like on Facebook.",
      "content": "No, you can't see what posts your friends Like on Facebook. Apart of Liked pages, you can't see liked posts or comments. While you were able to bypass this and search for Likes in the past, Facebook has made it impossible to do so as per their privacy practices. You may see \"[user] liked\" on a post you come across, but there's no way to pinpoint specific or all posts. However, you can still browse what pages your friend has Liked on the mobile app or website ."
    },
    {
      "title": "Go to your friend's profile.",
      "content": "Go to your friend's profile . You can find it by tapping the magnifying glass at the top-right corner and typing their name into the search box. [1] X Research source"
    },
    {
      "title": "Tap See (name's) About Info.",
      "content": "Tap See (name's) About Info . You'll see this near the top of your friend's profile. If you don't see this option, tap the About tab instead."
    },
    {
      "title": "Tap See All next to \"Likes\".",
      "content": "Tap See All next to \"Likes\". You may need to scroll down to see this option. Instead of See All , you may see a right-pointing arrow next to the \"Likes\" heading."
    },
    {
      "title": "View the Likes.",
      "content": "View the Likes. You'll see the full list of all movies, TV shows, artists, books, sports teams, restaurants, and other types of Pages your friend has Liked on Facebook. Facebook allows users to hide some or all of the things they've Liked on their profiles—keep in mind that it's possible your friend has hidden some or all of their Likes. If you want to hide your own Liked pages , do the following: Navigate to your profile. Tap ••• next to Likes . Tap Edit the Privacy of Your Likes . Tap the drop-down menu and select Only me . Tap Close ."
    },
    {
      "title": "Go to your friend's profile.",
      "content": "Go to your friend's profile. You can do this by clicking a friend's name on your news feed, or by searching for them using the Search bar at the top of the page. [2] X Research source"
    },
    {
      "title": "Click the More tab.",
      "content": "Click the More tab. This is below your friend's profile picture. A menu will expand with more options."
    },
    {
      "title": "Click Likes.",
      "content": "Click Likes . This is towards the bottom of the menu. This opens your friend's Likes page, where you'll find all of the movies, TV shows, artists, books, restaurants, and other Pages they've liked on Facebook. To browse between sections, click the tab at the top. Facebook allows users to hide some or all of the things they've Liked on their profiles—keep in mind that it's possible your friend has hidden some or all of their Likes. If you want to hide your own Liked pages, do the following: Navigate to your profile. Click More . Click Likes . Click ••• next to Likes . Click Edit the Privacy of your Likes . Click Only me . Click Save ."
    }
  ]
}