{
  "url": "https://www.wikihow.com/Shoot-at-the-Shooting-Range-in-GTA-V",
  "title": "How to Shoot at the Shooting Range in GTA V",
  "steps": [
    {
      "title": "Open the map.",
      "content": "Open the map. Shooting ranges can be found in the gun store, called Ammu-nation, and are open 24-7. However, not all Ammu-nations are equipped with a shooting range. Open up the map by pressing the Start button (PS3 and Xbox 360) or M key (PC)."
    },
    {
      "title": "Find an Ammu-nation with a shooting range.",
      "content": "Find an Ammu-nation with a shooting range. Ammu-nations can be identified by their black gun icon. Those with shooting ranges have icons that resemble a black gun inside a white square. Ammu-nations with shooting ranges can be found in the following locations: Downtown Los Santos Palomino Creek Blueberry Ocean Flats El Quebrados Come-A-Lot Old Venturas Strip."
    },
    {
      "title": "Mark the shooting range on the map.",
      "content": "Mark the shooting range on the map. Once you have found the nearest Ammu-nation with a shooting range, move your cursor over to its icon, and press the X button (PS3), A button (Xbox 360), or Left click (PC). This will mark the range as your destination."
    },
    {
      "title": "Go to the shooting range.",
      "content": "Go to the shooting range. Follow the purple path on your mini map (located in the bottom left-hand corner of the screen), and follow it to the shooting range."
    },
    {
      "title": "Enter the shooting range.",
      "content": "Enter the shooting range. Walk through the double doors, and you will be greeted with an array of weapons on the wall. Walk forward, and take a left into the side door, and you’ll enter the shooting range area."
    },
    {
      "title": "Opt to begin shooting.",
      "content": "Opt to begin shooting. Once inside the shooting range, you will receive an on-screen prompt asking if you wish to shoot, select the “Yes” option to begin."
    },
    {
      "title": "Select a weapon challenge.",
      "content": "Select a weapon challenge. After a brief loading screen, you will be brought to the Selection screen. Here, you can choose the challenge of the weapon you’d like to work with. If you have never used the shooting range before, you will only be able to participate in the pistol challenge. After this, the SMG challenge is unlocked, followed by the Shotgun challenge, and then the AK-47 Challenge. You can select which challenge you want by scrolling between them using the left stick (PS3 and Xbox 360) or directional arrows (PC). Select your challenge by pressing the X button (PS3), A button (Xbox 360), or Left Click (PC)."
    },
    {
      "title": "Select a challenge round.",
      "content": "Select a challenge round. Out of the weapon categories listed above, each has 3 different rounds of challenges. Although the challenges vary from weapon to weapon, the first involves still targets, the second involves slowly moving targets, while the third involves fast targets that flip over. All of the challenges are timed, and require a certain score to unlock the next level of challenge."
    },
    {
      "title": "Take aim.",
      "content": "Take aim. Once you have selected a challenge, a countdown will begin. Aim by holding down the L2 button (PS3), LT button (Xbox 360), or the right click (PC). Your gun’s aim is represented by the faint white target symbol in the middle of the screen; try to focus this point on the center of each target."
    },
    {
      "title": "Shoot!",
      "content": "Shoot! The targets will already be on screen, so shoot at those that are already there. Shoot at the targets by pressing the R2 button (PS3), RT button (Xbox 360), or Left click (PC). Each challenge has a different number of targets. Rapidfire gun challenges, like the SMG, have many more targets than shotgun challenges. If you do not complete the challenge before the timer ends, you will fail and have the opportunity to try again, or exit. Winning the challenge earns you a medal, but no other kind of reward. Once you want to exit the shooting range, press the circle button (PS3) B button (Xbox 360) or ESC key (PC), and you will leave the challenge menu."
    }
  ]
}