{
  "url": "https://www.wikihow.com/Open-an-Instagram-Account-Through-PC",
  "title": "How to Sign Up for Instagram on PC, Mac, or Chromebook",
  "steps": [
    {
      "title": "Go to https://www.instagram.com in a web browser.",
      "content": "Go to https://www.instagram.com in a web browser. You can use any web browser on your computer, such as Chrome, Safari, or Edge to access Instagram on your computer . Many of Instagram's best features, like direct messaging and the ability to create photo and video posts, are now available in your web browser. While it's not possible to create a story using Instagram on your computer, you can still view other people's stories just as you would in the mobile app."
    },
    {
      "title": "Click Sign up.",
      "content": "Click Sign up . It's the link on the right side of the page next to \"Don't have an account?\""
    },
    {
      "title": "Fill out the sign-up form.",
      "content": "Fill out the sign-up form. Enter your email address, full name, the username you'd like to use on Instagram, and a secure password to get started. [1] X Research source If you'd rather not use your email address, you could enter a phone number—but if you do, you'll need to confirm your phone number by verifying a code you receive via text. [2] X Research source Alternatively, if you already have a Facebook account, you can skip filling out the form and choose to link your new Instagram account to Facebook—just click Log in with Facebook , enter your Facebook login details, and then click Log in ."
    },
    {
      "title": "Click the blue Sign Up button.",
      "content": "Click the blue Sign Up button. It's at the bottom of the form. Your new Instagram account is now ready to use! [3] X Research source"
    },
    {
      "title": "Customize your profile.",
      "content": "Customize your profile. Now that you've created an account, you'll want to personalize your profile before you explore . [4] X Research source Click the profile photo at the top-right and select Profile . Click the Edit Profile button at the top of your profile. To select a profile photo, click Change profile photo and upload a photo from your computer. You can also change the name that appears on your profile, add a link to your website, type a brief bio, and update your gender and contact information. When you're finished, click Submit at the bottom to save your new profile."
    }
  ]
}