{
  "url": "https://www.wikihow.com/Sew-on-a-Wig",
  "title": "How to Sew on a Wig",
  "steps": [
    {
      "title": "Choose a lace wig.",
      "content": "Choose a lace wig. Lace wigs will provide you with the most realistic looking results because they have a sheer cap. This allows portions of your scalp to show through the wig when the hair is parted. It also allows you to blend your natural hair with the wig hair. [1] X Research source"
    },
    {
      "title": "Braid your hair.",
      "content": "Braid your hair. To sew in a wig, your hair will need to be in several tight braids against your head. You can braid your hair yourself, have a friend braid it for you, or get your hair professionally braided. Aim for something similar to cornrows or beehive braids. [2] X Research source If your hair is long, then you might need to secure some of the braids using bobby pins so that they will not be visible outside of the wig. You may want to leave a thin strip of hair loose around the hairline to achieve a more natural appearance. However, the rest of your hair should be braided."
    },
    {
      "title": "Try on the wig.",
      "content": "Try on the wig. Next, take your wig and put it on how you intend to wear it. Make sure to line up the edges of the wig with your natural hairline. Also, make sure that the wig is covering your braids. [3] X Research source"
    },
    {
      "title": "Place clips to hold the wig while you sew.",
      "content": "Place clips to hold the wig while you sew. You do not need to use clips, but they can be helpful for ensuring that you are sewing the wig in the right position. They can also help to keep the wig hair out of the way as you sew, which may be necessary for a long hair wig. Place clips as needed to hold the wig and to keep the hair out of the way while you sew. [4] X Research source"
    },
    {
      "title": "Cut the lace as needed to match your natural hairline.",
      "content": "Cut the lace as needed to match your natural hairline. With the wig on your head, it will be easier to see any spots where the lace extends too far past your natural hairline. Look for areas where the lace is extending beyond your natural hairline and then cut these areas. [5] X Research source Make sure to cut the wig backing only and avoid cutting any hair that is attached to the wig in other areas. If you’ve left some of your own hair loose around your hairline, use your fingers or a crochet hook to pull pieces of hair through the holes in the lace. This may help you to achieve a more blended, natural-looking hairline."
    },
    {
      "title": "Thread a hair weaving needle with 18” (46 cm) weave thread.",
      "content": "Thread a hair weaving needle with 18” (46 cm) weave thread. A hair weave needle is a curved and somewhat blunt needle. Weave thread is also thicker than regular sewing thread. Thread the weaving needle with about 18” (46 cm) of thread and tie a knot in the end of the thread. [6] X Research source You can purchase a hair weave needle and thread at a beauty supply store."
    },
    {
      "title": "Part the wig hair just behind your ears going up and over your head.",
      "content": "Part the wig hair just behind your ears going up and over your head. A good place to sew the first seam across your wig is right behind your ears and extending up and over the top of the back part of your head. Use a comb or your fingers to part the wig hair running from one ear to the other and going up and over the top of the back part of your head. [7] X Research source If you are using a frontal wig, then the lace will usually end just behind your ears. [8] X Research source This should make it easy to part your wig."
    },
    {
      "title": "Sew into your braided natural hair from ear to ear.",
      "content": "Sew into your braided natural hair from ear to ear. Insert your weave needle through the wig and into the braid underneath it. Be careful not to sew down too far or you may stick your scalp with the needle. Continue sewing in a straight line from one ear to the other. [9] X Research source Make the stitches about ½” (1.3 cm) apart. If you are using a frontal wig, then sew along or near the back edge of the frontal. This should be just behind your ears since frontals are only about 4” (10 cm) wide from front to back. [10] X Research source"
    },
    {
      "title": "Sew into the hair in front of your ears.",
      "content": "Sew into the hair in front of your ears. The next place to sew the wig is the area in front of your ears near your temples. Most natural hairlines come to a point in this area. Sew along the edges of the wig in this area to secure this part of the wig in place. [11] X Research source"
    },
    {
      "title": "Part the wig hair where you wouldn’t normally part it and sew.",
      "content": "Part the wig hair where you wouldn’t normally part it and sew. The last places you will need to sew are areas where you do not normally part the wig hair. This will ensure that the seam will be hidden while still securing your wig across the top of your head. Locate a couple of areas where you never part your wigs and part the wig hair using a comb or your fingers. Then, sew across the parts. [12] X Research source For example, if you always part your wig hair down the center, then you can part the wig hair to the side and sew along this area going from the front to the back of the wig. Then, part the wig on the opposite side and sew across the wig in the same way. Be careful not to sew too far back. Stop before you reach the crown, or else the stitches might show."
    },
    {
      "title": "Cut and tie the thread when you finish sewing.",
      "content": "Cut and tie the thread when you finish sewing. After you finish sewing your wig in place, cut the thread away from the needle and then tie it into a knot. Cut the excess thread off from the knot as well."
    },
    {
      "title": "Use a toothbrush to blend in the edges of the wig with your baby hairs.",
      "content": "Use a toothbrush to blend in the edges of the wig with your baby hairs. To give your wig an even more natural look, you can use a toothbrush to comb and tease out some of your baby hairs along the edges of the wig. Get an old toothbrush and drag it along the edges of your hairline to bring out some of your baby hairs. [13] X Research source"
    },
    {
      "title": "Wash your wig hair as needed.",
      "content": "Wash your wig hair as needed. Whether the wig is human hair or synthetic hair, you will need to wash the wig to maintain it. Wash your wig after wearing it for about 10 days total, or any time you get sweaty, such as after a workout. [14] X Research source Keep in mind that you cannot blow dry a synthetic wig after washing it. A synthetic wig will have to air dry after you wash it."
    },
    {
      "title": "Style a human hair wig like your own hair.",
      "content": "Style a human hair wig like your own hair. Wigs that are made from human hair are the most versatile and high quality wigs available. If your wig is made from human hair, then you can blow dry, style, and even dye the hair. You can use curling irons and flat irons on the hair and add styling products to make your style last longer. [15] X Research source If your wig is synthetic, then you cannot use heat styling methods or dye the hair. However, you can still wash it and style it using non-heat styling, such as by putting foam rollers in the hair overnight to make it curly."
    },
    {
      "title": "Comb or brush out your wig daily.",
      "content": "Comb or brush out your wig daily. Wig hair gets tangled the same as your natural hair, so it is important to comb and/or brush out your wig hair daily. Start from the ends of the wig hair and work up towards your scalp. Make sure to brush or comb your hair gently to avoid pulling out hair from the wig. If you have any stubborn tangles, lightly mist the area with a leave-in conditioner to help loosen them."
    },
    {
      "title": "Wear a satin cap at night to protect the wig while you sleep.",
      "content": "Wear a satin cap at night to protect the wig while you sleep. After you go to all of the hard work of sewing a wig into place, make sure that the hair stays smooth and does not get tangled while you sleep. You can do this by wearing a satin cap over your wig while you sleep. When you remove the cap in the morning, your hair will still require some brushing and styling, but it will be mostly tangle-free. [16] X Research source If you don’t want to wear a cap while you sleep, consider sleeping on a satin pillowcase instead."
    }
  ]
}