{
  "url": "https://www.wikihow.com/Not-Cry-when-a-Teacher-Shouts-at-You",
  "title": "How to Not Cry when a Teacher Shouts at You",
  "steps": [
    {
      "title": "Remove yourself from the situation.",
      "content": "Remove yourself from the situation. It may not always be possible in school, but one of the best ways to prevent yourself from crying is to step away from the stressful situation, even for just a minute. If possible, excuse yourself to the bathroom or even to the other side of the room. You could also ask to go talk to your counselor. [1] X Research source If you get yelled at, don't run out of the classroom. Never leave the classroom without permission. This will only make your teacher angrier with you."
    },
    {
      "title": "Try a mental distraction.",
      "content": "Try a mental distraction. If you can't physically remove yourself from the situation, you can still remove yourself mentally from the stress. Focus your mind on something else to help you keep your cool while you're being yelled at. [2] X Research source Try focusing on your breathing. [3] X Expert Source Katie Styzek School Counselor Expert Interview. 25 November 2020. Inhaling and exhaling slowly and deeply can help keep you calm, and actively thinking about your breathing can help temporarily take your mind off of the situation with your teacher. Alternatively, you can try counting in your head or counting objects in the room, such as the floor or ceiling tiles."
    },
    {
      "title": "Give yourself a pep talk.",
      "content": "Give yourself a pep talk. If you feel like you're about to cry, try silently repeating some words of encouragement to yourself. This can help ignite your inner strength and keep you positive, so you'll feel much better about the situation and may not feel like crying anymore. [4] X Research source You can use whatever words or phrase you want. Some examples are \"I'll get through this\" or \"I'm strong and can deal with this situation.\" You can also give yourself a little hug to comfort yourself."
    },
    {
      "title": "Resist the urge to yell back.",
      "content": "Resist the urge to yell back. It is almost always a bad idea to yell back at your teacher, even if you have done nothing to deserve being yelled at. This will only make the situation more stressful, which will make it harder for you to stop yourself from crying. [5] X Research source Instead of yelling back, your goal should be to deescalate the situation as much as possible so that the stress that causes you to want to cry goes away. Being cooperative and polite in response to your teacher's yelling is usually a great way to do this."
    },
    {
      "title": "Pinch the bridge of your nose.",
      "content": "Pinch the bridge of your nose. If mental exercises aren't enough to keep you from crying, you may be able to stop oncoming tears by pinching the bridge of your nose. This will restrict the tear ducts, which may be enough to prevent yourself from crying. [6] X Research source"
    },
    {
      "title": "Have a talk with your teacher.",
      "content": "Have a talk with your teacher. If your teacher yells at you a lot, the two of you may have some issues that you need to sort out. Ask your teacher if you can talk before or after class. This will give you the opportunity to discuss the reason for the shouting, and hopefully solve the underlying problem. [7] X Research source If you feel your teacher is making unfair assumptions about you, say so, but do it in a diplomatic way instead of arguing. For example, you might say, \"I get the feeling that you think I don't care about your class, but I really do.\" If you don't know why your teacher is yelling at you, ask him or her to explain what expectations you are failing to meet."
    },
    {
      "title": "Admit when you are wrong.",
      "content": "Admit when you are wrong. In some cases, your teacher may be yelling at you because you are failing to take responsibility for your own actions. You can solve this problem by admitting when you make mistakes and not making excuses. [8] X Research source Never lie to your teacher. If you do something wrong, simply apologize instead of making an excuse. To make an apology sound more sincere, make sure you let your teacher know that you understand what you did wrong and that you will do your best not to do it again. For example, you might say, \"I know that I was distracting the rest of the class by telling jokes, and I am sorry for that. I will try not to interrupt the class again.\""
    },
    {
      "title": "Find a solution to the problem.",
      "content": "Find a solution to the problem. If you find that you are getting yelled at a lot for acting in a specific way, try to think of something you could do to help remove the temptation to act that way. Your teacher will likely appreciate the initiative you take in correcting your own behavior. [9] X Research source For example, if you cannot stop talking to your friends in class, ask your teacher to move your seat so that you will not be tempted anymore."
    },
    {
      "title": "Pay attention to what causes your teacher to yell.",
      "content": "Pay attention to what causes your teacher to yell. Everyone has different triggers that cause them stress. Try to notice the specific things that tend to cause your teacher to yell and shout, and then avoid doing those things. [10] X Expert Source Katie Styzek School Counselor Expert Interview. 25 November 2020. For example, some teachers may yell a lot when students talk out of turn, while other teachers may get more upset when students use their cell phones during class. In some cases, stressful situations may cause your teacher to be more irritable. For example, if you notice that your teacher tends to yell a lot more right before a big test, try to be on your best behavior when you know a test is coming up."
    },
    {
      "title": "Work to meet your teacher's expectations.",
      "content": "Work to meet your teacher's expectations. The best thing you can do to prevent your teacher from shouting at you in the future is to work hard to meet the classroom expectations. Every teacher is different, but you can get on almost any teacher's good side by behaving well and putting your best effort into your work. Be polite and respectful of everyone in class. Do your best academically, and do extra credit work if you're struggling. Be on time and come to class prepared. Offer to help out by collecting papers or stacking chairs."
    },
    {
      "title": "Recognize bullying behavior.",
      "content": "Recognize bullying behavior. Teachers can be bullies just like other students. Not all yelling and shouting should be considered bullying, however, so consider the situation carefully in order to determine whether the shouting goes beyond reasonable disciplinary measures. If it does, there is a chance your teacher may be bullying you. [11] X Research source Think about the behavior that you displayed leading up to the shouting. If you were doing something dangerous or irresponsible, the shouting may be warranted. If you were just asking the teacher a reasonable question, the shouting may be bullying. If a teacher insults or taunts you, this may be bullying. Any kind of physical abuse is bullying and is completely unacceptable."
    },
    {
      "title": "Share with your parents.",
      "content": "Share with your parents. If you're dealing with a teacher who yells at you for no reason, singles you out, or insults you, you need to tell your parents what is going on. [12] X Expert Source Katie Styzek School Counselor Expert Interview. 25 November 2020. They may be able to talk to the teacher and help resolve the problem for you. If that doesn't work, your parents can be your advocates and help you figure out other ways to handle the situation. [13] X Research source Be as specific as possible when detailing your teacher's actions. For example, instead of saying, \"My teacher is mean to me,\" say something like, \"My teacher called me stupid because I didn't understand the lesson.\" Giving clear examples will help your parents take you more seriously."
    },
    {
      "title": "Go up the chain of command.",
      "content": "Go up the chain of command. If you and your parents are not able to resolve the bullying problems directly with your teacher, you may want to consider speaking with the school counselor or principal. [14] X Expert Source Katie Styzek School Counselor Expert Interview. 25 November 2020. Try to start with the person to whom the teacher directly reports. In some cases, this might be the principal, but in other cases, it might be a senior teacher or the vice principal. [15] X Research source You may choose to have your parents do this for you, or you may decide that you want to be involved in the conversation. Instead of insulting the teacher, provide specific examples of the problems you are having with the teacher and explain how the teacher makes you feel."
    },
    {
      "title": "File a report.",
      "content": "File a report. If the principal fails to help the situation and the bullying is severe enough that it is interrupting your ability to learn, you and your parents should take your complaints to a higher level. You can submit a formal complaint to the school board or the superintendent. [16] X Research source It helps to provide some kind of proof with a formal complaint. If you have anything in writing that can demonstrate your teacher's bullying behaviors, make sure you keep it. If your concerns are still not addressed, you may want to ask your parents about the possibility of switching schools."
    }
  ]
}