{
  "url": "https://www.wikihow.com/Read-Your-Chinese-Horoscope",
  "title": "How to Read Your Chinese Zodiac Birth Chart",
  "steps": [
    {
      "title": "Your Chinese zodiac sign is based on your birth year.",
      "content": "Your Chinese zodiac sign is based on your birth year. Chinese astrology determines your animal sign based on your birth year, which begins on or around February 4th annually according to the lunar calendar. If you're born before the Lunar New Year begins, you're technically born in the prior year. Consult the chart below to find the year of your birth and the corresponding animal: [1] X Research source 1900, 1912, 1924, 1936, 1948, 1960, 1972, 1984, 1996, 2008, 2020 — RAT (鼠) 1901, 1913, 1925, 1937, 1949, 1961, 1973, 1985, 1997, 2009, 2021 — OX (牛) 1902, 1914, 1926, 1938, 1950, 1962, 1974, 1986, 1998, 2010, 2022 — TIGER (虎) 1903, 1915, 1927, 1939, 1951, 1963, 1975, 1987, 1999, 2011, 2023 — RABBIT (兔) 1904, 1916, 1928, 1940, 1952, 1964, 1976, 1988, 2000, 2012, 2024 — DRAGON (龙/龍) 1905, 1917, 1929, 1941, 1953, 1965, 1977, 1989, 2001, 2013, 2025 — SNAKE (蛇) 1906, 1918, 1930, 1942, 1954, 1966, 1978, 1990, 2002, 2014, 2026 — HORSE (马/馬) 1907, 1919, 1931, 1943, 1955, 1967, 1979, 1991, 2003, 2015, 2027 — GOAT(羊) 1908, 1920, 1932, 1944, 1956, 1968, 1980, 1992, 2004, 2016, 2028 — MONKEY (猴) 1909, 1921, 1933, 1945, 1957, 1969, 1981, 1993, 2005, 2017, 2029 — ROOSTER (鸡/雞) 1910, 1922, 1934, 1946, 1958, 1970, 1982, 1994, 2006, 2018, 2030 — DOG (狗) 1911, 1923, 1935, 1947, 1959, 1971, 1983, 1995, 2007, 2019, 2031 — PIG (猪) Some refer to the goat as the sheep or ram."
    },
    {
      "title": "Your zodiac animal reflects unique traits, like wit and warmth.",
      "content": "Your zodiac animal reflects unique traits, like wit and warmth. Just like in Western astrology, each sign is commonly associated with a number of traits. Here are a few details on what each sign is like. [2] X Research source Rat : This sign has spirit, wit, alertness, delicacy, flexibility, and vitality. People born in the year of the rat are bright, sociable, and ambitious, generally making them wealthy and successful. However, they can also be timid, lack concentration and stability, and don't fit most leadership positions. Ox : This sign is intelligent, self-confident, and a naturally-born leader. Those born in the year of the ox are honest, industrious, patient, and above all else, do things steadily. No matter what, they always maintain a strong devotion to their work. However, they may also be prudish, obstinate, and poor at communication. Tiger : These individuals are tolerant, valiant, considerate, intelligent, and respected. They like challenges and are quite good at expressing themselves. People born in the year of the tiger may also be short-tempered and not easily interested in much. Rabbit : This sign is gentle, sensitive, compassionate, amiable, and modest. They are humorous and add spice to life—mainly because they can't stand things being dull. However, they tend to manage money poorly,lack determination, and be stubborn. Dragon: This sign is bright, self-assured, and romantic. They are also lively, intellectual, energetic, and excitable. They make good leaders and always aim for perfection. However, those born in the sign of the dragon can be arrogant, impatient, and sometimes overconfident. Snake : This sign is charming and skilled at communicating effectively with few words. They are very moral and full of wisdom. For most, money isn't a problem. However, they can be jealous and suspicious and often tend to overdo things. Horse : This sign is cheerful, quick-witted, kind to others, and loves adventure. They are also perceptive and talented, making good entertainers. However, those born in this sign can be impatient, lack substance, and come across as superficial. Goat : Those born in the sign of the goat are tender, polite, clever, gentle, and kind-hearted. They appreciate art and beauty, and have a soft spot for quiet living. However, they can be shy, pessimistic, moody, and worry too much. Monkey : This sign is incredibly clever. They are lively, flexible, quick-witted, and are very talented problem solvers. And they're very generous to boot! Weaknesses? They can be rather jealous, conniving, and selfish. Rooster : Those born in the sign of the rooster are deep thinkers, often thought of as honest, bright, communicative, and warm-hearted. They have high self-worth and tend to be independent. However, they may also have difficulty relating to others and tend to assume they are always right. Dog : This sign is loyal, courageous, warm, responsible, smart, and realistic. They can easily inspire confidence in others. On the other hand, they lack stability, can have a biting tongue, and easily find fault in others. Pig : This sign is diligent, courageous, honest, and chivalrous. They are tolerant, calm, and optimistic. They hate conflict and don't enjoy lying. However, people born under the sign of the pig can be naive, impulsive, and have trouble knowing when to draw the line."
    },
    {
      "title": "Your sign has a lucky number and a lucky color.",
      "content": "Your sign has a lucky number and a lucky color. Every person’s zodiac animal has a corresponding color and number, which are thought to be lucky, so use them to your advantage! [3] X Research source Rat : Lucky numbers: 2, 3 Lucky colors: blue, gold, green Ox : Lucky numbers: 9, 1 Lucky colors: blue, red, purple Tiger : Lucky numbers: 1, 3, 4 Lucky colors: blue, grey, white, orange Rabbit : Lucky numbers: 1, 4, 9 Lucky colors: red, pink, purple, blue Dragon : Lucky numbers: 1, 7, 6 Lucky colors: gold, silver, grey Snake : Lucky numbers: 2, 8, 9 Lucky colors: red, light yellow, black Horse : Lucky numbers: 2, 3, 7 Lucky colors: brown, yellow, purple Goat : Lucky numbers: 3, 9, 4 Lucky colors: green, red, purple Monkey : Lucky numbers: 1, 8, 7 Lucky colors: white, gold, blue Rooster Lucky numbers: 7, 5, 8 Lucky colors: gold, brown, brownish yellow, yellow Dog : Lucky numbers: 3, 4, 9 Lucky colors: green, red, purple Pig : Lucky numbers: 2, 5, 8 Lucky colors: yellow, grey, brown, gold"
    },
    {
      "title": "Each sign corresponds to yin or yang based on your birth year.",
      "content": "Each sign corresponds to yin or yang based on your birth year. Every zodiac animal is either yin or yang. This is the side of your personality that naturally has more power—though anything can change in alignment with the stars. Moreover, every year is also either yin or yang. Odd years are yang and even years are yin. Whatever the current year is, it's that side of the spectrum that tends to get emphasized. Yin is associated with passivity, coldness, femininity, submission, and dark energy. Yang represents activity, heat, masculinity, aggressiveness, and light energy. Remember: everyone contains both— it's just a cycle. You start with yin, say, until it blooms and turns into yang. Remember to also take into account whether the current year is yin or yang. Here is where each sign stands: Rat : Yang Ox : Yin Tiger : Yang Rabbit : Yin Dragon : Yang Snake : Yin Horse : Yang Goat : Yin Monkey : Yang Rooster: Yin Dog : Yang Pig : Yin"
    },
    {
      "title": "Each sign is compatible (or not) with others based on their traits.",
      "content": "Each sign is compatible (or not) with others based on their traits. It is believed that each sign romantically lines up — or really, really doesn't line up— with other signs. Here are some of the best and worst matches according to Chinese astrology: Rat : most compatible with dragon, monkey, and ox; least with sheep, horse, and rabbit Ox : most compatible with rat, snake, rooster; least with horse, dog, sheep Tiger : most compatible with horse, dog; least compatible with snake, monkey Rabbit : most compatible with sheep, pig, dog; least with rat, dragon Dragon : most compatible with rat, monkey, rooster; least with ox, rabbit, dog Snake : most compatible with ox, rooster; least with tiger, pig Horse : most compatible with tiger, sheep, dog; least with rat, ox, rabbit Goat : most compatible with rabbit, horse, pig; least with ox, dog Monkey : most compatible with rat, dragon, snake; least with tiger, pig Rooster : most compatible with ox, dragon, snake; least with rat, rabbit, dog Dog : most compatible with tiger, rabbit, horse; least compatible with ox, dragon, sheep, rooster Pig : most compatible with sheep, rabbit; least with snake, monkey, pig"
    },
    {
      "title": "Your birth month, day, and time reveal your four pillars of destiny.",
      "content": "Your birth month, day, and time reveal your four pillars of destiny. There is far, far more to Chinese astrology than just the 12 signs of the Zodiac. There are also the Four Pillars of Destiny, which represent the year, month, day, and hour you were born, in that order. It's similar to the birth chart used in Western astrology, but believed to be a lot more accurate, offering tons of insight into your personal life. [4] X Research source They are also combined with yin and yang and the 5 elements (metal, wood, water, fire, earth). Together, they determine your luck, affluence, longevity, happiness, and wealth year by year. Chinese astrology works in 60-year (or sexagesimal) cycles. This is a numeral system that originated in Mesopotamia, using the number 60 as the base. [5] X Research source Each of the 60 years in the cycle is named after the combination of one heavenly stem with one earthly branch . Every 60 years, the combination repeats."
    },
    {
      "title": "Your birth year determines your first pillar.",
      "content": "Your birth year determines your first pillar. Your zodiac animal (determined by your birth year) explains the traits you’ll have and your fortune until about age 16. Your first pillar represents the fate of your childhood and the influence of your parents and grandparents. [6] X Research source"
    },
    {
      "title": "Your birth month determines your second pillar and “inner” animal.",
      "content": "Your birth month determines your second pillar and “inner” animal. Your second pillar is also believed to reveal information about your family, career, and home life. It represents your fate from age 17 to 32. [7] X Research source Here's how it correlates to the Western calendar: February 4th - March 5th: Tiger March 6th - April 4th: Rabbit April 5th - May 4th: Dragon May 5th - June 5th: Snake June 6th - July 6th: Horse July 7th - August 6th: Goat August 7th - September 7th: Monkey September 8th - October 7th: Rooster October 8th - November 6th: Dog November 7th - December 6th: Pig December 7th - January 5th: Rat January 6th - February 3rd: Ox"
    },
    {
      "title": "The day of your birth determines your third pillar.",
      "content": "The day of your birth determines your third pillar. This third pillar is believed to divulge information about your adult life on a day-to-day basis—a pretty important one! It represents your fate from age 33 to 48. [8] X Research source Again, it is a sexagesimal cycle that starts when the sun reaches the celestial longitude of 315° and ends when it reaches the longitude of 330°. Therefore, each year is just a teeny bit different. If all this math seems a bit complicated, that’s because it is! So, it may be a good idea to allow an online calculator to do the work for you."
    },
    {
      "title": "Your birth hour determines your fourth pillar and your “secret” animal.",
      "content": "Your birth hour determines your fourth pillar and your “secret” animal. This is thought to be the truest representation of yourself. It is also used to represent information about your kids or your senior years, past the age of 48. Your later years are believed to depend on the combination of your heavenly stem and earthly branch. If either presents a conflict, it could lead to turbulence in the latter half of your life, also affecting your children. Here's how it lines up: [9] X Research source 1:00 - 03:00 AM: Ox 3:00 - 5:00 AM: Tiger 5:00 - 7:00 AM: Rabbit 7:00 - 9:00 AM: Dragon 9:00 - 11:00 AM: Snake 11:00 AM - 1:00 PM: Horse 1:00 - 3:00 PM: Ram 3:00 - 5:00 PM: Monkey 5:00 - 7:00 PM: Rooster 7:00 - 9:00 PM: Dog 9:00 - 11:00 PM: Pig 11:00 PM - 1:00 AM: Rat"
    },
    {
      "title": "The 10 Heavenly Stems represent the elements, while the 12 Earthly Branches represent the animal signs.",
      "content": "The 10 Heavenly Stems represent the elements, while the 12 Earthly Branches represent the animal signs. You have your own complicated sign, but the years have more detail to them too; each one has a stem paired with a branch. One Earthly Branch corresponds to your animal sign, while one Heavenly Stem is assigned to your element. The in-depth science of this aspect of Chinese astrology is highly nuanced and complex, but here is a brief overview. [10] X Research source To identify your Heavenly Stem, use the last digit of your birth year: [11] X Research source Metal = 0 or 1 Water = 2 or 3 Wood = 4 or 5 Fire = 6 or 7 Earth = 8 or 9 For example, if you were born in 1986, you’re a Fire Tiger. Since this is all part of a repeating, 60-year cycle, there will always be movement and change. The element you were born under will be naturally emphasized, but consider how it will work in tandem with the element of the current year. For example, if you’re a Fire Tiger, how might that factor into 2025, a wood year? Some years will work with your element, while others will work against it , creating harmony and disharmony. There are believed to be two cycles: the creative cycle and the destructive cycle. For example, water destroys fire but produces wood, and so forth. Each element affects others in different ways, creating a perfect balance."
    },
    {
      "title": "Work with your cycles.",
      "content": "Work with your cycles. Remember that this is a blueprint or map. It cannot be changed. That is nothing to fret about! The Chinese believe that this is knowledge to make you powerful—you will be better able to overcome obstacles and grasp opportunities when need be. In other words, you can always do the right thing at the right time. Remember that good luck and all positive things don't just happen. This chart is telling you that at certain times, they have potential . You have to go out and get it! By knowing your chart, you'll know when those times are and when you should make your move in alignment with the stars. Divina discusses some of the benefits that come as a result of learning more about your entire zodiac chart. She says, “There's a peace that comes along with knowing that there's an inevitability to certain things.” She shares an anecdote: “It's funny, clients can be relieved to hear bad news. You can tell them, ‘You're gonna have a really hard year, and it's going to continue for another 2 years—and then it's going to get easy.’ And it's relieving to hear that because then they can just relax.” She goes on to explain that it allows those who know and understand their own path to focus on the things that they can actually change, with the amount of free will they do have, instead of trying to wrestle with something that's not right before a period of huge transformation."
    },
    {
      "title": "Talk to an astrologist or Feng Shui master.",
      "content": "Talk to an astrologist or Feng Shui master. To know what seasons (parts of the cycle) or years will be for better or worse, talk to a master of Chinese astrology. They'll be able to pinpoint when you're lucky and, quite frankly, when you're not. Certain seasons (days, even) will be better than others (especially to take action) and they can outline that cycle for you. Carry a lucky symbol with you. Let's say you're a goat and it's a bad year for you, but it's a great year for the Ox. Carry a little trinket of an Ox around you to circumvent the negative airs around you. Use an online calculator if you'd like to figure out your sign the easy way. Remember to account for the timezone of your birth, which is important. Finally, don't forget that year of your birth refers to the lunar year, typically beginning on or before February 4th."
    },
    {
      "title": "The Chinese Zodiac may have roots in the Qin dynasty.",
      "content": "The Chinese Zodiac may have roots in the Qin dynasty. The Qin dynasty took place from 221–207 BCE, and some sources claim that this is where the Chinese Zodiac first began. Other records point to later periods, like the Han dynasty, from 206 BCE–220 CE, or the Warring States period, lasting from 475–221 BCE. Although its origins are up for debate, most scholars agree that the creation of the Chinese Zodiac was inspired by a famous folk legend about a race between animals. [12] X Research source In the legend, some accounts tell of the Jade Emperor calling for the race, while others believe that Buddha is responsible for orchestrating it. The reason behind the race was to form the zodiac itself, and the animals were asked to participate for an opportunity to be represented in the zodiac. The first 12 animals to cross the finish line are the ones who earned a place, in the order in which they finished the race, resulting in the order we still use today."
    }
  ]
}