{
  "url": "https://www.wikihow.com/Measure-a-Baseball-Glove",
  "title": "How to Measure a Baseball Glove: Positions, Sizing Charts, & More",
  "steps": [
    {
      "title": "Measure from the tip of the glove’s index finger to the base of the heel.",
      "content": "Measure from the tip of the glove’s index finger to the base of the heel. Run a flexible tape measure down the finger and along the palm to the bottom of the glove. This number will give you the size of the baseball glove in inches. [1] X Research source The size of the glove is also often etched into the leather on the pinky or thumb of the glove. [2] X Research source The “heel” is the palm area of the glove where the finger pockets all connect. You can also use a length of string to measure this, then use a ruler or measuring tape to measure the length of string."
    },
    {
      "title": "Wrap a measuring tape around the center of a glove horizontally.",
      "content": "Wrap a measuring tape around the center of a glove horizontally. This will give you the measurement of the catcher’s mitt. You can also measure it with a string–mark on the string where its ends meet, then measure the distance between the marks to find the size of the glove in inches. [3] X Research source Catcher’s mitts are measured this way because they place a greater emphasis on the catching area of the mitt, where the ball will land. [4] X Research source"
    },
    {
      "title": "Measure softball gloves using the same methods as baseball gloves.",
      "content": "Measure softball gloves using the same methods as baseball gloves. Though softball gloves are constructed differently to accommodate different hand sizes and a larger ball, they’re measured in the same manner as baseball gloves. [5] X Research source Softball catcher’s mitts are also measured by circumference, as well."
    },
    {
      "title": "Purchase a glove that fits the position you play.",
      "content": "Purchase a glove that fits the position you play. Different gloves are better suited to different positions, and purchasing a glove that fits the needs of the position may help you play better. [6] X Research source Outfielders’ gloves are for players playing left, center, or right field. They're typically longer than other gloves with deeper pockets to help outfielders catch fly balls. [7] X Research source Second base/shortstop gloves are small and lightweight, since these players need quick and easy access to the ball once they’ve caught it. [8] X Research source First base gloves tend to be longer and larger than the others to help players scoop balls off the ground and catch quick passes. [9] X Research source Third base gloves are larger to more easily catch a pass since third basemen don’t typically need to make quick passes themselves. [10] X Research source Pitcher’s gloves are most dependent on a player’s taste, however most pitcher’s gloves tend to have a closed web to conceal the pitcher’s fingers as they signal which pitch they’re about to throw. [11] X Research source Catcher’s mitts are the largest and have plenty of padding to protect a catcher’s hand against the pitcher’s powerful throws. [12] X Research source If you’re unsure of the player’s position, or they play many positions, choose a middle infield glove or “utility” glove , which is a good all-around glove that suits many styles of play. [13] X Research source"
    },
    {
      "title": "Choose a glove for the correct hand.",
      "content": "Choose a glove for the correct hand. Baseball gloves are made for both right- and left-handed players. A player throws a baseball with their dominant hand, and the glove rests on their other hand. Gloves are labeled by dominant hands. This can be confusing, since gloves labeled as “right-handed” are actually worn on the left hand. [14] X Research source"
    },
    {
      "title": "Try on the glove if possible.",
      "content": "Try on the glove if possible. Though gloves are widely available online, it’s best to visit an outlet in person in order to get a better feel for the glove before you purchase it. The best glove is one that the player feels comfortable using, regardless of measurement guides or glove components. [15] X Research source If you can’t try on a glove, purchase a size according to the above chart."
    },
    {
      "title": "Select the appropriate glove size, rather than sizing up.",
      "content": "Select the appropriate glove size, rather than sizing up. It might be tempting to buy a younger player a glove they can “grow into,” however a glove that’s too large could make it harder for a young player to handle their glove. If size is a concern, don’t buy a glove more than about a half in larger than you think the player will need. [16] X Research source"
    },
    {
      "title": "Buy a durable leather glove.",
      "content": "Buy a durable leather glove. Leather gloves tend to be more durable than vinyl gloves, which are also harder to break in . Leather gloves will last 2 or more seasons and can be more easily broken in to mold to a player’s hand. [17] X Research source"
    },
    {
      "title": "Webbing",
      "content": "Webbing The webbing is the area between the index finger and thumb, and is used to mitigate the force of the ball as it enters the glove. [18] X Research source More widely spaced webbing is typically better for infielders who need to retrieve the ball quickly, Outfielders and third-base players benefit from tighter webbing, which makes the ball easier to catch. [19] X Research source Basket webbing is tightly woven, and often makes it easier to close the glove. Trapeze webbing resembles shoelaces and can create a deeper pocket in the glove. Modified trap webbing adds a leather strip to the top of the glove, and is used by pitchers, infielders, and outfielders. H-webbing is created by leather strips that resemble the letter H, and is designed to let debris empty through the glove. I-webbing consists of a large center leather strip in the shape of an I, and helps to get the ball in and out of the glove. Cross webbing is composed of two perpendicular strips of leather and provides good flexibility. Two-piece webbing has large leather panels, and helps conceal pitches."
    },
    {
      "title": "Palm",
      "content": "Palm The palm of the glove is the padded base from which the fingers extend. This area is padded to protect the hand from the force of the ball. [20] X Research source"
    },
    {
      "title": "Heel",
      "content": "Heel This is the lower section of the palm. It protects the hand, and helps keep the ball secure in the glove. [21] X Research source"
    },
    {
      "title": "Lacing",
      "content": "Lacing The lacing is what keeps the glove together, and also acts as the force the shapes the glove. This is typically made of leather to allow it break in more easily as the player uses the glove. [22] X Research source"
    },
    {
      "title": "Hinge",
      "content": "Hinge This is the portion of the glove that flexes as the glove opens and closes. [23] X Research source It also determines how easily the glove can open. Younger players may need a looser hinge. [24] X Research source"
    }
  ]
}