{
  "url": "https://www.wikihow.com/Relationships/What-to-Talk-About-on-the-Third-Date",
  "title": "What to Talk About on the Third Date: 11 Tips to Spark Connection",
  "steps": [
    {
      "title": "The third date is a good time to clarify what you’re looking for.",
      "content": "The third date is a good time to clarify what you’re looking for. If you’re someone who’s only interested in a casual fling then a date that’s looking to get hitched as soon as possible probably isn’t the best option. What you want with a certain person can change over time, but knowing where you each stand at the beginning is a good idea. Being open about your dating goals from the beginning can give your relationship a foundation of clear communication, so talk about things like: [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source “What kind of a relationship are you looking for?” “Do you think you want to settle down someday?” “Are you looking for something serious or casual?”"
    },
    {
      "title": "If you’re thinking long-term, it’s good to be on the same page.",
      "content": "If you’re thinking long-term, it’s good to be on the same page. Asking someone about their dreams and ambitions helps you understand if you share goals on things like careers and families. Ask something like: [2] X Research source “Where do you see yourself in 5 years?” “Do you have any dreams for yourself?” “What kind of person do you want to be?”"
    },
    {
      "title": "Comparing values is important when figuring out your compatibility.",
      "content": "Comparing values is important when figuring out your compatibility. What are the things that are most important to you? If you and your date have completely opposite views on things like financial responsibility, the importance of family, or right and wrong, you might find it difficult to build a healthy relationship together. Ask questions like: [3] X Research source “What’s the most important thing in the world to you?” “What’s something that makes you angry about the world?” “Are you close to your family?”"
    },
    {
      "title": "Politics and religion are fair game with a new relationship.",
      "content": "Politics and religion are fair game with a new relationship. If these are important subjects to you, it’s a good idea to bring them up when the third date comes around. Finding a compatible partner means being willing to talk about controversial topics, so discuss questions like: [4] X Research source “Do you believe in God?” “Is religion something that’s important to you?” “How would you describe your political beliefs?”"
    },
    {
      "title": "How someone spends their time tells you a lot about them.",
      "content": "How someone spends their time tells you a lot about them. Figure this out to learn what a life with them would look like. If your date is someone who prefers to spend their time at home and you’re always looking for the next adventure, you might find it tough to be happy together. Talk about things like: [5] X Trustworthy Source Greater Good in Action An initiative by UC Berkeley's Greater Good Science Center promoting science-based practices for a meaningful life Go to source “Tell me what an average day looks like for you.” “What would be your idea of a perfect day?” “What gets you up in the morning?” Reader Poll: We asked 491 wikiHow readers which conversation topic they’d be most interested in discussing with a girl they’re dating and getting to know, and 6% of them said What she does for fun. [Take Poll]"
    },
    {
      "title": "Sharing childhood experiences teaches you a lot about each other.",
      "content": "Sharing childhood experiences teaches you a lot about each other. All of us are shaped by our childhoods, and so asking your date to describe themselves as a kid can give you a better understanding of their life and personality. If they seem uncomfortable talking about their childhood, respect their privacy. But if they seem open to it, say something like: [6] X Research source “What were you like as a kid?” “I was a pretty shy kid, which is weird because I’m so extroverted now. I think I had to teach myself how to be more outgoing.” “We moved around a lot when I was a kid, so I never had friends that lasted too long. Now, my friendships are something I pour a lot of energy into.”"
    },
    {
      "title": "Find out what made them who they are.",
      "content": "Find out what made them who they are. Many people point to certain moments that changed their life. Open up to your date about what the most important experiences in your life so far have been, and how they’ve impacted you as a person. Then ask your partner to do something similar. Give yourselves a chance to see how you each narrate your lives by saying something like: [7] X Trustworthy Source Greater Good in Action An initiative by UC Berkeley's Greater Good Science Center promoting science-based practices for a meaningful life Go to source “Could you tell me about what in your life has made you the person you are today?” “Losing my dad at an early age really taught me how to take care of myself. That’s always been a really important part of who I am.” “I had a teacher when I was in school who taught me how important reading is. I’m really grateful to her for that.”"
    },
    {
      "title": "Opening up about embarrassing experiences creates comfort.",
      "content": "Opening up about embarrassing experiences creates comfort. While dates 1 and 2 might have been about impressing each other, the third date is the time to let down your guard a little. Sharing embarrassing stories with your date can make you both feel more at ease around each other, so say something like: [8] X Research source “I once failed a job interview because I got lost looking for the bathroom. When I finally showed up late to the interview, there was toilet paper stuck to my pants.” “I’m probably the worst dancer you’ve ever met. My friends don’t even like going with me to the club anymore.” “Alright, I’m already very impressed with you. How about you tell me something embarrassing that’s happened to you?”"
    },
    {
      "title": "Telling your date how you appreciate them builds your intimacy.",
      "content": "Telling your date how you appreciate them builds your intimacy. What you like in someone else can actually say a lot about who you are as a person as well. Compliments feel good to everyone, and after 2 dates, you probably know enough about someone to tell them what about them stands out to you. You can say things like: [9] X Trustworthy Source Greater Good in Action An initiative by UC Berkeley's Greater Good Science Center promoting science-based practices for a meaningful life Go to source “I really admire how passionate you are about the causes you care about. It inspires me.” “I think you have an amazing ability to make the people around you feel comfortable.” “It might sound a little strange, but I want to play a game with you. Let’s each list three things we like about each other.”"
    },
    {
      "title": "To be safe and fun, sex requires communication.",
      "content": "To be safe and fun, sex requires communication. You might have heard of the “third date rule” that says that sex normally happens on the third date. There’s no truth behind this—some couples might have sex on the first date, while others might wait until the 20th. The important thing is that you’re on the same page if you do end up going home together, so talk about things like: [10] X Research source “What makes you feel good?” “What kind of sex do you like?” “What kind of safe sex methods work best for us?”"
    },
    {
      "title": "If you liked the date, make plans for another immediately.",
      "content": "If you liked the date, make plans for another immediately. It’s okay if you want more time to decide, but it can really show your enthusiasm for one another if you make plans for another date as soon as you say bye. [11] X Expert Source Judith Gottesman, MSW Matchmaker & Dating Coach Expert Interview. 19 October 2021. If you know you want to see this person again, say something like: [12] X Research source “I really had a great time with you tonight. I already know I want to see you again next week.” “I have so much fun with you. Honestly, I can’t wait until I get to see you again. How about Friday?” “Since we’re both into horror movies, what do you say about watching one this weekend together?” \"Maybe next time we can go to that restaurant we both love.\" [13] X Expert Source Judith Gottesman, MSW Matchmaker & Dating Coach Expert Interview. 19 October 2021. If too much time passes between dates, your future outings may not end up happening. [14] X Expert Source Judith Gottesman, MSW Matchmaker & Dating Coach Expert Interview. 19 October 2021."
    }
  ]
}