{
  "url": "https://www.wikihow.com/Play-Dreidel",
  "title": "How to Play Dreidel",
  "steps": [
    {
      "title": "Get a dreidel.",
      "content": "Get a dreidel. The dreidel you will get will depend on where you live. Outside of Israel, the four letters on the sides of the dreidel are Nun, Gimmel, Hay, and Shin, which stand for \"A Great Miracle Happened There,\" [3] X Research source referring to the miracle of the oil. In Israel, where the miracle happened, the dreidel has the letters Nun, Gimmel, Hay, and Pey , which means \"A Great Miracle Happened Here.\""
    },
    {
      "title": "Gather friends.",
      "content": "Gather friends. You can play with as few as two, but the more the merrier! Distribute tokens evenly among all of the players. The tokens can be any little thing: pennies, nuts, raisins, matchsticks, etc. A lot of people use gelt."
    },
    {
      "title": "Ante up.",
      "content": "Ante up. Before each spin, players put one token in the middle of the circle to create \"the pot.\" Every time the pot is emptied, or there's only one token left, every player should put a token in the pot."
    },
    {
      "title": "Take turns spinning the dreidel.",
      "content": "Take turns spinning the dreidel. When it's your turn, spin the dreidel once. The letter which comes up once it stops spinning determines whether you win, lose, or draw. According to the letter appearing, the player should perform the following action: [4] X Research source Shin (\"shtel\" or \"put in\" in Yiddish) - Put one more token in the pot. Nun (\"nisht\"or \"nothing\" (in Yiddish) - Do nothing. Gimmel (\"gantz\"or \"everything\" in Yiddish) - Take all tokens from the pot. Hay (\"halb\"or \"half\" in Yiddish) - Take half of all tokens lying in the pot. In case of an odd number of tokens, round up. If you run out of tokens, you are either \"out,\" or you may ask another player for a loan."
    },
    {
      "title": "Pass the dreidel on to the next player.",
      "content": "Pass the dreidel on to the next player."
    },
    {
      "title": "Keep playing until someone wins by collecting all the tokens.",
      "content": "Keep playing until someone wins by collecting all the tokens."
    }
  ]
}