{
  "url": "https://www.wikihow.com/Roll-a-Burrito",
  "title": "How to Roll a Burrito",
  "steps": [
    {
      "title": "Make sure your tortilla is large enough for its contents.",
      "content": "Make sure your tortilla is large enough for its contents. A good rule of thumb is to have your burrito at least twice as big as the contents you'll put in it. That means that you have fold the burrito in half, with the contents inside, and easily reach both ends together with room to spare."
    },
    {
      "title": "Put some moisture into your tortilla.",
      "content": "Put some moisture into your tortilla. This step is essential. Getting your tortilla warm and moist makes it pliable, meaning that it's easier to work with. [1] X Research source To get that warm moisture into your tortilla, try any one of the following: Place the tortilla under a large panini press on medium setting for 20 to 30 seconds. Place the tortilla on a plate in the microwave for 30 seconds, using the high setting. Steam the burrito, using a commercial steamer."
    },
    {
      "title": "Carefully add the contents of the burrito to the center of the tortilla.",
      "content": "Carefully add the contents of the burrito to the center of the tortilla. You probably already have an idea of what you want to put into your burrito, but if not, you can take a cue from these examples: [2] X Research source Beans (black, refried, pinto, etc.) Rice (white, brown, or \"Spanish\") Meat (carnitas, carne asada, chicken, etc.) Cheese Lettuce Salsa (\"red,\" i.e. pico de gallo, or \"green,\" i.e. tomatillo salsa) Sour cream Guacamole"
    },
    {
      "title": "Join the front and bottom flap and quickly lift the tortilla into the air.",
      "content": "Join the front and bottom flap and quickly lift the tortilla into the air. Make sure to keep the contents of the burrito in the tortilla. Set it back down again, open faced. [3] X Research source"
    },
    {
      "title": "Pull the left flap of the tortilla over the burrito contents, toward the center.",
      "content": "Pull the left flap of the tortilla over the burrito contents, toward the center. Hold this flap in place. It likely won't reach the center, but it should create a pocket that holds one side of your fillings in place."
    },
    {
      "title": "Pull the right flap of the tortilla over the burrito contents, toward the center.",
      "content": "Pull the right flap of the tortilla over the burrito contents, toward the center. Your tortilla flaps probably won't overlap at this point. Don't pull too hard on the ends of the flaps as you fold them over to the center. This could rip the tortilla, causing the contents to spill out before they spill into your mouth."
    },
    {
      "title": "Tuck the top flap of the tortilla underneath the burrito contents using one or two hands.",
      "content": "Tuck the top flap of the tortilla underneath the burrito contents using one or two hands. In this step, you should be pulling all of the burrito contents toward your body, into the center of the burrito."
    },
    {
      "title": "Starting from your body and moving outward, roll the burrito forward.",
      "content": "Starting from your body and moving outward, roll the burrito forward. This will bring the burrito together into a cylindrical shape. If you can, let the burrito rest on top of the last little flap for a minute or two; this helps fuse the ends of the tortilla together, making them stick together. [4] X Research source"
    },
    {
      "title": "Wrap the burrito in foil.",
      "content": "Wrap the burrito in foil. This does three things: It provides insulation to keep the burrito warm; it helps compact the burrito even more; it gives the person eating the burrito a mold to help keep the burrito together. [5] X Research source"
    },
    {
      "title": "Put some moisture into your tortilla.",
      "content": "Put some moisture into your tortilla. Again, this step is essential. You can microwave your tortilla, steam it, or put it through a panini press to get the desired heat and moisture. Whichever works best for you."
    },
    {
      "title": "Carefully add the contents of the burrito to the center of the tortilla, being careful not to overload.",
      "content": "Carefully add the contents of the burrito to the center of the tortilla, being careful not to overload. Place a smaller amount of burrito filling directly into the center of the tortilla."
    },
    {
      "title": "Fold the left and right sides of the tortilla toward the center.",
      "content": "Fold the left and right sides of the tortilla toward the center. Either the tortilla sides will meet, or the contents of the burrito will tell you when you should stop."
    },
    {
      "title": "Grab the bottom flap of the tortilla and tuck it over and then under the contents of the burrito.",
      "content": "Grab the bottom flap of the tortilla and tuck it over and then under the contents of the burrito. This is much like the tuck motion you performed rolling a larger burrito."
    },
    {
      "title": "Continue rolling the tortilla until it assumes its traditional cylinder.",
      "content": "Continue rolling the tortilla until it assumes its traditional cylinder. Your smaller burrito has been successfully rolled."
    },
    {
      "title": "Wrap the burrito in foil.",
      "content": "Wrap the burrito in foil. This provides insulation to keep the burrito warm; helps compact the burrito even more; and gives the person eating the burrito a mold to help keep the burrito together. [6] X Research source"
    }
  ]
}