{
  "url": "https://www.wikihow.com/Remember-All-50-States-of-USA",
  "title": "How to Remember All 50 States of USA",
  "steps": [
    {
      "title": "Listen to a fifty states song.",
      "content": "Listen to a fifty states song. You can find many songs online that sing all fifty states in alphabetical order. This video uses a rhyming song, which might be easier to learn. [1] X Research source Try this song instead if you just want a song without a video, or if you like the tune more. Listen to the song several times and try to sing along. [2] X Research source"
    },
    {
      "title": "Make a list of states to help you learn the song.",
      "content": "Make a list of states to help you learn the song. Find a list of states online , or print out a copy. Look away from the list and try to sing the song yourself. Whenever you get stuck, look back at the list and find the name of the next state. Look away again and try to sing the next part of the song. [3] X Research source Listen to the song again if you get completely stuck."
    },
    {
      "title": "Use a phrase instead.",
      "content": "Use a phrase instead. If the songs aren't helping, try a phrase that helps your memory instead. Here's a phrase that lists the first letter of each state: US PVC WOK MACHINING DATA 7M5N FAILS WW I TV WORK CON. Look at the full list of states in this order. Repeat this phrase to yourself many times, then try to write down the states in this order. In this phrase, \"7M5N\" means \"list 7 states starting with M and 5 states starting with N\". PVC is a kind of plastic, and WWI is short for \"World War One.\" (If you know what the words mean, you're more likely to remember the phrase.) These are called \"mnemonic devices\" (pronounced \"neh-mawn-ick\"), meaning \"memory helpers.\""
    },
    {
      "title": "Find someone else to test you.",
      "content": "Find someone else to test you. Hand the list of states to a family member or friend. Sing the song or recite the state names while the other person looks at the list. Ask the other person to stop you if you miss a state. [4] X Research source"
    },
    {
      "title": "Use an online quiz.",
      "content": "Use an online quiz. An online quiz will teach you to spell all fifty states to, since you have to type the name in correctly for it to count. Try naming as many as you can in ten minutes . Once you can do that, try it in five minutes ."
    },
    {
      "title": "Use similar sounds to remember difficult names.",
      "content": "Use similar sounds to remember difficult names. Once you can name most of the states, use this trick to remember the names you keep getting stuck at. Find a phrase you know that sounds like part of the state name. For instance, \"Swing-and-a- Miss-issippi \" or \" I-ow-a- dollar to my brother\" (\"I owe a dollar\"). Chant these phrases, or include the whole phrase in your song or spoken list of states to help you remember them."
    },
    {
      "title": "Watch a video listing all the states on a map.",
      "content": "Watch a video listing all the states on a map. Try out this video for a short song version. [5] X Research source If you like learning through pictures or stories as well as song, watch this video instead."
    },
    {
      "title": "Test yourself on a blank map.",
      "content": "Test yourself on a blank map. Find a map of the United States that has the borders of the states drawn in, but not the names. Print out several copies from an online map if you don't have a paper handout. Try to write all the state names in order of their location on the map, or using the order you learned from a video or your teacher. Check how many you got right using an atlas or an online picture . Cross out the names you got wrong, and write in the correct ones. [6] X Trustworthy Source US Bureau of Labor Statistics U.S. government agency that collects and reports labor-related information Go to source"
    },
    {
      "title": "Use an online quiz.",
      "content": "Use an online quiz. An online quiz can be great for helping you remember the position of each state separately, without having to repeat a long list every time. Try this quiz , which lets you choose the difficulty (\"study\", \"test\", or \"strict test\"). Read the question, then click on the part of the picture where you think that state is. [7] X Trustworthy Source US Bureau of Labor Statistics U.S. government agency that collects and reports labor-related information Go to source"
    },
    {
      "title": "Invent \"links\" between states when you're having trouble.",
      "content": "Invent \"links\" between states when you're having trouble. If you keep forgetting the name of a state, try linking it to a state you do remember next to it. The more creative and ridiculous the \"link\" you invent, the more likely you are to remember it. For example: Think of \" Washing dishes with oregano \" to remember that Washington is next to Oregon. Repeat \"The O.K. Llama pokes the text book\" to remember that Oklahoma looks like a finger jutting out to poke Texas."
    },
    {
      "title": "Focus on a specific section of the map.",
      "content": "Focus on a specific section of the map. If there are groups of states you keep having trouble with, ignore the parts of the map you already know. Print out several copies of the blank map, and try to label only that difficult section of the map. Keep checking and correcting yourself, and repeat the task until you've got it. Do this for every difficult section, practice with the whole map a few more times, and you can get a great score on your geography test."
    }
  ]
}