{
  "url": "https://www.wikihow.com/Play-%22Jingle-Bells%22-on-the-Piano",
  "title": "A Beginner-Friendly Jingle Bells Piano Tutorial",
  "steps": [
    {
      "title": "Put your right hand out in front of you.",
      "content": "Put your right hand out in front of you. For Jingle Bells, you'll only use your right hand. If you're a total beginner, then the first thing you need to do is to know your \"finger numbers\". Your thumb is finger number 1 . Your pointer finger is finger number 2 . Your middle finger is finger number 3 . Your ring finger is finger number 4 . Your pinky finger is number 5 . You could write the numbers on your hand if you have trouble remembering them, but it's pretty easy. If you already know note names, then you don't need to know finger numbers."
    },
    {
      "title": "Locate where you need to put your hands on the piano.",
      "content": "Locate where you need to put your hands on the piano. For Jingle Bells, your hand position will be entirely in the Middle C position (you just need your right hand). To find Middle C, look at your piano or keyboard (or a picture if you don't have one) and notice that the black keys are in groups of two and three."
    },
    {
      "title": "Find the group of two black keys that are closest to the middle of the piano/keyboard.",
      "content": "Find the group of two black keys that are closest to the middle of the piano/keyboard."
    },
    {
      "title": "Put your thumb of your right hand on the white key just to the left of the two black keys.",
      "content": "Put your thumb of your right hand on the white key just to the left of the two black keys. That key is called Middle C."
    },
    {
      "title": "Put the rest of your fingers on all of the white keys to the right of Middle C.",
      "content": "Put the rest of your fingers on all of the white keys to the right of Middle C. You should be covering 5 white keys, from Middle C to 4 to the right. This is called Middle C Position."
    },
    {
      "title": "Start playing.",
      "content": "Start playing. Here's how to play Jingle Bells if using finger numbers: 3 3 3 - 3 3 3 - 3 5 1 2 3 - - - 4 4 4 3 3 3 2 2 3 2 - 5 - 3 3 3 -3 3 3 - 3 5 1 2 3 - - - 4 4 4 3 3 3 5 5 4 2 1 - - -All you have to do is play the finger with that finger number. When you come across a dash (-), then hold the note longer. Each - is one extra beat. For example, if there's 3 3 3 - then on the third 3, you hold the note for an extra beat. If you know your Middle C note names (C D E F and G), then this is how you play Jingle Bells with note names: E E E - E E E - E G C D E - - - F F F E E E E D D E D - G - E E E - E E E - E G C D E - - - F F F E E E G G F D C - - -"
    },
    {
      "title": "Have fun entertaining your friends and family this holiday season!",
      "content": "Have fun entertaining your friends and family this holiday season!"
    }
  ]
}