{
  "url": "https://www.wikihow.com/Shrink-Rings",
  "title": "How to Shrink Rings",
  "steps": [
    {
      "title": "Clean your ring with soap and water.",
      "content": "Clean your ring with soap and water. Scrub the ring thoroughly using dish soap and warm water to wash off any oils or particles. Make sure the soap you use does not have moisturizing chemicals in it that might leave a film on the ring. [1] X Research source Let the ring air dry or dab it with a cotton towel instead of paper towels, which can damage the metal. If you use an ultrasonic jewelry cleaning machine, beware that the oscillations might knock stones loose from their settings."
    },
    {
      "title": "Apply a layer of silicone inside the ring.",
      "content": "Apply a layer of silicone inside the ring. Use a coffee stir stick or a narrow popsicle stick to spread the silicone around the inside of your ring. The silicone should be thickest towards the bottom of the band, directly opposite from where the stone sits on top of your finger. [2] X Research source For safety purposes, make sure you are using only clear food-grade or aquarium-grade silicone on your ring."
    },
    {
      "title": "Smooth out the silicone with the stir stick.",
      "content": "Smooth out the silicone with the stir stick. Taper the coating as you work up the sides of the ring so that it's thinnest near the top. This secures your finger against the top of the ring while the silicone at the bottom fills the gap between the ring and your skin. Gently wipe away extra silicone with a wet cloth as you go."
    },
    {
      "title": "Let the silicone dry.",
      "content": "Let the silicone dry. This process is called curing and will take at least 24 hours. Avoid wearing the ring during this time or until the silicone appears and feels firm. The cured silicone should hold for a few weeks, even when you wash your hands, but might degrade if it comes into contact with certain lotions, fragrances, or chemicals."
    },
    {
      "title": "Try on the ring once the silicone is dry.",
      "content": "Try on the ring once the silicone is dry. Check to see if the fit is snug or if you need to add another layer of silicone to the ring, as the curing process can shrink the silicone somewhat. If you need to remove the silicone from the ring at any point, you should be able to easily loosen it and pull it off completely with your fingernails [3] X Research source"
    },
    {
      "title": "Measure and mark how much of the ring you need to cut.",
      "content": "Measure and mark how much of the ring you need to cut. Make a mark in ink at the bottom of the ring showing how much needs to cut to make it fit. To get a better feel for how much you need to cut, measure the ring's current size using a ring stick, which is a graduated cylinder with size measurements on the side. [4] X Research source Compare that measurement with the correct size for your finger and you will see exactly how much of the ring you need to remove. The size of your fingers can fluctuate throughout the day. For instance, they tend to be more swollen first thing in the morning, as well as when you're hot. Try to take your finger size on a day when the temperature and humidity are normal, and at a time when you don't feel puffy or swollen. [5] X Expert Source Nicole Wegman Jewelry Professional & Founder of Ring Concierge Expert Interview. 23 April 2020."
    },
    {
      "title": "Cut open the ring where you marked it.",
      "content": "Cut open the ring where you marked it. Your best bet is to use a narrow jeweler’s saw, but you might also be able to use a pair of wire cutters or pliers, depending on the material the ring is made of. [6] X Research source If you follow the marker straight across the ring while you cut, you will be able to see if you have removed enough to shrink the ring to the size you want."
    },
    {
      "title": "File down the exposed edges left by the cut.",
      "content": "File down the exposed edges left by the cut. Before you can close the gap made by the cut, use a metal file to smooth out both edges. [7] X Research source Filing ensures both edges will join together evenly, which is important if you plan to solder the ring closed again. If you are going to leave the ring open, you don't want to hurt yourself by leaving sharp edges that can pinch your finger while you wear it."
    },
    {
      "title": "Bend the ring to close the gap between the edges.",
      "content": "Bend the ring to close the gap between the edges. Pull the ends together with pliers to shrink the circumference of the ring. [8] X Research source Make sure the ring is still a circle shape by applying pressure evenly as you pull the ends together. If the ring loses its shape, put it back onto the ring stick and tap it lightly with a hammer until it appears circular."
    },
    {
      "title": "Solder the edges of the ring together.",
      "content": "Solder the edges of the ring together. Use a soldering torch to apply heat and seal the cut edges of the ring back together with a little solder material that is the same metal as your ring. [9] X Research source Wear eye protection to prevent retina damage or something entering your eyes. [10] X Research source Clear out any excess material from the solder with a metal file and emery paper. Feel free skip this step and leave the ring open if you are uncomfortable using a soldering torch or if you don't have access to one."
    },
    {
      "title": "Clean and polish the ring until it's free of marks.",
      "content": "Clean and polish the ring until it's free of marks. Wash the ring in warm water with dish soap and a cloth before rinsing in cool water. Pat it dry with a fresh cloth. [11] X Research source Make sure you thoroughly clean both the inside and outside of the ring to rid the surface of any excess particles. If the ring is especially tarnished, add three parts baking soda to one part water in the cleaning solution."
    },
    {
      "title": "Consult a local jeweler before resizing a valuable ring yourself.",
      "content": "Consult a local jeweler before resizing a valuable ring yourself. If you have a valuable ring you don’t want to damage, your best option is to find a professional jeweler who will know the best method for resizing it and whether it can be resized at all. If you're able, take the ring to the jeweler who made the ring in the first place. They'll know how the ring was made and what metals were used. [12] X Expert Source Nicole Wegman Jewelry Professional & Founder of Ring Concierge Expert Interview. 23 April 2020. Jewelers can easily shrink rings that are made of gold, silver or platinum, but usually by up to two sizes at most. [13] X Research source Jewelers typically cannot resize rings made of titanium, tungsten, or those with gemstones going around the entire band. [14] X Research source"
    },
    {
      "title": "Have the jeweler shrink the ring by cutting out some of the band.",
      "content": "Have the jeweler shrink the ring by cutting out some of the band. The jeweler will cut away material from the bottom of the band with a very precise saw and then seal the edges back together again with a soldering torch. [15] X Research source After the jeweler cleans and polishes your ring, there should be no marks indicating that it was ever cut open, preserving its value. This method works best if your fingers don't often swell in response to changes in temperature or due to weight fluctuations because repeatedly resizing the ring repeatedly can weaken its overall structure."
    },
    {
      "title": "Ask about ring sizers to avoid cutting the ring.",
      "content": "Ask about ring sizers to avoid cutting the ring. If you don't want to risk weakening the ring by cutting material away from it, see if the jeweler can apply ring sizers like sizing beads or a fold-over device to improve the fit instead. These sizers can be removed later and are better options if you only need to shrink the ring by a little bit. [16] X Research source Sizing beads are two metal beads added to the bottom of the ring that create a wedge between your finger and the ring to keep it in place. A fold-over device is a small metal bar fixed to the bottom of the ring with a latch on one end that can be opened to squeeze the ring past your knuckle when it's put on or taken off, and closed again to secure the ring in place. [17] X Research source"
    }
  ]
}