{
  "url": "https://www.wikihow.com/Remove-Lice-Using-Tea-Tree-Oil",
  "title": "How to Use Melaleuca Oil to Get Rid of Lice",
  "steps": [
    {
      "title": "Potentially, but it's not the most effective method.",
      "content": "Potentially, but it's not the most effective method. Tea tree oil isn't regulated by the FDA because it is an essential oil. This makes doctors hesitant to recommend it as a good treatment. Independent medical research suggests that tea tree oil can be an effective treatment method, though. [1] X Research source A study published by Parasitology Research found that tea tree oil contains insecticidal properties that kill lice. It concluded that tea tree oil was an effective treatment. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Another medical study in Australia found that the combination of tea tree oil and lavender oil was a successful treatment against lice. [3] X Research source"
    },
    {
      "title": "Over-the-counter treatments are still more effective.",
      "content": "Over-the-counter treatments are still more effective. This is usually what doctors recommend. These usually come in the form of an anti-lice shampoo. To kill the lice, the shampoo includes active ingredients like pyrethrins or permethrin lotion. The shampoo can't kill unhatched eggs, so you'll need to do two rounds of treatment. Follow the first treatment with another 9-10 days later. This will get rid of any lice that hatched after the first round. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Mix tea tree oil in your shampoo.",
      "content": "Mix tea tree oil in your shampoo. Mix 3 to 5 drops of tea tree oil for every 1 oz of shampoo. [5] X Research source Wash your hair with the product in the shower. After, work a fine-toothed comb through your hair. Use the comb to get rid of any lice or nits (lice eggs). Always combine tea tree oil with another substance, like shampoo or a carrier oil. Tea tree oil can be pretty harsh on your skin. Diluting it makes it more gentle!"
    },
    {
      "title": "Alternatively, make a solution of olive oil and tea tree oil.",
      "content": "Alternatively, make a solution of olive oil and tea tree oil. Apply a combination of 3 tablespoons (44 mL) olive oil and 1 teaspoon (4.9 mL) tea tree oil to your hair. Wait for 30 to 40 minutes before washing out the solution. A study by Parasitology Research found that it takes about 30 minutes for the tea tree oil solution to effectively kill the lice. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "You may need a few tea tree oil treatments to get the job done.",
      "content": "You may need a few tea tree oil treatments to get the job done. Anti-lice treatments, including both tea tree oil and even over-the-counter methods, may need to be repeated to kill any lice that hatch after the first treatment. Use a fine-toothed comb to comb through your hair every 2-3 days after treatment. Do this for a total of 17 days to make sure the lice are gone! [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Repeat the treatment 9-10 days after the first round to get rid of any newly hatched lice or lice that you might have missed. [8] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Possibly, if you have sensitive skin.",
      "content": "Possibly, if you have sensitive skin. Tea tree oil is relatively safe, but potential side effects of the product include skin irritation, itching, burning, dryness, and redness on the scalp. Only apply tea tree oil to your skin. Never drink or ingest it, as it's toxic. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Spot test the tea tree oil on a small part of your skin before applying it to your scalp and hair. If you experience any side effects, don't use tea tree oil. Use another method to remove the lice instead, like over-the-counter treatments. Remember to use a carrier oil (like olive oil) or shampoo to dilute the tea tree oil. This will make it more gentle!"
    },
    {
      "title": "Yes, your doctor can recommend a stronger treatment.",
      "content": "Yes, your doctor can recommend a stronger treatment. If the tea tree oil isn't working, talk to your doctor about what medication they recommend. They may suggest over-the-counter treatment or, in particularly pesky situations, prescription medication. Never combine multiple types of anti-lice treatment unless your doctor specifically tells you to do so. Your doctor may recommend OTC medication containing either pyrethrins or permethrin lotion. They may recommend prescription medication if necessary. These stronger methods include either benzyl alcohol lotion, ivermectin lotion, or malathion lotion."
    },
    {
      "title": "Neem oil can be used to kill head lice.",
      "content": "Neem oil can be used to kill head lice. A study done by Parasitology Research found that shampoo containing neem oil effectively removes lice. In the study, children were given the treatment for 10-20 minute periods. After 7 days, the shampoo killed all the lice and eggs. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source To use this method, use a neem oil shampoo or add 10 to 20 drops of neem oil to 1 oz of your normal shampoo. Leave the shampoo in your hair for 20 minutes before washing it out!"
    },
    {
      "title": "Lavender oil is another remedy you can try.",
      "content": "Lavender oil is another remedy you can try. The National Library of Medicine published a study that suggested lavender oil as a semi-effective method to get rid of lice. The research noted, though, that tea tree oil was more effective. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source To use lavender oil, mix 2 drops of lavender oil in 10 millilitres (0.35 imp fl oz; 0.34 fl oz) of water. Use this instead of shampoo 2-3 times a week for 3 weeks. Lavender oil does not kill nits (lice eggs)."
    },
    {
      "title": "The most common OTC treatment is anti-lice shampoo.",
      "content": "The most common OTC treatment is anti-lice shampoo. These contain pyrethrin, an active ingredient found in flowers like chrysanthemums that is toxic to lice. To effectively get rid of lice , follow the instructions on the label and repeat the treatment 9-10 days after the first dose. This will hopefully remove any remaining lice. [12] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source You need two treatments because the shampoo isn't able to kill unhatched eggs. See your doctor if the lice persist after two treatments. They may be resistant to the pyrethrin. If so, your doctor can prescribe prescription medication like benzyl alcohol lotion, ivermectin lotion, or malathion lotion."
    }
  ]
}