{
  "url": "https://www.wikihow.com/Read-Faster",
  "title": "How to Read Faster",
  "steps": [
    {
      "title": "Practice a little every day.",
      "content": "Practice a little every day. A lot of the skills necessary to improve your reading speed will not come naturally to you, so you will need to practice them everyday until they become second nature. Even 15 to 20 minutes of practice per day can make a huge difference to your overall pace. [1] X Research source Improving your reading speed will take time, as you are learning how to read in a whole new way. Remember it took you years to learn how to read well as a child, so be patient with yourself this time round. A good way to track your progress is to time yourself on a regular basis. Set a timer and count how many words you read per minute. The more you practice, the higher this number should become."
    },
    {
      "title": "Start with easier material.",
      "content": "Start with easier material. When you are training yourself to read faster, it's a good idea to start with easier material -- something that you enjoy or gain immediate value from -- until your abilities improve. Something like a travel book or memoir of famous figure, for example, might be a good option. Starting with something very dense -- like a physics textbook -- can throw you off and make the whole process seem more daunting. Once your skills improve and you learn what to look for in a text, you will find yourself much better equipped to deal with longer, more complex material. By this time, you will have developed a good grasp of which techniques work best for you and learn to recognize which parts of a text are most important."
    },
    {
      "title": "Use your finger or an index card to set the pace.",
      "content": "Use your finger or an index card to set the pace. It's a good idea to use your finger, a pen or an index card to mark your place on the page as you read. And while using a pointer prevents you from losing your place and having to make regressions, this is not the only benefit. By moving the pointer quickly across each line and down the page you can set the pace you wish to read at, as your eyes will be forced to keep up. Think of your eyes like a magnet that's attracted to the pointer on the page -- wherever it goes, your eyes will follow!"
    },
    {
      "title": "Read for longer periods of time to improve your focus.",
      "content": "Read for longer periods of time to improve your focus. Your brain needs some time to sink into the rhythm of reading, especially if you’re coming from another activity that’s more active. Encourage yourself to read for at least 15 minutes at a time to ensure that your brain has time to adjust its focus. You’ll get progressively better at finding your focus with practice. It’s OK to take breaks when necessary, as well."
    },
    {
      "title": "Change your attitude towards reading.",
      "content": "Change your attitude towards reading. In addition to implementing specific techniques for increasing your reading speed, it's also important that you revise your attitude towards reading in general. Rather than seeing reading as a chore or something that has to be done, you should look at reading as an opportunity -- to be entertained, to learn something new, to expand your horizons. It doesn't matter what the subject is -- it could be a book on statistics or a historical account of mining in Colorado -- as long as you approach the topic with an open mind and a willingness to learn, you'll find the whole process much more enjoyable and easier to get through."
    },
    {
      "title": "Know when to slow down.",
      "content": "Know when to slow down. Despite the benefits of reading faster, it's important to recognize that there will be times when you need to slow down and really make an effort to fully comprehend what you're reading. There's no point skimming through a text if it prevents you from fully comprehending the material or retaining any useful information. Therefore, one of the most important skills you can develop is the ability to recognize when you should read slowly. In addition, there are certain types of texts that should never be skimmed through or glossed over too quickly. This includes works of fiction, classic literature, poetry and plays. These kinds of texts are works of art and creativity, where each and every word is intended to be read and even analysed. You will lose much of the value of these texts if you attempt to read them too quickly. [2] X Research source"
    },
    {
      "title": "Avoid sounding out the words in your head.",
      "content": "Avoid sounding out the words in your head. Many people sound out the words as they read -- either by moving their lips or hearing the words in their head. This is known as sub-vocalization and is one of the major problems that affects your reading speed. [3] X Research source Although sounding out words is an effective way of teaching kids how to read, it is not conducive to reading faster. This is because sub-vocalization only allows you to read the words as fast as you can say them -- which isn't very fast at all. By eliminating subvocalization, you can potentially double or triple your reading speed. You can avoid mouthing the words by keeping your mouth busy -- chewing gum, humming, or whatever. Preventing yourself from hearing the words in your head as you read is a little harder, but it can be achieved with concentration, practice and the art of mindfulness ."
    },
    {
      "title": "Avoid reading word-by-word.",
      "content": "Avoid reading word-by-word. Another common practice which slows down reading speed hugely is the practice of reading each individual word separately. Instead, you should try to read in chunks. For example, most inexperienced readers will read the phrase \"the horse is in the barn\" as \"the\" + \"horse\" + \"is\" + \"in\" + \"the\" + \"barn\", thus processing each word individually. However, your brain has an amazing ability to fill in gaps of information, so if you can train your brain to process the sentence \"the horse is in the barn\" as a single piece of information containing the key words \"horse\" and \"barn\", your brain will fill in the rest. That way, you can get the same meaning from a piece of text while only reading about 50% of the words. This speeds up reading time considerably."
    },
    {
      "title": "Overcome inefficient eye movement.",
      "content": "Overcome inefficient eye movement. When children learn how to read, they are taught to look at each word individually before moving onto the next. However, your eyes are capable of taking in much more than a single word at a time -- up to four or five, in fact -- so this practice makes reading a lot less efficient. [4] X Research source Try to relax your face and soften your gaze as you read -- this will allow you to take in more of the page at once. Try to absorb at least four words at a time, before moving your eyes onto the next chunk of words. In addition, you should try to utilize your peripheral vision as you read. This allows you to read to the end of the sentence without the need to refocus your gaze, thereby saving you time."
    },
    {
      "title": "Eliminate regression.",
      "content": "Eliminate regression. Regression is the practice of reading the same sentence or section two or three times over, whether intentionally or unintentionally. Obviously, this adds a lot of unnecessary time onto your reading, without necessarily improving your understanding of the material. [5] X Research source Some people regress because they lose their place in the text and go back to the beginning of the page or paragraph in order to find it again. You can avoid this by using a pointer to mark your place as you read -- whether it's your finger, a pen or an index card. Others regress because they feel that they haven't really grasped the meaning of the text the first time around. To overcome this, you need to ensure that you are really concentrating the first time round -- reading should be an active activity, not a passive one -- so engaging with the material from the get-go will prevent you from having to reread anything. In addition, you need to decide if the information is important enough to reread -- if you have grasped the basic concept of a sentence or paragraph (even if you haven't absorbed each individual word) then reading it again is a waste of time. [6] X Research source"
    },
    {
      "title": "Create the right reading atmosphere for your needs.",
      "content": "Create the right reading atmosphere for your needs. Many people are slow readers simply because they are attempting to read in an inappropriate environment. Beyond just finding a good reading spot without distractions or loud noises, experiment with what kinds of atmospheres work best for you personally to find the perfect reading spot. [7] X Research source If you prefer a quiet environment, try getting away from the TV, music, and conversation. You can also use earplugs or noise-cancelling headphones. If you find it uncomfortable to sit in total silence, try putting on some quiet music that you’ve heard before, so you’re not distracted by new lyrics or rhythms. You can also use a white noise machine or play soothing sounds like rain or waves. If you like to sit down, use a comfortable seat or even a beanbag chair. You can also lay on the couch or in a hammock. You might find it more comfortable to stand while you read. You can buy a standing desk or make your own by stacking stable boxes on top of each other. You might also prefer to be moving to keep you focused while you read. Try clicking a pen, tapping on the table, chewing something, or jiggling your legs."
    },
    {
      "title": "Preview the material.",
      "content": "Preview the material. One of the most efficient ways of improving your reading speed is to preview the material before you read it. This can help you to get a sense of what the text is about and allow you decide if it's even worth reading in full. To preview the material, try reading the entire first paragraph, the first sentence of each successive paragraph and the entire last paragraph. In between these items, look at headings, bullet points and highlighted words. This won't give you all the details, but it will help you to identify the most important parts to go back to and what you can simply skim over. This is a good technique for long, unfamiliar or difficult texts which you are trying to get an initial grasp of."
    },
    {
      "title": "Scan for the most important words.",
      "content": "Scan for the most important words. Another technique is to simply scan the material and pick out any key words. By using this method, you can develop a basic understanding of the material without wasting time on the nitty gritty. For example, in the sentence \"the fearsome lion stealthily hunted its unsuspecting prey -- the antelope,\" it is not necessary to read every single word in order to grasp its meaning. By skimming the text for key words you can come up with the phrase \"lion - hunted - antelope\", which communicates essentially the same meaning. following this step allows you to halve the time it takes to read a text without sacrificing too much meaning. This technique is best used for simple, short texts, such as magazine and newspaper articles."
    },
    {
      "title": "Read the first and last sentence of every paragraph.",
      "content": "Read the first and last sentence of every paragraph. If you're reading an article, book or paper for the sole purpose of gleaning new information, then a handy technique is just to read the first and last sentence of each paragraph, especially when it's reiterating something you already know. A lot of non-fiction work can be very repetitive and contain long-winded explanations of a simple concept. If you already have a grasp of the concept, then there's no need to go through the entire paragraph line by line. This also goes for newspaper and magazine articles -- if you only want a basic overview of the contents, it's amazing how much information you can glean simply by reading the first and last sentence of each paragraph."
    },
    {
      "title": "Skip over the parts you already know.",
      "content": "Skip over the parts you already know. If you're trying to improve your reading speed, you should get used to the idea of skipping over information you already know or understand, as reading these sections will provide you with little additional value. You can decide which sections are worth reading by skimming the text for key words or reading the first sentence of each paragraph. This will give you a pretty good idea of what the text contains and allow you to decide whether its worth the time investment. This also goes for things that you're not interested in. If you're reading something like a memoir or historical account, it's fine to skip over the parts you're not interested in reading about. This may go against your nature as a reader, but it will save you time while also helping you to maintain interest in what you're ready. Related to this, you should not feel bad about abandoning a book that you're not enjoying or learning anything from. Many books are poorly written or don't do a good job of explaining advanced concepts. Try to read about 10% of every book you pick up and if you find it's not working for you put it down and move on to a different book. This will save you time and be more beneficial in the long run."
    },
    {
      "title": "Retain the most important information.",
      "content": "Retain the most important information. One of the major issues people have when they begin to read faster is that they have difficulty absorbing and retaining the information they come across. While the major solution to this problem is to become a more active and engaged reader, there are several more specific techniques you can try. Link concepts in the book to things you already know. Linking complex ideas to a personal experience, memory or emotion will help you to access the information more easily. As a simple example, linking the French word heureux (which means happy) to a pleasant memory where you experienced feelings of happiness might help you to remember the word more easily. Highlight important information and write summaries. Use a highlighter while you're reading (or just dog-ear entire pages) to highlight important concepts or ideas. Then once you've finished the book, go back to these highlighted sections and use them to make a 200-300 word summary of the book. Doing this will provide you with a database of references that your can use in the future, which also helping you to commit the ideas to memory."
    }
  ]
}