{
  "url": "https://www.wikihow.com/Sell-a-Car-on-Craigslist",
  "title": "How to Sell a Car on Craigslist",
  "steps": [
    {
      "title": "Pick the right price for your car to help it sell quickly.",
      "content": "Pick the right price for your car to help it sell quickly. Ask for too much, and it might not sell at all. Ask for too little, and you could lose out on money. Check out the Kelley Blue Book price for your make and model, then set the price accordingly. [1] X Research source If your car has any damage or needs work done, you’ll want to discount the price a bit."
    },
    {
      "title": "This will help you make a good first impression.",
      "content": "This will help you make a good first impression. Take your car to the carwash, vacuum the inside, and pay for detailing, if you can. If your car is dusty or dirty, it’s much less likely to sell (even if it’s in great condition otherwise). Plus, your car will look good in the ad photos so people are more likely to inquire about it in the first place. [2] X Research source Take out anything unnecessary, like car seats or seat covers, before you sell your car."
    },
    {
      "title": "A good ad includes detailed pictures of what your car looks like.",
      "content": "A good ad includes detailed pictures of what your car looks like. Grab your phone or a digital camera and take pictures of the inside, the outside, and all the details. If your car has any damage, take up-close shots of that with something in the photo for a size reference. All in all, aim for about 12 photos, and have more as backup in case buyers want a closer look at something. [3] X Research source For great-looking photos, wait for a sunny, clear day to take your shots."
    },
    {
      "title": "Find your car’s title and make sure it’s in your name only.",
      "content": "Find your car’s title and make sure it’s in your name only. If you can’t find the title, don’t sweat it—make an appointment at the DMV to get a new one. Some states only require you to have the car title when selling, but others require you to fill out official title-transfer forms. Check out your local laws for more info before you start the car-selling process. [4] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source If you do need title-transfer forms, you can pick them up from the DMV. If all you need is the title, you can simply write the odometer reading, sales price, and your signature on the back of it when the time comes."
    },
    {
      "title": "Include the description, asking price, and why you’re selling the car.",
      "content": "Include the description, asking price, and why you’re selling the car. If there are any issues that need to be fixed, include those as well. If your car gets good gas mileage, you can throw that in with the ad, too. And, if your car is still under warranty or if you’ve modified it in any way, put that in your ad to draw people in. [5] X Research source “Selling my two-seater to buy something bigger. 35 MPG, runs great. Kept up with all scheduled maintenance and additional body work as needed. Has working AC and heater, also has heated seats. Minor dent on front bumper from fender bender, but no frame damage. Asking $8,000 or best offer. Cashier’s Check only.”"
    },
    {
      "title": "Unfortunately, you may encounter some fake offers via Craigslist.",
      "content": "Unfortunately, you may encounter some fake offers via Craigslist. It’s important to use your judgment and trust your gut when potential buyers reach out to you. If anyone asks you to send them money temporarily or come to your home, don’t respond to them, since it’s most likely a scam. [6] X Research source The same thing goes for anyone who seems too eager to buy your car. If it seems too good to be true, it probably is. Be suspicious of anyone claiming to be out of the country and offering to send you a wire transfer for the car. [7] X Expert Source Bryan Hamby Professional Auto Broker Expert Interview. 11 June 2019."
    },
    {
      "title": "Most people will want to test out your car before making an offer.",
      "content": "Most people will want to test out your car before making an offer. If that’s the case, pick a public location to meet them at to keep yourself safe. Bring a friend along with you or tell someone where you’re going and how long you’ll be gone. Ask the potential buyer if you can take a picture of their license before letting them test drive your car—if they won’t let you, take the test drive off the table. [8] X Research source Let the potential buyer drive the car while you sit in the passenger seat. Give them about 15 minutes to try out the car, and then circle back around to your meeting spot. Keep your phone on you in case of emergencies, and share your location with a friend if you feel unsafe."
    },
    {
      "title": "Potential buyers may try to haggle with you about the price.",
      "content": "Potential buyers may try to haggle with you about the price. If you’re okay with it, try to be slightly flexible with your pricing (it’s what Craigslist is about, after all). However, feel free to walk away from any sale you don’t feel comfortable with—it’s your car, and you can say yes or no to anyone you’d like to. [9] X Research source When it comes to payment forms, cash is best. However, if you’re selling your car for more than $10,000, you may have to take a Cashier’s Check instead."
    },
    {
      "title": "Some states require a bill of sale, but not all of them do.",
      "content": "Some states require a bill of sale, but not all of them do. However, a bill of sale can help protect you legally if there are any problems down the road with the sale. You can find a blank bill of sale template form online by searching “bill of sale template.” Then, all you have to do is fill out your car’s information and have the buyer sign the bottom. [10] X Research source If you aren’t going to use a bill of sale, simply list the odometer reading, the sale price, and your signature on the back of the car title before handing it over to the buyer."
    },
    {
      "title": "Most states require a notarized copy of the car title.",
      "content": "Most states require a notarized copy of the car title. [11] X Expert Source Bryan Hamby Professional Auto Broker Expert Interview. 11 June 2019. Even if your state doesn’t require it, it’s a good idea to get your sale notarized, just in case you need to prove it legally later on. Most bank branches have notaries and charge a small fee for the service, so set up an appointment to meet with the buyer and make the sale final. [12] X Research source It is very important not to sign the document before you get to the notary, otherwise, they may judge the document invalid."
    },
    {
      "title": "Since the car is no longer yours, you can take your name off everything.",
      "content": "Since the car is no longer yours, you can take your name off everything. Bring a screwdriver with you when you go to finalize the sale so that you can immediately remove your license plate. [13] X Research source Contact your DMV and insurance company, either by phone or online, to notify them of the completed sale. [14] X Research source You want to avoid continuing to pay taxes and insurance on a car you no longer own!"
    }
  ]
}