{
  "url": "https://www.wikihow.com/Questions-to-Ask-on-Tinder",
  "title": "150+ Funny & Fascinating Questions to Ask Your Match on Tinder",
  "steps": [
    {
      "title": "Catch your match’s attention and break the ice with a playful question.",
      "content": "Catch your match’s attention and break the ice with a playful question. When reaching out to someone on Tinder for the first time (or during the first few interactions), generic questions like “What’s up?” don’t always inspire as much interest. Instead, ask your Tinder crush a few playful questions designed to make them smile and get them thinking! [1] X Research source If you could travel in time, when and where would you go? If you were to make a movie based on your life, what would you call it? Quick! Describe yourself in just 5 words. What would you buy if you won the lottery? What’s the weirdest thing you carry in your bag? What pet would you get if you could have any animal? Hot take: Were Ross and Rachel on a break? Have you ever laughed so hard you spilled your drink on someone? What are your most embarrassing quirks? What’s the most exciting thing you can say about yourself in 60 seconds? What is your silliest turn-off? Reader Poll: We asked 2890 wikiHow readers and 49% of them agreed that their favorite way to break the ice is by asking funny or silly questions [Take Poll] . So, these wacky questions may just help you spark a convo with your Tinder crush!"
    },
    {
      "title": "Engage your Tinder match by bringing up movies, music, TV, and more.",
      "content": "Engage your Tinder match by bringing up movies, music, TV, and more. If you’re looking for fun, easy conversation starters, there’s always something noteworthy to talk about in entertainment and pop culture. Ask them about their favorite kinds of entertainment, from movies and games to books, and share your favorites too. You might find common ground! [2] X Research source What TV show would you recommend I start right now? Which superhero should get their own movie next? Have you ever watched a movie that was better than the book? What movie can you watch over and over without getting tired of it? If you could only listen to one artist for the rest of your life, who would it be? What are your top five favorite movies? What book do you think everyone should read? Zombies are taking over the planet! Which 5 characters are on your survival team? How do you feel about podcasts? What’s the best video game you’ve ever played?"
    },
    {
      "title": "See what your Tinder match likes to do (and what you have in common).",
      "content": "See what your Tinder match likes to do (and what you have in common). Lots of people have hobbies they’re super passionate about, so asking about them is an important part of getting to know your Tinder match. Learn more about the activities that bring them joy and all the different skills they’ve tried to pick up over the years. [3] X Research source What is the one hobby you’re most dedicated to? What’s one hobby you’ve tried, but given up on? What activity brings a smile to your face when you’re feeling sad? How do you generally spend your weekends? What is your favorite sport? Do you prefer outdoor games or video games? Do you play any musical instrument? If today was your last day in this city, what activities would you do? How many languages can you speak? What are you passionate about? What’s your hidden talent?"
    },
    {
      "title": "Learn more about the foods they love (and hate) the most.",
      "content": "Learn more about the foods they love (and hate) the most. You and your Tinder match can compare taste buds, eating habits, and all the different dishes each of you would love to try one day. You might even be able to make arrangements to meet up at a restaurant after some banter about your favorite foods! [4] X Research source What toppings do you like on your pizza? What’s in your fridge right now? What’s your favorite food? Do you cook often? What’s one snack you’ll never say no to? Which food best describes your personality? What is your comfort food? What’s your drink of choice at a bar? If you could eat only one thing for a week, what would you choose? What does your favorite breakfast look like?"
    },
    {
      "title": "Dive a little deeper into their likes, dislikes, and personal opinions.",
      "content": "Dive a little deeper into their likes, dislikes, and personal opinions. After chatting for a little while, ask your Tinder match more about their life—from things they’re enthusiastic about to details about their personality, habits, and preferences. [5] X Research source What's your Myers-Briggs type? What’s your astrology Sun sign? What’s the one compliment you get the most? What’s your favorite and least favorite household chore? What’s your favorite meme or GIF? Where do you go if you want to escape? What does your ideal night look like? Do you go out or are you at home with friends? What’s your guilty pleasure? What would you want to get on your birthday? Do you keep a diary? Do you like to sleep in on the weekends? Do you march to the beat of your own drum, or do you like going with the flow?"
    },
    {
      "title": "Get to know them better by learning about their family.",
      "content": "Get to know them better by learning about their family. Asking about their family can reveal a lot about their home life and relationships with their family. They might open up about how important their family is or let you know they don’t really talk to their family—but either way, you’d learn more about them and tell them about your family situation in return. Do you have any siblings? What’s the craziest prank you’ve played on a sibling? Does your family have any yearly traditions? What are your grandparents like? Are you more like your mom or your dad? Does your family have a silly nickname for you? Do you live by yourself? What’s the best advice your parent or guardian has ever given you? How many cousins do you have? What’s one word your friends would use to describe you?"
    },
    {
      "title": "Take them on a trip down memory lane and ask about their background.",
      "content": "Take them on a trip down memory lane and ask about their background. Bring up events from their childhood, grade-school days, their strongest memories of early adult life, and all the milestones under that umbrella. You can learn about what they were like as a kid, what kind of childhood they had, and how that informed the person they are now. What was your favorite grade in school? What was the best birthday you’ve ever had? If you could relive on day of your life again, which would it be? What was your most memorable job? Do you miss high school? What’s the silliest Halloween costume you’ve ever worn? So far in your life, what has been your favorite age? What's your most treasured memory? What’s your greatest accomplishment so far? What was the last time you did something for the first time? What was it?"
    },
    {
      "title": "Ask about their values and beliefs to get to know them on a deeper level.",
      "content": "Ask about their values and beliefs to get to know them on a deeper level. Once you’ve gotten to know each other enough that you’re comfortable confiding in one another, it might be a good time to ask them some deeper questions. These questions are designed to elicit a really thoughtful response, no matter what their thoughts are on the subject at hand! [6] X Research source Do you believe in destiny? Do you believe in astrology? Why or why not? Are you good at keeping secrets? What quote inspired you most? For what in your life do you feel most grateful? What’s something that gives your life meaning? What's more important to you, work or hobbies? Do you like talking about politics? Where do you feel most at home? Is there anything you'd never do? If you could make one decision to change the world, what would you do?"
    },
    {
      "title": "Use flirty questions to see if your Tinder match likes you back.",
      "content": "Use flirty questions to see if your Tinder match likes you back. Start peppering in a few flirty questions after a couple of exchanges. If you like your Tinder match and feel like there could be something between you, flirting is a great way to communicate your feelings and gauge theirs based on their response. [7] X Research source How on earth are you still single? What is it about you I’m so drawn to? Do you like to dance? What do you think is your sexiest feature? Want to hear a secret? What's the first thing you noticed about my profile? If I asked you out, would you say yes? Do you prefer to make the first move? Would you prefer cuddling up or having a make-out session? What's your go-to dance move?"
    },
    {
      "title": "Spring some wacky and unorthodox questions to entertain them.",
      "content": "Spring some wacky and unorthodox questions to entertain them. Sometimes, the most entertaining and thought-provoking questions are the ones you never see coming! Ask your Tinder match a weird and creative question that gets them to think outside the box. Do you think humans will ever inhabit Mars? Do you believe in the Illuminati? Of everyone who’s ever lived, who would you want to have dinner with? What’s your favorite conspiracy theory? Have you ever done something illegal? Who do you think you were in a past life? If you were to go to prison, what would it be for? Have you ever done the Gangnam Style dance? Did you drink enough water today? Do you believe in ghosts?"
    },
    {
      "title": "Sharing travel stories can tell you a lot about one another.",
      "content": "Sharing travel stories can tell you a lot about one another. Whether they travel regularly, go on vacation once in a blue moon, or left the state for the first time to go to college, odds are both of you have at least a couple of travel stories to tell! Ask them about their traveling experiences thus far and where they’d like to go in the future. [8] X Research source Have you ever traveled outside the country? How many different countries have you visited? What cultures would you like to experience? What’s the best vacation you’ve ever been on? Would you rather travel to the past or the future? Where’s the next place on your list to travel? What’s the most romantic travel destination you can think of? If you could travel the universe knowing you could never visit earth again, would you? Do you prefer flying on airplanes or road trips? What’s one place you absolutely have to visit sometime in your life? What’s your favorite place on earth?"
    },
    {
      "title": "Find out if you share any common goals for the future.",
      "content": "Find out if you share any common goals for the future. Now that you know the kind of person your Tinder match is, why not find out what kind of person they want to be someday? Ask questions about their ideal career, where they see themselves after a few years, and all the things they dream of doing in the future. [9] X Research source What does success mean to you? What is your dream job? What’s something you’ve always wanted to do, but haven’t? What are the top 5 things on your bucket list? What does your dream house look like? What makes you the most nervous about the future? What’s your biggest goal right now? What’s something you’d like to be remembered for? What’s the most important thing your life is missing? Where do you see yourself in 5 years?"
    },
    {
      "title": "Playing “This or That?” can help open up a conversation.",
      "content": "Playing “This or That?” can help open up a conversation. The ‘game’ is simple and totally open-ended; just ask a question with two options, phrased like a “This or that?” question, and see what they pick. Based on their answer, you could ask them to explain, comment on what your choice would be, or ask more rapid-fire questions! [10] X Research source Early bird or night owl? Savory or sweet? Concert or broadway show? Coffee or tea? Cats or dogs? Dine-in or delivery? Bath or shower? Cake or pie? Red or white wine? Kangaroo or platypus? Slippers or socks? You get a superpower! Flying or invisibility?"
    },
    {
      "title": "Turn up the heat with spicy questions if you’re both ready for it.",
      "content": "Turn up the heat with spicy questions if you’re both ready for it. Spicy questions can cement your attraction to one another and take your connection to the next level, but not right away. Rather, save them until you’re both comfortable enough to ask (and answer) them. You could even ask, “Is it okay if I ask you a spicy question?” before sending the first one, just to make sure they’re on board. What’s your favorite way to be seduced by someone? What's the worst thing someone can do in bed? Do you prefer to make out with the lights on or off? What makes you feel sexy? What do you fantasize about? What’s the dirtiest thing someone has said to you? What’s your ideal one-night stand look like? Do you prefer being the big spoon or little spoon? What do you find attractive in a person? Where do you like to be touched most?"
    },
    {
      "title": "Get a sense of their needs and the kind of relationship they want.",
      "content": "Get a sense of their needs and the kind of relationship they want. If you’re looking for a relationship on Tinder, the best way to do that is to ask your match about their idea of a relationship and what they look for in a partner. That way, you’ll know if your ideals, needs, and desires are compatible! [11] X Research source What’s your idea of a perfect date? How much time do you think couples should spend apart? Do you prefer cuddling or kissing? What is the most important thing for you in a relationship? What's your love language? What's a green flag for you in a relationship? What’s the best romantic surprise you’ve ever had? Can you surrender to love does that idea scare you? What is the weirdest date you have ever had? What made you start using Tinder?"
    }
  ]
}