{
  "url": "https://www.wikihow.com/Sew-an-Invisible-Zipper-with-Lining",
  "title": "How to Sew an Invisible Zipper with Lining",
  "steps": [
    {
      "title": "Sew a basting stitch along both sides of your garment's closure.",
      "content": "Sew a basting stitch along both sides of your garment's closure. Lay your garment right-side up and locate where you want to sew the zipper. Then, thread your sewing machine with a contrasting thread color and sew long, straight basting stitches about 5 ⁄ 8 inch (1.6 cm) from the side edge of the opening where you'll put the zipper. Do this for the opposite side, too. [1] X Research source If you prefer, sew the basting stitches by hand. Since the basting stitch lines are simply guidelines, you're not actually sewing the fabric edges together. The lines just help you position the zipper so you sew it in straight."
    },
    {
      "title": "Unzip the zipper and arrange the teeth of the left zipper to the left basting line.",
      "content": "Unzip the zipper and arrange the teeth of the left zipper to the left basting line. Take an invisible zipper that matches the color of your garment and unzip it all the way. Then, place the left zipper tape on the left side of your garment so the zipper teeth run directly on the basting stitch line. [2] X Research source The flat side of the zipper should be laying flat on the right side of your garment. If the zipper is bent or curled, lay it flat on an ironing board. Heat your iron to the synthetic setting and run it over the zipper tape to smooth it."
    },
    {
      "title": "Pin the left zipper tape to your garment.",
      "content": "Pin the left zipper tape to your garment. Push a sewing pin through the tape horizontally so it secures the zipper to the edge of your garment. Keep checking to see that the zipper teeth line up on the basting stitch line as you go. Pin all the way to the bottom of the left zipper. [3] X Research source Don't pin the right side of the zipper at this point. You'll attach the right-side zipper after you've finished sewing the left side in place."
    },
    {
      "title": "Attach an invisible zipper foot and set the groove into the zipper teeth.",
      "content": "Attach an invisible zipper foot and set the groove into the zipper teeth. Take the standard presser foot off of your sewing machine and push an invisible zipper foot onto the presser foot holder. Then, slide your fabric under the foot so the left groove fits onto the zipper teeth. [4] X Research source You'll see 2 grooves on the invisible zipper foot and your sewing needle will stitch in between them."
    },
    {
      "title": "Make straight stitches from the top down to the zipper stop.",
      "content": "Make straight stitches from the top down to the zipper stop. Set your machine to make standard straight stitches and begin sewing from the top of the left-side zipper. Stitch straight down until the invisible zipper foot reaches the zipper stop. Then, cut the thread and tie it off. [5] X Research source The invisible zipper foot glides along the zipper teeth as you sew, so this should only take a few seconds."
    },
    {
      "title": "Repeat this for the opposite side of the zipper.",
      "content": "Repeat this for the opposite side of the zipper. Once you've sewn 1 side of the zipper in place, lay the other side of the zipper on the opposite edge of the garment. Arrange the zipper tape so the zipper's teeth line up with the basting stitch. Then, position your invisible zipper foot so right groove sits on the teeth and the needle is to the left. Sew straight stitches down to the zipper stop. [6] X Research source"
    },
    {
      "title": "Zip the zipper and sew raw ends of the zipper tape.",
      "content": "Zip the zipper and sew raw ends of the zipper tape. Tuck the top ends of the zipper tape under to hide the raw edges and sew them in place by hand. Then, use a needle and thread or your machine to sew the bottom tape end to the garment's seam allowance. [7] X Research source Avoid sewing the bottom tape end to the fabric of the garment or your stitches will be visible. If you can see the basting stitches when you turn your garment right-side-out, pull the basting stitches out."
    },
    {
      "title": "Turn the garment inside out so the zipper tape is visible.",
      "content": "Turn the garment inside out so the zipper tape is visible. Once you've sewn the zipper to your garment, turn it inside out and lay it flat. This gives you easy access to the zipper tape, which is what you'll sew the lining onto. [8] X Research source Remember that the fabric side next to the zipper teeth is called the zipper tape. Turning your garment inside-out lets you see where everything lines up."
    },
    {
      "title": "Fold your lining by 5⁄8 inch (1.6 cm) and iron the crease flat.",
      "content": "Fold your lining by 5 ⁄ 8 inch (1.6 cm) and iron the crease flat. Take the lining that you've assembled for your item and read the pattern to find the seam allowance for the zipper opening. If the pattern doesn't specify, fold the part of the liner that fits around the zipper by 5 ⁄ 8 inch (1.6 cm). Then, use your iron to press the folded edges flat to make a crease. [9] X Research source Fold the pattern-side of the lining over towards the wrong side."
    },
    {
      "title": "Arrange the lining right-side-up on the wrong side of your garment.",
      "content": "Arrange the lining right-side-up on the wrong side of your garment. Position the liner so the V-shaped zipper opening fits around the actual zipper. Line up the bottom of the zipper with the point of the liner where the edges meet. [10] X Research source This gives your garment straight, professional-looking seams."
    },
    {
      "title": "Pin both sides of the lining to the zipper tape.",
      "content": "Pin both sides of the lining to the zipper tape. Hold the creased edge of the liner next to the zipper's teeth so the liner covers the zipper tape. Then, insert sewing pins horizontally along both sides of the zipper so the liner stays in place. [11] X Research source Ensure that you don't pin the liner over the teeth or your zipper will snag."
    },
    {
      "title": "Slip stitch the liner to the zipper tape.",
      "content": "Slip stitch the liner to the zipper tape. To create invisible stitches, thread a sewing needle. Insert it through the top edge of the zipper tape and bring the needle through the folded edge of the lining to make a stitch. Pull the thread and insert the needle back into the lining. Keep slip stitching between the folded lining and the zipper tape until you reach the bottom of the zipper. [12] X Research source Sew with the same thread that you used to sew the zipper to the garment. Make your stitches about 1 ⁄ 8 inch (0.32 cm) long, so they're short and strong."
    },
    {
      "title": "Sew slip stitches on the other side of the zipper tape and tie off the thread.",
      "content": "Sew slip stitches on the other side of the zipper tape and tie off the thread. Once you've secured the lining to 1 side of the zipper, start sewing along the other side. Work from the bottom of the liner at the base of the zipper up to the top. Then, tie off the thread and trim the excess. [13] X Research source"
    }
  ]
}