{
  "url": "https://www.wikihow.com/Remove-Bloodstains-from-Clothing",
  "title": "How to Remove Bloodstains from Clothing",
  "steps": [
    {
      "title": "Wet the stain with cold water.",
      "content": "Wet the stain with cold water. Blot a small stain with cold water to make sure it doesn’t run. You can also run it under a faucet of streaming cold water. If the stain is large, submerge it into a bowl or basin of cold water. [1] X Research source Do not use warm or hot water. This will make the stain worse. If the stain does run, you will need to treat the run as part of the stain."
    },
    {
      "title": "Apply soap to the blood stain.",
      "content": "Apply soap to the blood stain. You can use regular hand soap or bar soap for this. Lather the stain gently by rubbing it with a sponge. Then, rinse the soap out in cold water. Reapply soap and repeat the process if needed. [2] X Research source"
    },
    {
      "title": "Wash the clothing as usual.",
      "content": "Wash the clothing as usual. If you see that the stain has let up, you can wash it as normal. Make sure to wash it alone. Use the same detergent as you normally would. Do not, however, use warm water on the washing machine cycle. [3] X Research source"
    },
    {
      "title": "Let the clothing air dry.",
      "content": "Let the clothing air dry. The heat from a tumbler dryer can prevent the stain from fading completely, so do not put the clothing in the dryer. Instead, hang it up so that it can air dry. Once it is dry, you can store the clothing away or wear it. Repeat the process or try another method if the stain hasn’t faded completely. [4] X Research source Do not iron the clothing if the blood stain is still visible."
    },
    {
      "title": "Rinse the stain in cold water.",
      "content": "Rinse the stain in cold water. Try to get some of the stain out by rinsing it in cold water. Blot the stain with cold water and a towel. Or, you can run the stain under cold water."
    },
    {
      "title": "Make a paste out of salt and water.",
      "content": "Make a paste out of salt and water. Mix one part cold water and two parts salt together to create a paste. The amount of water and salt you need depends on the size of the stain. Do not mix so much water with the salt that you’ve created a liquid. The paste should be spreadable."
    },
    {
      "title": "Apply the paste to the stain.",
      "content": "Apply the paste to the stain. You can use your hand or a clean cloth to apply the paste to the stain. Rub the paste gently over the stain. You should begin to see the stain let up."
    },
    {
      "title": "Rinse the clothing in cold water.",
      "content": "Rinse the clothing in cold water. Once most or all of the stain has come out, run the clothing under cold water. Rinse it until the paste has been removed. If most of the stain hasn’t come out, reapply the paste."
    },
    {
      "title": "Launder as normal.",
      "content": "Launder as normal. Use whatever detergent you normally would for that particular piece of clothing. Do not, however, use anything but cold water to wash the piece of clothing. Hang up the clothing to air dry once it has finished washing."
    },
    {
      "title": "Test the hydrogen peroxide on a small spot of the clothing.",
      "content": "Test the hydrogen peroxide on a small spot of the clothing. Hydrogen peroxide can bleach some fabrics, so it is important to test it on a small, hidden spot of the clothing before use. Use a cotton swab or pour a very small amount, and use another method if you see discoloration. [5] X Research source Hydrogen peroxide helps to remove blood stains from fabric. However, you should rinse thoroughly with water after using it. Otherwise, it will bleach the area."
    },
    {
      "title": "Dilute the hydrogen peroxide for delicate fabrics.",
      "content": "Dilute the hydrogen peroxide for delicate fabrics. Pour 50% hydrogen peroxide and 50% water into a container. You can test this solution on a piece of the clothing if you’re not sure it has been diluted enough. [6] X Research source"
    },
    {
      "title": "Pour hydrogen peroxide directly onto the stain.",
      "content": "Pour hydrogen peroxide directly onto the stain. Make sure you pour the hydrogen peroxide only on the stain and nowhere else on the fabric. You will see it begin to foam up when it is working. Rub the hydrogen peroxide in with your hands to make sure it saturates the stain. [7] X Research source ."
    },
    {
      "title": "Repeat the process if necessary.",
      "content": "Repeat the process if necessary. One application of hydrogen peroxide may not do the trick, especially if it is a large stain. Apply more hydrogen peroxide if the first application does not fade or remove the stain. Wipe the stain between each application. [8] X Research source"
    },
    {
      "title": "Rinse with cold water.",
      "content": "Rinse with cold water. Once the stain has been removed, rinse it under cold water. You can then choose to wash it in the washing machine or leave it as is. Either way, allow the clothing to air dry. [9] X Research source"
    },
    {
      "title": "Dilute one tablespoon of ammonia with a half cup (118 mL) of water.",
      "content": "Dilute one tablespoon of ammonia with a half cup (118 mL) of water. Ammonia is a strong chemical and should only be used on tough stains. Do not use this method on delicate fabrics like silk, linen, or wool. [10] X Research source"
    },
    {
      "title": "Let the ammonia sit on the stain for a few minutes.",
      "content": "Let the ammonia sit on the stain for a few minutes. Pour the diluted ammonia over the stain. Make sure the ammonia is only on the stain and nowhere else on the article of clothing. Allow it to sit for a few minutes. [11] X Research source If you get ammonia on an unstained portion of the fabric, rinse it and start the process over again."
    },
    {
      "title": "Rinse with cold water.",
      "content": "Rinse with cold water. You should see the stain let up after a few minutes. At this point, rinse the stain under cold water. The stain should be gone, but if not, repeat the process. [12] X Research source"
    },
    {
      "title": "Wash in your usual manner.",
      "content": "Wash in your usual manner. Wash the clothing in the washing machine as you normally would. Make sure, however, to use cold water. If the stain isn’t completely gone, you can use an enzyme detergent that is made for breaking down tough stains in place of your regular detergent. [13] X Research source"
    },
    {
      "title": "Dry the clothing.",
      "content": "Dry the clothing. Heat sets stains, so do not put the clothing in the dryer after washing it. Allow it to air dry. Then, store it as usual. If the stain is still there, repeat the process or try another method."
    }
  ]
}