{
  "url": "https://www.wikihow.com/Make-an-Effective-Presentation",
  "title": "How to Make an Effective Presentation",
  "steps": [
    {
      "title": "Define your purpose.",
      "content": "Define your purpose. The purpose of presentation must be clearly defined before you start the presentation. For example, the purpose of your presentation may be: to inform people about an idea or to describe a business opportunity in order to gain support for some course of action. to inform, to analyze, to persuade. to create awareness of some issue."
    },
    {
      "title": "Identify your audience.",
      "content": "Identify your audience. Understanding the needs of your audience will help you to focus your presentation on the issues important to your listeners. It will also help you to adjust your style to accommodate different cultural and linguistic requirements. need of all cultural and linguistic difference culture. When assessing your audience, you should answer these questions: Who is your audience? Why are they attending your presentation? What is their background and level of knowledge of your topic? What are the interest ,likes and dislikes?"
    },
    {
      "title": "Consider the location and environment of the presentation.",
      "content": "Consider the location and environment of the presentation. The location can affect the style of your presentation. You should know: how large the space is whether or not public address equipment is available whether or not audio-visual equipment is available what kind of internet connectivity is available."
    },
    {
      "title": "Gather all your data.",
      "content": "Gather all your data. Print out all the relevant data you have. This could be emails, web articles, spreadsheets, meeting minutes, notes you made on a legal pad, etc. Gather it all together in one folder. Make sure to get a hard copy of as much as possible."
    },
    {
      "title": "Lay out all of your papers.",
      "content": "Lay out all of your papers. This could be done on a conference table, dining room table, or floor. Just get a big space and order them logically. This could be done sequentially, in a grid, or anything else that makes sense to you. Use post-it notes to record thoughts of how you plan on incorporating this into your presentation as well as what other info you need."
    },
    {
      "title": "Organize your content.",
      "content": "Organize your content. Collect and organize the material you need for your presentation. Having identified your audience and their needs, you should now be able to define the essentials which will give shape to your presentation. Keep in mind your audience and think of ways on how you can organize in a way that makes sense to them."
    },
    {
      "title": "Break your material down into three major parts.",
      "content": "Break your material down into three major parts. The introduction not only gives you an opportunity to welcome your audience and to introduce yourself. The introduction describes the purpose of the presentation and usually gives the audience a quick overview, or outline, of what you will cover. A good introduction is the vehicle which prepares your audience to listen to what you have to say. The main body of the presentation is where you make your key points. The information and ideas you put forward should be backed by supporting material. This could be the findings of a survey, an analysis of a situation, even anecdotal evidence gathered through interviews. The conclusion will usually review the main points that were covered during the presentation and reminds the audience of the purpose of the presentation. It is also the point where a call to action is made (if there is one)."
    },
    {
      "title": "Prepare an outline.",
      "content": "Prepare an outline. An outline serves as a guide to show you the right path in your presentation. Outlines can be organized like this: Introduction Key point 1 Support 1 Support 2 Support 3 Key point 2 Support 1 etc. Conclusion"
    },
    {
      "title": "Finalize your outline based on the additional research and input.",
      "content": "Finalize your outline based on the additional research and input. Do not include everything you know. Some things will not fit in to what you are trying to say. This will also allow you to elaborate further when people ask you questions."
    },
    {
      "title": "Create a PowerPoint.",
      "content": "Create a PowerPoint. Unless this is a long presentation (20-25 minutes or more) only use a title slide. The PowerPoint should be a visual display to supplement your presentation - not your presentation itself. It should not have too many words (certainly not every idea you mention) and you should not have to refer to it constantly."
    },
    {
      "title": "Decide what types of visual aids you will use.",
      "content": "Decide what types of visual aids you will use. Visual aids enhance the value of presentation by giving the audience something that shows you what you are speaking about. These visual aids can be graphs, charts, photos, videos, recordings. Almost anything can be used as long as it is pertinent to your talk."
    },
    {
      "title": "Review your aids.",
      "content": "Review your aids. Make sure the audience will be able to see and/or hear them. Try to use as little text as possible. If you are going to address a large audience, test your visuals beforehand. Even the person at the back of the room should be able to see them."
    },
    {
      "title": "Seek input.",
      "content": "Seek input. There are some people whose buy-in is critical, so it is in your best interest to get their thoughts (as well as your boss's thoughts) prior to the presentation. You may need to modify how you present the idea and/or some parts of the idea itself."
    },
    {
      "title": "Practice beforehand.",
      "content": "Practice beforehand. Say it out loud. If possible do it in the room you will be presenting in so you can understand the acoustics."
    },
    {
      "title": "Look sharp.",
      "content": "Look sharp. Depending on who your audience is you may need to dress up. Also take note of small things, such as the notebook you use. While it is certainly inappropriate and impractical to take notes during the whole time, you may need to record a thing or two. If you are meeting a higher-up in the company for the first time it may be worth getting a new notebook. Be careful to use the first two pages though - you do not want them to know you bought a new one just to meet them! Good posture, gesture and facial expression should be maintained during the presentation."
    }
  ]
}