{
  "url": "https://www.wikihow.com/Record-a-Song-at-Home-Easily",
  "title": "How to Record a Song at Home Easily",
  "steps": [
    {
      "title": "Obtain a home recording studio setup, you can use reflection filter products such as SnapRecorder.",
      "content": "Obtain a home recording studio setup, you can use reflection filter products such as SnapRecorder. You will need this to record vocals. [1] X Research source"
    },
    {
      "title": "Secondly make sure your computer has enough RAM memory to run a DAW (Digital Audio Workstation).",
      "content": "Secondly make sure your computer has enough RAM memory to run a DAW (Digital Audio Workstation). This could be GarageBand, Logic, Cubase, ProTools or even Audacity!"
    },
    {
      "title": "Organize what you want to record.",
      "content": "Organize what you want to record. Guitars? Bass? Drums? Make sure you have the necessary equipment to record these. For guitars and basses with your amp and one or two cables, it's okay. For drums you might need specific mics that are quite expensive."
    },
    {
      "title": "Plug your guitar to your amp as you would normally.",
      "content": "Plug your guitar to your amp as you would normally. Take off the end of the cable that is connected to the amp. You might need a little adapter to convert from a 6.35mm end to 3.5mm (standard headphone jack measure), then plug it to your computer's Audio-In port. (Usually next to the Audio-Out, or where you plug headphones or in newer Mac models, it's the same for Audio In & Out)"
    },
    {
      "title": "Hit record.",
      "content": "Hit record. Make proper adjustments for the DAW to recognize your guitar plugged and for the program to record from that line (either Mono or Stereo)."
    },
    {
      "title": "Use the mic and amp.",
      "content": "Use the mic and amp. You can also mic your amp, by putting the mic close to the amp and set the program to receive that signal."
    },
    {
      "title": "Record the drums.",
      "content": "Record the drums. For the drums you can use Drum Machines included on some DAWs, like GarageBand or Acoustica Mixcraft. [2] X Research source"
    },
    {
      "title": "Record keyboards.",
      "content": "Record keyboards. Keyboards often have a MIDI-out or a USB port so you can record directly, if not, use the headphone jack on it and plug it like you plugged the guitar/bass/microphone. [3] X Research source"
    },
    {
      "title": "Record other instruments.",
      "content": "Record other instruments. Other instruments like violins or pianos need a microphone in order to be recorded."
    },
    {
      "title": "Record your voice.",
      "content": "Record your voice. Your voice can be recorded either using a common microphone plugging it the way you plugged your guitar; or you can use any USB microphone. Guitar Hero or Rock Band mics work perfectly, people have recorded a whole EP with them, so don't be afraid to try them!"
    },
    {
      "title": "Record on your phone",
      "content": "Record on your phone . Phone recorders are increasingly high-quality, and can be just as easy for getting quick ideas down on record so you can play them back as in setting up an elaborate DIY studio with your computer. All you've got to do is click a button and place the phone close to the source. Try downloading higher-quality audio recorders than the default one that comes on the phone. HD options are available for no more than a few dollars--much cheaper than ProTools or other pro software. [4] X Research source [V161134_b01]. 27 August 2019."
    },
    {
      "title": "Consider investing in a high-quality hand-held digital recorder.",
      "content": "Consider investing in a high-quality hand-held digital recorder. Digital recorders like Zoom mics are great for recording acoustic music in quiet settings, just as good at getting field recordings and capturing the ambience of the room. You can record it straight into the recorder, play it back, and upload it to your computer as an mp3 to listen to later and share with your friends."
    },
    {
      "title": "Get an old cassette tape boombox for recording acoustic music.",
      "content": "Get an old cassette tape boombox for recording acoustic music. If it was good enough for the Mountain Goats, who recorded their first several albums all on a boombox and developed a huge following, it can be good enough for getting quick ideas down for demos or for recording practice sessions. If you've got an old model analog cassette stereo, pop a fresh cassette tape in, hit record, and play acoustic interments close to the input. For better quality, consider lining in a straight AV cable mic with the appropriate jack."
    },
    {
      "title": "Decide what backing track you're going to use.",
      "content": "Decide what backing track you're going to use. On YouTube, there are many different backing tracks you can find for writing your own song to."
    },
    {
      "title": "Find a melody that will fit to the instrumental.",
      "content": "Find a melody that will fit to the instrumental. Once you have it in your head what sort of melody you could sing, the whole process will be easy."
    },
    {
      "title": "Write the lyrics.",
      "content": "Write the lyrics. Use interesting words and gripping sentences for this. Use stuff that will hook the listener. [5] X Research source"
    },
    {
      "title": "Save the instrumental using an app like TubeSave.",
      "content": "Save the instrumental using an app like TubeSave. Then, upload it into a sound editor in a software like Easy Media Creator 10 by Roxio. [6] X Research source You then have that as your first layer."
    },
    {
      "title": "Using a tablet (iPad, Kindle Fire HD), download a really good sound recorder.",
      "content": "Using a tablet (iPad, Kindle Fire HD), download a really good sound recorder. Then upload the instrumental onto your phone. This will help to keep your music organised. Put your ear buds in, then press record on the sound app and play on the song. You will be able to sing in time."
    },
    {
      "title": "Upon finishing, upload the recording onto your computer.",
      "content": "Upon finishing, upload the recording onto your computer. Then add a second layer in your Sound Editor, and put it on."
    },
    {
      "title": "Increase/decrease the volume of your vocals to the volume you want on the song.",
      "content": "Increase/decrease the volume of your vocals to the volume you want on the song."
    },
    {
      "title": "Save the finished song.",
      "content": "Save the finished song. Rip the track to CD, and it's all done."
    }
  ]
}