{
  "url": "https://www.wikihow.com/Remove-the-Redness-of-a-Pimple",
  "title": "How to Remove the Redness of a Pimple",
  "steps": [
    {
      "title": "Ice the pimple to relieve inflammation.",
      "content": "Ice the pimple to relieve inflammation. Wrap a few ice cubes in a thin, clean cloth and apply directly to the zit. Hold the ice pack in place for 5-10 minutes at a time, repeating throughout the day as necessary. Allow your skin to rest for at least 2 hours before repeating the icing process, though, to avoid any potential damage. [1] X Research source Make sure not to put too much pressure on your skin. Too much pressure can cause the pimple to break, causing even more redness and spreading bacteria."
    },
    {
      "title": "Put a cucumber on the pimple.",
      "content": "Put a cucumber on the pimple. Cucumbers are naturally cooling, and they have mild astringent properties that may help minimize swelling and redness. Cut off a thin slice of cucumber and put it over your pimple for 5-10 minutes. To get the best effect, use a cucumber straight out of the refrigerator. A cold cucumber is going to deal with inflammation better than a warm cucumber."
    },
    {
      "title": "Make an aspirin mask to reduce redness.",
      "content": "Make an aspirin mask to reduce redness. Mix together 4-5 crushed uncoated aspirin with a little water to form a paste. Apply to the inflamed area gently with a cotton swab and rinse off once dry. [2] X Research source Do not try an aspirin mask if you have an allergy to the medication, if you are taking potentially interactive medication, or if you have a health condition that also prevents you from ingesting aspirin."
    },
    {
      "title": "Try a yogurt and honey mask to soothe inflammation.",
      "content": "Try a yogurt and honey mask to soothe inflammation. Mix together equal parts plain, full-fat yogurt and honey. Apply a thin layer of the mask to any inflamed areas on your face. Let the mask sit for 10-15 minutes before washing it off with warm water. [3] X Research source"
    },
    {
      "title": "Apply a hot washcloth or a warm compress to the zit.",
      "content": "Apply a hot washcloth or a warm compress to the zit. While ice can temporarily reduce redness, a warm compress works to reduce long-lasting inflammation. It can also open up your pores, allowing the sebum and bacteria to exit through the head of the zit. Hold a warm compress over the pimple for 10-15 minutes at a time. Reapply the compress up to 4 times throughout the day to help clear your pimple. [4] X Research source To make your own warm compress, soak a washcloth in water that is hot, but not too hot to touch. If you just steeped some tea, you could even use the teabag. Follow your warm compress with a gentle face wash. Washing your face will help remove some of the oil and bacteria that was drawn out by the warm compress. You can also add a few drops of tea tree oil or lavender oil to the compress to help reduce inflammation."
    },
    {
      "title": "Apply a green concealer to quickly mask the redness.",
      "content": "Apply a green concealer to quickly mask the redness. If you’re in a rush to reduce the redness around a pimple, apply a small amount of a green concealer directly to the zit. Blend it out with a clean makeup sponge or brush, and set it with a very thin layer of translucent powder. The green will neutralize the red discoloration. [5] X Research source Green concealer won’t perfectly match most skin tones. You will need to apply a bit of foundation or concealer that matches your skin tone over the green. Concealer can cover the redness of a pimple, but it will not be able to mask any bumps or rises in the skin due to a zit. Some concealers, though, have salicylic acid in them to help gradually combat acne."
    },
    {
      "title": "Hide the pimple with clothing or accessories.",
      "content": "Hide the pimple with clothing or accessories. While clothes and accessories don't actually get rid of the redness, they do make it less visible. If the pimple is on your body, cover it with a piece of clothing. If it is on your face, try using an accessory like sunglasses to hide it. If you have long hair, you may also try to style that in a way that covers up your zit."
    },
    {
      "title": "Apply a spot treatment that has salicylic acid.",
      "content": "Apply a spot treatment that has salicylic acid. You can find over-the-counter spot treatments with salicylic acid at most pharmacies and drug stores. Apply the spot treatment directly to your pimple. The acid will start to dry up the oils and sebum in the area, reducing some of the zit's overall redness. [6] X Research source Spot treatments will take several hours to several days to completely heal the pimple, but they can start to reduce redness quickly."
    },
    {
      "title": "Dab on an acne cream that contains benzoyl peroxide.",
      "content": "Dab on an acne cream that contains benzoyl peroxide. Benzoyl peroxide kills the bacteria in pimples. Since the bacteria also cause the redness, these creams help reduce the redness, as well. [7] X Research source Read the acne cream packaging to look for one that contains benzoyl peroxide."
    },
    {
      "title": "Use eye drops as a spot treatment.",
      "content": "Use eye drops as a spot treatment. Eye drops that contain tetrahydrozoline hydrochloride are formulated to help get rid of redness. That same ingredient can help reduce some of the redness commonly associated with acne. Apply a few drops to a cotton swab and dab that on your pimple to get the most targeted treatment. Alternately, freeze a cotton swab that's been soaked in eye drop solution overnight. Apply it gently to the pimple. The cold will suppress the inflammation. Eye drops won’t help treat the pimple itself. They will just reduce some of the redness for a little while."
    },
    {
      "title": "Use an over-the-counter redness reduction product.",
      "content": "Use an over-the-counter redness reduction product. Many drug stores and pharmacies carry redness relief creams and other topical treatments. These can target mild to moderate redness and reduce discoloration in as little as 12 hours. You may want to ask a pharmacist which product is right for you, especially if you have sensitive skin or are using any other topical treatments. [8] X Research source Common products used to combat redness include Rhofade and Eucerin Redness Relief Soothing Night Cream."
    },
    {
      "title": "Try hydrocortisone cream for a temporary reduction in redness.",
      "content": "Try hydrocortisone cream for a temporary reduction in redness. Although hydrocortisone cream is typically used for itching, it can also help reduce redness. Dab a small amount of the cream directly onto your pimple. You can buy 1% hydrocortisone cream over-the-counter at most drug stores. [9] X Research source"
    },
    {
      "title": "Use a clay mask to dry up zits.",
      "content": "Use a clay mask to dry up zits. Combine 2-3 tablespoons of powdered clay with enough water to form a spreadable paste. Apply a thin layer of the mask to your face and let it dry fully before rinsing it off with warm water. Add a few drops of tea tree oil to the paste before application to amp up its acne-fighting powers. [10] X Research source You can get powdered clay from most pharmacies, drug stores, and health food stores, as well as online. Alternatively, you could use a pre-mixed clay mask, which you can find in the bath section of your local department store or in a beauty supply or drug store."
    },
    {
      "title": "See a dermatologist if you get repeated breakouts.",
      "content": "See a dermatologist if you get repeated breakouts. You could get breakouts for reasons ranging from internal hormones to external environmental factors. If you’re struggling to control those factors on your own, talk to a dermatologist. They can help you develop a holistic acne treatment plan that may include diet and lifestyle changes, a new or enhanced skincare routine, and/or acne medication. [11] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source According to dermatologist Margareth Pierre-Louis, you could even talk to your dermatologist about prescribing a stronger medication, like retinoic acids. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Wash your face daily with a quality face wash.",
      "content": "Wash your face daily with a quality face wash. According to dermatologist Margareth Pierre-Louis, daily washing prevents your skin from developing a mild yeast infection. It also helps remove the dead skin, sebum, and bacteria that promotes acne. [13] X Expert Source Margareth Pierre-Louis, MD Board Certified Dermatologist Expert Interview. 15 May 2020. Look for a face wash that is formulated for acne-prone skin. Your dermatologist or doctor can help you with recommendations for the right wash for you. [14] X Research source Aim to wash your face 1-2 times a day. If you wear makeup, one of those times should be at the end of the day to remove your makeup. Try not to wash too much, since overwashing can actually encourage acne. Don't scrub too hard or use a rough-surfaced implement like a loofah or washcloth to wash your face. Your hands or a face brush will work great. When drying your face, gently pat dry with a towel."
    },
    {
      "title": "Use a toner after cleansing.",
      "content": "Use a toner after cleansing. Apply the toner to a cotton pad, then wipe it over your face. The toner will remove any excess dirt or makeup that remains on your skin and balance your skin's pH. Toner also tightens your pores. You can find toner at a drug store or beauty supply store."
    },
    {
      "title": "Moisturize your face daily.",
      "content": "Moisturize your face daily. Dermatologist Margareth Pierre-Louis agrees that moisturizer is a great way to hydrate and replenish your skin. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source After washing your face, you should apply a moisturizing cream, gel, or lotion. This helps replenish the natural moisture that was stripped away when you washed your face. Even if you have oily or acne-prone skin, a moisturizer can help reduce the amount of oil and sebum your face produces, and reduce your breakouts. [16] X Research source There’s no shortage of different moisturizers on the market, so finding the one for you might take a little experimenting. Look for a moisturizer that is formulated for your skin type (oily, combination, etc.) to get the best results. If you have acne-prone skin, look for a non-comedogenic moisturizer. It will be specifically formulated to ensure it doesn’t block your pores."
    },
    {
      "title": "Keep your skin hydrated.",
      "content": "Keep your skin hydrated. A moisturizer will help keep your skin hydrated, but there’s more you can do. Some of the most effective steps are preventative care, including limiting your exposure to cold or dry air, avoiding extended contact with hot or chlorinated water, and avoiding skin care products that contain alcohol. You should also make sure you are getting plenty of water inside and outside. Many doctors recommend drinking at least 3 liters (13 cups) of water per day for men, and 2.2 liters (9 cups) of water per day for women. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Use facial mists throughout the day to keep your skin hydrated from the outside. If you are in a consistently dry area, you may even want to use a humidifier to keep your skin happy."
    },
    {
      "title": "Ensure that your body is getting proper vitamins.",
      "content": "Ensure that your body is getting proper vitamins. While research is still ongoing, some studies suggest that certain vitamins can help fight against inflammation and encourage healthier skin. [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Common vitamins that are said to promote healthy skin include: Vitamin A . Vitamin A is an antioxidant, meaning it helps limit damaging molecules called free radicals. These can harm skin cells and hasten signs of aging. Foods rich in vitamin A include carrots, sweet potatoes, spinach, squash, apricots, and cantaloupe. [19] X Research source Vitamin C . Vitamin C is instrumental in producing collagen, the building block of skin. Studies also suggest that it has some anti-inflammatory benefits. Foods rich in vitamin C include guava, citrus fruits, kale, broccoli, kiwi, and strawberries. [20] X Trustworthy Source Oregon State University Linus Pauling Institute Research center dedicated to promoting optimal health through cutting-edge nutrition research and public outreach Go to source"
    },
    {
      "title": "Exfoliate every week.",
      "content": "Exfoliate every week. According to dermatologist Margareth Pierre-Louis, exfoliating involves removing your epidermis, or the outermost layer of your skin. [21] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Exfoliating 1-2 times a week removes the dead cells that end up in zits, and helps promote cellular turnover to keep your skin bright and healthy. [22] X Research source You should exfoliate after you cleanse your skin but before you apply toner. Both mechanical exfoliants, such as facial scrubs, and chemical exfoliants, such as enzyme wipes, are widely available. If you have acne-prone, sensitive, or aging skin, though, you should opt for a chemical exfoliant since scrubs could irritate and even damage your skin. If you have oily or acne-prone skin, you may want to exfoliate as often as 2-3 times per week."
    }
  ]
}