{
  "url": "https://www.wikihow.com/Score-in-Volleyball",
  "title": "How to Score Points in Volleybvall",
  "steps": [
    {
      "title": "Score 1 point every time the ball touches the floor on the opponent's side.",
      "content": "Score 1 point every time the ball touches the floor on the opponent's side. Teams take turns sending the ball over the net to the other side. Each team can only touch the ball 3 times in a row before they must hit it to the other side. If the ball touches the floor on one team's side, the other team gains 1 point. [1] X Research source Each round or point in volleyball is called a \"rally.\" Rallies begin with one team serving the ball to the other team."
    },
    {
      "title": "Familiarize yourself with rally scoring.",
      "content": "Familiarize yourself with rally scoring. Originally, the rules of volleyball stated that only the team serving could score a point. This provision has since been updated—now, either team can score, regardless of which team served the ball. The modern form of scorekeeping in volleyball is known as “rally scoring.” Always be looking for an opportunity to score, whether your team is serving or receiving. Rally scoring keeps games fast-paced, competitive, and fair."
    },
    {
      "title": "Know who can legally score during play.",
      "content": "Know who can legally score during play. During a volleyball match, there are rules about which players are allowed to contact the ball and when. Front row players are responsible for setting up and pulling off attacks, while back row players are generally forbidden from striking the ball. In situations where a back row player jumps from behind the attack line, however, a strike may be considered legal. Players in the back row cannot attack from in front of the attack line. It's legal for front-row players to reach over the net to make a block, but only after the opposing team has made contact with the ball 3 times."
    },
    {
      "title": "Be the first team to score 25 points.",
      "content": "Be the first team to score 25 points. These days, league volleyball games are almost always played to 25 points. However, the winning team must be ahead by at least 2 points by the end of the game. If neither team has a 2-point lead by the time they reach 25 points, the game will continue until one of them achieves a decisive victory. There’s no point cap in professional volleyball, which means that a could theoretically continue indefinitely if neither team manages to secure a 2-point advantage. 25 points may sound like a lot, but between quick scores and faults, a competitive game can be over in a flash."
    },
    {
      "title": "Win the best of 5 games to take the match.",
      "content": "Win the best of 5 games to take the match. Volleyball matches are played using a multiple-game system, similar to sports like tennis. The first team to win 3 games is declared the winner. This keeps play exciting and unpredictable, as rival teams can trade victories right up until the end. [2] X Research source The final game in the series is sometimes played to 15 points rather than the traditional 25. [3] X Research source Stay focused. Even if you’ve won the first 2 games, it’s still possible for the opposing team to rally and neutralize your advantage if you begin playing carelessly."
    },
    {
      "title": "Avoid giving up points on a fault.",
      "content": "Avoid giving up points on a fault. Making a clean hit isn’t the only way to score in volleyball. A point will also be awarded or deducted whenever you or the opposing team commits a technical foul. Penalty fouls in volleyball include: Faulting on a serve. Making contact with the ball more than 3 times before successfully getting it over the net. Hitting the ball out of bounds without a player from the opposing team first touching it. Attempting to block a hit from the opposite side of the net. Touching the net while the ball is in play."
    },
    {
      "title": "Use a score sheet to keep track of points.",
      "content": "Use a score sheet to keep track of points. A judge or referee will ordinarily be responsible for scoring during competitive play. If you’re playing for fun, you can print an official score sheet off the internet, or devise your own simple version to keep things simple. Write the names of the two teams at the top and make a notch anytime one team scores. [4] X Research source Make sure the scoring sheet you’re using provides spaces to list other important details such as players’ names, numbers, serving orders, and substitutions. For league games, you may also want to put down the time, date, and location of the match."
    },
    {
      "title": "Score points by grounding the ball on the opponent’s side of the net.",
      "content": "Score points by grounding the ball on the opponent’s side of the net. Each time you strike the ball to the floor, or the opposing team fails to keep it in the air or return it, your team will get one point. It’s critical that the ball fall within the legal boundaries. Otherwise, it will be considered out of bounds, and the point will be denied or even ruled a fault. [5] X Research source The key to winning is positioning and coordinating your team so that you have the best chance of scoring without leaving openings to be scored on yourself. An experienced referee with a good eye can be instrumental in arbitrating controversial plays."
    },
    {
      "title": "Perfect your serve.",
      "content": "Perfect your serve. During the opening play of the match, the player serving sends the ball sailing over the net, inviting the opposing team to return. When delivered with power and precision, a well-placed serve can score an immediate point for the offensive team. Even when successfully defended, it gives the serving team more time to set up for the next play in the rally. [6] X Research source A point scored on a serve (whether the result of a clean strike or failure of the receiving team to keep the ball in play) is called an \"ace.\" [7] X Research source Overhand serves are more difficult to pull off, but are also harder to defend than underhand serves. Be careful not to cross the court's end line while serving, or it could be declared a fault."
    },
    {
      "title": "Improve your passing skills.",
      "content": "Improve your passing skills. Strategic passing allows your team to get the ball into a better position to return or attempt a strike. Generally, giving final possession of the ball to the player with the strongest offensive skills is a good idea to maximize your scoring potential and keep the opposing team on their heels. When passing the ball, always contact the fleshy part of your forearms rather than your hands or wrists. Over time, too much force can cause stress to the small bones in these areas. Remember that your team only has 3 chances to return a ball falling on your side of the net before it's ruled a fault."
    },
    {
      "title": "Practice setting.",
      "content": "Practice setting. The purpose of setting is to control the ball in preparation for a strike. Skillful setting provides your team's hitters with a clearer angle of attack and allows them to the drive ball at such a high velocity that it's nearly impossible to return. [8] X Research source Coordinate with your team so the hitter is in position and ready to strike when the set ball reaches its highest point above the net. A set is sometimes called an \"overhead pass.\""
    },
    {
      "title": "Develop your striking technique.",
      "content": "Develop your striking technique. Once the setter has elevated the ball, the striker will attempt to fire it straight through the opposing team's defense. As the ball approaches, squat low and jump to meet it. Strike the ball with the flat of your palm as you would during an overhand serve. If they're unable to return your strike your team will earn a point. [9] X Research source Try to maneuver the ball as far away from the opposing team's defensive players as possible. In most games, most of the points your team scores will be due to unblocked strikes."
    },
    {
      "title": "Build a solid block to set up a score as the receiving team.",
      "content": "Build a solid block to set up a score as the receiving team. A strong offense alone doesn't win volleyball games. Establishing an ironclad defense with your teammates is essential for preventing the opposing team from scoring. It also forces them to make split-second returns if the ball happens to fall on their side of the net, which can help slow down an offensive assault and even lead to faults in your team's favor. [10] X Research source Under most competitive rules, the trio of players closest to the front of the net will be responsible for blocking. If a blocked ball falls on your side of the net, your team will still have 3 chances to return it."
    },
    {
      "title": "Pay close attention to your rotation.",
      "content": "Pay close attention to your rotation. In most sports, a player's position determines their location on the field or court. In volleyball, however, each player moves in a clockwise direction before every serve. You and your teammates must stay on top of the ongoing rotation and become confident playing from every possible position. [11] X Research source Your position in the rotation is not the same as your player position. Defensive players, for instance, will remain on the defensive until the rotation shifts them to the front of the court. [12] X Research source Playing out of the correct rotation could earn you a fault or even cause you to lose a point."
    },
    {
      "title": "Drill team plays constantly.",
      "content": "Drill team plays constantly. Sharpening your own technique will only get you so far. In order to increase your scoring potential during competitive play, it will be necessary to practice as a unit with your entire team. Ultimately, teamwork is more important when it comes to consistent scoring than having the hardest strike or the best block. [13] X Research source Be sure to incorporate both offensive and defensive drills into your practice to get some experience playing both sides of the net. [14] X Research source If possible, break into smaller teams and face off in a scrimmage to simulate competitive play and enhance your ability to come out on top in fast-paced rallies."
    },
    {
      "title": "Practice frequently.",
      "content": "Practice frequently. Regular practice is key to maintaining and developing your skills, both as an individual player and as a team. A good coach will keep you on a tight practice schedule and look for ways to bring the best out of each player. [15] X Research source Teams who practice hard play hard. Treat your practice sessions with the same seriousness you would a championship-level game."
    }
  ]
}