{
  "url": "https://www.wikihow.com/Pit-Dates",
  "title": "How to Pit Dates",
  "steps": [
    {
      "title": "Get a small serrated or pairing knife.",
      "content": "Get a small serrated or pairing knife. Using a small knife will make it easier for you to cut the dates accurately. Make sure the knife is sharp. You can use a sharpening stone to prepare the knife for cutting."
    },
    {
      "title": "Place the date on a cutting board.",
      "content": "Place the date on a cutting board. Use a cutting board to pit the dates with a knife. The cutting board will protect the cutting surface and ensure the date does not roll around or move too much when you cut it."
    },
    {
      "title": "Slice ⅛ of an inch (0.32 cm) into the center of the date.",
      "content": "Slice ⅛ of an inch (0.32 cm) into the center of the date. Hold the date with your thumb and forefinger. Place the knife in the center of the date. Slice downward from the top to the bottom of the date. Be careful not to cut all the way through the date. Only cut deep enough so you can expose the pit."
    },
    {
      "title": "Open the date and pull out the pit.",
      "content": "Open the date and pull out the pit. Use your fingers to part open the date at the cut. You should see the pit in the center of the date. Pull it out by tugging on it with your fingers. Repeat this with the remaining dates. With enough practice, you should be able to remove the pits with a knife quickly and efficiently."
    },
    {
      "title": "Get a long chopstick.",
      "content": "Get a long chopstick. Make sure the chopstick is smooth and sleek to the touch. A long wooden or metal chopstick will work well. It should have a pointed end so it can slide easily into the date. [1] X Research source"
    },
    {
      "title": "Hold the date in one hand and the chopstick in the other.",
      "content": "Hold the date in one hand and the chopstick in the other. Hold the date in your non-dominant hand using your thumb and forefinger. Grip the chopsticks in your dominant hand with the point facing one end of the date. [2] X Research source"
    },
    {
      "title": "Insert the chopstick into one end of the date.",
      "content": "Insert the chopstick into one end of the date. Slide the chopstick into one end of the date. You may need to wiggle it a little to get it into the date. Insert it as straight as you can so it reaches the pit in the center. [3] X Research source"
    },
    {
      "title": "Push the chopstick all the way into the date.",
      "content": "Push the chopstick all the way into the date. The pit should emerge out of the other end. Grip the date tightly with one hand as you push the chopstick in so it does not move or slide around. [4] X Research source Repeat this process with any remaining dates. You may need to wipe off the chopstick periodically to remove sticky residue from the dates."
    },
    {
      "title": "Look for sundried dates.",
      "content": "Look for sundried dates. Sundried dates are easy to pit and taste great as a snack on their own or as part of a recipe. They have been dried out so they are smooth on the outside and sticky and gooey on the inside. You can find sundried dates at your local grocery store or health food store."
    },
    {
      "title": "Try different types of dates.",
      "content": "Try different types of dates. There are many varieties of dates, from Barhi to Halawy to Medjool. Some dates are good for eating fresh and some are better prepared in recipes. Try different varieties so you can experience the full range of flavors in dates. [5] X Research source Look for a variety of dates at your local grocery store or at Middle Eastern grocery shops. You can also order different varieties online."
    },
    {
      "title": "Buy dates in bulk.",
      "content": "Buy dates in bulk. Save money by getting dates in bulk, or in large quantities. Dates are usually cheaper if you buy them in bulk. You can get dates in bulk at your local bulk store or online. Make sure you check the expiry date on the bulk dates and use them before they expire. Some varieties of dates must be used within a few weeks so they do not go bad."
    }
  ]
}