{
  "url": "https://www.wikihow.com/Play-Let-It-Ride",
  "title": "How to Play Let It Ride",
  "steps": [
    {
      "title": "Place 3 equal bets on the table in front of you.",
      "content": "Place 3 equal bets on the table in front of you. Place 3 stacks with equal numbers of poker chips in front of you to use for your bets. Since you make all of your bets before you get to see your hand of cards, be careful not to risk too much unless you’re feeling really lucky. If you’re playing Let It Ride at a casino, they may set a minimum amount you can place for each bet, but it’s usually around $5 USD. You’ll have the chance to take back 2 of your bets later on, but you’ll always have to keep one of them in play."
    },
    {
      "title": "Make optional 3-card bonus and progressive wagers to win extra money.",
      "content": "Make optional 3-card bonus and progressive wagers to win extra money. A 3-card bonus pays out if you have a pair of 10s or higher after you get your hand of cards. You’ll meet a progressive wager if you have a 3-of-a-kind or higher between the 5 cards in play. You usually only have to bet $1 USD per hand for a bonus wager, so just set a poker chip in front of your other bets for each bonus wager you want to make. [1] X Research source You still have to make your wagers before you’re dealt any cards, so it’s a small risk that could give you a huge payout if you win. Some Let It Ride tables at casinos won’t offer additional bets, but feel free to make them if you’re playing at home."
    },
    {
      "title": "Pick a dealer to deal 3 cards to each player and 2 to themselves.",
      "content": "Pick a dealer to deal 3 cards to each player and 2 to themselves. If you’re playing at home, choose someone to shuffle and deal the cards. Once you get your hand of 3 cards, you can look at them but keep them hidden from anyone else you’re playing with. When the dealer deals cards to themselves, they’ll keep the 2 cards face-down in front of them. [2] X Research source The dealer’s cards are called “community cards” and every player will use them. Your 3 cards and the dealer’s 2 cards form your poker hand."
    },
    {
      "title": "Familiarize yourself with standard poker hands.",
      "content": "Familiarize yourself with standard poker hands. You only get your bets paid out if you have a standard poker card combination between the 3 cards in your hand and the 2 community cards. You’ll win back your bet (and maybe some extra cash) if you have: [3] X Research source 1 Pair : 2 cards with values 10 or higher. Aces are the highest rank. 2 Pairs : 2 different sets of pairs. Three-of-a-kind: 3 cards of the same value. Straight : 5 cards of any suit in a sequence, such as 3-4-5-6-7 or 8-9-10-J-Q. Aces can come before 2s or after kings in a sequence. Flush : 5 cards of the same suit but not in a sequence. Full House : three-of-a-kind and a pair. Four-of-a-kind : 4 cards with the same value. Straight Flush : 5 cards in the same suit in a sequence. Royal Flush : ace, king, queen, jack, and 10 in the same suit."
    },
    {
      "title": "Choose to withdraw one of your bets if you don’t like your hand.",
      "content": "Choose to withdraw one of your bets if you don’t like your hand. Start with the player sitting to the left of the dealer and go clockwise around the table. You won’t be able to see the dealer’s cards yet, but if you feel confident that you can make a winning poker hand, keep all of your bets in the game and “let it ride!” If you’re not feeling lucky or were dealt a bad hand, you can take one of your stacks of chips back. [4] X Research source You're not competing to have a better hand than other players, so you don't have to worry about if you have a lower-value hand than them. If you have a pair or three-of-a-kind, you should let it ride since you’ve already got a winning hand. If you have 3 cards of the same suit in a sequence higher than 2-3-4, it’s a good idea to stay in for the first bet since it’s the start of a straight flush. If you’re missing one of the cards in the sequence but you have a 10 or higher, you should still let it ride."
    },
    {
      "title": "Flip over one of the dealer’s face-down cards.",
      "content": "Flip over one of the dealer’s face-down cards. Whoever is the dealer takes flips over the community card on their left to reveal it to everyone. The card they just revealed is now a part of your hand and counts towards any winning poker combos."
    },
    {
      "title": "Take back another one of your bets if you’re still not confident in your hand.",
      "content": "Take back another one of your bets if you’re still not confident in your hand. Take turns clockwise around the table. Choose if you want to let it ride and keep your bets in or if you want to take back another one of your bets. Even if you let it ride during your first bet, you can still withdraw one of your bets once you see the first community card. [5] X Research source You’ll always have to leave at least 1 of your bets in for the round. Let it ride if you already have a pair, three-of-a-kind, four-of-a-kind, or any 4 cards to form a flush. If you have a straight where you’re only missing the highest or lowest value, and one of the cards is a 10, you should keep your bet in for the round."
    },
    {
      "title": "Reveal the dealer’s second card and your hand.",
      "content": "Reveal the dealer’s second card and your hand. Once everyone chooses what to do with their second bet, the dealer flips over their last card to complete your 5-card poker hand. [6] X Research source"
    },
    {
      "title": "Pay out based on the hand made by your cards and the dealer’s cards.",
      "content": "Pay out based on the hand made by your cards and the dealer’s cards. If you didn’t have a winning poker hand, you lose any of the bets that were still on the table. Otherwise, you get a payout depending on the odds of your poker hand. While payout odds may differ depending on where you’re playing Let It Ride, the standard odds are: [7] X Research source 1 Pair : 1 to 1 2 Pairs : 2 to 1 Three-of-a-kind: 3 to 1 Straight : 5 to 1 Flush : 8 to 1 Full House : 11 to 1 Four-of-a-kind : 50 to 1 Straight Flush : 200 to 1 Royal Flush : 1,000 to 1 Some casinos have maximum payout limits for each hand."
    },
    {
      "title": "Earn a bonus payout if you meet a 3-card wager.",
      "content": "Earn a bonus payout if you meet a 3-card wager. If you had a winning card combination in your 3-card hand and placed a wager at the start of the round, you get an additional payout depending on the cards you have. [8] X Research source 1 Pair : 1 to 1 Flush : 3 to 1 Straight : 6 to 1 Three-of-a-kind: 30 to 1 Straight Flush : 40 to 1 Mini Royal Flush (ace, king, queen) : 50 to 1"
    },
    {
      "title": "Get a bonus for meeting a progressive wager.",
      "content": "Get a bonus for meeting a progressive wager. You win a progressive wager if you have a winning combo that’s a three-of-a-kind or higher with all 5 of the cards. You can also win a small amount from an “envy bonus” if another player at the table gets a winning combo. The payouts are: Three-of-a-kind: 9 to 1 Straight : 30 to 1 Flush : 40 to 1 Full House : 50 to 1 Four-of-a-kind : 300 to 1 Straight Flush : 10% of the jackpot. If another player gets a straight flush, you win a $300 USD Envy bonus. Royal Flush : 100% of the jackpot. If another player gets a royal flush, you win a $1,000 USD Envy bonus. Envy bonuses may vary depending on the casino and table."
    }
  ]
}