{
  "url": "https://www.wikihow.com/Play-Casino-(Card-Game)",
  "title": "Complete Game Instructions for Casino (Cassino)",
  "steps": [
    {
      "title": "Deal 4 cards to each player and the center of the table 2 at a time.",
      "content": "Deal 4 cards to each player and the center of the table 2 at a time. Shuffle a deck of cards excluding the jokers. Starting with the player to your left, deal out 2 cards at a time face-down to the other players going clockwise around the table except yourself. Then, set the next 2 cards face-up in the middle of the table before giving yourself 2 cards. Then, go around the table once more to deal out 2 more cards to each player and the middle of the table. [1] X Research source You can look at your hand of cards, but keep them secret from other players."
    },
    {
      "title": "Match a card from your hand to one on the table to capture it.",
      "content": "Match a card from your hand to one on the table to capture it. Look at the cards in your hand to see if any of them have the same value as one on the table. Play the card from your hand on top of the matching card in the middle to capture it. Set the card you played and the one you captured into a face-down scoring pile in front of you. [2] X Research source Example : If you have an 8 in your hand, you can capture an 8 on the table. If you have a 5 in your hand, you can capture a 5 on the table, and so on. The first player of the game is whoever sits to the left of the dealer. After that, players take their turns clockwise around the table. You may only capture kings, queens, and jacks by matching a card from your hand. During your turn, you'll always play one card from your hand. If you can't match a card from your hand to one on the table, then you may take one of the other options below."
    },
    {
      "title": "Capture multiple cards by playing a card matching their total value.",
      "content": "Capture multiple cards by playing a card matching their total value. Check if the combined value of any cards on the table adds up to the value of one of the cards in your hand. If they do, play the card from your hand to capture the cards with the same total value on the table, and add them to your face-down scoring pile. [3] X Research source Example : If you have a 7 in your hand, you can capture a 3 and 4, 5 and 2, or 6 and 1. If you have a 9 in your hand, you may play it to capture a 2, 3, and 4 on the table. Aces have a value of 1 in Casino, so you could capture a 4 and ace if you play a 5 from your hand. You may capture a match and cards with the same total value at the same time. For instance, if you play an 8 in your hand, and there is a 3, 5, and 8 on the table, you can combine the 3 and 5 and match the 8 to capture all of the cards. If you’re able to capture all of the cards on the table at once, like playing a 10 to capture an ace, 2, 3, and 4, you score a “sweep” and earn 1 additional point at the end of the round. Put the card you played face-up in your scoring pile as a reminder. [4] X Research source"
    },
    {
      "title": "Combine a card in your hand with a card on the table to create a build.",
      "content": "Combine a card in your hand with a card on the table to create a build. Rather than capturing right away, you may make a build to capture on your next turn. Place a card from your hand on top of one on the table so that you can see the number on each card. Then, declare the new value of the build out loud. You must have a card that matches the build’s total value in your hand so you’re able to capture the cards on your next turn. Just beware of any other players that have a card matching the value of the build, because they may play the card and capture on their turn. [5] X Research source Example : If you have a 6 and 8 in your hand, and a 2 on the table, you may lay the 6 on top of the 2 and announce, “Building 8” out loud. On your next turn, you may play the 8 from your hand to capture the 2 and 6. Once cards are in a build, they cannot be separated or captured individually. You may pull multiple cards from the table to form your build. For instance, if there is an ace, 2, and 3 on the table, and you have an ace and 7 in your hand, you could combine the 3 table cards on the table with your ace to build a 7. On your next turn, you would capture all of those cards, unless another player has a 7 and captures them first."
    },
    {
      "title": "Add cards to a single build to increase the value.",
      "content": "Add cards to a single build to increase the value. Instead of capturing a build, you may play a card from your hand to it to raise the total value, as long as you have a card to capture it on your next turn. Announce the new value of the build after you play your card. [6] X Research source Example : If there’s a 2 and 6 making an 8-build, and you have an ace and 9 in your hand, you can add the ace and say, “Building 9.” Then, you may play the 9 on your next turn to capture the build."
    },
    {
      "title": "Start a multiple build using cards with the same value as one on the table.",
      "content": "Start a multiple build using cards with the same value as one on the table. Multiple builds are 2 or more combinations of the same card value. Play a card from your hand and combine it with any number of cards on the table so the total value equals another card on the table. Then, announce the original card’s value out loud to show you’re making a multiple build. [7] X Research source Example : If there’s a 5 and ace on the table and you have a 4 in your hand, you may combine the ace and 4 and set them on top of the 5 to create a multiple 5-build. Then announce “Building 5” to the other players. On your next turn, you may play a 5 to capture the multiple build. You may not add a card to a multiple build to increase the value. You may only capture the build with a card that has the same value, or add another combination that equals that value."
    },
    {
      "title": "Play a card to the table if you can’t capture or build.",
      "content": "Play a card to the table if you can’t capture or build. If you don’t have the cards in your hand to capture or legally make a build, choose one of the cards from your hand, and add it face-up to the row in the middle of the table. You and other players may now capture the card normally or use it in builds. [8] X Research source Playing a card to the table is known as “trailing.”"
    },
    {
      "title": "Deal 4 new cards to each player when all players are out of cards.",
      "content": "Deal 4 new cards to each player when all players are out of cards. Because you must play one card during your turn from your hand, every player will empty their hand on the same turn. Deal out 4 cards to the players 2 at a time to refill their hands. [9] X Research source Do not add any more cards to the center of the table whenever you refill your hand."
    },
    {
      "title": "End the round when you run out of cards to play.",
      "content": "End the round when you run out of cards to play. After you deal out the last cards from the draw pile, continue taking turns capturing, building, or trailing. Once the last player plays their last card, the round immediately ends. [10] X Research source If there are still cards left in the middle of the table after playing the last card, add them to the scoring pile of the last player that captured."
    },
    {
      "title": "Earn 3 points if you captured the most cards.",
      "content": "Earn 3 points if you captured the most cards. Count out how many cards you captured in your scoring pile and give 3 points to whoever has the most. If there is a tie for the most number of cards, then no one receives points. [11] X Research source If you have any face-up cards in your scoring pile from getting a sweep, remember to add 1 point to your score for each one."
    },
    {
      "title": "Score 1 point if you captured the most spades.",
      "content": "Score 1 point if you captured the most spades. Sort through your scoring pile and count how many spades you collected. If you have more spades than any other player, then you add 1 point to your score. [12] X Research source If there is a tie for the most spades, then no one earns points are awarded."
    },
    {
      "title": "Award points for the aces, 10 of diamonds, and 2 of spades.",
      "content": "Award points for the aces, 10 of diamonds, and 2 of spades. Check your scoring pile for any aces and count 1 point for each one. If you have the 2 of spades, you also score 1 point. Lastly, check for the 10 of diamonds and add 2 points to your score if you have it. [13] X Research source The 10 of diamonds is sometimes known as the “Big Casino” or “Good 10.” The 2 of spades may also be called the “Little Casino” or “Good 2.”"
    },
    {
      "title": "Shuffle and deal out cards to start the next round.",
      "content": "Shuffle and deal out cards to start the next round. Gather all of the cards and pass them to the player on your left to be the next dealer. Just like the last round, shuffle and deal out 4 cards to the other players and the middle of the table. Continue playing just like you did during the first round capturing, building, or trailing cards. [14] X Research source"
    },
    {
      "title": "Win the game when you reach 21 points.",
      "content": "Win the game when you reach 21 points. After you finish a round, add the points from the current round to the previous one. If you earn a total of 21 points or more, you win the game! [15] X Research source If there’s a tie on who reached 21 first, play one more round and whoever has the highest score wins."
    }
  ]
}