{
  "url": "https://www.wikihow.com/Prepare-for-a-History-Exam",
  "title": "How to Prepare for a History Exam",
  "steps": [
    {
      "title": "Make flashcards of key terms, people, and dates.",
      "content": "Make flashcards of key terms, people, and dates. Studying history involves memorizing lots of dates, names, events, and other facts. Look through your notes and textbook and identify keywords. Make a list of them, then create flashcards with a word on one side and its definition or explanation on the other. You can even use an app like quizlet to create flashcards digitally. [1] X Research source If you have trouble coming up with a list, try asking your teacher what key dates, figures, and other information might show up on the test."
    },
    {
      "title": "Say information out loud as you read and write notes.",
      "content": "Say information out loud as you read and write notes. Seeing, saying, hearing, and touching at the same time help your brain make stronger connections and memorize information more easily. Try reading your textbook out loud as you study, and say what you’re writing as you create your flashcards. [2] X Research source You could also try recording yourself reading your textbook or flashcards. As you listen to the recording, follow along in your notes or flashcards."
    },
    {
      "title": "Use mnemonic devices to memorize facts.",
      "content": "Use mnemonic devices to memorize facts. Memorization can be boring, but using quick, silly ways to remember facts can add a little fun. Even better, they’re also an effective way to keep your facts straight. For example, the mnemonic device Neighbors Actually Persuaded Lovely Yvonne To Shut Her Window will help you memorize the British royal families in chronological order: Norman, Angevin, Plantagenet, Lancaster, York, Tudor, Stuart, Hanover, and Windsor. [3] X Research source"
    },
    {
      "title": "Read the course syllabus to identify overarching themes.",
      "content": "Read the course syllabus to identify overarching themes. Your course syllabus is the sheet of paper that lists each session’s topic and required reading. Look over the titles, units, and other information listed in the syllabus to find clues about how the course’s larger themes fit together. Ask yourself, “How does the syllabus organize these facts and figures? Does it mention or hint at any key critical questions? What connections does it make between individual class sessions?”"
    },
    {
      "title": "Synthesize information by making an outline or study guide.",
      "content": "Synthesize information by making an outline or study guide. You can make a study guide or outline once you’ve looked over your syllabus and gotten a feel for how the class organizes information. Use the syllabus as a guide to structure and consolidate your study guide. Your study guide won’t do you much good if it simply copies your class notes. Look for key themes in your class notes, pull out the essential information, and put it in your outline. For example, if you’re outlining class sessions on the Wars of the Roses, you could list key members (along with their dates and titles) of the houses of Lancaster and York in one section of your study guide. Then, you could outline underlying causes of the rivalry between the houses. Finally, you could list key battles and their dates, temporary truces and how they broke down, and the conflict’s resolution."
    },
    {
      "title": "Create a chart or map to make connections between facts.",
      "content": "Create a chart or map to make connections between facts. When studying history, charts, drawings, and maps are sometimes the best way to visualize how the information fits together. In addition to being great study tools, making visual aids like timelines, family trees, and flow charts will help give you a bird’s eye view of the material. [4] X Research source For example, making family trees and a timeline would come in handy if you’re trying to prepare for an exam on the Wars of the Roses."
    },
    {
      "title": "Ask your teacher for help.",
      "content": "Ask your teacher for help. Your teacher is there to help you! If you’re not sure what they are looking for, ask them. [5] X Research source For example, ask them what the exam's format will be, what the unit's main theses (or key ideas) are, and what information is most important."
    },
    {
      "title": "Study",
      "content": "Study the material as you get it. Start studying early - it's hard to learn all you'll need to know in just one night. Look over your notes from each class session that night when you do your homework. You can study more intensely as the test approaches, but you’ll have a solid foundation and won’t have to cram."
    },
    {
      "title": "Find out the test’s format.",
      "content": "Find out the test’s format. Do your best to get as clear an idea as possible of what the test will look like. Ask your teacher whether you should prepare for multiple choice questions, essays, or both. [6] X Research source Multiple choice or fill in the blank tests stress memorization, so you’ll know that you should put your flashcards to good use. If your test includes or is only made up of essays, you should be prepared to analyze a set of historical facts or compare and contrast two interpretations."
    },
    {
      "title": "Try to anticipate test questions.",
      "content": "Try to anticipate test questions. Put yourself in your teacher’s shoes and try to come up with potential test questions. Practice writing essays and, to prep for multiple choice questions, have someone quiz you on your flashcards. Study groups are great for coming up with potential test questions, since everyone can make up a question and quiz each other."
    },
    {
      "title": "Take practice exams.",
      "content": "Take practice exams. If you’re preparing for school exam, make and exchange practice tests with someone in your class, or have a family member test you. If you’re taking an AP History, SAT subject test, or other standardized exam, look for practice tests on CollegeBoard.org. [7] X Research source You can also find exam tips, sample responses, and other useful resources on CollegeBoard. Just search for whichever standardized test you’ll be taking."
    },
    {
      "title": "Get a good night’s sleep and eat well just before the test.",
      "content": "Get a good night’s sleep and eat well just before the test. Don’t stay up late cramming the night before the test. Try to go to bed on time, relax, and get a good night’s sleep. On the day of the test, have a full breakfast and, if the test is late in the day, a good lunch. If you feel like you need to study, just review your outlines and hard facts. Try to be confident and avoid overwhelming yourself or getting too nervous."
    },
    {
      "title": "Master a multiple choice test's material.",
      "content": "Master a multiple choice test's material. Mnemonic devices, flashcards, and other memorization techniques are great for multiple choice test prep. If you're in a study group, be sure to quiz each other, and try making practice tests for each other. [8] X Research source When you take the test, make sure to read the question clearly and try to eliminate at least half of the available answer options. [9] X Research source"
    },
    {
      "title": "Stick to an essay question's topic.",
      "content": "Stick to an essay question's topic. If your test will include short or long essay questions, make sure you can answer the question without adding any extra fluff. Being direct is especially important for short essays, which typically require you to provide just a few sentences and often deal with definitions. [10] X Research source When studying, refer to your list of key terms and concepts, and make sure you can concisely define them. Have someone quiz you on your flashcards. Try to get to the point that you can give a complete but brief answer without asking for any hints."
    },
    {
      "title": "Use the unit's main ideas to study for an essay test.",
      "content": "Use the unit's main ideas to study for an essay test. Look over your syllabus or textbook for your unit's key points. Those theses, or main ideas, are the best way to predict what a long essay question will ask. [11] X Research source Understand the unit's main concepts, then use the facts and figures you've memorized to back up those key points. Remember there's no \"U\" in history: leave personal opinions out of essays!"
    },
    {
      "title": "Read the essay question thoroughly.",
      "content": "Read the essay question thoroughly. A long essay can take up a major proportion of the test grade, so do your best to be sure you're answering the essay question the right way. When it's time to take the test, take a moment to understand what a long essay is asking you to do. [12] X Research source Look for words like analyze or compare and contrast, then plan your essay accordingly. For example, historians disagree about the degree to which feudalism in the Late Middle Ages set the stage for the Wars of the Roses. Your exam could include an essay asking you to defend one position and explain why it’s a more accurate interpretation."
    }
  ]
}