{
  "url": "https://www.wikihow.com/Say-Hello-in-Pakistan",
  "title": "How to Say Hello in Pakistan",
  "steps": [
    {
      "title": "Know the rules about addressing different sexes.",
      "content": "Know the rules about addressing different sexes. Muslim countries are very concerned with respecting defined boundaries between the sexes. If you are new to Pakistan and its culture, it is best to err on the side of caution when addressing the opposite sex. Keep in mind that there are strict rules about men addressing women and about women addressing men. Most Muslim women will not respond to greetings from men outside their families, and many men consider greetings from women, especially non-Muslim women, as very improper and impolite."
    },
    {
      "title": "Practice your pronunciation.",
      "content": "Practice your pronunciation. The complicated Persian and Arabic origin dialects make Urdu a difficult language for non-native speakers. [1] X Research source The accent can vary between regions, but the most appropriate greeting when speaking with a Muslim is the Salam greeting. Use the phrase \"As-Salam-u-Alaikum\", which means \"Peace be unto you\". [2] X Research source This phrase is pronounced “us-saa-laam-muu-alie-kum.”"
    },
    {
      "title": "Modify the greeting depending on your audience.",
      "content": "Modify the greeting depending on your audience. As with other languages, the pronouns in the Salam greeting will change depending on who you are greeting. For example, the Salam greeting would be different if you are meeting a male business associate versus meeting the girlfriend of a colleague. To modify the Salam greeting, you must change the “you” in the phrase, which is represented by the “-kum” part of As-Salam-u-Alaikum: [3] X Research source As-Salāmu `alayk (a) : use when greeting one male As-Salāmu `alayk (i) : use when greeting one female As-Salāmu `alayk (umā) : use when greeting two people of any gender As-Salāmu `alayk (unna) : use when greeting multiple females only' As-Salāmu `alayk (umu) : use when greeting a group of three or more people, where at least one is a male or if you are meeting a member of state such as a prime minister, president, king, etc."
    },
    {
      "title": "Greet people in the appropriate order.",
      "content": "Greet people in the appropriate order. Hierarchy is very important in Pakistan so greetings must be extended in a particular order. This is especially true if you are meeting people for business. Show respect by arriving on time and greeting the oldest person or the person with the highest position in the organization first. Then greet people in descending order of age or position. If you do not know everyone in the group, ask a mutual acquaintance to introduce you. Do not introduce yourself because this is considered very rude. Some other tips: [4] X Research source It is customary in Pakistan to need less personal space than many western cultures require, so don’t be surprised or back away if people stand very close to you while in a meeting. Only exchange business cards with either the right hand or with both hands. Never use the left hand, as this is considered extremely rude. Make sure your business card lists your title and any advanced degrees in order to show your status. If you are given a business card, be sure to show respect by studying the card and admiring their position and degrees before you place it into your cardholder."
    },
    {
      "title": "Avoid physical contact unless it is initiated.",
      "content": "Avoid physical contact unless it is initiated. Because the conventions of propriety are much stricter in Muslim countries, you should base any physical greetings, like shaking hands or embracing, on the cues from the Muslim you are greeting. If you are close with the person or they are of the middle class, shaking hands and embracing is much more common, even across sex lines. [5] X Research source Men typically shake hands with one another, and hugs are also common between Muslim and non-Muslim men if they have developed a relationship. Women will rarely hug or shake hands with men; however, some women in the middle and upper classes have adopted wearing gloves in order to bypass the strict law that says women can only make physical contact with male members of their family."
    },
    {
      "title": "Do not rush the conversation.",
      "content": "Do not rush the conversation. Despite the strict rules governing the sexes, Pakistani culture is an incredibly social and vocal culture. Once you have initiated the conversation with the Salam greeting, prepare for a longer conversation about the person's health, their family, and their business. Show interest in the conversation, and don’t try to cut them off, as this is considered rude."
    },
    {
      "title": "Always greet a fellow Muslim.",
      "content": "Always greet a fellow Muslim. In Muslim countries like Pakistan, it is considered extremely impolite to not greet a fellow Muslim. According to the Muslim holy text, the Quran, the Salam greeting has been mandatory since its creation, and the greeting is commanded by Allah. To not greet a fellow Muslim with “As-Salam-u-Alaikum” is to go against scripture, which immoral and punishable."
    },
    {
      "title": "Be aware of the rules dictating who initiates a greeting.",
      "content": "Be aware of the rules dictating who initiates a greeting. In Pakistan, the culture is informed and mandated by the Quran, including who is responsible for initiating a greeting. These rules are considered holy and are strictly followed. When in Pakistan, the rules for initiating a greeting include: The person who arrives greets the Muslims that are present. The person who is riding greets the one who is walking. The person who is walking greets the one who is sitting. The smaller group greets the bigger group. The young greet the elders present."
    },
    {
      "title": "Respond to any greeting promptly.",
      "content": "Respond to any greeting promptly. If you did not initiate the greeting first, it is considered unacceptable to not respond accordingly. [6] X Research source According to the Quran, it is also obligatory for a Muslim to return the Salam greeting regardless of whether or not the other person is Muslim. Not returning the Salam greeting goes against the Quran’s scripture. Respond with \"wa Alaikum Assalam wa Rahmatullah,\" which means \"May the peace, mercy, and blessings of Allah be upon you.\" This phrase is pronounced: \"waa-alie-kum-us-salam waa-rah-ma-tull-la-he.\""
    },
    {
      "title": "Greet any male elders first.",
      "content": "Greet any male elders first. In Pakistani and Muslim cultures, elders are respected highly, and your greeting should reflect this. If you are greeting a large gathering, always start by greeting the eldest males in attendance. Even if you are an elder, if you are the person arriving you must be the one to initiate the greeting, starting with your fellow elders. If you are unsure of whom the eldest is, it is best to bow your head and speak the Salam greeting in the general direction of the elders. [7] X Research source This is considered extremely polite and you will gain respect from the group by doing so."
    },
    {
      "title": "Greet the rest of the group in the appropriate order.",
      "content": "Greet the rest of the group in the appropriate order. After greeting the eldest male, it is best to acknowledge and greet the rest of the group in descending order, according to the Quran. Greet the other male members of the group next, and then acknowledge the women present. Current practices encourage extending the greeting to the children as well so that they become accustomed to the Salam greeting practices from an early age. [8] X Research source"
    },
    {
      "title": "Participate in the resulting conversation.",
      "content": "Participate in the resulting conversation. Unlike other greetings, the Salam greeting is truly a conversation starter in Pakistan and is not meant as a passing “Hello.” Once you have initiated or responded to the Salam greeting, get comfortable and ready yourself for a longer, pleasant conversation about your health, your family, and your business. Avoid speaking only of yourself and be sure to ask the other person/people about their affairs as well. [9] X Research source"
    }
  ]
}