{
  "url": "https://www.wikihow.com/Mod-Beat-Saber",
  "title": "How to Download & Install Mods on Beat Saber: Full Tutorial",
  "steps": [
    {
      "title": "Sign up as a developer.",
      "content": "Sign up as a developer. In order to mod games or sideload apps on Meta Quest, you have to enable developer mode. Before you can enable developer mode, you have to sign up as a developer. During this process, you will be asked to enter a developer organization name. You just need to enter a unique name. It doesn't have to be the name of a real developer. Afterward, you will be asked to add a credit card or set up two-factor authentication. Use the following steps to sign up as a developer: [1] X Research source Go to https://dashboard.oculus.com in a web browser. Sign in with your Oculus or Meta account. Enter a unique developer organization name. Click the checkbox next to \"I understand\" to agree to the terms of service. Click Submit . Read the Non-disclosure agreement and click the checkbox next to \"I agree.\" Click Submit . Click one of the options to add a credit card or set up two-factor authentication if needed."
    },
    {
      "title": "Enable developer mode.",
      "content": "Enable developer mode. After signing up as a developer, you can enable developer mode using the Meta Horizon (formerly Oculus app) on your smartphone. Use the following steps to do so: Make sure your Quest is powered on and near your phone. Open the Meta Horizon app on your smartphone. Tap your profile icon at the bottom of the scene. Tap the icon with three lines ( ☰ ) in the upper-right corner. Tap Devices . Tap your Meta Quest device (a green dot should indicate it is connected.) Tap Headset settings . Tap Developer mode . Ensure the toggle switch next to \"Developer Mode\" is turned on."
    },
    {
      "title": "Make sure you have installed a current purchased version of Beat Saber.",
      "content": "Make sure you have installed a current purchased version of Beat Saber. In order to mod Beat Saber, you must have a copy installed on your Meta Quest that was purchased from the Meta Quest store. Make sure you have the latest version installed. This method works using Meta Quest 2, 3, and Pro models."
    },
    {
      "title": "Backup your Beat Saber saved data (optional).",
      "content": "Backup your Beat Saber saved data (optional). You may want to backup your Beat Saber saved data in case anything goes wrong. Use the following steps to do so: Connect your Meta Quest to your computer. If prompted, allow your computer to access your Meta Quest files. Open File Explorer on Windows or Finder on Mac. Open your Meta Quest's internal storage. Navigate to Android > data > com.beatgames.beatsaber > files . Copy the \"AvatarData.dat,\" \"PlayerData.dat,\" and \"settings.cfg\" files Paste these files at any location on your computer. To restore Beat Saber, connect your Meta Quest and copy and paste these files to the same location you copied them from."
    },
    {
      "title": "Go to the ModsBeforeFriday website.",
      "content": "Go to the ModsBeforeFriday website. ModsBeforeFriday is one of the easiest, and currently, the only way to mod Beat Saber using a Meta Quest running Android 13 or higher. Go to https://mbf.bsquest.xyz/ using Google Chrome or Microsoft Edge. [2] X Research source This will not work using Firefox or Safari, You will receive an error message saying your web browser is outdated or incompatible. If you have previously used other methods of modding Beat Saber (i.e. BMBF or QAVS) those methods do not work now. The privacy features on the newest version of Android prevent the old mods from accessing the files they need. You have to use ModsBeforeFriday."
    },
    {
      "title": "Connect your Meta Quest headset.",
      "content": "Connect your Meta Quest headset. To do so, connect your Quest to your PC using a USB-C or USB-C-to-A cable. Then click Connect to Quest on the website. Select your Quest model in the pop-up and click Connect ."
    },
    {
      "title": "Click Mod the App.",
      "content": "Click Mod the App . This will automatically mod the game and install some of the core mods, including the song downloader mod. Do not disconnect your Quest until the process is complete. Warning: In order to mod Beat Saber, the website will need to downgrade your current version of Beat Saber to a previous version of Beat Saber. You may experience bugs and glitches that you might not experience in the official version of Beat Saber. You will also lose access to the leaderboards and multiplayer for the official version of Beat Saber."
    },
    {
      "title": "Install additional mods.",
      "content": "Install additional mods. Once the website is finished patching and modding your Beat Saber game, you will see a list of additional mods you can install. Leave your Meta Quest connected to your PC and click Install next to any additional mods you want to install."
    },
    {
      "title": "Launch Beat Saber.",
      "content": "Launch Beat Saber. When you launch Beat Saber on your Meta Quest, you may receive a pop-up warning that you are running an outdated or unofficial version of Beat Saber. Click the option to continue with your current version. DO NOT CLICK 'RESTORE'. This will install the official version of Beat Saber and erase all the mods."
    },
    {
      "title": "Using Mods.",
      "content": "Using Mods. After launching Beat Saber, when you arrive at the main menu, you will see the Mods menu to the left. Select one of the mods and use the menu to tweak the options. Use the \"SONGDOWNLOADER\" mod to search for and download custom maps and songs."
    },
    {
      "title": "Play custom songs and levels.",
      "content": "Play custom songs and levels. To play a custom song or level, select Solo on the main menu and then select the icon that resembles a hand with a music note over it. This displays all your custom song levels. Select a custom song and select a difficulty level. Then select Play . Some custom levels may not have all difficulty levels. Some only have Expert or Hard."
    },
    {
      "title": "Apply custom modifiers.",
      "content": "Apply custom modifiers. To apply custom modifiers, select Solo from the main menu. The menu to the left displays all available modifiers. The Vanilla tab contains modifiers that come with the base game. Select the Mods tab. Select one of the options to apply custom modifiers. Here you can make tweaks to the sabers (whackers) and the blocks (cyoobs)."
    },
    {
      "title": "Play the game at least once.",
      "content": "Play the game at least once. You can use this method to mod Beat Saber on your PC. In order to do so, you will need to have a copy of Beat Saber purchased through Steam or the Oculus Store. After downloading it, launch it at least once."
    },
    {
      "title": "Download and install the BSManager app.",
      "content": "Download and install the BSManager app. The BSManager app is an all-in-one app you can use to download and manage mods, as well as downgrade Beat Saber to the latest modable version. Use the following steps to download BSManager: Go to https://github.com/Zagrios/bs-manager/releases in a web browser. Scroll down and click the \".exe\" file for the latest version. Open the installation file in your Downloads folder. Follow the prompts to complete the installation."
    },
    {
      "title": "Open BSManager.",
      "content": "Open BSManager. Once you install BSManager, you can open it in the Windows Start menu. It has an icon that resembles a blue and red Beat Saber block."
    },
    {
      "title": "Download version 1.28.0.",
      "content": "Download version 1.28.0. The latest version of Beat Saber is not modable. You will need to download a previous version of Beat Saber. To do so, click 2023 at the top. Scroll down and click 1.28.0 . Then click Download at the bottom."
    },
    {
      "title": "Sign in to your platform.",
      "content": "Sign in to your platform. If you purchased Beat Saber through Steam, click Steam and sign in with your username and password, or use the QR code to sign in with Steam app (recommended). If you purchased Beat Saber through the Oculus Store, click Oculus and then enter your Oculus token. Use the following steps to obtain your Oculus token: [3] X Research source Open the Oculus app on your computer. Press Ctrl + Shift + i to open developer tools. Click the Network tab. Enter \"graph\" in the filter search bar in the upper-left corner. Select the first request below \"Name\" on the left. Click the Header tab next to the \"Name\" box. Locate and copy your token next to \"Access token.\" Paste it into the box labeled \"Oculus Token\" in BSManager. Click Validate."
    },
    {
      "title": "Run the game once through BSManager.",
      "content": "Run the game once through BSManager. After you have installed version 1.28.0, click it in the menu bar to the left. Then click Launch to launch the game. This will ensure that it is working."
    },
    {
      "title": "Add songs or maps to Beat Saber.",
      "content": "Add songs or maps to Beat Saber. To do so, select 1.28.0 in the menu bar to the left. Then click the Maps tab at the top. Use the search bar to search for the name of a song or artist. Select the song and click Add ."
    },
    {
      "title": "Add mods to Beat Saber.",
      "content": "Add mods to Beat Saber. To add mods to Beat Saber select 1.28.0 in the menu bar to the left. Then click the Mobs tab. Click the checkmark icon next to the mods you want to install. Then click Install or update in the lower-right corner. To remove a mod, click the trashcan icon next to it. Add the BeatSaverDownloader or BetterSongSearch mod to search and download songs in-game."
    },
    {
      "title": "Manually add a song and maps.",
      "content": "Manually add a song and maps. If you know of a song but it doesn't show up when you search for it in BSManager, you can add it manually. To do so, you will need to do a Google search for it and find the download file on the internet (i.e. from beatsaver.com .) Extract the contents of the zip file and use the following steps to download and install the song manually: Open BSManager . Click 1.28.0 in the menu bar to the left. Click the Mods tab. Click the Gear icon in the upper-right corner. Click Open folder . Open the Beat Saber_Data folder. Open the CustomLevels folder. Copy and paste the extracted folder here."
    },
    {
      "title": "Manually install mods.",
      "content": "Manually install mods. If there is a mod you want to install that doesn't show up in the BSManager list of mods, you can download it and manually install it. Download it from the internet and extract the \".dll\" file. Then use the following steps to install it manually. Open BSManager . Click 1.28.0 in the menu bar to the left. Click the Mods tab. Click the Gear icon in the upper-right corner. Click Open folder . Open the Plugins folder Copy and paste the mod file here."
    },
    {
      "title": "Using Mods.",
      "content": "Using Mods. After launching Beat Saber, when you arrive at the main menu, you will see the Mods menu to the left. Select one of the mods and use the menu to tweak the options."
    },
    {
      "title": "Play custom songs and levels.",
      "content": "Play custom songs and levels. To play a custom song or level, select Solo on the main menu and then select the icon that resembles a hand with a music note over it. This displays all your custom song levels. Select a custom song and select a difficulty level. Then select Play . Some custom levels may not have all difficulty levels. Some only have Expert or Hard."
    },
    {
      "title": "Apply custom modifiers.",
      "content": "Apply custom modifiers. To apply custom modifiers, select Solo from the main menu. The menu to the left displays all available modifiers. The Vanilla tab contains modifiers that come with the base game. Select the Mods tab. Select one of the options to apply custom modifiers. Here you can make tweaks to the whackers and the blocks (or cyoobs)."
    }
  ]
}