{
  "url": "https://www.wikihow.com/Signs-Your-Ex-Never-Loved-You",
  "title": "Signs Your Ex Never Really Loved You",
  "steps": [
    {
      "title": "When someone is in love, they put in the work to make their partner happy.",
      "content": "When someone is in love, they put in the work to make their partner happy. Instead, they may not have planned your dates or remembered your birthday or your anniversary. They never went out of their way to meet your friends, or they may have not been interested in making you feel better when you’re down. They made you feel like you were the only one in the relationship that was putting in any effort at all. [1] X Research source"
    },
    {
      "title": "In a loving relationship, you would be a priority to each other.",
      "content": "In a loving relationship, you would be a priority to each other. They didn’t have to drop everything in their life to help you, but if they didn’t even try to make an effort to put you first, then that could be a red flag. They might book tickets without you or head out to meet with their friends without letting you know. They may not have even asked you how your day was or if you’re okay when you get hurt emotionally or physically. Overall, you were not treated like the priority you were. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source After the breakup, make sure to treat yourself. Go out with friends, see a movie, or buy that new outfit you’ve been eyeing."
    },
    {
      "title": "Planning a future with someone you love can be exciting and important.",
      "content": "Planning a future with someone you love can be exciting and important. If they never included you in their future plans, or if they never talked about building a future with you in it, then it could be a sign that they never imagined you two together for the long run. They may have even made promises to move in together, get married, go on trips – but nothing ever came of them. [3] X Research source Take this breakup as an opportunity to plan out what you want your future to be. Write down your dreams and aspirations, and take this time to turn them into actions."
    },
    {
      "title": "It is incredibly important to build a connection with the person you love.",
      "content": "It is incredibly important to build a connection with the person you love. You may have shared your deepest fears or wildest dreams with them, but they never seemed interested. They might have always made you feel like it was never the time for you to share your interests and emotions. They might have even talked openly about their feelings, interests, and dreams, but never acted excited when it came to yours. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Lean on others for the connection and support that might have been missing in your relationship. Reach out to friends and family, share your feelings with someone you trust, and set aside time to reconnect and do fun activities together."
    },
    {
      "title": "In a lot of relationships, making a commitment can seal the deal.",
      "content": "In a lot of relationships, making a commitment can seal the deal. Your partner might have never thought about moving the relationship into the committed stage and kept things casual even when it was clear that you were committed to them. Your partner might have even said to others that you’re just a friend or flirted with other people – with or without you around. [5] X Research source Take time after the breakup to make a commitment to yourself. Create a routine that works for you and your goals, while scheduling activities that make you feel good."
    },
    {
      "title": "In a loving relationship, you shouldn’t feel ignored.",
      "content": "In a loving relationship, you shouldn’t feel ignored. There are ups and downs to every relationship. However, if they kept shutting you out with no explanation, or seemed to avoid you, it might have made you wonder if you were even in a relationship at all. Even when the two of you hang out, they might seem distant or they might not make time for the two of you to reconnect. [6] X Research source"
    },
    {
      "title": "When you’re in love, you want your partner to be open with you.",
      "content": "When you’re in love, you want your partner to be open with you. Practicing vulnerability and emotional intimacy is a fundamental part of maintaining healthy relationships. [7] X Research source Whether your ex never seemed to let you in on what they’re thinking or never let the conversation get deeper than asking how your day was, they didn’t really open up. They may have even kept the relationship purely physical and avoided making an emotional connection with you at all."
    },
    {
      "title": "In a committed relationship, your partner would consider how you’d feel.",
      "content": "In a committed relationship, your partner would consider how you’d feel. They might have done things without asking, didn’t bother wondering what you thought, or made decisions for the two of you without you there. Your ex’s feelings and problems may have always seemed more important to them than yours. They might have even tried to one-up your worries with their own: when you’re feeling sad, they always tried to seem more miserable. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Journaling can be a helpful way to clarify and process difficult emotions. In a safe place, write down what your experiences were, how they made you feel, and how intense your emotions were – let it all out."
    },
    {
      "title": "Love is built on mutual respect.",
      "content": "Love is built on mutual respect. They might make plans and not show up, talk to you in a disrespectful way, or cause you to not feel seen or valued. They may have constantly trampled over you on simple decisions like what movie the two of you want to go see, or on something as life-changing as wanting to get married . No matter what you did, you never seemed to feel heard or appreciated."
    },
    {
      "title": "Life partners are supposed to support each other.",
      "content": "Life partners are supposed to support each other. When your partner gives encouragement, you want them to validate your feelings and offer positive support. Your partner may have never celebrated your victories or helped carry your emotional baggage. There might have been times when you had to suffer alone, and your partner was nowhere to be found to help you through them. They might have even criticized you, made fun of your insecurities, belittled you, or made you feel worthless. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you still feel doubt or other negative feelings of self-worth, try looking back on times in your life when you felt most confident. Focusing on the high points in your life can help you slowly recover your hope and confidence. Make sure to look after yourself after the breakup to boost your self-esteem. Practice self-care by sleeping well, going out with friends, and exercising when you can."
    },
    {
      "title": "In a loving relationship, your partner wouldn’t distance themselves.",
      "content": "In a loving relationship, your partner wouldn’t distance themselves. They might be normal one moment, then distant the next. Mixed signals can be normal or even exciting when you’re first getting to know someone, but if you’re in a committed relationship and they’re still running hot and cold, it could be a red flag. One minute they’re just fine, the other they’re cold and unresponsive. They might even be warm and romantic while you’re together, but when you’re apart it’s like you’re in two different worlds. [10] X Research source After a breakup, it can be easy to focus on the negatives. Try starting a gratitude journal to help you feel more positive about life. Write down 3 to 5 things you’re grateful for each day, no matter how big or small."
    },
    {
      "title": "Sex increases intimacy and connection between two people in love.",
      "content": "Sex increases intimacy and connection between two people in love. Instead, you do the deed, but there’s no passion, respect, or tenderness. There might be no post-sex cuddles, kisses, or pillow talk. Instead, they might have gone straight to sleep or walked off and did other things. Sex can help create a close-knit bond between you and your partner. However, if that’s all your relationship is built on, there’s no room for intimacy or love. [11] X Research source Reader Poll: We asked 2178 wikiHow readers, and 76% of them agreed that the biggest sign a romantic partner isn't attracted to you is if they’re not interested in physical intimacy or sex . [Take Poll]"
    },
    {
      "title": "Introducing you to their friends and family is important when you’re in love.",
      "content": "Introducing you to their friends and family is important when you’re in love. Instead, your friends and family were kept out of the relationship. When you’re trying to develop your relationship further, a normal step in dating someone is having them meet your family or your close friends. Your ex may have always avoided making plans or come up with excuses at the last minute. They might have even kept your relationship completely out of the public eye. [12] X Research source"
    },
    {
      "title": "Your partner should treat you like their other half, not their parent.",
      "content": "Your partner should treat you like their other half, not their parent. Whether you’re always doing their dishes, cleaning their room, making their dinner, or telling them where you want to go, you may have felt like you were their parent rather than their partner. In a relationship, everything should be 50-50 – if they made you feel like you had to do all the work, they never valued you as they should have. [13] X Research source"
    },
    {
      "title": "Your partner wouldn’t repeatedly violate your personal boundaries if they loved you.",
      "content": "Your partner wouldn’t repeatedly violate your personal boundaries if they loved you. Whether they ask you to compromise your values, expect you to overshare your personal information, or invade your privacy without asking, your ex never seemed to respect your personal boundaries. [14] X Research source Reflect on your relationship, but don’t dwell on it. Make a list of things that did and didn’t work when you tried to set boundaries with your partner. Then, think about how you can use what you know now to grow."
    },
    {
      "title": "When you’re in love, you don’t put your needs above your partner’s.",
      "content": "When you’re in love, you don’t put your needs above your partner’s. Your ex might not have ever been willing to compromise, no matter if you’re having a major argument or if you’re just picking out a place to eat for dinner. Their needs, opinions, and desires always seemed to come before yours. [15] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source After the breakup, make yourself a priority. Set aside time to pick up activities, hobbies, and interests that you might have put off during your relationship."
    },
    {
      "title": "If they loved you, they wouldn’t have cheated on you with other people.",
      "content": "If they loved you, they wouldn’t have cheated on you with other people. Trust is incredibly important in a relationship, but it’s also very fragile. If your partner cheats on you, especially multiple times, then that trust is broken. Your significant other should want to avoid hurting you – if they went out of their way to go behind your back, especially multiple times, it could be a sign that they never loved you to begin with. [16] X Research source It can be tempting to stalk your ex’s accounts, trying to figure out why they chose another person over you. But in the end, you’re really only hurting yourself. Instead, consider unfollowing or blocking them and redirect your attention to building the future you want."
    },
    {
      "title": "When someone is in love, they wouldn’t manipulate their partner.",
      "content": "When someone is in love, they wouldn’t manipulate their partner. This doesn’t mean your partner isn’t allowed to make little white lies, but if they lied constantly, especially about the bigger things, then this can be a huge red flag. They might have lied about what they do for a living, what they did that weekend, and who their friends are. When you confronted them about it, they might have taken the whole situation personally and might have even blamed you for their actions. If your partner made you feel crazy and unlovable, it wasn’t love – it was manipulation. [17] X Research source If your partner was manipulative, they may try to convince you to get back together with them. Avoid contact with them, give yourself time to heal, and don’t feel tempted to change your mind. Remind yourself that before the relationship, you did just fine on your own. You did nothing wrong, and life will get easier with time."
    },
    {
      "title": "In a healthy, loving relationship, your partner wouldn’t hurt you.",
      "content": "In a healthy, loving relationship, your partner wouldn’t hurt you. Relationship abuse is a pattern of coercive or harmful behaviors used by one partner to maintain power over the other. The abuse might have been physical, verbal, emotional, sexual, financial, or digital. [18] X Research source If your partner abused you, you might have felt confused, angry, or trapped in the relationship. Abuse is never okay, and if you think you experienced it, remember that it’s not your fault that it happened to you. If you were abused during your relationship, build a network of support to help you heal and learn to love yourself again. Consider seeing a mental health professional, joining a support group, and reconnecting with your friends and family. If you need immediate assistance, call the National Domestic Violence Hotline at 800-799-7233 or text START to 88788."
    },
    {
      "title": "When you’re in love with your partner, you want to make up for the hurt you’ve caused.",
      "content": "When you’re in love with your partner, you want to make up for the hurt you’ve caused. Your ex might have never said sorry for the hurtful things they said or did. Even when they know they hurt you, they might avoid apologizing for their actions or talking about the incident at all. They might seem remorseful at the moment but later hurt you again in the same exact way. [19] X Research source"
    },
    {
      "title": "Saying “I love you” is incredibly important for a loving relationship.",
      "content": "Saying “I love you” is incredibly important for a loving relationship. They didn’t have to say “I love you” constantly, but asking you to let them know when you get home safe, writing you little notes, getting you surprise gifts, or checking in on you throughout the day are small actions that show their love for you. If you ever wondered during the relationship if your partner loved you, that’s probably a sign that they didn’t. [20] X Research source Focusing on building self-love can be incredibly healing after a breakup. Learn to love yourself by letting go of any self-hatred and practicing daily affirmations to reinforce positive thinking."
    },
    {
      "title": "Your partner might have had a harder time moving on if they were in love with you.",
      "content": "Your partner might have had a harder time moving on if they were in love with you. If your ex is in a relationship right after the breakup, it might have seemed like there was no grieving period. It can be easy to hate your ex for their actions. However, the best way to move forward is to see the other with compassion, and take ownership of your part in the relationship without blaming yourself entirely. Take this period to remember who you are and what you want in life. Not only will this help you get over the relationship, but it will also help you rekindle your relationship with yourself. There will always be more fish in the sea, but there’s only one of you."
    }
  ]
}