{
  "url": "https://www.wikihow.com/Skip-Class",
  "title": "How to Skip Class: The Best Excuses for Any Grade",
  "steps": [
    {
      "title": "Call yourself out for the entire day or a certain period.",
      "content": "Call yourself out for the entire day or a certain period. If you only want to skip a few periods, say that you have a dentist or doctor's appointment, or that you need to miss school for a family commitment. Usually, you won't want to try to fake a parent's voice — the office isn't stupid — so it's usually best to come up with someone else to cover for you, then share. Older siblings and cousins or grandparents might be up for calling you out of school, likewise friendly neighbors or a sibling of one of your friends. Make sure they keep the conversation brief and non-specific."
    },
    {
      "title": "Make or fake an appointment.",
      "content": "Make or fake an appointment. It's best if you can actually have a real appointment or reason to miss school. You might consider telling your parent the orthodontist scheduled you an appointment when you really haven't got one, or that they need to call you out for an appointment with your coach to go over plays for the weekend's game. A call from your parents will seem more real, even if the appointment isn't."
    },
    {
      "title": "Be as general as possible.",
      "content": "Be as general as possible. When you're making a fake appointment, it's best if you can keep it as vague and non-specific as you can to avoid causing suspicion. If you get your brother to call you in and say, \"He's got a doctor's appointment this morning and he's not going to be able to make it in today,\" the office will be unlikely to question it."
    },
    {
      "title": "Get your acting face on.",
      "content": "Get your acting face on. If you're acting fine and chatting with your friends in the back of the classroom one minute, then trying to tell your teacher you're about to puke the next minute, no one's going to believe you. To pull off the illness ruse, you've got to lay the groundwork: [1] X Research source Stay quiet during the day, with a concerned look on your face. Cradle your head in your hands and sigh deeply. Squint your eyes. Don't rush it. It's best if someone else brings up the subject of you not feeling good. If you lay it on thick enough, keeping your head down and looking ill, your teacher may say, \"Is everything okay?\" at which point you'll be able to play it off, and say, \"I don't know, I just don't feel right. I think I'm okay.\" It's better to downplay it."
    },
    {
      "title": "Ask to visit the nurse and get a hall pass.",
      "content": "Ask to visit the nurse and get a hall pass. After a long enough time has passed during which you can establish that you don't feel good, go up to your teacher: \"Actually, I really don't feel well. I've got a bad headache and stomachache. Could I visit the nurse?\" Get a hall pass and you're free of the classroom, your first obstacle. For another option, get up in a rush and ask to go to the bathroom. Leave hurriedly, as if something were very wrong, then take your time and head to the restroom slowly. Kill some time in the bathroom, wash your hands, and head back to the classroom after a long enough period of time to vomit has passed. Tell your teacher quietly you just threw up and you'd like to visit the nurse."
    },
    {
      "title": "Describe your \"symptoms\" to the nurse.",
      "content": "Describe your \"symptoms\" to the nurse. You've got lots of options available to you, depending on whether or not you want to be sent home, kill the rest of the class period in the nurse's office laying on a cot, or if you just want to cut out after you get your hall pass: [2] X Research source If you want to be sent home no questions asked, say you vomited. No one's going to make a kid stick around school who just puked in the bathroom, risking getting everyone else sick. The nurse will call your parents and ask if you can be picked up, or let you leave if you drive to school. If you want to kill the rest of the hour go with a headache. If you just can't stand the thought of another boring lecture on nothing, why not nap it off in the nurse's office? When the period's over, the nurse will probably check on you, at which point you can tell them you feel better and you want to go back to class, or you can say you want to be sent home. If you want to cut the rest of the day without calling home then just leave instead of heading to the nurse's office. Sign out and head wherever you wish."
    },
    {
      "title": "Know your school's attendance policy.",
      "content": "Know your school's attendance policy. Each school sets its own rules on absences. Find out how many absences you have already, and what the consequences are for the next one. Even if you plan to sneak out without getting marked absence, there's always a chance you get caught. Figure out whether your worst-case scenario is a minor mark on your record, or a serious consequence like suspension."
    },
    {
      "title": "Choose which class to skip.",
      "content": "Choose which class to skip. If you can, choose a teacher that doesn't take a role every day. In general, you're more likely to get away with skipping a class if the teacher is relaxed and if you haven't been absent from it more than once or twice before."
    },
    {
      "title": "Use an excuse when possible.",
      "content": "Use an excuse when possible. This is a limited resource; each teacher will only believe your excuses once or twice. But when it works, you have a consequence-free pass from the rest of the class. Here are some ideas you can use: Look antsy and say you have \"bathroom problems.\" If you're female, say you are having a bad period or \"female problems.\" Look upset and ask if you can talk to the school counselor. Deliberately leave a bag or other item in another room. Say you've lost it or left it in your gym locker, and claim there's something important inside (keys, wallet, etc. — but don't actually abandon these)."
    },
    {
      "title": "Don't look like a truant student.",
      "content": "Don't look like a truant student. Leave your backpack in your locker so you look like someone walking to the bathroom, not someone trying to sneak out. If you are reasonably tall and go to a large school, you can try dressing in smart clothes and pretending to be an adult. This may save you from a staff member's passing glance, but don't expect it to save you if someone stops you."
    },
    {
      "title": "Leave your previous class a few minutes early.",
      "content": "Leave your previous class a few minutes early. Tell your teacher you need to use the bathroom five or ten minutes before class ends. Even if the teacher doesn't let you leave, you have an excuse to rush out the door as soon as the bell rings. Your goal is to get as far as possible before passing period is over, while the halls are still full of people."
    },
    {
      "title": "Fake a hall pass.",
      "content": "Fake a hall pass. Forging a hall pass could get you in serious trouble, depending on your school's policy. Holding an old hall pass or scribbled-on piece of paper the same color and size can be almost as good, depending on how strict the staff members are about checking."
    },
    {
      "title": "Slip out or find a hiding spot.",
      "content": "Slip out or find a hiding spot. If staff members watch the exits during passing period, slip into a nearby bathroom or empty room and wait for the next class to start. Sneak out as soon as the exit is clear. If your school has very tight security, or if there's nowhere to hang out near your school, you could spend the whole class in a bathroom stall. You'd better have the best game ever on your phone for this to be worth it."
    },
    {
      "title": "Avoid obvious hang-outs.",
      "content": "Avoid obvious hang-outs. In some places, truancy is a crime. Getting caught could mean serious punishment, so you've got to be relatively sneaky if you want to hang out with friends. Don't head straight to the pizza place all the kids go to after school, the mall, or the park across the street from school. Get away from the school, stay in quiet neighborhoods, and definitely stay away from places where your parents or their friends might see you. Walk directly away from the school when you leave the school grounds. Don't pass by any windows or chain link fences where a teacher can see you on the other side."
    },
    {
      "title": "Prepare to face your parents.",
      "content": "Prepare to face your parents. Many schools phone your parents if you're marked absent from a class. It's up to you whether to own up and face the music, or whether to lie your way out of it. You know how your parents will react better than anyone, so use your judgement. Use your knowledge of school policy to your advantage. If the school marks you absent after five minutes, claim you were just late coming from the bathroom or from the previous class. If one parent is much less strict than the other, bring up the subject when only the lenient parent is around."
    }
  ]
}