{
  "url": "https://www.wikihow.com/Remove-an-Ink-Stain-from-a-Couch",
  "title": "Easy Ways to Get Pen Ink out from a Fabric Couch",
  "steps": [
    {
      "title": "Blot the stain right away.",
      "content": "Blot the stain right away. It is important to deal with the ink stain immediately. Blot the spot with a clean cloth or paper towels and apply a little pressure on it. Just blot and don't rub, since rubbing might spread the stain. [1] X Research source Work from the outside going towards the center and try to absorb as much ink as you can. Change the cloth or paper towels when needed. If the ink is already dry, it's still worth a try to remove it."
    },
    {
      "title": "Test the alcohol in an inconspicuous spot.",
      "content": "Test the alcohol in an inconspicuous spot. You can use rubbing alcohol to remove ink from leather, cloth , or vinyl, but no matter what material your couch is made from, it's a good idea to test it first just in case it alters the color or causes damage. [2] X Research source 90 percent isopropyl alcohol is best, but you can also use 70 percent if that's the only one you have. [3] X Research source Wait a minute, then check the spot. If it didn't change colors or warp, you're good to go."
    },
    {
      "title": "Apply rubbing alcohol to a clean white cloth.",
      "content": "Apply rubbing alcohol to a clean white cloth. Do not pour alcohol directly on the stain, since getting your couch all wet could cause it to look misshapen."
    },
    {
      "title": "Dab the ink stain with the cloth carefully.",
      "content": "Dab the ink stain with the cloth carefully. Do not rub or wipe it, since rubbing will cause the stain to spread. Repeat the process until the cloth is not absorbing any more of the ink. Make sure to change the cloth when it is saturated with ink, rather than dabbing more ink onto the couch. Use fresh alcohol if you're working so long that the alcohol evaporates."
    },
    {
      "title": "Clean and rinse the area thoroughly.",
      "content": "Clean and rinse the area thoroughly. Use a cloth dipped in water to wipe the area and clean off the alcohol."
    },
    {
      "title": "Dry the area with a towel.",
      "content": "Dry the area with a towel. Take a step back and look at your handiwork. If the stain remains, repeat the process or try a different method for removing it."
    },
    {
      "title": "Follow up with a leather cleaner (for leather only).",
      "content": "Follow up with a leather cleaner (for leather only). This will help prevent future stains and seal some added moisture into the leather to prevent it from cracking over time."
    },
    {
      "title": "Blot the stain right away.",
      "content": "Blot the stain right away. It is important to deal with the ink stain immediately. Blot the spot with a clean cloth or paper towels and apply a little pressure on it. Just blot and don't rub, since rubbing might spread the stain. Work from the outside going towards the center and try to absorb as much ink as you can. Change the cloth or paper towels when needed. If the ink is already dry, it's still worth a try to remove it."
    },
    {
      "title": "Test the vinegar in an inconspicuous spot.",
      "content": "Test the vinegar in an inconspicuous spot. Vinegar works wonders on ink stains. [4] X Trustworthy Source The Smithsonian Institution Leading group of museums and research institution funded by the U.S. government Go to source Its acetic properties allow it to remove stains effectively. [5] X Research source Plus, it's safe to use, gentle on hands and environment friendly. Vinegar can be used on any type of couch, but it's a good idea to test it in a hidden spot just in case it causes damage."
    },
    {
      "title": "Make a vinegar solution.",
      "content": "Make a vinegar solution. Combine 1 tablespoon of liquid dishwashing detergent, 1 tablespoon of white vinegar, and 2 cups of cool water in a small bowl."
    },
    {
      "title": "Dab the solution on the stained area using a soft cloth.",
      "content": "Dab the solution on the stained area using a soft cloth. Rubbing too hard will cause the stain to spread. Let it sit for about 30 minutes. Blot the stain every 5 minutes during this 30 minutes, using a clean white cloth and more of the vinegar solution."
    },
    {
      "title": "Clean the spot.",
      "content": "Clean the spot. Use a soft cloth damped with cold water. Wipe the affected area thoroughly until the solution is completely gone."
    },
    {
      "title": "Use a dry towel to absorb the moisture.",
      "content": "Use a dry towel to absorb the moisture. If the spot remains, repeat the process or try a different method for removing it."
    },
    {
      "title": "Follow up with a leather cleaner (for leather only).",
      "content": "Follow up with a leather cleaner (for leather only). This will help prevent future stains and seal some added moisture into the leather to prevent it from cracking over time."
    },
    {
      "title": "Blot the stain right away.",
      "content": "Blot the stain right away. It is important to deal with the ink stain immediately. Blot the spot with a clean cloth or paper towels and apply a little pressure on it. Just blot and don't rub, since rubbing might spread the stain. Work from the outside going towards the center and try to absorb as much ink as you can. Change the cloth or paper towels when needed. If the ink is already dry, it's still worth a try to remove it."
    },
    {
      "title": "Mix up soapy water.",
      "content": "Mix up soapy water. If the stain is still fresh, warm soapy water can do the trick. Mix 1/2 teaspoon of liquid dish washing soap with a small amount of hot water in a small bowl to make a solution."
    },
    {
      "title": "Stir the solution until lots of soap suds are formed.",
      "content": "Stir the solution until lots of soap suds are formed. You could also put it in a bottle and shake it up."
    },
    {
      "title": "Dip a soft cloth on the soap suds.",
      "content": "Dip a soft cloth on the soap suds."
    },
    {
      "title": "Gently wipe the ink stain with the soapy cloth.",
      "content": "Gently wipe the ink stain with the soapy cloth. Repeat the applying and wiping process when necessary."
    },
    {
      "title": "Use a clean damp cloth to rinse off the solution.",
      "content": "Use a clean damp cloth to rinse off the solution. Make sure to rinse the area thoroughly."
    },
    {
      "title": "Dry the area with a towel.",
      "content": "Dry the area with a towel. If the stain remains, repeat the process or try another method."
    },
    {
      "title": "Follow up with a leather conditioner (for leather only).",
      "content": "Follow up with a leather conditioner (for leather only). This will help prevent future stains and seal some added moisture into the leather to prevent it from cracking over time."
    }
  ]
}