{
  "url": "https://www.wikihow.com/Select-and-Store-Pomegranates",
  "title": "How to Select and Store Pomegranates",
  "steps": [
    {
      "title": "Select a heavy pomegranate.",
      "content": "Select a heavy pomegranate. While at the grocery store or farmers market, choose the heaviest pomegranates to purchase. [3] X Research source The weight of the pomegranate signifies how juicy it is. Lighter pomegranates do not contain as much juice as heavier ones. Although you could weigh each pomegranate on a produce scale, you don't necessarily need to do so. Just grab one in each hand and continue comparing until you have found the heaviest ones."
    },
    {
      "title": "Choose a pomegranate with a deep colored rind.",
      "content": "Choose a pomegranate with a deep colored rind. The rinds vary in shades of red, from bright to more brownish [4] X Research source or even pink. [5] X Research source The rind should also be glossy. [6] X Research source While the shade of the rind doesn't signify anything about ripeness or flavor, the deeper the color, the better. [7] X Research source"
    },
    {
      "title": "Examine the shape.",
      "content": "Examine the shape. Unripe pomegranates are round, like apples. However, their shape changes slightly as the fruit ripens and the juice-filled seeds begin to expand outward and press against the insides of the pomegranates. A ripe pomegranate will have more of a square shape because the sides will be flattened (instead of rounded). [8] X Research source"
    },
    {
      "title": "Test the fruit for any soft areas.",
      "content": "Test the fruit for any soft areas. To be sure your pomegranates aren't bruised, hold each pomegranate and gently squeeze it. The pomegranates should be hard, with no mushy spots."
    },
    {
      "title": "Select pomegranates with smooth, unbroken surfaces.",
      "content": "Select pomegranates with smooth, unbroken surfaces. The rind should be soft enough to scratch. If so, you know you have a ripe pomegranate. Unripe pomegranates have very hard rinds that cannot be scratched. [9] X Research source However, in very ripe pomegranates, the rind will be splitting open because the seeds are filled with juice and are expanding, which puts pressure on the outside of the pomegranate, causing the rind to split. You're more likely to find pomegranates like this at the end of Autumn, when they are ripest, and at your local farmers market (rather than the supermarket). [10] X Research source"
    },
    {
      "title": "Dress appropriately.",
      "content": "Dress appropriately. Before de-seeding your pomegranate, you may want to grab an apron or change into an old shirt that you don't mind getting stained. The juice from pomegranates will stain your clothes, so you might not want to wear your favorite outfit while removing the seeds!"
    },
    {
      "title": "Cut your pomegranate into quarters.",
      "content": "Cut your pomegranate into quarters. [11] X Research source The rind of pomegranates are hard, and you can't really peel a pomegranate because the seeds are nested into and attached to the internal membrane. To get to the edible part of the pomegranate, you'll need to cut into and through the rind. Cutting the pomegranate into quarters rather than halves will give you better access to the seeds."
    },
    {
      "title": "Fill a bowl with water.",
      "content": "Fill a bowl with water. Select a bowl in which you can submerge your pomegranate quarters. A medium size mixing bowl should be deep enough. Leave enough space in the bowl to place your hands into it without causing the water to overflow."
    },
    {
      "title": "Place your quartered pomegranate in the water-filled bowl.",
      "content": "Place your quartered pomegranate in the water-filled bowl. Removing the seeds of the pomegranate in water is the easiest way to de-seed your fruit because the seeds are heavier than the membrane that surrounds the seeds. Thus, the seeds will sink to the bottom of the bowl, and the membrane will rise to the surface. [12] X Research source Alternately, you can remove the seeds over the bowl and let the flesh and seeds drop into the bowl (rather than submerging the pomegranate in the water). [13] X Research source This way, you can immediately dispose of the rind when you have removed all the seeds. Removing the seeds underwater, however, lessens the risk that you may drop part of the pomegranate onto your counter top and stain it. [14] X Research source"
    },
    {
      "title": "Separate the seeds from the flesh.",
      "content": "Separate the seeds from the flesh. While submerged in the water, hold the pomegranate quarter with one hand, and run the thumb of your other hand around the clumps of seeds. Once you have removed all the seeds, you can skim off the membrane from the top of the water with your hands or a small strainer. Remove the seeds from the bottom of the bowl in the same manner. [15] X Research source Enjoy eating the plump seeds or prepare for storage!"
    },
    {
      "title": "Refrigerate.",
      "content": "Refrigerate. Refrigerating your pomegranate rather than leaving it on your counter or in your fruit basket will help keep it fresher longer. [16] X Research source You can expect your pomegranate to last for about two months if you keep it refrigerated. [17] X Trustworthy Source Produce for Better Health Foundation Nonprofit organization focused on promoting plant-based diet information to help consumers live healthier lives. Go to source"
    },
    {
      "title": "Store your pomegranate in a dry, cool place.",
      "content": "Store your pomegranate in a dry, cool place. It will last for about a month this way [18] X Trustworthy Source Produce for Better Health Foundation Nonprofit organization focused on promoting plant-based diet information to help consumers live healthier lives. Go to source and for a week at room temperature."
    },
    {
      "title": "Refrigerate the seeds.",
      "content": "Refrigerate the seeds. After removing the seeds from your pomegranate , you can store them in the refrigerator for five days. Be sure, however, to seal them tightly in a container or plastic bag before storing them."
    },
    {
      "title": "Freeze",
      "content": "Freeze the seeds. [19] X Research source If you don't plan on eating your seeds within a few days, you can prolong the freshness by storing them in the freezer. Be sure the seeds are completely dry before freezing them. [20] X Research source Otherwise, they will clump together. You can also flash freeze the seeds before freezing them in a storage bag. After drying any remaining water off the seeds, place them in a single layer on a wax-paper lined baking sheet. Freeze them on the baking sheet for two hours before storing them in a freezer bag. [21] X Research source Pomegranate seeds can be stored in the freezer for about a year and are best if used within a year [22] X Research source ."
    }
  ]
}