{
  "url": "https://www.wikihow.com/Record-a-Phone-Conversation",
  "title": "6 Ways to Record a Phone Conversation: with Pictures",
  "steps": [
    {
      "title": "Be sure you're staying legal.",
      "content": "Be sure you're staying legal. The United States federal government places no restrictions on private citizens recording their phone conversations, but many states require consent from all involved parties. Without such consent, your records will be legally useless in those states, and could even get you in trouble. Some states require consent from all parties before you can record a conversation: California, Connecticut, Delaware, Florida, Illinois, Maryland, Massachusetts, Michigan, Montana, New Hampshire, Oregon, Pennsylvania, and Washington. However, many of these states have their own language and ways to define phone conversations and recording, so check out your local laws to make sure you're not doing anything wrong before continuing. [1] X Research source If you're planning to tap a phone line instead, there are federal laws you must abide by in addition to state laws. Tapping a phone is the act of recording a conversation without the knowledge of either party. It is generally illegal except in certain law enforcement situations. [2] X Research source"
    },
    {
      "title": "Be aware of potential complications.",
      "content": "Be aware of potential complications. Recording your phone calls can be very useful, but it can also have unexpected consequences. Arm yourself with knowledge and play it safe. You may get into a state jurisdiction snafu if you record a conversation without two-party consent, and it turns out that the other conversant lived in a state where two-party consent is mandatory. Even though you aren't breaking the law in this case, your phone records might be thrown out of evidence. Your friends and family may be upset with you if you begin to record all your calls, and they find out. It's better to speak to those close to you before you start and respect whatever boundaries they set with you."
    },
    {
      "title": "Open the Phone app and make or answer a call.",
      "content": "Open the Phone app and make or answer a call. The phone app is a green app icon near the bottom of your screen on Android and iPhone. Note that there are a few provisions on this method: The recording feature isn't available in all countries or regions. Your phone will alert everyone on the call when the call is being recorded and when recording ends."
    },
    {
      "title": "Tap Record (Android) or the record icon (iPhone).",
      "content": "Tap Record (Android) or the record icon (iPhone). On iPhone, this icon looks like a set of sound waves with a record icon. [3] X Research source On Android, you can't begin recording a call: Until it's answered If you're on hold When you create a conference call"
    },
    {
      "title": "Stop recording by hanging up or pressing the record icon.",
      "content": "Stop recording by hanging up or pressing the record icon. You can find the call recording in Notes on iPhone or in the Recents tab of your Phone app on Android. [4] X Research source"
    },
    {
      "title": "Get an induction coil microphone.",
      "content": "Get an induction coil microphone . These microphones are available at electronic and phone stores and typically come mounted in suction cups to allow easy attachment to the handset. [5] X Trustworthy Source Reporters Committee for Freedom of the Press Nonprofit legal organization dedicated to protecting First Amendment rights to American citizens Go to source"
    },
    {
      "title": "Attach a recording device.",
      "content": "Attach a recording device. Plug the microphone's audio output jack into a computer, tape recorder, or other such device. A tape recorder or digital portable recorder has the advantage of being relatively small and portable, but a computer has advantages when it comes to cataloging and organizing your conversations. A good basic audio editing program for your computer is Audacity. Audacity is free, simple, and useful for things like clipping dead space off the ends of conversations. It can also export the conversation files in a variety of formats for easy storage. Audacity can be downloaded here ."
    },
    {
      "title": "Place the microphone.",
      "content": "Place the microphone. Secure the microphone to the handset near the mouthpiece (the end you speak into). Test the microphone by speaking into the mouthpiece and playing back the audio record on your input device. If you're worried the microphone's suction cup won't hold, secure the microphone with tape to ensure that your recording won't be interrupted."
    },
    {
      "title": "Record your conversation.",
      "content": "Record your conversation. Turn on the induction coil microphone when you pick up the handset. Turn it off and stop recording when you're finished."
    },
    {
      "title": "Capture your conversation with an inline recording device.",
      "content": "Capture your conversation with an inline recording device . Inline devices attach to your phone's cable and record your calls without requiring placement on the actual phone."
    },
    {
      "title": "Hook up the device.",
      "content": "Hook up the device. Plug your telephone line into the appropriate jack on your inline recorder, then plug the recorder's outgoing phone line into your wall jack as though it were a normal phone line. Find the recorder's audio output cable, and plug it into your audio recording device of choice. Some inline recorders come with a recording device integrated into the unit. If you'd prefer to save a step, buy one of these models. More basic models let you decide what type of audio recorder to use, which may make them more useful for some people."
    },
    {
      "title": "Activate the inline device.",
      "content": "Activate the inline device. Do it just as the conversation begins, and don't forget to start recording if using a separate audio recorder. Some devices come with a “remote input” feature. These devices will begin to record automatically when there's a call, saving you the trouble. [6] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source"
    },
    {
      "title": "Use an in-ear microphone.",
      "content": "Use an in-ear microphone . These microphones are available at electronics and phone stores. Their great advantage over other physical methods is their small size and low profile."
    },
    {
      "title": "Wear the microphone.",
      "content": "Wear the microphone. Install it into your receiving ear so that it will pick up the sounds from the speaker when you answer your phone."
    },
    {
      "title": "Plug in the microphone.",
      "content": "Plug in the microphone. Plug the audio jack of the microphone into a portable recording device. Pocket-sized digital and optical media recorders are widely available for purchase at electronics stores and online."
    },
    {
      "title": "Record your call.",
      "content": "Record your call. Switch your portable device's recording on as soon as you get a call. The microphone is always on and will send the sounds it picks up to your recording device."
    },
    {
      "title": "Use an app to record your conversations.",
      "content": "Use an app to record your conversations. If you are using a smartphone, some programs let you record effortlessly whenever you have a phone conversation. Although not everyone with a cell phone is using a smartphone, this is by far the easiest option for those who can do it. Browse the app store for your phone's operating system. Search for call recorders. Most of them are free or very cheap. Some popular choices include Cube Call Recorder, TapeACall, and Google Voice; however, not all apps will work in every area due to legal reasons. Double-check what you're getting. Read over the developer's description for the app to be sure it's what you want. Most call recorders only work with certain phones or brands; some only work with the speakerphone on. Find one that suits you."
    },
    {
      "title": "Tap the “Install” or “Purchase” button to download and install the app.",
      "content": "Tap the “Install” or “Purchase” button to download and install the app. Make sure the app is working properly by doing a test phone-call with a friend."
    },
    {
      "title": "Follow the app's instructions to record your calls.",
      "content": "Follow the app's instructions to record your calls. If the app seems to work, but your recording quality is low, snoop around on the Internet for solutions. There are often workarounds for such things."
    },
    {
      "title": "Use cloud-based web applications like Aircall or Kixie PowerCall.",
      "content": "Use cloud-based web applications like Aircall or Kixie PowerCall. Several cloud-based web portals facilitate the recording of phone conversations without the additional hassle of installing any software or purchasing hardware. Most of these services utilize the 'Cloud-Bridge' technology. The service calls both the source and destination numbers, bridges them, and records the call. The service is tightly integrated into a telephony infrastructure that resides in the cloud. This allows providers to store recordings in the cloud and make them available to subscribers through personal portals. Other call recording services include Broadsoft and TalkDesk. They can be used with any type of phone (fixed line or cellphone). All your call recordings are made available by the providers in your personal dashboard, and you can download them as well. All such web applications follow a subscription-based model. First, you need to create your personal profile on their website and purchase calling minutes according to their pricing plans. An average call + recording pricing varies from 10-25 cents per minute, depending on which plan you choose. They do not inform your caller that the call is being recorded. You need to take care of the legal angle. So if your location requires two-party consent, the onus is on you to inform your caller that the call is being recorded."
    }
  ]
}