{
  "url": "https://www.wikihow.com/Select-a-Watermelon",
  "title": "How to Select a Watermelon",
  "steps": [
    {
      "title": "Look for uniform shape.",
      "content": "Look for uniform shape. Look for a firm, symmetrical watermelon free from bruises, cuts or dents. If the watermelon has any lumps or bumps, this may mean that it received irregular amounts of sunshine or water during growing, causing dryness or inconsistency."
    },
    {
      "title": "Lift it up.The watermelon should be heavy for its size, as this indicates that it is full of water and therefore nice and ripe.",
      "content": "Lift it up.The watermelon should be heavy for its size, as this indicates that it is full of water and therefore nice and ripe. Try comparing the weight of your watermelon with another of equal size - the heavier one will be the riper. This advice goes for most fruits and vegetables."
    },
    {
      "title": "Look for the field spot.",
      "content": "Look for the field spot. The underside of the watermelon should have a creamy yellow spot, known as the field spot. This is where the melon sat on the ground and ripened in the sun, so the darker it is the better! This one is no wives' tale. If the field spot is white, or even nonexistent, this probably means that the watermelon was picked too soon, and will not be ripe. [1] X Research source"
    },
    {
      "title": "Inspect the color.",
      "content": "Inspect the color. A perfect, ripe watermelon should be dark green in color and dull in appearance, rather than shiny. A shiny watermelon will usually be under ripe."
    },
    {
      "title": "Try the tapping technique.",
      "content": "Try the tapping technique. The tapping technique can be a little hard to master, but many watermelon fans swear by it. Give the watermelon a firm grip with your knuckles and listen to the sound it makes. For a ripe melon, you want a full sound, more tenor than base. You do not want a dull or deep sound, as this means the watermelon is unripe. [2] X Research source"
    },
    {
      "title": "Know what to look for when selecting pre-cut melon.",
      "content": "Know what to look for when selecting pre-cut melon. If you're purchasing pre-cut watermelon, there are also certain things to look out for. Choose pieces with bright red flesh and dark brown or black seeds. Avoid pieces with white streaks and an abundance of white seeds. You should also steer clear if the flesh looks dried out or mealy, or is separating from the seeds. [3] X Research source"
    },
    {
      "title": "Store the watermelon correctly",
      "content": "Store the watermelon correctly . A whole, uncut watermelon can be stored in the refrigerator for up to a week, before it needs to be used. Remember to handle the watermelon carefully to avoid bruising. Never store a watermelon below 40 °F (4 °C), as this causes chilling injury to the fruit. If you wish to ripen your watermelon after purchase, keep it at room temperature for a couple of days. This will ripen the watermelon slightly, but not a huge amount - this is due to the fact that when a watermelon is picked too soon it will never fully ripen."
    },
    {
      "title": "Cut the watermelon.",
      "content": "Cut the watermelon. To cut your watermelon into bite-size chunks, first place the watermelon on a chopping board and cut off the top and bottom using a sharp knife. This will allow you to securely stand the watermelon on one of the cut edges. Run the blade of the knife down the sides of the watermelon, cutting the rind from the flesh. Next cut the watermelon into round disks, then cut the disks into 1-inch cubes. If not using immediately, place the cut watermelon in a covered container and refrigerate. It will keep like this for 3 to 4 days. [4] X Research source"
    },
    {
      "title": "Deseed the watermelon.",
      "content": "Deseed the watermelon. If you would like to deseed a watermelon, simply cut the watermelon in half, then in quarters. Cut through the flesh of the melon along the seed line with a paring knife. Now, lift off the piece you just cut out. Using a fork, scrape the seeds from the piece you just removed and from the remaining flesh on the rind. This is perfect to dice up into chunks for a snack, use in salsa, mix into drinks or anything else you would use watermelon for."
    },
    {
      "title": "Make watermelon salad",
      "content": "Make watermelon salad . Watermelon is the perfect addition to a fresh salad, giving your lunch an added, juicy crunch. This recipe pairs watermelon with cucumbers, cashew nuts and feta cheese!"
    },
    {
      "title": "Make watermelon lemonade",
      "content": "Make watermelon lemonade . Can you imagine anything more refreshing than a cold glass of watermelon-flavored lemonade on a hot summer's day? Use the sweetest watermelon you can find for best results!"
    },
    {
      "title": "Make watermelon donuts",
      "content": "Make watermelon donuts . Watermelon donuts aren't really donuts, they're just watermelon slices cut into the shape of donuts. Topped with sugar and slivered almonds, they make a delicious snack."
    },
    {
      "title": "Make deep-fried watermelon",
      "content": "Make deep-fried watermelon . This tasty, but not-so-healthy treat is often served at county fairs and other events. Finished with some powdered sugar, it makes a decadently juicy treat!"
    },
    {
      "title": "Make watermelon-infused vodka",
      "content": "Make watermelon-infused vodka . You can make a delicious, summery drink by infusing vodka with watermelon slices - serve over ice with a little juice for a perfect pink party drink!"
    }
  ]
}