{
  "url": "https://www.wikihow.com/Remove-Acrylic-Paint-from-Skin",
  "title": "How to Remove Acrylic Paint from Skin",
  "steps": [
    {
      "title": "Treat the paint spot immediately.",
      "content": "Treat the paint spot immediately. If you’ve just gotten paint on your skin and it hasn’t yet had time to dry, treat the area right away. Once the paint has begun to set up, it will harden and solidify in place, making it much harder to remove. Paint that is still wet should wash away without much trouble. This is especially important for bigger spills, as they will be more unsightly and harder to get out once they dry."
    },
    {
      "title": "Rinse the spot with warm water.",
      "content": "Rinse the spot with warm water. Run some warm water over the affected area. The heat of the water will loosen paint that has begun to dry, and much of it should wash away on its own. Rinsing the skin also weakens the paint’s hold as the skin grows slippery. You may be able to completely get rid of fresh paint spots this way. Acrylic paint is a water-based emulsion, meaning they are designed to be soluble in water. [1] X Research source"
    },
    {
      "title": "Use a mild soap to wash the area.",
      "content": "Use a mild soap to wash the area. Mix a mild hand soap or liquid detergent under with the water until it creates a lather. Wash the area thoroughly, applying firm pressure with the hand or washcloth. [2] X Expert Source Jeanine Hattas Wilson Professional Painter Expert Interview. 5 May 2021. Regular dish soaps are ideal for this type of job, as they contains abrasive elements and compounds that cut through dried-on stains."
    },
    {
      "title": "Repeat and dry.",
      "content": "Repeat and dry. If the soap and water successfully take out the paint stain on the first try, dry the area and call it a day. Otherwise, you may need to make another pass until the remaining paint fades and washes away. Try soaping up again. The surfactants in the soap combined with repeated scrubbings should be able to get out whatever’s left."
    },
    {
      "title": "Wash with soap and warm water.",
      "content": "Wash with soap and warm water. Wet the affected area with warm water to loosen the paint and lather up with a mild liquid detergent. Get as much of the paint off as you can using the soap and water. Dry the area thoroughly with a towel before applying baby oil. Due to the repellent relationship between water and various oils, the baby oil will have trouble working if the skin is still wet. [3] X Research source"
    },
    {
      "title": "Rub the baby oil into the skin.",
      "content": "Rub the baby oil into the skin. Squeeze an ounce or two of baby oil directly onto the paint spot and massage it into the skin. Work the dried paint away with the tips of your fingers, or with a cotton ball or sponge if the stain is particularly stubborn. Baby oil is proficient at breaking up and dissolving dried-on acrylic and oil-based paints. [4] X Research source Baby oil is one option that is much gentler and more beneficial to the skin than paint removers that use harsh chemicals as their primary agents. [5] X Research source Using a mildly abrasive implement like a cotton ball or sponge will help scour paint out of the deeper contours of the skin."
    },
    {
      "title": "Rinse away the loose paint.",
      "content": "Rinse away the loose paint. Run some warm water over the area again to wash away the dissolving paint. If necessary, use another dab of baby oil on remaining stains. In addition to erasing tough paint spots, the baby oil will also leave your skin feeling smooth and moisturized. [6] X Research source"
    },
    {
      "title": "Wash the area with soap and water.",
      "content": "Wash the area with soap and water. If the paint has already dried on the skin, you will need additional measures to remove the stain. Start by washing the area with soap and warm water. Loosen the paint as much as possible to weaken its hold on the skin. Scrub the area lightly as you wash. Pat the area with a towel before proceeding to treat the spot so that the water on your skin doesn’t dilute the alcohol."
    },
    {
      "title": "Apply rubbing alcohol to a cloth or cotton ball.",
      "content": "Apply rubbing alcohol to a cloth or cotton ball. Take a washcloth or large cotton ball swab. Douse the cloth or cotton ball with roughly an ounce of standard rubbing alcohol. Alcohol is a solvent for acrylic paint, which means it will start to break down the paint once it’s applied to the skin. [7] X Research source For ease of application, press the cloth or cotton swab to the mouth of the alcohol bottle and turn it upside down, soaking a compact circle perfect for scrubbing. Pure rubbing alcohol is one of the most highly recommended methods for removing paint from various surfaces. [8] X Research source"
    },
    {
      "title": "Swab the paint spot vigorously.",
      "content": "Swab the paint spot vigorously. Dab the area with the washcloth or cotton ball to wet it and give the alcohol time to begin acting on the paint. Then, go over the paint spot with alcohol using small, circular strokes to coax the paint out of the crevices of the skin’s surface. Scrub the area until all paint is gone, reapplying alcohol as needed. [9] X Research source You may have to scrub quite forcefully to reach paint that has settled deep into the skin."
    },
    {
      "title": "Wash and dry the skin.",
      "content": "Wash and dry the skin. Once all traces of paint have been removed, wash and dry the area to clear it of any leftover rubbing alcohol. Isopropyl alcohol is a mild irritant to the skin, and can cause redness and irritation if it is not rinsed away."
    },
    {
      "title": "Run some warm water over the paint spot.",
      "content": "Run some warm water over the paint spot. Loosen and re-wet the paint using warm water. Scrape away any flakes or thicker areas with a fingernail. Rinse the area until the bond between the paint and the skin beneath it begins to give way."
    },
    {
      "title": "Soak the corner of a hand towel with acetone.",
      "content": "Soak the corner of a hand towel with acetone. Find a thick, soft hand towel and dip one corner into a container of acetone. Let any excess acetone drip off the towel before using it to treat paint spots on skin. Fold or bunch the rest of the hand towel up under the soaked corner to create a scrubbing surface. [10] X Research source [11] X Research source Acetone is a harsher substitute for the gentler rubbing alcohol, and should be used only when soap and water and alcohol have failed to remove the stain. One of acetone’s most common uses is as nail polish remover, which means it’s been proven to work effectively on dried on acrylic paints. [12] X Research source"
    },
    {
      "title": "Press the towel to the paint spot.",
      "content": "Press the towel to the paint spot. Apply the acetone-soaked towel to the paint spot and hold it there for thirty seconds to a minute. The acetone may cause a slight burning or irritated sensation; this is normal. As you hold the towel over the spot, the acetone will eat away at the dried paint stain. [13] X Research source Because of its mildly caustic properties, acetone is irritating to the skin, but is usually not dangerous. Make sure you have no known allergy or intolerance to acetone before using it to treat skin."
    },
    {
      "title": "Wipe away any remaining paint and wash the skin.",
      "content": "Wipe away any remaining paint and wash the skin. Scour the spot with the corner of the hand towel. Once most of the paint has come away, rinse the towel with warm water and scrub again. This will continue to break down the paint stain while also removing the acetone from your skin. When the paint is completely gone, wash the area with mild soap and warm water and dry. Always wash skin after it has come into contact with acetone."
    }
  ]
}