{
  "url": "https://www.wikihow.com/Make-an-Essay-Appear-Longer-Than-It-Is",
  "title": "How to Make an Essay Appear Longer Than It Is",
  "steps": [
    {
      "title": "Choose a slightly larger font.",
      "content": "Choose a slightly larger font. If your teacher is unclear about which fonts you can use, pick one of the larger fonts like Arial, Courier New, Bangla Sangam MN, Quicksand, Armen CT or Cambria. If your teacher limits the font to Times New Roman, try choosing a similar, but larger font like Bookman Old Style. [1] X Research source Don’t pick a very large font like Arial Black or Lucida Handwriting. Your teacher will notice that you are trying to make your essay longer by choosing a larger font."
    },
    {
      "title": "Adjust the font size.",
      "content": "Adjust the font size. Your teacher will most likely require that you use 12 pt. font. To make your essay appear longer, try increasing the font size to 12.1, 12.3, or 12.5. See which adjustment makes the biggest difference without being too noticeable. [2] X Research source"
    },
    {
      "title": "Increase the size of periods and commas.",
      "content": "Increase the size of periods and commas. Hold down control+F on your keyboard. This is the find/replace function. Select all the 12 pt. periods and commas. Replace them with 14 pt. periods and commas. [3] X Research source"
    },
    {
      "title": "Increase the spacing between lines.",
      "content": "Increase the spacing between lines. If your teacher requires single or double spacing, try increasing the spacing by .1. Click “Format” then “Paragraph.” Under “Line Spacing” choose “Multiple.” Type 2.1 or 1.1 into the box under “At.” [4] X Research source"
    },
    {
      "title": "Increase the right margin by a quarter.",
      "content": "Increase the right margin by a quarter. If your teacher requires the margins to be 1 inch (2.5 cm), try increasing the right margin to 1.25 inches (3.2 cm). Click “Format” then “Document.” In the box next to “Right” type in 1.25. Adjusting the right margin by a quarter (or less) usually does not produce any visible changes. [5] X Research source If the increase is too noticeable, then try 1.15 or 1.1 instead. Because all documents are left justified, avoid increasing the left margin. Adjusting the left margin will produce a noticeable change that your teacher will detect."
    },
    {
      "title": "Increase the bottom margin by a quarter.",
      "content": "Increase the bottom margin by a quarter. Click “Format” then “Document.” In the box next to “Bottom” type in 1.25. If this increase is too noticeable, then try 1.15 or 1.2 instead. Manipulating the bottom margin is a useful strategy in making your essay appear longer, without it being too obvious. [6] X Research source"
    },
    {
      "title": "Expand the character spacing.",
      "content": "Expand the character spacing. Increasing the distance between words is another way to increase the length of your paper. Select the text you want to expand. Click “Font” then “Advanced.” Next to “Spacing” choose “Expanded.” Then type 1.5 into the box next to “By.” [7] X Research source"
    },
    {
      "title": "Lengthen your header.",
      "content": "Lengthen your header. Lengthen your header by including your name, the date, the course title and number, your teacher’s name, and your email or identification number. Including any more information than that will make the header too long. Also double-space the header. [8] X Research source"
    },
    {
      "title": "Place the title of the paper on a separate line below the header.",
      "content": "Place the title of the paper on a separate line below the header. Center the title and bold it. Also, increase the font size to 14. Make sure the space between the title and the header and the title and the first paragraph is double-spaced. [9] X Research source"
    },
    {
      "title": "Add a footer with page numbers.",
      "content": "Add a footer with page numbers. Click “Insert” then “Page Numbers.” Under “Position” select “Bottom of Page (Footer).” This will add a footer with page numbers to the bottom of your page, increasing the length of your essay. [10] X Research source"
    },
    {
      "title": "Spell out numbers less than ten.",
      "content": "Spell out numbers less than ten. For example, spell out one and two instead of using the numerals. This will not only make your essay longer, but it will also look more professional since it is a requirement in formal writing. [11] X Research source"
    },
    {
      "title": "Write out contractions.",
      "content": "Write out contractions. Write out contractions wherever possible to increase the length of your essay. For instance, instead of using “it’s,” write, “it is,\" or instead of using \"can't,\" write, \"cannot.\" It will also make your essay appear more formal. [12] X Research source"
    },
    {
      "title": "Minimize pronouns.",
      "content": "Minimize pronouns. Wherever possible, use specific names instead of pronouns. For example, instead of writing “they,” write, “Angela, Mark, and Tony.” However, use pronouns when writing out names becomes too wordy. Wordiness can detract from the readability and quality of your paper. [13] X Research source"
    },
    {
      "title": "Include supporting material.",
      "content": "Include supporting material. Adding quotations, anecdotes from personal experience, and paraphrasing research are strategies you can use to lengthen your essay. However, make sure the supporting material is relevant and strengthens the points you are trying to make. [14] X Research source Additionally, if you are quoting or paraphrasing research or literature, make sure to cite it properly. Citations can add extra length to a paper as well."
    },
    {
      "title": "Ensure that each paragraph has a topic and a concluding sentence.",
      "content": "Ensure that each paragraph has a topic and a concluding sentence. Introduce the paragraph with a topic sentence. This sentence should state your argument. Provide supporting evidence. Then conclude the paragraph by summarizing the points you just made, or by restating your opinion. [15] X Research source Expand your introductory paragraph with an attention-getting statement to hook the reader in."
    },
    {
      "title": "Be as descriptive as possible.",
      "content": "Be as descriptive as possible. Instead of saying, \"The painting was red,” say, \"The magnificent piece of art was full of vibrant, warm colors such as red, brown and mahogany.” In addition to lengthening your essay, you may give off the impression that you're truly passionate about the topic. [16] X Research source However, try to avoid being descriptive when it is unnecessary since this may cause your paper to appear embellished or sound verbose."
    },
    {
      "title": "Draw out your conclusion.",
      "content": "Draw out your conclusion. Conclusions don't have to be limited to one paragraph. Start your conclusion with a paragraph that simply summarizes your paper. Add a second paragraph that makes a final point about your thesis and how it can be applied to contexts outside of your paper. [17] X Research source"
    }
  ]
}