{
  "url": "https://www.wikihow.com/Show-Chickens",
  "title": "How to Show Chickens",
  "steps": [
    {
      "title": "Select a purebred chicken to show.",
      "content": "Select a purebred chicken to show. At most poultry shows, your chicken will be judged on how well it conforms to the standards of its specific breed and variety. For this reason, most competitions will not accept hybrid or mixed-breed chickens for show. [1] X Research source Do research on specific breeds of chicken that are accepted for show in your area and by the organizations you want to work with. For example, if you live in the U.S., you might start by looking at the list of breeds recognized by the American Poultry Association. A few popular show breeds include Cubalayas, Favorolles, Brahmas, Dutch Bantams, and Silkies."
    },
    {
      "title": "Study the standards for your chosen breed.",
      "content": "Study the standards for your chosen breed. Before you show your chicken, consult your local poultry association’s manual of breed standards. In order for a show chicken to be successful, it must conform to these standards. These might include things like being in a particular weight range, having a certain type of plumage, or having combs and wattles of a specific shape or color. If you live in the U.S., you will probably need to refer to the American Poultry Association’s guide, The American Standard of Perfection . If you live in the UK, consult British Poultry Standards by the Poultry Club of Great Britain."
    },
    {
      "title": "Buy chicks",
      "content": "Buy chicks from a reputable breeder. Do a search for your preferred breed’s national club or association and browse their breeder directory. If you’re not sure how to find out whether a breeder in your area is reputable, talk to someone at a local poultry club and ask for recommendations. [2] X Research source You can also find directories of breeders through the websites of organizations like the Livestock Conservancy. [3] X Research source Avoid buying chickens from feed stores, farmers’ supply centers, and auction houses. These chickens are more likely to be misidentified or in poor health than chickens bought directly from breeders. [4] X Research source"
    },
    {
      "title": "Choose a bird from your flock that meets the breed standards.",
      "content": "Choose a bird from your flock that meets the breed standards. Just because a chicken belongs to a show quality breed, there is no guarantee that it will meet all the required standards for show. You may need to raise a lot of birds before you get the perfect show chicken. [5] X Research source If you raise purebred chickens in a flock, it’s a good idea to occasionally remove members of the flock that don’t conform to breed standards. That way, undesirable traits won’t be passed on within the flock. Humane ways of culling your flock include selling unwanted chickens as pets or housing them separately as part of a laying flock."
    },
    {
      "title": "Pick a bird that is healthy.",
      "content": "Pick a bird that is healthy. A chicken that is sick, bedraggled, injured, or over- or underweight is unlikely to win any shows. Make sure any chicken you plan to show is in the best possible health before signing it up for an exhibition. Give your chickens the best possible care to ensure that they are healthy, happy, and show-ready. This means providing proper housing, nutrients, and grooming."
    },
    {
      "title": "Practice holding your chicken correctly.",
      "content": "Practice holding your chicken correctly. When handling your chicken at a show, you need to use proper form. To pick up your chicken, approach it from the front. Put your left hand underneath the chicken’s body with your index finger between its legs. Use your thumb to support one leg and your other 3 fingers to support the other leg. Carry the chicken with your right hand on its back and its head tucked under your left arm. [6] X Research source Using this hold not only demonstrates that you are familiar with show form, but will also help your chicken feel calm and secure."
    },
    {
      "title": "Learn how to pose your chicken.",
      "content": "Learn how to pose your chicken. Study your breed standards guide to find out what kinds of poses you may be asked to demonstrate. Get familiar with what the poses are supposed to look like, and practice guiding your chicken into those poses. Put your chicken on flat surface covered in a piece of carpeting and gently move its head and tail into the appropriate positions. If the chicken moves, guide it back into position. [7] X Research source Your goal is to get the chicken to hold the pose for 30-60 seconds after you remove your hands. Try practicing with your bird 10 minutes at a time, several times a day until the poses become second nature. Stroke your chicken under the beak as it poses and reward it with a treat if it stands still. You can also try clicker training your chicken. When the chicken does something you like (e.g., holding its head up for a pose), immediately click your clicker, then offer a treat. Your chicken will soon associate the sound and related action with a reward. [8] X Research source While you can support your chicken from beneath as you are teaching it to pose, don’t put your hand on its back. Doing so will encourage the chicken to sit or squat."
    },
    {
      "title": "Train your chicken to do a controlled walk.",
      "content": "Train your chicken to do a controlled walk. During the show, the judges may ask you to have your chicken walk along a table while you direct it with a baton or pointer. Set your chicken down on a long table covered in old carpet. Lead the chicken around the table with a treat until it gets the hang of following you around. Once your chicken is ready to stay on the table and follow your lead, incorporate your pointer, gently tapping the chicken to direct it around the table. [9] X Research source When you want the chicken to turn, tap it on the side of the hackle (the neck). To get your chicken to go forward, tap it on the saddle (the lower back, just above the tail). You may need to tap your chicken with a little force at first—enough to annoy it and get it moving without causing any pain. As your chicken becomes more willing to respond to the commands, make your taps lighter. Reward your chicken with a treat when it follows your guidance."
    },
    {
      "title": "Start preparing a year in advance.",
      "content": "Start preparing a year in advance. The year before you plan to show a chicken, attend an exhibition by the same organization you plan to show with. This will give you a clear idea of what to expect. Over the course of the year, observe your chicks carefully and select the individual(s) you think are most likely to be show quality. [10] X Research source Some breeds take longer to mature than others, so try to hatch eggs or buy chicks within an appropriate timeframe relative to when you plan to show. While some chickens may be ready to show in 6-8 months, others may take a year or more to fully “bloom.”"
    },
    {
      "title": "Keep your show chickens in small groups.",
      "content": "Keep your show chickens in small groups. Remove any chickens you think are show quality from the flock and house them in groups of 2 or 3. The complicated social hierarchies that form in large groups of chickens can lead to squabbling within the flock. This means that keeping your show chickens in a bigger flock puts them at risk of getting bullied. [11] X Research source A chicken that is low on the pecking order can end up with bald spots or more serious injuries. They might also become shy and skittish, which will make training and showmanship more difficult. If possible, avoid isolating your show chickens completely. Chickens are highly social animals that don’t do well without company."
    },
    {
      "title": "Get your chicken used to being handled.",
      "content": "Get your chicken used to being handled. During the show, you’ll be expected to handle and pose your chicken. Start socializing your show chickens from an early age so that they won’t act scared or aggressive when it comes time to show them off. You can do this by: [12] X Research source Handling your chicken frequently from an early age. Talking to your chicken regularly in a calm, soothing voice. Feeding your chicken treats out of your hand."
    },
    {
      "title": "Clean your chicken",
      "content": "Clean your chicken 2-5 days before the show. A few days before you plan to exhibit your chicken, bathe your bird in a tub or basin filled with warm water and a little gentle shampoo or dish soap. Rub the sudsy water through the chicken’s feathers from base to tip. Use a soft-bristled toothbrush to scrub the chicken’s legs and feet. Carefully rinse out the soapy water when you’re done. [13] X Research source For an extra clean rinse, transfer your chicken to a second rinse basin filled with warm water and a few spoonfuls of apple cider vinegar. This will help get all the soap residue out. Rinse the chicken a second time with plain water. Never submerge your chicken’s head under the water. Bathe your chicken in a warm, draft-free area, where the air temperature is around 80–90 °F (27–32 °C). Give your chicken at least 24 hours to dry off and preen itself before the show."
    },
    {
      "title": "Groom your chicken’s face, beak, and nails right after bathing it.",
      "content": "Groom your chicken’s face, beak, and nails right after bathing it. Once you’ve taken your chicken out of the bath, wrap it in a clean, dry towel with its face and feet sticking out. Use a damp sponge to wash the face, beak and wattles. Use a pair of nail clippers to carefully trim the top of the beak so it’s even with the bottom. Use soft-bristle toothbrush to scrub the nails, then clip them with nail clippers. [14] X Research source Take care not to cut through the vein in your chicken’s toenails, since this will cause pain and bleeding. You can file down any rough spots on the nails and feet with an emery board. When you’re done grooming your chicken, pat it dry with a towel and place it in a warm, clean coop."
    },
    {
      "title": "Do a final grooming 30 minutes before showtime.",
      "content": "Do a final grooming 30 minutes before showtime. About half an hour before judging begins, do some last-minute touchups to get your chicken looking its best. Gently scrub the toenails and feet with an old toothbrush, then wipe the legs down with wet wipes and a little baby oil to create a nice sheen. Use a wipe to clean away any dirt or manure from the feathers around the vent. Rub a silk cloth over the feathers from head to tail to smooth them and make them shine. [15] X Research source If you like, you can also rub the comb and wattles with a little baby oil or antibiotic ointment. This will help them look glossy and healthy."
    }
  ]
}