{
  "url": "https://www.wikihow.com/Oil-a-Baseball-Glove",
  "title": "How to Oil a Baseball Glove",
  "steps": [
    {
      "title": "Look for the right oils.",
      "content": "Look for the right oils. Baseball gloves are made of leather, so you’ll want oils and products that are specifically made for leather. The glove manufacturer will probably offer recommendations for oils and conditioners that will work well with their product, which you should be able to purchase at a sporting goods store."
    },
    {
      "title": "Work the oil into the leather.",
      "content": "Work the oil into the leather. Put a little bit of oil into the pocket, the areas between your thumb and forefinger where you catch balls, and rub it in so that you get a light coating. Make sure there are no globs of oil or other liquids left. [2] X Research source If you don’t want to just use your hands, a soft, clean cloth is a good idea. Put a small amount into a clean dish towel, and rub that into the glove."
    },
    {
      "title": "Let your glove dry.",
      "content": "Let your glove dry. Let the glove sit overnight in order for the oil to fully soak into the leather. Make sure it stays in a cool, dry place. The next morning, wipe the glove dry to remove any remaining oil."
    },
    {
      "title": "Form the pocket.",
      "content": "Form the pocket. This is the last step to breaking in a glove. The best way to do this is by playing catch for a few minutes every day for a few weeks. This will help make the glove form better to your hand, and give you the comfort you want while playing. [3] X Research source There are a few other popular methods for making a pocket. Place a baseball or softball into the pocket and tie the glove shut, repeating that process every night after giving it some use. Alternatively, use a hammer to pound the pocket in."
    },
    {
      "title": "Clean your glove after use.",
      "content": "Clean your glove after use. Once you are done for the day, either in a game or just playing catch, wipe down the glove with a clean rag. Get rid of any dirt or debris on it, and store in a cool, dry place daily. [4] X Research source"
    },
    {
      "title": "Apply a little leather cleaner.",
      "content": "Apply a little leather cleaner. To give your glove a better clean, put a little bit of cleaner on a damp cloth or sponge. Make sure you wipe the entire glove with the cleaner. This includes parts other than the pocket, including the laces and webbing. [5] X Research source Make sure you use the right kinds of leather cleaners. Look for designated baseball glove leather cleaners, or products recommended by the manufacturer. Avoid oil conditioners like linseed oil, mink oil, neatsfoot oil, silicon, or petroleum-based products. Keep your application light. Too much cleaner, or applying it too often, will cause the leather to break down faster. You probably want to do this once a year to help keep your glove lasting for a long time."
    },
    {
      "title": "Dry off the glove.",
      "content": "Dry off the glove. Use a damp cloth or sponge to wipe off any remaining oil. Then let your glove air dry overnight. Make sure you find a cool, dry place for your glove to sit, which means not in your gym or bat bag. [6] X Research source The leather will be a bit stiff after drying, but some regular use should soften it up again quickly."
    },
    {
      "title": "Keep your oil use limited.",
      "content": "Keep your oil use limited. You want to make sure you don’t overdo it when you apply cleaner. [7] X Expert Source Isaac Hess Baseball Coach & Instructor Expert Interview. 20 March 2020. Make sure you don’t soak the leather. Too much will make it deteriorate faster, the opposite of what you want."
    },
    {
      "title": "Avoid products not approved for leather.",
      "content": "Avoid products not approved for leather. Remember that your glove is made of leather, a specific kind of material. Not all oils are good on leather, and because it is a common material, they will usually say so on the label. Using these oils will break down the material and cause your glove to deteriorate faster."
    },
    {
      "title": "Use cool, dry air on your glove.",
      "content": "Use cool, dry air on your glove. Keep your glove in a cool, dry place when you are done oiling. Do not use a blow dryer, furnace, or dryer to dry it off. The extra heat will damage the glove, especially since you’ll be letting it sit overnight and not carefully watching it. [8] X Research source"
    },
    {
      "title": "Keep it out of the microwave.",
      "content": "Keep it out of the microwave. Cooking your glove in a microwave is a good way to dry out the leather, making the laces brittle and more likely to break. You can also start a fire if you aren’t watching carefully. Some gloves have metal parts in them as well, which create sparks that will catch fire and damage your microwave. This goes for other heating methods like ovens or your car. While your glove probably won’t catch fire sitting on the dashboard, it will still dry out and become brittle."
    }
  ]
}