{
  "url": "https://www.wikihow.com/Prevent-Perianal-Abscess-from-Returning",
  "title": "How to Avoid a Perianal Abscess Recurrence",
  "steps": [
    {
      "title": "Ask a friend or family member to take you home from the hospital.",
      "content": "Ask a friend or family member to take you home from the hospital. A smooth recovery from your current abscess is your best chance at preventing future abscesses. Schedule a surgical procedure to drain the abscess. Typically, this is a same-day procedure. Have someone close to you, like a family member or friend, available to drive you home. [1] X Research source You might be drowsy from anesthesia or pain medication, so a ride is absolutely necessary. As soon as you know when your procedure will take place, find an available person to give you a ride home so that you don't have to drive yourself. Ask them to pick up any prescriptions and help you get comfortable at home."
    },
    {
      "title": "Make a follow-up appointment to check your wound in 6 weeks.",
      "content": "Make a follow-up appointment to check your wound in 6 weeks. Schedule an appointment for your doctor to check your wound. Typically, they will want to see you in about 6 weeks, but in some cases might want to recheck you in 2-3 weeks. It’s a good idea to schedule the follow up as soon as possible so that your doctor’s schedule doesn’t fill up. [2] X Research source At the follow-up appointment, your doctor will check to make sure your wound is healing nicely. They will also check to make sure an anal fistula hasn’t occurred. A fistula is a small tunnel that goes from the anus to an open area in the skin close to the anus. These often occur because of a previous abscess. Unfortunately, almost 50% of people will have a fistula after the abscess surgery. [3] X Research source You can’t prevent a fistula, but you can decrease the likelihood by following your post-op instructions precisely."
    },
    {
      "title": "Keep the incision area clean and padded.",
      "content": "Keep the incision area clean and padded. Wash the area at least twice a day with a mild soap and warm water to keep it clean. Wear a soft maxi pad or sterile gauze in your underwear to collect any discharge from the healing abscess. The padding will also help you feel more comfortable. Change your pad or gauze if it's soiled, or at least twice a day, to keep the area clean and free of discharge."
    },
    {
      "title": "Avoid heavy lifting or exercise for 1 week after surgery.",
      "content": "Avoid heavy lifting or exercise for 1 week after surgery. You’ll be able to move around, but you should make sure to not really exert yourself for several days after your procedure. Don’t lift anything too heavy (probably not heavier than a full backpack) and don’t do any exercise. However, make sure to walk around during the day to keep your circulation going. [4] X Research source Depending on your job, you can probably return to work in 1-2 days. If your job involves a lot of physical activity, talk to your doctor first. Do not go swimming until your wound has completely healed. Avoid riding a bike for 6-8 weeks after your surgery. You can have sex as soon as you feel comfortable doing so."
    },
    {
      "title": "Ask your doctor about a laxative for easier bowel movements.",
      "content": "Ask your doctor about a laxative for easier bowel movements. You might not have regular bowel movements right after surgery; that’s normal. Resist the urge to strain or push. If you are not having normal bowel movements in 1-2 days after the surgery, ask your doctor if a laxative is right for you. A mild laxative might help. [5] X Research source Follow the dosage instructions from your doctor or the directions on the packaging. To make it easier to have a bowel movement, place a stool under your feet to prop them up. This helps you flex your hips and pelvis similar to when you're in a squatting position. [6] X Research source After you have a bowel movement, taking a sitz bath can help you keep the area clean and relieve any discomfort from the bowel movement."
    },
    {
      "title": "Take antibiotics as directed.",
      "content": "Take antibiotics as directed. In many cases, your doctor will prescribe post-op antibiotics, in case there is an infection. Follow all of your doctor’s instructions on how to take your medicine. Finish all of the medication, even if you feel fine. [7] X Research source"
    },
    {
      "title": "Ask your doctor about pain medication, as needed.",
      "content": "Ask your doctor about pain medication , as needed. It’s normal to feel pain or tenderness in your anal region. If the pain is uncomfortable but manageable, ask your doctor if it’s okay to take an over the counter pain reliever. Make sure to follow the dosage instructions. [8] X Research source If your pain is more severe, ask your doctor about a prescription pain medication. Make sure to follow your doctor’s instructions on taking these meds."
    },
    {
      "title": "Take a warm sitz bath for 15-20 minutes to help with discomfort.",
      "content": "Take a warm sitz bath for 15-20 minutes to help with discomfort. A sitz bath is a therapeutic treatment for your anal and genital area. You can take a sitz bath in your bathtub by sitting in 3 to 4 inches (7.6 to 10.2 cm) of warm water, or you can buy a small sitz bath bowl that fits over your toilet seat. Add Epsom or sea salt to the water, then sit in the sitz bath for 15-20 minutes. Pat the area dry. [9] X Research source Use a warm temperature that feels therapeutic but isn't too hot. You can apply a soothing cream after your sitz bath."
    },
    {
      "title": "Wash your anal area daily to keep the wound clean.",
      "content": "Wash your anal area daily to keep the wound clean. Use warm soapy water to gently clean the area, then gently pat dry with a clean towel. If it feels good, sit in a shallow bath for 20 minutes 3-5 times a day. [10] X Research source Clean yourself with a baby wipe after a bowel movement to keep the area clean and dry between showers or baths. Stick to mild soap and warm water. Don't use antiseptics like hydrogen peroxide and alcohol, which can slow healing."
    },
    {
      "title": "Follow your doctor’s instructions about dressing the wound.",
      "content": "Follow your doctor’s instructions about dressing the wound. Your doctor might have placed gauze on your wound after surgery. Ask when to remove it. If your wound is weeping or leaking, you can place additional gauze over the wound. [11] X Research source Change your bandage after you clean the area. Place a maxi pad in your underwear to absorb any drainage, if necessary."
    },
    {
      "title": "Apply ice several times a day to ease the pain.",
      "content": "Apply ice several times a day to ease the pain. Place ice on your wound for 20 minutes at a time, several times a day. It will be more comfortable if you place a thin cloth between the ice and your skin. [12] X Research source Put ice cubes in a baggie or use a ready-made ice pack. A cooling gel pack will work, too."
    },
    {
      "title": "Know when to call your doctor.",
      "content": "Know when to call your doctor. With proper care, you likely won’t have anything to worry about during the healing process. However, it’s important to know the warning signs that something isn’t right. Call your doctor right away if you experience: [13] X Research source Increased redness, swelling, or severe pain A fever Red streaks stemming from the incision Bright red blood seeping through the bandage or cause Feeling sick to your stomach An inability to pass gas"
    },
    {
      "title": "Understand the causes of abscesses.",
      "content": "Understand the causes of abscesses. Abscesses are common and can happen to anyone. They typically occur when the glands near your anus become clogged. This can be the result of bacteria or feces entering the glands. Cancer, Crohn’s disease, and trauma increase the risk of abscesses or fistulas. [14] X Research source Frequent cycling can also contribute to a perianal abscess or make it reoccur. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Even with the proper medical treatment and after-care, 2-3% of patients will have a recurrence of their abscess. If that happens, don't blame yourself—there probably wasn't anything you could do to prevent it. [16] X Expert Source Gary Hoffman, MD Colorectal Surgeon Expert Interview. 29 December 2020."
    },
    {
      "title": "Pay attention to common symptoms.",
      "content": "Pay attention to common symptoms. Signs of an abscess include redness, swelling, or tenderness near your anus. You might also experience fever, chills, and a general sense of feeling unwell. [17] X Research source It’s important to note that these are mostly common symptoms of other ailments, too."
    },
    {
      "title": "Visit your doctor for a diagnosis.",
      "content": "Visit your doctor for a diagnosis. Make an appointment to see your doctor. Explain your symptoms and ask for an exam. Your doctor can likely diagnose an abscess by doing a simple clinical exam. Occasionally, they might use imaging technology like an ultrasound or CT scan if they suspect a deep fistula. [18] X Research source Surgery is the only way to get rid of an abscess or fistula, but it is a very common, simple procedure."
    }
  ]
}