{
  "url": "https://www.wikihow.com/Remove-a-Sticker-from-Glass",
  "title": "13 Ways to Remove Stickers from Glass",
  "steps": [
    {
      "title": "Soaking the glass in soapy water is the simplest way to remove the sticker.",
      "content": "Soaking the glass in soapy water is the simplest way to remove the sticker. Fill your sink (or a clean basin) with hot water and a little bit of dish soap. If possible, soak the glass item (or at least the stickered portion of the glass) in the sudsy mixture and let it soak for an hour (or however long it takes for the sticker to get mushy). Then, carefully glide the edge of a credit/debit card over the glass to scrape off the sticker and its residue. [1] X Research source Be cautious when using any sort of tool to scrape glass. Always use steady, careful motions to keep yourself from scratching the glass surface by mistake."
    },
    {
      "title": "White vinegar is a handy household item with powerful cleaning properties.",
      "content": "White vinegar is a handy household item with powerful cleaning properties. Dip a few cotton balls or a paper towel sheet in a little bit of white vinegar and drape them on top of the sticker (or leftover residue). Leave the vinegar in place for about 5 minutes before attempting to remove the sticker and its residue. [2] X Research source If you’re still struggling after 5 minutes of soaking, leave the vinegar-soaked paper towel or cotton balls in place for a little longer. Vinegar is safe to use on glass—in fact, some commercial cleaning brands (like Windex) use vinegar in some of their glass-cleaning products."
    },
    {
      "title": "Heat can melt the adhesive enough to remove the sticker from the glass.",
      "content": "Heat can melt the adhesive enough to remove the sticker from the glass. Turn your hairdryer to a low heat setting and hover it over the leftover sticker residue. Wait for the residue to start loosening up from the glass, and then use a plastic scraper to carefully remove the adhesive from the surface. [3] X Research source If the residue is still stuck, use the hairdryer for a little longer. Warning: Glass can crack and break when its temperature changes suddenly. [4] X Research source Try to use the lowest setting on your hairdryer to prevent this damage from occurring."
    },
    {
      "title": "Repurpose rubbing alcohol to clean your glass containers.",
      "content": "Repurpose rubbing alcohol to clean your glass containers. Dip part of a clean cloth in rubbing alcohol and scrub at the leftover adhesive. If the residue is especially stubborn, soak an entire paper towel sheet in alcohol and drape it over the sticker. Wait 5 minutes before removing the paper towel and clearing away the residue. [5] X Research source Clean off the glass with soap and water once you’re done soaking it with rubbing alcohol."
    },
    {
      "title": "Acetone is a good solution for extra-stubborn sticker residue.",
      "content": "Acetone is a good solution for extra-stubborn sticker residue. Dip a cotton ball or clean rag in some acetone and scrub down the sticker or its leftover adhesive. Acetone is capable of breaking down some tough substances (like super glue) and should easily clear away any stickers that are mucking up your glass. [6] X Research source"
    },
    {
      "title": "Use WD-40 to rid your glass of any lingering residue from an old label.",
      "content": "Use WD-40 to rid your glass of any lingering residue from an old label. Apply a generous layer of WD-40 to the surface of the sticker and any leftover adhesive. Let it sit for 10 minutes before clearing it off with a clean rag. Before using the glass again, give it a quick cleaning with some soap and warm water. [7] X Research source"
    },
    {
      "title": "Gently scrape away leftover adhesive without scratching the glass.",
      "content": "Gently scrape away leftover adhesive without scratching the glass. Grab a plastic item with a blunt edge, like a credit card, debit card, gift card, or the blunt edge of a plastic knife. Guide the plastic edge along the surface of the sticker and adhesive to scrape it away from the glass. [8] X Research source Auto care professionals sometimes recommend using razor blades to scrape glass. [9] X Research source If you use a razor, be extremely careful so you don’t accidentally scratch the surface."
    },
    {
      "title": "Erase stickers from glass just as you would pencil from paper.",
      "content": "Erase stickers from glass just as you would pencil from paper. Have some spare erasers lying around your home? Take one and grind it over the leftover sticker adhesive repeatedly. As you rub, the adhesive will start to come off with the eraser. [10] X Research source Any eraser can work for this, but you’ll probably have better luck using a large one that’s easy to grip."
    },
    {
      "title": "Ice cubes can help “freeze” the adhesive, making it easier to remove.",
      "content": "Ice cubes can help “freeze” the adhesive, making it easier to remove. Fill a baggie with ice cubes and seal it shut. Then, set the bagged ice on top of the sticker adhesive, giving it a couple of minutes to firm up. Go over the hardened adhesive with a plastic scraper (e.g., a gift card, credit card, etc.) to remove it in easy chunks. [11] X Research source Warning: Sudden temperature changes can cause the glass to crack, so use caution if you give this method a try. [12] X Research source"
    },
    {
      "title": "Almost everyone has cooking oil in their home, making this an easy hack.",
      "content": "Almost everyone has cooking oil in their home, making this an easy hack. Dip a paper towel sheet into whatever type of cooking oil you have on hand, like canola, olive, or vegetable oil. Place the soaked portion of the paper towel over the sticker and let it sit for around 10 minutes. Then, use a clean paper towel to scrub the loosened sticker residue from the glass. [13] X Research source A plastic scraping tool can also do the trick."
    },
    {
      "title": "DIY your own cleaning scrub to rid your glass of sticky labels.",
      "content": "DIY your own cleaning scrub to rid your glass of sticky labels. Mix 1 US tbsp (15 mL) of coconut oil and 2 tbsp of baking soda (35 g) together and apply them to the surface of the sticker. Leave the mixture alone for 15 minutes before removing the rest of the sticker with your fingers. Once the sticker is totally gone, clean off the glass item. [14] X Research source If you’re working with a large sticker, you might need a larger amount of coconut oil and baking soda. Just be sure to always mix the oil and baking soda at a 1:2 ratio."
    },
    {
      "title": "The oils in peanut butter may break down the residue left by a sticker.",
      "content": "The oils in peanut butter may break down the residue left by a sticker. Apply a generous layer of peanut butter to the sticker’s surface and wait 5 minutes; in some cases, you might need more time for the peanut butter to work its oily magic. Using a blunt plastic edge (like a gift card, plastic spatula, or the blunt end of a plastic knife), scrape away the sticker and its residue. [15] X Research source Some people find that peanut butter is more effective on sticker adhesive rather than the sticker itself."
    },
    {
      "title": "Store-bought cleaners are great at removing sticker residue.",
      "content": "Store-bought cleaners are great at removing sticker residue. Check the packaging instructions before using the product to achieve the best possible results. Most brands (like Goo-Gone ) will likely tell you to spread the product over the adhesive, wait a certain amount of time, and then scrub away the product. [16] X Research source Some people swear by using The Pink Stuff to clear away sticker residue from glass. [17] X Research source"
    }
  ]
}