{
  "url": "https://www.wikihow.com/Run-a-Bake-Sale",
  "title": "How to Run a Bake Sale",
  "steps": [
    {
      "title": "Plan your bake sale.",
      "content": "Plan your bake sale. First, determine how many treats you plan to sell. If you just want to go round the neighbourhood, then you will need around 50-70 treats. For a class sale, around 15-40. For a whole school sale, around 100-150. Also, don't forget—if it's not a bake sale and more of baking orders, get all the orders in first! [1] X Research source"
    },
    {
      "title": "Plan what treats you want to make.",
      "content": "Plan what treats you want to make. Good ideas are cupcakes, cookies, slices of cakes, flapjacks, but then, you could always be creative, and make some different treats! [2] X Research source"
    },
    {
      "title": "Plan the prices.",
      "content": "Plan the prices. Don't rip your customers off (or you might not get any), by selling a cookie for $5. Sell your treats at reasonable prices e.g. Cupcake=$2 Cookie=$1 But try not to make them too cheap, or you won't make as much money. [3] X Research source"
    },
    {
      "title": "Plan the date.",
      "content": "Plan the date. Use a normal day, where people won't be busy or away. Also, use a sensible time, e.g. after school, or 4:00 PM in the neighbourhood. Remember to ask your principal if you can hold your bake sale! [4] X Research source"
    },
    {
      "title": "Advertise.",
      "content": "Advertise. Make fun, striking, colourful posters that say the date, time and prices of your bake sale. Hang these posters around in your neighbourhood or school. If you are baking for a charity, then include this too."
    },
    {
      "title": "Bake.",
      "content": "Bake. You can't have a bake sale without baking! It's best to ask your parents and/or a few friends to help. Make sure you have all the ingredients for your treats!"
    },
    {
      "title": "Decorate your treats.",
      "content": "Decorate your treats. Use icing, sprinkles, chocolate chips, edible glitter, candy, anything that will make your treats look stunning. If you are not very good at cake decorating, you may need help from your parents. [5] X Research source"
    },
    {
      "title": "Set up.",
      "content": "Set up. On the day, about an hour before your stall begins, place a large table, chair, sign (optional) and money pot in your front garden/the hall/the playground."
    },
    {
      "title": "Start your stall, and hope that people start lining up!",
      "content": "Start your stall, and hope that people start lining up! Don't forget to have a can or box for money!"
    }
  ]
}