{
  "url": "https://www.wikihow.com/Reclaim-Admin-Rights-to-a-Facebook-Page",
  "title": "How to Reclaim Admin Rights to a Facebook Page",
  "steps": [
    {
      "title": "Report the hacked account to Facebook.",
      "content": "Report the hacked account to Facebook. If you or another Page admin's personal Facebook account was hacked, the hacker may have also taken over your business or organization's Page. If the owner of the hacked account can no longer sign in, they'll need to report the incident at https://www.facebook.com/hacked to reclaim their account. [1] X Research source Once Facebook confirms the hack, you can continue with this method. This method will only work if you once had admin rights to a Page but were removed by someone who hacked another admin's account. If the person in control of the Page has never given you access, see this method instead."
    },
    {
      "title": "Go to https://www.facebook.com/help/contact/957215276032920.",
      "content": "Go to https://www.facebook.com/help/contact/957215276032920 . If you're not already signed in with the account that needs to regain admin rights to the Page, you'll need to do that first."
    },
    {
      "title": "Select the Page you want to reclaim.",
      "content": "Select the Page you want to reclaim. The Pages in the menu are those your account had access to in the past. If the hacker assigned you another non-admin role for the Page (such as Moderator, Analyst, or Jobs Manager), the Page won't be in this menu because you're technically still a member. The only way to move forward is to remove yourself from the current role. To do this, go to your page, click Manage at the top-right, click Page Access in the left panel, click the three dots next to your name, then click Remove access . [2] X Research source"
    },
    {
      "title": "Select \"Yes\" and click Send.",
      "content": "Select \"Yes\" and click Send . Click the box next to \"Did an unknown user who should not be associated with your Page remove your admin access?\" before clicking the Send button. This sends a report to Facebook so an agent can contact you with verification instructions. This can take anywhere from 1 day to a few weeks."
    },
    {
      "title": "Gather your documents.",
      "content": "Gather your documents. If you've lost admin control of a Page because a previous employee or contractor removed you, you accidentally removed yourself, the Page has a parent Page as an admin, or you're disputing ownership with a court order, you may be able to submit a chat to Facebook. [3] X Research source This will only work if you were previously an admin for the Page and have spent money advertising for the Page, as chat won't be available otherwise. Begin by preparing these documents: An official government ID for the person requesting Admin access. An official business document containing the owner's name and address, such as a utility bill, tax document, business license, or certificate of formation. [4] X Research source A written letter (you can type and print it out, but you'll need to sign it by hand) containing this information: The name and URL of the Page The requester's relationship to the Page The requester's name, email address, and personal Facebook profile URL An explanation of the request. For example, \"The current administrator, (name), was terminated by our company on X date and has not returned control of the Facebook Page. Please make (name) an administrator to the page https://facebook.com/facebook.\" A declaration statement, such as, \"I, (name), certify that I am the rightful owner of this Page and that this information is accurate.\" Your physical signature (digital signatures are not accepted)"
    },
    {
      "title": "Scan the documents.",
      "content": "Scan the documents. Each document must be scanned in as a PDF file. If you have an iPhone or Android, you can use your phone to scan the documents . You can also use a traditional scanner."
    },
    {
      "title": "Go to https://www.facebook.com/business/help/support.",
      "content": "Go to https://www.facebook.com/business/help/support . If you're not already logged in, sign in with the Facebook account that used to have Admin access to the Page."
    },
    {
      "title": "Submit a request to restore admin access.",
      "content": "Submit a request to restore admin access. If your account was previously a Page admin, you will have the option to submit a chat. If you don't see this option, contact somebody else within your organization to see if anyone who has Business Manager access in any capacity has the option to submit a chat request. [5] X Research source You can also try this method instead."
    },
    {
      "title": "Go to https://www.facebook.com/help.",
      "content": "Go to https://www.facebook.com/help . This takes you to the Facebook Help Center. If someone else has control over a page that should be yours and won't give you access, you can report the page as an infringement of your copyright. [6] X Research source Use this method if you own the organization or company the Page claims to represent, but you never actually had admin rights to the Page. For example, if a former employee removed your access to the company Page. Using this method will only result in the reported content or Page being removed from Facebook. Facebook will not change the Admin control of the Page."
    },
    {
      "title": "Click Policies and Reporting.",
      "content": "Click Policies and Reporting . It's on the left panel."
    },
    {
      "title": "Click Intellectual Property.",
      "content": "Click Intellectual Property . This is also in the left panel."
    },
    {
      "title": "Click Copyright.",
      "content": "Click Copyright . It's below \"Intellectual Property\" in the left panel."
    },
    {
      "title": "Click this form.",
      "content": "Click this form . This is a link in the first paragraph at the top of the right panel. [7] X Research source"
    },
    {
      "title": "Select I am the rights owner if the content is yours.",
      "content": "Select I am the rights owner if the content is yours. If you're reporting an infringement on behalf of your employer or other organization, choose I am reporting on behalf of my organization or client instead. [8] X Research source You may have to select Copyright and then Continue with your copyright report before you see these options."
    },
    {
      "title": "Enter your name and contact information.",
      "content": "Enter your name and contact information. You'll need to provide your full name (even if you're reporting on behalf of somebody else), mailing & email addresses, the name of the person who owns the rights, and the country where the rights holder lives. If you're reporting the page on behalf of yourself, enter your own name as the rights owner. Facebook will include your full name when communicating with the other party, so keep that in mind."
    },
    {
      "title": "Select Other as the copyrighted work type.",
      "content": "Select Other as the copyrighted work type. You'll find this option in the menu labeled \"Which of these best describes the copyrighted work?\""
    },
    {
      "title": "Enter at least one URL that proves you own the content.",
      "content": "Enter at least one URL that proves you own the content. For example, if you are a magazine publisher whose Page was hijacked, you can list your magazine's main website here and any pages on which your full name appears. This goes into the large box labeled \"Please provide links (URLs) to the copyrighted work or describe it in the box below.\" For example, if you owned wikiHow's and your Page was hijacked, you'd list www.wikihow.com here. If you don't have proof of ownership online, you can type a thorough explanation of your claim into the box instead."
    },
    {
      "title": "Select Other as the type of content you want to report.",
      "content": "Select Other as the type of content you want to report. Since you're reporting a Page, Other is the closest option."
    },
    {
      "title": "Enter the URL of the Facebook Page.",
      "content": "Enter the URL of the Facebook Page. You'll want to paste this into the box labeled \"Please provide links (URLs) leading directly to the specific content you are reporting.\" For example, if you owned wikiHow's Facebook page, you'd enter www.facebook.com/wikiHow here."
    },
    {
      "title": "Select This content copies my work from the next menu.",
      "content": "Select This content copies my work from the next menu. This is the first option in the \"Describe why you are reporting this content\" menu."
    },
    {
      "title": "Describe the situation in the next field.",
      "content": "Describe the situation in the next field. Now you can provide details on the incident. Let Facebook know that you are the one who should be the administrator of the Page but the current admin has removed your access. Be direct yet descriptive. For example, if an employee left the company and refuses to hand over admin rights to the Page, state that specifically in the box without going into too many specifics. To attach files, such as a business license, tax records, or other proof, click Choose Files , select a file, and then click Open ."
    },
    {
      "title": "Sign the form and click Submit.",
      "content": "Sign the form and click Submit . Read the statement above the name field before signing—by signing, you're stating the person running the Page is not authorized to do so, and that you or your company are. To sign the form, just type your name into the field at the bottom. Once Facebook makes a decision (or decides they need to see more proof), they'll contact you via email. The process can take anywhere from 24 hours to a few weeks, depending on how busy Facebook's copyright office is. If this doesn't work, try our guide to contacting Facebook ."
    },
    {
      "title": "Log in to Meta Business Suite at https://business.facebook.com.",
      "content": "Log in to Meta Business Suite at https://business.facebook.com . Sometimes a Facebook Page will exist for your business or organization even if you didn't create it. This usually happens when someone \"checks in\" at your location or an automatic Page is generated by Wikipedia. If a Page exists for your business or organization that doesn't have an admin, you can add it using Business Suite. You will need a Meta Business account to use this method. If you don't have one, log in with your Facebook account and follow the on-screen instructions to sign up now."
    },
    {
      "title": "Select your Facebook account from the top-left menu.",
      "content": "Select your Facebook account from the top-left menu. If you manage any Pages using this account, you may see a Page name in the top-left menu. If you do, click the menu and select your main Facebook account."
    },
    {
      "title": "Click the gear icon.",
      "content": "Click the gear icon. It's at the bottom-left corner of Business Manager."
    },
    {
      "title": "Click Business assets in the left panel.",
      "content": "Click Business assets in the left panel."
    },
    {
      "title": "Click Add Pages under \"Facebook Page.\"",
      "content": "Click Add Pages under \"Facebook Page.\""
    },
    {
      "title": "Click Claim an existing Facebook Page.",
      "content": "Click Claim an existing Facebook Page . It's the second option."
    },
    {
      "title": "Enter the URL of the Facebook Page and click Next.",
      "content": "Enter the URL of the Facebook Page and click Next . As long as nobody manages the current Page, you can add this Page to Business Manager. If the Page is already managed by someone else, Facebook will send a request to the current admin asking them to approve moving the Page into your business account. [9] X Research source"
    },
    {
      "title": "Follow the on-screen instructions to submit your request.",
      "content": "Follow the on-screen instructions to submit your request. Facebook will evaluate your request, and may ask for additional information to verify. Once verified, the Page will be added to your Business Manager account, and you can assign admins and other roles. Verifying ownership of the Page can take anywhere from a day to a few weeks."
    },
    {
      "title": "Create and distribute a non-competition contract.",
      "content": "Create and distribute a non-competition contract. Doing so will afford you some legal grounds if your account is hijacked. All employees or users on your Facebook page should sign this document before they are given access to company accounts."
    },
    {
      "title": "Restrict employees' Page privileges.",
      "content": "Restrict employees' Page privileges. When creating your Facebook Page initially, make sure you don't give any of your employees a title greater than Editor; this will ensure that they can perform Page maintenance and create posts without having the power to remove you as an admin. [10] X Research source Your title should be the highest tier, which is \"Admin.\" No one else should have this title."
    },
    {
      "title": "Monitor your Page's content frequently.",
      "content": "Monitor your Page's content frequently. If your employees are posting information that goes against Facebook's copyright or trademark agreements, your Page may have its privileges revoked by Facebook until the offending material is removed."
    },
    {
      "title": "Communicate with your employees.",
      "content": "Communicate with your employees. Happy employees don't take over administrator accounts or attempt to steal intellectual property; make sure you're listening and responding to your employees' feedback to cultivate a positive work environment."
    }
  ]
}