{
  "url": "https://www.wikihow.com/Practice-Two-Point-Position-Without-a-Horse",
  "title": "How to Practice Two Point Position Without a Horse",
  "steps": [
    {
      "title": "Mount the saddle on a stable object.",
      "content": "Mount the saddle on a stable object. If you have a saddle but not a horse, you can to improvise in order to practice your two point position at home or when you can't get to the stables. You will need to find an object that you can use to secure the saddle above the ground. Ensure it is sturdy and can take your weight before you use it. It could be a wide fence outside, or a barrel, a wooden polo practice horse, or something similar. Secure the saddle on the object you are using, and be sure it does not slip around or fall off. Now mount up and push yourself up into two point position and hold it for as long as you can. Concentrate on your form and body position. If possible set up a mirror or camera so you can correct your position. If you find yourself losing balance and falling forwards or backwards use this to improve your position. If you fall forwards, try to open your chest a little and concentrate on pressing your shoulder blades down and back while in position. If you fall backwards, try to press your hipbones forwards towards where the horse's ears would be."
    },
    {
      "title": "Practice by standing on the pedals of a bike.",
      "content": "Practice by standing on the pedals of a bike. If you don't have a saddle or an object to use as a practice horse you can try to replicate the position by standing up on the pedals of a bike. You can do this static or on the move. If you do on a static bike, you will need to secure the bike so you don't fall over. Stand up in the pedals and try to mimic the two point position. Lean slightly forward and take most of the weight on your ankles and heels, as you would in the saddle. [2] X Research source Doing this can also help you improve your balance, and with practice you might find you are able to keep your balance on the bike when it is static."
    },
    {
      "title": "Use a chair.",
      "content": "Use a chair. One very simple way to try and practice two point position at home is just to use a chair as your imaginary horse. Turn the chair around so you are facing the backrest and then squat over it with your hands on top of the back rest holding imaginary reins. Lower yourself down towards the seat of the chair, but don't let your backside touch it. Lean forward with a straight back and try to your body into a position similar to the two point position. This will help improve the strength in your legs, and can allow you just to focus on your body position without thinking about your balance."
    },
    {
      "title": "Ride a bike.",
      "content": "Ride a bike. In order to have a good strong two point position you need to have strong legs which can carry your weight for extended periods. Practising two point on a horse will work your legs, but it is easy to supplement this with some targeted strength training at home. [3] X Research source One of the best ways to strengthen your legs is to go cycling often. Try to ride everyday when you can't ride a horse to keep your legs strong and improve your stamina. Riding a bike out of the saddle to some extent mimics riding in two point position on a horse. You will have to lean forward a little and keep your balance in the same kind of way. [4] X Research source Improving the strength of your legs will help your remain stable and balanced in two point position, as well as improving your endurance."
    },
    {
      "title": "Do calf raises.",
      "content": "Do calf raises . If you have been working on your two point position you will have noticed how much it makes your calves burn. Calf raises are a great and very simple exercise which you can do at home. There are some variations which increase the difficulty, but the basic movement remains the same. To start with, stand up straight and lift yourself up onto your toes, contracting your calf muscles as you go. Keep your knees straight as you do this. [5] X Research source You can increase the intensity by standing on a block or a stair, and dangling your heel off the end. Doing this will increase the range of motion available, allowing you to drop your heel below the level of the rest of your foot. You can add weight to increase the difficulty simply by holding onto dumbbells or any weighted object as you do the raises. If you do regular sets of calf raises you will begin to notice your calves strengthening and the muscle becoming more defined, which can translate to a more stable and enduring two point position."
    },
    {
      "title": "Do squats.",
      "content": "Do squats . The second main exercise you can do at home to help you develop your leg muscles for a better two point position is squats. Like calf raises, you can do squats anywhere and you don't need any equipment, but you can increase the difficulty by adding weight. Stand up straight with your legs shoulder width, or slightly wider, apart and turn your feet out to around 45 degrees. Inhale, contract your abdominal muscles and drop down. You backside should go out behind you as you go down. The movement is as if you were sitting down on a chair that is a little behind you not directly underneath you. Keep your knees in line with your feet, your chest forward, your chin up and your back with only a slight bend as you drop down. Go down so that your thighs are as close to parallel with the ground as you can before pushing back up to a standing position. [6] X Research source"
    },
    {
      "title": "Practice yoga to improve your balance.",
      "content": "Practice yoga to improve your balance . As well as strengthening your legs, it will be beneficial for you to work on improving your balance when you are away from the stables. One very good way to do this is with regular yoga routines. Yoga can help you improve your core strength and flexibility which can translate to better balance on and off your horse. Try regular routines which involve the tree pose, the eagle pose and the dancer's pose. The tree pose involves you standing up on one leg with the sole of your other foot pressed up against the inside thigh of your standing leg. [7] X Research source For the eagle pose stand on one leg and bend the knee of the standing leg so you are squatting. Then raise your other leg and wrap it around your standing leg. Your arms should be crossed in front of you. [8] X Research source To do the dancer's pose stand on one leg and raise your other leg up behind you. Grab the foot of the other leg with the hand on the same side and pull it up towards your back as you lean forward and extend your other arm in front of you."
    }
  ]
}