{
  "url": "https://www.wikihow.com/Sing-Like-Michael-Jackson",
  "title": "How to Sing Like Michael Jackson",
  "steps": [
    {
      "title": "Listen to Michael Jackson's music.",
      "content": "Listen to Michael Jackson's music. From his early Jackson 5 recordings to his industry-transforming later work, Michael Jackson's musical art is a veritable treasure trove of vocal techniques, singing styles and performing flair. Familiarize yourself with this material—think of it as homework. Try to pick out outstanding moments that make Jackson's music so memorable, and think about how you can implement these touches in your own style. With countless albums spanning over forty years, live recordings, and concert video footage, MJ has left plenty of material to take cues and inspiration from."
    },
    {
      "title": "Add your own flourishes.",
      "content": "Add your own flourishes. After you've gained proficiency singing like MJ, start including some of your own unique traits. The King of Pop's musical styling remains so influential precisely because of his tendency to improvise distinctive embellishments in his songs. Don't just settle for being like Mike. Get comfortable in his style and make it your own. Most of Michael Jackson's trademark touches, such as his peculiar pronunciation of \"come on\" as \"shamone\" and exclamations like \"hee-hee!,\" were improvisations made while recording. Get into the spirit of Jackson's music when singing by loosening up and adding your own embellishments, or even improvise new lyrics and rhythms for a brand new take on a classic song."
    },
    {
      "title": "Get into it.",
      "content": "Get into it. Really put all of yourself into your singing! That intensity of feeling will show. Impressive singing is not always about hitting the notes, but wringing life out of them. Michael Jackson's own style was more noteworthy for its soulfulness than for its classical proficiency. Give it all you've got. Even get up and dance, if the music moves you. If you want to become a great performer, you've got to start with the man in the mirror. [1] X Research source It may not always seem like it, but singing can be a physically stressful activity after a while. Don't get so into it that you damage your voice. Remember to have fun! Music should be about being moved and spreading that feeling, so relax and enjoy yourself."
    },
    {
      "title": "Practice regularly.",
      "content": "Practice regularly. Devote some time every day to practice singing along to Michael Jackson's music and hone your technique. You don't have to get too formal with it—sing in the car, in the shower or while watching TV and just have fun with it. Singing is like any other skill, so the more you practice the better you'll get. [2] X Research source Unlike other activities, practicing singing is something you can do every day, even while you're doing other things! Learn to sing MJ's songs the way he sang them, then branch out and make use of your own unique vocal range and rhythm. Start with songs like \"Will You Be There\" for more traditional singing style, then move on to more difficult songs like \"Dirty Diana\" or \"Beat It.\""
    },
    {
      "title": "Hire a vocal coach.",
      "content": "Hire a vocal coach. If you're serious about becoming a better singer, consider hiring a vocal coach. These are professional music teachers who specialize in analyzing voices and devising methods for vocal improvement. A good vocal coach means a good ear to give you feedback about your technique and help take your singing to the next level. [3] X Research source This option can be a great benefit to your voice but comes with considerable expense. You should probably only hire a vocal coach if you're a dedicated singer seeking to refine your craft and have the necessary funds. It is not a requirement to work with a vocal coach in order to become a talented singer. Many of today's most popular artists are self-trained. If you learn the right methods and practice hard, your singing will improve. If you're already an intermediate singer, doing classical or operatic training might be a good option."
    },
    {
      "title": "Do voice exercises.",
      "content": "Do voice exercises. In addition to simply singing for practice, look up some voice warm-ups and exercises you can incorporate into your daily routine to improve your voice quality and efficiency. Voice exercises often consist of playful range modulation sequences and quick nonsensical phrases designed to fine-tune enunciation, projection and tonal accuracy. Doing voice exercises systematically is the equivalent of an archer practicing drawing a bowstring, or a basketball player drilling free throws. [4] X Research source An example of a common voice exercise used by choir singers during their warm-up is to repeat a sententious line, often packed full of assonance and alliteration, like \"mommy made me mash my M&Ms,\" singing your way up and down the scale and hitting a higher octave on each recitation. Since Michael Jackson's music was sung in a wide variety of ranges, you should also structure your voice exercises to be able to move through different ranges. Songs like \"Wanna Be Startin' Somethin'\" will make great voice exercises in themselves because of their rapid changes in rhythm and tone. Think of singing like Yoga. It’s all about flexibility. And just like in yoga, the more flexible you are, the more you can push yourself, but if you're just starting, you're not going to try to reach your leg behind your head and pull. So, the more flexible you are, the more that your voice can stretch and the more you're able to do."
    },
    {
      "title": "Take care of your voice.",
      "content": "Take care of your voice. Your voice is like a car's engine. It requires rigorous care and maintenance to be able to perform at top capacity. Be careful about singing out of your natural range and avoid dehydration, loud shouting or anything else that might put unnecessary strain on your voice. Give yourself a break from singing once a week or so to allow your vocal cords to fully recover. [5] X Research source Be sure to drink plenty of water before singing for long periods. The moisture will help make your voice supple and protect the tissue in and around your vocal cords from damage. If your throat becomes strained or sore from singing, sip warm tea, gargle mild salt water or use cough drops to soothe the discomfort and use your voice as little as possible to give it a chance to heal."
    },
    {
      "title": "Learn to sing tenor.",
      "content": "Learn to sing tenor. Study the tenor voice and work on fitting your voice to the appropriate range. Tenor is the highest male voice in classical singing and fell within Jackson's natural range once he got older. Tenor can be tough to hit and maintain, even for girls, so it will require a sharp ear and plenty of training before you can add it to your vocal repertoire. [6] X Research source Listen to recordings of famous tenor singers to get an idea of what a strong natural tenor voice sounds like. One good way to practice singing in the tenor voice is by using a keyboard or piano and singing notes from Upper 'C' down to Lower 'C.' By the time Jackson matured, his natural range had dropped to high tenor. This can be heard in his most famous songs, including \"Thriller\" and \"Man in the Mirror.\""
    },
    {
      "title": "Practice singing soprano.",
      "content": "Practice singing soprano. Study the soprano voice and begin practicing basic notes. Soprano is the highest vocal pitch and one of the most technically difficult to sing. Jackson learned to sing in the higher registers as a boy in the Jackson 5 and expanded his range as he got older. [7] X Research source Normal soprano range extends from Middle 'C' to High 'A,' making it the highest vocal range. As such, soprano is ordinarily sung by females; men who can sing in soprano voice boast especially impressive range. Don't worry if you have trouble settling into the soprano voice. It might take some time to train your voice to properly hit a higher register, or it might simply be out of your natural range. This is okay. Expanding your range is a good focus in voice training, but you should know your limits and always stick within a comfortable natural range. Jackson most famously sung in a soprano voice as a child in Jackson 5 songs like \"I Want You Back\" and \"I'll Be There.\""
    },
    {
      "title": "Try to sing falsetto.",
      "content": "Try to sing falsetto. Add some falsetto to your singing style. Falsetto is not so much a proper voice as a technique that allows the singer to hit much higher notes than they otherwise could in their natural voice. It was a favorite technique of MJ's: he was even known to sing entire songs in falsetto. Practice working your way into the falsetto \"voice\" by changing your point of projection upwards from the diaphragm to the top of the throat and nose. If you're unsure of how to project in a falsetto voice, try talking in a high-pitched cartoon character voice or \"wooing\" like you would a concert or sporting event. The same muscle groups used to generate these noises come into play when singing falsetto. The sound should feel like it's coming out from the center of your head, not from your lower throat or diaphragm. Falsetto was a technique very commonly utilized by Michael Jackson. Songs like \"Billie Jean\" and \"Smooth Criminal\" all feature prolonged sections of falsetto vocalization."
    }
  ]
}