{
  "url": "https://www.wikihow.com/Overcome-Anxiety",
  "title": "How to Overcome Anxiety",
  "steps": [
    {
      "title": "Understand and acknowledge that you are anxious.",
      "content": "Understand and acknowledge that you are anxious. Do not start beating yourself up about it, or tell your self unhelpful things such as \"I will never be able to get out of this\" or \"I am incapable.\" Understand that you can overcome this, and you will. [1] X Research source"
    },
    {
      "title": "Identify the source of your anxiety.",
      "content": "Identify the source of your anxiety. [2] X Research source Whether you have a panic attack or a sudden bout of worry and fear, it is important to determine what is causing your anxiety. Is something in your environment the primary source? Is a possible mishap the origin? Is an impending activity, meeting, or event the cause? You can handle a fear much easier when you are clear about what it is. [3] X Research source"
    },
    {
      "title": "Determine if your worry is solvable.",
      "content": "Determine if your worry is solvable. If you know what your fear is, the next step is to determine if it is something you can deal with, or something that only time (or your imagination) can manage. [4] X Research source If your fear is largely imagination or can’t be dealt with now, then make the conscious effort to put it out of your mind. If your worry is something that needs to be dealt with, then take steps to create a course of action. [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source What can you do to lessen this fear or worry? Is this a long term or a short term fix? What can I do to prevent this worry or fear from recurring?"
    },
    {
      "title": "Consider the worst.",
      "content": "Consider the worst. If your fear is mind-consuming, take a moment to think about the honest and absolute worse thing that could happen as a result of it. Perhaps you’re getting ready to do a huge presentation, and you begin to panic. Stop and think “what is the worst that could happen?” No matter how creative your response may be, thinking critically will lead to find that should it occur, there are few endings that can’t be dealt with in a reasonable manner."
    },
    {
      "title": "Accept uncertainty.",
      "content": "Accept uncertainty. [6] X Research source It can be tough to stop worrying when you’re never quite sure how a scenario will play out. At this point, it is important to simply accept the ever-present fact of uncertainty. We can’t know how something will go, or what the ending may be; worrying about the unknown is an unnecessary source of fear that can be avoided with the simple acceptance of chance."
    },
    {
      "title": "Consider the use of your worry.",
      "content": "Consider the use of your worry. You are worried for a reason - anxiety is a fear response to a real or imagined scenario. Problems arise when we begin worrying about things that don’t actually cause us danger. So, think about the purpose of your worry. Is it helpful? If you’re afraid of a legitimately dangerous situation, then your worry is being put to good use. If however, you are anxious without a purpose, then your worry has the best of you. Remembering that can help to bring you down off of an anxiety high. [7] X Research source If you feel like worrying is useful but it's still taking over your life, try setting aside a specific time each day as your worry time. Then, if you start worrying outside of that time, write down whatever you're thinking about in a notepad or on your phone. [8] X Expert Source Chloe Carmichael, PhD Licensed Clinical Psychologist, Author of Nervous Energy Expert Interview."
    },
    {
      "title": "Focus on both the positive and the negative.",
      "content": "Focus on both the positive and the negative. When you are anxious about something, it can be incredibly easy to see only the negative aspects of it. As with all things though, there must be a positive facet to your fear-filled situation as well. Don’t focus on a single negative event while completely ignoring other related positives ones at the same time. [9] X Research source Try making a list of positive things you can focus on instead of worrying. Then, when you start feeling anxious, choose one of the things on that list to think about instead. [10] X Expert Source Chloe Carmichael, PhD Licensed Clinical Psychologist, Author of Nervous Energy Expert Interview."
    },
    {
      "title": "Avoid thinking in terms of \"all or nothing.",
      "content": "Avoid thinking in terms of \"all or nothing. \" No matter what situation is about to go down, it’s unlikely that the outcome is completely black or white. Don’t allow yourself to ignore gray areas and overdramatize something. For example, assuming that if you don’t get accepted to a particular college, you’re a total failure and nobody will want you. This type of thinking is common with anxiety, but is also totally irrational. [11] X Research source"
    },
    {
      "title": "Don’t make it into a catastrophe.",
      "content": "Don’t make it into a catastrophe. If your fear is of something non-dangerous and possibly even imagined, one of the surefire ways to make it worse is to turn it into a catastrophe. If you’re anxious about flying on a plane, and at the first sign of turbulence turn it into a crash, you are making your anxiety worse. See every situation as it really is, rather than what it could be."
    },
    {
      "title": "Try not to jump to conclusions.",
      "content": "Try not to jump to conclusions. If you lack facts and have yet to experience your worry or fear, then jumping to conclusions about what might happen will do you no good. If an uncertainty lays before you, you can reduce your anxiety by realizing (and admitting) that you don’t know what may happen. Consider all possible outcomes, rather than jumping to the most morbid or unlikely. [12] X Research source"
    },
    {
      "title": "Don’t let your emotions control your reasoning.",
      "content": "Don’t let your emotions control your reasoning. [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source When you’re scared and anxious, it is easy to let emotions get in the way of logic. Your emotions will do just that though, and they will fool you into thinking you are in more danger than you really are. Don’t let your fear convince you are in danger, unless you really are. The same goes with all negative anxiety-based emotions, including stress, guilt, and embarrassment. [14] X Research source"
    },
    {
      "title": "Avoid making everything personal.",
      "content": "Avoid making everything personal. When anxiety strikes, don’t allow it to force you to take blame for a situation outside of your control. If you’re anxious and scared because your house was broken into, it may be easy to take it personally and blame yourself for the break-in. This type of thinking is illogical though, and will make you feel worse. Unless you invited thieves knowingly into your home, you can’t be held accountable for the robbing they did."
    },
    {
      "title": "Breathe deeply.",
      "content": "Breathe deeply. When you get anxious, your breathing quickens, which reduces the amount of oxygen your brain gets. This makes it more difficult to think clearly and form logical reasoning. Take a moment to focus on taking deep belly breaths. Inhale for 4 seconds, hold the breath for 4 seconds, and then release it for 4 seconds. Doing this for 1-2 minutes should help to calm your nerves quickly. If you are confused on where you should be breathing from, put your hands on your stomach. Feel it rise and fall as you breathe. Reader Poll: We asked 841 wikiHow readers who've experienced anxiety, and 55% of them agreed that the best relaxation technique is focusing on breathing. [Take Poll]"
    },
    {
      "title": "Take some time to exercise.",
      "content": "Take some time to exercise. [15] X Research source Whether anxiety has just struck or you are chronically anxious, exercising is sure to help. Physical activity releases endorphins which increase happiness, and reduce cortisol - a stress producing hormone. As soon as you start to feel anxiety hit, go workout or take a walk. Aside from immediate treatment, regular exercise will decrease the amount of anxiety you feel over time. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Meditate or pray.",
      "content": "Meditate or pray. Consciously taking your thoughts off of your stressor and focusing them inwards on something peaceful will reduce your anxiety and fear immensely. When anxious thoughts start to hit, retreat inwards and repeat a positive mantra to yourself or pray. Focus entirely on this, and eventually your anxiety will evaporate on its own. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Keep a healthy diet.",
      "content": "Keep a healthy diet. Although it may seem silly to link your anxiety to what you ate for breakfast, the foods you eat have a big impact on your mental functioning. Studies have shown a correlation between unhealthy eating and high anxiety and stress. Try to incorporate more fruits, veggies, and whole grains into your daily diet. Get tested to make sure you don’t have any food allergies that may be triggering your anxiety as well - a common experience. [18] X Research source"
    },
    {
      "title": "Take a magnesium supplement.",
      "content": "Take a magnesium supplement. Magnesium works in your body to reduce the effects of anxiety from regular worries to panic attacks. If you have a magnesium deficiency, you may be more anxious than you should be. Grab a magnesium supplement from a local health foods store and see if it improves your mood. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Try a herbal remedy.",
      "content": "Try a herbal remedy. [20] X Research source You don’t have to rely solely on chemical filled medications to relieve your anxiety. Instead, try an all-natural herbal remedy. Many scientific studies have shown a strong correlation between reduced anxiety and taking supplements of St. Johns wort, valerian root, and chamomile. Try one of these supplements before heading for heavier medications. [21] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Visit a therapist.",
      "content": "Visit a therapist. If your anxiety is so strong that you can’t seem to overcome it, there is no shame in going to a professional. The same way that you wouldn’t question the intelligence of visiting a medical doctor for an injury, it is similarly healthy to go to a psychologist for emotional and mental wellbeing. If you experience chronic anxiety or recurrent panic attacks, you may have a psychiatric diagnosis that can be easily dealt with through specialized therapy or medication. [22] X Research source Talk to your doctor about the different types of medications used to treat anxiety. SSRIs and SNRIs are antidepressants sometimes prescribed for anxiety; SSRIs help boost serotonin, while SNRIs increase norepinephrine and serotonin. Other medications used to treat anxiety include benzodiazepines and beta-blockers."
    }
  ]
}