{
  "url": "https://www.wikihow.com/Program-Genie-Garage-Door-Opener",
  "title": "Programming Guide: Genie Garage Door Openers",
  "steps": [
    {
      "title": "Remove the battery protector from the remote.",
      "content": "Remove the battery protector from the remote. If you see a small strip sticking out of the tip of the remote, this is the battery protector. Simply pull it out to activate the battery. This method will work with Intellicode II models. This includes Genie IntelliG, TriloG, SilentMax, PowerMax, GPower, and PowerLift Series Openers, with the model numbers 4024, 3024, 4042, 3042, 4022, 3022, and 4064, 3064, 4062, 3062, 2564, 2562. You can find the model number on the bottom of your garage door opener's motor cover."
    },
    {
      "title": "Press and hold the square button on the garage door opener.",
      "content": "Press and hold the square button on the garage door opener. This is the program button. Press and hold this button until the round blue LED light comes on. Then release the square button. The long purple LED should start flashing. You may need a ladder to reach the buttons on the bottom of the garage door opener. If you have an Intellicode 3 model, press and Program button once again. The Purple LED light should start blinking."
    },
    {
      "title": "Press the button on the remote you want to use.",
      "content": "Press the button on the remote you want to use. The remote has three buttons that allow you to program three garage door openers to a single remote. Press the button on the remote you want to use for this garage door opener. The long LED flashing purple should turn solid. Make sure you hold the remote 4 or 5 feet (1.2 or 1.5 m) away from the garage door opener when programming it. You have 30 seconds to press the button on the remote for each step. If the long LED light on the garage door opener turns red, you have run out of time and need to start over."
    },
    {
      "title": "Press the button on the remote again.",
      "content": "Press the button on the remote again. Press the same button on the remote. The long, round LED lights on the garage door opener should flash blue and then turn off."
    },
    {
      "title": "Press the button on the remote again.",
      "content": "Press the button on the remote again. This time, the garage door should open or close. If so, your remote has been successfully programmed and is ready to go. If it does not open or close, press the button a few more times. If the garage door does not open or close, repeat these steps again. [1] X Research source"
    },
    {
      "title": "Open the cover halfway and enter the program code.",
      "content": "Open the cover halfway and enter the program code. After entering the program code, slide the cover all the way open until it latches. The program code for different garage door opener models are as follows: GPWK-12: Press # + 8 Intellicode Model GWKIC, ACSDG: Press PROG + 8 while the cover is fully open. Intellicode Model GWKP: Press and hold # + 6 + Up/Down Arrows . GK-BX Wireless Intellicode: Press and hold the Program Key + Up/Down Arrows ."
    },
    {
      "title": "Enter 3 5 7 and press # or Prog.",
      "content": "Enter 3 5 7 and press # or Prog . This is the default factory PIN for the keypad."
    },
    {
      "title": "Enter your PIN number and press # or Prog.",
      "content": "Enter your PIN number and press # or Prog . This is the personal PIN number that you will use to open the garage door. It can be any number that is 3 to 8 characters."
    },
    {
      "title": "Press and hold the Program button on the garage door opener (Intellicode 2 & 3 only).",
      "content": "Press and hold the Program button on the garage door opener (Intellicode 2 & 3 only). If have an Intellicode 2 or 3 system, press and hold the square button on the garage door opener until all LEDs turn blue. Then release the program button. You should see the oval LED start flashing purple. If your keypad does not have \"Intelicode\" printed on the front, you will need to enter a door code that is determined by the internal transmitter. Consult the user's manual or manufacturer's web page to learn how to determine the door code."
    },
    {
      "title": "Enter the PIN and press ▲▼ several times (Intellicode 2 & 3 only).",
      "content": "Enter the PIN and press ▲▼ several times (Intellicode 2 & 3 only). While the purple light is flashing, enter your new PIN into the keypad and then press the Up/Down button several times until the garage door opens. If you have a Liftmaster or Sears Craftsman wireless keypad, press the Enter key instead."
    },
    {
      "title": "Close the cover.",
      "content": "Close the cover. You should see the lights flash on the keypad after programming your keypad. If the lights do not flash, it isn't programmed correctly."
    },
    {
      "title": "Test the keypad.",
      "content": "Test the keypad. Enter your PIN into the keypad and press the Up/Down or Star key to test the keypad and make sure it is working properly. [2] X Research source"
    }
  ]
}