{
  "url": "https://www.wikihow.com/Sign-Up-for-Free-Amazon-Prime-Student-Version",
  "title": "Join or Switch to Amazon Prime Student: Eligibility & More",
  "steps": [
    {
      "title": "Navigate to the Amazon website.",
      "content": "Navigate to the Amazon website . If you don't have an Amazon account yet, you can create one now to begin your Amazon Prime Student membership. If you already have an Amazon account, you can proceed to Signing Up for Prime Student on Desktop or Signing up for Prime Student on Mobile ."
    },
    {
      "title": "Click Accounts & Lists in the top-right corner.",
      "content": "Click Accounts & Lists in the top-right corner. This will be underneath Hello, sign in and next to Returns & Orders . You will be redirected to the login page."
    },
    {
      "title": "Click Create your Amazon account.",
      "content": "Click Create your Amazon account . This will be underneath New to Amazon? in a grey button."
    },
    {
      "title": "Enter your details.",
      "content": "Enter your details. You will need to fill out Your name , Mobile number or email , and Password . Your mobile number or email will be used to sign into your account. Make sure to create a secure password ."
    },
    {
      "title": "Click Verify email.",
      "content": "Click Verify email . To verify your email, Amazon will send a One Time Password to the email used. Be sure to check your email's spam folder if you can't locate the email."
    },
    {
      "title": "Enter the OTP.",
      "content": "Enter the OTP. If you haven't received the OTP, click Resend OTP below the form."
    },
    {
      "title": "Click Create your Amazon account.",
      "content": "Click Create your Amazon account . Your Amazon account will be created. You can now begin to buy on Amazon and leave reviews on purchases . In addition to the Prime membership, you can apply for an Amazon credit card ."
    },
    {
      "title": "Log into Amazon on your web browser.",
      "content": "Log into Amazon on your web browser. You'll need an Amazon account to join Prime Student."
    },
    {
      "title": "Navigate to the Amazon Prime Student homepage.",
      "content": "Navigate to the Amazon Prime Student homepage. You'll be able to see your complete benefits before you sign up."
    },
    {
      "title": "Click Try Prime Student.",
      "content": "Click Try Prime Student . This will be an orange button. You'll be redirected to an eligibility form."
    },
    {
      "title": "Enter your details.",
      "content": "Enter your details. All fields are required. You'll need to input your University , First name , Last name , Date of Birth , and Graduation Year . To use your .edu email instead, click Click here to signup using your.edu email . You can find this below the form. You'll need to add a Payment method and Billing address ."
    },
    {
      "title": "Click Start your 6-month trial.",
      "content": "Click Start your 6-month trial . You can find the terms and conditions below the button. You cannot enroll in Prime Student more than once per account. If you had an existing Prime Student membership active in the past, you won't be able to sign up again. After your 6-month free trial, you will be automatically updated to a regular Prime Membership at half the cost for up to four years. When your four years are over, you will be charged for Amazon Prime at full cost. You can always sign up for Prime at any time."
    },
    {
      "title": "Log into Amazon on your mobile web browser.",
      "content": "Log into Amazon on your mobile web browser. You can use Safari, Google Chrome, Mozilla Firefox, or another mobile browser. You cannot sign up using the Amazon app. You'll need to use the Amazon website on a mobile web browser."
    },
    {
      "title": "Navigate to the Amazon Prime Student homepage.",
      "content": "Navigate to the Amazon Prime Student homepage. You'll be able to see your complete benefits before you sign up. Alternatively, you can search Prime Student in the search bar to be taken to the Prime Student page. Tap Sign up for Prime Student ."
    },
    {
      "title": "Tap Try Prime Student.",
      "content": "Tap Try Prime Student . This will be an orange button. You'll be redirected to an eligibility form."
    },
    {
      "title": "Enter your details.",
      "content": "Enter your details. All fields are required. You'll need to input your University , First name , Last name , Date of Birth , and Graduation Year . To use your .edu email instead, tap Click here to signup using your.edu email . You can find this below the form. You'll need to add a Payment method and Billing address ."
    },
    {
      "title": "Tap Start your 6-month trial.",
      "content": "Tap Start your 6-month trial . You can find the terms and conditions below the button. Your 6-month trial for Prime Student will begin. When the trial ends, you'll be charged for Prime Student, which is half the cost of regular Prime. After a four-year period, you will be upgraded to regular Prime at its normal rates."
    },
    {
      "title": "Log into Amazon.",
      "content": "Log into Amazon . If you don't want to keep your Amazon Prime Student membership, you can cancel Prime at any time."
    },
    {
      "title": "Click Account & Lists in the top-right corner.",
      "content": "Click Account & Lists in the top-right corner. This will be next to Returns & Orders ."
    },
    {
      "title": "Click Prime.",
      "content": "Click Prime . You'll be redirected to your Prime benefits and payment settings."
    },
    {
      "title": "Under \"Manage\", click Update, cancel and more.",
      "content": "Under \"Manage\", click Update, cancel and more . This will open a drop-down menu."
    },
    {
      "title": "Click End membership.",
      "content": "Click End membership . You will be taken to a new page."
    },
    {
      "title": "Click Cancel My Benefits.",
      "content": "Click Cancel My Benefits . You can also choose Remind Me Later to keep your benefits and send a reminder three days before membership renewal, or Keep My Benefits to stop the cancellation process. This will end your Amazon Prime membership. You'll be able to restart your Prime membership whenever you'd like."
    }
  ]
}