{
  "url": "https://www.wikihow.com/Send-Pictures-to-a-Cell-Phone",
  "title": "6 Simple Ways to Send Pictures to a Cell Phone",
  "steps": [
    {
      "title": "Download and install the Nearby Share app on your Windows PC.",
      "content": "Download and install the Nearby Share app on your Windows PC. It can be downloaded from the Android Nearby Share for Windows Website ."
    },
    {
      "title": "Sign in with your Google Account.",
      "content": "Sign in with your Google Account. By signing in with your Google Account, you can sync your Google Contacts and change discoverability settings to only be visible to your contacts or only to your own devices. You can also opt to not use an account. You can also follow these steps to transfer images from one Android smartphone to another nearby Android smartphone! If you're initiating the Nearby Share on your phone, you can simply tap \"Nearby Share\" on the photo in your phone's gallery app. If the receiver is an Android smartphone as well, they only need to accept the file when you tap their phone's name in the \"Nearby Share\" list."
    },
    {
      "title": "Choose a device name.",
      "content": "Choose a device name. This device name will be used to identify your device and it will be visible to other people."
    },
    {
      "title": "Choose device discoverability settings.",
      "content": "Choose device discoverability settings. On the setup page, click on the option inside the \"Receiving\" box to select who will be capable of discovering your device via nearby share. You can opt to be visible to Everyone, only to your Contacts (contacts from your Google Account), only to your devices (requires a Google Account), or to no one."
    },
    {
      "title": "Go back to the setup page and click Done.",
      "content": "Go back to the setup page and click Done . You can choose to help improve the app by allowing the app to automatically send usage info and crash reports to Google."
    },
    {
      "title": "Allow Bluetooth and Wi-Fi access.",
      "content": "Allow Bluetooth and Wi-Fi access. Nearby Share requires both Bluetooth and Wi-Fi."
    },
    {
      "title": "Drag and drop pictures to Nearby Share app on your Windows PC.",
      "content": "Drag and drop pictures to Nearby Share app on your Windows PC. The Nearby Share app will start looking for nearby devices."
    },
    {
      "title": "Wait for the \"Device nearby is sharing\" notification on your Android.",
      "content": "Wait for the \"Device nearby is sharing\" notification on your Android. Turning on Wi-Fi and Bluetooth and connecting your Android device to the same Wi-Fi network with your computer can speed up the process."
    },
    {
      "title": "Tap the notification or manually change the visibility of your Android Phone.",
      "content": "Tap the notification or manually change the visibility of your Android Phone. Tapping the notification will launch Nearby Share on your Android and make the phone visible to everyone temporarily. You can also change this on the Nearby Share settings on your Android device and set up visibility to only your contacts or to your own devices."
    },
    {
      "title": "On the Nearby Share app on your PC, click your Android cell phone.",
      "content": "On the Nearby Share app on your PC, click your Android cell phone."
    },
    {
      "title": "Accept the file on your phone.",
      "content": "Accept the file on your phone. Once you tap the button, the file will be downloaded onto your phone."
    },
    {
      "title": "Make sure the receiving device has AirDrop on.",
      "content": "Make sure the receiving device has AirDrop on . You can use AirDrop to send pictures to an iPhone from any Apple device, including your Mac, iPad, or another iPhone, if both devices are within Bluetooth and Wi-Fi range. On the iPhone that's receiving the photos: Open Settings and tap General . Tap AirDrop . If the person sending the photos from their Mac, iPhone, or iPad is in your contacts list, you can enable Contacts Only . If not, choose Everyone. [1] X Research source Also, ensure that Bluetooth and Wi-Fi is enabled on both devices. If either device has a Personal Hotspot turned on, disable it ."
    },
    {
      "title": "Open the Photos app on the device sending the photos.",
      "content": "Open the Photos app on the device sending the photos. For example, if you want to send photo from a Mac to an iPhone, open the Photos app on your Mac."
    },
    {
      "title": "Click or tap the photo you want to share.",
      "content": "Click or tap the photo you want to share. This opens a larger version of the photo. Alternatively, you can select multiple photos. To select multiple photos on a Mac, hold down the Command key as you click each photo. To select multiple photos on an iPhone or iPad, tap Select at the top-right corner of the All Photos tab, then tap each photo you want to send."
    },
    {
      "title": "Click or tap the Sharing icon .",
      "content": "Click or tap the Sharing icon . This share icon looks like a square with an arrow pointing up. You'll see it in the lower-left corner of your screen on an iPhone or iPad, and in the top toolbar on a Mac. [2] X Research source"
    },
    {
      "title": "Click or tap AirDrop.",
      "content": "Click or tap AirDrop . A list of nearby devices will appear."
    },
    {
      "title": "Click or tap the iPhone to which you want to send the photos.",
      "content": "Click or tap the iPhone to which you want to send the photos. If the other device (Mac, iPhone, or iPad) has Bluetooth and Wi-Fi enabled and is in range, you should see it listed here. The receiving device will get a pop-up with that picture that you are sending via AirDrop."
    },
    {
      "title": "Open your email program or website on a PC or Mac.",
      "content": "Open your email program or website on a PC or Mac. You can easily attach photos to an email message to send them to a cell phone. For example, if you have a Gmail address , you can go to https://www.gmail.com on your computer. Alternatively, if you have Facebook Messenger on the device you're sending photos from and the cell phone receiving the photos, you can easily attach photos in Facebook Messenger ."
    },
    {
      "title": "Compose a new message.",
      "content": "Compose a new message. On your computer, create the message that you want to send along with the photos."
    },
    {
      "title": "Attach the images.",
      "content": "Attach the images. Click the \"Attachments\" button, which often looks like a paperclip, and then browse for the images you want to attach . Most email services support sending up to 20 MB, which is usually about 5 images per message."
    },
    {
      "title": "Enter the recipient.",
      "content": "Enter the recipient. If you're sending the photos to your own cell phone, you can enter your own email address. Alternatively, enter the email address of the person who should receive the photos. MMS - If you want the message to be sent as an MMS message to the cell phone, use the recipient's MMS address."
    },
    {
      "title": "Send the message.",
      "content": "Send the message. You may have to wait a few moments for the images to upload to your mail server and another few moments for the message to be delivered."
    },
    {
      "title": "Open your email or the MMS message on your cell phone.",
      "content": "Open your email or the MMS message on your cell phone. If you're sending the images to yourself, the message should arrive in a few moments. To receive an MMS message, you will need to have a cellular data connection."
    },
    {
      "title": "Save the images.",
      "content": "Save the images. The process varies depending on your phone, but generally, you can press and hold an open image on your screen or tap the Menu button and choose to save it to your phone. Repeat this for each of the images in the message. Using text messages or email is a great way to send pictures from an Android to iPhone or from an iPhone to an Android."
    },
    {
      "title": "Open the picture that you want to send.",
      "content": "Open the picture that you want to send. If you're sending photos from an iPhone, open the Photos app and select the photo. On an Android, you can use your phone's Gallery app or Google Photos."
    },
    {
      "title": "Tap the \"Share\" button.",
      "content": "Tap the \"Share\" button. [3] X Research source This looks different depending on the phone and version that you are using."
    },
    {
      "title": "Select an app to share with.",
      "content": "Select an app to share with. There are several options to choose from, depending on the apps you have installed on your phone: You can select your text messaging app to attach the selected photo to an MMS, RCS, or iMessage . Choose your email app to attach the photo to an email message . Other apps: There will be a variety of other options listed based on what you have installed, including Facebook Messenger , WhatsApp , and more."
    },
    {
      "title": "Choose a recipient and send the message.",
      "content": "Choose a recipient and send the message. Depending on the method you chose, you'll need to finalize the message that will go along with the image. The message may take a few moments to send if you're sending multiple images."
    },
    {
      "title": "Move the images you want to transfer into one folder.",
      "content": "Move the images you want to transfer into one folder. You can have multiple subfolders in the folder, but having them all in one place will make it much easier to add the images to your iPhone."
    },
    {
      "title": "Connect your iPhone to your computer using a USB cable.",
      "content": "Connect your iPhone to your computer using a USB cable."
    },
    {
      "title": "Open iTunes (Windows) or Finder (Mac).",
      "content": "Open iTunes (Windows) or Finder (Mac). You'll need to use Finder instead of iTunes for macOS Catalina and newer. [4] X Research source"
    },
    {
      "title": "Click the Device button or select your iPhone.",
      "content": "Click the Device button or select your iPhone. If you're using iTunes, click the picture of an iPhone next to the menu at the top of iTunes. On a Mac, click your iPhone in the left panel. [5] X Research source You will also be asked to trust the computer on your iPhone's screen."
    },
    {
      "title": "Select the Photos option in the left panel.",
      "content": "Select the Photos option in the left panel."
    },
    {
      "title": "Select \"Sync Photos.\"",
      "content": "Select \"Sync Photos.\" You can now choose an album or a folder to sync."
    },
    {
      "title": "Select the folder with the pictures you want to transfer.",
      "content": "Select the folder with the pictures you want to transfer. You can select multiple folders if you'd like."
    },
    {
      "title": "Click Apply.",
      "content": "Click Apply . If syncing doesn't start right away, click Sync to sync the photos to your phone now. [6] X Research source"
    },
    {
      "title": "Install Android File Transfer if you have a Mac.",
      "content": "Install Android File Transfer if you have a Mac. If you have a Windows PC, you won't need to install anything special to send photos from your PC to an Android phone. [7] X Research source On a Mac, go to https://www.android.com/filetransfer/ and click Download . Then, follow these instructions to install: Double-click the file you downloaded. Drag Android File Transfer to Applications . Once installed, open Android File Transfer . The app will open on its own the next time you connect your Android to your Mac, but you'll need to launch it manually at first."
    },
    {
      "title": "Connect your Android phone to your computer with a USB cable.",
      "content": "Connect your Android phone to your computer with a USB cable. If you are using Windows, the Autoplay window will usually appear. If you are using a Mac, your should now see your Android in Android File Transfer."
    },
    {
      "title": "Tap Charging this device via USB on your Android.",
      "content": "Tap Charging this device via USB on your Android. A list of options will appear."
    },
    {
      "title": "Tap File Transfer under \"Use USB for.\"",
      "content": "Tap File Transfer under \"Use USB for.\" This allows you to send photos and other files from your computer to your Android. A file transfer window will expand on your PC or Mac's screen. [8] X Research source"
    },
    {
      "title": "Drag the photos you want to send to your Android.",
      "content": "Drag the photos you want to send to your Android. Navigate to the folder on your computer to which you've saved the photos, and drag each photo to your Android. As you drag photos, they'll be sent to your Android instantly."
    },
    {
      "title": "Disconnect your Android when finished.",
      "content": "Disconnect your Android when finished. If you're using Windows, eject your Android before unplugging it from your PC. On a Mac, you can simply unplug it once you've transferred the photos."
    }
  ]
}