{
  "url": "https://www.wikihow.com/Put-Together-Outfits",
  "title": "How to Put Together Outfits",
  "steps": [
    {
      "title": "Organize your closet.",
      "content": "Organize your closet. A lot of times when we don't know what to wear or how to put together an outfit it means that it is time to organize our closet. Organizing means it will be easier to locate the clothes you want for the outfits you'll be putting together and it will remind you what you own in way of clothing. Get rid of anything you almost never wear. There is no point in keeping around something you wear only once or twice. Make space for the items you will wear. Make a rule for yourself: every 6 months clean out your wardrobe. The stuff you just can't throw away, put in storage and if in the next 6 months you haven't looked for it, to charity or friends it has to go. When you're organizing you want to make sure that you will have easy access to your clothes. An easy way of organizing them is by item, so all the t-shirts together, all the sweaters together, all the dresses together, and so on. It makes it easier to find them when you know where the items of clothing will be. And if you organize them by color it's a win-win situation for you. [1] X Expert Source Kathi Burns, CPO速 Board Certified Professional Organizer Expert Interview. 31 December 2019."
    },
    {
      "title": "Make sure you have essential wardrobe tops.",
      "content": "Make sure you have essential wardrobe tops. You'll need a few basic tops that are the foundation of your wardrobe. These tops should be versatile and trend-proof. It's best for your basic wardrobe components to be in neutral colors like black, navy blue, white, and ivory so that you can mix and match them easily. [2] X Expert Source Kathi Burns, CPO速 Board Certified Professional Organizer Expert Interview. 31 December 2019. The best is to stick to more classical designs than to follow every season trend. Get a scarf or some jewelry that represents the season. Accessories can be an easy and cheap way to make the same outfit look different every day of the week. Casual tops: these are tops like short and long sleeve t-shirts, camisoles and tank tops (which are particularly good for under sweaters). Invest in good quality and simple colors. A few dressy blouses. Blouses can be worn under blazers or button-down cardigans. They can give a good bit of class to an outfit. Wear them with jeans, with a skirt and boots, or with jewelry. You'll want to add some sweaters, button-down cardigans, or pullovers in neutral colors to wear with your casual tops and blouses. They are really good for layering purposes, especially if you live in a climate that runs warm and cold on the same day. Simply dress up as an \"onion\", in layers: t-shirt, blouse, light cardigan, scarf, jacket, etc. Good basic jackets to have are a plain black leather jacket, a neutral peacoat, a lightweight neutral trench coat, and a blazer. Blazers especially can be worn on their own in mild, spring-type weather or they can be worn with something like a peacoat. (A peacoat is a rough woolen jacket that has a row of buttons on either side, but only buttons on one side. You can sometimes see them on doormen for hotels.)"
    },
    {
      "title": "Make sure you have essential wardrobe bottoms.",
      "content": "Make sure you have essential wardrobe bottoms. These are the jeans and trousers and skirts that make up the basis of what you'll wear with the tops. Again, you'll want to go for neutral colors and styles that won't change with every fashion. Trousers: you'll want a couple of pairs of jeans (a basic pair that you can dress up or down, and a casual pair that's for down house projects and lounging around), some neutral dressier trousers. For colder areas, a thick tweed is a good fabric for dressier trousers. It's best to choose straight or boot-cut jeans in dark blue, works perfectly with pumps or heels when you need a casual outfit. Every wardrobe must have black tailored trousers. You will wear them more than you think. Skirts: having a tailored skirt and a casual skirt is good for your wardrobe. There are nice pencil skirts and more fitted skirts which are 'tailored' skirts, or the more floaty, knee-length spring skirts that are good for your more casual needs. If you have a pear-shaped figure, invest in an A-line, tailored skirt; it will compliment your figure and will work with nearly every sweater, blouse, or jacket. It will look good with pumps or boots too. Dresses: having some basic, neutral dresses can be a good basis for any outfit. The reason the little black dress is such a closet staple is that it is so versatile. You can dress it up or down and black, of course, goes with everything. If you're not into black, find a simple dress in navy, white, or ivory. Black dresses come in so many different styles and shape that once you find the right one they will become your second skin. Even for summer dresses, you can stick with the same style of dress just in brighter colors. It's handy to find a good tailor to make needed alterations so you can have the best dresses possible."
    },
    {
      "title": "Gather accessories.",
      "content": "Gather accessories. Accessories especially can add an individual element to your wardrobe without overwhelming you. Belts, jewelry, handbags, scarves, and hosiery are great in neutral colors as well as funkier, brighter styles. A bright scarf with a black t-shirt and fitted jeans can be a fun, easy outfit. You don't have to invest a lot but you will still look great and stylish. Handbags: if you have a specific color palette, (like you tend to wear greens and blues and grays) grab a handbag in a complementary color (like a mustard yellow, or gold), to add a little spice to your ensemble. Make sure that your handbag is functional too. A good idea is to have one main bag that you use every day (one in neutral colors so that it goes with your different outfits) and a range of bags that you use for more specific occasions, like going to a concert or going out to a fancy restaurant. Jewelry: jewelry is very much according to individual preference. You'll need to figure out what you like and work with that. Maybe you prefer chunkier, geometric jewelry, or pearls. Jewelry can be used as a highlight to your outfit or can be the highlight of your outfit depending on your specific style. Belts: the best basic kinds of belts are wide and skinny belts. If you get them in neutral or complementary to your wardrobe colors they can make a great addition. Wide belts especially look good on just about everyone as long as you find the right size. If your outfit is looking boring slip on a skinny belt to add a little fun. Scarves: these are both functional (they can be warm and cozy) and great fashion statements. Getting a few neutral scarves is a great idea, but you can also mix it up with patterns you like and bright colors. Hosiery: these include tights, leggings, and socks. Get some sheer black or nude tights to wear with skirts and dresses. Get leggings in neutral colors and get socks that go with your shoes (wearing black socks with white flats, for instance, can look a little weird). You can also get some fun hosiery like sparkly silver tights, or galaxy leggings. You could wear them with your little black dress, a nice cardigan, and some exciting earrings."
    },
    {
      "title": "Get versatile shoes.",
      "content": "Get versatile shoes. Shoes are really important to make a fun and comfortable outfit. You'll need a few different styles of basic footwear in your closet to draw from when creating outfits. Different shoes go better with different items of clothing. Something to remember, light colored shoes (especially white ones) can get dirty really fast, so make sure you consider that when picking your shoe color! You should have a pair of classic high heels ( black for winter, fall time and beige for summer, some basic pumps, and boots). Flats are great with jeans, skirts, and dresses. They can be dressy or not depending on the occasion. It's good to have at least one neutral pair (again; neutral colors are good!) and a few that are more exciting, like patent red leather, or shiny silver. Boots, especially in colder places, are very important. You can get some casual black or gray boots, or some fancy heeled ones that you can couple with jeans or a dress. Ankle boots are really good with skinny jeans and with skirts. Casual sneakers for those casual jeans that you have. You can wear these out and about with skirts or use them when you go on a really nice long walk. They're comfortable and you can do housework or yard work in them (you don't want to get your nice things dirty)."
    },
    {
      "title": "Find some key statement pieces.",
      "content": "Find some key statement pieces. These are pieces that are very individual to you. They can be jewelry, hosiery, shoes, scarves, or all of the above. These types of pieces brighten up an otherwise neutral outfit and make it more exciting and more individual. For instance, you could have a brightly colored floral dress that you could wear with black leggings, knee-high black boots, a green cardigan (to match the stems of the flowers on the dress) and a grey scarf. Or you could get really bold and wear the dress with crimson pumps. Another example could be a royal purple blouse that you wear with jeans, to dress it down, or with a black pencil skirt and grey boots."
    },
    {
      "title": "Work around one item.",
      "content": "Work around one item. A good way to make putting your outfit together easier is to pick one item and craft the entire outfit around that item. Usually, the specific item is one of the statement pieces, but it doesn't have to be. Example: If you're looking to showcase a big gorgeous necklace, wear a plain, neutral t-shirt with a neck that's cut so that the necklace can be seen. Pair this with jeans and a pair of flats. This way the necklace acts as the most important part of the outfit with nothing to draw attention away from it. You can also work an outfit around a specific color. [3] X Expert Source Kathi Burns, CPO速 Board Certified Professional Organizer Expert Interview. 31 December 2019. So for instance, one week you could wear something red each day and make outfits around that color and the next week you could move on to the green. For instance, you could pair a red skirt with a black blouse, navy tights, black boots, and blue jewelry."
    },
    {
      "title": "Pick your 'uniform.'",
      "content": "Pick your 'uniform.' This means find the two or three basic ensembles you like to wear and put together outfits using these as bases, while you mix things up a little. These will be the outfits that you feel most comfortable in. For example, you could find that you tend towards an ensemble of skinny jeans (black and denim), a few different t-shirts (both long and short sleeve) with varying footwear (for instance, you could dress the outfit up with a pair of ankle boots or some flats). If you wear a lot of jeans you could mix things up a bit by rolling up the cuffs (a good spring or summer variation). You could vary between jeans and a sweater and skirts and a sweater. This would give you more range. The color and type of sweater could change and you could vary it with different jewelry, scarves, and shoes, but the basic outfit would either be jeans and a sweater or a skirt and sweater."
    },
    {
      "title": "Mix and match.",
      "content": "Mix and match. Mixing and matching clothing is your basis for choosing different outfits each day. This way you don't have to wear the same t-shirt and jeans routine that you always do (although that's perfectly okay if that's what you like). Using a black blazer as an example: you could put the blazer with jeans, a white t-shirt, a bright blouse, and flats. You could pair the blazer with a pale spring skirt, ankle boots, and chunky jewelry. Or you could put the blazer over a long, colorful summer dress and wear sandals. With only 8 different pieces of clothing you can make a variety of outfits. Pick a solid colored and a print t-shirt, a pair of jeans, a skirt, a dress, a cardigan, a blouse, and a vest. You could wear the print t-shirt with the jeans and the vest and a pair of sandals. You could wear the dress, the cardigan, and a skinny belt, or the dress, the vest and a pair of boots. You could pair the skirt with each of the tops in turn and wear either the vest or the cardigan over them. Pair with jewelry, a scarf, and shoes."
    },
    {
      "title": "Think seasonal.",
      "content": "Think seasonal. You can change your wardrobe around as the season's change (if you live in a place where that happens). Save the warmer scarves and sweaters for fall and winter along with your warmer jackets. [4] X Expert Source Kathi Burns, CPO速 Board Certified Professional Organizer Expert Interview. 31 December 2019. Have boots work as your cool weather footwear, while flats and sandals can be your warm weather go-to's. Colors, too, can change depending on the season. In warmer parts of the wear, you could wear paler colors to keep you cooler and more floral prints to reflect the flowers. In winter it's fun to wear some brighter colors especially if you live in a dark or rainy place so that your bright gold scarf or red dress brings a flare of color to an otherwise drably-colored day."
    },
    {
      "title": "Create a style library.",
      "content": "Create a style library. As you try out outfits, mixing and matching and determining what your base style is, take pictures, or write down a description, of each outfit. This way you can remember what worked and what didn't so that you either recreate the outfit, or you can remember that that particular outfit didn't work. This can also help you decide what to wear if you're feeling unsure. Just go back through your outfit photos and pick the one you liked the best. You'll feel confident because you know it looks good and your decision will have been made."
    },
    {
      "title": "Look for outfit ideas.",
      "content": "Look for outfit ideas. Look everywhere for outfit ideas. Look at mannequins in store windows, look at catalogs and fashion magazines, and look at what people are wearing as you're out and about. These will give you ideas for what you can try out. You don't have to go out and buy all new things based on an outfit you saw in a magazine or on the street. Instead, go through your wardrobe and see what clothing you already own that you can use to recreate the look. This way you won't be copying exactly, you'll be putting your own style onto it."
    },
    {
      "title": "Experiment.",
      "content": "Experiment. This is the most important part of putting together outfits and especially in getting good at it. You have to try out different styles and clothes and outfits before you find the ones that you really like. Only re-wear the outfits that you liked and that you felt comfortable and confident in. Comfort and confidence are the keys to looking good."
    }
  ]
}