{
  "url": "https://www.wikihow.com/Remove-a-Stuck-Glass-Decanter-Stopper",
  "title": "How to Remove a Stuck Glass Decanter Stopper",
  "steps": [
    {
      "title": "Wrap the decanter in a hot washcloth.",
      "content": "Wrap the decanter in a hot washcloth. Wet a washcloth in hot water and wrap it around the decanter’s neck. This can slightly expand the decanter to release the stopper. Wait five or ten minutes to allow the heat from the washcloth to transfer to the glass. Remove the washcloth and gently attempt to remove the stopper. You can tap lightly with a wooden spoon on the sides to loosen it. [1] X Research source"
    },
    {
      "title": "Drip hot water into the decanter.",
      "content": "Drip hot water into the decanter. If possible, allow some hot water to drip in between the stopper and decanter. This should warm and dissolve anything built up between the two. Try this if the stopper is small and recessed enough into your decanter to allow you access to drip water into the space. If it is not, you can run hot water over the entire area to loosen it. Gently tap the sides of the stopper with a wooden spoon to loosen it. Do not use a metal spoon or other metal object, as it may break the glass. [2] X Research source"
    },
    {
      "title": "Submerge the entire decanter in hot water.",
      "content": "Submerge the entire decanter in hot water. Fill a sink or other vessel large enough to cover your decanter with water. Allow your decanter to soak in the water for several minutes. Keep the decanter in the hot water for about 10 minutes. Add more hot water if it becomes cool. You can even let it soak overnight if it doesn’t come loose. [3] X Research source Remove the decanter from the water and attempt to remove the stopper. Tap gently with a wooden spoon at the sides of the stopper to loosen it."
    },
    {
      "title": "Heat vegetable oil.",
      "content": "Heat vegetable oil. Warm up vegetable oil, olive oil, or coconut oil on the stove or microwave for use in unsticking your decanter stopper. You only need to use a small amount of oil. Heat it to a temperature that is comfortable to the touch."
    },
    {
      "title": "Drip oil between the decanter and stopper.",
      "content": "Drip oil between the decanter and stopper. Use your heated oil to drip a small amount in between the glass of the decanter and the stopper. This should warm and loosen any particles or residue that cause sticking. Try using a medicine dropper to pour the oil more precisely into the small gap, or pour the oil liberally over the area for the chance for some of it to drip inside. Leave the oiled decanter to sit in a warm place, like in the kitchen while cooking, to allow the oil to stay warm and loosen the stopper."
    },
    {
      "title": "Gently attempt to remove the stopper.",
      "content": "Gently attempt to remove the stopper. After allowing the oiled decanter to sit in a warm place, gently wiggle the stopper to loosen and remove it. [4] X Research source Tap the sides of the stopper with a wooden spoon or another object that won’t break the glass to loosen it. Note that the oil may drip into the contents of the decanter, so it may need to be disposed of. The stopper and the neck of the decanter should also be cleaned to remove the oil."
    },
    {
      "title": "Wipe down the stopper and neck.",
      "content": "Wipe down the stopper and neck. Clean the connecting parts of the decanter after each use or before storing for a long period of time. This will help avoid the buildup of residue that causes sticking over time. Use a damp cloth without any other cleaner to gently wipe down the decanter and stopper. You can also try wrapping a piece of paper around the stopper before placing it in the decanter in order to store it for a long period of time."
    },
    {
      "title": "Clean the inside of the decanter.",
      "content": "Clean the inside of the decanter. Remove stains or residue from liquid that has been left for a long time in a decanter with a stuck stopper. Fill the empty decanter with warm, soapy water and two tablespoons of uncooked rice. Swirl the mixture periodically over 30 minutes to remove stubborn stains, then rinse thoroughly with warm water. [5] X Research source You can also try a small amount of vinegar, baking soda, or denture cleaner in water to clean the inside. Always make sure to rinse thoroughly with just water afterwards."
    },
    {
      "title": "Store the decanter in a clean place.",
      "content": "Store the decanter in a clean place. Keep your decanter in a place you’ll use it often, or store it inside a cabinet or other area with little dust. This will help avoid particles that make the stopper stick over time. Keeping the decanter in a relatively warm and humid place may help keep it loose and lubricated. Use the water or oil methods of loosening the stopper every so often during storage so that it does not become more stuck over time."
    }
  ]
}