{
  "url": "https://www.wikihow.com/Score-a-Ham",
  "title": "How to Score a Ham",
  "steps": [
    {
      "title": "Prepare to score.",
      "content": "Prepare to score. First, place the raw ham on a cutting board. Make sure that it sits squarely and securely on the board, so that it won't rock around while you cut. Find a sharp, clean chef's knife. [1] X Research source"
    },
    {
      "title": "Slice the ham.",
      "content": "Slice the ham. Use your knife to make shallow, diagonal cuts across the ham. Each score should be about 1/3\" deep. The scores should extend all the way from top to bottom on each side of the ham. Leave about one inch between cuts. You may score the ham while it is raw, right before you cook, or you may score it at the end of the baking time – just before you add the glaze. [2] X Research source There is no definitive right or wrong way to do this."
    },
    {
      "title": "Complete the diamond score.",
      "content": "Complete the diamond score. Now, score the ham in the opposite direction. Make cuts of the same depth and spacing, but perpendicular to the original set of scores. Slice a latticework of diamonds along the surface of the ham. [3] X Research source Make sure to use a very sharp and clean knife for this."
    },
    {
      "title": "Dress with cloves.",
      "content": "Dress with cloves. It is common to poke small cloves into the ham for added flavor and aesthetic. Put one clove in the center of each latticework diamond. It is usually easiest to insert the cloves where the scores intersect."
    },
    {
      "title": "Prepare a ham glaze",
      "content": "Prepare a ham glaze . For a simple glaze recipe, heat 1/4 cup dark corn syrup, 2/3 cup butter, and 2 cups of honey in the top half of a double boiler. Keep the glaze warm while the ham is baking."
    },
    {
      "title": "Brush the glaze onto the ham at intervals while baking.",
      "content": "Brush the glaze onto the ham at intervals while baking. Bake the ham at 325°F for one hour and 25 minutes. Every 10-15 minutes, remove the ham from the oven and brush the glaze liberally over the surface. Then, in the last five minutes of baking, turn on the broiler to caramelize the glaze. [4] X Research source Wait for the ham to reach an internal temperature of 160° F before you add the glaze. Make sure that it is cooked fully through. [5] X Research source Alternately, wait to add the glaze until the last 20-30 minutes of cooking. Then, bake at a steady temperature until the glaze begins to caramelize and turn brown. [6] X Research source Be generous with the glaze. Make sure that the sauce spills into all of the scored grooves so that the interior fat of the ham absorbs the flavor."
    },
    {
      "title": "Let cool before serving.",
      "content": "Let cool before serving. Remove the ham from the oven and let it sit at room temperature for several minutes. Serve the scored, glazed ham by slicing along the scores."
    }
  ]
}