{
  "url": "https://www.wikihow.com/Sell-Puppies",
  "title": "How to Sell Puppies",
  "steps": [
    {
      "title": "Determine your asking price.",
      "content": "Determine your asking price. To figure out a baseline starting price, research the market price of your puppies' breed online. Then, factor in the cost of food and veterinary care your puppies will have received by the time they are sold, including check-ups and vaccinations. [1] X Research source A total price, including vet exams, vaccinations, and food may range from $425 to $880. If your dog is a mixed-breed dog, there may not be a standard baseline price depending on the mix of breeds. In that case, use the vet and food costs. If your dogs are purebred, visit the American Kennel Club dog breed web page to determine if your puppies meet the breed standard. Dogs that do are considered show quality and may be worth a higher price."
    },
    {
      "title": "Reach out to your personal network.",
      "content": "Reach out to your personal network. Ask friends, family members, and coworkers if they know anyone who might be interested in buying a puppy. [2] X Research source If you've sold a litter before, reach out to previous buyers to see if they know anyone who might be looking for a new pup. Though posting on social media to reach your network may sound like a good idea, keep in mind that Facebook doesn't allow selling dogs through a personal account. [3] X Research source You can advertise a sale on Instagram, though."
    },
    {
      "title": "Post flyers in your veterinarian’s office and in pet shops.",
      "content": "Post flyers in your veterinarian’s office and in pet shops. Ask your veterinarian if you can post a flyer in their lobby. You might also visit local pet shops in your area to ask if you can advertise your litter there, too. To make your flyer complete, include a photo of your puppies, the asking price, and reliable contact information. [4] X Research source Take good quality pictures of your puppies to include on your flyer. You want your puppies to look extra cute and irresistible to prospective buyers! You might also include info on the breed, coat, and sex of your puppies."
    },
    {
      "title": "Contact kennel club members.",
      "content": "Contact kennel club members. If you're a part of any kennel clubs (like the American Kennel Club or the United Kennel Club), ask your fellow club members if they know of any prospective buyers. To get in touch, try attending dog shows and kennel club events. [5] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source If you're a registered breeder with the American Kennel Club, you can also sell puppies on the American Kennel Club Marketplace ."
    },
    {
      "title": "Create a website to advertise your litter online.",
      "content": "Create a website to advertise your litter online. Making a website can be a surprisingly easy and affordable way to reach potential customers. If you plan on selling another litter in the future or are a registered breeder, try out this option to help make a name for your breeding program. Include good-quality photos of your puppies, an \"About Me\" page to let prospective buyers know more about you, and a \"Contact\" page with your contact info. [6] X Research source Consider using a website building platform like WordPress , Squarespace , or Wix . These platforms offer free options and can make formatting a lot easier. If you make flyers to post in your area, include your website as a part of your contact information. This can draw traffic to your site and get the word out about your puppies!"
    },
    {
      "title": "Make a breeding announcement in a breed magazine.",
      "content": "Make a breeding announcement in a breed magazine. If your dog is purebred, look into whether there is a magazine dedicated to its breed online. Publications like Just Labs and the Retriever Journal will sometimes run breeding announcements for those specific types of dogs in the magazines. To learn more, visit the magazines' websites and click their advertising or contact page. Then, reach out and ask about their ad requirements. [7] X Research source Magazines will usually charge a fee to run ads in their publications."
    },
    {
      "title": "Use a puppy-selling website, but prioritize buyers in your region.",
      "content": "Use a puppy-selling website, but prioritize buyers in your region. These websites allow you to list an ad for your puppies on their site. Though convenient, these sites do come with risks. If an interested buyer is far away, you won't be able to meet in person, which is a big part of finding good homes for your litter. [8] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Travel and shipping can also be stressful for a young pup. [9] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source To screen potential buyers and keep your pup safe, prioritize selling to buyers in your area. Some of the top puppy-selling websites include Puppies.com (formerly Puppy Find), Nextdaypets.com, and Puppyspot.com. Though it's free to list an ad on these sites, they do charge a fee for getting in touch with buyers. You can also sell puppies on classified ad websites including Hoobly.com and Gumtree.com. Keep in mind that you aren't permitted to sell animals on Craigslist.com."
    },
    {
      "title": "Ask questions about potential buyers' lifestyles to determine a good fit.",
      "content": "Ask questions about potential buyers' lifestyles to determine a good fit. Once interested customers contact you, ask them about their household, living situation, and day-to-day activities. A larger breed may not be a good fit for someone who lives in a studio apartment and works all day, for example. To find out this information, you can either draft an application for them to fill out and send back to you or interview them over the phone. Things you might ask include: [10] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source Have you ever had a dog before? Do you have any other pets? Do you have a backyard? How many hours a day will you spend away from home? Will you be able to cover vet costs and medical care? Do you have young children in your family? Will you be able to devote time to leash training, potty training, and other necessities for a puppy? Are you aware of this specific breed's needs?"
    },
    {
      "title": "Meet prospective owners in person.",
      "content": "Meet prospective owners in person. If any interested households seem like a good fit, pick a time to meet in person and invite the whole household. [11] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source During your meeting, go over the puppy's health and lifestyle needs, answer any questions they may have, and give prospective owners time to play with the puppies. [12] X Research source To keep yourself safe, vet prospective buyers ahead of time by asking for a copy of their driver's license and avoid meeting them alone. [13] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source It's a good sign if potential buyers seem genuinely interested in learning more about the puppy's needs. If they ask questions and treat the puppies with care and respect, they're likely a great match. Watch out for potential buyers that seem uninterested in learning more about the puppy's health and lifestyle needs. This could be a sign that they aren't invested in taking proper care of the puppy."
    },
    {
      "title": "Ask for a deposit if a buyer wants to reserve a pup.",
      "content": "Ask for a deposit if a buyer wants to reserve a pup. This allows potential owners to place a hold on a particular pup. If they do, charge them a refundable or non-refundable deposit to place the hold. [14] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Typical deposits vary depending on the price of the dog. Just make sure it's reasonable so that it doesn't put off a great potential owner!"
    },
    {
      "title": "Offer a contract for extra protection.",
      "content": "Offer a contract for extra protection. Once you've agreed to sell your puppies, make the transfer of ownership official with a contract. If you aren't comfortable writing your own contract, you can also find a contract template online. In the contract, consider including a certification that the puppy is purebred, a health guarantee, a spay/neuter agreement, and a promise that the pup can be returned to you if they aren't a good match. [15] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source If you offer a certification that your pup is purebred, be sure to give the buyers a copy of the dog's pedigree papers to prove their purebred lineage. [16] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Agreeing to take back the puppy back if they aren't a good fit can save them from being rehomed to a household that isn't a good match or taken to a shelter. [17] X Research source A health guarantee promises buyers that the puppy won't develop medical conditions like heart issues or hip dysplasia and that the buyers can return the pup and get a new one if they do. If you offer a guarantee, make sure it is specific to your pup's breed (different breeds have different health risks). [18] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source"
    },
    {
      "title": "Wait to give up the puppies until they are at least 8 weeks old.",
      "content": "Wait to give up the puppies until they are at least 8 weeks old. Taking the puppies away from their litter any sooner can lead to long-term emotional issues. In many states, it's actually illegal to sell a puppy before 8 weeks. [19] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source If a puppy is taken away from its litter too young, it may become anxious, fearful, or aggressive as an adult. They may also be harder to train. [20] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Wait until poodles are 15 weeks old to sell them so their immune systems can fully develop."
    },
    {
      "title": "Keep the puppies in good health.",
      "content": "Keep the puppies in good health. While you wait for the puppies to go to their forever homes, take them to the vet for check-ups and any required vaccinations. Then, keep a copy of all of their medical documents to give to the new owners. [21] X Research source"
    },
    {
      "title": "Provide a clean, stable home.",
      "content": "Provide a clean, stable home. To keep your puppies healthy and comfortable, clean their living environment regularly. Be sure to sanitize their living quarters, wash blankets and bedding, and clean up any fecal matter or urine. Your puppies' mother should be responsible for cleaning her pups when they are young. If you notice the puppies are dirty or the mother is not able to bathe her pups, wipe the puppies down with a warm washcloth. [22] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Avoid bathing the puppies until they are at least 4 weeks old. Since it can be dangerous to submerge small puppies in water, many owners wait several weeks to months before bathing puppies for the first time ."
    },
    {
      "title": "Socialize the puppies safely with people and other dogs.",
      "content": "Socialize the puppies safely with people and other dogs. Getting plenty of social interaction can help your puppies transition well into their new homes and be more confident in new environments. Once your vet allows it (usually once your puppies have received their shots), give them the opportunity to play with adults and children and socialize with other dogs as often as possible. [23] X Research source Always supervise your puppies when playing with children and other dogs. Part of socializing your puppies is exposing them to new sights and sounds. Try bringing them outside when neighbors walk by and playing music in their living environment."
    },
    {
      "title": "Invite the owners to purchase the pup and pick them up at your home.",
      "content": "Invite the owners to purchase the pup and pick them up at your home. Visiting your home to pick up the puppy ensures that the puppies will have a safe and smooth transition. If the owners live farther away, consider meeting them at a drop-off point in between the two locations. To be safe, ensure that the owners pay you using your preferred payment method before parting with your puppy. [24] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source You might consider asking the new owners to pay you on a secure online platform like PayPal. Alternatively, you can also request that they pay you using a debit or credit card. Do your absolute best to avoid shipping. Though it's possible to ship a dog safely, it can still be stressful (and sometimes traumatizing) for a young puppy. [25] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    }
  ]
}