{
  "url": "https://www.wikihow.com/Pronounce-Portuguese",
  "title": "How to Pronounce Portuguese",
  "steps": [
    {
      "title": "Start with the 8 basic vowels.",
      "content": "Start with the 8 basic vowels. Brazilian Portuguese has 5 vowels that produce 8 basic vowel sounds. Many of these sounds are familiar to English speakers. The 8 basic vowel sounds are as follows: [2] X Research source The letter \"i\" makes an \"ee\" sound, similar to the \"ee\" in the English word \"beet.\" The letter \"u\" makes an \"oo\" sound, similar to the \"oo\" in the English word \"boot.\" The letter \"e\" makes an \"eh\" sound, similar to the \"e\" in the English word \"bet.\" The letter \"e\" also makes an \"ay\" sound, similar to the \"ay\" in the English word \"bay.\" The letter \"o\" makes an \"oh\" sound, similar to the \"o\" in the English word \"vote.\" The letter \"o\" also makes an \"ah\" sound, similar to the \"o\" in the English word \"cot.\" The letter \"a\" makes an \"ah\" sound, similar to the \"a\" in the English word \"father.\" The letter \"a\" also makes an \"uh\" sound, similar to the \"uh\" in the English word \"cut.\" This pronunciation only occurs when the \"a\" is in the last syllable of the word and is unstressed."
    },
    {
      "title": "Practice the 5 nasal vowels.",
      "content": "Practice the 5 nasal vowels. If a vowel has a tilde ( ˜ ) over it or is followed by an \"m\" or an \"n,\" use the nasal pronunciation. If you're a native English speaker, you may need to practice this, since nasal vowels don't exist in English. If the vowel is followed by an \"m\" or an \"n,\" don't pronounce those letters. [3] X Research source The letter \"ã\" makes an \"ung\" sound, similar to the \"ung\" in the English word \"rung.\" The letter \"˜e\" makes an \"ang\" sound, similar to the \"ang\" in the English word \"sang.\" The letter \"˜i\" makes an \"ing\" sound, similar to the \"ing\" in the English word \"sing.\" The letter \"õ\" makes an \"ong\" sound, similar to the \"ong\" in the English word \"song.\" The letter \"˜u\" makes an \"oong\" sound that doesn't quite exist in English. Think of saying \"moon,\" but more nasal."
    },
    {
      "title": "Combine vowel sounds to produce diphthongs.",
      "content": "Combine vowel sounds to produce diphthongs. Brazilian Portuguese has 8 diphthongs, in which 2 vowels next to each other are blended together to form a new sound. If you see 2 vowels together that are not diphthongs, they each make separate sounds. [4] X Research source The diphthong \"ai\" sounds like the \"ie\" in the English word \"pie.\" The diphthong \"ão\" sounds like the \"own\" in the English word \"town.\" The diphthong \"au\" sounds like the \"ow\" in the English word \"cow.\" The diphthong \"ie\" sounds like the \"e\" in the English word \"yes.\" The diphthong \"oi\" sounds like the \"oy\" in the English word \"toy.\" The diphthong \"ou\" sounds like the \"ow\" in the English word \"slow.\" The diphthong \"ei\" sounds like the \"ay\" in the English word \"day.\" The diphthong \"uo\" sounds like the \"uo\" in the English word \"quote.\""
    },
    {
      "title": "Pronounce most consonants the way you would in English.",
      "content": "Pronounce most consonants the way you would in English. Brazilian Portuguese uses the same alphabet as English, and most of the consonants are pronounced the same. However, there are some exceptions: [5] X Research source The letter \"c\" is pronounced like the \"s\" in the English word \"safe\" if it occurs before an \"e\" or an \"i.\" If it is followed by an \"a,\" \"o,\" or \"u,\" it's pronounced like the \"c\" in the English word \"cat,\" unless it has a cedilla (ç). Then it's pronounced like an \"s.\" Similarly, a \"g\" makes a hard sound, like the \"g\" in the English word \"got,\" if it's followed by an \"a,\" \"o,\" or \"u.\" When followed by an \"e\" or an \"i,\" it makes a soft \"zh\" sound, like the \"s\" in the English word \"pleasure.\" A \"j\" always makes a soft \"zh\" sound, like the \"s\" in the English word \"measure.\" An \"s\" is pronounced like the \"s\" in the English word \"satisfaction\" unless it is between 2 vowels. Then, it makes a \"z\" sound, like the \"s\" in the English word \"rose.\" Brazilians tend to pronounce a \"w\" like a \"v.\" An \"x\" usually sounds like the \"sh\" in the English word \"shot.\" However, it can make a \"ks\" sound in loan words, such as \"taxi.\" The Brazilian Portuguese \"r\" is pronounced like the English \"r\" when it occurs inside words. At the beginning of a word, it's pronounced like the \"h\" in the English word \"heat.\""
    },
    {
      "title": "Change the sound of \"t\" and \"d\" if followed by an \"i\" or an \"e.\"",
      "content": "Change the sound of \"t\" and \"d\" if followed by an \"i\" or an \"e.\" This is one of the big differences between Brazilian and European Portuguese pronunciation. In European Portuguese, the sound of these letters is constant. However, in Brazilian Portuguese, you change the sound as follows: [6] X Research source When a \"t\" is followed by an \"i\" or an \"e,\" it sounds like the \"ch\" in the English word \"chirp.\" When a \"d\" is followed by an \"i\" or an \"e,\" it sounds like the \"g\" in the English word \"giant.\""
    },
    {
      "title": "Create consonant blends out of 2 consonants next to each other.",
      "content": "Create consonant blends out of 2 consonants next to each other. Brazilian Portuguese also has digraphs, which are formed when 2 consonant sounds are blended together to form a new sound. There are 3 digraphs in Brazilian Portuguese: [7] X Research source The digraph \"ch\" is pronounced like the \"ch\" in the English word \"machine.\" The digraph \"lh\" is pronounced similar to the \"lli\" in the English word \"million.\" The digraph \"nh\" is pronounced similar to the \"ni\" in the English word \"onion.\""
    },
    {
      "title": "Place stress on the next-to-last syllable for most words.",
      "content": "Place stress on the next-to-last syllable for most words. If you see an accent mark over a vowel, you'll stress that syllable (except a tilde ( ˜ ), which doesn't affect stress). However, the rest of the time you'll stress the next-to-last syllable, unless the word ends in \"l,\" \"z,\" \"r,\" \"u,\" or \"i.\" If it does, you stress the last syllable instead. [8] X Research source When an \"l\" occurs at the end of a word in Brazilian Portuguese, it makes an \"oo\" sound, like the \"oo\" in the English word \"boot.\" For example, the Brazilian Portuguese word \"papel\" is pronounced \"pah-peh-oo.\" An \"r\" at the end of the word is silent. For example, the Brazilian Portuguese word \"comer\" is pronounced \"coo-meh.\" If a \"z\" occurs at the end of the word, it makes an \"ss\" sound, similar to the \"ss\" in the English word \"hiss.\""
    },
    {
      "title": "Start with the open pronunciation of vowels.",
      "content": "Start with the open pronunciation of vowels. In European Portuguese, use the open pronunciation if the vowel is in the stressed syllable or has an acute accent ( ´ ) over it. All 5 vowels have open pronunciation. [9] X Research source An open \"a\" makes an \"ah\" sound, similar to the \"a\" in the English word \"father.\" An open \"e\" makes an \"eh\" sound, similar to the \"e\" in the English word \"pet.\" An open \"o\" sounds similar to the short \"o\" sound in the English word \"pot.\" An open \"i\" makes an \"ee\" sound, similar to the \"ee\" in the English word \"beet.\" An open \"u\" makes an \"oo\" sound, similar to the \"oo\" in the English word \"boot.\""
    },
    {
      "title": "Continue on with the closed pronunciation of vowels.",
      "content": "Continue on with the closed pronunciation of vowels. Out of the 5 vowels, 3 of them also have a closed pronunciation. In European Portuguese, the closed pronunciation is used when the vowel occurs anywhere other than the last syllable of the word. [11] X Research source A closed \"a\" makes an \"uh\" sound, similar to the \"u\" in the English word \"butter.\" A closed \"e\" sounds similar to the \"ai\" in the English word \"airplane.\" A closed \"o\" sounds similar to the \"ou\" in the English word \"mould.\""
    },
    {
      "title": "Use the reduced pronunciation of vowels in unstressed syllables.",
      "content": "Use the reduced pronunciation of vowels in unstressed syllables. One of the hallmarks of European Portuguese, in contrast to Brazilian Portuguese, is the tendency to reduce the sound of vowels in unstressed syllables until they are barely heard or completely nonexistent. Although Portuguese is technically a phonetic language, you will still see these vowels in written Portuguese, even though you likely won't hear them when talking to a native speaker from Portugal. [13] X Research source The sound a reduced vowel makes — if it makes any sound at all — is an \"uh\" or \"eh\" sound, similar to the \"schwa\" sound. Vowels that occur at the ends of words aren't pronounced at all, as long as they aren't part of the syllable being stressed. This habit gives rise to the reputation Portuguese have for \"eating the vowels\" at the end of their words."
    },
    {
      "title": "Practice the nasalized pronunciation of vowels.",
      "content": "Practice the nasalized pronunciation of vowels. Three of the vowels also have nasal versions, which you'll pronounce if the letter has a tilde ( ˜ ) over it or is followed by an \"m\" or an \"n.\" The \"m\" or \"n\" following a nasalized vowel is not pronounced. These sounds may take some practice if you're a native English speaker, since English doesn't have nasal vowels. [14] X Research source A nasal \"a\" sounds a bit like \"ang\" in the English word \"anger.\" A nasal \"e\" sounds a bit like the \"eng\" in the word \"ginseng.\" A nasal \"o\" sounds a bit like the \"ong\" in the English word \"among.\""
    },
    {
      "title": "Combine vowel sounds together to create diphthongs.",
      "content": "Combine vowel sounds together to create diphthongs. A diphthong occurs when the sounds of 2 vowels that are next to each other in a word are blended together to make a different sound. If you see 2 vowels that are not a diphthong, each of them is pronounced separately. In European Portuguese, diphthongs in which one vowel has a tilde ( ˜ ) over it are pronounced nasally. [15] X Research source The diphthongs \"ão,\" \"ao,\" and \"au\" all make an \"ow\" sound, like the \"ow\" in the English word \"cow.\" However, \"ão\" is more nasal. The diphthongs \"õe\" and \"oi\" make a sound similar to the \"oy\" in the English word \"boy,\" with the first being more nasal. The diphthongs \"ãe\" and \"ai\" make an \"aye\" sound, similar to the sound of the English word \"eye.\" The letters \"ai\" aren't a diphthong if they appear before a \"z\" at the end of a word, before an \"nh\" anywhere in a word, or before \"l,\" \"r,\" \"m,\" or \"n,\" unless the consonant starts a new syllable. The diphthong \"ou\" makes an \"oh\" sound, similar to the \"oe\" in the English word \"hoe.\" The diphthong \"ei\" makes an \"ay\" sound, similar to the \"ay\" in the English word \"hay.\""
    },
    {
      "title": "Use the same sound for most consonants as you would in English.",
      "content": "Use the same sound for most consonants as you would in English. European Portuguese uses the same alphabet as English. Most of these consonants also sound the same as they do in English. However, some are more limited than their English counterparts. [16] X Research source The letter \"c\" has a soft sound, like the \"c\" in the English word \"cinema,\" if it comes before an \"i\" or an \"e.\" Otherwise, it has a soft sound, like the \"c\" in the English word \"cup.\" However, if the \"c\" has a cedilla (\"ç\"), it retains the soft sound, even if it follows an \"a,\" \"o,\" or \"u.\" Like the letter \"c,\" the letter \"g\" makes a soft sound, like the \"g\" in the English word \"marriage,\" if it comes before an \"i\" or an \"e.\" Otherwise, it makes a hard sound, like the \"g\" in the English word \"game.\" The letter \"h\" is normally silent. However, in combination with an \"l\" or an \"n,\" it sounds more like the \"y\" in the English word \"yarn.\" The letter \"j\" always has a soft \"zh\" sound, like the \"s\" in the English word \"measure.\" In European Portuguese, the letter \"q\" is always followed by a \"u\" and pronounced like the \"k\" in the English word \"skate.\" If the \"u\" is followed by an \"i\" or an \"e\" without a diacritical mark, the \"u\" itself is silent. However, if the \"u\" is followed by an \"a\" or an \"o,\" it retains the \"oo\" sound and the \"qu\" is read as its own syllable. For example, the word \"quo\" is pronounced \"KOO-oh.\""
    },
    {
      "title": "Recognize consonants that have a different sound at the end of a syllable.",
      "content": "Recognize consonants that have a different sound at the end of a syllable. In European Portuguese, some consonants, known as \"coda consonants,\" have a different sound if they occur at the end of a syllable. For some of these, the sound also differs depending on what letter follows them. [17] X Research source If an \"m\" or an \"n\" occurs at the end of a syllable, the preceding vowel has a nasal sound and the consonant isn't pronounced. If an \"s\" or \"z\" is followed by \"c,\" \"ç,\" \"ch,\" \"f,\" \"p,\" \"q,\" \"s,\" or \"t,\" or is the last letter in the word, they sound like the \"sh\" in the English word \"sheep.\" If followed by any other consonant, they make a \"zh\" sound like the \"s\" in the English word \"pleasure.\" Between 2 vowels, they make a \"z\" sound like the \"z\" in the English word \"lazy.\""
    },
    {
      "title": "Work on your guttural \"r\" sound.",
      "content": "Work on your guttural \"r\" sound. The \"r\" in European Portuguese is a sound that doesn't exist in the English language, so it can be difficult to get right. If you're familiar with Spanish, it's similar to the guttural \"j\" in that language. [18] X Research source At the end or alone in the middle of a word, it has a softer pronunciation, closer to the English \"r.\" However, if it's doubled in the middle of a sentence, you'll also make the guttural \"r.\""
    },
    {
      "title": "Take care with your pronunciation of the letter \"x.\"",
      "content": "Take care with your pronunciation of the letter \"x.\" Of all the letters in the European Portuguese alphabet, the letter \"x\" is the most ambiguous. Although there are some rules, the easiest way to know how it's pronounced is to listen to a native speaker. There are 4 different ways \"x\" can be pronounced, depending on its location in a word and the letters surrounding it. [19] X Research source An \"x\" makes a \"ks\" sound, similar to an English \"x,\" most often in words borrowed from other languages, such as \"taxi.\" An \"x\" also sometimes makes an \"ss\" sound, similar to the \"ss\" in the English word \"hiss.\" If a word begins with \"ex\" followed by a vowel, the \"x\" makes a \"z\" sound, similar to the \"z\" in the English word \"lazy.\" The most common way to pronounce \"x\" is with a \"sh\" sound like the \"sh\" in the English word \"sheep.\" It's pronounced this way in words that begin with \"ex\" followed by a consonant, when it's between 2 vowels, and when it's at the end of a sentence."
    },
    {
      "title": "Blend consonant sounds together to create a digraph.",
      "content": "Blend consonant sounds together to create a digraph. European Portuguese has 5 digraphs, 2 of which are the same letter doubled to create a new sound. With a digraph, you combine the sounds of the 2 consonants together to make a new sound. [20] X Research source The digraph \"ch\" makes a \"sh\" sound, similar to the \"sh\" in the English word \"sheeep.\" The digraph \"lh\" sounds similar to the \"lli\" in the English word \"brilliant.\" The digraph \"nh\" sounds similar to the \"ny\" in the English word \"canyon.\" The digraph \"rr\" indicates a guttural \"r\" in the middle of a word. The digraph \"ss\" sounds similar to the \"ss\" in the English word \"classic.\""
    },
    {
      "title": "Stress the last or next-to-last syllable unless there is a diacritical mark.",
      "content": "Stress the last or next-to-last syllable unless there is a diacritical mark. For most words in Portuguese, the next-to-last syllable of a word is stressed, regardless of how long the word is. However, if the word ends in \"i,\" \"l,\" \"r,\" \"z,\" \"im,\" \"um,\" \"ins,\" or \"uns,\" the stress shifts to the final syllable. [21] X Research source The stress also shifts to the final syllable if the word ends in a diphthong, such as \"ão\" or \"ui.\" If the word has a vowel with an acute or circumflex accent mark, the stress falls on that syllable. A tilde ( ˜ ) over a nasal vowel only indicates stress in words that end in \"ã.\" [22] X Research source"
    }
  ]
}