{
  "url": "https://www.wikihow.com/Show-Interest-in-Your-Crush-Without-Overdoing-It",
  "title": "How to Show Interest in Your Crush Without Overdoing It",
  "steps": [
    {
      "title": "Say hi.",
      "content": "Say hi. It’s a simple first step, but it’s an important one. Your crush can't know you if you never talk to them. If you're not comfortable with talking to your crush, saying \"hi\" is a good way to break the ice and build your confidence. [1] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. This will make it easier to talk to them in the future."
    },
    {
      "title": "Make casual conversation.",
      "content": "Make casual conversation. Once you’ve gotten used to saying “hi,” it will be easier for you to engage your crush casually. Keep it simple and light early on, showing an interest but without getting too personal: Ask how their day is going. Talk to them about the latest events happening in your town or at school. Ask them how any school activities they participate in are going. \"How did football practice go today?\" \"When's the next event for the Debate Club?\" Ask what they like to do in their spare time, and ask follow-up questions about that. Getting to know your crush's interest is a great way to both learn more about him and make him feel appreciated. For example; almost everyone likes music; \"What kind of music do you like?\" is a great icebreaker. Reader Poll: We asked 2660 wikiHow readers who've talked to their gym crush, and 54% of them agreed that the best way to break the ice is by making small talk about their workout routine. [Take Poll] Even if your crush isn’t interested in working out, this is a great example of how to start a casual conversation about their interests!"
    },
    {
      "title": "Use body language.",
      "content": "Use body language. Once you’re comfortable enough to talk to your crush, don’t forget to incorporate body language. Eighty per cent of human communication is nonverbal. [2] X Research source Doing these things can help indicate your interest: Smile at your crush when they look at you. [3] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. This shows you’re happy to see them, and will engender good feelings in them about seeing you in return. Meet your crush with uncrossed arms and a gaze upward-- don't look down at your shoes or phone. This shows your availability to being approached. [4] X Research source Make eye contact. Eye contact is a great way to both show your crush has your attention, and to establish intimacy. Lean closer when you talk to them. [5] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. This indicates both an interest in what they are saying, and will over time make them more comfortable with sharing space with you. Brush their arm or lightly touch them occasionally as you talk. Making someone comfortable with physical contact with you is a great way to build intimacy. It also shows you're comfortable with them. [6] X Research source (Generally, this is a better approach if you are a woman and your crush is a man, but it can still work if your crush is comfortable with you doing this.)"
    },
    {
      "title": "Compliment them.",
      "content": "Compliment them. You don’t want to overdo this, or it comes across as flattery, but try to remember it when you see them. Everybody likes to feel appreciated, and like many of the other techniques described here, this will grow positive feelings in them about seeing you. In particular, if they shows up looking different in some way, compliment that. \"I like your new haircut.\" \"Is that a new outfit? It looks great on you.\" If you’ve been talking to your crush a bit, and know more about their activities and hobbies, you can find ways to compliment them on their efforts there, as well. The more genuine you can be, the better: If, say, your crush is an athlete, watch them practice or compete, and compliment something they did well, rather than trying to guess at it. \"I saw you make a great catch at practice the other day\" goes a lot further than \"Well, I don't know anything about football, but you must be good!\""
    },
    {
      "title": "Suggest an activity and make plans.",
      "content": "Suggest an activity and make plans. Once you and your crush are more comfortable with each other, you can make plans to spend more time together. At first, you may want to suggest something where something is going on, or where other people will be, to take some of the pressure off having to maintain conversation the whole time. Some examples might include: A local sporting event, particularly for one of your school’s teams (if you’re at the same school). \"The basketball team is playing Friday night; do you want to go?\" Invite them to see a show of some sort: a band, a movie, or a theater production. This one is great for people uncomfortable with conversation because it creates a shared experience, an important part of getting closer to someone [7] X Research source , while also not putting too much pressure on either party to talk. Invite them to a party or social gathering coming up."
    },
    {
      "title": "Be yourself.",
      "content": "Be yourself. If you’re trying to fake an interest in things you don’t like, or in behavior that isn’t you, because you think it will impress your crush, then they'll eventually notice your awkwardness and discomfort with it. He’ll respect you more and you’ll get along better if you’re honest, rather than if you lie about your tastes in order to try to please him."
    },
    {
      "title": "Stay present and focus on them.",
      "content": "Stay present and focus on them. Many people practice staying in the moment through meditation or other exercises. You don’t need to become a Zen master for your crush, though. Simply pay attention when they're talking and respond appropriately. They'll appreciate your interest and attention. Today’s world is full of distractions; don’t let things like your smartphone take your attention away from the person you're spending time with."
    },
    {
      "title": "Get to know their friends.",
      "content": "Get to know their friends. Many people value the opinion and respect of their peers. It isn’t strictly necessary that you get to know your crush's friends, but if your crush is feeling interested in you but unsure about whether to proceed, the encouragement and approval of their friends will help. You don’t have to please them, but just letting them get to know you a little better can go a long way in winning their endorsement."
    },
    {
      "title": "Invite your crush to activities where the two of you can be alone.",
      "content": "Invite your crush to activities where the two of you can be alone. Since you've already established a comfort level with spending time together in social situations, you can propose activities where it’s just the two of you spending time together. Going out for a cup of coffee, or going for a walk in the park, are two good examples."
    },
    {
      "title": "Pay attention to your crush's body language.",
      "content": "Pay attention to your crush's body language. Your crush may be showing signs they are interested in you, too. Some of these signs differ in men and women, but here are some keys to look for: If a guy straightens his posture or fixes his hair when he sees you, it's because he wants to look his best around you. [8] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. Similarly, women will smooth their clothing and toss their hair back to allow their face to be better seen. [9] X Research source [10] X Research source How a woman handles her purse can tell you a lot about what she's thinking. If she is holding it tightly or in front of her, she's uncomfortable. If she holds it to her side or loosely, she is comfortable with you, and doesn't want it to get in the way of getting closer to you. [11] X Research source When you’re talking, if your crush touches their face, fidgets or stutters, or is on the edge of his seat when you talk, these are signs they're nervous-- because they are feeling attracted to you, too. Wanting to get physically closer to you, or whisper in your ear, is a great sign for you; these behaviors indicate your crush desires intimacy."
    },
    {
      "title": "Make the move yourself.",
      "content": "Make the move yourself. Nothing says you have to wait. If you think your crush is interested in you but hesitant to make the first move, you may want to go ahead and make it. Sometimes your crush is shy or intimidated by you, and in these cases you'll have more luck making the move yourself. Ask them on a date, tell them about your feelings, or even make the first move physically, like with a kiss on the cheek. \"I really like hanging out with you; would you like to go on a date sometime?\" Tradition dictates that men ask women out, but that is less strictly true in this day and age, so no matter your gender, if you feel the time is right to make a move, go ahead and make it."
    }
  ]
}