{
  "url": "https://www.wikihow.com/Perform-Self-Hypnosis",
  "title": "An Expert Guide to Self-Hypnosis",
  "steps": [
    {
      "title": "Find a quiet, comfortable, distraction-free room.",
      "content": "Find a quiet, comfortable, distraction-free room. Ensure you won't be disturbed for at least a half hour while you hypnotize yourself. Go into a comfy room, like your bedroom or living room, and sit on a chair, or lie down on a couch or bed, if desired. Whether you sit or lie down, don't cross your legs or any part of your body. You may be in this position for a while and this could end up being uncomfortable. [2] X Expert Source Stephanie Riseley, MFA Certified Hypnotherapist Expert Interview. 28 April 2020. Wear comfortable clothing. It's pretty hard to enter any kind of deep, relaxed state when all you can think about is the waistband of your jeans cutting off your circulation. [3] X Expert Source Stephanie Riseley, MFA Certified Hypnotherapist Expert Interview. 28 April 2020. Most people choose to be in a trance for around 15-20 minutes, so make sure you are not going to be disturbed for at least half an hour, to be safe. Turn off your phone (and the alerts), lock the door, and sequester yourself. Although some people prefer to lie down, you are more susceptible to sleep while lying down than when sitting up."
    },
    {
      "title": "Create affirmations that reflect your hypnosis goals.",
      "content": "Create affirmations that reflect your hypnosis goals. Are you doing it just to relax? For self-improvement? To train your brain? If you're doing it to achieve a greater end (weight loss, quitting smoking, etc.), prepare a list of affirmations; you will be reciting these to yourself when you're under. Self-hypnosis can be used just for relaxation, sure, but it can be for a number of life-enhancing things, too, such as to achieve goals, change your thinking, or improve your physical and mental health. [4] X Expert Source Stephanie Riseley, MFA Certified Hypnotherapist Expert Interview. 28 April 2020. Self-hypnosis can help you get better sleep, alleviate chronic pain, decrease anxiety and stress, and improve digestive issues linked to Irritable Bowel Syndrome. [5] X Research source Here are some examples of affirmations you could try: If you want to quit a bad habit, something to the point is the most effective. Think along the lines of, \"I choose not to smoke. Cigarettes have no appeal to me.\" If you want to think more positively, aim for something like, \"I am capable of whatever I set my mind to. I am in control and I am valuable.\" If you want to reach a specific goal, like weight loss, say it in the present tense: \"I am eating healthy. I am losing my excess weight. My clothes feel better and I feel better.\""
    },
    {
      "title": "Close your eyes and work to rid your mind of fear, stress, or anxiety.",
      "content": "Close your eyes and work to rid your mind of fear, stress, or anxiety. Self-hypnosis is similar to meditation , and when you first begin, you might find it difficult not to think. You may find that thoughts keep intruding. When this happens, don't try to force the thoughts out. Observe them impartially, and then let them slip away. [6] X Research source Alternatively, some people like to pick a point on the wall and focus on it. It could be the corner, it could be a smudge, it could be wherever you want it to be. Focus on the point, concentrating on your eyelids. Repeat to yourself that they're getting heavier and heavier and let them close when you cannot keep them open anymore."
    },
    {
      "title": "Release the tension in your body.",
      "content": "Release the tension in your body. Beginning with your toes, imagine the tension slowly falling away from your body and vanishing. Imagine it freeing each body part one at a time starting with your toes and working its way up your body. Visualize each part of your body becoming lighter and lighter as the tension is removed. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Relax your toes, then your feet. Continue with your calves, thighs, hips, stomach, and so on, until you've relaxed each portion, including your face and head. Imagining something you find comforting or soothing, such as water (feel the water rushing over your feet and ankles, cleansing them of tension) can be effective as well."
    },
    {
      "title": "Take slow, deep breaths.",
      "content": "Take slow, deep breaths. When you exhale, see the tension and negativity leaving in a dark cloud. As you inhale, see the air returning as a bright force filled with life and energy. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source At this point, you can use visualization as you so choose. Think of a lemon and cut it in half in your mind. Imagine the juices oozing out. Place it in your mouth. What's your reaction? How does it feel, taste, and smell? Then, move on to more meaningful visions. Imagine your bills blowing away in the breeze, for instance. Get as detailed as possible."
    },
    {
      "title": "Imagine you’re descending a staircase to help you enter your trance.",
      "content": "Imagine you’re descending a staircase to help you enter your trance. Picture yourself at the top of a flight of 10 stairs which, at the fifth step, starts to submerge into water. Picture every detail of this scene from the top to the bottom. Tell yourself that you are going to descend the stairs, counting each step down, starting at 10. Picture each number in your mind. Imagine that each number you count is further down and one step closer to the bottom. After each number, you will feel yourself drifting further and further into deep relaxation. [9] X Research source As you take each step, imagine the feel of the step under your feet. Once you are at the fifth step, imagine and truly feel the refreshing coolness of the water and tell yourself that you are stepping into an oasis of purity and cleanliness. As you begin to descend the last five steps, start to feel the water getting higher and higher up your body. You may now start to feel somewhat numb and your heart might start to race a bit, but notice it and let any qualms about the situation just drift away into the water. At the bottom of the water you probably won’t really feel anything, just the sensation of floating freely. You may even feel like you're spinning. If you do not feel as stated above, try again, slower, with a will to grasp what is happening."
    },
    {
      "title": "Begin reciting positive affirmations at the bottom of the “staircase.”",
      "content": "Begin reciting positive affirmations at the bottom of the “staircase.” Once you have reached the bottom of the stairs and are floating in the water, recall the affirmations you established before beginning your trance. “Swim” through the water and recite your affirmations in the present or future tense quietly to yourself, or as if you’re reading it from a page. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Avoid using statements with a negative connotation, such as \"I don't want to be tired and irritable.\" Instead, say, \"I am becoming calm and relaxed.\" Other examples of positive statements include: \"I am strong and slender\" or \"I am successful and positive.\""
    },
    {
      "title": "Repeat your statement(s) to yourself as many times as you wish.",
      "content": "Repeat your statement(s) to yourself as many times as you wish. Feel free to wander about the water, visualizing yourself finding treasure (in the form of self-confidence, money, etc.), or simply letting all your tensions disappear. Find areas where the water is cold, hot, or full of wildlife. Let your imagination go. [11] X Research source You might picture three boxes or treasure chests under the water that you have to swim to get to. Once you have found the boxes, open them slowly, one at a time, and narrate to yourself what is happening when you open the box. For example, \"As I open the box I feel a radiant light engulf me, I feel it becoming a part of me. This light is my newfound confidence that I can never lose as it is now a part of me\" and then proceed on to the next box."
    },
    {
      "title": "Ascend the “staircase” to exit your hypnotic state.",
      "content": "Ascend the “staircase” to exit your hypnotic state. With each step you take, feel the water becoming lower and lower until you have once again reached that fifth step. Once you are out of the water and are on the sixth step you may start to feel heavy or as if there is a weight on your chest. Merely wait on the step until this passes, constantly repeating your aforementioned statements. [12] X Research source Once it passes, continue up the stairs, visualizing each step by its number, feeling the steps underneath you. Will yourself to carry on up the stairs. Imagining the staircase may work for you, but it’s not the only way to self-hypnotize. If you come up with another scenario that you prefer, use it!"
    },
    {
      "title": "Take your time opening your eyes once you have ascended.",
      "content": "Take your time opening your eyes once you have ascended. You may want to visualize yourself opening a door to the outside world. Do this slowly and imagine the light that pours in through the doorway; this may make your eyes open naturally. If you need to, count down from ten, telling yourself that once you finish, your eyes will open. Take your time getting up, and don’t rush it. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Try telling yourself, \"Wide awake, wide awake,\" or something you're used to, in order to wake up. This will put your mind back in a conscious state, bringing you back to reality."
    },
    {
      "title": "Believe in yourself and your ability to self-hypnotize.",
      "content": "Believe in yourself and your ability to self-hypnotize. No self-hypnosis or mantra will manifest itself in real life if you don't actually mean it. In order for it to be effective, you have to believe in yourself and your actions. And why not? If you do mean it, it could work. [14] X Research source If the first time doesn't seem effective, don't write it off automatically. Some things take time to get used to and to get good at. Come back to it in a few days and revisit the experiences. You may be surprised."
    },
    {
      "title": "Visualize your goals.",
      "content": "Visualize your goals. Whatever it is you're working toward—be it confidence, weight loss, positive thinking, or something else—visualize yourself in the situation acting as you'd like to react or being as you'd like to be. If you want to be more fit, imagine yourself lifting heavy weights with ease or being able to fit into your old jeans. The endorphin rush alone will be worth it! Many use hypnosis to get over certain issues like shyness. Simply imagining yourself going about the world with your head high, smiling, and making eye contact can be the first step toward a more extroverted you."
    },
    {
      "title": "Use outside relaxation techniques to assist you.",
      "content": "Use outside relaxation techniques to assist you. White noise and other soothing background sounds have been proven to aid in relaxation. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If background music, white noise, or sound effects—such as water, the rainforest, etc.—would help you feel calmer and make it easier to enter your trance, play some while you hypnotize yourself. Some people find that getting out of the trance is difficult and they lose track of time, so setting an alarm may help. Just make sure it has a soothing tone so that you’re not startled out of your trance, but gently awakened."
    },
    {
      "title": "Use self-hypnosis to become the person you want to be.",
      "content": "Use self-hypnosis to become the person you want to be. Find a goal of yours you'd like to achieve and concentrate on it during your relaxed state. Think of the person you'd like to be and be that person. Hypnosis is great for a deep, deep meditation, but it can also be used for a bigger, better purpose. Many people find that they emerge more positive and motivated afterward. Take advantage of that possibility! There is no wrong way to go about self-hypnosis. Whether it's kicking a bad habit, having focus in your work life, or just changing your thinking, hypnosis can help. [16] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Getting rid of the stressors in your life is an integral part of being the person you want to become and this will help. And the more you do it, the better and more natural it'll feel."
    }
  ]
}