{
  "url": "https://www.wikihow.com/Sew-European-Pillowcases",
  "title": "How to Sew European Pillowcases",
  "steps": [
    {
      "title": "Select fabric for your pillowcases.",
      "content": "Select fabric for your pillowcases. You can use any type of fabric you like to create your custom European pillowcases. If you'd like soft, lightweight pillowcases so you can leave the pillows on the bed while you sleep, choose cotton, linen, or a cotton-synthetic blend. For purely decorative pillowcases, you may want a heavier fabric like tweed, brushed denim, or drapery fabric. [1] X Research source Buy around 1 yard (0.91 m) of fabric for each pillowcase you're making."
    },
    {
      "title": "Cut the fabric into 1 square that matches the size of your pillow.",
      "content": "Cut the fabric into 1 square that matches the size of your pillow. Most standard European pillows are 26 in × 26 in (66 cm × 66 cm) or 28 in × 28 in (71 cm × 71 cm), but you could make a pillowcase for any square-sized pillow. Measure across your pillow to find the measurement. Then, lay your fabric flat and cut a square with the same measurement. [2] X Research source For example, if you want to make a pillowcase for an 16 inches (41 cm) European pillow, cut the fabric to a 16 in × 16 in (410 mm × 410 mm) square."
    },
    {
      "title": "Make 2 rectangular pieces of fabric for the back of the pillowcase.",
      "content": "Make 2 rectangular pieces of fabric for the back of the pillowcase. To find the measurements for the back flaps, divide the size of your pillowcase by 2 and add 2 inches (5.1 cm). Then, cut a rectangle that's this length by the length of your pillow. [3] X Research source For example, if your pillow is 16 inches (41 cm), divide that by 2 to get 8 inches (20 cm) and add 2 inches (5.1 cm) to get a length of 10 inches (25 cm). Your rectangles should be 16 by 16 inches (41 cm × 41 cm)."
    },
    {
      "title": "Fold 1 long side of the rectangles over by 1⁄2 inch (1.3 cm) and iron it.",
      "content": "Fold 1 long side of the rectangles over by 1 ⁄ 2 inch (1.3 cm) and iron it. Lay the rectangles so the wrong side faces up and tuck 1 of the long ends over towards the center. Fold it by 1 ⁄ 2 inch (1.3 cm) and iron across it to crease the fabric. Then, do this for the other rectangle. [4] X Research source Don't fold and iron all of the long sides; just 1 on each rectangle since they'll overlap."
    },
    {
      "title": "Sew straight stitches across the folded sides of the rectangles.",
      "content": "Sew straight stitches across the folded sides of the rectangles. Take your fabric to the sewing machine and make a few stitches. Backstitch a few times before you make straight stitches down the folded length of the rectangle. Repeat this for the other rectangle. [5] X Research source Folding and sewing the edges that will overlap prevents them from fraying. Use a thread color that matches your pillowcase fabric."
    },
    {
      "title": "Stack the rectangles on the square so they overlap.",
      "content": "Stack the rectangles on the square so they overlap. Place the square of fabric so the pattern faces up. Then, arrange 1 of the rectangles pattern-side down on the square so the long sides line up. Put the other rectangle piece pattern-side down on the other side of the square so it overlaps. [6] X Research source Remember to put the folded and sewn edge in the center of the pillowcase."
    },
    {
      "title": "Pin around the outer seams of the pillowcase.",
      "content": "Pin around the outer seams of the pillowcase. Insert sewing pins so they're parallel to the sides of the square and put a pin every 2 inches (5.1 cm) or so. Don't pin across the folds in the center of the pillow since you won't be sewing these closed. [7] X Research source If you don't want to use sewing pins, use sewing clips instead. These won't leave holes and you won't accidentally poke yourself."
    },
    {
      "title": "Sew each side of the pillowcase using a straight stitch.",
      "content": "Sew each side of the pillowcase using a straight stitch. Start sewing at 1 corner of the pillow and sew a straight stitch along the side. Leave a 1 ⁄ 4 inch (0.64 cm) seam allowance as you go. When you reach a corner, stop sewing and lift your presser foot. Turn your fabric 90-degrees while the sewing needle is still in the fabric. Then, put the foot down and continue to sew. [8] X Research source"
    },
    {
      "title": "Turn the pillowcase right side out and stuff the Euro pillow into it.",
      "content": "Turn the pillowcase right side out and stuff the Euro pillow into it. Reach in between the overlapped fabric and pull the pillowcase so the pattern faces out. Take a knitting needle and push it into each corner to push the edge out. Then, open the back flaps of the pillowcase and insert the Euro pillow. [9] X Research source It's easy to wash the pillowcase. Just remove the pillow and wash the pillowcase according to the fabric's care instructions."
    }
  ]
}