{
  "url": "https://www.wikihow.com/Make-a-Walking-Stick",
  "title": "How to Make a Walking Stick",
  "steps": [
    {
      "title": "Find a good stick.",
      "content": "Find a good stick. A good walking stick starts with a good piece of wood, of course. The size, shape, sturdiness, and age of the wood all contribute to the quality of a potential walking stick. A good walking stick usually starts as a fairly straight piece of wood that is approximately one to two inches in diameter. Look for a piece of wood that is as tall as your armpit (usually in the 55-65 inch range); you can trim it to length later. Hardwoods tend to make the most manageable and sturdiest walking sticks. Good options include maple, alder, cherry, aspen, and sassafras, among others. [1] X Research source Look for fresh hardwood, but never cut from a live tree to make a walking stick. Enjoy nature, don’t damage it. If you look around a bit, you will find a suitable stick that is still fresh but no longer living. [2] X Research source Avoid sticks with holes or other evidence of insect activity. The stick may be weakened by insect boring, or you may unwittingly transport bugs into your home."
    },
    {
      "title": "Trim it to length.",
      "content": "Trim it to length. If you are making the walking stick for your own use, stand the stick on the ground and hold it in front of you as you would when walking, with your arm bent comfortably at the elbow (roughly at a right angle). Mark the stick about two inches above the top of your hand (or more if you intend to add a decorative top carving, for instance), and cut it to length with your saw of choice. (Note: Children or those unfamiliar with using saws should seek assistance. Power saws can take a finger in an instant, and hand saws can easily cause deep cuts as well.) If you want to size a stick for someone else before locating it, have him hold a broom out in front of him as described above. Measure the height from the floor to a few inches above the top of his hand. Take a tape measure or string cut to length with you on your walking stick search. [3] X Research source If you are making walking sticks for sale or to give to undetermined recipients, remember that the 55-65 inch range is a good general starting point for stick length. [4] X Research source"
    },
    {
      "title": "Whittle off the bark.",
      "content": "Whittle off the bark. You can leave the bark on if you wish, but most people prefer the look and feel of a stripped stick that reveals the smoothed wood grain beneath. Regardless, you’ll probably want to trim off any twigs or bumps by whittling them away. [5] X Research source You can use a pocketknife, larger knife, or even a plane to whittle away the bark. Use the whittling tool that is most comfortable for you. Shave away twigs and bumps first, then start shaving off the bark. Use short, quick, shallow strokes. You don’t want to dig into the wood. Good, safe whittling takes time. Always whittle away from your body, with your legs clear of the shaving motion. A knot in the wood could cause the knife to jump and slice or puncture you. If you are unfamiliar with whittling, seek assistance from someone with experience. Keep whittling until the bright wood beneath is exposed. Some trees have multiple layers of bark, so keep at it until you can see the wood grain."
    },
    {
      "title": "Let your stick dry.",
      "content": "Let your stick dry. Fresh wood is better for trimming and whittling, but dried wood provides more rigidity and durability. Time and patience are your best friends in this process. Drying time depends upon a host of factors, including wood type, environmental conditions, and personal preferences. Some recommend two weeks as the average target time, others say one month. [6] X Research source Let the stick dry until it becomes rigid but not brittle. You may need to rotate its positioning, or even strap it into place (for instance, by pinning it against a flat piece of lumber with metal clips used to secure conduit or pipe in place) to keep it from warping. Wood that dries too quickly can become brittle, so if it is extremely dry indoors, you may want to let your stick cure in a covered outdoor location, like a garage or shed."
    },
    {
      "title": "Add creative touches.",
      "content": "Add creative touches. You may have seen walking sticks with intricately carved tops; the face of a long-haired, bearded man seems to be a popular choice. Depending upon your skill level with a pocketknife and/or other woodworking tools, you can try your hand at decorating the top of your stick. Remember, if you mess up, you can just trim the stick off a bit shorter! [7] X Research source For somewhat simpler decorations, you can carve your name or initials into the stick. You can use a wood-burning tool to make these effects as well. Practice caution regardless of which method you employ. Also, you may find practical value in carving grooves in the area of your hand grip. The undulating indentations found on many car steering wheels can serve as one type of inspiration, but a spiral groove that wraps around the stick can also make a comfortable grip."
    },
    {
      "title": "Stain and seal the wood.",
      "content": "Stain and seal the wood. Once you’ve finished your trimming, whittling, curing, and carving, it is time to protect your creation so that it lasts for years to come. Sealing and especially staining the wood is optional, but recommended to improve the look and durability of your stick. Whether you are staining / sealing the stick or not, smooth it for comfort by using coarse and then fine sandpaper. Wipe away any sawdust with a tack cloth or a rag moistened with paint thinner. Apply any wood stain according to the package instructions. Expect to let each coat of stain dry overnight, and to lightly sand and wipe clean between applications. The more coats you add, the darker the finish. Add three coats (or the recommended number as per the package instructions) of a clear urethane varnish. Lightly sand with ultra-fine sandpaper and wipe clean between applications. Do any staining or sealing in a well-ventilated area. Always wear gloves, and consider wearing safety glasses and breathing protection as well."
    },
    {
      "title": "Get a grip.",
      "content": "Get a grip. If you have not carved a grip into your walking stick (see the step above on decorative carving), you can instead apply a grip after any staining and sealing is complete. Again, this step is optional. Practical and visually-appealing hand grips can be made from strips of leather, twine, nylon, or braided rope, wrapped around the grip area and secured with pins or small nails. [8] X Research source For that matter, an adhesive gripping wrap used for tennis rackets or golf clubs will also work, or even grip tape used on hockey sticks. For an extra measure of assistance in keeping ahold of your walking stick, you can also add a wrist loop if desired. Drill a hole through the stick (ideally before staining or sealing), just above the grip area. Feed through a strip of leather or other preferred material and tie it into a loop that will fit comfortably over the wrist."
    },
    {
      "title": "Protect the base.",
      "content": "Protect the base. The bottom tip of your walking stick will suffer the greatest wear and tear, which can result in cracking, splitting, splintering, or rotting. You can leave the tip in its natural state and clean, sand, or trim it as needed, or add optional protection to the bottom. Rubber caps used for canes and walkers make an easy and affordable solution. Look for them anywhere medical supplies are sold. You can also use large rubber stoppers. Drill a hole in the stopper and the bottom of the stick so that each will accept a wooden dowel, and glue the connections in place. [9] X Research source A short length of copper pipe can also make an elegant base protector for your walking stick. Take a one inch length of three-quarter inch or one inch diameter copper pipe, and whittle the base of your stick until the pipe just barely slides over the tip. Secure the pipe in place with a quick-drying epoxy glue. [10] X Research source"
    }
  ]
}