{
  "url": "https://www.wikihow.com/Remove-a-Kitchen-Sink",
  "title": "How to Remove a Kitchen Sink",
  "steps": [
    {
      "title": "Assess what type of sink you have.",
      "content": "Assess what type of sink you have. Kitchen sinks come in 2 basic designs: under-mounted, which are attached to the countertop from underneath, or drop-ins, which simply drop into the sink opening in a countertop. There are only slight differences in how you remove each kind of sink and they will be explained as you go through the steps."
    },
    {
      "title": "Open the cabinet under the sink.",
      "content": "Open the cabinet under the sink. Most of your work will be done here so clean out everything you can from this space. It will give you more room to move around and more space to place a bucket or your tools."
    },
    {
      "title": "Put on your protective eyewear and gloves.",
      "content": "Put on your protective eyewear and gloves. The under sink area is small and confined, with lots of pipes and other hazards to your eyes. This job can also be messy and hard on your hands, so wearing gloves is a good idea. Remember that wearing personal protective equipment can seem like a headache at times but it could save you from pain and injury in the long run."
    },
    {
      "title": "Unplug your garbage disposal, if you have one.",
      "content": "Unplug your garbage disposal, if you have one. Electricity and water don't mix, so unplugging your disposal as soon as possible is a very good idea. You may even want to turn off the circuit that the disposal was plugged in to. Go to your home's fuse box and turn off the circuit breaker controlling the garbage disposal plug. [1] X Research source"
    },
    {
      "title": "Turn off the water supply to the sink.",
      "content": "Turn off the water supply to the sink. You should have two separate valves located below the sink, one for the hot water and one for the cold water. In some cases, the hot water shut off knob will be red and the cold water shut off knob will be blue, but this is often not the case. Either way, turn both of the handles clockwise until they are all the way off. Double check that they are closed by turning on the water in the sink. A few drips at first are fine but the flow of water should be gone. [2] X Research source If you still have water coming out, you may need to consult a plumber to change out your shut off valves or you could do it yourself by following these steps: https://www.wikihow.com/Replace-Shut-off-Valves If there are no water shut off valves under your sink, you will need to locate them further down your water pipes. Trace the water supply lines as far as you can, looking for valves where you could shut off the flow of water. If all else fails, there should be a main water shut off, either where water comes into your house or at the curb in a meter vault. [3] X Research source"
    },
    {
      "title": "Disconnect the water supply lines from the underside of the faucet.",
      "content": "Disconnect the water supply lines from the underside of the faucet. Water supply lines that connect to kitchen sinks are most often flexible plastic tubing that connect on both ends, at the sink and the water shut off valve, with metal nuts. Because the connection to the sink is found on the backside of the bottom of the sink, it may be a bit awkward to get to. Use an adjustable wrench, channel-locks, or an open-ended wrench to loosen the nut on the water line, whichever you can most easily get into the space. Hold the line in place with one hand while you loosen the nut with the other, so that when it becomes disconnected you can keep the line upright. A bit of water will still be in the line, so have a bucket handy to pour out the water trapped in the line. [4] X Research source It's a good idea to spread towels across the bottom of the under-sink cabinet in order to catch small spills and reduce clean-up time later. If the connection between your water lines and the sink are totally inaccessible, you can usually disconnect that lines at the water shut off valves. Remember, though, that you need to be gentle with the connections at these valves, as breaking them would send water streaming into your kitchen."
    },
    {
      "title": "Disconnect the drain pipe from the sink.",
      "content": "Disconnect the drain pipe from the sink. The drain pipe is connected at the bottom of your sink strainer with a slip nut or a coupling nut, that connects plastic drain piping to a metal sink strainer. First loosen the nut that attaches the strainer to the drain pipe with channel locks or an adjustable wrench. [5] X Expert Source David Balkan Professional Plumber & CEO of Balkan Sewer & Water Main Expert Interview. 29 April 2021. This is usually a plastic nut that can be loosened by hand, with a bit of strength of course. When this nut is loose don't pull the connection apart yet! You will also need to loosen the slip nut at the far side of the P-trap, which is a distinctive J- or U-shaped span of pipe in the drain line under the sink. Loosening this nut as well should allow you to take off the whole piece of piping between the strainer and the far side of the P-trap without damaging the piping. Remember to keep your bucket handy to capture spills. [6] X Research source If you have a sink that is mounted underneath the counter, you may need to remove more drain piping in order to have space for the sink to come out. Remove your drain pipe further past the P-trap, giving space for the sink to be angled out. Whatever you take out can easily be replaced, as long as you leave at least an inch of pipe sticking out from the where it enters the under sink area. A slip nut connection is designed for removal by hand but if you can't get it off by hand, you may want to wrap a rag around the nut and gently turn the nut with your channel locks, so that the slip nut doesn't get damaged. [7] X Expert Source David Balkan Professional Plumber & CEO of Balkan Sewer & Water Main Expert Interview. 29 April 2021."
    },
    {
      "title": "Disconnect your garbage disposal, if you have one.",
      "content": "Disconnect your garbage disposal, if you have one. First you will need to disconnect the drain pipe from your disposal. Unscrew the main connection between the garbage disposal and the drainpipe with a screwdriver. [8] X Research source You may also need to remove the drain line for the dishwasher, if you have one connected to the drain through your garbage disposal. This is a simple connection that should be easy to detach with either a screwdriver or wrench, depending on the fixture."
    },
    {
      "title": "Remove your garbage disposal, if you have one.",
      "content": "Remove your garbage disposal , if you have one. Some garbage disposals have a special Allen wrench that unlocks the assembly from its connection (this should come with your disposal when you buy it). Use one hand to turn the special wrench counterclockwise and keep your other hand under the disposal. Other types of garbage disposal units use snap rings to connect the disposal to the bottom of the sink. With this connection, one ring is attached to the bottom of the sink and one ring is attached to the disposal. Then the two rings have several screws that sandwich them together, which can simply be loosened and removed when detaching the disposal. Either way, the unit will come off quickly and you'll need to have a good grip on it so that you're ready to catch it. In many cases, a sink with two bowls will have one bowl connected directly to the drain and one connected directly to a garbage disposal. If this is the case you will need to remove both connections."
    },
    {
      "title": "Cut through the caulking around your kitchen sink.",
      "content": "Cut through the caulking around your kitchen sink. Use a utility knife to carefully slice through the sealant along the edges of the fixture. Be sure not to cut into the countertop if you are going to continue using it."
    },
    {
      "title": "Detach the sink from the countertop.",
      "content": "Detach the sink from the countertop. If you have an under-mounted sink you will first need to have someone hold the sink up while you detach it, otherwise it could fall down onto you. For top-mounted sinks, this step can be done by yourself. Unscrew the metal clips that connect the sink to the countertop. Use a screwdriver to carefully take off the tiny clips. These screws may be difficult to access or be a bit rusty, so just take your time and be patient getting them off. In order for your helper to hold up an under-mounted sink, remove the strainer from the sink, allowing them to hold onto the sink through the strainer hole. The strainer is connected to the sink with a locknut that is located below the sink. You will need to use large channel locks to loosen the locknut, turning the locknut clockwise until it is detached. Then simply tap the bottom of the strainer up and it should pop up and be easily removed from the sink."
    },
    {
      "title": "Reach under the sink and gently push up on the sink to loosen it.",
      "content": "Reach under the sink and gently push up on the sink to loosen it. If it doesn't move easily, move from side to side of the sink, pushing up until the fixture is loosened on all sides. If you are having trouble getting the sink to detach, and you are worried it may pull off pieced of your laminate countertop, have a helper gradually cut along the caulking as you push up on one side of the sink. This should allow you to remove the sink without accidentally pulling off some of your counter's finish."
    },
    {
      "title": "Pull the sink out of the countertop.",
      "content": "Pull the sink out of the countertop. Stainless steel drop-in units are light enough to remove by yourself but older porcelain sinks can be heavy, so get someone to help you take that type out. Getting under-mounted sinks out is just a bit trickier. You will need to angle it out of the cupboard doors, being careful not to damage any cabinet surfaces or remaining piping."
    },
    {
      "title": "Clean up surfaces and spills.",
      "content": "Clean up surfaces and spills. Scrape off any old caulk or plumber's putty from the countertop with a paint scraper or a razor blade. Make sure the surface is clean before you begin installing a new kitchen sink. Also remember to sop up any water that may have come out of the sink during removal. [9] X Research source"
    }
  ]
}