{
  "url": "https://www.wikihow.com/Repair-a-CD-With-Toothpaste",
  "title": "How to Repair a CD With Toothpaste",
  "steps": [
    {
      "title": "Check both sides for damage.",
      "content": "Check both sides for damage. A CD stores information just beneath the label. A scratch that tears through the label usually destroys the CD permanently. Fortunately, scratches are more common on the reflected side, and that's where toothpaste comes in handy. The laser that reads the CD needs to bounce evenly off the smooth, reflective surface. [1] X Research source Toothpaste is just abrasive enough to wear down scratched areas to a smoother surface. Small scratches and scuff marks are much easier to repair than deep gouges. Some CD repair services can repair the disc with a special buffing machine, but these are hard to use without causing damage."
    },
    {
      "title": "Wash the CD with a damp, lint-free cloth.",
      "content": "Wash the CD with a damp, lint-free cloth. Even if you can't see them, tiny flecks of dust on the CD could gouge out new scratches when rubbed with the toothpaste. To prevent this, hold the disc under cool, running water and rub it with a lint-free cloth such as cotton or microfiber. Always rub directly from the center to the edge, never in small, circular motions or along the circular pathways. Only wash the reflective side of the disc. If the CD is very dusty, gently spray it with canned air first. If the CD is visibly greasy, use rubbing alcohol or a CD cleaning solution instead of water."
    },
    {
      "title": "Choose your toothpaste.",
      "content": "Choose your toothpaste. Only an actual \"paste\" will work, not a gel. [2] X Research source If convenient, choose a \"whitening\" or \"tartar control\" toothpaste. These tend to be more abrasive, which will help polish the CD. You might be able to look up your toothpaste brand online to find the \"RDA,\" a measure of abrasiveness. A high RDA toothpaste usually makes a smoother surface, although that's not always true. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Squirt the toothpaste onto a lint-free cloth.",
      "content": "Squirt the toothpaste onto a lint-free cloth. As before, a clean rag made from cotton or microfiber is ideal. You can use a cotton swab instead."
    },
    {
      "title": "Gently wipe the scratched area.",
      "content": "Gently wipe the scratched area. Rub the toothpaste over the scratched area. Always move from the center directly to the edge. Repeated movement will slowly wear down the CD, smoothing it out to the level of the scratch. Do not press hard."
    },
    {
      "title": "Wash off the toothpaste.",
      "content": "Wash off the toothpaste. Hold the CD under running water. Wipe it with a clean cloth in the same direction of movement."
    },
    {
      "title": "Dry the CD.",
      "content": "Dry the CD. Be careful, as dry CD is more easily scratched than a wet one. Blot away most of the water first, placing a lint-free cloth directly onto the CD and lifting. Finish by air drying or very gentle rubbing with a dry area of the cloth. As always, rub from the center to the edge in straight lines."
    },
    {
      "title": "Try stronger abrasives.",
      "content": "Try stronger abrasives. Test the CD once it is completely dry. If it still doesn't function, you can try the same cleaning process with a polish meant for silver, plastic, or furniture. Never use a polish that smells like kerosene or contains petroleum derivatives, as these can break down the CD. [4] X Research source"
    }
  ]
}