{
  "url": "https://www.wikihow.com/Sit-During-Zen-Meditation",
  "title": "How to Sit During Zen Meditation",
  "steps": [
    {
      "title": "Sit on a circular cushion (zafu) for the classic Zen position.",
      "content": "Sit on a circular cushion (zafu) for the classic Zen position. Many traditionalists prefer to use a circular meditation cushion called a zafu. If you prefer, though, you can use any type of soft but supportive cushion that helps you stay in the upright seated posture used for traditional Zen meditation. [2] X Research source For extra comfort, place a meditation mat, or even a blanket or towel, on the floor underneath the cushion. Sit in the center of the cushion if you prefer keeping your knees on it. Especially if you’re new to Zen meditation, you may find it easier to sit with your crossed legs resting on the cushion along with your backside. Sit at the front of the cushion if you want to rest your knees on the floor. This is a more traditional approach—your backside on the zafu and your crossed legs draped over the front."
    },
    {
      "title": "Cross your legs in a comfortable position when using a zafu.",
      "content": "Cross your legs in a comfortable position when using a zafu. The lotus position is the most traditional way to cross your legs during Zen meditation, but it may not be comfortable for newcomers or those with physical limitations. [3] X Expert Source Soken Graf Certified Meditation Coach Expert Interview. 6 March 2020. Fortunately, there are several positions you can use. Popular choices include: [4] X Research source Lotus: Cross your left leg over your right so that the tops of both of your feet are resting on the upper thigh of the opposite leg. Half Lotus: Cross your left leg over your right and rest your left foot on your right upper thigh, but tuck your right foot beneath your left leg. You can reverse legs if desired. Quarter Lotus: Cross your legs loosely so that your left knee is resting on (or just slightly above, depending on your flexibility) the side of your right foot, and vice versa. [5] X Research source Burmese: Instead of crossing one leg over the other, spread your legs a bit wider, rest your knees, lower legs, and feet on the mat (or floor), and touch the heel of one foot to the base of the ankle of the other foot."
    },
    {
      "title": "Choose a level, sturdy chair if you’re unable to sit on the floor.",
      "content": "Choose a level, sturdy chair if you’re unable to sit on the floor. [6] X Expert Source James Brown Meditation Coach Expert Interview. 3 April 2019. Don’t choose a soft, cushiony chair that you can sink down into, but rather one that enables you to sit flat-footed and fully upright. [7] X Expert Source Soken Graf Certified Meditation Coach Expert Interview. 6 March 2020. A wooden dining chair or even a folding metal chair may work—just make sure you can sit to the front of the chair and reach your feet flat to the ground. [8] X Research source Sit far enough forward that, when sitting fully upright, no part of your body can contact the back of the chair. You could use a chair-height stool if desired, because you shouldn’t be in contact with the back of the chair anyway."
    },
    {
      "title": "Put your feet flat on the floor, hip-width apart, when using a chair.",
      "content": "Put your feet flat on the floor, hip-width apart, when using a chair. Your lower legs, from your feet to your knees, should create 2 parallel vertical columns that are perpendicular to the floor. Your knees should bend at 90-degree angles, so that your upper legs are parallel to the floor. Your knees and feet should be at the same width apart as your hips, and your toes should be pointed straight forward. [9] X Research source Find a higher or lower chair if necessary so you can achieve this position. Add a lumbar support behind your lower back if necessary. You may not be able to sit fully upright on the front section of the chair without experiencing lower back discomfort. In this case, wedge a rounded lumbar pillow between your lower back and the base of the chair back."
    },
    {
      "title": "Use a rolled-up cushion as an alternative to a floor cushion or chair.",
      "content": "Use a rolled-up cushion as an alternative to a floor cushion or chair. Roll up your meditation cushion into a log shape. Your goal is to create a tubular cushion from your zafu that you can straddle with your legs, knees on the floor and backside resting on the cushion. If your zafu isn't big enough on its own, use additional cushions, mats, and/or blankets to build up the height needed to support this position. Lay one or multiple mats on the floor. Your knees will be supporting a fair amount of your body weight, so it’s helpful to give them some cushioning. Place at least one meditation mat or soft blanket on the floor, and use more than one if needed to provide additional cushioning. [10] X Research source The rolled cushion needs to be sturdy enough so that you can keep your upper body straight, rather than slouching down into the cushion.\\"
    },
    {
      "title": "Straddle the rolled cushion with your lower legs flat on the mat.",
      "content": "Straddle the rolled cushion with your lower legs flat on the mat. Imagine that you are sitting on a bicycle or a horse. Your lower legs and knees should be flat on the floor and against the sides of the cushion, your upper legs should be at roughly 45-degree angles, and your upper body should be perpendicular to the ground. Your shoulders, hips, and the middle of your shins should all be in a vertical line."
    },
    {
      "title": "Straddle a meditation bench instead of a rolled cushion, if desired.",
      "content": "Straddle a meditation bench instead of a rolled cushion, if desired. Meditation benches typically have 2 legs and a forward-slanted seat. Straddle the seat in the same way you would a rolled-up cushion, with your upper body upright and your lower legs flat on the floor. [11] X Research source Some meditation benches are wide enough that you can tuck your lower legs between the bench legs, rather than straddling them to the outside."
    },
    {
      "title": "Extend your spine straight upward, centering on your lower abdomen.",
      "content": "Extend your spine straight upward, centering on your lower abdomen. Push your lower spine slightly forward and extend your chest slightly out and up. In this position, you should feel as though the top of your head is extending as high as it can and that your belly is your center of gravity. [12] X Research source Your spine doesn’t need to be literally vertical, as this would likely be too uncomfortable to maintain. Rather, focus on stretching your upper body straight upward as much as you can without moderate or greater discomfort."
    },
    {
      "title": "Tuck your chin and direct your gaze on the floor about 4 ft (1.2 m) ahead.",
      "content": "Tuck your chin and direct your gaze on the floor about 4 ft (1.2 m) ahead. Angle your chin very slightly in and down, so that the crown of your head, rather than the top of your head, is your highest point. Angle your eyes a bit further downward so that you’re looking at the floor 3–4 ft (0.91–1.22 m) in front of you. [13] X Research source Close your eyes halfway, as if you have “sleepy eyes.” Look at the floor without fully focusing on it. Don’t close your eyes all the way, or you’ll likely daydream or possibly doze off."
    },
    {
      "title": "Align your lips and teeth and touch your tongue to the roof of your mouth.",
      "content": "Align your lips and teeth and touch your tongue to the roof of your mouth. Your top and bottom lips, as well as your upper and lower rows of teeth, should be aligned and in light contact with each other. Don’t clench your teeth or lips. Lightly press the tip of your tongue to the roof of your mouth, just behind your upper front teeth. [14] X Research source Breathe deeply through your nose while keeping your mouth closed."
    },
    {
      "title": "Rest your wrists on your thighs, overlap your fingers, and touch thumbs.",
      "content": "Rest your wrists on your thighs, overlap your fingers, and touch thumbs. No matter your sitting position—cushion, chair, bench, etc.—lay your wrists on top of your upper thighs. Open your hands with your palms up, and lay the fingers on your left hand on top of those on your right hand. Touch the tips of your thumbs together. The outer sides of both pinkies should be touching, but not pressing against, your abdomen. Now that your body is positioned, you can begin your zen meditation period."
    }
  ]
}