{
  "url": "https://www.wikihow.com/Reboot-a-DSL-Modem-Remotely",
  "title": "How to Reboot a DSL Modem Remotely",
  "steps": [
    {
      "title": "Make sure that you have a hybrid modem.",
      "content": "Make sure that you have a hybrid modem. A hybrid modem combines both your router and your modem into one housing, meaning that you only have one Internet item plugged into your DSL line. If you have a hybrid modem, you should be able to reboot your modem by rebooting your router. If your modem was delivered to you by your Internet Service Provider (ISP) and is separate of your router, skip to the next method ."
    },
    {
      "title": "Ensure that you're connected to the modem's network.",
      "content": "Ensure that you're connected to the modem's network. While you don't need to physically walk over to the modem, your computer must be connected to the modem's network in order to reboot it remotely."
    },
    {
      "title": "Find your router's IP address.",
      "content": "Find your router's IP address. You can do this on both Windows computers and Mac computers ."
    },
    {
      "title": "Open a web browser.",
      "content": "Open a web browser. You'll need to access your router/modem page via the Internet."
    },
    {
      "title": "Enter the IP address.",
      "content": "Enter the IP address. In the browser's address bar, type in the IP address for your router, then press ↵ Enter . This should open your router/modem page."
    },
    {
      "title": "Log into your router's page.",
      "content": "Log into your router's page. If prompted, enter your login name and password. If you didn't set a name and password, these credentials are probably in the manual or on the bottom/back of the router/modem combination unit."
    },
    {
      "title": "Find the \"Restart\" option.",
      "content": "Find the \"Restart\" option. Since different modem models have different page layouts, you may have to poke around in the page's settings. Try looking for the restart option in any of the following areas: Advanced Settings Configuration Help Utilities"
    },
    {
      "title": "Click the Restart option.",
      "content": "Click the Restart option. Again, the appearance of this button will vary depending on your router, so it may say anything from Restart to Power Cycle . Clicking it will prompt the connected router/modem hybrid to restart."
    },
    {
      "title": "Wait for your router and modem to finish rebooting.",
      "content": "Wait for your router and modem to finish rebooting. This can take anywhere from a few seconds to a few minutes. Once the unit finishes rebooting, your computer's Internet should reconnect."
    },
    {
      "title": "Make sure you qualify for this method.",
      "content": "Make sure you qualify for this method. If you're renting your modem from an ISP (e.g., Xfinity or CenturyLink), you can try calling your ISP and asking them to reboot your modem. Not all ISPs will do this for you, but it's the only way to reboot an ISP-owned router when you're away from the network. This usually won't work if you aren't renting your modem from an ISP."
    },
    {
      "title": "Determine who your ISP is.",
      "content": "Determine who your ISP is. If you don't know who your ISP is and you're away from the modem, you can probably find out by looking at your online cable bill or charges on your credit or debit card statement."
    },
    {
      "title": "Look up your ISP's tech support number.",
      "content": "Look up your ISP's tech support number. You can do this by going to https://www.google.com/ in a web browser, searching for your ISP's name and the phrase \"customer service phone number\", and reviewing phone number(s) in the search results. For example, to see Comcast's phone number, you would type comcast customer service phone number into Google and press ↵ Enter to see the phone number at the top of the search results."
    },
    {
      "title": "Call your ISP.",
      "content": "Call your ISP. Dial the customer service number to do so. This will usually result in an automated greeting."
    },
    {
      "title": "Navigate through the automated prompts.",
      "content": "Navigate through the automated prompts. You'll have to indicate that you want to speak with a representative before proceeding; this process will vary depending on the ISP, so follow the spoken instructions until you reach a real person."
    },
    {
      "title": "Present the representative with your account information.",
      "content": "Present the representative with your account information. When asked, tell the representative your phone number, your account number, and/or your address. Not all ISP representatives will require all of this information. Similarly, some ISPs will need more information (e.g., your date of birth) to confirm your account."
    },
    {
      "title": "Ask the representative to reboot your modem.",
      "content": "Ask the representative to reboot your modem. If they can reboot the modem, they should do so, though they may ask you to confirm some account information before they officially reboot your modem."
    }
  ]
}