{
  "url": "https://www.wikihow.com/Party",
  "title": "How to Party",
  "steps": [
    {
      "title": "Choose a time to party when you don’t have other commitments.",
      "content": "Choose a time to party when you don’t have other commitments. Don’t party the night before you have to show up to a class or work. Make sure to balance your social life and responsibilities. If you are planning on drinking, plan on some time to rest and recover the next day during which you don’t have any other commitments."
    },
    {
      "title": "Go out with friends who you trust to look out for each other.",
      "content": "Go out with friends who you trust to look out for each other. Choose to go out with friends who you know will help each other stay safe throughout the night and get home safe at the end of the night. Stick together as much as possible throughout the night to watch each others backs and enjoy the time together. Always have a friend watch your drink if you go to the bathroom and leave it. Don’t leave any friends on their own and make sure everyone knows where everyone else is going at all times. Stick together as much as possible throughout the night."
    },
    {
      "title": "Plan how you will get home safely ahead of time.",
      "content": "Plan how you will get home safely ahead of time. Choose a designated driver from among your friends or plan on a taxi or rideshare service to get you and all your friends home. Plan who is staying where to plan the most efficient route home at the end of the night. [1] X Research source If anyone in the group lives particularly far away from the others, plan for them to sleep over at your house or at one of the other friends’ houses. If someone wants to leave early, make sure to get them to their transportation safely, and have them text or call you when they get home safely."
    },
    {
      "title": "Choose a place to meet in case you and your friends get separated.",
      "content": "Choose a place to meet in case you and your friends get separated. Partying is unpredictable, and it’s easy to get separated if you’re in a crowded bar or club. Pick an area in the venue you are attending where you can all easily find each other if you get separated. [2] X Research source You can also create a group chat on your phone for the whole group that is going out so you can keep everyone updated about your locations throughout the night."
    },
    {
      "title": "Let people know where you are going before you go out.",
      "content": "Let people know where you are going before you go out. This is especially important if you are going out of town or not with a group of friends. Tell some close friends and your family where you plan on going and when you will be back. [3] X Research source Make sure to update your friends and family if your plans change. This way, they won’t get worried if you don’t come home when you said you would and they will know where you are."
    },
    {
      "title": "Eat before you drink to slow down the absorption of alcohol.",
      "content": "Eat before you drink to slow down the absorption of alcohol. Eat carbs to slow down the absorption of alcohol the most. Things like bread, pasta, and potatoes are great pre-drinking foods. This will help keep you from getting over-intoxicated and reduce the chances of alcohol poisoning."
    },
    {
      "title": "Pace yourself if you are drinking and set limits so you don’t get too intoxicated.",
      "content": "Pace yourself if you are drinking and set limits so you don’t get too intoxicated. Everyone has different alcohol tolerances, so it’s important to know what yours is and not pass it. Drink slowly and take breaks to avoid getting too drunk. If you experience symptoms such as dizziness, blurred vision, slurred speech, or poor coordination, then stop drinking and let yourself sober up. Your body can metabolize 1 drink an hour. If you stick to that limit, then you will be able to party the whole night without getting too drunk."
    },
    {
      "title": "Alternate water with alcoholic drinks to prevent a hangover.",
      "content": "Alternate water with alcoholic drinks to prevent a hangover . Staying hydrated will greatly reduce the chances that you have a nasty hangover headache the morning after drinking. Have 1 glass of water for every alcoholic beverage you drink throughout the night to stay hydrated. This also gives your body time to process the alcohol you drink and pace yourself better. Reader Poll: We asked 223 wikiHow readers how they prefer to pace themselves while drinking, and 52% of them said drinking water in between alcoholic drinks. [Take Poll]"
    },
    {
      "title": "Wear something that makes you feel comfortable and confident.",
      "content": "Wear something that makes you feel comfortable and confident. Getting ready for a party is exciting and fun. Pick an outfit for the night that shows off your personal style and flatters your silhouette, but also makes you comfortable physically and mentally. A unique piece of your outfit can also be an ice breaker or conversation starter. Try to pick at least 1 item that stands out, such as a beautiful necklace, a uniquely patterned shirt, or a colorful pair of socks."
    },
    {
      "title": "Bring some food or drinks to share if you are going to someone’s home.",
      "content": "Bring some food or drinks to share if you are going to someone’s home. Showing up to a party with something in hand is a sign of gratitude and good party etiquette. It doesn’t have to be anything expensive or fancy, but a bottle of wine or a bag of chips shows that you put some thought into the night. It isn’t always necessary to bring something to a party with your close friends, but if it’s the first time someone has invited you to their home, then it’s definitely a good move to bring something to share with the host and other guests."
    },
    {
      "title": "Think of 2-3 topics for conversations ahead of time.",
      "content": "Think of 2-3 topics for conversations ahead of time. Bringing good conversation with you to a party is also important, especially if you are not naturally extroverted. Think of 2-3 topics that interest you and that you can talk about comfortably so you can use them when you don’t know what to talk about. Avoid potentially controversial topics, such as religion or politics, when you are first meeting people. These are topics you can discuss later in the night if you and someone else get comfortable and it feels ok to breach more serious topics."
    },
    {
      "title": "Help the host out with something if you are uncomfortable standing around.",
      "content": "Help the host out with something if you are uncomfortable standing around. It might take a while to settle into the environment of a party, especially if you don’t know many people. Help out with serving drinks, clearing glasses, or taking people’s coats to give yourself something to do while you get settled in. This can also help you meet other guests by sparking conversations as you offer them drinks or offer to clear their empty glass away."
    },
    {
      "title": "Mingle with other guests, make eye contact, say hello, and start small talk.",
      "content": "Mingle with other guests, make eye contact, say hello, and start small talk. Small talk may seem trivial, but it is actually the most important first step to starting new relationships of any kind. Make eye contact and smile at people to see who might be interested in talking, then approach them, say hello, and start a conversation about anything. You may think that talking about the weather is a waste of time, but you never know who you might meet! Talking about how it rained all day might lead to an all-night deep conversation with your future soulmate. Small talk can also help you find out if you have things in common with people, so you can make new friends and other connections. Be interested in what other people have to say. Make eye contact, ask questions, listen, and wait your turn to speak."
    }
  ]
}