{
  "url": "https://www.wikihow.com/Prepare-and-Store-Fresh-Thyme",
  "title": "How to Prepare and Store Fresh Thyme",
  "steps": [
    {
      "title": "Set aside the amount you are going to use in your dish, then refrigerate the rest, unwashed.",
      "content": "Set aside the amount you are going to use in your dish, then refrigerate the rest, unwashed."
    },
    {
      "title": "Wrap the surplus sprigs loosely in plastic wrap and place in a sealed plastic container in the warmest part of your refrigerator.",
      "content": "Wrap the surplus sprigs loosely in plastic wrap and place in a sealed plastic container in the warmest part of your refrigerator. [1] X Research source Some people like to bundle the loose sprigs in a paper towel or two before wrapping with plastic. [2] X Research source The thinking is that the paper towels reduce essential oil losses by minimizing the bruising of delicate leaves."
    },
    {
      "title": "Record the contents and the \"use by\" date (one week) on a masking tape (or other) label.",
      "content": "Record the contents and the \"use by\" date (one week) on a masking tape (or other) label."
    },
    {
      "title": "Rinse the harvested sprigs, keeping the leaves attached, with clear, running water.",
      "content": "Rinse the harvested sprigs, keeping the leaves attached, with clear, running water."
    },
    {
      "title": "Pat the sprigs dry using paper towels.",
      "content": "Pat the sprigs dry using paper towels. Be gentle as the delicate leaves bruise fairly easily and will lose some of their essential oils (potency)."
    },
    {
      "title": "Wrap a piece of string or a bay leaf around a few of the stems to bundle them.",
      "content": "Wrap a piece of string or a bay leaf around a few of the stems to bundle them. You can use as many sprigs or as few as you like when creating your \"sprig bouquet.\" Be sure not to tie them too tightly, though, or you might snap the stems. [3] X Research source"
    },
    {
      "title": "Use your thyme sprigs.",
      "content": "Use your thyme sprigs. Thyme bouquets are great when used in marinades or with anything that can be roasted. Just be sure to remove the woody stem prior to consumption."
    },
    {
      "title": "Detach the leaves from the stem using either your fingers or a fork.",
      "content": "Detach the leaves from the stem using either your fingers or a fork. Do this only after the sprigs have been washed well and patted dry. [4] X Research source If you use your fingers, gently hold the top of the stem with one hand and use your other hand to gently pinch and run down the stem detaching the leaves. If you wish to use a fork instead, gently hold the top and run the stem between the tines."
    },
    {
      "title": "Spread the leftover leaves (detached from the stem) on a plate in a cool location.",
      "content": "Spread the leftover leaves (detached from the stem) on a plate in a cool location. [5] X Research source"
    },
    {
      "title": "Check the leaves after several days to see if the drying process is complete.",
      "content": "Check the leaves after several days to see if the drying process is complete. If not, stir the leaves gently and return the plate to the drying area."
    },
    {
      "title": "Push the thyme leaves into a pile when they are dry and transfer the leaves to a resealable container.",
      "content": "Push the thyme leaves into a pile when they are dry and transfer the leaves to a resealable container."
    },
    {
      "title": "Store the dehydrated thyme leaves in the refrigerator.",
      "content": "Store the dehydrated thyme leaves in the refrigerator. [6] X Research source Label the container with the \"packed on\" date and the contents. Note that dried thyme is one of the best herbs for retaining flavor. Still yet, thyme is best fresh (as is the case with most herbs)."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}