{
  "url": "https://www.wikihow.com/Meet-a-Guy-in-College",
  "title": "How to Meet a Guy in College",
  "steps": [
    {
      "title": "Look for guys in your classes.",
      "content": "Look for guys in your classes. Classes offer a convenient way to meet new guys in college. While in class, identify guys that you may be interested in, especially in the classes that are geared toward your major. [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source By meeting guys in classes that are geared toward your major, you can be sure that you will share at least some similar interests."
    },
    {
      "title": "Scope out the common room at your dorm.",
      "content": "Scope out the common room at your dorm. Dorm lounges are always buzzing with people and activities. Ask a friend to hang out with you at the common room. Sit on one of the couches and start looking for guys you may be interested in. [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Alternatively, bring a notebook or book with you to scope it out yourself."
    },
    {
      "title": "Go to a local cafe.",
      "content": "Go to a local cafe. Instead of studying at the library, venture off campus to study at a nearby cafe a couple times a week. By spending more time at the cafe, you may get to know the staff and regulars who frequent the cafe, increasing your chances of meeting new guys. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Give tailgating a try if you enjoy watching or playing sports.",
      "content": "Give tailgating a try if you enjoy watching or playing sports. Tailgating is another great way to meet guys in college. Plan to go with a friend or 2 to the next tailgating event before a big game. Start up a conversation with a guy by asking him if he tailgates often."
    },
    {
      "title": "Join a student club or organization to meet new guys.",
      "content": "Join a student club or organization to meet new guys. Make a list of activities that you may be interested in such as intramural sports, writing, politics, or volunteering. Visit the office of student clubs and organizations on campus to see if there are any clubs that fit your interests. Pick 2 to 3 clubs and plan to go to their next club meeting to see if you would like to join. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Become a member of a local volunteer group.",
      "content": "Become a member of a local volunteer group. Like joining a club on campus, joining a local volunteer group is a great way to meet new people whose interests are similar to yours. Identify different volunteer activities that you may be interested in doing. Search the Internet to find local groups that do the type of volunteer work you are interested in. Plan to go to their next meeting. [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, volunteer at a local community garden, or join a group that helps homeless veterans or victims of human trafficking."
    },
    {
      "title": "Attend a local event.",
      "content": "Attend a local event. Local events are another great way to meet new people, including guys, while you are in college. Find out about local events by scanning local newspapers and magazines. You can also check out the bulletin board at local cafes for upcoming events that you may be interested in. Bring a friend along with you, or go by yourself. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, attend a local arts festival, or attend a fundraiser for a cause that you believe in."
    },
    {
      "title": "Make a weekly schedule.",
      "content": "Make a weekly schedule. In your schedule, carve out time for class, homework, and studying first. Then identify pockets of time when you are free. Fill in these time slots with activities like volunteering, club meetings, local events, and hanging out with friends. [7] X Research source Additionally, keep your weekends free by doing most of your work during the week. This way, you will be able to hang out, attend events, or go out on a date during the weekend."
    },
    {
      "title": "Get ahead on your school work if you have extra time.",
      "content": "Get ahead on your school work if you have extra time. Some assignments may take less time to finish than usual, leaving you with some down time. Instead of taking a break, use this time to get ahead on your school work. Once you are ahead on your school work, you can make more time for friends, hanging out, and meeting guys. Plus, you will be more relaxed when you do hang out. [8] X Research source"
    },
    {
      "title": "Plan a lunch date.",
      "content": "Plan a lunch date. Unless you plan on studying during lunch, make use of your lunch time to meet up with guys you may be interested in. Meet at the dining hall between classes, or go to a restaurant off campus when you aren't so busy. [9] X Research source"
    },
    {
      "title": "Set aside a few hours per week to meet up with a guy.",
      "content": "Set aside a few hours per week to meet up with a guy. Your school schedule may be so busy that finding any time for extracurricular activities may seem impossible. But taking a break from school is necessary if you want to avoid burning out. Make a point to set aside a couple hours a week to plan a lunch, coffee, or movie date with a guy you may be interested in. [10] X Research source Make up for this time by getting up early the next morning, or by working a few extra hours at the end of the next day to finish any school work."
    },
    {
      "title": "Create a profile on an online dating site.",
      "content": "Create a profile on an online dating site. Online dating sites are an efficient, as well as effective, way to meet new people. You don't need to leave the comfort of your own home to meet new guys. Once you create your profile, the site's algorithm will find potential matches for you. You can check the site and manage your account whenever you have down time between classes or during lunch. [11] X Research source Check out online dating sites geared toward college students, such as the following: Date My School Campus Hook University Love Connection College Passions Student Love"
    },
    {
      "title": "Make eye contact and smile.",
      "content": "Make eye contact and smile. Whether you are in class, hanging out in the common room, or at a club meeting, making eye contact is a great way to initiate interaction. Make eye contact with him from across the room a couple times. On the 3rd time, smile to let him know that you are friendly and approachable. [12] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Don’t be surprised if he walks over and introduces himself after noticing you. Reader Poll: We asked 1295 wikiHow readers and 60% of them agreed that the best way to get a girl’s attention at school is by making eye contact and smiling . [Take Poll]"
    },
    {
      "title": "Introduce yourself.",
      "content": "Introduce yourself. If he doesn't approach you after the 3rd eye contact, approach him yourself. Greet him with a smile and introduce yourself to him. Start a conversation by asking him a question. [13] X Research source For example: “Hi. My name is Taylor. I saw that you’re reading Game of Thrones. I love that show. How does the book compare to the series?” If he doesn't seem interested, it is okay. There are a lot of other guys on campus."
    },
    {
      "title": "Ask him what he thinks about the class if you’re in class.",
      "content": "Ask him what he thinks about the class if you’re in class. You can ask him before class starts or after it ends. However, the likelihood of the question turning into a conversation may be greater if you ask him after class. It may even turn into a cup of coffee. [14] X Research source If he seems studious, ask him if you can borrow his notes."
    },
    {
      "title": "Inquire about his interest in the club.",
      "content": "Inquire about his interest in the club. Even though you both may have joined for similar reasons, asking him why he joined the club is a great way to get him talking. The more he talks, the more you can learn about his drives and passions. Having similar passions and drives is a great way to connect with someone. For example: “So why did you decide to join the Students for a Democratic Society?”"
    },
    {
      "title": "Make a statement instead of asking a question.",
      "content": "Make a statement instead of asking a question. Making a statement is simply expressing your opinion about a general situation. Unlike a question, a statement takes the pressure off of him, as well as you, to engage in a conversation. If he responds to your statement, he may be interested in a conversation. If he doesn't respond, then you really haven't risked anything. [15] X Research source For example, you can say: \"I look forward to coming to this class every day. It's so interesting\", \"The weather is so nice today\", or even \"The coffee here is the best!\"."
    },
    {
      "title": "Add him on social media.",
      "content": "Add him on social media. Social media is a great way to keep in touch if you are unsure when you will see him again. Ask him for his social media handle. Once you add him, like and comment on his pictures. Or send him a direct message asking him how he is doing, or if he would like to hang out."
    },
    {
      "title": "Ask for his phone number.",
      "content": "Ask for his phone number. Once you get to know him a little better, and you are sure you are interested in him, don’t be afraid to ask for his phone number. Casually ask for his phone number while you guys are chatting. For example, “Hey, would you mind if I got your phone number to text you to hang out sometime?”"
    },
    {
      "title": "Use your body language.",
      "content": "Use your body language. While you all are talking, maintain eye contact and lean in to show him that you are interested in what he is saying. If he says something funny, don’t forget to smile and laugh. These cues will signal to him that you are interested in him. [16] X Research source If you are comfortable doing so, touch him briefly on the shoulder, arm, or hand while talking or laughing. Touch is a great way to communicate to a guy that you are interested and may want to be more than just friends."
    },
    {
      "title": "Ask him out on a coffee or movie date.",
      "content": "Ask him out on a coffee or movie date. Asking him out on a date is a direct way of saying that you are interested. You can either text him, direct message him on social media, or ask him face to face. If he agrees to go on the date, tell him that you enjoy spending time with him. If you are feeling bold, tell him that you like him. [17] X Research source For example: “I really want to see that new comedy that is coming out this weekend, would you like to join me? Maybe we could grab a bite to eat afterward as well!” If he turns down the date, try not to take it personally as he may just not be ready to move on to that step. If you remain friends, it could develop into something more in the future."
    }
  ]
}