{
  "url": "https://www.wikihow.com/Shrink-Nylon",
  "title": "How to Shrink Nylon",
  "steps": [
    {
      "title": "Check if the nylon is mixed with other materials.",
      "content": "Check if the nylon is mixed with other materials. If it the fabric also contains rayon, linen, cotton, or wool, you can try shrinking it in the washing machine and dryer. If it is pure nylon, it will be harder to shrink. Moreover, it may contract temporarily. [1] X Expert Source Robert Shapiro Laundry Specialist Expert Interview. 24 August 2021. The tag on top of a piece of clothing usually tells you the composition of the fabric by percentage. Remember that shrinking will change length and width. [2] X Expert Source Robert Shapiro Laundry Specialist Expert Interview. 24 August 2021. If you just want something to be shorter, you should hem it instead."
    },
    {
      "title": "Wash the material in the washing machine.",
      "content": "Wash the material in the washing machine. Use the hottest available water setting and the longest wash cycle. If you want to wash the nylon while you shrink it, you can add detergent. You can add ½ cup of ammonia to help keep the color. If you don’t have a hot setting on the washing machine, boil a pot of water, turn off the heat, and soak the fabric for half an hour instead."
    },
    {
      "title": "Dry it in the dryer on medium heat.",
      "content": "Dry it in the dryer on medium heat. Don’t use the hottest setting, because this might melt the nylon. Run the dryer for about 15 minutes. If you have a long dryer cycle, make sure not to let it run all the way through to avoid over shrinking the fabric."
    },
    {
      "title": "Check the size and repeat if necessary.",
      "content": "Check the size and repeat if necessary. The garment may not shrink evenly. [3] X Expert Source Robert Shapiro Laundry Specialist Expert Interview. 24 August 2021. If it has not shrunk enough, repeat washing and drying until it is the right size. You may have to do many cycles, so don't give up after just one! [4] X Research source If it is the right size, wash it in cold water in the future to avoid more shrinking."
    },
    {
      "title": "Measure to the desired length.",
      "content": "Measure to the desired length. If you want to shorten your nylon clothing, try wearing the clothing and marking how much shorter you want it to be with a fabric pencil. It might be helpful to ask someone to help mark it for you as you wear the clothing item. Leave extra room for hem. A standard amount to leave for the hem allowance is1.25 inches (3.2 cm). [5] X Research source"
    },
    {
      "title": "Double-check your measurements and then cut.",
      "content": "Double-check your measurements and then cut. Use sharp scissors and cut slowly and carefully. Children’s scissors and other dull scissors will often create jagged lines. Don’t use scissors that you also use to cut paper. These will be too dull."
    },
    {
      "title": "Fold and iron the hem.",
      "content": "Fold and iron the hem. Make sure the outside of the fabric is facing down on the table. Then fold the first fold up. This should be half of your total hem allowance. Use a low heat on the iron so you don’t burn the nylon and iron over the hem. Then fold the hem over a second time and iron again. [6] X Research source If you don’t want to do a double fold, you can use a single fold hem instead."
    },
    {
      "title": "Pin the hem.",
      "content": "Pin the hem. Push the pin down through the folds and then back up again. You should use enough pins that the fold can stay without you holding onto it. If you put a pin about every 4 inches, that should be enough, though you can use as many pins as you want. [7] X Research source"
    },
    {
      "title": "Sew the hem on the sewing machine.",
      "content": "Sew the hem on the sewing machine. Use a sharp needle and a lightweight nylon thread. Set the stitch length on the sewing machine to no more than eleven stitches per inch. Sew all the way down the hem. If you don’t have a sewing machine, you can sew it by hand."
    }
  ]
}