{
  "url": "https://www.wikihow.com/Remove-Oil-Based-Stains-from-Fabrics",
  "title": "How to Remove Oil Based Stains from Fabrics",
  "steps": [
    {
      "title": "Blot as much oil as possible from the item.",
      "content": "Blot as much oil as possible from the item. As soon as the spill occurs, use paper towels to blot up as much oil as possible from the garment. Don't rub the fabric, which would cause the oil to spread. [1] X Research source"
    },
    {
      "title": "Check the garment care tag.",
      "content": "Check the garment care tag. Before treating the stain, read the care tag on the item. If the item is dry clean only, take it to the cleaners as soon as possible. Otherwise, find out if the garment can be laundered normally or if it needs to be hand washed and laid flat or hung up to dry. Take note of the temperature requirements as well as adjust your stain-removing strategy as needed. [2] X Research source For instance, if your item says to wash in cold water only, use cold water rather than hot in the following steps."
    },
    {
      "title": "Apply powder to the stain and let it sit for 30 minutes.",
      "content": "Apply powder to the stain and let it sit for 30 minutes. You can use baby powder, baking soda, talcum powder, cornstarch, or waterless mechanic's soap to further remove the oil from the fabric. Sprinkle the powder over the oil and let it sit for 30 minutes to absorb as much oil as possible. Then, use a spoon to scrape the oil and powder off the garment. Alternatively, you could rub plain white chalk over the spot to absorb the oil. Looking for other ways to remove grease stains from your clothes? Check out wikiHow’s “How do I get grease stains out of my clothes?” forum ."
    },
    {
      "title": "Scrub the stain with soap and water.",
      "content": "Scrub the stain with soap and water. Rinse the item with hot water, then apply a few drops of regular dish soap to the stain. Scrub the soap into the fabric with a toothbrush, then rinse it with hot water. [3] X Expert Source Safir Ali Professional Dry Cleaner Expert Interview. 15 September 2020. [4] X Research source The dish soap can be clear or colored, just make sure it doesn't have added moisturizers. Make sure the dish soap has some kind of grease-removing additive. [5] X Expert Source Safir Ali Professional Dry Cleaner Expert Interview. 15 September 2020. As an alternative to dish soap, you could use shampoo, laundry soap, or aloe vera gel instead. If you don't have a toothbrush, just rub the stained fabric against itself. The friction should still get a good portion of the oil out. [6] X Expert Source Safir Ali Professional Dry Cleaner Expert Interview. 15 September 2020."
    },
    {
      "title": "Wash the garment by itself.",
      "content": "Wash the garment by itself. As long as your garment is machine washable, you can pop it in the washing machine and launder it as usual. Follow the instructions on the care tag to determine the hottest water temperature the fabric can take. If the item is delicate, hand wash it. If your fabric is delicate, use a gentle detergent."
    },
    {
      "title": "Air dry the garment if the stain remains.",
      "content": "Air dry the garment if the stain remains. Before putting the garment in the dryer, check to see if the stain is gone. You may need to let the item air dry so you can inspect the fabric when it's dry. If you put the item in the dryer and the stain isn't gone, the heat will set it into the fabric. [7] X Research source Be sure to air dry any delicate fabrics rather than putting them in the dryer."
    },
    {
      "title": "Remove a stubborn stain with hairspray or WD-40.",
      "content": "Remove a stubborn stain with hairspray or WD-40. If you let the item air dry and still notice a stain, or if the stain is older and has set in, you can still remove it from your clothing. Spritz hairspray or WD-40 onto the stained fabric. Let it sit for 20 minutes, then launder the item as usual. [8] X Research source Although WD-40 is an oil, it works by “reactivating” set-in stains so they can be easily removed by laundering. Don't use WD-40 on delicate fabrics."
    },
    {
      "title": "Soak up the excess oil.",
      "content": "Soak up the excess oil. Use an old towel or paper towel to blot up as much of the oil as you can. Avoid rubbing the towel into the fabric, which could spread the stain. [9] X Research source"
    },
    {
      "title": "Sprinkle the area with powder and let it sit for 15 minutes.",
      "content": "Sprinkle the area with powder and let it sit for 15 minutes. Use baking soda, talcum powder, baby powder, or cornstarch to soak up the oil. Just sprinkle it on the stain and let it sit for 15 minutes. [10] X Research source"
    },
    {
      "title": "Scrape away the powder and repeat if necessary.",
      "content": "Scrape away the powder and repeat if necessary. Use a spoon to scrape away the powder or vacuum it up. If oil is still visible on the fabric, add fresh powder to the area and let it sit for 15 minutes. Then, scrape it away with a spoon or vacuum it up. [11] X Research source"
    },
    {
      "title": "Blot the stain with soapy water or solvent.",
      "content": "Blot the stain with soapy water or solvent. Mix 2 cups (470 ml) of cool water and 1 tablespoon (15 ml) of dish soap in a bowl or bucket. Dip a clean rag into the soapy water and use it to blot the stain. Keep blotting until the stain is gone. [12] X Research source Alternatively, you could use dry cleaning solvent or Lestoil in place of the soapy water. Be sure to test it on an inconspicuous area of the fabric first."
    },
    {
      "title": "Remove the soap with a clean, damp sponge.",
      "content": "Remove the soap with a clean, damp sponge. Wet a clean sponge with cool water. Press it to the stained area to remove the soap, solvent, or Lestoil and any remaining oil. [13] X Research source"
    },
    {
      "title": "Soak up the excess liquid then allow the fabric to dry.",
      "content": "Soak up the excess liquid then allow the fabric to dry. Blot the wet spot with a clean towel to absorb as much liquid as possible. Then, allow the fabric to air dry. [14] X Research source"
    }
  ]
}