{
  "url": "https://www.wikihow.com/Scare-People",
  "title": "How to Scare People",
  "steps": [
    {
      "title": "Make yourself look creepy.",
      "content": "Make yourself look creepy. Popping out and scaring someone can come off as goofy if you just look like yourself, but if you're dressed all in black with your face covered in fake blood and creepy clown makeup, you'll be scary. [1] X Research source If you know your target well, you can exploit their biggest fear by dressing up as whatever will scare that person the most, whether it's the dentist, a giant spider, or a ghost. Though the quick scare will still be effective if you just look like your regular self, you will frighten your victim at a whole new level if you dress up as someone scary. For more specific costume suggestions, skip to the next section for tips."
    },
    {
      "title": "Wait until your friend is alone.",
      "content": "Wait until your friend is alone. Being in a group helps to bolster your bravery, so it'll be easier if you wait to freak someone out until they're alone. The fright will be much stronger and more real. There are a variety of ways to make this happen, but here are some easy ones: Text your friend to meet you somewhere at a specific time, but have your creepy surprise waiting for them instead. This will give you the chance to set up beforehand. Wait until you know your friend or sibling will be alone and distracted. Alone in their room playing video games, or focusing hard on homework? Perfect. If you want to scare your sibling, set up your frightening scene while they're asleep and let them wake up to it. Super terrifying."
    },
    {
      "title": "Find a good hiding place.",
      "content": "Find a good hiding place. The best scares combine a moment of your victim thinking, \"Wait a minute, that looks creepy\" right before you pop out screaming to terrify them. Wherever you're planning your scare, and whatever it will include, it's a good idea to hide somewhere and wait for your opportunity to jump out and add a last-minute scare. Good hiding places include: Under beds Behind doors Behind trees or cars Under staircases In the dark basement In the attic In plain sight, but in the dark In the closet"
    },
    {
      "title": "Add some creepy props.",
      "content": "Add some creepy props. Find out what gives your friend nightmares and use it to your advantage. This will vary, depending on your friend and what scares them the most, but it's a good idea to do a little digging and find out what will freak them out the most. Think about the following little freaky props: Fake snakes, wetted with petroleum jelly to look really creepy Rusty knives Fake blood Raw meat Worms or cockroaches Static noise on television or radio Broken baby dolls"
    },
    {
      "title": "Scream and howl like a maniac.",
      "content": "Scream and howl like a maniac. After you set your trap, let your victim walk into it, and let it spring into action. Scream, growl, grab the person's arms, and laugh maniacally while enjoying the person's sheer terror. Then, run off into the night, all the while cackling with your head thrown back. You can hide in the distance to watch complete fear overwhelm your victim until he realizes he has been fooled. Alternatively, you can also leave a recording of creepy noises to startle your friend instead. Set up an old boombox to play a recording of you coughing and wheezing creepily, timed to set off when they walk in. When your victim is thoroughly frightened, it's a good idea to start backing off. You don't want to freak them out too much, or risk getting the cops called. Once they scream once, you got your fun, and now know when to call it quits."
    },
    {
      "title": "Make yourself look dead",
      "content": "Make yourself look dead . Everyone's scared of dead people. They're dead. That's scary. If you want to exploit this fear, you can learn to make yourself look like a zombie using basic make-up and safe products. Try out the following tactic: Wash your face thoroughly, then apply some really pale foundation make up all over your face. You could also use some baby powder to dust your face gently and make it appear paler. The pallor of death. Use dark blue or black eye shadow under your eyes to give them that sunken, fresh out of the grave look. Blend it gently to make it look more natural. Nice. Make up some fake blood using food coloring and corn syrup, then draw a fake \"wound\" on your body somewhere visible with marker and bloody it up with the fake blood. [2] X Research source"
    },
    {
      "title": "Dress up like a creepy surgeon.",
      "content": "Dress up like a creepy surgeon. For lots of us, the blood will curdle at the thought of visiting a deranged surgeon or dentist. It's time to have some fun with this fear. Dress up in rubber gloves, some blue scrubs, and cover your mouth like a real surgeon, so only your eyes are exposed. You can get most of these things at most drug stores. You can even go all out and get some surgical equipment to make it as realistic as possible, or at least your dad's power drill from the garage. Unplug it, of course. Splatter some ketchup or fake blood all over your scrubs and carry a knife and fork. You'll look super creepy."
    },
    {
      "title": "Go with a classic monster costume.",
      "content": "Go with a classic monster costume. The classics are classics for a reason. They're scary. Dress up as a zombie , vampire , ghost, or mummy . You could also invent your own monster costume and be even more unique. Look to famous horror-movie characters like Michael Myers, Jason, Freddy Krueger, or Ghost Face from Scream,\" and see if you can get your hands on a realistic looking mask. Wearing a mask over your regular clothes can look somewhat creepy, but if you're wearing what you wore to school that day, it'll probably be a quick tip that it's you."
    },
    {
      "title": "Don't dress up at all, but act creepy.",
      "content": "Don't dress up at all, but act creepy. If you don't have the time or energy to put together a creepy costume, you can use your acting skills to make up for it. It can be even creepier if you look the same, but seem off in some scary way. Try out the following: Just sit in a dark room with the TV blasting static, rocking back and forth, mumbling the sentence, \"They told me this would happen...\" over and over. When your friend starts looking concerned, scream at the top of your lungs. Walk into your sibling's room in the middle of the night and just stand over their bed with your mouth open, drooling fake blood and breathing raggedly. Stand facing the corner in a dark room. Do nothing. When you turn around, have fake blood all over your face."
    },
    {
      "title": "Pick a venue.",
      "content": "Pick a venue. While it takes more time and work, creating a scary environment, such as a haunted house , will build a lingering dread in people's hearts and minds while they expect the worst to happen at any moment. When creating a haunted house or other spooky scene, location is key. A house or structure with scary elements—like narrow hallways, squeaky steps or dark basements—is a good place to start. Make a map for yourself. Make sure people can easily move from room to room without difficulty."
    },
    {
      "title": "Pick a theme.",
      "content": "Pick a theme. A theme will help you decide how to decorate and what elements to include. For true authenticity, come up with a story for why the house is haunted. Is it haunted by an old lady whose husband disappeared into thin air? Is it haunted by a family that was brutally murdered in the basement? Make it at least a little bit believable. [3] X Research source Abandoned insane asylum Torture chamber Vampire's lair Zombie invasion Evil scientist's lab"
    },
    {
      "title": "Get some friends to help.",
      "content": "Get some friends to help. Creating a haunting house on your own can be a challenge. Instead, have your trusted friends dress up as eerie characters and help you decorate the house and spook the guests as they walk through the house. They can leap out at people, hide in closets, or spring out of fake coffins. You can station some guests on the porch, having them \"play dead\" until the guests get close enough. Then, they can jump out at your guests, scaring them before they even set foot in the house."
    },
    {
      "title": "Decorate accordingly.",
      "content": "Decorate accordingly. Create spaces that build tension, which is essential for a good scare. A long, dark hallway that must be followed will have people expecting the worst at any moment. People who are tense and anxious are easier to scare. Each room should have its own spooky theme so your guests are always on their toes and never know what to expect. Station a volunteer in each room to help create the spooky environment and direct the guests. Each room can have differently creepy effects, such as a bowl of cold noodles meant to be worms, or a jar of peeled grapes that are supposed to be eyeballs. Create \"specimen jars\" by placing broken toys or bent utensils in cloudy water that is dyed green."
    },
    {
      "title": "Create scary sound effects.",
      "content": "Create scary sound effects. Sound effects can go a long way in completely scaring a person out of his wits. There are a few things you can do to truly scare your guests with just a few key sounds. [4] X Research source Here are some things to try: Have your volunteers scamper from one side of an empty room to the other, wearing heavy boots. Place a few coins in an empty soda can and tie it to a string. Have your volunteers shake the can to create a \"rattling\" sound. Play a recording of spooky sounds in every room, from the sound of a woman screaming, wind wildly blowing, or the sounds of chainsaw. Make the most of silence. Make the house absolutely silent from time to time so the fear factor goes up during the next spooky sound."
    },
    {
      "title": "Create spooky lighting.",
      "content": "Create spooky lighting. The lighting can also go a long way in scaring the living day \"lights\" out of people. You can build areas of complete darkness, incorporate disorienting strobe lights into one room, or pump in fog in front of a light for an eerie effect, all of which will confuse a person's senses and make him more susceptible to scares. Here are some other ways to create spooky lighting: Designate a hallway where the guests have to wear blindfolds -- just make sure they're comfortable with this. Light a spotlight under fake creepy insects or a spiderweb to create a spooky shadow on the wall. Drape black plastic bags around the furniture to catch a little bit of eerie light."
    },
    {
      "title": "Commit to the mood.",
      "content": "Commit to the mood. Always stay in character in the haunted house to maintain the illusion. Don't stop and say hi to your friends. Keep the haunted house completely scary and believable. Don't break character, not even when you escort your guests out of the house. Later, when the guests tell you they had a great time at your haunted house, act like you have no idea what they're talking about."
    },
    {
      "title": "Concoct a premise.",
      "content": "Concoct a premise. Whether you're making a movie , writing a horror novel or just telling a story , a solid premise is key. Whether it's caused by a spider or a dark room with a sense of dread, fear lives in the brain. Horror movies, suspense novels, or scary campfire stories are all good ways to give people a fright. Watch a scare movie or read a spooky tale for inspiration. Don't just create your story on the spot. Though you can surely improvise, it's important to have your story set before you begin. If you hesitate while you're telling the story, then you will lose your audience."
    },
    {
      "title": "Say it's a true story.",
      "content": "Say it's a true story. Even if your story is wildly untrue, just say it's a true story -- that it happened in your town many years ago, that it happened to your cousin, or that you actually saw it happen. Saying something is actually true will get people to pay attention and will make your story sound more probable. You can even tell people that it's so secret that you can't even read about it online. Say you read about it on microfilm at the local library. Tell people they can do the same to confirm that the story is true -- obviously, no one would do that, but it'll lend more credibility to your tale. Before you jump into the story, you can ask, \"Are you sure you want to hear this?\" Act like the story is so scary that you don't know if you should proceed."
    },
    {
      "title": "Build suspense.",
      "content": "Build suspense. From the long walk up the attic stairs to the slow opening of a door, a good scare needs to be built up and anticipated. Don't just give it all away, or your audience won't be interested. Build anticipation by acting like you're telling a normal story, and let the creepy details slowly make their way into the story. Keep your readers on their toes by saying things like, \"But that's nothing compared to what happened later.\" Or, \"She thought that was the worst pain in the world, but that was only the beginning.\" Talk slowly and carefully. Don't just rush to the scariest parts of the story. Make every word count."
    },
    {
      "title": "Use visual aids.",
      "content": "Use visual aids. Show people your appendectomy scar and say it was where you were stabbed by the killer in question. Bring some old grainy photos of your grandparents and say they're pictures of the victims. If you've brought any other visual aids, just pass them around casually, like you always keep them with you. The fake blood-stained clothes of the victim are also a nice touch. You can even use something ordinary, like the baseball card collection of a little boy who disappeared."
    },
    {
      "title": "Create spooky sound effects.",
      "content": "Create spooky sound effects. The effects can be simple. If you're talking about something knocking on a door in the middle of the night, knock on the floor. Have a friend help out by creating other spooky sounds, like a creaking opened door, raindrops falling on the ceiling, or the wind blowing through the trees. You can also crumple a plastic bag, which creates a great rustling effect."
    },
    {
      "title": "Embellish the details.",
      "content": "Embellish the details. Just like the spooky atmosphere of a haunted house, the details of a scary story help set the scene. Describe the sounds of the abandoned warehouse or show the decaying teeth of the murderous clown. The more specific your scary story is, the better. For example, a man whose hand was severed is scary enough, but a man with a severed hand whose veins leave a trail of blood wherever he walks is even more frightening. Ground the story in history. If it was before World War II, casually mention who the president was, or bring up a detail from that period to make the story sound more realistic."
    },
    {
      "title": "Keep it surprising.",
      "content": "Keep it surprising. Don't reveal the ordinary details that people would expect to hear in any scary story. Sure, everyone has heard the story of a ghost who haunts the woods late at night, but how about the story of a ghost who makes people eat their own eyeballs, or a ghost who inhabits the body of a little girl's pet rabbit?"
    },
    {
      "title": "Tease the ending.",
      "content": "Tease the ending. When the story gets really scary, slow down or even clam up, like you can't bear to finish the story. Take a deep breath and wait for people to ask what happened next. Finally, make your voice absolutely calm as you reveal the gruesome ending. The spookiest endings are unresolved. Don't solve the mystery. Leave your audience to wonder if the ghost or scary person in question is still alive -- maybe even wandering in the woods nearby. When the story's over, go absolutely silent, like you were so overwhelmed by the ending that you can't possibly go on."
    }
  ]
}