{
  "url": "https://www.wikihow.com/Overcome-the-Fear-of-Death",
  "title": "How to Overcome the Fear of Death",
  "steps": [
    {
      "title": "Write down the times when you think about death.",
      "content": "Write down the times when you think about death. The first thing to determine when dealing with a fear of death is how – and how much – your fear affects your life. We are not often immediately aware of the environmental triggers or causes of our fears and anxiety. Writing about the situations in which they arise can be a helpful tool for working through these issues. [4] X Research source Start by simply asking yourself, “What was going on around me when I started feeling afraid or anxious in that moment?” For a number of reasons, this can be a very difficult question to answer at first. Start with the basics. Think back over the last few days and write down as many details as you can remember about the times you thought about death. Include exactly what you were doing when the thoughts arose. The fear of death is very common. Throughout human history, people have been concerned and preoccupied with the idea of death and dying. This can happen for several reasons, including your age, your religion, your level of anxiety, the experience of loss, and so on. For example, during certain transitional phases in your life, you may be more prone to having a fear of death. People may have a deeper preoccupation with death in the ages 4-6, 10-12, 17-24, and 35-55. Scholars have long philosophized about the prospect of death. According to the existentialist philosopher Jean-Paul Sartre, death can be a source of fear for people precisely because it is that which “comes to us from the outside and transforms us into the outside.” [5] X Research source Sartre, Jean-Paul. Being and Nothingness. trans. Hazel Barnes. New York: Philosophical Library, 1956, p. 545. The process of death, therefore, represents to us the most radical unknown dimension imaginable (or, in a sense, unimaginable). As Sartre points out, death has the potential to transform our living bodies back into the non-human realm from which they initially emerged."
    },
    {
      "title": "Make note of when you feel anxious or afraid.",
      "content": "Make note of when you feel anxious or afraid. Next, write down any of the times you can remember deciding not to do something because you were afraid or anxious. Write down instances even if you aren't sure about whether or not the emotions were necessarily related in any way to death or dying."
    },
    {
      "title": "Compare your anxiety with thoughts of death.",
      "content": "Compare your anxiety with thoughts of death. After you have one list of thoughts of death and one list of anxious moments, look for commonalities between the two. For example, you might notice that every time you see a particular brand of candy you feel some degree of anxiety, but you're not sure why. Then you realize that you think about death during these same situations. You might remember that the brand of candy in question was served at your grandparent's funeral. Then you also began feeling some degree of fear at the thought of death in general. Such connections, between objects, emotions, and situations, can be quite subtle, sometimes even more so than the scenario described above. But writing them down can be a great way to start becoming more aware of them. Then you can better influence how you manage the way you're affected in such moments."
    },
    {
      "title": "Recognize the link between anxiety and anticipation.",
      "content": "Recognize the link between anxiety and anticipation. Fear is a potent force that can potentially influence just about anything you do. If you can start to look beyond your fear, you may find that the actual event you're dreading is not as terrible as think it is. Anxiety is usually wrapped up in anticipation about how things will or won't go. It is an emotion that looks to the future. Keep reminding yourself that fear of death is sometimes worse than death itself. Who knows, your death may not be as unpleasant as you imagine it to be. [6] X Research source"
    },
    {
      "title": "Be honest with yourself.",
      "content": "Be honest with yourself. Be completely honest and fully face the fact of your own mortality. It will eat away at you until you do. Life becomes much more valuable when its temporarily is realized. You know that you will face death sometime, but you don't have to live life in fear. When you are honest with yourself and face your fear head-on, you will be able to start deconstructing this phobia."
    },
    {
      "title": "Focus on what you can control.",
      "content": "Focus on what you can control. Death can be an especially frightening thing to think about, primarily because it exposes the limits of life and what we are able to conceive. Learn to focus on what you can actually control while still engaging with what you cannot. For example, you may be worried about dying from a heart attack. There are certain factors that you can't control about heart disease, such as family history, race and ethnicity, and age. You will make yourself more anxious by focusing on these things. Instead, it's far healthier to focus on the things you can control, like quitting smoking, exercising regularly, and eating well. In fact, you are at higher risk for heart disease when you have an unhealthy lifestyle than just by the uncontrollable factors alone. [7] X Research source"
    },
    {
      "title": "Guide your life.",
      "content": "Guide your life. When we want to control the direction of our lives, we are often met with disappointment, frustration and anxiety about things that don't go as planned. Learn to loosen your grip on how tightly you control the outcomes of your life. You can still make plans, of course. Guide the course of your life. But allow some room for the unexpected. A fitting analogy is the idea of water flowing in a river. Sometimes the river bank will change, the river will curve, and the water will slow down or speed up. The river is still flowing, but you have to let it go where it takes you."
    },
    {
      "title": "Eliminate unproductive thought patterns.",
      "content": "Eliminate unproductive thought patterns. When you try to predict or imagine the future, you find yourself asking, “What if this happens?” This is an unproductive thought pattern known as catastrophizing. An unproductive thought pattern is a way of thinking about a situation that ultimately causes you to have negative emotions. How we interpret an event will result in the emotion we feel from it. For example, if you are worried that you're late for work, you might tell yourself, “If I'm late, I will get reprimanded by my boss and I'll lose my job.” Having unproductive thought patterns can put you on edge if you feel like you want to control the outcome so strongly. Replace unproductive thinking with positive thinking. Reason through your unproductive thought patterns. For example, say to yourself, \"If I'm late, my boss might get mad. But I can explain that there was more traffic than normal. I'll also offer to stay late after work to make up the time.\""
    },
    {
      "title": "Have a worry time period.",
      "content": "Have a worry time period. Devote five minutes during the day when you will allow yourself to worry about something. Do this at the same time every day. Try not to schedule this worry period for bedtime, because you don't want to lay in bed fretting over things. If you have a worrying thought any other time during the day, save it for your worry time period. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Challenge your anxious thoughts.",
      "content": "Challenge your anxious thoughts. If you are struck with anxieties about death, ask yourself about the chances of dying in certain scenarios. Arm yourself with statistics about dying in a plane crash, for example. You will likely find that your worries are inflated beyond the reality of what could possibly happen. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Think about how you're affected by others.",
      "content": "Think about how you're affected by others. When other people's worries start taking over your mind, you'll think more about risks too. Perhaps you have a friend who is particularly negative about diseases and illnesses. This causes you to feel nervous about getting ill yourself. Limit time you spend with this person so that these thoughts don't enter into your head so frequently. [10] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Try something you've never done before.",
      "content": "Try something you've never done before. We often avoid trying new things and putting ourselves in new situations precisely because of fears regarding what we do not yet know or cannot yet understand. [11] X Research source Knaus, D. W. J., &amp; Carlson, J. P. E. (2014). The Cognitive Behavioral Workbook for Anxiety: A Step-By-Step Program (Second Edition edition). Oakland, CA: New Harbinger Publications. In order to practice letting go of control, pick an activity you'd never consider doing and commit to giving it a try. Start by doing some research on it online. Next, maybe talk to people who have participated in the activity before. As you start to become more comfortable with the idea of it, see if you can't give it a try once or twice before making an especially long commitment to it. This method of experimenting with life and new activities can be a great tool for learning how to focus on producing joy in life as opposed to worrying about death and dying. As you participate in new activities, you will likely learn a lot about yourself, especially in regard to what you can and cannot control."
    },
    {
      "title": "Develop an end-of-life plan with your family and friends.",
      "content": "Develop an end-of-life plan with your family and friends. When it comes to death, you will likely come to realize that most of the process will be completely out of your control. There's no way we can ever know for sure exactly when or where we can die, but we can take some steps so as to become more prepared. [12] X Research source If you are in coma, for example, how long would you want to remain on life support? Do you prefer to pass in your home or remain in the hospital as long as possible? It might be uncomfortable talking about these issues with your loved ones at first, but such conversations can be incredibly helpful for both you and them if an unfortunate event arises and you are unable to express your desires in the moment. Such discussions might potentially help you feel a little less anxious towards death."
    },
    {
      "title": "Consider how life and death are part of the same cycle.",
      "content": "Consider how life and death are part of the same cycle. Recognize that your own life and death, as well as the lives of other creatures, are all parts of the same cycle or life-process. Life and death, rather than being two completely different events, are actually always occurring at the same time. The cells in our bodies, for example, are continuously dying and regenerating in different ways throughout an individual lifetime. This helps our bodies adapt and grow within the world around us. [13] X Research source Edelman, G. (1987). Neural Darwinism: The Theory Of Neuronal Group Selection (New edition edition). New York: Basic Books."
    },
    {
      "title": "Think about how your body is part of a complex ecosystem.",
      "content": "Think about how your body is part of a complex ecosystem. Our bodies serve as fertile ecosystems for countless different life forms, especially after our own lives come to an end. [14] X Research source While we are alive, our gastrointestinal system is home to millions of micro-organisms. These all help our bodies stay healthy enough to support proper immune functioning, and, in certain ways, even complex cognitive processing. [15] X Trustworthy Source International DOI Foundation (IDF) Registry of published versions of academic, professional, and government information, such as journal articles, research reports, data sets, and official publications. Go to source"
    },
    {
      "title": "Know the role your body plays in the grand scheme of things.",
      "content": "Know the role your body plays in the grand scheme of things. On a much larger, macro level, our lives fit together in unique ways to form societies and local communities which depend upon our bodies' energy and actions in order to sustain some degree of organization. [16] X Trustworthy Source International DOI Foundation (IDF) Registry of published versions of academic, professional, and government information, such as journal articles, research reports, data sets, and official publications. Go to source Your own life is composed of the same mechanisms and materials as other lives around you. Understanding this point can help you become more comfortable with the thought of a world without your particular self still being around. [17] X Research source Hanh, T. N. (2003). No Death, No Fear: Comforting Wisdom for Life (Reissue edition). New York: Riverhead."
    },
    {
      "title": "Spend time in nature.",
      "content": "Spend time in nature. Go on meditative walks in nature. Or, you can simply spend more time outside around many different life forms. These activities can be great ways to become more comfortable with the realization that you're a part of a larger world. [18] X Research source Thoreau, H. D., &amp; MacMechan, A. (n.d.). Walking."
    },
    {
      "title": "Consider the afterlife.",
      "content": "Consider the afterlife. Try thinking that after you die you will go somewhere happy. Many religions believe in this. If you ascribe to a particular religion, you may find comfort in considering what your religion believes about the afterlife."
    },
    {
      "title": "Live life to the fullest",
      "content": "Live life to the fullest . Ultimately, it's best to avoid spending too much time worrying about death and dying. Instead, fill each day with as much joy as possible. Don't let little things get you down. Go outside, play with friends, or take up a new sport. Just do anything that will take your mind off dying. Instead, focus your mind on living. Many people with the fear of death think about it daily. It means that you have a lot of things you want to do in life. Let the fear work through and ask yourself, “What is the worst thing that will happen today?” Today you are alive, so go and live."
    },
    {
      "title": "Spend time with your loved ones.",
      "content": "Spend time with your loved ones. Surround yourself with people that make you happy and vice versa. Your time will be well-spent – and well-remembered – when you share yourself with others. For example, you can rest assured that your memory will live on after you die if you help your grandchildren develop happy memories of you."
    },
    {
      "title": "Keep a gratitude journal.",
      "content": "Keep a gratitude journal. A gratitude journal is a way for you to write down and acknowledge the things you're thankful for. This will help keep your focus on the good things in your life. [19] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Think of good things about your life and cherish them. Take some time every few days to write down a moment or thing that you're grateful for. Write in depth, savoring the moment and appreciating the joy you've received from it."
    },
    {
      "title": "Take care of yourself.",
      "content": "Take care of yourself. Avoid getting involved in bad situations or doing things that can raise your chances of dying. Avoid unhealthy activities like smoking, drug or alcohol abuse, and texting while driving. Staying healthy removes some of the risk factors that can lead to death."
    },
    {
      "title": "Determine if you need to seek help from a mental health therapist.",
      "content": "Determine if you need to seek help from a mental health therapist. If your fear of death has become so intense that it is interfering with your ability to carry out normal activities and enjoy your life, you should seek the help of a licensed mental health therapist. For example, if you start avoiding certain activities due to your fear of impending death, then it is time to get help. [20] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Other signs that you may need to seek help include: feeling disabled, panicky, or depressed because of your fear feeling like your fear is unreasonable dealing with the fear for more than 6 months"
    },
    {
      "title": "Understand what you can expect from a mental health therapist.",
      "content": "Understand what you can expect from a mental health therapist. A therapist can help you to better understand your fear of death and find ways to minimize it and hopefully overcome it. Keep in mind that dealing with a profound fear takes time and effort. It can take a while before your fears become manageable, but some people see a dramatic improvement in just 8-10 therapy sessions. Some of the strategies that your therapist might use include: [21] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Cognitive Behavioral Therapy : If you are afraid of dying, you may have certain thought processes that intensify your fear. Cognitive behavioral therapy is a method that therapists use to get you to challenge your thoughts and identify the emotions associated with those thoughts. For example, you may think to yourself, “I can't fly because I am afraid the plane will crash and I will die.” Your therapist will challenge you to realize that this thought is unrealistic, perhaps by explaining that flying is actually safer than driving. Then, you will be challenge to revise the thought so that it is more realistic, such as, “People fly on planes every day and they are fine. I am sure that I will be fine too.” [22] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Exposure Therapy : If you are afraid of dying, you may start avoiding certain situations, activities, and places that intensify your fear. Exposure therapy will force you to confront that fear head on. In this type of therapy, your therapist will either ask you to imagine that you are in the situation you have been avoiding or they will ask you to actually put yourself into the situation. For example, if you have been avoiding flying because you are afraid the plane will crash and you will die, your therapist may ask you to imagine that you are on a plane and describe the way you feel. Later, your therapist may challenge you to actually fly on a plane. [23] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Medications : If your fear of dying is so profound that it is causing you to have severe anxiety, your therapist may refer you to a psychiatrist who can prescribe medicine that may help you. Keep in mind that the medicines used to treat anxiety associated with fear will only reduce your anxiety temporarily. They will not take care of the root cause. [24] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Share your thoughts on death and dying with others.",
      "content": "Share your thoughts on death and dying with others. It's always good to talk to someone about your fears or anxiety. Others may be able to share similar concerns. They may also suggest methods that they've used for dealing with the associated stress. [25] X Research source Shaver, P. R. (2012). Meaning, Mortality, and Choice: The Social Psychology of Existential Concerns. (M. Mikulincer, Ed.). Washington, DC: American Psychological Association. Find someone you trust and explain to her what you think and feel about death, and how long you've felt this way."
    },
    {
      "title": "Visit a death café.",
      "content": "Visit a death café. Issues related to death and dying can be particularly difficult for people to talk about in general. It is important to find the right group with whom to share your ideas regarding these issues. [26] X Research source There are “death cafes,” which are groups of people who meet in cafes specifically to discuss issues around death. These are essentially support groups for people looking to handle their emotions around death. The groups determine together how to best live life in the face of death. If you cannot find one of these cafes near you, consider starting your own. Odds are there will be lots of people in your area with concerns about death but who haven't had the opportunity to share their concerns."
    }
  ]
}