{
  "url": "https://www.wikihow.com/Patch-a-Leak-in-an-Air-Mattress",
  "title": "The Best Patch Kits and DIY Fixes for a Leaky Air Mattress",
  "steps": [
    {
      "title": "Inflate the air mattress",
      "content": "Inflate the air mattress fully to test for a leak. Use the air pump that came with your mattress to inflate it. Keep your mattress inflated the entire time you search for the leak so it will be easier to detect. Even with a leak, your mattress will still maintain enough air to find the hole or tear. [1] X Research source If you feel the mattress becoming soft, reinflate it before you start searching again. The higher the air pressure inside the mattress, the more noticeable the leak will be."
    },
    {
      "title": "Check for a loose or damaged air valve.",
      "content": "Check for a loose or damaged air valve. Hold your hand over the valve and feel for any escaping air. Make sure the valve is completely plugged and isn’t leaking back out from the stem. Then, check the area around the valve stem to see if there are any tears or holes in the seams surrounding it. If you don’t notice any damage around the valves, then the leak is located somewhere else. [2] X Research source If the valve is damaged, then it’s better to replace the full mattress rather than trying to fix it."
    },
    {
      "title": "Stand the mattress up on its side to check the bottom for leaks.",
      "content": "Stand the mattress up on its side to check the bottom for leaks. The majority of punctures and leaks occur on the bottom of the air mattress since something on the ground could have poked through. Stand the mattress up on its side and lean it against the wall to inspect the bottom. [3] X Research source"
    },
    {
      "title": "Listen for hissing sounds coming from your mattress.",
      "content": "Listen for hissing sounds coming from your mattress. Stand the mattress up on its side and lean it against a wall. Keep your ear about 2–3 inches (5.1–7.6 cm) away from your mattress, and slowly move your head across the entire surface. Start with the bottom of your air mattress before checking the sides and top. Try to listen for the thin, hissing noise of air escaping your mattress. [4] X Research source Most punctures and tears happen on the bottom of your air mattress since something on the ground could easily poke through and cause a leak."
    },
    {
      "title": "Run your hand over the surface to feel the air escaping.",
      "content": "Run your hand over the surface to feel the air escaping. Hold the back of your hand 2 inches (5.1 cm) away from your mattress. Push the mattress in with your other hand to increase the air pressure coming from the leak. Move your hand slowly across the entire surface until you feel a steady stream of air. [5] X Research source Try wetting the back of your hand before running it over your mattress. The escaping air will make the water feel cooler so the leak is easier to detect."
    },
    {
      "title": "Spray soapy water on your mattress and look for bubbles.",
      "content": "Spray soapy water on your mattress and look for bubbles. Fill a spray bottle with water and a few drops of dish soap, and mix them together. Lightly spray your mattress with the soapy water, starting near the valve and seams. Then, check the bottom and top of your mattress. Look for any areas where new bubbles are forming, which are a sign that air is leaking out. When you find the leak, wipe off all the soapy water with a clean towel. [6] X Research source Work in small sections spraying and drying your mattress so you don’t have as much to clean up."
    },
    {
      "title": "Circle the hole with a marker so it’s easier to see.",
      "content": "Circle the hole with a marker so it’s easier to see. When the mattress is deflated it will be nearly impossible to find the leak again. Draw a small circle or make a small dot on your mattress so you know where to apply your patch later on. [7] X Research source"
    },
    {
      "title": "Completely deflate the mattress.",
      "content": "Completely deflate the mattress. Undo the mattress’s valve so the air can escape. If all the air doesn’t come out on its own, press down on your mattress to force the rest of the air out through the valve. [8] X Research source Avoid putting a patch on while your mattress is inflated since air could get underneath the patch and ruin the adhesion."
    },
    {
      "title": "Smooth out the area around the hole with 120-grit sandpaper.",
      "content": "Smooth out the area around the hole with 120-grit sandpaper . Apply gentle pressure as you rub the sandpaper on your mattress. If your hole is on the top of your mattress and it has a fuzzy texture, sand the texture off of the mattress so the patch sticks to the material easier. [9] X Research source Be careful not to press too hard with your sandpaper since it could thin the mattress material and potentially create another hole. Most patch kits come with a small piece of sandpaper so you don’t need to buy it separately."
    },
    {
      "title": "Clean around the leak",
      "content": "Clean around the leak with isopropyl alcohol . Wet a clean cloth with your isopropyl alcohol, and wipe off the area around your leak so there isn’t any dust, dirt, or debris surrounding the hole. When you’re finished, pat the area dry with paper towels and let it air-dry for a few minutes. [10] X Research source If you try applying the patch while your mattress is still wet, then it may not stick well and could come loose later on."
    },
    {
      "title": "Cut out a patch that extends 1 in (2.5 cm) past the hole’s edges.",
      "content": "Cut out a patch that extends 1 in (2.5 cm) past the hole’s edges. Get a vinyl patch kit so you have everything you’ll need to fix the hole in your air mattress. Use a pair of scissors to cut the patch so it fits over the hole. Round the corners of the patch so it’s less likely to peel up later on. [11] X Research source If you don’t have a patch kit, you can also cut a patch from a sturdy piece of plastic, such as a vinyl shower liner."
    },
    {
      "title": "Secure the patch onto your mattress with its adhesive backing or rubber cement.",
      "content": "Secure the patch onto your mattress with its adhesive backing or rubber cement . If your patch has an adhesive backing, then simply peel off the backing paper and press it over the hole. If the patch doesn’t have any adhesive, spread rubber cement on the back of the patch and onto the area around the hole. Press the patch down firmly so it makes good contact with your mattress. [12] X Research source Follow the directions that came with your patch kit since they may vary. Be careful not to get any adhesive inside or on any other part of your mattress. Otherwise, it may make the sides of your mattress stick together and form new tears."
    },
    {
      "title": "Set a 10 lb (4.5 kg) weight on your patch for 6–8 hours.",
      "content": "Set a 10 lb (4.5 kg) weight on your patch for 6–8 hours. Use either an exercise weight or stack a few flat, heavy books on top of the patch while it sets. Since the adhesive needs time to completely set and seal the hole, leave your mattress deflated while it dries. [13] X Research source If you try inflating your mattress too soon, it could make the patch come loose."
    },
    {
      "title": "Inflate the mattress and check for leaks.",
      "content": "Inflate the mattress and check for leaks. Use your air pump to blow up the mattress completely. Then, place your ear right next to the patch and listen for any escaping air. If no one needs it to sleep, leave the mattress inflated overnight and return in the morning to make sure no more air is escaping. [14] X Research source If there’s still air leaking out from the patch, then it may not have adhered properly. You can try patching over it again, or it may be time to get a new air mattress."
    },
    {
      "title": "Cover a hole with a piece of duct tape for a quick fix.",
      "content": "Cover a hole with a piece of duct tape for a quick fix. Once you know where the leak is, cut off a piece of duct tape that’s about 1 inch (2.5 cm) larger than the hole or tear. Press the duct tape firmly over the hole so it doesn’t have any raised edges or wrinkles. For added protection, stick 4 more pieces of duct tape along the edges of the strip you just placed. [15] X Research source The adhesive on the back of duct tape will start to break down after blowing up your mattress a few times, but it will at least stay inflated through a few nights of sleep. If your air mattress is still losing air after you cover the leak, then try putting another layer of duct tape over the hole."
    },
    {
      "title": "Fix a tear in your mattress’s seam with a hot glue gun.",
      "content": "Fix a tear in your mattress’s seam with a hot glue gun . Heat up your glue gun on the lowest temperature setting while your mattress deflates. Smooth out the torn section of your mattress so it lays flat on the floor. Once the glue is hot, run a bead along the edges of the tear. Wait about 5–10 minutes for the glue to completely dry before inflating your mattress again. [16] X Research source Hot glue will start to crack and break down after you inflate your mattress a few times, so be sure to actually patch it as soon as you can. Avoid touching the tip of your glue gun against the mattress since it could melt the material or make another hole. Gluing your mattress or applying a DIY patch could potentially void the manufacturer’s warranty. Read through the warranty to see if you’re eligible for any replacements before you try a DIY method."
    },
    {
      "title": "Try filling a small hole with a dab of super glue.",
      "content": "Try filling a small hole with a dab of super glue . While the mattress is deflated, squeeze a small dab of super glue directly onto the hole so it creates a thin, even layer over the surface. Make sure the super glue doesn’t touch any other part of your mattress so it doesn’t create any other holes. Let the glue dry for a minimum of 4 hours before using your mattress again. [17] X Research source Super glue works best on pinholes and tiny punctures. If you have a bigger hole, you’re better off using duct tape or an actual patch."
    },
    {
      "title": "Use a piece of Flex Seal Tape to make a tight seal over the leak.",
      "content": "Use a piece of Flex Seal Tape to make a tight seal over the leak. Cut the piece of Flex Tape into a circle that extends past the edges of the leak by at least 1 inch (2.5 cm). Deflate your mattress and smooth out any wrinkles on the surface. Then, just peel the backing paper off the Flex Tape and press it firmly onto your mattress. Let the Flex Tape set for about 15 minutes before trying to blow up your mattress again. [18] X Research source"
    }
  ]
}