{
  "url": "https://www.wikihow.com/Pull-Out-a-Loose-Tooth",
  "title": "How to Pull Out a Loose Tooth",
  "steps": [
    {
      "title": "Watch for wide movement.",
      "content": "Watch for wide movement. Before anyone tries to pull a baby tooth out, it should be moving quite a bit. That is, your child should be able to move it back and forth and side to side without much pain. Lots of movement means the tooth is about ready to come out. [2] X Research source As noted, it's always best to let the baby tooth fall out on its own if possible."
    },
    {
      "title": "Wiggle it often.",
      "content": "Wiggle it often. Wiggling it is a great way to start getting that tooth out. Have your child wiggle it around with their tongue. They can do this movement throughout the day until the tooth falls out. Tell your child to only wiggle it as much as they can without discomfort. [3] X Research source"
    },
    {
      "title": "Have the child chomp on hard foods.",
      "content": "Have the child chomp on hard foods. To speed up the loosening process, offer carrots, apples, or other crunchy foods to help loosen the tooth gradually. It might even come out on its own with the child barely noticing."
    },
    {
      "title": "Pull it out with a tissue.",
      "content": "Pull it out with a tissue. The best way to pull out a kid's tooth is to grasp it with tissue or gauze. Try to pull the tooth out with a gentle tug. If the tooth is especially resistant or the child cries out, it's best to wait a few days. However, the tooth will often come right out. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Some kids won't like you touching their teeth at all, and in that case, it's best to leave it alone. You can also let the child try to pull it out themselves."
    },
    {
      "title": "Consult the dentist.",
      "content": "Consult the dentist. Try to be sure that the tooth is naturally loose, rather than from an accident, decay, or another reason. Talk to your doctor if you have doubts. If it takes more than two to three months to come out, it's also a good idea to see the dentist. Ask whether or not the tooth should be removed or left to fall out on its own. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source After consulting the dentist, be sure to follow their advice exactly."
    },
    {
      "title": "Care for the gums.",
      "content": "Care for the gums. If the area is bloody after the tooth falls out, hold a cotton ball gently to the gum. You can also have the child bite on it. You may need to hold it on as long as 30 minutes, as gums take longer to clot than other parts of the body."
    },
    {
      "title": "Visit a dentist.",
      "content": "Visit a dentist. If at all possible, you should go to a dentist to extract an adult tooth. Your adult teeth have longer roots, making it much more painful to remove an adult tooth. Plus, you'll likely have infection underneath that the dentist will need to deal with. [6] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020. Tooth extraction is a serious medical procedure. Apart from being painful, you can lose a lot of blood and develop an infection without proper care. If you can't afford a regular dentist, look for a dental school in your area that may do it cheaper. Also, many cities have free or cheap temporary dental clinics from time to time, which may make it affordable for you."
    },
    {
      "title": "Don’t attempt to remove the tooth.",
      "content": "Don’t attempt to remove the tooth. Never try to remove an adult tooth on your own. It’s a job that should only be left to licensed dentists. Trying to extract a tooth on your own – or with the help of an unlicensed dentist – could put you at risk of serious medical complications. Be aware that there are many things that could wrong. The tooth could be improperly removed, causing infection or nerve and tissue damage. Also know that practicing dentistry without a license is illegal. Depending on where you live, it can be either a misdemeanor or a felony and lead to fines, probation, or even imprisonment. [7] X Research source"
    },
    {
      "title": "Take pain medications.",
      "content": "Take pain medications. Having a tooth removed can be a painful procedure. Try an NSAID like ibuprofen or naproxen sodium for pain. Acetaminophen is also okay. [8] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020. Skip aspirin, as it could make the bleeding worse. [9] X Research source Taking vitamin C may also help the healing process."
    },
    {
      "title": "Be especially gentle for the first 24 hours.",
      "content": "Be especially gentle for the first 24 hours. Don't rinse your mouth for the first 24 hours. You can eat and drink lukewarm food, though not in the area where you removed the tooth. Make sure you're eating on the other side. You need to leave the hole alone as much as possible. [10] X Research source"
    },
    {
      "title": "Avoid alcohol for the first 24 hours.",
      "content": "Avoid alcohol for the first 24 hours. Alcohol may seem logical since it can help you avoid the pain. However, it can keep the wound from healing properly. In addition, it can make it bleed more, which you definitely don't want. [11] X Research source"
    },
    {
      "title": "Brush your teeth after the first 24 hours.",
      "content": "Brush your teeth after the first 24 hours. You will need to brush your teeth, but you should wait a day. When you do brush your teeth, be especially gentle around the extraction site. You don't want to pull up the clot accidentally. [12] X Research source"
    },
    {
      "title": "Use a saltwater rinse.",
      "content": "Use a saltwater rinse. [13] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020. It can also help to rinse with saltwater after the first 24 hours, which can remove some bacteria. Dissolve a teaspoon of salt in a glass of water. Swish it around in your mouth for 20 to 30 seconds, particularly near the clot, and then spit it out. [14] X Research source"
    }
  ]
}