{
  "url": "https://www.wikihow.com/Play-We%27re-Not-Really-Strangers",
  "title": "How to Play We’re Not Really Strangers",
  "steps": [
    {
      "title": "Place the box of cards in the middle of your play area.",
      "content": "Place the box of cards in the middle of your play area. The WNRS card box is divided into 3 sections: Level 1, Level 2, and Level 3. Position the box so the card questions are facing away from the other players; this way, no one can cheat and sneak a peek at the question cards ahead of time. [1] X Research source Level 1 cards are known as “Perception” cards, and are all about your impressions of yourself and the other players. Level 2 cards are called “Connection” cards, and take a deeper emotional dive into each player’s past. Level 3 cards are known as “Reflection” cards, and give you a chance to reflect on the connections you’ve made with the other players. [2] X Research source You can also remove each stack of cards from the box and arrange them in 3 piles. [3] X Research source"
    },
    {
      "title": "Remove the “Final Card” and set it next to the card box.",
      "content": "Remove the “Final Card” and set it next to the card box. Every WNRS box includes a “Final Card”; as the name suggests, this is the last card that you play. You don’t use it for the majority of the game, so it’s best to set it aside beforehand. [4] X Research source"
    },
    {
      "title": "Hand a “Dig Deeper” tile to each player.",
      "content": "Hand a “Dig Deeper” tile to each player. Every WNRS box comes with 2 clear tiles that have “Dig Deeper” printed on them in black ink. These tiles can be used situationally during the game, so it’s helpful to keep them on hand in your play area. [5] X Research source If you’re playing with a group of at least 3 people, you only need 1 “Dig Deeper” tile, which you can set next to the card box. Each player will just grab the tile when they want to use it, rather than holding onto it during the game."
    },
    {
      "title": "Set the notepads and pencils aside for future turns.",
      "content": "Set the notepads and pencils aside for future turns. Certain cards ask players to jot their thoughts down in writing with the provided notepads and pencils. The game comes with 2 notepads and 2 pencils, so make sure you keep them nearby. [6] X Research source If you’re playing with a larger group, you may need to provide extra pencils, pens, and paper for the other players."
    },
    {
      "title": "Hold a staring contest to decide who goes first.",
      "content": "Hold a staring contest to decide who goes first. Sit across from the other player and stare at them for an indefinite period of time. The first person to blink is known as Player 1, and the other player is known as Player 2. [7] X Research source"
    },
    {
      "title": "Read a Level 1 card to Player 2 and invite them to answer.",
      "content": "Read a Level 1 card to Player 2 and invite them to answer. Each card has a question written on it. Player 1 reads the question on the card to Player 2, who has to give an honest, genuine answer. Once Player 2 answers, Player 1 can chime in with their thoughts. [8] X Research source Examples of Level 1 card questions include: What was your first impression of me? What do you think I do for a living? Do you think I’ve ever had my heart broken? [9] X Research source"
    },
    {
      "title": "Draw a different Level 1 card and ask Player 1 to answer.",
      "content": "Draw a different Level 1 card and ask Player 1 to answer. Player 2 takes a new card from the Level 1 deck and reads it aloud to Player 1. This time, Player 1 gives an honest, thoughtful answer to the question, and Player 2 can offer some feedback. [10] X Research source Set any leftover cards face-up to the side of the card box."
    },
    {
      "title": "Use a “Dig Deeper” tile to get the other player to give a more drawn-out answer.",
      "content": "Use a “Dig Deeper” tile to get the other player to give a more drawn-out answer. Maybe you feel like the other player is only scratching the surface in their response. In this case, you could play your “Dig Deeper” tile to force the other player to go a little more in-depth. You can use 1 “Dig Deeper” tile per round. [11] X Research source Let’s say the question was “What is the worst assumption someone has made about you?” and Player 2 answered, “People assume that I’m rude when I’m really just shy.” Player 1 could use a “Dig Deeper” to get Player 2 to elaborate on that answer a little more."
    },
    {
      "title": "Switch to Level 2 cards after answering at least 15 Level 1 cards.",
      "content": "Switch to Level 2 cards after answering at least 15 Level 1 cards. Once each player has answered 7-8 questions apiece, you can switch over the Level 2 deck. [12] X Research source Keep in mind that these cards are a little more prying, and include questions like: How are you, really? What’s the most unexplainable thing that’s ever happened to you? What is your defining characteristic? [13] X Research source"
    },
    {
      "title": "Alternate asking each other questions from the Level 2 deck.",
      "content": "Alternate asking each other questions from the Level 2 deck. Like you did before, continue asking each other questions and providing really honest answers. Your “Dig Deeper” tile resets each round, so feel free to use it again if you feel like the situation calls for it."
    },
    {
      "title": "Switch to Level 3 cards once you’ve answered at least 15 Level 2 cards.",
      "content": "Switch to Level 3 cards once you’ve answered at least 15 Level 2 cards. You know the drill—once both players answer at least 7-8 cards, you can transition to the last and final deck: Level 3. [14] X Research source These cards really build on the bond you’ve created during the game, and include questions like: What can we create together? What can I help you with? In a word, how would you describe our conversation? [15] X Research source"
    },
    {
      "title": "Discuss at least 15 Level 3 cards before ending the game.",
      "content": "Discuss at least 15 Level 3 cards before ending the game. Gameplay cycles in the exact way it did during the first 2 rounds. Rotate between asking and answering Level 3 card questions until you both have responded to 7-8 cards."
    },
    {
      "title": "Handwrite a private note to the other player for them to read later.",
      "content": "Handwrite a private note to the other player for them to read later. Flip over the “Final Card,” which tells you and the other player to write each other a handwritten note. Fold the note in half so the other person can’t read it right away, and then exchange your messages. Once you split up, read the note on your own time. [16] X Research source In the “Quarantine Edition” of the game, the instructions encourage players to type out a message to the other player. After the video call ends, both players send the messages over to one another. [17] X Research source"
    },
    {
      "title": "Jot down your first impressions about each person you’re playing with.",
      "content": "Jot down your first impressions about each person you’re playing with. This doesn’t have to be super in-depth or anything (especially if you’re playing with 4-5 other people!). Just write down up to 3 sentences about each player before folding and setting your paper aside—you’ll get back to it later in the game. [18] X Research source"
    },
    {
      "title": "Nominate the most hesitant player to go first.",
      "content": "Nominate the most hesitant player to go first. Chances are, there’s at least one person in your group who isn’t crazy about playing a personal, soul-baring card game with a bunch of other people. Identify who this person is within your player group and have them read the first card. [19] X Research source"
    },
    {
      "title": "Read a Level 1 card out loud and have each player answer.",
      "content": "Read a Level 1 card out loud and have each player answer. Invite the nominated first player to read the question on the Level 1 card. Then, encourage each person in the group to share their answer to the question. [20] X Research source"
    },
    {
      "title": "Use a Dig Deeper tile to force a single player to give a deeper answer.",
      "content": "Use a Dig Deeper tile to force a single player to give a deeper answer. Each player can use the “Dig Deeper” tile 1 time in a single game, rather than 1 time per round. Keep the tile in the center of the playing space, and let players use it as they see fit. [21] X Research source"
    },
    {
      "title": "Rotate around the circle until every player has read at least 2 cards.",
      "content": "Rotate around the circle until every player has read at least 2 cards. Group games of WNRS are a bit more time-consuming, so you don’t have to go through 15 cards per round. Instead, make sure each player gets the chance to read a new card at least twice. At this point, you can switch to the Level 2 cards. [22] X Research source"
    },
    {
      "title": "Start drawing from the Level 2 deck of cards.",
      "content": "Start drawing from the Level 2 deck of cards. Continue around the circle of players, with each player drawing a Level 2 card and reading it aloud. Encourage each person to answer each question as honestly as possible."
    },
    {
      "title": "Continue drawing Level 2 cards until each player has read twice.",
      "content": "Continue drawing Level 2 cards until each player has read twice. Just like you did before, give each player a chance to read at least two Level 2 cards to the rest of the group before going to the Level 3 deck."
    },
    {
      "title": "Switch to the Level 3 deck.",
      "content": "Switch to the Level 3 deck. You’re in the homestretch! Keep playing the game in the exact same way, with each player drawing a card and the rest of the group giving individual answers. Once everyone has read at least 2 cards, you can move onto your first impressions sheet."
    },
    {
      "title": "Finish the game by sharing your first impressions of one another.",
      "content": "Finish the game by sharing your first impressions of one another. Go around the circle and have each player read off their first impressions of the other players. [23] X Research source This is a great way to get a better perspective on how you all come across to others."
    },
    {
      "title": "You “win” WNRS by getting to know the other players a little better.",
      "content": "You “win” WNRS by getting to know the other players a little better. For all intents and purposes, WNRS doesn’t have winners and losers—after all, the whole point of the game is learning something new about your fellow players! Koreen Odiney, the creator of WNRS, said it best: “I have found there are 2 ways to play this game: 1) Play safe. 2) Play to grow. The second is how you win.” [24] X Research source"
    },
    {
      "title": "Yes, there are plenty of other themed WNRS card packs that you can play with.",
      "content": "Yes, there are plenty of other themed WNRS card packs that you can play with. Bonus WNRS card packs tackle a lot of different thought-provoking topics, from self-reflection and breakups to relationships and self-love. [25] X Research source Here’s some of the extra packs available on the WNRS website: Friendship Edition: Think you know everything about your bestie? This expansion pack may surprise you. [26] X Research source Couples Edition: Take a deep dive with your partner, spouse, or SO as you learn more about each other. [27] X Research source Self-Love Edition: Play this expansion of WNRS by yourself. You might be surprised about what you discover along the way! Family Edition: Learn a little more about your loved ones (and your friend family) with several decks of engaging questions. [28] X Research source Healing Edition: This expansion pack lets you take a deep dive in your mental health experiences. You can also play this with a close friend or loved one, if you’d like. [29] X Research source Breakup Edition: Use this expansion back after a tough split with your ex as a way to reflect and learn more about yourself. [30] X Research source Forgiveness Edition: This expansion pack can help you on your journey of forgiveness—whether you’re struggling to forgive someone else, or yourself. Relationship Expansion Pack: This is a great pack for couples who’d like to take their relationship to a deeper, more emotionally intimate level."
    },
    {
      "title": "You can also download some bonus packs for free on the WNRS website.",
      "content": "You can also download some bonus packs for free on the WNRS website. WNRS has made some special, digital-only PDF editions that you can download and print out at home. You can find these PDFs by clicking on the “Online” page in the “Info” tab on the WNRS website. There are lots of different editions to peruse, like: Ex-Friend Edition: Host a deep, intellectual discussion with a former friend to better explore your past. Introspective Journal: This solo card pack allows you to check in with yourself. Quarantine Edition: Make the most of your time apart with a game of quarantine-related questions. [31] X Research source Race and Privilege Edition: Use this card pack to have a tough but meaningful conversation about race and privilege with the people in your life. [32] X Research source"
    }
  ]
}