{
  "url": "https://www.wikihow.com/Send-Large-Files-on-Discord-Without-Nitro",
  "title": "5 Simple Ways to Bypass Discord's File Size Sending Limit",
  "steps": [
    {
      "title": "Open Imgur.",
      "content": "Open Imgur. This app icon looks like an arrow with a blue starry night trail on a green background. You can find it on one of your Home screens, in the app drawer, or by searching. If you don't have the Imgur app , you can get it for free from either the Google Play Store on Android or the App Store on iPhone and iPad . You can only use this method if your video file is less than 60 seconds."
    },
    {
      "title": "Tap the upload icon.",
      "content": "Tap the upload icon. It's the icon that resembles a tray with an arrow pointing up at the bottom of the screen. [1] X Research source You'll need to create an account and sign in to create a post. When prompted, tap the \"Sign in/Sign up\" button. You can create an account with your Google account, Facebook account, or using your email address. If this is your first time using the app, you need to give it permission to use your camera or access your gallery."
    },
    {
      "title": "Tap to select the video/photos you want to post on Discord.",
      "content": "Tap to select the video/photos you want to post on Discord. A number will display in the top right corner to indicate how many files you've selected. You can tap a single video or photo, or you can tap to select multiple."
    },
    {
      "title": "Tap Next.",
      "content": "Tap Next . It's in the top right corner of your screen."
    },
    {
      "title": "Tap Post.",
      "content": "Tap Post . It's in the top right corner of your screen. [2] X Research source If you are asked if you want to \"Make some noise,\" you can tap Yes, keep the audio to post the video with audio, or No, remove the audio to post the video without audio. Uploading your video to Imgur may take a few seconds, but you'll get a notification when the process is done."
    },
    {
      "title": "Tap your profile icon.",
      "content": "Tap your profile icon. It's in the lower-right corner. It's the icon that resembles a person."
    },
    {
      "title": "Ensure all posts are visible.",
      "content": "Ensure all posts are visible. To do so, tap the icon that says Public or Hidden in the upper-left corner below \"Posts\". Then tap All ."
    },
    {
      "title": "Tap your post.",
      "content": "Tap your post. When you see the post you want to share, tap it to display it."
    },
    {
      "title": "Tap the Share icon.",
      "content": "Tap the Share icon. It's the icon that resembles a curved arrow pointing right. It's at the bottom of the page."
    },
    {
      "title": "Tap Copy URL.",
      "content": "Tap Copy URL . This will copy the link to your clipboard. [3] X Research source Alternatively, you can tap Discord and select which Discord server and channel to post to. If you do that, you can skip the next step."
    },
    {
      "title": "Open Discord and paste your link.",
      "content": "Open Discord and paste your link. The app looks like a game controller on a light blue or grey background. Navigate to the server and channel where you want to share your link from Imgur, then paste it into the chat."
    },
    {
      "title": "Go to imgur.com/ in a web browser.",
      "content": "Go to imgur.com/ in a web browser. You can use any web browser on your computer to do this."
    },
    {
      "title": "Click New Post.",
      "content": "Click New Post . It's the green button in the upper-left corner of the page. [4] X Research source"
    },
    {
      "title": "Click Choose Photo/Video.",
      "content": "Click Choose Photo/Video . You'll see this in the panel on the right side of the window. Alternatively, drag and drop your file from your file manager to the panel on the left side of the window. You can click Add image if you want to add another file. Alternatively, you can drag and drop the video you want to upload onto the Imgur page."
    },
    {
      "title": "Select your video.",
      "content": "Select your video. Click the video you want to upload and click Open . Your video can't be longer than 60 seconds. You may be asked if you want to \"Make some noise.\" You can click Yes, keep the audio to keep the sound, or \"No, remove audio\" to remove the sound."
    },
    {
      "title": "Click Copy Link.",
      "content": "Click Copy Link . It's in the upper-right corner of the video playback preview when you mouse over the video preview. This link will be copied to your clipboard. [5] X Research source"
    },
    {
      "title": "Open Discord.",
      "content": "Open Discord. You can open the desktop app or navigate to https://discord.com/app ."
    },
    {
      "title": "Paste the link where you want to share the large file.",
      "content": "Paste the link where you want to share the large file. Since it's an embedded post link, the video or large file should appear in the chat as if you posted it directly . If your video is too long, you can upload it to Google Drive and send that link instead."
    },
    {
      "title": "Open HandBrake.",
      "content": "Open HandBrake. The app icon looks like a pineapple next to a cocktail glass that you'll find in your Start menu or Applications folder. [6] X Research source If you don't have Handbrake , you can download and install it from https://handbrake.fr/ . Click the red Download HandBrake button and do the following according to your operating system: Windows: Double-click the installation file, then follow the on-screen instructions to finalize the installation wizard and install the program. Mac: Double-click the HandBrake DMG file, verify the download if prompted, then click and drag the HandBrake icon onto the Applications folder in Finder."
    },
    {
      "title": "Drag and drop the video that you want to share.",
      "content": "Drag and drop the video that you want to share. You'll see a preview of your video below."
    },
    {
      "title": "Change the format to MP4.",
      "content": "Change the format to MP4 . Use the drop-down menu next to \"Format\" on the left to select \"MP4.\" Setting this to MP4 should lower the video size without compromising too much quality."
    },
    {
      "title": "Select a smaller preset.",
      "content": "Select a smaller preset. Use the drop-down menu next to \"Preset\" to select a preset. Reducing the image resolution or frame rate will reduce the video file size. You can select \"Discord Small\" or \"Discord Tiny\" to reduce the video enough to upload to a Discord server."
    },
    {
      "title": "Click Start Encode.",
      "content": "Click Start Encode . It's the green button at the top of the screen."
    },
    {
      "title": "Save your work and go to Discord.",
      "content": "Save your work and go to Discord. In HandBrake, go to File > Save and save your compressed video. You can then open Discord (or go to https://discord.com/app )."
    },
    {
      "title": "Send your file via Discord.",
      "content": "Send your file via Discord. After you've compressed it, send your video via Discord. If it's still larger than 25 MB, you can try compressing with HandBrake again."
    },
    {
      "title": "Open Google Drive.",
      "content": "Open Google Drive. This app icon looks like a red, yellow, green, and blue triangle on a white background. You can find it on one of your Home screens, in the app drawer, or by searching. Use this method if you want to share a large file. You can also share large videos this way that are longer than 60 seconds. This method works for both Google Drive apps on Android and iPhone."
    },
    {
      "title": "Upload the video to Google Drive.",
      "content": "Upload the video to Google Drive. Use the following steps to do so: [7] X Research source Tap + New in the lower-right corner. Tap Upload . Tap the video or file you want to upload."
    },
    {
      "title": "Tap ⋮ next to the file you want to share.",
      "content": "Tap ⋮ next to the file you want to share. This three-dot menu icon is next to the file's name in Google Drive."
    },
    {
      "title": "Tap Share.",
      "content": "Tap Share . It's usually the first option in the menu. [8] X Research source"
    },
    {
      "title": "Tap Not shared.",
      "content": "Tap Not shared . You'll see this at the bottom of your screen next to a lock icon and under the \"Who has access\" header."
    },
    {
      "title": "Tap Change.",
      "content": "Tap Change . This is under the header \"Link settings\" and \"Restricted.\""
    },
    {
      "title": "Tap Restricted and select Anyone with the link.",
      "content": "Tap Restricted and select Anyone with the link . This changes the privacy to allow anyone who can see the Discord message to also see your Google Drive file. [9] X Research source"
    },
    {
      "title": "Tap the link icon.",
      "content": "Tap the link icon. You'll see this chain-link icon in the top right corner of your screen. When you tap it, you'll see a message at the bottom of the screen saying you've copied the link to your clipboard."
    },
    {
      "title": "Open Discord.",
      "content": "Open Discord. You can open Discord or go to discord.com/app ."
    },
    {
      "title": "Send your file via Discord.",
      "content": "Send your file via Discord. Anyone who can see the chat can also view your Google Drive file."
    },
    {
      "title": "Go to drive.google.com/drive/my-drive and sign in.",
      "content": "Go to drive.google.com/drive/my-drive and sign in. This will take you to your Google Drive, where you'll need to log in to continue. Use this method if you want to share a large file. You can also share large videos this way that are longer than 60 seconds."
    },
    {
      "title": "Upload a video you want to share.",
      "content": "Upload a video you want to share. Use the following steps to do so: Click + New in the upper-right corner. Click File upload . Select the file you want to upload and click Open ."
    },
    {
      "title": "Navigate to the file you want to share.",
      "content": "Navigate to the file you want to share. You can either scroll down to find it in the list of your Google Drive items or click through any folders you might have set up for organizational purposes."
    },
    {
      "title": "Click ⋮ next to the file you want to share.",
      "content": "Click ⋮ next to the file you want to share. It's the icon with three dots next to the file."
    },
    {
      "title": "Open the Share menu.",
      "content": "Open the Share menu. To do so, click Share followed by Share again."
    },
    {
      "title": "Click Restricted and select Anyone with the link.",
      "content": "Click Restricted and select Anyone with the link . This changes the privacy to allow anyone who can see the Discord message to also see your Google Drive file. [10] X Research source"
    },
    {
      "title": "Click Copy Link.",
      "content": "Click Copy Link . It's in the top right corner of the window below a gear icon. When you click it, you'll see a \"Link Copied\" message at the bottom of the window. Click Done to close the window. The sharing settings are updated as soon as you switch the privacy from \"Restricted\" to \"Anyone with the link,\" so clicking Done isn't necessary, but it will close the window."
    },
    {
      "title": "Open Discord.",
      "content": "Open Discord. You can open Discord or go to discord.com/app . You can also use the desktop client."
    },
    {
      "title": "Send your file via Discord.",
      "content": "Send your file via Discord. Anyone who can see the chat can also view your Google Drive file. Open a Discord channel and paste the link in the chat to send videos on Discord :."
    }
  ]
}