{
  "url": "https://www.wikihow.com/Poop-at-Work",
  "title": "How to Poop Quietly and Discreetly at Work",
  "steps": [
    {
      "title": "Be courteous.",
      "content": "Be courteous. Don't talk about other people's bathroom habits. If you happen to recognize someone in the restroom, don't mention it. [1] X Research source Don't make jokes at anyone's expense, and don't draw attention to someone in a stall. [2] X Research source"
    },
    {
      "title": "Avoid conversation.",
      "content": "Avoid conversation. Don't try to talk to someone in the stall next to you. While you may have a great work relationship with someone, they may not want to have a conversation between the stalls. Be considerate of others using the restroom. Don't talk on your cellphone, and don't use the restroom as a chance to catch up with another co-worker. Your conversation could be distracting to someone in a stall. [3] X Research source"
    },
    {
      "title": "Don't linger.",
      "content": "Don't linger. Restrooms can have a lot of traffic, especially if you're in a busy office building. Once you're finished, get out. Don't use the restroom for anything other than its intended use. [4] X Research source Avoid using your workplace restroom to shave or cut your toenails. Other people may be waiting on you to leave so they can relieve themselves."
    },
    {
      "title": "Avoid reading materials.",
      "content": "Avoid reading materials. When pooping at work, don't take reading materials into the stall with you. If you're nervous about people knowing what you're up to, then holding a newspaper will almost certainly tip them off. [5] X Research source Even if you have no problems pooping at work, avoid reading in the stall. You'll take longer, and you may be preventing people who need to use the restroom. Don't use your cellphone in the stall."
    },
    {
      "title": "Find a different restroom.",
      "content": "Find a different restroom. If you have trouble using the restroom at work, try to find a restroom on a different floor. Search for a restroom that is not used as frequently and do your business there. [6] X Research source If your workplace only has one restroom, search for a time when there is not as much traffic so you can have some peace and quiet. [7] X Research source"
    },
    {
      "title": "Muffle the sounds.",
      "content": "Muffle the sounds. If you are worried about people hearing you while you're in the stall, drape some toilet paper across the seat before doing your business. The paper will dampen any noises you might make while relieving yourself. [8] X Research source"
    },
    {
      "title": "Clean up after yourself.",
      "content": "Clean up after yourself. Don't make a mess in the stall. Other people have to use the same restroom you do at work, and no one wants to deal with a mess. Be considerate of others and try to be clean in the stall. Wash your hands. You should always wash your hands after using the restroom."
    },
    {
      "title": "Ask for air-fresheners in the stall.",
      "content": "Ask for air-fresheners in the stall. If you're embarrassed about the smells that come from the stall, ask your supervisor to buy some spray air freshener for each stall. [9] X Research source If you can't convince your supervisor to invest in any air fresheners, you could bring your own from home, or carry a book of matches. Lighting a match can often help eliminate bad smells. [10] X Research source"
    },
    {
      "title": "Make sure there is enough toilet paper.",
      "content": "Make sure there is enough toilet paper. If you notice the toilet paper in your stall is running low, refill it. If you don't have access to refilling it, let the person who maintains the restroom know that it needs attention."
    }
  ]
}