{
  "url": "https://www.wikihow.com/Play-Heads-Up!",
  "title": "How to Play Heads Up!",
  "steps": [
    {
      "title": "Determine which version you need.",
      "content": "Determine which version you need. Figure out whether you have an Android phone or use an iPhone or iPad. There is also another version of Heads Up! for the iPod and iPad called Heads Up! Kids. Decide on whether you'll be playing the game with children or with adults. [1] X Research source Heads Up! Kids replaces text with pictures so that kids who can't read can also play along."
    },
    {
      "title": "Visit the app's download page.",
      "content": "Visit the app's download page. Visit the download page for the device you plan on playing the game with. Search for the name of the app and then visit the download page. If you have an Android device, visit the Google Play store . If you have an iPhone or iPad, visit App Store . Heads Up! on the Google Play store is free. [2] X Research source Heads Up! on iTunes costs $.99. [3] X Research source"
    },
    {
      "title": "Download",
      "content": "Download and install the game to your phone or tablet. Click the download button to start the download and installation process. Once the download is done, an icon for the game should show up on your home screen. If you are downloading the app on App Store , keep in mind that you'll have to pay $.99 for the game."
    },
    {
      "title": "Tap on the icon on your home screen to open the game.",
      "content": "Tap on the icon on your home screen to open the game. After the app has been downloaded and installed, it should create an icon on your home screen. Tap on the icon to open up the program so that you can start the play the game."
    },
    {
      "title": "Organize into teams of two.",
      "content": "Organize into teams of two. If more than two people are playing, have everyone split up into teams of two. One player will guess the word on the screen while their teammate will provide clues to them. The goal is to guess the word that appears on the tablet without looking at it. Each time that a person guesses the word on the screen correctly, they receive a point. Rhyming is not allowed."
    },
    {
      "title": "Choose a deck.",
      "content": "Choose a deck. In Heads Up! there are a variety of subjects that you can choose from. Talk to your friends and determine which subject everyone likes the best. Decks include celebrities, movies, animals, accents, and characters. There are new decks regularly being added to the game, such as the Chinese New Year edition."
    },
    {
      "title": "Read the deck description and tap Play.",
      "content": "Read the deck description and tap Play. Once you tap the deck you want to play, you'll be brought to a brief description of what kind of clues will be in the deck. Talk to other people who are playing with you to determine if this is the topic you'd all like to play before starting the game. [4] X Research source This description will also give you brief directions on the rules of the game."
    },
    {
      "title": "Put the back of the phone against your forehead.",
      "content": "Put the back of the phone against your forehead. Decide who wants to go first, then have them put the phone against their forehead, with the face of the phone facing out so that their teammate can see the word. After a countdown, the game will begin. Putting the phone on your forehead will make sure that you can't see the word, but that your teammate can. If you are using a tablet, you can put the tablet in front of you instead of placing it on your forehead."
    },
    {
      "title": "Tilt the phone down if you guess the word correctly.",
      "content": "Tilt the phone down if you guess the word correctly. Your teammate will see the word and try to provide clues without saying the word directly. The person giving the clues should signal when you've gotten the word correct. Once you do, tilt the phone down so that the face of the phone points towards the floor. This will record your point. [5] X Research source"
    },
    {
      "title": "Tilt the phone up if you can't guess the word.",
      "content": "Tilt the phone up if you can't guess the word. If you're totally stumped and aren't sure what the word is, tilt the phone upwards to skip the card and go on to the next one. This won't count against your score, but you won't get a point for the card."
    },
    {
      "title": "Continue guessing cards until the time runs out.",
      "content": "Continue guessing cards until the time runs out. You have 60 seconds to guess all of the cards in the deck for your turn. Try to guess as many words as you can before the time runs out. Once the timer goes down to zero, it will tally up your points. After you have guessed the words in your deck, it's your teammate's turn to guess the word and your turn to hold the phone. Whoever scores the most points at the end of the round wins. You can play as many rounds as you want. If you are playing with more than 2 people, you can combine the points on each team, and whichever team gets the most, wins."
    },
    {
      "title": "Choose a deck that you're knowledgeable about.",
      "content": "Choose a deck that you're knowledgeable about. The best way to score more points is to be knowledgeable about the topic. If you love movies or TV shows, for example, you should pick the celebrity or movie deck. If you know a lot about biology and different animals, you should play the animal deck. The more you know about the topic in the deck, the easier the game will be for you."
    },
    {
      "title": "Play as a team rather than against each other with just two people.",
      "content": "Play as a team rather than against each other with just two people. While you can play Heads Up! against each other, you can also play as a team. Instead of trying to score more points than the other player, try to score points together and get a high score. This can be a less competitive and more fun way of playing the game."
    },
    {
      "title": "Give a description of the word.",
      "content": "Give a description of the word. One of the most common clues in Heads Up! is a description of a word. Try to visualize the object that is on the phone and describe it to the best of your ability. The more accurate and recognizable details you give, the better chance the person will be able to guess it. [6] X Research source For instance, if the card says \"alligator\" you can say something like \"It's a green reptile with a long mouth and lots of teeth.\""
    },
    {
      "title": "Make recognizable noises.",
      "content": "Make recognizable noises. If the word is an animal that makes a certain sound, you can copy the noise to give a clue of the word. If the word is a famous television show or movie with a recognizable theme song, you can hum the song instead of trying to describe the show or movie. Think of sounds, noises, or songs that are related to the word and use them instead of describing it. [7] X Research source For example, if the word is \"dog\" you can bark or say \"woof\" instead of describing a dog."
    },
    {
      "title": "Say synonyms of the word on the screen.",
      "content": "Say synonyms of the word on the screen. If there is a widely used synonym for the word that is on the screen, you can use it. Think about words that related or mean the same thing as the word on the screen and use that as your clue. [8] X Research source For example, if the word on the screen is \"cliff\" you can say something like \"precipice, crag, or bluff.\""
    }
  ]
}