{
  "url": "https://www.wikihow.com/Screenshot-in-Windows-10",
  "title": "How to Screenshot in Windows 10",
  "steps": [
    {
      "title": "Arrange your screen how you'd like it to appear in the screenshot.",
      "content": "Arrange your screen how you'd like it to appear in the screenshot. If you want to capture the entire screen , lay it out on the desired fashion."
    },
    {
      "title": "Press the ⊞ Win+⎙ PrtScr keys simultaneously.",
      "content": "Press the ⊞ Win + ⎙ PrtScr keys simultaneously. The PrtSc key is usually in the top row of keys. This captures the screen (or window) and saves the screenshot as a PNG image. The text on the key may vary by keyboard. For example, your key may say something like \"PrScr\" or \"PrtScrn.\" If your PrtSc key shares a key with a function key like F10, you may have to hold down Fn while you press that function key. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Navigate to the screenshot.",
      "content": "Navigate to the screenshot. Your screenshot is now saved to the Screenshots folder, which is inside your Pictures folder. Here's how to get there: [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Press ⊞ Win + E to open the File Explorer. Click Pictures on the left pane. If you don't see it, click the arrow next to This PC to expand more options. Double-click the Screenshots folder in the right panel. Double-click the latest screenshot (with the highest number in the file name) to view your screenshot."
    },
    {
      "title": "Open the window you want to capture.",
      "content": "Open the window you want to capture. If the window is already open, click its title bar at the top to make sure it's selected. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Press Alt+⎙ PrtScr together.",
      "content": "Press Alt + ⎙ PrtScr together. This copies a screenshot of the selected window to your clipboard . The text on the key may vary by keyboard. For example, your key may say something like \"PrScr\" or \"PrtScrn.\" Some keyboards require you to press Alt + Fn + ⎙ PrtScr together instead."
    },
    {
      "title": "Open Paint",
      "content": "Open Paint . You can search for it using the search bar/icon on the taskbar."
    },
    {
      "title": "Press Ctrl+V to paste the image.",
      "content": "Press Ctrl + V to paste the image. The screenshot will appear on the Paint canvas. [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you want to trim anything from the image, click the Crop tool at the top of Paint and then select the part of the screenshot you want to keep."
    },
    {
      "title": "Click the File menu and select Save.",
      "content": "Click the File menu and select Save . This options the Save As dialog window."
    },
    {
      "title": "Choose a save location.",
      "content": "Choose a save location. If you'd like to keep your screenshots organized in a single folder, you can open the Pictures folder and double-click Screenshots ."
    },
    {
      "title": "Enter a file name.",
      "content": "Enter a file name. If you'd like to change the name of the file, type a new name into the \"File name\" field at the bottom of the dialog window."
    },
    {
      "title": "Select an image type from the \"Save As Type\" menu.",
      "content": "Select an image type from the \"Save As Type\" menu. It's near the bottom of the window. The default file type is PNG, but you can choose any other file type you wish."
    },
    {
      "title": "Click Save.",
      "content": "Click Save . The screenshot is now saved to the selected location."
    },
    {
      "title": "Press ⊞ Win+G while playing a game.",
      "content": "Press ⊞ Win + G while playing a game. This shortcut opens the Xbox Game Bar , which allows you to take quick screenshots or longer video recordings. [5] X Research source You can quickly capture screenshots without opening the Game Bar first by pressing Windows key + Alt + PrtSc . [6] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Open the Capture widget.",
      "content": "Open the Capture widget. If you see a widget called Capture already, you can skip this step. If not, click the widget menu at the top-left corner of the Game Bar at the top of the screen, and then select Capture . [7] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click the camera icon on the Capture widget to take a screenshot.",
      "content": "Click the camera icon on the Capture widget to take a screenshot. Once a screenshot is captured, it'll be saved to your user folder under Videos > Captures ."
    },
    {
      "title": "View your screenshot.",
      "content": "View your screenshot. To get there, click the widget menu, select Gallery , and then click the folder icon at the top of the window. This opens a File Explorer window to your Captures folder."
    },
    {
      "title": "Open Snipping Tool.",
      "content": "Open Snipping Tool . While Microsoft originally planned to replace Snipping Tool with a new tool called Snip and Sketch, they've decided to bring back Snipping Tool. [8] X Research source There are two ways to open this built-in screenshot capture tool in Windows 10: [9] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Press Windows key + Shift + S (fastest way). In the Windows Search bar, type snipping , and then click Snipping Tool in the search results."
    },
    {
      "title": "Click the drop-down arrow next to the \"Mode\" button.",
      "content": "Click the drop-down arrow next to the \"Mode\" button. You will see four options to capture the screen: Free-form Snip , Rectangular Snip , Window Snip and Full-screen Snip . [10] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click the type of screenshot you want to capture.",
      "content": "Click the type of screenshot you want to capture. Here's what each option does: [11] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Free-form snip: Lets you capture any part of the screen in any shape by tracing freehand. Rectangular snip: Lets you capture a section of the screen by drawing a rectangle around it. Window snip: Use this if you want to capture a single window. After clicking the button, you'll be shown a list of windows you can capture at the bottom of the screen. Click a window to take the photo and see a preview. Full-screen snip: Captures the entire screen and displays a preview in the tool."
    },
    {
      "title": "Click the New button.",
      "content": "Click the New button. It's near the top-left corner of the tool. Depending on the mode you selected, you'll experience different results: [12] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you chose Free-form or Rectangle , the cursor will turn into a + . Drag the cursor to select the part of the screen you want to capture. When you lift your finger from the mouse, a preview will appear. If you choose Full-screen , the whole screen will be captured and a preview will appear. If you chose Window , click the window you want to capture to take the photo and view the preview."
    },
    {
      "title": "Edit the screenshot (optional).",
      "content": "Edit the screenshot (optional). Several editing tools appear at the top of the screen: Click the down-arrow next to the pen icon to choose a pen color, then draw your desired text or shape on the screen. Use the eraser tool to erase any mistakes. Click the highlighter icon to use a yellow highlighter to select certain text or areas. Click the rainbow bubble icon to open the screenshot in Paint 3D for more advanced jobs."
    },
    {
      "title": "Click the disk icon to save your screenshot.",
      "content": "Click the disk icon to save your screenshot. It's in the icon bar at the top of the Snipping Tool."
    },
    {
      "title": "Select a save location and click Save.",
      "content": "Select a save location and click Save . If you'd like to select a specific folder and specify a file name, you can do that before clicking Save . Your screenshot will be saved to the folder you select. [13] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Install Snip & Sketch from the Windows Store.",
      "content": "Install Snip & Sketch from the Windows Store. If you want more editing tools, such as the ability to write on your screenshots with different colored pens, try Snip & Sketch. First, check to see if you already have Snip & Sketch installed by pressing Windows key + Shift + S . If you see an icon bar at the top of the screen, you already have this tool. If not, you can open the Microsoft Store from the Windows menu, search \"Snip & Sketch,\" and then choose the option to install. Snip & Sketch was originally designed to replace the Snipping Tool in Windows. Microsoft has decided to combine all the best features of the two apps into one helpful Snipping Tool for Windows 11, but continue focusing on Snipping Tool for Windows 10. [14] X Research source Both tools are helpful in Windows 10, but Snip & Sketch has some extra annotation and editing tools that are helpful. If you want more annotation tools, install Snip & Sketch."
    },
    {
      "title": "Open Snip & Sketch.",
      "content": "Open Snip & Sketch. There are three ways to open the tool once it's installed: [15] X Research source Press Windows key + Shift + S (fastest way). Click the Notification Center (the squared speech bubble icon near the system clock) and click Screen snip . Type \"snip & sketch\" into the Windows Search bar, and then click Snip & Sketch in the search results."
    },
    {
      "title": "Arrange your screen how you'd like it to appear in the screenshot.",
      "content": "Arrange your screen how you'd like it to appear in the screenshot. Even if you just want to capture a portion of the screen, you'll be able to do so easily using Snip & Sketch."
    },
    {
      "title": "Open Snip & Sketch.",
      "content": "Open Snip & Sketch. You can open it by typing snip into the Windows search bar and clicking Snip & Sketch in the search results. You can also open the tool by press ⊞ Win + ⇧ Shift + S ."
    },
    {
      "title": "Click New.",
      "content": "Click New . It's the blue button near the top-left corner of Snip & Sketch. Four icons will appear at top of the screen. If you used the keyboard shortcut you can skip this step."
    },
    {
      "title": "Select a type of screenshot to take.",
      "content": "Select a type of screenshot to take. Hover the mouse cursor over each icon at the top of the screen to see what type of screenshot it represents, then click your selection to take a screenshot. Rectangular snip: This option lets you capture a section of the screen by drawing a rectangle around it. After you draw your shape, a preview of the screenshot will appear in the tool. Freeform snip: This lets you capture any part of the screen in any shape by tracing freehand. After you draw your shape, a preview of the screenshot will appear in the tool. Window snip: Use this tool if you want to capture a single window. After clicking the button, click the window you want to capture to take the photo and view the preview. Fullscreen snip: Captures the entire screen and displays a preview in the tool."
    },
    {
      "title": "Edit the screenshot (optional).",
      "content": "Edit the screenshot (optional). Snip & Sketch comes with several editing tools you can use to modify or mark the image before saving. Click the finger with a piece of string tied around it to freehand draw on the image. You can then select a drawing/writing tool and color at the top of the screen and draw text or shapes as needed. Click the eraser icon to erase part any mistakes you make while drawing. Click the ruler icon to display a ruler along the top of the screen. Click the crop icon (a square with a line through it) to preserve part of the image while trimming the rest."
    },
    {
      "title": "Click the disk icon to save your screenshot.",
      "content": "Click the disk icon to save your screenshot. It's near the top-right corner of Snip & Sketch."
    },
    {
      "title": "Select a save location and click Save.",
      "content": "Select a save location and click Save . If you'd like to select a specific folder and specify a file name, you can do that before clicking Save . Your screenshot will be saved to the folder you select."
    }
  ]
}