{
  "url": "https://www.wikihow.com/Obtain-a-Property-Easement",
  "title": "How to Obtain a Property Easement",
  "steps": [
    {
      "title": "Survey your land.",
      "content": "Survey your land. Before negotiating for an easement, you should check whether or not you actually own the land you want to use. For example, you might be storing equipment near the boundary line of your property. You should double check to see if the land you are using is actually part of your parcel. You can look for a survey that has already been performed. This is typically kept at your city or county office. Alternately, you could hire a surveyor to perform a survey. Surveyors can be found in your phone book or by searching online. At a minimum, get the legal description of property and try to find the precise boundaries of your property. If you actually own the land you want to use, then you don’t need to obtain an easement."
    },
    {
      "title": "Meet with a real estate agent.",
      "content": "Meet with a real estate agent. Once you find out that a neighbor owns the land, you should begin thinking about negotiations. You will probably have to pay for the easement. To begin planning for negotiations, you should try to come up with a reasonable price to offer. You could meet with a real estate agent. Agents probably have more experience understanding the value of land in the area. They might also know how much people usually pay for your type of easement. Also ask other people in the community if they have easements. Ask how much they paid for it. You want to know what is considered standard."
    },
    {
      "title": "Contact the property owner.",
      "content": "Contact the property owner. You should call or write the property owner and mention that you want to get an easement on their property. Ask for a time to meet so that you can discuss this possibility. It is usually more productive to negotiate face-to-face. You can read non-verbal cues when you meet in person and respond to those cues. If you want to negotiate in person, then you might want to hold off on contacting the owner until you will be around each other. For example, if you both own summer camps, then you might not want to negotiate during the winter. Instead, you could wait until June, when you both open your camps."
    },
    {
      "title": "Make an offer.",
      "content": "Make an offer. To successfully negotiate, you should make a relatively low opening offer. For example, if the maximum you want to pay for the easement is $1,000, then don’t open negotiations with $1,000 or even $850. You want to leave room to go up. The other side might immediately reject your offer. You should react positively and ask the other party to clarify why he or she is objecting to the offered amount. Don’t immediately buckle under pressure and increase your offer. Instead, ask the other side what part of your offer they like. For example, they might agree with the size of the easement but not like the price. By finding out where you agree, you can move forward and tackle the issues you disagree with."
    },
    {
      "title": "Negotiate until you agree.",
      "content": "Negotiate until you agree. Negotiation involves a process of give and take. Most negotiation will revolve around the price you pay for the easement. However, there are other variables in play: The duration of the easement. An owner can grant an easement for a limited amount of time or indefinitely. If the owner wants too much money for an indefinite easement, then offer to pay for a 15-year easement. You can always negotiate an extension after 15 years pass. The amount of use. You might want an easement to store equipment on someone’s property. For example, you might like to store a fishing boat, tackle, and other gear on someone’s lawn. During negotiations, you could offer to store only the equipment but not the boat. Who else can use the easement. You might want to use a driveway to access your own property. If the other party is worried about too many people using the driveway, you could agree to limit the use to you and your immediate family. You will then request that all visitors park out on the road and walk in."
    },
    {
      "title": "Be prepared to pay immediately.",
      "content": "Be prepared to pay immediately. If you come to an agreement, then you should move quickly to seal the deal. If you wait too long, then the property owner might go back on his promise. He might even try to squeeze more money out of you. Make sure you have the money available in your checking account to pay for the easement. You want to execute the agreement as soon as possible."
    },
    {
      "title": "Meet with an attorney.",
      "content": "Meet with an attorney. You will need to draft an easement agreement. It must follow all of your state’s formalities for transferring an interest in land: a written instrument, signatures, etc. [1] X Research source If you need help drafting the agreement, then you should contact a lawyer. A qualified land use attorney can help you draft the agreement and make sure that it is recorded properly. Even if you don’t want to pay a lawyer to draft the easement, you should have one look over any document you draft yourself. Many lawyers now offer “unbundled” legal services. Under this arrangement, you can hire the lawyer to perform discrete tasks for you, such as looking over your documents and pointing out mistakes."
    },
    {
      "title": "Open a word processing document.",
      "content": "Open a word processing document. If you want to draft the easement yourself, then you should open a blank word processing document. Set the font to a legible size and style."
    },
    {
      "title": "Title the document.",
      "content": "Title the document. Give the document a simple title: “Grant of Easement” is sufficient."
    },
    {
      "title": "Identify the parties.",
      "content": "Identify the parties. You need to explain who the parties are to the agreement. The person granting the easement to his property is the “Grantor” and the person gaining access to the property is the “Grantee.” For example, you can begin the document: “This Grant of Easement is made and entered into as of the Fourth day of August, 2016, by and among Michael J. Smith, ‘Grantor’ and Alice K. Jones, ‘Grantee.’”"
    },
    {
      "title": "State the consideration.",
      "content": "State the consideration. You need to say that the grantee gave money to the grantor in exchange for the easement. This creates a binding contract. For example, you could write: “In consideration of Five Hundred Dollars ($500.00) and other good and valuable consideration from the Grantee, the Grantor hereby grants the following….”"
    },
    {
      "title": "Explain the purpose of the easement.",
      "content": "Explain the purpose of the easement. You can state at the beginning why you are entering into the agreement. This helps anyone who reads the document quickly understand the kind of easement you are creating. For example, “Whereas Grantee is building a house and needs access to her property, and Whereas Grantor desires to grant to Grantee an easement over the servient parcel for the uses set forth herein….”"
    },
    {
      "title": "Describe the burdened parcel.",
      "content": "Describe the burdened parcel. The property that will be burdened with the easement is called the “servient” parcel. The property gaining the easement is called the “dominant” parcel. To describe the servient parcel, you should get the legal description of the property from the property’s deed. You could also simply attach the deed to the agreement and reference it. For example, you could state, “Grantor is the owner of certain property located in Cook County, Illinois, which property is more particularly described on Exhibit A attached hereto.”"
    },
    {
      "title": "Identify the land benefited.",
      "content": "Identify the land benefited. Your land is called the “dominant” parcel because you use the easement to benefit your property. You should also describe your property. You can attach an exhibit of the legal description of your property, just as you did for the servient estate. Call the exhibit of the dominant estate Exhibit B. For example, you could type, “Grantee is the owner of certain property also located in Cook County, Illinois, which property is more particularly described on Exhibit B attached hereto.” You might not be the neighbor. For example, you might live several towns over but want to purchase the easement to access a lake. In this situation, you do not need to describe your property."
    },
    {
      "title": "Describe the easement area.",
      "content": "Describe the easement area. As specifically as you can, identify the piece of property you will use. If you are using the driveway, then simply call it the driveway: “The Grantor grants to Grantee the right to use the driveway on the servient parcel.” However, if you are using a certain piece of land, then you might need a surveyor to mark off the metes and bounds."
    },
    {
      "title": "Describe the right created.",
      "content": "Describe the right created. You can also specify the rights created. The property owner can grant an easement for any purpose or for a limited purpose. You should explain the rights created. For example, you could say, “Grantor grants Grantee the right to use the driveway for entering and exiting Grantee’s property only.”"
    },
    {
      "title": "State how long the easement lasts.",
      "content": "State how long the easement lasts. Easements can last for a limited amount of time or indefinitely. You should specify the duration of the easement in the agreement. Easements can also last until a specified event happens. For example, if you are building your own driveway, then you might want an easement to use your neighbor’s driveway until your own is completed. If the easement is to last indefinitely, then state, “The easement is a perpetual easement.”"
    },
    {
      "title": "Explain whether the easement can be transferred.",
      "content": "Explain whether the easement can be transferred. This is a critical part of the easement agreement. You need to explain whether the easement is something you can transfer to others, or whether it is only for your use. If the easement is something which can be transferred when you sell your property, then you need to note that it “runs with the land.” For example, you could state, “The perpetual easement is a covenant intended to run with the land and is appurtenant to the dominant parcel.” This means that when you sell the land, you sell the easement along with it. However, the easement might be intended only for your personal use. If you sell your property, then the easement doesn’t get transferred. In this situation, the easement is “in gross.” In this situation, you could write, “The nature of the easement is in gross.”"
    },
    {
      "title": "State whether the easement is exclusive.",
      "content": "State whether the easement is exclusive. You might get exclusive use to the land, or others may be able to use it. State in the agreement whether the easement is exclusive or nonexclusive. If nonexclusive, then state who may also use the easement. For example, you might state, “This easement is nonexclusive and may be accessed by the owner of the servient estate.”"
    },
    {
      "title": "Explain who is responsible for maintenance.",
      "content": "Explain who is responsible for maintenance. You should also describe in the easement document who is responsible for maintenance. If the easement holder has the right to construct improvements, then that must be stated as well. For example, you could say, “Grantee and Grantor will share in maintaining the driveway, which shall include having it graded at least once a year.”"
    },
    {
      "title": "Have the agreement notarized.",
      "content": "Have the agreement notarized. You need your easement agreement to be executed in the same manner that a deed would. In most states, this means you need to have the agreement notarized. You can find notaries at most courthouses, town offices, and large banks. To find the nearest notary, you should visit the website for the American Society of Notaries. [2] X Trustworthy Source American Society of Notaries Non-profit organization providing education, training, and supplies to notaries in the United States. Go to source Enter your zip code on the Locator page. If you need to have the agreement notarized, then insert a notary block at the bottom of the page, underneath the signature lines. You can find acceptable notary blocks by searching the Internet."
    },
    {
      "title": "Sign the document.",
      "content": "Sign the document. You should sign the document in front of the notary. Be sure to also bring sufficient personal identification to show the notary. Generally, a valid driver’s license or passport should be sufficient. Depending on your state law, you may also need the agreement witnessed. Your Recorder of Deeds office should be able to tell you whether witnesses are required."
    },
    {
      "title": "Record the easement.",
      "content": "Record the easement. You need to have the easement recorded on the deeds for both parcels. You should contact the Recorder of Deeds Office and ask how to record the easement."
    },
    {
      "title": "Get a copy of the updated deed.",
      "content": "Get a copy of the updated deed. You want to make sure the easement has been recorded on the deeds. To check, get copies. You should staple your copy of the easement agreement to your copy of the deeds. Store in a safe place."
    }
  ]
}