{
  "url": "https://www.wikihow.com/Read-PDFs-on-an-iPad",
  "title": "How to Open and Read PDFs on an iPad",
  "steps": [
    {
      "title": "Install the Apple Books app if you don't have it.",
      "content": "Install the Apple Books app if you don't have it. You can check to see if you have the Books app by searching for it in Spotlight. Just swipe right on the Home screen until the Search bar appears at the top, tap the search bar, and then tap Books . If you see an orange icon with an open book at the top, you already have the app and can skip this step. If not, here's how to get it: Open the App Store (the blue icon with a white \"A\" inside). Tap Search (the magnifying glass) at the bottom of the screen. Type apple books into the search bar and tap the Search key. Tap GET or the cloud icon next to \"Apple Books\" (the orange icon with a white book inside)."
    },
    {
      "title": "Navigate to the PDF.",
      "content": "Navigate to the PDF. If the PDF is attached to an email message, open that email message now. If it's on the web, browse to the page where you found it."
    },
    {
      "title": "Tap the PDF.",
      "content": "Tap the PDF. If it's an email attachment, it's probably at the bottom of the message. [1] X Research source This opens the file in a simple reader. If you're using Safari, the Mail app, or the Gmail app, the PDF should open in a basic readable format. You can swipe left or right through the file to flip through the pages. If you just need a quick glance at the file, this could be enough for you. If you need to do more, keep reading!"
    },
    {
      "title": "Tap the Share icon .",
      "content": "Tap the Share icon . It's the square with an upward-pointing arrow. It's at the bottom of the screen if you're using Safari or the Mail app, but could be in a different location in other browsers and apps."
    },
    {
      "title": "Scroll right and tap Copy to Books.",
      "content": "Scroll right and tap Copy to Books . It's an orange icon in the icon list near the bottom of the screen. This saves the PDF to your library and launches the Apple Books app."
    },
    {
      "title": "Tap the PDF to open it in Apple Books.",
      "content": "Tap the PDF to open it in Apple Books. This expands the PDF into full-screen mode. Now that the PDF is saved to your library, you can view it at any time by tapping the orange Books icon on your home screen and selecting the file."
    },
    {
      "title": "Swipe right or left through the pages.",
      "content": "Swipe right or left through the pages. Each swipe will move you forward or backward one page. To view a visual table of contents that lets you quickly switch between pages, tap the PDF once to bring up the toolbar, and then tap the icon of three lines prefaced by three dots near the top-left corner. [2] X Research source To bookmark a page, tap the screen once, and then tap the bookmark icon at the top-right corner."
    },
    {
      "title": "Mark up the PDF.",
      "content": "Mark up the PDF. To highlight items and/or draw on your PDF, tap the screen once to bring up the toolbar, and then tap the marker icon at the top to open the PDF in Markup. You can use the different pens, highlighters, and tools to add what you wish to the file. Tap the undo icon (the curved arrow pointing left inside of a circle) at the top to reverse your changes. Tap the back button (the < at the top-left corner) to return to your library. This will save any changes you made in Markup, although you can return to Markup at any point to add or remove markings."
    },
    {
      "title": "Tap the Share icon to share the file with others.",
      "content": "Tap the Share icon to share the file with others. If you need to send the PDF to someone else, you'll need to do so from the Apple Books app. Simply open the PDF in Apple Books, tap the screen once to bring up the toolbar, and then tap the Share icon (the box with an upward-pointing arrow) at the top to bring up the sharing options. Choose any email, messaging, or cloud sharing option to share the file."
    }
  ]
}