{
  "url": "https://www.wikihow.com/Paint-Quotes-on-Walls",
  "title": "How to Paint Quotes on Walls",
  "steps": [
    {
      "title": "Select a quote or phrase you enjoy and want to paint onto your wall.",
      "content": "Select a quote or phrase you enjoy and want to paint onto your wall. Pick a quote you like, and consider what wall you want to paint it on. Then, choose a wall without many other decorations in an easy-to-see spot, such as across from your door. You should place your quote about 2/3 of the way up your wall. You can paint short phrases or longer expressions, depending on how much wall space you have. Paint things like, \"Follow your dreams,\" \"Always kiss me goodnight,\" or \"Be grateful.\" Paint the name of your son or daughter over their bed, for example."
    },
    {
      "title": "Find a font for your quote online.",
      "content": "Find a font for your quote online. Once you select your quote, go online and search for fonts appropriate for your quote. There are countless font generating websites online. When you find a font you like, type in your quote, and press the “Print” button to download your font. [1] X Research source For example, look up “Dr. Seuss font generators” if you are using a Dr. Seuss quote. Use kids script if you are painting your son’s name above his bed."
    },
    {
      "title": "Print out your quote on paper so you can trace it onto your walls.",
      "content": "Print out your quote on paper so you can trace it onto your walls. When you download your font, select a photo file option like JPEG. Then, copy your image into Paint or Microsoft Word . Make a new document, and select \"Insert\" from the options at the top. Click on \"Image\" or \"Picture,\" and go to your Downloads folder to select your image. Adjust the sizing to your liking with the image resize tools. Press “Print” when you are finished. [2] X Research source Depending on the desired size of your quote, you can print out your quote on 1 page or print each letter on their own pages. Print on letter or legal sized paper. If you don't have a printer, you can purchase a plastic stencil with a quote or go to a copy center, such as the UPS store or your local library."
    },
    {
      "title": "Shade the back of your print-out.",
      "content": "Shade the back of your print-out. You can use either a graphite pencil, piece of chalk, or pastel stick. Flip your paper over so the front is on a table. Take your medium of choice, and shade over the back of your paper. Be sure to thoroughly cover your letters. [3] X Research source After it’s covered, you can dump away any excess pigment in your trash can or onto another piece of paper. Graphite pencils tend to work best. If you don't have a graphite pencil handy, you can also use a piece of chalk. Alternatively, pastel sticks also work to make your transfer. All 3 have about the same chance of leaving residue behind."
    },
    {
      "title": "Hang your paper to your wall with 2-4 pieces of painter’s tape.",
      "content": "Hang your paper to your wall with 2-4 pieces of painter’s tape. Be sure you place your paper exactly where you want to paint your quote. Place 1 piece of tape on the top left corner, and 1 on the top right. If you’d like, you can stick additional pieces of tape on the bottom 2 corners. [4] X Research source You can easily rip painter’s tape with your fingers. Use scissors if you need assistance!"
    },
    {
      "title": "Draw over your letters using a ballpoint pen.",
      "content": "Draw over your letters using a ballpoint pen. Start with your letters on the left side, and trace over all of the edges. As you trace, the pigment on the back of the paper will rub onto your wall, creating your outline. Press down on your pen with moderate pressure as you write. [5] X Research source Make sure you trace over the inner and outer edges!"
    },
    {
      "title": "Remove the paper and reveal your outlines.",
      "content": "Remove the paper and reveal your outlines. Peel off your tape, and take down your paper from the wall. Your letters will be transferred to the wall, so you can easily fill them in with your paint. [6] X Research source"
    },
    {
      "title": "Purchase a stencil with a quote from a craft store for an easier solution.",
      "content": "Purchase a stencil with a quote from a craft store for an easier solution. Visit a local craft store in person or online and browse stencil inventories. Many offer various quotes and phrases. Purchase 1 you like, and tape it to your wall. Then, use a pencil and trace the letters of the stencil onto your wall. [7] X Research source You can also order a custom stencil with any quote you'd like online. [8] X Expert Source Jeanine Hattas Wilson Professional Painter Expert Interview. 5 May 2021. Plastic stencils are a helpful way to paint quotes if you don’t own a printer yourself."
    },
    {
      "title": "Grab your paintbrush and acrylic paint and fill in your lines from the left.",
      "content": "Grab your paintbrush and acrylic paint and fill in your lines from the left. Squeeze out some of your paint in a bowl or onto a small plate, and add more as you need it. Dip the tip of your brush into your paint, and paint over your quote. [9] X Research source If you are painting a small quote or few words, squeeze out a few small globs of paint For painting a sentence or more, squeeze out ¼ of the bottle. You can use paint in any color you’d like! Dark colors look best on light walls, and vice versa. Go with your favorite color, or use dark brown or black for a bold quotation."
    },
    {
      "title": "Paint over all of your lines and add a second coat if you'd like.",
      "content": "Paint over all of your lines and add a second coat if you'd like. Apply an even, smooth layer of paint over all of your letters. After you finish 1 layer of paint, you can go over the letters with another layer if the paint appears transparent. [10] X Research source Most of your letters should be pretty dry after you finish your first coat. If they are still wet, wait 30 minutes or so for your paint to dry in between coats."
    },
    {
      "title": "Let your paint dry for 1-3 hours and wash your materials.",
      "content": "Let your paint dry for 1-3 hours and wash your materials. When you finish painting over all of your quote, wash your materials with soap and water. You can squeeze a dime-sized amount of soap into your palm, and rub the bristles of your paintbrush into the soap. Then, run it under warm water. Give your walls a few hours to dry to avoid smudging or smearing your painted quotes. [11] X Research source To test how dry your paint is, very lightly touch the center of a bold line with the tip of your finger."
    },
    {
      "title": "Wash off any remaining markings from your wall after your paint is dry.",
      "content": "Wash off any remaining markings from your wall after your paint is dry. If you have smudges or marks on your walls, you can easily wash them off when your paint dries. Wet a washcloth with water from your sink, and squeeze out the excess. It should be damp, but not soaking wet. Then, lightly rub it over the marks on your walls. [12] X Research source Avoid rubbing your washcloth over your paint to avoid smudging or messing up your lettering."
    },
    {
      "title": "Touch up your lines once the paint is dry and your walls are clean.",
      "content": "Touch up your lines once the paint is dry and your walls are clean. Grab your brush, dip it in your paint, and smooth over any uneven lines or smeared spots. Make precise, smooth lines over the edges, and look for any places where the paint may still be transparent. [13] X Research source If your painted quote already looks fabulous, skip over the touch-ups! You only need to do this if your quote could use some finishing touches."
    }
  ]
}