{
  "url": "https://www.wikihow.com/Propagate-Areca-Palm",
  "title": "How to Propagate Areca Palm",
  "steps": [
    {
      "title": "Separate the offshoot with a knife.",
      "content": "Separate the offshoot with a knife. Examine the base of the Areca palm to find any offshoots that are growing from the main branch. Use a sharp knife to split this offshoot away from the main plant. If you’re having trouble separating this offshoot, try using sawing motions with your blade. [2] X Research source You don’t need to have any fancy gardening tools for this."
    },
    {
      "title": "Pull the separated offshoot from the soil by the root.",
      "content": "Pull the separated offshoot from the soil by the root. Grip the offshoot with both hands and try to free it from the soil. Pull on the plant slowly to loosen it from the roots, then tug it out of the soil completely. [3] X Research source Don’t try to pull out the plant in 1 go. If you can’t see the roots, dig around the base of the plant’s soil to reveal some of the roots. Wear gardening gloves to protect your hands."
    },
    {
      "title": "Soak the roots in a bowl of water for 1 hour.",
      "content": "Soak the roots in a bowl of water for 1 hour. Fill a bowl halfway with lukewarm or cool tap water, then submerge the exposed roots. Let the plant soak for around an hour so the roots are ready to be replanted. [4] X Research source Depending on the size of your offshoot, you may need a large bowl."
    },
    {
      "title": "Transplant the seedling into a pot.",
      "content": "Transplant the seedling into a pot. Choose a planting pot that’s large enough to fit your Areca palm offshoot. Fill this pot with a commercial soil mixture, then place your seedling inside. Double-check to make sure that the roots are fully buried in the soil so the offset can grow on its own. [5] X Research source Areca palms can be grown in pots that are as small as 6 in (15 cm) and as large as 52 in (130 cm). You can use peat and sand as an alternative for traditional soil mixes, as long as you combine them in a 3:1 ratio. You can also use a mixture of peat, sand, and pine bark, which can be combined in a 6:1:3 ratio."
    },
    {
      "title": "Scrub the seeds against a mesh screen to get rid of the outer skin.",
      "content": "Scrub the seeds against a mesh screen to get rid of the outer skin. Take a handful of Areca seeds and place them on top of a large, mesh screen. Turn on a hose or tap, then place both the screen and the seeds beneath the water. Rub the wet seeds along the mesh until the outer, fibrous layer of each seed washes away. [7] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source This process is also known as “cleaning” the seed. You can purchase Areca palm seeds at a nursery or garden center."
    },
    {
      "title": "Soak the palm seeds in a cup of lukewarm water for up to 1 week.",
      "content": "Soak the palm seeds in a cup of lukewarm water for up to 1 week. Fill a bowl or cup with tap water and place your peeled or “cleaned” inside. Change the water on a daily basis so the hard outer shell of the seed can soften. [8] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source Soaked seeds are more likely to germinate successfully."
    },
    {
      "title": "Sow the palm so the top of the seed is slightly visible.",
      "content": "Sow the palm so the top of the seed is slightly visible. Fill a planting pot with soil, then bury your soaked seed beneath the surface. Since your seeds are in partial shade, you don’t need to bury them all the way. [9] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source You can use a commercial soil mixture to sow your seeds. You can also combine peat and sand at a 3:1 ratio, or peat, sand, and pine bark at 1 6:1:3 ratio."
    },
    {
      "title": "Plant the seeds 3 to 6 feet (0.91 to 1.83 m) apart if you’re planting outside.",
      "content": "Plant the seeds 3 to 6 feet (0.91 to 1.83 m) apart if you’re planting outside. Dig a small hole or indent in the soil where you plan to grow your Areca palms. Bury the seed slightly beneath the surface, leaving part of the seed visible. Space any additional seeds by several inches or centimeters so your palms have plenty of room to grow. [10] X Research source Areca palms grow most successfully in a well-drained, partially shaded area. [11] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source"
    },
    {
      "title": "Water the palm on a daily basis to keep the soil moist.",
      "content": "Water the palm on a daily basis to keep the soil moist. Pour water over the base of the plant until the soil looks moist to the touch. Unlike succulents and other warm-weather plants, note that Areca palms need a consistent, regular amount of water so they don’t dry out. [12] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source You know you’ve overwatered if you see a visible puddle forming on your soil. If you overwater the plant, you might damage it."
    },
    {
      "title": "Grow Areca palms in a partially shaded area.",
      "content": "Grow Areca palms in a partially shaded area. Find an area in your home that doesn’t get a constant amount of sunlight, as you don’t want your plant to dry out. [13] X Research source Instead, look for an east-, south-, or west-facing window in your home, as these will give your plant a proper, balanced amount of sunlight and shade. [14] X Research source"
    },
    {
      "title": "Leave the palms in an 80 °F (27 °C) environment.",
      "content": "Leave the palms in an 80 °F (27 °C) environment. During the day, try to keep your plant in a consistently warm area that’s between 75 and 85 °F (24 and 29 °C). At nighttime, keep your palm plant in a cooler temperature that’s between 65 to 70 °F (18 to 21 °C). [15] X Research source If you don’t want your home to be this hot, keep your Areca palm on a porch, deck, or other outdoor area."
    },
    {
      "title": "Sprinkle fertilizer over the soil once each month.",
      "content": "Sprinkle fertilizer over the soil once each month. Visit your local gardening center, nursery, or home improvement store to find a nitrogen-rich fertilizer with a 3-1-2 Nitrogen-Phosphorus-Potassium (NPK) level. Sprinkle a spoonful of this over the surface of the soil, or however much is needed to cover the entire surface. [16] X Research source You can also use Osmocote, which is a fertilizer with a 19-6-12 NPK ratio. A teaspoon (6 g) of fertilizer is generally enough to cover the surface of a 6 in (15 cm) pot."
    }
  ]
}