{
  "url": "https://www.wikihow.com/Play-Spoons-(Card-Game)",
  "title": "How to Play Spoons: Instructions, Rules, & More",
  "steps": [
    {
      "title": "Arrange the spoons in a small circle in the middle of the table.",
      "content": "Arrange the spoons in a small circle in the middle of the table. Count your players, then place however many spoons is one less than the number of players. For example, if you're playing with 6 people, use 5 spoons."
    },
    {
      "title": "Shuffle",
      "content": "Shuffle a standard 52-card deck and deal 4 cards to each person. Keep the remaining cards in a deck next to the dealer. [1] X Research source Each player holds 4 cards throughout the entire game."
    },
    {
      "title": "Everyone takes one of their cards and discards it to their left simultaneously.",
      "content": "Everyone takes one of their cards and discards it to their left simultaneously . The person to the right of the dealer puts their card in a separate discard pile, while the dealer picks up a new card from the deck. [2] X Research source You don’t have to exchange cards with the card you receive, unless you want to—just pass the card to the player to your left."
    },
    {
      "title": "Repeat this process of everyone passing to the left.",
      "content": "Repeat this process of everyone passing to the left. During each round, the dealer picks up a new card and the person to their right adds one to the discard pile—creating a continuous influx of new cards. [3] X Research source Each player continues to circulate their cards, making each round pass quickly. It can get hard to keep track of what’s going on, but that makes the game more fun and exciting!"
    },
    {
      "title": "The first person with 4 of a kind (e.g. all 4 aces or all 4 nines) picks up a spoon.",
      "content": "The first person with 4 of a kind (e.g. all 4 aces or all 4 nines) picks up a spoon. As soon as someone picks up a spoon, the rest of the players can grab one too—even if they don’t have their own 4 of a kind. The person left without a spoon at the end of the round loses."
    },
    {
      "title": "Grab a spoon as soon as you notice one missing.",
      "content": "Grab a spoon as soon as you notice one missing. Although you can get caught up trying to get your own 4 of a kind, pay attention to other people's movements and check the number of spoons on the table throughout the game. [4] X Research source"
    },
    {
      "title": "Remove a spoon every time you remove a player from the game.",
      "content": "Remove a spoon every time you remove a player from the game. For example, if the first round has 6 players and 5 spoons, the second round has 5 players and 4 spoons. Continue playing until you’re left with a single person, who is the winner."
    },
    {
      "title": "Use the spelling method to score points.",
      "content": "Use the spelling method to score points. Similar to the basketball game Horse , give the loser of each round a single letter from the word “Spoon” (e.g. they get the letter “S,” and then “P”). The first player to receive all the letters to spell out the word loses. With this variation, the rules stay the same but the game takes a little longer."
    },
    {
      "title": "Play the “extreme” version of the game.",
      "content": "Play the “extreme” version of the game. Instead of arranging the spoons in the middle of the table, place them in random locations in the room you’re playing in. For example, you can position them along the wall or underneath furniture to make the game even more action packed and exciting. [5] X Research source"
    },
    {
      "title": "Use jokers as wildcards.",
      "content": "Use jokers as wildcards. If you’re looking to make the game a little easier, include the 2 jokers in your deck so you can reach your 4 of a kind faster. Since the joker is a wildcard, you can use it with any combination of cards. [6] X Research source"
    }
  ]
}