{
  "url": "https://www.wikihow.com/Repair-a-Cracked-Mirror",
  "title": "How to Repair a Cracked Mirror",
  "steps": [
    {
      "title": "Clean the mirror",
      "content": "Clean the mirror with soap and warm water. Take a sponge or a clean cloth and soak it in warm water. Apply a drop of dish soap and work the sponge or cloth into a lather. Wipe the cracked area clean to remove dirt and dust from the surface. [1] X Research source Dirt, dust, and debris can affect how well the resin fills the crack, so be sure to clean the area well! Remove any loose fragments of glass from the crack."
    },
    {
      "title": "Remove the adhesive backing of the stabilizer film.",
      "content": "Remove the adhesive backing of the stabilizer film. Take the clear stabilizer strip and locate the edge of the adhesive backing. Use your fingertips to peel off the backing to expose the adhesive. [2] X Research source Don’t peel off the adhesive backing until you’re ready to apply the film. Be careful not to allow the film to stick to itself or it may no longer be effective."
    },
    {
      "title": "Press the stabilizer film over the crack.",
      "content": "Press the stabilizer film over the crack. Place a corner of the stabilizer film onto the mirror at the edge of the crack. Apply the film over the crack by rolling it over the surface from the corner so no air gets trapped beneath the film. [3] X Research source Avoid removing the film and reapplying it or it could affect how well it adheres and leave behind a sticky residue."
    },
    {
      "title": "Use your fingers to smooth out the stabilizer film.",
      "content": "Use your fingers to smooth out the stabilizer film. Run your fingertips from 1 end of the stabilizer film to the other. Work to push out any air bubbles that may be trapped beneath the film and create a tight seal over the crack. [4] X Research source Make sure there aren’t any creases or bubbles in the film."
    },
    {
      "title": "Fill the syringe with the epoxy resin adhesive.",
      "content": "Fill the syringe with the epoxy resin adhesive. The epoxy resin adhesive comes with a plastic syringe. Push the plunger of the syringe so it’s all the way down, then insert the syringe into the container of resin. Slowly pull the plunger to pull out the resin and fill the syringe. You may need to cut the tip of the syringe with a pair of scissors in order to use it. If the resin did not come with a syringe, you can find one at an auto supply store, department store, or online."
    },
    {
      "title": "Insert the tip of the syringe through the stabilizer film.",
      "content": "Insert the tip of the syringe through the stabilizer film. Place the tip of the syringe over the stabilizer film roughly at the center. Use gentle pressure to push the syringe through the film and into the crack. The tip of the syringe should be inside of the crack."
    },
    {
      "title": "Push down the plunger to fill the crack with resin.",
      "content": "Push down the plunger to fill the crack with resin. Keep the syringe still and slowly push on the plunger. The resin will leave the syringe and fill the crack. The stabilizer film will keep the resin contained in the crack. Add a small amount of resin at a time. If you apply too much too quickly it could form an uneven bulge under the film."
    },
    {
      "title": "Wait 20 minutes to allow the resin to harden.",
      "content": "Wait 20 minutes to allow the resin to harden. After you apply the resin to the crack, slowly pull the tip of the syringe out of the stabilizer film. Leave the resin undisturbed for at least 10 minutes so it can start to set and harden in the crack. [5] X Research source Check the packaging of the resin adhesive for specific drying times. Set an alarm on your phone or clock for 20 minutes."
    },
    {
      "title": "Peel off the stabilizer film.",
      "content": "Peel off the stabilizer film. Use your fingernails to pry up a corner of the stabilizer film. Use 1 smooth motion to gently remove the film by peeling it off. [6] X Research source Don’t use quick or jerky movements or you could tear off a section of the film. Use a razor blade to get underneath the film if you can’t peel it off with your fingertips."
    },
    {
      "title": "Add a drop of the resin over the crack and cover it with the curing film.",
      "content": "Add a drop of the resin over the crack and cover it with the curing film. Use the syringe to squeeze out a small drop of the resin adhesive over the freshly filled crack. Take the curing film and press it over the crack. The small drop of resin will spread out under the film to cover the crack. [7] X Research source Use your fingers or a razor blade to smooth out the curing film and remove any bubbles from beneath it."
    },
    {
      "title": "Wait 1 hour to allow the resin to cure.",
      "content": "Wait 1 hour to allow the resin to cure. Leave the curing film completely undisturbed to allow the resin to fully set and cure in the crack. [8] X Research source Check the packaging of the resin for the specific curing time. Aim a fan at the mirror to help it cure faster. Set an alarm for an hour so you can be sure when the resin is done curing."
    },
    {
      "title": "Remove the curing film and scrape away the excess resin.",
      "content": "Remove the curing film and scrape away the excess resin. Pry up a corner of the curing film with your fingertips and gently peel it off. Try to use 1 smooth, fluid motion so the strip comes off cleanly. Take a razor blade or a utility knife and gently scrape over the top of the crack to remove any excess resin. [9] X Research source Be careful not to scratch the resin of the glass of the mirror. Angle the razor blade or utility knife so it’s parallel with the surface to run it over the crack evenly."
    },
    {
      "title": "Clean the area with glass cleaner.",
      "content": "Clean the area with glass cleaner. Polish the repaired mirror by spraying some glass cleaner over the entire surface. Use a clean cloth and rub the mirror in circular motions to buff it clean. [10] X Research source Don’t saturate the mirror with glass cleaner. You can find glass cleaner at department stores and online."
    }
  ]
}