{
  "url": "https://www.wikihow.com/Open-an-MP4-File-on-PC-or-Mac",
  "title": "How to Open an MP4 File on PC or Mac",
  "steps": [
    {
      "title": "Press ⌘ Cmd + Space to open Finder.",
      "content": "Press ⌘ Cmd + Space to open Finder. Finder’s search bar should appear at the center of your screen."
    },
    {
      "title": "Type in \"QuickTime Player\" and double click on it.",
      "content": "Type in \"QuickTime Player\" and double click on it. You should see a blue icon with a “Q”. If QuickTime Player does not come up you will need to download it from the App Store. This is usually not the case since QuickTime Player comes preinstalled on most Mac computers."
    },
    {
      "title": "Go to your MP4 file and double click it.",
      "content": "Go to your MP4 file and double click it. This should open the MP4 file with QuickTime Player if you have not changed your default media player. To make QuickTime Player your default media player right-click your MP4 file. Click Get Info and select QuickTime Player under Open With . Click Change All and Continue to set it as your default player."
    },
    {
      "title": "Press Play to view your file.",
      "content": "Press Play to view your file. MP4 files are video files that typically come from mobile phones."
    },
    {
      "title": "Locate the MP4 file on your computer.",
      "content": "Locate the MP4 file on your computer."
    },
    {
      "title": "Double-click the MP4 file to open it.",
      "content": "Double-click the MP4 file to open it. The file should automatically open with Windows Media Player. This software comes pre-installed on most Windows computers. If the file does not open with Windows Media Player, do the following: Right-click the file Select Open With Select Windows Media Player from the drop-down menu."
    },
    {
      "title": "Press Play to view your MP4 file.",
      "content": "Press Play to view your MP4 file."
    },
    {
      "title": "Download VLC Media Player",
      "content": "Download VLC Media Player . You should download VLC Media Player from Videolan.org ."
    },
    {
      "title": "Install VLC Media Player.",
      "content": "Install VLC Media Player. Installation for Windows or macOS varies. On Windows, download the zip file and right click on it. Select extract here and open the folder it creates. Click the launcher inside the folder to start the installation wizard. Follow the on-screen instructions to finish setting it up. On macOS, download the dmg file and double-click it. After entering your password it will start installing. If you get a message about it being a third-party app press ok."
    },
    {
      "title": "Open VLC Media Player.",
      "content": "Open VLC Media Player. The icon is an orange traffic cone with white stripes."
    },
    {
      "title": "Click on Media.",
      "content": "Click on Media . It is located at the top of the window."
    },
    {
      "title": "Select Open File from the drop-down menu.",
      "content": "Select Open File from the drop-down menu. A window will pop up asking you to choose a file."
    },
    {
      "title": "Choose your MP4 file and click Open.",
      "content": "Choose your MP4 file and click Open . VLC Media Player supports all types of audio files. [1] X Research source"
    },
    {
      "title": "Click the play button to view your MP4 file.",
      "content": "Click the play button to view your MP4 file. These types of files are typically videos."
    }
  ]
}