{
  "url": "https://www.wikihow.com/Mip-vs-Npt",
  "title": "A Comparison Between MIP and NPT Fittings",
  "steps": [
    {
      "title": "MIP, or Male Iron Pipe, is a type of NPT, or National Pipe Taper thread.",
      "content": "MIP, or Male Iron Pipe, is a type of NPT, or National Pipe Taper thread. NPT threads are the standard for pipe fittings across the United States. These fittings are threaded, meaning they have spiral grooves, much like a screw, that twist into a pipe. The threads on all NPT fittings are at a 60° angle, making them easy to install with most pipes. MIP fittings are also threaded at a 60° angle, so they fall under the umbrella of NPT threads. [1] X Research source While the thread angle of both MIP and NPT threads are the same, they both come in varying diameters and sizes. If you don’t already know your fitting’s pitch, or amount of threads per inch (TPI), it’s easy to measure it yourself . Use a string to find the circumference of your fitting. Then, divide it by pi, or 3.14159, to find the decimal equivalent. Simply use a conversion chart to find the thread dimensions."
    },
    {
      "title": "MIP and NPT fittings thread into different ports.",
      "content": "MIP and NPT fittings thread into different ports. For every MIP and NPT fitting, there is a corresponding “female” port that receives the fitting. This creates the seal between pipes. The threads on MIP fittings screw into the threads of an FIP, or Female Iron Pipe, fitting whose threads are hidden inside. [2] X Research source On the other hand, NPT threads fit inside FNPTs, or Female National Pipe Taper threads. [3] X Research source"
    },
    {
      "title": "MIP fittings are better for high-pressure systems than NPT threads.",
      "content": "MIP fittings are better for high-pressure systems than NPT threads. NPT fittings can’t withstand a lot of pressure, otherwise they leak. So, they’re mostly used in residential plumbing and gas pipes. You might see them around your shower pipes or gas-powered grill. [4] X Research source Unlike NPT threads, MIP fittings can withstand a lot more pressure. They’re more often used in industrial piping. [5] X Research source"
    },
    {
      "title": "MIP fittings are usually metal, while NPT threads are typically plastic.",
      "content": "MIP fittings are usually metal, while NPT threads are typically plastic. As their name implies, MIP fittings are commonly made out of iron. However, they can be made out of a variety of materials like copper, steel, and brass. Unlike MIP fittings, NPT threads are most commonly made out of heavy-duty plastics like PVC. [6] X Research source"
    },
    {
      "title": "NPT threads have a tapered shape while MIP fittings are straight.",
      "content": "NPT threads have a tapered shape while MIP fittings are straight. One of the biggest differences between NPT and MIP fittings are their shapes! NPT threads slightly taper down starting at the base, so the top of the fitting is wider than the end. MIP fittings are completely straight all the way down, so the base is the same width as the end. [7] X Research source Generally, tapered fittings make a tighter seal than straight fittings. [8] X Research source"
    },
    {
      "title": "NPT threads are sealed with teflon tape while MIP fittings use pipe dope.",
      "content": "NPT threads are sealed with teflon tape while MIP fittings use pipe dope. While the threads on both NPT and MIP fittings allow them to adhere tightly to pipes, they still need a sealant to prevent leaks. Generally, teflon or PTFE (Polytetrafluoroethylene) tape is wrapped around NPT threads to secure their seal. MIP fittings are most commonly sealed with pipe dope, which is a paste that’s applied onto the threads. [9] X Research source While these are the sealants most commonly used with each fitting, NPT threads can be sealed with pipe dope, and MIP fittings can be wrapped in teflon tape."
    },
    {
      "title": "NPT and MIP threads fit together, but work best with their own fittings.",
      "content": "NPT and MIP threads fit together, but work best with their own fittings. Because both NPT and MIP fittings use the same thread angle, they are compatible with one another. However, the fact that NPT threads are tapered and MIP fittings are straight means they won’t create the most air-tight seal. When connecting your pipes, use a MIP fitting with a FIP fitting, and an NPT thread with a matching FNPT thread. While NPT and MIP threads can be used together, they are not compatible with other common fitting types like BSPT, British Standard Pipe Taper, or BSPP, British Standard Pipe Parallel."
    }
  ]
}