{
  "url": "https://www.wikihow.com/Prepare-Yourself-for-EMDR-Therapy",
  "title": "How to Prepare Yourself for EMDR Therapy",
  "steps": [
    {
      "title": "Know what to expect.",
      "content": "Know what to expect. EMDR therapy is not a one-time treatment. It utilizes an eight-phase approach to psychotherapy, and requires the patient to recall painful memories while the therapist guides them through a series of eye movements. [2] X Research source Each set of eye movements lasts approximately 30 seconds, and is designed to replicate the mechanisms that take place during Rapid Eye Movement (REM) sleep. EMDR therapy helps patients deal with a traumatic past, but it can also help cope with present circumstances and even plan for future events. Studies have shown that eye movements help disrupt working memory. [3] X Research source The combination of exposure therapy and eye movement help the patient's brain process the traumatic memories. This changes the trauma from what's considered a \"stuck memory\" into a resolved learning experience, after which the patient is able to let go of the feelings of trauma. [4] X Research source EMDR has a high rate of success, when patients complete the entire course of treatment. Some patients are able to process a single traumatic event in as few as three sessions, while other patients need 12 or more sessions to fully process an event. Every patient is different, and for maximum results you should adhere to your therapist's recommendations."
    },
    {
      "title": "Learn if EMDR will help you.",
      "content": "Learn if EMDR will help you. EMDR was originally designed to primarily treat PTSD, but the scope of treatment has expanded somewhat over time. There is some anecdotal evidence which suggests that EMDR may be useful in treating phobias and panic disorders, but researchers have failed to find any strong clinical success in the use of EMDR for these conditions. EMDR is most effective at treating PTSD and trauma from assault, combat, or life-threatening situations. However, EMDR may be effective at treating other anxiety disorders, if those disorders originated in response to a traumatic incident. If you think EMDR therapy might be right for you, talk to your doctor or contact an EMDR-qualified therapist for a consultation."
    },
    {
      "title": "Find an EMDR-qualified therapist.",
      "content": "Find an EMDR-qualified therapist. It is vital that therapists be formally trained in EMDR therapy. The memories brought up in EMDR therapy are often traumatic, life-threatening events, and it is imperative that the therapist knows how to properly administer treatment and help the patient cope with these memories. If the therapist is not formally trained in EMDR, the treatment could be ineffective, or even harmful. Ask your prospective therapist if they have received both levels of EMDR training, and whether that training was through an EMDRIA-approved institution. Ensure that the prospective therapist is up to date on the latest EMDR protocols and practices. Ask the prospective therapist how many cases they have treated with the problem for which you are seeking treatment, and what their success rate has been for those cases. To find a qualified EMDR therapist in the United States or Canada, visit the Psychology Today search engine at https://therapists.psychologytoday.com/rms/prof_search.php . You can search by state or province, then expand the “Treatment Orientation” tab on the left-hand side to search for EMDR treatment. If you live outside these regions, you can use an online search engine like Google to find EMDR therapists in your area."
    },
    {
      "title": "Anticipate a slow start.",
      "content": "Anticipate a slow start. Before the actual EMDR therapy begins, the patient and therapist begin a period of preparation. This is important for the patient’s health and the success of the therapy, as the therapist teaches the patient various techniques to cope with the traumatic memories discussed during therapy. These techniques should ultimately help the patient to control or “soothe” their emotional response to the painful and traumatic memories that will arise during subsequent sessions. The preparation phase will vary, depending on the patient and their ability to manage the trauma. Many therapists feel that the patient is typically ready after one or two initial sessions, but the decision to move forward is at the discretion of the therapist. The end of the preparation phase will ultimately be determined by the perceived preparedness of the patient."
    },
    {
      "title": "Avoid wearing contact lenses.",
      "content": "Avoid wearing contact lenses. Due to the rapid eye movements associated with EMDR therapy, patients’ eyes often become dried out during sessions. If you wear contact lenses, switch to glasses for your session, or bring a lens case and solution to your session so you can remove your contacts before you get started."
    },
    {
      "title": "Consider bringing eye drops.",
      "content": "Consider bringing eye drops. In addition to removing your contact lenses, you may wish to bring eye drops to your session. Many patients experience dry, irritated eyes as a result of the eye movements associated with EMDR therapy. If you are prone to dry eyes, or if you are worried about experiencing dry eyes during a session, consider bringing some type of over-the-counter rehydrating eye drops, also known as artificial tears. These are available at most pharmacies and drug stores, and can help rejuvenate dry eyes or prevent them altogether."
    },
    {
      "title": "Prepare to bring up painful memories.",
      "content": "Prepare to bring up painful memories. The point of EMDR therapy is to allow the patient to better process memories of a traumatic experience. In order to do this, you must be willing to confront those traumatic memories, which can be stressful, painful, and generally unpleasant. However, the advantage of EMDR therapy is that you can confront those memories in a safe and secure environment under the guidance of a trained professional. Anticipate some degree of distress, discomfort, or pain, especially in the early stages of treatment."
    },
    {
      "title": "Plan to relax afterward.",
      "content": "Plan to relax afterward. Because EMDR therapy involves the evocation of painful or unpleasant memories, it is recommended that patients take the rest of the day off after a session, if at all possible. Some experts recommend trying to take a nap at home after the session ends. This is both to help soothe the patient after recalling upsetting memories, and to continue the processing that was begun during the EMDR session. If you can, try to schedule your sessions for days on which you will not have to return to work. It’s important to give yourself time immediately after your EMDR session to relax and process the emotions that arise during therapy."
    },
    {
      "title": "Anticipate a post-session emotional response.",
      "content": "Anticipate a post-session emotional response. Many patients experience upsetting emotional responses for several days after a session, with some particularly strong responses lasting several weeks. These responses are normal, and should simply be recounted to your therapist at the start of your next session. Some patients experience extreme responses that trigger depressive episodes, and these incidents should be reported to the therapist immediately to ensure the safety of the patient. Common responses in the days after a session include: feelings of insight vivid or upsetting dreams strong emotions recalling memories that had been blocked or forgotten"
    },
    {
      "title": "Follow your appointment schedule.",
      "content": "Follow your appointment schedule. Studies have shown that patients who do not complete the full eight-phase course of treatment are more likely to lose the beneficial effects of treatment, or lack any significant benefits whatsoever. For this reason, it is imperative that you commit to the full course of treatment, if you or your therapist believes that EMDR treatments could help you. Phase one - this phase of therapy involves the therapist taking down the patient's history. The therapist will then assess the patient's preparedness to progress, and will work with the patient to develop a treatment plan. Phase two - during the second phase of treatment, the therapist will work with the patient to ensure that they have multiple methods of coping with emotional pain and trauma. During this phase, the therapist may teach the patient different stress-reduction techniques and develop a plan to process disturbing emotions as they arise. Phases three through six - in these phases of treatment, the patient will identify some type of vivid visual imagery they associate with the traumatic memory, a negative belief they hold about themselves, a positive belief they hold about themselves, and any other emotions or sensations related to the memory. Sessions during these phases will focus on the use of eye movement. The therapist will also teach the patient to focus on the positive self-belief that they have identified. Phase seven - during phase seven, the therapist works with the patient to find some type of closure on the trauma. If the therapist has not done so yet, they will now begin asking the patient to keep a log throughout the week, and will work on instituting the self-calming and coping techniques from phase two for use at home when the patient is keeping their weekly log. Phase eight - in this (potentially) last phase, the therapist will review how much progress the patient has made and evaluate how to move forward."
    },
    {
      "title": "Be open and honest.",
      "content": "Be open and honest. In many ways, the course of each EMDR session is determined by the patient. The patient is always left in charge of deciding how much to tell the therapist in a given session, and whether they feel comfortable continuing or would prefer to stop. But through it all, it’s important that you offer your therapist total honesty in everything you discuss. If you need to stop or don’t yet feel comfortable proceeding on a certain topic, that is perfectly fine. However, in order to fully move past the trauma of the event, you will eventually need to open up about all aspects of the experience. As a patient, you have every right to withhold details or memories until you’re more comfortable revealing that information, but it’s important to know that prolonged withholding of information will extend the duration of the therapy, and may delay the healing process."
    },
    {
      "title": "Develop new coping skills.",
      "content": "Develop new coping skills. Though the memories of trauma will continue to live on in the patient’s mind, a successful course of EMDR therapy should help reduce or completely eliminate the distressing symptoms that had previously accompanied those memories. Once the memory no longer causes flashbacks, panic attacks, or symptoms of trauma, the therapist and patient will begin to develop new coping skills to help process and live with those memories, as well as any future trauma that may arise."
    }
  ]
}