{
  "url": "https://www.wikihow.com/Remove-Urine-Smells-from-a-Pet",
  "title": "How to Remove Urine Smells from a Pet",
  "steps": [
    {
      "title": "Purchase a pet-safe shampoo.",
      "content": "Purchase a pet-safe shampoo. Removing the urine smell from your pet will require giving him a good bath. When you are at the pet store, you may not find a shampoo that is specific to removing a urine smell. Fortunately, a thorough cleaning with a mild, good-quality shampoo will likely be effective in getting the smell out of your pet's skin and fur. Deodorizing shampoos are available that contain baking soda or citrus to neutralize bad odors. [2] X Research source Oatmeal- or aloe vera-containing shampoos are usually a good choice, since they will not dry out your pet's skin. [3] X Research source [4] X Research source If your pet has a skin condition (e.g., allergies, dry skin), your veterinarian can recommend a shampoo that is specific to your his medical needs. Do not use a human shampoo (even baby shampoo). Although human shampoo is not toxic to your pet, it can contain ingredients or fragrances than can irritate his skin. In addition, human shampoo has a pH that could lead to a skin reaction. [5] X Research source Consider purchasing a pet-safe conditioner that will help replenish the natural oils in your pet's skin and coat. [6] X Research source"
    },
    {
      "title": "Purchase a brush.",
      "content": "Purchase a brush. If you do not have one already, purchase a brush from your local pet store. The brush will be needed to smooth out your pet's coat before bathing him. [7] X Research source The type of brush you need will depend on the texture of your pet's coat. The staff at your local pet store can help you pick out the type of brush that would work best for your pet. For your cat, a metal comb and a bristle or rubber brush are useful for smoothing her coat and removing dead and loose hair. If your dog has a short and smooth coat, bristle and rubber brushes will loosen and remove dead skin and dirt. If your dog has long hair, slicker and bristle brushes are most useful. [8] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Gather together several towels.",
      "content": "Gather together several towels. You will probably need at least a few towels for the bathing process. If you are bathing your pet in your tub, you will need to put a towel in the bottom of the tub to create a non-skid surface. [9] X Research source At least one or two more towels (depending on your pet's size) will be needed to dry off your pet after his bath. Super-absorbent towels are available at your local pet store. [10] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source If you have a cat or very small dog, he's probably small enough to be bathed in your sink. However, since he smells like urine, it is advisable to bathe him in your bathtub instead of your kitchen sink. Pet-specific blow dryers are available at your local pet store if you prefer to dry your pet with a blow dryer. They can be especially useful for long haired pets. Make sure that your pet is comfortable with the noise of a blow dryer before using it to dry him off. [11] X Research source"
    },
    {
      "title": "Organize all of your supplies.",
      "content": "Organize all of your supplies. Dogs and cats are not particularly fond of being bathed. The experience will be even less enjoyable for them if you have to keep running back and forth to get the shampoo, towel, etc. Having everything in one place will make the bathing process easier for you and more tolerable for your pet. [12] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source In addition to the aforementioned bath supplies, you may also need some cotton balls that you would place in your pet's ears to keep protect them from water. [13] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source A small washcloth will be needed to clean your pet's face. Pouring or spraying water directly on your pet's face would be a very unpleasant experience for him. [14] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Nail trimmers could also be helpful if you want to trim your pet's nails before you bathe him. Trimming your pet's nails may keep you from being scratched when you are bathing your pet. [15] X Research source It is important not to get shampoo in your pet's eyes, so you may want to consider purchasing an pet-safe eye ointment. [16] X Research source Ask your veterinarian for recommendations on which ointment to purchase. If you are bathing your pet outside, you may want to purchase a pet-specific tub (available at your local pet store) or kiddie pool to set him in. [17] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source If you are bathing your pet in your tub, it would be helpful to place a piece of steel wool in the drain to keep his fur from clogging your drain. [18] X Research source Keep plenty of treats on hand. The treats will help your pet make a positive association with bath time."
    },
    {
      "title": "Bring your pet to the bathing area.",
      "content": "Bring your pet to the bathing area. If you have a dog, it is important not to call him to where you are. He will be expecting something positive when he comes to you, and may be very disappointed that you called him for something as unpleasant as a bath. [19] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source It is preferable to either pick him up and carry him to the bathing spot (if he's small enough), or walk him there. [20] X Research source You can pick up your cat, but he may run and hide from you if he knows that you are about to give him a bath. Entice him out of his hiding spot with a treat. Do not be surprised if your pet becomes resistant once he realizes where he is going. If this happens, do not raise your voice. [21] X Research source Be gentle yet firm with him, since bathing him will be necessary to remove the urine smell. Once you get to the bathing area, it may be helpful to give your pet a treat or two. If you are bathing your pet in the tub, place a towel in the tub before he gets in."
    },
    {
      "title": "Brush your pet.",
      "content": "Brush your pet. Brushing your pet will remove any tangles or matted fur. Doing this before you bathe him is very important—trying to brush through tangles or mattes is next to impossible when your pet's coat is soaked with water. [22] X Research source Start from your pet's neck and slowly work your way down to his tail."
    },
    {
      "title": "Trim your pet's nails.",
      "content": "Trim your pet's nails. If your pet's nails have not been trimmed in a while, your pet could easily use his nails to scratch you while you are bathing him. If you are comfortable with doing so, trim your dog's or cat's nails. If you have to use styptic powder on any of the nails to stop bleeding, wait until the bleeding has stopped before bathing him."
    },
    {
      "title": "Place cotton balls in your pet's ears.",
      "content": "Place cotton balls in your pet's ears. Keeping water out of your pet's eyes, ears, and face will be important when you are bathing him. If your pet will let you, place one or two cotton balls in each ear. [23] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source If he doesn't like having cotton balls in his ears, use extra care to avoid getting water in his ears. [24] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Remember to take the cotton balls out of his ears when you have finished bathing him. [25] X Research source"
    },
    {
      "title": "Get your pet completely wet.",
      "content": "Get your pet completely wet. If you are using a hose or handheld shower head to bathe your pet, make sure that the water pressure is not too forceful. You can also use a large plastic pitcher to pour water over him. [26] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source If you are giving your pet a bath inside, make sure that the water is no hotter than lukewarm. [27] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source You may not be able to adjust the temperature of the water if you are bathing your pet outside. To get your pet comfortable with the sensation of getting wet, put the water on his back and shoulders first. Once he has relaxed, wet his neck and work your way back to his tail. [28] X Research source"
    },
    {
      "title": "Shampoo your pet.",
      "content": "Shampoo your pet. Place a generous amount of shampoo in your palm and use your fingers to gently work the shampoo into your pet's coat and skin, starting from his neck and working your way back. [29] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source By working back from his neck, you will prevent any fleas from moving up his body towards his face and head. [30] X Research source You will probably need to shampoo your pet more than once to get the urine smell out. Keep in mind that shampoo has the tendency to strip the skin and coat of natural oils, so you do not want to shampoo him too many times. Use a washcloth dampened with plain water (no shampoo- bold) to wash your pet's face. [31] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Talking with your pet in calming voice and offering him occasional treats will help make the bathing process more enjoyable for him. Be careful not to get the shampoo in your pet's eyes."
    },
    {
      "title": "Rinse your pet completely.",
      "content": "Rinse your pet completely. Shampoo residue can make your pet feel itchy, so you want to make sure that you rinse out all of the shampoo before drying him. If you are bathing your dog, be mindful that your his hair is thicker than your own, so you will need to take extra time to work your fingers through his hair when rinsing out the shampoo. [32] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source You will know when you have rinsed out all of the shampoo when you no longer see any suds in the water that you are using to rinse him. Consider giving your pet a quick sniff after you have finished rinsing him to see if you can smell urine. If you still smell urine, consider shampooing and rinsing him again. If you placed a piece of steel wool in the bathtub drain, remove and discard the steel wool after you have finished rinsing him off."
    },
    {
      "title": "Dry your pet.",
      "content": "Dry your pet. If you are bathing your cat, wrap her snugly in a towel and dry her off in a warm, draft-free location in your home. [33] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source You may need more than one towel to dry off your dog, depending on his size. If you know that your dog is going to want to shake as soon as you finish rinsing him off, you can try gently holding his muzzle with your thumb and forefinger—a dog cannot shake his body if you hold his muzzle still. [34] X Research source You can let go of his muzzle once he is at least somewhat dry. If you are using a blow dryer to dry your pet, set it on one of the cooler settings to prevent thermal damage to his skin. [35] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Your dog may be tempted to bolt and rub on something (e.g., furniture, carpet, ground) as soon as you have finished drying him off. Consider keeping him in a relatively confined area, such as the kitchen, until he is completely dry. [36] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Give him plenty of praise.",
      "content": "Give him plenty of praise. Reward your pet with a generous amount of positive reinforcement. This can be a combination of treats, new toys, verbal praise, and extra playtime. [37] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Observe your pet's urinary habits.",
      "content": "Observe your pet's urinary habits. Your pet could smell of urine because of medical problems that make it difficult for him to control his urination, such as urinary incontinence or a recurrent urinary infection. [38] X Research source For example, your cat may continually urinate outside of litterbox because of a urinary infection that makes it unable for him to get to the litterbox in time. Your dog may not be able to hold his urine until you can take him outside for a walk, which may cause him to urinate inside the house."
    },
    {
      "title": "Take your pet to the veterinarian.",
      "content": "Take your pet to the veterinarian. If you clean your pet but notice that the smell of urine keeps coming back, and see a change in your pet's urinary habits, it is time to take your pet to your veterinarian for a thorough examination. Your veterinarian can perform various diagnostic tests, such as bloodwork and a urinalysis, to determine the cause of your pet smelling like urine. If your cat has arthritis, he may smell like urine because his arthritis prevents him from adequately grooming and cleaning himself. An obese cat would also be unable to groom and clean himself."
    },
    {
      "title": "Follow your veterinarian's treatment recommendations.",
      "content": "Follow your veterinarian's treatment recommendations. If your veterinarian has diagnosed your pet with a urinary tract infection, he or she will likely recommend an antibiotic to clear the infection. [39] X Research source If your cat is arthritic, your veterinarian will probably recommend an anti-inflammatory medication to help ease the joint pain. More complicated medical problems, such as kidney failure, may require more extensive treatment and dietary changes."
    }
  ]
}