{
  "url": "https://www.wikihow.com/Share-a-WhatsApp-Contact",
  "title": "How to Share a WhatsApp Contact",
  "steps": [
    {
      "title": "Open the WhatsApp app.",
      "content": "Open the WhatsApp app. It is green with a white phone icon inside."
    },
    {
      "title": "Tap on Chats.",
      "content": "Tap on Chats . This is located at the bottom of your screen, and the icon looks like two speech bubbles."
    },
    {
      "title": "Open a chat.",
      "content": "Open a chat. This should be the person with whom you want to share the contact. Simply scroll through your list of chats and tap on their name. [1] X Research source"
    },
    {
      "title": "Tap +.",
      "content": "Tap + . This is located in the bottom left of your screen."
    },
    {
      "title": "Tap Contact.",
      "content": "Tap Contact . This will appear at the bottom of your screen. [2] X Research source"
    },
    {
      "title": "Tap on the contact that you want to share.",
      "content": "Tap on the contact that you want to share. Now simply scroll through your contacts list , or search for their name in the top search bar, and tap on their name."
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . This is located in the top right corner."
    },
    {
      "title": "Tap on any contact info you don’t want to share (optional).",
      "content": "Tap on any contact info you don’t want to share (optional). If there are multiple pieces of information, such as an email and phone number, you have the option to select which you send. Simply tap on one of the options to unselect it."
    },
    {
      "title": "Tap Send.",
      "content": "Tap Send . This is located in the top right corner. You have now successfully sent a WhatsApp contact to someone. [3] X Research source"
    },
    {
      "title": "Open the WhatsApp app.",
      "content": "Open the WhatsApp app. It is green with a white phone icon inside."
    },
    {
      "title": "Tap on Chats.",
      "content": "Tap on Chats . This is located near the top left of your screen."
    },
    {
      "title": "Open a chat.",
      "content": "Open a chat. This should be the person with whom you want to share the contact. Simply scroll through your list of chats and tap on their name. [4] X Research source"
    },
    {
      "title": "Tap on the attachment icon.",
      "content": "Tap on the attachment icon. This looks like a paperclip and it is located in the bottom right corner. [5] X Research source"
    },
    {
      "title": "Tap on Contact.",
      "content": "Tap on Contact . This is a blue circle icon and it is located in the bottom right corner."
    },
    {
      "title": "Tap on the contact that you want to share.",
      "content": "Tap on the contact that you want to share. Now simply scroll through your contacts list, or search for their name in the top search bar, and tap on their name."
    },
    {
      "title": "Tap on the send arrow.",
      "content": "Tap on the send arrow. This is a green circle with an arrow inside, and it is located in the bottom right corner. [6] X Research source"
    },
    {
      "title": "Tap on any contact info you don’t want to share (optional).",
      "content": "Tap on any contact info you don’t want to share (optional). If there are multiple pieces of information, such as an email and phone number, you have the option to select which you send. Simply tap on one of the options to unselect it."
    },
    {
      "title": "Tap on the send arrow.",
      "content": "Tap on the send arrow. This is a green circle with an arrow inside, and it is located in the bottom right corner. You have now successfully sent a WhatsApp contact to someone."
    },
    {
      "title": "Open the WhatsApp app.",
      "content": "Open the WhatsApp app. It is green with a white phone icon inside."
    },
    {
      "title": "Go to Settings.",
      "content": "Go to Settings. On an iPhone, tap on the gear icon in the bottom right corner. On an Android, tap on the three dots in the top left corner and then tap Settings . [7] X Research source"
    },
    {
      "title": "Tap on the QR code icon.",
      "content": "Tap on the QR code icon. This is located directly next to your name. [8] X Research source"
    },
    {
      "title": "Tap Share.",
      "content": "Tap Share . This is located in the top right corner. On Android, this button appears as an icon that looks like a sideways “v”. [9] X Research source"
    },
    {
      "title": "Select a person or app to share your QR code to.",
      "content": "Select a person or app to share your QR code to. Just tap on any of the available apps or contacts on your phone in order to share your WhatsApp contact. [10] X Research source"
    }
  ]
}