{
  "url": "https://www.wikihow.com/Play-Strip-Poker",
  "title": "How to Play Strip Poker",
  "steps": [
    {
      "title": "Gather a mixed group of adventurous friends.",
      "content": "Gather a mixed group of adventurous friends. Make sure they are all consenting adults who actually want to play the game, rather than suggesting it once people have already gathered. Bringing it up spontaneously can leave some people feeling uncomfortable if they don't want to partake. If your group is already flirty or comfortable with each other, consider just arranging a night of strip poker. Otherwise you may want to get your friends together and let the game happen organically. Have fun. If it looks like someone isnt having fun. Make sure their comfortable or ask if their even interested in playing"
    },
    {
      "title": "Suggest a game of strip poker and make sure everyone agrees.",
      "content": "Suggest a game of strip poker and make sure everyone agrees. Don't pressure or force anyone to participate who doesn't want to. If someone does feel too shy, however, you don't necessarily have to kick them out if they are interested in staying to watch. They might change their minds after watching a few hands."
    },
    {
      "title": "Agree on the rules.",
      "content": "Agree on the rules. Decide which of the versions strip-poker below you want to play, what different items of clothing are worth, and so on. [1] X Research source Consider deciding how far the game will go and when it will end. Some people might be happy to play until they are completely nude, but others might only feel comfortable stripping until they are in their underwear. Agree on the limits, as well as if and how players will stay in the game once they have run out of clothes to shed."
    },
    {
      "title": "Make sure everyone starts with roughly the same amount of clothing.",
      "content": "Make sure everyone starts with roughly the same amount of clothing. If some of the girls are in dresses while the guys have socks, ties and belts, have players discard or add accessories until everyone is even. This is optional, but makes the game more fair."
    },
    {
      "title": "Pick a kind of poker.",
      "content": "Pick a kind of poker. Poker is a popular game using a standard deck of playing cards in which players are dealt cards and wager on the strength of their hands. Make sure your friends know how to play and know how to rank the traditional poker hands: from high card through pairs, straights, flushes, a full-house, four-of-a-kind, straight flush and so on. There are several popular poker variations, but not all of them are great fits for strip poker. Here are the two traditional options: Play five-card draw . Probably the easiest version for a casual game of strip poker. Each player is dealt five cards and gets to exchange one or more of those cards for an equal number off the top of the deck. They bet or fold before and after the exchange and the remaining player with the highest hand wins. Play Texas Hold'em . Each player is dealt two face-down cards and looks to combine them with a pool of five gradually revealed community cards. There are several rounds of betting, and the remaining player who can make the best five-card hand wins."
    },
    {
      "title": "Deal cards",
      "content": "Deal cards and play hands as you would in poker. Unlike in normal poker, where you play to win chips or money, the nominal objective in strip poker is to keep your clothes on while the losing players remove their clothing one piece at a time."
    },
    {
      "title": "If you lose a hand, strip.",
      "content": "If you lose a hand, strip. The game isn't fun if you can't enjoy losing as well as winning, so have fun with it! Maybe do a flirty dance when it comes time to remove a significant piece of clothing. [2] X Research source"
    },
    {
      "title": "Keep playing until someone—or perhaps everyone but the winner—is down to their undergarments or, if you prefer, completely naked.",
      "content": "Keep playing until someone—or perhaps everyone but the winner—is down to their undergarments or, if you prefer, completely naked. This is the traditional end of the game. Once a winner is declared, let everyone have their clothes back—or keep playing in the nude for new stakes! You can combine your game of strip poker with truth-or-dare. Let players who lose all their clothes keep playing with different penalties if they lose, such as having to answer a truth or do a dare. Just keep your dares within a realm everyone is comfortable with."
    },
    {
      "title": "Strip every time you lose a hand.",
      "content": "Strip every time you lose a hand. This is the simplest—and fastest—way to play. Simply deal out cards and play out a hand of poker with no betting. At the end the player with the highest hand wins and everyone else is required to remove a piece of clothing. [3] X Research source Alternatively, have only the player with the lowest hand in each showdown strip. This is a slower version of the game, for a more extended evening of fun. If you want, you can let players fold early in the hand—such as before the flop in Texas Hold'em—to avoid having to strip. However this obviously gives shy players the option to hardly participate at all, which can defeat the fun of the game."
    },
    {
      "title": "Let the winner choose who strips.",
      "content": "Let the winner choose who strips. This version is a great way to reveal hidden crushes and flirtations within a group. Play out a hand as normal, and at the end the person with the highest hand gets to choose one person in the group to lose and article of clothing. With this variation especially, make sure no one in your game is likely to get jealous or territorial. In a group of friends it can be fun to find out who wants who to show a little more skin, but not if the answer is going to make anyone upset. Don't pick on any one person. Conspiring just to strip down one player completely, especially in a larger group, is less fun, and can feel uncomfortable and predatory to that person."
    },
    {
      "title": "Bet clothes instead of chips.",
      "content": "Bet clothes instead of chips. Deal out hands and let players bet an item or items of clothing instead of chips, which must be matched by the same or equivalent item by anyone who wants to call. Players without good enough hands can fold. After the showdown, the players who stayed in and lost remove the clothes they wagered. [4] X Research source"
    },
    {
      "title": "Exchange clothes for chips.",
      "content": "Exchange clothes for chips. Play a normal game of poker with chips or cash bets, but allow players who run low to trade in items of clothing to the bank or another player for a loan of chips. This is the version of the game that most resembles actual poker, with betting, bluffing and strategy. Different items of clothing can either all have the same value, or can increase in value the closer they put a player to being naked. For instance if socks are worth $10, a shirt might be worth $30, and an undergarment could be worth $60. If a player trades in some clothing and later wins a large pot, you should decide whether he or she is allowed to buy back some of their clothes. Letting them buy back some modesty adds a further layer of strategy to the game, while having players stay stripped keeps the game moving."
    },
    {
      "title": "Play heads-up with your lover.",
      "content": "Play heads-up with your lover. Strip poker is classically a group activity, but you can adapt it into a fun game of foreplay with your significant other or potential paramour. With only two players there isn't much point in betting or strategy, so simply deal out hands and reveal them. The player with the lower hand loses a piece of clothing."
    },
    {
      "title": "Don't be rude or judgmental about other players' bodies.",
      "content": "Don't be rude or judgmental about other players' bodies. Not everyone who plays strip poker should have to be a supermodel. Just be kind and recognize that the other players are putting themselves out there and shouldn't be judged or insulted for the way they look."
    },
    {
      "title": "Don't assume going in that strip poker will turn sexual—or won't.",
      "content": "Don't assume going in that strip poker will turn sexual—or won't. Some games among adults can turn into something more, but most just involve just a little loss of modesty. If a sexual situation does arise, make sure everyone is happy with that, or keep the game platonic."
    },
    {
      "title": "Stop the game if someone gets upset.",
      "content": "Stop the game if someone gets upset. Make sure everyone is playing because they are having fun, and don't force anyone to stay who doesn't want to. If something happens to ruin the good vibe, cut your losses and let everyone go home."
    },
    {
      "title": "Don't get jealous or territorial.",
      "content": "Don't get jealous or territorial. If you are at a game of strip poker with your romantic partner or a friend you may be attracted to, watching other people see that person naked can spark some unhappy feelings. Keep these instincts in check—getting petty or angry is the fastest way to ruin the game for everyone."
    },
    {
      "title": "Don't sexualize or objectify other players.",
      "content": "Don't sexualize or objectify other players. A little flirtation is expected, but coming on too strong will be a big turn-off to everyone."
    },
    {
      "title": "Play your best poker!",
      "content": "Play your best poker!"
    }
  ]
}