{
  "url": "https://www.wikihow.com/Raise-Cyanuric-Acid-Levels-in-a-Pool",
  "title": "How to Raise Cyanuric Acid Levels in a Pool",
  "steps": [
    {
      "title": "Plan on testing the water at least once a week.",
      "content": "Plan on testing the water at least once a week. Since the cyanuric acid needs to be balanced with the other chemicals in your pool, it's important to check this balance every week. For example, you might find that while cyanuric acid levels are fine, your chlorine level is off. [2] X Research source"
    },
    {
      "title": "Retest the water after it's been diluted.",
      "content": "Retest the water after it's been diluted. If your outdoor pool doesn't have a cover and there's a lot of rainfall, the cyanuric acid may become diluted and ineffective. Remember to check the cyanuric acid levels if the pool's water becomes diluted. [3] X Research source You can test the cyanuric acid levels as often as you like. If you believe the balance of your pool is off, test the cyanuric acid levels again even if it hasn't been a week since the last test."
    },
    {
      "title": "Use test strips.",
      "content": "Use test strips . Buy strips that are chemically formulated to detect cyanuric acid. Keep in mind that many basic kits only test for chlorine and pH levels so you may need to buy a more advanced kit. [4] X Research source To use a strip, dip it in the water for about 30 seconds and compare the color on the strip to the color on the chart that came with the strips. This will tell you the cyanuric acid level in the water. Purchase test strips online or from your local pool supply store."
    },
    {
      "title": "Consider using a liquid turbidity test kit.",
      "content": "Consider using a liquid turbidity test kit. Some kits will come with a small container for gathering a water sample. Add the powdered solution and swirl the container so the water dissolves the solution. Wait 1 to 3 minutes and fill a sample cell with some untested pool water. Once the time is up, fill another sample cell with some of the tested pool water. You'll now be able to compare the results to an untested sample. Use the chart that came with the test kit to determine the cyanuric acid level in your pool. If you don't want to test the water yourself, fill a container with water and take it to your local pool supply store where they can test it for you. You'll need to gather about 2 tablespoons (30 ml)."
    },
    {
      "title": "Determine if you need to add cyanuric acid to your pool.",
      "content": "Determine if you need to add cyanuric acid to your pool. The cyanuric acid in your pool should be between 30 and 50 ppm, although some find it more effective closer to 80 ppm. [5] X Research source Keep in mind that the higher your cyanuric acid levels, the weaker your chlorine becomes. The World Health Organization recommends that cyanuric acid levels don't exceed 100 ppm."
    },
    {
      "title": "Purchase cyanuric acid.",
      "content": "Purchase cyanuric acid. Buy powdered or liquid cyanuric acid from your local pool supply store. Keep in mind that if you buy it online, you may have to buy it in bulk."
    },
    {
      "title": "Make adjustments to the chlorine, alkalinity, and pH, if necessary.",
      "content": "Make adjustments to the chlorine, alkalinity, and pH, if necessary. If you need to adjust other chemicals in your pool water, start by adjusting the free available chlorine. Then add chemicals to adjust the total alkalinity and make corrections to pH before you add the cyanuric acid. Wait 3 hours and test the cyanuric acid level again."
    },
    {
      "title": "Calculate how much cyanuric acid to add.",
      "content": "Calculate how much cyanuric acid to add. Follow the cyanuric acid manufacturer's instructions to determine how many pounds of cyanuric acid you need to add. You'll need to know how many gallons of water your pool holds as well as how many parts per million (ppm) of cyanuric acid you need to add. For example, if you need an extra 10 ppm of cyanuric acid in your 10,000 gallon (37850 l) pool, you'll need around 1 pound (1.86 kg) of acid."
    },
    {
      "title": "Dissolve powdered cyanuric acid in warm water.",
      "content": "Dissolve powdered cyanuric acid in warm water. If you're using powdered cyanuric acid, fill a 5-gallon (18.9 l) bucket half full with warm water. Pour in the cyanuric acid and let it rest for at least 10 minutes so it dissolves. You can add it to the pool once the acid is dissolved. [6] X Research source Remember to put on protective goggles and wear gloves when handling the cyanuric acid."
    },
    {
      "title": "Pour the liquid or powdered cyanuric acid into the pool.",
      "content": "Pour the liquid or powdered cyanuric acid into the pool. Add the dissolved cyanuric acid or liquid cyanuric acid directly into the pool instead of into the filter tanks or skimmers. Once you've added the cyanuric acid, check the water's pH level and adjust it as necessary. Wait until no one is using the pool before you add the cyanuric acid. You can swim after 2 to 4 hours or once the pool has run a complete filter cycle."
    },
    {
      "title": "Use stabilized chlorine for a minor cyanuric acid increase.",
      "content": "Use stabilized chlorine for a minor cyanuric acid increase. If your cyanuric acid level doesn't need a substantial increase (less than 10 ppm), buy stabilized chlorine. These tablets or sticks are chlorine combined with cyanuric acid. Follow the manufacturer's instructions to determine how many tablets or sticks to add directly to the pool. Stabilized chlorine is great for maintaining cyanuric acid levels in your pool because it doesn't dramatically change the acid level. If you’re unsure if the chlorine you’re using contains Cyanuric acid check the package. If the label mentions Trichlor or Dichlor it will add Cyanuric acid to your water. [7] X Research source Remember to check chlorine levels a few days after adding the stabilized chlorine."
    },
    {
      "title": "Run the pool pump for several hours.",
      "content": "Run the pool pump for several hours. Keep the pool pump running for at least 2 to 4 hours after you've added the cyanuric acid. The pump will agitate the water so the cyanuric acid is distributed throughout the pool. [8] X Research source"
    }
  ]
}