{
  "url": "https://www.wikihow.com/Poop-More",
  "title": "How to Poop More",
  "steps": [
    {
      "title": "Holding in a bowel movement worsens constipation.",
      "content": "Holding in a bowel movement worsens constipation. Whenever you feel like you need to make a bowel movement, go to the bathroom as soon as you can. Avoid straining or trying to push while you’re on the toilet since it could increase your risk of hemorrhoids or anal fissures. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Avoid using your phone or reading while you’re on the toilet. Only stay in the bathroom as long as you need to."
    },
    {
      "title": "The correct posture prevents you from straining while you go.",
      "content": "The correct posture prevents you from straining while you go. When you sit on the toilet, keep your back straight, lean forward, and rest your elbows on your knees. If you can, put your feet on a stool so your knees are higher than your hips. Bulge your stomach to make it easier for you to go. Avoid hovering or squatting over the toilet seat since it puts more pressure on your pelvic floor muscles."
    },
    {
      "title": "Eating stimulates your bowels naturally and gives you the urge to go.",
      "content": "Eating stimulates your bowels naturally and gives you the urge to go. Aim to have 3–4 small meals spread evenly throughout your day. Try to eat around the same time every day so your body gets used to the routine. Make enough time so you have a few minutes free after eating just in case you feel the urge to go to the bathroom. [2] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source"
    },
    {
      "title": "High-fiber foods bulk up your waste and move it out of your bowels.",
      "content": "High-fiber foods bulk up your waste and move it out of your bowels. Some foods that are high in fiber include whole-grain bread and pasta, beans, apples, ripe bananas, broccoli, carrots, and almonds. [3] X Expert Source Dale Prokupek, MD Board Certified Internist & Gastroenterologist Expert Interview. 16 April 2020. Start incorporating some of these foods into each of your meals so you can get enough fiber throughout the entire day. [4] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source For example, a medium apple with skin has about 3.7 grams of fiber, ½ cup (75 g) of green beans has 2 g, a slice of whole-wheat bread has 2 g, and 1 cup (200 g) of whole-wheat spaghetti has 6.3 g. [5] X Trustworthy Source Michigan Medicine The University of Michigan's medical center, which provides patient care, supports research, and educates the public on health topics Go to source Increase the amount of fiber in your diet gradually since having too much causes bloating and gas. [6] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you don’t get enough fiber from your diet, you can also take fiber supplements. Just talk to your doctor before starting them since they can affect how you absorb other medications. [7] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Sugary and fatty foods make you constipated since they don’t have much fiber.",
      "content": "Sugary and fatty foods make you constipated since they don’t have much fiber. Do your best to cut frozen meals, snack foods, and fast food out of your diet. Find healthy replacements, such as fresh fruits and vegetables and homemade meals, so you keep getting healthy amounts of fiber through your diet. [8] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Check the nutritional information on your food to see how much fiber it contains before eating it."
    },
    {
      "title": "Fluids make your stools softer and easier to pass.",
      "content": "Fluids make your stools softer and easier to pass. Aim to have at least 15.5 cups (3.7 L) of water every day if you’re a man or 11.5 cups (2.7 L) if you’re a woman. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source As a good rule of thumb, just drink something whenever you’re feeling thirsty. You can also incorporate fruit juices, clear soups, and broth to help the fiber from your diet work better. [10] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Water also prevents dehydration, which might lead to constipation as well."
    },
    {
      "title": "Working out pushes waste through your intestines faster.",
      "content": "Working out pushes waste through your intestines faster. If you sit down a lot during the day, try to get up and spend a little bit of time being physically active. [11] X Expert Source Dale Prokupek, MD Board Certified Internist & Gastroenterologist Expert Interview. 16 April 2020. You can try lifting weights, going for long walks, playing intramural sports, or anything else that gets you up on your feet. Aim to get at least 150 minutes of physical activity during the week to keep your body healthy and your bowel movements regular. [12] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Talk to your doctor to see if you’re healthy enough to start a workout program. They’ll recommend exercises for you based on your current physical condition."
    },
    {
      "title": "Anxiety and stress can lead to constipation and make it harder to go.",
      "content": "Anxiety and stress can lead to constipation and make it harder to go. It’s completely normal to get stressed every now and then, but too much upsets your stomach and digestion. Look for techniques that help you calm back down. [13] X Research source You can try meditation , yoga , deep breathing, or visualization of your happy place. Incorporate some stress management into your regular routine so you never feel too overwhelmed. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For example, you could try box breathing, where you inhale for 4 counts, hold your breath for 4 counts, and exhale slowly for 4 counts. Keep repeating this until you feel calm."
    },
    {
      "title": "Only try laxatives if nothing else works.",
      "content": "Only try laxatives if nothing else works. Laxatives stimulate your bowels so it’s easier to go, but they do have their drawbacks. Since they can be habit-forming and disrupt your normal digestion, only use them if you haven’t been successful with any other methods we’ve recommended. If you do take laxatives, follow all the dosage instructions on the packaging so you don’t overuse them. [15] X Research source You can take laxatives by mouth if they’re oral pills, but you must insert saline enemas and some suppositories into your rectum."
    },
    {
      "title": "Some opioid painkillers and antidepressants cause constipation.",
      "content": "Some opioid painkillers and antidepressants cause constipation. If you’re currently on prescription medication, ask your doctor if constipation is a common side effect. Let them know what you’re experiencing and ask if there’s anything you can do about it. They may recommend switching medications or could prescribe a low-dose laxative to counteract your symptoms. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}