{
  "url": "https://www.wikihow.com/Pop-Culture-of-the-90%27s",
  "title": "The Most Iconic Pop Culture Moments & Trends of the 1990s",
  "steps": [
    {
      "title": "The 1990s were chock-full of exciting pop culture moments and trends.",
      "content": "The 1990s were chock-full of exciting pop culture moments and trends. The period is usually remembered as a time of relative prosperity and optimism, and the rise of the internet increased communication and access to information. [1] X Research source It’s no wonder the decade is remembered so fondly! Here's an overview: The 90s ushered in a new era of celebrity, with actors like Cameron Diaz, Leonardo DiCaprio, Angela Bassett, Gwyneth Paltrow, and Brad Pitt shooting to superstardom. [2] X Research source Supermodels like Cindy Crawford, Naomi Campbell, Linda Evangelista, and Christy Turlington also exploded in popularity. The public was captivated by Princess Diana, who wore her iconic “revenge dress” in June of 1994 following her split from Prince Charles. [3] X Research source Harry Potter and the Sorcerer’s Stone was published in June of 1997, kicking off one of the most notable fantasy series of all time."
    },
    {
      "title": "The 90s had a wide range of iconic fashion trends.",
      "content": "The 90s had a wide range of iconic fashion trends. The decade saw the rise of the grunge aesthetic , which included graphic tees, plaid flannels, distressed jeans and tights, and Dr. Marten’s. On the other end of the spectrum, the 1995 movie Clueless inspired a bright, colorful style filled with matching mini skirt and blazer sets, mini dresses, baby tees, headbands, and Mary Jane heels. [4] X Research source Sought-after clothing brands in the 90s included Calvin Klein, Tommy Hilfiger, Donna Karan, and Ralph Lauren. Stores like Gap and Limited Too were also popular. [5] X Research source Hair trends of the 90s included crimped waves, baby braids, butterfly clips, barrettes, and scrunchies. And of course, there was “The Rachel,” a layered haircut inspired by Jennifer Aniston’s character from Friends . [6] X Research source"
    },
    {
      "title": "The 90s were a great decade for music.",
      "content": "The 90s were a great decade for music. From pop to rap to rock, the 1990s were filled with groundbreaking and genre-defining music that continues to captivate modern-day listeners. Here are some of the most memorable music moments from the 90s: Nirvana released their album Nevermind , which included the hit “Smells Like Teen Spirit.” [7] X Research source The Notorious B.I.G. and Tupac Shakur redefined hip-hop and rap, and the genre exploded in popularity. Girl groups like TLC, Destiny’s Child, and The Spice Girls rose to fame, releasing timeless hits like “No Scrubs,” “Say My Name,” and “Wannabee.” Boy bands like NSYNC and the Backstreet Boys enjoyed similar popularity with hits like “Bye Bye Bye” and “I Want It That Way.” Pop stars like Britney Spears, Mariah Carey, and Christina Aguilera dominated the charts. [8] X Research source"
    },
    {
      "title": "The 1990s were a golden age for movies.",
      "content": "The 1990s were a golden age for movies. Heartwarming family classics, rom-coms, blockbuster thrillers, dramas—the 90s had it all! It also included the Disney Renaissance, which saw the release of some of the studio’s most iconic animated films. [9] X Research source Here are some of the most impactful movies from the 90s: Major blockbusters : Titanic (1997), Jurassic Park (1993), Forrest Gump (1994) Family movies : Home Alone (1990), Matilda (1996), The Parent Trap (1998) Disney Renaissance : Beauty and the Beast (1991), Aladdin (1992), The Lion King (1994), The Hunchback of Notre Dame (1996), Hercules (1997), Mulan (1998) Teen movies : Clueless (1995), 10 Things I Hate About You (1999), The Craft (1996), She’s All That (1999) Romantic comedies : Pretty Woman (1990), Sleepless in Seattle (1993), You’ve Got Mail (1998) Action, thrillers, & dramas : Ghost (1990), Pulp Fiction (1994), The Shawshank Redemption (1994)"
    },
    {
      "title": "The 90s had some of the most beloved TV shows in history.",
      "content": "The 90s had some of the most beloved TV shows in history. It was an especially successful period for sitcoms, including iconic shows like Friends , The Fresh Prince of Bel-Air , Full House , and Seinfeld . [10] X Research source Other popular shows from the decade include Buffy the Vampire Slayer , The Simpsons , Boy Meets World , and Dawson’s Creek . [11] X Research source"
    },
    {
      "title": "Kids toys and video games ruled the market in the 90s.",
      "content": "Kids toys and video games ruled the market in the 90s. The craze for toys like Beanie Babies, Furbies, and Tamagotchis took the world by storm in the 1990s. [12] X Research source Video games like Super Mario Kart , Sonic the Hedgehog , and Pokémon Red/Blue were also all the rage. [13] X Research source The PlayStation was first unveiled in 1995, and other gaming platforms like the Game Boy and the Super Nintendo Gaming System were popular, as well."
    },
    {
      "title": "The 1990s were defined by the rise of the Internet.",
      "content": "The 1990s were defined by the rise of the Internet. [14] X Research source The first flip phone, the Motorola StarTAC, was released in 1996, and cell phones started to become commonplace. [15] X Research source Advancements in technology also marked this decade. Google was founded in September of 1998, which created unprecedented access to information. [16] X Research source Advancements like these heralded the beginning of the Digital Age, which we’re still navigating today. [17] X Research source"
    },
    {
      "title": "There were many news-worthy moments in sports during this decade.",
      "content": "There were many news-worthy moments in sports during this decade. The United States won the first Women’s World Cup of soccer in 1991 and golfer Tiger Woods won the Masters Tournament in 1997. [18] X Research source The decade also saw the beginning of Serena Williams’ tennis career, as well as the infamous figure skating scandal between Tonya Harding and Nancy Kerrigan at the 1994 Olympics. [19] X Research source In 1994, a strike of baseball players led to the World Series being canceled for the first time in 90 years. Basketball legend Michael Jordan announced his retirement in January of 1999. [20] X Research source"
    },
    {
      "title": "The 90s contained significant historical moments that changed the world.",
      "content": "The 90s contained significant historical moments that changed the world. Here are some of the biggest headlines from the decade: In 1990, the Hubble Space Telescope was launched into orbit around Earth. The U.S.S.R. dissolved in December of 1991, becoming 15 independent countries. Bill Clinton became president of the United States in 1993. In 1998, he became the second U.S. president to be impeached. Nelson Mandela became the first Black president of South Africa in May of 1994. In June of 1995, The U.S. Space Shuttle Atlantis docked with the Russian space station. This signaled a new era of collaboration in space exploration. O.J. Simpson was found not guilty of murdering his ex-wife, Nicole Brown Simpson, and her friend Ronald Goldman in a hugely publicized trial in 1995. Princess Diana tragically passed away in a car accident in 1997, and her death was mourned worldwide. [21] X Research source"
    }
  ]
}