{
  "url": "https://www.wikihow.com/Run-Your-Desktop-off-DC-Power",
  "title": "How to Run Your Desktop off DC Power",
  "steps": [
    {
      "title": "Buy an inverter.",
      "content": "Buy an inverter. In order to convert a battery's DC current into a current which your desktop computer's power supply can recognize, you'll need to buy a 12 volt DC to AC inverter. Make sure the inverter you buy converts according to your region's voltage limits. North American power supplies typically use 110v or 120v outputs, while other parts of the world often use 220v, 230v, or 240v. [1] X Research source Your inverter should have at least two power outputs (electrical sockets). This will allow you to plug in both your desktop unit and your monitor if necessary."
    },
    {
      "title": "Purchase a 12 volt battery.",
      "content": "Purchase a 12 volt battery. All batteries output DC power, so just make sure the battery you purchase is a 12 volt model in order to ensure its compatibility with your inverter. [2] X Research source"
    },
    {
      "title": "Unplug your desktop computer.",
      "content": "Unplug your desktop computer. If your desktop is plugged into an AC outlet (e.g., an electrical outlet), you'll need to unplug it before proceeding."
    },
    {
      "title": "Attach your battery to your inverter.",
      "content": "Attach your battery to your inverter. In most cases, you'll use each of the inverter's colored wires to connect to each of the same-colored clips on the battery. 12 volt batteries can seriously harm you or any connected electronics if connected improperly. For this reason, you should check both the battery's documentation and the inverter's manual to ensure that you know how to connect them properly."
    },
    {
      "title": "Turn on the inverter.",
      "content": "Turn on the inverter. Press the inverter's Power button to turn it on. You should do this before connecting your computer to the inverter, as failing to do so may result in damage to your computer."
    },
    {
      "title": "Plug your computer into the inverter.",
      "content": "Plug your computer into the inverter. The inverter's power output sockets are usually opposite the side to which you connected the 12 volt battery."
    },
    {
      "title": "Attach any other components to the inverter.",
      "content": "Attach any other components to the inverter. If you can't or don't want to run your desktop monitor off of AC power, you'll need to connect the monitor's power cable to the inverter as well. The same goes for speakers and any other powered components you want to use with your computer."
    },
    {
      "title": "Turn on your desktop.",
      "content": "Turn on your desktop. From this point, you should be able to run your computer using your inverter and the connected battery. Keep in mind that you will need to minimize your computer's intensive operations (e.g., video editing, gaming, and so on) if you want to maximize your battery use."
    },
    {
      "title": "Understand the limitations.",
      "content": "Understand the limitations. DC/DC power supplies are significantly smaller than their traditional counterparts, making them insufficient for high-performance computers or sustained high-processing usage. DC/DC power supplies are also fairly uncommon, meaning you may have to wait for several weeks before one can be shipped to you if you order online."
    },
    {
      "title": "Make sure your motherboard has a 20- or 24-pin ATX connector.",
      "content": "Make sure your motherboard has a 20- or 24-pin ATX connector. This is crucial if you want to plug a DC-to-DC power supply into your motherboard. The easiest way to figure out your motherboard's connector is by finding your motherboard's product information and then looking up the motherboard model along with \"atx\". The ATX connector is the rectangular input with large holes in it. If your motherboard doesn't have a 20- or 24-pin ATX connector, it won't be able to support a DC-to-DC power supply. Try using an inverter instead."
    },
    {
      "title": "Purchase a DC/DC power supply.",
      "content": "Purchase a DC/DC power supply. DC-to-DC power supplies are most easily found online, but you may be able to find a DC to DC power supply unit in a tech store such as Best Buy. Some places from which you can buy DC-to-DC power supplies include http://www.mini-box.com/ and https://www.digikey.com/ ."
    },
    {
      "title": "Buy a power supply-to-battery adapter if necessary.",
      "content": "Buy a power supply-to-battery adapter if necessary. Most DC-to-DC power supplies will use a coaxial cable to connect to your 12 volt battery, meaning you'll need an adapter which has two wires to connect to the battery on one end and a coaxial output on the other end. This isn't necessary for all power supplies. Check your power supply's power input before buying an adapter."
    },
    {
      "title": "Buy a 12 volt battery.",
      "content": "Buy a 12 volt battery. Since DC to DC power supplies run on 12 volts, you'll need a 12 volt battery. Make sure the battery's wattage and other specifications match your power supply's specifications."
    },
    {
      "title": "Unplug your desktop computer.",
      "content": "Unplug your desktop computer. If your desktop is plugged into an AC outlet, unplug it before proceeding to minimize the risk of electric shock or damage to the internal components."
    },
    {
      "title": "Ground yourself",
      "content": "Ground yourself . Doing so will prevent you from accidentally harming your computer's motherboard by transmitting static electricity."
    },
    {
      "title": "Open the desktop.",
      "content": "Open the desktop. In most cases, you'll want to lay the desktop unit on its side before removing the side panel. You may need a screwdriver for this step."
    },
    {
      "title": "Locate the motherboard.",
      "content": "Locate the motherboard. The motherboard is a circuit board which you'll usually find near the bottom of the desktop unit."
    },
    {
      "title": "Unplug the current power supply.",
      "content": "Unplug the current power supply. The current power supply will typically be located near the top of the desktop unit with several wires connecting it to different components on the motherboard. You'll need to unplug each of these wires. Your power supply will also be attached to your hard drive, so unplug it there as well."
    },
    {
      "title": "Plug your DC-to-DC power supply into the motherboard.",
      "content": "Plug your DC-to-DC power supply into the motherboard. The power supply's main plug will fit into the 20- or 24-pin slot on your motherboard. [3] X Research source If your power supply only has 20 pins, leave the left-most 4 pins on your motherboard empty."
    },
    {
      "title": "Attach the DC-to-DC power supply to your computer's connectors.",
      "content": "Attach the DC-to-DC power supply to your computer's connectors. Using the power supply's cables, attach it to the necessary inputs on the motherboard and the hard drive. At minimum, you'll want to connect the power supply to your hard drive, your computer's processor, and the graphics card(s) if necessary."
    },
    {
      "title": "Plug your power supply into the battery.",
      "content": "Plug your power supply into the battery. In most cases, this will entail connecting the coax-to-battery adapter's red and black wires to the same-colored outputs on the battery and then screwing the coaxial cable from the power supply into the coaxial output on the adapter. If your power supply uses a different means of connection, consult the battery's documentation and the power supply's manual for more specific instructions."
    },
    {
      "title": "Reassemble your desktop, then turn it on.",
      "content": "Reassemble your desktop, then turn it on. From this point, you should be able to run your computer using the DC-to-DC power supply and the connected battery. Keep in mind that you will need to minimize your computer's intensive operations (e.g., video editing, gaming, and so on) if you want to maximize your battery use."
    }
  ]
}