{
  "url": "https://www.wikihow.com/Open-a-Lock",
  "title": "How to Open a Lock",
  "steps": [
    {
      "title": "Recognize combination locks.",
      "content": "Recognize combination locks. Combination locks require that you input in a series of numbers in the correct order to open the lock. They usually feature dials with numbers from 0-60 or 100, and you need to spin the dial to get the lock to open."
    },
    {
      "title": "Find the combination.",
      "content": "Find the combination. Usually, the combination is on a sticker or engraved in the back of the lock. If you cannot find the combination, you will not be able to open the lock unless you can figure out the numbers or break the lock. As an example, this tutorial will solve for the combination 5 - 45 - 20"
    },
    {
      "title": "Turn the dial clockwise 3 times.",
      "content": "Turn the dial clockwise 3 times. This \"resets\" the dial, allowing you to input your combination. [1] X Research source"
    },
    {
      "title": "Turn the dial clockwise to your first number.",
      "content": "Turn the dial clockwise to your first number. Line up the first number in your combination with the small arrow on the top of the lock. In this case, stop on 5. [2] X Research source"
    },
    {
      "title": "Turn the dial counter-clockwise back to your first number.",
      "content": "Turn the dial counter-clockwise back to your first number. Turn the dial one full rotation, returning to your first number. Make sure your turn -counter-clockwise. You will pass your second number while spinning, but this is intentional. For this example, you would return back to 5."
    },
    {
      "title": "Keep turning counter-clockwise to your second number.",
      "content": "Keep turning counter-clockwise to your second number. After making the first full rotation, keep turning the same direction until you reach your second number. Here you would turn all the way to 45."
    },
    {
      "title": "Turn the dial clockwise to the final number.",
      "content": "Turn the dial clockwise to the final number. After landing on your second number, simply turn the dial to your last number, here 20. This completes your combination."
    },
    {
      "title": "Pull up on the U-shaped lock to open it.",
      "content": "Pull up on the U-shaped lock to open it. Once you've successfully input your combination the lock should easily come off. To review: Spin the dial 3 times clockwise, landing on your first number. Spin the dial counterclockwise 1 full rotation before landing on your second number. Spin the dial clockwise to your final number. Open the lock."
    },
    {
      "title": "Open multiple-dial locks by turning each dial individually.",
      "content": "Open multiple-dial locks by turning each dial individually. Some combination locks feature multiple dials with the numbers 0-9. To open one, simply turn each dial to create the correct combination. For example, if the combination is 1492, turn the first dial to 1, the second to 4, the third to 9, and the last to 2. The first number is almost always on the dial closest to the lock."
    },
    {
      "title": "Know that you can cut down the number of tries needed to guess a combination lock.",
      "content": "Know that you can cut down the number of tries needed to guess a combination lock. A classic MasterLock has 64,000 possible combinations, but with a few simple tricks and a web-based algorithm you can crack the code in fewer than 8 guesses. [3] X Research source"
    },
    {
      "title": "Set the dial to 0.",
      "content": "Set the dial to 0. Start with the triangle pointing down to 0 on the dial. It does not matter which way you turn to get there. [4] X Research source"
    },
    {
      "title": "Put pressure on the lock as if you were trying to open it.",
      "content": "Put pressure on the lock as if you were trying to open it. Pull on the U-lock as if you had put in the right combination and wanted to open the lock."
    },
    {
      "title": "Turn the dial clockwise until it \"sticks.\"",
      "content": "Turn the dial clockwise until it \"sticks.\" As you turn the dial, you'll reach a point where the dial gets stuck. It will only move between two close points, either between two numbers (like 10 and 11) or between two half numbers (like 2.5 and 3.5). Write down the number in between the grooves as your first sticking point. For example, if you are stuck between 2.5 and 3.5, right down 3 as your first sticking point. If this number is a half number, like 1.5 (sticking point is between 1 and 2), ignore it. Release the lock to turn the dial and repeat this step until you find the next sticking point. This number will be under 11."
    },
    {
      "title": "Keep turning with the lock pulled tight to find the second sticking point.",
      "content": "Keep turning with the lock pulled tight to find the second sticking point. Repeat the previous step, holding the lock as if you were opening it and turning the dial until it sticks. Record the number in between the sticking points -- if you are stuck between 4.5 and 5.5, your second sticking point is 5. Like before, ignore half-sticking points (2.5, 9.5) and continue until you have a whole number. This number will also be below 11."
    },
    {
      "title": "Loosen your pressure on the lock.",
      "content": "Loosen your pressure on the lock. Put about half as much pressure as before on the top of the lock as before. You are completely trying to pry it open, but you are putting some pressure on it as if you were opening the U on top of the lock."
    },
    {
      "title": "Turn the dial counter-clockwise until you feel resistance.",
      "content": "Turn the dial counter-clockwise until you feel resistance. You will be able to turn past this number, but you'll feel the dial slow down as it passes this point. Record this number as the resistance point. You can turn the dial past this resistance point multiple times, all counter-clockwise, to make sure you feel resistance in the same place each time. [5] X Research source"
    },
    {
      "title": "Input your first and second sticking point and resistance point into an online calculator.",
      "content": "Input your first and second sticking point and resistance point into an online calculator. While you can do some basic math to figure out the exact location by hand, online hackers have posted a free algorithm to determine the 8 potential combinations for your lock online. This calculator will give you two potential sticking points to test out."
    },
    {
      "title": "Try out a \"third digit\" provided by the computer.",
      "content": "Try out a \"third digit\" provided by the computer. The online algorithm will provide the first digit for you and offer two potential third digits at the bottom. Turn to the first one to test it out. If one of the third digits is \"15,\" go to 15 on the dial."
    },
    {
      "title": "Pull hard on the lock as if you were opening it.",
      "content": "Pull hard on the lock as if you were opening it. With the dial on the potential digit, pull hard on the lock. Note how much resistance the lock gives."
    },
    {
      "title": "Turn to the other possible third digit and pull on the lock.",
      "content": "Turn to the other possible third digit and pull on the lock. Do the same thing with the second potential digit. Compare this with the resistance from the first number -- one of them should be much easier to pull on then the other."
    },
    {
      "title": "Choose the third digit that offered the least resistance.",
      "content": "Choose the third digit that offered the least resistance. You can check them multiple times, but one number will provide noticeably less resistance when you pull on the lock. Click on this digit in the algorithm online. You should see the box labeled \"second digit\" fill up with 8 possible numbers."
    },
    {
      "title": "Try out all 8 potential combinations.",
      "content": "Try out all 8 potential combinations. Now that you have your 8 possible combinations, the only thing to do is try them all out. The first and last number will all be the same, but try out every one of the possible middle digits to get the lock open. [6] X Research source"
    },
    {
      "title": "Insert the key and turn it.",
      "content": "Insert the key and turn it. Most locks turn clockwise to open, but try turning counter-clockwise if this doesn't work. As long as you have the correct key you will hear a faint \"click\" and the door will open. If the door does not open, you likely have the wrong key."
    },
    {
      "title": "Try picking the lock if you do not have a key.",
      "content": "Try picking the lock if you do not have a key. Lock picking works on any traditional pin lock. f you can use a key to open the lock, you can pick it."
    },
    {
      "title": "Pick up a basic lock picking set.",
      "content": "Pick up a basic lock picking set. You will need two tools -- a torque wrench and a pick. In a pinch, resourceful locksmiths have used bobby pins, paper clips, and butter knives as well. However, the easiest way to pick a lock is with a professional kit, which can be found cheaply online. [7] X Research source Try using a flathead screwdriver, butter knife, or small Allen key if you do not have a torque wrench. Anything small enough to fit in the keyhole but sturdy enough not to break. Try using a bobby pin or paperclip if you cannot get a pick. Simply straighten them and use pliers to angle the last half a centimeter up 90 degrees."
    },
    {
      "title": "Look into the lock.",
      "content": "Look into the lock. You should see several \"pins,\" which are small metal cylinders that keep the lock in place. The grooves on a key are made to push all of these pins up into the right place, allowing you to turn the key. When you pick a lock, however, you use your pick to manually push each pin out of the way."
    },
    {
      "title": "Insert the torque wrench into the bottom of the lock.",
      "content": "Insert the torque wrench into the bottom of the lock. You want to wedge it lightly into the bottom of the lock so it is only a few centimeters deep."
    },
    {
      "title": "Turn the torque wrench like you were opening the lock.",
      "content": "Turn the torque wrench like you were opening the lock. Act as if you were using a key, using light pressure to turn the lock. It will not go very far, but keep this pressure on the lock as you work."
    },
    {
      "title": "Insert your pick and feel the pins.",
      "content": "Insert your pick and feel the pins. Using your pin, feel each of the pins in the lock. You should be able to move them up individually, [8] X Research source"
    },
    {
      "title": "Push up on one of the pins with your pick, maintaining pressure with the torque wrench.",
      "content": "Push up on one of the pins with your pick, maintaining pressure with the torque wrench. You easily push the pins up with your pick. To make them stay, however, you need to use your torque wrench to keep turning the lock so it doesn't slide back into place."
    },
    {
      "title": "Vary the pressure with your torque wrench if the pins don't move.",
      "content": "Vary the pressure with your torque wrench if the pins don't move. When you push each pin up, the subtle turning of the torque wrench prevents them from sliding back into place. If the pins don't stay up when you push them, add more pressure the torque wrench. If they are too difficult to push up, apply less pressure. This is the \"art\" of lock picking, and takes some practice. Each lock is a little different, and you'll need to feel out how much pressure is correct as you work."
    },
    {
      "title": "Repeat this step with every pin.",
      "content": "Repeat this step with every pin. Keep up your pressure with torque wrench as you push up each pin. [9] X Research source"
    },
    {
      "title": "Once you've gotten every pin up, turn the torque wrench.",
      "content": "Once you've gotten every pin up, turn the torque wrench. The pins are what keep the lock from moving, but with every pin out of the way you'll be able to turn the lock freely."
    },
    {
      "title": "Call a locksmith if you still can't get into your door.",
      "content": "Call a locksmith if you still can't get into your door. Locksmiths are professionals who can open almost any door. Make sure, however, that you can prove that the lock they are breaking belongs to you, or they may not provide service."
    },
    {
      "title": "Know that you can manually open some car doors.",
      "content": "Know that you can manually open some car doors. The following techniques only work on older cars that don't use electronic locking. If your car doors have small knobs or rods that move up and down when you lock the car you should be able to get the door open without a key."
    },
    {
      "title": "Pry open the door with a screwdriver and push the unlock button.",
      "content": "Pry open the door with a screwdriver and push the unlock button. Known as the \"screw and rod\" technique, this can damage your car if you are not careful. Since the locking mechanism is usually on the middle of the door, you can pry open the top part of the door with a screwdriver and use a long rod to push the unlock button. Pry open the top of the door with a flathead screwdriver. Take a metal rod or yardstick and stick it into the space you between the car and the door. Use the rod to press the \"unlock\" button on your door. This technique often works for newer cars as well."
    },
    {
      "title": "Use a clothes-hanger to open your door manually.",
      "content": "Use a clothes-hanger to open your door manually. Pull apart the clothes hanger so that you have a long wire with the hook at the end. You can use this hook to manually pull up the lock on your car door. Stick the hook end of the hanger between weather-stripping and the bottom of the window, lining the end of the hook up with the knob of the lock. Stick the hook down and feel around for the lock -- it will feel like a vertical rod sticking up from the keyhole to the lock inside the car. Get your hook under this rod and pull up to release the lock. This may take some time, especially if you are inexperienced, but it will work in a pinch. \"Slim-Jims\" are professional hooks made for this purpose. They are the long, slender tools seen in carjackers on movies and TV."
    },
    {
      "title": "Unlock your car with your shoelace.",
      "content": "Unlock your car with your shoelace. This strategy only works on cars that have a visible knob that unlocks the door. Still, it is quick, easy, and efficient. To open your car with a shoelace: Create a slipknot in the middle of your lace. Get the lace inside the car by threading it between the door and the car frame. Think of \"flossing\" the space between your door and the car. Hook the loop in the middle of your lace around the locking mechanism. Tighten the lace around the lock by pulling on both ends. Pull the lock upwards to unlock your car."
    },
    {
      "title": "Call AAA if you cannot get into your car.",
      "content": "Call AAA if you cannot get into your car. If you have an AAA membership you may be entitled to a free or discounted visit from a locksmith. Be sure to call and ask about the price and how soon someone can come help you."
    }
  ]
}