{
  "url": "https://www.wikihow.com/Share-a-Printer",
  "title": "How to Share a Printer",
  "steps": [
    {
      "title": "Install the printer drivers.",
      "content": "Install the printer drivers . [1] X Expert Source Luigi Oppido Computer & Tech Specialist Expert Interview. 31 July 2019. In order to share a printer, it must be installed on the computer it is connected to. Most modern printers connect via USB and will install automatically when they are connected."
    },
    {
      "title": "Open the Control Panel.",
      "content": "Open the Control Panel. You can access the Control Panel in Windows 7 by clicking the Start menu and selecting Control Panel. In Windows 8, press ⊞ Win + X and select Control Panel from the menu."
    },
    {
      "title": "Open the Network and Sharing Center.",
      "content": "Open the Network and Sharing Center. If your Control Panel is in Category view, click \"Network and Internet\", and then select \"Network and Sharing Center\".Click on \"Network and Internet\". If your Control Panel is in Icon view, click the \"Network and Sharing Center\" icon."
    },
    {
      "title": "Click the \"Change advanced sharing settings\" link.",
      "content": "Click the \"Change advanced sharing settings\" link. This is located in the left navigation pane of the Network and Sharing Center."
    },
    {
      "title": "Expand the profile you need to change.",
      "content": "Expand the profile you need to change. You will see three different options when you open the \"Advanced share settings\": Private, Guest or Public, and All Networks. If you are on a Home network, expand the Private section. [2] X Research source"
    },
    {
      "title": "Enable \"File and printer sharing\".",
      "content": "Enable \"File and printer sharing\". Toggle this on to allow other devices to connect to your printer. This will also allow you to share files and folders with other computers on the network."
    },
    {
      "title": "Toggle the password protection.",
      "content": "Toggle the password protection. You can decide whether or not you want to enable password protection for your printer. If it is turned on, only users who have a user account on your computer will be able to access the printer. You can toggle password protection in the \"All Networks\" section."
    },
    {
      "title": "Share the printer.",
      "content": "Share the printer. Now that file and printer sharing has been turned on, you will need to share the printer itself. To do this, go back to the Control Panel and open the Devices and Printers option. Right-click on the printer you want to share and click \"Printer properties\". Click the Sharing tab, and then check the \"Share this printer\" box. [3] X Research source"
    },
    {
      "title": "Install the printer drivers.",
      "content": "Install the printer drivers. [4] X Expert Source Luigi Oppido Computer & Tech Specialist Expert Interview. 31 July 2019. In order to share a printer, it must be installed on the computer it is connected to. Most modern printers connect via USB and will install automatically when they are connected."
    },
    {
      "title": "Open the Control Panel.",
      "content": "Open the Control Panel. You can access the Control Panel in Windows Vista by clicking the Start menu and selecting Control Panel. [5] X Research source"
    },
    {
      "title": "Open the Network and Sharing Center.",
      "content": "Open the Network and Sharing Center. If your Control Panel is in Category view, click \"Network and Internet\", and then select \"Network and Sharing Center\".Click on \"Network and Internet\". If your Control Panel is in Icon view, click the \"Network and Sharing Center\" icon."
    },
    {
      "title": "Enable printer sharing.",
      "content": "Enable printer sharing. Expand the \"Printer Sharing\" field and toggle printer sharing on. You can decide whether or not you want to enable password protection for your printer. If it is turned on, only users who have a user account on your computer will be able to access the printer."
    },
    {
      "title": "Share the printer.",
      "content": "Share the printer. Now that file and printer sharing has been turned on, you will need to share the printer itself. To do this, go back to the Control Panel and open the Devices and Printers option. Right-click on the printer you want to share and click \"Printer properties\". Click the Sharing tab, and then check the \"Share this printer\" box. [6] X Research source"
    },
    {
      "title": "Install the printer drivers.",
      "content": "Install the printer drivers. [7] X Expert Source Luigi Oppido Computer & Tech Specialist Expert Interview. 31 July 2019. In order to share a printer, it must be installed on the computer it is connected to. Not all printers will install automatically on XP, and you may need to manually install the software that came with the printer."
    },
    {
      "title": "Turn on printer sharing.",
      "content": "Turn on printer sharing. Before you can share your printer, you need to make sure that printer sharing is enabled. To do so, click the Start menu and select \"My Network Places\". Right-click on your active network connection and select Properties. Click the General tab, and then check the \"File and Printer Sharing for Microsoft Networks\" box. You may be asked to reboot the computer once you are done."
    },
    {
      "title": "Share your printer.",
      "content": "Share your printer. Open the Control Panel from the Start menu and select \"Printers and Faxes\". Right-click on the printer that you want to share and click \"Sharing\". Click the \"Share this printer\" option, and give the printer a name so that it can be identified on the network. [8] X Research source"
    },
    {
      "title": "Install the printer drivers.",
      "content": "Install the printer drivers. [9] X Expert Source Luigi Oppido Computer & Tech Specialist Expert Interview. 31 July 2019. In order to share a printer, it must be installed on the computer it is connected to. Most printers will install automatically when connected to a Mac computer, but you may need to manually install the software for older printers."
    },
    {
      "title": "Turn on printer sharing.",
      "content": "Turn on printer sharing. Open \"System Preferences\". This can be accessed by clicking the Apple menu in the upper-left corner of the menu bar. Look for the \"Internet & Network\" or \"Internet & Wireless\" section, and click the Sharing option. Check the \"Printer Sharing\" box in the left frame of the Sharing window. [10] X Research source If your printer has a scanner too, check the \"Scanner Sharing\" box as well."
    },
    {
      "title": "Share a printer.",
      "content": "Share a printer. Once sharing is turned on, enable sharing for your printer by opening the \"Print & Scan\" section of the System Preferences menu. Select the printer you want to share from the list on the left side. If you don't see the printer you want to share, then it may not be installed properly. With the printer selected, click the \"Share this printer on the network\" option. [11] X Research source If it has a scanner, click the \"Share this scanner on the network\" option as well."
    },
    {
      "title": "Add a network printer in Windows Vista, 7, and 8.",
      "content": "Add a network printer in Windows Vista, 7, and 8. Open the Control Panel and select \"Devices and Printers\". Click the \"Add a printer\" button at the top of the window. [12] X Research source Wait for the scan to complete, and the printer should appear in the list of available printers. Select it and click Next to add it to your computer. If the printer you are looking for cannot be found, click \"The printer that I want isn't listed\". You can then manually connect to the printer by entering the printer's network name."
    },
    {
      "title": "Add a network printer in Windows XP.",
      "content": "Add a network printer in Windows XP. Open the Control Panel and select Printers and Faxes. Look for the \"Printer Tasks\" section and click the \"Add a printer\" option. This will open the \"Add Printer Wizard\". Select the \"A network printer, or a printer attached to another computer\". The quickest way to connect to a network printer is to enter in the network address for it. This means you will need to know the computer name and the printer name. Enter in the address using the following syntax: \\\\ computername \\ printername . You can also browse for available printers, though this method is not as reliable as simply entering the name of the printer."
    },
    {
      "title": "Add a network printer in Mac OS X.",
      "content": "Add a network printer in Mac OS X. Open \"System Preferences\" by clicking the Apple menu and selecting it. Click on the \"Print & Scan\" icon, and then click on the \"+\" button at the bottom of the list of currently-installed printers. The window that comes up will automatically detect any printers shared on the network. Select the one you want to add it to your list of printers. [13] X Research source"
    }
  ]
}