{
  "url": "https://www.wikihow.com/Prevent-and-Treat-Dandruff",
  "title": "How to Prevent and Treat Dandruff",
  "steps": [
    {
      "title": "Shampoo with it daily for 2-4 weeks as your first treatment option.",
      "content": "Shampoo with it daily for 2-4 weeks as your first treatment option. Pythrione zinc is the key dandruff-fighting ingredient in Head & Shoulders dandruff shampoo, as well as a wide range of store-brand competitors to it. This ingredient kills the malassezia fungi that commonly cause dandruff. Use it daily as directed for at least 2 weeks, then evaluate whether your dandruff situation has improved. If it has improved, keep using the shampoo either daily or at least every 2-3 days. If it hasn’t improved, move on to other shampoo options. [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Follow the product instructions for using the shampoo. Generally speaking, you’ll want to keep the shampoo in your hair for around 5 minutes before rinsing it out. Other name brands that use pyrithione zinc include Jason Dandruff Relief 2-in-1 and SHS Zinc."
    },
    {
      "title": "Use them one at a time until you find the most effective ingredient.",
      "content": "Use them one at a time until you find the most effective ingredient. Pyrithione zinc isn’t the only dandruff-fighting shampoo option out there, and an alternative key ingredient may work better in your case. Try one of the alternatives for 2-4 weeks, evaluate your results, and move on as needed. Be sure to use each shampoo as directed—some can be used every day, while others may recommend less frequent use. Major anti-dandruff ingredients to look for include: [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Salicylic acid and sulfur , found in brands like Neutrogena T/Sal and Sebulex. These ingredients soften dead skin cells on your scalp so that they wash away in the shower. Use a conditioner after shampooing to reduce scalp dryness. Selenium sulfide 1% to 2.5% , found in brands like Exsel, Selsun Blue, and Reme-T. This ingredient slows down skin cell production and kills dandruff-causing fungi, but may discolor blonde or chemically-treated hair. Ketoconazole 1% , found in brands like Nizoral A-D. This ingredient is particularly helpful in treating and parenting dandruff that is caused by fungi. Coal tar , found in brands like Neutrogena T/Gel, Tarsum, and Tegrin. This ingredient slows down the production of the dead skin cells that end up as dandruff. Coal tar can cause discoloration of lighter-colored hair."
    },
    {
      "title": "Corticosteroids or antifungals may reduce your dandruff production.",
      "content": "Corticosteroids or antifungals may reduce your dandruff production. Once you’ve found the anti-dandruff shampoo that does the best job in your case, consider adding a medicated topical cream to your regimen if you still have some dandruff issues. Try, for instance, hydrocortisone 0.5% or 1%, which are OTC corticosteroid creams. Apply the product 1-2 times daily until your condition improves, then as needed. Alternatively, try terbinafine 1%, an OTC antifungal, applying it 1-2 times daily until your condition improves. [3] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source As with shampoos, try these products one at a time for about 2-4 weeks, then move on if you don’t see positive results. The best time to apply one of these creams to your scalp is when your hair is slightly damp after washing it with an anti-dandruff shampoo. But they can also be applied to your scalp when your hair is dry."
    },
    {
      "title": "They’ll diagnose your specific condition and direct you to stronger treatments.",
      "content": "They’ll diagnose your specific condition and direct you to stronger treatments. If you’ve tried several OTC anti-dandruff shampoos and creams without any luck, don’t give up on getting rid of your flakes! Depending on the type and cause of your dandruff, your doctor may prescribe medicated shampoos or creams that are stronger and more effective than OTC options. They can also identify and treat underlying conditions that may be contributing to your dandruff. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If your dandruff worsens while you try OTC options, if your scalp is really itchy all the time, or if you notice redness or swelling in the area, contact your doctor sooner rather than later. Conditions like seborrheic dermatitis, contact dermatitis, eczema, psoriasis, ringworm, and “cradle cap” (in infants) can cause dandruff. But most of the time it just happens!"
    },
    {
      "title": "Applying warm oils can add moisture and loosen dandruff.",
      "content": "Applying warm oils can add moisture and loosen dandruff. Before bedtime, warm a small bowl of mineral oil, olive oil, coconut oil, almond oil, or another natural oil, then massage it into your scalp with your fingers. Put on a shower cap or wrap your hair in a towel overnight. Rinse out the oil in the shower the next morning by washing with a dandruff shampoo. [5] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Alternatively, try shampooing with dish detergent to remove the oil!"
    },
    {
      "title": "Massage it into your scalp to possibly kill dandruff-causing fungi.",
      "content": "Massage it into your scalp to possibly kill dandruff-causing fungi. Reputable studies have demonstrated the anti-fungal properties of apple cider vinegar, [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source tea tree oil, [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source and aloe vera. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You won’t, however, find reputable studies that definitively prove any of them effectively treat dandruff. Here’s what to do if you choose to give one of them a try: Mix equal parts of apple cider vinegar and plain water in a bowl, massage the mixture into your scalp, and wash it out after a few minutes. Dilute a few drops of tea tree oil in a natural carrier oil, such as coconut oil, massage it into your scalp, and wash it out after several minutes. Work a glob of aloe vera gel into your hair and scalp and leave it for up to several hours or overnight. As an added bonus, aloe works as a natural hair gel!"
    },
    {
      "title": "Apply it to your damp hair before shampooing.",
      "content": "Apply it to your damp hair before shampooing. Baking soda helps scrub away flaky skin and is another natural anti-fungal that might kill off dandruff-causing fungi. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Here again, there are no definitive studies that show it to be a proven dandruff treatment, but you may want to give the following procedure a try: With your hair wet in the bath or shower, take a small handful of baking soda and massage it into your scalp—don’t scrub so hard that it hurts. Leave the baking soda in place for 1-2 minutes, rinse it away, and wash your hair with shampoo as normal. [10] X Research source"
    },
    {
      "title": "This is essentially a DIY dandruff shampoo that may help out.",
      "content": "This is essentially a DIY dandruff shampoo that may help out. Salicylic acid is a common ingredient in dandruff shampoos because it’s an anti-inflammatory that helps scaly, flaky skin to release from your scalp. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Aspirin contains salicylates as well, so it’s possible—but not proven by medical research—that adding crushed aspirin to regular shampoo might help fight dandruff. To give this unproven but potential treatment a try, do the following: Crush 2 aspirin tablets into a fine powder. Mix them into your regular shampoo (not dandruff shampoo) and lather the mixture into your hair as normal. Leave the shampoo in your hair for at least 1-2 minutes, rinse it out, and shampoo again without the crushed aspirin. [12] X Research source"
    },
    {
      "title": "Some people say less frequent washing helps, but the opposite is true.",
      "content": "Some people say less frequent washing helps, but the opposite is true. Letting your hair and scalp get oily due to infrequent washing doesn’t prevent dandruff—instead, it traps the flakes in the oil so that they hang around in your hair even longer! Try washing your hair with shampoo at least 3 times per week, if not every day, in order to rinse away the flakes that naturally and inevitably form on your scalp. Frequent washing with regular shampoo should help with minor dandruff. Move up to using a dandruff shampoo if you have more extensive dandruff."
    },
    {
      "title": "When you do use them, wash them out as soon as is practical.",
      "content": "When you do use them, wash them out as soon as is practical. Styling products like hair spray, hair gel, mousse, and hair wax can lead to a build-up of oil on your hair and scalp, which helps produce dandruff and trap it in your hair. Aim to cut down on your use of styling products, especially if you already have an oily scalp or are starting to develop dandruff. [13] X Research source Don’t leave styling products in your hair overnight! Shampoo them out before going to bed or, even better, once you get home at the end of your day."
    },
    {
      "title": "Exposure to sunlight may reduce dandruff-causing fungi on your scalp.",
      "content": "Exposure to sunlight may reduce dandruff-causing fungi on your scalp. Take your hat off for a bit on a sunny day, but also remember to practice sun safety. For most people, 10-15 minutes of “sunny scalp time” is fine, but aim for less time if you have very pale skin or a bit more time if you have darker skin. In any case, don’t expose your scalp long enough to risk a sunburn! Apply a broad-spectrum sunscreen to your face and areas of exposed skin before spending time in the sun."
    },
    {
      "title": "These nutrients, along with healthy fats, may help prevent dandruff.",
      "content": "These nutrients, along with healthy fats, may help prevent dandruff. It’s hard to pinpoint specific evidence here, but it’s possible that a diet that’s higher in zinc, B vitamins, and healthy fats may help reduce dandruff-causing fungi. Aim to eat a healthy diet overall and look for opportunities to boost your intake of these particular nutrients. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Zinc-rich foods include beef, poultry, shellfish, fortified cereals, oatmeal, and beans. Pork, salmon, chicken, eggs, yogurt, avocados, sunflower seeds, chickpeas, and fortified cereals are good sources of B vitamins. Good sources of healthy fats include olive oil, nuts and seeds, avocados, fatty fish, soybeans, and tofu."
    },
    {
      "title": "Having dandruff can be stressful, but stress can cause more dandruff!",
      "content": "Having dandruff can be stressful, but stress can cause more dandruff! Instead of letting dandruff add to your stress, focus on reducing any stress or anxiety you are dealing with at home, school, or work. Try techniques like meditation, yoga, deep breathing, light exercise, exploring nature, listening to soothing music, talking with an old friend, or whatever other healthy stress-busters work best for you. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source When you start feeling stressed out about your dandruff, remind yourself that it’s extremely common, not dangerous to your health, and something that you can successfully treat!"
    }
  ]
}