{
  "url": "https://www.wikihow.com/Remove-Apps-from-a-Mac-Desktop",
  "title": "How to Remove Applications from Your Mac Desktop",
  "steps": [
    {
      "title": "Open the Finder app and go to Applications.",
      "content": "Open the Finder app and go to Applications . This folder holds all of the apps installed on your Mac. [1] X Research source Some apps are installed by Apple and cannot be deleted by users. Apps like System Preferences, Messages, Photos, Notes, Pages, and Calendar are preinstalled and cannot be removed from your Mac."
    },
    {
      "title": "Select the app you wish to remove in Finder by clicking it once.",
      "content": "Select the app you wish to remove in Finder by clicking it once. Click on an app in Finder just once to select but not open the app. Double-clicking on the app you wish to remove will open the app. If you accidentally open an app, you do not need to close it to delete the app. Navigate back to Finder and be sure the app is still selected. You can tell an app is selected if its name is highlighted in Finder."
    },
    {
      "title": "Once an app has been selected, delete it by selecting File > Move to trash.",
      "content": "Once an app has been selected, delete it by selecting File > Move to trash . In the top right corner of your Mac screen, find the File tab. Click File and locate the option to Move to trash near the bottom of the pop-up menu. By choosing Move to trash, the selected app will be deleted from Finder and moved to your Mac trash. You can also delete an app by hold-clicking on it in Finder, and then dragging it with your mouse to the trashcan icon in the dock. Deleted apps still in the Trash will continue to take up storage space on your Mac. Empty your trash by clicking the trashcan icon on the app dock and selecting the Empty option in the top right corner of the window. [2] X Research source"
    },
    {
      "title": "Recover an app by opening the Trash and dragging it back into Applications.",
      "content": "Recover an app by opening the Trash and dragging it back into Applications . If you accidentally deleted the wrong app, open the Trash by clicking on the trashcan icon located in your dock. Find the app you want to recover and hold-click on the app while dragging it with your mouse back into the Applications tab to the left of the files in the trash."
    },
    {
      "title": "Click the apple logo at the top left corner of your screen.",
      "content": "Click the apple logo at the top left corner of your screen. This action will open the Apple menu. If you want to check which apps are taking up the most storage space on your Mac, you can see that information in this menu."
    },
    {
      "title": "Open About This Mac and navigate to Storage.",
      "content": "Open About This Mac and navigate to Storage . In this window, you will be able to see the breakdown of used and unused storage space on your Mac represented in a graph. Hover over the different colored blocks in this graph to see what category of content is taking up what amount of storage space. These categories include Photos, Apps, Messages, and the Operating System."
    },
    {
      "title": "Press Manage and then move to Applications.",
      "content": "Press Manage and then move to Applications . Clicking Manage will pull up a new window in which you can manage your Mac storage. In this pop-up window, select the Applications tab to see a full breakdown of the storage each app is taking up on your Mac."
    },
    {
      "title": "Delete an app in this window with the Delete... button.",
      "content": "Delete an app in this window with the Delete... button. Select an app you wish to remove from your Mac by clicking on it once. Once selected, you can delete this app by clicking the Delete... button at the bottom right corner of this window. After pressing Delete... , you will be asked to confirm your decision to delete an app in a pop-up message. In this message you can also see the amount of storage that will be freed up on your Mac by deleting this app."
    },
    {
      "title": "Locate the app dock on your Mac desktop.",
      "content": "Locate the app dock on your Mac desktop. The dock will appear as a bar at the bottom or side of your Mac home screen, your desktop. Icons of the apps you are using or have used recently will appear in the dock. The default position of the dock on Mac computers is at the bottom of the desktop screen. You can change the placement of the dock to be on the left or right side of your desktop by going to System Preferences > Dock & Menu bar > Position on screen . [3] X Research source"
    },
    {
      "title": "Hold-click on the app you want to remove from your desktop.",
      "content": "Hold-click on the app you want to remove from your desktop. Place your mouse on the app in your dock you want to close, click on the app and hold until a menu pops up. Hold-clicking on the app you wish to remove will pull up a menu of options about that app. If you are having trouble seeing apps in your dock, you can change the size of the app icons in System Preferences > Dock & Menu bar > Size . You can also change your settings so that hovering over an app in the dock will magnify its size for easier visibility. Turn on this feature in System Preferences > Dock & Menu bar > Magnification."
    },
    {
      "title": "In the pop-up menu, select Options > Remove from Dock.",
      "content": "In the pop-up menu, select Options > Remove from Dock . In the menu which pops up from the app you clicked on, hover your mouse to Options > Remove from Dock. This action will remove an app from your desktop dock. If an app is still open, you will first have to select Quit from the pop-up menu before you can remove it from your desktop. Sometimes, apps are \"open\" even if you cannot see it opened in your desktop. You can tell if an app is open by checking if there is a black dot underneath the app icon (if the dock is on the bottom of your screen), or next to the app icon (if your dock is on the side of your screen)."
    }
  ]
}