{
  "url": "https://www.wikihow.com/Say-Happy-St.-Patrick%27s-Day-in-Gaelic",
  "title": "How to Say Happy St. Patrick’s Day in Gaelic (+ More Irish Phrases!)",
  "steps": [
    {
      "title": "Tell someone “Lá fhéile Pádraig sona dhuit!”",
      "content": "Tell someone “Lá fhéile Pádraig sona dhuit!” This is a very basic, straightforward way of wishing anyone you meet a happy St. Patrick's Day. [1] X Research source The expression means “Happy St. Patrick's Day to you!” Lá fhéile Pádraig means “St. Patrick's Day.\" Note that you could also shorten this to “Lá ‘le Pádraig” in this saying and any other. The meaning is the same, but native Irish speakers often use the latter as a way of shortening the term to something more natural and casual. Sona means “happy” in English. Dhuit means “to you,” when the “you” being referred to is singular. Pronounce the exclamation as lah leh PAH-drig SUN-uh gwitch ."
    },
    {
      "title": "Wish “Lá fhéile Pádraig sona dhaoibh!”",
      "content": "Wish “Lá fhéile Pádraig sona dhaoibh!” to a crowd. This sentiment adapts the basic way of wishing someone a happy St. Patrick's Day to a plural form. Use this version when you are talking to two or more people. [2] X Research source The expression means “Happy St. Patrick's Day to you!” Lá fhéile Pádraig means “St. Patrick's Day.\" Note that you could also shorten this to “Lá ‘le Pádraig” in this saying and any other. The meaning is the same, but native Irish speakers often use the latter as a way of shortening the term to something more natural and casual. Sona means “happy” in English. The use of dhaoibh also means “to you,” but this Irish term is used in instances in which “you” refers to multiple people being spoken to. Pronounce this Irish greeting as lah leh PAH-drig SUN-uh YEE-uv ."
    },
    {
      "title": "Exclaim “Beannachtaí na Féile Pádraig dhuit!”",
      "content": "Exclaim “Beannachtaí na Féile Pádraig dhuit!” to one person. This phrase is a slightly more traditional and more religious way to wish an individual person a happy St. Patrick's Day. [3] X Research source This expression means “St. Patrick’s Day blessings to you!” Fhéile Pádraig means “St. Patrick's Day.\" Note that you could also shorten this to “‘le Pádraig” in this saying and any other. The meaning is the same, but native Irish speakers often use the latter as a way of shortening the term to something more natural and casual. Beannachtaí na means “blessings.” Dhuit means “to you,” when the “you” being referred to is singular. This Irish sentiment should be pronounced as BAN-ukh-tee nuh FAY-leh PAH-drig gwitch ."
    },
    {
      "title": "Offer “Beannachtaí na Féile Pádraig oraibh!”",
      "content": "Offer “Beannachtaí na Féile Pádraig oraibh!” when speaking to multiple people. Use this version of the phrase for a more traditional and slightly more religious way to wish two or more people a happy St. Patrick's Day. [4] X Research source This expression means “St. Patrick’s Day blessings to you!” Fhéile Pádraig means “St. Patrick's Day.\" Note that you could also shorten this to “‘le Pádraig” in this saying and any other. The meaning is the same, but native Irish speakers often use the latter as a way of shortening the term to something more natural and casual. Beannachtaí na means “blessings.” The use of oraibh means “to you” when the “you” refers to multiple people. You should pronounce this statement as BAN-ukh-tee nuh FAY-leh PAH-drig ur-iv ."
    },
    {
      "title": "Toast \"Sláinte!\"",
      "content": "Toast \"Sláinte!\" In essence, this phrase has the same effect as toasting “cheers!” in English. [5] X Research source Translated more literally, this term means “health” in English. [6] X Research source Pronounce this term as slawn-cheh ."
    },
    {
      "title": "Offer \"Sláinte is táinte!\"",
      "content": "Offer \"Sláinte is táinte!\" in toast, instead. If you want to make a more emphatic toast, bump things up a notch by using this phrase. This toast, translated literally, means “health and wealth!” Sláinte means “health,” is means “and,” and táinte means “wealth.” You should pronounce this traditional Irish toast as slawn-cheh iss toin-cheh ."
    },
    {
      "title": "Exclaim \"Éire go Brách!\"",
      "content": "Exclaim \"Éire go Brách!\" Propose a toast using this phrase to show your Irish pride. [7] X Research source This translates into \"Ireland forever!\" Éire means “Ireland,” and go Brách translates into “forever.” Pronounce this expression as Ay-reh guh brawkh ."
    },
    {
      "title": "Ask someone, \"Cá mbeidh tú ag fliuchadh na seamróige?\"",
      "content": "Ask someone, \"Cá mbeidh tú ag fliuchadh na seamróige?\" If you plan to go out for drinks later in celebration and want to meet up with someone there, this phrase can be used to ask that person where you should meet. This phrase translates into, \"Where will you be wetting the shamrock?\" To \"wet the shamrock\" means to \"go for a drink.\" Cá means “where,” mbeidh means “will,” tú means “you,” ag means “be” or “by,” fliuchadh means “wetting,” na means “the,” and seamróige means “shamrock.” This phrase is pronounced as Caw meg too egg flyuh-ka nah sham-roh-ih-geh ."
    },
    {
      "title": "Proclaim, \"Tabhair póg dom, táim Éireannach!\"",
      "content": "Proclaim, \"Tabhair póg dom, táim Éireannach!\" If you're feeling especially festive on St. Patrick's Day, use this phrase and try your luck. Translated directly, the saying means, “Kiss me, I'm Irish!” Tabhair means “give,” póg means “kiss,” and dom means “me.” The term táim means “I” and Éireannach means “Irish.” This expression should be pronounced as Tower pogue dum, toim Aye-ron-okh ."
    },
    {
      "title": "In celebration, request, “Píonta Guinness, le do thoil.”",
      "content": "In celebration, request, “Píonta Guinness, le do thoil.” If you are out celebrating at a traditional Irish pub on St. Patrick's Day, use this phrase to order a popular Irish beverage. [8] X Research source This sentence means “A pint of Guinness, please.” Pionta refers to “pint” and Guinness refers to “Guinness.” The phrase “le do thoil” is an Irish way to say “please.” Pronounce this request as Pyun-tah Guinness, leh duh huh-il ."
    },
    {
      "title": "Ask for \"uisce beatha\" or \"beoir\" instead.",
      "content": "Ask for \"uisce beatha\" or \"beoir\" instead. When you want to order a drink in celebration of this festive event, these are a couple of other options for you to consider. The term uisce beatha means “whiskey.” The term beoir means “beer.” Pronounce \"uisce beatha\" as ish-keh byah-ha . Pronounce “beoir” as byoh-ir ."
    },
    {
      "title": "Talk about \"Seamróg.\"",
      "content": "Talk about \"Seamróg.\" These are well-known symbols of Ireland. [9] X Research source The word shamrock comes from the Irish word \"seamróg\" which means \"little clover\" or \"young clover\" in the Irish language. Pronounce this Irish word as sham-rogue ."
    },
    {
      "title": "Know about \"Ádh na nÉireannach.\"",
      "content": "Know about \"Ádh na nÉireannach.\" This phrase will likely come up a lot in St. Patrick's Day conversation amongst speakers of the Irish language. [10] X Research source When you use this phrase, you are talking about “the luck of the Irish.” Ádh na means “luck of,” and nÉireannach means “Irish.” This phrase should be pronounced as Awe nah Nay-ron-okh ."
    }
  ]
}