{
  "url": "https://www.wikihow.com/Ride-No-Handed-on-a-Bike",
  "title": "How to Ride No Handed on a Bike",
  "steps": [
    {
      "title": "Try riding one-handed with each hand.",
      "content": "Try riding one-handed with each hand. You may find that one hand is easier to ride with than the other. If you practice enough it will become easier."
    },
    {
      "title": "Once you get the hang of riding one handed, try taking your hands off of the handlebars for a few seconds at a time.",
      "content": "Once you get the hang of riding one handed, try taking your hands off of the handlebars for a few seconds at a time. Keep them close so you can grab the bars again and not fall if you get nervous. [1] X Research source"
    },
    {
      "title": "When you're ready to give it a try, find somewhere with lots of open space that slopes downhill slightly.",
      "content": "When you're ready to give it a try, find somewhere with lots of open space that slopes downhill slightly. This will let you coast downhill and maintain your speed without pedaling."
    },
    {
      "title": "Keep your center of gravity low.",
      "content": "Keep your center of gravity low. Focus your weight on the seat and pedals before taking your hands off the handlebars."
    },
    {
      "title": "Take your hands off of the handlebars, but only lift them about one inch above the handlebars at first because then you can easily regain control of the bike by grabbing the handlebars if necessary.",
      "content": "Take your hands off of the handlebars, but only lift them about one inch above the handlebars at first because then you can easily regain control of the bike by grabbing the handlebars if necessary. [2] X Research source"
    },
    {
      "title": "Practice going in straight lines, eventually you will become comfortable enough to try making turns by leaning.",
      "content": "Practice going in straight lines, eventually you will become comfortable enough to try making turns by leaning. [3] X Research source"
    },
    {
      "title": "To turn while riding no-handed, move your lower body in the direction you want to turn, but try to keep a grip on the bike with your knees and keep your upper body straight.",
      "content": "To turn while riding no-handed, move your lower body in the direction you want to turn, but try to keep a grip on the bike with your knees and keep your upper body straight. Pointing your knees in the direction you wish to turn helps. [4] X Research source"
    }
  ]
}