{
  "url": "https://www.wikihow.com/Set-up-an-AutoCAD-Drawing",
  "title": "How to Set up an AutoCAD Drawing",
  "steps": [
    {
      "title": "Open the AutoCAD program.",
      "content": "Open the AutoCAD program. The program is either shown as an icon on your desktop, or you may find it in the START menu on the bottom left corner of your computer screen."
    },
    {
      "title": "Go to modelspace.",
      "content": "Go to modelspace. There are two views in AutoCAD: modelspace and paperspace. Your drawing should always be made in modelspace, and dimensions that are added later should be represented in paperspace. To switch between modelspace and paperspace, view the tabs located at the bottom of the screen. One tab is labeled ‘modelspace’ and the other tabs are labeled either as ‘sheet’ or ‘layout’. The ‘sheet’ or ‘layout’ tabs indicate paperspace.If you are in modelspace, the background of the screen should appear black. If you are in paperspace, the background should appear white."
    },
    {
      "title": "Set your units.",
      "content": "Set your units. Engineers represent units in various ways: feet, meters, etc. To ensure accuracy and eliminate confusion, it is important that the drawing is set in the proper units. To set up your units, type ‘UN’ into your keyboard and then select the ‘ENTER’ key. A dialog box should pop-up on the screen allowing you to specify the unit type and precision for your units. The options for the unit types are: DECIMAL, SCIENTIFIC, ENGINEERING, ARCHITECTURAL, FRACTIONAL. The ‘precision’ section allows you to pick the number of decimal places for your dimensions. If you are doing a project for your teacher, she should have information regarding unit specifications."
    },
    {
      "title": "Select the toolbars that you will use throughout your drawing.",
      "content": "Select the toolbars that you will use throughout your drawing. To do this, hover your mouse over an empty space at the top of your screen near the toolbars. Then right-click and select AutoCAD. A long list should show up, displaying various toolbars containing different commands. The most popular toolbars that are used for AutoCAD 2D drawings are the DRAW, MODIFY, and OBJECT PROPERTIES toolbars. Select these toolbars and they should pop-up on your screen. Move them to the side to create space for your drawing. DRAW TOOLBAR: contains common drawing tools. MODIFY TOOLBAR: contains editing options. OBJECT PROPERTIES TOOLBAR: contains style and color options"
    },
    {
      "title": "Turn on OSNAP.",
      "content": "Turn on OSNAP. OSNAP, which refers to object snap, is an extremely useful property when creating a drawing. It allows you to see where the midpoint and endpoint of a line is located, where a tangent is on a circle, and other useful information. To turn on OSNAP, press the F3 button on your keyboard. To ensure your OSNAP settings are on, right-click on the icon reading ‘OSNAP’ located at the bottom left-hand corner of the screen. A dialog box should pop-up on the screen. Click the ‘SELECT ALL’ button, ensuring that all OSNAP properties are turned on."
    },
    {
      "title": "Import or go to the Autocad drawing that is not to scale.",
      "content": "Import or go to the Autocad drawing that is not to scale. It is okay if the Autocad drawing is not to scale, as long as you know at least one length. Type in \"UN\" followed by the space bar to change the units. Make sure the units are architectural and the precision is 1/6\"."
    },
    {
      "title": "Identify one line segment in the drawing that you know the length of.",
      "content": "Identify one line segment in the drawing that you know the length of. This can be a wall length or the length of a building. Larger lengths make more accurate scaling in Autocad. You do not want to scale the whole drawing by the width of a door or the length of a piece of furniture, for example."
    },
    {
      "title": "Measure the length of the line segment that you chose in Step 2.",
      "content": "Measure the length of the line segment that you chose in Step 2. Click on the line, type \"properties\" followed by the space bar in the command prompt. Scroll down the pop up window until you see the length of the line. Write this number down. You can also draw a new line in the drawing to scale from, if the line doesn't exist in the drawing, like the length of a building, for example."
    },
    {
      "title": "Divide the length the line should be by the length the line is in the drawing.",
      "content": "Divide the length the line should be by the length the line is in the drawing. (length full scale) / (length measured in drawing). You should get a decimal number. Write this number down."
    },
    {
      "title": "Type \"scale\" into the command prompt followed by the space bar.",
      "content": "Type \"scale\" into the command prompt followed by the space bar. Then select the entire AutoCad drawing and press the space bar. Then click any part of the drawing. You will see as you move your mouse, AutoCad is attempting to manually scale the drawing. Do not click a second time. Instead type in the command prompt the decimal number you got from Step 5. Then press the space bar. The drawing should be scaled accurately."
    },
    {
      "title": "Check the line that you measured in step 2 to make sure the scale is now accurate.",
      "content": "Check the line that you measured in step 2 to make sure the scale is now accurate. If it is close, but slightly off, you may have not included enough decimal places in your scale calculation. Simply repeat steps 3-6 for the new scaled drawing to get the scale even more precise. After a second run of the scale, the AutoCad drawing should be accurately scaled."
    },
    {
      "title": "Check the settings.",
      "content": "Check the settings. Before scaling, you should make sure that all layers are set to ON and UNLOCKED. Note: Pretty much the same procedure can be used when rotating an object by an undefined angle."
    },
    {
      "title": "Use the following:",
      "content": "Use the following: Command: Line --> Draw a line of a length that you want to use (for example, you have an object in your drawing, and you want it to be 100 units long, so draw a 100 units long line). This is going to be your reference length. Command: Scale --> select entire drawing, except your reference line, press space."
    },
    {
      "title": "Select the base point.",
      "content": "Select the base point. Type \"re\" (as reference), press space. Pick first point and endpoint of the object from your drawing, that you want it to be 100 units long. Type \"po\" (as points), press space."
    },
    {
      "title": "Pick first point and endpoint of your referenced line that you drew.",
      "content": "Pick first point and endpoint of your referenced line that you drew."
    },
    {
      "title": "Done.",
      "content": "Done. Instead of you having to calculate and writing down decimals, now AutoCAD will do it instead, and the result will be most accurately scaled drawing."
    }
  ]
}