{
  "url": "https://www.wikihow.com/Remove-Mildew-Smell-from-Clothing",
  "title": "How to Remove Mildew Smell from Clothing",
  "steps": [
    {
      "title": "Replace your laundry detergent with 1 cup (240 mL) of vinegar.",
      "content": "Replace your laundry detergent with 1 cup (240 mL) of vinegar. Plain white vinegar is a safe and natural method to remove bad odors from your laundry, including the smell of mildew. In addition to killing the bacteria that cause odor, vinegar strips away most of the product buildup that could be trapping odor in your clothes. If you like, you can use half the detergent you normally use in combination with the vinegar, as long as the detergent is not made from a natural soap. [1] X Research source Vinegar breaks down the fats in natural soaps, such as castile soap, rendering both ineffective if the two are combined. [2] X Research source"
    },
    {
      "title": "Wash your clothes with 1⁄2 cup (120 mL) of baking soda if they still smell bad.",
      "content": "Wash your clothes with 1 ⁄ 2 cup (120 mL) of baking soda if they still smell bad. Vinegar and baking soda both kill mold and mildew, but they attack different strains of these odor-causing bacteria. If you’ve already tried vinegar and your clothes still smell moldy, add 1 ⁄ 2 cup (120 mL) of baking soda into the wash, and run the cycle with the hottest water possible. [3] X Research source It may help to add a little vinegar into the rinse cycle after washing with baking soda."
    },
    {
      "title": "Use oxygen bleach",
      "content": "Use oxygen bleach or borax if you prefer a commercial detergent. Regular detergent may not be able to kill mildew, so if you prefer to use a stronger, store-bought detergent, opt for one containing oxygen bleach, or dissolve borax in hot water and add it to the wash. [4] X Research source You can use oxygen bleach in place of your regular detergent, but borax is usually used in addition to detergent."
    },
    {
      "title": "Use an enzyme odor remover for mildew caused by sweat.",
      "content": "Use an enzyme odor remover for mildew caused by sweat. If you accidentally leave your damp workout clothes in your gym bag, the combination of mildew and body odor makes it especially difficult to get the smell out of the fabrics. Choose a product that has enzymes for destroying odor, then add it to your wash. [5] X Research source Some commercial laundry detergents contain odor-fighting enzymes, or you can purchase a bottle of laundry booster that you use in addition to your regular detergent."
    },
    {
      "title": "Dry your clothes outside",
      "content": "Dry your clothes outside if you have the option. After you machine wash your clothes, use clothespins to clip them to a line outside, and let the fresh air and sunlight dry your clothes naturally. Sunlight can kill some of the bacteria that create unpleasant odors on your clothes, which is why line-drying leaves clothes smelling so fresh. [6] X Research source This method works better on natural fibers like cotton and wool than it does for synthetic fabrics like spandex or nylon. Over time, exposing your fabrics to sunlight will bleach their color."
    },
    {
      "title": "Put your clothes in the freezer if you don’t want to wash them.",
      "content": "Put your clothes in the freezer if you don’t want to wash them. Exposing odor-causing bacteria to extremely cold temperatures may kill them, helping to reduce the smell of mildew in your clothes. Just place the garment in a resealable plastic bag and put the bag in the freezer overnight. [7] X Research source It might seem unusual, but freezing their clothes is a long-time secret weapon of denim lovers who want to extend the life of their jeans."
    },
    {
      "title": "Spritz the item with white vinegar or vodka and let it dry.",
      "content": "Spritz the item with white vinegar or vodka and let it dry. [8] X Expert Source Dario Ragnolo House Cleaning Professional Expert Interview. 13 August 2019. Both white vinegar and vodka can be used to kill the bacteria that causes mildew odors, and since they are odorless after they evaporate, you can spray them directly onto your garment. Just pour the liquid into a spray bottle, saturate the item, and let it air-dry for the freshest result. [9] X Research source If you’re in a hurry, place the item in the dryer instead of air drying."
    },
    {
      "title": "Seal the item in a bag with activated charcoal.",
      "content": "Seal the item in a bag with activated charcoal. Activated charcoal has a powerful filtration effect, which is why it is used in water and air filters, treatments for poisoning, beauty products, and more. Place the item into a sealable plastic bag containing several tablets of activated charcoal, and leave it in there at least overnight. For really tough odors, you may need to leave the item in the bag for up to a week. [10] X Research source You can buy activated charcoal at pet supply stores, vitamin and nutrition shops, and some big-box retail centers."
    },
    {
      "title": "Hang damp clothes up",
      "content": "Hang damp clothes up to dry right away. Whether it’s the towel you used after your shower or your workout gear after an hour at the gym, don’t just throw your damp clothes on the floor or into the laundry basket. Instead, drape your wet clothes on the side of the laundry basket or hang them over the shower rod to dry out before they go into the laundry. [11] X Research source Balling up wet clothes will cause them to stay wet longer, giving mildew a better chance to grow."
    },
    {
      "title": "Use the recommended amount of detergent.",
      "content": "Use the recommended amount of detergent. Overusing laundry detergent can lead to a buildup of soap suds that never get completely rinsed out in the wash. This residue then feeds the odor-causing bacteria, leaving even your cleanest clothes with a funky smell. Each time you wash your clothes , measure your detergent carefully to make sure you don’t add too much. [12] X Research source Follow the guidelines on your detergent packaging to know how much to add. When in doubt, add a little less detergent than you think you need."
    },
    {
      "title": "Don’t use fabric softener on your workout clothes.",
      "content": "Don’t use fabric softener on your workout clothes. Fabric softener leaves your clothes feeling soft and smelling good, but when it’s used on stretchy, synthetic workout clothes, it leaves a slick residue that is nearly impossible to remove. This residue then keeps water from penetrating the fabric, meaning your clothes will smell bad even when they’re clean. [13] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Fabric softener residue will also promote the growth of bacteria in much the same way as using too much detergent."
    },
    {
      "title": "Dry your clothes immediately after you wash them.",
      "content": "Dry your clothes immediately after you wash them. Leaving your clean clothes in the washing machine will cause them to start developing mildew after just a few hours, or even sooner if the weather is really hot and humid. Try to move them over to the dryer or line-dry them as soon as possible after you wash them. [14] X Research source If you do accidentally leave your laundry in the washing machine for too long, run them through another cycle with some vinegar to help get rid of the smell before you dry them."
    },
    {
      "title": "Don’t store your clothes in damp rooms like the bathroom or basement.",
      "content": "Don’t store your clothes in damp rooms like the bathroom or basement. If you keep your clothing in a damp basement or in a humid environment like the bathroom, moisture from the environment will be absorbed by the fabric, leading to the growth of mildew. Instead, keep your clothes in a well-ventilated closet or a dresser. [15] X Research source Plastic dry-cleaner bags can also trap moisture and lead to mildew on your clothing. If the air in your room is extremely humid, place a desiccant like silica gel packets into your dresser drawers or the bottom of your closet. You can purchase these from craft or home improvement stores."
    },
    {
      "title": "[Clean a Smelly Washing Machine|Clean your washing machine]] if your clothes smell worse after washing.",
      "content": "[Clean a Smelly Washing Machine|Clean your washing machine]] if your clothes smell worse after washing. Sometimes washing machines, especially front-loading models, can develop mildew, which can then be transferred to your clothes. If you think the washing machine might be the problem, dip a rag in hot, soapy water and clean the gasket around the door and any detergent dispensers, then pour in 1 cup (240 mL) of bleach and 1 cup (240 mL) of baking soda and run a regular or cleaning cycle. [16] X Research source If you like, you can add 1 ⁄ 2 cup (120 mL) of an enzymatic detergent for extra odor-killing power. To prevent mildew from forming in your washing machine, leave the door cracked after each cycle so the machine will dry out, and always remove wet clothes right away."
    }
  ]
}