{
  "url": "https://www.wikihow.com/Ride-a-Public-Transportation-Bus",
  "title": "How to Ride a Public Transportation Bus",
  "steps": [
    {
      "title": "Look at a bus route map.",
      "content": "Look at a bus route map. Nearly every public transportation bus has a set route that they travel on. To find out how to get to where you need to go, get a bus route map. These typically have different colored lines with dots along them that represent the different busses and stops. The bus route map should also have a timetable on it that displays when each bus will be where. [1] X Research source You can typically find these bus route maps online at the city’s transportation website, or at local schools, shopping centers, and businesses along the bus routes. Also check for an additional route map that’s for weekends and holidays, as the city you’re in may have different schedules or routes on these days."
    },
    {
      "title": "Refer to the route map’s timetable for arrival and departure times.",
      "content": "Refer to the route map’s timetable for arrival and departure times. While each bus route map is a little different, they usually all have a timetable included. The timetable should display the times when the busses that travel along each particular route arrive at and depart from each stop. Find the section of the timetable that specifies your route and write down the arrival time for the stop that’s closest to your location. [2] X Research source Often, bus timetables are colored-coded to represent each route. For example, If you look at the map and discover that you’ll need to take the yellow route, look for the a section of the timetable that’s highlighted in yellow."
    },
    {
      "title": "Look for intersecting routes if you think you’ll need to transfer.",
      "content": "Look for intersecting routes if you think you’ll need to transfer. If no routes take you directly to where you need to go, look on the map at the different routes that stop near your starting location. Then, see if those routes intersect with any other routes that lead to your destination. [3] X Research source If you find a place where the routes intersect, identify the stop and refer to the timetable to figure out what time you’ll need to get off of your original bus and get onto a different bus that travels the second route. Look in the map key for phrases like “transfer point” and “transit center,” as these may be labeled on the map."
    },
    {
      "title": "Use an online trip planning feature if your city has one.",
      "content": "Use an online trip planning feature if your city has one. Go online to your city’s public transportation website. Look for a public transportation trip planning feature that allows you to type in your starting location, your destination, and possibly also the time of day that you want to travel. When you submit this information, the feature will likely show you what route you should take. [4] X Research source If you aren’t sure how to get to your city’s public transportation website, try Googling the name of your city followed by the words “public transportation.”"
    },
    {
      "title": "Get a bus pass",
      "content": "Get a bus pass or cash to pay the fare. If you want to ride the bus, you must pay a fare. Most people who use the bus frequently buy a pass and use it for efficiency and ease. You can usually purchase a bus pass at the city’s public transportation website and/or office. If you aren’t interested in getting a bus pass, you can also just pay in cash each time you ride the bus. Just make sure to bring exact change, as most city bus drivers aren’t authorized to make change for you. [5] X Research source Some public transportation systems offer a discounted rate for seniors and/or people with disabilities. You can apply for this discounted rate at your city’s public transportation website and/or office and then potentially receive a special bus pass that allows you to use the bus for a lower fare."
    },
    {
      "title": "Arrive at the bus stop a few minutes prior to arrival.",
      "content": "Arrive at the bus stop a few minutes prior to arrival. Most public transportation systems run smoothly so that they’re reliable and predictable. Because of this, being late to the bus stop by just 1-2 minutes could mean missing your bus. To avoid this, make sure to get to the stop a least a few minutes before the bus is supposed to be arriving. [6] X Research source"
    },
    {
      "title": "Look at the banner to make sure it’s the right bus.",
      "content": "Look at the banner to make sure it’s the right bus. Most public transportation buses have a digital banner on the front and/or side of the bus that displays the destination of the bus and/or the particular route name or number that the bus takes. As the bus approaches, make sure to read the banner to make sure that it’s the right bus. [7] X Research source"
    },
    {
      "title": "Wait for passengers to get off before you get on.",
      "content": "Wait for passengers to get off before you get on. Continue standing at the bus stop, even once the bus has come to a complete stop. Back up away from the door if necessary, and allow passengers to get off of the bus. Once it seems like everyone who is getting off at the stop is off of the bus, walk through the door that’s located towards the front of the bus. [8] X Research source If you need to, ask the bus driver to lower the bus to make getting on easier for you."
    },
    {
      "title": "Pay for the bus.",
      "content": "Pay for the bus. After you’ve stepped onto the bus, you’ll need to pay the required fare. If you have a bus pass, show it to the bus driver and/or scan it, if there’s a place to do so. [9] X Research source If you don’t have a pass, simply put your cash through the slit in the farebox. [10] X Research source If you aren’t sure what amount of cash to pay, check the farebox for a sign that displays the amount that’s required. [11] X Research source"
    },
    {
      "title": "Ask for a transfer slip if you need one.",
      "content": "Ask for a transfer slip if you need one. You may need to transfer to a different bus in order to get where you need to go. Often times, if this is the case, you won’t be charged again when you get on the second bus, as long as you have a transit slip to show the second bus driver. If you think you may need to transfer to a different bus later, ask the bus driver for a transit slip just after you get on and pay. [12] X Research source"
    },
    {
      "title": "Sit in a seat and/or hold on.",
      "content": "Sit in a seat and/or hold on. Once you’ve paid, look for an open seat and sit in it. If you can’t find one, stand somewhere that’s as out of the way as possible. Be sure to hold onto a pole or a handle so that you don’t fall and hurt yourself or someone else once the bus starts moving. [13] X Research source Seniors and people who are disabled get first priority of the seats that are located at the front of the bus. If a person who is elderly or disabled gets on the bus and you’re sitting in the front, stand up and offer them your seat."
    },
    {
      "title": "Try to minimize the amount of space you take up.",
      "content": "Try to minimize the amount of space you take up. Buses are often crowded, so it’s best to be considerate and accommodating while riding. If you’re sitting, try to only use one seat, and don’t put your purse, jacket, or anything else in the seat next to you. If you’re standing, take your backpack off and hold it by your side so that there’s more room for others. [14] X Research source To get away from the crowd, you can try sitting or standing towards the back of the bus."
    },
    {
      "title": "Pull the signal cord when your stop is close.",
      "content": "Pull the signal cord when your stop is close. For efficiency, buses sometimes won’t stop at stops that no passengers are getting off at. To communicate your stop to the bus driver, be sure to pull the signal cord that’s located just above the bus windows. Do this about 1 block before your stop. [15] X Research source In the United Kingdom, buses usually have coloured 'stop' buttons located on the poles instead of signal cords. When pressed, you will hear a beep or bell sound and a panel at the front of the bus will light up to read 'bus stopping'. Only pull a signal cord or press a 'stop' button once. Doing so again and again for one stop is disrespectful to the driver and can even distract them."
    },
    {
      "title": "Exit through the back door.",
      "content": "Exit through the back door. Typically, passengers get on through the front door and get off through the back door. This makes getting on and off easier and smoother for everyone. Be sure to head to the back door once the bus has stopped at your stop. [16] X Research source You can exit through the front door if you’re disabled, elderly, or need to remove your bike from the bike rack."
    },
    {
      "title": "Wait until the bus is gone to cross the street.",
      "content": "Wait until the bus is gone to cross the street. City buses can’t stop traffic. Once you’ve exited the bus, wait safely on the side of the road until the bus has departed. Then, you can either look both ways and cross the street or press the crosswalk button and wait until you’re signaled to cross the street, depending on how busy the area is. [17] X Research source"
    }
  ]
}