{
  "url": "https://www.wikihow.com/Persuade-Your-Parents-to-Get-a-Dog",
  "title": "How to Persuade Your Parents to Get a Dog",
  "steps": [
    {
      "title": "Talk about a dog as a “family” pet.",
      "content": "Talk about a dog as a “family” pet. Talk to your parents about how having a dog will make you spend more time around the house. Therefore, you will have more time with your dog. Tell them that having a dog can be fun for the whole family—you can go for walks in the park together, or have a family barbecue in the backyard while throwing a Frisbee to the dog. Ask them to picture how nice it will be to have a family dinner with the dog by your side, or to have a family movie night with the dog sitting at your feet."
    },
    {
      "title": "Say that having a dog will make you spend more time outside.",
      "content": "Say that having a dog will make you spend more time outside. Your parents will likely enjoy the fact that you'll go out more if you aren't doing so already. [1] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Tell them that having a dog will help you to unplug and have a simpler mindset outside with your dog."
    },
    {
      "title": "Show them that having a dog can improve your mental health.",
      "content": "Show them that having a dog can improve your mental health. Having a dog is therapeutic and people who own dogs have been known to live longer and to be happier. A dog knows when you're upset and can comfort you in times of stress. Dogs are intuitive creatures that know exactly how to cheer up their owners. If your parents spend a lot of time at work, then tell them that having a dog in the house will not only be soothing for everyone but that a dog can keep you company while they're away."
    },
    {
      "title": "Tell them that having a dog can make a home feel more secure.",
      "content": "Tell them that having a dog can make a home feel more secure. Dogs are protectors of their pack, and will take any means necessary to ensure the safety of those they regard as their family. You will feel more secure with a dog around in your house. With some careful training, your dog can learn who is and who isn’t welcome in your home. [2] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Homes that have dogs visible inside are much less likely to be robbed. Show your parents that a dog, once trained, will not only be your lifelong companion, but will also be your protector. If you're old enough for your parents to go on vacation without you, tell them how much more secure you'd feel if there was a dog by your side."
    },
    {
      "title": "Explain how having a dog will teach you responsibility.",
      "content": "Explain how having a dog will teach you responsibility. [3] X Expert Source Emily Fleisher, CTBC Professional Dog Trainer Expert Interview. 27 January 2020. [4] X Expert Source Amanda Marshall-Polimeni Dog Behavior Consultant Expert Interview. 5 March 2021. Though you should show your parents that you're capable of having a dog by being responsible, you can also tell them that having a dog will make you an even more responsible and careful person. Here's why: Having a dog will teach you to follow a routine. You'll have to feed, walk, and play with the dog at certain times. Having a dog will make you go to bed earlier and wake up earlier so you can walk it. No more staying up until three in the morning staring at your computer or TV screen. Tell them that having a dog will teach you the value of being responsible for another being."
    },
    {
      "title": "Talk about the type of dog you want.",
      "content": "Talk about the type of dog you want. Do a bit of research to figure out what kind of dog you want and why. Whether you want a small breed dog, like a miniature schnauzer, or a large dog, like a Labrador, explain your reasons for wanting a particular breed of dog. This will show your parents that you have put time and effort into thinking about getting a dog. [5] X Expert Source Emily Fleisher, CTBC Professional Dog Trainer Expert Interview. 27 January 2020. When you talk with your parents about the type of dog you want, you may also want to: Tell them about the strong suits and features of a particular breed of dog. Is it known for being easy to train, fiercely loyal, or just really cute? Explain what works best for training this breed of dog. Show them that you already know what to do to house train and teach the dog basic commands like \"sit\" and \"stay.\" Show them a picture of the dog or dog breed. Showing a picture of the dog to your parents may help to make them much more sympathetic. Who can resist a picture of a cute dog?"
    },
    {
      "title": "Make sure that you are ready for dog ownership.",
      "content": "Make sure that you are ready for dog ownership. It’s very easy to fall in love with the idea of dog ownership, especially after watching a great dog movie, but the reality requires a great deal of work. [6] X Expert Source Rendy Schuchat Certified Professional Dog Trainer Expert Interview. 29 January 2021. Even though you may like the idea of getting a dog, are you really ready for the time, expense, and effort? Will you be willing to give up some of your social time to spend time with your dog? [7] X Expert Source Amanda Marshall-Polimeni Dog Behavior Consultant Expert Interview. 5 March 2021. [8] X Expert Source Emily Fleisher, CTBC Professional Dog Trainer Expert Interview. 27 January 2020."
    },
    {
      "title": "Figure out a way to help with the cost.",
      "content": "Figure out a way to help with the cost. Dogs can be expensive because of the cost of food, grooming, veterinary care, and toys. Think about how you can help out with this household expense. Then, offer to pay for all, or some, of the dog’s expenses. You will need to stick to this promise, so make sure that your money-making ideas are realistic. You can offer to do odd jobs around the neighborhood, deliver newspapers, or use your savings or birthday money to help with the cost of buying the dog."
    },
    {
      "title": "Pull your weight with household chores.",
      "content": "Pull your weight with household chores. If you want your parents to see that you'd be a great dog owner, then you have to be able to do the basics: make your bed, keep your room clean, wash the dishes, and do anything that is required of you. Then, take it to the next level and pick up more household chores, help cook dinner, mow the lawn, do laundry, and maybe even make your parents coffee when it looks like they need caffeine or do whatever you can to go above and beyond what is required of you. Allow your parents to see you doing these chores, particularly the extra ones, without being asked or reminded to do them. This shows that you're responsible, and that you can remember to do things like taking the dog for a walk."
    },
    {
      "title": "Keep your grades up.",
      "content": "Keep your grades up. If you want your parents to see that you can handle the added responsibility of a dog, then you should make sure to keep your grades up as you continue to ask to add a new member to your family. If you can, try to do even better in school to show them that you're committed to working hard and doing whatever it takes to get the dog. [9] X Research source [10] X Research source If you decide to make a verbal promise to your parents, be as specific as you can. You might say, “I will keep my grades in math at an A.” Or, “I will score an A on all of my science tests.”"
    },
    {
      "title": "Show them that you can take care of something.",
      "content": "Show them that you can take care of something. Have your parents give you something to take care of for a set amount of time. It can be an egg (don't let it break!), a sack of flour, a plant, or even a smaller pet like a hamster or fish. Doing well on this test run may show your parents that you're responsible and serious about wanting a dog. Though this may seem silly, you should treat the situation with the utmost seriousness."
    },
    {
      "title": "Do a test run.",
      "content": "Do a test run. If you have a friend or family member who needs someone to take care of his or her dog for a little while, volunteer to help them. Taking good care of the dog for a few days will show your parents that you're ready to take on a pet, and it will make them see how happy you are to be hanging out with a furry creature."
    },
    {
      "title": "Give them time to think about it.",
      "content": "Give them time to think about it. Remember, don't ask them over and over every day, or they will shut you out. If they say no, keep showing maturity and understanding, keep being helpful around the house, and occasionally mention the dog, to get them used to the idea. Being patient will also show them that you're so committed that you're willing to wait."
    },
    {
      "title": "Show them that you will walk the dog.",
      "content": "Show them that you will walk the dog. [11] X Expert Source Emily Fleisher, CTBC Professional Dog Trainer Expert Interview. 27 January 2020. They may be worried that you will get the dog, get bored, and force them to take care of the little creature instead. Tell them that you've already selected the best walking times for the dog and are determined to walk the dog every day; if you have a sibling, show that you've split up the walking duties. To prove your point, you can even go for walks on your own during the appointed doggie-walking times."
    },
    {
      "title": "Assure them that the dog won't destroy their home.",
      "content": "Assure them that the dog won't destroy their home. Your parents may be worried that the dog will chew up all of their furniture and cords, bring dirt into the house, and shed all over the place. It's your job to show them that none of this will happen. When you talk with your parents about their concerns, make sure to: Tell them that you'll get the dog plenty of chew toys to make sure the dog doesn't chew the furniture. As for any loose cords or wires, tell them that you'll tape or cover them up, which will make your house look more orderly anyway. Explain how you'll prevent the dog from tracking dirt into the house. You can explain that you'll clean the dog's paws in the garage or the back porch before the dog sets foot into the house again. Discuss how you will prevent the dog from shedding too much. Dogs shed, but you can explain to your parents that you'll make a cleaning schedule to clean up the fur. Let them know that you plan to give the dog a weekly bath, or bathe it however often is necessary for the breed."
    },
    {
      "title": "Create a food and water chart.",
      "content": "Create a food and water chart. Your new dog will need to eat at least once, but usually twice, per day. Do some research to determine whether or not you’ll go with wet, dry, or combination dog food. Find a food that is nutritious, but also fits your budget. Then, craft a chart showing when the dog will eat and how much. You can also estimate food cost over time. [12] X Expert Source Rendy Schuchat Certified Professional Dog Trainer Expert Interview. 29 January 2021."
    },
    {
      "title": "Think about house training.",
      "content": "Think about house training. If you plan to adopt an older dog, they may already be house-trained. However, you will likely need to work with a puppy or younger dog on their bathroom skills. Be prepared to talk with your parents about how you will not only pick up the poop, but will also clean up and place pee pads in the home."
    },
    {
      "title": "Provide a list of recommended veterinarians.",
      "content": "Provide a list of recommended veterinarians. Show them that you'll be able to give the dog medical care. Do your research in advance and find the best vet in your area. Ask your friends with dogs which vets they recommend, or do research on your own. Try to find a vet that is close to home so you can walk to his office if you don't drive, and show your parents that you've already done your research and can take care of it."
    },
    {
      "title": "Make a plan for vacations and other extended outings.",
      "content": "Make a plan for vacations and other extended outings. Show them that you have a game plan for watching the dog if your family goes on vacation. Your mom might ask, \"What will we do when we go away to the beach for a week?\" Don't get caught off guard and do your research in advance. Find a doggie daycare nearby that can take your dog in, or find a close friend or neighbor who is willing to take care of the dog. [13] X Research source"
    },
    {
      "title": "Be willing to wait to adopt.",
      "content": "Be willing to wait to adopt. [14] X Expert Source Amanda Marshall-Polimeni Dog Behavior Consultant Expert Interview. 5 March 2021. Show them that you won't get bored with the dog. Your parents may worry that once you get the dog, you'll stop taking care of it after a few weeks. In addition, they'll likely need time to make their decision. To ease their concerns on this front, tell them that you're willing to wait a few months and to keep discussing the dog to show that this isn't just a passing phase; you're really committed to getting a dog and are willing to wait to show them how dedicated you really are."
    }
  ]
}