{
  "url": "https://www.wikihow.com/Raise-a-Baby-Squirrel",
  "title": "How to Raise a Baby Squirrel",
  "steps": [
    {
      "title": "Look for the baby's mother first.",
      "content": "Look for the baby's mother first. While you can certainly raise a baby squirrel, no one can raise it better than its mother. When you find a baby squirrel, it's important to always try to reunite baby and mother before doing anything else. A squirrel mama will look for her babies and reclaim them if they are warm. [1] X Research source Squirrel moms will not take back a cold baby because they will think it is either sick or dying. It's up to you to monitor the situation. If the baby is hurt, cold, or it's nighttime and mom does not come to get the baby within one to two hours, the baby is probably an orphan and needs your help. Human scent on a squirrel baby will not deter the mother from taking them back so touching them is not a worry at any point. If there is more than one baby and one is already dead, the mom will not take the live one(s) back. Therefore it will be up to you to rehab them and see if mom will reclaim them after some time has passed and the scent of her deceased baby subsides."
    },
    {
      "title": "Pick the baby up gently.",
      "content": "Pick the baby up gently. Wearing thick leather gloves (just to be safe), take this chance to observe the baby and check for injuries, bugs, bleeding, bumps or wounds. If they are bleeding or you see broken bones or serious injury, you need to find a vet who will see a squirrel as soon as possible. Most vets will not see the squirrel unless you are licensed. If this is the case, call any and all rehabbers in your area immediately."
    },
    {
      "title": "Make the baby warm.",
      "content": "Make the baby warm. Baby squirrels don't generate their own heat so you must do that for them. Find or borrow a heating pad, electric blanket, a hot water bottle, or even a hand warmer. A liquid heating pad that recirculates water is the best for heat control. Make sure the heating apparatus of choice's temperature is a low-to-medium temperature. Baby squirrels should be incubated at about 99 °F (37 °C). If you have a thermometer handy or can borrow one it will help you create the right environment for your baby squirrel's good health. Some heating pads shut off after a few hours, so check it often to be sure it is still on. If you have no option, but to raise the baby yourself, invest in a non-auto-shut-off heating pad. The baby's life depends on it. You can also place a towel over top of the container or the lid to the container with air holes punched out to keep the heat inside."
    },
    {
      "title": "Get a small box.",
      "content": "Get a small box. Once you get what you need to warm your baby squirrel, a small box, basket or a large Tupperware about a foot square (with air holes punched out of the lid) or another similar container is needed. Place your heating device to one side. This way if it gets too hot, the baby squirrel can simply crawl away from the pad. If a heating pad is used, be sure it is under the container, not inside with the baby. Make a nest inside the box with nesting material from the area where you found the baby. Make a donut-shaped nest and place the baby inside. Be sure the heat source is nuzzled up against the nest but not directly in contact with the baby. If necessary you can use soft fabrics from your home. Do not use towels as baby squirrels can snag their toes and break ankles, lose limbs, etc."
    },
    {
      "title": "Try to find mama one more time.",
      "content": "Try to find mama one more time. Put the nest outside. If the area is safe from dogs, cats, raccoons, and other predators you can put the nest on the ground. If you're not sure, put it up in a tree or on a pole to keep it safe. As your baby squirrel warms it will instinctively call for its mother. If she is around there is an excellent chance she will come and get her baby. Squirrel mothers carry their babies just like a cat so don't worry about the nest being in a tree."
    },
    {
      "title": "Bring the nest inside.",
      "content": "Bring the nest inside. After one to two hours it's time to throw in the towel. There are many reasons why the mother may not come. She may be injured or dead, for instance. In any event, at this point the baby and your nest need to come join your household. If you have a dog or a cat make sure the baby has its own protected room and other animals are never allowed to have contact with the baby. Make sure you continue to keep the nest warm."
    },
    {
      "title": "Look for a squirrel rehabilitation center.",
      "content": "Look for a squirrel rehabilitation center. Call your local vets, animal shelters, humane societies, Fish & Game, Fish & Wildlife, and Wildlife groups to get a referral for a local wildlife rehabilitator that takes in squirrels. You can also search online by typing in \"squirrel rehabilitation\" and your state and city. Go to http://www.thesquirrelboard.com for help with the baby squirrel until you find a rehabber. It is a forum that you can join and ask questions that will help you raise the baby until a rehabber is found. If a rehabber cannot be found, the squirrel board will help you raise the baby to release back into the wild."
    },
    {
      "title": "Be aware that some countries and states have strict laws about raising baby squirrels.",
      "content": "Be aware that some countries and states have strict laws about raising baby squirrels. In the United Kingdom it is a criminal offense that carries a maximum penalty of 2 years imprisonment, to rear, keep or reintroduce a grey squirrel back into the environment. Some states in the U.S., such as Washington state, have laws that make it illegal to possess or provide rehabilitation to a sick, injured, or orphaned wild animal, such as a squirrel, unless you are transporting the animal to a licensed wildlife rehabilitation for care. [2] X Research source Familiarize yourself with the laws in your area, and be aware that you may be liable for prosecution if it is illegal to raise orphaned wildlife."
    },
    {
      "title": "Clean your baby squirrel.",
      "content": "Clean your baby squirrel. Be aware that baby squirrels might have parasites such as fleas, mites, ticks and maggots. Remove the fleas and maggots by hand with flea combs and/or tweezers. Petco also sells flea and mite sprays made specifically for small animals such as hamsters. Always check to ensure this is safe for your baby. Non-chemical options such as diatomaceous earth and blue Dawn dish soap (blue only) may be used. If it's a tiny, pink-skinned baby, do not apply any chemicals to the squirrel. Put the spray on the cloth around the baby. Do not spray into wounds. It will sting. Wash your hands immediately after cleaning it, since the parasites could spread to you or other animals."
    },
    {
      "title": "Check for dehydration.",
      "content": "Check for dehydration. You can see how dehydrated they are by gently pinching their skin. If the \"tent\" of their skin stays there over a second or more, they are dehydrated. A dehydrated baby squirrel needs water as fast as possible as you don't know how long it has been since they ate or drank. Wrinkly, sunken eyes or appearing emaciated are also telltale signs of a dehydrated squirrel."
    },
    {
      "title": "Choose your liquid.",
      "content": "Choose your liquid. Most fallen babies will be in need of water. An even better solution is to go to the supermarket or drug store and purchase Pedialyte in the baby section. They may also carry their own store brand of rehydrating baby fluid as well (Gerber has a brand also). Squirrels like fruit flavors, but plain will do if it's all they've got. Do not use Gatorade or any other sports drink. If you are nowhere near a store or drugstore, here is a homemade formula: One teaspoon salt Three teaspoons of sugar One quart of warm water Mix well"
    },
    {
      "title": "Use oral syringes.",
      "content": "Use oral syringes. These are the types of syringe that have no needle. Do not use anything larger than 5 cc syringe. The best option would be to use 1cc syringes. These can be obtained by asking your local pharmacy for some needle-less syringes."
    },
    {
      "title": "Check the baby's temperature.",
      "content": "Check the baby's temperature. You don't need a thermometer to obtain a precise temperature, but the baby should be warm to the touch. This is a crucial step before you give it any fluids because it won't be able to digest what you're feeding it if it is not warm."
    },
    {
      "title": "Feed hairless, pink babies with great care.",
      "content": "Feed hairless, pink babies with great care. If your baby is hairless and pink it is probably also tiny, about 2–3 inches (5.1–7.6 cm) long. It's easy to aspirate the babies when they are this little and that leads to fluid in their lungs. This will give them pneumonia and they might die. To avoid this, hold the baby upright in your hand with the syringe pointed towards the roof of their mouth. Do not force feed the baby - go as slow as the baby requires. It may take an hour to get 1cc in the baby until they learn how to suck on the syringe. Be sure the fluids are warm but not too hot. You can store the unused amounts in the refrigerator. For these little babies, just put one little drop on their lips at a time and let them suck that in. If they won't take the fluids, poke a drop in their mouth so they can taste some of it first. Some will just open their mouths wide and start sucking away. If their eyes are open, you can let them take the syringe in their mouth and gently give them a few drops. If a lot falls out of their mouth or comes out the nose, you're going way too fast. Hold them upside down immediately for 10 seconds, then blot the fluids off their nose and out of their nostrils then wait about one minute before you continue."
    },
    {
      "title": "Provide the proper amount.",
      "content": "Provide the proper amount. Give tiny, eyes-closed pink babies 1 cc every two hours; fully furred eyes-closed babies 1-2 cc about every two hours; open-eyed babies 2-4 cc every three hours until a rehabber calls you back with your instructions. [3] X Research source If the baby is gagging or unresponsive to feeding, take it immediately to a rehabber and request lactated ringers. If done properly, these should help get the baby feeding again. [4] X Research source Feed every two hours around the clock until the baby squirrel is two weeks old. After that, feed every three hours until their eyes open. Then feed the baby every four hours until weaned, which is between seven and ten weeks old. [5] X Research source"
    },
    {
      "title": "Stimulate the baby squirrels.",
      "content": "Stimulate the baby squirrels. They need to be stimulated to go to the bathroom when their eyes are closed so before and after each feeding of fluids you will need to gently wipe the genital and anal area with a warm, moist cotton ball or cotton swab until they pee or poop. Otherwise their stomach will bloat and may result in death. Their mothers do this for them in the wild. If they are very dehydrated and haven't eaten in a while, they may not pee for a quite a few feedings and may not poop for a day."
    },
    {
      "title": "Decrease the time between feedings.",
      "content": "Decrease the time between feedings. If the baby is feeding well and hydrating and continuously growing without incident, feed it every hour for four to six hours. Use the following recipe as a guideline: [6] X Research source 1 part powdered puppy milk replacer 2 parts distilled water 1/4 part whipping cream (not whipped cream) or plain yogurt"
    },
    {
      "title": "Warm the food.",
      "content": "Warm the food. Microwaving is fine. Like liquids, introduce this soft food gradually. Like the Pedialyte, however, you will move up the feeding steps rather quickly. [7] X Research source Do not mix Pedialyte and formula. Start with a weak formula mixture. 4 parts water to 1 part powder for 1 day. 3 parts water to 1 part powder for 1 day. 2 parts water to 1 part powder until weaning."
    },
    {
      "title": "Wean your baby.",
      "content": "Wean your baby. Once your little one is ready for solid food (when its eyes are open), you can use Rodent Blocks by Kaytee, Oxbow, or Mazuri found at most pet stores. They contain the right amount and right types of nutrients. You can also buy blocks specifically made for squirrels at HenrysPets.com. Give the squirrel blocks until he is released. [8] X Research source"
    },
    {
      "title": "Do not introduce nuts as a first food.",
      "content": "Do not introduce nuts as a first food. Start with healthy vegetables (broccoli, spring mix, kale, etc). Once the baby is eating all blocks and veggies, you can slowly introduce fruits and nuts. Give only one nut per day and only 1-2 small pieces of fruit per day. Like a human baby it will also let you know when it's done with formula by pushing it away. If your squirrel pees on the food, don't worry, it's just what baby squirrels do. Give them small amounts of just one food at a time to be sure it doesn't get diarrhea. Avoid picking acorns from the ground as many contain an invisible toxin that can quickly kill a squirrel. [9] X Research source"
    },
    {
      "title": "Purchase a large cage.",
      "content": "Purchase a large cage. Squirrels need room to run a bit. Make sure the cage is at least 2'2'x3' with shelves, a bed, and places to hide and climb. Keep a ceramic water source in the cage. If it's plastic the squirrel will chew, destroy, and possibly eat it. Provide it with toys to play with. Good ideas are pinecones, clean sticks, or a clean, thick dog bone. Bad ideas are anything it can rip apart, choke on, and throw the stuffing all over the place (like a bean-stuffed toy). [10] X Research source Include objects to grind his teeth on, as they never stop growing."
    },
    {
      "title": "Play with your baby squirrel.",
      "content": "Play with your baby squirrel. They need social interaction, especially if your baby is a loner. This should include at least one hour of outside-the-cage fun time every day. If you don't have a room safe for this, either get a larger outdoor cage for them to spend time in (you'll eventually need one anyway, but don't transfer the baby to the outdoor cage without a travel carrier) or move it to a different cage in a different part of your house. Do not allow the baby to play outside while not contained. Hawks and other predators are much faster than you and may snatch up the baby before you have a chance to react. The baby may also get spooked and run away, unable to return. It is a good idea to let them get used to heights and curtain rods will be a great help here. You don't want your baby to be crawling on the ground once it gets outside and many hand-raised squirrels tend to do just that, ending up easy prey for snakes, cats etc. Rehabilitators will pair a baby squirrel with a friend before either opens their eyes so they bond together. This is yet another reason to take the baby to a rehabilitator: two squirrels will help each other survive in the wild in a variety of ways. [11] X Research source A baby squirrel kept in a small cage too long can have growth deformities from the cramped spaces or from circling the small cage. Once the baby stops taking formula completely, stop taking the baby out. He will need to learn a natural fear of humans to ensure his safety in the wild."
    },
    {
      "title": "Move the rehabilitation into the wild.",
      "content": "Move the rehabilitation into the wild. At four to five months of age the squirrel will need to be moved to an outside cage that is as large as possible, preferably at least six feet tall. Make sure it is predator-proof. Make sure it has a nesting box, sticks to play with, allows your squirrel to climb and jump on various surfaces, and is partially covered from rain. The cage should also have a solid bottom or your squirrel could pull a daring escape. If you're building one, a sally port is recommended to ensure he doesn't jump out when you're opening the door to feed him. Ensure the cage has a tiny squirrel-sized door for release. This door should be around 4 inches square. This way, if a squirrel is being chased by a larger predator, he can return home safely without fear that the larger predator will follow him and trap him. When it is time for release, open this door only and allow the squirrel to venture out on his own. [12] X Research source Your squirrel should spend at least four weeks in its outdoor cage prior to release. During this time, it's crucial to feed wild foods so he knows what to look for."
    },
    {
      "title": "Let your squirrel go.",
      "content": "Let your squirrel go. Because it has no mother or siblings, you must make sure the release area is safe from dogs, cats, unfriendly neighbors, and other predators. The area should have plenty of water, food, and fruit and nut trees. Provide enough food for at least three weeks after release. If you release in your yard, put up a feeder and keep it regularly stocked with fresh food. After all, you already know what your squirrel likes to eat. [13] X Research source Putting your squirrel back in the environment where you found it is a great idea if it is safe and provides to food sources it needs. It's vitally important not to release your squirrel too soon. At four months a baby is woefully unprepared to survive on its own and is easy prey for predators. You must monitor the squirrel for the first week to make sure he is able to find food, water, and is confident in the new surroundings."
    }
  ]
}