{
  "url": "https://www.wikihow.com/Politely-Decline-an-Invitation",
  "title": "How to Politely Decline an Invitation",
  "steps": [
    {
      "title": "Respond in the manner requested ASAP.",
      "content": "Respond in the manner requested ASAP. [1] X Expert Source Tami Claytor Etiquette Coach Expert Interview. 16 February 2022. If invited to a wedding or another event for which an RSVP card is included, return the RSVP promptly. If you immediately know that you cannot or will not attend the event, let the host know right away not to expect you. [2] X Research source If the invitation came without a RSVP card, look on the invitation for the preferred method of contacting the host. Send \"regrets\" for written invitations within a week. [3] X Research source Don't give the impression that you may come if you know you won't. Stringing the host along as they prepare for their event will frustrate them. If you are not sure whether or not you can attend, call the host to explain your dilemma and ask when they need a solid answer. If you plan to attend but must be late, ask the host if that is ok. If the event includes a seated meal, it may not be possible to show up at anytime. However, your host may suggest you come at the conclusion of dinner before dancing begins. [4] X Research source If no RSVP is requested, still call or write to the host with your regrets and thank them for including you. It is considered rude to ignore an invitation completely. “Regrets only” is often an option included on formal RSVP cards. If you do not send the card back, you are agreeing to attend."
    },
    {
      "title": "Follow up with a handwritten note.",
      "content": "Follow up with a handwritten note. Thank the host for the invitation, say you will not be able to make it, and wish them luck with their event. You might also tell them you would love to see them another time, if appropriate. Just don’t change your response! It’s important to stick to your original decision. The type of note should match the type of invitation sent. For a wedding or bridal shower, send a formal card or use nice looking stationery. Never send a typed response to a personal invitation. Unless even your address on the envelope was typewritten, your host put time and effort into your invitation and you should do the same. Find examples of polite declines online if you are not sure what to say, but be sure to change the wording to fit your particular circumstances or manner of speaking. [5] X Research source Don’t get caught plagiarizing an example you found instead of taking time to write a sincere note."
    },
    {
      "title": "Be honest when giving any explanation(s).",
      "content": "Be honest when giving any explanation(s). If you have another obligation, let him/her know. If you don’t have another obligation, and can’t comfortably explain why you don’t want to go, just politely decline without offering a reason. Don’t make up a reason for not attending. It will likely backfire when s/he finds out you lied, even if it was to protect his or her feelings. Don’t feel the need to over-explain. For formal invitations, a simple “I’m sorry to have to miss it,” will suffice. [6] X Research source If pressed for a reason, you can simply says, “It’s personal.” [7] X Research source Avoid relaying any guilt for needing to skip the event. This only wastes your time and energy and may be negatively accepted by your host."
    },
    {
      "title": "Send a congratulatory note and a gift, if appropriate.",
      "content": "Send a congratulatory note and a gift, if appropriate. [8] X Expert Source Tami Claytor Etiquette Coach Expert Interview. 16 February 2022. For an occasion where a gift might be expected, like a baby or bridal shower, a birthday party, or a special celebration like a wedding or graduation party, send a small and thoughtful gift with a written congratulations after you send your regrets. Don’t wait until you can get a gift to send your regrets, though! Let the host know ASAP that you cannot attend, and send a gift and a written card later. Don’t feel obligated to buy a gift for someone you don’t know well or aren’t related to. It is up to your own judgment as to whether your invitation warrants a gift. [9] X Research source"
    },
    {
      "title": "Respond in the manner requested.",
      "content": "Respond in the manner requested. If the event was transmitted by evite, then you can send an email or personal message through social media. [10] X Research source If the invitation was written, but on informal stationery, send a card in return. Call when a phone number is given, unless the invitation says texting is ok. Even if the option is given on the evite, avoid offering an explanation that all guests can see. It’s much better to simply decline and send a personal message if you feel the need to say why you cannot attend. [11] X Research source If your potential host is a close friend, it is best to tell them you can’t make it in person, if possible, or at least over the phone. Send a written note also, closer to the date of the event, to wish them a happy party. [12] X Expert Source Tami Claytor Etiquette Coach Expert Interview. 16 February 2022. Reader Poll: We asked 190 wikiHow readers how they preferred to respond to an informal dinner invitation, and only 4% of them said an in-person conversation. [Take Poll] Promptly declining an evite via text, email, or social media can help you avoid any awkward conversations."
    },
    {
      "title": "Be honest, but also kind.",
      "content": "Be honest, but also kind. If you just don’t wish to go, be honest and tell the host you aren’t interested in this particular event, but would love to come to other things s/he hosts in the future. Avoid agreeing to attend something you really don’t want to attend. It will only disappoint your host more when you are expected and don’t show up, or if you change your response at the last minute. It’s ok to not feel guilty for not wanting to attend yet another baby or bridal shower in the spring. Wipe shame from your mind, and respond with a polite decline. [13] X Research source"
    },
    {
      "title": "Offer an alternative time to get together.",
      "content": "Offer an alternative time to get together. If you are declining a friend’s birthday party or graduation celebration, wish them a great party and offer an alternative date to celebrate when it’s just the two of you. Be sure to offer your sincere disappointment that you cannot attend the original event, and thanks for thinking you were important enough to invite!"
    },
    {
      "title": "Turn your regrets into a compliment sandwich.",
      "content": "Turn your regrets into a compliment sandwich. This is especially important when turning down informal, but very personal, get-togethers, like a date. [14] X Research source Say, “That is very sweet of you, but I will have to pass. I’d love to do something else though, just as friends.” Don’t embarrass your host by telling others about the invitation. Keep it to yourself, just as you would like others to do when you ask them out."
    },
    {
      "title": "Call after the event to ask how it went.",
      "content": "Call after the event to ask how it went. If you were invited to a party or event by a close friend, call them afterwards to see how their event went. This gives you a chance to show them you are still thinking about them and happy for their success or accomplishment."
    }
  ]
}