{
  "url": "https://www.wikihow.com/Measure-Hips",
  "title": "How to Measure Hips",
  "steps": [
    {
      "title": "Find a full-length body mirror.",
      "content": "Find a full-length body mirror. Although the hips are easier to measure by yourself than other areas of the body, a mirror will help you ensure the tape is not twisted or uneven. Therefore, stand in front of one to get your measurement. [1] X Research source"
    },
    {
      "title": "Take off your clothes.",
      "content": "Take off your clothes. Remove your outer garments, such as your pants and shirt. You can leave on thin underwear and still obtain an accurate measurement. Wearing jeans or anything else too bulky will change the measurement. [2] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you always wear the same bulky clothes, you can leave them on if you're just measuring to judge how much weight you've lost. However, if you're measuring for a pattern or clothes , it's important to be as accurate as possible."
    },
    {
      "title": "Place your feet together.",
      "content": "Place your feet together. Having your feet apart can create a measurement that's actually larger than your hip area. Put your feet together to take the measurement. At the very least, your feet shouldn't be wider than your shoulders, but together is better. [3] X Research source"
    },
    {
      "title": "Know the difference between your waist and hips.",
      "content": "Know the difference between your waist and hips. Your natural waist is the smallest part of your torso, where your body dips in. Your hips are below that, and they are usually wider than your waist. Your hip measurement includes your butt and your hips. [4] X Research source"
    },
    {
      "title": "Find the widest point.",
      "content": "Find the widest point. Your hip measurements should be taken at where your hips are the widest. That's because when you're taking measurements, you're trying to get an accurate representation of your body, and the hips represent the widest point on your bottom half. For clothes to fit accurately, you need to find the widest point. Once you have your tape measure in place, you may need to move up or down an inch or two to find the widest spot. Everyone's body is different, so it may take a few tries repositioning the tape measure to ensure you're measuring the widest spot. [5] X Expert Source Andrea Beaulieu Professional Tailor & Fashion Designer Expert Interview. 1 May 2020."
    },
    {
      "title": "Hold a cloth tape measure on one hip.",
      "content": "Hold a cloth tape measure on one hip. Hold one end on one hip. It doesn't matter which side you start with. You can also pull it more towards your middle if that's easier for you. Just make sure you hold on to that end as you bring the other end around. [6] X Research source Cloth measuring tapes are soft and flexible tools you can find in sewing kits and craft stores. Most measuring tapes go up to 5 five or so. Most big box stores and drug stores will also carry sewing kits. [7] X Research source You can also print a tape measure off the internet. You can find these with a simple search online. You simply cut them apart, align the edges, and then glue or tape them together. [8] X Research source Of course, you need to be careful with this type of tape measure, as it can rip easily. However, don't try to use card stock, as that can be too stiff to get a good measurement. Don't use metal measuring tapes. Metal measuring tapes, the kind you use for do-it-yourself improvement projects, are not good for taking measurements of your body. They aren't flexible enough, so they won't give you an accurate measurement. [9] X Research source"
    },
    {
      "title": "Go around the back.",
      "content": "Go around the back. Wrap it around your backside, being careful to make sure it doesn't twist. Pull the tape around to the other end from the other hip. Make sure you are getting it around your rear end at the same time. [10] X Research source You can also start out holding both ends and step over the tape so it's on your backside. This movement can help if you have trouble wrapping it around the back."
    },
    {
      "title": "Check in the mirror.",
      "content": "Check in the mirror. Now that you've got it wrapped around, check to make sure you've got it right in the mirror. The tape should be parallel to the floor all around, and it shouldn't be twisted at all. Make sure it looks even. You'll need to shift around to check out the back side of the tape. Turn to the side so you can see. If the tape measure doesn't look even, reposition it and try again. [11] X Expert Source Andrea Beaulieu Professional Tailor & Fashion Designer Expert Interview. 1 May 2020."
    },
    {
      "title": "Make it snug.",
      "content": "Make it snug. When measuring, the tape should be snug around your hips. However, it shouldn't be cutting off circulation. It should be tight enough that you can only fit a finger underneath it, no more."
    },
    {
      "title": "Read the measurement",
      "content": "Read the measurement . You can look down to find out your measurement. You measurement is where the end of the tape meets a number as the tape measure comes around. You may need to look in the mirror to read the number more easily."
    },
    {
      "title": "Write down your hip measurement.",
      "content": "Write down your hip measurement. Now that you've figured out what your hip measurement is, write it down so you can save it for later. You'll also need other measurements to make clothing, such as your bust , hip, thighs, waist , and inseam , depending on what you're making. [12] X Research source Like your hips, you measure your thigh at the thickest part of your leg. The inseam is the inside of your leg from your crotch to where you want your pants to fall. If you have a pair of pants that are the length, you can measure the inseam on them instead of your body."
    },
    {
      "title": "Add a few inches when making clothing.",
      "content": "Add a few inches when making clothing . When you make clothing, you don't make it to your exact measurements because then it would be skin-tight, which would mean it would be difficult to move. Therefore, you must add a few inches to make it more wearable. You add inches for two reasons. One, as already stated, is to make the clothing more wearable. However, you might also add inches to create a design. For instance, if you want a really flowing, poofy skirt, you might add more inches at the hip than for an a-line skirt. How much the cloth gives also affects how many inches you add. That is, if it is especially stretchy, you probably don't need to add as many inches. Most patterns will help you determine how many inches to add. However, if you are doing it yourself, you should add 2 to 4 inches (5.1 to 10 cm), depending on how tight or loose you want your clothing. Also, if you're a bit curvier, you may want to add more inches to allow for better movement."
    }
  ]
}