{
  "url": "https://www.wikihow.com/Measure-for-a-Lazy-Susan",
  "title": "A Fast & Easy Guide to Choosing and Measuring for a Lazy Susan",
  "steps": [
    {
      "title": "Choose a round lazy susan for any cabinet without a blind corner.",
      "content": "Choose a round lazy susan for any cabinet without a blind corner. They’re best for straight cabinets and corner cabinets that are easily accessible. However, round lazy susan’s are great for accessing blind corners. Round lazy susans can be single-tiered or multi-tiered, depending on which style you choose."
    },
    {
      "title": "Use a tape measure to get the cabinet’s width from left to right.",
      "content": "Use a tape measure to get the cabinet’s width from left to right. Measure inside the cabinet to see how much space you have for a lazy susan. Position your tape at the center of the left side, then stretch it over to the center of the right side. Hold the tape taut so you’re getting an accurate measurement. [1] X Research source Write down your measurements so you can keep track of them."
    },
    {
      "title": "Measure the cabinet’s depth from back to front.",
      "content": "Measure the cabinet’s depth from back to front. Position your measuring tape at the center of the back of the cabinet. Then, stretch the tape toward the front of the cabinet. Take the measurement at the inside of the door frame. [2] X Research source"
    },
    {
      "title": "Subtract 2 in (5.1 cm) from the shorter of the two measurements.",
      "content": "Subtract 2 in (5.1 cm) from the shorter of the two measurements. This will give you the maximum diameter for your lazy susan since it’s the largest size that will fit inside your cabinet. If you’re buying a lazy susan, check the box to find the measurement that’s right for you. If you’re making a lazy susan , measure out a circle with a diameter that’s no larger than this measurement. Your lazy susan needs space on either side to spin freely. You don’t want your lazy susan bumping against the inside of your cabinet. Some lazy susans are only sold in even diameters. If your maximum diameter is an odd number, round down one number."
    },
    {
      "title": "Measure the height if you’re installing a multi-tier lazy susan.",
      "content": "Measure the height if you’re installing a multi-tier lazy susan. With this model, you’ll install a center bar to hold the tiers. To find out how long your center bar should be, measure from the center of the top of the cabinet to the center of the bottom of the cabinet. Lazy susans sometimes come with adjustable bars, but you want to make sure that it expands to be big enough or contracts to be small enough to fit your cabinet."
    },
    {
      "title": "Select a D-shape lazy susan for a straight or 45-degree cabinet.",
      "content": "Select a D-shape lazy susan for a straight or 45-degree cabinet. D-shape lazy susans are almost a full circle, but they have a flat side that makes them look like a fat letter “D.” They’re perfect for 45-degree cabinets, which have a hexagonal shape. You can also use them in a standard cabinet. Use a D-shape lazy susan if you want more clearance for your cabinet door to close. The flat side of the lazy susan will be inset further into the cabinet."
    },
    {
      "title": "Use a measuring tape to measure the width from left to right.",
      "content": "Use a measuring tape to measure the width from left to right. Hold the measuring tape in the center of the left wall, then stretch it to the center of the right wall. Pull the tape taut to get the correct measurement. Write down your measurements to keep track of them."
    },
    {
      "title": "Measure the depth from the back to the inside of the door frame.",
      "content": "Measure the depth from the back to the inside of the door frame. Hold a measuring tape against the back wall, then stretch it to the inside of the front wall. Make sure the measuring tape is taut so you get the correct measurement. Only measure the inside of the cabinet, since that’s where your lazy susan will go."
    },
    {
      "title": "Deduct 2 in (5.1 cm) from the shorter of the two measurements.",
      "content": "Deduct 2 in (5.1 cm) from the shorter of the two measurements. This calculation is the maximum diameter for your lazy susan because it’s the largest size that will fit inside your cabinet. Focus on the smaller measurement so your lazy susan will have clearance on that side. Once you have this measurement, buy a lazy susan that’s no bigger than the maximum diameter that will fit inside your cabinet. Lazy susans have their diameter printed on the box so you can pick the one that fits your cabinet."
    },
    {
      "title": "Measure the height of the cabinet for a tiered lazy susan.",
      "content": "Measure the height of the cabinet for a tiered lazy susan. Since tiered lazy susans have a center bar, you’ll need to take the center height to make sure your kit has a bar that’ll fit. Simply hold your tape measure at the center of the top of the cabinet and stretch it down to the center of the bottom of the cabinet. Use this measurement to help you choose the right lazy susan. Some lazy susan kits have adjustable bars, but you still want to make sure that the bar will fit your cabinet."
    },
    {
      "title": "Pick a kidney-shaped lazy susan for corner cabinets with a folding door.",
      "content": "Pick a kidney-shaped lazy susan for corner cabinets with a folding door. The center of the door won’t be attached to anything, so you can fold it open like an accordion. Installing a lazy susan in this cabinet will help you access the blind corner so you can maximize your cabinet space. With this type of cabinet, you can also use a pie-cut lazy susan."
    },
    {
      "title": "Use a measuring tape to measure the width of the cabinet.",
      "content": "Use a measuring tape to measure the width of the cabinet. Start your tape in the center of the left wall. Then, stretch the tape across the entire corner cabinet to the center of the right wall. Hold the tape taut to get the correct measurement. Jot down the measurement so you can easily keep track of it."
    },
    {
      "title": "Measure diagonally from the back to the opposite corner.",
      "content": "Measure diagonally from the back to the opposite corner. With a corner cabinet, you’ll measure the depth of the cabinet twice, since it can differ. To get the first depth measurement, hold your tape measure against the back wall of the cabinet. Then, stretch the tape diagonally to the corner of the inside of the door frame that’s furthest away from that side of the back wall."
    },
    {
      "title": "Measure the other back wall to the opposite corner.",
      "content": "Measure the other back wall to the opposite corner. Move the measuring tape to the other side of the back wall. Then, stretch the tape diagonally to the inside corner of the door frame. Like before, pull the measuring tape taut to get the correct measurement."
    },
    {
      "title": "Subtract 2 to 4 in (5.1 to 10.2 cm) from the shortest of the measurements.",
      "content": "Subtract 2 to 4 in (5.1 to 10.2 cm) from the shortest of the measurements. This is the maximum diameter your lazy susan can have. This quick calculation will give you the maximum diameter that’ll fit in your corner cabinet. When you’re shopping for a lazy susan, look for the printed diameters on the boxes to find the right one for you. [3] X Research source Since lazy susans are typically sold in even numbers only, you’ll need to round down 1 digit if your maximum diameter is an odd number."
    },
    {
      "title": "Measure the height of the cabinet for a multi-tiered lazy susan.",
      "content": "Measure the height of the cabinet for a multi-tiered lazy susan. With a multi-tiered lazy susan, you’ll need to install a bar to hold them in place. In that case, measure the center of the top to the center of the bottom of your cabinet. Make sure the lazy susan kit you purchase has a center bar that will fit in your cabinet."
    },
    {
      "title": "Opt for a pie-cut lazy susan for a corner cabinet with an attached door.",
      "content": "Opt for a pie-cut lazy susan for a corner cabinet with an attached door. With the pie-cut shape, the door to the cabinet will rotate with the lazy susan as you turn it. Instead of pulling the door open, it’ll slide into the cabinet as you turn the lazy susan and eventually emerge on the other side. Pick this type of lazy susan if you want to put in a little extra work up front to make it much easier to see everything in your cabinet later on. Pie-cut- and kidney-shaped lazy susans are almost the exact same shape. However, they fit different types of doors."
    },
    {
      "title": "Use a measuring tape to measure the width from left to right.",
      "content": "Use a measuring tape to measure the width from left to right. Hold the measuring tape against the center of the left wall and stretch it across to the right wall. Hold the tape taut, then take the measurement. Write down the measurement so you can keep track of it."
    },
    {
      "title": "Measure from one back wall to the inside of the door frame.",
      "content": "Measure from one back wall to the inside of the door frame. Like with a kidney-shaped lazy susan, you’ll need to take two depth measurements in your corner cabinet. For the first measurement, hold the measuring tape against the back wall and stretch it to just inside the door frame. [4] X Research source"
    },
    {
      "title": "Measure from the other back wall to the parallel side.",
      "content": "Measure from the other back wall to the parallel side. Move your measuring tape to the other back wall. Then, measure from the back to just inside the opposite door frame. Pull the tape taut to get the perfect measurement. [5] X Research source"
    },
    {
      "title": "Deduct 2 to 4 in (5.1 to 10.2 cm) from the shorter of the measurements.",
      "content": "Deduct 2 to 4 in (5.1 to 10.2 cm) from the shorter of the measurements. This will give you the maximum diameter for your lazy susan. When you go shopping for your lazy susan, pick one that has a diameter no larger than your calculated maximum diameter. If the diameter is odd, you’ll likely need to round down 1 number since lazy susans are typically sold in even numbers. [6] X Research source You don’t need a center bar for a pie-cut lazy susan because it’ll attach to the cabinet door. The cabinet door is what will rotate so you can access your things."
    },
    {
      "title": "Get a half-round lazy susan to access a blind corner.",
      "content": "Get a half-round lazy susan to access a blind corner. They typically have pivots that connect them to the door so that the lazy susan can easily slide in and out of the cabinet. They’re perfect for cabinets that are narrow or have blind corners, especially bottom cabinets. When you open the cabinet door, you’ll see everything in your lazy susan."
    },
    {
      "title": "Use a measuring tape to measure the width of the door frame.",
      "content": "Use a measuring tape to measure the width of the door frame. Start the measuring tape on the left edge of the door frame, then stretch it to the right edge of the frame. Pull the tape taut to get the correct measurement. You only need this one measurement for a half-round lazy susan."
    },
    {
      "title": "Buy a lazy susan with a diameter and width smaller than the door frame.",
      "content": "Buy a lazy susan with a diameter and width smaller than the door frame. A half round lazy susan needs to swing in and out of the cabinet. Because of this, it needs to be smaller than the cabinet opening on all sides. Check the measurements on the box to choose the right half round lazy susan for your kitchen. The lazy susan will come all the way out of the cabinet opening when you need to access the items in your cabinet."
    }
  ]
}