{
  "url": "https://www.wikihow.com/Protect-Estuaries",
  "title": "How to Protect Estuaries",
  "steps": [
    {
      "title": "Conserve water in your home.",
      "content": "Conserve water in your home. [1] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Making simple lifestyle changes to save water not only helps you save money, but it also diverts less water from nearby estuaries. This leaves more water for the fish, plants, and wildlife that rely on it to live! Fix any leaks as soon as possible. Common culprits are running toilets, faucet drips, home water treatment units, and outdoor sprinkler systems. Replace your old toilets, showerheads, and washers with new, water-saving products. Look for products with a low water factor, as this means that they use less water. [2] X Trustworthy Source Energy Star Program run by the U.S. Environmental Protection Agency and Department of Energy focused on educating consumers about energy efficiency Go to source Install a rain barrel in your garden. Rain barrels are large barrels attached to downspouts in your yard. They collect rainwater that you can use for gardening, both saving you water and reducing runoff that would go into storm drains."
    },
    {
      "title": "Dispose of chemicals properly.",
      "content": "Dispose of chemicals properly. Deposit waste from disinfectants, beauty products, auto fluids, medicine, paint, and lawn care products at your local household hazardous waste facility. Any substance that goes down your drain will eventually flow into a body of water, which affects all the marine life in that body of water. Never flush them down a toilet, pour them in a sink, or dump them in a storm drain. This would cause hazardous products to flow through sewage treatment plants and into coastal bodies of water. [3] X Research source"
    },
    {
      "title": "Repair any automotive oil leaks as quickly as possible.",
      "content": "Repair any automotive oil leaks as quickly as possible. If you notice that your car is leaking oil, try to determine the source of the leak and get it fixed by a mechanic as soon as possible. The goal is to minimize the amount of oil that flows into nearby storm drains. [4] X Research source If you figure out where the leak is coming from, you can place a pan or bowl underneath it to collect the oil in the meantime before you take it in to get it fixed. Just remember to remove the bowl or pan before you drive away."
    },
    {
      "title": "Commit to walk, carpool, or bike instead of driving.",
      "content": "Commit to walk, carpool, or bike instead of driving. Look for alternatives to driving alone every day. Cars lead to air pollution that increases the amount of nitrogen in the air. High levels of nitrogen can produce algae blooms in estuaries that deplete the water of oxygen and make it cloudy, which is unhealthy for the animals living there."
    },
    {
      "title": "Use non-toxic pesticides.",
      "content": "Use non-toxic pesticides. Rather than using harsh chemicals to get rid of pests in your garden and home, use natural pesticide mixtures. Mild dishwashing soap mixed with water or cooking oil is just one of a few different alternatives you have."
    },
    {
      "title": "Pick up animal feces.",
      "content": "Pick up animal feces. If you own an animal that defecates outside, do your best to pick up their waste before it washes into a storm drain and flows into an estuary. Dog feces in particular contain coliform bacteria and disease-causing organisms like salmonella, roundworms, and giardia. These organisms are unhealthy and should not be funneled into estuaries. [5] X Research source"
    },
    {
      "title": "Pump your septic system every three years.",
      "content": "Pump your septic system every three years. If your house has a septic tank, hire a professional waste removal company to pump your tank and remove the solid waste buildup. If you don’t regularly pump your septic system, it can lead to messy, smelly overflow that pollutes groundwater and leads to contaminated runoff in estuaries. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The rate of waste buildup in septic tanks can vary based on the amount of people living in a certain household. Before the waste removal company starts pumping, ask them to measure the thickness of the scum and sludge layers, which make up the waste buildup at the top and the bottom of the tank. This can help you estimate exactly how often you need to pump your tank. [7] X Research source The tank should be pumped when the sludge and the scum layers make up between 25-33% of the liquid depth of the tank. [8] X Research source Don’t flush paper, plastics, cigarette filters, diapers, or kitchen scraps down your toilet, as these items can clog your septic tank. Start a compost pile for kitchen scraps instead!"
    },
    {
      "title": "Don’t dump your waste overboard.",
      "content": "Don’t dump your waste overboard. Keep a bag or can onboard your boat and keep all your trash in there until it can be disposed of properly back on land. [9] X Research source If your boat has a restroom onboard, be sure to dump your sewage at a designated onshore dump station or pump it out at a pump out service station. [10] X Research source"
    },
    {
      "title": "Slow your boat when around sensitive habitats.",
      "content": "Slow your boat when around sensitive habitats. Observe any designated “no wake zones,” which typically include marshes, mudflats, and any vegetated shallows. Waves from boats can damage shorelines, increase erosion, and uproot native plant species, so slowing down is key."
    },
    {
      "title": "Fish respectfully.",
      "content": "Fish respectfully. Observe “catch and release” practices to help keep more fish alive — especially in estuaries that are home to endangered or threatened fish species. [11] X Research source Estuaries often serve as important breeding grounds for several fish species. For catch-and-release fishing, avoid the use of bait and instead use artificial hooks or flies. These hooks generally catch the fish on the lip, which makes it easier to quickly remove the hook. [12] X Trustworthy Source US National Park Service Agency responsible for the maintenance and promotion of national parks and monuments Go to source"
    },
    {
      "title": "Wash and drain your boat to prevent the spread of invasive species.",
      "content": "Wash and drain your boat to prevent the spread of invasive species. Before moving your boat from one body of water to another, inspect and hose down your boat’s hull to remove any animal hitchhikers. Drain any bilge water as well. This prevents the spread of invasive species, which are species that are brought to new habitats by human activity. Invasive species can disrupt estuary environments by changing water circulation and sediment patterns. Their presence can also lead to declines in key native species. [13] X Research source"
    },
    {
      "title": "Connect with your local watershed group.",
      "content": "Connect with your local watershed group. If you live near an estuary, there are likely several government and nonprofit organizations looking for volunteers with a range of skills. You could look into doing something more hands-on, like clearing brush or monitoring water quality in estuaries, or something more administrative, like staffing a front desk or planning a community event. [14] X Research source There are opportunities for nearly every skill!"
    },
    {
      "title": "Plant more native trees.",
      "content": "Plant more native trees. Sedimentation, the rate at which sediment deposits in bodies of water as a result of erosion, is a major problem for estuaries today. You can slow sedimentation by planting native vegetation — meaning plants that grow naturally in a place and were not introduced by human activity — alongside rivers and streams that flow into estuaries. [15] X Research source"
    },
    {
      "title": "Participate in a shoreline cleanup or habitat restoration project.",
      "content": "Participate in a shoreline cleanup or habitat restoration project. Look for a local cleanup or project to participate in, or start your own! Removing trash from your local shorelines (of rivers, estuaries, or beaches) is a great hands-on way to make our waters healthier.. [16] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Planting local plant species in estuaries and removing invasive plants is also an easy way to have a quick, tangible impact."
    },
    {
      "title": "Report any threats to estuaries that you see.",
      "content": "Report any threats to estuaries that you see. Reach out to your local city council, political officials, or environmental protection organizations if you witness any activity that could pose a threat to an estuary, such as illegal dumping, unusual/new species of plants or animals, pollution spills, or people removing estuarine plants without a permit. [17] X Research source"
    }
  ]
}