{
  "url": "https://www.wikihow.com/Remove-Wrinkles-from-Leather-Jackets",
  "title": "How to Remove Wrinkles from Leather Jackets",
  "steps": [
    {
      "title": "Place the jacket on a hanger.",
      "content": "Place the jacket on a hanger. Make sure your coat hanger is durable and can hold your jacket. Extended time on cheap coat hanger can actually cause wrinkles. Place the coat on a strong hanger for the purpose of steaming. For proper storage , use a hanger with wide molded shoulders. This will keep the shoulders intact. [1] X Research source"
    },
    {
      "title": "Turn on your shower.",
      "content": "Turn on your shower. Allow your water to get fairly hot before activating the shower. Plan to take a shower so you don’t waste water while steaming your leather jacket. The steaming process will take 10 to 15 minutes. [2] X Research source"
    },
    {
      "title": "Hang the coat and shower.",
      "content": "Hang the coat and shower. Find a spot in your washroom that will allow the coat to hang from, but won’t cause the coat to get wet. Once your coat is hanging securely, take a hot shower. [3] X Expert Source Susan Stocker Cleaning Guru Expert Interview. 8 November 2019. Take your time in the shower and make sure steam builds up in your washroom. This is a cheap way of steaming your jacket without having to bring the coat into a dry cleaner. A safe spot to hang you coat is on the back of the washroom's door. The back of the door usually has hooks for clothing and towels. If your washroom doesn't have hooks, you could also try hanging it from the lip of the sink. Attempt to place the jacket in an area where it won't get wet."
    },
    {
      "title": "Wear the jacket.",
      "content": "Wear the jacket. After letting the coat steam for about 15 minutes, you should wear the coat. Get dressed and plan to wear your leather jacket for the day. This will cause the jacket to settle to your body and prevent further wrinkles. [4] X Research source"
    },
    {
      "title": "Set your iron.",
      "content": "Set your iron. It is possible to press your jacket with an iron as long as your iron can be turned down to its lowest setting. If your iron cannot turn down to a low setting, then you shouldn’t follow this technique. Consider purchasing an iron with a wider range in temperatures. This will allow you to clean and maintenance your clothing more at home."
    },
    {
      "title": "Prepare your jacket.",
      "content": "Prepare your jacket. Set your jacket on an ironing board. Place sections at a time of the coat on the ironing board to smooth out any wrinkles. You can alternatively use a hard surface. You have a less likely chance of damaging your floors or tables with a low-heat iron. [5] X Research source Place a thin layer of cotton over the leather jacket. This will offer your leather jacket more protection from being over-heated."
    },
    {
      "title": "Iron the jacket.",
      "content": "Iron the jacket. Do not wet the jacket like you might to other fabrics while ironing. Press the jacket in small amounts at a time. Move the cotton barrier as you move the jacket to avoid over-heating the cotton garment. Only use the iron on your jacket in small but quick increments. This will avoid effecting the leather with too much heat. This process should take a long time if done correctly. Use patience and resist the urge to use high heat to quicken your time. [6] X Research source If you are concerned about ruining your jacket, test a small amount of the jacket before ironing the whole jacket."
    },
    {
      "title": "Lay out the jacket.",
      "content": "Lay out the jacket. Place the jacket on a table or hard floor. You should lay it out on a hard, flat surface opposed to tile or a bumpy surface. Straighten the arms and make sure there isn’t any folds in the jacket. Use your hands to stretch out the wrinkled parts of the jacket. Try to determine which areas need more attention than others."
    },
    {
      "title": "Place heavy books on the jacket.",
      "content": "Place heavy books on the jacket. Make sure when you put a book down, the jacket underneath is slightly stretched. This will flatten it down. Putting heavy books on it is a bit like standing on a grape; it squashes it. [7] X Research source It could help to have a friend help you do this process. Have the friend stretch out a section of the jacket as you place a book on it. Old, hardcover textbooks work the best for this technique. Other good examples are large dictionaries or collected works of a major author."
    },
    {
      "title": "Leave it flatten.",
      "content": "Leave it flatten. Leave the jacket under the books to straighten out over night. The jacket will need plenty of time to flatten. If the wrinkles are not out, leave it for a bit longer. Check if the books have improved the condition of the jacket. You could also increase the amount of books over the jacket. You may find that this technique works well in combination with another method."
    },
    {
      "title": "Wear your jacket.",
      "content": "Wear your jacket. This will give the jacket its shape back. Now that you've squished the jacket and the wrinkles are out, you should wear it for a day. Spend about 30 seconds moving your arm across your body and then swinging them back and forth. [8] X Research source"
    }
  ]
}