{
  "url": "https://www.wikihow.com/Make-a-Tuna-Sandwich",
  "title": "How to Make a Tuna Sandwich",
  "steps": [
    {
      "title": "Drain and rinse the tuna.",
      "content": "Drain and rinse the tuna. How many times you drain and rinse is up to you, but draining and rinsing it at least once is recommended. Use a can opener to open the can, but don’t remove the lid yet. Holding the lid in place, flip the can over and hold it over the sink to drain the liquid. Pull off the top of the can, and be careful not to cut yourself. Take the tuna out of the can and place it in a strainer or colander. Rinse the tuna thoroughly with water, then press the water out using a clean hand or a paper towel."
    },
    {
      "title": "Combine the ingredients.",
      "content": "Combine the ingredients. Place the rinsed tuna in a medium-sized bowl. Add the celery, onion, mayonnaise, lemon juice, and salt and pepper. Mix the ingredients to combine. Be sure to thoroughly combine the ingredients so all of the elements are distributed evenly."
    },
    {
      "title": "Assemble the sandwiches.",
      "content": "Assemble the sandwiches. Distribute the tuna mix evenly across 4 slices of bread and top each with another slice of bread to make 4 sandwiches. You have the option of toasting the bread before spreading the tuna mix over it for a warmer, crunchier version. You can also substitute a roll or a croissant in place of the sandwich bread for taste and texture variation. Or you can avoid bread altogether and use the tuna mix over a salad for a lower-carb alternative."
    },
    {
      "title": "Drain and rinse the tuna.",
      "content": "Drain and rinse the tuna. How many times you drain and rinse is up to your discretion, but draining and rinsing at least once is recommended. Use a can opener to open the can, initially leaving the top in place. Hold on to the top and flip the can over and hold it over the sink to drain the liquid. Pull off the top of the can, being careful not to cut yourself. Take the tuna out of the can and place it in a strainer or colander. Rinse the tuna thoroughly with water, then press the water out using a clean hand or a paper towel."
    },
    {
      "title": "Combine the ingredients.",
      "content": "Combine the ingredients. Place the tuna in a medium-sized bowl. Add the celery, onion, mayonnaise, and sweet relish. Stir to combine. Instead of yellow onion, you can substitute in the same amount of green onion. In place of relish, you can substitute in 1/4 cup chopped dill pickles. Be sure to thoroughly combine the ingredients so all of the elements are distributed evenly."
    },
    {
      "title": "Assemble the toppings.",
      "content": "Assemble the toppings. Spread about half the tuna mix onto two slices of bread, then top each with your accoutrements of choice and mustard, if desired. You can easily convert this into a tuna BLT at this point by adding 2-3 strips of cooked bacon."
    },
    {
      "title": "Assemble the sandwiches.",
      "content": "Assemble the sandwiches. After adding the fixings of your choice, top each sandwich with another slice of bread. At this point you also have the option of toasting the bread before spreading the tuna mix over it for a warmer, crunchier alternative. You can also substitute a roll or a croissant in place of the sandwich bread for varying taste and texture. You can also avoid bread altogether and use the tuna mix over a salad for a lower-carb choice."
    },
    {
      "title": "Drain and rinse the tuna.",
      "content": "Drain and rinse the tuna. The number of times you drain and rinse it is up to you, but draining and rinsing it at least once is recommended. Use a can opener to open the can, but don’t remove the lid. Holding the lid in place, flip the can over and hold it over the sink until all the liquid has drained. Remove the top of the can, and be careful not to cut yourself. Take the tuna out of the can and place it in a strainer or colander. Rinse the tuna thoroughly with water, then press the water out using a clean hand or a paper towel."
    },
    {
      "title": "Combine the ingredients.",
      "content": "Combine the ingredients. In a medium bowl, mix together tuna, eggs, celery, and mayonnaise. Stir to combine. Be sure to mix thoroughly so that all of the ingredients are evenly distributed. Add salt and pepper to taste."
    },
    {
      "title": "Assemble the sandwiches.",
      "content": "Assemble the sandwiches. Divide the mixture evenly between two slices of bread, then top each with the remaining slices of bread to make two sandwiches. For a crunchy, warm variation, toast the slices of bread before assembling the sandwiches. You can also substitute a roll or a croissant in place of the sandwich bread for taste and texture variation. Or you can avoid bread altogether and use the tuna mix over a salad for a lower-carb choice."
    },
    {
      "title": "Pre-heat the broiler.",
      "content": "Pre-heat the broiler. It’s important to let the broiler warm up for several minutes before you toast the bread, otherwise it may cook unevenly. You can find the “broil” setting on the far end of the oven-temperature dial on most ovens."
    },
    {
      "title": "Drain and rinse the tuna.",
      "content": "Drain and rinse the tuna. The number of times you drain and rinse it is up to you, but draining and rinsing it at least once is recommended. Use a can opener to open the can, but don’t remove the lid. Holding the lid in place, flip the can over and hold it over the sink until all the liquid has drained. Remove the top of the can, and be careful not to cut yourself. Take the tuna out of the can and place it in a strainer or colander. Rinse the tuna thoroughly with water, then press the water out using a clean hand or a paper towel."
    },
    {
      "title": "Combine the ingredients.",
      "content": "Combine the ingredients. In a medium bowl, mix together tuna, shallot, mayonnaise, lemon juice, parsley, salt, hot sauce, and pepper. Stir to combine. Stir thoroughly so that all ingredients are evenly distributed."
    },
    {
      "title": "Assemble the sandwiches.",
      "content": "Assemble the sandwiches. Spread 1/4 of the tuna mix onto each of 4 bread slices. Top with cheese and tomato. You can substitute in any variety of sandwich bread, or you may use a roll or croissant in the place of sandwich bread."
    },
    {
      "title": "Broil the sandwiches.",
      "content": "Broil the sandwiches. Place the slices of bread and tuna mix onto a baking sheet and broil in the oven for 3 to 5 minutes. or until cheese is melted. Remove from the oven, turn off the broiler, and serve."
    },
    {
      "title": "Pre-heat the broiler.",
      "content": "Pre-heat the broiler. You need to let the broiler warm up for several minutes before you toast the bread, otherwise it may not cook evenly. You can find the “broil” setting on the far end of the oven-temperature dial on most ovens."
    },
    {
      "title": "Drain and rinse the tuna.",
      "content": "Drain and rinse the tuna. How many times you drain and rinse is up to you, but draining and rinsing it at least once is recommended. Use a can opener to open the can, but don’t remove the lid yet. Holding the lid in place, flip the can over and hold it over the sink to drain the liquid. Pull off the top of the can, and be careful not to cut yourself. Take the tuna out of the can and place it in a strainer or colander. Rinse the tuna thoroughly with water, then press the water out using a clean hand or a paper towel."
    },
    {
      "title": "Combine the ingredients.",
      "content": "Combine the ingredients. Using a medium-sized bowl. combine the tuna, mayonnaise, lemon juice (if using), celery, onion, parsley, basil (if using), cilantro (if using), and vinegar. Stir to combine. Add salt and pepper to taste. Be sure to thoroughly combine all of the ingredients so that they’re distributed evenly throughout the mix."
    },
    {
      "title": "Prepare the bread.",
      "content": "Prepare the bread. Place the bread on a baking sheet. Broil in the oven for 1 minute or until the bread is toasted. Be careful not to burn the bread; don’t broil it for too long. Remove from heat but leave the broiler on."
    },
    {
      "title": "Assemble the sandwiches.",
      "content": "Assemble the sandwiches. Spread the tuna mix over 4 slices of the toasted bread, or, if using pita, place the mix inside each of the pita pockets. Place one slice of cheese or a layer of Feta over the tuna spread. Place a tomato slice on top of the cheese slice, then place a second slice or layer of cheese over the tomato."
    },
    {
      "title": "Broil again.",
      "content": "Broil again. Place the assembled sandwiches on a baking sheet and broil again for 3 to 5 minutes or until the cheese is melted. Keep a close eye on the sandwiches to ensure they don’t char or burn. Remove from heat, turn off the broiler, and serve."
    },
    {
      "title": "Pre-heat the broiler.",
      "content": "Pre-heat the broiler. It’s important to let the broiler warm up for several minutes before you toast the bread, otherwise you may have an unevenly toasted sandwich. You can find the “broil” setting on the far end of the oven-temperature dial on most ovens."
    },
    {
      "title": "Drain and rinse the tuna.",
      "content": "Drain and rinse the tuna. The number of times you drain and rinse it is up to you, but draining and rinsing it at least once is recommended. Use a can opener to open the can, but don’t remove the lid. Holding the lid in place, flip the can over and hold it over the sink until all the liquid has drained. Remove the top of the can, and be careful not to cut yourself. Take the tuna out of the can and place it in a strainer or colander. Rinse the tuna thoroughly with water, then press the water out using a clean hand or a paper towel."
    },
    {
      "title": "Combine the ingredients.",
      "content": "Combine the ingredients. In a medium bowl, mix together tuna, lemon juice, tomato, celery, green onion, and sour cream. Stir to combine. Be sure to mix thoroughly so that all of the ingredients are evenly distributed. Add salt and pepper to taste."
    },
    {
      "title": "Prepare the bread.",
      "content": "Prepare the bread. Scoop out the top of each roll, leaving a hollowed out portion so that the rolls resemble small boats. Line the bottom of the boats with shredded lettuce."
    },
    {
      "title": "Assemble the sandwiches.",
      "content": "Assemble the sandwiches. Fill each boat with 1/4 of the tuna mixture. Top with tomato, bacon (if using), and cheese."
    },
    {
      "title": "Heat the sandwiches.",
      "content": "Heat the sandwiches. Place each of the rolls on a cookie sheet. Broil for 3 to 5 minutes, or until cheese is melted. Remove from heat, turn off the broiler, and serve."
    },
    {
      "title": "Drain and rinse the tuna.",
      "content": "Drain and rinse the tuna. You may choose how many times you prefer to rinse the tuna, but draining and rinsing it at least once is recommended. Use a can opener to open the can, but don’t remove the lid yet. Holding the lid in place, flip the can over and hold it over the sink to drain the liquid. Pull off the top of the can, being cautious not to cut yourself. Take the tuna out of the can and place it in a strainer or colander. Rinse the tuna thoroughly with water, then press the water out using a clean hand or a paper towel."
    },
    {
      "title": "Combine the ingredients.",
      "content": "Combine the ingredients. In a medium bowl, mash the avocado together with the greek yogurt until smooth. Stir in the tuna, onion, relish, celery, salt and pepper. lemon if using, and cayenne pepper if using. Stir until all ingredients are well-combined."
    },
    {
      "title": "Assemble the sandwiches.",
      "content": "Assemble the sandwiches. Distribute the tuna mix evenly across 4 slices of bread and top each with another slice of bread to make 4 sandwiches. For a warm, crunchy variation, toast the bread before spreading the tuna mix on. You can also substitute a roll or a croissant in place of the sandwich bread. Or you can skip the bread and use the tuna mix over a salad for a lower-carb version."
    }
  ]
}