{
  "url": "https://www.wikihow.com/Sand-a-Car-for-Repainting",
  "title": "How to Sand a Car for Repainting",
  "steps": [
    {
      "title": "Yes, if your existing paint is solid and uncracked.",
      "content": "Yes, if your existing paint is solid and uncracked. You can go ahead and use a primer coat to cover your existing paint before adding your new color. The new paint will go on shiny and smooth, and you don’t have to worry about sanding anything down. [1] X Research source This includes paint in the doorway and crevices of the car. Unfortunately, you can't paint over existing paint that is cracked without sanding first. If any part of your paint is cracked, you’ll have to sand it off before doing a primer coat. [2] X Research source"
    },
    {
      "title": "Wear a mask, gloves, and goggles for safety.",
      "content": "Wear a mask, gloves, and goggles for safety. Sanding creates a lot of fine dust particles that can irritate your lungs, eyes, and skin. Before you start sanding, put on your protective equipment and keep it on until you’re finished. If you’re worried about getting particles in your car or your home, wear overalls over your clothes, then take them off and wash them."
    },
    {
      "title": "Move your power sander in small, smooth and circular motions.",
      "content": "Move your power sander in small, smooth and circular motions. Attach your sandpaper to the power sander and turn it on. Press it up against your car as hard as you can, and move it in small circles across the entire panel. [3] X Research source Do your best to make even motions and to avoid staying in a certain pattern too long, or you might end up staying in a rut."
    },
    {
      "title": "Work one panel at a time for an even sanding.",
      "content": "Work one panel at a time for an even sanding. You can separate the car into different panels: the doors, the roof, the hood, the trunk, the bumper, and the fender. In total, each panel will probably take about 2 hours to sand down completely. [4] X Research source It might sound like a long time, but it’s totally worth it for a new, smooth paint job."
    },
    {
      "title": "Wipe your car off with a damp cloth before priming and painting.",
      "content": "Wipe your car off with a damp cloth before priming and painting. Sanding generates a lot of dust, which can get stuck in automotive paint and primer. Before you move on, use a damp cloth to wipe down the outside of your car. [5] X Research source If you’re super worried about dust, use paint thinners to wipe down the outside of your car. Wait for the thinners to evaporate before you move onto priming."
    },
    {
      "title": "Use a power sander for the majority of your car.",
      "content": "Use a power sander for the majority of your car. A power sander will be way easier to use than hand sanding your entire car. Use this tool on the large, flat surfaces of your vehicle, like the doors, roof, trunk, and hood. [6] X Research source You can buy a power sander from most hardware stores for around $40."
    },
    {
      "title": "Hand sand small cracks and crevices in your car.",
      "content": "Hand sand small cracks and crevices in your car. The corners of doors, underside of the body, and the small cracks in between door handles can be tough to reach with a power sander. Keep a few sheets of loose sandpaper around so you can sand down these areas by hand. [7] X Research source To make hand sanding easier, staple a piece of sandpaper to a block of wood so it’s easier to hold onto."
    },
    {
      "title": "Start with a 180-grit sandpaper.",
      "content": "Start with a 180-grit sandpaper. This will roughly take off the outermost layer of paint and primer. You might notice that it looks a little scratched and rough at this point, but that’s okay. [8] X Research source"
    },
    {
      "title": "Go over the paint again with 300-grit sandpaper.",
      "content": "Go over the paint again with 300-grit sandpaper. This sandpaper is a little smoother, and it will help remove some of the scratches that the previous sandpaper left behind. Your car won’t look perfect at this point, but that’s all right. [9] X Research source"
    },
    {
      "title": "Finish with 1200- to 2000-grit wet-to-dry sandpaper.",
      "content": "Finish with 1200- to 2000-grit wet-to-dry sandpaper. This will give your car the silky smooth finish that it needs for your new coat of paint. Soak your wet-to-dry sandpaper in water overnight, then use it like you normally would over your entire car. [10] X Research source It’s super important to soak your wet-to-dry sandpaper before you use it. Using wet-to-dry sandpaper while it’s dry can scratch your car. Using wet-to-dry sandpaper will give your car a smoother finish than typical sandpaper will."
    },
    {
      "title": "Sand down to the bare metal of the car.",
      "content": "Sand down to the bare metal of the car. Most experts recommend sanding until you’ve removed both the paint and the primer from the car. This can take a long time, but the new coat of paint will go on much smoother if you do. [11] X Research source Obviously, the kind of sand and the quantity of sanding will depend on what exactly do you want to do with the car. If you aren’t as worried about getting a smooth coat, you can sand down to the primer instead of the bare metal."
    },
    {
      "title": "Sand it down with 40- to 50-grit sandpaper to start.",
      "content": "Sand it down with 40- to 50-grit sandpaper to start. You can hand sand or use a power sander, depending on where the rust is. Use your sandpaper to strip off the rust and the surrounding paint until you can see bare metal poking through. [12] X Research source This method works well for surface rust, or rust that hasn’t penetrated all the way through the body of your car. If your car has holes in it from rust, take it to a professional."
    },
    {
      "title": "Add 2 layers of rust converter to the area before you paint.",
      "content": "Add 2 layers of rust converter to the area before you paint. Put on a pair of rubber gloves and use a brush or a sponge to apply a thin layer of rust converter where the rust used to be. Wait 15 to 30 minutes for the product to dry, then add a second layer. Wait for the second layer to dry all the way before you start painting your car. [13] X Research source Rust converters contain chemicals that react with the rust and convert it into a harmless compound that won’t hurt your car. You can find rust converters at most auto body shops."
    }
  ]
}