{
  "url": "https://www.wikihow.com/Play-Music-in-Discord",
  "title": "The Best Way to Listen to Music with or Without Friends on Discord",
  "steps": [
    {
      "title": "Click the Apps icon.",
      "content": "Click the Apps icon. It's a 2x2 grid of a tilted square, triangle, heptagon, and star that you can find next to the chat field in a DM, group message, or channel on any server. You can use apps to listen to music on your computer and mobile."
    },
    {
      "title": "Search for a \"music\" app.",
      "content": "Search for a \"music\" app. Type \"music\" in the search bar and press Go to see a list of music apps on Discord. The most popular music apps are Lofi, Rythm, and TuneIn Radio & Podcasts. [1] X Research source"
    },
    {
      "title": "Click or tap an app that you want to use and select Launch.",
      "content": "Click or tap an app that you want to use and select Launch . The app will load. You will still see the chat in the background of the music app, so you can listen to music without sacrificing your chatting ability. For some apps, like Lofi, you can tap various parts of the screen to adjust the sounds of background noise, like a running river, rainfall, and chirping birds. You can also change the volume using on-screen volume buttons to lower or increase the overall Lofi sounds. Others can click or tap Join in the chat channel or DM to listen along with you. You do not need to be in a voice chat to listen to music together. Click or tap Leave to close the app."
    },
    {
      "title": "Connect Spotify to Discord.",
      "content": "Connect Spotify to Discord. In order to play your Spotify playlist through a voice channel on Discord, you need to have the two services linked . To do this, follow these steps: Open Settings. Select Connections . Select the Spotify icon. Login with your Spotify account."
    },
    {
      "title": "Share your music with others.",
      "content": "Share your music with others. Once connected, you're ready to share your Spotify music on Discord. There are a few different ways that you can do this, but you first need to play a song/playlist on Spotify: Find a chat with someone, then right-click their name and select Invite to Listen Along . Create a jam from your playlist to get a link, join a voice chat, share your URL and others can listen along as well as suggest or remove songs. Join a voice chat and have others hover their mouse over the channel and select Play on Spotify ."
    },
    {
      "title": "Find and invite a music bot.",
      "content": "Find and invite a music bot. You can use sites like https://top.gg/tag/music to search for good music bots. FredBoat is a good music bot that plays music from Vimeo, Bandcamp, Soundcloud, Deezer, Dailymotion, or Twitch. Once you find the bot, you can invite it to a server where you have admin privileges. If you don't have admin privileges, using an app to play music might be a better option for you. Some servers that you join might already have music bots added; just ask an admin if one already exists that you can use."
    },
    {
      "title": "Enter the command to play a song.",
      "content": "Enter the command to play a song. The various bots have different commands, so what works for one may not work for another. For example, to start playing a song on FredBoat, type the command /play , then paste the URL of a song. The URL must be from Vimeo, Bandcamp, Soundcloud, Deezer, Dailymotion, or Twitch. However, if you don't have a URL, you can simply enter the song name and the bot will display all the songs matching that title. Many music bots also link to a website that details more commands that you can use."
    }
  ]
}