{
  "url": "https://www.wikihow.com/Remove-Giblets-from-a-Chicken",
  "title": "How to Remove Giblets from a Chicken",
  "steps": [
    {
      "title": "Thaw your chicken fully",
      "content": "Thaw your chicken fully if it was frozen. Make sure that your chicken is not frozen. You can do this by soaking your chicken in cold water for a couple of hours, or letting it sit in your fridge for a few days if you have time. Your chicken doesn’t need to get up to room temperature, but it should not be frozen before you start preparing it. Cold water thawing takes about 30 minutes per 1 pound (0.45 kg) of chicken, while fridge thawing takes about 5 hours per 1 pound (0.45 kg) of chicken. [1] X Research source"
    },
    {
      "title": "Take your fresh or thawed chicken out of its packaging.",
      "content": "Take your fresh or thawed chicken out of its packaging. If your chicken is store-bought, it will most likely be wrapped in plastic or some other protective layer. Remove the packaging fully and make sure there are no bits of it stuck to your chicken. Immediately throw the packaging away in the garbage. Use scissors or a knife to cut the packaging off if you are having trouble. [2] X Research source From this point on, you’ll be touching raw meat with your bare hands, so be aware of any surfaces that you touch or tools that you handle so you can wash them later. Wash your hands often with soap and warm water to avoid the spread of salmonella."
    },
    {
      "title": "Set your chicken on a sturdy and clean surface.",
      "content": "Set your chicken on a sturdy and clean surface. This is usually a cutting board on a countertop, but you can also use a table or other hard surface. Make sure that whatever you set your chicken on can be cleaned well after you use it. [3] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source It’s a good idea to reserve a cutting board just for working with raw chicken, so you don’t cross-contaminate other foods."
    },
    {
      "title": "Find the neck and posterior ends of your chicken.",
      "content": "Find the neck and posterior ends of your chicken. It is important to know which side of the chicken is which. The neck end of your chicken will be closer to its wings, while the posterior end will be closer to its back legs. [4] X Research source The hole on the neck end of the chicken is usually smaller than the hole on the posterior end."
    },
    {
      "title": "Reach into the neck of your chicken to feel for the giblets.",
      "content": "Reach into the neck of your chicken to feel for the giblets. Your giblets may be wrapped up in a plastic bag, tied together in a mesh bag, or sitting in the chicken itself. Try the neck opening of your chicken first to see if you can feel whether or not the giblets are accessible from this point. [5] X Research source"
    },
    {
      "title": "Reach into the posterior of your chicken to check for giblets there.",
      "content": "Reach into the posterior of your chicken to check for giblets there. If you couldn’t feel the giblets through the neck of the chicken, reach your hand into the posterior end of the chicken to feel for the giblets that way. [6] X Research source This opening on the chicken is bigger, so you might have an easier chance of finding them."
    },
    {
      "title": "Pull the giblets out of your chicken.",
      "content": "Pull the giblets out of your chicken. You can pull them through either opening of the chicken. If your giblets are in a bag, they should be easy to grab all at once. If the giblets are loose in the chicken, you may have to pull the pieces out one by one. You can set the giblets aside to use in a recipe later, like gravy or giblets and liver, or you can throw them away. Most chicken giblets include: 1 neck 1 gizzard 1 heart 2 kidneys 1 liver [7] X Research source"
    },
    {
      "title": "Check the posterior end for kidneys that might still be attached.",
      "content": "Check the posterior end for kidneys that might still be attached. If your giblets were loose inside of your chicken or if the giblet bag didn’t contain the kidneys, they might still be attached inside of your chicken. Look inside of the posterior of your chicken for dark red colored round objects near the opening. If the kidneys are still attached, you can pull them out with your hands."
    },
    {
      "title": "Prepare and season your chicken like you normally would.",
      "content": "Prepare and season your chicken like you normally would. Once you’ve removed the giblets, season and prepare the chicken according to the recipe you are following. You can roast chicken in the oven , put it in a slow cooker, or even fry it."
    }
  ]
}