{
  "url": "https://www.wikihow.com/Run-Away-from-an-Abusive-Home",
  "title": "How to Run Away from an Abusive Home",
  "steps": [
    {
      "title": "Ask yourself a few questions before you take action.",
      "content": "Ask yourself a few questions before you take action. Though you may feel like running away is the only answer, take time to think before you make the drastic decision to leave home. This step is useful for teenagers who are upset or angry at their parents but are not sure if their parent's actions justify leaving home. Consider the following questions: Am I in danger if I stay at home? This question is important, as it will help you determine if you need to take action to get out of the home. If you feel the abuse at home is out of control and dangerous to your safety, there may not be anything you can do to change the environment and it may be time to get out. How will I survive? This question is useful especially for teens who are not sure where they will live or how they will survive once they run away from home. Creating an escape plan and taking steps to adjust once you leave the home will help you answer this question. Your escape plan should specify a safe place you can go to and numbers for runaway helplines where you can speak to professionals who can help you survive and thrive outside of the abusive home. Who can I count on to help me? This question can help you to identify any support lines you may have around you, from a trusted friend to a professional support person. [1] X Expert Source Sabrina Grover, LMSW Licensed Master Social Worker Expert Interview. 3 December 2021. You should also have at least one emergency contact that you can rely on in the event you end up in trouble while on your own."
    },
    {
      "title": "Talk to a trusted friend or family member about your decision.",
      "content": "Talk to a trusted friend or family member about your decision. If you are a teen who is trying to escape an abusive environment, you may want to reach out to an elder that you trust and can confide in. Share your fears and your decision to leave the home. They may be able to support you in your decision and help you get out of the home. They can also help you put your fears into perspective and give you an outside view of the situation. This step can also be useful for adults who are trying to get out an abusive home environment, as confiding in a trusted friend or family member can help you to create an escape plan and feel confident enough to put it in motion."
    },
    {
      "title": "Speak to a professional counselor or support person for help.",
      "content": "Speak to a professional counselor or support person for help. Search online for the youth hotline in your state or area and get in touch with them. Explain your situation and get advice on how to effectively escape from the home. Speaking to a professional can also help you prepare for your escape and ensure that you have a network of professional support for when you do decide to leave the home. There are usually professional counselors that answer the phones on these helplines. They may ask you to provide your name or they may allow you to stay anonymous. Their job is to listen to your issues at home and make suggestions on safe places to go or actions you can take to get out of a dangerous situation. You can also contact the National Runaway Safeline (1-800-RUNAWAY) or the National Runaway Switchboard (800-621-4000), a 24 hotline that can connect you to professional services for runaways in your area."
    },
    {
      "title": "Arrange a safe place to go to.",
      "content": "Arrange a safe place to go to. One of the key details of your escape plan is having a safe place to go to once you leave the abusive home. [2] X Expert Source Sabrina Grover, LMSW Licensed Master Social Worker Expert Interview. 3 December 2021. This could be a trusted relative’s home, a close family member’s home, or a runaway shelter. You can also stay at a hotel for a night or two if you are of age. You should arrange your stay with a relative or family member beforehand. You can also stay with a close friend. It is not against the law for someone to take you in if they believe you are in danger. But if the adults in the safe place do anything illegal or lie to the authorities about your whereabouts, they can be charged with contributing to the delinquency of a minor. Call the shelter near you and let them know when you plan to leave so they are aware of when you are going to be there."
    },
    {
      "title": "Avoid sleeping on the streets.",
      "content": "Avoid sleeping on the streets. Though it may be challenging to find a safe place to go, leaving without a safe place can lead to a night or several nights spent sleeping on the streets. Often, the streets can be very dangerous and risky, especially if you are a teenager. Avoid this option by arranging for a safe place before you leave the abusive home."
    },
    {
      "title": "Save as much money as you can.",
      "content": "Save as much money as you can. You are going to need cash on hand to pay for your stay at a hotel and other basic amenities you may need as you transition out of the abusive home. [3] X Expert Source Sabrina Grover, LMSW Licensed Master Social Worker Expert Interview. 3 December 2021. Try to save as much cash as you can and store it in a safe place where it cannot be found. If you are a teenager who is planning to run away from home, you can likely find a runaway shelter where you can stay there for free for a few nights. You may also be able to stay with a friend or a relative for free until you figure out where you are going to live permanently. If you are an adult trying to get out of an abusive home, you may have a joint bank account with your abusive spouse. Apply for a new bank account at a bank that is close to the safe place you will be heading to when you leave the home. You may need a new permanent address, such as the safe place address, to apply for a new bank account. Doing this will cut you off from your abusive spouse and make it harder for them to find you."
    },
    {
      "title": "Pack the basic necessities.",
      "content": "Pack the basic necessities. Bring a few changes of clothing, toiletries, identification documents, and any small sentimental items. Try to fit these items in a small bag so you can carry it easily with you when you leave. Make sure you also bring cash with you as you will need this to pay for items once you leave. Avoid using credit cards as these can be used to locate you."
    },
    {
      "title": "Remove any traces of your escape plans from your computer or phone.",
      "content": "Remove any traces of your escape plans from your computer or phone. Once you have an escape plan in place, it’s important that you get rid of any traces of your escape plan that may be on your computer or your phone. This will prevent the abuser in your home from finding out about your plans and ensure your escape plan will be successful."
    },
    {
      "title": "Go to the safe place and do not tell your abusers where you are.",
      "content": "Go to the safe place and do not tell your abusers where you are. Per your escape plan, take your packed bag and go to your agreed upon safe place. Time this for when the abuser is out of the house or when you are alone in the house. Avoid giving your abuser any indication of where you have gone, as this could place you in danger. You may use public transportation, such as a bus or a train, to get out of the abusive home and go to the safe place. Or, you may be able to arrange a pick up a few blocks away from the abusive home through the person who lives in the safe place, if they have a car. If you believe you are in danger and cannot get out of the home, despite your escape plan, call 911 or a domestic abuse helpline."
    },
    {
      "title": "Be aware of your rights as a runaway.",
      "content": "Be aware of your rights as a runaway. If you are a minor (under 18 years of age) and you decide to run away from an abusive home, you should be aware of your legal status as a runaway. Though state laws can vary, in general, your parents have a legal right to call the police and report you missing. The police may then try to locate you and bring you home. If you are older than 18 years of age and are running away from an abusive spouse, the police do not have the jurisdiction to return you to the home. As a minor, you can prevent the police from taking you back to the abusive home if you explain your situation. Describe in detail the abuse you have suffered and let the police know that you are afraid to return to the home. The police will then take you to Child Protective Services. The CPS worker will then listen to the details of your situation and determine if your parents are providing a safe and stable environment for you as a minor. If they determine this is not the case, they can authorize your removal from the abusive home."
    },
    {
      "title": "Go to a runaway shelter or stay with a relative.",
      "content": "Go to a runaway shelter or stay with a relative. If the CPS worker determines that it is not safe for you to return to the abusive home, they will suggest that you stay with a relative or with someone you feel safe being around. If you do not have a safe place to stay, they will refer you to a runaway shelter. A professional counselor will talk to you at the runaway shelter and allow you to stay there if you are at least 12 years of age, you are mature enough to stay in the shelter, and it is clear you are in danger if you return home. Though the shelter staff may tell your parents where you are, your parents cannot simply take you from the shelter. Some shelters require parental permission to house runaways and some do not. Talk to the shelter about their rules. You can find out more information on runaway shelters through the National Runaway Safeline, 1-800-RUNAWAY. The safeline is open 24 hours a day and can refer you to professional support people in your area. [4] X Research source"
    },
    {
      "title": "Adjust your personal documentation so you cannot be found.",
      "content": "Adjust your personal documentation so you cannot be found. Once you are in a safe place, it is important that you take steps to remain hidden from your abuser. This is especially applicable if you are running away from an abusive spouse. Change your address and get a new bank account. You can also change your social security number so your abuser cannot use it to try to locate you. Call the social security office near you and explain you are a victim of domestic abuse. They will often let you change your social security number due to abuse circumstances. You may also want to consider hiring a lawyer, especially if you are going to have to fight for custody of your children or your assets."
    }
  ]
}