{
  "url": "https://www.wikihow.com/Make-an-Engine-from-a-Battery,-Wire-and-a-Magnet",
  "title": "How to Build an Electric Engine With a Battery, Wire & Magnet: Step-by-Step",
  "steps": [
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. You don't need any special tools to make a homopolar motor. All you need is a battery, a length of copper wire, and a neodymium magnet. [3] X Research source You can use any kind of alkaline battery, but a larger battery, such as a C-cell, will be easier to hold. [4] X Research source Get a few inches of copper wire. You can use bare wire or insulated wire. If you choose to use insulated wire, strip some of the insulation off at each end. You can find copper wire online, or at most hardware stores. [5] X Research source Any neodymium magnet should do the trick for this experiment, but search for one with a conductive plating. You can buy nickel plated neodymium magnets of varying sizes online. [6] X Trustworthy Source Science Buddies Expert-sourced database of science projects, explanations, and educational material Go to source You will also need one drywall screw. The screw will let you see the motor in action. Once you've successfully constructed the motor, the screw will spin. [7] X Research source"
    },
    {
      "title": "Put the magnet on the screw.",
      "content": "Put the magnet on the screw. Take the neodymium magnet and attach it the head of the drywall screw. [8] X Research source"
    },
    {
      "title": "Attach the screw to one end of the battery.",
      "content": "Attach the screw to one end of the battery. You can put the tip of the screw on either side of the battery. The side you choose will determine which direction your motor will spin. [9] X Research source The single point of contact between the tip of the screw and the battery serves as a low-friction bearing. A heavier magnet will decrease the amount of friction between these two points. [10] X Research source"
    },
    {
      "title": "Place the copper wire on the battery.",
      "content": "Place the copper wire on the battery. Take your copper wire and hold it to the other end of the battery. For example, if you placed your screw on the button end of the battery, hold the copper wire to the flat end. [11] X Research source"
    },
    {
      "title": "Complete the motor.",
      "content": "Complete the motor. Gently place the free end of the copper wire to the side of the magnet. The magnet and the screw should start to spin. [12] X Research source When you place the copper wire to the side of the magnet, you complete the circuit between the battery terminals. The current flows from one end of the battery, down the screw, and into the magnet. By touching the wire to the side of the magnet, you allow the current to keep flowing through the wire, and into the other end of the battery. [13] X Research source A homopolar motor is capable of continuous rotation without the need to reverse the direction of the current. [14] X Research source It does not take long for the screw to start spinning at high speeds. Both the screw and magnet could easily fly off the battery. Exercise caution when working with magnets and electricity. [15] X Research source It is possible for the wire to get warm when conducting this experiment. Don't hold the wire to the magnet for extended periods of time. [16] X Research source"
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. You only need a few things to make a freestanding homopolar motor. You should be able to find everything you need online, or at your local hardware store. You will need the following materials to make your motor: 1 AA battery, 2-3 neodymium magnets, and several inches of copper wire. [17] X Research source You may also need a pair of wire cutters or pliers to help you work the copper wire. [18] X Trustworthy Source Science Buddies Expert-sourced database of science projects, explanations, and educational material Go to source"
    },
    {
      "title": "Place the battery on the magnets.",
      "content": "Place the battery on the magnets. Stack your magnets together to make a stand. Place the flat, or negative, side of the battery on top of the magnets. [19] X Research source"
    },
    {
      "title": "Bend your copper wire.",
      "content": "Bend your copper wire. Take several inches of copper wire and bend it so that one end touches the magnet, and one end touches the positive side of the battery. [20] X Research source You can bend your copper wire into different shapes that will spin when placed on the battery. Symmetrical shapes work best, so that the spinning doesn't throw the wire off balance. [21] X Research source Try bending your wire into a heart shape. When you form the heart shape, bend each end of copper wire so that they fit around the magnet. The indention at the top of the heart will be the connecting point to the positive end of the battery. [22] X Research source"
    },
    {
      "title": "Place the wire over the motor.",
      "content": "Place the wire over the motor. Take your wire and place it over the battery. As long as you have a section of wire touching the side of the magnet, and a section of wire touching the positive side of the battery, your wire should spin. [23] X Research source The current in this homopolar motor flows in the presence of a magnetic field. When a current flows in a magnetic field, it will experience something known as the Lorentz force. The Lorentz force is what causes the wire to spin around the battery. [24] X Research source The wire connects to the battery at three points. One point of the wire is on the positive terminal, and the two ends of the wire are near the magnet, on the negative terminal. The current flows out of the positive terminal and down both sides of the wire. The magnetic field pushes the current outwards, causing the wires to rotate. [25] X Research source"
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. You can use your homopolar motor to demonstrate magnetohydrodynamic (MHD) propulsion. MHD propulsion is a means of using electrical current to push something through water. You'll need the following for this experiment: [26] X Research source 1 C-cell battery 1 strong neodymium magnet 2 pieces of thick copper wire A small dish Salt and pepper"
    },
    {
      "title": "Prepare the water.",
      "content": "Prepare the water. Pour about .25 to .5 inches (0.6 to 1.3 cm) of water into the dish. Don't fill the dish completely. Stir in a few dashes of salt and pepper, and place the dish on the magnet. [27] X Research source Adding salt improves the conductivity of the water. Adding pepper allows you to see the propulsion at work. [28] X Research source"
    },
    {
      "title": "Bend the wire.",
      "content": "Bend the wire. Bend each piece of wire so that when you hold the wires to the battery, the opposite ends are only a few centimeters apart. [29] X Research source When you hold the the copper wire to the battery, the wires should almost make a \"Y\" shape. Be careful not to let the ends of the wire touch each other. [30] X Research source"
    },
    {
      "title": "Hold the wires to the battery.",
      "content": "Hold the wires to the battery. Hold one wire against the positive side of the battery, and one end against the negative side of the battery. [31] X Research source"
    },
    {
      "title": "Stick the free ends of the wire in the dish of water.",
      "content": "Stick the free ends of the wire in the dish of water. Place one wire in the center of the dish, and the other against the side of the dish. You should see the water begin to swirl around one of the wires. [32] X Research source The water moves due to the Lorentz force. Each wire carries an electrical current. When you dip the wires into the salt water, you complete the circuit. The current moves horizontally through the water, from one wire to the other. Because the dish of water is sitting on a magnet, there is a magnetic field moving upwards through the water. When the electrical current moves through the magnetic field, the Lorentz force causes the water to spin. [33] X Research source If you turn the battery around, you can reverse the direction of the current, and the water will spin in the opposite direction. [34] X Research source You're dealing with water and electricity, so exercise caution when performing this experiment. [35] X Research source"
    }
  ]
}