{
  "url": "https://www.wikihow.com/Send-Files-via-Bluetooth-on-iPhone",
  "title": "How to Send Files to iPhone Over Bluetooth: Guide + Limitations",
  "steps": [
    {
      "title": "Unfortunately, it is not possible to send files from an iPhone using Bluetooth.",
      "content": "Unfortunately, it is not possible to send files from an iPhone using Bluetooth. But even though you can't use Bluetooth to transfer files, you can still use other methods. And the Bluetooth capabilities of your iPhone are still helpful for connecting to accessories, such as AirPods and speakers."
    },
    {
      "title": "AirDrop.",
      "content": "AirDrop. AirDrop is Apple's wireless file transfer protocol that uses both Bluetooth and Wi-Fi to transfer data. [1] X Research source If you're using an iPhone and want to transfer a file to another iPhone, iPad, or Mac, AirDrop will be perfect for you. The downside is that AirDrop only works between Apple products. For example, you can use AirDrop to transfer files from an iPhone to another iPhone or from an iPhone to a Mac, but not to transfer files from an iPhone to a Windows PC or Android."
    },
    {
      "title": "Email.",
      "content": "Email. Simply email yourself the file you want to transfer as an attachment. Open your email on a different device and download the attached file. The downside to this method is that most email services have a limit on how big of a file you can send as an attachment. It's also not practical for sending multiple files."
    },
    {
      "title": "iCloud.",
      "content": "iCloud. When you sign up for an Apple ID, you get 5GB of free iCloud storage you can use to save any file you wish. You can retrieve the files you save to iCloud on Apple products by signing in with your Apple ID. On non-Apple products, you can retrieve files saved to your iCloud storage by signing into the iCloud website using a web browser."
    },
    {
      "title": "Other Cloud Services.",
      "content": "Other Cloud Services. Like iCloud, you can use other cloud storage services to save files and retrieve them on other devices, including Dropbox, Google Drive, and OneDrive. Download the cloud storage app from the App Store on your iPhone and sign in or sign up for an account. Then use the cloud storage app to upload the files you want to transfer. Download and sign in to the cloud storage app on a different device and use the cloud storage app to retrieve your files."
    },
    {
      "title": "Place both devices near each other.",
      "content": "Place both devices near each other. Make sure both your iPhone and the other Apple device you want to send a file to are near each other and have Bluetooth turned on. You can only use AirDrop to send files to other Apple devices. You cannot use AirDrop to send files to an Android or a Windows computer. Make sure the feature is on and ready for sharing. To do that, go into Settings , tap General and select AirDrop . Then, check either Contacts only or Everyone for 10 Minutes ."
    },
    {
      "title": "Open the file you want to send.",
      "content": "Open the file you want to send. You can open the file you want to send in whichever app it is associated with. For example, if you want to send a photo, open the Photos app and then open the photo you want to send. Alternatively, you can open a file from within the Files app on your iPhone."
    },
    {
      "title": "Tap the Share icon .",
      "content": "Tap the Share icon . It normally has an icon that resembles a square with an arrow pointing up. You can usually find it in the upper-right corner of your app."
    },
    {
      "title": "Tap the AirDrop option.",
      "content": "Tap the AirDrop option. It has a white icon with blue concentric rings with a triangle cut out of the bottom half of the rings. Tap the AirDrop option in the Share menu to open the AirDrop menu ."
    },
    {
      "title": "Tap the device or user you want to send the file to.",
      "content": "Tap the device or user you want to send the file to. You should see a list of nearby users or devices you can send the file to. Tap the user or device you want to send the file to. If you do not see a list of devices you can send to, make sure all users have Bluetooth turned on and are near each other. Also, check your AirDrop permissions in the Control Center to make sure you can receive files from the other device."
    },
    {
      "title": "Open the AirDrop notification on the receiving device.",
      "content": "Open the AirDrop notification on the receiving device. When you send a file to another device using AirDrop, the other device will receive a notification. Check your notifications and open"
    },
    {
      "title": "Click or tap Accept on the receiving device.",
      "content": "Click or tap Accept on the receiving device. This will start transferring the file to the device. Once the file is finished transferring, you can find the file in your Downloads folder on your PC or Mac. One iPhone and iPad, you can open the file in the app it is associated with. [2] X Research source"
    },
    {
      "title": "Open your email app.",
      "content": "Open your email app. You can use Mail on iPhone, Gmail, Outlook, or any other email app you normally use to send and receive email."
    },
    {
      "title": "Compose a new email.",
      "content": "Compose a new email. Click the option to compose a new email. This will be different depending on one which app you are using. It may be a button that says New or Compose or an icon with a plus sign (+) in the lower-right corner or an icon resembling a pen and paper in the upper-right corner."
    },
    {
      "title": "Enter an email address as the recipient.",
      "content": "Enter an email address as the recipient. If you are sending the file to someone else, enter their email address in the \"To:\" field. If you are sending the file to another device you own, you can enter your email address as the recipient."
    },
    {
      "title": "Add the file you want to send as an attachment.",
      "content": "Add the file you want to send as an attachment. To do so, tap the icon that resembles a paperclip. Then tap the file you want to send. This attaches it to your email. Most email services limit the size of the file you can send. You should send an attachment that is more than 25 MB large."
    },
    {
      "title": "Send the email.",
      "content": "Send the email. Tap the icon that resembles a paper airplane or arrow pointing up. This sends the email. You should get a notification when you receive the email."
    },
    {
      "title": "Download the attachment.",
      "content": "Download the attachment. After a few moments, the recipient can open the email message on their device and click or tap the attachment to download the file."
    },
    {
      "title": "Open the Files app .",
      "content": "Open the Files app . It has an icon with a blue folder. Use this method if you want to send a file from your iPhone to another one of your own devices. This can be useful if the file on your iPhone is too large to attach to an email."
    },
    {
      "title": "Tap On My iPhone.",
      "content": "Tap On My iPhone . It's in the main menu of the Files app. This displays all files stored locally on your iPhone. If you don't see this option, tap the back button at the top-left until you're at the Browse screen, then tap On My iPhone here."
    },
    {
      "title": "Tap the file you want to send.",
      "content": "Tap the file you want to send. It will most likely be in a folder named after the app the file is associated with (i.e., Pages for Pages documents). Open the folder and tap the file you want to send to open the file. If you can't find the file on your iPhone, tap iCloud Drive in the main menu of the Files app and check to make sure it isn't already uploaded to your iCloud storage."
    },
    {
      "title": "Tap the Share icon .",
      "content": "Tap the Share icon . It has an icon that resembles a square with an arrow pointing up."
    },
    {
      "title": "Tap Save to Files.",
      "content": "Tap Save to Files . It's at the bottom of the Share menu. This allows you to select where you want to save the file to."
    },
    {
      "title": "Tap iCloud Drive.",
      "content": "Tap iCloud Drive . If you don't see it, tap the back button until you're at Browse , then tap iCloud Drive . This displays all folders in your iCloud storage."
    },
    {
      "title": "Select a folder and tap Save.",
      "content": "Select a folder and tap Save . Select where to save the file in your iCloud storage and tap Save in the upper-right corner. This saves the file to your iCloud storage."
    },
    {
      "title": "Go to https://www.icloud.com on the device to which you want to transfer the file.",
      "content": "Go to https://www.icloud.com on the device to which you want to transfer the file. You can use Safari or any other web browser to retrieve your files from the iCloud website. If you are on a Mac and signed in with your Apple ID, click the iCloud folder in the Finder. On Windows PC, you can download the iCloud app from the Microsoft Store. This allows you to browse your iCloud storage inside File Explorer."
    },
    {
      "title": "Sign in with your Apple ID.",
      "content": "Sign in with your Apple ID. Use the email address and password associated with your Apple ID to sign in to your iCloud storage."
    },
    {
      "title": "Click iCloud Drive .",
      "content": "Click iCloud Drive . It's the option that has an icon that resembles a blue cloud. This opens your iCloud storage."
    },
    {
      "title": "Select the file you want to transfer.",
      "content": "Select the file you want to transfer. Locate the file you want to transfer and click it to select it."
    },
    {
      "title": "Click the Download icon .",
      "content": "Click the Download icon . It has an icon that resembles a cloud with an arrow pointing down. It's at the top of the page in the middle. This downloads the file to your device. You can find your downloaded files in your Downloads folder."
    },
    {
      "title": "Download a cloud storage app on your iPhone.",
      "content": "Download a cloud storage app on your iPhone. In addition to iCloud, you can use other storage services to transfer files from your iPhone to other devices. Download the app for the storage service you want to use from the App Store. Other cloud storage apps include Google Drive, Dropbox, and OneDrive."
    },
    {
      "title": "Open your cloud storage app and sign in.",
      "content": "Open your cloud storage app and sign in. Once you finish downloading the cloud storage app you want to use, tap the icon on your Home screen to open the app. Then sign in with the email address and password associated with your account. If you do not have an account, follow the instructions to sign up for a new one. If you use Google Drive, you can sign in using your Gmail account. If using OneDrive, you can sign in using your Microsoft account."
    },
    {
      "title": "Tap the option to add files.",
      "content": "Tap the option to add files. It is most likely an icon with a plus (+) symbol at the bottom of the screen or in the lower-right corner. This displays a pop-up menu."
    },
    {
      "title": "Tap the option to upload files.",
      "content": "Tap the option to upload files. It will be in the pop-up menu that appears when you tap the plus icon. It will most likely say Upload or Upload File , Create or Upload File or something similar."
    },
    {
      "title": "Tap the option to browse for files on your iPhone.",
      "content": "Tap the option to browse for files on your iPhone. It will say Browse , Upload File or something similar. Tap the option to browse files on your iPhone."
    },
    {
      "title": "Select the file you want to upload.",
      "content": "Select the file you want to upload. Tap the file to select it. It will either start uploading automatically, or you will need to tap Upload to begin uploading the file. Wait until it is completed uploading."
    },
    {
      "title": "Open the cloud storage app or website on a different device.",
      "content": "Open the cloud storage app or website on a different device. These cloud storage apps are available on iPhone and iPad from the App Store, or the Google Play Store on Android devices. Download the app on a mobile app to retrieve your files. On a PC or Mac, go to the cloud storage website in a web browser. The cloud storage websites are as follows: Google Drive: https://drive.google.com/ Dropbox: https://www.dropbox.com/ OneDrive: https://onedrive.live.com/"
    },
    {
      "title": "Sign in to your account.",
      "content": "Sign in to your account. Locate the option to sign in to your cloud storage and sign in with your email address and password."
    },
    {
      "title": "Click or tap the file you want to transfer.",
      "content": "Click or tap the file you want to transfer. This selects the file or opens the file inside the app or web browser."
    },
    {
      "title": "Click or tap the Menu icon ⋯.",
      "content": "Click or tap the Menu icon ⋯ . It's the icon with three dots in the upper-right corner. This displays a drop-down menu. Alternatively, you can right-click the file on a PC or Mac to display a context menu."
    },
    {
      "title": "Click or tap the option to download the file.",
      "content": "Click or tap the option to download the file. It will either say Download or it will be an icon with an arrow pointing down at the top of the page. This downloads the file to your device. On most devices, you can find your downloaded files in the Downloads folder."
    }
  ]
}