{
  "url": "https://www.wikihow.com/Manage-Your-Partner%27s-Family-Gathering-with-Social-Anxiety",
  "title": "How to Manage Your Partner's Family Gathering with Social Anxiety",
  "steps": [
    {
      "title": "Talk openly with your partner about your anxiety.",
      "content": "Talk openly with your partner about your anxiety. Whether you're meeting your partner's family for the first time or the tenth, it's important to be open about the anxieties you have. Make sure that your partner is understanding of what you're feeling and facing. [1] X Research source Assess if you and your partner have similar personalities about social situations and family gatherings. Are you both more introverted? Or are you the introvert and your partner is the extrovert? By understanding each other's personalities in social situations, you and your partner are less likely to have misunderstandings about one another's behaviors in social settings. Don't shy away from explaining to your partner how your social anxiety affects you physically and emotionally. Use this an opportunity to educate. For example, say something like, \"My social anxiety can make me feel light-headed and dizzy when I'm in front of a large group of people. Sometimes I feel like I can't breathe until I'm alone for a minute.\" Ask for your partner's support and reassurance. Make sure that your partner understands that you need words of encouragement rather than judgment. Consider saying, \"I know that you may not fully understand my anxiety, but your words of encouragement and support will help get me through it.\""
    },
    {
      "title": "Come up beforehand with a strategy if you get too anxious.",
      "content": "Come up beforehand with a strategy if you get too anxious. Have an \"out\" if things get too anxiety-provoking at the family gathering. While it may be tempting to just stay home or not go, having a plan in place ahead of time will make the event seem less stressful. Consider rehearsing lines with your partner of how you might say that you need to politely leave or end the conversation with the various family members. [2] X Research source If you're going to your partner's family's home, consider talking beforehand about a set time to leave. For example, let's say that the party starts at 7pm, and you will likely want to leave by 9pm. Find a possible compromise between you and your partner about when to leave and how to get home if things change. Make sure to \"check in\" with your partner throughout the night about the time you discussed. Another option could be a body language signal that you both use to help or \"rescue\" each other when a conversation is too stressful or irritating. This can help to teach you and your partner to help each other in awkward situations, rather than ignoring or getting frustrated with each other. Find a reasonable excuse to, at least, leave the room or the party if things are too anxiety-providing. For example, you can say that you need \"some air and want to sit outside\" for a moment, or a more classic excuse of just \"needing to use the restroom.\" If you need to leave the party altogether, focus on being polite regardless of the reason you give for leaving."
    },
    {
      "title": "Do activities that reduce your stress beforehand.",
      "content": "Do activities that reduce your stress beforehand. Find healthy ways to cope with stress and social anxiety. Maybe you have a ritual that makes things easier, or a go-to activity to help you feel better. Consider these healthy activities to reduce anxiety: [3] X Research source Exercise. Got for a walk. Get outdoors. Go to the gym. [4] X Expert Source Alexandra Janelli Certified Hypnotherapist & Anxiety and Stress Management Coach Expert Interview. 27 August 2020. Write down things that you know you are capable of, and things you've overcome. Find inspiration to believe in yourself through your words. Journaling can help to externalize and let go of negative thoughts. Do yoga or meditation. Find solace and peace through a mind and body connection. Open up to a trusted family member or friend. Spend some time with someone you care about and ask for their advice and support in helping you manage and overcome your social anxiety. Consider if medication or therapy could be beneficial, if you are not already doing these things. Many people find relief through anxiety medication or ongoing therapy with a qualified psychologist. Use self-affirmations. Tell them to yourself out loud when you're alone. Consider these: \"I am confident in social situations\" or \"I feel calm and can hold a conversation.\" [5] X Research source"
    },
    {
      "title": "Gain control of your anxiety.",
      "content": "Gain control of your anxiety. Instead of letting your fears and anxiety symptoms control you, start taking control of your own life and how you feel. When you start taking more action of your cognitive and physiological responses, you can feel an increase in hope, empowerment, and courage to face your fears. [6] X Expert Source Alexandra Janelli Certified Hypnotherapist & Anxiety and Stress Management Coach Expert Interview. 27 August 2020. Try incorporating the following steps to help you with social anxiety: Recognize and evaluate your thoughts. Are you thinking that other’s will think you less than them? Do you feel that they will laugh at you for some reason? Why do you feel this? Are you afraid of failing or looking silly? After careful evaluation of your thoughts, ask yourself if these are realistic thoughts to have, or if you should just let them go. Recognize and evaluate your physical reactions. Are you feeling funny in your gut as if you have butterflies fluttering? Do you notice an increase in perspiration, or redness creeping up your chest, neck and face? Is your heart racing? Is your chest heavy and you're finding it harder and harder to take normal breaths? Practice some healthy coping skills to help you reduce your symptoms. Try taking several long and very slow deep breaths or closing your eyes and imagining a happy, safe place until you notice your heartbeat slows and your muscles relax. Challenge all of your negative thoughts. Try to replace every negative thought you have with a positive one. Reader Poll: We asked 841 wikiHow readers who've experienced social anxiety, and 55% of them agreed that the best way to relax is by focusing on breathing. [Take Poll]"
    },
    {
      "title": "Practice facing your fears.",
      "content": "Practice facing your fears. Try not to ignore your fears or avoid the situations that provoke these fears within you. The more you face the fears associated with social anxiety, the more you will be able to prove that your worst fears will be overcome and no longer realized. [7] X Expert Source Alexandra Janelli Certified Hypnotherapist & Anxiety and Stress Management Coach Expert Interview. 27 August 2020. Empower yourself with courage and strength, and lean on the support of your partner to help you face your fears head on. Consider going to social skills therapy groups. Make small goals, such as saying hello to everyone you encounter. The more you do this, the more your anxiety will decrease. Want more tips on dealing with social anxiety from wikiHow users? Check out our How do I deal with social anxiety? forum ."
    },
    {
      "title": "Be an active and engaged listener.",
      "content": "Be an active and engaged listener. With social anxiety, you may feel hesitant to engage in conversation. Focus on listening, instead of talking. Many people are more interested in talking about themselves. Use these techniques to show you're engaged when possible: [8] X Research source Avoid darting your eyes away from the family members you're talking with. Maintain eye contact and nod your head. Focus less on how they may be judging you, and instead think about what is interesting about them. If they start asking questions about you, consider redirecting the conversation back to them. Let's say one of guests ask you about your family. You could keep it brief and say, \"They're doing well. I hear that you're thinking of moving, what's that process been like for you?\" While you may want to use your phone, tablet, or other devices to distract yourself, avoid doing this when someone is in the middle of talking to you."
    },
    {
      "title": "Ask others about their interests and hobbies.",
      "content": "Ask others about their interests and hobbies. Learn to ask questions about other people as a way to reduce the focus on yourself. I may be feel less stressful for you in social situations when you don't have to talk. [9] X Research source Ask open-ended questions about their interests, rather than questions that lead to \"yes\" or \"no\" responses. For example, consider asking, \"Have you seen any good movies lately?\" or \"Are you a sports fan?\" Try to remember what they say, and refer back to this information later when you continue conversation with them or others that have similar interests."
    },
    {
      "title": "Focus on connecting with at least one of your partner's family members.",
      "content": "Focus on connecting with at least one of your partner's family members. If you're at a large family gathering, it may feel overwhelming to be around a lot of people. Consider identifying one person or a small group of two or three people that you focus on getting to know. [10] X Research source Consider talking with your partner about who might be a good match for developing a conversation at the event when your partner is busy. Find common interests or personalities traits with that family member. Try to look more at the commonalities rather than the differences. Getting on the good side of at least one family member of your partner's family will be particularly helpful over time, as you may be obligated to attend some social functions in the future."
    },
    {
      "title": "Be helpful.",
      "content": "Be helpful. If you have social anxiety, you might feel less anxious if you're busy doing something, rather than having to engage in small talk. Depending on the social gathering, see if you can help the host or other family members with tasks that need to be done. [11] X Research source For example, if it is an event with lots of food that needs to be prepared or placed out for guests, ask to help with food preparations or setting out the food. If there is an older adult that needs assistance, ask if you can help them with getting food, or walking them to a different area of the event. Identify others who may be in need, and consider assisting them."
    },
    {
      "title": "Find a quiet space when you need a moment.",
      "content": "Find a quiet space when you need a moment. If you have social anxiety, it's likely that you may need more quiet time to yourself away from others. While you may not want to go find a place to hide as soon as you arrive at a family gathering, it's okay to take breaks while you're there. [12] X Research source Maybe you need a moment to yourself to reduce your anxiety or prevent a panic attack from starting. When you begin to feel your anxiety level heighten, ask to be excused for a moment. If the event takes place outdoors such as at a park or someone's backyard , consider walking around the area on your own to catch your breath. If the event is in a small or cramped space, consider saying that you need to get something from the car or that you need to go check your car. Then you can possibly sit alone in the car until your feelings subside. If the event is in a large home or building, consider finding a room that's empty or a bathroom that's not being used."
    },
    {
      "title": "Avoid using alcohol or other substances to cope with stress.",
      "content": "Avoid using alcohol or other substances to cope with stress. While it may seem like drinking would lighten the mood and make you feel less anxious, it could also have the opposite effect. Consider staying away from things that could change your behavior, possibly for the worse. If you're very anxious, avoid depending on alcohol before, during, or after the event to deal with your feelings. If you feel like you need alcohol in order to handle social situations, you may need to find other, healthier ways to cope with the anxiety you're feeling. Dependence on alcohol or other possibly addictive substances when you are anxious or depressed can be a dangerous mix. For behavior health and substance use treatment options in your area, contact SAMHSA's National Helpline at 1-800-662-4357 or https://findtreatment.samhsa.gov/ . A trained specialist can assist you with options for help such as treatment programs or counseling."
    },
    {
      "title": "Focus on the positives in the situation.",
      "content": "Focus on the positives in the situation. When you're anxious, it may be easier to see the negatives of the situation, but there are usually some positives in any given situation. It's important to remember that you are strong and capable. [13] X Research source Consider thinking about your partner, and what they have done to be supportive throughout the event, even if very small things. Focus on the people who are caring, loving, and gracious, even if you may disagree about certain things or feel uneasy at times. Make sure to remember that you succeed just by coming to the event. Even if it's a small victory, make sure to remember it."
    }
  ]
}