{
  "url": "https://www.wikihow.com/Record-from-Spotify",
  "title": "How to Record from Spotify",
  "steps": [
    {
      "title": "Open Audacity.",
      "content": "Open Audacity. Double-click the Audacity app to launch Audacity. It's the icon that resembles a yellow sound waveform with blue headphones. If you don't already have Audacity installed: On Windows : Go to https://www.audacityteam.org/download/windows/ and click Audacity X.X.X Installer at the top the page (where X.X.X is the latest version available). Double-click the installer file and follow the prompts to install Audacity. On Mac : Go to https://www.audacityteam.org/download/mac/ and click Audacity X.X.X.dmg file at the top of the page (where X.X.X is the latest version available). Double-click the .dmg file and follow the prompts to install Audacity."
    },
    {
      "title": "Select an audio host.",
      "content": "Select an audio host. Click the drop-down box on the left-side of the microphone icon and select: On Windows : Windows WASAPI On Mac : Core Audio"
    },
    {
      "title": "Select a recording device.",
      "content": "Select a recording device. Click the drop-down box to the right of the microphone icon and select your speakers (or whatever output you use). Select whatever speakers or audio output you normally use to play your computer's audio through. To find out what audio output you're currently using: On Windows : Click in the bottom-right corner of the taskbar. On Mac : Click in the top-right of the menu bar."
    },
    {
      "title": "Select Stereo recording.",
      "content": "Select Stereo recording. Click the next drop-down box, to the left of the speaker icon, and select 2 (Stereo) Recording Channels . It's the second option in the drop-down menu."
    },
    {
      "title": "Select your audio playback device.",
      "content": "Select your audio playback device. Click the drop-down box to the right of the speaker icon and select the audio output you use to listen to the music. Generally, you'll want to select the same output that you selected as your recording device, this way you can hear what you're recording."
    },
    {
      "title": "Click the record button.",
      "content": "Click the record button. It's the button with the red circle on it at the top of the Audacity app. This starts recording all the audio that your computer plays."
    },
    {
      "title": "Press play in the Spotify app.",
      "content": "Press play in the Spotify app. Switch over to the Spotify app and press play or click the song you want to record to start playing it. As the song plays, you'll see sound waves form on the timeline in the Audacity app as it records the Spotify music."
    },
    {
      "title": "Click the stop button when you're finished recording.",
      "content": "Click the stop button when you're finished recording. It's the button with the black square on it at the top of the Audacity app."
    },
    {
      "title": "Save your recording.",
      "content": "Save your recording. When you're done recording the song, you can export the recording to save it: Click File . Click Export . Click Export as MP3 . Type a filename for the song. Select a location to save it. Click Save ."
    }
  ]
}