{
  "url": "https://www.wikihow.com/Open-a-File-in-Windows",
  "title": "How to Open a File in Windows",
  "steps": [
    {
      "title": "Press ⊞ Win+E.",
      "content": "Press ⊞ Win + E . Pressing the Windows key (usually near the bottom-left corner of the keyboard) and E together opens your file browser, which is called File Explorer."
    },
    {
      "title": "Navigate to the file you want to open.",
      "content": "Navigate to the file you want to open. The drives on your computer appear in the left panel of the File Explorer. Clicking any drive or folder in the left panel displays its contents on the right. Files you've downloaded from the internet are usually saved to the Downloads folder. Click the arrow next to This PC to expand all folders, then click Downloads to open this folder. If you're not sure where the file is located, click This PC in the left panel, then type the file name (or part of it) into the search bar at the top-right corner of File Explorer. Press ↵ Enter to start the search."
    },
    {
      "title": "Double-click the file to open it.",
      "content": "Double-click the file to open it. This opens the file in its default app. If you want to select a specific app to open the file with, right-click the file, select Open With , and then choose an app. Check out https://www.openwith.org to learn more about finding the right app to open a file. If the file is a ZIP/compressed file, right-click the file and select Extract here . This creates a new folder in the current directory. You can now double-click the new folder to browse what's inside."
    },
    {
      "title": "Open the app you want to use.",
      "content": "Open the app you want to use. For example, if you want to open a Microsoft Word document, you'd want to open Microsoft Word. All of the apps installed on your PC can be found in the Start menu, which is usually at the bottom-left corner of the screen. You may have to click All Apps or All Programs to view the entire list. You can also open an app using the Windows Search bar. Click the magnifying glass or circle to the right of the Start button, type app's name (e.g., word ), and then click it in the search results."
    },
    {
      "title": "Click the File menu and select Open.",
      "content": "Click the File menu and select Open . The File menu is usually in a menu bar at the top of the screen. Once you click Open , you'll usually see a file browser. Sometimes the menu will display an icon of a folder instead of the word File . If you don't see a File menu, look for a menu or button called Open instead."
    },
    {
      "title": "Browse to the file you want to open.",
      "content": "Browse to the file you want to open. If you don't see the file in the list, you'll have to navigate to the folder where it is stored. You can do this using the folders and drives on the left side of the file browser."
    },
    {
      "title": "Select the file and click Open.",
      "content": "Select the file and click Open . This opens the file for viewing and/or editing in the current app."
    },
    {
      "title": "Open the Documents folder.",
      "content": "Open the Documents folder. Many of your Windows apps save files to the Documents folder by default. There are several ways to do this: Click the Start menu, which is usually at the bottom-left corner of the screen, and then click the Documents folder. Click the circle or magnifying glass to the right of the Start menu, type documents into the search bar, and then click the Documents folder in the search results. Double-click the Documents folder on your desktop. Double-click This PC or Computer on the desktop, and then double-click Documents inside."
    },
    {
      "title": "Double-click the file you want to open.",
      "content": "Double-click the file you want to open. This opens the file in its default app for viewing and/or editing. You can also open a file with another program by right-clicking the file, selecting Open With , and then choosing another app. Check out https://www.openwith.org to learn more about finding the right app to open a file."
    }
  ]
}