{
  "url": "https://www.wikihow.com/Put-Strings-on-a-Ukulele",
  "title": "How to Put Strings on a Ukulele",
  "steps": [
    {
      "title": "Unwind each string from its tuning peg at the top of the ukulele.",
      "content": "Unwind each string from its tuning peg at the top of the ukulele. Start with the 2 pegs that face up when you play, turning them clockwise to unwind the strings. For the strings on the 2 pegs that face down toward the floor, turn the pegs counter-clockwise. Carefully pull the strings out of the peg holes. [1] X Research source If you have a hard time getting the strings out of the tuning pegs, use nail clippers to clip them off. Just be careful not to scratch the finish of your ukulele."
    },
    {
      "title": "Undo the knot at the bridge to slide the string out of the bridge hole.",
      "content": "Undo the knot at the bridge to slide the string out of the bridge hole. If you have a bridge with bridge pegs, gently pull the peg out to free the string. For a tie bar bridge, on the other hand, untuck the ends of the strings from underneath first. Then loosen and untie the knots to free the strings. [2] X Research source If you're having a hard time untying the knots, clip at them with your nail clippers until you can get the string off your ukulele."
    },
    {
      "title": "Clean your ukulele while the strings are off.",
      "content": "Clean your ukulele while the strings are off. There's no better time to clean your ukulele than when all the strings are off because you have complete access to the fingerboard. A lot of grime can accumulate on the surface, especially if you play frequently. Use a little lemon oil or wood polish and a soft, lint-free cloth to gently clean the surface. [3] X Research source Check your bridge as well and clean any dust or dirt that might have accumulated there."
    },
    {
      "title": "Tie a knot at the end of each string if you have bridge pegs.",
      "content": "Tie a knot at the end of each string if you have bridge pegs. For a ukulele with pegs at the bridge, the knot at the end of the string simply keeps the string from slipping past the peg. Tie the knot as close as possible to the end of the string, then press the bridge peg in place snugly over the knot. [4] X Research source If the knot keeps coming undone, try a double-knot. High-quality strings tend to hold a knot better than cheaper strings, so if you continue to have a problem with this, consider an upgrade. Apply gentle pressure when you press the bridge peg into place to avoid accidentally cracking your bridge. The peg has a little notch so you can tell if you've got it in securely."
    },
    {
      "title": "Knot the end of the string around the bridge if you have a tie bar bridge.",
      "content": "Knot the end of the string around the bridge if you have a tie bar bridge. Insert your new string through the bridge hole and pull about 2 to 3 inches (5.1 to 7.6 cm) of the string through. Make a knot in the string and pull the shorter end of the string towards the bottom of the ukulele. Wrap that shorter end around the loop one more time, then pull the string tight to secure it. [5] X Research source You might want to tuck the ends of the strings under or loop them around after you've finished stringing your ukulele so they won't poke you while you play."
    },
    {
      "title": "Feed the other end of the string through its tuning peg hole.",
      "content": "Feed the other end of the string through its tuning peg hole. Once you have the bridge end of the string secure, pull it up to the top of the ukulele and slide it through the hole in the tuning peg that corresponds with that string. While turning the peg, loop it once over the top of the end of the string sticking out, then twice underneath. This should secure the string in the hole so you can tighten it the rest of the way. [6] X Research source It helps to give your tuning pegs a turn so the holes are lined up with the string. Then, you can just slide the string right in."
    },
    {
      "title": "Repeat the same process with each of the other 3 strings.",
      "content": "Repeat the same process with each of the other 3 strings. With 1 string secure, move on to the next. It doesn't matter what order you do them in. However, you don't want to try to tune any of the strings until you've got them all on. [7] X Research source"
    },
    {
      "title": "Tighten each string up and tune it to pitch.",
      "content": "Tighten each string up and tune it to pitch. Start with the 2 pegs that face up when you play, turning them counter-clockwise to tighten the strings. For the other 2 pegs, turn them clockwise. Tighten just enough that the string has tension, then use your tuner to bring them to the right pitch. [8] X Research source With new strings, you might find that you have to adjust them more often to keep them in tune. After some time playing, the strings will stretch and stay in tune longer."
    }
  ]
}