{
  "url": "https://www.wikihow.com/Peel-an-Avocado",
  "title": "How to Peel an Avocado",
  "steps": [
    {
      "title": "Wash the fruit.",
      "content": "Wash the fruit. Rinse the avocado under cool to lukewarm running water, scrubbing the peel gently with your fingers. It is important to wash the avocado even though you will not be consuming the peel. Otherwise, dirt and bacteria from the peel could get onto the flesh as you peel it. Do not use soap to clean the avocado. Dry the avocado with a clean paper towel or clean dishcloth after rinsing it. Note that your hands should be clean before you wash the avocado. Use warm water and soap to scrub your hands for 20 seconds before you begin preparing the avocado."
    },
    {
      "title": "Place the avocado on a secure surface.",
      "content": "Place the avocado on a secure surface. Lay the avocado on its side. It will be easier and safer to cut the avocado on its side rather than on its end since more of the skin's surface will be secured in place. To help prevent slipping, place a clean dish towel or no-slip silicone mat on the counter or cutting board beneath the avocado. [1] X Research source"
    },
    {
      "title": "Slice the avocado in half lengthwise.",
      "content": "Slice the avocado in half lengthwise. Use a sharp kitchen knife to cut the avocado from top to bottom. Note that with the avocado on its side, you will be making a horizontal cut through the long side of the fruit rather than the short width side. Securely grip the avocado in your non-dominant hand. If necessary, hold the fruit with a towel to give yourself more traction and a firmer grip. Start from the narrower end, or the \"top,\" and across to the wider end, or the \"bottom.\" You will need to cut around the pit at the center of the fruit. You will not be able to cut through it."
    },
    {
      "title": "Twist the two halves apart.",
      "content": "Twist the two halves apart. Pick up the fruit in both hands and rotate the halves in opposite directions to twist them apart. Get a firm grip on both halves of the avocado. Use one hand to twist one half toward you and the other hand to twist the other half away from you. You may need to wiggle and rotate the halves back and forth in order to free them. When you separate the two halves, the pit will still be lodged into one side of the fruit. You will need to remove it before you can peel the avocado."
    },
    {
      "title": "Scoop the seed out with a metal spoon.",
      "content": "Scoop the seed out with a metal spoon. This is the safest technique you can use to remove the pit of the avocado. Slide the tip of the spoon in between the pit and the surrounding flesh. Gently push the spoon underneath the pit, following the side of the pit as closely as possible. Circle the spoon around the pit to loosen it from the surrounding flesh on all sides. Glide the spoon back under the pit of the avocado and lift it straight up and out."
    },
    {
      "title": "Remove the pit by striking it with a sharp knife and lifting it straight out.",
      "content": "Remove the pit by striking it with a sharp knife and lifting it straight out. [2] X Research source You will need to tap the pit with the sharp edge of your knife with enough force to stick into it but not enough to cut through it. This method is not officially recommended since it can be fairly dangerous. Exercise as much caution as possible so that you do not accidentally cut yourself with the knife in the process. Protect your hand by holding a folded kitchen towel in the palm of the hand you are holding the avocado in. The towel should separate your hand from the avocado. Gently tap on the center of the seed with your kitchen knife, gradually wedging it further and further in. Slowly increase the pressure of each tap as you progress. Once the knife is securely fixed into the seed, twist the blade from side to side to loosen the seed. As soon as the seed breaks free from the flesh, lift it straight out by lifting up the knife, bringing the seed with it."
    },
    {
      "title": "Glide a metal spoon in between the flesh and the skin.",
      "content": "Glide a metal spoon in between the flesh and the skin. Slip the tip of a large metal serving spoon into the flesh of the avocado as close to the skin as possible. Try to insert the spoon into the flesh before the dark green portion of the flesh to preserve as much of the flesh as possible. Gently push the spoon underneath the flesh, following the curve of the skin as closely as possible. Slowly glide the spoon around the perimeter of the fruit to completely sever the flesh from the skin."
    },
    {
      "title": "Lift the flesh out whole.",
      "content": "Lift the flesh out whole. Slide the spoon back under the bottom of the flesh and scoop it straight up and out. If the flesh has been completely loosened, it should come out in one solid chunk. If there are any parts of the flesh that are still stuck to the skin, the avocado may come out in pieces, instead. If you accidentally cut through the peel as you were severing the flesh, you may have small pieces of peel stuck to the flesh in several spots."
    },
    {
      "title": "Peel away any remaining fragments of skin.",
      "content": "Peel away any remaining fragments of skin. If there are any pieces of skin still stuck to the fruit, you can peel them off by digging your nail under the peel and lifting it away. If you are unable to remove the fragments with your nail, shave them off with a small paring knife, instead. From this point on, you can cut and prepare the avocado as desired."
    },
    {
      "title": "Cut the avocado into quarters or slices.",
      "content": "Cut the avocado into quarters or slices. Cut each avocado half in half again, lengthwise, to produce quarters. If desired, you can continue cutting these sections lengthwise to create smaller, easier to handle sections. Place each half cut-side-down as you cut it into quarters or wedges. Doing so will give you more traction, making it easier and safer to cut the fruit. Smaller wedges will be easier to peel than wider wedges."
    },
    {
      "title": "Pinch the peel at the tip of the slice.",
      "content": "Pinch the peel at the tip of the slice. Use your index finger and thumb to dig into the tip of each wedge, just below the dark green portion of the flesh and just above the skin. Ideally, you will only have the skin gripped in between your fingers. Note that this method is also referred to as the “nick and peel” method. [3] X Research source"
    },
    {
      "title": "Slowly peel the skin down and off.",
      "content": "Slowly peel the skin down and off. Peel the skin off the avocado as you would peel a banana. Hold the fruit in your non-dominant hand. Grip the exposed tip of the peel with your dominant hand and slowly pull it away from the flesh and downward. Peel slowly to prevent the flesh from breaking or the skin from tearing as you remove it."
    },
    {
      "title": "Alternatively, slice the skin off with a knife.",
      "content": "Alternatively, slice the skin off with a knife. If the avocado is not quite ripe, the skin may be difficult to remove with your fingers. If this happens, you can glide a small paring knife in between the peel and the flesh. This is not ideal, however, since you may lose more of the flesh this way than you would by simply peeling the skin off with your fingers."
    },
    {
      "title": "Score the avocado flesh.",
      "content": "Score the avocado flesh. Use a paring knife to cut lines into the flesh. Cut a series of three or four parallel lines running from the top to the bottom of each half. Cut another set of lines perpendicular to this first set. Cut the flesh down to the skin, but do not cut into the skin."
    },
    {
      "title": "Use a spoon to separate the chunks from the flesh.",
      "content": "Use a spoon to separate the chunks from the flesh. Glide a large metal serving spoon beneath the flesh, severing the cubes from the skin at the point from which they are still attached. Gently push the spoon underneath the flesh, following the curve of the skin as closely as possible. Slowly glide the spoon around the perimeter of the fruit to completely sever the pieces of fruit from the skin."
    },
    {
      "title": "Peel away any remaining fragments of skin.",
      "content": "Peel away any remaining fragments of skin. If there are any little pieces of skin still stuck to the chunks of fruit, you can peel them off by digging your nail under the remaining peel and lifting it away. If you are unable to remove the fragments with your nail, you can try shaving them off with a small paring knife, instead."
    }
  ]
}