{
  "url": "https://www.wikihow.com/Refresh-Yourself",
  "title": "How to Refresh Yourself",
  "steps": [
    {
      "title": "Meditate",
      "content": "Meditate every day. Studies suggest that meditation can physically change your brain to make you happier, calmer, more empathetic, and more focused. Many people are intimidated by the thought of sitting quietly for long periods, but even just a few minutes a day will help. [1] X Research source Set a goal to sit quietly with a clear mind for 10 minutes each day. This won’t be easy at first. You might only be able to go 1 or 2 seconds before a thought flies into your mind. When thoughts and worries come into your mind, observe them without judgement, and then let them pass. Treat your mind like a muscle. Work up to longer moments of quiet just as you would work up to heavier weights when weight-lifting. Some people find it helpful to name the thoughts that come into their mind as they go by. For example, if work stress comes to mind, just say in your head, “Work” and then allow the thought to pass out of your mind, like a cloud drifting across the sky."
    },
    {
      "title": "Do a walking meditation.",
      "content": "Do a walking meditation. If you’re not particularly good at sitting and meditating, try starting with a walking meditation. Find a quiet space and walk from one end of it to the other, back and forth, paying careful attention to the experience of walking. [2] X Trustworthy Source Greater Good in Action An initiative by UC Berkeley's Greater Good Science Center promoting science-based practices for a meaningful life Go to source Pay attention to how your feet feel on the ground; how the air around you feels; to any noises that you hear; or any smells that might be there. As thoughts come into your mind, don’t engage with them, just let them pass and work on quieting your mind once more. The key is to be fully present in the moment and really experience everything around you."
    },
    {
      "title": "Learn to live in the moment.",
      "content": "Learn to live in the moment . This is also referred to as being mindful. Try to slow down and be present in each moment, and to do things with intention. Doing this will help you feel more joyful and calm every day. [3] X Research source This may be difficult at first, but it will get easier with time. Whenever you get distracted, just gently draw your attention back to the moment and your intention."
    },
    {
      "title": "Write in a journal every day.",
      "content": "Write in a journal every day. Keeping a regular journal can help you get in touch with yourself and how you really feel about things. It can also help you solve problems and relax. Set aside 20 minutes each day to write in your journal. [4] X Research source It’s ideal to write in a physical journal as opposed to using your computer. Go to a bookstore and get yourself a nice journal that you feel excited to write in. You might also get yourself a nice pen! If you’re so worried about your privacy that you can’t bring yourself to write in a physical journal, use a password-protected text document instead. Using a physical journal will be more effective, but any journal is better than nothing!"
    },
    {
      "title": "Disconnect.",
      "content": "Disconnect. Countless studies have linked the use of technology — including computers, cell phones, and TVs — to sleeping problems and depressive symptoms. It’s important to set time aside each day to do something that doesn’t involve looking at a screen: read a book, go for a walk, meditate, or do whatever may appeal to you. People who spend a lot of time on the Internet and social media are particularly prone to fatigue, sleep problems, and depression. [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Signs that you’re spending too much time online include staying online longer than intended, losing track of time while online, and being unable to cut down on the time you spend online. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you think you might have a problem, start keeping track of how much time you spend online. You can do this in a calendar, notepad, or other device, but just be sure to be consistent. There are also online resources available to help you limit the time you spend on your computer."
    },
    {
      "title": "Clean your house and/or workspace.",
      "content": "Clean your house and/or workspace. Having a messy house and work space can make you feel anxious and overwhelmed. [7] X Research source If you spend a lot of time in cluttered, messy spaces, you might have trouble feeling refreshed. The physical act of cleaning might even get your blood pumping enough to make you feel a bit better, and having a less cluttered living/working space will definitely help your mind feel more clear and refreshed. Experts suggest making the task of cleaning more fun by setting a playlist of your favorite music to clean to."
    },
    {
      "title": "Keep yourself clean",
      "content": "Keep yourself clean and well groomed. When we’re feeling down, it can be difficult to maintain basic hygiene. Doing basic things like brushing your teeth, having a shower, washing your face, trimming your nails, and brushing your hair are sure to help you feel refreshed. [8] X Research source Make your daily hygiene routine into an enjoyable ritual by using products that make you feel good: nice-tasting toothpaste, nice-smelling face and/or body wash, and a good-quality moisturizer are all things that will help you enjoy getting clean and looking your best ."
    },
    {
      "title": "Take a long bath.",
      "content": "Take a long bath. A popular image for relaxation is a person soaking in a warm, bubbly bath. Light a few candles, play some soft music, and slip into a tub of warm water. Try to lie in the bath for at least 15 minutes while mindfully enjoying the bath — don’t think about work/school/etc. If you don't have sensitive skin, you can add a nice bubble bath to the water. If you have sensitive skin, try Epsom salts and dried lavender. If you are unable to take baths, or you dislike them, you can also have a relaxing shower. Use a body wash or soap in a relaxing scent like lavender. If you take a shower instead of a bath, mindfully pay attention to how the water feels on your skin, how it sounds as it hits the tub, and to any other elements of the experience that may stand out to you."
    },
    {
      "title": "Treat yourself.",
      "content": "Treat yourself. Get a massage, go to a spa, get a haircut, or just take yourself out for dinner. Do something that you wouldn't normally do, and that makes you feel pampered. The key is to give yourself a break and have someone do something nice for you. If you don't have a lot of money, keep an eye out for local Groupon (or similar coupon) deals. Other ideas for pampering yourself on a budget: Go get a fancy hot chocolate or coffee from a nice cafe, and sit in and just enjoy the atmosphere, or read a book. Go to a local community center that has a sauna, and sit in there, maybe even enjoy a whirlpool hot tub soak and a swim. See if there are any gardens in your area that allow free or cheap entry, and then walk around and mindfully enjoy the experience — for example the smells, sights, and feeling of your feel on the ground as you walk."
    },
    {
      "title": "Set aside time to focus on something you enjoy.",
      "content": "Set aside time to focus on something you enjoy. Take time to enjoy something that you love, and really devote your time to it. Don’t check your phone or go on your computer, or anything else during this time. Examples: Cuddle up in blankets and pillows with some hot tea and a good book. Light some scented candles or incense and flip through song lyrics while you listen to your favorite album from beginning to end. Put on an outfit that you feel really fantastic in. [9] X Expert Source Jordan Stolch Image Consultant & Style Advisor Expert Interview. 3 November 2020. Sit down with a few of your favorite chocolates and eat each one slowly and mindfully, paying attention to their complex flavors, textures, and scents. Avoiding screens is a good idea when you’re seeking to refresh yourself, but if you really want to, you could also set aside time to curl up with a snack and your favorite beverage, and watch one of your favorite TV shows or movies. Reader Poll: We asked 175 wikiHow readers what their go-to stress-relieving activity is, and 60% of them said, doing something I enjoy, like reading a favorite book or watching a funny video. [Take Poll]"
    },
    {
      "title": "Do not feel guilty.",
      "content": "Do not feel guilty. While pampering yourself it's imperative that you don’t think about work or anything else that stresses you out. When those thoughts arise in your mind, gently put them aside and continue enjoying what you’re doing. If you feel guilty about taking time for yourself, it will end up being stressful instead of refreshing, so really try to keep your mind off work or any other stressors while you're pampering yourself."
    },
    {
      "title": "Drink enough water.",
      "content": "Drink enough water. Signs that you're not drinking enough water include feeling hungry, feeling tired, having burning eyes and a dry mouth, and reduced mental functioning, including low mood and an inability to focus. [10] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source To calculate how much water you should drink each day, take your body weight in pounds, and divide that in half. That’s how much you should be drinking each day, in ounces. For example, a 150-pound woman needs to drink roughly 75 ounces of water each day. If you live somewhere hot or you workout regularly (i.e. you sweat a lot), this number will increase. A 150-pound woman living in a hot climate with an active lifestyle might drink anywhere from 75 to 150 ounces of water, depending on her day."
    },
    {
      "title": "Eat healthfully",
      "content": "Eat healthfully . Experts commonly recommend eating lean proteins, healthy fats, and whole grains, and avoiding processed foods that contain lots of sodium and/or sugar. The key is to eat a variety of foods in order to get all of the nutrients and vitamins you need. [11] X Research source Studies have shown that eating too much and/or eating the wrong foods can cause damage to your brain and affect your mood and memory. Omega-3 fatty acids (found in fish), antioxidants (found in blueberries), and folic acid (found in spinach, orange juice, and yeast) improve brain function. [12] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Don’t eat too much.",
      "content": "Don’t eat too much. Aim to use (“burn”) as many calories as you consume. How many calories you need each day depends on your age, gender, size, and level of physical activity. [13] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Example: A moderately active female aged 19-30 should aim to consume 2,000 calories a day. Moderate activity includes walking about 1.5 to 3 miles per day (at a rate of 3 to 4 miles per hour), plus any day-to-day activities. [14] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Exercise regularly.",
      "content": "Exercise regularly. Studies have shown that exercise reorganizes the brain, making it more resilient to stress. [15] X Trustworthy Source Princeton University Leading academic institution devoted to expanding and sharing knowledge Go to source Exercise has also been proven to improve memory and thinking skills. [16] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source When you can think clearly and are less susceptible to stress, you're less likely to feel burnt out. Experts recommend doing at least 150 minutes of moderate physical activity (walking) or 75 minutes of vigorous physical activity (running, cardio class) each week. You can also combine the two. [17] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Thirty minutes every day is the most popular recommendation. If you struggle to find time for scheduling regular workout sessions, do your minutes in 10- or 20-minute intervals throughout the week. For example, one day you could do 10 minutes of walking in the morning, 20 minutes at lunch, then 10 minutes after work."
    },
    {
      "title": "Think positively",
      "content": "Think positively . Celebrate your daily successes, no matter how small they may seem. When you make mistakes, forgive yourself. Try to live in the moment and let go of any worry that you have about the past or future. [18] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source It’s also important to let go of any worries you have about other people. You cannot control them. Worrying about what others think or what they may do will only exhaust you."
    },
    {
      "title": "Socialize.",
      "content": "Socialize. Ensure that you get out of the house/workplace and hang out with people who you enjoy spending time with. Socialize with people who make you feel like the best version of you, who are supportive and fun to be around. When we feel stressed out and burnt out, we tend to isolate ourselves. Avoid this urge, as it will only make your feelings worse. Try to talk to at least one good friend about how you’re feeling. Go out for a walk or a cup of tea with them. [19] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you’re living far away from friends, try to find time to talk to them on the phone or online. There are a lot of ways to communicate now beyond face-to-face, and many of them are free, so take advantage of them."
    },
    {
      "title": "Laugh and have fun.",
      "content": "Laugh and have fun. Go dancing, watch a comedy special, hang out with people who make you laugh — whatever it is that makes you happy, do it! Taking time to enjoy life will help keep you feeling refreshed and prevent you from feeling burnt out. Even if you're not feeling happy right now, force yourself to get out and do something that’s likely to improve your mood. [20] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Do things that interest you.",
      "content": "Do things that interest you. Pick up a hobby or two that make you feel fulfilled in life. Learn a musical instrument or a second language; join a cooking class; take an art or writing class at a local college. Taking time to develop your interests will make you feel more fulfilled in life. If all you do is wake up, work/go to school, come home, eat, and sleep, it’s no wonder you’re feeling burnt out. Help keep yourself feeling refreshed and inspired by learning new things."
    },
    {
      "title": "Get enough sleep.",
      "content": "Get enough sleep. The common recommendation of nightly sleep is 7 to 9 hours for adults and 8.5 to 9.5 hours for teens. However, a study testing participants after 9 hours of sleep versus 7 hours of sleep suggested that even seven hours of sleep per night is too little. [21] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you’re feeling burnt out and groggy all the time, try increasing how much sleep you get each night. Aim for 9 hours per night. If that’s not possible, aim for as close to 9 as you can go. Some researchers suggest planning your sleep in accordance with the 90-minute-cycle rule. As you sleep, you cycle through 5 phases that go from deep to relatively wakeful sleep. You will feel most awake when you wake up during the wakeful phase. You can do this by deciding when you want to wake up, and then counting backwards in 90-minute segments to figure out when you need to go to sleep. As an example, to wake up feeling well rested at 7 a.m., you’d need to go to sleep by 10 p.m."
    },
    {
      "title": "Have a good work/life balance.",
      "content": "Have a good work/life balance. Studies have proven that lacking a good work/life balance will actually burn you out and make you less productive in the long run. Prevent burnout by keeping lower work hours and spending more time on keeping yourself happy and healthy. [22] X Research source It’s common for students and those in regular jobs to work well beyond full-time hours. This is already exhausting, but what’s worse is many employers and teachers encourage this behaviour. Many people seem to believe that being exhausted and lacking free time are signs that you’re working extra hard. You might even have the best intentions and really believe that you’re working harder, but you’ll only render yourself less productive in the long run."
    }
  ]
}