{
  "url": "https://www.wikihow.com/Prune-a-Snowball-Bush",
  "title": "How to Prune a Snowball Bush",
  "steps": [
    {
      "title": "Prune the bush after the flowers bloom in spring.",
      "content": "Prune the bush after the flowers bloom in spring. Expect viburnum snowball bushes to blossom in May. Heavy pruning should only be done at this time since you can easily destroy next year’s flowers by removing old wood. [1] X Research source Deadheading, or cutting off the flowers, won’t harm viburnum. However, doing it isn’t necessary and prevents the plant from growing berries."
    },
    {
      "title": "Cut the oldest shoots near the ground.",
      "content": "Cut the oldest shoots near the ground. The oldest branches are the thickest, woodiest ones. They may produce side shoots or have flaky bark that make them easier to recognize. Using a clean, sharp pair of shears, cut as close to the soil as you can to completely remove the shoots. At most, remove no more than ⅓ of the shoots. Usually, this means removing 1 to 3 shoots at a time. Leave behind the thinner, fresher shoots coming up from the plant’s base. These will rejuvenate your viburnum. Although the snowball flowers bloom on old wood in viburnum plants, the oldest shoots produce weak flowers and are safe to remove."
    },
    {
      "title": "Trim the sides of the plant into shape if needed.",
      "content": "Trim the sides of the plant into shape if needed. Viburnum often grows well when it is left alone, so you may not need to do routine trimming. If your bush gets too large or begins extending out of its spot in your yard, use clippers to reduce its size. Cut the branches as needed. [2] X Research source Remember to only perform hard trimming in spring, after the bloom, to avoid damaging the bush’s buds the next year. You can trim the branches this way to maintain the snowball bush’s rounded shape or sculpt it into a hedge."
    },
    {
      "title": "Reduce the bush’s height by ⅓ if it becomes overgrown.",
      "content": "Reduce the bush’s height by ⅓ if it becomes overgrown. Viburnum snowball bushes grow relatively quickly, so they can become too tall or crowded. If your bush needs serious work, use shears to trim the shoots and branches back. You can also cut out the larger, older shoots to thin the plant. The best time to do this is around May, after the flowers bloom, although it can be done anytime as needed. After trimming back the plant, you may want to wait and watch it grow back. Then you can see where you need to thin out the branches. By maintaining the bush regularly, you likely won’t need to do this."
    },
    {
      "title": "Trim damaged branches down to the new growth throughout the year.",
      "content": "Trim damaged branches down to the new growth throughout the year. Examine your snowball bush throughout the year to look for broken or rotting branches. With a sharp pair of shears, cut out the damaged parts. If possible, cut above the nodes, which are where new leaves and branches grow off of the old branches. [3] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source This routine trimming should be done year-round to keep your snowball bush healthy and thriving."
    },
    {
      "title": "Prune snowball hydrangeas after the first frost in fall or winter.",
      "content": "Prune snowball hydrangeas after the first frost in fall or winter. Wait for the first frost to happen in your area. This happens when the temperature reaches 32 °F (0 °C) and the ground freezes over. Snowball hydrangeas go dormant, so you can perform heavy pruning during this time. Hydrangeas flower on new wood."
    },
    {
      "title": "Trim all the branches down to10 in (25 cm).",
      "content": "Trim all the branches down to10 in (25 cm). Aim to make each branch between 4 to 10 in (10 to 25 cm) long. Use a clean pair of shears to cut the branches cleanly. Shorter branches will produce larger, stronger snowball flowers during the next growing season. You can cut snowball hydrangeas to the ground every year. This usually isn’t necessary and can weaken your plant over time, so only try doing this every 3 or 4 years. You don’t have to deadhead hydrangea since you remove the old blooms when you trim back the branches."
    },
    {
      "title": "Cut older branches back to the growth nodes.",
      "content": "Cut older branches back to the growth nodes. Check the branches for thick spots where new buds form. Trim thick, woody branches right above this point. Doing this encourages the plant to grow new branches, which can be helpful if your bush looks a little thin or ragged. Try to trim some of the old branches back every fall so your hydrangea always has fresh growth."
    },
    {
      "title": "Remove damaged branches throughout the year.",
      "content": "Remove damaged branches throughout the year. Check the hydrangea often, looking for branches that are splintered or rotting. Also note any tangled or weak stems. Clip these off as you find them in order to keep your plant healthy. Through routine maintenance, you can reduce the amount of pruning you need to do in the fall."
    }
  ]
}