{
  "url": "https://www.wikihow.com/Protect-Folders-With-Passwords",
  "title": "3 Easy Ways to Protect a Folder With a Password",
  "steps": [
    {
      "title": "Right-click the folder and select Properties.",
      "content": "Right-click the folder and select Properties . You can do this in File Explorer or by right-clicking any folder on your desktop. [1] X Research source Windows Pro, Enterprise, and Education Editions have their own built-in file encryption software called BitLocker. BitLocker can be used to encrypt an entire hard drive or individual folders and files. BitLocker is not available on Windows Home Edition. If you are using Home Edition, you will need to use third-party software to encrypt your files and folders. [2] X Research source"
    },
    {
      "title": "Click Advanced.",
      "content": "Click Advanced . It's at the bottom of the Properties window next to \"Attributes.\""
    },
    {
      "title": "Check \"Encrypt contents to secure data\" and click OK.",
      "content": "Check \"Encrypt contents to secure data\" and click OK . This starts the process of encrypting your folder. [3] X Research source If you want to open a password-protected folder, follow the previous steps up to this point and uncheck this box. Then, enter your password."
    },
    {
      "title": "Select \"Apply changes to this folder, subfolders and files\" and click Ok.",
      "content": "Select \"Apply changes to this folder, subfolders and files\" and click Ok . It's the second radio option in the \"Confirm Attributes Changes\" window. [4] X Research source"
    },
    {
      "title": "Click the \"Back up your file encryption key\" in the pop-up message.",
      "content": "Click the \"Back up your file encryption key\" in the pop-up message. You can also find this pop-up message in the Notifications window by clicking the icon that resembles a square-shaped speech box in the Taskbar."
    },
    {
      "title": "Insert a USB flash drive in a USB port and click Back up now (recommended).",
      "content": "Insert a USB flash drive in a USB port and click Back up now (recommended) . This will back up your encryption key to a flash drive. This will help prevent losing access to your files if you forget your password. If you don't have a flash drive, click Back up Later to be reminded next time you log in, or Never back up . Warning: If you don't back up your encryption key, you could lose access to your files if you forget your password."
    },
    {
      "title": "Click Next two times.",
      "content": "Click Next two times. First, click Next at the bottom of the Certificate Export Wizard welcome window. Then click Next again to create a new password."
    },
    {
      "title": "Select \"Personal Information Exchange - PKCS #12\" and click Next.",
      "content": "Select \"Personal Information Exchange - PKCS #12\" and click Next . This is the default option in the Certificate Export Wizard window. Then click Next in the lower-right corner."
    },
    {
      "title": "Check \"Password\" and enter your password twice.",
      "content": "Check \"Password\" and enter your password twice. To create a new password, click the checkbox next to \"Password\" and then enter your desired password in the two fields below the checkbox. Make sure you enter the same password both times."
    },
    {
      "title": "Click Next.",
      "content": "Click Next . It's in the lower-right corner of the Certificate Export Window."
    },
    {
      "title": "Go to the USB drive.",
      "content": "Go to the USB drive. Use the file browser to navigate to the location of your USB drive. This may be a temporary \"D:\" or \"E:\" drive."
    },
    {
      "title": "Type a name for the certificate and click Save.",
      "content": "Type a name for the certificate and click Save . This saves the certificate as a \".pfx\" file."
    },
    {
      "title": "Click Next and then Finish.",
      "content": "Click Next and then Finish . This finishes the process of encrypting and password-protecting your folder. You can now eject the USB drive and put it in a safe location. If you need to access your folder, follow steps 1 - 4. Then, uncheck the box that says \"Encrypt contents to secure data.\" Then, enter your password to unencrypt the folder."
    },
    {
      "title": "Download and install Wise Folder Hider.",
      "content": "Download and install Wise Folder Hider. Wise Folder Hider is a program you can use to password-protect files and folders, hide files and folders, and create an encrypted drive. You can download the free version of Wise Folder Hider for Windows from https://www.wisecleaner.com/wise-folder-hider.html . Use this method if you have Windows Home Edition. Once downloaded, double-click the file and follow the on-screen instructions to install."
    },
    {
      "title": "Open Wise Folder Hider and set a password.",
      "content": "Open Wise Folder Hider and set a password. Wise Folder Hider will usually open automatically after it is installed, but you'll find it in the Start menu if it doesn't. Once open, you'll be prompted to enter a password ."
    },
    {
      "title": "Drag files into Wise File Hider.",
      "content": "Drag files into Wise File Hider. Drag any files or folders you want to protect with passwords into the app. When you close the app, those files and folders will be locked and hidden inside Wise Folder Hider. Additionally, you can set a separate password for each folder you add. To do so: Click the drop-down menu across from a folder you added under the \"Hide File\" tab. Click Set Password . Enter the password you want to set for that folder twice and click Ok ."
    },
    {
      "title": "Open a hidden folder.",
      "content": "Open a hidden folder. To access a hidden folder, open Wise Folder Hider, enter the password you set, and click Open . To remove a password-protected folder from Wise Folder Hider, click the drop-down menu across from a folder under the \"Hide File\" tab and select Unhide ."
    },
    {
      "title": "Create an encrypted drive (optional).",
      "content": "Create an encrypted drive (optional). In addition to locking and hiding folders behind a password-protected app, you can create an encrypted drive that you can use to password-protect your files and folders. If you want to do this, use the following steps to do so: Click the Encrypt File tab. Click Create in the lower-right corner. Enter a name for the encrypted drive (or leave it as the default). Click Browse and select a save location for the encrypted drive (or leave it as the default \"Documents\" folder). Click Create ."
    },
    {
      "title": "Set a password for the encrypted drive.",
      "content": "Set a password for the encrypted drive. To do so, open Wise Folder Hider and enter your password. Click the Encrypted File tab. Click the drop-down menu across from the encrypted drive and click Set Password . Enter a password for the drive twice and click Ok ."
    },
    {
      "title": "Mount the encrypted drive.",
      "content": "Mount the encrypted drive. You must mount the drive to access it and add files and folders. To do so, open Wise Folder Hider and enter your password. Click the Encrypt File tab and click Mount across from the encrypted drive. Enter your password for the encrypted drive and click Ok ."
    },
    {
      "title": "Add files to the encrypted drive.",
      "content": "Add files to the encrypted drive. Once the encrypted drive is mounted in Wise Folder Hider, it will appear in your list of drives in File Explorer. Press the Windows key + E to open File Explorer. Right-click any files or folders you want to add to the encrypted drive and click Cut . Then open the encrypted drive, right-click, and click Paste ."
    },
    {
      "title": "Unmount the encrypted drive.",
      "content": "Unmount the encrypted drive. Once you have added all the files and folders you want to add to the encrypted drive, click Unmount across from the drive in Wise Folder Hider. This will hide the encrypted drive in File Explorer. You must mount it in Wise Folder Hider to display it in File Explorer again."
    },
    {
      "title": "Open Disk Utility.",
      "content": "Open Disk Utility. You can do so quickly by typing disk utility into Spotlight and pressing Return ."
    },
    {
      "title": "Click the File menu and select New Image.",
      "content": "Click the File menu and select New Image . This will open a Finder window. On some older Macs, this option may be labeled \"Disk Image from Folder\" instead."
    },
    {
      "title": "Select the folder you want to protect and click Open.",
      "content": "Select the folder you want to protect and click Open . Click the box at the top of the pop-up window, click your folder's location (e.g., Desktop ), click your folder, and click Open ."
    },
    {
      "title": "Enter a name for your folder.",
      "content": "Enter a name for your folder. Do so in the \"Save As\" field."
    },
    {
      "title": "Click the \"Encryption\" drop-down box and select 128-bit AES encryption.",
      "content": "Click the \"Encryption\" drop-down box and select 128-bit AES encryption . It's in the \"Encryption\" drop-down menu."
    },
    {
      "title": "Select read/write as the Image Format.",
      "content": "Select read/write as the Image Format. This option will allow you to add and remove files to your encrypted folder later."
    },
    {
      "title": "Click Save.",
      "content": "Click Save . This button is in the bottom-right corner of the window."
    },
    {
      "title": "Create a password and click Choose.",
      "content": "Create a password and click Choose . Enter a password you want to set for your folder in the \"Password\" field and enter it again in the \"Verify\" field to confirm. Your passwords must match to continue."
    },
    {
      "title": "Click OK and then Done.",
      "content": "Click OK and then Done . If you named your image the same thing as your original folder, click Replace when prompted to replace the folder. Once you click Done , your new password-protected folder will appear as a .dmg file. You can delete the original folder you used to create the password-protected folder if you want. Your files are safe in the \".dmg\" that was just created."
    },
    {
      "title": "Open the password-protected folder.",
      "content": "Open the password-protected folder. To access files in your protected folder, double-click the newly created \".dmg\" file, enter the password you set, and click OK . Your folder will open as a mounted virtual \"drive\" on the desktop. Once unlocked, this will open a window and display your files."
    },
    {
      "title": "Lock the folder again.",
      "content": "Lock the folder again. When you are done, you can lock the folder again by \"Ejecting\" the drive that was opened in one of the following ways: Click and drag the drive's icon to the trash. Right-click on the icon and select Eject \"[Your Folder Name]\" Click the eject button next to your folder's name in the Finder window on the left."
    }
  ]
}