{
  "url": "https://www.wikihow.com/Place-a-Google-Doc-on-a-Flash-Drive",
  "title": "7 Easy Steps to Save a Google Doc on a Flash Drive",
  "steps": [
    {
      "title": "Plug your flash drive into your computer.",
      "content": "Plug your flash drive into your computer. It should insert into one of the thin, rectangular slots in your computer's casing. If you're using a Windows desktop computer, USB ports are typically in either the front or the back of the computer's CPU box. If you're using an iMac, you may find the USB ports on the side of your keyboard or on the back of the iMac's screen. Not all Macs have USB ports. If you're using a newer Mac that doesn't come with USB ports, you'll need to purchase a USB-C to USB adapter."
    },
    {
      "title": "Open the Google Drive website.",
      "content": "Open the Google Drive website. Go to https://drive.google.com/ in your preferred web browser. If you're already logged into Google Drive on your computer, this will open your Google Drive main page. If you aren't yet logged in, click the Go to Google Drive button and then enter your email address and password to log into your Google account. If you have more than one Google account logged in, click your Google account's profile image in the upper-right corner of the page, then click the account whose Drive you want to use."
    },
    {
      "title": "Select the document you want to download.",
      "content": "Select the document you want to download. Single-click the document to select it. If the document is inside of a folder, double-click the folder to open the document. Double-clicking it will open it in a new window."
    },
    {
      "title": "Click ⋮.",
      "content": "Click ⋮ . This vertical three-dot menu icon appears in the upper-right side of the Google Drive window once you've selected the document you want to download. A drop-down menu will appear. You can also right-click the document in your Drive to get this menu."
    },
    {
      "title": "Click Download.",
      "content": "Click Download . It's near the bottom of the drop-down menu. [1] X Research source If you have the file open, go to File > Download and pick a format, then your USB to save it."
    },
    {
      "title": "Choose your flash drive.",
      "content": "Choose your flash drive. Your USB flash drive should appear in the panel on the left side of the window. If not, you'll need to troubleshoot any issues and have it repaired . Rename the file if you'd like before continuing."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . The Google document, like Google Docs, Google Slides, Google Sheets, or Google Forms, will be saved to your flash drive. Make sure your computer isn't using your flash drive before removing it from the port. To access that file, plug it into another computer that can read and use the USB flash drive."
    }
  ]
}