{
  "url": "https://www.wikihow.com/Play-Bunco",
  "title": "How to Play Bunco",
  "steps": [
    {
      "title": "Know the object of Bunco.",
      "content": "Know the object of Bunco. Players roll dice and accumulate ‘wins’ (or \"buncos\".) The person with the most wins or Buncos at the end of the game is the winner. [1] X Research source"
    },
    {
      "title": "Know how to form a bunco.",
      "content": "Know how to form a bunco. Each round correlates to a number on the die; the first round correlates with the one on the die, round two correlates with the two, etc. If a player rolls the dice and gets three of the number that the round correlates to, the person gets a bunco. Example : If it is round four and the player rolls the dice and three of them land on four, that player gets a bunco."
    },
    {
      "title": "Find a group of 12 people to play with.",
      "content": "Find a group of 12 people to play with. Bunco is played with 12 people because it is divisible by four. [2] X Research source If you are playing with more or less than 12 people, make sure that you are playing with enough people so that there are four players at each table. If you are playing with an odd amount of people, assign a “ghost” to someone. The partner of the “ghost” rolls and keeps score for the “ghost”. Essentially one person on the team with an uneven number gets to roll and keep score twice."
    },
    {
      "title": "Understand what the head table is.",
      "content": "Understand what the head table is. The head table controls the pace of the game. The game begins with the head table rings the bell. To pick the players who will be at the head table: Collect all 12 score sheets. Assign someone to draw small stars on four of the card sheets. Shuffle the sheets. Have each player select a sheet. Those who pick sheets with stars are the players who will begin at the head table."
    },
    {
      "title": "Divide the rest of the players between two tables.",
      "content": "Divide the rest of the players between two tables. There should be four people at each table. A typical Bunco game consists of three tables--one “losing” table, one “middle” table and one head table. The head table is the best, the middle is middle, and the losing table is worst."
    },
    {
      "title": "Divide each table into teams.",
      "content": "Divide each table into teams. People across from each other are teammates. However, keep in mind that this will change every round. [3] X Research source"
    },
    {
      "title": "Pick a scorekeeper for each team.",
      "content": "Pick a scorekeeper for each team. This person will play the game, but will also be in charge of keeping track of points for the team he/she is on."
    },
    {
      "title": "Give each table what they'll need to play.",
      "content": "Give each table what they'll need to play. Each table should have a spiral notebook to write the score in, 3 dice, a score sheet for each player, and a pencil for each of the four people at the table. [4] X Research source"
    },
    {
      "title": "Begin round one of the game.",
      "content": "Begin round one of the game. One person at the table will take the three dice and roll them. They will want to get as many 1s as possible, as this is Round 1. [5] X Research source For each 1 that he/she roll, they get one point unless they roll three 1s, which would be a 21 (the highest amount of points possible). This is called a \"bunco\", hence the name of the game. When a player gets a bunco, they should yell \"Bunco!\" Mark a hash mark on the player’s card that got the bunco. If the player rolls three of a kind, but they're not 1s, he/she gets five points, but not a bunco."
    },
    {
      "title": "Let the first player continue to roll until he/she doesn’t roll the number needed.",
      "content": "Let the first player continue to roll until he/she doesn’t roll the number needed. When he/she doesn’t get the number, the dice is passed to the left. For example, in the first round, if a player rolls the dice and gets a 3, 4, and 6, he/she must pass the dice to the next player because none of those dice were 1s. The dice must also be passed as soon as a player scores 21 points. This could either be achieved by getting a bunco or rolling the dice so that at least one of the die is the number needed and adding that to the existing score."
    },
    {
      "title": "Finish round one.",
      "content": "Finish round one. When a team from the head table gets 21 points or more, the round is over. That team must yell out “game!” The scorekeeper at the head table rings the bell to signify the end of the round. The team at each table with the most points is the winner of that round for each individual table. Players can finish up the roll that they started when the bell was rung. If there is a tie between teams at a table, one person from each team must roll one die. The person who rolls the highest number wins for his/her team."
    },
    {
      "title": "Winning teams write a W on their cards.",
      "content": "Winning teams write a W on their cards. Losing teams (those with fewer points) write an L on their cards. Shift teams accordingly. The winning team at the head table stays at the head table. The losing team at the head table goes down to the middle table. The winning team at the middle table moves up to the head table. The losing team moves down to the losing table. The winning team at the losing table moves up to the middle table. The losing team stays at the losing table."
    },
    {
      "title": "Switch partners.",
      "content": "Switch partners. You do not have to do this, but it makes the game more lively. Once each team has moved to the appropriate table, switch partners so that you make up a whole new team. [6] X Research source"
    },
    {
      "title": "Continue playing.",
      "content": "Continue playing. Move to round two (the new number that the teams must hope to roll is 2.) There are six rounds in Bunco. Playing all the way to round 6 completes one hand of the game."
    },
    {
      "title": "Keep score.",
      "content": "Keep score. You should keep score by a team (you and the person you're facing) and individually (how many buncos you've gotten)."
    },
    {
      "title": "Determine the winner.",
      "content": "Determine the winner. After all of the rounds are over, each player should count up the number of buncos they have, as well as how many wins and losses. You can either play that the person with the most buncos wins, or the person with the most buncos and ‘wins’ wins. Award prizes accordingly."
    }
  ]
}