{
  "url": "https://www.wikihow.com/Prevent-Spitting-During-Pregnancy",
  "title": "How to Prevent Spitting During Pregnancy",
  "steps": [
    {
      "title": "Brush your teeth immediately after eating.",
      "content": "Brush your teeth immediately after eating. Keeping your teeth and gums clean and healthy can help reduce the excess saliva in your mouth. Brushing your teeth after eating can also decrease nausea and vomiting, which is what causes the excess saliva. [2] X Research source"
    },
    {
      "title": "Use a minty mouthwash.",
      "content": "Use a minty mouthwash. Mint can soothe your stomach and ease feelings of nausea, which can help with excess saliva. If you have excess saliva, rinse out your mouth several times a day to help with bad breath and the buildup of bacteria in your mouth and on your teeth and gums. [4] X Research source Carry a travel-size bottle of mouthwash with you so you can rinse your mouth when you're out and about if you don't have the opportunity to brush your teeth right away."
    },
    {
      "title": "See your dentist if you have tooth decay or an infection.",
      "content": "See your dentist if you have tooth decay or an infection. Both tooth decay and oral infections can cause excess saliva. If you already have excess saliva due to pregnancy, any dental problems will only make the condition worse. [5] X Research source If it's been a while since your last dental checkup, go ahead and schedule one. If you do have any dental problems, your dentist can take care of them."
    },
    {
      "title": "Treat your nausea and vomiting to decrease your excess saliva.",
      "content": "Treat your nausea and vomiting to decrease your excess saliva. Excess saliva is typically caused by morning sickness. If you have severe morning sickness, treating that might help your excess saliva as well. Some remedies for nausea and vomiting caused by pregnancy include: Eating multiple smaller meals (say, 6 meals instead of 3) and snacking frequently [6] X Research source Drinking beverages like water or ginger tea [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Avoiding triggers, such as heat and humidity, odors, or flickering light [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Going for a walk after eating [9] X Research source"
    },
    {
      "title": "Eliminate irritants that might trigger excess saliva.",
      "content": "Eliminate irritants that might trigger excess saliva. Smoke, pesticides, some cleaning products, and other irritants can cause a reaction that increases your saliva production. Pay attention to your physical reaction around potential irritants and avoid those that are causing excess saliva. [10] X Research source You might have sensitivities while pregnant that you've never had before. If something gives you a headache or makes you feel nauseous, it might also be causing excess saliva."
    },
    {
      "title": "Take your prenatal vitamin at night before you go to bed.",
      "content": "Take your prenatal vitamin at night before you go to bed. Prenatal vitamins with iron can sometimes worsen morning sickness and excess saliva. If you normally take your prenatal vitamin in the morning, try taking it just before bed and see if that helps. [11] X Research source Your doctor might also suggest that you switch from a tablet to a chewable form, which is more easily absorbed."
    },
    {
      "title": "Try clinical hypnosis to treat excess saliva.",
      "content": "Try clinical hypnosis to treat excess saliva. Some people have found that clinical hypnosis helps relieve excess saliva as well as nausea and vomiting caused by pregnancy. While this doesn't work for everyone, it might be worth a try if other attempts have failed. [12] X Research source Even though hypnosis isn't harmful either to you or your baby, make sure the hypnotist you're going to is board-certified."
    },
    {
      "title": "Try to swallow as much saliva as you can.",
      "content": "Try to swallow as much saliva as you can. If you have severe nausea, swallowing your saliva might make you feel worse. However, as long as you can stomach it, the easiest way to get rid of excess saliva is to keep swallowing. [13] X Research source If the excess saliva feels thicker, has a bitter taste, or is difficult to swallow, try drinking something, such as ginger ale, to help it go down more easily."
    },
    {
      "title": "Carry tissues or a handkerchief with you at all times.",
      "content": "Carry tissues or a handkerchief with you at all times. There may be moments when you simply can't swallow the saliva in your mouth and need to spit it out. If you have tissues or a handkerchief, you can be more discreet about this. [14] X Research source Dab at your mouth rather than spitting directly into the tissue or handkerchief until the problem feels like it's under control. This will keep the paper or cloth from getting too wet. If you have tissues, you can simply throw them away. Keep your handkerchief in a plastic bag so you don't have to worry about anything else getting wet or damaged by it."
    },
    {
      "title": "Chew sugarless gum to help soak up the excess saliva.",
      "content": "Chew sugarless gum to help soak up the excess saliva. Chewing gum won't necessarily cause your body to produce less saliva, but it will help soak up the excess saliva already in your mouth. It can also make the saliva easier to swallow. [15] X Research source Mint gum might also soothe your stomach. If you feel less nauseous, your body will be less likely to produce excess saliva."
    },
    {
      "title": "Sip water throughout the day.",
      "content": "Sip water throughout the day. By drinking water throughout the day, you can ensure that your body is well-hydrated. Sipping water also helps break up the thicker saliva and makes it easier to swallow. [16] X Research source Get a water bottle that you can carry with you and refill it when you have the opportunity. That will make it easy for you to make sure you're drinking enough water to stay hydrated."
    }
  ]
}