{
  "url": "https://www.wikihow.com/Respond-to-Sarcasm",
  "title": "How to Respond to Sarcasm",
  "steps": [
    {
      "title": "Stop, Process.",
      "content": "Stop, Process. Immediately following the application of the device \"sarcasm\", take a second to decide why it was used. Was it used for humor, insult, or a dorky way for history teachers to connect to their rad students? Follow these tips to help decide: Humor: Was the quip used quickly in a light setting? Was it followed by a smile and a longing look of approval? If so- it was probably intended humorously. Insult : Was the situation heated before the comment? Did the statement contain hurtful material? Perhaps regarding someone's recent weight gain? If any of this applies, you've probably just been dissed. Reaching out to youth: In more cases than necessary, sarcasm is used as a foolish ploy to gain youth attraction. This is usually initiated in forms of awkwardness anchored with puns and other word play. Characteristics include the phrases \"Uh-duh!\", \"NOT!\", and the topical application of \"uh-WINNING!\"."
    },
    {
      "title": "Think fast!",
      "content": "Think fast! Regardless of choice, the most important thing is to reply quickly. Any dawdling will immediately become a sign of weakness, showing limited exercise of your sarcasm muscles. A quick response ensures a hearty comeback. (On a special note, the faster you reply, the less creative your comeback has to be). [1] X Research source"
    },
    {
      "title": "Decide how to reply.",
      "content": "Decide how to reply. Will you crush your competitor with a sassy comment about her birkenstocks or simply outwit your friend with a humorous quote. Things to keep in mind while replying to sarcasm would be found in the following steps: [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Do's:",
      "content": "Do's: [3] X Research source Reply fast. Use previous knowledge on opposite. Exploit their weaknesses, mainly their weird eye tick."
    },
    {
      "title": "Don'ts:",
      "content": "Don'ts: [4] X Research source Cry (anywhere besides a Meg Ryan rom-com, crying is unnecessary). Use commonly used sarcastic replies (see Reaching out to youth). Back down, once a comment is said, it's out there. Don't go back, man."
    },
    {
      "title": "Disarm them.",
      "content": "Disarm them. Sarcasm loses its edge when you respond properly. Try one of the following: Correct them. Explain the facts clearly and calmly. This response has the bonus that it can be combined with the laughter of step 3. But be prepared that the sarcastic won't care for your explanations since he or she is not on a lookout for justice. Ignore it. They won't use sarcasm if they don't see any effect. Either pretend you didn't understand, or continue with the conversation. But your price for peace here is sleepless nights (one or more) when you're kept awake with regret and contempt. Agree. Be sarcastic about their sarcasm. Be careful, however, as this can extend into a game of wits and the most sarcastic person walks away the winner, often leaving misunderstandings in its wake."
    },
    {
      "title": "Remember when to walk away.",
      "content": "Remember when to walk away. A person who can only respond with sarcasm probably isn't worth listening to. But walking away leaves the sarcastic person pleased with his win and you emotionally devastated. [5] X Research source"
    }
  ]
}