{
  "url": "https://www.wikihow.com/Message-Someone-on-YouTube",
  "title": "How to Message Someone on YouTube",
  "steps": [
    {
      "title": "Open YouTube.",
      "content": "Open YouTube. Go to https://www.youtube.com/ in your computer's web browser. This will open your YouTube home page if you're logged into your YouTube account. If you aren't signed into your YouTube account, click SIGN IN in the upper-right corner of the page, then enter your email address and password."
    },
    {
      "title": "Go to a user's channel.",
      "content": "Go to a user's channel. Type a user's name into the search bar at the top of the YouTube home page, press ↵ Enter , and select their name in the results. This will open their channel page. You can also go to a video that the user has uploaded and then click their name below the video player. If you're subscribed to the person whom you want to message, you can click their name below the \"SUBSCRIPTIONS\" heading on the left side of the page."
    },
    {
      "title": "Click the ABOUT tab.",
      "content": "Click the ABOUT tab. It's near the top-right side of the channel's page. If there is no ABOUT tab on the user's page, you cannot send them a message."
    },
    {
      "title": "Click the \"Message\" icon.",
      "content": "Click the \"Message\" icon. It's the speech bubble-shaped icon below the \"Stats\" section of the YouTube channel page. Doing so prompts a pop-up window. [1] X Research source If you don't see the \"Message\" icon, the user may not accept messages, or they may have age-restricted content on their channel."
    },
    {
      "title": "Enter your message.",
      "content": "Enter your message. Click the \"Enter your message\" text field in the middle of the pop-up window, then type in your message. You can enter a message of up to 1500 characters."
    },
    {
      "title": "Click SEND.",
      "content": "Click SEND . It's a blue button in the bottom-right corner of the window. This will send the message to the channel's inbox."
    },
    {
      "title": "Open YouTube.",
      "content": "Open YouTube. Go to https://www.youtube.com/ in your computer's web browser. This will open your YouTube home page if you're logged into your YouTube account. If you aren't signed into your YouTube account, click SIGN IN in the upper-right corner of the page, then enter your email address and password."
    },
    {
      "title": "Click your profile picture.",
      "content": "Click your profile picture. It's a circular picture in the upper-right corner of the page. Doing so prompts a drop-down menu."
    },
    {
      "title": "Click Creator Studio.",
      "content": "Click Creator Studio . You'll find this option in the drop-down menu. This will open your Creator Studio page ."
    },
    {
      "title": "Click COMMUNITY.",
      "content": "Click COMMUNITY . It's a tab on the left side of the page. Clicking this prompts the COMMUNITY menu to expand."
    },
    {
      "title": "Click Messages.",
      "content": "Click Messages . This option is in the COMMUNITY menu. Doing so opens a list of your messages."
    },
    {
      "title": "Find a message.",
      "content": "Find a message. Scroll through your messages until you find the message to which you want to reply. If you don't find your message in the main Approved messages tab, look for it in the Filtered messages and Likely spam tabs."
    },
    {
      "title": "Click Reply.",
      "content": "Click Reply . It's a grey link below the message's text. Doing so opens a text box below the message."
    },
    {
      "title": "Enter your message.",
      "content": "Enter your message. Type your reply into the text box below the original message."
    },
    {
      "title": "Click Reply.",
      "content": "Click Reply . It's a blue button below the bottom-right corner of the message. Doing so will send your reply to the original message's sender."
    }
  ]
}