{
  "url": "https://www.wikihow.com/Practice-Self-Care",
  "title": "How to Practice Self Care",
  "steps": [
    {
      "title": "Manage stress.",
      "content": "Manage stress. Make attempts to manage and reduce stress in your life. Sources of stress might include having a lot to do with work, school, or taking care of someone else. Identify what you have control over, which is usually just your reaction to the stress. [1] X Research source Practicing relaxation techniques will increase energy, motivation, and productivity. Some simple techniques to reduce stress include: [2] X Research source Taking 5-30 minutes every morning for meditation or morning pages. Using imagery by finding a quiet spot, closing your eyes, and using all of your senses to imagine a deeply relaxing and peaceful scene. Imagine a space that's meaningful and calming for you. Trying progressive muscle relaxation, where you alternatively tense and relax the muscles throughout your body. Practicing deep breathing. [3] X Expert Source Leah Morris Life Coach Expert Interview. 19 June 2020. Trying tai-chi or yoga. Keeping a journal. Taking a hot bath or shower."
    },
    {
      "title": "Surround yourself with supportive people.",
      "content": "Surround yourself with supportive people. Spend time with friends, family, and others who make you feel good about yourself. Choose people who respect your needs and boundaries. Make sure the people you spend time with are considerate, reliable, and supportive of your goals. Avoid people who drain you, belittle you, or stress you out. [4] X Research source"
    },
    {
      "title": "Make time for fun.",
      "content": "Make time for fun. It's important to make time for fun and leisure, especially when you're stressed. Remember to engage in a variety of things for fun and involve other people. Try one of these ideas: Have a date night once a week with your spouse or with your friends. Re-read a favorite book. Watch a favorite movie. Find a hobby to enjoy. Listen to peaceful music. Buy an adult coloring book."
    },
    {
      "title": "Consider counseling.",
      "content": "Consider counseling. Know when you're feeling overwhelmed and don't be afraid to seek professional help. Needing to talk to somebody doesn't make you broken, it makes you human. Put effort into finding somebody you can trust and connect with. If you're not able to form a relationship with your therapist, the arrangement won't be beneficial. Counseling is beneficial to self-care because it: [5] X Research source Gives you a safe place to talk and process. Helps you deal better with daily stressors and worries. Allows you to get an objective opinion. Encourages you to live a better life."
    },
    {
      "title": "Give yourself affirmations.",
      "content": "Give yourself affirmations. [6] X Expert Source Leah Morris Life Coach Expert Interview. 19 June 2020. Encourage and validate yourself by saying something affirming to yourself. Pick a phrase or saying that's positive, personal, powerful, and precise. Some examples you can try: [7] X Research source “I can do this.” “I believe in myself.” “I love and accept myself.” “I am doing my best.” “This too shall pass.”"
    },
    {
      "title": "Exercise regularly.",
      "content": "Exercise regularly. Moving around does so many great things for you and can be done in the comfort of your own home! Exercise for at least 30 minutes a day, even if it's just in 10-minute intervals. It's okay if you can't exercise every single day, just aim for most days of the week. Choose activities that are fun and interesting for you. Try to do a variety of different activities to keep things interesting. You can: [8] X Research source Take the dog for a walk. Dance in your house. Do yard work. Join an exercise class at a local gym. Stretch or do yoga. Reader Poll: We asked 866 wikiHow readers, and 58% said that the most satisfying and effective way to practic self-care is through exercise and physical activity. [Take Poll]"
    },
    {
      "title": "Eat healthy foods.",
      "content": "Eat healthy foods. [9] X Expert Source Leah Morris Life Coach Expert Interview. 19 June 2020. Eating healthy foods will help keep you energized and your body healthy. When you're busy working or taking care of others, it can be difficult to plan and cook a healthy meal for yourself. Eventually though, the easy foods you tend to grab are going to drain you and leave you feeling unhealthy. Some ways to modify your diet a little to better take care of yourself: Eat whole grains. Eat more dark green vegetables. Eat a variety of fresh or frozen fruit. Choose low-fat or fat-free dairy products. Try a variety of lean proteins. Eat regular meals and snacks."
    },
    {
      "title": "Get adequate sleep.",
      "content": "Get adequate sleep. Make sure you're getting enough sleep each night. Most people need about 7-9 hours to feel at their best the next day. It can be difficult to take care of your sleep schedule when your stressed, overworked, busy with work or school, or caring for a sick loved one. Try to: Set a goal of when you want your bedtime to be and try to stick to it. Make sure your bedroom is free of distractions, such as the television. Get a sleep and exercise tracker, such as a FitBit, that tracks the quality of your sleep. Make your bedroom a peaceful place, with clean linens, comfortable bedding, and soft lighting."
    },
    {
      "title": "Monitor your physical health.",
      "content": "Monitor your physical health. Another practice of good physical self-care is ensuring you monitor your physical health. When you're sick, take time off work or school. Schedule regular appointments with your doctor. Make sure you're taking any prescriptions consistently and accurately. [10] X Research source Take time to appreciate every amazing thing your body does. Remember that your body is working to keep you alive, so take care of it well. Pay attention to body sensations and notice spots of attention."
    },
    {
      "title": "Take a vacation.",
      "content": "Take a vacation. Schedule time-off from your responsibilities. Vacations don't necessarily have to be yearly trips to the beach, as those can be stressful and expensive. Vacations can be mini-breaks that you take from stress throughout the week or month. For example, schedule time off just for quiet and relaxation for half an hour every day. Find places inside or outside your home that are comforting to you. If you are able to take a trip away from home, plan your vacation so that it's not more work and stress for you. Don't schedule too many activities and over-extend yourself."
    },
    {
      "title": "Make time for intimacy.",
      "content": "Make time for intimacy. Physical touch is comforting, reassuring, and stress reducing. Hug a friend. Cuddle or hold hands with your partner. Don't neglect your sex life."
    },
    {
      "title": "Schedule regular breaks.",
      "content": "Schedule regular breaks. Make sure you take breaks to get up, walk around, and clear your thoughts at work when you're stressed. Don't work through your lunch break. Consider getting up to stretch or talk to coworkers to re-energize yourself. Also take regular breaks to get water. [11] X Research source"
    },
    {
      "title": "Make your workplace comfortable.",
      "content": "Make your workplace comfortable. Try to create a workspace that makes you feel calm, capable, and motivated. This will reduce your stress load and help you feel more productive at work. You can: [12] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Buy plants for your office or cubicle. Declutter your desk. Make sure your chair is comfortable and adjusted well. Wear noise-canceling headphones to give yourself some quiet while working. Sit near a window for natural light, which is better than fluorescent lighting."
    },
    {
      "title": "Know when to negotiate.",
      "content": "Know when to negotiate. To better enjoy your job and reduce your stress load, know when to negotiate and when to ask for help. This will allow you to feel more empowered and less alone at work. Don't be afraid to advocate for yourself for a raise or promotion. Don't be afraid to ask for help from colleagues, superiors, or clients. Seek out opportunities for supervision, consultation, or training. [13] X Research source"
    },
    {
      "title": "Don't take work home with you.",
      "content": "Don't take work home with you. In order to keep better work-life balance and reduce stress, try to avoid taking any work home with you. This means avoiding taking physical work home, as well as avoiding thinking about work while you're at home. If you work from home, schedule specified times for work-related tasks and don't let them interfere with home tasks. For example, after 5 p.m. make sure you stop checking emails or answering calls for work, even though you may technically be available. Keep a work space at home that's separate from your other spaces. [14] X Research source"
    },
    {
      "title": "Put your own needs first.",
      "content": "Put your own needs first. It's not selfish to put your own needs first. In fact, you'll be better able to help others when you've been focusing on your own health, both mentally and physically."
    },
    {
      "title": "Ask for help when you need it.",
      "content": "Ask for help when you need it. It can be difficult to ask for or accept help when you need it. Putting up a “tough” front when you're stressed and feeling like you have to take care of everything will only drag you down. Let your friends and family help you. [15] X Research source It can be easier to ask for help if you: [16] X Research source Make a list of things you need help with. Avoid weakening your requests, instead be specific. Consider the other person's abilities and interests when asking for help."
    },
    {
      "title": "Say “no” and set limits with others.",
      "content": "Say “no” and set limits with others. Make sure you're not always the one helping everyone else out. You're only human and you can't do it all. Practice saying “no” to more responsibilities and saying “yes” to more opportunities for fun and connection with others. [17] X Expert Source Leah Morris Life Coach Expert Interview. 19 June 2020. Keep in mind not to apologize when you have to say “no.” Often times we place far too much stress on ourselves. You don't have to apologize for refusing to take on anything too overwhelming that will compromise your own well being."
    },
    {
      "title": "Practice time management.",
      "content": "Practice time management. Time management skills are essential to keep you less stressed and more productive. It's important to balance the demands in various areas of your life in order to better care for yourself. [18] X Research source Make to-do lists. Schedule professional and personal activities using a calendar. Set precise, realistic, and small goals. Stop procrastinating. Create a morning ritual and stick to it."
    }
  ]
}