{
  "url": "https://www.wikihow.com/Prepare-an-Emergency-School-Kit-for-Girls",
  "title": "How to Prepare an Emergency School Kit for Girls",
  "steps": [
    {
      "title": "Get a small bag.",
      "content": "Get a small bag. The bag should hold everything needed for the kit, and it doesn't have to be fancy. Make sure it isn't too big or see-through. You don't want people seeing what's inside when you look through your locker, especially if you have any toiletries."
    },
    {
      "title": "Add lip balm and lip gloss.",
      "content": "Add lip balm and lip gloss. This is optional, but it is good to rehydrate your lips whenever they're dry. Dry lips can be quite uncomfortable, and even painful. You always want to keep them nice for your smile!"
    },
    {
      "title": "Add deodorant.",
      "content": "Add deodorant. This is a big one for girls who are starting to mature. You don't want to walk the hallways after gym smelling all sweaty and gross. Deodorant will keep your body odor to a minimal. A travel-sized one is recommended. [1] X Research source Try picking a deodorant that includes an antiperspirant, as they will cover up sweat throughout the day."
    },
    {
      "title": "Pack your makeup.",
      "content": "Pack your makeup. While at school, it is likely that you might accidentally smudge or mess up your makeup. Rather than going the rest of the day with your makeup messed up, you can bring it with you and fix it if you need to."
    },
    {
      "title": "Add lotion.",
      "content": "Add lotion. Lotion is good when your hands begin to feel dry. You can even put it on your face if you don't wear makeup. It is also good to keep your legs moisturized for sports games and practices. [2] X Research source"
    },
    {
      "title": "Add hand sanitizer.",
      "content": "Add hand sanitizer. It is important to properly sanitize once every while during the school day, due to the many children that are there as well. You are prone to picking up multitudes of germs, so make sure you are keeping yourself sanitary."
    },
    {
      "title": "Pack some gum or mints.",
      "content": "Pack some gum or mints. If your breath doesn't smell good, just pop a piece of gum, or a mint in your mouth. You should still brush your teeth every morning. Some schools may not allow gum, so just stick with mints if that is the case."
    },
    {
      "title": "Include pads/tampons.",
      "content": "Include pads/tampons. You might get your period unexpectedly. It is a good idea to keep a box of pads or tampons in your locker or even a separate case for them. It might be a good idea to do this even if you haven't started - just in case! You could also help out a friend if they just started and haven't got any themselves! [3] X Research source"
    },
    {
      "title": "Pop in some perfume/body spray.",
      "content": "Pop in some perfume/body spray. You want to smell good in school. A clean body is good enough for most people but add perfume if you feel the need! However, body spray is less strong and a better option for school."
    },
    {
      "title": "Include tissues.",
      "content": "Include tissues. There will be a time that you will have to blow your nose and you might be embarrassed to get up and get one off the teacher's desk, so why not look for one in your bag?"
    },
    {
      "title": "Include extra supplies.",
      "content": "Include extra supplies. It is likely that during the year you will lose pencils and pens, or lend some and not get them back. Keep multiple backups and you won't have to worry about not being prepared."
    },
    {
      "title": "Take your cell phone.",
      "content": "Take your cell phone. You should not allow your phone to distract you during the day, as you are there to learn, but it is important to have a phone with you in case of emergency. Do not bring your phone to school if you are not allowed, as you are risking getting it taken away. Keep your phone on silent throughout the day so that it does not disrupt the class."
    },
    {
      "title": "Add hair ties and hairpins.",
      "content": "Add hair ties and hairpins. While doing work or physical activities, it is likely that your hair will get in your face. It is important to have multiple hair ties, in the event that one would break."
    },
    {
      "title": "Include hairspray and dry shampoo.",
      "content": "Include hairspray and dry shampoo. It is very common to wake up with greasy hair, and while most students lack the time to shower in the morning, it is important to have something to keep it looking clean."
    },
    {
      "title": "Put in a water bottle.",
      "content": "Put in a water bottle. This will keep your energy up and keep you hydrated throughout the day. If your school does not allow drinks, keep it in your bag until you visit the bathroom or another private room."
    },
    {
      "title": "Have a small snack available in your emergency school kit.",
      "content": "Have a small snack available in your emergency school kit. Don't feel like wasting your money? Buy a box of granola bars at the store and take one with you each day."
    },
    {
      "title": "Don't forget your wallet.",
      "content": "Don't forget your wallet. Your wallet may contain money, coupons, gift cards, discount cards, and dinner cards for school. Schools often hold fundraisers where you can buy items, and it is important to have money with you in the event that this happens. Keep this very safe, and try to avoid putting big amounts of money in at once."
    },
    {
      "title": "Include a compact mirror.",
      "content": "Include a compact mirror. You will need it for any makeup touch-ups, and it's particularly more convenient than constantly going to the bathroom."
    },
    {
      "title": "Include an extra pair of underwear in your school emergency kit.",
      "content": "Include an extra pair of underwear in your school emergency kit. This is useful when you are on your period. You never know when something can soak!"
    },
    {
      "title": "Add a hairbrush.",
      "content": "Add a hairbrush. You never know when your hair can be tangled! A small brush is optimal, as it does the same job and allows more space."
    },
    {
      "title": "Think about anything else you might need.",
      "content": "Think about anything else you might need. It is likely that your school has varying rules, which might allow you to bring more things."
    }
  ]
}