{
  "url": "https://www.wikihow.com/Remove-Scratches-from-a-Phone-Screen",
  "title": "How to Remove Scratches from a Phone Screen",
  "steps": [
    {
      "title": "Have toothpaste at the ready.",
      "content": "Have toothpaste at the ready. Toothpaste should already be a standard part of your medicine cabinet and morning routine. Designed to be abrasive, toothpaste can fix a plastic scratch the same way it cleans teeth. Because it is home-based and shouldn't require additional purchases, toothpaste is the recommended remedy for fixing plastic scratches . It's important to make sure the toothpaste is an actual paste, as opposed to a gel-based toothpaste. [1] X Research source In order for the scratch to work, the toothpaste needs to be abrasive. Check your toothpaste box if you're unsure about the kind of toothpaste you are using. A baking soda mixture has the same abrasive qualities as toothpaste. If you'd rather use baking soda, you can stir up a paste with two parts baking soda and one part water. Use it in the same manner."
    },
    {
      "title": "Dab the toothpaste with an applicator.",
      "content": "Dab the toothpaste with an applicator. [2] X Research source Because this is a home-based remedy, there aren't any set rules of applicator you need to use. A soft cloth, paper towel, cotton swab or toothbrush can all suit your purposes in this instance. When you dab the toothpaste, you should only use a pea-sized amount. Any more will create an unwieldy mess on your phone."
    },
    {
      "title": "Apply toothpaste to the scratch.",
      "content": "Apply toothpaste to the scratch. Once you've got your dab of toothpaste, rub it around in a gentle, circular motion. Continue doing this until the scratch is barely noticeable. Since the toothpaste is abrasive on its own, you won't need to apply too much pressure. Keep at the scrubbing until you start to see progress. Even if the scratch is too significant to be done away with entirely, the abrasion should reduce the scratch. If your scratch is significant enough, toothpaste won't be enough to fix it. Even so, it should at least reduce the look of most scratches. If the scratches are severe, you can protect the cracked screen until you're able to get it replaced. You can also protect a curved phone screen ."
    },
    {
      "title": "Clean your phone.",
      "content": "Clean your phone. Once the scratch is reduced to your liking, it's a simple process of cleaning off the toothpaste. Taking a soft, slightly damp cloth and wiping away the excess toothpaste is a good start. From there, you should take a polishing cloth and wipe away any dirt or oils that have otherwise built up on your screen. By doing this, you'll renew the look of your phone, and hopefully make your phone look better than even before the scratch. Some methods may worsen your scratches or fail to improve them, such as: coconut oil, petroleum jelly, and powdered cleansers. Beware of these methods. If the damage worsens, you will need to fix your phone screen ."
    },
    {
      "title": "Purchase a cerium oxide polish.",
      "content": "Purchase a cerium oxide polish. If your phone has a glass screen (instead of a plastic one) you'll have to use a more heavy-duty solution than toothpaste or baking soda to get scratches off your phone. In this case, a cerium oxide polish is recommended. This type of polish can be bought as a soluble powder, or in a pre-mixed form. While the pre-mixed polish is obviously the more convenient option, you'll get much better value if you buy it in its powdered form. 100g of cerium oxide powder should be more than enough when it comes to polishing your phone screen. You may want to buy a larger amount in the event of future scratching."
    },
    {
      "title": "Mix your powder into a slurry.",
      "content": "Mix your powder into a slurry. If you bought powdered cerium oxide, you'll first need to prep the mix yourself. Luckily, this is very easy, and likely worth the money you'll be saving. Pour some powder (approx. 50-100g) into a small container. Slowly add water until the solution has the consistency of dairy cream. Mix regularly as you add the water in order to make sure your measurements are correct. Measurements don't have to be perfect in the case of this polish, so long as you make sure there's enough water for the polish to soak into an applicator. This step can be disregarded completely if you buy a pre-mixed polish."
    },
    {
      "title": "Block off all vulnerable spots with tape.",
      "content": "Block off all vulnerable spots with tape. A cerium oxide polish will do a number on your device if it seeps into any of the phone's holes, including the speaker, headphone jack or charger input. It can also potentially endanger your phone's cam lens. With that in mind, you should first cordon off the area you'd like to have polished with tape. Cover up whatever parts of your phone that might have problems if they're touched by the polish. Taping up your phone before cleaning may seem overzealous, but it's highly recommended you follow through with this step before proceeding forward. In the case of a foul-up, your phone can be quickly wrecked otherwise."
    },
    {
      "title": "Apply the polish to the scratched area.",
      "content": "Apply the polish to the scratched area. Dab a smooth polishing cloth in your cerium oxide mix, and rub the scratched area in a vigorous, circular motion. Regularly check to see how the scratch is looking as you tend the area. Every 30 seconds or so, it's a good idea to wipe away the mix with the opposite end of your cloth, dab the cloth in new polish, and repeat the process for maximum effectiveness. When applying an abrasive polish, you'll want to go harder with the application than if you were simply cleaning it. Make sure not to go too hard, however. There would be nothing worse than causing new cracks in the screen while you're trying to fix old ones."
    },
    {
      "title": "Give your phone a follow-up clean.",
      "content": "Give your phone a follow-up clean. Once you've applied and cleaned off the polish, it won't hurt to give your phone a quick once-over with a polishing cloth. This will wipe away any excess debris caused by the polish process. Remove the tape you added before polishing and wipe your phone. It doesn't need to take more than a minute or two to do thoroughly, but you may be impressed how much nicer your phone looks once you've wiped away the excess muck. You should wipe your screen regularly. Twice a day may sound like a lot, but it only takes a second, and will ensure your screen stays healthy."
    },
    {
      "title": "Understand the risks.",
      "content": "Understand the risks. This method may strip the oleophobic coating of your phone, which is the coating that protects all modern smartphone screens and makes them scratch-resistant. [3] X Research source Only use this method if you plan to replace the oleophobic coating or install a screen protector afterwards."
    },
    {
      "title": "Prepare your eraser.",
      "content": "Prepare your eraser. This method will only be effective against minor scratches. If you're using a Magic Eraser , be sure to wet the sponge to soften the abrasiveness. Squeeze out excess water. If you're using a pencil eraser, be sure you're using a new eraser without any graphite markings."
    },
    {
      "title": "Using the eraser, gently scrub your screen in small circles.",
      "content": "Using the eraser, gently scrub your screen in small circles. Continue this until the scratches lessen or disappear. Results can take up to a minute of scrubbing. This method will only work for minor, surface-level scratches. This may lessen the appearance of deeper scratches, but it may not remove them entirely."
    },
    {
      "title": "Wipe your screen clean.",
      "content": "Wipe your screen clean. Make sure there is no leftover residue or eraser shavings. The scratches on your phone screen should be improved. Be sure to apply a new oleophobic coating or install a screen protector."
    },
    {
      "title": "Purchase a screen protector.",
      "content": "Purchase a screen protector. [4] X Expert Source Linh Le Certified Mobile Repair Specialist Expert Interview. 10 February 2022. Cellphones have never been so fragile and prone to scratching as they are today. Screen protectors are commonplace, and you should invest in one if you're the slightest bit worried about damaging your phone. Common phone protectors aren't generally too expensive, and they'll be much more affordable than replacing your screen or phone if the damage is bad enough. Higher-end protectors are virtually unbreakable, while affordable brands will at least take damage so your phone proper won't have to. Between a plastic screen protector and tempered glass protector, you are better off investing in the latter. [5] X Expert Source Linh Le Certified Mobile Repair Specialist Expert Interview. 10 February 2022. Tempered glass protectors offer better durability, visibility, and comfortable feel. [6] X Research source Applying a screen protector will give additional protection to your device."
    },
    {
      "title": "Wipe your screen regularly.",
      "content": "Wipe your screen regularly. Small scratches can occur on your screen if you leave excess debris on your screen. Wiping your screen clean with a microfiber or silk cloth a couple times per day will keep your phone screen looking its best. Wiping your screen is especially useful if your phone is a touchscreen, as built-up oils and fingerprints can smudge the screen and blur it up. Using clothes fabric like a shirt sleeve or even a dishcloth can also work as screen wipers, although ideally you'll want the smoothness of silk or microfiber when it comes to maintaining your screen."
    },
    {
      "title": "Stow your phone somewhere safe.",
      "content": "Stow your phone somewhere safe. Most of the time your phone is scratched or damaged, you'll be on the go somewhere. It's important to consider where scratches come from and how they're most likely to be made. Put your phone in a separate pocket than your keys or coins. If possible, place your phone in a zip-up pocket to prevent it falling out accidentally. Don't put your phone in your back pocket. On top of risking cracking if you sit down on it, there have been reports of it causing nerve problems due to the pressure it creates on your backside."
    }
  ]
}