{
  "url": "https://www.wikihow.com/Nature-Deities",
  "title": "The Ultimate Guide to the Gods and Goddesses of Nature",
  "steps": [
    {
      "title": "Asase Yaa/Asase Efua (Akan)",
      "content": "Asase Yaa/Asase Efua (Akan) Asase Yaa is the earth goddess of the indigenous Akan people, located off the Guinea Coast. She is personified as a nurturing mother, and the Akan honor her through drink and the pouring out of wine. [1] X Research source Asase Yaa’s name means “Earth” (Asase) and “Female Born on Thursday” (Yaa) because most Akan believe the earth was created on a Thursday. They treat Thursday as a day of rest to honor the earth. The Fante people near southern Ghana believe that the earth was created on a Friday. They call the earth goddess Asase Efua (“Female Born on Friday”) and treat Friday as a day of rest."
    },
    {
      "title": "Geb (Egyptian)",
      "content": "Geb (Egyptian) In Ancient Egypt, Geb was a god who represented the earth. He was said to have been born in the arms of his twin sister Nut, the goddess of the sky. Geb was also considered the father of snakes, and he was often depicted as a snake or having the head of a snake. Sometimes he was given the head of a goose. [2] X Research source Ancient Egyptians called the earth “The House of Geb.”"
    },
    {
      "title": "Ala (Igbo)",
      "content": "Ala (Igbo) To the Igbo people, Ala is the personification of the earth and a deity who controls the actions of mankind. She represents both the surface of the earth and everything below the surface. She is worshiped at shrines and is responsible for fertility and agriculture. [3] X Research source Ala is also responsible for morality and for bringing wrongdoings to light."
    },
    {
      "title": "Tonantzin (Aztec)",
      "content": "Tonantzin (Aztec) - In the Náhuatl language of the Aztec people, the name Tonantzin means “Our Mother.” Tonantzin represents the earth, and she’s honored through agricultural and fertility practices. [4] X Research source Although Tonantzin was an ancient Aztec deity, in the 1500s she became associated with the Virgin of Guadalupe. She remains an important figure to the Mexican people today. [5] X Research source"
    },
    {
      "title": "Hou Tu (Chinese)",
      "content": "Hou Tu (Chinese) According to ancient Chinese mythology, Hou Tu (后土) is the Mother of the Earth and the lord of the Underworld. She rules alongside Sheji, the god of soil and harvest. [6] X Research source She’s the source of everything beautiful, including the earth’s scenery, and she’s responsible for maintaining the balance between yin and yang. [7] X Research source Hou Tu originally began as a genderless deity but came to be recognized as a goddess."
    },
    {
      "title": "Prithvi (Hindu)",
      "content": "Prithvi (Hindu) In Hinduism, Prithvi is Mother Earth. She is also called Brumi Devi or Bhudevi, and she’s represented as a generous and nurturing figure who protects all living things. She’s often considered to be responsible for natural disasters, which are attributed to her anger. Prithvi is highly revered in the Hindu tradition and she’s honored through the practice of Bhoomi Pooja, or the protection of the earth. [8] X Research source In early texts, Prithvi was often associated with Dyaus, the god of the sky. Later, she would be depicted as the partner of Lord Vishnu, the protector of the universe. [9] X Research source"
    },
    {
      "title": "Zemes māte (Baltic)",
      "content": "Zemes māte (Baltic) In the Baltic religion, Zemes māte was revered as the Earth Mother. She’s considered to be the source and protector of all life on earth. In Baltic festivals, offerings to Zemes māte included libations of beer and the burying of herbs. [10] X Research source Offerings were also made to Zemes māte when a child was born. As Christianity became prevalent in the Baltic region, Zemes māte would become associated with the Virgin Mary."
    },
    {
      "title": "Fjörgyn & Fjörgynn (Germanic)",
      "content": "Fjörgyn & Fjörgynn (Germanic) In Norse mythology, Fjörgyn and Fjörgynn are an ancient pair of deities. Fjörgyn is an earth mother goddess and is sometimes named as the mother of Thor. Elsewhere, the goddess Jord is said to be the mother of Thor. Both the words Fjörgyn and Jord can be used to mean earth, so they may be the same person. [11] X Research source Not much is known about Fjörgynn, but he may be a sky god and the husband of Fjörgyn."
    },
    {
      "title": "Nerthus/Terra Mater (Germanic)",
      "content": "Nerthus/Terra Mater (Germanic) Nerthus was an ancient Germanic goddess who was worshipped by a number of tribes throughout the Baltic region. She is said to have enjoyed visiting her people in a chariot drawn by cows. [12] X Research source Devotees of Nerthus worshipped her at a temple on an island in the Baltic Sea."
    },
    {
      "title": "Gaia (Greek)",
      "content": "Gaia (Greek) In Greek mythology , Gaia represents the earth. She’s considered to be the mother of all living creatures. She offered prophecies at the Oracle of Delphi and helped Zeus overthrow the titans, although she later turned against Zeus. [13] X Research source Gaia was the mother of mythological figures like the Titans, Cyclopes, Furies, Giants, sea gods and goddesses, and the gods and goddesses of Olympus."
    },
    {
      "title": "Papatūānuku (Māori)",
      "content": "Papatūānuku (Māori) In the Māori tradition, Papatūānuku is both the mother of the earth and the land itself. Papatūānuku emerged from the water, then had children with Ranginui, the sky father. Their children then had more children, including birds, fish, and water. Ultimately, all living things are considered to be their descendants. [14] X Research source According to legend, Papatūānuku and Ranginui were born in darkness. Their children eventually pushed them apart to let in light, which is why the earth and sky are separated."
    },
    {
      "title": "Sun Deities",
      "content": "Sun Deities In many cultures, the sun is personified as a deity. The sun is often represented as a god, but is a goddess in a few cultures. Sun deities are often depicted as powerful and may rule over other gods and goddesses. Cultures with a variation on the sun god figure include: Nyambe/Nzambe: Bantu supreme deity and sun god [15] X Research source Anyanwu: Igbo god of Sun, prosperity, and sustenance. [16] X Research source Amaratsu: The Shintō goddess of the sun, worshipped at the Grand Shrine of Ise in Japan. The Japanese Imperial Family claim to be descendants of Ameratsu. [17] X Research source Ar/Arev: The sun god of the ancient Armenians. As a people, they were known as “Arevortik,” which meant “Children of the Sun.” [18] X Research source Apollo: Greek god of sun, crops, and herds [19] X Research source"
    },
    {
      "title": "Moon, Star, and Sky Deities",
      "content": "Moon, Star, and Sky Deities Other celestial bodies also play a prominent role in polytheistic religions. Moon deities are often represented as goddesses, although they can sometimes be gods. The stars, heavens, and sky are also considered deities in many traditions. Nut: Nut is the Egyptian goddess of the heavens and the sky. She is said to have swallowed the sun each evening before giving birth to it again the following morning. [20] X Research source Chang’e: According to Chinese tradition, after Chang’e ingested an immortality elixir intended for her husband, she was transformed into the moon. She is still celebrated in the Chinese Mid-Autumn festival. [21] X Research source Dou Mu Niang Niang: The ancient Chinese worshipped Dou Mu Niang Niang as the mother of the stars and constellations, particularly the Big Dipper. Tai Sui: The Tai Su is a collective of 60 personified stars in Chinese mythology. Each Tai Sui takes a turn ruling depending on their location in the sky. iNyanga: In the Zulu religion, iNyanga is the goddess of the moon and healers. [22] X Research source Tsukuyomi: Tsukuyomi is the Japanese god of the moon. He is also the husband of Amaratsu, the sun goddess, but Amaratsu rejected Tsukuyomi after he killed Uke Mochi, the goddess of food. [23] X Research source Mayari: Mayari is the Tagalog goddess of the moon, war, hunts, and weapons. She lost one eye during a war against Apolaki, the god of the sun. [24] X Research source Tala: Tala is the Tagalog goddess of the stars, sometimes depicted as the sister of Mayari [25] X Research source Mẫu Thượng Thiên: In the Vietnamese culture, Mẫu Thượng Thiên is the Mother of the Sky. [26] X Trustworthy Source Nature Respected Multidisciplinary Scientific Journal Go to source Nyx: In ancient Greek mythology, Nyx was the personification of night and the mother of Gaia. [27] X Research source Ranginui: Ranginui is the Māori sky father and husband of Papatūānuku [28] X Research source"
    },
    {
      "title": "Weather Deities",
      "content": "Weather Deities Weather and seasons had a profound impact on developing civilizations, from the rain needed for crops to the destructive power of storms. Weather deities played a prominent role in many cultures, and offerings were frequently made to appeal to them. Lei Gong: In ancient Chinese mythology, Lei Gong was the god of thunder. [29] X Research source Unsondo: Unsondo (also called Umvelinqangi) is the Zulu god of thunder and earthquakes. [30] X Research source Amadioha: Amadioha is the Igbo god of thunder and lightning, often called the “King of the Sky.” [31] X Research source Xevioso: To the Fon people, Xeviosa is the god of thunder and lightning. [32] X Research source Thor: Thor is the good-natured Norse god of thunder and the sky. He is said to have protected mankind from evil beings like trolls and giants. [33] X Research source Indra: The Hindu god Indra is associated with storms and rain. At one time, he was considered the supreme god in Hinduism, but he eventually took on a lesser role. [34] X Research source Vayu: The ancient Iranian god Vayu was the god of the wind and fate. He is associated with the Hindu god Vāyu. [35] X Research source Fujin and Raijin: In Japanese mythology, Fujin is the god of wind, and his brother Raijin is the god of thunder. Together, they are responsible for creating storms. [36] X Research source Susanoo: Susanoo is the Japanese god of storms and the younger brother of sun goddess Amaterasu. [37] X Research source Aja: Aja is a whirlwind goddess of the Yoruba people. She is also responsible for giving people knowledge of medicinal plants and herbs. [38] X Research source Tishtrya: Tishtrya is the ancient Iranian god of rainfall, seas, and the star Sirius [39] X Research source Agni: Angi is the Hindu god of fire, encompassing fire from the sun, lightning, and the hearth, as well as sacrificial fire. [40] X Research source"
    },
    {
      "title": "Water Deities",
      "content": "Water Deities Water was an incredibly important resource for developing cultures, and as such, it’s heavily represented in mythology. From gods and goddesses that ruled all water to deities that presided over local rivers and streams, water deities can be found from around the world: Oshun: Oshun is a water goddess revered by the Yoruba people of Nigeria. She is a protector of humans and is also associated with purity and fertility. [41] X Research source Suijin: Suijin is the god of water in the Shinto religion. He’s considered a protector of fishermen, and shrines to him are often placed near water sources. [42] X Research source Mẫu Thoải: One of the four Vietnamese mother goddesses, Mẫu Thoải rules over water. [43] X Trustworthy Source Nature Respected Multidisciplinary Scientific Journal Go to source Anahita: In Persian mythology, Anahita is the goddess of water, wisdom, health, fertility, and warfare. [44] X Research source Gong Gong: Gong Gong is the Chinese god of water. It’s said that he’s engaged in an ongoing battle with Zhurong, the god of fire, and that the battles between them are the source of natural disasters like earthquakes. [45] X Research source Tsovinar: Tsovinar is the Armenian goddess of water, the sea, thunder, and lightning. Rituals and songs were devoted to Tsovinar during droughts as an appeal for rain. [46] X Research source Varuna: Varuna is the Hindu god of the oceans and sky, as well as truth and justice. In ancient Hinduism, he was considered an extremely powerful god, and people prayed to him for good weather. [47] X Research source Njǫrd: Njǫrd was an ancient Norse god of the sea and everything in it. He was an important figure in Scandinavian culture, and many locations in Sweden are named after him. [48] X Research source Rán: A ruler of the ocean, Rán is one of the most powerful goddesses in Norse mythology. She’s sometimes depicted as being half fish. [49] X Research source Tano and Bia: Tano, also called Ta Kora, is the god of the Tano River in Ghana, and at one time may have been worshipped as the god of thunder. He is the brother of Bia, who is also a river god. [50] X Research source Sínann: According to Irish mythology, the goddess Sínann followed the stream of Segais in search of wisdom. After she drowned, the stream became a river and was named after her—The River Shannon. [51] X Research source Abnoba: Abnoba is the Celtic goddess of the Danube River. She’s associated with the Roman goddess Diana. [52] X Research source Nøkken: In Germanic mythology, Nøkken (also known as neck, nokk, and nix, among other names) were shapeshifting spirits who lived in rivers and streams. [53] X Research source"
    },
    {
      "title": "Gods and Spirits of the Forest and Wilds",
      "content": "Gods and Spirits of the Forest and Wilds The forest can be an enchanting place of bounty, but its deep, thick woods can also hide many dangers. It’s no wonder that many cultures have dedicated deities to protect and nourish woodland areas. Many forest gods and spirits are responsible for protecting the forest from greedy practices, often punishing hunters who take more than they need. Aranyani: In Hinduism, Aranyani is the goddess of the forest and the mother of all woodland animals. Large forests are sometimes referred to as “aranyani” in her honor. [54] X Research source Baianai: The Turkic god of the forest and guardian of animals. Hunters would often leave a small offering of food under a tree to ask the Baianai for protection. [55] X Research source Artio: Artio is the Celtic goddess of wildlife and abundance. She is said to have been able to transform into a bear. She’s associated with the Greek goddess Artemis. [56] X Research source Arduinna: Arduinna is the Celtic goddess of the Ardennes forest. She is often depicted as riding a large boar and is associated with the Greek goddess Diana. [57] X Research source Selvans: Selvans was the Etruscan god of woodlands and individuality. When the Romans took over the Etruscan region, they rededicated his temple to Genius. [58] X Research source Tapio: In Finnish mythology, Tapio is the god of the forest and the ruler of game. He’s sometimes depicted as a tree, and sometimes as a female. [59] X Research source Dali: In Georgian mythology, Dali was the goddess of the wilderness, nature, and animals. She was believed to be able to transform into animals and is particularly associated with deer. [60] X Research source Pan: Pan is a Greek god who ruled over wilderness, hills, and herds. He is often depicted as having horns, legs, and ears like a goat, and is said to have played the flute. [61] X Research source His Roman counterpart is Faunus. [62] X Research source Silvanus: Silvanus is the Roman god of the countryside. He often appears as a farmer or peasant. As human cities grew, Silvanus was adopted as the patron of parks and gardens. [63] X Research source Feronia: Feronia is a Sabine goddess of wilderness and the wild woods. She was adopted by the Romans and a temple to her was built in Rome. [64] X Research source Berstuk: Berstuk is an evil forest god of the Wendish and Slavic religions. He’s said to have a moss-covered beard and the feet of a goat. [65] X Research source Tāne: In the Māori tradition, Tāne is the great god of the forest. He is also attributed as the creator of the world. [66] X Research source Curupira: In Brazilian mythology, the curupira is a tiny human-like spirit with green or black skin, bright red hair, and backwards feet. They are said to protect the forests from poachers, loggers, and other dangers. [67] X Research source Leshy: The leshy is a Slavic forest spirit who can often be heard whistling, singing, or laughing. On the rare occasions that he appears to a person, he’s identifiable by his pointed head and missing eyebrows, eyelashes, and right ear. [68] X Research source Yum Kaax: Yum Kaax is a Mayan god whose name means “Lord of the Forest.” He was the protector of the forest and wildlife, and it was tradition to pray to him for permission before going on a hunt. [69] X Research source"
    },
    {
      "title": "Mountain Deities",
      "content": "Mountain Deities Mountains are ever-present and imposing, but because their terrain is difficult, they’re also mysterious. Many cultures dedicated gods, goddesses, and spirits to the mountains, volcanoes, hills, and rocks that made up their landscapes. L’inglesou {endbold} In Haitian Vodou, l’inglesou is a dangerous and vengeful loa, or spirit, that lives in rocky areas. [70] X Research source Red roosters are still offered to him as ceremonial sacrifices. [71] X Research source Sanshan Guowang: The Sanshan Guowang are three mountain gods worshipped in Southern China. A temple to them still stands in the Toushe Basin in Taiwan. [72] X Research source Sansin: The Sansin are Korean spirits that are responsible for guarding mountains. They are associated with mountain tigers. Festivals dedicated to the Sansin are still observed in Korea today. [73] X Research source Mariang Sinukuan: Sometimes called Apúng Sinukuan, this Philippine goddess is represented by Mount Ararat. She is said to be responsible for the animals and fruits of the forest. [74] X Research source Kaon: Also known as Kan-Laon or Lalaon, this Philippine goddess lives in Mount Kanlaon. She is responsible for both harvest and pestilence. [75] X Research source Mẫu Thượng Ngàn: Mẫu Thượng Ngàn is one of the Vietnamese mother goddesses. She rules over mountains and forests. [76] X Research source Tản Viên Sơn Thánh: Tan Vien, sometimes called Son Tinh, is the Vietnamese god of the Ba Vi mountains. A festival in his honor is still observed today. [77] X Research source Skaði: Skaði, or Skadi, is the Germanic goddess of the wilderness and mountains. Originally a giantess, she was accepted into Asgard after marrying Njord, the god of the sea. [78] X Research source Ullr: Ullr is the Germanic god of winter and mountains. He was also responsible for Asgard when Odin was travelling. [79] X Research source Oxylus: Oxylus, or Oxylos, is a Greek demi-god of mountains and forests. [80] X Research source Rūaumoko: Rūaumoko is the Māori god of volcanoes, earthquakes, and seasons. [81] X Research source"
    },
    {
      "title": "Agriculture and Fertility Deities",
      "content": "Agriculture and Fertility Deities Agriculture and fertility often go hand-in-hand, and deities that oversee the land are also often responsible for human conception and childbirth. These gods and goddesses often represent love and light, but they may also be associated with the entire life cycle, including war and death. Nomkhubulwane: Nomkhubulwane, also known as Mbaba Mwana Warea, is the Zulu goddess mother of fertility, agriculture, and rain. She is still a beloved figure in Zulu culture today. [82] X Research source Xochiquetzal: Xochiquetzal is the Aztec goddess of flowers, plants, beauty, and love. In some myths, she also governs fresh water. [83] X Research source Pachamama: Pachamama is an Incan goddess who symbolizes fertility, nature, and the earth. A festival in her honor is still celebrated each year in August. [84] X Research source Jacheongbi: According to Korean mythology, Jacheongbi was born as a human, but she journeyed to the magical realm in search for Mundoryeong, a prince of that realm. After completing a number of trials, she returns to the human world to become the god of agriculture. [85] X Research source Abu: Abu is the Sumerian god of vegetation, light, and fertility. He represents the cycle of seasons and farming. [86] X Research source Emesh: In ancient Sumer, Emesh was the god of summer and the creator of fertile fields. He was often depicted as a peasant or farmer. [87] X Research source Cernunnos: Cernunnos is the Celtic god of wild things. He’s associated with fertility and produce, and he’s often depicted as having or wearing antlers. [88] X Research source Sucellus: In the Celtic tradition, Sucellus was the god of agriculture and feasting. He is usually depicted with a dog by his side. [89] X Research source Freyja: Freya is the Norse goddess of fertility, love, and war. She is usually depicted as riding a boar with golden bristles. [90] X Research source Freyr: The brother and partner of Freyja, Freyr was the Norse god of fertility, rain, sunshine, and peace. The boar was his symbol as well. [91] X Research source Aphrodite: Aphrodite is the Greek goddess of fertility, love, beauty, the sea, and war. She’s associated with the Roman goddess Venus. [92] X Research source Aristaios: Aristaios, or Aristaeus, was the Greek god of shepherds, cheesemaking, bee-keeping, honey, olives and oil, medicinal herbs, and the Etesian winds. [93] X Research source Artemis: Artemis is the Greek goddess of childbirth, fertility, wild animals, and the hunt. She’s associated with the Roman goddess Diana and the Lithuanian goddess Medeina. [94] X Research source Cybele: The Roman goddess Cybele is associated with fertility. Cybele’s priests were dedicated through a gruesome ceremony that involved, among other things, the sacrifice of a bull. [95] X Research source Demeter: Demeter is the Greek goddess of fertility, harvest, and crops. She is associated with the Roman goddess Ceres. Both are mother figures—Demeter is the mother of Persephone, who was taken to the Underworld by Hades. [96] X Research source Persephone: Persephone is the daughter of Demeter and the wife of Hades. She is both the queen of the Underworld and the goddess of spring. [97] X Research source Jarilo: Jarilo, also known as Gerovit or Yarylo, is the Slavic god of fertility and spring. He is often depicted as having an olive branch in one hand and a sword in the other. [98] X Research source"
    },
    {
      "title": "Plants and Healing",
      "content": "Plants and Healing Many cultures have deities that oversee beneficial plants. They’re often responsible for sharing the medicinal benefits of plants with humans, and they may be depicted in animal form. Osanyin: The Yoruba god (or orisa) Osanyin is said to rule over roots, leaves, and herbs, and uses them for healing. He is often depicted as a bird on an iron bar. [99] X Research source Ningikuga: This Baylonian goddess ruled over marshes and reeds. She is said to have been responsible for purifying the earth. [100] X Research source Xochipilli: Xochipilli is the Meoamerican god of summer and flowers. He’s often depicted as youthful, playful, and mischievous. [101] X Research source Damu: Damu was an Egyptian god of vegetation, particularly the sap that flows through trees. Ningishzida: Ningishzida was a Mesopotamian god of trees, especially twisted tree roots. He’s depicted as a serpent or as a man with serpents growing from his shoulders. [102] X Research source Ameretat: Ameretat is an Iranian plant goddess. She also represents immortality. Chloris: Chloris is a nymph and the Greek goddess of flowers. Her Roman counterpart is named Flora. [103] X Research source"
    },
    {
      "title": "Minor Nature Deities",
      "content": "Minor Nature Deities In addition to the major gods, goddesses, and spirits that ruled the natural world, many cultures had a variety of minor deities. These creatures were said to inhabit plants, bodies of water, and the land. They include: Anthousae: Greek flower nymphs [104] X Research source Dryads: Greek tree and forest nymphs Nymphs: Greek nature spirits Epimelides: Highland pasture nymphs of Greece Naiads: Fresh water nymphs of Greece Nereids: Greek sea nymphs Ngen: Native American Green Man spirits that protect the forests [105] X Research source Dokkaebi: Mischievous Korean nature spirits [106] X Research source"
    }
  ]
}