{
  "url": "https://www.wikihow.com/Pass-Safely-on-a-Two-Lane-Road",
  "title": "How to Pass Safely on a Two Lane Road",
  "steps": [
    {
      "title": "Look at traffic signals and lane markings to ensure passing is legal.",
      "content": "Look at traffic signals and lane markings to ensure passing is legal. Check for signs indicating whether you're in a designated passing zone or non-passing zone. If you're unsure, look at the lane markers. [1] X Research source A solid yellow line indicates it's unsafe to pass into oncoming traffic. A single dotted yellow line or a solid yellow line with a dotted line on your side of traffic indicates that it's a safe move."
    },
    {
      "title": "Evaluate the conditions.",
      "content": "Evaluate the conditions. Look around you, and check to be sure that there are no conditions that could prohibit you from making a safe pass. Be aware of upcoming hills or curves, traffic stop signs or lights, and train tracks. [2] X Research source Tunnels, bridges and viaducts can obstruct your view. If you see any up ahead, wait until you have passed them to consider a move. Do not attempt to pass a slow moving car if you're driving on a hill or curve because you'll have limited vision. Wait for a long stretch of flat road. Be aware of driveways and other entrances where cars may unexpectedly come from. If the weather is rainy, foggy or snowy, consider staying in your lane as these types of conditions can cause you to slip or they can make it more challenging to see ahead. Check your surroundings for animals, like deer, that can run into the middle of the road."
    },
    {
      "title": "Check surrounding traffic.",
      "content": "Check surrounding traffic. Look ahead to the other lane, and notice traffic following behind you, and check for vehicles in front of the one you plan to pass. [3] X Research source Establish there is no oncoming traffic that will come within 200 feet (0.061 km) of you in the passing lane. Do not pass if you can't see .25 miles (0.40 km) ahead. Look at your rear-view and side mirrors for traffic coming from behind you right before you move into the opposite lane to pass. Then check for oncoming traffic once again."
    },
    {
      "title": "Ensure you can pass without going over the speed limit.",
      "content": "Ensure you can pass without going over the speed limit. It can be frustrating to be behind someone driving slow, but if they are driving less than 15 miles (24 km) under the speed limit, it may be best to stay put. [4] X Research source You'll have to increase your speed up to 20 miles (32 km) to pass, so be sure you're aware of the speed limit where you are. Be aware that speed limits can drop dramatically, up to 30 miles (48 km), along some country roads upon arriving in a town."
    },
    {
      "title": "Have a backup plan.",
      "content": "Have a backup plan. Ensure that you have enough space between the vehicle in front of you and any behind you so that you have an opening if you need get back into your lane without passing. Use the two-second rule. Count one thousand one, one thousand two after the car in front of you has passed a marker of some kind to be sure you have enough space. A sign, tree or lamppost works as a marker."
    },
    {
      "title": "Accelerate slowly.",
      "content": "Accelerate slowly. Give yourself at least one vehicle length distance between the front end of your car and the back end of the one you're passing. Avoid being aggressive with your speed and give yourself plenty of time and space between the vehicle. Don't slam on the gas to safely arrive in front of the slow car."
    },
    {
      "title": "Use your turn signal.",
      "content": "Use your turn signal. Alert the slow driver of your maneuver by using your turn signal. look over your shoulder and check your mirrors as you start to make a pass."
    },
    {
      "title": "Smoothly pass over the dotted lane marker.",
      "content": "Smoothly pass over the dotted lane marker. Look ahead to be sure there is still no traffic coming up ahead. If it's safe, swiftly accelerate to a speed that does not exceed the speed limit. You should be able to make the maneuver in roughly 15 seconds."
    },
    {
      "title": "Quickly pass the vehicle.",
      "content": "Quickly pass the vehicle. Glance at both your side and rear-view mirrors to determine the position of the vehicle you just passed. Always keep an eye on the vehicle you're passing to be sure they don't speed up or move in an unexpected way. Keep both hands on the wheel the whole time. Be on alert."
    },
    {
      "title": "Signal your re-entry to the appropriate lane.",
      "content": "Signal your re-entry to the appropriate lane. Put on your turn signal after moving about two car lengths in front of the vehicle you are passing. Smoothly cross back into the lane. Maintain your desired speed without exceeding the limit. Glance in your rear-view to check the distance of yourself and the car you passed."
    }
  ]
}