{
  "url": "https://www.wikihow.com/Plant-Azaleas",
  "title": "How to Plant Azaleas",
  "steps": [
    {
      "title": "Pick the right azalea for your garden.",
      "content": "Pick the right azalea for your garden. Azaleas are popularly grown in the southeastern United States because they do well with mild winters and long summers. Azaleas are hardy plants that don't need much care. Different types of azaleas have slightly different needs, so pay attention to what type you pick out to ensure you'll be satisfied with the results. Azaleas are available in two main classes: Native azaleas grow like small trees and don't need pruning. Most are deciduous (lose leaves in the winter) and are able to tolerate warmer temperatures. [1] X Research source Asian azaleas grow as shrubs and are available in two varieties, both of which are evergreen: Kurume hybrids. These are bright red and keep well-contained in one area. They can be planted in containers, raised beds or directly in the ground, and won't get larger than 3 or 4 feet (0.9 or 1.2 m) tall. They don't require much maintenance. Southern Indian hybrids , on the other hand, grow very tall and large. They come in many colors, notably hot pink and white and can easily grow tall enough to cover a window or door. If you have a lot of space, this might be a good choice for you, but you may have to prune them from time to time. The Azalea Society or your local nursery can make recommendations on the type of azalea to plant in your area. There are hybrid descriptions and examples online or in local garden and landscaping shops. Stick with one type of azalea or incorporate several different colors and species into the garden for variety. – The choice is yours."
    },
    {
      "title": "Choose a shady planting spot.",
      "content": "Choose a shady planting spot. Find a place in the garden or yard with some shade - \"dappled shade,\" as many azalea enthusiasts term it. This particular mix of shade and sunlight is perfect for azaleas. If you plant them in full sunlight, they won't grow as well. According to the Azalea Society of America, azaleas bloom well when planted under shady trees. There are deciduous azalea varieties that do well with full sun, so check into these if you don't have much shade available."
    },
    {
      "title": "Make sure the soil drains well.",
      "content": "Make sure the soil drains well. Azaleas need soil that drains very well, rather than retaining water after a rain. To determine whether the soil drains well where you want to plant your azalea, dig a hole before it rains, then check back afterward. If the hole is filled with standing water, the soil doesn't drain well; it's likely highly composed of clay. If the water is gone, the soil should be fine for azaleas. If the soil doesn't drain well, you can mix it with compost or other organic matter in order to loosen it up. Till it to a depth of several feet to break it up, then mix in the other well-draining matter. Another option is to plant your azalea in a pot or a raised bed, where you can control the soil drainage more easily."
    },
    {
      "title": "Determine the soil's acidity.",
      "content": "Determine the soil's acidity. Azaleas prefer a slightly acidic soil, such as a pH 5.5 or pH 6. If a soil test reveals an alkaline soil, mix some sulfur into the dirt before planting to balance it. Avoid planting azaleas near concrete sidewalks, driveways or foundations that may leach out lime (which can raise the pH of the nearby soil.) [2] X Research source"
    },
    {
      "title": "Dig a hole and plant the azalea.",
      "content": "Dig a hole and plant the azalea. Use a garden shovel to dig a hole in the dirt deep enough to cover the root and bottom of the plant. Remove the azalea from its container and loosen the roots. If it is pot-bound (roots tightly circling and too close together) you may need to cut some roots in order to do this. Dig a few inches wider than the ball of the root, and set the azalea upright in the hole so that the top of the root ball is slightly above the surface of the ground. Drop soil into the hole around the plant. Spread it around and under the azalea, and lightly pat it into place with your fingertips. Wet the azalea before planting. Dip the root ball in a bucket of water, or use a hose to lightly dampen it, before setting the azalea into the ground. [3] X Research source If you are planting more than one azalea, make sure the holes are space several feet apart."
    },
    {
      "title": "Water the azalea plant.",
      "content": "Water the azalea plant. Water the plant and the soil slowly and thoroughly. Water again the day after planting. The plants must be watered at least once per week, unless they are in direct sunlight, in which case they must be watered more frequently. Take care not to let the azalea dry out, or it will wither."
    },
    {
      "title": "Keep the azalea well-mulched.",
      "content": "Keep the azalea well-mulched. Use pine bark, pine needles, sawdust or wood chips between the bushes. This will keep the soil moist and the temperature of the dirt even. Mulch will also help keep out weeds. A good time to re-apply mulch might be after the blooms have faded."
    },
    {
      "title": "Only fertilize the azalea if required.",
      "content": "Only fertilize the azalea if required. If your soil is rich and acid, there is probably no need to fertilize and generally azaleas grow quite well without extra nutrients. In fact, over-fertilizing is often worse than not fertilizing at all since their shallow root systems can be damaged by fertilizer. [4] X Research source If you do need to fertilize, do it in spring, right after the azalea blooms. Use an acid forming fertilizer like cottonseed meal, or choose a special azalea fertilizer. Improper fertilizing can also cause the plant to bloom at the wrong time, so be sure to fertilize only if required."
    },
    {
      "title": "Trim away dead branches in the spring.",
      "content": "Trim away dead branches in the spring. Pruning azalea plants early will allow the plant's energy to be directed toward producing new growth. Assess your azalea to find dead branches and other spots that need trimming. Use a pair of hand clippers to thin the azaleas. Clip out any dead branches. Don't go overboard with this early-season pruning. Each healthy branch you cut away is a branch that could have produced beautiful spring flowers. If you want to drastically change the shape of your azalea, wait until later in the summer."
    },
    {
      "title": "Do a light pruning after the blooms fade.",
      "content": "Do a light pruning after the blooms fade. Now is the time to reshape your azalea shrub if you wish. Cut long, stray shoots next to woody branches to retain the azalea's natural form. Trim back areas that seem too crowded to promote air flow and improve the look of the bush. Be sure you make careful cuts - don't use hedge clippers to trim the bush willy nilly. Don't prune too late in the year. Prune no later than 3 weeks after the blooms have gone - otherwise, you'll be cutting away next year's flower growth."
    },
    {
      "title": "Do a drastic pruning when necessary.",
      "content": "Do a drastic pruning when necessary. If you have an azalea that has grown to large proportions and you're ready to cut it back, you can safely cut it to within a foot of the ground and it will grow back bushy and beautiful. Do it after the blooms of spring have faded, so the plant has time to reestablish itself before the next phase of growth."
    }
  ]
}