{
  "url": "https://www.wikihow.com/Set-Goals",
  "title": "How to Create Goals (That You Can Actually Achieve)",
  "steps": [
    {
      "title": "Determine your life goals.",
      "content": "Determine your life goals. Ask yourself some important questions about what you want for your life. What do you want to achieve: today, in a year, in your lifetime? The answers to this question can be as general as \"I want to be happy,\" or \"I want to help people.\" [1] X Research source Consider what you hope to attain 10, 15, or 20 years from now. A career life goal might be to open your own business. A fitness goal might be to become fit. A personal goal might be to have a family one day. These goals can be incredibly broad."
    },
    {
      "title": "Break the big picture down into smaller and more specific goals.",
      "content": "Break the big picture down into smaller and more specific goals. [2] X Expert Source Sydney Axelrod Certified Life Coach Expert Interview. 30 June 2020. Consider areas of your life that you either want to change or that you feel you would like to develop with time. Areas might include: career, finances, family, education, or health. Begin to ask yourself questions about what you'd like to achieve in each area and how you would like to approach it within a five year time frame. [3] X Research source For the life goal “I want to be fit,” you might make the smaller goals “I want to eat more healthily” and “I want to run a marathon.” [4] X Expert Source Sydney Axelrod Certified Life Coach Expert Interview. 30 June 2020. For the life goal “I want to open my own business,” the smaller goals may be “I want to learn to manage a business effectively” and “I want to open an independent book store.”"
    },
    {
      "title": "Write goals for the short term.",
      "content": "Write goals for the short term. Now that you know roughly what you want to accomplish within a few years, make concrete goals for you to begin working on now. [5] X Expert Source Sydney Axelrod Certified Life Coach Expert Interview. 30 June 2020. Give yourself a deadline within a reasonable time frame (no more than a year for short-term goals). Writing your goals will make them harder to ignore, consequently making you accountable for them. To become fit, your first goals may be to eat more vegetables and to run a 5k. To open your own business, your first goals may be to take a bookkeeping class and to find the perfect location for your bookstore."
    },
    {
      "title": "Make your goals smaller steps that move you towards larger life goals.",
      "content": "Make your goals smaller steps that move you towards larger life goals. Basically, you need to decide why you're setting this goal for yourself and what it will accomplish. [6] X Expert Source Sydney Axelrod Certified Life Coach Expert Interview. 30 June 2020. Some good questions to ask yourself when figuring this out are: does it seem worthwhile? Is now the right time for this? Does this match my needs? [7] X Research source For example, while a short-term fitness goal might be to take up a new sport within six months, ask yourself if that will help you reach your bigger goal of running a marathon. If not, consider changing the short term goal to something that will be a step towards meeting the life goal."
    },
    {
      "title": "Adjust your goals periodically.",
      "content": "Adjust your goals periodically. You may find yourself set in your ways concerning broad life goals, but take the time to re-evaluate your smaller goals. Are you accomplishing them according to your time frame? Are they still necessary to keep you on track towards your larger life goals? Allow yourself the flexibility to adjust your goals. [8] X Research source To become fit, you may have mastered running 5K races. Perhaps after you have run a few and worked on improving your personal best times, you should adjust your goal from “run a 5K” to “run a 10K.” Eventually you can move to “run a half marathon,” then “run a marathon.” To open your own business, after completing the first goals of taking a bookkeeping class and finding a location, you may set new goals to obtain a business loan to purchase a space and to apply for the proper business licensing through your local government. Afterwards, you can move towards buying (or leasing) the space, then obtaining the books you need, hiring staff, and opening your doors to business. Eventually you may even work towards opening a second location!"
    },
    {
      "title": "Make your goals specific.",
      "content": "Make your goals specific. When setting goals, they should answer the highly specific questions of who, what, where, when, and why. For each specific goal you make, you should ask yourself why it is a goal and how it helps your life goals. [9] X Research source To become fit (which is very general), you have created the more specific goal “run a marathon,” which begins with the short-term goal “run a 5K.” When you set each short-term goal—such as running a 5K, you can answer the questions: Who? Me. What? Run a 5K. Where? At Local Park. When? In 6 weeks. Why? To work towards my goal of running a marathon. To open your own business, you have created the short-term goal “take a bookkeeping class.” This can answer the questions: Who? Me. What? Take a bookkeeping class. Where? At the Library. When? Every Saturday for 5 weeks. Why? To learn how to manage a budget for my business."
    },
    {
      "title": "Create measurable goals.",
      "content": "Create measurable goals. [10] X Expert Source Sydney Axelrod Certified Life Coach Expert Interview. 30 June 2020. In order for us to track our progress, goals should be quantifiable. \"I'm going to walk more\" is far more difficult to track and measure than \"Every day I'm going to walk around the track 16 times.\" Essentially, you'll need a few ways of determining if you're reaching your goal. [11] X Research source “Run a 5K” is a measurable goal. You know for certain when you have done it. You may need to set the even shorter-term goal of “run at least 3 miles (4.8 km), 3 times every week” to work towards your first 5K. After your first 5K, a measurable goal would be “run another 5K in one month, but take 4 minutes off of my time.” Likewise, “take a bookkeeping class” is measurable because it is a specific class that you will sign up to take and go to every week. A less measurable version would be “learn about bookkeeping,” which is vague because it’s difficult to know when you’re “finished” learning about bookkeeping."
    },
    {
      "title": "Be realistic with your goals.",
      "content": "Be realistic with your goals. It is important to evaluate your situation honestly and recognize which goals are realistic and which are a little far-fetched. Ask yourself if you have the all the things you need to complete your goal (skill, resources, time, knowledge). [12] X Research source To become fit and run a marathon, you will need to spend a lot of time running. If you do not have the time or interest to devote many hours every week to running, this goal may not work for you. If you find this is the case, you could adjust your goals; there are other ways to become fit that do not involve spending hours and hours running. If you want to open your own independent bookstore but you have no experience running a business, have no capital (money) to put towards opening the business, and you have no knowledge about how bookstores work, or you’re not really interested in reading, you may not be successful in achieving your goals."
    },
    {
      "title": "Set priorities.",
      "content": "Set priorities. At any given moment, you have a number of goals all in different states of completion. Deciding which goals are more important or time-sensitive than others is crucial. If you find yourself with too many goals, you're going to feel overwhelmed and are less likely to accomplish them. [13] X Research source It may help to choose a few top priorities. This will provide you focus when conflicting goals come up. If it's a choice between completing one or two minor goals and completing one top priority, you know to choose the top priority. If you’re working towards becoming fit and you have set the smaller goals “to eat more healthily,” “to run a 5K,” and “to swim 1 mile (1.6 km), 3 days per week,” you may find that you do not have the time or energy to do all of those things at once. You can prioritize; if you want to run a marathon, first running a 5K may be more important to your goal than swimming every week. You may want to continue eating better, because that is good for your overall health in addition to helping you run. If you’re working towards opening your own bookstore, you may need to obtain a business license and be sure you can qualify for a business loan (if you need one) before you begin selecting specific books to carry in your store."
    },
    {
      "title": "Keep track of your progress.",
      "content": "Keep track of your progress. Writing in a journal is a great way to keep track of both personal and professional progress. Checking in with yourself and acknowledging the progress made towards a certain goal is key to staying motivated. It may even encourage you to work harder. [14] X Research source Asking a friend to keep you on track can help you stay focused. For example, if you're training for the big race, having a friend to regularly meet up with and work out with can keep you on track with your progress. If you are getting fit by working towards a marathon, keep a running journal in which you record how far you ran, how much time it took, and how you felt. As you improve more and more, it can be a great confidence boost to go back and see how far you’ve come since you started. It may be a bit more difficult to track your progress towards opening your own business, but writing down all of your goals and sub-goals, then crossing them out or indicating when each one is complete can help you track the work that you’ve done."
    },
    {
      "title": "Assess your goals.",
      "content": "Assess your goals. Acknowledge when you have reached goals and allow yourself to celebrate accordingly. Take this time to assess the goal process—from inception to completion. Consider if you were happy with the time frame, your skill set, or if the goal was reasonable. For example, once you have run your first 5K, be grateful that you've completed a goal, even if it seems small one in comparison to your bigger goal of running a marathon. Of course, when you open the doors of your independent bookstore and you make your first sale to a customer, you’ll celebrate, knowing that you have worked towards your goal successfully!"
    },
    {
      "title": "Keep setting goals.",
      "content": "Keep setting goals. Once you have achieved goals—even major life goals—you will want to continue to grow and set new goals for yourself. [15] X Research source Once you run your marathon, you should assess what you’d like to do next. Do you want to run another marathon, but improve your time? Do you want to diversify and try a triathlon or an Ironman race? Or do you want to go back to running shorter distance races—5Ks or 10Ks? If you have opened your independent bookstore, do you want to work on implementing community events, such as book clubs or literacy tutoring? Or do you want to make more money? Would you like to open additional locations or expand by adding a coffee shop inside or next door to your bookstore?"
    }
  ]
}