{
  "url": "https://www.wikihow.com/Pee-Outside-as-a-Woman",
  "title": "Discreet and Comfortable Ways to Pee Outside as a Woman",
  "steps": [
    {
      "title": "Find a private place away from other people.",
      "content": "Find a private place away from other people. If you’re not shy about other people seeing you, that’s totally cool, but other people could be offended. Peeing out in the open also puts you in a pretty vulnerable situation. So for your safety and the sake of politeness, find a private place where you’re hidden behind something large, like a bush, large tree, or boulder. For safety reasons, use the buddy system and bring a friend with you, especially if it’s nighttime or if you’re in an unsafe area. Avoid trekking into a large bush if you don’t want to be surrounded by insects and other creepy crawlies while you take a leak. Some other great tips for keeping your business your business would be to wrap a towel or blanket around your waist so that it covers all your important parts, and opening the front and back doors if you’re in a car and taking a leak between them."
    },
    {
      "title": "Try your best to find a restroom, or at least a place that’s not public property.",
      "content": "Try your best to find a restroom, or at least a place that’s not public property. The most ideal thing would be to pee in an actual bathroom, right? If you can only find a men’s restroom and it’s an emergency, use that. But if there’s no restroom in sight, at least pick a spot that’s not someone’s property. [1] X Research source Keep in mind that urinating outside in public places that aren’t restrooms is against the law in most cities and could earn you a citation or worse. If there is no restroom, find a place behind lots of bushes where no one can see you."
    },
    {
      "title": "Find a nice patch of soft ground rather than hard ground.",
      "content": "Find a nice patch of soft ground rather than hard ground. Soft surfaces, like grass and pine needles, absorb fluids more readily than hard surfaces. Getting hit with some backsplash would likely put a damper (pun intended) on your experience."
    },
    {
      "title": "Pop a squat facing away from the wind.",
      "content": "Pop a squat facing away from the wind. If it’s windy, make sure that you’re facing away from the wind to help direct the stream away from you. Just make sure no poor soul is standing downwind of you."
    },
    {
      "title": "Pee while facing downhill if you’re on a slope.",
      "content": "Pee while facing downhill if you’re on a slope. This way, your urine will drain away from you, and not back towards you and whatever nice shoes you decided to wear that day. If you have to go when you’re doing something like rock climbing (aka the steepest slope there is), pull your pants and the legs loops of your harness down to your ankles to avoid getting them wet. Then stick your butt out behind you and arch your back so that your pee is aimed backward. It’s odd, sure, but infinitely better than holding in your pee for hours."
    },
    {
      "title": "Do your business far away from water, trails, and campsites.",
      "content": "Do your business far away from water, trails, and campsites. Find a place that’s at least 200 feet (60.96 meters) away from where other people might be, as well as water sources. If you go too close to any of these places, you risk contaminating the water supply and spreading some pretty nasty bacteria. If you’re doing something like running a race, it’s totally normal for runners to take a leak in the middle of their run. Just be sure to take a few steps off the path to do your business."
    },
    {
      "title": "Get your clothes and underwear out of the way.",
      "content": "Get your clothes and underwear out of the way. You just have to rip the bandaid off, even if it’s a bit embarrassing. Plus, not only would staying in soiled underwear be uncomfortable, but it can also lead to infections. Once you’ve gotten your skirt, dress, shorts, or pants out of the way, pull your underwear down until it’s about half-way down your thighs. If you’re wearing a skirt or a dress, pull it up by the hem until it’s at waist level. If the dress or skirt has a lot of fabric, bunch everything up in front of you and make sure no fabric is hanging behind you. If you’re wearing shorts or pants, unbutton and unzip them first. Then, pull them halfway down your thighs. Don’t let them go past your knees, or they may get wet. If you’re wearing long pants, roll up the cuffs. [2] X Research source"
    },
    {
      "title": "Pee while in a squat position for a quick and efficient whizz.",
      "content": "Pee while in a squat position for a quick and efficient whizz. Place your feet as wide apart as they’ll go that’ll still allow you to hold your balance and squat down. If you’re having trouble keeping your balance, lean forward and place your hand on the ground or brace yourself against a wall or tree if there’s one by you. This will put your privates behind your underwear and pants or shorts if you’re wearing any. Use your hand to hold your shorts or pants close to your knees. This will help keep them from getting wet. [3] X Research source"
    },
    {
      "title": "Sit on something with your legs propped up to make an improvised toilet.",
      "content": "Sit on something with your legs propped up to make an improvised toilet. Just because you’re in the great outdoors doesn’t mean you have to be uncomfortable. Find two objects, such as rocks or logs, then sit down on the edge of one object and rest your feet up on the other with your knees bent. Scoot forward so that your privates are right above the ground and not touching the surface you’re sitting on. [4] X Research source Keep your thighs apart wide enough so that they’re not touching."
    },
    {
      "title": "Lean against a flat surface and do a wall sit.",
      "content": "Lean against a flat surface and do a wall sit . It’s like you’re sitting on your own invisible throne. Find a tree or wall and lean your back against it. Then, squat until your thighs are parallel to the ground and your legs form a 90-degree angle while being bent at the knee. Ensure your feet are planted squarely on the ground and go ahead and answer nature’s call while also toning your legs a bit. [5] X Research source"
    },
    {
      "title": "Squat on the ground and place one hand behind you for balance.",
      "content": "Squat on the ground and place one hand behind you for balance. This is called the tripod method, and it’s a super comfortable position. Spread your feet apart so that they’re in line with your hips and bend your legs so that you’re squatting. Place either one or both hands behind you to hold yourself up. [6] X Research source"
    },
    {
      "title": "Go in a wide-mouthed bottle",
      "content": "Go in a wide-mouthed bottle for easy cleanup. For this, you’ll need to slide your underwear and shorts/pants all the way down to your ankles. Kneel down on the ground, place the bottle between your legs, and go ahead and let loose. Another option is to hold it up directly to your urethra. Be sure to label the bottle so it doesn’t accidentally get used for something else later and dispose of it ASAP. [7] X Research source"
    },
    {
      "title": "Wipe yourself off and continue going about your day.",
      "content": "Wipe yourself off and continue going about your day. After all that hard work, the last thing you want is for your underwear to get wet anyways because of leftover drips. You can use baby wipes , tissue, toilet paper, or even a specially made pee rag if you came extra prepared. [8] X Research source If you’re using baby wipes, tissue, or toilet paper, don’t just leave them on the ground for some unsuspecting person or animal to stumble upon. Put the used paper into a plastic bag and throw the bag away once you find a trash can. If you’re using baby wipes, or any other wet wipe, use one that doesn’t contain alcohol. Too much alcohol can kill both the good and bad bacteria on your body and cause a urinary tract infection. If you don't have anything to wipe with, wait a while for the excess pee to air dry or do a little shake and wiggle until you’re not dripping anymore. Your underwear might still get a bit wet, so change it as soon as possible."
    },
    {
      "title": "Invest in a female urination device.",
      "content": "Invest in a female urination device . Wouldn’t it be nice if you could go wherever and whenever just like a guy? Well, you’re in luck! These nifty contraptions are small enough to keep in your purse or bag (sorry, more stuff to carry) and look like funnels, except that the top is slanted. Some are disposable while others are reusable. [9] X Research source Female urination devices may also be called an FUD, female urination aid, stand-to-pee device, pee funnel, or portable urination device."
    },
    {
      "title": "Get in ample practice time with the device before using it on the go.",
      "content": "Get in ample practice time with the device before using it on the go. Before you attempt to use a female urination device for the real deal, practice using it within the comfort of your home in the shower or in front of your toilet. The last thing you'd want is to use it for the very first time on a trip, only to end up making a bit of a mess. [10] X Research source"
    },
    {
      "title": "Unbutton your pants or lift your skirt up and out of the way.",
      "content": "Unbutton your pants or lift your skirt up and out of the way. This device will allow you to pee while standing up, but you’ll obviously still need to get access to your privates to make that happen. [11] X Research source"
    },
    {
      "title": "Move your underwear to the side.",
      "content": "Move your underwear to the side. Hold the underwear by the leg hole against your thigh. If you’re wearing tight pants, you may need to lower them a little in order to reach. [12] X Research source"
    },
    {
      "title": "Position the device against your privates.",
      "content": "Position the device against your privates. Press the cup part against your body and aim the pointy spout toward the ground away from your feet. Make sure that the end of the spout is lower than the back of the funnel so your pee doesn’t come running back down the spot toward your hand. [13] X Research source"
    },
    {
      "title": "Wipe yourself off and clean the device before putting it away.",
      "content": "Wipe yourself off and clean the device before putting it away. Wipe yourself front to back to avoid bringing any germs from behind to the front. If you have access to water, rinse your device off right away. If you can’t wash it right away, put the device into a resealable bag (or the container it came in), and be sure to wash it as soon as possible."
    }
  ]
}