{
  "url": "https://www.wikihow.com/Play-Clue-(Cluedo)",
  "title": "Official Rules Guide for Clue (Cluedo)",
  "steps": [
    {
      "title": "Set the game board in the middle of the players.",
      "content": "Set the game board in the middle of the players. Unfold your Clue game board and place it on the table so everyone can reach it. The Clue game board features 9 rooms that the players may move between. Make sure there’s enough room for everyone to sit around and access the game board easily. [1] X Research source Play Clue with 3–6 players that are 8 or older."
    },
    {
      "title": "Place all 6 character pawns and weapons on the board.",
      "content": "Place all 6 character pawns and weapons on the board. Take out all 6 character pawns and place them on the corresponding starting squares with the same color. Randomly distribute all the weapon tokens in the rooms on the board. Just make sure that each weapon is in a room by itself at the start of the game. Even if you don’t have 6 players, use all 6 pawns since any of them could still be suspects in the game."
    },
    {
      "title": "Give each player a detective’s note sheet and pencil.",
      "content": "Give each player a detective’s note sheet and pencil. Pass each player a detective’s notes sheet to keep track of information throughout the game. These sheets include a checklist of all of the suspects, rooms, and weapons so you’re able to easily mark what evidence is still in play and what you’ve already ruled out. [2] X Research source If you don’t have any more detective note sheets, list all the Suspects, Rooms, and Weapons on sheets of notebook paper to give to each player. Alternatively, buy more note sheets if you want official copies."
    },
    {
      "title": "Shuffle the Suspect, Room, and Weapon cards into separate decks.",
      "content": "Shuffle the Suspect, Room, and Weapon cards into separate decks. Separate the Clue cards into piles of Suspects, Rooms, and Weapons. Keep these card types in separate stacks and shuffle each one. Then, place the 3 stacks face down on the board. [3] X Research source"
    },
    {
      "title": "Add 1 card from each stack to the “Case File Confidential” envelope.",
      "content": "Add 1 card from each stack to the “Case File Confidential” envelope. Draw 1 card from the top of the Suspect, Room, and Weapon stacks and place these cards into the “Case File Confidential” envelope without looking at them. Make sure you keep the cards face down so that no one can see them. [4] X Research source These cards represent the person who committed the crime, what weapon they used, and where it happened. Whoever can guess the 3 hidden cards correctly wins the game."
    },
    {
      "title": "Shuffle all the cards together and deal them out to the players.",
      "content": "Shuffle all the cards together and deal them out to the players. Combine the 3 stacks of cards still on the board and shuffle them thoroughly. Then, deal the cards face-down starting with the player on your left. Deal clockwise around the table until your run out of cards. [5] X Research source It’s okay if players don’t have the same number of cards. You may look at your cards, but do not show them to any of the other players. Revealing your cards gives other players more information and will help them deduce the hidden cards faster."
    },
    {
      "title": "Mark what cards you’re dealt on your note sheet.",
      "content": "Mark what cards you’re dealt on your note sheet. Look through your cards and secretly put a checkmark next to the ones you have on your note sheet. Since you have those cards in your hand, you know that they can’t be hidden inside the envelope. Each player has different cards, so no one has the same information at the start of the game. For example, if you have the Suspect Mrs. Peacock, the candlestick Weapon, and the kitchen Room in their hand, then these cannot be in the envelope."
    },
    {
      "title": "Roll the dice and move your pawn on your turn.",
      "content": "Roll the dice and move your pawn on your turn. Whoever is using the red pawn and playing as Ms. Scarlet goes first. Roll both dice and move your pawn forward, backward, or to either side the same number of spaces. You’re not allowed to go on a space you’ve already touched on your turn and you can’t move through a space with another pawn on it. Finish your movement in a space once you reach your maximum movement or once you reach a Room. [6] X Research source On later turns, if you’re in a Room that has the words “Secret Passage” in it, you can move to the listed room instead of rolling the dice. If another player is on a space in front of a Room’s door, you must wait for them to move before you’re able to enter the Room. If you get blocked in a room, then you have to wait until your next turn to see if the pawn moved out of your way. [7] X Research source"
    },
    {
      "title": "Make a “Suggestion” for a Suspect and Weapon whenever you enter a Room.",
      "content": "Make a “Suggestion” for a Suspect and Weapon whenever you enter a Room. As soon as you go into a Room, immediately name a Suspect and a Weapon. Move the Suspect’s pawn and the Weapon into the same Room as you. This means you’re suggesting that the Suspect used the Weapon you named to commit the crime in the Room with your pawn. [8] X Research source Example : After moving into the Study, you might say, “I suggest that it was Colonel Mustard with the Lead Pipe in the Study.” Move the yellow Colonel Mustard pawn and the Lead Pipe token into the study. There are no limits on the number of suspects or weapons that you may have in one room at one time. Making Suggestions helps you find out what information other players have, so choose Suspects, Weapons, or Rooms that you don’t have in your hand."
    },
    {
      "title": "Ask other players if they have any of the cards you just named.",
      "content": "Ask other players if they have any of the cards you just named. After you make a Suggestion, the person on your left checks their hand to see if they have any of the cards you named. If they have one or more of the cards, they choose one to secretly reveal to you without letting the other players see. If they don’t have any of the cards, then the next player to the left checks their hand. Once someone shows you a card, mark it down on your notes sheet. [9] X Research source When someone shows you a card that you suggested, you know it can’t be hidden in the envelope. If no one has the card, then you know for a fact it’s one that was hidden."
    },
    {
      "title": "Continue taking turns to learn more information.",
      "content": "Continue taking turns to learn more information. The player to your left takes their turn after you, and play continues clockwise around the table. As the game goes on, cross off all the information you find out from other players to rule out Suspects, Weapons, and Rooms. Once you narrow down the list of Suspects, Weapons, and Rooms, you’ll have a better guess at what’s inside the envelope. [10] X Research source One way to win at Clue is suggesting cards you already have in your hand. If you suggest Professor Plum used the Rope in the Ballroom, and you have the Rope and Ballroom in your hand, then Professor Plum is in the envelope if no one else reveals the card."
    },
    {
      "title": "Make a final “Accusation” when you’re sure you know the hidden cards.",
      "content": "Make a final “Accusation” when you’re sure you know the hidden cards. If you feel confident about who the Suspect is, what Room they were in, and what Weapon they used, make your Accusation. State that you’re making your final Accusation at the start of your turn or after you make a Suggestion. Name the Suspect, Weapon, and Room and secretly check the cards in the envelope. If your Accusation is correct, reveal the cards and immediately win the game! Keep in mind that you may only make 1 Accusation per game. If you get the Accusation wrong, then you’re out of the game and not allowed to make any other guesses. Return the cards to the envelope and continue revealing your cards to other players when they ask."
    }
  ]
}