{
  "url": "https://www.wikihow.com/Sell-Old-Coins",
  "title": "All the Best Ways to Sell Old Coins: Tips, Tricks, & More",
  "steps": [
    {
      "title": "Identify the coin",
      "content": "Identify the coin . Before selling a coin, determine what type of coin you have. First, find the coin’s denomination, then note the date and mint mark displayed on the front or back of the coin. You can then type the information you’ve collected into an online search engine like The American Numismatic Association to determine exactly what type of coin you have and what it might be worth. [1] X Research source Coin dealers and collectors may be able to help you, too. Take a clear photo of both sides of the coin and send it to coin collector groups online by searching The American Numismatic Society’s Coin Club Directory or by joining the NGC Collector’s Society if you can’t bring it to a dealer in person."
    },
    {
      "title": "Note the coin’s condition.",
      "content": "Note the coin’s condition. Look over both sides of the coin. Does it look dirty or scratched? The worse the damage is, the less your coin will be worth. Keep an eye out for any printing errors, as these mistakes often increase the value. [2] X Research source Get your coins graded . Grades are given on a 70-point scale where 0 is “Poor,” and 70 is “Mint Condition.” Coins rated “Good” or 6 are actually very worn, and ones rated “Fine” or 12-15 have a medium amount of wear. [3] X Research source Don’t attempt to clean the coin, as cleaning the coin can damage it further and decrease its value. Coins are historical artifacts, and collectors prefer them in their current state."
    },
    {
      "title": "Look up the coin’s value.",
      "content": "Look up the coin’s value. Once you know what type of coin you have, you can estimate how much it’s worth . Plenty of sites online maintain a list of current coin values, such as the PCGS Price Guide . Another option is to reference The Official Red Book , an official and detailed guide to coin values. Coins are listed at wholesale price. You may not get as much money for your coin if you sell them individually instead of in a lot."
    },
    {
      "title": "Monitor auctions to find out how much your coin is worth.",
      "content": "Monitor auctions to find out how much your coin is worth. More information on coin values can be found by searching through recent sales on sites such as Heritage Auctions . Search for coins similar to the one you own to get a glimpse of how much others are paying for them. [4] X Research source"
    },
    {
      "title": "Get an appraiser to value your coin collection.",
      "content": "Get an appraiser to value your coin collection. Appraisers are necessary when you’re selling valuable coins or a large collection. Search your local phone directory or online for a trustworthy coin appraiser or dealer. They’ll analyze each coin, verify its authenticity, and tell you how much it’s worth. [5] X Research source Look at online reviews from other customers or consult the Better Business Bureau to vet the appraiser’s reputation. Many respectable dealers are members of groups like the American Numismatics Association or Professional Coin Grading Service . Use these sites to find trustworthy appraisers."
    },
    {
      "title": "Group coins by value.",
      "content": "Group coins by value. Different buyers specialize in different types of coins. If you’re selling multiple coins at a time, try to separate them into value-based groups. Make groups of high, medium, and low-value coins. How you group the coins is up to you, but the easiest way to do this is by the coin’s wholesale value. [6] X Research source You can also separate the coins based on how worn they are, the metal used in them, or where they were printed."
    },
    {
      "title": "Speak to reputable coin dealers.",
      "content": "Speak to reputable coin dealers. Local coin dealing shops are great places to visit as a beginner—you’ll mostly sell coins of low and medium value here. When you go to a dealer, look at their stock. If they have a lot of coins made of the same metal and of similar quality to the ones you’re selling, chances are they’ll give you a fairer price. [7] X Research source Many dealers can also handle rare coins, but you’ll usually get more money from auctions or private collectors when selling these coins. Remember that dealers are running a business. They’ll pay you less than the wholesale price to make a profit. It’s best to let multiple dealers evaluate your coins. Shop around before deciding on a dealer to sell to so you know you’re getting the best payout."
    },
    {
      "title": "Visit coin shows.",
      "content": "Visit coin shows. Coin shows bring together large numbers of buyers and sellers. Look for people dealing in coins of similar quality to the ones you’re selling. Discuss a fair selling point, but don’t feel pressured to sell. You won’t always get a great offer at a coin show, but you’ll have an opportunity to find trustworthy dealers and meet people who can guide you in the right direction. You can find a list of reputable coin shows near you by searching online through The American Numismatic Association’s Coin Show Directory ."
    },
    {
      "title": "Search for online coin dealers.",
      "content": "Search for online coin dealers. Popular and reputable coin-selling sites such as CoinsForSale , ModernCoinMart , and Apmex are a fast way to sell both rare and common coins from your own home. [8] X Research source Take good pictures of the coins to boost buyer interest and get better offers on your coins. Work in a well-lit environment, so the lettering and mint marks are as visible as possible."
    },
    {
      "title": "Pick up coin collector magazines.",
      "content": "Pick up coin collector magazines. Publications such as Numismatic News and Coin World feature advertisements from reputable coin dealers. Coin magazines offer enlightening information on coin sales and may also reveal your perfect buyer. Whatever you do, avoid advertising in your local newspaper. Even if you meet someone in a safe place, your coins are a potential target for thieves."
    },
    {
      "title": "Submit your coins to auctions.",
      "content": "Submit your coins to auctions. Coin auctions of all sizes happen online and in person and can be local, regional, or national. Try to find an auction that features a lot of coins of similar material to yours, such as copper or silver. Auctions are unpredictable, so you may earn less than a dealer would pay or, conversely, get an unexpected boost to your sale price. [9] X Research source Reputable coin auction sites include Stack’s Bowers , Heritage Auctions , and GreatCollections. Auctions charge both buyer and seller fees of around 10-15% of the final sale price. Consider this when determining how much you can make from auctioning a coin. Auction sites like eBay are also fine, but be wary of getting scammed."
    },
    {
      "title": "Choose buyers who give you a fair analysis.",
      "content": "Choose buyers who give you a fair analysis. Unscrupulous buyers will give low offers to get a deal on your coins and rip you off. Watch the potential buyer evaluate your coins, if possible, to determine their legitimacy. They should analyze each coin individually. Avoid anyone who offers you a flat price without bothering to take a long look at the coins. [10] X Research source Say no to any buyer who pressures you into selling coins immediately. Look for dealers with positive reviews and accreditation from well-known numismatics organizations like Numismatic News or through the Better Business Bureau’s Coin Dealer filter ."
    },
    {
      "title": "Have the coins evaluated by multiple buyers.",
      "content": "Have the coins evaluated by multiple buyers. Shop around to get the most from your coins. Let multiple dealers evaluate your coins and make offers on them. Tell each one you’ll “think about their offer and come back later.” Then, when you’re ready to sell, choose the dealer you feel most comfortable doing business with. [11] X Research source"
    },
    {
      "title": "Sell coin collections as a whole.",
      "content": "Sell coin collections as a whole. When selling a large collection of coins, keeping the coins as a package deal will typically earn you a greater profit. Never accept an offer based on weight when selling a collection, as this will likely undervalue your coins. Many dealers will attempt to pick out the high-value coins and leave you with a less valuable collection that’s harder to sell, which is why it’s important to sell your coins together."
    },
    {
      "title": "Keep documentation of your sales.",
      "content": "Keep documentation of your sales. Even a coin you got for free can cause you legal problems. Your government likely taxes any profit you make off of sold coins. That’s why keeping a detailed list of every sale you make, and any coin purchases is important. [12] X Research source Consult your local tax laws to find out how to report your income."
    }
  ]
}