{
  "url": "https://www.wikihow.com/Not-Miss-Your-Partner-in-a-Long-Distance-Relationship",
  "title": "How to Not Miss Your Partner in a Long Distance Relationship",
  "steps": [
    {
      "title": "Prioritize communication.",
      "content": "Prioritize communication. [1] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. Making time to talk to each other every day is extremely important to maintaining a long-distance relationship. It helps you stay connected, be informed about what is happening in each other’s lives, and miss each other less. Commit to calling each other once a day (or as frequently as schedules will permit). [2] X Research source Agree on how many times a day/week you will talk to each other. Try to have a standing date to talk (for example, before bedtime). Let your partner know ahead of time if you will need to cancel for another reason. You could say, “Because we’re not able seeing each other every day, let’s try to talk as often as possible. Can we call each other every night before bed? It would be nice to hear your voice before I go to sleep.” Reader Poll: We asked 1620 wikiHow readers how they’re most likely to get to know their long-distance partner, and only 8% recommended imagining being my partner . [Take Poll] So instead, schedule time every day to check in with your significant other."
    },
    {
      "title": "Know each other’s schedules.",
      "content": "Know each other’s schedules. Just as you would likely have an idea of what your partner was doing each day when you were living in the same place, inform each other of your daily schedules. It helps you stay connected and figure out when you can get in touch with each other. [3] X Research source You could keep a copy of your partner’s daily schedule in your phone or in your calendar. It’s nice to think about what the other person is doing at that moment. It helps you feel connected to them. While you are eating your lunch, you could think, “Michael is probably driving to work right now.”"
    },
    {
      "title": "Talk via webcam.",
      "content": "Talk via webcam. Using a webcam is a great way of helping you feel better about the distance. Just seeing your loved one smiling and hearing their voice can make you feel better and more connected to them. Regular webcam calls can make the distance seem shorter. Many new computers/monitors come with webcams and microphones already installed. If you do not have either, they are fairly inexpensive to purchase, and well worth the investment if you have a long distance relationship! You can use your webcam in conjunction with a variety of programs, like Skype or social media applications (like Facebook ). You can also make video calls using your phone, using things like FaceTime or Google Hangouts . [4] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019."
    },
    {
      "title": "Email or text.",
      "content": "Email or text. Send little messages to your significant other throughout the day to let them know you are thinking about them. Let them know how your day is going. You could check in them by: Texting on the train on your way to work. (If your partner is abroad, consider using WhatsApp to cut down on text message costs.) Emailing at work about your day. Sharing news or a joke on a social media app."
    },
    {
      "title": "Send mail.",
      "content": "Send mail. Getting a letter or card in the mail can brighten someone’s day. Whether you write a letter or clip out an article in your hometown paper you know your partner would appreciate, it’s nice for your partner to receive a tangible reminder of your relationship when you’re not there. Pick out a thoughtful card that reminds you of your partner or your relationship. Send a care package. They are fun to assemble and to receive!"
    },
    {
      "title": "Plan your next visit.",
      "content": "Plan your next visit. Having something to look forward to will help you be less frustrated about the distance. [5] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. Talking about being together and planning what you want to do can help you feel like your relationship is going somewhere. Look at your calendars and determine when one of you can come visit. Research transportation options if necessary and find out how much a visit will cost. Remember it is best (for both your wallet and your peace of mind!) to book a trip well in advance. If you do not share a bank account, decide ahead of time how you will split the cost of the trip. If you do not share finances and are always the one traveling to see your partner, it may not be fair that you are paying for each flight on your own. You could say, “Maria, let’s talk about budgeting for my next visit. Since I’ve paid for my last two flights, can you pay for this one?” Talk about the things that you will do with each other when you are reunited with your partner, in order to build excitement and anticipation."
    },
    {
      "title": "Surprise each other.",
      "content": "Surprise each other. Long distance relationships are a lot of work to maintain. Scheduling calls and visits can take a lot of the fun out of the relationship. So make attempts to surprise your partner as much as possible. [6] X Research source Send a gift for no reason. When they call to thank you, you could say, “I heard the author of that book being interviewed on the radio. It sounds like something you’d really enjoy. It made me think of you.” Call unexpectedly, just to say you love them. If the budget allows, surprise them with an unexpected visit. Do some detective work ahead of time to ensure they’re going to be free during the time you want to go."
    },
    {
      "title": "Display mementos.",
      "content": "Display mementos. Have reminders of your relationship around your home. Even though your partner may be far away, putting up pictures or other little reminders of them may help you feel more connected to them. You can be reminded of your partner’s importance in your life. Hang up pictures of the two of you together around your home or at work. Make a picture of the two of you the wallpaper on your phone. Exchange t-shirts. Having something of your partner's can reassure you and comfort you, especially if it's something like a t-shirt that they've worn and smells like them."
    },
    {
      "title": "Plan for the future.",
      "content": "Plan for the future. Talk about your goals for the relationship after your separation ends. [7] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. While you may be in a long distance relationship for just a few months or for many years, it may help you and your partner feel confident about the relationship if you have some mutually agreed-upon goals. While it may not be possible in every circumstance, knowing an end date to your time apart can be helpful in planning your next steps and strengthening your relationship. It is good to have something concrete to look forward to when the separation obligations are over. Maybe you will be taking a next step in your relationship, like moving in together, or maybe you and your partner will be reunited and able to take a long vacation before resuming your day-to-day lives. Express your dreams about what you would like to have happen when you are reunited. Even if you never fulfill these plans, it can distract your mind from the distance between the both of you and make you think of your future together. You could say, “When you get home, I want to spend a day in the city, walking around and having lunch at our favorite Indian place. What do you want to do?”"
    },
    {
      "title": "Encourage each other.",
      "content": "Encourage each other. One or both of you may get down about the pain of the separation. Be supportive and remind each other that the distance isn't forever. It might be a long way away, but the measure is only temporary, and you will eventually be together. Stay positive and loving toward each other. You could say, “I know how much we miss each other, but it makes me happy that we care about each other so much. Talking to you every day really helps me feel better about our separation.” Keep track of how many days you have until your separation is over. You could say, “just four more months until you’re home for good!” or “We’ll be seeing each other in two weeks, and then you’ve only got six months left of school!”"
    },
    {
      "title": "Create something for your special someone.",
      "content": "Create something for your special someone. Getting creative and making something like a scrapbook or a photo collage can not only help you take your mind off things, it can also remind you of the good times you've both shared together. When your partner is feeling lonely, they can look at something that you have put the time and effort into and know how much they mean to you. You don’t have to be crafty to make something for your partner. It is the thought that counts, and your partner will appreciate your efforts. You could make a mixed CD of songs that are meaningful to your relationship. If you like to bake, you could make cookies to send in the mail."
    },
    {
      "title": "Get support from your friends.",
      "content": "Get support from your friends. Ask your friends to help you stay busy and avoid obsessing over your long-distance romance. Keep an active social life and fill your calendar with fun (and distracting) things to do. [8] X Research source You could say to your friends, “Please let me know of anything you’re up to while Mark is deployed. I need to keep busy!” Take the initiative and plan events for you and your friends. They don’t have to be anything big. You could say, “Do you want to order pizza and watch a movie with me tomorrow night?”"
    },
    {
      "title": "Have a plan if you’re lonely.",
      "content": "Have a plan if you’re lonely. You may realize that loneliness hits you at certain times--maybe when you are out with your married couple friends, or when you drive by places that hold happy memories with your partner. Come up with some ways to deal with your loneliness so you can be prepared when it strikes. [9] X Research source You could call a friend and catch up with them. Text your partner and let them know you are thinking about them. You could say, “I was just walking by the park where we had a picnic over the summer. That was a lovely day. Thinking of you!” You could decide to exercise, clean your apartment, or read a book to take your mind off your loneliness. Stay engaged with your friends and family. Make plans with them and do things that interest you. Many people feel lonelier at night. If you happen to be one of them, consider creating a bedtime routine to help reduce anxiety and make you feel more peaceful. You could take a bath, read a book, and send a goodnight text before heading to bed. [10] X Trustworthy Source Go Ask Alice Medical advice site with content written by health promotion specialists affiliated with Columbia University Go to source If the time zones are not too different, then you could even schedule a video chat with your partner to help reduce feelings of loneliness in the evening."
    },
    {
      "title": "Live your life.",
      "content": "Live your life. Don’t put life on hold just because your partner isn’t there for it. Your partner wouldn’t want you to sit at home, pining for their return (if they do, you need to have a conversation about long distance relationship expectations). Time will move much faster if you are out and about instead of waiting by the computer to chat. [11] X Research source Use the extra time you may have to better yourself. You could take up a new exercise program, take some classes, or learn a skill you’ve always wanted to have. Be sure to engage with family and friends who are local as well. Spend some extra time at school or at work, working to achieve some educational or professional goals."
    },
    {
      "title": "Pursue your own interests.",
      "content": "Pursue your own interests. Even though you miss your partner, there are no doubt things that you enjoy doing without them around. Take advantage of their absence to pursue your interests that your partner doesn’t necessarily share. [12] X Trustworthy Source Go Ask Alice Medical advice site with content written by health promotion specialists affiliated with Columbia University Go to source For example, you may be a big foodie, while your partner’s idea of exotic cuisine is the Chinese buffet. You could spend your time apart trying new restaurants. You may love science fiction movies while your partner can’t stand them. Catch up on all the movies you want to see that might otherwise require negotiation."
    }
  ]
}