{
  "url": "https://www.wikihow.com/Properly-Dispose-of-Ink-Cartridges",
  "title": "How to Safely Recycle or Reuse Ink and Toner Cartridges",
  "steps": [
    {
      "title": "Take the cartridges to a store with a drop-off recycling program.",
      "content": "Take the cartridges to a store with a drop-off recycling program. Most office supply stores and other big-box stores accept used ink or toner cartridges so they can be recycled safely. Some stores also offer a rewards program when you recycle cartridges. Call stores ahead of time to check if they accept used cartridges before visiting the location. [1] X Research source Office Depot accepts ink cartridges from any brand, and gives you rewards if you make a purchase within the same month. [2] X Research source Staples accepts cartridges purchased from their retail or online store. [3] X Research source Best Buy can recycle up to 3 ink or toner cartridges per day for free. Retailers like Walmart, Costco, and Target may also have offer ink and toner drop-offs but it may vary by location."
    },
    {
      "title": "Mail the cartridges back to the manufacturer if you’re able to.",
      "content": "Mail the cartridges back to the manufacturer if you’re able to. Sustainability specialist Kathryn Kellogg mentions that most ink cartridge manufacturers have their own recycling programs that allow you to send in all your old cartridges. Check the cartridge manufacturer’s website to see if they have a recycling program and follow any steps online for how to pack and mail your cartridges in so they’re disposed of safely. [4] X Research source HP will send a prepaid envelope so you can pack up and send your used cartridges directly to them. They may also partner with nearby office supply stores to drop off your cartridges. Canon allows you to take used ink and toner cartridges to any FedEx location to be sent back and recycled. Lexmark accepts old ink cartridges when you package them in the box from a new cartridge you’ve bought. [5] X Research source Epson ink cartridges can be packaged in any shipping box or envelope and mailed back to their recycling center. [6] X Research source Brother ink cartridges can be packaged in a box from a new cartridge you’ve bought, and mailed from any USPS location. [7] X Research source If you have a third-party or generic ink cartridge, use a different recycling or disposal method because they may not have mail-in programs. Some services like InkRecycling will pay you for sending in your ink cartridges, but they may only accept specific brands."
    },
    {
      "title": "Check if your city’s recycling center accepts ink or toner cartridges.",
      "content": "Check if your city’s recycling center accepts ink or toner cartridges. While you shouldn’t place ink or toner cartridges in your normal trash bin, you may be able to take them directly to a recycling center. Contact your local recycling service and ask if they accept cartridge drop-offs. Follow their instructions when you take your cartridges in so they can be properly disposed of."
    },
    {
      "title": "Ask local non-profits or schools if they’re collecting ink cartridges.",
      "content": "Ask local non-profits or schools if they’re collecting ink cartridges. Some non-profits and schools hold fundraising drives where they collect used ink cartridges and get paid for sending them in. Reach out to any organizations or schools near you to see if they’re running any recycling programs. [8] X Research source"
    },
    {
      "title": "No, don’t throw ink or toner cartridges in your trash can.",
      "content": "No, don’t throw ink or toner cartridges in your trash can. Ink and toner cartridges are made of plastic that can take over 1,000 years to break down when they’re in a landfill. Rather than tossing empty cartridges in your trash, research the recycling options available so they don’t go to waste. [9] X Research source Avoid tossing ink cartridges in your recycling bin too because recycling centers won’t be able to remove or sort them out properly."
    },
    {
      "title": "Locate the fill holes on the top of the ink cartridge.",
      "content": "Locate the fill holes on the top of the ink cartridge. You may need to peel off the sticker or label on top of the cartridge to expose the holes. On black ink cartridges, look for the fill hole in the center of the cartridge. If you’re refilling a color ink cartridge , then there will be 3 separate fill holes for the red, yellow, and blue ink. [10] X Research source If you don’t see any refill holes on the top of your ink cartridge, then it’s not made to be refilled. Recycle your old cartridge and purchase a new one."
    },
    {
      "title": "Inject the cartridges with ink until they’re full.",
      "content": "Inject the cartridges with ink until they’re full. Purchase an ink cartridge refill kit that’s compatible with the ink cartridges you’re filling. Cover your workspace with cardboard and wear gloves to protect the surface and yourself from ink spills. Fill up one of the kit’s syringes with the ink, and push it into the cartridge’s fill hole. Slowly press down on the plunger to add the ink into the cartridge until it oozes out. [11] X Research source Wipe any excess ink off with a paper towel when you finish filling them. Cover the hole with the label or a piece of tape before installing it in your printer . If you don’t feel comfortable refilling your ink cartridges by yourself, then search for an ink refill service in your area."
    },
    {
      "title": "Use thinner or smaller fonts.",
      "content": "Use thinner or smaller fonts. Rather than using large, bold fonts when you’re printing out documents, switch to an ink-efficient typeface. These fonts use less ink when you print them out so your cartridges last longer. Some good fonts to use are: [12] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Century Gothic, size 11 Times New Roman, size 12 Calibri, size 11 Verdana, size 11"
    },
    {
      "title": "Switch to Draft Mode in your print settings.",
      "content": "Switch to Draft Mode in your print settings. Before you print a document, look in the preferences or settings for an option labeled Draft Mode , Toner Save , EconoMode , or something similar. Draft Mode prints your documents in lower quality with less ink so you can easily check for errors or mistakes without wasting more ink. [13] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Print fewer high-resolution pictures.",
      "content": "Print fewer high-resolution pictures. High-quality images take up the most ink when you’re printing something out, so cut them out of the document if you don’t need them. Switch to a printer-friendly version of a page, or use a lower-quality image so you can save your ink. Alternatively, use a printing service whenever you print out images so you don’t have to use ink from your printer."
    },
    {
      "title": "Leave your printer turned on between uses.",
      "content": "Leave your printer turned on between uses. When you turn your printer off and back on again, it can trigger a maintenance cycle that burns through ink. Let your printer stay plugged in and running so that the cycle doesn’t run. [14] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Printers don’t use a lot of power when they’re not running, so it won’t impact your energy or electric bill."
    }
  ]
}