{
  "url": "https://www.wikihow.com/Skin-a-Dead-Animal",
  "title": "How to Skin a Dead Animal",
  "steps": [
    {
      "title": "Place carcass, belly up, on a slope if available.",
      "content": "Place carcass, belly up, on a slope if available."
    },
    {
      "title": "Remove genitals or udder.",
      "content": "Remove genitals or udder."
    },
    {
      "title": "Remove musk glands at the knees.",
      "content": "Remove musk glands at the knees."
    },
    {
      "title": "Split hide from tail to throat.",
      "content": "Split hide from tail to throat. make the cut shallow so you do not pierce the stomach."
    },
    {
      "title": "Insert your knife under the skin, taking care not to cut into the body cavity.",
      "content": "Insert your knife under the skin, taking care not to cut into the body cavity. Peel the hide back several inches on each side to keep hair out of meat."
    },
    {
      "title": "Open the chest cavity by splitting the sternum.",
      "content": "Open the chest cavity by splitting the sternum. You can do this by cutting to one side of the sternum where the ribs can join."
    },
    {
      "title": "Reach inside and cut the windpipe and gullet as close to the base of the skull as possible.",
      "content": "Reach inside and cut the windpipe and gullet as close to the base of the skull as possible."
    },
    {
      "title": "With the forward end of the intestinal tract free, work your way to the rear, lifting out internal organs and intestines.",
      "content": "With the forward end of the intestinal tract free, work your way to the rear, lifting out internal organs and intestines. Cut only where necessary to free them."
    },
    {
      "title": "Carefully cut the bladder away the carcass so that you do not puncture the bladder (urine can contaminate meat).",
      "content": "Carefully cut the bladder away the carcass so that you do not puncture the bladder (urine can contaminate meat). Pinch the urethra tightly and cut it beyond the point you are pinching."
    },
    {
      "title": "Remove the bladder.",
      "content": "Remove the bladder."
    },
    {
      "title": "From the outside of the carcass, cut a circle around the anus.",
      "content": "From the outside of the carcass, cut a circle around the anus."
    },
    {
      "title": "Pull the anus into the body cavity and out the carcass.",
      "content": "Pull the anus into the body cavity and out the carcass."
    },
    {
      "title": "Lift or roll the carcass to drain all the blood.",
      "content": "Lift or roll the carcass to drain all the blood."
    },
    {
      "title": "Remove the hide, make cuts along the inside of the legs to just above the hoof or paw.",
      "content": "Remove the hide, make cuts along the inside of the legs to just above the hoof or paw. Then peel the skin back, using your knife in a slicing motion to cut the membrane between the skin and the meat. Continue this until the entire skin is removed. [1] X Research source"
    },
    {
      "title": "Most of the entrails are usable.",
      "content": "Most of the entrails are usable. The heart, liver, and kidneys are edible."
    }
  ]
}