{
  "url": "https://www.wikihow.com/Renewable-Energy-Credits",
  "title": "Renewable Energy Credits: What They Are & How You Can Use Them",
  "steps": [
    {
      "title": "A renewable energy credit is a certificate (also known as renewable energy certificate or REC) that represents energy created by renewable sources like solar, wind, and other zero-emission sources.",
      "content": "A renewable energy credit is a certificate (also known as renewable energy certificate or REC) that represents energy created by renewable sources like solar, wind, and other zero-emission sources. A REC is a non-tangible item that gives someone the property rights to renewable energy that’s been created and its environmental benefits. They allow businesses and homeowners to be more sustainable by investing into renewable energy. When energy providers offer renewable energy plans that rely on RECs, it allows buyers to participate in renewable energy generation without installing complex infrastructure, or renewable energy systems (like solar panels). [2] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "First, a person or organization can choose to support renewable energy projects.",
      "content": "First, a person or organization can choose to support renewable energy projects. These renewable energy projects provide individuals and organizations with the ability to help reduce the reliance on fossil fuel technologies. In turn, they reduce their carbon footprints, meet organizational sustainability goals, and champion sustainable practices."
    },
    {
      "title": "When people and organizations purchase RECs, they receive documentation that certifies where that energy came from.",
      "content": "When people and organizations purchase RECs, they receive documentation that certifies where that energy came from. When your home or business receives physical electricity through the utility grid, there’s no way to tell where the energy came from or how it was generated, but the RECs work by substantiating the claims that a company, office, or household owns renewable electricity that was generated. [3] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Once generated, renewable energy certificates can be kept or sold. When a REC is purchased, the buyer becomes the owner of that renewable energy source. Therefore, that buyer can claim that the electricity they consume comes from a renewable energy resource with minimal or zero emissions. A REC can only be retired once each Mwh unit has a unique tracking number tying it to its attributes in its tracking system. By purchasing a REC, you’re able to support renewable energy production without having to install or maintain renewable energy sources at home (like solar panels or wind turbines). Instead, you can simply switch providers and enroll in a renewable energy plan like Indra Energy to go green and reduce your carbon footprint without any complex equipment or expensive installation."
    },
    {
      "title": "RECs are created when renewable energy sources deliver electricity to the grid.",
      "content": "RECs are created when renewable energy sources deliver electricity to the grid. To be more precise, a single renewable energy credit is generated whenever renewable energy sources (like solar panels or wind turbines) produce one megawatt-hour (MWh) of electricity. For instance, if a geothermal heat pump produces 10 MWh of electricity, then the owner of the pump has ten renewable energy credits to use or sell. [4] X Research source"
    },
    {
      "title": "Since all of our electricity flows into the same grid, it’s impossible to track what energy is renewable, and what isn’t.",
      "content": "Since all of our electricity flows into the same grid, it’s impossible to track what energy is renewable, and what isn’t. RECs identify the renewable energy once it’s produced and before it’s added into our electrical grid. Each REC has unique tracking and certification that includes information about the date the energy was generated, where it was generated, and what type of renewable source it came from. RECs are certified through independent organizations, like the Green-e Energy program. This certification ensures that RECs are real, verifiable, and only counted in the grid once."
    },
    {
      "title": "You can get RECs by generating, purchasing, or re-bundling them.",
      "content": "You can get RECs by generating, purchasing, or re-bundling them. There are three main ways to get RECs as a business owner or homeowner. First, you can generate your own RECs by installing a renewable energy source at your home—like solar panels, heat pumps, or mini wind turbines. If you want to generate renewable energy in your home without installing equipment, you can switch to a renewable energy company like Indra Energy. Indra Energy offers 100% renewable energy plans, and you can quickly switch to their environmentally-sustainable service with zero hassle. Plus, Indra Energy offers both month-to-month and fixed rate plans. If you’re still unsure about using renewable energy in your home, you can try it out with one of their monthly into-to-variable rate plans."
    },
    {
      "title": "Secondly, you can purchase RECs from utility authorities in your city that offer green power programs.",
      "content": "Secondly, you can purchase RECs from utility authorities in your city that offer green power programs. Search “buy renewable energy credits + [your city/town]” and look for certified REC providers. [5] X Research source"
    },
    {
      "title": "Alternatively, you can get involved in re-bundling, which is a more complicated practice that’s primarily used by corporations.",
      "content": "Alternatively, you can get involved in re-bundling, which is a more complicated practice that’s primarily used by corporations. RECs can be purchased as “bundled” or “unbundled” from the electricity that produced them. If you purchase unbundled renewable energy credits, you can then contractually re-bundle the RECs with electricity from another project. In this process, the RECs from one renewable electricity project are sold and replaced by new, cheaper RECs from a separate renewable energy project. [6] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source This strategy (known as REC arbitrage) is used by electricity consumers that generate, buy, and sell RECs with two main goals in mind: to decrease the cost of their renewable electricity usage and to prove their claims about renewable electricity usage and carbon footprint reduction. [7] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Consider RECs if you want evidence that you’ve reduced your carbon footprint.",
      "content": "Consider RECs if you want evidence that you’ve reduced your carbon footprint. RECs have numerous benefits for both business as they give you a way to prove that you’re generating renewable energy without installing solar panels or other renewable energy options . [8] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source If you’re an individual, you can feel satisfied that you’re reducing your environmental impact —without having to go through the trouble of installing solar panels. In addition, creating and buying RECs helps to support the renewable energy market. It shows companies and government entities that there’s a demand for renewable energy systems, promoting the growth of environmental consciousness nationwide. If you run a business, you can use RECs to show that you’ve met your sustainability goals. Some businesses (like Whole Foods and Starbucks) are voluntary REC buyers—i.e., they choose to purchase RECs in order to prove that they’re environmentally conscious. Others are compliance REC buyers, meaning that they’re legally obligated to show they’re offsetting their electricity usage by purchasing renewable energy credits. [9] X Research source Ultimately, the best benefit of using RECs is helping the environment. RECs encourage renewable energy use, as opposed to fossil-fuel based greenhouse gas emissions and other pollutants. Renewable energy is cleaner, safer, and better for the environment. [10] X Trustworthy Source United Nations Official site for the United Nations, an intergovernmental organization devoted to maintaining peace and building relationships between all nations. Go to source So, if preserving the environment and keeping our planet healthy are issues that you care about, then RECs may be a great fit for you and your home or business."
    },
    {
      "title": "Solar renewable energy credits are RECs created from solar panels.",
      "content": "Solar renewable energy credits are RECs created from solar panels. Also referred to as solar renewable energy certificates, SRECs are a sub-type of REC. RECs can be generated by any type of renewable energy source, while SRECs are only generated when electricity is produced by solar panels. [11] X Research source Like RECs, SRECs can be sold to electrical utility companies once generated. In certain markets, SRECs can be worth from $200-$300 USD. [12] X Research source"
    },
    {
      "title": "Switch to an electricity supplier that has renewable energy plans.",
      "content": "Switch to an electricity supplier that has renewable energy plans. If you live in a state with a deregulated energy system, you have the right to choose an electricity supplier that best fits your needs and your priorities. If you’re passionate about using renewable energy to power your home, then switching to a renewable energy provider like Indra Energy , that purchases RECs to prove their energy plans are 100% renewable, is one of the easiest ways to do so. Indra Energy offers 100% renewable electricity plans, so you can rest assured that all of the electricity supplied from our plans is backed by RECs. Plus, switching your electricity provider is one of the only ways to have a renewable energy plan that doesn’t require the big up-front costs involved in installing equipment. Indra Energy also offers fixed rates for 6 month and 12 month, and month-to-month into-to-variable rate plans. You can earn rewards to use in over 500,000 ways (and have some fun!) with Indra Energy’s customer rewards program, where customers earn points every month to spend on thousands of retail, dining, and entertainment experiences (valued at $1100 USD per year)."
    },
    {
      "title": "Make energy efficient updates to your home.",
      "content": "Make energy efficient updates to your home. Before making big changes to your home, start small by updating your home with tools and features that will make your energy production and use more efficient. For starters, get a home energy assessment from a qualified professional. This assessment will tell you what features of your home are allowing energy to go unused or to be used inefficiently. Depending on the results of your assessment, you might consider the following energy efficiency updates to save energy and support your renewable energy usage: [13] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source Install proper insulation and air sealing Install energy-efficient windows (with double- or triple-pane glass) [14] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source Install energy-efficient kitchen appliances and lighting systems. Implement smart water consumption habits to save water Rely on available daylight before turning on lamps and overhead lights"
    },
    {
      "title": "Install a geothermal or air source heat pump.",
      "content": "Install a geothermal or air source heat pump. Geothermal heat pumps and air source heat pumps both naturally extract heat from the environment to be used as energy—giving your home hot water and natural heat. While geothermal heat pumps draw heat from the ground, air source heat pumps take heat from the surrounding air. [15] X Research source These pumps work in all temperatures—air pumps have been shown to work at temperatures well below freezing. [16] X Research source Both types of heat pumps are forms of renewable energy, but geothermal pumps are considered more energy efficient due to ground temperatures being more stable than air temperatures. However, geothermal heat pumps are much more expensive and require a much more complex installation process."
    },
    {
      "title": "Purchase a wind turbine for your home.",
      "content": "Purchase a wind turbine for your home. When you picture a wind turbine, you’re probably thinking of the massive, skyscraper-sized pinwheel structures you see while driving through open farmland. However, smaller wind turbines are available as an excellent renewable energy source for homeowners. They can be installed as a free-standing pole or directly onto the building. As the wind blows, the blades will turn, driving the internal turbine and generating power."
    },
    {
      "title": "Use a biomass system to produce heat and hot water.",
      "content": "Use a biomass system to produce heat and hot water. Biomass heating systems use organic materials like wood pellets, chips, and logs, to create heat and hot water. In a biomass system, these organic materials are burned in order to generate electricity in your home . Compared to fossil fuels like coal and oil, the wood burned in a biomass system generates much less carbon—about the same amount as the tree absorbed during the time that it was growing. [17] X Research source"
    },
    {
      "title": "Install a solar power or solar heating system.",
      "content": "Install a solar power or solar heating system. Solar power can be used as a renewable energy source through solar panels and solar water heaters—and it doesn’t even have to be sunny for these systems to work efficiently! Solar photovoltaic panels are one of the most recognizable types of renewable energy. The panels can be installed on the roof, and they convert the sun’s rays into energy that can be used to warm your home, power your devices, and provide hot water. [18] X Research source However, installing solar panels as a homeowner can be a costly and time-consuming endeavor (even though solar panels will likely still save you money in the long-term). As an alternative, solar water heaters use sunlight channeled through solar collectors to capture and retain the sun’s heat in an insulated storage tank. This tank then heats the circulating water to provide it to your home. [19] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source Solar water heaters, however, do require a backup system when there’s insufficient sunlight."
    },
    {
      "title": "Try a hydroelectric system if you live near a lake or river.",
      "content": "Try a hydroelectric system if you live near a lake or river. Hydroelectric systems use downward-flowing numbers to generate electricity. In-home hydroelectric systems aren’t an option for everyone, since they require water. However, if you live in a home that’s on a river with a 1-meter (0.00062 mi) drop, you may be able to generate enough electricity to power your entire home with a hydroelectric system. [20] X Research source"
    },
    {
      "title": "What is renewable energy?",
      "content": "What is renewable energy? Renewable energy is energy generated from natural sources like the sun, wind, biomass, and water. Typically, renewable energy sources are things that can be naturally replenished and don’t emit harmful greenhouse gases. Often referred to as “green” or “clean” energy, renewable energy is a step away from traditional energy sources like fossil fuels (coal and oil) that emit greenhouse gases and do irreparable harm to the environment. [21] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source"
    },
    {
      "title": "How are RECs priced?",
      "content": "How are RECs priced? RECs are bought and sold on two different markets: compliance markets and voluntary markets. Renewable portfolio standards typically drive compliance market prices, while voluntary markets are usually driven by climate-related sustainability goals. The prices in each of these markets vary greatly depending on these factors as well as national and statewide economics, but compliance markets are typically more expensive than voluntary ones. [22] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "What is the legal basis of RECs?",
      "content": "What is the legal basis of RECs? RECs are primarily designated by state law as a way to substantiate claims in the U.S. renewable electricity market. When a corporation, household, non-profit, business, or other organization has to or choose to legally prove how they are offsetting their carbon footprint, renewable energy credits are a way to do it. RECs are supported by governmental entities, regional electricity authorities, NGOs, trade associations, and U.S. case law. [23] X Research source"
    },
    {
      "title": "What is the difference between RECs and carbon offsets?",
      "content": "What is the difference between RECs and carbon offsets? Offsets and renewable energy credits both represent the environmental benefits of actions taken to reduce greenhouse gas emissions. RECs represent 1 MWh of generated renewable electricity, while offsets represent a metric ton of avoided or reduced emissions. Fundamentally, a REC and a carbon offset have different criteria for qualification and crediting—RECs are focused on crediting the creation of green energy, while offsets are focused on crediting the reduction of harmful energy. [24] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    }
  ]
}