{
  "url": "https://www.wikihow.com/Mom-I-Frew-Up",
  "title": "What Does “Mom I Frew Up” Mean?",
  "steps": [
    {
      "title": "It’s a meme about being a kid and waking your mom up after you’ve vomited.",
      "content": "It’s a meme about being a kid and waking your mom up after you’ve vomited. “Mom I frew up” is a catchphrase and meme series that recalls the nostalgic experience of being a small child and waking your parents (usually your mom) up in the middle of the night to tell them you’ve thrown up. The meme format usually involves an image of a small figure (not necessarily a child) standing in a doorway with the caption “Mom I frew up.” The meme’s popularity reflects the universality of the experience of throwing up as a kid and seeking your mom for help—but it also touches on the comfort we can find in our parents when we’re sick or upset. “Mom I threw up” is also sometimes used, but “frew” is meant to more accurately reflect how a young kid might say “threw.” The meme frequently takes the form of photos, but it may also be used in videos, especially on TikTok."
    },
    {
      "title": "The meme began on Twitter in late 2018.",
      "content": "The meme began on Twitter in late 2018. The earliest known meme related to “Mom I frew up” was posted in September 2018 by user @onyxrose9. The post included an image of an alien walking through a dark tunnel with the caption, “Me walking up to my parents room at 3 am on a school night just to tell them I threw up on my pillow.” [1] X Research source A more viral version of the meme was posted in October 2018 by user @Moristiko. The since-deleted tweet included a picture of a small alien standing in a doorway with the caption, “me walking to my parents room at 2am telling them i threw up.” [2] X Research source The trend continued on Twitter, with user @dontperciveme00 being the first to literally use the phrase “mom, i threw up,” in the caption to a post including a photo of a baby raccoon standing behind a sliding glass door ."
    },
    {
      "title": "The meme grew in popularity across Reddit, Instagram, and TikTok.",
      "content": "The meme grew in popularity across Reddit, Instagram, and TikTok. As the phrase spread on Twitter, Reddit, and Insta, users began incorporating various fictional characters or people into the meme (like Mike Wazowski ). [3] X Research source They also began changing “threw” to “frew” to more accurately reflect how a small child might speak. The phrase eventually made its way onto TikToks in videos of people acting as themselves as young kids—like this video by user @itstrevorabney —or of cats seemingly embodying the meme, as in this compilation vid ."
    },
    {
      "title": "Use the meme to showcase a cute but funny character, figure, or animal.",
      "content": "Use the meme to showcase a cute but funny character, figure, or animal. The meme is frequently used as a stand-alone humorous image, with its power lying in the image you choose to pair with the caption. Find an adorable, funny, or surprising image of your pet, a celebrity, or a trendy fictional character, and pair it with the catchphrase. For instance, next time you snap a cute photo of your dog standing on its hind legs, caption it “Mom I frew up.” You can also keep an eye out for current social media trends to pair with the meme, like someone did with the Robert Pattinson in a Tracksuit meme ."
    },
    {
      "title": "Make a TikTok video of you acting out the meme.",
      "content": "Make a TikTok video of you acting out the meme. People have taken to TikTok to make videos in which they reenact themselves as a young kid using the “Mom I frew up” line with their own parents. The video showcases the common experience many of us share of finding comfort (and, retroactively, humor) in going to our parents when we’re distressed."
    },
    {
      "title": "“Mom I frew up” is one of many fun social media trends you can partake in.",
      "content": "“Mom I frew up” is one of many fun social media trends you can partake in. There are loads of other side-splittingly funny or weird memes to get in on on the internet. Check out these articles to learn about similar memes: Bombastic Side-Eye Shrimp Is Bugs Old Man Yells at Cloud He Just Like Me Fr Only in Ohio"
    }
  ]
}