{
  "url": "https://www.wikihow.com/See-Someone%27s-Likes-on-Instagram",
  "title": "How to See Someone's Likes on Instagram: Tricks & Workarounds",
  "steps": [
    {
      "title": "",
      "content": "There is no way to see a list of posts or Reels a person has liked on their Instagram profile. The only way to see if someone liked an Instagram post is to open it and see if the person's username appears in the list of people who liked it."
    },
    {
      "title": "Go to the person's Instagram profile.",
      "content": "Go to the person's Instagram profile. While you can't see a list of posts someone liked on Instagram, you can see who they're following , and then check those users' posts to see if the person liked them."
    },
    {
      "title": "Tap their Following list.",
      "content": "Tap their Following list. It's the number above \"Following\" at the top of their profile. This displays a list of people the user is following on Instagram. If you are not already following this person and their profile is private , you won't be able to see their Following list."
    },
    {
      "title": "Browse the feeds of the people they follow.",
      "content": "Browse the feeds of the people they follow. You can tap the number of likes beneath any of their photos to see a list of everyone who liked it. Any mutual friends you have in common with the person who posted the photo will be at the top. So, if you're checking to see if your friend liked a post, you should see their name at the top of the Likes list. [1] X Research source"
    },
    {
      "title": "Tap the menu at the top of your profile ☰.",
      "content": "Tap the menu at the top of your profile ☰ . Even though you can't see someone else's likes, your own likes are super easy to find."
    },
    {
      "title": "Tap Your Activity.",
      "content": "Tap Your Activity . It's under \"How you use Instagram.\""
    },
    {
      "title": "View your likes, comments, tags, and more.",
      "content": "View your likes, comments, tags, and more. Tap Likes to see an ongoing list of every post and Reel you've liked on Instagram, with your most recent likes at the top. You can use the menus at the top to display likes from a certain date range, reorder them from oldest to newest, and content type (posts, Reels, and Threads). [2] X Research source"
    },
    {
      "title": "What Instagram activity can you see?",
      "content": "What Instagram activity can you see? Instagram no longer has an activity feed, so it's tricky to see what someone is doing. You can see likes and comments on posts and Reels, but you have to go directly to the post or Reel to see them. It also isn't possible to see if somebody viewed, liked, or responded to someone else's Instagram Story ."
    },
    {
      "title": "Is there an app that can tell me what someone likes on Instagram?",
      "content": "Is there an app that can tell me what someone likes on Instagram? No. Apps that claim to be able to tell you what your friend or partner is doing on Instagram cannot show you other peoples' Instagram activity because this feature isn't built into Instagram. Don't be fooled by these fake apps, as they are generally scams. If you tried to use some Instagram stalker app and linked it to your account, unlink it for your safety."
    },
    {
      "title": "Can people see what I like on Instagram?",
      "content": "Can people see what I like on Instagram? People cannot see a list of posts you've liked, but if they view a post you have liked, they will see your name in the Likes list."
    }
  ]
}