{
  "url": "https://www.wikihow.com/Pass-a-Job-Interview",
  "title": "How to Pass a Job Interview",
  "steps": [
    {
      "title": "Do some research about the company ahead of time.",
      "content": "Do some research about the company ahead of time. You will make an impression as a serious candidate if you come to the interview with some background knowledge about the company and the direction in which it’s heading. Try to figure out the goals of the business or the organization that you're applying for a job with, getting some sense of their style and the way they situate themselves against their competitors. [1] X Research source Focus on using the vocabulary that shows up on the company’s website. If you’re applying for a serving job at a “farm-to-table” restaurant, you should probably be familiar with what that means. If you're applying to work as an editor with a holistic magazine, you need to do some research into holistic medicine. Knowing your interviewer's name and some details about that person's role in the company can help you have a more conversational dialogue during your interview, which often leads to the interviewer forming a more positive impression."
    },
    {
      "title": "Anticipate and practice your answers to common interview questions.",
      "content": "Anticipate and practice your answers to common interview questions. The most stressful part of the job interview is figuring out how to answer the questions that you’ll be asked. What does the interviewer want to hear? Trying to do some digging and anticipate possible questions will help you practice your answers before hand. Come up with answers that are sincere, but still reflect positively on you as a candidate. Frequently asked interview questions and possible answers include: [2] X Research source What do you know about this company? Why are you a good fit for this company? What do you bring to a team? Describe a time when you overcame a challenge at work."
    },
    {
      "title": "Come up with a good strength and weakness.",
      "content": "Come up with a good strength and weakness. What is your most difficult work-related challenge? What is your biggest strength? Biggest weakness? These are some of the most commonly asked interview questions, and the interview is the last moment you want to be struggle for a good answer. You'll be asked this question in almost every single job interview. [3] X Research source Good answers to these question are sometimes couched in self-praise: \"I'm very organized when it comes to my work and my schedule, but you'd never know it if you saw my desk\" is a good answer. Likewise, \"I tend to take on responsibilities but sometimes forget to ask questions when I need help\" can be honest and effective. If you're applying for a leadership position, it's important to emphasize your leadership qualities and your self-reliance. A good strength might be, \"I'm good at communicating my vision to people and getting others excited about a common goal.\" A good weakness might be, \"I have to remember to slow down and take on one project at a time. Sometimes I want to do too much.\" If you're applying for an entry-level position, the interviewer won't be looking for you to prove leadership credentials. A good strength might be, \"I follow directions extremely well and I'm a fast learner. If I don't know how to do something, I'm always keen to learn and improve, so I won't have to ask twice.\" A good weakness might be, \"I'm not always the best idea person, I'm mostly happy to help other people implement their ideas.\""
    },
    {
      "title": "Bring some good questions of your own.",
      "content": "Bring some good questions of your own. Interviewers will often ask if you have any questions during or after the interview, which can throw a lot of first-time interviewees. Asking a question shows you are engaged in the conversation, so come up with a list of questions to ask so you are prepared in case you can't come up with one quickly when you are prompted. Good questions might include: [4] X Research source How do you like working here? What does someone need to be successful at this company? Who will I be working with most closely? What do the day-to-day operations consist of? Is there room for growth with this company? What's the turnover like for this position?"
    },
    {
      "title": "Avoid clichés.",
      "content": "Avoid clichés. Interviews are a time to let your potential employer get to know you, the real you, not a pumped-up, cliched version of yourself who's giving canned answers to try to get a job. The purpose of the interview isn't to suck up, show off, or tell the interviewer what they want to hear. The purpose is to give sincere answers, not to insult the interviewer's intelligence. Avoid interview lines like ”My only weakness is that I’m a perfectionist\" or \"This company needs someone like me to turn it around.\""
    },
    {
      "title": "Complete all necessary documents ahead of time.",
      "content": "Complete all necessary documents ahead of time. Depending on the interview process, it is really helpful if you bring along an extra copy of your resume, references, work portfolio, and a cover letter, if applicable. Look over all documents for typos and grammatical errors. If you have time, give them to someone else to review and catch any silly mistakes you may have missed. It's also important to familiarize yourself intimately with your resume, CV, and other application materials. It can look suspicious if you have trouble recalling content from your resume, so you want to make sure all names, dates, and described responsibilities are clear. Be sure to use the space on your resume to highlight your skills and experiences rather than including a list of references—the hiring team will request references once you get to the final stages of an interview process."
    },
    {
      "title": "Dress the part.",
      "content": "Dress the part. Pick out an outfit that makes you look professional and feel confident, as well as something that matches the business to which you’re applying. [5] X Research source In most cases dark-colored suits are appropriate for interviews, unless you are interviewing for a job with a very casual dress code, in which case dress pants and a clean, collared shirt are appropriate."
    },
    {
      "title": "Get there on time.",
      "content": "Get there on time. Nothing looks worse than arriving to a job interview late. Show up at the appropriate time, ready to go. If your interview is in an unfamiliar area, drive to the location the day before to make sure you aren't late because you got lost. Aim to arrive no fewer than 10 or 15 minutes before your assigned interview time to factor in unknown causes of delay like traffic conditions, etc. [6] X Trustworthy Source CareerOneStop Online resource sponsored by the U.S. Department of Labor providing information on job training, employment opportunities, and careers Go to source Keep in mind though, while it’s important to show up on time, showing up too early can be frustrating for potential employers. If they told you to be there at a specific time, that means they want you there at that time, not 30 minutes before. If you want to make a good impression, follow instructions specifically. Stay busy as you wait, writing notes or reviewing the job description and company information. Keep documents and materials in your left hand so you are prepared to get up and shake hands as soon as the interviewer comes out to greet you."
    },
    {
      "title": "Practice power posing right before your interview to help you feel your best.",
      "content": "Practice power posing right before your interview to help you feel your best. If you can, step into the restroom or somewhere private about 5 minutes before your interview is scheduled to start. Look in the mirror and stand up straight, with your shoulders back, feet hip-width apart, and your hands on your hips. Then, hold that pose for a minute or two. This can have a mental and even physical effect that makes you feel more powerful and confident. [7] X Research source Try pairing this with a positive affirmation, like, \"I'm absolutely qualified for this position, and I just need to show them that!\""
    },
    {
      "title": "Be yourself.",
      "content": "Be yourself. At an interview, you'll likely feel nervous and want to perform your best. It's a scary situation, no doubt about it. But Try to remember that you don't need to put on an act to get a job. You just need to be yourself. Focus on remaining calm and listening closely to the conversation as it unfolds. Be yourself. [8] X Trustworthy Source CareerOneStop Online resource sponsored by the U.S. Department of Labor providing information on job training, employment opportunities, and careers Go to source Interviewers expect you to be nervous. Don't worry about saying so. It might help to get it out of the way and get to know your interviewer on a more personal level, which can help you to stand out. Don't be afraid of small talk."
    },
    {
      "title": "Listen closely and pay attention.",
      "content": "Listen closely and pay attention. One of the worst things you could do in an interview is have to ask an interviewer to repeat their question because you weren't paying attention. Don't disqualify yourself by letting your mind wander. Most interviews won't take more than 15 minutes, and certainly never longer than an hour or so. Focus on the conversation at hand and respond actively. [9] X Research source"
    },
    {
      "title": "Sit up and keep your back straight.",
      "content": "Sit up and keep your back straight. Lean forward and listen closely during an interview, using open and interested body language. Look at the interviewer when you're talking and when they are speaking. A great interviewing trick is to look at the bridge of the interviewers' nose, between the eyes. They will have no idea you aren't making eye contact and it will help you relax a little. Try it with a friend, you will be amazed."
    },
    {
      "title": "Think before you speak.",
      "content": "Think before you speak. Another common mistake in an interview is talking too much and too quickly. You don’t need to fill awkward silences with chatter. Especially if you’re a nervous talker, don’t feel the need to fill the space with talking. Sit back and listen. Don’t give away too much. When you're asked a question, you don't need to have an immediate answer. In fact, it can be a turn off for an interviewer to feel as if you've given no thought whatsoever to a complicated question. Slow down and think about it. Pause, say, \"That's a great question, let me think about a good answer.\""
    },
    {
      "title": "Be willing to do what it takes.",
      "content": "Be willing to do what it takes. Your go-to answer in a job interview should be \"Yes.\" Are you willing to work nights and weekends? Yes. Are you comfortable taking on multiple clients? Yes. Do you have experience working in a high-paced environment? Yes. Most jobs provide enough on-the-job training for skills that are essential to conducting the day-to-day operations that you'll be able to pick up anything you're unfamiliar with after you get the job. Don't disqualify yourself ahead of time. Be agreeable and sort out the details after you get the job. Don't lie about some things. Being willing to do what's necessary for the position doesn't mean that you should stretch your experiences or tell fibs that'll get you outed the first day on the job. If you've never cooked a meal in your life, you shouldn't tell the kitchen manager you're a great cook."
    },
    {
      "title": "Sell yourself in conversation.",
      "content": "Sell yourself in conversation. In general, the purpose of the interview is just to get to know you as a person. They've got your resume, your experiences, and your essentials on paper. What they don't know is you. [10] X Research source An interview isn't an interrogation or an argument. It's a conversation. Participate in it. When the interviewer is talking, pay close attention and listen to what they are saying, listen, and respond honestly. Some interviewees are thrown when interviewers don't instantly launch into a series of questionnaire-style questions."
    },
    {
      "title": "Take notes.",
      "content": "Take notes. Carry a pen and paper in your portfolio or briefcase to jot quick notes if necessary. You may also bring extra copies of your application documents and questions list to refer to if needed. [11] X Research source Note-taking makes you appear engaged and well-organized. It also helps you remember important details and names, which can be useful later in the interview, or when you are making follow-up contact. Be careful to only take brief notes when necessary to take any at all, since extensive note-taking can be distracting."
    },
    {
      "title": "Follow up.",
      "content": "Follow up. It's usually a good idea to get in touch shortly after the interview to keep your name somewhere in the conversation. Unless you've been explicitly told not to, make contact to follow up on your interview. Calls are usually discouraged, but emails or other correspondence would be a good idea. Since many companies have a lot of references to check, make sure your references are ready to receive the call and get back to the employer. [12] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Summarize important details of the interview, using your notes to refresh your memory. Make sure to thank the interviewer for the opportunity, and mention that you look forward to hearing from the company soon."
    },
    {
      "title": "Don’t show up with coffee.",
      "content": "Don’t show up with coffee. For some reason, lots of people think bringing a to-go cup of coffee to a job interview is a great idea. To an interviewer, this looks informal at best and disrespectful at worst. You're not on your lunch break, so treat yourself to a latte after the interview, not before. Even if the interview is early, or you might end up waiting a long time to get through with it, don't show up with a cup of coffee. The plus side is you won't have to worry about spilling it."
    },
    {
      "title": "Turn off your phone and put it away.",
      "content": "Turn off your phone and put it away. Biggest faux-pas of the mobile phone age? Using yours in a job interview. Never ever take your phone out and look at it at any point in the job interview. As far as your interviewer is concerned, you should be a troglodyte who's never even heard of an app. Turn your phone all the way off, keep it in your car, and never, under any circumstances, give the interviewer the impression that a text message takes precedence over getting this job. [13] X Trustworthy Source CareerOneStop Online resource sponsored by the U.S. Department of Labor providing information on job training, employment opportunities, and careers Go to source"
    },
    {
      "title": "Don't talk about money.",
      "content": "Don't talk about money. In the interview, it's not the time to ask about benefits, the possibility of a raise, or really even bring up the topic of money. If you're applying for a job, it's time to focus on your skills and qualifications. Sometimes, you'll be prompted to provide a base salary requirement for the job. The best answer for this is that you're willing to work for the lower end of the average salaries for your position. Express that you really want the job and that you'll be fine with what's being offered in the legal limit."
    },
    {
      "title": "Treat your interview like a conversation, not an interrogation.",
      "content": "Treat your interview like a conversation, not an interrogation. Never get defensive in an interview, even if you feel like you're not getting on perfectly with the interviewer. It's supposed to be a conversation, so try to assume the best in people. Nobody is trying to antagonize you on purpose. Treat it as a chance to prove yourself and come up with a good explanation, not a defensive snark. [14] X Research source"
    },
    {
      "title": "Don’t knock your previous boss.",
      "content": "Don’t knock your previous boss. Making petty comments about previous coworkers, superiors, or other job in general should be avoided. Even if you're applying for a rival business, avoid painting yourself like someone with a grade, or like someone who'll be difficult to work with. It's bad form to gripe about your previous job. If you're asked why you're leaving your current job, say something positive. \"I'm looking for more out of my work environment and I'm excited about getting a fresh start. To me, this looks like a great place to do it.\""
    },
    {
      "title": "Avoid pre-interview cigarettes and alcohol.",
      "content": "Avoid pre-interview cigarettes and alcohol. Even if you indulge in the occasional smoke, avoid smoking before a job interview. A recent study revealed that up to 90 percent of employers would hire a nonsmoker over a smoker of equal qualification. Right or wrong, smoking makes the interviewee looks nervous. Likewise, having a few drinks to soothe tense nerves should always be avoided. You want to be sharp and on point, not sloppy. Interviewers will expect you to be nervous. It’s a job interview."
    },
    {
      "title": "Don’t be afraid to reveal yourself.",
      "content": "Don’t be afraid to reveal yourself. Billionaire mogul Richard Branson claims to hire primarily based on personality, as opposed to experience or quantifiable skills. Each job is different and the essential aspects of the job can be learned. Focus on selling yourself and letting your true personality shine through, not on trying to be something you’re not. [15] X Research source"
    }
  ]
}