{
  "url": "https://www.wikihow.com/Play-Werewolf-on-Telegram-on-iPhone-or-iPad",
  "title": "How to Play Werewolf on Telegram Using Your iPhone or iPad",
  "steps": [
    {
      "title": "Open Telegram.",
      "content": "Open Telegram. Telegram has a blue icon with a white paper airplane. Tap the Telegram icon on your Home screen to open Telegram. If you do not currently have Telegram, you can download it for free from the App Store. You may also want to take a little time to learn how to use Telegram ."
    },
    {
      "title": "Tap the Chats tab.",
      "content": "Tap the Chats tab. It's the icon that resembles two speech bubbles at the bottom-middle of the screen."
    },
    {
      "title": "Tap the search bar and type @werewolfbot.",
      "content": "Tap the search bar and type @werewolfbot . Search results will display below the search bar as you type. [1] X Research source"
    },
    {
      "title": "Tap Werewolf Moderator.",
      "content": "Tap Werewolf Moderator . If you typed the name correctly, it will be the first result at the top. This will start a private message dialogue with the Werewolf Moderator. Werewolf Moderator is not a real person. It is a bot."
    },
    {
      "title": "Tap Start.",
      "content": "Tap Start . It's the button at the bottom of the screen. This will start the Werewolf bot program."
    },
    {
      "title": "Type /grouplist in the message bar and tap the Send icon.",
      "content": "Type /grouplist in the message bar and tap the Send icon. This will start a search for groups that play Werewolf. Alternatively, you can search for a group called \"Werewolf - The Game.\" This is the official group chat for Werewolf and the largest group."
    },
    {
      "title": "Select a language.",
      "content": "Select a language. Tap whichever language you wish to play in."
    },
    {
      "title": "Select a Variant.",
      "content": "Select a Variant. If you are new to Werewolf, select Normal . There are other game variants and modes you can play in. These variants may differ depending on which language you select. Variants that include \"Not Safe for Work\" or \"NSFW\" may include adult language and images."
    },
    {
      "title": "Tap the group you want to join.",
      "content": "Tap the group you want to join. Each variant will have a list of groups you can join. Tap whichever group you are most interested in joining."
    },
    {
      "title": "Tap Join group.",
      "content": "Tap Join group . It's the blue button at the bottom of the page. Depending on the timing and number of players, a game may already be in progress. If so, it's a good idea to observe the chat to get an idea of how the game is played. Some rooms may require you to verify that you are not a bot. To do so, tap I am not a bot in the chat. Then reply to the message with the alphanumeric numbers in the image."
    },
    {
      "title": "Start or join a new game.",
      "content": "Start or join a new game. To start a new game, type /startgame@werewolfbot , then tap the Send icon. This starts your first game of Werewolf! If someone else in the group starts a game and you want to join, simply type /join during the joining phase. [2] X Research source If you want to extend the Join timer to allow more players to join, type /extend during the joining phase to extend the timer. This feature may not be available in all groups."
    },
    {
      "title": "Understand the night cycle.",
      "content": "Understand the night cycle. Werewolf always starts with a night cycle. During this phase, all the action happens. Werewolves can select a player to kill. Other player roles may have actions of their own they can perform at night. If you type / in chat, a list of commands will appear above the chat as you type. You can tap these commands to use them instead of typing them all out."
    },
    {
      "title": "Understand the day cycle.",
      "content": "Understand the day cycle. During the day cycle, the villagers (and werewolves) can talk amongst themselves and decide who they think the werewolves are. They can also hold a lynch vote to vote on who they think the werewolf is. The player that gets the most votes will be killed. Be careful. Werewolves can also vote!"
    },
    {
      "title": "Understand the villager roles.",
      "content": "Understand the villager roles. While Werewolf on Telegram is similar to Werewolf the party game, there are a lot more roles for players to assume. The following are the roles on the side of the villagers: [3] X Research source Villager: Basic villagers have no special skills. Your only goal is to help the other villagers figure out who the werewolves are without getting killed by the werewolves or lynched by your villager teammates. The villager emoji is a man with blond hair. The Seer: Each night the Seer is able to pick a player and have that player's role revealed to them. Be careful not to reveal your role as the Seer to other players. Otherwise, the werewolves may attack you. The Seer emoji is a person with grey hair. Apprentice Seer: If the Seer dies, the Apprentice Seer becomes the new Seer. The Apprentice Seer emoji resembles a person thinking, with their hands in front of them. Cursed: If a Cursed villager is attacked by a werewolf, they become a werewolf and can then hunt the villagers at night. The Cursed emoji is a cat with a frown. The Drunk: If the Drunk is attacked by a werewolf, the werewolf also becomes drunk and cannot attack the next night. The Drunk emoji resembles two beer pints. The Harlot: The Harlot is allowed to visit one player each night. If Harlot lives, you know that player is not a werewolf. If the Harlot visits a werewolf or serial killer, they will be murdered. The Harlot emoji resembles a lipstick kiss. The Beholder: The Beholder will always know who the Seer is. The Beholder emoji is an eyeball. The Gunner: The Gunner has two silver bullets. Each day, they will be allowed to shoot one player. Once they shoot a player, everyone will know they are the gunner. Be careful. You only get two bullets. The Gunner emoji resembles a water pistol. The Traitor: If the Traitor is alive after all werewolves are killed, they will become a werewolf and hunt other players. The Traitor emoji is a middle finger. The Guardian Angel: The Guardian Angel can select a player to watch over and protect each night. If the Guardian Angel chooses to watch over a werewolf, there is a 50% chance they will be killed. The Guardian Angel emoji resembles a cherub's face with wings and a halo. The Detective: Each day the Detective has a chance to investigate a player. However, there is a 40% chance they may be detected by the werewolves. The Detective emoji resembles a man with a fedora. Cultist Hunter: Each night the Cultist Hunter may select a player to hunt. If that player is a Cultist, they will die. If a Cultist attacks a Cult Hunter, the newest cult member will die. The Cult Hunter emoji resembles a guy with a bearskin hat. The Wild Child: The Wild Child may select a role model at the beginning of the game. If their role model dies, the Wild Child becomes a werewolf. The Wild Child emoji resembles a baby's face. The Fool: The Fool is told they are the Seer at the beginning of the game. Each night they can choose to reveal the role of a player, but the role that is revealed is completely random. The Fool emoji resembles a joker card. Masons: All Masons know who each other are. If one of the Masons is converted to the cult, the other masons will know. The Mason emoji resembles a guy with a hard hat. Cupid: Cupid is allowed to select two players at the beginning of the game. If one player dies, the other will too. If both players are alive at the end of the game, they will win regardless of what team they are on. The Cupid emoji resembles a bow and arrow. The Hunter: If a werewolf attacks the Hunter, the hunter has a 30% chance of killing the werewolf instead. If more than one werewolf attacks the hunter, the chance of the Hunter killing a werewolf goes up, but the chance of the Hunter surviving goes down. If a Cultist attacks a Hunter, they have a 50% chance of not being converted to the cult, and a 50% chance of killing the cultist. The Hunter emoji resembles a dart hitting a bullseye. The Mayor: The Mayor has no special abilities until he reveals himself. Once he reveals himself, his vote counts double during lynch voting. The Mayor emoji resembles a medal. The Prince: If the Prince is voted out during a lynch vote, they will be revealed as the Prince and they will survive. This can only happen once. If the team holds a second vote and insists on voting out the Prince, they will die. The Prince emoji resembles a crown. The Clumsy Guy: When the Clumsy Guy votes, there is a 50% chance their vote will be cast for a completely random player. The Clumsy Guy emoji resembles a guy with a head bandage. The Blacksmith: The Blacksmith has a chance of preventing the werewolves from eating at night. The Blacksmith emoji resembles two hammers. The Sandman: The Sandman can prevent all players from using their special abilities at night, but only once per game. The Sandman emoji resembles blue \"Zs\" floating up. The Oracle: While the Oracle cannot tell what role a player is, they can determine what role a player is not. This will be chosen from roles that are still alive. The Oracle emoji resembles a blue spiral. The Pacifist: The Pacifist can nullify a lynch vote, but only once per game. The Pacifist emoji resembles a peace sign. The Wolf Man: If the Seer tries to determine your role, they will think you are a werewolf. The Wolf Man has two emojis, which resemble a man with blond hair, and a round black face. The Wise Elder: The Wise Elder can survive a werewolf attack, but only once per game. If the Hunter or Gunner attacks the Wise Elder, they will lose their ability and be converted to a normal villager. The Wise Elder emoji resembles a stack of books. The Troublemaker: The Troublemaker can call for a second vote during the day, but only once per game. The Troublemaker emoji resembles a head exploding. The Chemist: Every other night, the Chemist can choose a random player to have a drink with. One drink is neutral and the other is poison. The Player will choose which drink they want, and you will drink the other one. One player will die. There is a 50% chance you will get the poisoned drink. The Chemist emoji resembles a guy in a lab coat. The Gravedigger: If anyone (including werewolves) died the previous night, werewolves and the Serial Killer will not be able to find the Gravedigger. If no one died the previous night, there is a chance the werewolves and Serial Killer can attack the Gravedigger. The Gravedigger emoji resembles a skull and crossbones. The Augur: Every morning, the Augur can find out a role that is not in the game. The same role will not be revealed twice. The Augur emoji resembles an eagle."
    },
    {
      "title": "Understand the evil roles.",
      "content": "Understand the evil roles. In addition to werewolves, there are other evil roles that players can assume and play against the Villager team. Some of these roles play on the Werewolf team, and some play on a team of their own. The evil roles are as follows: Werewolves: During the day, the werewolf's goal is to act as a normal villager and deceive the other villagers. At night, werewolves can pick a random player to kill. The werewolf emoji resembles a rat's head. The Lycan: The Lycan is just like a regular werewolf, except that they will appear as a normal villager to the Seer. The Lycan has two emojis, which resemble a rat's head and a face. Snow Wolf: The Snow Wolf does not attack other players with the rest of the werewolves. Instead, they can select a player to freeze and prevent them from performing any actions that night. A Snow Wolf cannot freeze the same player two nights in a row. The Snow Wolf has two emojis, which resemble a rat's head and a snowman. Wolf Cub: If the Wolf Cub is killed, all other werewolves will be allowed to claim two victims that same night. The Wolf Cub has an emoji that resembles a puppy face. The Sorcerer: The Sorcerer plays on the same team as the werewolves. They can reveal if a player is a werewolf or a Seer. The Sorcerer emoji resembles a crystal ball. Cultists: The Cultists' goal is to convert all other players (except the werewolves and Serial Killer) to the cult. If all living players are members of the cult at the end of the game, the Cultists win. The Cultist emoji resembles a silhouette of a person. The Serial Killer: The Serial Killer plays on a team by themselves. They can kill any player. If the Serial Killer is attacked by a werewolf, there is an 80% chance they will kill the wolf and live. If the Serial Killer survives the game, they will win. The Serial Killer emoji is a knife. The Arsonist: The Arsonist also plays on a team by themselves. Every night, they can choose to dose a player's house in kerosene. Once one or more houses are doused, the Arsonist can choose to ignite all doused houses and kill all inhabitants (and their guests). If the Arsonist is the last one alive at the end of the game, they win."
    },
    {
      "title": "Understand the neutral roles.",
      "content": "Understand the neutral roles. In addition to the Villager and Evil roles, the neutral roles don't support either team, and may win or lose along with another team. These roles are as follows: The Doppelganger: The Doppelganger is allowed to pick one player at the beginning of the game. If that player dies, the doppelganger will assume the role that player had. Cultists cannot recruit a doppelganger to the cult until after they have changed roles. If the doppelganger does not change roles by the end of the game, they lose. The Doppelganger has an emoji that resembles comedy and drama masks. The Tanner: If the Tanner gets voted out during a lynch vote, he automatically wins and everyone else loses. The Tanner emoji resembles a devil mask. The Lovers: The Lovers are assigned by Cupid at the beginning of a game. If one wins, they both win. If one dies, they both die. If both players are the last players alive at the end of the game, they both win regardless of team and get a special ending. The Lovers do not have an emoji. The Thief: The Thief can steal any player's role during the first night of the game. If Full Thief mode is turned on, there is a 50% chance the Thief can steal a role every night. If successful, that player will become the new Thief. The Thief emoji resembles a purple devil."
    },
    {
      "title": "Open Telegram.",
      "content": "Open Telegram. It's the blue app with a white paper airplane in the center. If you haven't already, download Telegram from the App Store and sign in with your username and password."
    },
    {
      "title": "Tap the Chats tab.",
      "content": "Tap the Chats tab. It's the icon that resembles two speech bubbles at the bottom-middle of the screen."
    },
    {
      "title": "Tap the group chat you want to play Werewolf with.",
      "content": "Tap the group chat you want to play Werewolf with. You can tap an existing group or create a new group. You must be an administrator to add bots to a group. If you're having trouble adding the bot to your group, you may need to convert your group to a supergroup."
    },
    {
      "title": "Tap the group profile image.",
      "content": "Tap the group profile image. It's in the upper-right corner. This will display the Group Info menu."
    },
    {
      "title": "Tap Add Member.",
      "content": "Tap Add Member . It's at the top of the member list."
    },
    {
      "title": "Tap the search bar and type @werewolfbot.",
      "content": "Tap the search bar and type @werewolfbot . The search bar is at the top of the page. This will display a variety of users that match your search results."
    },
    {
      "title": "Tap Werewolf Moderator and then press Done.",
      "content": "Tap Werewolf Moderator and then press Done . If you typed the name correctly, it should be in your list of search results at the top.This adds the Werewolf Moderator bot to your group. With the Werewolf Moderator bot added to your group, you can play Werewolf in your own group."
    },
    {
      "title": "Tap Close.",
      "content": "Tap Close . It's the button at the top-left of the screen. This will take you back to the main group chat."
    },
    {
      "title": "Open the chat you added the Werewolf Moderator too.",
      "content": "Open the chat you added the Werewolf Moderator too. If you haven't already done so, open Telegram and tap the group or channel you added the Werewolf Moderator to."
    },
    {
      "title": "Type /config and tap the Send icon.",
      "content": "Type /config and tap the Send icon. The Werewolf Moderator will PM you a list of options you can use to configure the game."
    },
    {
      "title": "Set the timers for the game.",
      "content": "Set the timers for the game. To set the game timers, tap Game Timers and use one of the following options to set your game timers: Max Extended Time: This is the amount of time that can be added to a joining timer by typing the \"/extend\" command. To set this timer, tap this option and then tap the number of seconds you want the \"/extend\" command to extend the joining timer by. Set Day Timer: This is the number of seconds the day cycle lasts in a game. To set the day timer, tap Set Day Timer and then tap the number of seconds you want the day cycle to last. Set Night Timer: This is the number of seconds night lasts in the game. To set the night timer, tap this option and then tap the number of seconds you want the night cycle to last. Set Lynch Timer: This is the time allowed for Lynch voting. To set the Lynch timer, tap this option, and then tap the number of seconds you want to allow for Lynch voting."
    },
    {
      "title": "Configure the roles.",
      "content": "Configure the roles. To configure the roles, tap Role Configuration . Check or uncheck each role you want to allow or disallow. Then tap Validate at the bottom of the screen. Each role is represented by an emoji. If you want to see a complete list of the roles and which role corresponds to each emoji, type \"/rolelist\" in the group chat and tap Send icon."
    },
    {
      "title": "Configure the game mechanics.",
      "content": "Configure the game mechanics. To configure the game mechanics, tap Game Mechanics . Then tap one of the following options and configure the game mechanics: Show Roles At Game End: Tap this option to configure if you want to allow or disallow the game to show the roles at the end of the game. Your options are \" Don't Show Any ,\" \" Show only living players , and \" Show all players .\" Enable Secret Lynch: By default, lynch voting is done out in the open. If you want to allow Lynch voting to be done in secret, select this option and tap Yes. . Secret Lynch Count: If Secret Lynch is turned on, this option will show the vote count at the end of each vote. To enable this mode, first make sure Secret Lynch is enabled. Then tap this option and tap Yes . Secret Voters: If Secret Lynch is enabled, this will show the names of all players who got voted on. To enable this option, make sure Secret Lynch is enabled. Then select this option and tap Yes . Enable Random Mode: When Random Mode is enabled, Chaos, Secret Vote, Show Roles on Death, and whether to allow the Cultist, Fool, and Tanner roles will be determined randomly at the start of a game. To enable this mode, tap this option and then tap Yes . Show Roles on Death: This option allows players' roles to be revealed upon their death. If you want to enable this option, tap this option, and then tap Yes . Thief Full Game: If this option is enabled, the thief can steal a role every night. To enable this mode, tap this option and tap, Yes ."
    },
    {
      "title": "Configure the group settings.",
      "content": "Configure the group settings. The group settings allow you to configure the general settings for the group chat. To configure the group settings, tap Group Settings . Then tap one of the following options and configure the group settings: Change Language: If you want to change the language of the group chat, tap this option and select a new language. Then tap the variant you want to use. Change Game Mode: This option allows you to change between Normal and Chaos mode. In Normal mode, Werewolf Moderator will try to assign both good and evil roles in a way that is balanced and fair for both sides. In Chaos mode, roles will be assigned completely at random. To select a new game mode, tap this option and select Normal Only , Chaos Only , or Player Choice . Set Max Players: This option allows you to select the maximum number of players you want to allow. To select the maximum number of players, tap this option and tap the maximum number of players you want to allow. You can allow between 5 and 35 max players. Allow Extending Timer: If you want to allow or disallow players to extend the Join timer with the \"/extend\" command, tap this option and then tap Allow or Disallow . Allow Fleeing: This option lets you decide if you want to allow or disallow players to flee once a game has started. Players can always flee during the Joining phase. To allow or disallow fleeing after a game starts, tap this option and tap Allow or Disallow . Show IDs on joining: This option allows you to show or hide Player IDs while they join the game. To show or hide player IDs, tap this option and tap Show or Hide . Allow NSFW Gif Packs: This option allows you to allow or disallow players to post GIFs in the chat that may contain adult material. To allow or disallow not-safe-for-work gifs, tap this option and tap Allow or Disallow . Shuffle Player List: This option allows you to shuffle the player list every time a new game starts. To enable or disable this, tap this option, and tap Yes , or No . Burning Overkill: This option lets you decide if you want to allow the Arsonist and a Serial Killer to be in the same game. To allow or disallow this, tap this option, and tap Allow or Disallow ."
    }
  ]
}