{
  "url": "https://www.wikihow.com/Paint-a-High-Ceiling-over-Stairs",
  "title": "How to Paint a High Ceiling over Stairs",
  "steps": [
    {
      "title": "Cover the stairs and railing with drop cloths.",
      "content": "Cover the stairs and railing with drop cloths. No matter how careful you are, there’s a good chance a few drips will fall on the stairs when you paint. Use drop cloths or old sheets to protect the stairs. [1] X Research source If there are any hanging pictures or removable fixtures on the walls of your staircase, you may want to remove them before you begin painting. Be very careful when walking on the stairs, especially if they are wooden, as the cloth will make them slippery. [2] X Research source"
    },
    {
      "title": "Place a step ladder at the top of the stairs.",
      "content": "Place a step ladder at the top of the stairs. To construct a scaffold, you will need ladders on the floor above and the floor below the stairs you will be painting. A step ladder is the most stable option, and should be able to fit on the floor at the top of your stairs. [3] X Research source The step ladder should be parallel with the stairs, and set back at least 6 in (15 cm) from the top stair to avoid any risk of falling. It’s a good idea to place cinderblocks or weights on the inner side of each ladder leg to keep it from moving, laying down a cloth first to protect your floors."
    },
    {
      "title": "Prop an extension ladder against the wall at the bottom of the stairs.",
      "content": "Prop an extension ladder against the wall at the bottom of the stairs. There will most likely not be room to fit another step ladder at the bottom of the stairs that is high enough to make a scaffold. Instead, prop the top of an extension ladder against the wall opposite your stairs. Prop the bottom against 1 of the stairs so that the ladder is angled enough that you could climb it. [4] X Research source Position the extension ladder so that its rungs are even with the rungs of the step ladder, so that your scaffold will be level. You may want to wrap the top arms of the ladder in cloth or foam to protect your wall. [5] X Research source"
    },
    {
      "title": "Lay a 2- by 12- inch (5.1-cm x 30.5-cm) board between the ladders.",
      "content": "Lay a 2- by 12- inch (5.1-cm x 30.5-cm) board between the ladders. Find a board that is at least 2 inches (5.1 cm) thick and about 12 inches (30 cm) wide, or wide enough to stand on. It should be long enough that you can set 1 end on a rung of your step ladder and the other end on a rung of your extension ladder. This will be your scaffold to stand on while you paint the ceiling. [6] X Research source"
    },
    {
      "title": "Clamp the board to the ladder rungs on each side.",
      "content": "Clamp the board to the ladder rungs on each side. Use clamps to secure the board to the ladder and keep it from slipping when you stand on it. You can also nail stops on the underside of the board on either side of where it will rest on the rung. [7] X Research source"
    },
    {
      "title": "Measure the depth of 3 stairs.",
      "content": "Measure the depth of 3 stairs. Your leveler should be deep enough that it spans 3 stairs. Put the end of your measuring tape on the inner edge of any stair and pull it out so that it measures the depth of 3 stairs. You may want to use a level to make sure that you are holding the measuring tape straight when you pull it out. >"
    },
    {
      "title": "Use a level and measuring tape to find the height your leveler should be.",
      "content": "Use a level and measuring tape to find the height your leveler should be. Hold the end of your measuring tape against the surface of 1 of your stairs. Set a level on the 2nd stair up from that one (so that there is 1 stair between them) and measure the distance between the lower stair and where the level sticks out from the higher stair. This will be the height of your leveler’s legs."
    },
    {
      "title": "Measure the width of your stairs.",
      "content": "Measure the width of your stairs. Use measuring tape to find the width of your stairs. Your platform should be about 6–10 inches (15–25 cm) narrower than the width of the stairs, to allow for some room to step around it while it’s in place. For instance, if your stairs are 3 feet (0.91 m) wide, your platform should be no wider than 2.5 feet (0.76 m)."
    },
    {
      "title": "Cut legs for your platform from 2- by 4-inch (5.1-cm x 10.2-cm) boards.",
      "content": "Cut legs for your platform from 2- by 4-inch (5.1-cm x 10.2-cm) boards. Use a circular saw or miter saw to cut legs that are as long as the height you measured with the level and measuring tape. You may want to use a speed square to make sure you are cutting in a straight line. [8] X Research source"
    },
    {
      "title": "Cut a platform out of thick plywood using a circular saw and a guide.",
      "content": "Cut a platform out of thick plywood using a circular saw and a guide. Use plywood that is thick enough to support your weight, at least 1 inch (2.5 cm) and medium density. Use a ruler to trace a straight line where you will cut, or fasten a board over the plywood to use as a guide while you cut. The platform should be the width of your stairs minus 6–10 inches (15–25 cm), and the depth of 3 stairs."
    },
    {
      "title": "Mark where the legs will go on the platform and drill the holes.",
      "content": "Mark where the legs will go on the platform and drill the holes. Place the legs that you cut in 2 corners of the platform. The legs will support half of the platform while the other half is supported by a stair. Use a carpenter’s pencil to trace where the legs will go on the platform, and drill 2 holes inside both of the spaces you traced. [9] X Research source The edge of each leg should be flush with the edge of the platform, and the width of the legs should be running parallel to each other. You may want to use a countersink drill to make your holes, which will make a slight depression around the hole and allow the top of the screw to be flush with the board instead of sticking out slightly. This is especially useful if you are working on wooden stairs and don’t want to scuff the wood."
    },
    {
      "title": "Use screws to fasten the legs to the platform.",
      "content": "Use screws to fasten the legs to the platform. Use a drill to screw through the pilot holes in the platform and into the tops of the 2 legs. You may find it helpful to clamp another board onto your work surface to use as a brace when you screw the legs in. You can brace the leg against the clamped board while holding the platform against it and inserting the screws. [10] X Research source"
    },
    {
      "title": "Measure the distance between the legs for support boards.",
      "content": "Measure the distance between the legs for support boards. To make your leveler more stable, it’s a good idea to put support boards between the legs. Measure the width between the 2 legs to find out how long your support boards should be. [11] X Research source"
    },
    {
      "title": "Cut two 2- by 4-inch (5.1-cm x 10.2-cm) boards to fit between the legs.",
      "content": "Cut two 2- by 4-inch (5.1-cm x 10.2-cm) boards to fit between the legs. Using a circular saw or miter saw, cut 2 boards to fit the width between the legs. These will be your support boards, which will keep the legs from wobbling when you use the leveler. [12] X Research source"
    },
    {
      "title": "Drill pilot holes in the legs and screw the first support board into place.",
      "content": "Drill pilot holes in the legs and screw the first support board into place. The 1st support board will go at the top of the legs against the platform. Make 2 pilot holes in each leg where you will fasten the 1st support board in place. [13] X Research source"
    },
    {
      "title": "Cut two 2- by 4-inch (5.1-cm x 10.2-cm) boards to brace the 2nd support board.",
      "content": "Cut two 2- by 4-inch (5.1-cm x 10.2-cm) boards to brace the 2nd support board. These braces should be about 4 inches (10 cm) long. They will fit between the 1st and 2nd support boards, and will attach to the insides of the legs. In other words, the 2 support boards and 2 braces will form a rectangle inside the legs."
    },
    {
      "title": "Set the 2nd support board on top of the braces and fasten it to the legs.",
      "content": "Set the 2nd support board on top of the braces and fasten it to the legs. Put the braces in place without screwing them in yet, and place the 2nd support board on top of them. Drill 2 pilot holes in each leg where it will attach to the 2nd support board, then screw the board into place. Screw the 2 braces into the legs with 2 screws each. [14] X Research source The braces should attach to the legs with 1 screw towards the top and 1 screw towards the bottom. Drill pilot holes through the braces first from the inside, then use screws to attach them to the legs. [15] X Research source"
    },
    {
      "title": "Cut four 1- by 2-inch (2.5-cm x 5.1-cm) boards to fit the edges of the platform.",
      "content": "Cut four 1- by 2-inch (2.5-cm x 5.1-cm) boards to fit the edges of the platform. These boards will serve as safety rails to keep your ladder from slipping off the platform. Cut 2 boards that are as long as the width of your platform, and 2 boards that are as long as the depth minus 2 inches (5.1 cm). They should fit on the edges of the top of the platform. [16] X Research source"
    },
    {
      "title": "Use wood glue and screws to attach the safety rails to the edges of the platform.",
      "content": "Use wood glue and screws to attach the safety rails to the edges of the platform. Drill pilot holes through the safety rails in at least 2 points per rail. Then put a layer of wood glue on the bottom of each safety rail, set the rails in place, and use screws to fasten them to the platform. [17] X Research source Once the wood glue has dried, you can set your leveler at any point on the stairs and use it as a platform. Prop an extension ladder on the leveler and brace it against the wall. [18] X Research source"
    },
    {
      "title": "Use a broom and cloth to dust before painting.",
      "content": "Use a broom and cloth to dust before painting. Ceilings and high areas often accumulate dust and cobwebs, which will make it difficult to paint. Wear a dust mask and use a rag to brush any dust off the ceiling, laying a rag over the end of a broom for hard-to-reach spots. [19] X Research source"
    },
    {
      "title": "Cover your walls with plastic sheeting.",
      "content": "Cover your walls with plastic sheeting. Even if you will be painting the walls the same color as the ceiling, you want to protect them from drips that can dry into visible bumps on the wall’s surface. Use painter’s tape to hang plastic sheeting on the walls, making the tape even with the top of the wall against the ceiling. [20] X Research source"
    },
    {
      "title": "Use tape to mask off any fixtures on your ceiling.",
      "content": "Use tape to mask off any fixtures on your ceiling. To keep your lights, fans, smoke alarms, and any other fixtures safe from accidental painting, cover their edges with painter’s tape. Make sure the tape is only on the fixture and does not cover any of the ceiling itself. [21] X Research source"
    },
    {
      "title": "Use an edging tool to cut in the edges of a 10 feet (3.0 m) section.",
      "content": "Use an edging tool to cut in the edges of a 10 feet (3.0 m) section. Using an edging tool, rather than a roller, will allow you to get paint along the edge of the ceiling without pushing it onto the wall. Edging tools are designed to apply paint close to ceiling edges and may even attach to extension poles. Roll your edging tool against the grooved part of the paint tray a few times to remove excess paint, which can cause drips."
    },
    {
      "title": "Use a roller to paint inward from the section you cut in.",
      "content": "Use a roller to paint inward from the section you cut in. Working in 10 feet (3.0 m) sections will allow you to paint over the brush strokes with the roller before they dry, making a more smooth texture. Rolling several horizontal strokes and then rolling over them with vertical strokes will also help create an even texture. [22] X Research source Run your roller over the grooved section of your paint tray a few times after you dip it in the paint. This will squeeze out some of the excess paint and help you avoid drips. If the ceiling is still hard to reach even on your scaffold, you may need an extension pole for your roller. For edging and corners, you can secure a paintbrush to the end of the extension pole. A lambswool roller cover with at least 0.5 inches (1.3 cm) nap is ideal for painting ceilings, as it will hold the most paint without spattering. [23] X Research source"
    },
    {
      "title": "Continue edging and painting in sections until the ceiling is complete.",
      "content": "Continue edging and painting in sections until the ceiling is complete. If necessary, move your ladder once you are done with 1 side so that you can reach the other. It’s best to do all your painting in 1 session, so that the paint doesn’t dry and leave unsightly ridges or laps. Check your paint can’s label for typical drying times. You can test whether the paint is dry by gently dabbing it with a dry, clean cloth in an inconspicuous spot to see if any paint comes off. Once the paint is dry, you can remove the painter’s tape and begin painting the walls if desired."
    }
  ]
}