{
  "url": "https://www.wikihow.com/Report-an-Abandoned-Vehicle",
  "title": "How to Report an Abandoned Vehicle",
  "steps": [
    {
      "title": "Get a notepad, pen, and your smartphone to document specifics.",
      "content": "Get a notepad, pen, and your smartphone to document specifics. Your local police department wants to know specifics about the abandoned vehicle. Some jurisdictions also allow you to submit photos of the abandoned vehicle. The fastest and easiest way to submit photos to your police department is with a smartphone. [1] X Research source Try to document details about the vehicle during the day when people are around. For safety reasons, it’s a good idea to have a friend or family member with you if you need to approach the vehicle."
    },
    {
      "title": "Write down the make, model, color and license plate number.",
      "content": "Write down the make, model, color and license plate number. Police departments want to know the make, model, and color of the vehicle. They also want to know the license plate number and the state shown on the license plate if it has one. [2] X Research source The police want to know if the vehicle is \"junk.\" You can tell a vehicle is junk if it has broken windows, flat or missing tires, a destroyed interior and no license plates. [3] X Research source Some people abandon junk vehicles on the street and in empty lots, which is considered illegal by many police departments."
    },
    {
      "title": "Confirm the location of the abandoned vehicle.",
      "content": "Confirm the location of the abandoned vehicle. This is very important because a seemingly abandoned, unregistered vehicle may be someone’s private property. If there’s no one around who can help you figure out the precise address where the vehicle has been abandoned, try using the GPS feature on your smartphone to pinpoint the location. If the abandoned vehicle is on public property—such as a street—you can report it. You can also report an abandoned vehicle on private property, depending on the circumstance."
    },
    {
      "title": "Call the police on their non-emergency number in most cases.",
      "content": "Call the police on their non-emergency number in most cases. More police departments today ask citizens to report abandoned vehicles on their non-emergency number. In many areas, you would dial 3-1-1 to report a non-emergency. [4] X Research source Some police departments have a dedicated toll-free number you can call to report an abandoned vehicle."
    },
    {
      "title": "Fill out the police department's online form as an alternative.",
      "content": "Fill out the police department's online form as an alternative. Some jurisdictions simply don't accept phone calls regarding abandoned vehicles. Instead, they offer an online form for members of the public to submit electronically. The form for reporting abandoned vehicles is usually posted on the police department's website. Provide as much detail as possible on the online form for a quicker response."
    },
    {
      "title": "Cooperate with the police should they have questions.",
      "content": "Cooperate with the police should they have questions. The police don’t automatically consider a vehicle that has been parked somewhere for a day or two as abandoned. This is especially true if it has unexpired license plates. Occasionally, the police may want to ask you some questions when investigating the abandoned vehicle you reported. To help them remove the vehicle faster, it’s a good idea to answer any questions they have for you as quickly and truthfully as possible. [5] X Research source Most of the time, once you report an abandoned vehicle, the police investigate without any further contact with you. A vehicle usually has to have been unattended for 72 hours before police consider it abandoned. [6] X Research source"
    }
  ]
}