{
  "url": "https://www.wikihow.com/Resolve-Conflict",
  "title": "How to Resolve Conflict",
  "steps": [
    {
      "title": "Know your own feelings.",
      "content": "Know your own feelings. Pay attention to your emotions and notice if you're starting to feel angry, sad, or frustrated. By recognizing these feelings you can help make sure they don't take over and hurt your ability to resolve the conflict. [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Control your temper.",
      "content": "Control your temper. While conflicts often cause frustration, it is important to keep your anger at bay if you want to solve the problem. Emotional responses filled with yelling and screaming won't help resolve your conflict. This will just provoke the other person and cloud your own critical thinking skills."
    },
    {
      "title": "Think before you speak.",
      "content": "Think before you speak. Insults or cruel statements won't solve anything, and you'll probably regret them later. Some questions to ask before speaking are: [2] X Research source What do I mean by saying this? Is it a constructive statement or am I just trying to hurt someone? Will this statement contribute to solving the problem? Could the other person interpret this statement as an attack? Would I get angry if someone said this to me?"
    },
    {
      "title": "Take a break.",
      "content": "Take a break. If you feel yourself getting frustrated or angry to the point that you can't control it, walk away for a few minutes. Close your eyes, breathe, and gather your thoughts. When you're feeling better, go back and talk about the problem with a clear head. [3] X Research source"
    },
    {
      "title": "Mind your nonverbal communication.",
      "content": "Mind your nonverbal communication. You may not realize it, but this can make or break conflict resolution. Actions like rolling your eyes, huffing and puffing, or making annoyed faces can easily anger someone else, even if you aren't saying anything to convey those feelings. Pay attention and avoid these at all costs. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Stay calm even if the other person is not.",
      "content": "Stay calm even if the other person is not. Not all people will follow the advice on this list. It is important to keep your composure even if the other person resorts to yelling, insults, and losing his temper. [6] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. If the situation in any way turns threatening, physical, or violent, remove yourself right away. There is no longer any chance of solving the problem constructively if this happens and your safety is more important."
    },
    {
      "title": "Define the problem as you see it.",
      "content": "Define the problem as you see it. To effectively solve an issue, you need to understand what that issue is. It seems obvious, but sometimes people argue and fight without even really knowing what the problem is. Take some time and think about what's troubling you. [7] X Research source"
    },
    {
      "title": "State what you think the issue is.",
      "content": "State what you think the issue is. Use clear, specific, and nonthreatening language. Make sure that in defining the problem, you aren't attacking the other person. Even if the problem was caused by someone else, don't use frustrated or accusatory language. This can anger the other person and hurt your chances of resolving the conflict."
    },
    {
      "title": "Ask the other person the problem as they see it.",
      "content": "Ask the other person the problem as they see it. When you've established why you're upset, you have to understand how the other person views the problem. Encourage the other person to be open and honest with you. Let him know you want to solve the issue and he should feel comfortable letting you know exactly what's bothering them. [8] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. When you ask the other person to explain his point of view, don't do so in an angry or challenging way. You want to make sure everyone is comfortable expressing their opinions."
    },
    {
      "title": "Listen attentively.",
      "content": "Listen attentively. You may find that the other person interprets the problem very differently. Don't interrupt or put words in his mouth. Allow him to state the issue in his own way before answering. In defining what the problem is, the other person may state some problems or mistakes associated with you. Don't get insulted or defensive- remember, the only way to effectively solve problems is putting everything on the table."
    },
    {
      "title": "Repeat what was said before answering.",
      "content": "Repeat what was said before answering. Again, this seems obvious, but many people hear and interpret someone's answers differently from the original intention. Make sure you're on the same page as them. Start with statements like \"So what you're saying is...\" This helps ensure that you've understood the problem. It also shows the other person that you're listening carefully. [9] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018."
    },
    {
      "title": "Answer all questions openly and honestly.",
      "content": "Answer all questions openly and honestly. The other person may have questions for you as well. Respect that he is also trying to find a solution to the problem. Don't get frustrated, but instead answer as completely as you would expect your own questions to be answered. [10] X Research source"
    },
    {
      "title": "Establish a goal.",
      "content": "Establish a goal. When everyone is on the same page about what the issue is, then you can go about finding a solution. The steps for establishing a goal are similar to defining the problem: Clearly state your ideal solution to this issue. Ask the other person to do the same. Again, listen carefully and don't make assumptions. The other person may not be aware of their own goal. Ask similar questions to the ones you asked yourself prior to the conflict so they can establish one. Encourage him or her to be as specific as possible. [11] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source"
    },
    {
      "title": "Find common ground.",
      "content": "Find common ground. When everyone has expressed a desired solution, find compatibility in the responses. This will ease the process to finding a solution. [12] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Disagreements tend to magnify differences and obscure similarities. Break this trend by looking for similarities, no matter how small they are. Any common ground is a starting point to build from. Use phrases like, \"Okay, so it looks like we agree on...\" to make it clear that there is common ground between the two parties. This realization can make people more willing to cooperate and compromise. Take a workplace argument for example. In defining their problem, both parties have stated that they don't enjoy working in close proximity to each other because it is a distraction. From that common ground, a solution can be an office or desk change to resolve the disagreement."
    },
    {
      "title": "Compromise.",
      "content": "Compromise. It is very likely you and the other person won't agree completely on a solution. Using the common ground you've established, work out a solution that is acceptable to both parties. Talk through everyone's ideas for an ideal solution. Find out what is most important to the other person and clearly state what is important to you. This will show what everyone is willing and unwilling to compromise on. Remember that in a compromise, neither party is completely satisfied. Be flexible enough to work with the other person and come to a solution acceptable for everyone. Take the previous workplace disagreement as an example. Both parties don't want to work in the same area. But there aren't any offices available for a relocation. So the two workers agree that they will not interact with each other until they take breaks. Neither party has gotten exactly what it wants, but the solution is acceptable enough to allow them to complete their work effectively."
    },
    {
      "title": "Address all issues in the solution.",
      "content": "Address all issues in the solution. Leaving anything unresolved is only a temporary fix, and unsolved problems will likely cause more trouble in the future. Make your solution as complete as possible to avoid anymore issues."
    },
    {
      "title": "Follow-up on the solution.",
      "content": "Follow-up on the solution. In a few weeks, revisit the issue and see if your solution is working. If there are still problems, analyze the issue again and see if you can design a better solution. [13] X Research source"
    },
    {
      "title": "Solve the problem instead of being right.",
      "content": "Solve the problem instead of being right. Arguments and disagreements can be made much shorter if you stop focusing on being right. The point isn't to \"win,\" but to resolve the conflict. [14] X Research source"
    },
    {
      "title": "Pick your battles.",
      "content": "Pick your battles. Although there are some things in life you shouldn't let go, many other things are simply not worth the trouble. Before pursuing something, analyze the situation and see if it is truly an important matter. By doing so, you can avoid unnecessary stress. [15] X Research source"
    },
    {
      "title": "Admit your mistakes.",
      "content": "Admit your mistakes. It's possible that you're responsible for a particular problem. If so, recognize that and take responsibility to avoid needless argument. Understand that this isn't a mark of weakness, but maturity. [16] X Research source"
    },
    {
      "title": "Focus on the present.",
      "content": "Focus on the present. Avoid bringing the past into disagreements and don't hold grudges. This will only make arguments last longer and hurt the chance of a resolution. [17] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Reader Poll: We asked 293 wikiHow readers what would make them willing to forgive a partner, and 0% of them said focusing on the future. [Take Poll] So, make sure you aren't looking ahead before you've dealt with what's happening in the present."
    },
    {
      "title": "Recognize if you need to seek help.",
      "content": "Recognize if you need to seek help. If you see that you are constantly getting into arguments and disagreements, you may have a problem with anger or stress. If so, you should consider seeking help from a mental health professional."
    }
  ]
}