{
  "url": "https://www.wikihow.com/Sleep-in-Class",
  "title": "How to Sleep in Class",
  "steps": [
    {
      "title": "Slip on a hoodie to hide your face from the side and front.",
      "content": "Slip on a hoodie to hide your face from the side and front. If you’re wearing a hooded sweatshirt, lean forward a bit and pull on your hood. Your eyes will be shielded from both the sides and the front, making it a great, natural-looking way to get a bit of sleep. Look up your dress code rules or review the guidelines for that class to make sure you can wear your hood in class. If your teacher asks you to take your hood off, they’ll realize you’re asleep."
    },
    {
      "title": "Rest your forehead on your hands and look down.",
      "content": "Rest your forehead on your hands and look down. Keeping your hands on your forehead will block your eyes so your teacher won’t see them. Your hands will also help you stay balanced so you don’t slip when you fall asleep. To throw your teacher off even more, open a textbook in front of you so that it looks like you’re reading."
    },
    {
      "title": "Prop your head on one hand and hold your pencil in the other.",
      "content": "Prop your head on one hand and hold your pencil in the other. Rest your elbow on the desk and place your hand under your chin, on your forehead, or against your cheek. Hold a pencil in your other hand and put it on your notebook. Tilt your head down to take a quick nap. This trick makes it look like you’re about to take notes or are reading over what you’ve just written."
    },
    {
      "title": "Put your hair in front of your face if you have long hair.",
      "content": "Put your hair in front of your face if you have long hair. Arrange your hair in front of your face before you walk into class so the teacher thinks it’s a new style. When you doze off, the teacher won’t be able to tell that your eyes are closed. This is a perfect trick if you’re growing out bangs. [1] X Research source"
    },
    {
      "title": "Prop up a book on your desk to hide your face.",
      "content": "Prop up a book on your desk to hide your face. If you want to make sure the teacher can’t see your face, prop your textbook upright on your desk and sit so your face is hidden behind it. Try to maintain an upright posture so it looks like you’re reading. [2] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source This strategy can look obvious, so only use it when the class has a lot going on and is a little louder, such as during group work or a lab activity. Your teacher will be distracted and won’t pay as much attention to your sleeping."
    },
    {
      "title": "Slump down in your chair if you sit behind someone taller than you.",
      "content": "Slump down in your chair if you sit behind someone taller than you. Slide down in your chair, place your head down on your desk, or hold your head in your hands. The person in front of you will block the teacher’s view of your chair so you can safely take a snooze. This is best when the person in front of you is noticeably taller and broader than you. Make sure that the class won’t be getting up and moving any time soon, such as for partner or group work. If the person in front of you stands up, you might be caught."
    },
    {
      "title": "Nap when you sit in the back of a class.",
      "content": "Nap when you sit in the back of a class. It’s harder for the teacher to see what you’re doing if you sit towards the back of the classroom, but be careful if you sit in the very back. Most teachers know that students who sit in the back want to go to sleep, so the back row might put you on the teacher’s radar. Be careful if you’re right in the center of the class, as well. This will put you right in the teacher’s line of sight."
    },
    {
      "title": "Try to nap in a class with a less observant teacher.",
      "content": "Try to nap in a class with a less observant teacher. You probably know which teachers are stricter and more observant during class, and which ones get caught up in their lessons and don’t look around as often. If you can, try to schedule your nap for a class with a more relaxed, inattentive teacher."
    },
    {
      "title": "Sleep when the teacher puts on a video or movie.",
      "content": "Sleep when the teacher puts on a video or movie. If you’re sleepy, it’s almost impossible to stay awake through a movie or a video, especially an educational one. If your teacher puts on a video and turns off the lights, try leaning back in your chair and closing your eyes. The dark room should make it easy for you to get away with a quick nap. [3] X Trustworthy Source American Chemical Society Scientific society for those involved with chemistry and publisher of several leading peer-reviewed scientific journals Go to source"
    },
    {
      "title": "Nap in a class that uses computers.",
      "content": "Nap in a class that uses computers. Classes that use computers are great to nap in, especially if you’re using desktop computers with monitors to hide your face. Just be sure you keep your hand on the mouse. Try to wake yourself up and move the mouse every so often to keep the computer from going into screensaver mode. [4] X Research source You can also make this work if you’re using a laptop. Slouch in your seat a bit to hide your face behind the laptop. If your class is using a tablet, prop your head up with one hand and keep the other on the tablet screen to pretend like you’re working. If you don't think you'll be able to wake yourself up, you can disable the screensaver on your computer. Just be sure to turn it back on before class is over so you don’t get caught."
    },
    {
      "title": "Fit in a nap if you face away from the teacher.",
      "content": "Fit in a nap if you face away from the teacher. Some classes, like art class, allow students to sit wherever they want in order to boost their creativity. If you have a class like this, do a little work first thing in the class, then sit facing away from the teacher and take a quick catnap. [5] X Research source Doodle a little every few minutes to show that you’re working, then doze off again."
    },
    {
      "title": "Pay attention at the beginning of class.",
      "content": "Pay attention at the beginning of class. Even if you’re feeling really sleepy, try to look like you’re listening to the teacher at the start of class. Take out a pencil and paper and take a few notes. Make eye contact with the teacher and try to answer a question or two. [6] X Research source This will give the teacher the impression that you are paying attention through the whole class, even when you’re asleep. Don’t call too much attention to yourself or it will seem really obvious when you stop responding."
    },
    {
      "title": "Ask the person next to you to wake you up if necessary.",
      "content": "Ask the person next to you to wake you up if necessary. At the beginning of class, tell your neighbors that you’re really tired and might try to take a quick nap. Ask them if they wouldn’t mind waking you up if something important is about to happen. [7] X Research source You could say, for example, “Hey Alex, I was up super late last night and I’m exhausted. If I fall asleep, will you wake me up if we start the lab or do partner work?” This is best if you are friends or at least acquaintances with the person next to you. If you don’t like each other, you probably can’t rely on them to wake you up, and they might even report you to the teacher."
    },
    {
      "title": "Make sure you can wake up when the bell rings.",
      "content": "Make sure you can wake up when the bell rings. Don’t get into such a deep sleep that you won’t wake up when it’s time to change classes or go to lunch! Try to just relax and drift off without allowing yourself to go all the way into a deep sleep. Train yourself to sleep lightly by forcing yourself to open your eyes every few minutes or asking your friend to tap you on the shoulder once in awhile."
    },
    {
      "title": "Avoid wearing earplugs or earbuds.",
      "content": "Avoid wearing earplugs or earbuds. You might sleep better if you can tune out the noise of your classroom with music, but wearing earplugs or earbuds in class is a big warning sign to your teacher. It might also make it harder to hear the bell ring or the teacher’s voice if they call on you. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    }
  ]
}