{
  "url": "https://www.wikihow.com/Open-Docx-Files-on-Android",
  "title": "How to Open Docx Files on Android",
  "steps": [
    {
      "title": "Open the Microsoft Word app.",
      "content": "Open the Microsoft Word app. The app icon looks like a blue “W” on a white page with another page behind it. You can find this on either your home screen, the app drawer, or by searching. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source You can get this app from the Google Play Store if you don’t have it. Log in if prompted."
    },
    {
      "title": "Tap the Open icon (an open folder).",
      "content": "Tap the Open icon (an open folder). This is in the bottom menu at the bottom right. A list of locations will open, including your OneDrive and the local storage of your device. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "",
      "content": "Tap Allow if prompted. This will allow the app to access your documents."
    },
    {
      "title": "Tap the location of your file.",
      "content": "Tap the location of your file."
    },
    {
      "title": "Navigate to your file.",
      "content": "Navigate to your file. This can be in your collective OneDrive folder or in the Downloads folder of your phone’s storage."
    },
    {
      "title": "Tap the file you want to open.",
      "content": "Tap the file you want to open. The file will open in Microsoft Word. You can edit the document by tapping the pencil icon ."
    },
    {
      "title": "Open the Google Docs app.",
      "content": "Open the Google Docs app. This app icon looks like a blue piece of paper with a paragraph on it. You can find this on either your home screen, in the app drawer, or by searching. [3] X Research source You can get this app from the Google Play Store if you don’t have it. Log in if prompted."
    },
    {
      "title": "Tap the folder icon.",
      "content": "Tap the folder icon . A box will pop up asking if you want to open from Google Drive or Device Storage."
    },
    {
      "title": "Tap Device Storage.",
      "content": "Tap Device Storage . Your phone’s downloads folder will open. [4] X Research source"
    },
    {
      "title": "Navigate to your file.",
      "content": "Navigate to your file. This can be in your collective Google Drive or in the Downloads folder of your phone’s storage."
    },
    {
      "title": "Tap the file you want to open.",
      "content": "Tap the file you want to open. The file will open in Google Docs. You can edit the document by tapping the white pencil within the blue circle."
    }
  ]
}