{
  "url": "https://www.wikihow.com/Open-a-Combination-Lock",
  "title": "How to Open a Combination Lock",
  "steps": [
    {
      "title": "Buy a combination lock.",
      "content": "Buy a combination lock. Combination locks can be found at most hardware, home improvement, and sports stores across the US. Some stores that sell combination locks are The Home Depot, Lowes, Sears, Modell's, Staples, and Walmart."
    },
    {
      "title": "Find the combination on the sticker on the back of the lock.",
      "content": "Find the combination on the sticker on the back of the lock. Most of the time, your new combination lock will come with a sticker on the back of the lock, telling you your lock's combination. Remove the sticker carefully. Write down the combination and throw out the sticker -- you don't want to leave the sticker around in case someone else finds it and knows it's the combination to a lock. [1] X Research source Start memorizing your new locker combination. This will make it easier for you to consistently open the lock."
    },
    {
      "title": "Turn the dial on the lock clockwise three times.",
      "content": "Turn the dial on the lock clockwise three times. Turn the dial to the right. This clears the lock and resets it so that it's ready to open. [2] X Research source"
    },
    {
      "title": "Stop turning when the marker points to the first number of the combination.",
      "content": "Stop turning when the marker points to the first number of the combination. The marker or line should be at the top of the dial, pointing to the twelve o'clock position. In many cases, it will be red. The first number on this lock's combination is 36, so you should stop turning the dial when the marker points to that number. [3] X Research source"
    },
    {
      "title": "Turn the dial back to the left for one full turn.",
      "content": "Turn the dial back to the left for one full turn. Spin it counterclockwise one full turn, past the first number (36), then stop at the second number—in this case, 10. [4] X Research source"
    },
    {
      "title": "Turn the dial to the right.",
      "content": "Turn the dial to the right. Finally, turn the dial clockwise again and stop at the last number on the sticker—1. [5] X Research source"
    },
    {
      "title": "Open the lock.",
      "content": "Open the lock. Pull up the shackle at the top of the lock, and it should open right up. You can also hold on to the shackle and pull down the lock. If it doesn't open , repeat the process from the beginning. Once you've partially engaged the tumblers, you should clear out the lock before trying again."
    },
    {
      "title": "Insert the shackle.",
      "content": "Insert the shackle. Spin the shackle around so that the opened portion is above the hole, and push it into the opening at the top of the lock."
    },
    {
      "title": "Spin the dial.",
      "content": "Spin the dial. Turn the dial in any direction for three turns. It doesn't matter what number you stop on. This process will disengage the tumblers and will make it so that you'll have to start all over again with the first number if you want to open it."
    },
    {
      "title": "Test it.",
      "content": "Test it. Make sure it's locked by pulling on the lock or shackle. If it opens, lock it again."
    }
  ]
}