{
  "url": "https://www.wikihow.com/Melt-Hard-Wax-Beans",
  "title": "3 Quick and Easy Ways to Melt Hard Bean Wax",
  "steps": [
    {
      "title": "Pour the wax beans into a microwave-safe bowl.",
      "content": "Pour the wax beans into a microwave-safe bowl . A heat-resistant glass mixing bowl is a safe bet—just make sure that it’s large enough so you don’t have to fill it more than halfway with hard wax beans. Check the bag instructions on your beans to see how many you need to melt. Ultimately, it’ll depend on how much skin you plan to wax."
    },
    {
      "title": "Heat the wax for 10 seconds and give it a stir.",
      "content": "Heat the wax for 10 seconds and give it a stir. After a quick round in the microwave, check the wax beans and see how much they’ve melted. Stir the beans with a wooden stick as they start to congeal so your wax has an even consistency. [1] X Research source"
    },
    {
      "title": "Microwave the wax repeatedly for 10 seconds until it looks like thick honey.",
      "content": "Microwave the wax repeatedly for 10 seconds until it looks like thick honey. Scoop up some of the wax and see how it looks on the wooden stick. It’s good to go if it’s pretty thick and honey-like. [2] X Research source Check the temperature of the wax by patch-testing it along the backside of your wrist. If it feels a little too warm, wait a few minutes before applying any wax. [3] X Research source"
    },
    {
      "title": "Reheat the wax in 10-second increments when it starts to congeal.",
      "content": "Reheat the wax in 10-second increments when it starts to congeal. While a microwave is the quickest way to melt hard wax beans, it doesn’t provide a lot of residual heat to keep them at the ideal temperature and consistency. Stick the wax in the microwave in 10-second increments until it is once again warm with a thick, honey-like consistency. Be sure to stir the wax with a wooden stick in between each microwave cycle."
    },
    {
      "title": "Pour 1-2 in (2.5-5 cm) of water into a medium-sized pot.",
      "content": "Pour 1-2 in (2.5-5 cm) of water into a medium-sized pot. Add at least 1 in (2.5 cm) so the water doesn’t boil away completely, but don’t fill the pan more than halfway. With a double boiler, your goal is to create gentle, indirect heat. [4] X Research source A saucepan also works if you don’t have a pot on hand. [5] X Research source"
    },
    {
      "title": "Bring the water to a boil",
      "content": "Bring the water to a boil and reduce it to a simmer. Turn the stovetop burner up to high heat and wait for the water to bubble and boil. At that point, turn the heat down to a low temperature so the water settles to a simmer. Remember: with double boilers, the name of the game is gentle heat. [6] X Research source"
    },
    {
      "title": "Pour the hard wax beans into a stainless steel or tempered glass bowl.",
      "content": "Pour the hard wax beans into a stainless steel or tempered glass bowl. Grab a small- or medium-sized mixing bowl that’s heat resistant—stainless steel or tempered glass is a safe bet. [7] X Research source Check the instructions on the wax bean bag to see how much you should melt at once."
    },
    {
      "title": "Nestle the bowl into the pot so it doesn’t touch the water.",
      "content": "Nestle the bowl into the pot so it doesn’t touch the water. Center the mixing bowl so it rests along the edge of the pot while hovering slightly above the water. If the bottom of the bowl touches the water, the wax beans might get too hot. [8] X Research source"
    },
    {
      "title": "Stir the wax frequently with a wooden stick.",
      "content": "Stir the wax frequently with a wooden stick . [9] X Research source Grab a clean stick and give the melting beans a good stir every minute or 2. This helps give your wax a more even consistency since the indirect heat of the double boiler prevents the beans from melting evenly."
    },
    {
      "title": "Do the “flip” test to see if your wax is ready.",
      "content": "Do the “flip” test to see if your wax is ready. Scoop up a large dollop of melted wax with a wooden stick and flip it over in front of you, watching the wax slowly collect and fall away from the base of the stick. If you can count to 2 or 3 before the wax completely drips off the stick, your wax is ready to use. Then, quickly flip the stick back over before the wax can actually separate and fall off. [10] X Research source The wax is much too hot to apply if it immediately falls and separates from the stick. If it takes more than 3-4 seconds to drop away, the wax is too cool to apply. [11] X Research source Depending on the consistency, either raise the temperature slightly or give your wax some time cool off so it’s safe to apply to your skin."
    },
    {
      "title": "Pour the wax beans into the warming chamber.",
      "content": "Pour the wax beans into the warming chamber. Simply open the lid on your wax warmer and pour the beans into the inner compartment. [12] X Research source Many warmers have a fill line marked on the inner chamber—don't add beans beyond this line. If there isn't a fill line, don't fill the chamber more than two-thirds full. Double-check your wax warmer’s user manual to see what the manufacturer recommends."
    },
    {
      "title": "Set the warmer to the highest possible setting for 10-15 minutes.",
      "content": "Set the warmer to the highest possible setting for 10-15 minutes. As the wax starts to melt, use a wooden stick to mix the melted wax along the edge of the chamber with the less-melted wax at the center. In about 10-15 minutes, all of the wax will be melted. [13] X Research source To be safe, consult your wax warmer’s manual to see if the manufacturer mentions any specific temperature suggestions."
    },
    {
      "title": "Check the wax with a wooden stick to see if it resembles molasses.",
      "content": "Check the wax with a wooden stick to see if it resembles molasses. Dip a wooden stick into the melted wax and scoop up a dollop of it. Then, hold out the wooden stick and watch how quickly (or slowly!) the melted wax drops from the bottom of the stick—just be sure to flip the stick over before it actually does. If you can count to 2 or 3 before the wax falls off, your wax is safe and ready to use for waxing. [14] X Research source Liquid-like wax is far too hot to wax your skin with, while super slow wax is too cool. [15] X Research source Adjust the temperature on your warmer accordingly until the wax looks like molasses or thick honey."
    }
  ]
}