{
  "url": "https://www.wikihow.com/Print-from-iPhone-to-HP-Printer",
  "title": "How to Print from an iPhone to an HP Printer",
  "steps": [
    {
      "title": "Make sure both your phone and printer are connected to the same network.",
      "content": "Make sure both your phone and printer are connected to the same network. They need to be on the same Wi-Fi network for AirPrint to work. [2] X Research source If your printer has a built-in display, use that to connect to the Wi-Fi network that you want to use. To do that, touch the Wireless icon and go to Network Settings/Settings . If your printer does not have a touch screen, press the Wireless and Information buttons at the same time until your printer displays Connected or Ready. For HP Deskjet 6000 and 6400, ENVY 6000 and 6400, and Tango printers: Press and hold the Wi-Fi (Wireless) button and the Power button on the back of the printer for five seconds until the blue bar flashes. Press and hold the WPS button on the router until the connection process begins within two minutes of the blue bar flashing. The blue bar stops flashing when the connection completes. On an iPhone , go to Settings > Wi-Fi to change your Wi-Fi network. [3] X Research source"
    },
    {
      "title": "Open the item you want to print on your iPhone.",
      "content": "Open the item you want to print on your iPhone. Many different apps support printing within the app, so you can print almost anything. [4] X Research source"
    },
    {
      "title": "Tap then Print.",
      "content": "Tap then Print . The Share icon looks like an arrow pointing out of a box or a curved arrow, depending on the app you're using. You'll see Print towards the middle or bottom of the menu. [5] X Research source"
    },
    {
      "title": "Select your printer then tap Print.",
      "content": "Select your printer then tap Print . You should be able to change the paper size as well as how many copies you'd like to print. [6] X Research source If your printer is not listed in your iPhone's list of printers, it may not have AirPrint compatibility. In that case, use the Wi-Fi Direct method. [7] X Research source Not all printers have AirPrint capabilities. If you aren't sure if your printer has Wi-Fi or AirPrint capabilities, you can check the manual that came with it or you can check Apple's list of AirPrint printers . In the case that your printer does not have AirPrint, use Wi-Fi Direct to print wirelessly. Check out tips about printing from an iPhone on wikiHow’s “How do you print easily from an iPhone?\" forum page ."
    },
    {
      "title": "Get the Wi-Fi Direct name and password for your printer.",
      "content": "Get the Wi-Fi Direct name and password for your printer. You'll need this information to connect with your phone. [8] X Research source For printers with a touch-screen, tap the Wi-Fi Direct icon (it's the icon with multiple squares and rectangles next to the Wi-Fi icon). Most HP printers without a touch-screen will print the Wi-Fi Direct name and password if you press the Information button (it looks like an \"i\" in a circle). If the sheet does not print, you can try a few different steps: Press and hold the Wi-Fi Direct button for three seconds. Press the Wireless and Information buttons at the same time. Press and hold the Resume/Cancel for two-ten seconds. Once the sheet is printed, you can look for the Wi-Fi Direct name and password."
    },
    {
      "title": "Open Settings on your iPhone.",
      "content": "Open Settings on your iPhone. This icon looks like a few gears on a light grey background. [9] X Research source"
    },
    {
      "title": "Tap Wi-Fi.",
      "content": "Tap Wi-Fi . It's usually the second option in the menu next to a blue Wi-Fi icon. [10] X Research source"
    },
    {
      "title": "Tap the printer's Wi-Fi Direct name.",
      "content": "Tap the printer's Wi-Fi Direct name. If you don't remember what it is, look at your printer's touch-screen or refer to the printout. [11] X Research source If your printer is not shown here, you may not have Wi-Fi Direct enabled on your printer. Wi-Fi Direct has been included in printers since 2014."
    },
    {
      "title": "Enter the password.",
      "content": "Enter the password. You'll see this displayed on the printer's touch-screen or on the printout."
    },
    {
      "title": "Tap Join.",
      "content": "Tap Join . While connected to the printer's Wi-Fi, your iPhone will not have internet access. [12] X Research source"
    },
    {
      "title": "Open the item you want to print on your iPhone.",
      "content": "Open the item you want to print on your iPhone. Many different apps, like Photos, Mail, and WhatsApp, support printing within the app, so you can print almost anything."
    },
    {
      "title": "Tap then Print.",
      "content": "Tap then Print . The Share icon looks like an arrow pointing out of a box or a curved arrow, depending on the app you're using. You'll see Print towards the middle or bottom of the menu. [13] X Research source"
    },
    {
      "title": "Select your printer then tap Print.",
      "content": "Select your printer then tap Print . You should be able to change the paper size as well as how many copies you'd like to print. [14] X Research source"
    }
  ]
}