{
  "url": "https://www.wikihow.com/Save-a-TikTok-Video-in-Your-Gallery-on-Android",
  "title": "3 Easy Ways to Save TikTok Videos to an Android",
  "steps": [
    {
      "title": "Open the TikTok app.",
      "content": "Open the TikTok app. You will be taken to the “Home” tab, which features popular videos or videos from accounts you follow."
    },
    {
      "title": "Find a video you want to download.",
      "content": "Find a video you want to download. You can scroll through your home feed to look for a video you’d like to save. Alternatively, you can tap the magnifying glass icon in the upper-right corner and search for the name of a video or creator . Tap a creator's account name to view their videos. You can also visit your profile to save one of your own videos. To get to your profile, tap the account icon in the bottom right corner of the app."
    },
    {
      "title": "Tap the Share icon .",
      "content": "Tap the Share icon . The icon resembles a curved arrow on the right side of the video playback. This displays the Share options."
    },
    {
      "title": "Tap Save Video.",
      "content": "Tap Save Video . It's one of the options at the bottom of the menu. It has an icon that resembles an arrow pointing down over a tray. This saves the video in your Android gallery. The first time you do this, TikTok will ask permission to access your phone’s photos, media, and files. Tap Allow when this appears, or you won’t be able to save videos to your device. If you don't see this option, swipe left on the icons to scroll to the right. If the download icon is gray, the user has set their videos to not allow downloads. You cannot download their video through the TikTok app, but you can use a third-party app to download the video. [1] X Research source"
    },
    {
      "title": "Open the TikTok app.",
      "content": "Open the TikTok app. TikTok recommends that you download the videos you post to have offline copies of them. You can set your videos to download automatically when you post them."
    },
    {
      "title": "Tap +.",
      "content": "Tap + . It's the button in the middle at the bottom of the page. Tap this button to create a new post."
    },
    {
      "title": "Record or upload a video or photo and tap Next.",
      "content": "Record or upload a video or photo and tap Next . You can either use the tools to upload or make a video . You can also upload use photos to make a slideshow. Tap Next when you are ready to continue."
    },
    {
      "title": "Tap ⋯ More options.",
      "content": "Tap ⋯ More options . It's at the bottom of the page where you enter your description, location, and hashtags. This displays the options menu."
    },
    {
      "title": "Scroll down and tap the toggle switch next to \"Save to device.\"",
      "content": "Scroll down and tap the toggle switch next to \"Save to device.\" When this option is turned on, you will automatically save the video to your Gallery when you post it. This option will stay turned on for all future videos you post as well."
    },
    {
      "title": "Post your video.",
      "content": "Post your video. Tap Post at the bottom of the page. This will post the video to TikTok, and the video will be downloaded to your Gallery automatically."
    },
    {
      "title": "Download Video Downloader by InShot.",
      "content": "Download Video Downloader by InShot . Some TikTok users block their videos from being downloaded by other users. If you run into this issue, a popular solution is Video Downloader. There are other apps you can use to download videos from TikTok. You can try different ones in the Google Play Store ."
    },
    {
      "title": "Open TikTok and find a video.",
      "content": "Open TikTok and find a video. Browse through your TikTok feed or search for a video you want to download."
    },
    {
      "title": "Tap the Share button .",
      "content": "Tap the Share button . Along the right side of the video, you’ll see a few options to choose from. Tap the Share button, which has an icon with an arrow pointing right."
    },
    {
      "title": "Tap Copy Link.",
      "content": "Tap Copy Link . It's the first or second option at the bottom of the screen. Tap this option to copy the link to the video."
    },
    {
      "title": "Open Video Downloader.",
      "content": "Open Video Downloader. The app icon has an arrow pointing down over a yellow bar. If you see an ad, wait for the ad to finish playing and tap the \"X\" icon or Continue to app at the top of the page. The first time you open Video Downloader, it may ask you for permission to access your photos and videos. Tap Allow to grant it access."
    },
    {
      "title": "Paste the link in the text box and tap the Return icon.",
      "content": "Paste the link in the text box and tap the Return icon. You'll see a text box at the top of the screen that says “Search or Type URL.” Long press on this box to bring up the “Paste” and “Clipboard” options, tap Paste , then tap the arrow icon to the right of the text field."
    },
    {
      "title": "Tap the Download icon .",
      "content": "Tap the Download icon . It's the red button with an arrow pointing down over a line. It's in the lower-right corner."
    },
    {
      "title": "Tap the Download button.",
      "content": "Tap the Download button. It's at the bottom of the page above an arrow over a tray. Tap this icon to download the video to your Gallery."
    }
  ]
}