{
  "url": "https://www.wikihow.com/Open-a-TSV-File-on-PC-or-Mac",
  "title": "How Do I Open a TSV File? Your Easy, Step-by-Step Guide",
  "steps": [
    {
      "title": "Find and right-click the TSV file on your computer.",
      "content": "Find and right-click the TSV file on your computer. Open the folder that contains the TSV file you want to open, and right-click on the file icon to see your options on a drop-down menu. TSV files can be imported into most spreadsheet programs. You can use a spreadsheet program like Microsoft Excel , LibreOffice ( https://www.libreoffice.org ) or Apache OpenOffice ( http://www.openoffice.org ). Alternatively, you can use a basic text editor like Notepad or TextEdit , but this may sometimes distort the data in your TSV file, and only show a scramble of numbers and characters."
    },
    {
      "title": "Hover over Open with on the right-click menu.",
      "content": "Hover over Open with on the right-click menu. A sub-menu will pop up with multiple app options."
    },
    {
      "title": "Select Microsoft Excel on the \"Open with\" menu.",
      "content": "Select Microsoft Excel on the \"Open with\" menu. This will import the data stored in your TSV file into Excel, and open it as a spreadsheet. If you don't have Microsoft Excel on your computer, you can browse the available Office packages on Microsoft's product page."
    },
    {
      "title": "View your TSV data on the spreadsheet.",
      "content": "View your TSV data on the spreadsheet. Your TSV's data will be automatically formatted into cells on the Excel spreadsheet. You can view all your columns and data here."
    },
    {
      "title": "Open Google Sheets in your internet browser.",
      "content": "Open Google Sheets in your internet browser. Type or paste https://docs.google.com/spreadsheets into the address bar, and press ↵ Enter or ⏎ Return on your keyboard. If you're not automatically logged in, use your Google account to sign in here."
    },
    {
      "title": "Click the + icon on the bottom-right.",
      "content": "Click the + icon on the bottom-right. This icon looks like a colored \" + \" on a white button in the lower-right corner of your screen. It will create and open a new, blank spreadsheet file."
    },
    {
      "title": "Click the File tab.",
      "content": "Click the File tab. This button is in the upper-left corner of your spreadsheet. It will open a drop-down menu."
    },
    {
      "title": "Click Import on the \"File\" menu.",
      "content": "Click Import on the \"File\" menu. This will open a new pop-up window, and allow you to select the TSV file you want to view."
    },
    {
      "title": "Click the Upload tab in the Import window.",
      "content": "Click the Upload tab in the Import window. You can find this option on a tab bar below the \"Import file\" heading at the top of the window. This tab will allow you to select a file from your computer, and import it to Google Sheets. Alternatively, you can select a file from your Google Drive documents in the My Drive tab."
    },
    {
      "title": "Click the blue Select a file from your device button.",
      "content": "Click the blue Select a file from your device button. This will open your file navigator in a pop-up, and prompt you to select your TSV file. Alternatively, you can drag and drop your TSV file from your computer to the Import window here."
    },
    {
      "title": "Select the TSV file you want to view.",
      "content": "Select the TSV file you want to view. Click on your TSV file in the file navigator pop-up, and click the Open button on the bottom-right. This will upload your file to Google Sheets. You'll be prompted to select your data import settings when the upload is finished."
    },
    {
      "title": "Select Replace spreadsheet under \"Import location.",
      "content": "Select Replace spreadsheet under \"Import location. \" When this option is selected, your TSV file's data will be copied and pasted as the first sheet in this online workbook. Since you just created a new, blank spreadsheet, this option is the simplest solution. If you're importing TSV data to a different worksheet with more data, you can select Create new spreadsheet here to create a new online file out of your local TSV."
    },
    {
      "title": "Select Tab under \"Separator type.",
      "content": "Select Tab under \"Separator type. \" This will detect the tabs in your TSV file, and arrange your data according to this selection. TSV files use tabs to separate data values. Alternatively, you can select Detect automatically here."
    },
    {
      "title": "Select No under \"Convert text to numbers, dates, and formulas\" (optional).",
      "content": "Select No under \"Convert text to numbers, dates, and formulas\" (optional). If you want to format all the cells in the same data type as your TSV, make sure to select No here. If you want to convert your data from the TSV file, you can select Yes ."
    },
    {
      "title": "Click the Import data button.",
      "content": "Click the Import data button. This will import all your data from the selected TSV file, and paste it to your online spreadsheet. You can view your TSV data in Google Sheets here."
    }
  ]
}