{
  "url": "https://www.wikihow.com/Remove-Nail-Polish-From-Leather",
  "title": "How to Get Nail Polish off Leather: Scraping, Cleaning Products & More",
  "steps": [
    {
      "title": "Scrape nail polish off.",
      "content": "Scrape nail polish off. If you have just spilled nail polish on leather, you should immediately try to treat it by scraping the nail polish off of the leather with a small spatula or dull-bladed knife. This works best if the nail polish is still wet, as it will be easier to scrape off the leather. As you remove the nail polish, wipe it off of the knife or spatula, and continue to remove it until as much polish as possible has been removed. Be careful when using a knife that you don't stab the leather. That is why it's important to use a dull-bladed knife, or better yet a spatula because you won't run the risk of putting a hole in your leather. Use these tools in a slight upward lifting motion."
    },
    {
      "title": "Blot polish with a cotton ball.",
      "content": "Blot polish with a cotton ball. Another technique to removing the nail polish stain while it is wet is to take a cotton swab or ball and gently blot the stain until all or most of it is removed. This will prevent you from smearing the stain. [1] X Research source If you have a larger stain, use damp paper towels or a rag to dab the stain, but be careful not to smear the stain or to drip water onto your leather that will cause the stain to run."
    },
    {
      "title": "Peel dry polish off.",
      "content": "Peel dry polish off. If you haven't discovered the nail polish stain until after it dries, you'll need to attempt to peel it off with your finger. Try using your fingernail to get under the edge of the stain so that you can peel it off. If your stain is on a couch or car seat, push down on the surface of the leather on one side of the stain so that the opposite side of the stain is lifted up, making it easier to get underneath the stain. If your stain is on a leather garment, try folding the leather near the edge of the stain. Peel the polish off slowly, watching the leather as you do so to make sure you don't damage it."
    },
    {
      "title": "Test the leather.",
      "content": "Test the leather. Before you use any products on the leather, you will want to test each of them out to make sure the leather will not become damaged. Certain products like acetone may remove dye from the leather, so take extra caution when using these products. Before you remove an entire stain with a product, test an inconspicuous area on the leather, then wait 24 hours to observe if the leather is damaged. If the leather seems fine, then proceed to treat the stain with the product."
    },
    {
      "title": "Remove the stain with rubbing alcohol.",
      "content": "Remove the stain with rubbing alcohol. Rubbing alcohol can cause less damage to leather than acetone, but it may dry out your leather, so take caution when using it. After you have tested it on part of the leather, soak cotton swaps in rubbing alcohol and gently dab the stain. As the cotton swabs soak up the stain, change them out with fresh ones until the stain has been removed. [2] X Research source Be careful not to oversaturate your stain with rubbing alcohol as this will more than likely damage your leather. You want to soak your swabs in alcohol, but you don't want them to be so wet that they drip the alcohol on the rest of the surface."
    },
    {
      "title": "Apply non-acetone nail polish remover to the stain.",
      "content": "Apply non-acetone nail polish remover to the stain. If rubbing alcohol wasn't effective to remove all of the stain, it's time to move to a harsher product. Non-acetone remover shouldn't bleach your leather, but you will still want to test your product first because it may also dry out your leather. After you have checked your product on the leather, moisten a cotton swab with the nail polish remover, and carefully dab at the stain, making sure you don't touch the parts of the leather unaffected by the stain. [3] X Research source Nail polish remover may take a few attempts, so in between each attempt to remove the stain, allow the leather to dry. Then, proceed to treat the stain until it is removed with a new cotton ball each time. The benefit of non-acetone nail polish remover is it won't bleach your leather, but it may not be powerful enough to remove the stain. If non-acetone nail polish remover is not removing your stain, you can try acetone nail polish remover. This is a harsher product and will more than likely damage your leather, but the damage can be repaired rather easily."
    },
    {
      "title": "Create mixture of white vinegar and olive oil.",
      "content": "Create mixture of white vinegar and olive oil. Using one part white vinegar and two parts olive oil, combine ingredients and then using a tooth brush or cleaning brush, gently scrub the stain with the mixture. This will pick apart the nail polish and it should begin to flake off. Then, clean the mixture off of the leather with a paper towel and let dry. [4] X Research source This is the safest nail polish stain remover as it works like leather conditioner and won't dry out or stain your leather. However, it may be the least effective in removing your stain."
    },
    {
      "title": "Wash off leftover product.",
      "content": "Wash off leftover product. After you have treated your stain, your leather may have some damage, but it is easy to remedy this damage. Begin by washing the area of the stain on the leather with a moisturizing bar of soap and water. This should remove any product left on your leather. [5] X Research source After you have washed your leather, pat dry and let it air dry the rest of the way. You can then proceed to treat the leather. If you used non-acetone products, your leather may not have suffered any damage due to bleaching, but many products can dry out leather, so it's important to condition leather afterwards to keep the leather from cracking, especially on furniture."
    },
    {
      "title": "Condition your leather.",
      "content": "Condition your leather. You can purchase leather conditioner or create your own by mixing one part white vinegar with two parts linseed oil or lemon essential oil. Apply in a circular motion and let dry. It should dry in an hour or so depending on the size of the stain. This conditioner should restore the shine to your leather and remove the nail polish remover stain, but if not, proceed to the next step. [6] X Research source"
    },
    {
      "title": "Apply paste shoe polish.",
      "content": "Apply paste shoe polish. If your leather was damaged by the products you used, you can repair the color of your leather by using a shoe polish. Find a shoe polish that is similar to the color of your leather, and work some of the polish into the stain. Then, let it dry and buff it out as you would a pair of leather shoes. Make sure you buff enough that it will not come off. [7] X Research source"
    },
    {
      "title": "Dye your leather.",
      "content": "Dye your leather. If you have removed your nail polish stain and your leather is left damaged, you can dye your leather back to its original color if your stain is on a piece of furniture. You will want to find a match for your leather, so try contacting a leather furniture store. You can also purchase leather re-dye kits, but be cautious in doing this because you want to make sure you are dyeing your leather the right color."
    },
    {
      "title": "Contact a professional.",
      "content": "Contact a professional. This is probably the safest step, as a professional will know best how to treat a stain and will be able to do so without creating unrepairable damage. If you are weary of removing stains on your own, then contact your local furniture store or a stain removing professional and have them treat the stain."
    }
  ]
}