{
  "url": "https://www.wikihow.com/Remove-a-Dent-from-Wood",
  "title": "How to Remove a Dent from Wood",
  "steps": [
    {
      "title": "Dab the dent with water.",
      "content": "Dab the dent with water. Pour about an ounce of water over the affected area, just enough to cover the dent and a small part of the surrounding wood. Make sure the dent is completely wet. Pooling inside the depression itself is a good sign that the spot has been thoroughly soaked. [1] X Research source Using an eyedropper or kitchen baster will give you more control over where you apply the water. If there’s any serious breakage or chipping around the dent, you may need to have the surface repaired professionally to avoid making it worse."
    },
    {
      "title": "Place a damp paper towel or piece of cloth over the dent.",
      "content": "Place a damp paper towel or piece of cloth over the dent. Wet the cloth or paper towel and wring out the excess water, then lay it directly on top of the dent. This will provide a little added moisture while also creating a buffer that will help protect the wood from being damaged by the heat of the iron. [2] X Research source It may be a good idea to use an old t-shirt, dusting rag or some other piece of fabric that you don’t care about potentially ruining. If the dent is located on the side or corner of a piece of furniture, you might need to hold the cloth in place with your free hand while you steam the wood. [3] X Research source"
    },
    {
      "title": "Give the water time to soak into the wood.",
      "content": "Give the water time to soak into the wood. Let the wood sit for a minute or two to absorb as much moisture as possible. As the water seeps into the wood, it will cause it to soften and become pliable. Once you apply heat to the spot, the wood will expand and the dent will lift right out. The deeper the water penetrates into the wood, the more effective the steaming process will be."
    },
    {
      "title": "Heat up a clothes iron.",
      "content": "Heat up a clothes iron. Plug the iron in and turn it on to the highest setting. Give it a few minutes to start warming up—it needs to be nice and hot in order to work effectively. [4] X Research source The iron will be very hot after you’ve turned it on. Touching the surface could result in a painful burn. When you’re not using the iron, set it on a hard, level surface where it won’t get tipped over."
    },
    {
      "title": "Run the iron over the dented area.",
      "content": "Run the iron over the dented area. Press the iron into the damp cloth above the dent and move it around using slow circular motions. Make a few passes, gradually widening the area that you’re ironing. Keep heating the wood until the cloth is dry, then lift a corner to check your progress. [5] X Research source The heat from the iron (coupled with the moisture of the water) will cause the compressed wood in the dent to swell, returning it to its original form. Try not to let the iron sit in one place for too long, or it may scorch the cloth or the wood underneath. [6] X Research source"
    },
    {
      "title": "Rewet the wood and repeat as needed.",
      "content": "Rewet the wood and repeat as needed. A single ironing might be all you need to deal with minor dents. For more severe depressions or areas with multiple marks, continue adding water and ironing slowly until the worst of the dents have been raised. [7] X Research source Between attempts, be sure to dampen the cloth with fresh water or grab a fresh paper towel. You might not be able to remove deep dents entirely. However, steaming will help to level them out and make them less noticeable. [8] X Research source"
    },
    {
      "title": "Let the wood dry completely.",
      "content": "Let the wood dry completely. Wet wood is soft, which makes it prone to splitting and breakage. Allow the surface to air dry before handling it. In the meantime, hold off on replacing furniture or setting other objects on it to avoid further accidents. [9] X Research source The heat of the iron will have evaporated most of the moisture, but it may take a few hours to regain its full hardness and rigidity. The wood will shrink somewhat as it dries, which can cause problems if you begin sanding or putting pressure on it too soon."
    },
    {
      "title": "Smooth out the wood with sandpaper.",
      "content": "Smooth out the wood with sandpaper. In some cases, small flaws may be left behind in the wood, or the water might produce a slight discoloration. You can remedy this by running a square of high-grit sandpaper over the area until it blends in with the wood around it. [10] X Research source Use light, smooth strokes to avoid scratching the wood surface, which may have been weakened by the dent."
    },
    {
      "title": "Brush on a protective finish.",
      "content": "Brush on a protective finish. When you're done buffing imperfections out of finished surfaces, be sure to touch them up with a fresh coat of paint or laminate. This will help conceal any remaining traces of the dent and act as a barrier against knocks and bumps in the future. [11] X Research source A water-based satin varnish is a great option for a protective finish. In most cases, a single coat will do to cover up the spot where the dent was. Allow the refinished surface to air dry overnight before touching it."
    },
    {
      "title": "Repair large dents with a filler material.",
      "content": "Repair large dents with a filler material. Steaming won’t always be enough to eliminate dents. Deep gouges and spots with breaking, splitting or chipping should be looked at by a professional. Extensive damage can usually be repaired with a durable epoxy or lacquer filler. [12] X Research source For bigger jobs, have a woodworker cut a special wood inlay to fit the damaged area. [13] X Research source Afterwards, the repaired surface will likely need to be resealed or stained."
    }
  ]
}