{
  "url": "https://www.wikihow.com/Save-Instagram-Photos-to-Your-Phone",
  "title": "How to Save Instagram Photos to Your Phone",
  "steps": [
    {
      "title": "Open the Instagram App.",
      "content": "Open the Instagram App. On your mobile phone, tap on the multi-colored camera lens app image to open the Instagram App."
    },
    {
      "title": "Log in to your account.",
      "content": "Log in to your account. If you have logged in to the app before, it will instantly direct you to your account. If you are not logged in, fill in your username and password in the appropriate box to log into your account."
    },
    {
      "title": "Click on your profile.",
      "content": "Click on your profile. At the bottom right side of the app is an icon showing a rough sketch icon of a person. Tap on it and it will direct you to your profile page."
    },
    {
      "title": "Tap on the horizontal three lines.",
      "content": "Tap on the horizontal three lines. You will find this at the top right side of the screen. Once you tap on it, a menu of options will pop up."
    },
    {
      "title": "Go to Settings.",
      "content": "Go to Settings. This is located at the very top of the menu of options. Click on it and more options will appear."
    },
    {
      "title": "Click on the Account option.",
      "content": "Click on the Account option. Select the Account option that appears from the list of options after clicking on Settings. More options will appear."
    },
    {
      "title": "Select the Original Photos option (iPhone).",
      "content": "Select the Original Photos option (iPhone). It is the third of the four options that will appear after selecting Account. Tap on it, and another pop-up will show on the screen. For Android devices, it will read as “Original Post”."
    },
    {
      "title": "Switch on Save Original Photos.",
      "content": "Switch on Save Original Photos. On Android devices, this will appear as Save Original Posts. By default, this option is off. To activate it, tap on the switch. You can tell it is on when the switch turns blue. Only iOS devices will see the Original Photo options. Once you activate it, all unedited photos and videos taken with Instagram’s feed camera will automatically download and save to your phone’s camera roll."
    },
    {
      "title": "Switch it off if desired.",
      "content": "Switch it off if desired. You can decide at any time to turn this setting off. Go to Settings. Tap on Account. Select original photos to original post options. Switch off Save Original Photos or Original Posts by turning off the switch."
    },
    {
      "title": "Open the Instagram App.",
      "content": "Open the Instagram App. It is represented by the shiny rainbow-like camera lens icon. Click on the app to open it."
    },
    {
      "title": "Log in to your account.",
      "content": "Log in to your account. It should take you directly to your account if you have logged in before. Log in by filling in your account’s username and password if you haven't already."
    },
    {
      "title": "Navigate to other users’ photos.",
      "content": "Navigate to other users’ photos. Go to the post that has the photo you want to save. You can find it on your feed, or you can visit the person’s page to view it."
    },
    {
      "title": "Tap on the Bookmark icon.",
      "content": "Tap on the Bookmark icon. You will find the icon just under the picture you want to save, on the same line as the likes and comment buttons. It is located at the far right end of the line. Once clicked, the picture gets saved to a folder on the app."
    },
    {
      "title": "Save photo to a specific folder.",
      "content": "Save photo to a specific folder. By default, when you select the bookmark icon, the post or picture gets saved to a “Saved” folder. If you want to save under a certain folder or collection, do the following: Tap and hold the bookmark icon. Select the folder or collection you want to save the picture or post under. Create a new collection to save the picture or post by tapping on the plus symbol at the top of the “Save To” pop-up."
    },
    {
      "title": "View the saved photo or video.",
      "content": "View the saved photo or video. After saving the photos in your chosen collection, you can view it any time you want. To view it, do the following: Go to your profile on the Instagram app. Click on the person-shaped icon at the bottom of your Instagram Feed. Click on the “Saved” option. A pop-up menu will appear. Select the “Saved” option to view your saved contents."
    },
    {
      "title": "Open Instagram.",
      "content": "Open Instagram. Go to the Instagram website using a desktop browser."
    },
    {
      "title": "Log in to your account.",
      "content": "Log in to your account. Fill in your username and password to log in."
    },
    {
      "title": "Navigate to the image.",
      "content": "Navigate to the image. Find the picture you want to save and open it in a fresh tab."
    },
    {
      "title": "Select \"View page source.\"",
      "content": "Select \"View page source.\" Use your mouse to right-click on the image for download. Click on the View Page Source option from the pop-up menu that appears. The page source code will open in another tab."
    },
    {
      "title": "Find and copy the first .",
      "content": "Find and copy the first . jpg Link. On the source code page, use the find tool or scroll manually until you find the first jpg.link. Copy only the URL and not the quotation marks."
    },
    {
      "title": "Paste on a new tab.",
      "content": "Paste on a new tab. The image you want to save will load here."
    },
    {
      "title": "Save the image.",
      "content": "Save the image. Right-click on the photo and click download to save it on your computer."
    },
    {
      "title": "Transfer the photo to your phone.",
      "content": "Transfer the photo to your phone. You can do this by emailing it to yourself or any other form of messaging you choose."
    }
  ]
}