{
  "url": "https://www.wikihow.com/Pretend-to-Faint",
  "title": "How to Pretend to Faint",
  "steps": [
    {
      "title": "Learn the causes of fainting.",
      "content": "Learn the causes of fainting. Fainting is a common malady that many people experience. Its causes can be either harmless or life threatening. Since you’re planning to fake faint, it’s better to learn about the relatively harmless reasons people faint. Fainting is caused by reduced blood flow to the brain. A harmless fainting spell can be caused by low blood pressure or a nervous system response that reduces blood flow to the brain. [1] X Research source Such a nervous system response could be the result of highly stressful or traumatic event, fear, or pain. For teenagers, fake fainting is a perfect excuse to avoid an event or exam, since it’s common for them to experience real, but harmless, fainting spells. For adults who are older, it’s possible for them to experience a harmless fainting spell once or twice a year; but anything more than that might be considered the result of something life-threatening."
    },
    {
      "title": "Learn the symptoms of fainting.",
      "content": "Learn the symptoms of fainting. A person who faints can experience several symptoms leading up to losing consciousness [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source , including feeling very hot, nauseous, lightheaded or confused, or hyperventilating. A person might also feel dizzy or weak, or have ringing ears or experience a temporary loss of hearing. These symptoms are common for someone who experiences a harmless fainting spell."
    },
    {
      "title": "Decide on a harmless reason for your fake faint.",
      "content": "Decide on a harmless reason for your fake faint. Unless you need to fake a fainting spell for a dramatic play, you’ll need to come up with a reason for your fake fainting spell that won’t compel people to call an ambulance, and that will also allow you to walk away seemingly shaken up, but unharmed. Because low blood pressure and low blood flow to the brain are usually the causes of harmless fainting spells, there are several scenarios that could cause that type of fainting. Not eating breakfast or waiting too long between meals to eat something can cause low blood pressure. Not drinking enough water can cause dehydration and reduce blood flow to the brain. If you happen to be outside or in a really stuffy room, you could say that you got too hot. You could pretend to experience a stressful or traumatic event. If you’re easily scared by bugs or loud noises, you could pretend your fear caused you to hyperventilate, and then faint. If you decide to let someone in on your plan to fake faint, you could have them hit or slap you so hard you faint. Now this might be a little dramatic and may have repercussions for the person helping you out, but it is a valid reason for a fainting spell that won’t seem life-threatening."
    },
    {
      "title": "Map out how your fake faint will happen.",
      "content": "Map out how your fake faint will happen. In order for your fake fainting spell to have as little blowback as possible, and to achieve the result you’re looking for, you’ll need to have it planned out as best you can. Your reason for wanting to fake faint will determine the location where it happens. You may have a little more control over when it happens. But you need to have extreme control over how it happens, so as not to injure yourself or cause unintended consequences. What are you trying to avoid? A friend’s wedding? An exam you haven’t studied for? Maybe you’re singing to an auditorium of your peers, and you don’t feel ready. To minimize the blowback from your fake fainting spell, you may want to fake faint in front of only a few people. Fainting in front of a lot of people might expose you to some who can easily detect a fake fainting spell, and it might also make the moment bigger than you want it to be, hindering a quick exit. When you pretend to faint try your best to look real. You also don’t want to faint during an important event that might affect other people, such as your friend’s wedding, while someone’s receiving an award, or during the test you’re trying to avoid. Plan for your fake fainting spell to happen before the event you’re trying to avoid."
    },
    {
      "title": "Know how your fake fainting spell will happen.",
      "content": "Know how your fake fainting spell will happen. Will you be standing or sitting? What symptoms do you think you can effectively mimic? Which way will you fall when pretending to faint? How long will you pretend to be unconscious? Have these questions answered. It’s important to do a dry run of your fake fainting spell. You don’t want to think you can pull it off, only to realize during the act that you’re afraid of falling and bumping your head or that you can’t hyperventilate without smiling. You also want to ensure that you fall as safely as possible in order to minimize potential injury. Know exactly what you’re going to do, so that when you fake faint in front of other people, it will go smoothly."
    },
    {
      "title": "Plan your exit.",
      "content": "Plan your exit. You should only pretend to be unconscious for a few seconds, and a maximum of 20 seconds. Once a person falls to the floor or reclines enough so that his or her head is parallel to the heart, blood flow is almost immediately restored to the brain, as is consciousness. [3] X Research source Once you pretend to awaken from your loss of conscious, don’t jump up immediately and act as if everything is fine. Plan to sit for a few minutes, since it takes about that long for a person to recover from a real fainting spell. Knowing this is important. You don’t want to faint during a time-sensitive event and expect to run out immediately afterwards. Also prepare to explain away your fainting as no big deal, so that once you should feel fine to stand up and walk away, you can exit the area as quickly as possible."
    },
    {
      "title": "Set the stage for your fake fainting spell.",
      "content": "Set the stage for your fake fainting spell. Now that you’re prepared to make a fake faint look real, you can now make it happen. Once you’re where you want your fake fainting spell to happen, make sure the conditions are right for it to occur the way you want it to. Are enough or the right people present? Is the event you’re trying to avoid still happening? Is the hallway too crowded? Once you know things seem right, move to the general area where you want your fake fainting spell to occur. A real fainting spell happens fairly quickly from the onset of symptoms. Make sure there aren’t dangerous objects nearby that could cause serious injury if you happen to hit them when falling. And make sure you won’t hit anyone."
    },
    {
      "title": "Complain about having symptoms of fainting.",
      "content": "Complain about having symptoms of fainting. When you’re ready, begin exhibiting symptoms of fainting . [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This should only occur for a few minutes in total. If you plan to use not as your excuse not eating breakfast, mention that you’re very hungry. If the room is crowded or stuffy, you could start complaining about feeling hot. If you’re walking, start slowing down, hold your head a little, and say you feel dizzy. You can blink or squint your eyes. Complain of nausea. Pretend to suddenly lose energy, and say you feel weak. Keep up this last symptom for 1-2 minutes."
    },
    {
      "title": "Get in position where you’ll faint.",
      "content": "Get in position where you’ll faint. While exhibiting your symptoms, and without drawing attention to your movements, move into the spot where it seems safest to fall. If you plan on fainting while sitting, pretend you’re too weak to stand and take a seat. You can say that you feel kind of weird and that you think you need a glass of water or some fresh air. Maybe ask someone to open a window. If you are windowless or have no water around, just say you think you need to sit down, or go out for fresh air. Sit for a bit and get up slowly. Then stumble a bit and fall forward. Before you do that say something such as \"I just....\" Make sure you don't finish your sentence, unless it's short."
    },
    {
      "title": "Pretend to faint.",
      "content": "Pretend to faint. Make sure you fall safely . You don't want to hit your head and hurt yourself. If you are standing, buckle your knees and let them hit the ground before you attempt to drop your torso. Make sure you go fast enough without making it look as if a 5000 volt surge of lightning has rushed though you, or it will seem fake. If you are sitting, relax and imagine you actually are fainting. Let yourself fall off the chair, as it is unlikely you would stay on there if you actually did faint. Try to land on the back side of your thigh, not your hip or tailbone. Then quickly drop your torso. Just close your eyes and let all your muscles completely weaken; just relax. Act as if you have no bones and fall to the floor in a crumpled heap. This will seem real."
    },
    {
      "title": "Pretend to be unconscious for a few seconds.",
      "content": "Pretend to be unconscious for a few seconds. Lie on the ground. Make sure you aren't stiff, and if someone attempts to lift an arm and shake it, let it completely relax and when they drop it, just let it fall. This is a common 'fake spotter' test. Unconscious people don't have control over their limbs. Someone should come over to see if you are okay, causing a diversion for whatever occasion. Don't stay down there too long, or someone might call the Emergency Services . Unless you want that to happen, make sure you don't stay out for more than 20 seconds."
    },
    {
      "title": "Open your eyes and take a deep breath.",
      "content": "Open your eyes and take a deep breath. People who have fainted will often awaken having not remembered that they fainted. Say all you can remember is feeling hot and that it looked as though someone dimmed the lights in the room."
    },
    {
      "title": "Sit up slowly and after a moment, stand, or get someone to pull you to your feet.",
      "content": "Sit up slowly and after a moment, stand, or get someone to pull you to your feet. After a moment, you can attempt to stand and sort of waver a bit again, so people think you might faint again and will all rush to your aid. [5] X Research source At this moment, if people are asking you questions, you can begin to explain your fake faint away as harmless."
    },
    {
      "title": "Make a semi-haste exit.",
      "content": "Make a semi-haste exit. Rest for about ten minutes or so to pretend to recover from your fake fainting spell. When you’re ready, excuse yourself to either go home to rest or to set an appointment to visit your doctor. Someone may offer to take you somewhere, you can either accept their generosity or explain that you can get safely to your destination on your own."
    }
  ]
}