{
  "url": "https://www.wikihow.com/Note-Enclosures-in-a-Letter",
  "title": "How to Indicate an Enclosure in Letters and Emails",
  "steps": [
    {
      "title": "Include an enclosure after the formal closing at the end of your letter.",
      "content": "Include an enclosure after the formal closing at the end of your letter. Use a complimentary closing such as “Sincerely” or “Yours Truly,” leave space for your signature, and then type your name. [1] X Research source Consider writing “Thank you” if you request something in the letter. [2] X Research source Generally, your closing might be more familiar if you’re on more personal terms with the recipient. For example, if you are writing to your best friend’s father, you might use a more informal closing such as “Kind regards” or “Best wishes.”"
    },
    {
      "title": "Type “Enclosure” and the name of the enclosed document under your signature.",
      "content": "Type “Enclosure” and the name of the enclosed document under your signature. If you’ve included an additional document to your letter or email, place an enclosure notation beneath your signature. Write or type “Enclosure” followed by the name of the document or content attached. [3] X Research source If you've included more than one document, use the plural “Enclosures” and indicate the number of enclosures afterward. The number should either follow a colon or be surrounded in parentheses. For example, if you have 3 brochures enclosed, type either “Enclosures: 3” or “Enclosures: Fast food brochure (1), menu (2), catering information (3).”"
    },
    {
      "title": "Abbreviate “Enclosure” with “Enc.” or “Encl.”",
      "content": "Abbreviate “Enclosure” with “Enc.” or “Encl.” You don't necessarily have to type out the entire word “enclosure” to make an enclosure notation on a formal business letter or email. Both “Enc.” and “Encl.” are acceptable. [4] X Research source If you're enclosing more than one document, you can note the number of enclosures after the abbreviation but don't add an “s” to the abbreviation. Ensure all documents have an easily recognizable title if you want to list them this way. You don't want your recipient to question whether the right documents are there."
    },
    {
      "title": "Include a description if needed.",
      "content": "Include a description if needed. Writing a description for an enclosure isn’t necessary, but it can help the recipient know what type of document(s) you’ve enclosed. This is most common when including both original documents and copies. List the title of the document and then include the description in parentheses. [5] X Research source For example, you might write “Enclosures: Birth certificate (original plus two copies).” If you’ve enclosed original documents that you’ll need returned, note that in the body of the letter."
    },
    {
      "title": "Describe and mention enclosures in the body of the letter.",
      "content": "Describe and mention enclosures in the body of the letter. When writing your letter, make sure to discuss or mention any additional paperwork attached to the letter or email. The enclosure annotation will flag the reader initially; however, a detailed reminder never hurts, especially if you’re enclosing important documentation or content that needs to be described. If you're enclosing multiple documents, it may be more efficient to simply list them in your letter, along with a brief explanation of what those documents are."
    },
    {
      "title": "",
      "content": "Amy Fields, Sales & Marketing Boots & Co 6789 Country Ave. Nashville, TN 37011 March 25, 2024 Mr. Bill Crock, CEO Sandals & Co 12345 Saddlebrook Rd. Detroit, MI 48211 Dear Mr. Crock, I hope this email finds you well. I’m writing to discuss the possibility of organizing a fundraising event. Boots & Co would love to partner with Saddles & Co this summer to raise money for children in need. I’ve enclosed a proposal in this email. I look forward to potentially working with you in the future. Sincerely, Amy Fields Enclosure: Fundraiser proposal"
    },
    {
      "title": "",
      "content": "Sally Sunshine 3412 Sunshine Lane Montgomery, AL 36043 April 22, 2024 Barbara Butter 6789 Rolling Rd. Bakerville, TN 37185 Dear Mrs. Butter, My name is Sally Sunshine, and I’m a recent graduate of the Cupcake Academy. I saw you’re looking for a cupcake baker, and I believe my skills would be a good match for you and your company, All Things Baked. I’ve enclosed my cover letter, resume, and baking portfolio for you to peruse at your leisure. I look forward to hearing from you. Sincerely, Sally Sunshine Enclosures: 3"
    },
    {
      "title": "Type in Times New Roman with default margins.",
      "content": "Type in Times New Roman with default margins. Opt for a standard, easy-to-read font, like Times New Roman or Helvetica, when writing formal business letters or emails. Stick with default margins that are 1 in (2.5 cm). This ensures that your message can be read easily. [6] X Research source If you have a shorter letter and want to fill the page, consider increasing the margins a little to see if that helps balance the page. For particularly short letters, try a slightly larger, more spread-out font, such as Verdana. But be careful that the font isn’t too distracting."
    },
    {
      "title": "Include your name and address in the top left-hand corner.",
      "content": "Include your name and address in the top left-hand corner. Unless you’re writing on letterhead, your name and address will be the first thing at the top of the page in a formal business letter. Write out your address as you would the front of an envelope single-spaced at the top left of the page. [7] X Research source Your word processing program may have a business letter template you can use, so you don't have to format it manually. In addition to your mailing address, you can also include your phone number, email address, or both."
    },
    {
      "title": "Type the date the letter was completed.",
      "content": "Type the date the letter was completed. If you're formatting your letter manually, double-space from the last line of your address. Then, type the full version of the date, formatted in the style your recipient uses. [8] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source For example, if you’re writing your letter to someone in Europe, put the day first, then the month, then the year: “16 July 2017.” If you’re writing to an American, write, “July 16, 2017.”"
    },
    {
      "title": "Identify the recipient and their location, then greet them.",
      "content": "Identify the recipient and their location, then greet them. Double-space down from the date and type the name of the person to whom you're writing, along with their mailing address. After the address, skip down another 2 lines and type a formal greeting. “Dear” is followed by the person's title and name is typically appropriate. [9] X Research source Depending on your reason for writing, you also might include their job title or company name. Use discretion on whether to include the recipient’s first name. If the person is in a position of authority, use “Mr.” or “Ms.” followed by their last name."
    },
    {
      "title": "Indicate your reason for writing.",
      "content": "Indicate your reason for writing. A business letter or email is best when it’s brief and to the point. After introducing yourself, go immediately into why you are writing the letter and what you hope to accomplish as a result. [10] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source For example, if you’re writing to apply for a job, you might write, “My name is Sally Sunshine, and I’m a recent graduate of the Cupcake Academy. I saw you’re looking for a cupcake baker, and I believe my skills would be a good match for you and your company.”"
    },
    {
      "title": "Type the body of the letter or email in block style.",
      "content": "Type the body of the letter or email in block style. There are several paragraph styles for formal business letters, but the block style is the simplest and most commonly used. For this style, single-space your text and double-space between paragraphs. [11] X Research source Paragraphs aren’t indented in block style, and the text is left-justified."
    },
    {
      "title": "An enclosure is an additional document attached to a business letter.",
      "content": "An enclosure is an additional document attached to a business letter. Unlike regular attachments that expand on the message of a letter, enclosures stand alone. For example, a resume provided with a cover letter would be an enclosure. Enclosures are noted within a business letter or email with an enclosure notation informing the reader or recipient of the additional material."
    }
  ]
}