{
  "url": "https://www.wikihow.com/Remove-Latex-Paint-from-Clothes",
  "title": "How to Remove Latex Paint from Clothes",
  "steps": [
    {
      "title": "Dampen the fabric with warm water.",
      "content": "Dampen the fabric with warm water. Moisten a clean rag with some warm water. Using your rag, you can dab the stained fabric to get it a little bit wet. [1] X Research source"
    },
    {
      "title": "Pour rubbing alcohol over the stain.",
      "content": "Pour rubbing alcohol over the stain. Although there are many ways of removing latex paint, by far the most effective solution is rubbing alcohol. Open a bottle of rubbing or isopropyl alcohol. Pour a liberal amount of alcohol over the stain. [2] X Expert Source Rani Gorgis Laundry & Cleaning Specialist Expert Interview. 7 April 2021. If you have a clean garden sprayer, you can put the rubbing alcohol in it and then spray the stain. [3] X Research source If the paint has been on there for a while, let the alcohol soak for a few minutes to break it up."
    },
    {
      "title": "Rub the fabric against itself.",
      "content": "Rub the fabric against itself. Once the stained fabric has been thoroughly doused with alcohol, you can rub the fabric against itself to begin removing the stain. Simply rub one part of the fabric against another part of it. If needed, you can apply more isopropyl alcohol at this stage. Unless you're working with a delicate fabric, it should stand up to some vigorous scrubbing."
    },
    {
      "title": "Use a laundry brush to scrub the stain out.",
      "content": "Use a laundry brush to scrub the stain out. Depending on the size of the latex paint stain, you can use a laundry brush or even a toothbrush. Brush the isopropyl alcohol into the stain to remove the paint. [4] X Research source [5] X Expert Source Rani Gorgis Laundry & Cleaning Specialist Expert Interview. 7 April 2021. If you prefer, you can use a pumice stone instead of a brush. [6] X Research source"
    },
    {
      "title": "Rinse out the stain with warm water.",
      "content": "Rinse out the stain with warm water. Run some warm water over a clean rag. Wipe off the paint and the rubbing alcohol. At this stage, you may prefer to simply run water over the stained fabric in your laundry sink. [7] X Research source"
    },
    {
      "title": "Put the stained clothing item in the washing machine.",
      "content": "Put the stained clothing item in the washing machine. After removing the latex paint stain, you should put the clothing item in the washing machine. Follow the directions for laundering the item, as directed on the clothing label. By laundering the item, you will remove any remaining latex paint and alcohol from the fabric. [8] X Research source Launder stained clothing in hot water. You should wash the stained item on its own, since you don't want the latex to get on other clothing items."
    },
    {
      "title": "Flush the latex paint stain with warm water.",
      "content": "Flush the latex paint stain with warm water. Place the stained part of the fabric under a tap with running warm water. [9] X Expert Source Rani Gorgis Laundry & Cleaning Specialist Expert Interview. 7 April 2021. Try to get out as much of the latex paint as you can, especially if the stain is fresh. [10] X Research source"
    },
    {
      "title": "Test the fabric to make sure it is color-safe.",
      "content": "Test the fabric to make sure it is color-safe. Pour some liquid dish detergent onto the inseam of the piece of clothing you want to clean. Rub the detergent into the inseam and see if any color comes out. If nothing comes out, you know the fabric is color-safe and you can proceed with using dish detergent to remove the stain. [11] X Research source If the fabric is not color-safe, you'll need to take the item to a professional dry cleaner."
    },
    {
      "title": "Prepare a detergent solution with one-part detergent and one-part water.",
      "content": "Prepare a detergent solution with one-part detergent and one-part water. Because dishwashing detergents are made to break up oils, they can help to dissolve latex paint. Mix one-part dishwashing detergent with one-part water. [12] X Research source"
    },
    {
      "title": "Moisten a sponge with the detergent solution and apply it to the fabric.",
      "content": "Moisten a sponge with the detergent solution and apply it to the fabric. Allow it to soak in for three minutes. Then, use a clean cloth or fabric brush to scrub out the stain. [13] X Research source"
    },
    {
      "title": "Work up a lather with a sponge.",
      "content": "Work up a lather with a sponge. Using your sponge, rub away at the stain until you get a nice lather. Continue to scrub the stain until the paint is no longer visible. [14] X Research source You can reapply the detergent mixture and try again, if necessary. If you can't get rid of the paint using detergent, you'll need to use rubbing alcohol."
    },
    {
      "title": "Rinse and launder the clothing item.",
      "content": "Rinse and launder the clothing item. Run warm water over the stain until all of the soap and the paint are gone. Finally, throw the item in the washing machine. [15] X Research source To launder the item, follow the directions listed on the clothing label. You should launder the stained clothing separate from your regular washing load."
    },
    {
      "title": "Spray a small stain with hairspray.",
      "content": "Spray a small stain with hairspray. Lay your clothes on a flat surface. Douse the small stain with hairspray. Leave it for a few minutes so the alcohol can break up the paint, and then come back and do a bit of scrubbing with a fabric brush. When you're finished, launder the clothing as you normally would, and finish with a run through the dryer."
    },
    {
      "title": "Scrub the stain with gel hand sanitizer.",
      "content": "Scrub the stain with gel hand sanitizer. Squirt some hand sanitizer onto the small stain. Then, you can scrub the stain with a toothbrush to get the latex off your clothes! Since hand sanitizer contains rubbing alcohol and is portable, this is a quick and efficient way of addressing paint stains when they happen. [16] X Research source"
    },
    {
      "title": "Scrub the stain with paint thinner.",
      "content": "Scrub the stain with paint thinner. Pour half a cup of paint thinner into a yogurt container. Saturate a clean rag in the container. Use the rag to scrub off the latex paint. When the rag gets dirty, you can squeeze out the excess liquid into a separate yogurt container. Continue scrubbing until all of the paint is gone. [17] X Research source If the stain is very bad, you can pour the paint thinner directly onto the fabric. Keep in mind that paint thinner may damage more delicate clothing."
    },
    {
      "title": "Use a specialty cleaning product to remove difficult stains.",
      "content": "Use a specialty cleaning product to remove difficult stains. There are certain cleaners, like “goo-gone” or “goof off,” which are made to get rid of the sticky materials. If you have a specialty cleaning product, you should use it in a well-ventilated area, since the smell is often quite strong. Apply the specialty cleaning product and let it soak in the stain for two minutes. You can scrub off the stain with a pumice stone or other scrubbing implement. Finally, rinse and launder the item. [18] X Research source If necessary, you can repeat the process."
    },
    {
      "title": "Use rubbing alcohol on a cotton ball to remove a small stain.",
      "content": "Use rubbing alcohol on a cotton ball to remove a small stain. If you are cleaning a small stain, you can use cotton balls with rubbing alcohol. Place a cotton ball on top of a bottle of rubbing alcohol. Turn the bottle upside down to soak the ball. Then, you can use the cotton ball to scrub off a small stain."
    },
    {
      "title": "Apply lavender oil to small latex stains.",
      "content": "Apply lavender oil to small latex stains. Although relatively expensive in comparison to rubbing alcohol, you can use lavender oil to get rid of small latex stains. Put between five and seven drops of lavender on the stain. Wait for the lavender to work its magic, which should take around half an hour. At this stage, you can scrub off the stain with spoon. [19] X Research source"
    },
    {
      "title": "Scrape off excess paint with a butter knife.",
      "content": "Scrape off excess paint with a butter knife. Although a knife could easily damage thinner and more delicate fabrics, you can use a butter knife to scrape latex off denim and thicker fabrics. Put the clothing on a sturdy work surface, such as an ironing board. Pointing the knife away from you, apply pressure to the fabric and scrape off the blobs of latex paint. [20] X Research source"
    },
    {
      "title": "Apply duct tape to the stained fabric.",
      "content": "Apply duct tape to the stained fabric. As long as the paint is dry, you can use duct tape to remove excess latex paint. Cut a piece of duct tape. Place it over the latex paint and press it firmly against the fabric. Finally, pull off the duct tape to remove bits of latex paint! [21] X Research source"
    },
    {
      "title": "Use a disposable razor to remove latex stains from thicker fabrics.",
      "content": "Use a disposable razor to remove latex stains from thicker fabrics. Although a disposable razor will damage cotton, silk, and other sensitive fabrics, you can use it to remove latex stains from wool and denim. Place the clothing on a sturdy surface, such as an ironing board. Use the razor to scrape the latex paint off the fabric. It is best to use an old or dull razor, since a new one could damage your clothing."
    },
    {
      "title": "Try scratching the paint off with an emery board.",
      "content": "Try scratching the paint off with an emery board. If you're working with a thick fabric and a small amount of paint, you may be able to scratch or rub it off with the aid of a basic emery board or fine grit sandpaper. Carefully scrub at the paint, using your nail to scratch out any ingrained paint. Finish with a wash and dry cycle. Be gentle as your scrub, otherwise you may accidentally scratch a hole into the fabric along with removing the paint."
    }
  ]
}