{
  "url": "https://www.wikihow.com/Repeat-a-Song-on-SoundCloud-on-Android",
  "title": "How to Loop a Song on the Soundcloud Mobile App",
  "steps": [
    {
      "title": "Open the Soundcloud app and select your desired song.",
      "content": "Open the Soundcloud app and select your desired song. The Soundcloud app icon is orange and features a white cloud logo. Once open, use the search function or navigate to your library (using the navigation bar at the bottom of your screen) and select the song, album, or playlist you’d like to repeat to play it. The Soundcloud app is free on the Google Play Store. Find it by searching for Soundcloud in the Play Store search bar. When you first open the app, you will need to sign in with your Soundcloud account or sign up for a new account with an email address or Google account. Unfortunately, it’s not possible to loop a song via the website while browsing on mobile."
    },
    {
      "title": "Tap on the player bar on the bottom of the screen.",
      "content": "Tap on the player bar on the bottom of the screen. After tapping on your desired song, album, or playlist, it will begin to play automatically. A horizontal song player will appear near the bottom of the screen with the song title and a Play/Pause button. Tap on this player to open the full-screen view for the music player."
    },
    {
      "title": "Tap on the “Next Up” button at the bottom of the screen.",
      "content": "Tap on the “Next Up” button at the bottom of the screen. The \"Next Up\" or queue button looks like three parallel white lines with a play icon. Tapping on this will show you which songs are playing next and reveal additional playback controls. [1] X Research source"
    },
    {
      "title": "Tap once on the oval icon with an arrow at the top right of the screen.",
      "content": "Tap once on the oval icon with an arrow at the top right of the screen. Tapping this icon once will highlight it and add a “1” to the icon, which means only the current song will repeat. Tapping it again removes the “1” but keep the icon highlighted, indicating that the entire album or playlist will repeat. Tap the icon a third time to turn off the repeat function. Next to the “Repeat” icon, you’ll also notice the “Shuffle” icon, featuring 2 overlapping arrows. This plays the selected album or playlist in a random order."
    },
    {
      "title": "Navigate and sign in to Soundcloud on a browser.",
      "content": "Navigate and sign in to Soundcloud on a browser. Open your browser and proceed to the Soundcloud website . Once there, sign in using your Soundcloud profile, Google account, or Facebook account. Or, make a new Soundcloud account using the on-screen prompts."
    },
    {
      "title": "Navigate to and select your song of choice.",
      "content": "Navigate to and select your song of choice. Use the search bar or the “Feed” or “Library” tabs at the top of the web page to browse music. Click on a song, album, or playlist to select it, then click the play button to play it."
    },
    {
      "title": "Press the “Repeat” icon in the bottom progress bar.",
      "content": "Press the “Repeat” icon in the bottom progress bar. Once your song, album, or playlist is playing, a progress bar will appear on the bottom of your screen with playback controls. Click the “Repeat” icon, which features horizontal lines overlaid with a “play” arrow. Clicking this once repeats only the current song, while clicking it twice repeats the entire album or playlist. Click the “Repeat” icon a third time to turn off repeat. Next to the “Repeat” icon is the “Shuffle” icon with 2 overlapping arrows. Clicking this will play the album or playlist in random order."
    },
    {
      "title": "Open your Soundcloud app and select “Library” on the bottom bar.",
      "content": "Open your Soundcloud app and select “Library” on the bottom bar. The “Library” icon looks like 3 vertical rectangles that look a bit like books."
    },
    {
      "title": "Select “Playlists,” then “Create playlist.”",
      "content": "Select “Playlists,” then “Create playlist.” In your “Library” menu, you’ll see a number of navigation options in a list. From the list, select “Playlists.” Then on the next screen, tap “Create Playlist.” After, enter the playlist’s name in the popup window. If you like, toggle the “Public” option to make your playlist hidden from other users."
    },
    {
      "title": "Add songs to your playlist from the menu or individually.",
      "content": "Add songs to your playlist from the menu or individually. Use the search function or “Library” menu to find an individual song or album, then tap the 3 vertical dots next to it to open a popup menu. Select “Add to Playlist” from the options. Or, after creating your playlist, a number of suggested songs will appear on the playlist’s page. Select the “+” icon to add them to your playlist. After selecting \"Add to Playlist,\" select the name of your playlist in the popup menu to add the song or album to that playlist."
    }
  ]
}