{
  "url": "https://www.wikihow.com/Moon-Lesbian",
  "title": "Everything You Need to Know About Moon and Sun Lesbians",
  "steps": [
    {
      "title": "A moon lesbian may identify with traits associated with the moon.",
      "content": "A moon lesbian may identify with traits associated with the moon. One of the most common definitions of “moon lesbian” is a lesbian who has a more feminine, reserved, and/or mysterious personality and aesthetic. These are traits that are also associated with the moon and nighttime. Moon lesbians may also be drawn to cool, dark tones and moon imagery."
    },
    {
      "title": "The term “moon lesbian” can also refer to a closeted lesbian.",
      "content": "The term “moon lesbian” can also refer to a closeted lesbian. In some cases, people use the term “moon lesbian” to refer to closeted lesbians, or lesbians who are not publicly out about their sexuality. While the exact reason for this connection is unknown, it could be because the moon is often associated with secrets and mystery. [1] X Research source"
    },
    {
      "title": "A moon lesbian may be a femme lesbian or a feminine non-binary person.",
      "content": "A moon lesbian may be a femme lesbian or a feminine non-binary person. The term “moon lesbian” is also sometimes used to refer to lesbians who embrace their feminine side. This can be femme cisgender lesbians or feminine non-binary individuals who are attracted to women. Again, there is no definitive reason for this association, but it could be because the moon has historically symbolized femininity. [2] X Research source"
    },
    {
      "title": "There isn’t a strict definition of what a moon lesbian is.",
      "content": "There isn’t a strict definition of what a moon lesbian is. While there are common associations, there isn’t a universally agreed-upon definition of what a moon lesbian is. It is ultimately a way for lesbians to express their identity, and they may identify with the term in whatever way best reflects their preferences. The term “moon lesbian” isn’t a formal identity in the LGBTQ+ community. Instead, it’s a label some lesbians use for fun and self-identification, allowing them to describe their preferences or aesthetic alignment."
    },
    {
      "title": "The moon lesbian flag is a purple-toned variation of the standard lesbian flag.",
      "content": "The moon lesbian flag is a purple-toned variation of the standard lesbian flag. The standard lesbian flag, or the sunset lesbian flag, consists of seven horizontal stripes in shades of orange and pink. The moon lesbian flag is based on the sunset lesbian flag, but the colors have been changed to match the aesthetic of the moon or the night sky. In descending order, the moon lesbian flag colors are dark purple, purple, medium lavender, off-white, light pinkish-purple, muted pastel pink, and dark pink. [3] X Research source"
    },
    {
      "title": "The term “moon lesbian” may have originated on Tumblr.",
      "content": "The term “moon lesbian” may have originated on Tumblr. It’s hard to pinpoint exactly where the term “moon lesbian” came from or who designed the moon lesbian flag. However, the term mainly seems to exist in online spaces, like Tumblr and TikTok, so it’s likely that it originated on one of these sites."
    },
    {
      "title": "A sun lesbian is essentially the opposite of a moon lesbian.",
      "content": "A sun lesbian is essentially the opposite of a moon lesbian. Just like with moon lesbians, there isn’t one definitive definition of what a sun lesbian is. The term may refer to individuals who appreciate the sun’s aesthetic, gravitate toward warm colors and cheerful imagery, and have bright and outgoing personalities. The term is also sometimes used to describe butch lesbians or lesbians who are more masculine. Like moon lesbian, sun lesbian isn’t a formal identity in the LGBTQ+ community. Instead, it’s a way for lesbians to express themselves, their preferences, and their aesthetics."
    },
    {
      "title": "The sun lesbian flag is an orange-toned variation of the standard lesbian flag.",
      "content": "The sun lesbian flag is an orange-toned variation of the standard lesbian flag. Like the moon lesbian flag, the sun lesbian flag is based on the standard lesbian flag, with the colors changed to match the aesthetic of the sun. From top to bottom, the colors are pinkish-red, red-orange, orange, off-white, yellow-orange, light brick red, and brick red. [4] X Research source"
    },
    {
      "title": "Most people aren’t aware of the term.",
      "content": "Most people aren’t aware of the term. The term “moon lesbian” exists mainly in niche online spaces, so many lesbians and other members of the LGBTQ+ community are unfamiliar with it. Of those who are aware of it, some believe the moon lesbian flag is a valid form of self-expression, while others don’t see the point of using it. Some people have claimed that the creator of the sun and moon lesbian flags is a TERF (trans-exclusionary radical feminist), so the flags shouldn’t be used. However, there is little to no evidence of this, as there doesn’t seem to be a certain creator attributed to the flags or the terms themselves."
    },
    {
      "title": "Lesbian pride flag",
      "content": "Lesbian pride flag Today, the most widely recognized lesbian flag is the sunset lesbian flag , created by non-binary lesbian Emily Gwen in 2018. The flag features seven horizontal stripes in a gradient from deep orange to dark pink, with a white stripe in the middle. From top to bottom, here’s what each stripe represents: [5] X Research source Dark orange: Gender nonconformity Orange: Independence Light orange: Community White: Unique relationships to womanhood Pink: Serenity and peace Dusty pink: Love and sex Dark rose: Femininity"
    },
    {
      "title": "Non-binary lesbian flag",
      "content": "Non-binary lesbian flag A non-binary lesbian is someone who identifies as non-binary or genderqueer and is attracted to women or feminine-aligned individuals in a sapphic way . While there have been many non-binary lesbian flags over the years, one of the most recognizable was designed by a person known as Fruitindividual in 2021. The top half of the flag is inspired by the lesbian flag, while the bottom half is inspired by the non-binary flag, highlighting both identities. [6] X Research source From top to bottom, the flag’s colors are dark orange, orange, light orange, white, yellow, purple, and black."
    },
    {
      "title": "Butch lesbian flag",
      "content": "Butch lesbian flag While there are now a few different butch lesbian flags, the first known butch pride flag was created in 2016 by Tumblr user dorian—rutherford. Like many lesbian flags, the butch flag consists of seven horizontal stripes in different colors. From top to bottom, the colors are navy blue, gray-blue, gray, white, light purple, purple, and dark purple. [7] X Research source The creator never confirmed what the colors represent, but many have speculated that blue represents masculinity, purple represents lesbian and woman-identified individuals, and white represents people across the gender and sexuality spectrums more broadly."
    },
    {
      "title": "Stud/Black lesbian flag",
      "content": "Stud/Black lesbian flag Created by Tumblr user afroemostar, the Stud/Black lesbian pride flag was designed to highlight and celebrate Black lesbians as completely independent from the white lesbian experience. The flag consists of seven horizontal stripes in gradient brown tones meant to resemble the range of skin tones found within the Black community. [8] X Research source"
    }
  ]
}