{
  "url": "https://www.wikihow.com/Numb-Skin",
  "title": "How to Numb Skin",
  "steps": [
    {
      "title": "Use an ice pack.",
      "content": "Use an ice pack. When you cool your skin, it constricts the blood vessels. This reduces the blood flow to the area and can relieve swelling, irritation, and muscle spasms. This is particularly good for soothing bruises and minor injuries. [1] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source If you don’t have an ice pack already prepared in the freezer, you can use a bag of ice cubes or frozen vegetables. Always wrap the ice pack in a towel instead of putting it directly on your skin. This will help prevent frostbite. [2] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source After 20 minutes, remove the ice pack from your skin and let your skin warm up. After 10 minutes you can put it on again if you need to."
    },
    {
      "title": "Numb small areas with topical anesthetic creams.",
      "content": "Numb small areas with topical anesthetic creams. These creams are often available over-the-counter and can soothe sunburns, minor burns, insect bites, stings, and minor abrasions. Always consult your doctor if you are pregnant, breastfeeding, treating a child or a senior citizen, or are taking other medications, herbal remedies, or supplements that could interact. Read and follow the instructions on the packaging. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can usually buy these products at your local pharmacy as sprays, ointments, creams, patches, and pre-prepared bandages. The medications may contain: benzocaine, benzocaine and methol, butamben, dibucaine, lidocaine, pramoxine, pramoxine and methol, tetracaine, or tetracaine and methol. If you are unsure about the dosages or how often to apply it, consult your doctor. Your doctor will be able to make recommendations based on your particular condition and medical history. Check the expiration dates. Do not use expired medications. Stop using these medications and consult your doctor if you see no improvement after a week, the area gets infected, develops a rash, or starts burning or stinging. Symptoms of an overdose include blurred vision, confusion, seizures, dizziness, feeling too hot, too cold, or numb, headache, sweating, ringing in your ears, irregular or slow heartbeat, difficulty breathing, sleepiness. If you show these symptoms, go to the doctor immediately or call an ambulance."
    },
    {
      "title": "Take oral painkillers.",
      "content": "Take oral painkillers. Non-steroidal anti-inflammatory drugs can relieve pain from arthritis, muscle pain, tooth pain, fever, gout, back pain, headaches, and menstrual cramps. These medications can generally be purchased over-the-counter at local pharmacies. Many can provide relief within a few hours. Do not use them for more than a few days without consulting your doctor. Always consult your doctor before using these medications if you are pregnant, breastfeeding, treating a child, or on other medications, herbal remedies, or supplements. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Common medications include: Aspirin (Anacin, Bayer, Excedrin), ketoprofen (Orudis KT), ibuprofen (Motrin, Advil, Nuprin), naproxen sodium (Aleve). Aspirin should never be given to children or teenagers because it is associated with Reye’s syndrome. Do not take these medications without first consulting a doctor if you have high blood pressure, diabetes, kidney disease, liver disease, allergies to these medications, ulcers, bleeding problems, high alcohol intake, heart problems, asthma, or are on other medications that may interact such as warfarin, lithium, heart medications, arthritis medications, vitamins, and others. Common side effects include gas, bloating, heartburn, stomach discomfort, vomiting, diarrhea, and constipation. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you have these or any other side effects, contact your doctor immediately."
    },
    {
      "title": "Ask your doctor about cooling sprays.",
      "content": "Ask your doctor about cooling sprays. Ethyl chloride (Cryogesic) can sprayed onto skin right before a painful procedure. The liquid is sprayed onto your skin, which will then feel cold as it evaporates. Your skin will warm up within a few minutes. The spray is only effective as pain relief for as long as it takes your skin to warm up. This may be done immediately before a child receives a medical treatment that involves using a needle. It can be a good substitute for other topical anesthetics if the child is allergic to them. Do not apply the cooling spray more often or in greater amounts than recommended by the doctor. It can cause frostbite. [6] X Research source Always read and follow the instructions on the packaging. Consult a doctor before applying it to a child or if you are pregnant or breastfeeding. Keep it out of your eyes, nose, mouth, and open wounds."
    },
    {
      "title": "Consult your doctor about topical creams.",
      "content": "Consult your doctor about topical creams. If your doctor expects that you will need pain relief from a procedure you will be undergoing, you may be given an anesthetic to apply shortly before the procedure. Your doctor may ask you to cover the medication with a bandage while it is absorbed into your skin. Do not apply it to your nose, mouth, ears, eyes, genitals, or broken skin. Two frequently used types include: Tetracaine (Ametop Gel). This gel is smeared on the skin a half hour to 45 minutes before the procedure for which you need to be numbed. You can remove it right before the procedure. You will be numb for up to six hours. It may make your skin red where you applied it. Lidocaine and prilocaine(EMLA cream). You can apply this an hour before the procedure and then remove it right before the procedure. It will be effective for up to two hours. A side effect is that it may make your skin look white."
    },
    {
      "title": "Discuss other types of anesthesia with your doctor.",
      "content": "Discuss other types of anesthesia with your doctor. If your doctor thinks that local, topical anesthetics might not be sufficient, he or she may suggest numbing larger areas of your body. This is commonly done for procedures which may go below the skin, childbirth, or surgeries. Possibilities include: A regional anaesthetic. Regional anesthetics do not put you to sleep, but they numb a larger area of your body than local anesthetics. [7] X Research source You may receive these as local injections. When a woman receives epidural anesthesia during childbirth, this is a regional anesthetic which numbs the lower half of her body. General anesthesia. This is done for many surgical procedures. You may receive the anesthetic either as an intravenous medication or inhale it as a gas. Side effects can include: nausea, vomiting, dry or sore throat, chills, tiredness. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}