{
  "url": "https://www.wikihow.com/Open-OGG-Files-on-iPhone-or-iPad",
  "title": "How to Open OGG Files on iPhone or iPad",
  "steps": [
    {
      "title": "Open the App Store .",
      "content": "Open the App Store . The App Store is the blue icon that has a white capital \"A\". You can open the App Store by tapping the icon on your homescreen."
    },
    {
      "title": "Tap the Search tab.",
      "content": "Tap the Search tab. The Search tab is in the lower-right corner. It has an icon that resembles a magnifying glass. This displays a page with a search bar in the middle."
    },
    {
      "title": "Type VLC in the search bar.",
      "content": "Type VLC in the search bar. The search bar is the grey bar in the center of the screen. Typing in the search bar displays a list of search results that match your text"
    },
    {
      "title": "Tap VLC.",
      "content": "Tap VLC . You should see VLC Media Player or VLC for Mobile appear in the list of search results. Tap it to display VLC and similar apps in the App Store."
    },
    {
      "title": "Tap GET next to VLC for Mobile.",
      "content": "Tap GET next to VLC for Mobile. This downloads and installs VLC on your iPhone or iPad. VLC for Mobile has an orange icon with an image that resembles a traffic cone."
    },
    {
      "title": "Open the Files app.",
      "content": "Open the Files app. The Files app has an icon that resembles a blue folder. It's in the Dock at the bottom of your homescreen. Press the circular button below your screen to return to the homescreen."
    },
    {
      "title": "Tap the Browse tab.",
      "content": "Tap the Browse tab. The Browse tab is the second tab at the bottom of the screen. It's next to an icon that resembles a blue folder. This displays the Locations menu in a bar to the left."
    },
    {
      "title": "Tap the Location the OGG file(s) are saved to.",
      "content": "Tap the Location the OGG file(s) are saved to. If the files are saved to your iPhone or iPad storage, tap On My iPhone/iPad . If it is saved to your iCloud storage, tap iCloud Drive . You can also tap another cloud storage service, such as Google Drive, or Dropbox. If you do not see the cloud drive in the Locations menu, make sure you have downloaded the cloud service app from the App Store and that you are signed in to the app. Then tap Edit above the Locations menu, and tap the toggle switch next to the cloud storage."
    },
    {
      "title": "Navigate to the OGG file(s).",
      "content": "Navigate to the OGG file(s). If the files are saved to a specific folder, tap the folder to view it's contents. Otherwise, scroll up and down and view all the files on your drive or storage."
    },
    {
      "title": "Tap Select.",
      "content": "Tap Select . The Select button is in the upper-right corner of the Files app. This displays a radial button to the left of all the files in the folder or drive."
    },
    {
      "title": "Tap the radial button next to the OGG file(s).",
      "content": "Tap the radial button next to the OGG file(s). This selects the files. Selected files display a blue checkmark in the radial menu to the left. Select all OGG files you wish to open."
    },
    {
      "title": "Tap Share.",
      "content": "Tap Share . The Share button is the first button in the lower-left corner. This opens the Share menu, which displays all the apps you can use to open the file."
    },
    {
      "title": "Tap Open in VLC.",
      "content": "Tap Open in VLC . The second bar from the bottom of the Share menu displays apps you can open the files in. Swipe left on this line to view all apps. Tap the VLC icon to open the files in VLC. It says Open in VLC below the icon."
    },
    {
      "title": "Tap the file you want to play.",
      "content": "Tap the file you want to play. When you open the files in VLC, they display in the VLC files menu. Tap the file you want to play. The Playback controls are at the bottom of the screen, and the timeline bar is at the top of the screen."
    },
    {
      "title": "Open the App Store .",
      "content": "Open the App Store . The App Store is the blue icon that has a white capital \"A\". You can open the App Store by tapping the icon on your homescreen."
    },
    {
      "title": "Tap the Search tab.",
      "content": "Tap the Search tab. The Search tab is in the lower-right corner. It has an icon that resembles a magnifying glass. This displays a page with a search bar in the middle."
    },
    {
      "title": "Type OPlayer in the search bar.",
      "content": "Type OPlayer in the search bar. The search bar is the grey bar in the center of the screen. Typing in the search bar displays a list of search results that match your text."
    },
    {
      "title": "Tap OPlayer lite.",
      "content": "Tap OPlayer lite . As soon as OPlayer HD lite appears in the list of search results, tap it to display OPlayer HD lite and similar apps in the App Store."
    },
    {
      "title": "Tap GET next to OPlayer Lite.",
      "content": "Tap GET next to OPlayer Lite. This downloads and installs OPlayer Lite. OPlayer has a black icon with a green 3/4 circle and a green Play triangle in the center. There are a few different versions of OPlayer. OPlayer Lite and OPlayer HD Lite are the versions that don't have a purchase price. OPlayer Lite is designed for iPhone, and OPlayer HD Lite is designed for iPad."
    },
    {
      "title": "Open the Files app.",
      "content": "Open the Files app. The Files app has an icon with a blue folder. It's in the Dock at the bottom of your homescreen. Press the circular button below your screen to return to your homescreen. The Files app allows you to browse and open files on your iPhone."
    },
    {
      "title": "Tap the Browse tab.",
      "content": "Tap the Browse tab. The Browse tab is the second tab at the bottom of the screen. This displays the Locations menu at the bottom of the screen."
    },
    {
      "title": "Tap the location the file is saved to.",
      "content": "Tap the location the file is saved to. If the file is saved to your iPhone storage, tap On my iPhone . If it is saved to your iCloud storage, tap iCloud Drive . You can also tap other cloud drives, such as Google Drive, or Dropbox. If you do not see the cloud drive in the Locations menu, make sure you have downloaded the cloud service app from the App Store and that you are signed in to the app. Then tap Edit above the Locations menu, and tap the toggle switch next to the cloud storage."
    },
    {
      "title": "Navigate to the OGG file.",
      "content": "Navigate to the OGG file. If the OGG file is saved to a specific folder, tap that folder to view it's contents. Otherwise, scroll up and down to view all the files in the storage or drive."
    },
    {
      "title": "Tap Select.",
      "content": "Tap Select . The Select button is in the upper-right corner. This displays a radial button to the left of all files in the folder or drive."
    },
    {
      "title": "Tap the radial button next to the OGG file(s).",
      "content": "Tap the radial button next to the OGG file(s). This displays a blue checkmark icon to the left of the file(s). Tap the radial button next to all OGG you have saved to the folder or drive."
    },
    {
      "title": "Tap Move.",
      "content": "Tap Move . It's the third tab at the bottom of the screen. This displays all the locations on your iPhone storage and asks you to select a new location to move the files too. To play OGG files in OPlayer, they must be saved to the OPlayer folder in your iPhone storage."
    },
    {
      "title": "Tap On my iPhone.",
      "content": "Tap On my iPhone . This displays a list of all the folders in your iPhone storage."
    },
    {
      "title": "Tap OPlayer Lite.",
      "content": "Tap OPlayer Lite . This folder was created when you downloaded and installed OPlayer Lite on your iPhone. Tap the folder to select it."
    },
    {
      "title": "Tap Move.",
      "content": "Tap Move . It's in the upper-right corner of the screen. This copies the selected files from their previous location to the OPlayer folder."
    },
    {
      "title": "Open OPlayer.",
      "content": "Open OPlayer. You can open OPlayer by tapping the icon on your homescreen, or by tapping OPEN next to OPlayer in the App Store. Press the circular button below your screen to return to your homescreen."
    },
    {
      "title": "Tap My Documents.",
      "content": "Tap My Documents . It's the first option in the menu that displays when you open OPlayer. This displays all the files saved to the OPlayer folder on your iPhone."
    },
    {
      "title": "Tap the OGG file.",
      "content": "Tap the OGG file. This plays the audio file in OPlayer. The playback controls are at the bottom of the screen. The timeline bar is at the top of the player. There are more options on the left and right sides of the app."
    },
    {
      "title": "Open the App Store .",
      "content": "Open the App Store . The App Store is the blue icon that has a white capital \"A\". You can open the App Store by tapping the icon on your homescreen."
    },
    {
      "title": "Tap the Search tab.",
      "content": "Tap the Search tab. The Search tab is in the lower-right corner. It has an icon that resembles a magnifying glass. This displays a page with a search bar in the middle."
    },
    {
      "title": "Type OPlayer HD in the search bar.",
      "content": "Type OPlayer HD in the search bar. The search bar is the grey bar in the center of the screen. Typing in the search bar displays a list of search results that match your text."
    },
    {
      "title": "Tap OPlayer HD lite.",
      "content": "Tap OPlayer HD lite . As soon as OPlayer HD lite appears in the list of search results, tap it to display OPlayer HD lite and similar apps in the App Store."
    },
    {
      "title": "Tap GET next to OPlayer HD Lite.",
      "content": "Tap GET next to OPlayer HD Lite. This downloads and installs OPlayer Lite. OPlayer has a black icon with a green 3/4 circle and a green Play triangle in the center. There are a few different versions of OPlayer. OPlayer Lite and OPlayer HD Lite are the versions that don't have a purchase price. OPlayer Lite is designed for iPhone, and OPlayer HD Lite is designed for iPad."
    },
    {
      "title": "Open OPlayer HD Lite.",
      "content": "Open OPlayer HD Lite. After OPlayer HD Lite is finished downloading, you can open it by tapping it's icon on your homescreen, or by tapping OPEN next to it in the App Store."
    },
    {
      "title": "Tap the Folder icon.",
      "content": "Tap the Folder icon. The Folder icon is the first option in the black bar to the left. This displays a list of file servers you can use to browse files on your iPhone or iPad."
    },
    {
      "title": "Tap Files.",
      "content": "Tap Files . It's the third option in the File Servers menu that appears when you tap the Folder icon in OPlayer HD. This opens the Files app, which you can use to browse and open Files on your iPad."
    },
    {
      "title": "Tap the Browse tab.",
      "content": "Tap the Browse tab. It's the second tab at the bottom of the screen. It's next to an icon that resembles a blue folder. This displays the Locations menu in a bar to the left."
    },
    {
      "title": "Tap the location the OGG file is saved to.",
      "content": "Tap the location the OGG file is saved to. If the file is saved to your iPad storage, tap On my iPad . If the file is saved to your iCloud storage, tap iCloud Drive . If it is saved to a different cloud storage, such as Google Drive or Dropbox, you can tap that location as well. If the Cloud storage drive the file is saved to is not displaying in the Locations menu, make sure you have downloaded the Cloud service app from the App Store and you are signed in to the app. Then tap Edit above the Locations menu, and tap the toggle switch next to all locations you want to appear in the Locations menu."
    },
    {
      "title": "Navigate to the OGG file.",
      "content": "Navigate to the OGG file. If the file is saved to a specific folder, tap that folder to view it's contents. Otherwise, scroll up and down to view all the files in the drive or iPad storage."
    },
    {
      "title": "Tap the OGG file.",
      "content": "Tap the OGG file. This opens the OGG file in OPlayer HD Lite. The Playback controls are to the left. The Skip buttons are to the right. The timeline bar is at the bottom of the screen along with some other options. To open more than one file, tap Select in the upper-right corner of the Files app. Then tap all the files you want to open and tap Open in the upper-right corner."
    }
  ]
}