{
  "url": "https://www.wikihow.com/Potty-Train-Your-Child",
  "title": "How to Potty Train Your Child",
  "steps": [
    {
      "title": "Know when your child is ready.",
      "content": "Know when your child is ready. It is very important that your child is developmentally ready to learn how to use the potty, as this will make the process so much easier and faster. [1] X Expert Source Sylvia Rath Parenting Specialist Expert Interview. 19 May 2021. When a child is ready to be potty trained will vary from child to child, and can be any age from 18 to 36 months. In general, girls tend to be toilet trained slightly earlier than boys—the average age for girls is 29 months, whereas for boys it's 31. You can tell if your child is ready to potty train by looking out for the following signs: Showing an interest in the bathroom and how other people use it. Possessing good motor skills, including the ability to walk to the bathroom, climbing the steps and pulling down their pants. Using language skills, such as being able to understand simple instructions and follow them. Having predictable bowel movements. Understanding—through words or facial expression—of when they need to urinate or have a bowel movement. Wanting to please parents and act like a grown up. Knowing what the words wet and dry, clean and dirty, and up and down mean. Keeping their diaper dry for two hours and waking up dry from a nap occasionally. Wanting to get out of diapers and into underwear or training pants, and asking to get out of dirty diapers. Becoming more interested in being clean and dry. Noticing sticky fingers, dirty feet, dirty diapers, etc. You should never push your child to potty train if they are not ready—they will only resist you and the potty training process will be frustrating and time-consuming. Give your child another month or 2 and you will find it much easier. It has also been proven that one of the most effective ways to potty train is to start the process way before the physical process starts with books, songs, games, and activities to prepare them for the general idea."
    },
    {
      "title": "Understand that the potty training process will take time.",
      "content": "Understand that the potty training process will take time. [2] X Expert Source Sylvia Rath Parenting Specialist Expert Interview. 19 May 2021. The number one thing you need in order to successfully potty train your child is patience! Potty training is a process, it does not happen overnight. You and your child will need to work on it together and overcome any accidents and setbacks. Although you hear of some parents who potty train their child over the course of a single weekend, it is completely normal for the training process to take up to 6 months. Try to be as consistently upbeat and encouraging with your child as possible and deal with any accidents calmly. Remember that no typical child is going to graduate high school in diapers—they will get there! You should also be aware that although your child might be fully potty trained during the day, it is common for children to continue wetting the bed at night until the age of 5. They should be able to stay completely dry by the age of 6, but until that time be prepared to use pull-ups and plastic sheets at night. [3] X Research source"
    },
    {
      "title": "Get the right equipment.",
      "content": "Get the right equipment. A training potty is the easiest and least intimidating option for a child new to potty training. You can get all sorts of cute potties, some in the shape of your child's favorite cartoon characters. These are a good choice as you want your child to feel as comfortable as possible with the potty and enthusiastic about using it. You should also consider getting a potty with a removable seat, which you can place on the toilet once your child is ready. If you decide to use the toilet from the beginning, make sure to get a step stool for your child so their feet feel firm and secure while sitting on it. This will make them feel more stable and help eliminate the fear of falling in. Consider placing the potty in the playroom or living area to begin with. This will help your child to get comfortable with the potty and less intimidated by the prospect of using it. They may also be more inclined to use it if it's within easy reach. To get your child interested in potty training and motivate them to use the potty, get a few books about potty training and look for songs or shows about the topic. You can also purchase a “drink-and-wet” doll."
    },
    {
      "title": "Choose the right time.",
      "content": "Choose the right time. Choosing the right time to potty train can make a huge difference in your chance of success. Avoid trying to potty train if your child has recently gone through a period of change—such as the arrival of a new sibling, moving to a new house or starting at a new daycare—as these things can be stressful for a child and potty training will only add to that stress. Choose a period when you can spend long periods of time with your child at home so they will feel comfortable and secure with their environment and always have you there for encouragement and support. Many parents choose to potty train their children over the summer months—not only because they tend to have more free time to spend with their children, but also because their child will be wearing less layers of clothing, which makes getting to the potty on time much easier for the child."
    },
    {
      "title": "Set a schedule.",
      "content": "Set a schedule. Setting a schedule can help turn potty time into a routine, which will help your child adjust to their new responsibility and help them to remember to go all by themselves. To start off, try picking 2-3 times a day when you will put your child on the potty and let them sit there for a few minutes. If they use it, that's great, but if not don't worry about. You just need your child to get used to the feel of it. To encourage your child to go, try to pick times when they are most likely to need the bathroom, like first thing in the morning, after mealtimes, and before bed. You can also give your child extra liquids with their meals if you like, as this will help to get their digestive system going. Make potty time part of your child's bedtime routine. For instance, they can put their pajamas on, wash their face, brush their teeth, and go to the potty. They'll soon remember to go all by themselves."
    },
    {
      "title": "Introduce your child to the potty.",
      "content": "Introduce your child to the potty. Let your child get comfortable with it, so they understand that the potty is not an intimidating or scary thing at all. Put the potty in their play area, where they can sit on it fully clothed, while reading a book or playing with toys. Once they've grown accustomed to or even fond of the potty, you can move it to the bathroom."
    },
    {
      "title": "Show your child how to use it.",
      "content": "Show your child how to use it. Your child next needs to understand what the potty is actually for . To explain it, try taking your child's dirty nappy and popping its contents into the potty. Tell them the potty is where the \"poop\" and \"pee-pee\" goes. Alternatively, you can put the contents of the nappy in the toilet and let them wave goodbye as it flushes away. You can also demonstrate how the toilet is used by bringing the child into the bathroom with you when you need to go. Have them sit on the potty as you sit on the toilet and show them how it's done. With any luck, this will encourage them to use the potty like a \"big boy\" or \"big girl.\" If possible, little boys might be better off going to the bathroom with their dad, grandpa, uncle or other male adult. If possible, little girls might be better off going to the bathroom with their mom, grandma, aunt or other female adult. However, you should forget about teaching boys to pee standing up just yet, as this can be confusing for them (not to mention messy). For now, have them sit on the potty for number ones as well as number twos!"
    },
    {
      "title": "Let your child sit on the potty for at least 15 minutes a day.",
      "content": "Let your child sit on the potty for at least 15 minutes a day. Let your child get accustomed to the potty by letting them sit on it for five minutes three times a day. Encourage them to go, but don't worry if they don't. Praise them for trying and let them know that they can try again later. If they're impatient to get off, try reaching into that potty basket for some entertainment. To create a potty basket or box, find a small box or basket that is at least 1 foot (0.30 m) long, and 6 inches (15 cm) wide. Borrow 2-3 potty books from your local library to place in the potty basket/box. An electronic device with potty apps, movies, videos, and songs on it will also entertain your child, although the use of technology like this should be limited to one hour a day. Make sure that your child's drink-and-wet doll with a cup and possibly a potty of his/her own is in the basket: your child can make the doll \"go\" in the toilet and can make them feel proud of \"teaching\" their doll to use the toilet. A few extra pairs of underwear or training pants is helpful in case of accidents and a pack of flushable wipes is great for your child to wipe better and helps give a better clean after accidents. A sippy cup of water will help your child go and a coloring picture on a clipboard with crayons attached makes for even more entertainment. Of course, paper towels are helpful for cleaning up messes, and potty flashcards can be lifesavers. Never force your child to sit on the potty if they don't want to—you'll only cause further resistance which can upset the whole training process."
    },
    {
      "title": "Use the right toilet-related words.",
      "content": "Use the right toilet-related words. Try not to confuse your child by using vague or obscure words to describe the act of using the toilet or the names of particular body parts. Use easy, straightforward, child-friendly words like \"pee,\" \"poop,\" and \"potty\" when speaking to your child. Never use words like \"dirty\" or \"disgusting\" to describe natural bodily processes, as this can cause your child to feel ashamed or embarrassed about their actions, which can negatively impact the potty training process. If a child feels anxious or embarrassed about using the potty, they can start to hold everything in, which can lead to health problems such as constipation and urinary tract infections. For this reason, it is very important that a child feels comfortable with using the potty. [4] X Research source Being open with your child will give them confidence and let them know that they should feel proud of themselves for using the potty correctly."
    },
    {
      "title": "Stay with your child while they use the potty.",
      "content": "Stay with your child while they use the potty. Children can feel extremely anxious about using the potty for a variety of reasons—if they are using the toilet they can be afraid of falling in or scared of the flushing noise that the toilet makes. Other children may see their bowel movements as part of themselves, which they feel they are losing by using the potty. For this reason, it is important that you stay with your child at all times while they are on the potty, at least at first. Smile at your child, give plenty of praise, and use a calm, soothing tone of voice at all times. You can also try singing songs or playing games with your child while they're on the potty, so they come to see potty-time as a fun activity, rather than something to be feared."
    },
    {
      "title": "Read potty-themed picture books.",
      "content": "Read potty-themed picture books. [5] X Expert Source Sylvia Rath Parenting Specialist Expert Interview. 19 May 2021. Many parents have found books dealing with the subject of potty training to be an extremely helpful tool in teaching their child how and why they should use the potty. These books are often humorous and encouraging, with engaging pictures which children can relate to. Get your child involved in the reading process by asking questions and getting your child to point out certain items in the pictures. Then once you've finished reading, ask your child if they'd like to try using their potty, just like the little boy or girl in the book. Some popular potty-related books include \"Once Upon A Potty\" by Alona Frankel, \"Everyone Poops\" by Taro Gomi, and \"I Want My Potty\" by Tony Ross. [6] X Research source"
    },
    {
      "title": "Learn your child's \"need-to-go\" signals.",
      "content": "Learn your child's \"need-to-go\" signals. If you can learn to read the signs that your child needs to use the bathroom, then you can get them to the bathroom quickly and encourage them to use the potty instead of going in their diaper or underwear. Common signals that a child needs to use the bathroom include: a change or pause in activity; squatting; clutching at their diaper; grunting; turning red in the face. You can help your child to recognize these signs themselves by asking them \"Do you need to go potty?\" or \"Do you need to pee/poop?\" as soon as you notice the warning signs. Encourage your child to tell you whenever they feel like they need to go. Be aware that some children will be reluctant to stop what they're doing, especially if they are playing and having fun, just to use the potty. You will need to encourage them and give them lots of praise to make it seem worth their while!"
    },
    {
      "title": "Let your child go nappy-free for an hour or two a day.",
      "content": "Let your child go nappy-free for an hour or two a day. Many parents recommend the technique of removing a child's diaper and letting them run around the house naked for a couple of hours a day. [7] X Expert Source Sylvia Rath Parenting Specialist Expert Interview. 19 May 2021. They will enjoy the feeling, while also learning to recognize their body's \"need-to-go\" signals, without the safety net of a diaper. Be aware that you will have accidents if you decide to employ this method—but an accident (or 5) may be just what your child needs to realize the importance of using the potty! Don't act cross or disappointed when your child has an accident—just clean it up calmly and reassure your child that they'll make it to the potty on time next time. If you scold them, they may become anxious about using the potty and start holding it in. Many parents dislike using pull-up diapers because they are now so absorbent that a child cannot tell if it is wet or not. Without some feeling of discomfort, they will not be able to learn their body's signals and make it to the bathroom on time. If the child is naked, or wearing cloth underwear however, there will be no mistaking the need to go! [8] X Research source"
    },
    {
      "title": "Make using the potty part of the morning or nighttime routine.",
      "content": "Make using the potty part of the morning or nighttime routine. Using the potty needs to become a normal and natural daily activity for your child, and the best way to make this happen is to incorporate potty time into their pre-existing daily routine. Sit them on the potty after they brush their teeth each morning, or before their nightly bath. Do this every day and night, without fail, and your child will soon be hopping on the potty all by themselves!"
    },
    {
      "title": "Show your child how to wipe correctly and flush the toilet.",
      "content": "Show your child how to wipe correctly and flush the toilet. Instruct your child on how to wipe themselves properly with toilet paper before they hop off the potty. Make it easier for them by always leaving a roll of toilet paper (maybe the decorated kind!) beside the potty. Show them how to wipe from front to back. This is particularly important for girls in particular, who should always wipe from front to back to avoid spreading bacteria and getting an infection. [3] X Research source They will probably still need help wiping for some time, especially after a number two, but is good to get your child into the habit of trying. Once they are done, let your child do the honors of flushing the toilet and wave goodbye or cheer as everything gets flushed away. Congratulate your child on a job well done!"
    },
    {
      "title": "Remind your child to wash their hands after they use the potty.",
      "content": "Remind your child to wash their hands after they use the potty. Children are usually impatient to get back to the important business of playtime once they are finished with the potty, but you must make sure to emphasize how important it is for your child to wash their hands before leaving the bathroom. To encourage hand washing, get your child a step stool so they can easily reach the sink and buy some children's antibacterial soap in a bright color that they will enjoy using. Teach your child to sing a song while they wash, so they will not be tempted to wash too quickly. Get them to sing the alphabet when they start washing their hands and tell them they can only stop when they get to the letter Z!"
    },
    {
      "title": "Praise your child for trying.",
      "content": "Praise your child for trying. The most important thing you can do for your child during potty training is to offer endless encouragement, regardless of whether they succeed in using the potty or not. Praise them for every little success—from telling you when they need to go, to pulling down their own pants, to sitting on the toilet for a full minute. Even if they don't end up going, tell your child well done for trying and remind them that they can try again later. Just be careful not to over -encourage your child. Offer praise in a calm voice and don't get over-excited. Being too over-the-top with your encouragement is its own form of pressure and may cause your child to feel anxious about pleasing you."
    },
    {
      "title": "Offer rewards for small successes.",
      "content": "Offer rewards for small successes. Many children respond well to incentives or rewards for using the potty. What kind of rewards you decide to offer will depend on both your parenting style and what your child responds to. Some ideas are outlined below. Food: Some parents use candy as a reward for successfully using the potty. For instance, you could give your child 3 mini M&M's or a jelly worm every time they manage to go in the potty. Other parents are wary of offering food as a reward, as they believe it might affect their children's eating habits in future. [9] X Research source Star Charts: Another common in motivator is for parents to create a star chart, where a child is given an additional gold star for every time they successfully use the potty. Sometimes the gold star is motivation enough in itself, while other times parents offer additional rewards if a child reaches a certain number of stars by the end of the week—such as a trip to the park, an extra story at bedtime, or some ice cream. Other times the reward will be given after the chart is completed. Toys: Another good option is to buy a small set of toys (nothing big—maybe just a collection of toy cars or plastic animals) and let your child choose one every time they use the potty. Another good idea with toys is to have older siblings put small , little toys in a box or bag. This way, every time your child goes potty, they get a different kind of toy! Piggy Bank: Some parents offer their children monetary incentives to use the potty! Put a piggy bank in the bathroom and pop a penny in every time your child uses the potty. Once it's full your child can cash it in to buy some treats, like an ice cream or a ride on the machines at the mall. This also may get them ready for when they're older and have an actual allowance! [9] X Research source"
    },
    {
      "title": "Share the good news.",
      "content": "Share the good news. A great way to encourage your child to take pride in using the potty, is to let them boast about it to a friend or family member. Make a big deal of them being able to tell Mommy or Daddy about how well they did with the potty when he or she comes home at the end of the day. Or else give grandma or Uncle Joe a heads up and let your child ring them to tell them the good news. Getting positive, encouraging reactions from someone other than you (the potty trainer) will impress upon your child how good it feels to \"be a big boy/girl.\" Another trick parents use is to rope in a friend or family member to portray their child's hero or favorite cartoon character over the phone. It could be Dora the Explorer, Spiderman, or Barney the Dinosaur—whoever your child likes. Telling their hero about their potty training successes and getting praised in return will make them feel proud as punch!"
    },
    {
      "title": "Don't scold your child when they have an accident.",
      "content": "Don't scold your child when they have an accident. Scolding and giving punishments are major no-nos when it comes to potty training. Remember that your child has only recently developed the ability to recognize and control their bladder and bowel movements, and they are still getting the hang of things. They don't intentionally have accidents just to annoy you or cause you extra work. As mentioned before, scolding a child for having an accident or failing to use the potty can cause them to develop anxiety around the whole issue. This anxiety may cause them to start trying to hold everything in, which just causes further accidents and may lead to both health and psychological problems down the line. [4] X Research source If your child has an accident reassure them that it's okay and that they will make it to the potty next time round. Speak in a neutral tone of voice and explain to the child that poop and pee go in the potty. Show them where the potty is and let them know that you're proud of them for trying and that you're confident that they will soon be using the potty just like a big boy or girl."
    },
    {
      "title": "Have patience.",
      "content": "Have patience. Potty training can be a stressful and frustrating time for parents, but remember that it is only temporary and your child will get the hang of it sooner or later. Don't start panicking about whether your child has development issues if things aren't going well. When your child is ready, they'll pick it up just fine. If your child just doesn't seem to be getting the hang of it, the best thing to do might be to give potty training a break for a month or two and then try again. Remember, some kids don't become fully potty trained until they're 3—and that's perfectly normal!"
    },
    {
      "title": "Let your child pick out some \"big boy\" or \"big girl\" underwear.",
      "content": "Let your child pick out some \"big boy\" or \"big girl\" underwear. Once your child is doing well and using the potty consistently you can bring them shopping to pick out some \"big boy underpants\" or \"big girl underwear\" together. They will feel so proud and grown up wearing them, it will make you smile! Let them wear the underwear at home, though you may want to continue using diapers or training pants at night or when you're on the go, as accidents will happen. Cloth underwear will actually help your child with their training, as they will be able to tell when the underwear are wet—something which is not so easy with absorbent diapers. They will also be so pleased with their new underwear that they will be reluctant to get them wet, and therefore more diligent about keeping them dry!"
    },
    {
      "title": "Take the potty on the road.",
      "content": "Take the potty on the road. Getting the hang of using the potty or toilet at home is one thing, but strange, unfamiliar bathrooms can be intimidating to a child and they may refuse to use them. You can overcome this, and avoid putting your child back in diapers if you're trying to phase them out, by bringing the potty with you while travelling. Potties with removable seats are great for this, as you can pop them onto the seat of any toilet to recreate your child's comfort zone!"
    },
    {
      "title": "Teach your male toddler to pee standing up.",
      "content": "Teach your male toddler to pee standing up. Once your child has got the hang of peeing sitting down, it's time for them to master the art of doing it while standing up. Just be aware that a toddlers \"aim\" is not usually the greatest and you can expect some interesting attempts at making it into the bowl. One great method some parents use for training their toddlers how to get their pee in the bowl is to put some Cheerios or Fruit Loops in the toilet bowl and tell their child to aim directly for them. This turns it into a fun game which appeals to most toddlers' mischievous side! [10] X Research source You can also purchase adhesive “targets” that can be stuck to the toilet bowl from online shops."
    },
    {
      "title": "Let babysitters and teachers know.",
      "content": "Let babysitters and teachers know. Your potty training efforts will be undermined if your child is not being encouraged to use the potty by babysitters or child minders. Take the time to talk to anybody who frequently cares for your child—whether it's grandparents or the employees at your child's day care—and politely explain how important it is that they keep up your child's potty routine. [8] X Research source Tell them about your child's normal schedule, along with the words you use to refer to any potty-related activities, and ask them to follow the same lines. This will prevent your child from becoming confused and your potty-training routine from being disrupted. Always send a spare change of clothes, some wipes, and a few emergency diapers or training pants with your child whenever they are away from home. This will make things easier on the caregivers and help your child to feel less embarrassed about any accidents."
    },
    {
      "title": "Progress to night training when your child is ready.",
      "content": "Progress to night training when your child is ready. When they are dry or fairly dry most days, your child may be ready for nap and night-training. If so, invest in some bed pads (you'll want at least 3 so you can change them easily) and put one on top of the bottom sheet on your child's bed. Look for the kind that have a soft layer on top and a plastic layer underneath. When that's done, put the potty next to the bed when your child goes to bed or goes for a nap. Leave your child's bedroom door open and encourage them to call you if they wake up needing to go. If they do, put them quickly on the potty and praise them for doing so well. If they go in the bed, change the pad and don't make a big deal of it. Deal with it calmly and matter-of-factly and reassure your child that it's okay. Remember that children may reach the age of 6 before they stop having accidents at night-time."
    }
  ]
}