{
  "url": "https://www.wikihow.com/Plant-Sprouted-Onions",
  "title": "How to Plant an Onion That Has Sprouted to Get New Onions",
  "steps": [
    {
      "title": "Peel off the sprouted onion’s papery outer skin.",
      "content": "Peel off the sprouted onion’s papery outer skin. Dig your fingernails into the skin at the top of the onion bulb and rip it off piece by piece. Discard the skin when you are done. [1] X Research source As you remove the outer layer from the onion, you’ll likely see that the inside of the onion is starting to divide into sections. These are the sprouts."
    },
    {
      "title": "Use a knife to cut the onion's layers from the sprouts.",
      "content": "Use a knife to cut the onion's layers from the sprouts. The sprouts look like green onions growing at the center of the onion bulb. Slice through onion’s layers vertically while avoiding the sprouts. Repeat on the other side, then carefully slice off the onion's layers. [2] X Research source If you don’t have a knife, peel off the onion’s layers individually with your hands. You can eat the onion layers if they are firm and crisp, though make sure you wash them first! If they are soft and mushy, discard them."
    },
    {
      "title": "Separate the onion sprouts.",
      "content": "Separate the onion sprouts. You will likely find a few sprouts growing at the center of the onion bulb. Some will protrude from the bulb, others will not. Use your hands to gently separate the sprouts from one another so they don't compete for space while they’re growing. Given proper care, each sprout can grow into a brand new onion bulb! [3] X Research source"
    },
    {
      "title": "Place the sprouts in water until roots grow.",
      "content": "Place the sprouts in water until roots grow. You can keep the sprouts in individual cups, glasses, or bowls of water. Within a few days, white roots will form at the bottom of each sprout. [4] X Research source If white roots are already present, you can plant the sprouts straight into the soil. If you see dry, brown roots on a sprout, it means they are already dead. You want to wait for new white roots to form. Change the water every few days or whenever it looks cloudy or starts to develop an onion smell."
    },
    {
      "title": "Plant the sprouts 1 inch (2.5 cm) deep in quality potting soil.",
      "content": "Plant the sprouts 1 inch (2.5 cm) deep in quality potting soil. Sometime in the spring or summer, dig an individual hole for each sprout and cover it so only the green part sticks out. Keep each sprout at least 3 inches apart (7.5 cm), or in separate pots, so they don't need to compete for space. [5] X Research source Consider applying a thin layer of mulch to the soil to aid the growth process. Whether indoors or outdoors, ensure the plants get ample sunlight. If you’re growing the onions inside, you’ll probably need to use a grow light . If you live in a cold climate, plant the sprouts in pots inside and gradually introduce them to the outdoors once the danger of frost is over. The onions have been inside for some time and will need to adjust. [6] X Research source During the winter in cold climates, keep the plants indoors at all times to ensure they stay alive. Expect to see onion bulbs form after 60–80 days!"
    },
    {
      "title": "Water the plants every few days.",
      "content": "Water the plants every few days. Onions are resilient but need plenty of water to grow . Pour a little water from a gardening can or hose on the soil around the onions, not the plant itself. Ensure the soil is well drained. [7] X Research source If you are using mulch, the onions will only need 1 inch (2.5 cm) of water a week. [8] X Research source To avoid overwatering—which can rot the onion bulbs—water whenever the top 1 inch (2.5 cm) of soil feels dry."
    },
    {
      "title": "Check the plants for weeds every day and remove any that appear.",
      "content": "Check the plants for weeds every day and remove any that appear. As the onions grow, weeds will inevitably emerge around them. Wear garden gloves and be sure to pull the weeds out by the roots so they don't grow back."
    },
    {
      "title": "Treat the plants twice a week with fungicidal spray.",
      "content": "Treat the plants twice a week with fungicidal spray . The spray will prevent harmful fungi from destroying your plants and ensure they remain healthy. A few short sprays on each plant should be enough. [9] X Research source If you prefer not to use synthetic compounds, oxidate or copper sprays are good alternatives."
    },
    {
      "title": "Look for signs that the onions are ready for harvest.",
      "content": "Look for signs that the onions are ready for harvest. The onions should be grown after 60–80 days. They’ll go rotten if you leave them ripe for too long, so harvest them as soon as they’re ready. You will know an onion is ready when: The top of the onion bulb fully emerges from the soil. The green sprouts wilt and/or turn brown. Flowers stalks appear. [10] X Research source"
    },
    {
      "title": "Pull the onions from the ground once they have ripened.",
      "content": "Pull the onions from the ground once they have ripened. When the sprouts have turned to full onion bulbs that look ready for consumption, you can harvest them. Don't be scared of ripping out the roots."
    },
    {
      "title": "Place the onions outside on dry ground for a few days.",
      "content": "Place the onions outside on dry ground for a few days. Handle them carefully and lay them out in a single layer to avoid bruises. This will begin the curing process and allow excess soil to fall from their skins. [11] X Research source If you’d like, you can brush some of the dirt off of the onion, but don’t rinse them—the onions could rot if they get wet."
    },
    {
      "title": "Clip the roots and cut off all but 1 inch (2.5 cm) of the onion's foliage.",
      "content": "Clip the roots and cut off all but 1 inch (2.5 cm) of the onion's foliage. Use a knife or garden scissors to carefully trim the onions. This will stop the onions from decaying in storage. [12] X Research source"
    },
    {
      "title": "Keep the onions in a warm space until dry outer skins form.",
      "content": "Keep the onions in a warm space until dry outer skins form. Place the onions in a shaded spot that stays about 75–80 °F (24–27 °C)—it should be warm but out of the sun. Leave them there for about a month so the onions can cure. You will know they are cured when the foliage shrivels and the onions produce a papery outer layer. [13] X Research source You can skip the curing process if you wish to eat the onions straight away, but storing them without curing first carries a high risk of mildew and rot. [14] X Research source If you can't find anywhere dry enough to cure the onions, consider using a dehumidifier to keep moisture levels down. [15] X Research source ."
    },
    {
      "title": "Store the onions in a cool spot in baskets or dry mesh bags.",
      "content": "Store the onions in a cool spot in baskets or dry mesh bags. After curing, move the onions to a cellar or garage that’s cool, dark, and dry. Also, make sure they have good air circulation by keeping them in bushel baskets, racks, or even a cardboard box with holes. You can store cured onions for up to 10–12 months. [16] X Research source If an onion sprouts in storage, you can replant it again!"
    },
    {
      "title": "What happens if you plant a whole sprouted onion?",
      "content": "What happens if you plant a whole sprouted onion? If you don’t remove the old bulb from the new onion sprouts before you replant them, the onion bulb will rot, and the onion sprouts will likely rot as well. Also, the sprouts will compete for space, so the new bulbs will probably be smaller than they would if you separated them. [17] X Research source"
    },
    {
      "title": "How do you grow onions from onions?",
      "content": "How do you grow onions from onions? After an onion sprouts, separate the green sprouts, place them in water to develop roots, then plant them in the ground until a new onion bulb forms."
    },
    {
      "title": "How many onions grow from one bulb?",
      "content": "How many onions grow from one bulb? Usually you’ll get two or three new shoots from each onion bulb, so you can grow 2–3 new onions."
    },
    {
      "title": "Can onions be planted indoors?",
      "content": "Can onions be planted indoors? Yes, you can plant onions in a container that you keep indoors—but because onions require full sun to grow, you’ll probably need to keep them under a grow light. [18] X Research source"
    },
    {
      "title": "When should I plant my onion sprouts?",
      "content": "When should I plant my onion sprouts? The best time to plant onion sprouts is in the spring when soil temperatures have reached about 50 °F (10 °C). However, you can plant them sooner, as long as the danger of frost has passed. [19] X Research source"
    },
    {
      "title": "Can I plant any color onion?",
      "content": "Can I plant any color onion? Yes, you can sprout and plant any color onion to regrow new ones."
    }
  ]
}