{
  "url": "https://www.wikihow.com/Play-Slap-Bass",
  "title": "How to Play Slap Bass",
  "steps": [
    {
      "title": "Practice your form before you pick up the bass.",
      "content": "Practice your form before you pick up the bass. If you’re new to slap bass techniques, it’s best to practice the basic slapping motion before you start playing the instrument. Familiarize yourself with the new form, and internalize the slap techniques before you start attempting new licks."
    },
    {
      "title": "Form a loose “thumbs up” fist with your dominant hand.",
      "content": "Form a loose “thumbs up” fist with your dominant hand. To play slap bass, hold your fingers in a loose fist and stick your thumb up. Your playing hand will maintain this position whenever you play slap bass."
    },
    {
      "title": "Rotate your hand from the wrist and forearm.",
      "content": "Rotate your hand from the wrist and forearm. With your thumb still extended up, practice turning your wrist several times, as though you were turning a doorknob. Focus on turning your wrist while keeping the rest of your arm still. When you play slap bass, your sound should come entirely from this basic rotating motion."
    },
    {
      "title": "Practice flicking your thumb.",
      "content": "Practice flicking your thumb. Flick your thumb in a smooth motion back and forth as an extension of the rotating motion in your wrist. When you play, this turning-and-flicking motion will allow your thumb to hit and bounce off the strings. This causes the strings to bounce off the bass frets, producing the “slap” sound. Remember, for this technique you use the thumb slapping for the E and A string. Use your pointer and middle or ring and pinkie (whichever you prefer) for the D and G strings to pluck."
    },
    {
      "title": "Rest your non-dominant hand on the neck of the bass.",
      "content": "Rest your non-dominant hand on the neck of the bass. While you're starting out, you'll want to use your non-dominant hand to stabilize the instrument. Later, you'll use this hand to incorporate damping techniques. In general, you should be holding your bass as you normally would."
    },
    {
      "title": "Place your thumb parallel to the strings near the end of the fretboard.",
      "content": "Place your thumb parallel to the strings near the end of the fretboard. This is the area of the strings directly above the area where the neck of the bass meets the body. Striking the strings with your thumb in this particular area will allow for maximum string-reverberation off the fretboard, thus producing the greatest “slap” noise. [1] X Research source To start, rest your left hand on the fretboard without touching the strings."
    },
    {
      "title": "Strike an open string with the bony part of your extended thumb.",
      "content": "Strike an open string with the bony part of your extended thumb. Combine the rotate-and-flick motion in order to play an open slap note on the bass. While you rotate your wrist, try to hit the string with the bony part of your thumb, as this will allow for the fullest sound. [2] X Research source An open string refers to a string played without being pressed into contact with the fretboard. Play an open string by striking the string with your thumb and letting it ring."
    },
    {
      "title": "Rebound your thumb away from the string after every hit.",
      "content": "Rebound your thumb away from the string after every hit. Once your thumb makes contact with the string, complete your wrist rotation to pull your thumb away from the string. Keeping your thumb on the string after you play a note will prevent the string from slapping against the fret board, which will cut off the slap sound. [3] X Research source"
    },
    {
      "title": "Keep slapping open strings until you create a consistent slap sound.",
      "content": "Keep slapping open strings until you create a consistent slap sound. This basic playing motion in your wrist and thumb will be the mainspring for slap bass licks. Therefore, it’s important to feel comfortable with the form and technique with your thumb against open notes before you move on to more complicated techniques. [4] X Research source"
    },
    {
      "title": "Use your left hand to dampen notes on the fretboard.",
      "content": "Use your left hand to dampen notes on the fretboard. Once you’ve gotten the hang of playing open slap notes, you can start controlling the length and tones of the notes by using your left hand to dampen the strings after they’ve hit the fretboard. After you strike a note with your right thumb, practice damping the note by lightly pressing the fleshy part of your left fingers over the open note."
    },
    {
      "title": "Practice slapping and damping to create a rhythm.",
      "content": "Practice slapping and damping to create a rhythm. Start with a simple, repetitive rhythm, starting with one note at a time to get used to slapping and damping at the same time. For example, if you're playing a rhythm with four beats, try slapping notes with your right thumb on beats one and three, and damping those notes with the fingers of your left hand on beats two and four. [5] X Research source"
    },
    {
      "title": "Position your right index and/or middle fingers under the strings.",
      "content": "Position your right index and/or middle fingers under the strings. Popping is the final component of slap bass playing technique, and involves pulling up on the strings to produce twangy sounds that compliment your slaps. While slapping the strings with your thumb, keep your fingers underneath the strings to add popping to your licks. [6] X Research source"
    },
    {
      "title": "Pull the strings away from the fretboard to create the popping sound.",
      "content": "Pull the strings away from the fretboard to create the popping sound. Think about using the side of your index/middle finger to pull the string up and away from the bass. When you release the string, it will strike and reverberate off the fretboard, producing a popping noise. [7] X Research source"
    },
    {
      "title": "Practice putting all three techniques together.",
      "content": "Practice putting all three techniques together. Eventually, you’ll want to incorporate slapping, damping, and popping into the same musical phrases. Start with short, slow licks where you can focus on creating consistent slapping and popping sounds while damping the strings in between notes. When you get comfortable incorporating all three techniques at once, you can move on to faster, more complicated licks. [8] X Research source"
    }
  ]
}