{
  "url": "https://www.wikihow.com/Play-Risk",
  "title": "How to Play Risk: Board Setup, Rules, Strategy, & More",
  "steps": [
    {
      "title": "Set out the game board, cards, and dice.",
      "content": "Set out the game board, cards, and dice. Unfold the board and set it in the middle of the table. Shuffle the 42 cards marked with map territories and the 2 “wild” cards with pictures of troops together to make the draw pile. Set the 3 red attack dice and 2 white defense dice near the board. [1] X Research source The Risk board has 6 continents — North America, South America, Europe, Africa, Asia, and the Australian Archipelago — that contain a total of 42 smaller territories. Variation: If you want to play with the Secret Mission cards, randomly give each player 1 Mission of each of the 4 types. Keep the cards a secret from the other players."
    },
    {
      "title": "Give each person starting troops based on the player count.",
      "content": "Give each person starting troops based on the player count. Each player gets one set of plastic army troops. An army contains Infantry that are worth 1 troop, Cavalry that are worth 5 troops, and Artillery that count as 10 troops. Players get a total number of troops depending on how many people are playing the game. [2] X Research source 6 players - 20 troops each 5 players - 25 troops each 4 players - 30 troops each 3 players - 35 troops each 2 players - 40 troops each (this varies between editions, and you must use “neutral” armies that aren’t controlled by either player) Cavalry and Artillery troops are a way to let you consolidate multiple troops on the map. For example, if you have 5 Infantry in 1 territory, you could trade them in at any time for 1 Cavalry so the map is easier to see."
    },
    {
      "title": "Roll a die to determine who goes first.",
      "content": "Roll a die to determine who goes first. Take turns rolling a die to see who gets the highest number. If there’s a tie, the tied players roll again until there’s a winner. The first player gets to put down the first troop and takes the first turn at the start of the game. [3] X Research source After the first player, take turns clockwise around the table."
    },
    {
      "title": "Take turns placing Infantry troops on the board to claim starting territories.",
      "content": "Take turns placing Infantry troops on the board to claim starting territories. Starting with the first player, place 1 of your Infantry onto an empty territory that’s on the map. Once all the territories are claimed, add 1 troop to any territory with one of your pieces in it until you run out of available troops. After that, the game starts with the player who placed the first troop. [4] X Research source Any territory with your pieces in it is considered under your control. Variation: Remove the 2 “wild” cards from the draw pile and deal out the cards evenly to each player. Each player places one of their troops in the territories listed on the cards they have. Always deal out cards to claim starting territories during a 2-player game."
    },
    {
      "title": "Try to conquer all of the territories on the board to win.",
      "content": "Try to conquer all of the territories on the board to win. The Risk game board is split up into 42 territories that you can control. On your turn, you’ll place troops from your army on the board before attacking territories that your opponents control. At the end of your turn, you can move troops to fortify territories you control. Once you control all of the territories, you win the game. [5] X Research source Some variations of Risk give each player secret missions they need to complete as an alternate way to win. A game of Risk usually takes around 2 hours, but it could take an hour or two longer if you’re playing with all 6 players."
    },
    {
      "title": "Count the troops you get from territories and continents.",
      "content": "Count the troops you get from territories and continents. At the beginning of each of your turns, you receive more armies based on the number of territories and which continents you control. For every 3 territories you control, you gain 1 additional troop. If you control all the territories on one of the continents, then you gain the number of troops listed on the board. [6] X Research source Example: If you had 11 territories, you would receive 3 troops. For 13 territories, you would receive 4 troops. Receive 3 troops for controlling Africa, 7 troops for Asia, 2 troops for Australia, 5 troops for Europe, 5 troops for North America, and 2 troops for South America. If you ever gain fewer than 3 troops at the beginning of your turn, round up to 3 troops."
    },
    {
      "title": "Trade in sets of 3 matching cards to place bonus troops.",
      "content": "Trade in sets of 3 matching cards to place bonus troops. During the game, you’ll get chances to draw cards from the draw pile. When you have 3 cards that show the same troop picture, or have 3 different troop pictures (Infantry, Cavalry, and Artillery), you can turn the cards upside-down to claim extra troops. Each time a player turns in cards, they gain more troops that the last set of cards. [7] X Research source First set: 4 troops Second set: 6 troops Third set: 8 troops Fourth set: 10 troops Fifth set: 15 troops For every set after the fifth set, add 5 more troops to the total. If you have 5 or more cards at the beginning of a turn, you must turn at least one set of them in. If one of the cards you turn in has a territory you control, place 2 bonus troops in that territory. You can only do this once per turn. Some editions of Risk have stars on the cards instead of troops. You gain troops based on the number of stars on the cards you turn in."
    },
    {
      "title": "Place your troops on territories you control.",
      "content": "Place your troops on territories you control. You may place the troops you received anywhere you have another troop on the board. You can split your troops between each of your territories, or you can place all of your new troops in one territory. You can use any combination of Infantry, Cavalry, or Artillery as long as you don’t place more troops than what you gained for the turn. [8] X Research source Example: If you gained 16 troops, you could place 16 Infantry; 3 Cavalry and an Infantry; or 1 Infantry, 1 Cavalry, and 1 Artillery. Try to place your troops in territories that border your opponents so you can perform a strong attack or defend yourself. [9] X Research source"
    },
    {
      "title": "Declare an attack on a territory adjacent to one you control.",
      "content": "Declare an attack on a territory adjacent to one you control. Territories are adjacent if they share a border or if they have a sea line connecting them. When you want to attack another territory, name the territory you’re attacking and which territory you control that you’re attacking from. The territory you control must have at least 2 troops in it. [10] X Research source Example: You may say, \"I'm attacking Eastern United States from Western United States.\" Attacking during your turn is always optional. If you’d rather save your troops and keep your defenses strong, you can skip straight to fortifying your troops."
    },
    {
      "title": "Choose up to 3 troops to use for your attack.",
      "content": "Choose up to 3 troops to use for your attack. The number of troops you choose to attack with determines how many dice you get to roll when you square off the opponent. Push the troops into the territory that you’re attacking, but leave at least 1 troop in the original territory. Gain 1 attack dice for every troop you choose to use. [11] X Research source Since Cavalry or Artillery are worth 5 and 10 troops, you can’t use the pieces in an attack. Trade Cavalry or Artillery pieces in for Infantry before you make your attack."
    },
    {
      "title": "Roll the red attack dice against your opponent’s white defense dice.",
      "content": "Roll the red attack dice against your opponent’s white defense dice. As the attacker, roll 1 red die for each of the troops you’re using in your attack. The defending player rolls the same number of white dice as the number of troops in their defending territory, with a maximum of 2. Compare the die with the highest value for both the attacker and defender to see who rolled higher. Then look at the next highest die for each player until you resolve each die. [12] X Research source If the red die is higher than the white die, remove 1 troop from the defending territory. If the red die is lower or equal to the white die, remove 1 of the attack troops from the board. Example: John decides to attack Jane. John uses 2 troops to attack and Jane has 1 troop to defend. John rolls as a 4 and 3. Jane rolls a 3. Since John’s highest die was a 4 and Jane’s was a 3, John wins the battle and removes Jane’s troop from the board."
    },
    {
      "title": "Occupy the territory if you win it.",
      "content": "Occupy the territory if you win it. If you successfully wipe out all of the defending troops in the territory you’re attacking, keep all of the troops you used to attack in the territory. You can also move additional troops from the attacking territory to the one you just captured as long as you leave 1 troop behind. [13] X Research source If there are still enemy troops left in the territory, then move your troops back into the territory they came from. As soon as you run out of troops on the board, you’re out for the rest of the game."
    },
    {
      "title": "Attack any number of times during your turn.",
      "content": "Attack any number of times during your turn. You can keep attacking the same territory or you can try attacking a different area on the map altogether. You can perform as many attacks as you want during your turn until you decide you’re finished. [14] X Research source Pay attention to how many troops you have left on the board before you declare an attack. It may be smarter to save your troops for a strong defense so you don’t wear yourself too thin."
    },
    {
      "title": "Draw a card at the end of your turn if you captured a territory.",
      "content": "Draw a card at the end of your turn if you captured a territory. If you've conquered at least one territory, take the top card from the draw pile and add it to your hand. No matter how many territories you controlled on your turn, you still only draw 1 card from the pile. [15] X Research source If you manage to wipe out an opponent by destroying their last troop on the board, you gain all the cards they had in their hand."
    },
    {
      "title": "Move troops from 1 territory to another connected territory.",
      "content": "Move troops from 1 territory to another connected territory. Fortifying your territories is the last chance you have to build your defenses up for enemy attacks. Choose any number of troops in one territory that you want to move. You can move the troops to an adjacent territory you control, or to any territory you control as long as you have troops in all the territories in between. [16] X Research source"
    },
    {
      "title": "Leave at least one army piece behind in the original territory.",
      "content": "Leave at least one army piece behind in the original territory. You have to retain control of the territory you’re moving troops out of, so keep at least 1 Infantry behind. [17] X Research source"
    },
    {
      "title": "Try to guard territories that border your opponents.",
      "content": "Try to guard territories that border your opponents. Since you won’t be able to move your troops again until your next turn, set yourself up for the defensive at the end of your turn. Look for territories you have that are vulnerable to the other players and try to fortify them with your troops so you can keep control of it. [18] X Research source"
    },
    {
      "title": "Wait to attack until you build up troops on a territory.",
      "content": "Wait to attack until you build up troops on a territory. Attacking with a lot of troops early on spreads your army out pretty thin, which makes you an easy target for the rest of the players. If you want to win at Risk , think about if you really gain any advantage from attacking immediately. It might be better if you just wait until your next turn so you have time to build up more troops. [19] X Research source"
    },
    {
      "title": "Take small continents early in the game.",
      "content": "Take small continents early in the game. Even though you get a larger troop bonus for controlling larger continents, they have a lot more territories you need to defend. By focusing on controlling the smaller continents, you can defend them a lot easier so you get extra reinforcements each turn. [20] X Research source Hold off on trying to control all of Asia since it has too many borders to fortify and will quickly lead to over-expansion and spreading your troops thin."
    },
    {
      "title": "Focus on building a strong defense.",
      "content": "Focus on building a strong defense. Instead of attacking as much as you can, defend your borders and build up your troops. While you will not receive the continent bonus at the beginning of your turn, having strong defenses along continent borders will make it harder for your opponents to attack you and win. [21] X Research source"
    },
    {
      "title": "Form temporary alliances with other players.",
      "content": "Form temporary alliances with other players. Even though only one person can win the game, you can make an unofficial agreement with another player to team up. You might work together to try eliminating another player or make deals not to attack one another for a turn. Just keep in mind that you will eventually need to attack each other. This will make it easier to concentrate your efforts on other objectives. Example: \"Alex has a lot of pieces in Europe. Sammy, I won’t attack your troops if you help me attack him on your turn.\" You can say your alliances out loud or you can keep them secret."
    }
  ]
}