{
  "url": "https://www.wikihow.com/Score-a-March-Madness-Bracket",
  "title": "How to Score a March Madness Bracket",
  "steps": [
    {
      "title": "Choose your preferred scoring system.",
      "content": "Choose your preferred scoring system. There are many different ways to score a March Madness bracket. The most common method is to award 1 point for correct predictions in the first round, 2 in the second round, 4 in the third, 8 in the fourth, 16 in the fifth, and 32 in the sixth and final round. However, you could also go with a point scheme like 1-2-3-4-5-6 to make each round weighted more evenly. [1] X Research source ESPN tracks March Madness brackets using a 10-20-40-80-160-320 scoring system. However, this is no different from a standard 1-2-4-8-16-32 system, as each point value is just multiplied by 10. [2] X Research source Many simplified office pools award a single point for each correct prediction, meaning the player with the most accurate guesses at the end of the tournament is most likely to win. [3] X Research source"
    },
    {
      "title": "Look up the seed numbers for each of the participating teams.",
      "content": "Look up the seed numbers for each of the participating teams. Knowing a teams' seed number is important for confirming that their placement on your bracket corresponds to their scheduled matchups in the tournament. You can find a complete list of team seeds on the NCAA website. [4] X Research source \"Seeds\" are essentially rankings that show where each team falls in their respective division. Each division has 16 teams, and they're seeded from 1 to 16. [5] X Expert Source Ryan Tremblay Basketball Coach Expert Interview. 13 November 2020. Seed numbers change every season, so make sure the listing you're looking at is up-to-date."
    },
    {
      "title": "Enter the names of the participating teams in the first round column.",
      "content": "Enter the names of the participating teams in the first round column. When you look at your blank bracket, you’ll see 32 numbered lines running down either side of the page. These numbers correspond to a given team’s seed number within their region. Write in the name of each NCAA team on the line that matches their seed number. [6] X Research source You'll use these seed pairings to predict which teams you think will advance in the tournament. In the first round of games, high seeds play against low seeds. The #1 seed in each division will play the #16 seed, the #2 seed will play the #15 seed, #3 will play #14, and so on. [7] X Expert Source Ryan Tremblay Basketball Coach Expert Interview. 13 November 2020."
    },
    {
      "title": "Predict a winner for each game.",
      "content": "Predict a winner for each game. Go down the list of the 64 teams and decide which out of each pairing will win their first round game. Once you’ve made your choice, write the name of your predicted winner on the next line in the bracket. From there, you’ll go on to choose a winner for each game in the subsequent rounds of the tournament. [8] X Research source For the first round of action, you’ll be predicting 32 teams that you think have the best chance of moving onto the second round. In the second round, you’ll select 16 of those 32 winners, and so on. It’s usually a good idea to make safe predictions in the first couple rounds to ensure that you end up with as many points as possible by the higher stakes rounds. A #16 seed is unlikely to beat a #1 seed, for instance, so picking the #1 seed will give you the best chance of scoring. [9] X Research source"
    },
    {
      "title": "Note the winner of each game on your bracket.",
      "content": "Note the winner of each game on your bracket. The simplest way to do this is to circle correct predictions or cross out incorrect ones. You’ll need to do this after each and every game, so be sure to keep up with the March Madness play schedule and update your bracket regularly. [10] X Research source The tournament unfolds in 6 rounds of games. After each round, half the number of teams from the previous round will move on until only two teams remain. You can also highlight the names of the winning teams to make them more visible at a glance. [11] X Research source"
    },
    {
      "title": "Award yourself points for correct predictions.",
      "content": "Award yourself points for correct predictions. If the scoring system you’re using awards 1 point for first round wins, you would receive 1 point for each team you have circled on the second round column of your bracket. You would get 2 points for each of your second round victories, 3 or 4 for the third round (depending on the exact scoring system you’re using) and so on until you reach the last round. Put the number of points you receive for each correct prediction in parentheses next to the circled team name, or tally them up on a separate sheet of paper. The sixth and final round of the tournament is worth the most points in the majority of scoring systems—with a standard 1-2-4-8-16-32 scheme, it’s possible to win 32 points (the maximum number for each individual round) just by correctly guessing the outcome of the final game. [12] X Research source"
    },
    {
      "title": "Add up your points for each correct pick to get your final score.",
      "content": "Add up your points for each correct pick to get your final score. Using a standard 1-2-4-8-16-32 scoring system, you’ll score your bracket out of a possible 192 points. The player with the highest number of points at the end of the tournament wins their pool. [13] X Research source To calculate the total number of points available in each round according to different scoring systems, simply multiply the point scheme for that round by the number of winning teams. In a 1-2-3-4-5-6 system, for instance, your score will be out of 128 total points, while in a 1-1-1-1-1 system it will be out of 63."
    },
    {
      "title": "Determine the winner of your pool.",
      "content": "Determine the winner of your pool. Once you've got your final score tallied up, compare it with those of the people you're playing against to see who had the most accurate predictions. If you're playing in a casual office pool, the task of reviewing players' brackets and declaring a winner will usually be assigned to an impartial third party. [14] X Research source Official pools often have closed online scoring systems in place to prevent the possibility of cheating. In these pools, you'll simply fill out your bracket, make your predictions, and let the moderators take care of the rest. [15] X Research source It's not necessary to enter an official pool in order to follow the action of March Madness. Many players like to fill out their own brackets alone or with a small group of friends just for fun."
    },
    {
      "title": "Try out other scoring systems.",
      "content": "Try out other scoring systems. 1-2-4-8-16-32, 1-2-3-4-5-6, and 1-1-1-1-1-1 are the most common point schemes used for scoring March Madness brackets, but they’re not the only ones. You can also find pools running systems like 1-2-3-4-6-10, 2-3-5-8-13-21, and 2-3-5-7-10-50. [16] X Research source You could even make up your own custom scoring system for a pool you’re running with your friends. Different systems award different numbers of points for different stages of the tournament. This means that some systems reward players more for correction predictions in the early rounds, while some put more emphasis on the last few games."
    },
    {
      "title": "Enter pools based on your play style to better your chances.",
      "content": "Enter pools based on your play style to better your chances. If you tend to choose winners based on statistical probability, sticking to pools that are weighted more evenly will allow you to rack up points for each correct prediction you make. If you’re a lucky guesser, on the other hand, you might fare better in a pool that uses a system where the final round is worth more than the others. [17] X Research source By being more selective of the pools you participate in, you can essentially shift the determining factor toward either skill or chance."
    },
    {
      "title": "Use bonus points or multipliers to make your pool more interesting.",
      "content": "Use bonus points or multipliers to make your pool more interesting. Up the stakes by awarding twice the number of points to players who correctly predict an upset. Alternatively, you could reward players for taking a chance on the underdog by multiplying the point value for the round by the winning team’s seed number. [18] X Research source With a seed multiplier, a correct #1 seed pick right in the first round would only be worth 1 point, while getting a #16 pick right would net you 16 points. [19] X Research source If you decide to add bonus points or multipliers, you won’t be able to take part in larger pools with fixed scoring systems."
    }
  ]
}