{
  "url": "https://www.wikihow.com/Season-Peas",
  "title": "How to Season Peas",
  "steps": [
    {
      "title": "Simmer your peas in water for 8-10 minutes.",
      "content": "Simmer your peas in water for 8-10 minutes. Fill a pot with enough water to cover the quantity of peas you want to cook and bring it to a boil . Pour the peas into the water and reduce the heat to a simmer, then let the peas cook for 8 to 10 minutes or until they are tender. Some cooks warn that adding salt to the water before boiling can toughen the peas and slow down the cooking process. [1] X Research source Others claim that salt may actually reduce cooking time by causing the water to boil hotter. It can also impart a little flavor to the peas. If you’d like to experiment with salt, try adding about ½ to 1 teaspoon (2.5 to 5 grams) of salt per 1 US quart (0.95 L) of water before boiling. If you wish, you can add a pinch of sugar to the water to enhance the sweetness of the peas. [2] X Research source"
    },
    {
      "title": "Drain the peas once they are cooked.",
      "content": "Drain the peas once they are cooked. Once the peas have achieved the desired texture, pour them into a strainer or colander. Drain off all the cooking water. A mesh strainer may work better than a colander, since the small peas can get stuck in the larger holes of the colander. [3] X Research source"
    },
    {
      "title": "Sauté the cooked peas in butter, salt, and pepper.",
      "content": "Sauté the cooked peas in butter, salt, and pepper. Melt some butter in a skillet and add the freshly cooked peas. Sprinkle on a little salt and pepper to taste. Gently stir the peas and spices with a spatula to distribute the salt and pepper evenly and prevent burning. If you like, you can add some aromatics (such as minced garlic or shallots) to the butter and let them soften slightly before adding the peas. Since the peas are already cooked, you don’t need to sauté them for more than a minute or 2."
    },
    {
      "title": "Add a pinch of fresh herbs.",
      "content": "Add a pinch of fresh herbs. As the peas are sautéing, add in a sprinkling of fresh, chopped herbs to taste. Add just a small spoonful to be sure you don’t overwhelm the peas, and increase the amount if you want more punch. For maximum flavor, bruise the herbs slightly with your fingers before adding them to the dish, and add them right before you take the peas off the heat. [4] X Research source Add sweeter herbs like mint to bring out the natural sweetness of the peas. For a more savory flavor, try parsley, basil, sage, or rosemary. If you use an herb with a stronger flavor, such as rosemary, add it earlier in the cooking process (e.g., when you first start melting the butter) to soften the flavor."
    },
    {
      "title": "Sprinkle on some additional spices before serving if desired.",
      "content": "Sprinkle on some additional spices before serving if desired. Because of their mild flavor, cooked peas go well with a wide variety of seasonings. When you are ready to serve up your peas, add a little of the dried seasoning of your choice to taste. [5] X Research source A few good options include marjoram, paprika, turmeric, dill, cilantro, oregano, mustard, savory, allspice, thyme, and caraway. You can also flavor your peas by drizzling on some white vinegar or lemon juice, a dressing (such as vinaigrette), or a flavorful oil, like sesame or olive oil."
    },
    {
      "title": "Add your frozen peas to a skillet with butter, garlic, and sugar.",
      "content": "Add your frozen peas to a skillet with butter, garlic, and sugar. There are many ways to cook frozen peas , but sautéing is a great way to achieve a rich and flavorful result. Put your peas in a large skillet along with some salted sweet cream butter, crushed or minced fresh garlic, and a little bit of sugar. [6] X Research source If you’re using 1 pound (0.45 kg) of frozen peas, add 6 tablespoons (89 mL) of butter, 2 teaspoons (about 8 grams) of sugar, and 3 cloves of fresh garlic."
    },
    {
      "title": "Cook over medium heat for 5 to 7 minutes.",
      "content": "Cook over medium heat for 5 to 7 minutes. Stir the peas occasionally as you sauté them to prevent burning and distribute the butter and seasonings evenly. Your peas should be cooked when the butter is melted and the peas are heated all the way through. [7] X Research source If you like, you can tear up a few fresh mint leaves and sprinkle them onto the peas as they cook."
    },
    {
      "title": "Remove your peas from the heat and season them to taste.",
      "content": "Remove your peas from the heat and season them to taste. Once the peas are cooked, sprinkle on a little salt and black pepper until you achieve the desired flavor. [8] X Research source You can serve them this way if you like, or add additional seasonings, such as: Basil Parsley Oregano Tarragon Paprika Dill Turmeric Cumin Marjoram Cilantro"
    },
    {
      "title": "Put 1 can of drained peas into a saucepan with a little water.",
      "content": "Put 1 can of drained peas into a saucepan with a little water. If you’re using a 16 ounces (450 g) can of peas, use about .5 cups (120 mL) of water. Pour off the water from the can before adding the peas and fresh water to the pan. Many canned peas have added salt and sugar. For this reason, you may wish to taste the peas before seasoning them, since these additives can affect their flavor. If you’d prefer peas without additional salt or sugar, look for cans labeled “no added salt,” “no added sugar,” “low sodium,” or similar."
    },
    {
      "title": "Simmer the peas over medium heat and add butter.",
      "content": "Simmer the peas over medium heat and add butter. Turn on your stove and bring the peas to a simmer or low boil. Add a little bit of unsalted butter to the mix. If you’re cooking 16 ounces (450 g) of peas, add 2 tablespoons (30 mL) of butter."
    },
    {
      "title": "Add other seasonings to taste.",
      "content": "Add other seasonings to taste. While the peas and butter are simmering, sprinkle in a little salt and black pepper to taste. If you wish, you can also add 1 teaspoon (about 4 grams) of sugar. If your peas were canned with added salt or sugar, be sure to taste-test them first so that you don’t overdo it. You can also add additional seasonings, such as: Red pepper flakes Onion powder Garlic powder Other spices, such as parsley, sage, turmeric, oregano, or basil"
    },
    {
      "title": "Cook the peas until they are heated through and the butter is melted.",
      "content": "Cook the peas until they are heated through and the butter is melted. Canned peas are already cooked, so you only need to heat them up as much as desired. Pour off any additional water before you serve up the peas. You can serve the cooked and seasoned peas on their own or mix them into other dishes, such as pasta, salad, or soup."
    }
  ]
}