{
  "url": "https://www.wikihow.com/Shape-Your-Eyebrows-with-a-Razor",
  "title": "How to Shape Your Eyebrows with a Razor",
  "steps": [
    {
      "title": "Purchase a razor made specifically for eyebrows.",
      "content": "Purchase a razor made specifically for eyebrows. A standard razor will not give you detailed brows, and can be dangerous to use near your eyes. Instead purchase an eyebrow razor, whose small blade will give you the brows you desire. You can order an eyebrow razor online or purchase one at your local beauty supply store."
    },
    {
      "title": "Use a small amount of shaving cream.",
      "content": "Use a small amount of shaving cream. You will get a closer shave if you apply shaving cream to the area of skin surrounding the eyebrow. Try starting with a dime-sized amount, and use more if necessary. Try applying the shaving cream when you get out of the shower. Only put shaving cream over the part of your eyebrow you want to shave. Use a cotton swab to wipe away any excess shaving cream so you can see what you're doing. You can also use petroleum jelly or a moisturizer to help prep the skin. [1] X Expert Source Erica Coates Professional Makeup Artist Expert Interview. 25 February 2022."
    },
    {
      "title": "Hold your brow skin taut.",
      "content": "Hold your brow skin taut. Use your non-dominant hand to hold the skin around the eyebrow taut. This will help you get a closer, more detailed shave. Then use your dominant hand to begin shaping your eyebrow. [2] X Research source"
    },
    {
      "title": "Shave under your brow in the direction of hair growth.",
      "content": "Shave under your brow in the direction of hair growth. [3] X Expert Source Erica Coates Professional Makeup Artist Expert Interview. 25 February 2022. It’s important that you stroke the razor in the same direction that your eyebrows grow. If you use the blade in the opposite direction, you can nick your skin and possibly create ingrown hairs. Instead, gently stroke the razor in the direction that your eyebrows grow. Also, avoid shaving above your eyebrows or they could look unnatural."
    },
    {
      "title": "Check your progress frequently.",
      "content": "Check your progress frequently. You should check your progress in a mirror as much as possible. It is easy to accidentally shave off too much of your eyebrows. To prevent this from happening, step back and look in the mirror after completing each section of eyebrow. [4] X Research source"
    },
    {
      "title": "Wash your face after you finish.",
      "content": "Wash your face after you finish. Once you are done shaving your eyebrows, wash your face with a gentle facial cleanser. This will help remove any remaining shaving cream or oils from your hands. Do not apply moisturizers to the freshly shaved area, as this can clog pores. [5] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Maintain your brow shape by shaving weekly.",
      "content": "Maintain your brow shape by shaving weekly. In order to maintain the look of your newly shaped eyebrows, you will want to shave them regularly. Try shaving about once a week, or more if your hair grows quickly."
    },
    {
      "title": "Consider waxing or tweezing.",
      "content": "Consider waxing or tweezing. While you can effectively shape your eyebrows using a razor, the hair will grow back quickly. This means you will need to shape your brows more often than if you wax or tweeze them. If you’d like longer lasting brows, try tweezing or waxing your brows instead of shaving. You can also use multiple methods. Use tweezers to pluck out thick, dark eyebrow hairs, and use a razor to shave off smaller, lighter hairs."
    },
    {
      "title": "Line up your brow’s inner edge with the outer tip and bridge of your nose.",
      "content": "Line up your brow’s inner edge with the outer tip and bridge of your nose. Take a pencil and place it vertically along the sides of your nose tip and bridge. This will help you see where the innermost edge of your eyebrow should be. As you do the same and trace the points for both eyebrows, You can shave or tweeze the hair between these two reference points if visible. [6] X Research source"
    },
    {
      "title": "Make sure the arch peaks just past the outer edge of your iris.",
      "content": "Make sure the arch peaks just past the outer edge of your iris. The iris is the colored part of your eye, and it can serve as an excellent guide for figuring out where your eyebrow’s arch should peak. The arch of your brow should peak about 1/8 inch or 3 millimeters past your iris’s outer edge when you're looking straight into a mirror. [7] X Research source Keep in mind that your iris moves when you look around."
    },
    {
      "title": "Taper the brow.",
      "content": "Taper the brow. You should maintain a uniform thickness from the inner edge of the eyebrow up to the arch. Once you reach the arch, you can begin tapering the brow thinner until you reach the outer edge of the eyebrow. You can also keep your eyebrows at the same thickness throughout if tapering doesn’t seem right for you. [8] X Research source"
    },
    {
      "title": "Don’t let the outer edge of the eyebrow droop.",
      "content": "Don’t let the outer edge of the eyebrow droop. The outermost edge of your eyebrow should not dip below the level of your eyebrow’s inner edge. Keep both edges of the eyebrow on the same level. You can also let the outer edge sit a tiny bit higher than the inner edge. [9] X Research source"
    },
    {
      "title": "Trim long eyebrow hairs with scissors.",
      "content": "Trim long eyebrow hairs with scissors. Use a comb to brush your eyebrow hairs up. Then, trim any hairs that extend out of your eyebrow shape. Brush your eyebrow hairs down and do the same thing."
    },
    {
      "title": "Ask a friend to help you.",
      "content": "Ask a friend to help you. You will be more successful at shaping your eyebrows with a razor if you ask someone to help. A friend or family member can help you determine the best brow shape. They can also alert you if it looks like you are shaving away too much of your eyebrows. [10] X Research source"
    }
  ]
}