{
  "url": "https://www.wikihow.com/Shave-Chocolate",
  "title": "How to Shave Chocolate",
  "steps": [
    {
      "title": "Choose a peeler.",
      "content": "Choose a peeler. Note that different sizes of peelers will produce different sizes of shavings."
    },
    {
      "title": "Choose chocolate at room temperature.",
      "content": "Choose chocolate at room temperature. Place a sheet of parchment or a plate underneath, to catch the shavings as they fall."
    },
    {
      "title": "Hold the chocolate bar firmly in one hand.",
      "content": "Hold the chocolate bar firmly in one hand. Hold it with one long side facing upward for small curls, or hold it flat for larger curls."
    },
    {
      "title": "Hold the peeler in your other hand.",
      "content": "Hold the peeler in your other hand. For smaller curls: Press it down firmly on the side of the chocolate bar and drag the peeler along the edge. For larger curls: Scrape along the broad area of the chocolate bar, on the flat surface side."
    },
    {
      "title": "Add the shavings to your pastries, baked goods and cold puddings.",
      "content": "Add the shavings to your pastries, baked goods and cold puddings."
    },
    {
      "title": "Prepare the chocolate first.",
      "content": "Prepare the chocolate first. Put 1 to 1/2 ounces of chocolate into a heavy-based saucepan. Add 1 teaspoon of coconut oil or similar shortening. Place the saucepan over a low heat. Warm gently, stirring often until the chocolate and shortening has melted."
    },
    {
      "title": "Lay down a sheet of parchment paper under the glass dish.",
      "content": "Lay down a sheet of parchment paper under the glass dish. It should be longer at one end, to catch the curls once you push them off."
    },
    {
      "title": "Remove the melted chocolate from the heat.",
      "content": "Remove the melted chocolate from the heat. Spread it over the base of a glass baking dish. Use a metal spatula or the edge of a butter knife to help spread it evenly. Allow to set."
    },
    {
      "title": "Use a metal spatula to make the curls.",
      "content": "Use a metal spatula to make the curls. Hold it at a 45-degree angle and push the spatula edge into the chocolate sheet to lift up sections into curls. Push the curls onto the parchment paper at one end."
    },
    {
      "title": "Pick up the shavings with a toothpick or skewer.",
      "content": "Pick up the shavings with a toothpick or skewer. This will keep them from squashing or melting from your body heat."
    },
    {
      "title": "Use as needed to decorate cakes, cupcakes, cheesecake, etc.",
      "content": "Use as needed to decorate cakes, cupcakes, cheesecake, etc."
    },
    {
      "title": "Melt chocolate in a bowl set over simmering water.",
      "content": "Melt chocolate in a bowl set over simmering water. The chocolate must be at room temperature before using it."
    },
    {
      "title": "Remove the melted chocolate.",
      "content": "Remove the melted chocolate. Allow it to cool for one minute."
    },
    {
      "title": "Spread oil lightly onto the work surface.",
      "content": "Spread oil lightly onto the work surface. Pour the melted chocolate onto this surface and spread out thinly with a metal spatula. Ensure that it is evenly spread across the whole surface."
    },
    {
      "title": "Let the chocolate cool.",
      "content": "Let the chocolate cool. When it is about to set, hold a long and sharp knife upright, holding it non-blade side, lower end, with your other hand."
    },
    {
      "title": "Drag the knife in a sawing motion towards you.",
      "content": "Drag the knife in a sawing motion towards you."
    },
    {
      "title": "Remove the shredded chocolate pieces onto baking paper and leave to fully harden.",
      "content": "Remove the shredded chocolate pieces onto baking paper and leave to fully harden."
    },
    {
      "title": "Set up a sheet of parchment paper.",
      "content": "Set up a sheet of parchment paper. Place the grater or shredder over the top."
    },
    {
      "title": "Find a suitable large bar of chocolate.",
      "content": "Find a suitable large bar of chocolate."
    },
    {
      "title": "Grate the chocolate against the grater's holes.",
      "content": "Grate the chocolate against the grater's holes. Allow the chocolate pieces to gather on the parchment paper at the base. Large grater holes produce large shaved chocolate pieces. Smaller grater holes produce fine or powdery chocolate shavings."
    },
    {
      "title": "Continue until you have as much as needed.",
      "content": "Continue until you have as much as needed."
    },
    {
      "title": "Transfer the grated or shredded chocolate to the food items as needed.",
      "content": "Transfer the grated or shredded chocolate to the food items as needed."
    }
  ]
}