{
  "url": "https://www.wikihow.com/Pry-off-a-Watch-Backing-Without-Proper-Tools",
  "title": "3 Easy Ways to Open the Back of a Watch With Household Items",
  "steps": [
    {
      "title": "Try your thumbnail on cheap, simplistically-designed watches.",
      "content": "Try your thumbnail on cheap, simplistically-designed watches. Some watch backings can be opened by prying a simple hinge in the back open. Inspect your watch to determine whether the backing will make this possible. If the backing has no screws, it can likely be opened with your thumbnail. This method will only work if your watch backing has no screws. While you may be able to use other fingernails, your thumbnail is usually the largest and strongest."
    },
    {
      "title": "Locate your watch's hinge.",
      "content": "Locate your watch's hinge. On simple watches, the hinge will look like a small indentation along the edge of the watch's back. This is where you will place your thumbnail to pry off the backing. Do not set your watch down as you work. Keep it in your other hand so you can maneuver it while prying it open."
    },
    {
      "title": "Insert your thumbnail underneath the backing hinge and lift.",
      "content": "Insert your thumbnail underneath the backing hinge and lift. As you work, your nail should face the back of the watch. Lift slowly to avoid chipping or bending your thumbnail. With pressure and patience, the backing should pop off. If the backing does not easily come off, avoid using your thumbnail so you don't damage it. [1] X Research source This method is best done if you have long, healthy fingernails."
    },
    {
      "title": "Use a razor blade as an alternative.",
      "content": "Use a razor blade as an alternative. If the hinge is tight or your thumbnail is too short to pry off the backing, a flat razor blade can work as well. Place the razor blade's edge in through the hinge opening and lift until it is pried off. If there is no indentation but a space between the back and casing, you can use this method with a razor blade. Small kitchen knives can work in a pinch if you don't have a razor blade."
    },
    {
      "title": "Purchase a soft, mashable rubber ball.",
      "content": "Purchase a soft, mashable rubber ball. Rubber balls often have enough grip to pry off watch backings. Choose a rubberized ball that is both squishy and tacky so it can latch onto your watch's back. Stress balls can work as a cheaper alternative. Avoid rubber balls made from hard materials. The ball needs to be soft and pliable so it can grip the backing. A super-cheap alternative is to reverse-wrap a new tennis ball with duct tape until completely covered. The duct tape adhesive is very sticky and the tennis ball gives you something to grip onto."
    },
    {
      "title": "Place the watch down on a flat surface.",
      "content": "Place the watch down on a flat surface. Although you can hold the watch in your hand while you work, placing it on a flat surface will allow you to work more comfortably and efficiently. If your watch is expensive or fragile, set a towel down for the watch to rest on while you work."
    },
    {
      "title": "Press the ball firmly into the watch's backing.",
      "content": "Press the ball firmly into the watch's backing. The rubber ball will need to press itself firmly against the backing, particularly the screw notches. Apply firm pressure as you move the ball against the backing so the ball can establish a strong grip. Apply pressure to the watch in increments to avoid accidentally damaging your watch."
    },
    {
      "title": "Twist the ball counterclockwise.",
      "content": "Twist the ball counterclockwise. Most watch models will loosen when turned counterclockwise and tighten when turned in the opposite direction. As you turn the watch, the backing's screws should loosen. Twist quickly and firmly to keep the rubber ball's grip firm on the backing."
    },
    {
      "title": "Use the ball to loosen, but not remove, the backing.",
      "content": "Use the ball to loosen, but not remove, the backing. Once the backing is loose enough, you can use your fingers to remove it entirely. Twist the backing with your fingers in the same counterclockwise movement until it and the screws come off. Keep the backing and screws in a safe place so you do not lose them. [2] X Research source"
    },
    {
      "title": "Use the rubber ball again to put the backing on afterward.",
      "content": "Use the rubber ball again to put the backing on afterward. You'll want to make sure to secure the backing on tightly once you have done whatever you needed to while removing it. Place the cover on your watch's back and press the rubber ball firmly against it. Turn swiftly in a clockwise motion to tighten the backing up again. [3] X Research source"
    },
    {
      "title": "Use scissors to loosen extremely tight backings.",
      "content": "Use scissors to loosen extremely tight backings. Rubber balls may not provide enough grip if your backing is screwed on tightly enough. Scissor tips are usually small enough to reach your watch's screws and twist them off as a specialized screwdriver would. Choose a pair of scissors with blunt tips to avoid injuring yourself if they slip."
    },
    {
      "title": "Put the watch down on a firm, flat surface.",
      "content": "Put the watch down on a firm, flat surface. Placing the watch on a flat surface will allow you to work safely while handling the scissors. If your watch is expensive or fragile, set a soft towel down for the watch to rest on while you take out the screws."
    },
    {
      "title": "Locate the watch's screw notches.",
      "content": "Locate the watch's screw notches. These notches mark the locations of your screws. Open the handle of the scissors, then put one scissor tip into a screw notch as you prepare to unscrew it. Make sure you place the scissor end firmly inside the notch to avoid losing your grip as you turn it. [4] X Research source"
    },
    {
      "title": "Twist the notches in a counterclockwise movement.",
      "content": "Twist the notches in a counterclockwise movement. Just as you would with the rubber ball method, turn the scissors in a counterclockwise movement to loosen each screw. Once you've removed your first screw, repeat this method on the remaining notches. [5] X Research source When you're ready to put the backing on again, you will use the same method but twist in a clockwise movement."
    },
    {
      "title": "Try using a precision screwdriver as an alternative.",
      "content": "Try using a precision screwdriver as an alternative. If you can't get the hang of or would prefer not to use scissors, purchase a precision screwdriver from your local hardware store. Precision screwdrivers are usually small enough to unscrew watch backings without having to purchase specialized tools."
    }
  ]
}