{
  "url": "https://www.wikihow.com/Play-Phasmophobia-on-Oculus-Quest-2",
  "title": "How to Play Phasmophobia VR on Oculus Quest 2: Easy Guide",
  "steps": [
    {
      "title": "Download the Oculus app onto your computer.",
      "content": "Download the Oculus app onto your computer. You can find the download on the official website here . This program is needed to connect your Oculus headset to your computer. You should already have Steam and Phasmophobia downloaded. If you don't, install it first . [1] X Research source"
    },
    {
      "title": "Download SteamVR",
      "content": "Download SteamVR . You can find this in the Steam library. Search for \"SteamVR\" and download it to your computer."
    },
    {
      "title": "Open the Oculus app on your computer.",
      "content": "Open the Oculus app on your computer. This should be open while you connect your Oculus via Air Link. If you're using a wired cable, simply plug your Oculus into your computer to connect it."
    },
    {
      "title": "Put on the Oculus headset and navigate to Settings.",
      "content": "Put on the Oculus headset and navigate to Settings . This will be in the top-left corner of the Apps window. [2] X Research source"
    },
    {
      "title": "Toggle on Air Link.",
      "content": "Toggle on Air Link . This will be on the Features tab. [3] X Research source"
    },
    {
      "title": "Select Continue.",
      "content": "Select Continue . A new window will open with a menu."
    },
    {
      "title": "Select Oculus Air Link.",
      "content": "Select Oculus Air Link . This is the square on the right side of the window."
    },
    {
      "title": "Select your computer name and select Pair.",
      "content": "Select your computer name and select Pair . You should see your computer name underneath the Available PCs header. [4] X Research source This will take a moment to connect. When it does, you'll see a code on both your computer and headset."
    },
    {
      "title": "Select Confirm.",
      "content": "Select Confirm . Make sure the codes match. If they do not match, select Cancel and try again. Make sure you're selecting the correct computer. [5] X Research source Your Oculus headset is now connected to your computer."
    },
    {
      "title": "On the Oculus, select Desktop.",
      "content": "On the Oculus, select Desktop . This should be in the row of apps at the bottom of the screen. You'll need to use the Oculus to open the necessary programs through your computer."
    },
    {
      "title": "On the Oculus, find SteamVr and select Launch.",
      "content": "On the Oculus, find SteamVr and select Launch . SteamVR will open with a completely new background. The window will show your Steam library. [6] X Research source"
    },
    {
      "title": "Select Phasmophobia.",
      "content": "Select Phasmophobia . This may take a moment depending on your computer. The game will launch on your Oculus headset. You can now play Phasmophobia in VR. For the best, immersive experience, use headphones as you play."
    }
  ]
}