{
  "url": "https://www.wikihow.com/Polish-Laminate-Floors",
  "title": "How to Polish Laminate Floors",
  "steps": [
    {
      "title": "Sweep the floor before you polish it.",
      "content": "Sweep the floor before you polish it. Always sweep the floor to avoid scratching the laminate with any dirt or stones that may be on the floor. Use a broom to sweep the entire laminate floor until there is no trace of dust or dirt. [1] X Research source If you don’t have a broom, use a brush pan and sweeper instead. If the floor is muddy or grimy, use a mop to clean it before you sweep. If you like, you can mop with your own all-natural cleanser made of equal parts water, vinegar, and rubbing alcohol. Just make sure to wipe your floor clean and let it dry completely before applying the polish."
    },
    {
      "title": "Dampen a polishing cloth with warm water.",
      "content": "Dampen a polishing cloth with warm water. Saturate your polishing cloth with warm water and then squeeze it out to remove all the drips. If you don’t have a polishing cloth, use a microfiber cloth instead, as this will achieve a similar result. [2] X Research source If your mop has a polishing attachment, use this instead of a polishing cloth. Make sure the cloth is damp, but not sopping wet. Too much moisture can damage and warp your laminate floor."
    },
    {
      "title": "Squirt a line of laminate polish over the length of your laminate.",
      "content": "Squirt a line of laminate polish over the length of your laminate. Look for a floor polish that is specifically designed for laminate flooring. This ensures that the polish won’t damage the delicate surface. To apply the polish, simply squeeze it out of the bottle onto the floor in a wiggly line down the length of your laminate floor. [3] X Research source If you haven’t used the laminate polish for a while, shake it before use. You can purchase laminate polish from a store that sells cleaning supplies."
    },
    {
      "title": "Rub the polish over the entire laminate floor.",
      "content": "Rub the polish over the entire laminate floor. Use your damp polishing cloth to rub the polish into the floor. Start by wiping the polish back and forth against the grain of the laminate. Then, rub the polishing cloth back and forth with the grain of the laminate flooring. This helps to prevent streak marks. [4] X Research source Don’t worry if the floor looks a little shiny or oily after you have applied the polish, as this is normal and will fade as it dries."
    },
    {
      "title": "Leave the polish to dry for 24 hours.",
      "content": "Leave the polish to dry for 24 hours. If possible, avoid walking on the laminate. If this is not possible, simply leave it to dry for as long as possible. Avoid putting any heavy objects on the polish while it dries, as this can create an uneven looking surface. [5] X Research source If possible, keep pets away from the polish for 24 hours while it dries."
    },
    {
      "title": "Measure olive oil, vinegar, and water into a bottle.",
      "content": "Measure olive oil, vinegar, and water into a bottle. Measure 2 tablespoons (30 mL) of olive oil, 2 cups (470 mL) of warm water, and 1 tablespoon (15 mL) of distilled white vinegar into a bottle. These ingredients help to both clean and shine your laminate flooring. [6] X Research source Purchase distilled white vinegar from a health food store. If you don’t have white vinegar, use apple cider vinegar instead. You can also substitute ammonia for vinegar. Use 1 part ammonia for every 3 parts water. This home-made floor polish can be used in place of store-bought polish."
    },
    {
      "title": "Add 15 drops of your favorite essential oil.",
      "content": "Add 15 drops of your favorite essential oil. This is a great way to make your floors and house smell amazing. Add 15 drops of 1 essential oil or mix together a few of your favorites. Orange, lemongrass, lime, and lavender are all beautiful-smelling options. [7] X Research source If you don’t have any essential oils, simply skip this step."
    },
    {
      "title": "Shake the bottle to combine the ingredients.",
      "content": "Shake the bottle to combine the ingredients. Make sure that the lid is firmly on the bottle and then shake it up and down vigorously until the ingredients are combined. Shake the bottle each time that you use the polish to ensure that the ingredients are mixed. [8] X Research source"
    }
  ]
}