{
  "url": "https://www.wikihow.com/Remove-Blades-from-a-Razor",
  "title": "How to Remove Blades from a Razor",
  "steps": [
    {
      "title": "Replace the blade when you feel tugging or pulling as you shave.",
      "content": "Replace the blade when you feel tugging or pulling as you shave. Sometimes, it’s hard to tell when to change the blade in a safety razor. Pay attention to the first few strokes of your shave. If it feels like the blade is pulling on your hair, it’s time to change the blade! [5] X Expert Source Woody Lovell Professional Barber Expert Interview. 28 January 2020. If you notice that after you shave your face feels irritated or there are razor bumps and marks, this is a sign you should change the blades before you shave again. [6] X Expert Source Woody Lovell Professional Barber Expert Interview. 28 January 2020. Never test the blade on your hand, you can cut yourself or damage the razor if it isn’t already dull."
    },
    {
      "title": "Twist the handle of the razor counterclockwise to expose the blade.",
      "content": "Twist the handle of the razor counterclockwise to expose the blade. Hold the handle in your dominant hand and use the other hand to hold the head of the razor. Then, rotate the handle to the left until the head begins to the separate from the handle or the top of the head opens up to reveal the blade, depending on the razor. [7] X Research source There are a few different types of safety razors, and the blade comes out differently on some of them. Pay attention to the head of the razor as you’re twisting the handle. Be careful not to tip the razor on its side or hold it upside-down. The razor can fall out of the head easily in those positions."
    },
    {
      "title": "Remove the current blade from the head of the razor.",
      "content": "Remove the current blade from the head of the razor. Carefully using your fingers or a butter knife, lift the side of the blade to take it out of the head. Try to avoid touching the sharp edges of the blade as you remove it. [8] X Research source When you remove the blade, you can recycle it to reduce waste!"
    },
    {
      "title": "Place a new blade into the open slot in the head.",
      "content": "Place a new blade into the open slot in the head. Select a new blade to replace the old one, and carefully slide it into the slot on the head. The blade will normally have words or arrows printed on it to ensure that it’s facing the right direction. [9] X Trustworthy Source U.S. Transportation Security Administration U.S. government agency responsible for ensuring safety by setting and enforcing travel protocols Go to source If you don’t have a holder or cartridge for your extra blade, be very careful when handling the blade."
    },
    {
      "title": "Twist the handle clockwise to close the head and secure the blade.",
      "content": "Twist the handle clockwise to close the head and secure the blade. Once the blade is in the razor, replace any parts that might cover the blade, and twist the handle the opposite direction to tighten the head. Carefully tilt the razor onto its side to ensure that the blade is secure and won’t fall out of the head. [10] X Trustworthy Source U.S. Transportation Security Administration U.S. government agency responsible for ensuring safety by setting and enforcing travel protocols Go to source Some handles will lock into place once the head is completely secure, but most will not."
    }
  ]
}