{
  "url": "https://www.wikihow.com/Sew-a-Fabric-Book-Cover",
  "title": "How to Sew a Fabric Book Cover",
  "steps": [
    {
      "title": "Gather your fabric and sewing supplies.",
      "content": "Gather your fabric and sewing supplies."
    },
    {
      "title": "Measure the length and width of an open book",
      "content": "Measure the length and width of an open book"
    },
    {
      "title": "Cut fabric to your desired length and width, allowing for a half-inch seam allowance on all sides.",
      "content": "Cut fabric to your desired length and width, allowing for a half-inch seam allowance on all sides. Add an additional two inches in length for \"each\" pocket, which will be created at both ends of the cover. This should create a long rectangle."
    },
    {
      "title": "Cut an identical piece of iron-on interfacing and iron it onto the wrong side of the fabric.",
      "content": "Cut an identical piece of iron-on interfacing and iron it onto the wrong side of the fabric."
    },
    {
      "title": "Turn over the two short sides of the rectangle twice, to form quarter-inch hemlines.",
      "content": "Turn over the two short sides of the rectangle twice, to form quarter-inch hemlines. Stitch them in place."
    },
    {
      "title": "With right sides together, fold over two inches at both ends of the rectangle, to create pockets.",
      "content": "With right sides together, fold over two inches at both ends of the rectangle, to create pockets. Stitch the upper and lower seams of each pocket."
    },
    {
      "title": "Turn the pockets right side out and iron them flat.",
      "content": "Turn the pockets right side out and iron them flat."
    },
    {
      "title": "Between the two pockets, turn over the remaining raw edges twice, to form quarter-inch hemlines.",
      "content": "Between the two pockets, turn over the remaining raw edges twice, to form quarter-inch hemlines. Stitch them in place."
    },
    {
      "title": "Slide the front and back cover of your book into the pockets.",
      "content": "Slide the front and back cover of your book into the pockets."
    }
  ]
}