{
  "url": "https://www.wikihow.com/Paint-Screen-Frames",
  "title": "How to Paint Screen Frames",
  "steps": [
    {
      "title": "Set up a ladder if your screen frames are out of reach.",
      "content": "Set up a ladder if your screen frames are out of reach. If you’re painting screen frames that are on the ground floor, it’s not necessary to use a ladder. But if the frames are too high to reach safely, place a ladder up against the wall of your home and have someone stand at the bottom to keep it steady. [1] X Research source You may need a small stepladder to reach the top of some screen frames on the ground floor. Use a ladder with an attachable tray to prop your supplies on so you’re not carrying everything at once. If you’re painting screen frames indoors, set down a drop cloth beneath them so you don’t get paint or primer on the floor. [2] X Expert Source Jeff Baldwin Residential Painter Expert Interview. 1 March 2021."
    },
    {
      "title": "Remove the screen frames if you'd like to clean and paint both sides.",
      "content": "Remove the screen frames if you'd like to clean and paint both sides. Most people paint the screen frames without removing them, but if you'd like to work on them on a flat surface, this is okay too. Press up on the upper section of the screen frame and lift the bottom portion out to the front or back to remove it. [3] X Research source Most screen frames can easily pop out, but if they don't, it might be best to leave them installed. Place a sheet or clean piece of plastic over your flat work surface and place the screen frames on top of them."
    },
    {
      "title": "Wash the screen frames using soapy water and a sponge.",
      "content": "Wash the screen frames using soapy water and a sponge. Fill a bucket with warm water and a regular dish soap to create suds. Dip a clean sponge or rag into the water and wipe down the screen frames to get rid of any dirt. [4] X Expert Source Jeff Baldwin Residential Painter Expert Interview. 1 March 2021. Rinse the sponge or rag in the water every few swipes to clean it so you're not spreading around dirty water. [5] X Research source It’s okay to just use a damp rag and skip the soap, if desired. Give the screen frames a second wipe-down to remove any extra soap, if needed. Use a garden hose to rinse off the suds more quickly."
    },
    {
      "title": "Use an 80-grit sanding sponge to remove imperfections from the frame.",
      "content": "Use an 80-grit sanding sponge to remove imperfections from the frame. Purchase a medium sanding sponge from your local home improvement store. Rub the sanding sponge against the screen frame using back and forth strokes, going along the entire frame. This will get rid of any bumps, old paint, or rust. Wipe off any dust from sanding using a clean cloth. [6] X Research source It's not necessary to remove all of the paint if your frame is made of metal, but sanding off as much old paint as possible on a wooden frame is a good idea. Avoid pressing down with lots of pressure when you’re using the sanding sponge—using a light pressure works perfectly."
    },
    {
      "title": "Dry the frame using a clean towel or cloth.",
      "content": "Dry the frame using a clean towel or cloth. Use a clean, dry towel to go along the screen frame, wiping away any extra moisture left over from washing the screen frame using circular movements. This will also help get rid of any dust from the sanding. Wipe the frame thoroughly to ensure it’s entirely dry, otherwise the primer won’t stick properly. [7] X Research source If the towel or cloth you're using to dry the frame gets too damp, use another dry one to make sure all of the moisture gets wiped up."
    },
    {
      "title": "Cover the screen with masking paper to avoid getting paint on it.",
      "content": "Cover the screen with masking paper to avoid getting paint on it. Rip off a piece of masking paper long enough to cover the length of one of the screen's sides. Use painter's tape to attach the masking paper along the inner edge of the frame to protect the screen. Keep placing pieces of masking paper along the inner edge of the screen and securing them evenly with tape to keep off any paint and primer. [8] X Research source Create clean lines between the frame and the screen so your paint job is straight. Purchase painter’s tape and brown masking paper from your local hardware store or online. Choose masking paper that’s at least 9 inches (23 cm) long so it covers as much of the screen as possible."
    },
    {
      "title": "Put painter’s tape along the rest of the edges of the screen frame.",
      "content": "Put painter’s tape along the rest of the edges of the screen frame. Check to make sure the painter’s tape is along the entire inner edge of the screen frame where the screen is covered with paper. [9] X Research source Line the rest of the edges of the frame with painter’s tape too, covering any areas that you don’t want painted. [10] X Expert Source Jeff Baldwin Residential Painter Expert Interview. 1 March 2021. Press the edges of the tape down firmly to make sure they don’t come up when you’re priming and painting."
    },
    {
      "title": "Purchase a rust-resistant primer to go on metal screen frames.",
      "content": "Purchase a rust-resistant primer to go on metal screen frames. Visit your local home improvement store to find a spray or liquid paint primer to use on your metal frames. Look for primers that are labeled as working well on metal surfaces or have the word \"rust-resistant\" on them to find a good option. [11] X Research source Spray paints are great for metals due to their sleek surface and generally don't take as long to apply as liquid paints. [12] X Expert Source Jeff Baldwin Residential Painter Expert Interview. 1 March 2021. A liquid paint primer is applied to the metal using a paint brush."
    },
    {
      "title": "Pick out a wood primer for wooden screen frames.",
      "content": "Pick out a wood primer for wooden screen frames. There are lots of different options when it comes to wood primers, such as ones that come in a spray form or ones in a liquid paint form that you apply with a paint brush. Visit a local home improvement store to find primers labeled as working on wooden surfaces to use on your screen frames. [13] X Research source A liquid paint primer is great for getting into the nooks and crannies of wood and gives you a little more control."
    },
    {
      "title": "Hold a can of primer 5–8 in (13–20 cm) away from the screen if you’re spraying it.",
      "content": "Hold a can of primer 5–8 in (13–20 cm) away from the screen if you’re spraying it. If you purchased a spray paint primer, shake it well before applying it. Hold the can at least 5 in (13 cm) away from the screen so you cover the surface evenly and start spraying the primer along the frame's surface. Keep pressing down on the nozzle while moving the can around the screen slowly, spraying an even layer. [14] X Research source Avoid holding the can of primer in one spot as you’re spraying it so it doesn't create drips."
    },
    {
      "title": "Apply a thin layer of primer with a brush if you’re painting it on.",
      "content": "Apply a thin layer of primer with a brush if you’re painting it on. If you purchased a regular paint primer, shake the can before opening it or stir the primer using a wooden stick so it’s properly mixed. Dip a 1 in (2.5 cm) paint brush into the paint and paint the primer onto the screen frame using back and forth parallel strokes. Distribute the paint along the frame evenly using the brush until you create a thin layer. [15] X Research source Wipe off any extra paint against the side of the can before you apply it to the screen. Using parallel strokes will make the paint look as even and flat as possible. If you're painting a wooden screen frame, paint going with the grain of the wood. Use a paintbrush that's bigger or smaller if needed, depending on the thickness of your screen frames."
    },
    {
      "title": "Let the coat of primer dry for 24 hours before applying another one.",
      "content": "Let the coat of primer dry for 24 hours before applying another one. After 24 hours, apply another coat of primer if you'd like. Read the instructions on your can of primer to see if they recommend applying a second coat or if one coat will work fine. [16] X Research source If you're priming the other side of the screen as well, wait for the primer to dry completely before flipping it over."
    },
    {
      "title": "Use a paint that adheres to metal to go on metal screen frames.",
      "content": "Use a paint that adheres to metal to go on metal screen frames. Pick out a spray paint if you used a spray primer or a liquid paint if you used a liquid primer. Select the paint color you'd like to use on your screen frames and check the labeling to be sure the paint works on metal surfaces. [17] X Research source The paint label will tell you whether it can be used on metal or wood—look for wording like “rust-resistant” to help you pick one out for metals."
    },
    {
      "title": "Apply a wood paint to wooden frames.",
      "content": "Apply a wood paint to wooden frames. If you used a spray primer on your wood, it's best to use a spray paint color, while a liquid paint goes best on top of a liquid primer. Choose a paint color in your desired color and make sure the label says that it works well on wooden surfaces. [18] X Research source Visit your local hardware store or home improvement store to find a paint for wood. If you’re painting screen frames inside, use an interior paint. Outdoor screen frames should be coated in an exterior paint."
    },
    {
      "title": "Hold the can of paint at least 5 in (13 cm) from the screen to spray it.",
      "content": "Hold the can of paint at least 5 in (13 cm) from the screen to spray it. Apply the paint color to the screen frame just like you did the primer, holding the can away from the surface as you press down on the nozzle so it covers the frame evenly. Move the can along the frame slowly as you spray and cover it in a smooth layer of paint. [19] X Research source Shake the can of spray paint thoroughly before applying it. Go along each edge of the screen frame in as straight of a line as possible for the best look. Don’t worry if the frame isn’t completely covered after one layer—you can apply another layer after the first one dries."
    },
    {
      "title": "Cover the frames using a paint brush if you're using liquid paint.",
      "content": "Cover the frames using a paint brush if you're using liquid paint. Shake the can of paint before removing the lid or use a wooden stick to stir it, mixing the paint evenly. Dip your paint brush into the paint and apply the paint color to the frames using back and forth strokes that are all going the same direction. Go along each edge of the frame, dabbing the surface with the brush to get into any nooks and crannies. [20] X Research source If you're painting a wooden screen frame, paint going with the grain of the wood for the best look. Wipe off any excess paint from your brush using the side of the paint can. Apply thin, even coats and don't worry if the primer is still visible—you can add more coats to cover it up later on."
    },
    {
      "title": "Wait 4 hours for the paint to dry before applying a second coat.",
      "content": "Wait 4 hours for the paint to dry before applying a second coat. Set a timer for 4 hours so you know when your screen frames are ready for another coat of paint. Apply the second coat of paint just like you did the first, spreading the paint on evenly and avoiding any drips. [21] X Research source If you do see drips on the frames, use a regular paint brush or a foam brush to remove them."
    },
    {
      "title": "Peel off the painter’s tape and paper carefully.",
      "content": "Peel off the painter’s tape and paper carefully. Pull the painter's tape off slowly at an angle so it comes off without damaging the paint. Take off all of the paper as well, revealing a clean screen. [22] X Research source Throw away the painter’s tape and paper in the trash. Let the paint dry for 24 hours after you apply the last coat. If you're painting the other side of the screen too, wait for the most recent coat to dry completely before you flip the screen over and paint the back."
    }
  ]
}