{
  "url": "https://www.wikihow.com/Remove-a-Background-from-the-Desktop-Background-List-(Windows)",
  "title": "Remove a Background from the Desktop Background List (Windows)",
  "steps": [
    {
      "title": "Right-click the desktop background.",
      "content": "Right-click the desktop background. Right-click anywhere on your desktop where there are no icons. This displays a pop-up menu."
    },
    {
      "title": "Click Personalize.",
      "content": "Click Personalize . It's near the bottom of the menu that appears when you right-click the desktop background. This opens the Background settings menu. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Background.",
      "content": "Click Background . It's in the panel on the left (Windows 10) or center (Windows 11) of the settings menu. This displays the Windows background settings."
    },
    {
      "title": "Ensure \"Picture\" is selected below \"Background\".",
      "content": "Ensure \"Picture\" is selected below \"Background\". Use the drop-down menu below \"Background\" to select \"Picture.\" This allows you to select a single image to use as a background. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Depending on your version of Windows, you might see this menu next to the “Personalize your background” header instead. Selecting \"Slideshow\" allows you to select an entire folder of images to use as rotating background images."
    },
    {
      "title": "Click Browse.",
      "content": "Click Browse . It's below the list of recently used background images. This opens a file browser that allows you to select an image to use as a background. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source This option may say Browse photos instead, depending on your version of Windows."
    },
    {
      "title": "Navigate to the folder containing the image you want to delete.",
      "content": "Navigate to the folder containing the image you want to delete. You can use any image on your computer as a background image. Navigate to the one you want to delete. To navigate to the location of Windows' default background images, click \" C:\\ (This PC) \" in the panel to the left (or This PC > Windows (C:) in Windows 11). Then open the Windows folder followed by the Web folder. Here you will find a variety of folders containing the default background images for Windows."
    },
    {
      "title": "Right-click an image you want to delete.",
      "content": "Right-click an image you want to delete. This displays a pop-up menu next to the image."
    },
    {
      "title": "Click Delete.",
      "content": "Click Delete . It's in the menu that pops up when you right-click a file. This deletes the file and sends it to the Recycling Bin. To permanently delete the images files from the Recycling Bin, right-click the Recycling Bin on your desktop and click Empty Recycling Bin ."
    },
    {
      "title": "Remove the picture from your recents (optional).",
      "content": "Remove the picture from your recents (optional). If deleting the picture from the source doesn't remove it from the suggestions underneath the menu, you can easily delete it by selecting 5 new background pictures. This will force the old picture out of the recents. Do the following: Click Browse underneath the suggested pictures. Select a new photo. Click Choose picture . Repeat four more times or until the old background is cycled out."
    },
    {
      "title": "Right-click the desktop background.",
      "content": "Right-click the desktop background. Right-click anywhere on your desktop where there are no icons. This displays a pop-up menu."
    },
    {
      "title": "Click Personalize.",
      "content": "Click Personalize . It's near the bottom of the menu that appears when you right-click the desktop background. This opens the Background settings menu."
    },
    {
      "title": "Click Lock screen.",
      "content": "Click Lock screen . It's in the panel on the left (Windows 10) or center (Windows 11) of the settings menu. This displays the Lock screen settings menu."
    },
    {
      "title": "Select \"Picture\" below \"Lock screen\".",
      "content": "Select \"Picture\" below \"Lock screen\". This opens up the file browser that allows you to select an image to use as a lock screen background image. In Windows 11, select Picture next to the Personalize your lock screen header, then click Browse photos ."
    },
    {
      "title": "Navigate to the image you want to delete.",
      "content": "Navigate to the image you want to delete. You can select any image on your PC as a lock screen image. Navigate to the folder containing the image you want to delete. To navigate to the location of Windows' default background images, click \" C: (This PC)\" (or This PC > Windows (C:) in Windows 11) in the panel to the left. Then open the Windows folder followed by the Web folder. Here you will find a variety of folders containing the default background images for Windows."
    },
    {
      "title": "Right-click an image you want to delete.",
      "content": "Right-click an image you want to delete. This displays a pop-up menu next to the image."
    },
    {
      "title": "Click Delete.",
      "content": "Click Delete . It's in the menu that pops up when you right-click a file. This deletes the file and sends it to the Recycling Bin. To permanently delete the images files from the Recycling Bin, right-click the Recycling Bin on your desktop and click Empty Recycling Bin ."
    },
    {
      "title": "Remove the picture from your recents (optional).",
      "content": "Remove the picture from your recents (optional). If deleting the picture from the source doesn't remove it from the suggestions underneath the menu, you can easily delete it by selecting 5 new background pictures. This will force the old picture out of the recents. Do the following: Click Browse (or Browse photos ) underneath the suggested pictures. Select a new photo. Click Choose picture . Repeat four more times or until the old background is cycled out."
    },
    {
      "title": "Right-click the desktop background.",
      "content": "Right-click the desktop background. Right-click anywhere on your desktop where there are no icons. This displays a pop-up menu."
    },
    {
      "title": "Click Personalize.",
      "content": "Click Personalize . It's near the bottom of the menu that appears when you right-click the desktop background. This opens the Background settings menu."
    },
    {
      "title": "Click Themes.",
      "content": "Click Themes . It's in the panel on the left (Windows 10) or center (Windows 11) of the settings menu. This opens the Themes settings menu. In addition to a background image, themes also contain a color scheme, custom cursors, and custom sounds for Windows. The default themes that came pre-installed on Windows can't be deleted."
    },
    {
      "title": "RIght-click one of the themes.",
      "content": "RIght-click one of the themes. Themes are listed below the header that says \"Change Theme\" in the Themes settings menu. In some versions of Windows, this may say “Current theme” instead. Right-clicking a theme in this list displays a pop-up."
    },
    {
      "title": "Click Delete.",
      "content": "Click Delete . It's in the pop-up that appears when you right-click a theme. This deletes the theme. If the text that says \"Delete\" is greyed out, you can't delete the theme."
    },
    {
      "title": "Open the Registry Editor.",
      "content": "Open the Registry Editor. Press Win + R to open the Run menu. Type \"regedit\" and press Enter . If asked for permission, click Yes . Make sure to backup your registry if you haven't used the registry before. You can do so by clicking File > Export > select a save location and name > Save ."
    },
    {
      "title": "Navigate to the wallpaper location.",
      "content": "Navigate to the wallpaper location. The wallpaper folder is typically found at the following file path: HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Wallpapers"
    },
    {
      "title": "Select an item.",
      "content": "Select an item. The images should be labeled as BackgroundHistoryPath0 , BackgroundHistoryPath1 , and so on. To select more than one item, hold down CTRL and click each item."
    },
    {
      "title": "Right-click the items and select Delete.",
      "content": "Right-click the items and select Delete . This will delete the wallpapers from the registry."
    },
    {
      "title": "Restart your computer.",
      "content": "Restart your computer. The backgrounds should be deleted."
    }
  ]
}