{
  "url": "https://www.wikihow.com/Monopoly-Jail-Rules",
  "title": "A Complete Guide to the Rules for Jail in Monopoly",
  "steps": [
    {
      "title": "When sent to Jail, you must immediately place your token on the Jail space.",
      "content": "When sent to Jail, you must immediately place your token on the Jail space. There are three ways that the Monopoly game might prompt a player to go to Jail. The first way is by landing on the Go to Jail corner space on the board. The second one is by drawing a Go to Jail card from the Chance or Community Chest piles. The third and final way to go to Jail is to roll 3 doubles in a row on the dice (meaning both die must land with the same number facing up). [1] X Research source When a player is sent to Jail, they must place their token on the orange Jail space in the corner of the board and leave it there until they get out. Normally, as you play the Monopoly board , you collect a $200 salary every time you pass the Go space. But if you're sent to Jail, you must pass Go without collecting any money, even if your token passes Go on the way to Jail."
    },
    {
      "title": "Pay $50 to the bank on either of your next two turns.",
      "content": "Pay $50 to the bank on either of your next two turns. After you go to Jail, your turn is immediately over. On your next two turns, you have the option to pay the bank a $50 fine and get out of Jail immediately. After paying the fine, roll the dice and move your token to the number of spaces shown down the board. [2] X Research source"
    },
    {
      "title": "Roll doubles on one of your next 3 turns.",
      "content": "Roll doubles on one of your next 3 turns. If you want to try to avoid the $50 fine or stay in Jail longer, roll the dice instead. If you land doubles on any of your next 3 turns after going to Jail, you get out for free. If you still haven't rolled doubles by the third turn, you have to pay the $50 fine anyway. After that, you can move your token out of Jail and down the board the number of spaces you rolled. [3] X Research source Many players choose to roll for doubles instead of paying the fine, but sometimes, paying the fine is a bigger advantage. For example, if you go to Jail later in the game when all the properties in front of the Jail space are owned by other players, you have a chance to roll for a 7 and land on the Community Chest space where you're safe from paying rent. If you're rolling for doubles, though, and get one, then you have to move that number of spaces on the board and could land on a high-rent property instead."
    },
    {
      "title": "Use (or buy) a Get Out of Jail Free card.",
      "content": "Use (or buy) a Get Out of Jail Free card. Players can draw Get Out of Jail Free cards at random from the Chance or Community Chest card decks in the middle of the board. If you draw one at any point in the game, save it in case you go to Jail. Then, on your next turn after going to Jail, return the card to the bottom of the deck you drew it from and roll the dice to play the board. [4] X Research source If another player has a Get Out of Jail Free card, you can try to buy it from them while you're in Jail. Just be careful: the other player may try to convince you to give them more money than you can afford or trade a valuable property in exchange. Weigh the risks carefully; it may be better to try to roll doubles or pay the $50!"
    },
    {
      "title": "Set up alternate Monopoly rules to get out of Jail faster.",
      "content": "Set up alternate Monopoly rules to get out of Jail faster. Monopoly is infamous for taking up to several hours to play. Having players sit in Jail for 3 turns at a time can make it go even longer, so some players make up their own alternate rules to get out quicker. For example, you can make an alternate rule that every player must get out of Jail on their first turn by rolling doubles, paying a fine, or using a Get Out of Jail Free card. Another alternate rule to speed up the game is to give each player unlimited double rolls. That means that even if they roll 3 doubles in a row, they won't have to go to Jail."
    },
    {
      "title": "Landing on the Jail space is called “Visiting Jail,” and nothing happens.",
      "content": "Landing on the Jail space is called “Visiting Jail,” and nothing happens. If you roll the dice and the last space is on the orange Jail space in the corner, you can simply skirt around the orange part and leave your token on the green space. This is known as \"Just visiting.\" You don't have to stay there on your next turn, nor do you have to pay a fine. [5] X Research source If your roll takes you past the Jail space, just move your token over it like you would any other space."
    },
    {
      "title": "Players in Jail can still buy and sell property, including houses and hotels.",
      "content": "Players in Jail can still buy and sell property, including houses and hotels. That includes the property spaces on the board as well as the Railroad and Utility spaces. To buy or sell property in Jail, wait until it's your turn and then start negotiating with other players. You can offer money or trade properties you already own to get the ones you want. If you're looking to sell instead of buy, try to offer properties you think the other players would be interested in. [6] X Research source For example, if you want to sell a property to make some quick cash, and another player needs it to make a monopoly, offer it to that person specifically. Always try to charge more than you paid for it so you can get your investment back! Players in Jail can also buy houses and hotels for their properties. Once it's your turn, if you own all the properties in the same color (a “monopoly”), you can add houses to them and increase the rent price for other players who land on those spaces. After you've built 4 houses on each property in a monopoly, start adding hotels to really drive up the rent!"
    },
    {
      "title": "You can still collect rent while in Jail, but you don’t have to pay rent.",
      "content": "You can still collect rent while in Jail, but you don’t have to pay rent. Other players who land on any of your properties still have to pay you rent whether you're in Jail or not. This means you can still make money, even if you're stuck in Jail for 2 turns and can't get out until the third one. [7] X Research source However, being in Jail means you don't have to pay rent to anyone else. Because your token is stuck in Jail and not moving around the board, it's impossible for you to land on another player's property. So, while you're locked up, you can rest at ease knowing that you're not going to have to pay rent for a while! [8] X Research source"
    },
    {
      "title": "The benefit of being in Monopoly Jail is you don't have to pay rent.",
      "content": "The benefit of being in Monopoly Jail is you don't have to pay rent. For this reason, it can be strategically advantageous to later in the game when most or all of the properties are bought up and players are starting to build houses and hotels on them. A property with houses or hotels on it is much higher in rent than an empty space. Some players can go bankrupt in one unlucky roll of the dice! But that isn't possible when you're in Jail, and that means you still have a hope of winning the game . Take advantage of this break from paying rent by buying or selling property to build up your savings and setting up houses and hotels to increase the money you have coming in."
    },
    {
      "title": "The downside of being in Jail is you can't land on properties to buy them.",
      "content": "The downside of being in Jail is you can't land on properties to buy them. Going to Jail early in the game can cause major setbacks, especially if you have the bad luck to land in there multiple times. In the beginning of the game, your goal is to land on and buy up as much property as you can. But that's impossible to do if you're spending a lot of this critical time locked up."
    }
  ]
}