{
  "url": "https://www.wikihow.com/Set-a-Keyboard-Shortcut-to-Open-Spotlight",
  "title": "How to Set a Keyboard Shortcut to Open Spotlight",
  "steps": [
    {
      "title": "Open the Apple Menu.",
      "content": "Open the Apple Menu. On your Mac’s desktop, navigate to the Apple menu at the top left corner of the screen. Click it to open a dropdown menu. [2] X Research source"
    },
    {
      "title": "Select System Preferences….",
      "content": "Select System Preferences… . This will open a new window on your desktop. [3] X Research source"
    },
    {
      "title": "Click Keyboard.",
      "content": "Click Keyboard . Depending on your operating system, you may find this option in the middle of the of the System Preferences menu or close to the bottom, in the same row as Software Update . Click the Keyboard button once to open the Keyboard window. [4] X Research source"
    },
    {
      "title": "Choose the Shortcuts tab.",
      "content": "Choose the Shortcuts tab. Click Shortcuts in the horizontal list of tabs at the top of the Keyboard window. This will display a list of utilities and apps and the keyboard shortcuts currently associated with them. [5] X Research source"
    },
    {
      "title": "Select Spotlight from the lefthand column.",
      "content": "Select Spotlight from the lefthand column. Click Spotlight in the list of utilities on the left side of the Shortcuts window. [6] X Research source"
    },
    {
      "title": "Click Show Spotlight Search.",
      "content": "Click Show Spotlight Search . In the righthand column, select the top option, Show Spotlight Search . Once it’s selected, it will be highlighted in blue. [7] X Research source"
    },
    {
      "title": "Select the current shortcut.",
      "content": "Select the current shortcut. To the right of Show Spotlight Search , you’ll see the default shortcut combination, ⌘Space . Click on it to select it so you can type in a new combination."
    },
    {
      "title": "Type in the new shortcut you would like to use.",
      "content": "Type in the new shortcut you would like to use. Enter any combination of keys in the highlighted text input box. You’ll need to hold down all the keys at once, just like you would if you were using the shortcut command. [8] X Research source You won’t be prompted to confirm your selection. As soon as you hold down the new combination of keys, the shortcut will be automatically updated. To reset the shortcut to the default key combination, click Restore Defaults at the bottom of the window."
    }
  ]
}