{
  "url": "https://www.wikihow.com/Pick-a-Sentry-Safe-Lock",
  "title": "How to Pick a Sentry Safe Lock",
  "steps": [
    {
      "title": "Purchase a rare earth magnet with a 125 pounds (57 kg) pull force.",
      "content": "Purchase a rare earth magnet with a 125 pounds (57 kg) pull force. You can buy a rare earth magnet with enough pull force online for between $20 and $50 (USD). Choose a disc shaped magnet that’s a little larger than a hockey puck, and ensure it has the right pull force. [2] X Research source"
    },
    {
      "title": "Do not put your fingers between the magnet and metal.",
      "content": "Do not put your fingers between the magnet and metal. Use caution when handling a powerful magnet. You could suffer a serious injury if your finger or other body part gets caught between a magnet and metal. [3] X Research source A rare earth magnet with a 125 pounds (57 kg) pull force could break a finger. When you hold it near the safe, grasp it from its sides. Keep your fingers clear of the broad, circular face that will attract and cling to the safe. Keep the magnet away from credit or debit cards, phones, tablets, computers, and other electronic devices. Additionally, anyone who has a pacemaker must avoid coming into contact with a strong magnet. Store the magnet in a secure box out of reach of children. While you can store it in a box made of a magnetic metal, it'll be easier to lift it out of a non-magnetic container."
    },
    {
      "title": "Put the magnet in an old sock.",
      "content": "Put the magnet in an old sock. A sock will make easier to slide the magnet over the safe’s surface. [4] X Research source"
    },
    {
      "title": "Hold the magnet to the top left corner of the safe.",
      "content": "Hold the magnet to the top left corner of the safe. There’s a part called the solenoid in the safe’s top left corner that springs the lock mechanism when it’s electronically triggered. Holding the magnet to this part of the safe will trigger the solenoid. [5] X Research source"
    },
    {
      "title": "Grasp the handle and wiggle the magnet until the safe opens.",
      "content": "Grasp the handle and wiggle the magnet until the safe opens. Hold the magnet at the top left corner with one hand and the safe’s handle with the other. Slide the magnet around the top corner slightly as you pull the handle. Within a few seconds, the magnet will trigger the solenoid and unlock the safe. [6] X Research source"
    },
    {
      "title": "Insert a small metal nail file into the keyhole.",
      "content": "Insert a small metal nail file into the keyhole. Find a metal nail file with a pointed end that’s small enough to fit into the keyhole. Slide the file pointed side down all the way into the hole. [7] X Research source If you don’t have a nail file, you can use a small flat-head screwdriver. [8] X Research source"
    },
    {
      "title": "Jiggle the file up and down until you hear a click.",
      "content": "Jiggle the file up and down until you hear a click. After inserting the file as far as possible into the keyhole, wiggle it up and down to release the pins. You’ll hear a click when you’ve released the pins. [9] X Research source It might take some time, so keep jiggling until you hear the pins release."
    },
    {
      "title": "Turn the file in the direction the lock opens when you hear a click.",
      "content": "Turn the file in the direction the lock opens when you hear a click. As soon as you hear a click, twist the file to open the lock. SentrySafe locks usually turn to the left. [10] X Research source"
    },
    {
      "title": "Cut a straightened paperclip in half.",
      "content": "Cut a straightened paperclip in half. Straighten a paperclip, then use a pair of needle-nose pliers with a wire cutter to cut it in half. [11] X Research source"
    },
    {
      "title": "Pinch 1⁄4 inch (0.64 cm) of an end of the paperclip and fold it over.",
      "content": "Pinch 1 ⁄ 4 inch (0.64 cm) of an end of the paperclip and fold it over. Use the pliers to pinch the end of one of the halves. Fold the end about 1 ⁄ 4 inch (0.64 cm) from its tip. The folded end should be completely closed, so it’s flush with the half’s remaining length. [12] X Research source"
    },
    {
      "title": "Bend the folded end at a 90 degree angle to create a tension tool.",
      "content": "Bend the folded end at a 90 degree angle to create a tension tool. Grab the folded end with the pliers and bend it at the fold's tip. When you're done, this half of the paperclip should look like a straight wire with a tiny hook bent at a right angle on one end. [13] X Research source You’ll insert the tension tool into the bottom of the keyhole and use it to turn the lock open."
    },
    {
      "title": "Bend the other half’s end at a 45 degree angle to make a picking tool.",
      "content": "Bend the other half’s end at a 45 degree angle to make a picking tool. Hold an end of the other half of the paperclip with your pliers about 1 ⁄ 8 inch (0.32 cm) from the tip. Fold this length at a 45 degree angle. [14] X Research source The picking tool is what you’ll use to rake and release the pins."
    },
    {
      "title": "Insert the tension tool into the bottom of the keyhole.",
      "content": "Insert the tension tool into the bottom of the keyhole. Slide the tension tool in with the hook facing down. Push it into the keyhole’s shear line, or the bottom of the hole, until you encounter resistance. [15] X Research source"
    },
    {
      "title": "Turn the tension tool in the direction the lock turns.",
      "content": "Turn the tension tool in the direction the lock turns. Use as little force as possible to rotate the tension tool just slightly. You’ll need to carefully apply slight rotational tension, or twisting force, with the tension tool as you jiggle the pins with the picking tool. SentrySafe locks typically open to the left."
    },
    {
      "title": "Insert the pick tool all the way into the keyhole.",
      "content": "Insert the pick tool all the way into the keyhole. Slide the pick tool all the way to the back of the upper part of the keyhole. The 45 degree bend should face up. [16] X Research source SentrySafe locks often have 4 pins, and you’ll need to access the last pin at the back of the lock."
    },
    {
      "title": "Jiggle the pick tool quickly until the lock opens.",
      "content": "Jiggle the pick tool quickly until the lock opens. Rake the pins by jiggling the pick up and down as you slowly pull it toward the keyhole’s opening. Keep the tension tool turned slightly toward the open position as you jiggle. Keep raking until you hear a click, then turn the tension tool all the way to the left to open the lock. [17] X Research source"
    }
  ]
}