{
  "url": "https://www.wikihow.com/Smoke-a-Cigar",
  "title": "A Guide to Smoking a Cigar: Cutting & Enjoying Stogies",
  "steps": [
    {
      "title": "Familiarize yourself with the varieties of cigars.",
      "content": "Familiarize yourself with the varieties of cigars. Learn to identify the various shapes and flavors of each stogie. Weigh factors like smell, size, and how each cigar feels in your hand. Do you like an open or closed foot (part you light)? How big would you like the head (the part you smoke) to be? There are a variety of cigars to choose from, like: [1] X Research source \" 'The Corona.'\" With a diameter of 6 inches (15 cm) and a 42-ring gauge, this cigar has an open foot and rounded head. Its caramel-like flavor is rich and intense, but you can smoke it fairly quickly because it's thinner. \" 'The Robusto.'\" Arguably the best for beginners, despite its name, the robusto has a fairly thin diameter (often about 4.75–5.5 inches (12.1–14.0 cm)) and boasts great starting flavors that are nutty, mild, and well-seasoned. \" 'The Pyramid.'\" Because of its pointed, closed heads, the pyramid allows its complex, diverse flavors to mesh and stay in your mouth for longer. \"' The Torpedo'\", a popular option among cigar aficionados, is a type of pyramid with a bulge in the middle that allows flavors to be nursed even longer with greater intensity. \" 'The Perfecto.'\" With a bulge in the middle, two closed ends, and an often small stature, the perfecto is great for a quick smoke break. The Panatela. With a 7 in (18 cm) diameter and 38-ring gauge, the panatela (also called the lancero) is thin and adaptable to whichever type of tobacco you choose. Its flavor can be sweet and mellow or bold and peppery. \" 'The Culebra.'\" Made of 3 Panatellas braided together, with a thick, rope-like shape, the culebra combines style and substance. Its flavors are rich and earthy. Plus, its unique shape helps you stand out and look sophisticated when smoking in public. \" 'The Toro.'\" The Toro has a 50+ inch ring gauge. Because of its width, it allows for savory, hour-long smoke seshes. It's great to nurse throughout a poker game or during a movie. \"' The Churchill.'\" 7 inches (18 cm) long, with a 50-inch ring gauge, Churchills are as savory as they come. Store them for a few weeks to accumulate the most robust flavors like cedar and coffee."
    },
    {
      "title": "Sample a few cigars to figure out what you like.",
      "content": "Sample a few cigars to figure out what you like. Buy a few different kinds of cigars that can suit various needs. For a quick afternoon smoke, go with a Corona or something thinner. For a whole evening, unwind, smoke a Churchill or something long-lasting. If you don't know what to pick, ask the tobaccoist or salespeople for advice. [2] X Research source If you haven't smoked before, start with a mild cigar, which will be less expensive and offer less intense starting flavors so you don't cough. Try 2 to 3 of a particular type or brand of cigar before deciding that you don't like that line. Individual sticks, even in the same box, can vary in flavor and satisfaction. The color is a way to gauge a cigar's intensity. A black or dark cigar is more intense. A lighter amber is a good starter."
    },
    {
      "title": "Inspect the cigar for damage or poor assembly.",
      "content": "Inspect the cigar for damage or poor assembly. Before you buy the cigar, gently squeeze it to ensure there aren't any spots that are too hard or too soft. An uneven cigar will give you a bad draw. (Sometimes, it might not even be smokable!) Also, look out for lumps in the cigar. Make sure that neither the tobacco at the end nor the wrapper is discolored. [3] X Research source If your cigar feels flaky or dry, odds are it's dehydrated and not worth smoking. Cigars will dry out if they're left unprotected. Store your stogies in a sealed container as soon as possible after purchasing. You can also purchase a humidor , a box for storing cigars, to ensure they stay in top-notch condition. [4] X Research source"
    },
    {
      "title": "Find a quality cutting device.",
      "content": "Find a quality cutting device. Ideally, you'll be using a guillotine (a single-bladed cutter) to cut your cigar, but you can also use a really sharp knife or blade. Just avoid using dull scissors, your teeth, or a butter knife to cut; all of these will tear the cigar. [5] X Research source"
    },
    {
      "title": "Place your blade down on the cap of the cigar.",
      "content": "Place your blade down on the cap of the cigar. To cut the cigar, slice into the cigar's cap. The cap is placed on the head of the cigar (about 0.1 inches (0.25 cm) from the top) to keep it from drying out. Just tap the head (or the cap) of the cigar with the blade to put it in position. [6] X Research source Aim the blade where the cigar meets the wrapper to keep the cap from falling off."
    },
    {
      "title": "Cut the cigar with one swift \"chop\" of your blade.",
      "content": "Cut the cigar with one swift \"chop\" of your blade. Hold the cigar with one hand and the guillotine with the other. Place the head of the cigar into the guillotine and cut into its cap . Slice off the head in one quick chop. [7] X Research source If you cut too slowly or tentatively, you'll tear the cigar's wrapper."
    },
    {
      "title": "Choose a well-made lighter without a scent or aftertaste.",
      "content": "Choose a well-made lighter without a scent or aftertaste. Try to use long wood matches or a butane lighter to light up, since these don't alter the flavor of the cigar. Don't use gas or Zippo lighters; they can leave a fuel-like aftertaste. Avoid paper matches and scented candles, too. [8] X Research source You can also purchase a cigar lighter at whatever store you get your cigars."
    },
    {
      "title": "Use a flame to warm the tobacco at the foot of the cigar.",
      "content": "Use a flame to warm the tobacco at the foot of the cigar. The foot of the cigar is the part you'll light. Hold the flame below the foot without touching it, and rotate the cigar a few times until the foot is evenly warmed. Even warmth makes the cigar easier to light and distributes the flavors more effectively. [9] X Research source"
    },
    {
      "title": "Inhale slightly as you light your cigar.",
      "content": "Inhale slightly as you light your cigar. Hold the flame in front of your cigar without touching it. Then, inhale just enough so that the cigar lights properly. Avoid inhaling any smoke. Once it's lit, you're ready to kick back and enjoy each drag. [10] X Research source To check if the cigar is fully lit, turn the foot end towards your mouth and gently blow on it; the lit portions should light up orange."
    },
    {
      "title": "Draw smoke into your mouth and savor the flavor.",
      "content": "Draw smoke into your mouth and savor the flavor. Hold the cigar up to your mouth and suck in a little smoke. Hold the smoke in your mouth for a few seconds to taste it. Then, exhale it all out. Do not inhale the cigar smoke. A cigar is not like a cigarette. The flavor is meant to be enjoyed, but not inhaled. [11] X Research source Some people like adding saliva to the end of their cigar to keep it lubricated and enhance the flavor."
    },
    {
      "title": "Puff and rotate the cigar every 45 seconds or so.",
      "content": "Puff and rotate the cigar every 45 seconds or so. To keep the cigar in good form, ensure it stays lit evenly by twisting it ever-so-slightly every 30 seconds to a minute. Remember that a good cigar can last 2 to 3 hours. [12] X Research source Remember you're by no means obligated to finish the cigar. Put it down whenever you feel like it, especially if you get queasy! You don't need to ash your cigar constantly: the trademark of a well-rolled cigar is that the ash will remain on the end of it for quite a while. If your cigar keeps going out, it is either not a quality cigar or you are not puffing frequently enough."
    },
    {
      "title": "Remove the cigar band after about 12 puffs.",
      "content": "Remove the cigar band after about 12 puffs. The band is placed on the cigar to prevent the tobacco from tearing. Once your cigar is lit, you won't need it anymore, so feel free to peel it off. In fact, after 12 or so puffs, the band should already be starting to fall off on its own, due to the heat. [13] X Research source"
    },
    {
      "title": "Enjoy your cigar with an alcoholic beverage.",
      "content": "Enjoy your cigar with an alcoholic beverage. Though it's not a requirement, an alcoholic beverage can enhance the smoking experience and can bring out the flavors of the cigar. Some common beverages for smoking a cigar include port, cognac, bourbon or scotch, or red wine — especially Cabernet Sauvignon. [14] X Research source A coffee-based beverage -- or even coffee -- can also bring out the flavor in a cigar. Though a cigar can overpower the flavor of many beers, an India Pale Ale (IPA) beer is a perfect companion to almost any cigar. make a simple cocktail , like a martini, to enjoy your cigar with. You can also learn how to pair cigars as a dessert or accompaniment to a meal."
    },
    {
      "title": "Extinguish the cigar when you're done smoking.",
      "content": "Extinguish the cigar when you're done smoking. To put out your cigar, set it aside in a nearby ashtray . The stogie should extinguish itself after a minute or two without you puffing on it. Before you set it down, gently blow through the cigar to expel any smoke that will go stale. [15] X Research source You can relight a cigar after extinguishing, which usually results in an ashy, bitter taste. Most smokers prefer to throw partially-smoked cigars out."
    }
  ]
}