{
  "url": "https://www.wikihow.com/Paint-Melamine",
  "title": "How to Paint Melamine",
  "steps": [
    {
      "title": "Set up your workspace before you begin.",
      "content": "Set up your workspace before you begin. Place newspaper, a tarpaulin, or a drop cloth on the floor below your project. Ventilate the area by opening all windows, and turning on a fan if possible. [1] X Research source If there are other objects close by that you cannot move out of the way, also cover these with a drop cloth to protect them"
    },
    {
      "title": "Use a sander to lightly roughen the surfaces.",
      "content": "Use a sander to lightly roughen the surfaces. Attach 150 grit sandpaper to the sander, and sand every area that you are planning to paint. Pay special attention to the edges and any detailing. [2] X Research source"
    },
    {
      "title": "Apply a liquid deglosser as a quick alternative to sanding.",
      "content": "Apply a liquid deglosser as a quick alternative to sanding. Apply the deglosser with a paintbrush, and leave it to soak into the wood for 15 minutes. Then wipe it off with a cloth. [3] X Research source Make sure that you are working in a well-ventilated area. Liquid deglosser takes the shine off surfaces and makes them dull to prepare for painting."
    },
    {
      "title": "Wipe away all of the sanding dust with a tack cloth.",
      "content": "Wipe away all of the sanding dust with a tack cloth. Clean away all loose wood, coating, and dust particles from your project. Check all of the joints and corners to make sure that you haven't missed a spot. If there is a big mess, you can always vacuum or sweep away the dust first before using a tack cloth."
    },
    {
      "title": "Clean all of the surfaces with trisodium phosphate (TSP) detergent.",
      "content": "Clean all of the surfaces with trisodium phosphate (TSP) detergent. Dilute 4 ounces (110 g) of TSP powder into 2 gallons (7.6 L) of warm water. Use a sponge to wipe down all surfaces with the solution. Then use a clean rag to rinse all of the surfaces with fresh, clean water. Always wear gloves when using TSP to avoid irritating your skin."
    },
    {
      "title": "Apply primer with a paintbrush over all of the edges and corners.",
      "content": "Apply primer with a paintbrush over all of the edges and corners. Use a paintbrush to apply a primer that is specifically for melamine. Target all of the areas that you cannot easily reach with a roller. [4] X Research source Primers that are specifically for laminate wood are an alternative option."
    },
    {
      "title": "Use a roller to apply the primer to the whole project.",
      "content": "Use a roller to apply the primer to the whole project. Roll the primer in one direction across each surface. Ensure that the roller always sounds crinkly and wet, and if it loses that sound, apply more primer. If you are using a new roller cover that has fibers, wrap it in masking tape before you use it. Rip off the masking tape to remove any loose fibers that would have otherwise been stuck to your project. [5] X Research source"
    },
    {
      "title": "Sand the primer once it’s dry to remove any imperfections.",
      "content": "Sand the primer once it’s dry to remove any imperfections. Use 220 grit sandpaper to smooth over any drips or other marks caused by the primer. Wipe over the sanded surfaces with a tack cloth again. [6] X Research source The instructions that are on the primer will indicate how long it will take to dry. This normally takes around 4 hours."
    },
    {
      "title": "Add a second coat of primer.",
      "content": "Add a second coat of primer. Cover the full surface of the kitchen cupboards or furniture again. Wait for the primer to dry. [7] X Research source You don't need to sand the surface again after the second coat of primer, unless you notice more bumps or imperfections."
    },
    {
      "title": "Apply the first coat of melamine paint over the primed surfaces.",
      "content": "Apply the first coat of melamine paint over the primed surfaces. Use a foam roller to evenly coat all surfaces with paint. Let the first coat dry for 6-8 hours. [8] X Research source If you prefer to use a paint brush, brush against the grain first and then brush with it. [9] X Research source Paint applied to melamine takes longer to dry than on wood. This is because melamine isn’t as absorbent. You can buy paint specifically for melamine surfaces from home improvement stores."
    },
    {
      "title": "Add the second coat of melamine paint once the first is dry.",
      "content": "Add the second coat of melamine paint once the first is dry. Use either a foam roller or paintbrush again to apply paint to all of the surfaces. Let the final coat dry for 24 hours. [10] X Research source"
    },
    {
      "title": "Spray paint your project if you prefer a smoother finished surface.",
      "content": "Spray paint your project if you prefer a smoother finished surface. Start with the back or inside of any doors to cupboards, so that you can get used to spray painting there first. Then spray paint your entire project, and let it dry overnight. [11] X Research source Wear a respirator mask at all times when working with spray paint. Check that the spray paint can be used on melamine surfaces by reading the label before you purchase it. Apply a second coat with spray paint if you need to once the first coat is dry."
    }
  ]
}