{
  "url": "https://www.wikihow.com/Signs-a-Pisces-Man-Is-Playing-You",
  "title": "How to Tell When a Pisces Man Is Playing You (15+ Red Flags)",
  "steps": [
    {
      "title": "Pisces guys can be wishy-washy when uncertain about a relationship.",
      "content": "Pisces guys can be wishy-washy when uncertain about a relationship. You may notice a Pisces man flake out on the plans you make together more often than not when he’s playing you. He might even make up a story each time explaining why he can’t follow through on your plans, which means there’s a chance that your Pisces guy isn't as committed to the relationship as you are. [1] X Research source If this becomes a pattern with your Pisces, the best way to address it may be to talk to him about it directly. Ask him if there’s a reason he’s been so hard to pin down lately. He may own up to his flakiness and explain there’s been something else on his mind or that he’s been feeling stifled lately, for example. If so, you may be able to work through the problem together. If the problem continues, however, it might be time to consider finding a new partner who won’t bail on you."
    },
    {
      "title": "Pisces men are usually extremely emotional.",
      "content": "Pisces men are usually extremely emotional. An emotional connection is something Pisces almost always craves in a relationship—at least when he’s serious about his partner. For a Pisces man to be emotionally unavailable, he’s likely not planning on sticking around. If he seems cold, detached, and won’t confide in you or let you confide in him, he’s likely trying to stay emotionally unavailable. [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Pisces is a water sign, which is why they have such a deeply sensitive and emotional nature—and why it’s unlike Pisces to be emotionally unavailable unless they’re not serious about the relationship. Think about how he reacts when you tell him you've had a hard day or how much he remembers after you tell him details about yourself. If he's really invested in you, he'll be empathetic, attentive, and soak up every detail you tell him. If he's not invested, on the other hand, he probably won't react much to your confessions or remember much of what you say."
    },
    {
      "title": "When they’re invested, Pisces men want relationships and not just sex.",
      "content": "When they’re invested, Pisces men want relationships and not just sex. Does it seem like your Pisces guy is really into you when the two of you are in bed but emotionally disconnected when you're out in the real world? If a Pisces man is playing you because he only wants sex, he might briefly turn on the romance and passion, only to become cold and detached when the moment passes. [3] X Research source If you're concerned that he's playing you, it might be a good idea to press pause on intimacy with him until you know where the relationship stands. Talk to your Pisces man about what kind of relationship you're looking for, and ask him what he's really looking for as well. Even if you don't want the same thing, at least you'll be able to communicate your needs and then move on. If you’re worried that he’s only using you for sex, then you could consider abstaining from sex until he decides to commit to you. Reader Poll: We asked 282 wikiHow readers if they wait to be in an official relationship before having sex, 67% of them responded with yes . [Take Poll]"
    },
    {
      "title": "Normally, Pisces men like to learn everything about their partners.",
      "content": "Normally, Pisces men like to learn everything about their partners. Getting to know you more intimately and learning about your hopes and dreams is often one of the ways a Pisces tries to build a stronger emotional connection with you. Therefore, if your Pisces doesn’t ask you any questions and makes no effort to find out (or remember) anything about you, he’s likely playing you. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Pisces is ruled by Neptune, the planet of creativity and dreams, why is why Pisces men can be so dreamy and idealistic. Pisces’ tendency to daydream and fantasize about things may cause him to become more invested in the idea of you than who you really are—and, as a result, they may not make an effort to get to know you."
    },
    {
      "title": "Pisces men may act uncaring to try and separate from their emotions.",
      "content": "Pisces men may act uncaring to try and separate from their emotions. Normally, Pisces men are super sensitive to their partner’s needs. They’re usually the first to ask whether you need help or what they can do for you. So, if your Pisces man never checks up on you or seems concerned when you’re going through a difficult time, he’s likely trying to stay detached because he’s playing you. Try asking him for help or advice when you have a problem and see what he says. If he always comes up with an excuse to avoid helping you out or brushes off your request for advice, he’s likely playing you."
    },
    {
      "title": "One-on-one time is only important for Pisces when he’s committed.",
      "content": "One-on-one time is only important for Pisces when he’s committed. Pisces men are super attentive when they really want to be in a relationship; they’ll go out of their way to get plenty of alone time with their significant other. If you’re always the one to call or ask him out —and he tries to dodge your attempts at getting together more often than not—then he may be playing you. [5] X Research source Pisces guys can be a little flaky and need “me” time even when they are committed to a relationship; don’t rush to panic if they don’t call for a few days every now and again. However, there’s a difference between needing “me” time and being impossible to set plans with. It’s normal for Pisces to take some time for himself between the time he spends with you, but not to the point that he avoids you entirely."
    },
    {
      "title": "Pisces men are usually secretive at first but relax after a few dates.",
      "content": "Pisces men are usually secretive at first but relax after a few dates. Being emotionally connected means letting your partner see the real you, which is why Pisces can easily open up when they’re invested in a relationship. [6] X Research source On the other hand, if months pass and you realize you know almost nothing about your Pisces, his interests, goals, or family, he might be playing you. Withholding information about his personal life can indicate that a Pisces man doesn’t really have feelings for you—because he doesn’t see a reason to open up to you."
    },
    {
      "title": "Pisces men are normally romantics at heart.",
      "content": "Pisces men are normally romantics at heart. Some signs just aren’t big on overt romantic gestures—but Pisces certainly is! These sensitive and emotional guys absolutely love to show their partners how much they care when the relationship is genuine. Consider your Pisces man’s behavior thus far; if he rarely puts effort into sweet and romantic gestures, he may be playing you. For example, Pisces men are the type to give you flowers, treat you to a candlelit dinner, or compose a poem about how lovely you are (after all, Pisces is a super creative sign). If it seems like your Pisces man takes you for granted and isn’t trying in the relationship, it’s a reliable sign that he’s not really interested, just using you."
    },
    {
      "title": "He might say one thing but do another when he's playing you.",
      "content": "He might say one thing but do another when he's playing you. Essentially, a Pisces man’s words might not match his actions; he may say romantic things to you but be completely unwilling to follow through on them later. When a Pisces guy is just trying to keep you on the hook without actually intending to build a relationship with you, his words and actions will seem pretty inconsistent. For example, he might say that he absolutely loves spending time with you but then ghost you for weeks at a time. Think about how often your Pisces man's words line up with his actions. If you notice a pattern of inconsistency, it might be time to call him out and let him know that you need a more consistent partner for the relationship to work."
    },
    {
      "title": "No matter how affectionate he is in private, he’s distant in public.",
      "content": "No matter how affectionate he is in private, he’s distant in public. Normally, Pisces guys love PDA (public displays of affection). After all, Pisces is a super touchy-feely and romantic sign—so if Pisces is feeling the love, they like to show it. That’s why a lack of PDA can be a major red flag that your Pisces is playing you; it can mean he doesn’t have the kind of affection for you that he should. For example, your Pisces guy might be super hands-on behind closed doors, especially in the bedroom—but as soon as you’re in public, he won’t even hold your hand. He might even avoid physical contact outside the bedroom entirely—no kisses, cuddles, or hugs unless it happens during intimacy. If you feel you’d like more physical affection in the relationship, try saying something to him. If he’s willing to work on it, so much the better. If not, the best thing you can do is find someone else who can fulfill your needs."
    },
    {
      "title": "Moodiness can indicate that he feels uneasy about the relationship.",
      "content": "Moodiness can indicate that he feels uneasy about the relationship. Pisces is a sensitive sign, so some moodiness is totally normal for them. [7] X Research source However, your Pisces man won’t be moody around you all the time unless he really doesn’t like the idea of sharing an emotional bond with you. In fact, he may use his moodiness as a weapon to keep you at arms’ length for as long as possible. Ultimately, you don’t deserve to be in a relationship with someone whose mood sours whenever you’re around. You deserve a partner who thinks the world of you! So, if Pisces’ mood shows no signs of changing, it might be time to reconsider the relationship —or, at the very least, ask him to tell you what’s wrong."
    },
    {
      "title": "Lying may be a sign that he doesn’t care about gaining your trust.",
      "content": "Lying may be a sign that he doesn’t care about gaining your trust. If your Pisces man is playing you, he might very well tell lies to manipulate you and keep you on the hook. Pisces is a super intuitive sign, able to easily pick up on other peoples’ needs and moods—which means it’s not hard for Pisces guys to figure out what you want to hear and use it against you if that’s what he wants to do. [8] X Research source If he’s lying to you, you might notice that his claims are super vague, with few details. If you challenge his story, he won’t be able to add more details; he might just get defensive instead. Even if you catch him in a lie , a Pisces man who is intentionally playing you probably won’t own up to it. Confronting him might help you reach a resolution—or it might just give you the motivation you need to move on. Remember, honesty and trust are the foundation of any healthy relationship. If your Pisces man isn’t someone you can trust, and doesn’t want to change, then moving on might be for the best!"
    },
    {
      "title": "Pisces men prefer to drop hints rather than directly say negative things.",
      "content": "Pisces men prefer to drop hints rather than directly say negative things. They aren’t the most direct signs; their sensitivity makes them more likely to beat around the bush than cut to the chase. Calling you his “friend” rather than a significant other may be his subtle way of saying the relationship isn’t serious for him. At the end of the day, he’s just having fun, which makes you only a “friend” in his eyes. If you want a real romantic relationship with him, this may be a dealbreaker. After all, it’s important to be on the same page with your partner about what the two of you are to one another. Talk to him about your relationship and what you need from him going forward. If he refuses to treat you (and acknowledge you) as his romantic partner, then it might be time to move on."
    },
    {
      "title": "Pisces may use you to get a taste of love, even if it isn't real.",
      "content": "Pisces may use you to get a taste of love, even if it isn't real. Love-bombing is a form of manipulation that involves excessive flattery and intense, overly dramatic declarations of love. Essentially, your Pisces man might be very clingy and romantic at first—but then ghost you. Or, he might alternate between love-bombing and ghosting to keep you on the hook. This tends to happen most often when a Pisces guy just isn’t ready (or emotionally mature enough) for a relationship but wants to take it for a “test drive” anyway. Your Pisces man might enjoy the feeling of loving someone and being loved, but it’s not permanent for him—which is why he’ll detach from you so suddenly. If your Pisces man keeps trying to love-bomb you, detach, and then repeat the cycle, it might be best to cut him off and move on . You deserve a partner whose feelings won’t change at the drop of a hat!"
    },
    {
      "title": "Dreamy Pisces usually loves imagining a future with their partner.",
      "content": "Dreamy Pisces usually loves imagining a future with their partner. This is the kind of sign that’ll daydream about their wedding, settling down with someone, having a family, and everything in between—and he won’t hesitate to discuss the future if he’s really devoted to the relationship. If he’s playing you, however, he’ll likely avoid any attempt to talk about the future and take things one day at a time with you. He may also avoid making plans too far ahead in the future, likely because he’s not convinced you’ll still be together then. If you feel like you need some assurances about the future of your relationship, tell him so. He might be willing to work with you—but if he really doesn’t see a future with you, it’s better for you to know that sooner rather than later."
    }
  ]
}