{
  "url": "https://www.wikihow.com/Quit-Roblox",
  "title": "How to Quit Roblox",
  "steps": [
    {
      "title": "Decide whether completely quitting the game is the right thing to do.",
      "content": "Decide whether completely quitting the game is the right thing to do. Quitting a game you've known and loved is an extremely hard process, and many people don't have the heart to cut all connections to the game. If schoolwork, medical conditions, or current events have lead to you wanting to quit, you might want to take a break instead of permanently leaving the game."
    },
    {
      "title": "Wrap up your Roblox experience with your online friends.",
      "content": "Wrap up your Roblox experience with your online friends. How you do this is really up to you, but try playing all of the games you've enjoyed before you decided to quit. If you know/trust each other, you can all call using an app/service like Zoom, Houseparty, Discord, or Google Hangouts while doing so. Make sure you say goodbye to your friends that you've enjoyed talking to through your gaming journey. Just unfriending and leaving them alone might hurt their feelings more than you will be hurt for erasing your account."
    },
    {
      "title": "Decide what to do with your account and items.",
      "content": "Decide what to do with your account and items. Will you keep them in case you ever want to play Roblox again? Or will you give your account and items to one of your friends or siblings? Whatever you do, don't sell your account online, since that's against the terms of service."
    },
    {
      "title": "Cancel your Premium subscription if you have one.",
      "content": "Cancel your Premium subscription if you have one. You/your parents/guardian definitely don't want to pay for something you don't even use. Plus, Premium can be considered quite expensive."
    },
    {
      "title": "Change your blurb/about me section to a memorial.",
      "content": "Change your blurb/about me section to a memorial. Try writing something like \"<Account name>, <Year of joining> to <Year of quitting>\" or \"REST IN BLOX, ME\". Of course, this step is completely optional."
    },
    {
      "title": "Message your friends a quick goodbye, even if you already messaged them a goodbye letter.",
      "content": "Message your friends a quick goodbye, even if you already messaged them a goodbye letter. If you don't want to lose your Roblox friends, you can add them on social media (recommended) or add them on phones (not recommended). If you want to stay in touch with the Roblox community, you can go on Roblox's Reddit or just search: offsite Roblox forums."
    }
  ]
}