{
  "url": "https://www.wikihow.com/Prove-Yourself-a-Good-Person",
  "title": "How to Prove Yourself a Good Person",
  "steps": [
    {
      "title": "Be yourself.",
      "content": "Be yourself. If you're not comfortable, most people can detect your uneasiness. Don't do things you don't like or feel uncomfortable doing. Don't change yourself to please others. It's your life, your choice. You may be happy in the short term when you are able to please someone, but in the long term it is unlikely to work out. Do things that make you feel good about yourself and give meaning to your life. Keep in mind that nobody has the exact same mind and or experience. That's what makes us unique individuals. [1] X Research source"
    },
    {
      "title": "Be open minded.",
      "content": "Be open minded. The effect of making the other person lose self esteem does not always take place immediately. Watch what you say and do. Avoid religious intolerance, racism, sexism, stereotypes, criticism, and hate. Seek out people and experiences that are different or new. Aim to understand and learn from them, not judge them."
    },
    {
      "title": "Smile whenever you can, to everybody.",
      "content": "Smile whenever you can, to everybody. It will make their day. [2] X Research source"
    },
    {
      "title": "Follow your instincts,[3] X Research source act from the heart.",
      "content": "Follow your instincts, [3] X Research source act from the heart."
    },
    {
      "title": "Learn to respect others' perspectives even though they differ from yours.",
      "content": "Learn to respect others' perspectives even though they differ from yours. Have respect and compassion for people that are different from you."
    },
    {
      "title": "Don't criticize others on little things, because everyone makes mistakes and all people are different.",
      "content": "Don't criticize others on little things, because everyone makes mistakes and all people are different. As much as some people would like to believe otherwise, nobody is perfect. [4] X Research source"
    },
    {
      "title": "Never talk behind people's backs.",
      "content": "Never talk behind people's backs. This is emotional abuse. Gossiping, starting rumors, carrying on rumors, exaggerating and backstabbing, along with others in its category can make people not like you, but even hate you. It's hurtful and nobody gains anything from it. Don't be one of those people that get a temporary boost by putting others down. [5] X Research source"
    },
    {
      "title": "Love everyone, forgive the ones that have hurt you.",
      "content": "Love everyone, forgive the ones that have hurt you. This step is easier said than done, but achieving it will lift the weights off of your heart. Untying the knot will give you more time to focus on the people and things that are more important to you. [6] X Research source"
    },
    {
      "title": "Experience for yourself!",
      "content": "Experience for yourself! Keep others' opinions in mind, and be aware when warnings are given to you, but don't be a sheep! Your friends may hate Ricky, but that doesn't mean he's a terrible person. Get to know him yourself. [7] X Research source"
    },
    {
      "title": "Appreciate life, all the ups and downs.",
      "content": "Appreciate life, all the ups and downs. It is so much easier to enjoy yourself this way, and people are usually attracted to individuals that are cheerful, because really, most if not all people want to feel that joy. [8] X Research source"
    }
  ]
}