{
  "url": "https://www.wikihow.com/Reduce-Yeast-in-Your-Body",
  "title": "How to Reduce Yeast in Your Body",
  "steps": [
    {
      "title": "Cut sugary and processed foods from your diet.",
      "content": "Cut sugary and processed foods from your diet. High blood sugar may throw off your body’s pH balance and cause more yeast to form in your body. Do your best to limit the amount of food you eat that’s been heavily processed, such as snack foods and prepackaged snacks. Try to replace foods that have a lot of natural sugars with low-glycemic foods, like chicken, eggs, pasta, quinoa, fruits, and vegetables instead. [1] X Research source Try to avoid foods and drinks that contain yeast, such as baked goods, bread, and alcohol, since they can also increase yeast in your body."
    },
    {
      "title": "Load up on fermented foods to get more probiotics.",
      "content": "Load up on fermented foods to get more probiotics. Lactobacillus is one of the good types of gut bacteria that eats away yeast in your digestive system. Try to eat something with lactobacillus or other strains of healthy gut bacteria at least once a day. Sauerkraut, yogurt, kefir, kimchi, miso, tempeh, and kombucha are all great sources of probiotics. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Kombucha is an especially good choice because it contains polyphenols and acetic acid that can kill the fungus. [3] X Research source If you’re new to fermented foods, don’t overdo it because too much all at once can cause an upset stomach or diarrhea. For instance, start by drinking 4 fluid ounces (120 mL) of kombucha once a day for 2 days, and then work your way up to 3 4 fl oz (120 mL) servings per day over a week. Probiotics won’t be as effective if you still have a lot of sugar or yeast in your diet."
    },
    {
      "title": "Add more garlic to your diet.",
      "content": "Add more garlic to your diet. Garlic contains allicin and alliinase, compounds that have antimicrobial properties. You can reap the benefits of these compounds by eating lightly cooked garlic (sauteed or steamed for less than 5 minutes) or by peeling and eating a raw clove. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you can't bear the taste of raw garlic, finely chop 1 peeled clove and put it in 8 fluid ounces (240 mL) of boiling water for at least 5 minutes to make garlic tea. Powdered garlic doesn’t provide any antimicrobial benefits, so stick to fresh garlic or minced garlic that comes in a jar."
    },
    {
      "title": "Use coconut oil in place of other cooking oils and coffee creamers.",
      "content": "Use coconut oil in place of other cooking oils and coffee creamers. Coconut oil contains fatty acids that have antifungal and antimicrobial properties, giving your gut bacteria what it needs to balance the levels of yeast in your stomach. If you typically cook with olive or canola oil, swap those out for coconut oil to keep your yeast levels in check. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can also add coconut oil to your coffee to add a sweeter flavor and make it less bitter. You can also swish coconut oil in your mouth for 1 or 2 minutes at a time to treat oral candida. It doesn’t taste good, but it helps! Plus, swishing with coconut oil can whiten your teeth!"
    },
    {
      "title": "Chew gum sweetened with xylitol to fight off yeast.",
      "content": "Chew gum sweetened with xylitol to fight off yeast. Xylitol makes it harder for the candida fungus to stick to any surface—in this case, your intestines. Chew a piece of xylitol-sweetened gum after or between meals to help cut back on the amount of yeast in your body. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Look at the ingredients list on the package to see if a particular brand of gum contains xylitol. Note that xylitol-sweetened gum contains sugar alcohols that may cause gas, bloating, and diarrhea if you eat too much. Stick to 10 or fewer pieces per day. You can also use xylitol in place of sugar for cakes, cookies, or brownies—any recipe that doesn't require dissolving the sugar will work."
    },
    {
      "title": "Sip 8 fluid ounces (240 mL) of aloe vera juice or aloe vera water.",
      "content": "Sip 8 fluid ounces (240 mL) of aloe vera juice or aloe vera water. Aloe vera lubricates the walls of your intestines, making it harder for the yeast to stick to them and overproduce. The juice from this powerful plant can also boost your immune system, which can help your body fight off any condition that’s being exacerbated by too much yeast. You can buy premade aloe vera juice or aloe vera water at most grocery stores or natural health stores. If you’d rather take aloe vera as a gel capsule, talk to your doctor first. You can also dry drinking green tea since it may help kill yeast. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Sprinkle turmeric onto your meals.",
      "content": "Sprinkle turmeric onto your meals. Turmeric is loaded with curcumin, an antifungal and anti-inflammatory agent that may slow the growth of yeast in your body. Use at least 2 tsp (6.4 g) of turmeric powder in your meals every day or stir 1/2 tsp (1.6 g) into coffee, tea, or milk and drink it 4 times a day. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The daily recommended amount of turmeric is 500 to 2,000 mg per day. One full teaspoon provides 200 mg of curcumin. You can also take turmeric capsules, just be sure to talk to your doctor first. Turmeric powder can also help ease any inflammation that may be caused by yeast overgrowth."
    },
    {
      "title": "Ask your doctor about taking fluconazole for persistent yeast infections.",
      "content": "Ask your doctor about taking fluconazole for persistent yeast infections. If you’re battling a yeast infection in your mouth, throat, esophagus, genitals, lungs, or other organs, your doctor may prescribe fluconazole. Take 1 pill a day for at least 7 days (and up to 4 weeks) with 8 fluid ounces (240 mL) of water on an empty stomach or after eating. It may take 3 to 4 weeks for your yeast infection to go away completely, so keep taking it as your doctor has told you to. [9] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Depending on your condition, your doctor may tell you to take a double dose on the first day of your treatment. Your symptoms should start to ease after the first 3 to 4 days, but don’t stop taking it just because you feel better. Stopping the medication after 7 days could cause your yeast infection to come back. Some common side effects include dizziness, upset stomach, and headaches. If you take antacids or medication for GERD, don’t take them within 2 hours of taking fluconazole because it can affect how your body absorbs the drug."
    },
    {
      "title": "Take itraconazole to treat persistent lung and nail yeast infections.",
      "content": "Take itraconazole to treat persistent lung and nail yeast infections. Your doctor can order you a prescription for itraconazole if you’re experiencing symptoms of a yeast infection in your lungs or, more commonly, on your nails. Take it once or twice daily for 1 to 4 weeks on a full stomach. [10] X Research source Avoid taking itraconazole within 2 hours of taking antacids or GERD medication because these can decrease absorption. Some side effects of itraconazole are dizziness, nausea, diarrhea, headache, and upset stomach. If any of these side effects worsen over time, stop taking the drug and call your doctor right away. Call an ambulance if you experience any signs of an allergic reaction like itching, swelling of the tongue, lips, or face, dizziness, or trouble breathing. Don’t stop taking it if your symptoms clear up after just 1 week—take it for however long your doctor tells you to (which is usually no longer than 4 weeks)."
    },
    {
      "title": "Use boric acid suppositories to treat vaginal yeast infections naturally.",
      "content": "Use boric acid suppositories to treat vaginal yeast infections naturally. Certain strains of yeast that lead to vaginal yeast infections don’t always respond to traditional antifungals, especially if you've taken antifungals enough times that the fungus has become resistant to them. To use boric acid, insert 1 capsule into your vagina before going to bed for 7 days in a row. Do this for up to 2 weeks to treat a stubborn yeast infection. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Boric acid is considered a safe, natural alternative to prescription antifungal medications. However, you should always talk to your doctor before using boric acid. With your doctor’s approval, you can continue to use boric acid twice a week for up to 1 year as a preventative method. Don’t use boric acid if you are pregnant or trying to become pregnant because it can be toxic to the developing baby."
    },
    {
      "title": "Talk to your doctor about getting antifungal IV treatments if necessary.",
      "content": "Talk to your doctor about getting antifungal IV treatments if necessary. It’s extremely rare to have to get IV treatments for yeast, but your doctor may recommend it if you are elderly, if you have a weakened immune system, or if you have another illness that’s exacerbated by the excessive yeast in your body. On average, you’ll need to get infusions every day for 7 to 14 days (even after your last test for infection has come back negative). [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Antifungals called echinocandins (caspofungin, micafungin, or anidulafungin) will be injected into your bloodstream via an IV. It won’t hurt but if you don’t like needles, it can make you a bit squeamish. Amphotericin-B is another type of injectable antifungal medication, but your doctor will only recommend it if you have a potentially life-threatening fungal infection."
    },
    {
      "title": "Use miconazole nitrate suppositories for vaginal yeast infections.",
      "content": "Use miconazole nitrate suppositories for vaginal yeast infections. Buy an antifungal suppository specifically made to treat yeast infections (it will usually specify on the label). Put the tablet into the applicator and insert the applicator as far into your vagina as you can comfortably get it. Slowly press down the plunger to release the tablet. Do this once a day before going to bed 3 days in a row. [13] X Research source Along with the suppository, you can also apply miconazole nitrate cream to the outside of your vagina to ease any itching or burning sensations caused by the infection. Some suppository kits come with this cream as well. Don’t use miconazole nitrate suppositories if you’re in your first trimester of pregnancy because small amounts of the chemicals can get absorbed by your vaginal and uterine tissues."
    },
    {
      "title": "Apply clotrimazole cream 1 to 2 times a day to treat athlete’s foot.",
      "content": "Apply clotrimazole cream 1 to 2 times a day to treat athlete’s foot. After getting out of the shower or washing your feet, apply a dime-sized amount of the cream to both of your feet. Be sure to get the small crevices between your toes. Do this once or twice a day for up to 7 days. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Terbinafine hydrochloride is another antifungal cream that can treat athlete’s foot. While you’re treating your athlete’s foot, be sure to wear ventilated shoes and change your socks at least once a day."
    },
    {
      "title": "Shower with antifungal body wash or soap to treat jock itch or ringworm.",
      "content": "Shower with antifungal body wash or soap to treat jock itch or ringworm. Hop in the shower and deposit a quarter-sized amount of antifungal body wash into your hand. Massage the affected area for at least 15 seconds before rinsing it away. If you have antifungal soap, use it just like you would normal soap—just make sure to work up a good lather over the affected area. [15] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source For jock itch, use the body wash or soap every day (once or twice a day) for 2 weeks. To treat ringworm, use the body wash or soap 1 or 2 times a day up to 4 weeks. If the ringworm infection is on your scalp, it’s okay to use the body wash or soap on your head. Just be sure to use a conditioner afterward to moisturize your hair."
    },
    {
      "title": "Heal yeast infections on your skin by applying antifungal powder.",
      "content": "Heal yeast infections on your skin by applying antifungal powder. Wash the affected area with soap and water and pat it dry with a towel. Apply a thin layer of the powder to your skin twice a day (morning and night) for at least 7 days and up to 2 weeks at a time. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Yeast infections on your skin (intertrigo) usually show up in skin folds like your armpits, groin, and elbows. Call your doctor if the skin infection doesn’t clear up or gets worse after 2 weeks of using the powder."
    },
    {
      "title": "Get rid of nail fungus by applying diluted tea tree oil twice a day.",
      "content": "Get rid of nail fungus by applying diluted tea tree oil twice a day. Add 5 drops of tea tree oil to 1 ⁄ 2 fluid ounce (15 mL) of olive, jojoba, or almond oil. Stir it together, dip a cotton ball into the mixture, and rub it onto your nails. Do this once or twice a day for up to 2 weeks. If you're treating your fingernails, don't wash your hands for as long as you can. If you're using it on your toenails, let it sit for as long as possible. [17] X Research source Don't be stingy when you're applying the oil—the more you apply, the better! If you're putting it on your toenails at the beginning of your day, wear shoes with some ventilation because more airflow will help clear up the fungus. Don’t put tea tree oil on your nails without diluting it with a carrier oil first because it can irritate the skin around your nails."
    },
    {
      "title": "Take note of recurring or lingering urinary tract infections (UTIs).",
      "content": "Take note of recurring or lingering urinary tract infections (UTIs). A UTI affects your kidneys, ureters, urethra, and bladder and is typically caused by the E. coli bacteria. However, it's possible for the candida (yeast) to also cause a fungal UTI. The symptoms are similar, but a UTI caused by yeast won't respond to treatments designed to get rid of bacterial UTIs (like antibiotics). If you have a candida UTI, you may have the following symptoms: [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Burning or pain while urinating Cloudy or odd-smelling urine Pain in your lower abdomen."
    },
    {
      "title": "Notice digestive issues like constipation, diarrhea, gas, and bloating.",
      "content": "Notice digestive issues like constipation, diarrhea, gas, and bloating. Candida naturally lives in your intestines and is regulated by good bacteria in your gut. However, a lack of good gut bacteria can cause an overgrowth of yeast and affect how you digest food. If you're inexplicably gassy, bloated, or constipated on a regular basis, there's a chance you have too much yeast in your gut. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you have IBS, your gastrointestinal symptoms may be even more pronounced if you have too much yeast in your gut."
    },
    {
      "title": "Assess whether or not you feel chronically fatigued.",
      "content": "Assess whether or not you feel chronically fatigued. High amounts of yeast in the body can cause you to feel tired and sluggish. If you’re constantly feeling tired or drained all the time and don’t have some other condition that may be causing it, it could be a sign of yeast overgrowth. [20] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Being tired after a long, hard day doesn’t mean you have chronic fatigue or yeast overgrowth. However, if you’re especially tired after waking up on a regular basis, it’s worth investigating whether or not you have yeast overgrowth."
    },
    {
      "title": "Examine your armpits and groin for rashes.",
      "content": "Examine your armpits and groin for rashes. Cutaneous candidiasis is a relatively common and harmless (but annoying) condition that causes a red, itchy rash to form on your skin, particularly in moist areas with lots of friction. You may also notice red bumps (or \"satellite lesions\") around the central rash. [21] X Research source It may help to use a small handheld mirror to examine the backside of your armpits or your entire groin area. A cutaneous candidiasis rash may look similar to eczema but without flaking or dry, white patches. Cutaneous candidiasis is also unlikely to appear on your cheeks, arms, knees, or other areas where eczema typically shows up."
    },
    {
      "title": "Inspect your fingernails and toenails for signs of a fungal infection.",
      "content": "Inspect your fingernails and toenails for signs of a fungal infection. A fungal infection on your nails may show up as black, white, or yellow spots that appear crusty and feel brittle. If you have a fungal infection caused by too much yeast in your body, your nails may also start to flake or scale away towards the ends and on the sides. [22] X Trustworthy Source DermNet NZ Online clinical resource website written and run by dermatologists providing evidence-based information about dermatology and skin health Go to source These symptoms may also show up along with athlete’s foot, which causes redness, burning, and stinging on the skin of your feet (particularly between your toes). Nail fungus is very common and not dangerous at all, but the fungus won’t go away on its own so be sure to treat it."
    },
    {
      "title": "Check your tongue, cheeks, and gums for oral thrush.",
      "content": "Check your tongue, cheeks, and gums for oral thrush. Thrush looks like white, bumpy patches on your tongue, inner cheeks, and gums and may even show up on your tonsils or throat. These white patches may bleed if they're accidentally scraped or bitten. [23] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Thrush is most commonly found in infants and elderly people with sensitive immune systems. If you wear dentures or have poor oral hygiene, you may also have a higher chance of getting oral thrush."
    },
    {
      "title": "Be aware of chronic, long-term sinus infections.",
      "content": "Be aware of chronic, long-term sinus infections. While it’s extremely rare, yeast can cause your nasal passages to swell up, making it easier for bacteria to settle into your sinuses and cause an infection. Fungal sinusitis is also less likely to respond to traditional methods of treating sinusitis and may stick around longer or occur more frequently. Symptoms include: [24] X Research source Fever, headache, and cough Facial swelling, pain, or numbness Nasal discharge Dark ulcers in your nasal passages."
    },
    {
      "title": "Notice any swelling in your joints or other arthritic symptoms.",
      "content": "Notice any swelling in your joints or other arthritic symptoms. In rare cases, candida that lives in your gut can get into your bloodstream and affect how blood flows through your body. Some areas may get more or less blood flow, resulting in swollen joints and stiffness that’s usually associated with arthritis. [25] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you have arthritis and too much yeast in your body, your symptoms may be exacerbated."
    }
  ]
}