{
  "url": "https://www.wikihow.com/Put-Jibbitz-on-Crocs",
  "title": "How to Put Jibbitz on Crocs",
  "steps": [
    {
      "title": "Choose which hole you’d like to put your Jibbitz charm in.",
      "content": "Choose which hole you’d like to put your Jibbitz charm in. A standard pair of clog-style or slip-on Crocs has 13 openings on each shoe, giving you 26 openings to work with. [1] X Research source Decide how you’d like to space out your Jibbitz charms, and assign each charm to a specific opening on your Crocs. Certain Crocs, like the Classic Crocs Flip, have around 6 Jibbitz openings on the sandal band. That still gives you plenty of real estate to put Croc charms on! You can attach as many or as few Jibbitz charms as you’d like!"
    },
    {
      "title": "Pinch and fold the top section of the Croc to create a bigger opening.",
      "content": "Pinch and fold the top section of the Croc to create a bigger opening. Place your fingers along both sides of the Jibbitz opening. Then, pinch your fingers to make the opening slightly more oblong. Don’t worry—Crocs are super bendy and flexible, so this won’t hurt your shoes. [2] X Research source"
    },
    {
      "title": "Slide the Jibbitz post through the opening until you hear a “pop.”",
      "content": "Slide the Jibbitz post through the opening until you hear a “pop.” Hold the Jibbitz charm at a 45-degree angle on top of the shoe’s opening. Starting from the side, push the entire charm in and through the opening. You’ll hear a “pop” sound once it’s securely in place. [3] X Research source Some people prefer to turn their Jibbitz charms so they’re facing the people they walk past, while others like to rotate their charms so they’re directly facing them. There’s no right or wrong way to do this—it really depends on your personal preference!"
    },
    {
      "title": "Pinch the top of your Crocs and pull out the Jibbitz charm to remove it.",
      "content": "Pinch the top of your Crocs and pull out the Jibbitz charm to remove it. Like you did before, pinch around the opening to make it a little more ovular. Then, pull the charm out of the opening at a sideways angle to remove it completely. [4] X Research source"
    },
    {
      "title": "Select a spot on your Crocs sandal strap to attach the Jibbitz charm.",
      "content": "Select a spot on your Crocs sandal strap to attach the Jibbitz charm. Tie-on Jibbitz charms have a small, stretchy loop that’s attached to the base of the charm. This loop wraps around the strap, lace, or surface of the shoe and fastens to a peg along the bottom of the charm. Unlike original-style Jibbitz, tie-on charms don’t require a special opening to attach to your shoe. [5] X Research source Tie-on charms work with a lot of different Crocs and shoe styles, but they work especially well with flip-flops, sandals, and other shoes with straps."
    },
    {
      "title": "Fasten the tie to your strap or lace.",
      "content": "Fasten the tie to your strap or lace. Center the charm on top of the strap or lace on your shoe. Then, stretch the loop around and beneath the strap or lace. Hook the end of the loop on top of the peg so the charm stays in place. [6] X Research source The peg is beneath the actual Jibbitz charm."
    },
    {
      "title": "Take off croc charms by unhooking the tie loop from the peg.",
      "content": "Take off croc charms by unhooking the tie loop from the peg. Gently pull the stretchy loop off of the hook—the rest of the charm will completely detach from your shoe. [7] X Research source"
    },
    {
      "title": "Pick a spot on your shoelaces to clip the Jibbitz charm.",
      "content": "Pick a spot on your shoelaces to clip the Jibbitz charm. Clip-on charms work just like any other clip-on accessory, and make it easy to decorate the laces on your sneakers and running shoes. Look for an open, empty spot that’s big enough to fit your Jibbitz charm before you get started. [8] X Research source The number of charms you can fit on your laces depends on both the size of your laces and the size of your Jibbitz charms."
    },
    {
      "title": "Open the clip and slide the Jibbitz charm onto your shoelace.",
      "content": "Open the clip and slide the Jibbitz charm onto your shoelace. Pinch the clip along the back of the charm to up the clamp. Then, slide the charm over the lace and release the clip to keep it in place. [9] X Research source"
    },
    {
      "title": "Unclip the Jibbitz charm to remove it from your shoe.",
      "content": "Unclip the Jibbitz charm to remove it from your shoe. Pinch the clamp on the charm to open up the clip. Then, just slide the charm up and off the lace so it’s no longer on your shoe. [10] X Research source"
    }
  ]
}