{
  "url": "https://www.wikihow.com/Remove-Egg-Stains-from-Car-Paint",
  "title": "How to Remove Egg Stains from Car Paint",
  "steps": [
    {
      "title": "Treat the stain right away.",
      "content": "Treat the stain right away. If the stain is relatively fresh, it may be okay to use a mixture of soap and water to clean it. This method will likely be most useful within the first hour after the stain forms; after that, the egg white will dry and begin to etch into your topcoat of paint. Wet the stain with warm water to soften it before you begin manually cleaning. [1] X Research source"
    },
    {
      "title": "Combine a gentle soap with warm water.",
      "content": "Combine a gentle soap with warm water. This is the solution you will be using to treat the stain. The gentler the soap, the better: ordinary car wash soap should be sufficient, or a regular-strength dish soap designed to cut grease. Hand soap won't do it. Harsher soaps contain astringent chemicals that can eat away at the paint and make the spot more noticeable. The warm water will help soften the stain and prepare it to be buffed out. You can soak the soap and water mixture into a towel as you go, or prepare it in a spray bottle beforehand for ease of application. Watch out for industrial cleaners. They can be extremely harsh on paint, and if you're not careful you could make the problem worse."
    },
    {
      "title": "Use a towel or soft scrubber.",
      "content": "Use a towel or soft scrubber. Abrasive surfaces can damage your paint, especially if the job requires a lot of vigorous scrubbing. Find a microfiber towel or use the soft side of a kitchen sponge to go over the stain while leaving the paint unharmed. While softer surfaces are less likely to damage your paint, it will take longer for them to work on the stain, increasing the total time of the process."
    },
    {
      "title": "Dry the spot thoroughly.",
      "content": "Dry the spot thoroughly. Once the stain is gone, dry the area with a microfiber towel. Make sure all traces of egg are gone before drying--if not, the streaks that soften and run off will dry again, and you're back to square one. If possible, put the car up for the night somewhere enclosed to give it time to dry completely. A chamois or microfiber towel works best for drying as it absorbs and holds moisture."
    },
    {
      "title": "Assess the damage.",
      "content": "Assess the damage. If the stain has had time to set up, soap and water may not work: sanding is your next best option. Make sure the area you're planning to sand is broad and flat and accessible enough to allow for a sanding motion. Wet the stain to prepare it."
    },
    {
      "title": "Choose the appropriate sandpaper.",
      "content": "Choose the appropriate sandpaper. You should be sanding softly enough to spare your paint as much damage as possible. Pick a sandpaper with a higher grit (something in the 80-120 grit range) to avoid scratching the area further. High-grit sandpapers use a higher number of grains that are less coarse, making them perfect for smoothing and finishing jobs. [2] X Research source Soak the sandpaper in water for a few hours (or overnight) to slightly soften the grit. Otherwise, the friction of the sandpaper is more likely to damage your car. Cutting the sandpaper will create a smaller sanding surface, making you less likely to accidentally scrape other areas of paint. Alternatively, a Mr. Clean Magic Eraser might do the trick. Its dense plastic surface works much like a fine, high-grit sandpaper, and it can be purchased in most supermarkets and convenience stores."
    },
    {
      "title": "Sand the spot.",
      "content": "Sand the spot. Use small, gentle sanding motions. Try to coax the stain out with the sandpaper very gradually, and keep the sandpaper and stain wet. Sand until the stain is gone, but stop before you start taking off paint. [3] X Research source"
    },
    {
      "title": "Polish the scratches.",
      "content": "Polish the scratches. Finish with a high-speed rotary polisher to remove any and all marks made by sanding. By doing this, you're effectively melting your clear coat around the stained area, blending it smooth. You can optionally apply a polish coat at this point. Use a pure polish on the buffed area to remove any unsightly swirl marks. If the egg damage is still not gone, you may have to do an area respray (spot-blending). If you're not familiar with how to use a machine polisher or don't have access to one, take your car to a garage to be polished once you've removed the stain."
    },
    {
      "title": "Purchase a small bottle of brake cleaner.",
      "content": "Purchase a small bottle of brake cleaner. This can be bought at any auto accessory store or superstore like Walmart in the automotive section. Brake cleaner is designed to absorb and erode oil, dirt, rust and stray paint, so if you need a higher-powered solution to your egg stain problem, it will likely do the trick. Caution : Brake cleaner is a toxic, corrosive and potentially flammable solution. Exercise care when using brake cleaner fluid at home. If applied improperly or left on too long, it could cause considerable damage to your car's paint. [4] X Research source"
    },
    {
      "title": "Take a heavy-duty paper towel and fold it into a small square.",
      "content": "Take a heavy-duty paper towel and fold it into a small square. Create a compact, thick pad to use to apply the brake cleaner. Spray some cleaner onto the paper towel in an area slightly larger than a half-dollar. You can apply more later if you need to. Paper towels are optimal when working with brake fluid as they can be disposed of. Avoid using a towel that you might reuse as the brake fluid is toxic and mildly corrosive."
    },
    {
      "title": "Go over the stain with the brake cleaner.",
      "content": "Go over the stain with the brake cleaner. Make your motions smooth but firm. Wipe away as much of the stain as you can, reapplying more brake cleaner as needed."
    },
    {
      "title": "Repaint the area if necessary.",
      "content": "Repaint the area if necessary. The impact and hardening of the egg stain may have chipped the paint, or the brake cleaner might have taken some paint off. Buy a small bottle of finishing paint from your dealership in the right color and touch up the areas where the paint is faded. [5] X Research source If you want your paint to look best, the mechanics at your car's dealership can touch up your car professionally for a small fee."
    },
    {
      "title": "Pick up a Wash & Wax solution.",
      "content": "Pick up a Wash & Wax solution. This specialty cleaner type was made for instances just like this one. The Wash & Wax will clean away dirt and stains and leave the paint polished to protect it, essentially mimicking the function of a clear coat of paint. [6] X Research source Wash & Wax cleaners work essentially the same way that brake cleaner fluid does, but are intended for use on the vehicle's exterior and are safer for most common uses. There is no guarantee that a Wash & Wax will work for its applied purpose here. They can be an effective cleaner for many types of dirt and stains that build up on vehicles, but you'll be using at your own risk."
    },
    {
      "title": "Spray the Wash & Wax onto the stain.",
      "content": "Spray the Wash & Wax onto the stain. Cover the whole stain and let sit for a few minutes. The cleaner will begin to work on the stain on its own, saving you trouble and preventing potential damage later."
    },
    {
      "title": "Use a nylon scraper to remove the stain.",
      "content": "Use a nylon scraper to remove the stain. Don't get too rough, as you'll be scraping directly against the paint. Take off as many pieces of the soaked stain as you can and wipe them away with a towel. [7] X Research source Nylon scrapers are cheap and safe. It's better to spring for one than to use a harder scraper with unexpected results."
    },
    {
      "title": "Reapply the Wash & Wax and rub out the spot.",
      "content": "Reapply the Wash & Wax and rub out the spot. Use another small amount of cleaner on the area where the stain was. Rub out any remnants of the stain or excess cleaner until the spot looks clean and smooth. The wax in the solution should leave your paint with a protective luster. Use a microfiber cloth to buff the spot. In all, this should only take about 20 minutes, with minimal muscle."
    }
  ]
}