{
  "url": "https://www.wikihow.com/Ride-the-New-York-City-Subway",
  "title": "How to Ride the New York City Subway",
  "steps": [
    {
      "title": "Review the route map and find the stations nearest where you wish to go.",
      "content": "Review the route map and find the stations nearest where you wish to go. The New York City Subway has dozens of lines, designated by color, number, and letter, in addition to transfers to PATH trains and connections to the Long Island Rail Road. Planning can be difficult. There are a few major hub stations, including Penn Station, Atlantic Terminal, and Grand Central, where you can transfer to virtually any line as well as connect to above-ground commuter trains. If you are new to NYC or are touring, it is best to use something like Google or HERE maps to plan your route. Late-night service is more limited than service during daylight hours."
    },
    {
      "title": "Find the stations nearest your starting point and your destination, and determine the trains to use to get from the former to the latter.",
      "content": "Find the stations nearest your starting point and your destination, and determine the trains to use to get from the former to the latter. You can use MTA's route planner to find connections and nearby stations. Note that it only allows you to plan for one route at a time, not all the routes. Unlike other systems, the New York City subway does not have elevators installed in all stations. You may need to find a station that is accessible if you have strollers, luggage, or wheelchairs."
    },
    {
      "title": "Determine the fare required for the trip you will take.",
      "content": "Determine the fare required for the trip you will take. New York City Subway currently has a flat fare of US$2.75 for entry, but if you are to transfer to the Port Authority Trans Hudson (PATH) trains, buses, or commuter trains, you will end up spending more."
    },
    {
      "title": "Use route-planning tools such as Google Maps or competing services.",
      "content": "Use route-planning tools such as Google Maps or competing services. When using these services, you may need to select the public transit option, and you may be shown options other than the Metro. You may also use the scheduler explorer to get a clearer idea of additional options and their timings."
    },
    {
      "title": "Go to the subway station where you start your trip.",
      "content": "Go to the subway station where you start your trip. You may use your mapping tool to guide you to your station. Subway station entrances usually have huge, green or glass banisters along with stairs or escalators leading down, along with the name of the station. Accessible stations will also have elevators that go down to the mezzanine or platform level."
    },
    {
      "title": "Buy a ticket.",
      "content": "Buy a ticket. Ticket machines at each station take cash and change as well as credit and debit cards. You can also obtain a ticket from the station attendant. Tickets are sold according to how much money you put on them. If you do not have sufficient fare, you can refill the Metro Card at ticket machines. Many stations also allow you to tap your debit card or mobile phone to enter."
    },
    {
      "title": "Check for announcements about system-wide delays before entering the station.",
      "content": "Check for announcements about system-wide delays before entering the station. These can be found on MTA's website under \"Service Status\" [1] X Research source . If there are delays, make plans for alternate routes."
    },
    {
      "title": "Swipe your ticket at the entrance reader.",
      "content": "Swipe your ticket at the entrance reader. If you have balance, the turnstile will unlock, allowing you to enter. If you are in a wheelchair, have a station attendant help you. They will open the emergency exit to allow you to pass through after paying."
    },
    {
      "title": "Board the correct train and ride to your destination.",
      "content": "Board the correct train and ride to your destination. Since the New York City subway goes virtually everywhere, you may need to do a lot of transfers to get to your destination. Train service is typically broken up into express and local. The inside tracks are usually for express trains while the outside tracks are for local trains. Other trains run express at certain times of day, these trains are usually designated with a diamond. A train that runs express on one line may run local on another line. For example, the 2 (Van Cortlandt Park—242nd Street/Flatbush Avenue—Brooklyn College) train runs express on the Seventh Avenue Line, but runs local on the Eastern Parkway Line."
    },
    {
      "title": "Practice good train ettiquette.",
      "content": "Practice good train ettiquette. Do not stand in the doorway for long, or try to walk through the doors as they are closing. Be particularly careful about rushing bikes through doorways. Jammed doorways can hold up the train for you and your fellow passengers, and also prevent additional trains from arriving at the station. Federal law requires the seats closest to the doors be made available for the elderly, pregnant women, and handicapped people upon request. Please yield these seats to those in need of them. If there are other vacant seats, use them so that you won't need to vacate your seat on demand. Seating is limited, and some cars may be standing room only. Mind your belongings. Keep them off the seat next to you. Do not lean against the train doors or move between cars while the train is in motion."
    },
    {
      "title": "Exit the train.",
      "content": "Exit the train. Keep in mind that doors open on different sides at different stations. Small stations will have one platform that services two trains, one going in either direction. Large stations may have two or three platforms in one area, or may have platforms for different lines spaced wide apart. If you miss getting off at your designated station, stay calm and get off at the next station, then ride a train in the opposite direction."
    },
    {
      "title": "Exit the station.",
      "content": "Exit the station. Proceed through the same turnstiles to exit. Some stations only allow exit at certain turnstiles. These will have stairs or escalators that go right up to street level."
    }
  ]
}