{
  "url": "https://www.wikihow.com/Measure-for-Hip-Roofing",
  "title": "How to Measure for Hip Roofing",
  "steps": [
    {
      "title": "Find the dimensions of each of the roof’s faces.",
      "content": "Find the dimensions of each of the roof’s faces. Use a ladder to carefully climb onto the roof. If the roof has a triangular shape, stretch your tape measure along the bottom edge, then measure from the peak point down to the center of the bottom edge. For trapezoidal roofs, measure the bottom edge, the top edge (also known as the “ridge”), and the distance between the 2 edges. [1] X Research source If possible, have a helper steady the ladder from ground level while you work. If you’re working with a rectangular roof, be sure to measure both the longer and shorter hips separately. You’ll need both sets of dimensions in order to accurately tab out your roof’s total square footage. Jot down eat dimension separately in a notebook or scrap sheet of paper. Don’t forget to label which dimension is which. It’s not necessary to measure the vertical sides of your roof, or to figure out its slope. To find the square footage of a hip roof, you just need to calculate the area of each of its faces. For this, you'll use the same formula that you would use to find the area of an ordinary triangle or trapezoid. [2] X Research source"
    },
    {
      "title": "Calculate the area of each roof face.",
      "content": "Calculate the area of each roof face. [3] X Expert Source David Bitan Roofing Contractor & Maintenance Professional Expert Interview. 14 July 2020. To find the area of a triangular roof, multiply the length of the bottom edge by the length of the ridge, then divide the product by 2. For a trapezoidal roof, add the lengths of the bottom edge and ridge together, divide the sum by 2, and multiply the number you get by the measurement of the line running between the two edges. Do this for every face of differing size. [4] X Research source If the bottom edge of one triangular roof face is 30 feet (9.1 m) long and the distance between the peak and the bottom edge is 18 feet (5.5 m), the area of the face is 270 square feet (25 m 2 ). If one face of a trapezoidal roof is 30 feet (9.1 m) long at the bottom and 24 feet (7.3 m) long at the top with a 14 ft (4.3 m) height differential, its cumulative area would be 378 square feet (35.1 m 2 )."
    },
    {
      "title": "Add the areas of all 4 faces together.",
      "content": "Add the areas of all 4 faces together. [6] X Expert Source David Bitan Roofing Contractor & Maintenance Professional Expert Interview. 14 July 2020. Now, all you have to do is find the sum of the individual square foot calculations you just made. Add the combined areas of the 2 longer faces with those of the 2 shorter faces. Doing so will give you the total square footage of your roof. [7] X Research source If you’re trying to work out the total area of the roof of a square building, simply multiply the area of one of the identical faces by 4. Keep in mind that trapezoidal roofs have 2 trapezoid-shaped faces and 2 triangular faces, which means you'll need to apply both formulas in order to add up the area correctly. [8] X Research source"
    },
    {
      "title": "Up your square footage by 5% when ordering materials to account for waste.",
      "content": "Up your square footage by 5% when ordering materials to account for waste. Once you’ve determined the total combined area of each face of your roof in square feet, multiply that number by 0.05. This will tell you how many square feet of roofing material you’ll need to buy in order to make sure that you have enough in the event that some of the materials are damaged or there are mistakes made during installation. For reference, a standard package of shingles contains enough materials to cover 33.3 square feet (3.09 m 2 ) of roofing. [9] X Research source You may not end up using every last bit of your chosen roofing material when it’s all said and done, but it’s better to have too much than not enough."
    },
    {
      "title": "Measure the length and width of the building.",
      "content": "Measure the length and width of the building. Use a tape measure or laser measuring tool to find the dimensions of each of the building’s parallel sides. Generally speaking, a structure’s length is simply whichever side is the longest, while its width corresponds to the side running laterally across its length. [10] X Research source You can find laser measuring tools and other specialty measuring devices at any major hardware store or home improvement center. [11] X Research source If you already know the exact dimensions of the structure you’re roofing or have access to the original building plans, it’s okay to skip this step and work from recorded measurements. Write down and label each of your measurements clearly as you map out the size and shape of your roof. Sketching out a rough diagram of the roof can help you visualize how each of the components will fit together. A good piece of 3D construction software will guarantee even more precise results. [12] X Research source"
    },
    {
      "title": "Decide how steep a slope you want your roof to have.",
      "content": "Decide how steep a slope you want your roof to have. The slope you choose will mostly be a matter of preference. Roofs with a slight grade are easier to install and maintain, but may not provide adequate runoff if you live in an area that receives lots of precipitation. Conversely, high-sloping roofs drain well and tend to look quite impressive, but they’re much more difficult to work on. [13] X Research source The term “slope” refers to the steepness of the angle of each of the roof’s faces. “Slope” is sometimes used interchangeably with “pitch,” though pitch more accurately describes the steepness of the roof in relation to its overall size. Hip roofs often have relatively gentle slopes. A hip-style roof with a high slope is known as a tented roof. [14] X Research source"
    },
    {
      "title": "Calculate the span of your center common rafters.",
      "content": "Calculate the span of your center common rafters. First, subtract 1–1.5 inches (2.5–3.8 cm) from the width measurement you just took to account for the thickness of the ridge board, which will span the length of the roof between the individual rafters. Then, divide this number by 2 to reflect the separate halves of the roof. The number you get will tell you how far apart to space the 2 sets of centering rafters, which will also dictate the length of your ridge board. [15] X Research source If the structure you’re building the roof for is 12 feet (3.7 m) wide, the common rafters would have a run of 5 feet (1.5 m), 11 −1 ⁄ 4 inches (27 cm). The common rafters are the vertical boards that serve to mark the ends of the ridge board. They run from the ridge (the uppermost edge of the roof) down to the exterior walls of the structure. [16] X Research source"
    },
    {
      "title": "Use the ends of the ridge board to set the king common rafters.",
      "content": "Use the ends of the ridge board to set the king common rafters. Once you know how long your ridge board will be and where it will be centered, measure from either end straight down to the bottom edge of the roof face. This measurement will allow you to cut the king common rafters, which you’ll use to secure the ends of the ridge board and continue the line it forms along the midpoint of the structure’s length. [17] X Research source The exact length of each of your rafter boards will depend on the particular slope you’ve selected for your roof. The king common rafters are also sometimes known as “crown end rafters.”"
    },
    {
      "title": "Measure from the ridge board to the building's corners to size the hip rafters.",
      "content": "Measure from the ridge board to the building's corners to size the hip rafters. Find the distance between the ends of the ridge board and outside corner of the structure’s upper wall plate, similar to the way you measured for the king common rafters. Refer back to this measurement when it comes time to cut the hip rafters that will frame the roof’s corner contours. [18] X Research source You may need to use temporary braces to stabilize your hip rafters until you can nail them down once you actually begin building. [19] X Research source"
    },
    {
      "title": "Determine the appropriate length and spacing of your remaining rafters.",
      "content": "Determine the appropriate length and spacing of your remaining rafters. With your primary framing members in place, all that’s left to do is fill in the space between the common, king common, and hip rafters with additional vertical supports. Space your rafters according to the guidelines laid out in your local building codes. The rafters spanning the length of the ridge board will all be a uniform length, but be sure to cut each rafter shorter and shorter as they begin to progress down the hip. [20] X Research source Measure from the top of the last rafter you set to the top of the next one in the row to figure out how much to wood to take off of each board. For overhanging roofs, you’ll also need to cut birdsmouth notches into the rafters at the point where they’ll meet the exterior wall of the structure. [21] X Research source"
    }
  ]
}